[
    {
        "title": "Is it weird to bring my (29F) ex boyfriend (25M) food even though he broke up with me?",
        "author": "ThrowRA_27900",
        "url": "https://www.reddit.com/r/relationships/comments/11q2wdp/is_it_weird_to_bring_my_29f_ex_boyfriend_25m_food/",
        "text": "[removed]",
        "created_utc": 1678691723,
        "upvote_ratio": 1.0
    },
    {
        "title": "TL;DR : Should I End My Situationship over Resse’s Pieces and A CareBear",
        "author": "Reasonable_Region_32",
        "url": "https://www.reddit.com/r/relationships/comments/11q2u26/tldr_should_i_end_my_situationship_over_resses/",
        "text": "So me (25F) and my \"friend\" (24 F)have known each other for one year and six months, and recently we've started \"hooking up.\" Because every time in the last five months of our friendship, when we hung out, we started cuddling, kissing each other shoulders, play biting, and playing in each other's hair; it increasingly went further each time. We eventually discussed it, and they told me, \"I'm emotionally unavailable. However, I said, \"I'm emotionally unavailable too.\" (I've been in three mentally, verbally, and physically abusive relationships in the past. And I'm not ready for a relationship because I'm still in therapy. Trying to undo all the trauma)\n\nMy friend said they weren't ready either, so we kept it casual. And decided if something happens between us then it does. So after that, we started hanging out more often, not going on dates or anything. But we don't have sex either (my friend likes to wait to have sex), so we cuddle whenever we hang out now! One time we hung out for 8 hours, and just last week, we had our first official kiss! However, it was my birthday, and when they came by, they gave me Reese's pieces for my birthday. I got upset because they told me, \"I forgot to get you something, so I just ran into a corner store and got that.\" It hurt my feelings, not because it was candy but because I felt like an afterthought. I started to act pissy towards them, and they then started to act silly to soften me up, and we ended up having fun. While we were cuddling in bed, I don't remember quite what they said, but it was something about us being in a relationship. I said, \"ew, that's weird!\" My friend got offended and said, \"why is that weird?\" I said, \"I don't know!\" My friend again said, \"no, why is that weird?!\" This time they were more forceful. I said, \"it just makes me uncomfortable\" they left the topic alone after that.\n\nThen we were about to go to the store, and I was on my phone texting my PLATONIC STRAIGHT friend on Instagram. My friend saw it and thought I was on hinge, so when I walked away, they followed, and when we were at the bus stop, they said, \"I'm going go on hinge\" in a jokingly way; they went on the app in front of me and asked me who they send a rose to.\n\nLater that night, after they left, I told them how it hurt my feelings. They got me a Reese piece for my birthday and said they were sorry. However, they didn't like that I called it an \"incident\" and had to calm them down so they wouldn't get mad at me. I then sent them a carebear that I wanted. They saw it but didn't reply.\n\nI texted them again the next day. However, they still didn't reply. The next day, they finally told me they didn't like how I was acting and said I demanded too much from them because we're just friends anyway, and I shouldn't have high exceptions for a friend. She then asked for space, and I went into complete panic mode! I realized I was acting childish and punishing her for things my exes had done to me. Because my exes used to buy me things to make up for the abuse, I told them I knew I was being unfair because I was testing them on something they didn't think they had to study for, I promised I'd do better because I didn't want to lose them. I asked them to please be patient with me and they said. \"I could never hate you, I really value our friendship and I don't want to lose you either.\"\n\nI sent them another message, but they didn't reply, and I freaked out; I unsent the message. About an hour later, I texted them on their phone, asking if we were still friends. They said \"yes,\" but started feeling smothered by these text messages. And my friend asked me to talk after I finished the midterms. Fast forward 8 days later, I texted them yesterday; I said, \"Hey, how are you? Can we face time?\" They didn't reply for a day and said, \"Sorry for not replying yesterday. I was just busy. And I'm not able to face time today. I hope you're doing well, though.\" I said, \"is there a time when we could face time?\" They asked what I wanted to talk about. I said: \"I just miss is all; I just want to talk to my friend.\" They didn't reply, and I followed up with them. \"Do you just want to press reset on this whole thing?\" They replied, \"I'm just not ready to talk yet, dude. I'll reach out to you.\" I said, \"Okay, I'm going to block you on Instagram; I'm not being malicious. It's for my mental health. I'm here when you're ready to talk, and I don't mind being platonic friends again. \" They said, \"sounds good!\"\n\nI don't know maybe they've met someone else and don't want to tell me, but I don't understand why their distancing themselves from me like this. What should I do? Should I just break up with them? Is that want they want from? \n\n&amp;#x200B;\n\nTL;DR : Should I End My Situationship over Resse’s Pieces and A CareBear",
        "created_utc": 1678691484,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a guy friend used to flirt with you and then stops is he still a friend? (M24) (F25)",
        "author": "Optimal-Flight-7963",
        "url": "https://www.reddit.com/r/relationships/comments/11q2t0j/if_a_guy_friend_used_to_flirt_with_you_and_then/",
        "text": "[removed]",
        "created_utc": 1678691382,
        "upvote_ratio": 1.0
    },
    {
        "title": "A 19F girl, friend zoned 19M me out of nowhere in a snap. i don't know what to do and need help.",
        "author": "Remarkable_Site1364",
        "url": "https://www.reddit.com/r/relationships/comments/11q2rto/a_19f_girl_friend_zoned_19m_me_out_of_nowhere_in/",
        "text": "[removed]",
        "created_utc": 1678691251,
        "upvote_ratio": 1.0
    },
    {
        "title": "my (f21) friend (f16) is being abused by her bf",
        "author": "dazedconfused21",
        "url": "https://www.reddit.com/r/relationships/comments/11q2ndk/my_f21_friend_f16_is_being_abused_by_her_bf/",
        "text": "[removed]",
        "created_utc": 1678690833,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25f) hid things from my bf (29m) how do i fix it - 2 year relationship",
        "author": "AgileAd6991",
        "url": "https://www.reddit.com/r/relationships/comments/11q2jc7/i_25f_hid_things_from_my_bf_29m_how_do_i_fix_it_2/",
        "text": " I (25f) have been in a relationship with my boyfriend (29m) for 2 years. We've been long distance for most of it.\n\nHe has difficulties with m/f friendships which is something I grew up with and was very familiar to me. My group of friends from highschool had sexual histories between different people including myself which he was not comfortable with and it brought difficulties at the beginning of our relationship, since I would sometimes still see them.\n\nSometimes when we would fight about things like this I would leave out details (e.g. this person slept one of my friends; this person flirted with me once) or not tell him everything because I didn't want him to be mad at me. I directly lied to him about having a sexual interaction with someone from that friend group, a good friend, in the past because I was ashamed and it meant nothing. I had never told almost anyone else and I thought I could pretend it never happened. That person is now in a serious live-in relationship with my sister and this added incentive for me to keep it hidden because it would have upended my boyfriend's relationship with my sister's partner. My bf and I made compromises where I would not see anyone I had a sexual history with and seeing guy friends under certain circumstances.\n\nI have otherwise blocked people I had a history with (after a fight about it) and was trying to be intentional in my relationship, but it took me a while to get to that point. I initially fought back in blocking friends I had slept with which I deeply regret now since they are hardly even my friends anymore and I care about my boyfriend much more than that was worth. Things like this degraded his trust of me.\n\nFast forward to now and he came to visit me where I live now. While he was here he went through my phone while I slept (he had never done that before, he had a feeling I was hiding something) and found old old messages between me and my friends that detailed all my sexual history, including the person I lied about. He found out about all the times when I covered up details so we wouldn't fight.\n\nFor context I had been in a emotionally and sexually abusive relationship before him and i had not dealt with that properly when we first got together. Who I am now is not the person who hid things and I've spent real time working on this to show up better in our relationship. We had been doing really well and learning how to show up for each other in the way we both needed. I love him so much. But things I did in the beginning have come back to haunt me. Is this something that can ever be repaired?  \n\n\nTL;DR: i hid things/ lied to my boyfriend about my past with someone so I could stay friends with that person. He found out and I don't know if I can fix things.",
        "created_utc": 1678690405,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 31M overheard my family talk bad about my 29F GF and what she wears, so should I tell her?",
        "author": "throwawayaccountblow",
        "url": "https://www.reddit.com/r/relationships/comments/11q2hx6/i_31m_overheard_my_family_talk_bad_about_my_29f/",
        "text": "Hi, so I’ve been dating my GF for a year now and we went to a rented house with my family. I’ll say now that I live out of the state with my GF and this is only the second time they’ve been around my partner. \n\nOn our first day, we arrived before my family. My girl wanted to pick up a few items from the store and I wasn’t feeling well, so I went into the rented house. Our car wasn’t in the driveway when my Mom, Auntie, Dad and Sister all arrived. I was in the bathroom and they thought they were alone in the living room. I overheard everything they said next.\n\nThey think my GF needs to stop wearing  leggings that shows off her rear and that she dresses indecent. My Mom said the pictures of us online were sometimes “gross” and my partner is “advertising her pancakes.” My family is from the south by the way. My sister said she could see her thong, which I doubt since her leggings aren’t transparent, but the comment didn’t help. And my Dad called it “distracting.”\n\nEveryone agreed it was off putting. What made it worse was that my GF arrived back in blue leggings (she’s athletic and likes to be comfortable) and a crop top. My family didn’t know I could hear them from he bathroom when I came out. \n\nWe’re spending a few more days together. I love my family and I love my GF, but should I let her know what my family thinks of her wardrobe?\n\nTLDR; I overheard my family and they hate the leggings my GF wears. Should I tell her?",
        "created_utc": 1678690255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25f) hid things from my bf (29m) how do i fix it",
        "author": "AgileAd6991",
        "url": "https://www.reddit.com/r/relationships/comments/11q2hjc/i_25f_hid_things_from_my_bf_29m_how_do_i_fix_it/",
        "text": "[removed]",
        "created_utc": 1678690214,
        "upvote_ratio": 1.0
    },
    {
        "title": "i hid things from my bf how do i fix it",
        "author": "AgileAd6991",
        "url": "https://www.reddit.com/r/relationships/comments/11q2gxt/i_hid_things_from_my_bf_how_do_i_fix_it/",
        "text": "[removed]",
        "created_utc": 1678690157,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't take overprotective parents much longer",
        "author": "twoblackfishercat",
        "url": "https://www.reddit.com/r/relationships/comments/11q2ftb/i_cant_take_overprotective_parents_much_longer/",
        "text": "I can't take overprotective parents much longer\n\nI (15f) can't take my overprotective parents much longer\n\nBackground: growing up I had food allergies and severe asthma. Nothing worked, I was in and out of the hospital constantly. Even laughing too hard could give me an attack. My mom was amazing. She worked so hard to protect me. I don't want this post to sound like I'm ungrateful. \n\nAs I got older my health improved. I'm 15 and as long as I take care of myself I'm pretty much a normal teenage girl. I haven't had a hospital visit in a year which is a record. \n\nMy parents still treat me like a sick five year old. My mom requires me to take my medication in front of her. I've never been allowed to go on a sleepover or an overnight trip. If I get a cold they're angry with me and they are both awake all night listening to see if I start coughing. \n\nI found out today I'm not going to be allowed to go to my extended family's iftar because my dad is afraid I'll eat something I'm allergic to. I'm going to be left home alone. I've gone before with no problem but he has a problem now. \n\n I can't take this any more, I'm about to break. I begged them to just give me some space and I can't get that either. Tonight I put my headphones on and buried myself in bed and cried. My mom pounded on the door to tell me to take my meds before I fell asleep. How do I tell them they're driving me crazy without hurting their feelings?\n\nTldr:.My overprotective parents still treat me like a sick kid.How do I get them to back off without hurting their feelings?",
        "created_utc": 1678690030,
        "upvote_ratio": 1.0
    },
    {
        "title": "What techniques are available to avoid a person that is a pathological liar other than avoid the behavior as much as possible?",
        "author": "Snappass23",
        "url": "https://www.reddit.com/r/relationships/comments/11q2eyy/what_techniques_are_available_to_avoid_a_person/",
        "text": "[removed]",
        "created_utc": 1678689941,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love my gf but am at a loss",
        "author": "BornTumbleweed3929",
        "url": "https://www.reddit.com/r/relationships/comments/11q2brj/i_love_my_gf_but_am_at_a_loss/",
        "text": "TLDR at the bottom. This is kind of long and all over the place bc it’s late at night and this story is like a years worth of pent up emotions. I (17f) am in a relationship with B (16f) and I have slowly started to resent her. As a bit of background before I start B is autistic but very high functioning to the point that if she didn’t tell you, you wouldn’t know. This doesn’t bother me at all and I still loved her even after I found out however she revealed to me that she doesn’t feel empathy, sorrow or guilt really, which initially was fine but is relevant later on. Anyways me and her have been together for a little over a year and things were amazing to begin with seeing as we were friends before hand but I always feel like the relationship is insincere to her. She always tells me that if me and her don’t work out she’s gonna be straight and that I’m the only girl she will ever like which makes me feel like she doesn’t even really like girls, and she’s constantly talking about boys but tells me I have nothing to worry about bc she’s in a relationship with me and she would never cheat. The day before she told me she liked me (which she knew I liked her at this point) she was crying over a guy she liked and how he didn’t like her and I stupidly ignored this which I realize was a red flag but I really liked her so I ignored it. Me and her started dating about a week later and things were going great and they were for the first couple of months. \n\nMy mom however is very homophobic and when she found out I was gay kicked me out and I now live with my dad about 30 mins away. I go see her every weekend and at some point she revealed she doesn’t feel sorry for me or for the fact that I got kicked out and disowned by my mother. Instead she feels sorry for herself bc it’s now a inconvenience for her with me living farther away. On top of this she is constantly ridiculing my father who is trying his hardest to raise me (I’m the oldest and me and him were very low contact until me moving in) and calling him a bad father when he does the simplest things, such as going out to eat instead of cooking and other small things. B grew up very spoiled and has never had chores and her parent have always babied her so she doesn’t really understand what it’s like to live lower class which I am (I also did at my mothers seeing as she was living off child support) and when I say things to her like how I sometime am late to pay for bills she takes it out on my dad saying stuff like he’s a bum and how she hates him for being such a bad father to me even tho he didn’t do anything and we just don’t have money bc we have to pay for food and such. \n\nI hate how she is always mean to him for no reason and if I speak out on it she gets offended and says she’s only telling the truth and she’s sorry for being mean bc she’s been going through a lot. I hate to be selfish but it makes me upset bc I’m also going through a lot I have a new home, new school , no friends, and I feel like I barley know my dad even tho we live together and she seems to be flourishing at the moment. Her parents payed for her to completely redo her room, have been taking her on shopping trips for no reason, she’s been skipping school, making a lot of new friends and flirting with guys which she then tells me about and more. I’m normally pretty understanding and I understand we all deal with mental health differently but I get no sympathy at all and it always seems to be a competition on who has worse mental health with her (ex: I tell her I got 2 hours of sleep and she has to one up me and say she only got 1 kinda thing) and it’s so annoying. She also has lately been having many emotional breakdowns for seemingly no reason. I don’t know much about autism so sorry if I sound dumb but does it worsen? are these symptoms that I was just unaware of? If it’s her autism causing her to be so irritated and moody then I feel bad and what can I do to help? If it’s not I don’t know what to do. She’s the only one I have and I love her but I can’t do it anymore. I’m so stressed as it is and I have to walk on eggshells around her to not upset her further. Please help and if I said anything offensive about autism please let me know bc as previously stated I don’t know much about it.\n\nTLDR: my gf is always upset and the relationship feels insincere but I don’t know what to do bc I love her.",
        "created_utc": 1678689617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if I am overly sensitive or if my partner is overly critical or both.",
        "author": "iwannagotohomepls",
        "url": "https://www.reddit.com/r/relationships/comments/11q2beo/not_sure_if_i_am_overly_sensitive_or_if_my/",
        "text": "My partner (24F) and I (22M) seem to have a recurring theme around me being too sensitive.\n\nIt typically looks like this:\n\nMe: \\*Does a thing\\*\n\nHer: \"Why are you doing it that way? That's obviously not gonna work\" \\*Insert suggestion about correct way to do it\\* OR during a high stress situation, she gets very snippy.\n\nMe: Doesn't say anything and does it the way she suggests.\n\nHer: \"Are you butthurt now?\"\n\nMe: \"No, I just felt like I was being treated like I am doing things incorrectly and like I was annoying and in the way\"\n\nHer: \"No you're not doing it wrong, it's just it drives me crazy when things are not done x way. I feel like I just hurt your feelings all the time and can't say anything. I obviously wouldn't hurt you on purpose and it makes me upset that you're upset and think I would hurt you\"  \n\n\nI then feel bad for bringing up the fact that her snipping at me or making me feel like I am an annoying bother over some small thing (it is usually about me not initiating sex enough, cleaning wrong, or parenting wrong, sometimes driving wrong or just a general assumption that I did not do things her way) so I end up apologizing for being so dramatic or sensitive. I am wondering if I am the problem here. \n\nSometimes when upset, she will not talk to me for a few hours or up to a day. We agreed that since this makes me anxious we would set a time to talk and I will give her the space she needs. The past few fights, I do my part but if I ask her when she would like to circle back she says she doesn't know and to leave her alone, so I do. That does not feel fair bc she is not upholding her half. \n\n&amp;#x200B;\n\nNot to mention I am scared to have any sort of conflict whatsoever bc she has held breakup or divorce over my head unintentionally. Like \"maybe we should just break up if you feel x\" or the fact that I did not have enough sex w her she was like \"I can't do this anymore I wanna divorce I will be out by x month\" back to \"we can make it work I do not really want a divorce\" This happened legit 2-3 times a month for the past year and a half. It's been 3 months since the last divorce talk, and I am having serious debilitating panic attacks and anxiety. \n\n&amp;#x200B;\n\nOverall I just feel like I am not allowed to ever feel upset at her or voice my hurt without getting in trouble with her. I cannot tell if it's my fault for being so sensitive and making her feel like she can't voice her complaints or if there is some lowkey abuse going on. My abuse radar is off bc I was abused growing up which plays into it being so hard for me to be criticized so often, which I know is a me problem, but still has an effect.  \n\n\nTL;DR: Wife criticizes me often, but I am not sure if I'm just too sensitive and she is not actually that critical or if she is gaslighting me. I am going crazy and riddled with anxiety after all the fights and divorce threats.",
        "created_utc": 1678689581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I be worried that my sister (22F) &amp; best friend (19M) have formed a strong friendship?",
        "author": "TaquitosLoquitos",
        "url": "https://www.reddit.com/r/relationships/comments/11q2a3d/should_i_be_worried_that_my_sister_22f_best/",
        "text": "Long story short, my sister (22F) wanted a gym buddy &amp; I didn't feel like the gym was something for me. I'm just not a gym guy. My best friend (who I've known my entire life and is 19) said if my sister wanted a gym buddy, he was more than happy to join her. My friend is very into fitness &amp; goes to the same gym as my sister. Since then, he always picks her up from our place so they can go together, which is just simply weird to me. They've done cardio classes together, salsa dancing at the gym, kick boxing, mountain climbing - pretty much anything that has to do with fitness, they're doing it together.\n\nOf course I'm not ignored though. They've tried getting me invovled saying it's super fun and that it's good being active. I simply say no. I'm more of walking/jogging type guy, not intense stuff like they do. They haven't invited me to anything in quite a while, so I figured they simply decided not to invite me anywhere due to my same NO answer. \n\nIts been 5 months &amp; they've formed a friendship together. She even invites him to join us everytime we go out to eat, go to theme parks/events or when she does BBQ at our place. He was also invited to spend Christmas with us a few months back, my sister (even my our mom) wanted him involved. I didn't mind, but was a little weirded out by her request. My friend is an incredible person who I'm lucky to have in my life, but it's super weird seeing my sister &amp; him bonding happily. He's always very respectful &amp; kind towards her, so I can at least trust he isn't being pervy around her. My sister is also very respectful, yet goofy/silly with him when they're together around me. They genuinely look like great friends that respect each other.\n\nThat's all fine with me, because they're in front of me. But I also get worried about what they do together when I'm not around or when they're at the gym. It's annoying having these thoughts, because I get a bit paranoid. Part of me knows they aren't doing anything together, but part of me wonders if they are. \n\nPlus, my sister is adventurous &amp; very beautiful. She's so hilarious, fun, silly and such an outgoing person. She's someone that makes everyone laugh and smile, it'll be hard to not be attracted to her. I just don't want that person to be a close friend, which is why I worry about their friendship together. \n\nShould I be worried about their friendship? I don't want to tell my sister how i feel, I believe she'll end up feeling bad about this whole thing. She might even stop being gym buddies with my friend and things could get awkward with everyone involved. She loves my friend and is happy she has a gym buddy, so I definitely don't want to mess anything up. \n\nTL;DR: the relationship my sister and best friend have together is making me a bit worried &amp; idk if I should be. I Have no idea what I should do or not do",
        "created_utc": 1678689441,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't take overprotective parents much longer",
        "author": "twoblackfishercat",
        "url": "https://www.reddit.com/r/relationships/comments/11q25da/i_cant_take_overprotective_parents_much_longer/",
        "text": "[removed]",
        "created_utc": 1678688961,
        "upvote_ratio": 1.0
    },
    {
        "title": "WIBTA if I told my boyfriend of 3 years I don't like my engagement ring.",
        "author": "Due_Instruction_886",
        "url": "https://www.reddit.com/r/relationships/comments/11q233a/wibta_if_i_told_my_boyfriend_of_3_years_i_dont/",
        "text": "[removed]",
        "created_utc": 1678688725,
        "upvote_ratio": 1.0
    },
    {
        "title": "My “ex” situationship is confusing me",
        "author": "Mindless-Media-5249",
        "url": "https://www.reddit.com/r/relationships/comments/11q229z/my_ex_situationship_is_confusing_me/",
        "text": "[removed]",
        "created_utc": 1678688642,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(19f) am stuck between N(21m) and M(20m)",
        "author": "Mean_Entrepreneur684",
        "url": "https://www.reddit.com/r/relationships/comments/11q1zlz/i19f_am_stuck_between_n21m_and_m20m/",
        "text": "\ntl;dr i’ve known M for a long time, he was my first love, but he is currently living out of state. i just met N, i think i love him too, but he has some things to work on. M is home and wants to hang out with me. should i go for M or stick with N. \n\nso i met M 5 years ago, he lives down the road from me. as soon as i saw him i instantly was crushing so i started chatting and i got his snap and we started texting. i sat with him on the bus, and then i started taking my dogs on walks with him everyday. we used to meet at this one place at night sometimes and sit and talk. then he started to get dry and say he couldn’t come out. turns out he got back together with his ex. a year later he starts texting me again and we hung out here and there, but i was pursing another guy (my ex of 4 years (who was also a neighbor)) who said i couldn’t talk/hang out with M bc they knew i was stuck on him for a long time. so 4 years pass, i break up with my ex, i’m doing my own thing for a while, and one night i’m with my friend and she convinces me to text M. this was absolutely nuts to me i’m like no way i did that. anyway he texts back and we started snapping each other a lot. i learned that M was going away for college and this was discouraging, but we did hang out a few times before he left. he never really flirted with me or made any moves but i was content with spending time with him. so after he left i continued to do my thing. went to a party one night (a little over 2 months to be exact) and i met N. it actually was the best night of my life not just bc of meeting N but he is apart of it. to sum it up i let some guys go take my truck mudding in a field and N was standing in the road and i had my window rolled down and he was like are y’all going mudding and i said yes wanna come, he hopped in and the rest is history lol. after meeting him i liked him. i got his number and we started texting. i ended up taking him home he lives ab 25 from me. the next day he asks me if i want to have dinner with his family which was absolutely insane to me but i went. from there we hung out a lot. we do the deed too. he’s a good time, very funny, and i love his family but there are some flags ab him. he goes to bars a lot, mostly bc he plays in a pool league but he always had to be drinking. he smokes a lot too. he works part time in the morning and sleeps all day or gets on the game and is awake all night until he goes to work, now i’m not a big future planner but this is a tad scary to think about if i was. he got a dui one night and i went and waited at the police department and took his ass home. ever since then i’ve been at his house almost everyday, he doesn’t drink anymore (if he does he has one) and he doesn’t sleep all day anymore, he also is on the hunt for a full time job. so M is away at college but we still snap, and he starts flirting with me and asking for me to come see him. M texts me the other day and tells me he’s moving to this other state bc he was offered a job he couldn’t refuse and he wants me to visit. i tell my mom and she’s like do it (she does not like N). M is home for the next few days before he makes the big move and he wants to hang out. i’m in a bad situation here bc i really care for both of these boys and recently i’m telling myself N but i’m worried i’m saying that bc i’m obsessive.",
        "created_utc": 1678688377,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love my gf but I’m at a loss.",
        "author": "BornTumbleweed3929",
        "url": "https://www.reddit.com/r/relationships/comments/11q1z83/i_love_my_gf_but_im_at_a_loss/",
        "text": "[removed]",
        "created_utc": 1678688337,
        "upvote_ratio": 1.0
    },
    {
        "title": "How am I so bad with girls?",
        "author": "LegitimateWasabi6183",
        "url": "https://www.reddit.com/r/relationships/comments/11q1vk7/how_am_i_so_bad_with_girls/",
        "text": "[removed]",
        "created_utc": 1678687976,
        "upvote_ratio": 1.0
    },
    {
        "title": "is she (27f) not interested in me (32m) should I give up?",
        "author": "Throwerpopuptown",
        "url": "https://www.reddit.com/r/relationships/comments/11q1upe/is_she_27f_not_interested_in_me_32m_should_i_give/",
        "text": "Been talking to this girl the last 6 months occasionally long distance. Met her a few times years ago before I moved away out of state and was moving back and we made plans to grab a drink.\n\nWhen I got back we planned to hang out one weekend but she just sorta disappeared. It is wasnt hard set but we just said this weekend we'd grab a drink. \n\nTurned out she was sick and went to the ER on Monday. Had pics on her story so wasn't bullshit. \n\nThe next weekend we hung out but she was hella late. Hour or so. Wasn't a big deal because what I invited her to was something I was already doing. \n\nShe also was way on otherside of town where she lived so was understandable to a degree. \n\nDate seemed fine. Covo was good etc. Had drinks. Went back to my place for her to meet my dog, I lived super close by the bar. \n\nI didn't make a move bc I was still feeling her out. We made plans to hang out again and I joked she owed me a drink for being late. \n\nI hit her up next evening and told her to let me know next time she's free and that I tried to find a concert for us to go to this weekend but the music scene here is meh. \n\nShe seemed neutral and liked my comment about letting me know when shes free. \n\nThe issues are she takes like legit 24 hours to read any message I sent her during that exchange. She also hasn't  told me when shes free it's been 4-5 days now. \n\nWhat really annoyed me though is she went to a concert that weekend legit across the street from my house and never hit me up. Even after I said I was trying to find us a concert that weekend to go to. \n\nI just feel like I'd have to do all the effort to get anything to happen and it just feels bleh to me now. What should I do? \n\nLast communication sort of - was yesterday she liked one of my story posts but I haven't said anything to her since Thursday because she's said nothing but liking one of my stories. And I feel like I put the ball in her court by asking her to tell me next time shes free. I just feel like demoralized at this point or am I just over thinking?\n\nTl:Dr; don't feel like she's interested enough ?",
        "created_utc": 1678687892,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://biolink.info/ANDERSONVEGUILLAEXCLUSIVE",
        "author": "ANDERSON_VEGUILLA",
        "url": "https://www.reddit.com/r/relationships/comments/11q1pd3/httpsbiolinkinfoandersonveguillaexclusive/",
        "text": "[removed]",
        "created_utc": 1678687363,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find real love",
        "author": "pharmacy-nerd",
        "url": "https://www.reddit.com/r/relationships/comments/11q1lwp/how_to_find_real_love/",
        "text": "[removed]",
        "created_utc": 1678687041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to be mean to my boyfriend?",
        "author": "garbagelady4",
        "url": "https://www.reddit.com/r/relationships/comments/11q1gw8/is_it_normal_to_be_mean_to_my_boyfriend/",
        "text": "[removed]",
        "created_utc": 1678686536,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t think I can ignore the big things anymore",
        "author": "caffeinatedpastry",
        "url": "https://www.reddit.com/r/relationships/comments/11q1gjk/i_dont_think_i_can_ignore_the_big_things_anymore/",
        "text": "[removed]",
        "created_utc": 1678686498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (15M) and my gf (15F) ended things in bad terms because of me being toxic",
        "author": "TSConn02nd",
        "url": "https://www.reddit.com/r/relationships/comments/11q1cxg/me_15m_and_my_gf_15f_ended_things_in_bad_terms/",
        "text": "We've been dating for half a year but we've been through so much in these times.\nI've helped her overcome her fears and give her opportunities that she hadn't been\nable to get to and gave her gifts that she really wanted. We both enjoyed each others\ncompany and knew what each other wanted. We're both each others first times in \neverything and gave everything we could give to each other. It may have been my first love but everyone\nknew that it would be something that would last until marriage. My closest friends, family\nand her friends all thought that we would last for a long time considering how much\nwe've loved each other. Then after Christmas rolled around\nI started getting even more stressed and at some point she noticed I've gotten toxic\ndue to my personal life and me not being able to communicate it out properly because\nshe had her own problems too, and I held it in for too long. At some point we had a fight over me trying to paint a \ngift of a friend and shouted at her saying that she doesnt love me anymore and clearly\ndoesnt trust me in doing anything, I hurt her feelings too much and told\nme I couldnt redeem myself and wont give me another chance, there are scars in her heart\nfrom what I've said to her and now she's found another person she admires and wants\nto erase our memories of each other even if all of them were special to her and that I've helped\nher achieve her dreams (Such as taking her to conventions after convincing her strict parents\nand getting her cosplays). \n\nBut now with the way she's acting it's as if none of it was special and that I was never special.\nIt hurts alot and it's sad to think that all the reassurance that we'd last came from her.\nAnd now we're ending things in bad terms because I've hurt her too much and there's no healing from this.\n\nDoes a guy like me deserve another chance after everything we've given each other? or am I iredeemable?\nI'm sorry for asking I just want help\n\n\nTL;DR: We were each others first love but broke up due to me snapping against her in a fight,\nnow she's pretending nothing we had was real or special and I dont know how to move on or if I should try again.",
        "created_utc": 1678686130,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [24f] 4 year relationship with my [28m] bf has been difficult. I don't know if we should keep trying or not.",
        "author": "trforsuchnsuch",
        "url": "https://www.reddit.com/r/relationships/comments/11q181u/my_24f_4_year_relationship_with_my_28m_bf_has/",
        "text": "S/o and I have had a complicated relationship. \nWe both come from bad backgrounds of all sorts of abuse and addictions. (Drugs, alcohol and porn)\nOne of two that still affects us both today. \n\nTo put it bluntly, he fucked up quite a few times. I finally left and when he realized he TRULY lost me, he wanted to make things right.\nI still struggle alot with the damage from the choices he made, even two years later. (I have cptsd ontop of this)\n\nI made an appointment for couples counseling next month. I'm not sure if its worth waiting and if things can be fixed...\n\nWhen do you stop trying???\n\n\nTL;DR Rocky relationship and wondering when you both should stop trying.",
        "created_utc": 1678685650,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with husband and his ex wife’s battle for their kid custody",
        "author": "Ok-Helicopter-3766",
        "url": "https://www.reddit.com/r/relationships/comments/11q17fr/how_to_deal_with_husband_and_his_ex_wifes_battle/",
        "text": "[removed]",
        "created_utc": 1678685587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on whether to give a second chance. Me (19M) and her (18F)",
        "author": "FenrissWoof",
        "url": "https://www.reddit.com/r/relationships/comments/11q16cn/advice_on_whether_to_give_a_second_chance_me_19m/",
        "text": "Before I start, some stuff was translated from another language so the meaning might not get across completely. I'll try to keep it as accurate as possible though.\n\nSo I had a girlfriend for a month-ish, we both are part of a sort of club/org so we had meetings once or twice a month and met there. I thought we liked each other mutually and all. But about a month in, she sent me a text basically saying she was in an intimate unofficial relationship with multiple people at the same time before we were together and she regretted accepting my confession. (In Chinese, its called a **暧昧** relationship).\n\nAbout 3-4 months later, she sends me a long text after the last club meet and now says she didn't actually have an **暧昧 relationship.** Also said that after meeting me again after some time she realizes she still liked me. She expresses a lot of regret with her decision in the text, adding that I was the first boy she held hands with and hugged. And she wants to commit to a serious relationship now.\n\nI don't know what I should do. On one hand, I think it would be good if I just let her go, but if she does seriously want to fix it, should I give her a second chance?  \n\n\nTLDR; my ex sends me text 3-4 months after she broke up with me due to being in intimate relationships with other ppl and now claims she wasn't and wants to be serious with me now. second chance?",
        "created_utc": 1678685477,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (f24) doesn’t seem to take my (m25) feelings into consideration.",
        "author": "looney-fumes",
        "url": "https://www.reddit.com/r/relationships/comments/11q1546/my_girlfriend_f24_doesnt_seem_to_take_my_m25/",
        "text": "\nMy girlfriend and I have been dating for almost a year.  I’m 25, she’s 24. We get along great and share a number of things in common.  She’s my first girlfriend and first sexual partner I’ve ever had.  I never really put forth much effort into dating because of poor self-esteem.  But I consider myself a much improved person. \n\nHowever, we’ve recently hit sort of a rough patch. One of her friends is getting married in November and has invited us. I don’t really care for weddings so I wasn’t too excited to begin with. Then I learned that two of my girlfriend’s old hookups will be there.  Now I’m really sold on the idea of not going.\n\nHere’s where I may be the asshole, I understand that this is a big occasion but I don’t want to be in the same room as two guys she used to fuck.\n\nI’ve tried my best to explain to my girlfriend that being in the same room as two guys she used to casually hook up with and have meaningless sex with is not an ideal situation for me to be in.  However, she has stated that I am overreacting, being irrational and making a bigger deal of this than it really is.  \n\nI’ve told her that she can’t really see my side of things and where I’m coming from because she can’t see things for my perspective.  I told her to imagine if I was the only guy she had ever been intimate with and she had to be in the same room with women I used to hook up with.  She claims she wouldn’t care. I don’t really believe her.\n\nWe haven’t really gotten along since. The wedding is set for November and my decision is final, as I have decided isn’t best for me not to go to avoid any awkward situations.\n\nTL;DR - I’ve decided to not go to a wedding and my girlfriend is being inconsiderate about it.",
        "created_utc": 1678685357,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(31F) fiances(32M) friend is making me uncomfortable",
        "author": "Apart-Air3525",
        "url": "https://www.reddit.com/r/relationships/comments/11q14vh/my31f_fiances32m_friend_is_making_me_uncomfortable/",
        "text": "\nMy fiancé and I have been together for a long time (over 10 years) and engaged for a few years. I recently learned from a mutual friend that his former coworker who he still keeps in touch with had a crush on him at some point. I’ve met her several times and she has always been awkward around me. I chalked it up to her just being an awkward person until I learned about the crush. She frequently initiates contact between them via text or phone calls. \n\nMy fiancé has been more secretive with his phone recently which spurred me to snoop. I honestly didn’t find any red flags on his end but saw frequent communications from the former coworker/friend. One was thanking my fiancé for “last night for multiple reasons” to which he responded something to the effect of “I’m not sure what I did but you’re welcome.” [Context: he had been hanging out with her and multiple others the previous night during a work related conference] She then responds about how she talks about him at work a lot to her new coworkers who were excited to meet him and then apologized for opening up to him about her personal drama. She closed it out with /something like: “I’m sorry I just want to tell you everything when I’m around you.”\n\n\nMy fiancé didn’t respond to this at all but it just gave me the feeling that she definitely still has a crush on him. I understand an innocent crush but I just can’t imagine myself texting someone who is in a serious relationship like this. I haven’t talked to my fiancé about it yet because that requires me to admit to snooping. I want to shut down this behavior and I honestly think my fiancé is not instigating any of it. How should I approach this?\nTLDR: how do I get my fiancés friend to stop attempting to disrupt my serious relationship?",
        "created_utc": 1678685332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think I should move in?",
        "author": "Spiritual_Singer_467",
        "url": "https://www.reddit.com/r/relationships/comments/11q13b8/do_you_think_i_should_move_in/",
        "text": "[removed]",
        "created_utc": 1678685171,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (24M) fiancé keeps pressuring me (23F) to get pregnant again, and I really don’t want to, and when I bring it up he’s so rude.",
        "author": "amatajohnson111",
        "url": "https://www.reddit.com/r/relationships/comments/11q12yt/my_24m_fiancé_keeps_pressuring_me_23f_to_get/",
        "text": "[removed]",
        "created_utc": 1678685137,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23F) having issues with (24M)",
        "author": "amatajohnson111",
        "url": "https://www.reddit.com/r/relationships/comments/11q11ta/i_23f_having_issues_with_24m/",
        "text": "[removed]",
        "created_utc": 1678685019,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (14F) was just confessed to by my friend (16M)",
        "author": "RandomflyerOTR",
        "url": "https://www.reddit.com/r/relationships/comments/11q106u/i_14f_was_just_confessed_to_by_my_friend_16m/",
        "text": "[removed]",
        "created_utc": 1678684858,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex (M22) and I (F22) broke up because he kissed another girl while extremely drunk",
        "author": "Jbgoodseventeen",
        "url": "https://www.reddit.com/r/relationships/comments/11q0ys2/my_ex_m22_and_i_f22_broke_up_because_he_kissed/",
        "text": "My ex and I were together for 3 years. He went on a night out, ended up getting super drunk and his friend saw him kissing another girl. He doesn’t remember it happening and he told me immediately the morning after when his friend informed him what happened. I truly believe he would have told me right after the kissed happened if he remembered. \nHe didn’t know the girl, I don’t know who initiated the kiss but I know that it was a random in the moment encounter. \n\nI ended up breaking it off with him as soon a so found out, he was extremely devastated with what he did and hasn’t stopped apologising. I can see he regrets what he did and feels horrible about it. \nHe understands now that he doesn’t have a good relationship with alcohol and those type of environments. I can tell this has changed his life and he wants to do the work to be a better person. \n\nOf course, I am absolutely heartbroken he could do that because we have had so many conversations throughout our relationship about how bad cheating is. It’s still fresh but I know I’ll be okay and heal. \n\nWe have genuine love here, we were so involved in each others lives and there is so many questions with stay or go. But I know I have to go because we are at such different phases in life and this incident was probably just a wake up call that we both need to work on ourselves and heal from all our traumas. He thinks it’s best as well if we don’t stay together, but trust me we both don’t want to let this go. Honestly I thought he was the one for me, I thought this was it. We both agreed that it was a case of right person, wrong time. But I don’t know if “the one” would do this, maybe that’s naive to think. My friends tell me that it’s not something they could never see past even with time and separation. I feel like an idiot for thinking that I could take him back but my hearts has hope it could work in the future. \n\nI feel wrong and ashamed to think that if he truly worked on himself and healed, realised all the bad patterns, that maybe down the line we could make it work again when we are both ready. \n\nAll opinions are welcome, any advice on getting on a situation like this would be amazing\n\nTL;DR Boyfriend kissed another girl while drunk and I ended the relationship",
        "created_utc": 1678684726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Messy relationship. Do we try or just call it quits? 24f and 28m.",
        "author": "trforsuchnsuch",
        "url": "https://www.reddit.com/r/relationships/comments/11q0yq1/messy_relationship_do_we_try_or_just_call_it/",
        "text": "[removed]",
        "created_utc": 1678684719,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend called me a mean name after seeing my own nudes on my phone from a previous relationship I had 4 years ago",
        "author": "L4ter_Days",
        "url": "https://www.reddit.com/r/relationships/comments/11q0yfx/my_boyfriend_called_me_a_mean_name_after_seeing/",
        "text": "TL;DR: my boyfriend of 2 years called me a very hurtful name and I don’t know how to address the issue without causing more trauma to myself and him\n\nYesterday my boyfriend (27M) asked to see my (27F) nudes folder in my phone. Don’t really know why he needed to see them on my phone since I send him a bunch but I have no problem with him looking through my phone as I have nothing to hide. I do keep my nudes in one of those “secret” apps with a passcode as I don’t think it’s smart to keep them in your regular camera role. I barely look at the folder of myself so I forgot I had about 5 photos/videos I sent to a previous partner, the remaining 20+ were sent to my boyfriend. He then perused them all and asked me what the guys name was, what his member was like, said stuff like “I didn’t get a video with tongue in it”. I tried to reassure him saying “there’s a lot of stuff you get that he never did” and told him the relationship was solely this guy manipulating me as he had a girlfriend the whole time which I did not find out for a year and then blocked him on everything. He seemed okay after that but today while I was helping him pack, we are moving into a house we bought together, he randomly brought up the guy again and said “my girlfriend is a *rhymes with skunk*”That really hurt me. He said sorry but never said that’s not how he truly feels about me now. I know he’s probably projecting his jealousy but that is not okay to say to me especially because that’s how I felt about myself when I was in that previous relationship. He’s also forgetting that he has been with other people before me and that’s the whole point of dating people. I think it’s a very misogynistic unfair hypocritical thing to say when his past isn’t much different from mine. I suppose it’s bad I kept old nudes and I don’t know why I did but I’ve deleted them now because it triggered a lot of negative emotions for me. I understand seeing those would’ve been hurtful but there’s no need for degrading terms towards me. I said it’s fine for now because I didn’t know how to deal with it at the time and I tend to shut down and get quiet, but I feel I should still talk to him about it as it is obviously still bothering me if I came here looking for advice on Reddit",
        "created_utc": 1678684688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chase her or my dream of having kids?",
        "author": "rdhillon20",
        "url": "https://www.reddit.com/r/relationships/comments/11q0wr5/chase_her_or_my_dream_of_having_kids/",
        "text": "tldr: Older guy falling for an older woman but worried we might be unable to have kids together. Should I pursue this any further?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm a single 40 year old guy, married before but no kids. Just started hanging out with this 39 yr old woman and I really like her. Its clear she likes me too. My dream is to get married and raise a family. She has similar goals. \n\nI want to be very intentional and respect her time. While I'd like to continue hanging out and hopefully this becomes a long term relationship and marriage, her (and my) age  worries me.  I understand you'd say its too early in the relationship to think about marriage and kids but I don't want to waste both of our time if age is gonna be a deal breaker later. I'm at the point where I need to be decisive and either (1) choose this person coz she's awesome and take the risk that we might have to live with an adopted kid OR (2) say goodbye to her and keep looking for a younger woman. Both (1) and (2) will make me sad.\n\nPlease don't get me wrong. I'm not trying to be misogynistic or discriminate against age without reason. I'm myself 40 and that doesn't help the fertility situation. Just being honest and trying to be decisive with my next steps. Any advice will be helpful!\n\n Thank you",
        "created_utc": 1678684528,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(38/F) boyfriend (40/F) is having these fears of cheating on me even before marriage. Is this normal?",
        "author": "AdBasic711",
        "url": "https://www.reddit.com/r/relationships/comments/11q0wml/my38f_boyfriend_40f_is_having_these_fears_of/",
        "text": "[removed]",
        "created_utc": 1678684517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Throwaway. I 24f am wondering when/if to call it quits with 28m.",
        "author": "trforsuchnsuch",
        "url": "https://www.reddit.com/r/relationships/comments/11q0w3c/throwaway_i_24f_am_wondering_whenif_to_call_it/",
        "text": "[removed]",
        "created_utc": 1678684470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chase her or my dream of having kids?",
        "author": "rdhillon20",
        "url": "https://www.reddit.com/r/relationships/comments/11q0vcx/chase_her_or_my_dream_of_having_kids/",
        "text": "[removed]",
        "created_utc": 1678684400,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(38/F) boyfriend (40/F) is having these fears of cheating on me even before marriage. Is this normal?",
        "author": "AdBasic711",
        "url": "https://www.reddit.com/r/relationships/comments/11q0v3h/my38f_boyfriend_40f_is_having_these_fears_of/",
        "text": "[removed]",
        "created_utc": 1678684376,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend got super drunk and kissed another girl, I ended the relationship",
        "author": "Jbgoodseventeen",
        "url": "https://www.reddit.com/r/relationships/comments/11q0uvm/my_boyfriend_got_super_drunk_and_kissed_another/",
        "text": "[removed]",
        "created_utc": 1678684355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl Invited Me To Hotel",
        "author": "J-Hobbs",
        "url": "https://www.reddit.com/r/relationships/comments/11q0obr/girl_invited_me_to_hotel/",
        "text": "\nGirl [32] invited me [32] out for dinner and a hotel\n\nWe're friends. She's expressed she's looking for a boyfriend. I'm out of shape physically and not interested in sex. I'm not very attracted to her. But I enjoy her company. I would be receptive to receive pleasure from her but I don't feel comfortable giving. I understand this is selfish.\n\nHaven't been in this situation before.\n\nWhat should I do?\n\nLast thing I want to do is be rude or hurt someone's feelings. \n\n\nTL;dr: girl invited me out to dinner and hotel. I'm not attracted to her. I enjoy her company. Not sure how to react. Want to respect her feelings.",
        "created_utc": 1678683756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (m19) always send a confirmation text to my friend/crush (f19) when we schedule a date to study for a class in college?",
        "author": "SweatyFold7356",
        "url": "https://www.reddit.com/r/relationships/comments/11q0l9i/should_i_m19_always_send_a_confirmation_text_to/",
        "text": "[removed]",
        "created_utc": 1678683498,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know",
        "author": "ladyofourtimes92",
        "url": "https://www.reddit.com/r/relationships/comments/11q0jao/i_dont_know/",
        "text": "[removed]",
        "created_utc": 1678683319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shall I do it?",
        "author": "Appropriate-Mix1342",
        "url": "https://www.reddit.com/r/relationships/comments/11q0irm/shall_i_do_it/",
        "text": "[removed]",
        "created_utc": 1678683273,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F25) fiancé (m25) doesn’t want to do anything but play video games on his pc every spare moment he can get, no matter how many times I’ve brought it up",
        "author": "dont-kink-shame",
        "url": "https://www.reddit.com/r/relationships/comments/11q0h0f/my_f25_fiancé_m25_doesnt_want_to_do_anything_but/",
        "text": "My fiancé loves his pc, which is fine. I knew from when we first started dating he was a gamer and spent lots of time on his pc. But he spends every waking moment on it now, and it’s really taking a toll on our relationship, both physically and mentally. The rare times we go out (which has gone from once a week to once a month) as soon as we get home he’s on his pc. I’m at a point where I don’t know what to do about. Every time I bring it up it’s a fight.\n\nTL;DR: my fiancé spends a lot of time gaming to the point it’s hurting our relationship and I’m at a los in how to bring it up",
        "created_utc": 1678683111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my girlfriend cheating f21 m25",
        "author": "DuePsychology8924",
        "url": "https://www.reddit.com/r/relationships/comments/11q0gnu/is_my_girlfriend_cheating_f21_m25/",
        "text": "M24 F21 I’ve been a little suspicious of my girlfriend recently, nothing specific I can name but just how’s she’s been cold and not herself.\n\nFor context, she’s started a new job in the last month where she feels the need to be quite glamorous, I know her colleagues are woman so I’m not so fussed, but little things I’m noticing but trying hard not to focus on. \n\nShe always wears bikini brief underwear but recently, every day on a work day she’s wearing a small g string thong. I obviously only notice this because she gets changed in our room early morning while I’m half asleep, half awake chatting to her.\n\nWe have always been really sexually active, but more recently we’re having sex still often but not daily like previously and I’m having to initiate a lot of it. \n\nAnother thing is, I’ve noticed a pattern, as soon as she’s home from work and I’m home too, she’ll quickly shower which kinda worries me. We normally would decide dinner first, chat and all that but now it’s “I feel gross, I’ll shower quickly then we’ll decide dinner” or whatever it is. I don’t know why but this one scares me alot. The other day we had sex when she got home from work, but she wanted to shower first which made zero sense. This made me really nervous. And I’m hoping it’s not for obvious reasons. \n\nI also went through her snap the other day just to see her photos and snaps and I found a selfie of her boobs she never sent to me. I couldn’t find any guys in her list she has spoke to recently and the others were just me and her sisters.\n\n\nTLDR: is my girlfriend cheating? Some strange stuff happening recently and less intimacy or am I reading into this too much?",
        "created_utc": 1678683081,
        "upvote_ratio": 1.0
    },
    {
        "title": "M25 F21 girlfriend is acting suspicious",
        "author": "DuePsychology8924",
        "url": "https://www.reddit.com/r/relationships/comments/11q0bv2/m25_f21_girlfriend_is_acting_suspicious/",
        "text": "[removed]",
        "created_utc": 1678682653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that my(30m) gf(28f) wants go to IKEA with a male friend?",
        "author": "failedmang",
        "url": "https://www.reddit.com/r/relationships/comments/11q09c6/is_it_weird_that_my30m_gf28f_wants_go_to_ikea/",
        "text": "Pretty simple question.  Like any relationship, we occasionally have issues we need to talk through.  We don’t get to spend that much time together because she is often busy.\n\nShe mentioned to me last week that one of her male friends got into gradschool and she will be visiting him to celebrate.  He lives about 2 hours drive away and my gf decided that they would go to Ikea.\n\nI pointed out to her that going to Ikea is something that married couples do.  (I went with her on her first ever trip to Ikea 6 months ago).  She seemed defensive about it and, like she often does, claims that it doesn’t matter what other people think since our generation is dumb anyway.  Her friend has never been to IKEA before and she wants to share this experience with him.\n\nI trust her to not “cheat”,  (she’s never had “sex” and can barely handle fingers), but things like this do make it less clear to me how much she values the relationship.\n\nTL;DR: Is it weird that my GF of 4 years wants to take another man to Ikea?",
        "created_utc": 1678682426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uncomfortable with my (31F) fiancés(32M) friend",
        "author": "Apart-Air3525",
        "url": "https://www.reddit.com/r/relationships/comments/11q095x/uncomfortable_with_my_31f_fiancés32m_friend/",
        "text": "[removed]",
        "created_utc": 1678682414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that my(30m) gf(28f) wants go to IKEA with a male friend?",
        "author": "failedmang",
        "url": "https://www.reddit.com/r/relationships/comments/11q07sy/is_it_weird_that_my30m_gf28f_wants_go_to_ikea/",
        "text": "[removed]",
        "created_utc": 1678682289,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I (20F) know/can do to help my (19M) Boyfriend when it comes to his previous relationship traumas?",
        "author": "ttlynotluzir",
        "url": "https://www.reddit.com/r/relationships/comments/11q00r7/what_should_i_20f_knowcan_do_to_help_my_19m/",
        "text": "Tldr; Men of reddit  who have been through abusive relationships or something similar is there anything I should know? Anything I should be doing or that I can do to help him or ease him? He experiences a lot of paranoia is there anything I can do to help ground him? He wants to talk about his past relationships now (he's deemed it time and I tell him to take it easy) what should I not say and how do I prepare myself for that conversation? I don't want to react in a way where it might hurt or trigger him.\n\nBackground: Hello Reddit, my (20f) boyfriend (19m) has been in a lot of abusive relationships. His abuse ranges from physical, mental and emotional. He's been cheated on as well. He's also had a checkered past (Juvenal prison and sadly hanging out with the wrong crowds/gangs). He was also raised in an abusive household. \n\nI have a past with physical and emotional abuse (mainly with my family/childhood) and poverty but I was \"lucky\" that I self isolated and never got involved with the wrong people (well except by this one stalker who till this day bothers me lol) but I have attended therapy (this was before I met him) and was deem \"stable\" but I  am currently out but soon going back to sort out my issues regarding relationships (aka my insecurities and why my triggers flare up and how to handle them in a healthy way).\n\n I struggle with cptsd and the cluster, depression, self harm, disassociating, anxiety, insomnia you know the works. \n\nAnd before him I avoided romantic relationships like the plague. Luckily the worst I've had has been a toxic partner who wore me down inside and my confidence.\n\nI met him and he's a really good person, he's been through a lot but he's a great listener and always prioritizes me (I remind him i come second to himself lol) and helps me out. He is very good for me.\n\nBut recently, I don't know how to help my boyfriend navigate our relationship.\n\nI remind him that I'm here to listen, I won't get mad or angry, if he has a concern he can voice it, it's us vs the problem not each other, I encourage him to have boundaries with me and voice when I've done something that either triggers him or bothers him. But he'll sometimes get tunneled vision and I can recognize it because I get like that, I work hard for us to not accidentally trigger the others wounds (in the beginning it was hard but I've learned how to spot it now lol for both of us).\n\nAt times I am a little drained because I'm juggling a lot (Nursing student, Part time Work, Family and now my partner) but he's my partner and my person and he needs support and love.\n\nI love him very much and I just want to help our relationship have a strong base/foundation. We're just to really hurt young adults trying to make it work you know?\n\nThank you if you've read this far !",
        "created_utc": 1678681686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fiancé just wants the play on the computer",
        "author": "dont-kink-shame",
        "url": "https://www.reddit.com/r/relationships/comments/11pzy6c/fiancé_just_wants_the_play_on_the_computer/",
        "text": "[removed]",
        "created_utc": 1678681464,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (27F) boyfriend (23M)wants space and it’s been over a week… is the relationship over?",
        "author": "MorningIntelligent10",
        "url": "https://www.reddit.com/r/relationships/comments/11pzxzs/my_27f_boyfriend_23mwants_space_and_its_been_over/",
        "text": "Me and my boyfriend had a huge argument because I have jealousy/insecurity issues with him having a girl best friend in his life. He doesn’t like how I’m projecting my past trauma on him and how I’m way too dependent on him. I have BDP. He asked for space and it’s been a week since I last talked to him. He said he needs time to think about the relationship as he thinks there are aspects of it that isn’t fixable. I called him and he has ignored me constantly. Is our relationship over? Why is he dragging this out and hurting me more by not giving me answer on what he wants? It hurts so much not knowing what is happening and feeling like this for a week.\n\nTLDR; it’s been a week after a fight (he asked for space) and hasn’t contacted me since",
        "created_utc": 1678681448,
        "upvote_ratio": 1.0
    },
    {
        "title": "(27F) Boyfriend (23M) wants space and it’s been over a week… is the relationship over?",
        "author": "MorningIntelligent10",
        "url": "https://www.reddit.com/r/relationships/comments/11pzwu7/27f_boyfriend_23m_wants_space_and_its_been_over_a/",
        "text": "[removed]",
        "created_utc": 1678681339,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (M25) girlfriend (F26) confessed to a friend.",
        "author": "ThrowRA2-3",
        "url": "https://www.reddit.com/r/relationships/comments/11pzvi4/my_m25_girlfriend_f26_confessed_to_a_friend/",
        "text": "\nWe have been dating for 3 years. We have a friend group we often all hang out with. And there’s one guy in there that’s relevant. He called me one day. and told me to come to his house alone. \nWhen I came. He told me he had to show me something. He took out his phone and showed me text messages. From my girlfriend. \n\nShe told him she was in love with him. Spilled out her heart for him. And said would break up with me if he was willing to be with her. He declined. It seems she almost certainly thought he felt the same for her and “misread signs”. So she then told him to pretend the conversation never happened. And never let me know because “I guess I can stay with him then. He isn’t that bad”. \nHe lied to her and said he wouldn’t tell me so she wouldn’t get the chance to try to gaslight me in advance into thinking he was making stuff up. \n\nNow i am thinking about what to do. How to confront her about this. And how to (most likely)break up with her. I’m worried though if I handle it wrong that it will destroy our friend group. Any tips?\n\n\nTLDR: girlfriend confessed to a friend and wanted to get with him. Backtracked when she rejected him and called me “not that bad”.",
        "created_utc": 1678681225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the bad guy",
        "author": "hardcider45",
        "url": "https://www.reddit.com/r/relationships/comments/11pzs17/am_i_the_bad_guy/",
        "text": "[removed]",
        "created_utc": 1678680930,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23 f) don’t know what to do about my feelings for my (28 m) guy best friend",
        "author": "False-Transition-714",
        "url": "https://www.reddit.com/r/relationships/comments/11pzj0y/i_23_f_dont_know_what_to_do_about_my_feelings_for/",
        "text": "[removed]",
        "created_utc": 1678680167,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (M25) girlfriend (F26) confessed to someone else.",
        "author": "ThrowRA2838497",
        "url": "https://www.reddit.com/r/relationships/comments/11pzhce/my_m25_girlfriend_f26_confessed_to_someone_else/",
        "text": "[removed]",
        "created_utc": 1678680051,
        "upvote_ratio": 1.0
    },
    {
        "title": "He’s going to the Navy😫 (M21) (M19)",
        "author": "ander999-",
        "url": "https://www.reddit.com/r/relationships/comments/11pzcxh/hes_going_to_the_navy_m21_m19/",
        "text": "1 (m21) met this guy (m19) last year. We hit it off\nand had such a romantic few months. The first five minutes of meeting him I knew he was going to make me feel different than previous love interests. But we met at a bad time, just a few months before i left the country for a bit. Now i'm back and I still have the same feelings for him maybe stronger. But turns out now he might be going to the Navy and has also been going through family issues. Before i left we said we'll stay friends but since I've been back we haven't spoken of it. Would you tell him about how you feel risking the friendship now or just be there for him as a friend until he leaves?\n\nTL;DR He’s my friend and leaving in May, should i tell him i still like him.",
        "created_utc": 1678679686,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (23F) told me (24 M) she thinks I only view women as sexual objects because I have no women friends",
        "author": "lane1241",
        "url": "https://www.reddit.com/r/relationships/comments/11pzc1o/my_girlfriend_23f_told_me_24_m_she_thinks_i_only/",
        "text": "[removed]",
        "created_utc": 1678679609,
        "upvote_ratio": 1.0
    },
    {
        "title": "I F(26) want to break up with my boyfriend M(27) of almost three years",
        "author": "kuczech",
        "url": "https://www.reddit.com/r/relationships/comments/11pz8qy/i_f26_want_to_break_up_with_my_boyfriend_m27_of/",
        "text": "Just what the title says. We began dating three years ago in May and it has been nothing like what a healthy relationship should be. I had no idea my boyfriend would be as difficult as he is, and it's had a massive impact on my wellbeing. I always feel a sense of fear about so many things now. Dread, sadness... I wanted to travel and do exciting things with my SO and remained completely single for over one year prior to getting into a relationship with him. No talking to any other men with the intention of getting to know them for the sake of a potential relationship. Nothing. I had decided to focus only on my own development at that time and it was the best time of my entire life. When I found out my current SO was interested in me, I decided I was in a place where I was interested in starting a relationship. \n\nSince that time, I have been far more than disappointed. I think about the fact that every day, time is passing that I could be spending experiencing other things in the world that I feel makes life valuable. I always avoided having a conversation with him about things because I also do want a relationship in my future, but this one has been so terrible. If we did have a conversation about our future it would only require a few minutes of discussion because I know that if I could end it now, I would. I just haven't been able to conjure up the bravery to sit down and talk with him. One reason this has been very hard is that my boyfriend also only likes to talk about very shallow topics, so a conversation like \"hey, I was wondering if we could discuss where we are at with things\" would sound totally out of the blue. I've brought up the possibility of breaking up a couple of times before when I observed how obviously terrible things were, but he never responded with mutual feelings about that. So I gather from those conversations that the breakup will only happen if I'm completely blunt and just tell him I want out. \n\nSo that's it... just feeling really burdened again tonight and I'm so sick of feeling this way and never having any relief from it. \n\nTL;DR - I've been dating someone who has no idea how I actually feel about our relationship and I want it to end. I don't even care if I can't ever find anyone else. Being single forever is better than what I'm going through now.",
        "created_utc": 1678679326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Concerned about how insanely misogynistic my(24f) bfs(22m) friends are.",
        "author": "anan876",
        "url": "https://www.reddit.com/r/relationships/comments/11pz802/concerned_about_how_insanely_misogynistic_my24f/",
        "text": "So I’ve been adamant about meeting my bfs friends, as I think that’s important for a relationship. Anyways I’ve met two of them at events now, and both left me literally shocked at the amount of misogyny. The first one talked about his ho phase, how he’ll only “throat fck fat women, nothing more”, how he’ll tell women they’re gorgeous, and treat them right just to sleep with them, then ghost, that women are “pathetic, and stupid bc they fall for it” .He did say “I’m sorry I know you’re a woman and I probably shouldn’t have said that” but what the actual fuck. The second one was just as bad. Saying he has a girl he won’t date, because he can’t stop sleeping with other women, but he keeps her along just because he likes that they love each other. He even brought up how she gets very upset when he sleeps with others, then tells her she loves him. He also brought up that he had a gf that he only dated because she “gave good head, and had a fat ass”, and talked about how he sees attractive women just as things to fuck. They said a lot of other crude things, but those stood out to me. What’s weird is both of them were very nice otherwise. Anyways, Ive heard men talking like this at bars, in highschool, or online, but it was genuinely horrifying to hear face to face. The fact that it’s so normalized that no other men there were even phased, including my bf, raises many red flags. Now my boyfriend has never talked or acted like this to me, but if he had these friends he must relate to it somehow. I just don’t even know how to handle this. Please give some advice. \n\nTLDR; bfs misogynistic friends raising red flags. Idk what to do.",
        "created_utc": 1678679261,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often do you see your bf/gf at the year mark? 34 F and 26 F",
        "author": "unopenedvessel",
        "url": "https://www.reddit.com/r/relationships/comments/11pz2rh/how_often_do_you_see_your_bfgf_at_the_year_mark/",
        "text": "[removed]",
        "created_utc": 1678678813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that normal?",
        "author": "whiteseaturtle",
        "url": "https://www.reddit.com/r/relationships/comments/11pz25w/is_that_normal/",
        "text": "[removed]",
        "created_utc": 1678678760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21F) hang out with my friends (25M, 23F) a lot, but always pay for everything",
        "author": "Slushy69420",
        "url": "https://www.reddit.com/r/relationships/comments/11pz1b8/i_21f_hang_out_with_my_friends_25m_23f_a_lot_but/",
        "text": "So I’m gonna be fully transparent and say I’m a spoiled kid. I don’t work, pay rent, and get a generous allowance from my father. The guy lives with his mom and has a job, the girl pays rent, has a job and goes to school. I’m always happy to share my allowance because I love my friends and am fully aware of how lucky I am to not have anything weighing on me to pay. I don’t resent my friends since I have no reason to.\n\nSaying all this, that doesn’t necessarily mean that my bank is loaded or that my family is rich. I’ve been broke obviously since I don’t just ask for money when I don’t need it. My dad is very generous to all of us, his kids. I’m writing this because lately I’ve felt a bit weird specifically towards the girl, we’ll call her Danny. I’ve been friends with Danny since last June, we met online and by total coincidence, she was actually already familiar with my older brother and they hung out sometimes. I was a bit weirded out by this coincidence, but we hung out and we clicked. She’s very sweet and I love her a lot. Lately, I feel like there’s more of an *expectation* when we hang out to pay for everything and if I wanna see her, I have to get her a way to my place or go pick her up. She lives a few towns over and I don’t drive nor does she so Ubers are a bit pricey or I have to ask someone to pick her up or drop me off. \n\nThe guy, we’ll call him John, also lives a few towns over, we’ve been friends for almost 6 years and he’s great. I don’t feel this way with him at all cuz he pays for his rides and only wants to go do something if he has money even if I want to pay for both of us. He offers to bring snacks over and is pretty cool. I mention him just to compare\n\nSo the thing that started my feelings with Danny is the fact that she tells me she’s broke and can’t hang out but a day or two later, she’s out at a restaurant with other friends. I went over to her place cuz she said she wanted to go to the movies. A couple weeks ago, I go over to her new place where we agreed to go before the theater and she’s not dressed, time comes around to head out and she starts saying she doesn’t want to go anymore and starts putting the movie on her computer. I’m resistant enough to keep pushing but we end up just watching at her place. Today, she posted that she got a new iPhone which she mentioned she wanted the last time we hung out (we hung out a week ago or so and she said she was broke) my brother and I picked her up and dropped her off after we bought some snacks and drinks. I swiped up on her story and asked how she afforded it and she says “It’s better to leave some questions unanswered LOL”\n\nSo I’d like some feedback on if Im being too sensitive since she has things to be putting her hard worked money into and it’s normal if we’re really friends. Am I being selfish? \n\nTLDR: I get a good allowance and regularly pay when I hang out with my friends who work/pay rent. No problem with the guy, but I feel like the girl is taking advantage of me",
        "created_utc": 1678678684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (27F) end things with my current boyfriend (32M) over societal norms?",
        "author": "BeingABro99",
        "url": "https://www.reddit.com/r/relationships/comments/11pz16y/should_i_27f_end_things_with_my_current_boyfriend/",
        "text": "Context: I (27F) come from a South Asian family where culture is super important. I've been dating for a while now and ever since I turned 26, I've been looking to date with the intention of settling down. I always make it clear in the beginning that we'll see how it goes and then have a discussion as to \"where we're headed\".\n\nBeing South Asian, there are things such as religious differences, family backgrounds, socio-economic status, financial stability etc that matter to additionally.\n\nI've recently met a real nice guy (32M) via a dating app, we've been together about 3 months and he has been very upfront about his life. I come from a well-off family, he comes from a family of no wealth. I'm pretty settled career wise, he's still studying. We're from different places, we follow different religions but all those are things that we don't control. He's 32, about 4 years older than I am and has been nothing but great to me.\n\nOur differences are something I know my family will have an issue with. But it's 2023, do I take these factors into consideration and end that relationship? Or should I let go of these things because happiness, love and respect are what matter most?\n\nTL; DR: Should I break up with my current boyfriend over ingrained social issues?",
        "created_utc": 1678678674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whenever I complain about periods my BF(20M) jokes about getting me pregnant so I(20F) don’t get one. When he says it it makes me deeply uncomfortable. Should I approach him about it?",
        "author": "ChannelHefty3982",
        "url": "https://www.reddit.com/r/relationships/comments/11pz0ij/whenever_i_complain_about_periods_my_bf20m_jokes/",
        "text": "[removed]",
        "created_utc": 1678678617,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21F) hang out with my friends (25M, 23F) a lot, but always pay for everything",
        "author": "Slushy69420",
        "url": "https://www.reddit.com/r/relationships/comments/11pyw2m/i_21f_hang_out_with_my_friends_25m_23f_a_lot_but/",
        "text": "[removed]",
        "created_utc": 1678678264,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (21M) bf (39M) is not responding to me anymore",
        "author": "LengthPresent8178",
        "url": "https://www.reddit.com/r/relationships/comments/11pyu1u/my_21m_bf_39m_is_not_responding_to_me_anymore/",
        "text": "My (21 M) boyfriend (39 M) of almost 7 months has me blocked since Friday (he did not even talk to me on Saturday which was our 7 months together) and here is why:\n\nA week prior, my american cousin (23 M) texts me that he will come visit me from the US Friday through Sunday (for context I am an international student in Canada). We have always been so close, he is like a big brother to me. So, I informed my boyfriend. Now the problem is my family is used to interfere a lot with my personal life before my bf taught me to put boundaries and they are homphobic. My bf doesn’t want to bring that into his life so he wants me to cut contact with them as he is very private. However, I have been pushing this visit away for 6 months now and I came up with every possible excuse to the point where my cousin did not even ask to come this time he just gave me the heads up. Long story short, my bf blocked me last week as he did not want me to see them (mainly according to him in fear of them changing my mind on some topics that me and him have already established and some decision we’ve taken also so that I don’t skip seeing him during the weekend as I visit him every weekend and we have been doing that for 7 months non stop, I am not complaining btw i love it). I ended up postponing the visit a week further to comfort my bf and be able to spend time with him and he was okay with it. But later during the week, when friday started approaching my bf became iffy. I informed him thursday night that my other cousin (20 F) and their other cousin (24 F) are also coming immediately after I knew I also told him that the girls will be staying in a hotel while my cousin and I will stay at my place. He has already been making “jokes” (or so i thought) about me sleeping with my cousin in the same bed and doing sexual stuff with him (i have different pillows and covers) so he started it again. I told him that it is not even in me to think of anyone sexually let alone my cousin who I share the same blood with. He would not let go. He went as far as saying he’ll sleep with someone (as a joke i hope) as well as texting a guy of the same nationality as me on tinder to get on my nevers. I played along but then he blocked me as I seemed bothered. I expressed my uncomfort through an email and that I am already sad from not being able to see him this weekend. So, he unblocked only for me to call and him to continue teasing me and have me in the background while he texts the guy. At the end, I said bye as I felt disrespected and I hung up on him which is not a habit of mine. I have been blocked ever since. I think what I did was disrespectful and I have been trying to reach out through emails to make it up as I still love him so much but he is not responding. I don’t even know if he’s receiving/reading them. I have previosuly confronted him with his love of having me all to himself and he confessed to wanting me to dedicate my time to him and prioritizing him “regardless”, he also makes me feel that I don’t do as much effort as he does and that all he does is for my best interest while I always act selfishly.\n\nI don’t know my heart is aching and I felt like ranting. I am hurting checking if he unblocked me or not every now and then.\n\nTLDR: my bf blocked me after i hung up on him as he was teasing me through texting a guy on tinder because my cousins are coming over to visit me.",
        "created_utc": 1678678100,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (24M) best friend’s girlfriend(24F) is in love with me",
        "author": "SerenityNow_1989",
        "url": "https://www.reddit.com/r/relationships/comments/11pytcp/my_24m_best_friends_girlfriend24f_is_in_love_with/",
        "text": "My best friend has been dating a girl in our friend group for 8 months, and for the same amount of time, she has been telling me that she wishes she had met me first. At first, I brushed it off as harmless flirtation, but it's starting to make things difficult for me and our friend group.\n\nWhenever we're all together, she gives me nonstop attention. There have been nights where she ignores my best friend and only talks to me. Recently she's trying to force my friend into a relationship that he doesn't want and she turned up the flirting and touching to make him jealous. \n\nAll of our friends have confirmed that she's in love with me and she talked to the girls in our group about her feelings for me. \n\nI've also started to develop feelings for her because she’s the only girl in a long time that has acted remotely interested in me. I'm also desperate for a relationship which doesn’t help. I've confided in her about my dating struggles, and she's told me that she would have dated me in a heartbeat.\n\nI'm afraid of flirting back or instigating anything because I don't want to hurt my friend. I’ve woken up to her laying on top of me after we got really drunk and I’m afraid of what could happen if we keep going out. \n\nI've confronted her about this behavior twice now, but each time she cries for hours which kills me. She doesn’t know that I’m starting to develop feelings. \n\nWhat should I do? Should I stop going out with them? Should I tell my friend about it? I'm just not sure what to do and could use some guidance.\n\nTL;DR: Best friend's girlfriend is in love with me and it's causing a toxic situation in our friend group. Should I stop hanging out with them?",
        "created_utc": 1678678037,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (21M) bf (39M) is not responding to me anymore",
        "author": "LengthPresent8178",
        "url": "https://www.reddit.com/r/relationships/comments/11pyt06/my_21m_bf_39m_is_not_responding_to_me_anymore/",
        "text": "[removed]",
        "created_utc": 1678678011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (22M) gf (22f) cheating?",
        "author": "rbt200",
        "url": "https://www.reddit.com/r/relationships/comments/11pysjr/is_my_22m_gf_22f_cheating/",
        "text": "We have been dating 6 months.\nI have been out of the country for the last week, and my gf has been working late nights, getting off around 12:30am. Due to the 7 hour time difference while I was away, it was difficult to talk over this last week. On a couple occasion, she has been nearly unreachable at work/when she gets off which was cause for some concern but I understand it may get busy and she doesn’t text, or gets off and is tired. I just got back to the city where we both live today, and she has left for a week yesterday for vacation with her family. I am taking care of her cat while she is gone. So I get back in town and go to feed her cat and I notice an empty box for UTI meds in her trash can in her room. Now I know that sex is not the only cause for a UTI, but over the course of us dating she has had 3-4, always within a day or two of us being sexually active and she always tells me when she gets one. However this time she told me nothing about any symptoms while I was away. We hadn’t had sex in the few days before I left town. So I am stressing a bit. What do you guys think? Is this something I should bring up to her and if so, how? \n\nResponses are greatly appreciated as I don’t know how to bring this up to her while she is on vacation with her family. I haven’t said anything yet.\n\nTLDR: I was out of town for a week, and come home to find a box of UTI meds in my gfs trash can when feeding her cat. We were not sexually active right before I left.",
        "created_utc": 1678677973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (24M) and my girlfriend (24F) are arguing more frequently over things rooted in our insecurities. How should I approach talking this through with her or is this something we deal privately on our own terms?",
        "author": "ThrowRA_toto",
        "url": "https://www.reddit.com/r/relationships/comments/11pyqss/me_24m_and_my_girlfriend_24f_are_arguing_more/",
        "text": "For context, this is my first relationship and this is her 3rd one + has talked with/gone on dates with 8-10 other guys in the past year. We been together for about 5 months now exclusively. Essentially we've been arguing more often these days and it always seems to point back to our insecurities.\n\nMy insecurity is that I wonder if I'm just a rebound to her and whether she actually likes me for me or not. I have this insecurity because when I first asked her out, she said she'd been waiting for me to ask her out for months until I finally did. However, she was talking with multiple other guys during this time and throughout the months without telling any of us (we all hang out in the same group of friends). She's been going out with them, hanging out and getting meals, which is fine, she can do that if she wants, but it makes me question why, if she was so interested, didn't she hint or make it more clear that she was also into me. I know I shouldn't think this but I feel like sometimes she got bored of those guys or they ended it with her and when I came around, she was on board immediately without actually thinking about it.\n\nHer insecurity is that I don't actually like her as much as she likes me because if I did, I would've asked her out sooner rather than months later. She gets jealous when I hang out with other girls and wonders if I actually like her. I reassure her and do many things for her which she appreciates, but any little moment where it looks like I'm invested in other people or my career, she gets worried. She realizes she shouldn't think this but can't help it.\n\nBasically, our arguments usually start because someone feels as if the other party isn't fully invested. Then it spirals down to us bringing up our insecurities of us wondering if the other side truly has feelings for one another. This is not healthy thinking so I'm thinking me and her should talk this through and reassure each other. Anyone have advice on if this is the right move and if so, how to best have these types of conversations?\n\ntldr: girlfriend and I have insecurities that the other side doesn't truly like the other person and it's causing us to argue and doubt. wondering how I can talk to her about this",
        "created_utc": 1678677831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband wont let dad stay over for a night",
        "author": "Ancient-Wrangler9713",
        "url": "https://www.reddit.com/r/relationships/comments/11pyqrk/husband_wont_let_dad_stay_over_for_a_night/",
        "text": "Hey so I (30F) need advice if it's normal or how to deal with this. Husband (30M) has undiagnosed severe social anxiety or how he says hates people (but he can't handle crowds, movie theaters, etc) and dad is away across country snd only comes to visit for a night for a trip. Well, husband felt so uncomfortable and panicked and wouldn't let dad stay over for a night cuz even his room he didn't feel comfortable enough like it's too much for husband. Dad only wants to see me and sleep on couch not in cold (driving). Once I told him no, and dad and mom were pissed saying they're ashamed of us and that we treated dad worse than a dog. Now dad is coming over again for night and husband got instantly stressed out and refuses to talk to me (I came with dad on phone by accident and hubby says I'm trying to manipulate him and entrap him into saying yes, which I didn't mean to I didn't know it'd bother him).\n\nI get hubby has boundaries, he has some issues socially, but my parents also take it like end of the world, and I'm stuck in middle being torn apart and don't know what to do. Wtf do I do?\n\nTl;Dr hubby has some kinda social issues with people and won't let dad stay for a night instead of spending it jn cold, like once a year, and parents are \"ashamed\" of us. What to do?",
        "created_utc": 1678677828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband wont let dad stay over",
        "author": "Ancient-Wrangler9713",
        "url": "https://www.reddit.com/r/relationships/comments/11pypu6/husband_wont_let_dad_stay_over/",
        "text": "[removed]",
        "created_utc": 1678677752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is he an asshole?",
        "author": "rooney_99",
        "url": "https://www.reddit.com/r/relationships/comments/11pyplk/is_he_an_asshole/",
        "text": "[removed]",
        "created_utc": 1678677733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband wont invite dad even for 1 night",
        "author": "Ancient-Wrangler9713",
        "url": "https://www.reddit.com/r/relationships/comments/11pyntb/husband_wont_invite_dad_even_for_1_night/",
        "text": "[removed]",
        "created_utc": 1678677600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I 21M forgive my best friend 22M friend for kissing a girl 20F that I was talking to?",
        "author": "ThrowRA14392193",
        "url": "https://www.reddit.com/r/relationships/comments/11pyicy/should_i_21m_forgive_my_best_friend_22m_friend/",
        "text": "[removed]",
        "created_utc": 1678677175,
        "upvote_ratio": 1.0
    },
    {
        "title": "unexpectedly dumped my partner",
        "author": "grdnofjne",
        "url": "https://www.reddit.com/r/relationships/comments/11pyakc/unexpectedly_dumped_my_partner/",
        "text": "i (f23) just expectedly broke up with my boyfriend (m30) over the phone today. i don’t know what happened. we have been having a bit of a rough go at things, never super intense or anything really bad necessarily... just some troubles with communication on his end and maybe some comparability issues that we have been trying to work through, but like i said it never got bad (by bad i mean like weekly fighting, raising voices, crying, stuff like that). \n\nyesterday i had come over to his place because he invited me earlier in the week, but i was getting the vibe that he wanted to be alone. he told me he was feeling “disconnected from me” and it was making him sad, he didn’t have anything else to say when i asked why.. and never followed up on it. he wouldn’t tell me what he needed and wouldn’t say if he wanted me to stay or go.\n\nthis has been a problem before and i always ask him to just tell me what he’s feeling and what he needs honestly because i don’t want to be a burden or play guessing games. he has a hard time just saying “you know i think i’m needing to do my own thing” and instead just gets kind of weird and won’t explicitly tell me? it’s so strange because i really respect the time we spend apart and have tried to make him feel as comfortable as i can when it comes to being honest about space! i left on an awkward note and later in the night we briefly texted and had a loving chat, i told him i hope he’s feeling better and having fun and he said he loves me and really wanted to see each other the next day. \n\nit’s not like this happens every week, but there is some reoccurrence. overall i would say he has a communication problem, i on the other hand do not and it’s starting to feel like my mentioning of things that are troubling me are becoming a nuisance to him... the thing is the talks would happen way less if he was doing his part communicating and meeting me halfway on things. i really do think he loves me, but maybe it just boils down to being too different. i don’t know. \ntoday we were trying to make plans to hangout on facetime, going back and fourth like “so do you want to hangout?” “why don’t you let me know?” etc (seemingly harder to make plans than it should have been). i told him our interaction yesterday made me feel bummed out and he admitted that he didn’t want me to be there, but felt bad telling me because he didn’t think it would go over well (i ALWAYS ask him to tell me what he needs and never get upset over needing space! i just want him to tell me) suddenly i just said “i don’t want to do this anymore” it was like i just dissociated and realized i have no more energy to give to these trivial miscommunications and insecurities. i don’t know what the hell happened and i’m starting to spiral a bit, feeling like i just did something stupid and so rash and wish i had thought about it longer. i really need some reassurance to stick to what my gut was just telling me in that moment though.. i don’t know what the fuck is happening. we haven’t talked since the phone call a few hours ago. i do feel that breaking up is fine, but there was zero time to prepare. i have not been contemplating it or anything so it just feels completely confusing. i really wish he had said he feels the same way but he just sort of said i caught him off guard and that he isn’t good talking on the spot. we ended the call with him saying he’d talk to me soon??? ahhhh whaaaat. did i just make a big rash evil mistake!? i hate that it came out over the phone but it was like this big overwhelming feeling of defeat and exhaustion just took over. my last boyfriend was such a piece and broke up with me over a ten minute facetime call after three years of dating.. i am feeling exactly like him right now BUT i am also feeling really disappointed in my boyfriends inability to communicate and his growing disinterest/respect for my needs and feelings. \n\nTLDR; unexpectedly broke up with my boyfriend over the phone and feel like a total lunatic. no clue if i should stick to this feeling or try and talk to him!?",
        "created_utc": 1678676569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me 30M and older brother 35M",
        "author": "m_r_l_1992",
        "url": "https://www.reddit.com/r/relationships/comments/11py82a/me_30m_and_older_brother_35m/",
        "text": "[removed]",
        "created_utc": 1678676400,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18M) ended my relationship with my lover (18F)been together for six months. I want to get her back.",
        "author": "Blankusernamees",
        "url": "https://www.reddit.com/r/relationships/comments/11py6aa/i_18m_ended_my_relationship_with_my_lover_18fbeen/",
        "text": "[removed]",
        "created_utc": 1678676266,
        "upvote_ratio": 1.0
    },
    {
        "title": "He's (30M) great on the phone but not as responsive in texts with me (25F)?",
        "author": "TesterThrow121",
        "url": "https://www.reddit.com/r/relationships/comments/11py5hm/hes_30m_great_on_the_phone_but_not_as_responsive/",
        "text": "I've been getting to know someone, and we have out of this world conversations on the phone, but something that's really been driving my anxiety is the inconsistency in texting. We don't really send paragraphs or anything when communicating via text and it's all fairly casual, so I don't imagine it would take much to respond. When I questioned him once about getting back to me on something, he said he was putting thought into it and based on what he shared, it really did seem like he was thinking before responding. But I'm not sure this would apply to all situations when he takes hours. I don't know how accurate online/activity indicators are but he seems to be active fairly often, so obviously it hurts a little if he doesn't open a message or respond. I do have some past experiences where I would be ignored intentionally, so I think that's partly where the anxiety is coming from.\n\nI don't feel comfortable bringing this up since we haven't established anything. I guess I just wanted to check myself on if I'm being too sensitive about this? I always look forward to our conversations, and this makes me feel like he might not feel the same.\n\nTD;LR: We have awesome phone calls, but he sometimes takes hours to text back even after reading the message. Am I being too sensitive about this?",
        "created_utc": 1678676206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating a noncommittal guy as I wait for an old flame to rise from the grave",
        "author": "SaladLongjumping130",
        "url": "https://www.reddit.com/r/relationships/comments/11py1gw/dating_a_noncommittal_guy_as_i_wait_for_an_old/",
        "text": "This is kind of long, sorry. \n\nI(30ishF) met two guys last spring. One was amazing, we took a beautiful trip and I fell in love with everything about him. His hair, his pensive silences, the way he smiled, etc etc. Albeit, a bit of a sadboy.\nThe other was objectively good- attractive, clean, good manners, virtuous, thoughtful, funny, never sad. But no spark. \n\n\nThe sadboy gave me some amazing moments, then just kind of disappeared. I knew he was set to travel away from here, but neither of us knew how long he would be gone. We took a trip to a national park and then parted ways. He kept in touch a for a few weeks, then weeks turned to months, and I haven't heard from him since end of last summer. I met him in April 2022. I have thought about him almost daily since. Last week I had such a vivid dream about him.\n\nThe good boy was kind of a placeholder. It was never supposed to be serious, but he was funny and cute, and has always been eager to try new things with me. We got comfortable with one another and things have kind of just been this way since. We're dating, but not really a couple. He has straight up told me he's not looking for anything too serious and doesn't see marriage with me, and that okay because we're just having fun. But after 9 months of casually dating, I have been feeling like something has to give. \n\nThe last couple weeks I have felt like I need to do something else with my life. He is fun, but he can be a little rude. He called me annoying the other night, and I'm just not feeling like he accepts me for who I truly am. Obviously there are more detail, but this is the gist. This weekend I went through all the pros and cons of ending things with good boy, and as I'm sitting alone in deep thought I get a text from sadboy, the first in 8 months. He is back in town and wants to see me. There is no telling how long he'll be around, and seeing as how we never got physical it could just be a friendly visit. \n\nMy question:\nIt seems too good to be true, and with perfect timing. Am I completely out of line in thinking he might want something more? Am I getting  ahead of myself??\n\nTL;DR: guy I'm dating won't commit, despite being a great guy. right as I making the life decision to stay or not, the guy I've been waiting for appears from nowhere and I'm ready to jump right in feet first",
        "created_utc": 1678675888,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend is ghosting me and I'm not sure what to do?",
        "author": "SharpshooterTom",
        "url": "https://www.reddit.com/r/relationships/comments/11pxx2j/my_friend_is_ghosting_me_and_im_not_sure_what_to/",
        "text": "[removed]",
        "created_utc": 1678675548,
        "upvote_ratio": 1.0
    },
    {
        "title": "gf (29f) told me (31m) she doesn't love like others do",
        "author": "Ok-Organization3520",
        "url": "https://www.reddit.com/r/relationships/comments/11pxux0/gf_29f_told_me_31m_she_doesnt_love_like_others_do/",
        "text": "I (31m) made the mistake (?) of telling my gf (29f) of a yr during a nice night out that she means a lot to me and that i'm grateful for her presence in my life. she, in turn, appeared to get very worked up and told me that she does not love people like others do. I was very surprised and couldn't bring myself to say anything other than \"what?\" She then said that she hopes that I know how much she cares about me, but that only I can decide whether her love is enough for me. I was so confused I just said ok and moved on. Now, with some time to reflect, I still don't know what to think. Is she emotionally unavailable? Or just nicely letting me down? I plan to try to talk to her about this week but i just want to ask whether anyone has experienced the mindfuckery of something like this.\n\nTldr: gf told me that she cares about me, but doesn’t love people like others do.",
        "created_utc": 1678675388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (23m) ask this girl (21f) who i'm pretty certain is interested in me out through text or wait till I have the chance in person?",
        "author": "nikberardi36",
        "url": "https://www.reddit.com/r/relationships/comments/11pxtvc/should_i_23m_ask_this_girl_21f_who_im_pretty/",
        "text": "[removed]",
        "created_utc": 1678675303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask this girl who i'm pretty certain is interested in me out through text or wait till I have the chance in person?",
        "author": "nikberardi36",
        "url": "https://www.reddit.com/r/relationships/comments/11pxscy/should_i_ask_this_girl_who_im_pretty_certain_is/",
        "text": "[removed]",
        "created_utc": 1678675190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living in the same house across multiple relationships",
        "author": "mediocretoast03",
        "url": "https://www.reddit.com/r/relationships/comments/11pxs9i/living_in_the_same_house_across_multiple/",
        "text": "So I just wanted to get some opinions about something that's been on my mind. I'm a 33m and am currently going through a divorce.  \n\nI've lived in my current house for 10.5 years now and it's a good home in a good location. It's an older house but in good shape and nothing really wrong with it. The best part is that my house payment is less than $500 a month. I bought the house while single, met and married my wife, and now in a divorce.\n\nBut throughout my marriage my wife would occasionally mention that she wanted a new house to \"make our own\". And we almost did at one point but a price increase and interest rate increase killed it for us. So I tried to help her by freshening up our home, which I did in a few rooms with new furniture and such. It was always a bit of a sore point though. I get where she is coming from on the emotional side, but the rational part of my brains says that we don't need a new house, and we would likely be tight on money if we did get one.\n\nIt's got me thinking though, moving forward. If I encounter someone like that again, am I being insensitive for not really wanting to move just for the sake of moving? It would have to make sense or serve a purpose for me to want to do that. And I most definitely wouldn't want to do it and be house poor.\n\nTLDR would it bother you that your SOs home was his previous marital home? And I don't want to move if I don't have, to because my payment is so cheap?",
        "created_utc": 1678675181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask this girl who i'm pretty certain is interested in me out through text or wait till I have the chance in person?",
        "author": "nikberardi36",
        "url": "https://www.reddit.com/r/relationships/comments/11pxrvq/should_i_ask_this_girl_who_im_pretty_certain_is/",
        "text": "[removed]",
        "created_utc": 1678675152,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up and have apologized several times but my boyfriend won't forgive me.",
        "author": "gojonumber1fan",
        "url": "https://www.reddit.com/r/relationships/comments/11pxrod/i_messed_up_and_have_apologized_several_times_but/",
        "text": "Hi, I just wanted to say thank you for taking your time to read this. I’m so sorry this post is quite long, so feel free to ask me any questions. I feel very lonely and hopeless right now, and I am in desperate need for help.\n\nMy boyfriend (23M) and I (21F) officially have been together for a month, known each other for 5 months so far. Ever since we became close, we started having little arguments mainly due to miscommunication/misinterpretations.\n\nLast night, we just had a major argument, resulting in him becoming really upset at me, which I deserve. We were having a conservation through text, and he randomly brought up about this nightclub. I told him how it’s funny because I just searched up that exact nightclub earlier yesterday. He asked me why I searched it up, and I said I just wanted to see what it looks inside. He said “No one looks up the inside of a club for no reason” and I replied “I look up random things okayy because I’ve never been there” He then kept asking me “But why? There’s always a reason” and then followed by “Do your friends want to go or smt?” And then I said “Well yeah my friends did mention they want to go with me sometime”\n\nHe then said “I knew someone asked!” And then he proceeded to ask me if I’m still going to this rave later this month. I told him “yeah maybe..”\nAnd then few conversations later, he straight up told me “Just be straight forward next time ‘maybe’ isn’t a yes or no to me and you saying just looking at a club for fun. 🤨”\n\nNow, he said this because he thinks no one looks up the club for no reason. He said “Like why couldn’t you just tell me your friends wanna go to the club? It’s not that hard.” And he told me I shouldn’t say “maybe” and should’ve said yes or not because he thinks I’m actually going to the rave, when in reality I’m actually still thinking about going so that’s why I said “maybe.”\n\nHe thinks I’m hiding something from him because I wasn’t being that clear twice in the row. I might admit it’s my fault for not clarifying it more with him because I did actually look up the club because my friends do want to go with me. But I looked up that club more specifically because I was randomly curious to see what it looks like, and I tried defending myself on that, but he just doesn’t seem to believe me on this.\n\nBecause of that, he thinks I seemed so afraid of telling him that. But I was also truthful about saying “maybe”about going to the rave. I just didn’t clarify the reason enough why I’m still thinking about going in the first place.\n\nHe got upset at me and I tried telling him “I’d never lie or hide from you. I was actually looking up photos of the club randomly for fun. For the rave, I said maybe I’m still actually thinking of going because our group isn’t big enough, and I really wanted you to come, that’s why I asked you to come. But I guess I’ll be more clear next time.”\nHe replied to that with “ “I guess” nice way to end it” , referring to how I wrote “I guess I’ll be more clear next time” in that text. And that’s all after that.\n\nI tried my best to communicate with him and clear more things up for him, but he was giving me dry responses. I kept apologizing and reassuring him that I’m being honest and I have nothing to hide from him and I’m not afraid to talk to him, over and over. I can honestly understand how he thought I was hiding something last night because I wasn’t being straightforward. But I also feel like he was being too hard on me last night.\n\nThis morning, I kept asking if we could call so we could talk about it and work on communicating more. He told me “No you did this to yourself, so not my fault” and “You keep saying we need to communicate better and it’s you that’s screwing up” and “I don’t need to hear you say sorry anymore”\n\nEventually I finally got him to call me and I tried apologizing again and explaining myself. But he gave me silent treatment for 10-15 mins and acted very upset and cold to me. He thinks I’m just repeating myself over and over again on what I’ve said on text beforehand, and how it’s a waste of time for him. He thinks I can’t change for what I did, and he doesn’t want to think anymore. I told him I’ll work on communicating better and he said “Whatever I hope so.”\n\nWe got silent after that and he said “So..are we done now?”. I asked him if he’s still upset with me and he kept dodging the question and he said he doesn’t want to talk about it anymore. We said our byes and he hung up really fast.\n\nI don’t know what to do. He hasn’t texted me since then. I promised to him I’ll work on communicating better. I don’t want to be a bad girlfriend to him or someone that would just apologize for their behavior then turn around and do it again. I really did mean it when I apologized and I take responsibility of my actions and I saw how deeply it upset him. I should’ve been more clear with him.\n\nI feel like this is completely my fault because we keep telling each other to communicate with each other well, but yet, we always end up in an argument. He’s generally a very caring and loving person and loves me very much and is willing to work things out with me, no matter how bad it gets. But I don’t know how I feel about last night. He’s so upset with me and wouldn’t talk to me. I really want to make this relationship work and I am really willing to do whatever it takes. I don’t want this relationship to turn out unhealthy, especially since we’ve been dating for only a month and we already started arguing.\n\nKeep in mind, we constantly text each other throughout the day. More than we facetime/call each other. I tried telling him texting isn’t the same as talking face-to-face in person, so it’s hard to tell through texting and it could result in a lot of misinterpretations. \n\nI know I can’t keep begging someone to forgive me or else it’d drive them away more, so should I just give him space?\n\nTL;DR I didn’t communicate well with my boyfriend and have apologized to him several times, but he won’t forgive me.",
        "created_utc": 1678675136,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up and have apologized several times but my boyfriend won't forgive me.",
        "author": "gojonumber1fan",
        "url": "https://www.reddit.com/r/relationships/comments/11pxq8t/i_messed_up_and_have_apologized_several_times_but/",
        "text": "[removed]",
        "created_utc": 1678675022,
        "upvote_ratio": 1.0
    }
]