[
    {
        "title": "My gf doesn't want to talk to me.",
        "author": "Dragonpriestt",
        "url": "https://www.reddit.com/r/relationships/comments/11s3qld/my_gf_doesnt_want_to_talk_to_me/",
        "text": "[removed]",
        "created_utc": 1678902659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel bad when talking intimately",
        "author": "ThrowRAlonelyeyes",
        "url": "https://www.reddit.com/r/relationships/comments/11s3j3t/why_do_i_feel_bad_when_talking_intimately/",
        "text": "TL;DR: I feel used when talking sexily?\n\nI (f19) have recently started talking to (m23) I like him alot and he likes me too. We’ve been getting to know each other more and he’s very kind, sometimes when he tries to talk to me more seductively it makes me feel gross almost as if it’s all he wants. He’s expressed interest in me and my life and only just started talking this way so why do I feel like this? We’ve not met yet as I’ve got extreme anxiety and it’s difficult for me when meeting people, I’m concerned I’ll always feel like this?",
        "created_utc": 1678902223,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend of 5 years made really weird comments to my friend. Please see below for details",
        "author": "Lucky_Thought_177",
        "url": "https://www.reddit.com/r/relationships/comments/11s3iy3/my_boyfriend_of_5_years_made_really_weird/",
        "text": "[removed]",
        "created_utc": 1678902213,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend 26M and I, 24 F have been together for 5 years, he made really weird comments to my friend 23 F the other night. Please see details below.",
        "author": "Lucky_Thought_177",
        "url": "https://www.reddit.com/r/relationships/comments/11s3h02/my_boyfriend_26m_and_i_24_f_have_been_together/",
        "text": "[removed]",
        "created_utc": 1678902092,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend 26M has been with me 24F for 5 years, he made really weird comments to my friend 23F. I’m not sure if I’m misunderstanding or if I want to but it does not seem right, please give your honest opinion. See below for details",
        "author": "Lucky_Thought_177",
        "url": "https://www.reddit.com/r/relationships/comments/11s3d9r/my_boyfriend_26m_has_been_with_me_24f_for_5_years/",
        "text": "[removed]",
        "created_utc": 1678901868,
        "upvote_ratio": 1.0
    },
    {
        "title": "do I breakup with my boyfriend of 5 years",
        "author": "MarieIrelandRN",
        "url": "https://www.reddit.com/r/relationships/comments/11s38v0/do_i_breakup_with_my_boyfriend_of_5_years/",
        "text": "TLDR: my boyfriend used to be a great boyfriend and now he seems to care very little and put in little effort as we get older. I expected the opposite to happen and now I am confused when I should walk away. \n\nbuckle yourselves up because this post will likely be long. I hope you stay to listen as I could really use a variety of opinions on it.\n\nBackstory: He and I met when we were both 19 and went to the UMichigan. I am now 25 and hes 24 turning 25 in a month. At first, I was still in love with my ex and wasn't sure how I felt about my current boyfriend- A. After about 5 months we entered into a relationship. We really had about 0 conflicts in the first two years. A got me gifts with thought, flowers on valentines day and took me out to dinner at least 1x a month (keep in mind we were in college). After school, he even drove home with me during the pandemic so I wouldn't have to make the 12 hour drive by myself. I remember our time during the pandemic as the most blissful time in our relationship. Frequently we discussed our hopes and dreams for our future together- a house, kids, pets- we really got down to detail. We had lengthy romantic discussions about these things and I felt very secure and safe in our relationship. I was certain we would get married and last forever.\n\ntwo more years after that I am now the most uncertain I have ever been about A. About a year after college ended I moved to his city to begin a master's program and start our lives in the same city. A year after that, we moved in together. Now this brings us to present day.\n\nTo recap the last year I have spent in this relationship I will begin by saying I feel that A has changed a lot. I am not sure why and I have had many conversations with him to address this, but without any real change. I just dont feel as loved, taken care of , or celebrated anymore. There are some specific things that bother me that have changed in the past year that I will list below:\n\n\\- we used to have sex about every night or every other night sometimes twice a day for 4 years. Now, about a year ago the frequency declined when I moved to his city and again when I moved in. Now we have sex about 1x per week sometimes 2x. Its never spontaneous, fun or exciting. I never feel sexy no matter how much I dress up, do my hair, or makeup. I bought toys, lingerie, etc to spice things up and it worked at first and now it just feels like a joke. I would embarrass myself if I climbed on top of him in lingerie. When I bring this up this is what he says \"I never noticed, I love having sex with you, nothing is wrong\" I try initiating by touching him kissing him straddling his lap- none of it works and then if i bring it up he says he \"didnt notice that was what I was trying to do\" even though its what ive done for 5 years and worked for the last 4 years.\n\n\\- He makes tons of plans with his friends to do fun things but not me. He often goes to golf with friends, play poker, workout, go to the range, etc with his friends. Ive asked if we can do things together and he put up a lot of barriers such as money (kid makes 240k a year) and saying that he \"cant think of things to do all the time\" it was only when I started crying that I felt like he fully grasped why I was hurt. His side of the story is that we live together and see each other all the time at night watching tv together and he wants to get out of the house after work. I also want to do that and dont consider watching tv and playing on our phones quality time.\n\n\\- my birthday was in december and he still hasn't gotten me a christmas gift or bday gift. For context, I asked for ski lift tickets totaling about 500 dollars for both bday and xmas. He makes 240k and I make 0 as I am in school. For his birthday I bought him 240 dollar golf shoes. Our ski trip fell through in last Jan and we scrapped the gift idea. I have not bought his xmas gift bc he wants sneakers and wants to pick them out himself- I have reminded him 5 times, asked him to pick them out, offered to go with him, or purchase a gift card for him to do. He still hasn't. Its now march 15th and I haven't received a bday gift or xmas gift. I brought this up he said I was overreacting bc its only been 6 weeks since the trip was cancelled. He wants to get me a golf bag for both xmas and birthday that costs 225 dollars (less than I spent on his bday gift alone) and for me to get him running sneakers for christmas. This rubs me the wrong way bc I feel like he should be driving this plan and should be taking action. It makes me sad that he forgot about my birthday and wont really spend money on me despite making 240k a year and spending about 300 dollars a week on himself for fun. It also rubs me the wrong way that he makes much more than me yet I spend more money than him on gifts.\n\n\\- I did not receive flowers or a gift for valentines day. We rescheduled dinner due to my class schedule and we ended up going to dinner friday coming home, no sex. I went to bed. He played fifa and stayed up.\n\n\\- He does not bring up the future anymore, does not give me compliments, does not recognize when I do my hair, makeup etc. He says he's still invested in a future, wants a future, and loves me more than ever, but does nothing to show it. It makes me sad and Ive addressed this with him. I noticed he checks out other girls a lot when we are out in public and I never catch him checking me out anymore even when Im naked. He used to touch me all the time, remark on how beautiful he thought I was, etc\n\n\\-All of these issues Ive brought up probs once a month or every 6 weeks and nothing has even gotten slightly better. At this point, I think I sound like a broken record and Im scared Im teaching him that I wont leave even if Im unhappy. Im so conflicted because he used to be a great boyfriend and now he is not so I know he is capable of it.\n\n\\- I still do quite a bit to make him feel loved. I put away his laundry if Im already doing mine, I cook dinner, make him bfast if im home that day while Im making mine, bring him coffee, leave him love notes on his computer, text him randomly to remember some piece of history we share that is particularly sweet like when he sent me flowers after I got surgery during year 1 of our relationship. He reciprocates none of this.\n\n\\-Ive addressed his mental health which he says is doing great lately, his physical is totally normal, he had labs to check testosterone recently and they were normal\n\nAt what point do I leave this relationship? if theres any more information you want or need let me know. I just really need the advice.",
        "created_utc": 1678901607,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (M17) losing my Girlfriend (F16) and I can't handle it",
        "author": "Weak_Consequence_289",
        "url": "https://www.reddit.com/r/relationships/comments/11s3747/im_m17_losing_my_girlfriend_f16_and_i_cant_handle/",
        "text": "[removed]",
        "created_utc": 1678901508,
        "upvote_ratio": 1.0
    },
    {
        "title": "I recently found out my best friends/crush of 5 years lied about caring about me",
        "author": "Tough-Equivalent-376",
        "url": "https://www.reddit.com/r/relationships/comments/11s36kd/i_recently_found_out_my_best_friendscrush_of_5/",
        "text": "[removed]",
        "created_utc": 1678901476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I breakup with my boyfriend of 5 years",
        "author": "MarieIrelandRN",
        "url": "https://www.reddit.com/r/relationships/comments/11s34b5/do_i_breakup_with_my_boyfriend_of_5_years/",
        "text": "[removed]",
        "created_utc": 1678901351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bf blocked me from seeing his insta story",
        "author": "problemativ",
        "url": "https://www.reddit.com/r/relationships/comments/11s3345/bf_blocked_me_from_seeing_his_insta_story/",
        "text": "My (f26) bf(22) flew to another country today to visit his friends. They are also planning to party. He is staying there for 5 days. We have been together for only three months. There were no red flags so far and he has been nothing but great. \n\nI was wondering why he hasn’t posted anything yet as he is someone who posts insta stories quiet frequently. \nI have a second anonymous account and looked at his profile. I was shocked. I could see that he already posted stories. \n\nWith my normal account I could not see it. I don’t know whether he has blocked me from his stories before or now that he is going away. His account is not private so it’s not like I would not notice and some of my friends are also following him. \n\nDid he block me so I don’t see what he is doing there? I don’t mind him partying or anything. I am very confused… \nShould I confront him now or when he comes back? How should I approach him? I don’t want to seem crazy. \n\nTL;DR! Bf blocked me from seeing his insta stories while being on a trip to visit his friends. I am confused and sad and need advice on how to approach this situation.",
        "created_utc": 1678901276,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (M17) losing my Girlfriend (F16) and I can't handle it",
        "author": "Weak_Consequence_289",
        "url": "https://www.reddit.com/r/relationships/comments/11s2qcc/im_m17_losing_my_girlfriend_f16_and_i_cant_handle/",
        "text": " \n\nHello, this is going to be long and I want to apologise in advance for this and I also want to ask you to read it all the way through and thank you if you do.\n\nMy Girlfriend confessed to me last night that she doesn't think that she loves me anymore and that she has wanted to break up for a while, she also told me that she doesn't find me attractive anymore. This has broken me and I am currently at the lowest point that I have ever been and I need you all to help me as best you can.\n\nMy Girlfriend has always been a fiery and strong willed Individual, so much so that I had to fight to get certain things to change that she did during our Relationship because they seriously bothered me and affected me mentally. Things like how she sleeps nude in a house where her entire family walks into her room whenever they want at any time and pull the covers off of her and walk in on her changing clothes without intention to do so but nonetheless it has happened.\n\nDuring our Relationship we have had arguments and fights about many things. I made her sleep in at-least her bra and pants, I made her wrap her towel around her completely whenever she got out of the shower as she would crookedly hold the towel over her back which left her entire front exposed and she would walk around like that. I made her understand that I will never permit her to have Guy friends because I know of their nature and what would most likely happen between them. I also made her stop using TikTok because of the amount of Pornographic Content on there that would appear on both mine and her FYP's, we both stopped using it.\n\nI have always been Insecure about myself and my body and due to this Insecurity I have made Rules but I have always made sure to not be extreme and try to make things as easy for her, but she has told me how she hates not having her freedom and said that she's sick of it. At first when she originally told me this I made changes and tried to be more lenient but asked her to be respectful of me and how I feel which she pretty much didn't and it really fucked me up.\n\nShe would play video games where Individuals would sexually harass her and she wouldn't do anything about it, she would constantly talk to weird people in Voice Chat and I even caught her being sexual with another person when she didn't know I was watching which really fucked me up.\n\nWe haven't actually broken up yet, last night she told me that she wants to break up and be single again and to which I asked if we could try and change things up to see if there's still things left because if it's going to end with her leaving me then I want to try regardless and she responded saying she's not sure. Then we proceeded to get in bed and we said Goodnight to each other and we said I love you to each other and we slept. Then we woke up this morning we spoke about her gerbil and a little playground box she made for him which she seemed happy during and then when she left for college we said I love you to each other once on call and three times in text. I'm not sure what to do or think and I'm petrified of losing her.\n\nPlease can you all help me out, I poured my soul into our relationship and losing her would be the worst thing imaginable for me right now. Please give me your advice and thank you for reading.\n\nTL;DR I'm (M17) losing my Girlfriend (F16) and I can't handle it",
        "created_utc": 1678900511,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (29M) haven't talked to my best friend (33M) in almost 6 months",
        "author": "ThrowRA227123",
        "url": "https://www.reddit.com/r/relationships/comments/11s2pd8/i_29m_havent_talked_to_my_best_friend_33m_in/",
        "text": "To preface, we met at my hometown bar (5 years ago) when I moved back in with my parents after my divorce and hit it off pretty quickly due to similar interests in comedy and music tastes\n\nWe would party, take vacations, go to music festivals, or just kick back on the couch and watch a movie together for the better half of that 5 years\nP even hosted my birthday party at his house once\n\nP was always a good friend to me, maybe a little rowdy and loud when he was drunk (think of the series 'jackass' style antics)\n\nP has been a bachelor almost the entire time I've known him, always talking and taking out different girls until he met his now gf(27F) H, but would always make sly remarks when she wasn't around about how he was 'still on tinder' or 'was flirting with some girl at the bar last night'\nI often wondered if this was true or if he was just stroking his own ego, but me and my new girlfriend(27F) T always kind of brushed it off as not being very serious\n\nThere were a few instances after September of 2021 and leading up to this that kind of shed some light on what P's true colors may be (being an asshole bully at the bar, punching and breaking the mirror on our other buddies truck, drunk wrestling matches with people he would start, getting drunk and telling us the same stories an abundance of times about what he did in middle school, telling a few white lies to his gf, and much of my exteneded friend group becoming fed up woth him because in their words 'hes like a high schooler who never grew up') but I always chalked it up to him having a few to many beers (the over drinking was a common occurrence for him, not to say we all weren't drinking more than we should have for a period of time), plus he never did much of this to me, so I guess it never really sunk in until after the fact of what I'm about to recount to you\n\nThen one day in Oct 2022, I get out of the dentist office T works at to get a call from my H\nI text my gf whats going on because she's on break at this point and she comes out to my car to get on the call back to H\nH is crying, and is asking me if I dated a girl (32F) K (whom I did date between my divorce and my now gf T)\nI confirm and H tells me K sent her a bunch of screenshots from tinder and snapchat between them and P about meeting up (specifically at times when H was working) as well as some sexually explicit messages between to two (this is before K's knowledge of P being in a relationship)\nWhile I'm on the phone with H, P sends me a text saying that K got some messages from him on tinder and sent them to H, but his account has been deleted for awhile now and everything 'is all fucked up'\nObviously me and H both know he's lying because no one is about to make a fake tinder AND snapchat just to try to get with some girls\n\nFast forward to when P gets off work and goes home to H, (these events were described to me and T by H a day or 2 later) and P is basically trying to explain everything away or say someone is impersonating him and he would never do that, until H finally gets him to confess\nH moves out of P's place, getting her head straight about the situation because obviously she is crushed\nAll the while he is trying to get ahold of me every few days to talk to me about what happened, but at this point I'm also pretty bummed and don't really wanna hear it because\nA) getting with your best friends ex is a huge breaking of bro code\nB) me and T both really like H as well as out extended friend group, and we think what he did was totally wrong\nC) you tried to lie your way out of it not only to H, but to me as well, so obviously you knew you had something to hide\n\nFast forward a few weeks and H decides to take P back and moves back in with him,, and from there that is their buisness not mine\nI'm still not returning P's calls or texts because I feel extremely betrayed. I end up hearing thru the grapevine that he says 'he didn't realize I had dated K' when they had met and we had hung out at the bar together multiple times, so in my head it's just another attempt to explain everything away\nI've heard from another friend that was on the phone with him a week later, P tried to say that 'I wasn't gonna do anything, I was just flirting' but me and my other friend both agree that the only reason nothing happened was because he got caught\n\nWe have exchanged a few memes here and there since then (he is the only one who would understand the humor of some things i find funny), and at this point if I saw him in public I would be cordial with him, maybe even have a beer, but I'm not sure I ever want to hear what he has to say because I'm not even sure I can trust him anymore as a close friend. I feel very hurt by what he did. I've spent my whole life being a 'push over nice guy' but something inside me seemed to snap with this, and I've hit a point where I believe people need realize the consequences of their actions and how they affect people as well as themselves\n\nT thinks I should forgive him since some time has passed (its been almost 6 months since i last had a real convo with him), but I'm not sure I'm ready to, or ever will be ready to, as well considering the fact my life hasn't even skipped a beat since I stopped talking to him, I don't know if that will ever happen\nDo you think a second chance makes sense? Should I even hear him out?\n\nTLDR\nMy best friend cheated on his girlfriend with my ex, then tried to lie it away to everyone until the truth came out and I feel betrayed on multiple levels",
        "created_utc": 1678900453,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [20s M] boyfriend [20s M] keeps hinting at a proposal and not following through. It’s making me lose my mind!",
        "author": "MajesticProduct5978",
        "url": "https://www.reddit.com/r/relationships/comments/11s2mqp/my_20s_m_boyfriend_20s_m_keeps_hinting_at_a/",
        "text": "My boyfriend and I have been together for just over 7 years. My family and friends all love him, and we have had a pretty good relationship and understand each other well.\n\nWe both know that a lot of other gay men have reasons to not want to be married, but I’ve always wanted to get married, and he has too. \n\nHe always said that he would want to live with someone first, which I always thought made sense. We bought a house together in 2021. \n\nHe then said that he wanted to wait until my sister was married in May 2022 before we got engaged. Towards the end of that May he told me he had bought a ring. The ring box is on his desk and I can see it literally every day.\n\nLast June while on a road trip with my sister, her husband and our friends, my boyfriend told me, “I’m packing the ring in my backpack, I think this weekend would be a nice chance to pop the question.” The weekend went past and he didn’t propose. I didn’t want to say anything because I had a really nice time on the trip and didn’t want to make the memory of it weird. \n\n2 months later in August, I finally broke and asked him why he changed his mind without saying anything. He said he couldn’t find a right time to do it, which I thought was strange considering we went out for fancy dinners twice and had a sunset picnic on the beach. He said he had made plans to propose soon.\n\nIn November, I reminded him about what he said in August, and he said that he planned to propose one weekend in the summer, but it rained. He said he knew it was beginning to stress me out, but that I shouldn’t worry and it’ll happen soon.\n\nIn late Feb, after still nothing, I told him that I don’t think he meant to upset me, but telling me in May that he had bought a ring, having it pretty much on display in our house, but never proposing after repeatedly saying he would, was beginning to really get to me. He said he understood my feelings, but that was all he really said. Since then we’ve definitely argued a lot more.\n\nI just don’t know where to go from here. I feel like if he does eventually propose, it’s just going to be because I’ve nagged him into!! I just really don’t know what to do, I love him and want us to be happy together, but part of me questions what kind of person would keep hinting an upcoming proposal but then not follow through. I’m growing resentful honestly. What conversation do we need to have so this doesn’t ruin our relationship?\n\n*tl;dr boyfriend told me he bought an engagement ring last year, keeps hinting a proposal is incoming but never follows through. I now feel we argue a lot more and now I don’t know what to do.*",
        "created_utc": 1678900288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does marriage still make sense?",
        "author": "languageanalyst",
        "url": "https://www.reddit.com/r/relationships/comments/11s2mki/does_marriage_still_make_sense/",
        "text": "[removed]",
        "created_utc": 1678900277,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (19F) bf (22M) feels I’m stringing him along",
        "author": "No_Fox_5012",
        "url": "https://www.reddit.com/r/relationships/comments/11s2j44/my_19f_bf_22m_feels_im_stringing_him_along/",
        "text": "I (19F) and my bf (22M) have been together for a year, and everything has been going well … until I brought up the idea of going traveling for 4-6 months. \n\nI’m a person that loves to travel and explore and he knew that when we got together but it has never been a problem until now. \n\nI brought it up in conversation after some close work colleagues moved to Australia for a few months and just said how I would love to do that too. At first it was just a crazy idea but the more I thought about it the more it became a realistic idea. \n\nI asked him if he would like to go traveling with me and he said no. I asked him if he wanted to try long distance while I was travelling and he said no. I then asked him if he would like to come out and visit me while I was travelling (say in Europe where flights are cheeper) and he said no. I said to him that he was leaving no other option than for us to go on a break while I’m away and revisit the relationship when I’m back, split up altogether or for me to not go travelling at all. \n\nI had talked to my close friends about the idea of going travelling and 2 of them are 100% in but I would have to wait until they finished university in 3 years time. \n\nWe got in a big flight about it where he told me he feels like I’m stringing him along until I go traveling and we’ll break up. I feel like I’ve given him every option available so that we can stay together and I can still travel and he’s not happy with any suggestion I make. \n\nA couple weeks later he tells me that he wants an open relationship so that he can see other girls to “get over me quicker when I inevitably breakup with him to go traveling”. I hesitantly agreed after he pinky promised it wasn’t a test and this is what he really wanted and he set up dating profiles for us both. Within 2 days I had 23 matches and was talking a few guys and he had no matches. He saw me texting one of the guys and accused me of cheating and that it was all a test to see if I really loved him. I brought up that he promised it wasn’t a test and the only reason I agreed was to make him happy to save us in the long run. \n\nAll of this has happened because I want to go traveling and live life to the fullest. I love this man and truly believe I could marry him one day so I don’t want to ruin our relationship. However, it is important to me that I can have the freedom to go traveling while I’m young so I don’t have any regrets. \n\nTL;DR I want to go travelling and have offered my (22M) bf options to stay together which he has declined and says I’m stringing him along. He then asked for an open relationship to make it easier for him if we break up then accused me of cheating when I was talking to a guy. Should I still go traveling when it could ruin out relationships altogether?",
        "created_utc": 1678900069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Already questioning relationship 5 months in",
        "author": "Anonomouslyalcoholic",
        "url": "https://www.reddit.com/r/relationships/comments/11s2j3b/already_questioning_relationship_5_months_in/",
        "text": "I’m (26f) having serious doubts about my relationship w (31m) and wondering if we moved too fast. My boyfriend has been great, treats me really well, caring. But there’s some stuff I feel like is gonna get in the way long term…he travels a ton for work &amp; idk if I’m comfortable with being alone so much. He dismisses my concerns saying he’ll spend time with me when he is around.\n\nHe also wants to move to another state asap, which being alone would make even worse: I also feel like a big motivation for me being with him is because I want to move out of my crazy parents house. I’ve heard if there’s problems in the beginning it will only get worse. \n\nBut I also feel like if I end this I’ll never meet someone else who treats me well and cares. And I want it to work out, but I’m having serious doubts. But every time I tell him my concerns he just tries to make up ways to make me feel better. How do I figure this out?\n\n(Tl;dr) Serious doubts in semi-new relationship. Bf wants to move far away but travels for work and I’d be alone which is my main concern",
        "created_utc": 1678900067,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23F) don’t know how to integrate my (23M) fiancé into my social life",
        "author": "ThrowRa122344338919",
        "url": "https://www.reddit.com/r/relationships/comments/11s2bht/i_23f_dont_know_how_to_integrate_my_23m_fiancé/",
        "text": "\n\nThis is going to be a long story with so many red flags but I don’t know if this is healthy anymore. \n\nMy fiancé and I have been experiencing some issues with me expressing how to show affection in a way that will soothe their insecurities. I haven’t introduced my fiancé to that many people in my life we have only been together for under a year. We have known each other online for about four years now.\n\nWhen I first was going to introduce him to a very special friend of mine which I’d been planning for 4 months…he tried to bring a girl he met that week off of a hookup app when we were still dating… already dating. The girl looked exactly like me just with tattoos and piercings. Of course I was furious and my fiancé didn’t end up meeting my friend.. he doesn’t know that I know he has cheated more than once. (Sexually and emotionally). that was the last time I seriously was trying to have him meet someone important to me. That entire thing was humiliating and embarrassing. Why did my fiancé do that?? To get back at me because he was jealous that I was talking to a guy at a bar WHO I was acquainted with and my friend wanted to hookup with them. Leaving me at the bar without saying anything was enough… redownloading a hookup app for him had to be the next step. \n\nSoon after it came to light he was cheating ( he only knows I know about the one time) on me… I looked at the time stamps and he was sending explicit messages to another girl he met off the same hookup app…while I was crying and apologizing to him on the phone for bringing it back up that downloading that app hurt my feelings. Boy has a private snap story and he doesn’t know I know that. He finished a bottle of alcohol that night and claimed he didn’t remember sexting this other girl and I’ve heard 3+ excuses on why this happened. My parents are dead and I have no family that lives in my state or nearby states. When all of this happened I reached out to my siblings spilling everything.. they told me to dump him of course. They don’t like him and my brothers don’t approve of our engagement.This is the first time I haven’t dumped someone for cheating on me. I mended my trust issues with this part. I’m not checking his phone or socials for evidence ect. This only happened 6 months ago. My fiancé swears up and down that he doesn’t remember cheating on me, I don’t believe it but I definitely think he regrets it. \n\nI have a hard time keeping friends and I maybe played up that I have a bigger social life than what I actually have. I only have 2 close friends at this point and one is dying from cancer. He’s met 2 of 3 my friends.. my other friend has no interest in meeting my fiancé.. when I found out about the cheating my bestie ubered across state lines to come get me and drove my car back to the apartment at 11pm that night. I was too much of an emotional wreck. I live with my bestie. I don’t talk about my fiancé in front of them just because I know they aren’t the biggest fan. My best friend is not allowed over to our apartment once him and I move in together. I know this will cause This is my partner’s rule. I know once we move in together I probably won’t see my bestie again.. I don’t have my fiancé over at my place often because A) my place is really messy and past trauma history with that B) my best friend hates them for cheating on me and I’m scared of confrontation. I know there will be confrontation. \n\n\nI’ve met everyone in my fiancé’s inner circle and they’re also close with their family. I maybe check in on my siblings once per season but I don’t really talk to anyone on either side of the family.. last time I saw them it was at my parent’s funeral. My fiancé has been making it a point to meet my family but I don’t even picture any of them traveling to come visit or see me. They’ve never brought it up or mentioned it before let alone to meet my fiancé. I’m not that close with my family at all and definitely no where near buying birthday presents or sending cards to each other ect. \n\nI know my red flag is letting people revolve in and out of my life so often. He gets confused on who am I friends with and how do I know certain people. I don’t tell my friends anymore about our relationship issues because it causes him anxiety and they grow to resent my partner. I talk about it with my therapist but I have a hard time empathizing and sympathizing with his concerns on why he hasn’t met any of my friends. one friend he did meet he doesn’t like. Will make comments about her sexual activity when she has a body county of 1 and he’s over 35. \n\nHe has asked for my ring back over three times. He has commented that maybe we should break up if I was still sad about him cheating on me. Not angry just sad. That was a week after he cheated on me.. one time I called him out on his bluff and I handed back the ring. To be clear I’ve been more faithful than him in this relationship yet I have less insecurities. I don’t get jealous or worried. I don’t post him a lot by himself like appreciation posts ect on my socials but I do post group pics of us. He does post a lot of appreciation posts of me and to be honest I don’t like it.. makes me feel like a trophy, which I know isn’t the intention. I don’t know how to get over that feeling. \n\nTo be clear I do love him and ideally I don’t want to break up I just don’t know if I should keep trying and these are fixable issues. I don’t know where to begin. I don’t know how to form a better relationship with my family so my fiancé could meet them when I feel like no one in my family actually takes interest in who I am and what I’m doing in my life. I’m not ready to open up to them so he can ease his insecurity that I’m hiding him. All my life it was just me, my mom and my dad and now they’re dead. This relationship is definitely a piece of work. whenever he brings this up to me I just get really quiet because I don’t know what to say. I don’t have friends like him. I don’t have friends that check up on me every single day. I don’t have friends that care about me, the way that his friends care about him. I don’t have a family group chat. I don’t get random calls or texts from family trying to check up on me. I don’t have the stable long term relationships he has in his life and I don’t know how to tell him that. \n\nTL;DR! - He cheated early on, wants to meet a inner circle of mine that I don’t have, he thinks I’m trying to hide him when I just don’t have anyone. Someone please help. Are there really no solutions to keep this relationship together? Couple’s counseling is not an option for us at this moment.",
        "created_utc": 1678899622,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) mother (41F) likes my boyfriend (18M) a little too much",
        "author": "NoThing8696",
        "url": "https://www.reddit.com/r/relationships/comments/11s2awy/my_18f_mother_41f_likes_my_boyfriend_18m_a_little/",
        "text": "TLDR; My mother has constantly called my boyfriend’s accent “sexy,” always wants to smoke with him, says she would leave her husband for someone like him, and has been pushing my boundaries very far. Is this normal? Does she just want me to be with a good, attractive man? \n\nThis may seem like an odd issue but I NEED an answer. My mother has been pushing boundaries a bit far with my boyfriend. For background my boyfriend is from England—where we live in the United States, and we’ve been together for 2 years. He has visited once for a month and a half but is coming again for 3 months in April. My mother has been with her current husband for around 9 years. I haven’t had the best relationship with her, she’s very emotionally distant but everything changed when my boyfriend first met her on a call.\n\nShe has constantly told me I’m lucky to be with someone like him (keep in mind she doesn’t know him PERSONALLY) all she knows is he’s british and he works. She has mentioned to me after he left from his first visit, that if she was single then she’d go on a british dating site and has called him accident “attractive” and “sexy” multiple times to me and her friends—which they shared my slight disgust. \n\nWhen he was here for a month, she constantly wanted to smoke weed with him, not asking me, but directly asking him constantly and I just followed. I don’t enjoy smoking, so i’d sit on the sidelines. The one time she got him blasted, she started asking him personal questions about our sex life, we were 17 at the time. I stopped her from asking as it was clearly making him uncomfortable. \n\nShe has also acted very childish with him when he made a light-hearted joke about buying her alcohol (since she had him drink some and the bottle was nearly gone). She took this as him calling her an alcoholic and started ‘whining’ to him about apologizing. \n\nOne more mention, she has repeatedly joked about replacing me with him, and wanting to adopt him. And has told me she has had dreams about him and I.\n\nIs this normal?? Am I overreacting with her behavior? I feel overall dismissed with both of them.",
        "created_utc": 1678899590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mid 30s f, mid 30s m and the kitchen",
        "author": "confusedgf48562",
        "url": "https://www.reddit.com/r/relationships/comments/11s2ac1/mid_30s_f_mid_30s_m_and_the_kitchen/",
        "text": "I need help understanding what is going on. Due to circumstances, he always comes to my place for now. That will change within a couple months. My kitchen is very small and two people cannot work in it.\n\nThree weeks ago he asked if I would like him to cook breakfast. I said yes I'd love that. I was overjoyed. I'd been doing all the work and I get it, it isn't his kitchen, not used to it, can be awkward, etc. So I was excited that he felt comfortable enough.\n\nNext weekend, I made dinner Saturday and cleaned up. Had sex. Looking forward to breakfast. In the morning, I gave him a bj and then he says he's hungry and asks for breakfast. I feel sad, but ok. So I made breakfast again. I also make dinner. I clean everything up. I talk with him about it, he says he messed up, he doesn't know my kitchen, etc. I say ok. I figure he will make up for it next week.\n\nThe next weekend (this past), I had bought a mini coffee maker so he can have coffee at my house. I don't drink it unless at work. I give him a bj, he falls back to sleep, and I get up, get him his orange juice and coffee, clean up the kitchen, and make breakfast since hes still sleeping. I clean the kitchen again. We go out for a hike, come back, he says he is hungry. We throw together a cheese and crackers and salami board while I cook dinner. He doesn't touch the dishes in the sink.\n\nWe take a nap. I tickled him once he got up. He says I am mean and that I'm a jerk. I get really sad. I did all of this for him, and one instance of me tickling less than two seconds and that was the response I got. I started to cry, I didn't want to part ways this way. He said I could come over. I said OK. Sex that night.\n\nI give him a bj that morning (it's now Monday, we work nights), and he gets up and makes me pancakes and bacon while I do the dishes.\n\nI talked with him about what had upset me, why I was crying. Apparently to him he thought everything was fine and now it wasn't and things are awkward, as if the problem is that things are awkward, not that hes not holding up his part of chores. I said, when I come over, I do the dishes while you cook so you don't end up with a giant mess. He said but I didn't ask for that. I asked should I be asking for you to do the dishes every time I cook? He said yes. I said OK, it's hard for me to ask for help because of my past. It just works better if you step in without me asking because it makes me feel like a nag. And I felt awful for being called a jerk when I'm not asking to have an orgasm each time we have sex, I'm letting you just enjoy it and I'm enjoying you enjoy it, but I'm cooking and cleaning every single time you're over, but I clean up over there, somehow I'm the jerk? He said he felt bad after he called me that. I don't know why he wouldn't just apologize if he felt bad immediately after having done it.\n\nHe says it will be easier if/once we move in, but the point of living separately is to make sure there is mutual respect and things are working relatively well. So far I'm just bending over backwards. I want more. I want to be treated well, not like a bangmaid and a sugarmomma that pays for everything.\n\nSo that's where we are. I don't know what to call this behavior on either of our parts? I just need him to step up. I don't know why this is so hard. But it always happens this way, I want help and I'm eventually called a nag by some guy who wont step up. I just want a good, loving relationship. And breakfast. And not having a billion dirty dishes constantly in my tiny kitchen.\n\nWe have been friends for one year, in a relationship since mid february.\n\nTl;dr how to manage a relationship where we are always at my place and literally everything is on me, even him telling me that i need to tell him what i need when to me its painfully obvious. Why am I having to do everything???",
        "created_utc": 1678899554,
        "upvote_ratio": 1.0
    },
    {
        "title": "ex-GF's (19F) best friend, who liked me (19M) before, stopped at nothing to break us up after getting us together and labeled me a toxic person and ruined many of my other friendships and connections in order to do so.",
        "author": "BrokeTheDirector",
        "url": "https://www.reddit.com/r/relationships/comments/11s2a90/exgfs_19f_best_friend_who_liked_me_19m_before/",
        "text": "we are all college freshmen who knew each other in high school. my GF and i got together late senior year after her best friend got us together almost singlehandedly. her best friend did have a crush on me for a long, long time, and for some reason she decided to play matchmaker with us and my ex-gf. it was an absolutely beautiful relationship for the summer and the fall of starting college, and i will always be forever grateful for what was provided for me from her best friend.\n\nhowever, something switched inside her during this winter. my girlfriend told me that her friend group , lead by her best friend, had an intervention in which they sat my at-the-time girlfriend down and told her they think i am a toxic, manipulative person who is manipulating her every day in order to make her addicted to me. i am fundamentally incapable of doing this. when my GF would defend me, they would only double down and say she has been manipulated even more. every time my GF would have a conversation with either me or her friend group about the relationship, my GF would be convinced of their side. it was an absolutely cold war shitshow that I couldn't escape. we ended up breaking up because of the sheer mental anguish that was put on her because of this.\n\ni've come to discover that her best friend has gone on to make every single person who knows the both of us to absolutely hate me. many people that i knew from high school will not talk to me anymore. connections i had are now gone. almost all of our mutual friends have gone to her side and now i am virtually alone. my ex-gfs best friend was an very influential person in the circles i ran in, and she used to influence to absolutely crush me like a bug. i have given up in fighting this war, and i know am i am only feeling but a faction of the pain that my ex-GF may have felt during all of this. her friend stopped at nothing to absolutely. fucking. ruin. me.\n\nso now i am left here wondering; why? why did her friend put so much effort into absolutely ruining me? was i truly manipulative and toxic as she would claim? is this a jealousy complex? did she feel that since she started the relationship, she can end it? it is important to say that my GFs friend has never been in a relationship before.\n\nTL;DR: my ex-girlfriends best friend convinced all of our mutual friends that I am a toxic, manipulative person, and now i have lost countless friends.",
        "created_utc": 1678899549,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F28) want to give a guy (M27) that works at a local shop a note with my number on it, is this a bad approach? Is there a better approach I could take?",
        "author": "jmp3-07",
        "url": "https://www.reddit.com/r/relationships/comments/11s29as/i_f28_want_to_give_a_guy_m27_that_works_at_a/",
        "text": " (just a quick note, I have posted this on another subreddit, but I am really trying to evaluate all perspectives so I will post it here as well.\n\nHello everyone,\n\nfirst things first, I know this is usually a big no-no, but please read on and let me know what you think.\n\nI (F28) want to give my number to a guy (looks to be around the same age as me) at a local cannabis shop. I've never seen him outside of his work, otherwise I would just approach him outside of work. I know he has to be nice to me while working in customer service, and I really don't want to make him uncomfortable. I haven't been able to get it off my mind so I am considering giving him a note next time I go to the shop that says:\n\n\"Hey! Sorry if this is weird, but you seem pretty cool so I thought it might be nice to chat outside of work sometime. No hard feelings if you're not interested! If I don't hear from you, we can pretend this never happened :) (insert my phone number here).\"\n\nI have been told this may sounds too apologetic, so should I just ask him verbally or change how the note is written?\n\nThis is not the only shop I go to, so if he seems really uncomfortable or if I'm awkward, there are plenty of other places I can go.\n\nAnd, I get it, the general rule of thumb is to not ask people out when they're working. I agree. That being said, I have been asked out while working and sometimes it's creepy and sometimes its respectful and I can just say no. I'm hoping I can go the respectable route, haha. Like I said, it's been on my mind for a while, and I think (if I do this properly) I won;t run the risk of going too far.\n\nI have thought that he has flirted with me, but I don't want to go too far with assumptions.\n\nI can't think of anything else to add, so let me know if you need more info \n\nTLDR: I want to give a guy at a local shop my phone number, is this inappropriate/a bad idea? Is there a different/better approach I can take?",
        "created_utc": 1678899487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being dramatic for being upset and what do I say to him?",
        "author": "ThrowRa__cc",
        "url": "https://www.reddit.com/r/relationships/comments/11s2943/am_i_being_dramatic_for_being_upset_and_what_do_i/",
        "text": "[removed]",
        "created_utc": 1678899474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone track their horrible sex life",
        "author": "Non21368",
        "url": "https://www.reddit.com/r/relationships/comments/11s28lg/anyone_track_their_horrible_sex_life/",
        "text": "Here’s how 2023 has been for my sex life.\nI have initiated 16 times. Rejected 16 times. \nShe initiated 6 times. And we have had sex 6 times. I have never rejected sex in my marriage. I don’t believe in it unless under extreme circumstances. Sickness,injury and such. \nWhy is it my wife get to have sex 100% of the times that she wants it. Honestly 50% was probably pitty sex. And so far this year I have had sex 0% of the times that I wanted to have sex. If I had initiated every single day those numbers may have changed a little bit but I’m tired of being rejected. It has broken me emotionally. Depression is at an all time high. Bad thoughts enter my head on a daily. I get anxiety every time I try to initiate because deep down I know she’s just going to reject me. \n\nOn a side not I’m keeping track of our sex life so that if and when it doesn’t get better this year, I’m going to show just exactly how bad it is and maybe that will convince her to take this seriously. \n\nShe doing hormone therapy but doesn’t take it seriously. She’s not taking her prescriptions like she’s supposed to and doesn’t follow up with the doctor regularly. \nTL;DR how close am I to being in a sexless marriage?",
        "created_utc": 1678899439,
        "upvote_ratio": 1.0
    },
    {
        "title": "ex-GF's (19F) best friend, who liked me (19M) before, stopped at nothing to break us up after getting us together and labeled me a toxic person and ruined many of my other friendships and connections in order to do so.",
        "author": "BrokeTheDirector",
        "url": "https://www.reddit.com/r/relationships/comments/11s281w/exgfs_19f_best_friend_who_liked_me_19m_before/",
        "text": "[removed]",
        "created_utc": 1678899407,
        "upvote_ratio": 1.0
    },
    {
        "title": "22 year old virgin wish I was dead",
        "author": "ThrowRA578ye8",
        "url": "https://www.reddit.com/r/relationships/comments/11s24w4/22_year_old_virgin_wish_i_was_dead/",
        "text": "[removed]",
        "created_utc": 1678899222,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (M17) losing my Girlfriend (F16) and I can't handle it",
        "author": "Weak_Consequence_289",
        "url": "https://www.reddit.com/r/relationships/comments/11s23zv/im_m17_losing_my_girlfriend_f16_and_i_cant_handle/",
        "text": "[removed]",
        "created_utc": 1678899167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23F) don’t know how to integrate my (23M) fiancé into my social life",
        "author": "ThrowRa122344338919",
        "url": "https://www.reddit.com/r/relationships/comments/11s23xc/i_23f_dont_know_how_to_integrate_my_23m_fiancé/",
        "text": "[removed]",
        "created_utc": 1678899163,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M32) have ruined my relationship with her (f28)",
        "author": "Merrywinds",
        "url": "https://www.reddit.com/r/relationships/comments/11s1z5h/i_m32_have_ruined_my_relationship_with_her_f28/",
        "text": "We've been together for 4 years. I have not shown enough love, appreciation, care, recognition or desire towards her, and she has said this many times. We've had multiple fights over this topic and she is right. I have dragged us both down to this state and she has been the driver of the relationship and us as a unit for all this time, but now it has gone too far. She's an immigrant who sacrificed her life with her friends and family to be with me and I am not giving her what she deserves.\n\nI know what I have to do medium-long term to give her the life she deserves, but I do not know how to salvage the current situation I put us in. As of now, any apologies are insulting to her and my mere presence gives her anxiety and anger. Because of all the compounding failures and pain I have caused, I do not know how to help her feel supported, loved and safe.  We've come to the point where if I tell her what I will do, it hurts her because again, in her words, I make it about me.\n\nAs for me, I think I never learned relationship / emotional skills in my life and I may have serious issues with not feeling empathy or strong emotions. I can basically decide not to care or feel if I do not want to. I've been called cold, a dick and an asshole many times and for good reason. I also change jobs often and get bored of people at work even if I'm very successful and do very well professionally. I'm looking to go to therapy but that will not help here and now.\n\nTl;Dr: I'm a class A dick looking to fix myself long term, but I want to save my relationship now. Wat do.",
        "created_utc": 1678898876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me [f, mid 30s], him [m, mid 30s] and the kitchen",
        "author": "confusedgf48562",
        "url": "https://www.reddit.com/r/relationships/comments/11s1y57/me_f_mid_30s_him_m_mid_30s_and_the_kitchen/",
        "text": "[removed]",
        "created_utc": 1678898815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (male 18) was just broken up with (female 18) but I still think we have a chance, is it worth it?",
        "author": "Sudden-Dinner-9556",
        "url": "https://www.reddit.com/r/relationships/comments/11s1x9e/me_male_18_was_just_broken_up_with_female_18_but/",
        "text": "[removed]",
        "created_utc": 1678898761,
        "upvote_ratio": 1.0
    },
    {
        "title": "18M, 18F, can anyone here give me some advice? Been struggling with choosing.",
        "author": "Sudden-Dinner-9556",
        "url": "https://www.reddit.com/r/relationships/comments/11s1vtm/18m_18f_can_anyone_here_give_me_some_advice_been/",
        "text": "[removed]",
        "created_utc": 1678898676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice would be nice",
        "author": "Sudden-Dinner-9556",
        "url": "https://www.reddit.com/r/relationships/comments/11s1uml/any_advice_would_be_nice/",
        "text": "[removed]",
        "created_utc": 1678898605,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf feels like I’m stringing him along",
        "author": "No_Fox_5012",
        "url": "https://www.reddit.com/r/relationships/comments/11s1plb/my_bf_feels_like_im_stringing_him_along/",
        "text": "[removed]",
        "created_utc": 1678898303,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [26F] am still confused about my breakup with my ex [23M]. Help me out?",
        "author": "curious-Biscotti279",
        "url": "https://www.reddit.com/r/relationships/comments/11s1nyk/i_26f_am_still_confused_about_my_breakup_with_my/",
        "text": "\nI started dating my ex in 2020. We stayed in the same city, but 3 hrs apart. He would come to visit me (once or twice a month) .\n\nOmiting the unnecessary deets, it had been 2.5 years. But he never brought up the topic of marriage, family, etc by himself. He had however promised that he will go against his family if the need be, that he loves me more than his family, and he wants me by his side forever.\n\nNow, before anybody tells me that we are too young and all , let me specify that this is India and he is a Rajathani guy, and they get married pretty early. 25-26 is a good age for them. Infact his dad was already having plans for his son's marriage.\n\nIn november, I asked him to give me a timeline-and just a timeline- telling his family about me, engagement, marriage, etc. He seemed very annoyed and told me strictly that he needed 5-6 years for some financial things. It was not a discussion, he just stated it and after that I was free to do whatever I wanted to (it felt like that). I tried to convince him to come to a middle ground as it was too much for me ( I am 26 already) . He told that night that he would tell me the next day.\n\nHe also told me that his mom would get a geart attack on knowing about me as she was strictly against love marriages.\n\nI was very anxious the entire night but he kept dodging my calls . The next day, I only called him up to discuss further. He had a very indifferent tone and said that it's pointless to discuss this topic. He said \" it can take me 5 years also , 10 years also. I am not sure. How can I stop you from leaving?\"\n\nI hadn't even talked about \"leaving\" at that point. I was shocked. I asked him whether he is letting us go, he said YES. And he said \" you wanted clarity, here it is. Don't bother me further\".\n\nIt has been 4 months but I am so hurt even today. I wonder if he even loved me or not.If somebody loves you, they cannot give up on you so easily. Heck, he didn't even ask for time to think. He made his decision in 11 hours.And if he knew his mom would die on knowing about me, why was he always pressuring me for sex then?\n\nHe sometimes made me feel like he was so much in love (calling 10+ times a day, calling just to say ILY, the way he looked at me, the affection, etc)\n\nWhat's your view?\n\ntl;dr- still confused about breakup after 4 months. Need advíce.",
        "created_utc": 1678898201,
        "upvote_ratio": 1.0
    },
    {
        "title": "My wife (32F) didn't tell me (35M) first about her new job",
        "author": "This-Engine-3654",
        "url": "https://www.reddit.com/r/relationships/comments/11s1jwu/my_wife_32f_didnt_tell_me_35m_first_about_her_new/",
        "text": "Not long ago, my wife was looking for a new job. She had done several interviews, and she let me know that she finished her last round for one position. \n\nThe next day, we were getting supper with our kids and my parents (they are local and we see them fairly regularly), and she announces with a huge smile that she had gotten a call about an hour earlier and had gotten that job. I was very deeply hurt that she hadn't told me first, and I felt stupid to be learning about it at the same time as everybody else. I told her this and she said she had only known for a little bit and had decided to surprise everyone, but that she was sorry that it hurt me. I feel that by not telling me, she was disrespecting me and our marriage because I think we should be sharing everything with each other, and I feel that her response didn't recognize that and brushed off my feelings. She never said I am overreacting, but I feel that by her response that she thinks I am. Was I overreacting here?\n\nTL;DR - wife got a new job and didn't tell me directly before telling the whole family together.",
        "created_utc": 1678897962,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel numb/ anxious toward/ repulsed by my partner when there’s conflict?",
        "author": "Traditional-Stock-71",
        "url": "https://www.reddit.com/r/relationships/comments/11s1ifk/i_feel_numb_anxious_toward_repulsed_by_my_partner/",
        "text": "Tl;dr\nWhen unpleasant things happen, I feel numb, anxious and/or repulsed by my partner whom I love and treasure very much, and have a very strong healthy relationship with. I cannot find anything about this phenomenon. Any help would be very much appreciated&lt;3\n\n\nI [25F] love my partner[23F] to death, they are the light of my life, my sunshine and guiding moonlight, my best friend, my everything, and the best possible thing I could’ve ever asked for or dreamt of. We are in a very happy, stable, healthy relationship. \n\nBefore we get into the problem, there are a couple factors to take note of.\nFirstly, we are LDR(I live in Singapore and they live in the USA, California), we met online near the end of 2021 and we met up in person for the very first time last year in November and it was absolutely wonderful, the happiest 2 weeks of my life.\nSecondly, I live in a pretty awful household. I’ve been severely emotionally abused and neglected my entire life and my family is the bane of my existence. I was also severely bullied growing up. I think I’d just sort of gone numb as a coping mechanism, at some point in my life I even experienced a couple months of depersonalisation/ derealisation during highschool. Right before I met my partner, I had just broken out of a 4 year depression period and was finally getting treated for adhd in hopes that I could get my life together. I was… extremely numb at that point, and I could almost feel my brain melting. Despite being numb, it scared me so much it’s what prompted me to see a psychiatrist. It was only last year where I’ve been able to realise the extent of my mental illness. Later on I started getting treated for anxiety and depression as well.\n\nSo! Around two months in of being with my partner, some family issues flared up and I was on the receiving end of one of my sister’s worst emotional outbursts. I didn’t think much of it, in the moment I reacted calmly. But I remember feeling extremely nauseous and anxious that night. The next day when I video called my partner, as we do, I noticed I was a little repulsed by them? Which was weird but my initial reaction was to brush it off however the feeling just kept growing stronger. They didn’t do anything different or anything, just looking at them filled me with what I can only describe as pure utter repulsion. Which is a complete utter 180 of the usual warmth and love I feel for them.\nI spent the whole week bawling and inconsolable, not understanding and bewildered why I was repulsed by the love of my life. In the end I stayed at my friends place for 3 days to get away from my family and limited time with my partner to reduce the feeling of repulsion. I had very clearly communicated the situation to my partner who was extremely understanding, concerned and sympathetic but was unable to do anything, especially being the subject of my repulsion. After 2 weeks the the feeling slowly started to subside and I was able to feel my whole feelings of warmth and love for them again.\n\nI’ve searched high and low on the internet but I cannot find anything about this phenomenon. Why is it directed at my partner, my favourite person in the world? Why not literally anyone else?🥲\n\nOf course I knew there was always a possibility this might happen again but yet I was kinda caught off guard. A week ago my partner and I had a serious discussion after 2 weeks of them being away on a work trip and unable to call. It was over something we have discussed before and it’s something that can’t really be helped due to the distance and time difference of 16 hours, but nonetheless we both end up tearful and just… sad due to the circumstances.\n\nOver the next few days I realised I was feeling numb and more baffling, anxious (but not repulsed) around my partner. Which has never happened before. They have always been my biggest comfort. The anxiety especially flares up when they mention things like our future visits or our hypothetical wedding and future house together. Usually I love discussing these things, and it makes me very happy knowing our future together is something we both think about. But currently they just fill me with anxiety and dread. I have since communicated all this to my partner and we have decided not to touch on those topics until further notice. They have been extremely sweet and supportive, and despite me being scared and confused I can’t feel my love for them, they have been extremely optimistic and confidant about my feelings for them. Which helps a little. At least someone knows how I really feel I suppose :’)) Since this isn’t their first rodeo they’re not scared and confused like last time, just sweet and supportive.\n\nI don’t understand what happened, it’s not like we’ve never discussed serious before. We have very open and radical communication and honesty. So I fail to understand what triggered this bout of… whatever this is.:(\n\nI’m panicking, I don’t know what to do. My partner is an amazing, wonderful person and aside from the inner daily inner turmoil and frustration, I also hate to put them through this. I miss them too, and I just… don’t understand why I feel this way or why this is happening. I’m scared. I don’t want to feel this way, I don’t want to lose them, I can’t help but feel they deserve someone who won’t go through this bouts of not even knowing how or why they feel a certain way. Is this normal? Am I doomed to periods like this for the rest of my life? Is this abnormal? Should I continue this relationship? If my brain self sabotaging?? Why is it targeting the best thing in my life?? Does it think it’s too good to be true?? I don’t want to hurt my partner😭😭 \n\nIf you’ve reached the end, thank you. This is certainly quite the long read😅 I appreciate you getting this far and if you have any advice or similar experiences, please enlighten me I’d be ever so grateful to learn from them.&lt;3",
        "created_utc": 1678897872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Situationship (30F) says I (32M) suck in bed but doesn't want to teach me. Is this doomed to fail?",
        "author": "friedchicken48",
        "url": "https://www.reddit.com/r/relationships/comments/11s1hrm/situationship_30f_says_i_32m_suck_in_bed_but/",
        "text": "I've (M 32) been in a situationship for a year now and the sex has not been good. Outside of sex, everything is going great -- we get along super well and spend a ton of time together. She (F 30) is currently exploring her bisexuality and has several other partners, and things by all accounts are going well. I'm fairly inexperienced with sex and haven't had many partners and it clearly shows in the bedroom. I enjoy sex, and want to get better but my confidence is pretty shot. She is the only person I'm currently seeing.\n\nThis has been a conversation we've had multiple times that she is not enjoying the intimacy between us and she doesn't know if this should continue. She specifically said she doesn't want to be a teacher and told me to figure it out. It really doesn't foster any comfort and it feels embarrassing. I know no one has an obligation to anything but it still hurts.\n\nEven though we haven't ended our situationship, in my mind this is practically over. I'm stuck in a rut trying to figure out how to even get better at sex if I'm not having any of it. I've read tons of articles and watched videos on things to try but when I try to put it into practice it doesn't work and the mood is ruined. I'm a fairly monogamous dude and the idea of hook ups are scary to me now because of the hit on my confidence from this experience. \n\nShould I just find myself a partner/fwb that is patient and fits with my situation? Or is there a conversation I can still have with my situationship to try something else?\n\nThanks in advance!\n\n---\n**tl;dr**: situationship says I suck in bed but doesn't want to teach me. I want this to work but I don't know how to get better if we fail at sex every single time.",
        "created_utc": 1678897837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love advice",
        "author": "Dangerous-West-2748",
        "url": "https://www.reddit.com/r/relationships/comments/11s1h85/love_advice/",
        "text": "[removed]",
        "created_utc": 1678897808,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [26F] am still confused about my breakup with my ex [23M ]. Help me out?",
        "author": "curious-Biscotti279",
        "url": "https://www.reddit.com/r/relationships/comments/11s1elf/i_26f_am_still_confused_about_my_breakup_with_my/",
        "text": "[removed]",
        "created_utc": 1678897650,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I move past this and be happy?",
        "author": "westcoastbambi",
        "url": "https://www.reddit.com/r/relationships/comments/11s1edz/how_do_i_move_past_this_and_be_happy/",
        "text": "I (29f) dated my ex(33m) for a few years until I made the mistake of looking through his phone one day. To my surprise, he was texting his friend about another female friend and basically saying how he could hook up with her if he wanted but he’s loyal.\nThat crushed me mainly because she and him were hanging that night with friends when he texted him that, and this girl can probably get whoever she wanted and I don’t think he’s someone she wants… so I felt just *crushed* and left the entire situation to save heartache for myself. \nFast forward 8 years later after years of on and off contact and basically becoming friends again after we both dated other people i find myself attached to him and wanting him again. I’m just so hurt that everything triggers me, we get into arguements sometimes bevause i can’t control my emotions and feel like he’s settling for me. Because he deep down wanted his friend who didn’t want him. (She’s been from 15 year relationship to a current 5 year..)\n\nI don’t know how to stop ruminating on how he basically thought about cheating on me with someone he claims was his friend. Like do all men wanna fuck the females in there life but remain loyal? I’m losing my mind over this.\n\nTL;DR boyfriend mentioned how he could cheat on me years ago and i can’t move past it",
        "created_utc": 1678897636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wish I was dead",
        "author": "Professional_Back156",
        "url": "https://www.reddit.com/r/relationships/comments/11s1d83/wish_i_was_dead/",
        "text": "[removed]",
        "created_utc": 1678897568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girlfriend (24f) regularly using something I (25m) buy for myself",
        "author": "Sweet-Serve-4745",
        "url": "https://www.reddit.com/r/relationships/comments/11s18qh/girlfriend_24f_regularly_using_something_i_25m/",
        "text": "My gf and I live together and when it comes to rent, bills and grocery shopping we split them all 50/50.  6 months ago I got a new job and decided I wanted to buy myself a little something each month. I started buying myself a nice bottle of wine each month. For the first 2 months that was fine and on the third month my gf asked if she could have a glass. I said yeah and have her a glass and she enjoyed it.\n\nThe following month after I bought it I noticed she'd had just over half of the bottle. The same thing happened the following month so I asked my gf to start contributing to the cost of the wine since she was now having more than I was. She refused and said it was my wine and that that I wanted to buy so she shouldn't need to pay for it. I disagreed and pointed out that she was now having more of this than I was and she just said she'd be fine if we didn't have it in so she shouldn't have to buy it. \n\nThis month when I bought the wine, my gf asked me if I would pour her a glass and I refused. I told her that unless she starting paying half of the cost of it, then the wine would be for mine as initially intended. She said I was being unfair and that she lives her aswell so she should be able to drink it. Does anyone have any advice on how to handle the situation?\n\ntl;dr my gf is regularly drinking more than half of the wine that I buy for myself but refuses to contribute towards the cost. Does anyone have any advice?",
        "created_utc": 1678897295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partner JUST got out of shower to go to the gym",
        "author": "porpoisewang",
        "url": "https://www.reddit.com/r/relationships/comments/11s189a/partner_just_got_out_of_shower_to_go_to_the_gym/",
        "text": "[removed]",
        "created_utc": 1678897266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partner JUST got out of the shower to go the gym",
        "author": "porpoisewang",
        "url": "https://www.reddit.com/r/relationships/comments/11s17sr/partner_just_got_out_of_the_shower_to_go_the_gym/",
        "text": "[removed]",
        "created_utc": 1678897239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband (19M) me (20F) he rarely wants to have intimacy..",
        "author": "Unfair-Flow-7036",
        "url": "https://www.reddit.com/r/relationships/comments/11s17n6/husband_19m_me_20f_he_rarely_wants_to_have/",
        "text": "yes I know we married young.. We live alone. He rarely wants to have intimacy. I always initiate it but 90% of the time he’s too tired or is not in the mood. I know I’m not the problem. I’ve never had this problem with previous relationships. NEVER. I’ve asked him why or what’s wrong and he just says he’s not used to it in his previous relationships they wouldn’t always do it. And tells me I’m just used to guys wanting to f*ck. But that’s not the case, theirs just times I’m in the mood and he just pushes me off. This is one of the main reasons we argue too. Am I in the wrong for feeling upset for this? What do I do? Or why do you think he’s like this? Please help!!\n\nTl;dr I’ve tried talking to him and he doesn’t see nothing wrong with it.",
        "created_utc": 1678897231,
        "upvote_ratio": 1.0
    },
    {
        "title": "To move in with fiance or not (24) (23)",
        "author": "No-Concert-9663",
        "url": "https://www.reddit.com/r/relationships/comments/11s141a/to_move_in_with_fiance_or_not_24_23/",
        "text": "I've been dating my fiance for 2 years before we got engaged last week, setting the wedding for two years from now. Currently we both still live at home with our parents, with different circumstances. Recently, my fiance got a new job in a different city, which means a lot more income, but about a total of 3.5 hours of driving + walking every day. I work a full remote job that only meets once a month or so 5 minutes from my parents' house. We are looking to rent an apartment near my fiance's workplace, which would reduce the commute to a 10 minute drive (10 minute walk if we can find one even closer)\n\nFiance:\n\n* lives with single verbally abusive mother, who owns 6 cats in an apartment\n* complains about disturbed sleep and inability to relax at home due to mother's ranting and outbursts\n* has one month's expenses worth of savings (lost the rest as mother took it all to pay an old debt of hers)\n* pays no bills except for gas and phone bill\n\nMe:\n\n* lives with semi-retired (very) wealthy parents in a gated community\n* pays no bills except for phone bill\n* does no chores (we have housekeepers that come and take care of that every day)\n* has 5 years' expenses worth of savings\n\nOur incomes are about equal and this move would mean we both would have to spend about 55% of our income on all necessary bills + a little bit extra to save for unexpected expenses. My parents, however, tell me this is a bad decision. \n\nThey tell me I'm making my life more difficult and that my fiance is the only person who will benefit from the move, since my job meets close to where I'm at currently and I don't need to be closer to my fiance's workplace. They said I should stay home for one more year, calculating the year's worth of bills and telling me I should save that amount up instead, while my fiance should get a roommate. They've said I'm short-sighted and thinking with my heart too much.\n\nMy fiance, on the other hand, would much prefer to live with me rather than a roommate (and I would too, since if we're getting married in a couple of years, we might as well start joining our lives) and would probably not make the move alone unless the commute/continuing to live with abusive mother starts to feel unnecessarily oppressive.\n\ntl;dr: want to move out from parents and live with fiance, parents criticizing decision and saying i'm making a bad choice",
        "created_utc": 1678897016,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to leave my relationship with my boss",
        "author": "Amelia12346",
        "url": "https://www.reddit.com/r/relationships/comments/11s1329/i_want_to_leave_my_relationship_with_my_boss/",
        "text": "So i’ve (F25) been in a relationship with my bf (M37) for 2 years. Havent really wanted to mention this before but he is my manager.\n\nIts been very toxic over the past several months, in which its clear hes insecure from the way he is untrusting of me, judges the clothes I wear, swears at me &amp; overall just says things that are disrespectful too.\n\n(You can check my last post about my toxic relationship for more depth as to why I want to leave which should explain it)\n\nSo I’ve been trying to find a job for around 2-3 months &amp; have only had more success with the crappy paying jobs, which I cant take because I wont be able to afford bills, rent, household stuff etc. The ones around my current salary or more have not accepted me as they found people more qualified (even though I have years of sales experience?). (I have not used him as a reference so that is not the reason).\n\nALSO, I cannot complain about him to anyone as it is his company in which he is partnered with his best friend, and it is a small company so there is no HR, its just a small office of a few people. I dont really want to put in a legal complaint, I mean we both consented to the relationship even if it was unprofessional, &amp; dont want to go down the legal route as it would be stressful &amp; embarrassing too so that is not an option (even my family dont know about this relationship). And I definitely have to leave my job, we had an argument once &amp; was going to break up in which he said how i cant work anymore but then we got over it (so yes he will fire me, and if not, I’d want to leave anyway as we work in the same room &amp; i have to sit near him). His best friend (other boss) knows about us so would just support whatever my current bf says :/\n\nSo today Im thinking to just dump him even though I have no job to support me, I cant keep being in this relationship, its mentally exhausting, having to walk on eggshells constantly too. I dont have anybody to talk to about this as my friends think I left him months ago (I was embarrassed to say i didnt).\n\nMy only backup is to borrow money from my dad which I have been absolutely dreading to do as I didnt want to disappoint him but have already talked about how I need to leave my job because its depressing (not that im dating my boss). He said he will help me but sounded disappointed. I have never asked him for money before so its really embarrassing.\n\nPlease advise on the situation if you can. Theres the option of staying with him until I get a new job but it would mean having to deal with it all again. This has been depressing me &amp; I have even seen a counsellor.\n\nTL;DR - 25f need to leave a relationship with my 37m boss as its toxic and mentally draining, but it means I will lose my job &amp; have to borrow from my dad which is humiliating for me.",
        "created_utc": 1678896958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband (19M) me (20F) He rarely wants to have intimacy.",
        "author": "Unfair-Flow-7036",
        "url": "https://www.reddit.com/r/relationships/comments/11s0xye/husband_19m_me_20f_he_rarely_wants_to_have/",
        "text": "[removed]",
        "created_utc": 1678896655,
        "upvote_ratio": 1.0
    },
    {
        "title": "My GF (21F) broke up with me because she's gay, and I can't understand why I'm not devastated",
        "author": "TofuTime17",
        "url": "https://www.reddit.com/r/relationships/comments/11s0tl9/my_gf_21f_broke_up_with_me_because_shes_gay_and_i/",
        "text": "First, some backstory. I (22M) had been dating my girlfriend for 3 years. I know 3 years really isn't that long of a time, but I wholeheartedly believed that she was \"the one\". Our relationship was very healthy (never had a single fight) and we had even openly talked about marriage a few times. Discussing marriage at our age is definitely not common in today's world, but it goes to show just how in love we were. I graduate college in 2 months and was planning to move in with her.\n\nAnyway, 4 days ago she calls me in tears and tells me that she's a lesbian and apologizes because she feels she \"wasted\" the last 3 years of my life (her words).  In short, I tell her that she didn't do anything wrong; I understand and am not mad at her.  She deserves to live the life she wants to live, and I'm not going to force her to live a lie to make me happy.\n\nRight after the phone call I wasn't sad, but I attributed this to being in shock/having not fully come to terms with what just happened.  However, it's now been several days and nothing's changed.  I should be absolutely destroyed.  I should be sobbing my eyes out, but I'm just....not.  It's not like I'm apathetic either. I'm on spring break with some friends and I've genuinely been having a lot of fun. I'm not repressing my emotions or drowning out my sorrows in booze. (We're in Chicago, not the stereotypical college spring break in Miami.)\n\nWhat makes me the most sad is how quickly I moved on. I'm more upset about having to reinstall tinder than I am about getting dumped, which I know is a terrible thing to say given that I love her so much (to say nothing about how a massive wrench just got thrown into all of my future plans).  I loved her with every ounce of my being. I just can't wrap my head around why I'm so calm about what happened.\n\nTL;DR  My girlfriend came out as a lesbian and I'm not as sad as I should be.",
        "created_utc": 1678896407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (m31) broke up with me (f27) after 7 months of dating and saying he wanted to marry me.",
        "author": "miloandfranklin",
        "url": "https://www.reddit.com/r/relationships/comments/11s0pvn/boyfriend_m31_broke_up_with_me_f27_after_7_months/",
        "text": "I’ve been pretty critical of my boyfriend lately. He made some racist/sexist jokes, was reading a book about how marriage was a scam and men’s value goes up with more sex partners while women’s value goes down, and I felt he failed to set boundaries with a woman who was hardcore flirting him. He also lied about the number of sexual partners he had (turns out it was 30-50 rather than 20-30, which I think is a lot but more important is that he lied). Turns out he hated the book, felt bad about the jokes, and he feels I overreacted about the woman and number of sexual partners. I didn’t accuse him of cheating, but I said I needed help building back trust because he shouldn’t have texted this woman after promising me he wouldn’t (it was an innocent text but still). He’s saying my paranoia over this is the last straw, because although he feels I’m right about all my concerns, he doesn’t feel he deserves me being upset at him. He also feels I have not been trying Catholicism enough, but I’ve gone with him 4 out of the 5 times he’s invited me to church. And lastly, he’s upset that I’m only willing to hyphenate my name for marriage instead of taking his and getting rid of mine.\n\nHe broke up with me so abruptly. We were literally talking about marriage this weekend and staying up late talking. He said he would watch a documentary about racism in America because he admitted he was ignorant, but now he’s resentful I even asked because his sponsor (AA) is a black man. He may be ignorant but I felt like he was learning. Should I have backed off? He was so kind and thoughtful and I loved him. Now I just feel like a paranoid, insecure nag who doesn’t trust anyone.\n\nTL;DR my boyfriend broke up with me because I wouldn’t change my name for marriage, and he was tired of me complaining about his racist/sexist jokes and another woman who flirted with him.",
        "created_utc": 1678896188,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [25F] soon-to-be husband [30M] wants to invite an old crush to our wedding",
        "author": "Disastrous_Emu_TA",
        "url": "https://www.reddit.com/r/relationships/comments/11s0ojq/my_25f_soontobe_husband_30m_wants_to_invite_an/",
        "text": "[removed]",
        "created_utc": 1678896113,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (24F) ex boyfriend (26M) kissed me unexpectedly and now I don’t know what to do",
        "author": "GGreddit23",
        "url": "https://www.reddit.com/r/relationships/comments/11s0n4k/my_24f_ex_boyfriend_26m_kissed_me_unexpectedly/",
        "text": "My (F,24) ex boyfriend (M, 26) and I have been broken up for about 5 months now. I  broke up with him because we were fighting constantly and felt really lost in the relationship and not because we didn’t love each other but ultimately we both agreed that it was for the best. Around\nDecember we started hooking up and seeing each other again but we had a fight again about our past and I realized that we are not in a place to get back together and so I wrote him a heartfelt letter and told him I had to distance myself which meant I blocked his number for a little over a month. We had no contact except for watching each other’s instagram stories despite us not following each other until yesterday.  \n\nI work at an office that he had to visit every 2 months for appointments and every time I avoided him because I knew it would stir sometime up in me. And yesterday was his last appointment and it was the final one and I debated if I to see him or not and in the end decided to do it. We said hello and stayed chatting for a bit, he was smiling ear to ear and looking in my eyes and the spark was immediately there for the both of us which is exactly what I was scared of. I asked why he kept smiling and he said it was hard not to smile when looking at me. And in the end when he had to leave he thanked me for helping him with his treatment and he gave me a hug and kiss on the cheek but then he stayed longer to keep talking to me and ask me how I’m doing, I noted all the small ways he would make physical contact by slightly grabbing my hand, my waist etc. and in the end we gave each other a long hug and he gave me another kiss on the check and where he should’ve stayed he lingered a bit longer and he said he was really happy to see me, he kept smiling and I couldn’t help but smile back, we looked at each other for a bit not saying anything just kinda smiling/laughing and then he leaned in a kissed me. I immediately pulled away because this was in the MIDDLE of my office in front of everyone and plus it’s crazy!! So I pushed him off and told him “get out of my office” but in a jokey way in which we both still laughed but he left. And then he came back to say goodbye to my boss and when he passed me he just turned around and looked at me and I smiled from my peripheral and that was the end. \n\nI have been feeling incredibly conflicted because it is now the second day since and he hasn’t reached out to say anything to me and in a way that makes me upset because I wish he would but on the other hand I feel relieved because if he does, I dont know if I want to rekindle things..I don’t know if we can, how could I trust that things are different now? I love him still and I could tell he loves me as well but maybe I’m just being naive. Do I just go on pretending nothing ever happened? Very confused. Any perspectives? \n\nTLDR; My (F,24) ex boyfriend (M,26) came to my job and kissed me unexpectedly but hasn’t said anything to me since. I don’t even know if I want him back but I feel confused and need advice because I still love him but I don’t believe that we have magically fixed all our issues, any perspective?",
        "created_utc": 1678896042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (m31) broke up with me (f27) after 7 months right after saying he wanted to marry me.",
        "author": "miloandfranklin",
        "url": "https://www.reddit.com/r/relationships/comments/11s0ll5/boyfriend_m31_broke_up_with_me_f27_after_7_months/",
        "text": "[removed]",
        "created_utc": 1678895963,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (24F) ex boyfriend (26M) kissed me at work and I don’t know what to do next",
        "author": "GGreddit23",
        "url": "https://www.reddit.com/r/relationships/comments/11s0if7/my_24f_ex_boyfriend_26m_kissed_me_at_work_and_i/",
        "text": "[removed]",
        "created_utc": 1678895778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M21) got broken up with my now ex girlfriend (F19). We both go to college together and have a class together.",
        "author": "sandwalker23",
        "url": "https://www.reddit.com/r/relationships/comments/11s0huv/i_m21_got_broken_up_with_my_now_ex_girlfriend_f19/",
        "text": "[removed]",
        "created_utc": 1678895747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couples Counselling at end of 8 year relationship",
        "author": "WombatService",
        "url": "https://www.reddit.com/r/relationships/comments/11s0fph/couples_counselling_at_end_of_8_year_relationship/",
        "text": " \n\nI (40m) have recently separated from my partner (43f). Our relationship was 8 years long. We live together with our 5 year old son in the house we jointly own.  In general it has been happy, but we have had our issues, traumas and crisis along the way. Communication has always been something we could have done better. I am absolutely devastated and fearful of the future.\n\nShe reluctantly agreed to attend couples counselling.\n\nWe had an initial joint session, which was very hard as I said I wanted to see if reconciliation was possible. She stated that instead of wanting to work on aspects of our relationship, she wants to focus on separation mediation.\n\nShe had her individual session the other day. Mine is scheduled for next week. She has since set out that we could continue to do family things together but live apart. I don’t think I’m comfortable with this, I think it would be very painful.\n\nI’m not sure I need a counsellors assistance to read the writing on the wall. her messages outside of counselling have made it clear that there is no future together.\n\n**Is there any benefit in carrying on with this counselling?**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTLDR: Separated from partner of 8 years, 5yo child. She sees counselling as sep mediation. Is it worth it?",
        "created_utc": 1678895617,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA (30s, F) for telling my ex (30s, M) he can't see our son",
        "author": "Few_Perspective_8145",
        "url": "https://www.reddit.com/r/relationships/comments/11s0dxt/aita_30s_f_for_telling_my_ex_30s_m_he_cant_see/",
        "text": "[removed]",
        "created_utc": 1678895510,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA (30s, F) for telling my ex (30s, M) he can't see our son",
        "author": "Few_Perspective_8145",
        "url": "https://www.reddit.com/r/relationships/comments/11s0bru/aita_30s_f_for_telling_my_ex_30s_m_he_cant_see/",
        "text": "[removed]",
        "created_utc": 1678895387,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was rejected and couldn't be happier :)",
        "author": "Then_Ad_3254",
        "url": "https://www.reddit.com/r/relationships/comments/11s0b61/i_was_rejected_and_couldnt_be_happier/",
        "text": "[removed]",
        "created_utc": 1678895350,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for telling my ex he can't see our son",
        "author": "Few_Perspective_8145",
        "url": "https://www.reddit.com/r/relationships/comments/11s08sb/aita_for_telling_my_ex_he_cant_see_our_son/",
        "text": "[removed]",
        "created_utc": 1678895208,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for telling my ex he can't see our son",
        "author": "Few_Perspective_8145",
        "url": "https://www.reddit.com/r/relationships/comments/11s07rw/aita_for_telling_my_ex_he_cant_see_our_son/",
        "text": "[removed]",
        "created_utc": 1678895149,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (23) love life is tragic, and I feel like giving up on dating - the pattern is something I can’t keep going through.",
        "author": "movement_on",
        "url": "https://www.reddit.com/r/relationships/comments/11s03zb/my_23_love_life_is_tragic_and_i_feel_like_giving/",
        "text": "\nI’m a 23 year old, and I hate modern dating. I keep experiencing the same thing, over and over again, since my last relationship three years ago. \n\nEssentially, I’d only ever been a casual fling person - not out of choice, but nobody ever wanted more. Then, I (then 20f) met someone (22m) at university and we had a year long relationship from basically the beginning of Covid… it was very intense as a first proper relationship. Every time I asked him why he got into a relationship with me, he’d reply with “because you asked”. Looking back, he was only with me because he settled into it and liked not having to put effort in. I broke up with him.\n\nSince then, I’ve been using dating apps and I continuously come across the same experience. I match with someone, we chat, I like them, they like me, we go on dates and we’re talking and getting to know each other, and every single time without any notice they just suddenly lose interest after a couple of weeks or months of fun times and communication.\n\nIt’s been intense - some of these people have written poems about me, have literally admitted to having gender and sexuality crises because of me, have told me that they’ve never dated someone like me… this sounds dramatic, but I think it’s because I’m autistic and have a really strong sense of relationship justice so I’m constantly communicating about needs and wants and fears and it can be nice.\n\nBut when they lose interest, the excuses for dropping off my radar usually involve a long message describing how fantastic and unique and lovely they have found the Experience™️ of loving me, some have admitted to falling in love with me, but each of them says something like “I’m just not sure I’m ready”. Ready for what?!\n\nI think another weird pattern is how many of them tell me this is the first time they’ve dated somebody seriously since their last long term relationship. \n\nIdk what I’m doing wrong because nobody ever says that I am the problem, maybe I’m blind to it.\n\nTldr; people I date enjoy me and even fall for me until one day they suddenly don’t and it’s always unexpected and within a three month timeframe.",
        "created_utc": 1678894931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be weird to tell him this",
        "author": "cowhats1",
        "url": "https://www.reddit.com/r/relationships/comments/11s03sy/would_it_be_weird_to_tell_him_this/",
        "text": "[removed]",
        "created_utc": 1678894919,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (M17) losing my Girlfriend (F16) and I can't handle it",
        "author": "Weak_Consequence_289",
        "url": "https://www.reddit.com/r/relationships/comments/11s03po/im_m17_losing_my_girlfriend_f16_and_i_cant_handle/",
        "text": "[removed]",
        "created_utc": 1678894915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be weird to send this",
        "author": "cowhats1",
        "url": "https://www.reddit.com/r/relationships/comments/11s00wp/would_it_be_weird_to_send_this/",
        "text": "[removed]",
        "created_utc": 1678894758,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (23NB) love life is tragic, and I feel like giving up on dating - the pattern is something I can’t keep going through.",
        "author": "movement_on",
        "url": "https://www.reddit.com/r/relationships/comments/11rzz5i/my_23nb_love_life_is_tragic_and_i_feel_like/",
        "text": "I’m a 23 year old, and I hate modern dating. I keep experiencing the same thing, over and over again, since my last relationship three years ago. \n\nEssentially, I’d only ever been a casual fling person - not out of choice, but nobody ever wanted more. Then, I (then 20f) met someone (22m) at university and we had a year long relationship from basically the beginning of Covid… it was very intense as a first proper relationship. Every time I asked him why he got into a relationship with me, he’d reply with “because you asked”. Looking back, he was only with me because he settled into it and liked not having to put effort in. I broke up with him.\n\nSince then, I’ve been using dating apps and I continuously come across the same experience. I match with someone, we chat, I like them, they like me, we go on dates and we’re talking and getting to know each other, and every single time without any notice they just suddenly lose interest after a couple of weeks or months of fun times and communication.\n\nIt’s been intense - some of these people have written poems about me, have literally admitted to having gender and sexuality crises because of me, have told me that they’ve never dated someone like me… this sounds dramatic, but I think it’s because I’m autistic and have a really strong sense of relationship justice so I’m constantly communicating about needs and wants and fears and it can be nice.\n\nBut when they lose interest, the excuses for dropping off my radar usually involve a long message describing how fantastic and unique and lovely they have found the Experience™️ of loving me, some have admitted to falling in love with me, but each of them says something like “I’m just not sure I’m ready”. Ready for what?!\n\nI think another weird pattern is how many of them tell me this is the first time they’ve dated somebody seriously since their last long term relationship. \n\nIdk what I’m doing wrong because nobody ever says that I am the problem, maybe I’m blind to it.\n\nTldr; people I date enjoy me and even fall for me until one day they suddenly don’t and it’s always unexpected and within a three month timeframe.",
        "created_utc": 1678894645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I (F20) a cheater for talking to my ex best friend behind my bf (M24)'s back? )):",
        "author": "sakiluvsyou",
        "url": "https://www.reddit.com/r/relationships/comments/11rzwf1/am_i_f20_a_cheater_for_talking_to_my_ex_best/",
        "text": "This happened last year but I (F20) wanted to come on reddit to talk about it. There was a man who was my best friend we'll name him Ian (25). Ian was like an older brother to me, really. I never seen him in any other way, not sexually, not romantically, nothing like that. Just plainly like my brother and I loved him very much. He was always there when I needed someone he never judged me and always had the same opinions as I did and made me feel very accepted.\n\nI got together with a guy who is now my boyfriend still, but I knew he never liked Ian, so I stopped talking to Ian as my bf wished for me to do so and I love my bf so ofc I listened. Whenever my bf and I would argue I would just turn to Ian because my bf would block me and not talk to me for a few hours or even for the whole day. I turned to Ian to talk to him about the problem, ask him for advice, and jut vent to him. But after the conversation then I would block Ian.\n\nBut then when another fight happened I would talk to Ian again for support because my other \"friends\" hates my bf and dont like it when I talk about him to them so I just shut my mouth. One day I was on a call with Ian on discord and my bf saw I was online, checked our mutual friends (even tho my bf hates Ian he just keeps him on his friends list idk why but yea he did) and saw that Ian and I were friends on discord again and was telling me to answer his texts.\n\nI didnt want to talk to my bf because we were in an argument at the time.But then I left the call with Ian and answered my bf's call. He was furious. So he made me share my screen and found out I had been talking to Ian whenever we would argue and needed someone. And my bf considered it as cheating and was borderline close to leaving me): I didnt think it was considered cheating to him but after this incident then I realized he considered it as cheating. Ever since then when we would argue every now and then he would bring up the time I \"cheated\" on him. I've always felt guilty.\n\nAm I a cheater?\n\n&amp;#x200B;\n\nTL;DR: My boyfriend considers me as a cheater for talking to my ex best friend when I need comforting behind his back. Am I considered a cheater?",
        "created_utc": 1678894480,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i(21F) tell my bf (21M) about a mutual acquaintance i hooked up with before we got together? please read the text its more complicated",
        "author": "nnubuvtcc",
        "url": "https://www.reddit.com/r/relationships/comments/11rzvfz/should_i21f_tell_my_bf_21m_about_a_mutual/",
        "text": "should i (21F) tell my bf(21M) about a mutual acquaintance that i hooked up with before we got together?\n\nmy bf and i have been together for 13 months. a couple months before that, he was living abroad and we were close friends. \n\nduring this time, a drunken hook up happened with a mutual acquaintance of ours. i honestly wasn’t into it but i wasn’t in the right state of mind to say no so i just went with the flow. \n\na couple months later, my bf (then friend) comes back to the country and we get into a relationship. i didn’t think it mattered to tell him cause it was in the past. \n\nat some point in the middle of our relationship, we break up for about 2 weeks then get back together. FH thought we were still broken up, and for some reason thought that me being single means i’d be interested. he started touching me so i moved his hand. \n\nlater, i texted him telling him how uncomfortable he made me and that i’d appreciate no physical contact, i’m not interested and never was, i’m in a relationship, and i actually regret what happened because i simply am not interested. \n\nFH apologized, said it was a misunderstanding and won’t happen again. he kept his word, it never happened again. but apparently he’s been telling a lot of people about it and saying i couldn’t turn him on and how i’m so into him despite being in a relationship and that i very obviously want him. \n\nkeep in mind ever since texting him (as stated above) (about 8 months ago) our interactions have been only been “hi” or “hello” in passing when we run into each other in college. \n\nmy bf doesn’t attend our college, but he knows many people in my college.\n\ni am worried that if it keeps spreading, my bf will find out and think that it happened during our relationship, not before. i am also worried he might be pissed that i didn’t tell him about the hook up because it is someone he knows and someone who runs in our extended circle of friends (he’s a friend of someone we see often). \n\ni don’t really care about what happened in the past, but i’m worried it might affect my relationship. \n\ndo you think i should tell my bf now? please give me your honest advice. \n\nTL;DR old hookup telling people about the hookup despite it being long ago and i’m worried my bf might get the wrong idea.",
        "created_utc": 1678894422,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21m) Cant move on from my ex girlfriend (21f)",
        "author": "Dalschn",
        "url": "https://www.reddit.com/r/relationships/comments/11rzst9/i_21m_cant_move_on_from_my_ex_girlfriend_21f/",
        "text": "Tldr:\nAbout a month and a half ago my ex girlfriend of 5 months broke up with me. It was because I got upset with her when I was having an anxiety attack and she just got fed up and dumped me over text. I was upset because i felt like she had no regard for my feelings, but in the moment when i was upset- i did not communicate in a rational way.\n\nWe were about to meetup for food and i asked if she wanted to hangout afterwards and she said no. I got upset about this because I was looking forward to seeing her after a long day at work and she made me feel unwanted. I had been feeling unwanted and useless for the past couple weeks after our interactions and i didnt want to cause any problems so i would casually mention that i didnt like how she was talking to me a few times before this day. In retrospect, I am sure her words/behavior were unrelated to me but it still upset me. I got upset about her saying no to hanging after we ate because i was already in an anxious mindset and it caused me to go over the edge and blow up on her. She didn’t respond for hours to my texts and it made me feel like she didnt care. She claimed i gave her a panick attack and i felt horrible because i didn’t even realize. Once she responded, she dumped me and i thought it would be a good idea to go to her place to atleast try to talk about it in person but she was ignoring me and then i foundout she wasnt home and left to her parents house.\n\n———-\n\nThis whole situation was so embarrassing for me and out of character. There were a lot of factors that led me to have an anxiety attack and blow up on her, but the biggest slap in the face is that she wouldnt even end things on civil terms. I really love her and i was ready to be committed to our relationship and I wouldve been willing to work out any problem with her. It sucks because she just gave up on me so easily.\n\nShe told me if i contacted her then shed call the police and basically treated me like a stalker. This really has hurt me because i was in love with this girl, despite not telling her i loved her because i was waiting for the right moment to tell her. It sucks spending 5 months with a girl you love and then getting dumped, blocked on everything, and treated like a stalker.\n\nI only want the best for her. The last month and a half ive tried to get over her with rebound women, and to no avail. I think i can’t move on because i was never able to leave the relationship on civil terms and it eats me alive. I constantly feel like I have failed and wasted the last 5 months of my life. I respect her decision to leave me, but I just wish she showed that she cared about my feelings by allowing us to part ways on good terms. How can she be okay with ending things like this and becoming complete strangers?\n\nI tried contacting her to ask to be unblocked and she just keeps threatening me with calling the police. It breaks my heart because i felt like we had a great relationshop and now she acts like i’d go out of my way to hurt her, which id never do.\n\nPlease give me some advice to move on",
        "created_utc": 1678894261,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21m) can’t move on from my ex girlfrien(21f)",
        "author": "Dalschn",
        "url": "https://www.reddit.com/r/relationships/comments/11rzr89/i_21m_cant_move_on_from_my_ex_girlfrien21f/",
        "text": "[removed]",
        "created_utc": 1678894173,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i (21f) tell my bf (21M) about a mutual acquaintance that i hooked up with before we got together? pls read for details its more complex",
        "author": "nnubuvtcc",
        "url": "https://www.reddit.com/r/relationships/comments/11rzr5f/should_i_21f_tell_my_bf_21m_about_a_mutual/",
        "text": "[removed]",
        "created_utc": 1678894168,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (20F) don’t know how to support my boyfriend (21M)",
        "author": "throwawayokay2234",
        "url": "https://www.reddit.com/r/relationships/comments/11rzp4n/i_20f_dont_know_how_to_support_my_boyfriend_21m/",
        "text": "Posting anonymously as my boyfriend has a Reddit account and I also want to respect his privacy as much as possible!\n\nI have a sensitive topic that might me triggering due to issues of consent. I want to be as empathetic as possible to all parties involved and need advice with how to proceed:\n\nMy (20F) boyfriend (21M) of 2 years has a friend (20F) who I was uncomfortable with because it was very clear to me that she was interested in him. I’m not usually a jealous person, but I told my BF I wasn’t comfortable with him spending time with her alone.\n\nDespite this, he went on vacation with her behind my back and met up with her frequently in secret which I found out via text messages that popped up on his phone. When I asked him about this, he told me that I was a bad girlfriend not to trust him.\n\nI finally confronted him and asked if anything had happened with her. He denied it at first and then finally admitted that they had slept together on multiple occasions. Later, he explained that it wasn’t his fault, and that it was nonconsensual .\n\nHe said that they slept together a few times because she had pushed the issue and she made him uncomfortable. He also said that he only met her to hang out to prove to himself that he wasn’t a victim and that he was struggling with it.\n\nI’m not sure how to proceed. I want to support him through this but I’m struggling with my own emotions at the same time. I guess I just need some advice on how to handle this while still respecting everyone involved.\n\nTLDR; I asked my boyfriend not to hang out with a girl who was hitting on him and he secretly went on vacation with her and met up with her behind my back. I found out later that they had slept together on multiple occasions but that he felt it was nonconsensual. I want to be supportive and respectful, but I’m struggling with my own emotions. I don’t want to be selfish - how can I proceed?",
        "created_utc": 1678894043,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner wants to move to a new city for their dream job, but I don't want to leave - what should we do?",
        "author": "anexcellentposter",
        "url": "https://www.reddit.com/r/relationships/comments/11rzp3r/my_partner_wants_to_move_to_a_new_city_for_their/",
        "text": "[removed]",
        "created_utc": 1678894042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (26M) says I (30F) disrespected him? Been together 2 years…",
        "author": "Alongcamepolyam",
        "url": "https://www.reddit.com/r/relationships/comments/11rzmw6/boyfriend_26m_says_i_30f_disrespected_him_been/",
        "text": "Boyfriend (M/26) suggested going to a new restaurant last night. My dad joined us. The dining experience was mixed. The waitress was friendly but perhaps a little ditsy and forgetful. She forgot my BF’s drink and had to be asked a second time to bring it around. They just ran out of some of the menu items so we ordered something else. My BF’s food came out first. We told him to eat his food so it didn’t get cold but he only nibbled on his sides and waited for our food to come to eat, which wasn’t until 5-10 minutes later. The waitress dropped the bill off at our table and I put my card down to pay (it was my turn, we switch off on paying). The waitress came by with a handheld card reader but I was still eating and my fingers were sticky so my boyfriend looked at the bill and handed her the card. As he was looking at the receipt he noticed they up-charged for one of his sides, which we weren’t told about. He asked the waitress about it and she explained that the side he chose was a ‘premium’ side and that’s what the up charge was for (to note- it didn’t say this on the menu). She said she probably should have told us when we ordered and was sorry, but wouldn’t remove the upcharge. My boyfriend got very upset but paid with my card regardless and signed for me. As I was finishing up eating I asked where my card and receipt were because they weren’t on the table. He said he put them in his pocket and then handed it to me. When I looked at the receipt I noticed that there was no tip given. So I went to reach into my purse to grab some cash to leave. At this point my BF tells me not to leave a tip, and that the waitress doesn’t deserve it. That she gave shit service and doesn’t deserve a tip and that his food was cold. I explain to him that the service was great but it wasn’t so bad as to not tip her and that although it wasn’t the best experience that I would still like to come back to the restaurant at some point in the future and try some different menu items, and if I don’t leave a tip I’ll never be able to come back. I’ve worked in the service industry before, it’s just bad etiquette. BF gets angry with me and tells me that not only does he not want me to tip but that he doesn’t want me to come back to the restaurant because of solidarity. I explain that it’s my money and I was choosing to leave a tip. This squabble continues for a few minutes and he ends up walking out. I tipped the waitress but not the full 20%, which I believe to be on par with the service provided. \n\nThe remainder of the night went in silence and when we went to bed he refused to cuddle or anything. He told me that I disrespected him and that it made him not want to respect me in return. He said that I used my paying as a way to disregard his feelings and opinion and it made him want to put himself in a position of power to never be in that situation again…\n\nAs of this morning, he is still being icy towards me. Am I missing something here? Did I disrespect or undermine my BF? \n\nTLDR; my boyfriend feels disrespected by me because I tipped a waitress when he didn’t want me to.",
        "created_utc": 1678893910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help With Love",
        "author": "Dangerous-West-2748",
        "url": "https://www.reddit.com/r/relationships/comments/11rzlm9/help_with_love/",
        "text": "[removed]",
        "created_utc": 1678893831,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (37F) Ex-husband (37M) wouldn't let my youngest daughter (8F) to be at my wedding. Please help me.",
        "author": "Less_Sentence4323",
        "url": "https://www.reddit.com/r/relationships/comments/11rziz4/my_37f_exhusband_37m_wouldnt_let_my_youngest/",
        "text": "So I need to give some back story, My husband (37M) and I (37F) have been divorced for 6 years now. We have two daughters, Emily (16F) and Gaby (8F) and was happily married for 10 years. My husband cheated on me with a freshman in college and left me for her. It was hard for me. I was in so much emotional pain. It wasn't just his cheating but also how he said he hates me and that I looked ugly. He even said something on the line like \"I was not as tight as I used to be\". You can imagine my pain. It gave me some serious trust issues. I couldn't forget what he said to me during our divorce. Emily knew why we divorced and she held some resentment towards her father for that. Gaby was too young at that time. Nonetheless he was a sh!tty husband but a good father to both of them. We shared custody. The girls would be with me from Fri-Mon. I tried my best but from time to time I would spiral. I have been in and out of therapy since my divorce. I met my now husband Ben (41M) 4 years ago. We met because we worked in the same building and I was crying on the roof of the office building. Ben was there too when he saw me. He asked me what happened and I just bawled my eyes out because that day was my wedding anniversary and that was the same day my ex decided that he would get married to his AP. Ben listened to my concerns and stayed with me the whole day to make sure I was fine. He even dropped me to my house because I was too emotionally unstable to drive myself. From there we started dating. He told me his story about how he lost his wife and only daughter 10 years ago in a car accident. He was really fond of my daughters as well. Emily has started to call him dad after a year of us dating. Gaby also calls him \"daddy Ben\".\n\nI was finally healing and getting back to my old-self. Ben was really nice and caring. We welcomed our son a year ago. My girls are happy to have a brother. He proposed to me when I was pregnant and we had been planning for our wedding since then. Now, here is the issue. Emily is one of my bridesmaid. Gaby is my flower girl. Emily is old enough to choose which parent she wants to live with. So there was no issue from her part. But Gaby was still going back and forth from my house to my ex's house. My wedding is in 2 weeks. My ex was fine with it. I spoke to him many times to make sure that he drives Gaby to my mother's place but now he refuses. He says that he only gets to see his daughter 3 times a week and he is not willing to give up his days for some \"party.\" I told him he could take my days for a week and let her be at the wedding. He says he will not let Gaby go. The wedding is on a Tuesday which means Gaby would be with him. I cannot change the date because everything is booked. Please give me some advice. We have argued a lot and I don't think I can go through any emotional pain with this ever again. Gaby would be heartbroken because she is really excited to be flower girl.\n\nTL:DR: My ex-husband won't let my youngest daughter to be at my wedding because he thinks it is his day so he should spend time with her.",
        "created_utc": 1678893670,
        "upvote_ratio": 1.0
    },
    {
        "title": "The spell has been broken",
        "author": "mathistdificil",
        "url": "https://www.reddit.com/r/relationships/comments/11rzg5q/the_spell_has_been_broken/",
        "text": "TL;DR: Used to be heavily attached to my wife but not anymore (hopefully) \n\nMe (M32) and my wife (W30) have been married for 4 years now, we a 3 year old daughter. Since the beginning of the relationship she was clearly the one with the power, if things didn't go her way, she would just say that she might just leave me. I was so attached to her that sometimes I would cry asking her for forgiveness even when I did nothing wrong, just to be ok with her.\n\nRecently she opened my phone and saw a chat I had with a coworker (W30), there was nothing bad in that chat, just a friendly casual conversation, for reference I don't talk to her often, I don't talk to any women on a daily basis, just the casual morning chat since I work from home.\n\nShe immediately sent me a message telling me that she would cheat on me but we will remain as a couple for our daughters sake and that I didn't agreed to this she would just leave.\n\nThe most impressive thing after that was that I no longer felt attachment, a year ago I i would have cried, begging her for mercy. Not that day, I told her I didn't wouldn't want to be married to an unfaithul wife. Since then (2 weeks ago), she has been mean to me at times and some other times she is just nice.\n\nWhat should I do now? I feel like a castaway that just found land for the first time in 4 years.",
        "created_utc": 1678893508,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think the spell has been broken",
        "author": "mathistdificil",
        "url": "https://www.reddit.com/r/relationships/comments/11rzeun/i_think_the_spell_has_been_broken/",
        "text": "[removed]",
        "created_utc": 1678893425,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think the toxic relationship spell has been broken",
        "author": "mathistdificil",
        "url": "https://www.reddit.com/r/relationships/comments/11rze7i/i_think_the_toxic_relationship_spell_has_been/",
        "text": "[removed]",
        "created_utc": 1678893388,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am obsessed with my ex best friend(22F) who I feel abandoned me (22F)",
        "author": "who_are_you123",
        "url": "https://www.reddit.com/r/relationships/comments/11rzdg3/i_am_obsessed_with_my_ex_best_friend22f_who_i/",
        "text": "So I was best friends with this girl since we were 16. At one point she started hanging out with another girl and they acted like a clique together and now they're still best friends and I've been thrown out. I talk to this \"new\" girl and see her here and there she's really nice and she's grown from her \"mean girl\" times.\n\nMy ex best friend however has completely ghosted me, I hung out with her a couple times like 1,5y ago and we had fun but now she just doesn't respond. She came out w me and my fiance (who I met 1,5y ago) last year cus she had nothing else to do. Then she takes literally months to reply to my messages and I know she sees other ppl and messages them regularly. It's just rly hurtful. Like I feel there's smthn wrong w me. I'm suspected autistic by a psychiatrist and it's pretty standard stuff for autistic girls to get ghosted by their girlfriends and left out (which happened all my life so it kinda hurts even more cus I thought I finally had nice friends) but I'm not sure I'm autistic so take it with a grain of salt lol...\n\nI get really enraged STILL even though it's been years since we were close. We hung out literally everyday and I had so much fun with her and never had a sweet friendship like that before or since.  I had literally JUST forgotten abt her like few weeks ago, means she wasn't disrupting my thoughts and feelings. And today, my other friend txt me if I want to go somewhere cus this ex bff of mine invited her there. I just get enraged on the inside. I just want to forget abt her because mainly I feel like I'm boring as a friend since I get ghosted. And it hurts. And that ppl just switch me for cooler company when they get the chance. I feel also pathetic for feeling this way and I can't stand it. Then there are all these people saying \"if you always get left out you're the problem\" and it hurts cus Idk what i did.\n\nTl;dr even after years I'm bothered by constant feelings of inadequacy and anger after my friend abandoned me in my experience (not necessarily true)",
        "created_utc": 1678893344,
        "upvote_ratio": 1.0
    },
    {
        "title": "i snooped through my bf (M25) stuff and got my (F24) feelings hurt",
        "author": "catluvrrr23",
        "url": "https://www.reddit.com/r/relationships/comments/11rz77x/i_snooped_through_my_bf_m25_stuff_and_got_my_f24/",
        "text": "[removed]",
        "created_utc": 1678892976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey I’m looking for a man for long time relations",
        "author": "anjelaeyes",
        "url": "https://www.reddit.com/r/relationships/comments/11rz1mb/hey_im_looking_for_a_man_for_long_time_relations/",
        "text": "[removed]",
        "created_utc": 1678892645,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (31F) boyfriend (33M) has been getting on to me about my finances, when I’ve told him I’m on top of everything. How do I get him off my back?",
        "author": "THROWRA-confusedgf-",
        "url": "https://www.reddit.com/r/relationships/comments/11rz1gw/my_31f_boyfriend_33m_has_been_getting_on_to_me/",
        "text": "This happened two days ago and my boyfriend and I have been arguing about it since:\n\nI work in homeless services, and lately one of my clients has been carrying his belongings in a garbage bag. I had this really nice northface back that I got a few years ago, but didn’t really use it. I wanted to give this backpack to my client so he could comfortably carry his things in. I was sharing this with my boyfriend and he was more concerned that I just gave away a really nice (and expensive) backpack when I could have sold it instead. I explained to him that I got it years ago, didn’t end up liking it after using for a while, and I also got it with a gift card so it’s not like I actually used my money. He thinks I just throw money away by giving away things I don’t want anymore.\n\nFor example (these are examples he gave), when he lost his AirPods, I gave him my old pair. These shirts that I thrifted 10 years ago, I gave them to him because they were more his style than mine anyway. He just thinks I just throw away money. \n\nI also like really nice things like jewelry, purses, and nice clothes. I don’t really spend a lot of money all the time, but sometimes I like to spoil myself every now and then with the money I earned for all the hard work I do at work. His biggest concern is that I (we both do, but I have more in student debt) and we both pay off our student loans and then when they are paid off, we can spend money on whatever I want. That sounds really nice, but I’m probably going to be paying off my loans for the next 30-40 years, maybe 50, or until I’m off this earth, regardless, I don’t want to stress myself out, and literally just be working to pay them off. I’m on top of my loans, and my bills every month, and still have money left over. I don’t always spend it, but again, if I see something I like and it’s not going to put me in a financial bind, I might get it. \n\nHe would rather spend money on experiences, rather than materialistic things, and he thinks I’m being materialistic when I don’t believe I am. \n\nThis whole argument has made me feel like I did the wrong thing and questioning if I am in the wrong about everything and am hoping to hear others perspective.\n\nTLDR: my boyfriend won’t get off my back about how I spend my money.",
        "created_utc": 1678892634,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Women; How often do you think about relationships like this?",
        "author": "Kangologist",
        "url": "https://www.reddit.com/r/relationships/comments/11rz09p/for_women_how_often_do_you_think_about/",
        "text": "Hi,\n\nMy girlfriend has had 3 previous sexual partners before me (1 relationship, 1 hookup, and 1 douchebag situationship I'll explain). I have had 0 previous partners before her because I was waiting to meet the one I want to marry. We are very close so I asked her about her past relationships and how they affected her so I got to thinking about how often does she think about it? She says never unless I ask her about it but I'm curious about the average woman if they think about it much. I'm going to explain each situation so that you have some context;\n\n1- The first boyfriend met at work, would see him once a week at her place during covid and would most of the time have sex and do nothing else. He never took her on a date, and the last time they ever saw each other he asked for sex, she said no, and then when he got home he broke up with her by text after 5 months together.\n\nShe was hurt by this and a few months later was looking to be loved so she got Tinder, then comes number 2.\n\n2- She saw him 4 times in a span of 2 months and hooked up, after each hookup she would drive home crying because she didn't feel loved and regretted it. She also knew she never wanted to be with him for anything but a hookup because he was a douche.\n\n3- A few months later she starts crushing on this guy from work, she becomes very obsessed, making drawings for him, writing his name everywhere... At one point he said he liked her, but ended up using her. He would tell her to send him nudes, and would use tactics like, \"if you truly liked me you would send me nudes\" when she said no. And then she would send nudes/videos out of guilt, but feel horrible about it. They hooked up 4 times in the span of 2-4 months, where they would drive to meet each other, he would say \"I love you\" just to have sex and then leave. He even convinced her to go in raw as \"it feels better\" and if she loved him she would let him. She always ended up driving home crying because she was not being loved.\n\nThat's 3 men, that never once put in the effort to take her on a date or to give her love and I genuinely feel bad for her as she doesn't always make the best decisions.\n\nI'm glad I met her when I did because she needed love and I give her all my love every day. She needed confidence, which is what I give her, and she needed a best friend, which is what I am to her. Although I sometimes get mad when thinking about her past because I want to break the skulls of the men who treated her like that, I now accept that her past is what brought her to me.\n\nShe's everything to me, and we know one day we will get married.\n\nBut in situations like the ones I explained above, in your experience, how often would you think about these men?\n\ntl:dr how often do you think about your ex’s like these",
        "created_utc": 1678892563,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Women; How often do you think about past relationships like this?",
        "author": "Kangologist",
        "url": "https://www.reddit.com/r/relationships/comments/11ryxxv/for_women_how_often_do_you_think_about_past/",
        "text": "[removed]",
        "created_utc": 1678892431,
        "upvote_ratio": 1.0
    },
    {
        "title": "bf(19M) used to getting sex from past partners but is with me (18F) who is a virgin and won’t participate in sexual stuff until marriage",
        "author": "Academic_Platform935",
        "url": "https://www.reddit.com/r/relationships/comments/11ryq2v/bf19m_used_to_getting_sex_from_past_partners_but/",
        "text": "basically, my boyfriend is my first boyfriend and we have expressed each others minds on sex. he has had it before where as i haven’t and this is practically my first relationship. nor am i going to participate in it until i’m married. but i wanted to ask for serious advice, is it okay if i joke around about having sex and stuff or if he says “smd” i say “say less” or something? i say it as a joke and he knows i would never but i was wondering if i should stop incase it triggers something in him which causes him to ask me to do it or maybe do it with another girl in the future?. before we got together i told him the reason why i wouldn’t want to be with you is because i don’t want you to be tied to me and not get what you’re used to getting which is sex. he said it’s fine and he isn’t with me for sex and he saw comfort in me when we first met, that’s why i proceeded with the relationship. but i wanted advice if i should continue making these jokes or should i just avoid them to avoid future questions about sex? i feel like men would know more about this if they were put in this situation so it would be nice to know from a males perspective.  \n\nTLDR - me(18F) joking around with my bf (19M) about sex even though i would never do it until marriage. should i stop or is it fine ?",
        "created_utc": 1678891960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this Abuse ?",
        "author": "Lolly_Ava_",
        "url": "https://www.reddit.com/r/relationships/comments/11rypn4/is_this_abuse/",
        "text": "[removed]",
        "created_utc": 1678891933,
        "upvote_ratio": 1.0
    },
    {
        "title": "(18m) Love at first sight with a girl in high school, what should I do?",
        "author": "ThrowRAKleptos",
        "url": "https://www.reddit.com/r/relationships/comments/11rynx6/18m_love_at_first_sight_with_a_girl_in_high/",
        "text": "[removed]",
        "created_utc": 1678891834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend doesn’t want sex as much anymore",
        "author": "Throwawayanxbay",
        "url": "https://www.reddit.com/r/relationships/comments/11rybc3/boyfriend_doesnt_want_sex_as_much_anymore/",
        "text": "My (20F) boyfriend (20M) and I have been living together for a year, together for about a year and a half. (I know we moved in soon but it worked in our favor at the time so we just did it). \n\nOur sex life started like any new relationship, all the time. It then slowed down to about twice every week, maybe anywhere about 6-10 times a month before my period. \n\nNow, just in the past 2 months, it’s been about once every week and a half, about only 3-4 times a month. Most of the times it feels like me initiating or that he initiates a day or so after I put the idea in his mind. \n\nI know it’s normal to have a slow down I just can’t stop shaking the feeling it’s me.  I’ve been struggling a bit with my mental health which probably doesn’t help in the department of sex. I just stopped taking birth control for health reasons (will be off it for 6 months before doing other options and talked with my doctor). I know my libido might be a lot higher off of the pill. \n\nHe still calls me beautiful, even yesterday he kept calling me pretty and saying I’m his and all these sweet things. He’s been helping me through my mental health struggles, even though it hasn’t been easy. He tells me there’s nothing wrong with me, I’m still beautiful, he says he’s just been busy with work and working out a lot. \n\nHe goes to the gym 5 days a week, I started going with him because our work schedules don’t line up all the time so we just get Monday and Tuesdays off together and don’t see each other much the rest of the week. We are pretty short on time and would only have time really late at night or on our days off where most the time we just want to be lazy.\n\nRight now, I don’t have a big libido, so the amount of sex isn’t the problem, more so I feel invalidated if he doesn’t want sex with me. And also my libido might become high off the pill, so I won’t know know what to do then. \n\nIs there a way to make time for sex? I feel it’s so awkward to set time for it if you both aren’t in the mood, but I also don’t want to just live a sexless life at some point. Is the slow down normal for how long we’ve been together and living together? \n\nTLDR; A sexual slowdown between me and my partner.",
        "created_utc": 1678891085,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 weeks is almost over!!",
        "author": "E4brat",
        "url": "https://www.reddit.com/r/relationships/comments/11ryb7l/2_weeks_is_almost_over/",
        "text": "[removed]",
        "created_utc": 1678891077,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (m24) girlfriend (f23) wants to be friends with her ex",
        "author": "ThrowRA_himj",
        "url": "https://www.reddit.com/r/relationships/comments/11ry927/my_m24_girlfriend_f23_wants_to_be_friends_with/",
        "text": "My (m24) girlfriend (f23) wants to be friends with her ex.\n\nMy girlfriend is bi, her last relationship was with a woman, they ended on good terms a while ago and knew they’d wanna be friends at some point. \n\nNow I’m in a relationship with her and it makes me a bit uncomfortable to know she wants to hang out with her ex .. she reassures me there are no romantic feelings from either side, and also she’s the one who ended the relationship a few months before me and her met. She believes relationships can evolve and change from romantic to platonic, especially if the basis of it was friendship and it just didn’t work out in the end. I initially did tell her I don’t like that she’s being friend with someone she used to be intimate with but she insists this is important to her. It seems to me that my feelings aren’t her priority and almost as if she’s choosing her ex over me. \n\nHer ex doesn’t live in the same city so they see each other very occasionally. But the fact that she wants it still bothers me… \n\nTD;LR: am being reasonable here or should I just trust her.",
        "created_utc": 1678890946,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (m24) girlfriend (f23) wants to be friends with her ex.",
        "author": "ThrowRA_himj",
        "url": "https://www.reddit.com/r/relationships/comments/11ry65l/my_m24_girlfriend_f23_wants_to_be_friends_with/",
        "text": "[removed]",
        "created_utc": 1678890775,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to survive the 3 weeks til therapy?",
        "author": "CutestCatfish",
        "url": "https://www.reddit.com/r/relationships/comments/11ry5v8/how_to_survive_the_3_weeks_til_therapy/",
        "text": "My fiancé (34m) and I (36f) have officially decided to seek couples counseling. We've been together 2 years, known each other for 2.5 roughly. We have about 3 weeks left before our intake appointment.\n\nToday, I am incredibly frustrated and mad. And frankly, if I'm honest, I don't feel like pushing it down or playing \"nice\" with him (which is usually how we handle things... hence needing therapy to work on communication). I'm kind of tired of sparing his feelings every time he's in the wrong. I don't want to add fuel to the fire, but a lot of the last year has been me trying to convey maturely that he's done something to upset me, and him getting upset with me for wanting to \"stay mad\" and \"hold it against him indefinitely.\" He doesn't understand that it's important to let each other feel our feelings.\n\nThe incident in question? I have slept terribly for the past two days. He knows this. I opened up to him yesterday via text about how exhausted I am. I'm also having a couple of minor health things, nothing major, but it's all at once so in general I am very physically taxed. And I got a stress bomb dropped on me at work concerning getting hired next year, to give a summary. Even with all this at the forefront... about an hour after lying down to sleep, he decides he randomly needs to make out with me, and keeps trying when it's clear I'm tired and not into it. In the middle of the night, he grabs my belly fat and squeezes it, something I have asked him multiple times to stop doing because I hate it and it makes me feel self-conscious. I moved away subtly. Then some time later, he grabs my ass. I finally huffed in frustration, very loudly, and went to the other side of the bed. Him being in horny teenager mode does not overrule my need for rest. It felt so inconsiderate, especially when he is well aware I am a very light sleeper and anything and everything wakes me up.\n\nSo... how should I handle this? I really just want to tell him I'm pissed and I'm going to be pissed until I'm done being pissed. But I recognize that I may not be handling this is a way that reflects \"good communication,\" which is the whole goal, and I should practice what I preach. And in general, how should I be approaching disagreements between now and our first session? I just feel like we've reached a point where communicating with the tools we have is toxic and unproductive, but repressing everything isn't going to help either. Any advice on tackling issues between now and then?\n\nTL;DR: My fiance pissed me off by not caring about my sleep, and idk how to approach the subject. How do we handle disagreements between now and starting therapy?",
        "created_utc": 1678890758,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25F) earn more than my boyfriend (34M). Is this a problem?",
        "author": "randomtigerx",
        "url": "https://www.reddit.com/r/relationships/comments/11ry4xz/i_25f_earn_more_than_my_boyfriend_34m_is_this_a/",
        "text": "Tldr: I am making $150k and he is making $110k, however my career means I have a higher earning capacity. Wondering if this will cause issues later and what are things I can do to prevent this? \n\nFirstly, I’d like to say my boyfriend and I are both in very fortunate positions. We both make good incomes however I am earning more than my boyfriend given my career choices despite him being 9 years older than me. He also works in a more unstable industry whereas my salary will continue to grow at a steady rate. There is the possibility that as he gets older, promotion opportunities become more rare so the difference in income could get larger.\n\nWe’ve been dating for close to a year and things are getting more serious, we are thinking of moving in together. I’ve never been in a relationship where I earn more than my partner, so just trying assess whether this will become an issue e.g. if/when we have kids and if I choose to reduce to part time work. Outside of finances, I’m also scared of how this will be perceived by family and friends. \n\nDoes this seem like an issue to you? Have you been in a similar scenario and how did you navigate it?",
        "created_utc": 1678890704,
        "upvote_ratio": 1.0
    }
]