[
    {
        "title": "My boyfriend (19m) and I (19f) aren’t as intimate anymore because of my anxiety",
        "author": "BackseatTango",
        "url": "https://www.reddit.com/r/relationships/comments/11pjjo9/my_boyfriend_19m_and_i_19f_arent_as_intimate/",
        "text": "My boyfriend and I are in a great relationship, he doesn’t mind that we don’t have sex as often but I love how happy he gets when I say we can do it so I kinda force my body to get turned on sorta.\n\nThe issue is that my family is strict and doesn’t know about him, we can only meet up at certain times and I can’t bring my phone or anything because I’m tracked by my family. We also don’t have enough time to drive to his house because he lives in the town over. His family knows about me and loves me, they’re very chill with my boyfriend and make jokes about making sure he wears a condom etc. (which I enjoy because I don’t get to laugh about those things with my family)\n\nThis all leads us to one option pretty much, parking lots. Which was also great because I’m a jeep girl (he has an old ass jeep) and I always made jokes about how doing it in the back of a jeep was on my bucket list. This used to get me in the mood even more. We even have a tarp to cover the windows with. However it all went downhill in January when him and I were being pretty wholesome. A coo pulled up in front of us and questioned us about doing drugs. (We both hate drugs and don’t befriend anyone who uses) We didn’t get any tickets or arrested but it put a paranoia in me. My parents would kill me if I got so much as a speeding ticket, getting arrested for hanging out with my boyfriend would make them even more furious.\n\nSince then I stopped being as intimate. I always have this fear that my parents are gonna find out and it gives me really bad anxiety. I don’t care if I get arrested for it, if anything that sounds like a great legacy to get arrested for and my boyfriend is a tradie too so he’ll be praised by his coworkers for it. I do care about my parents beating me and disowning me. I don’t know what to do or how to put my mind at ease. Any advice would be great.\n\ntldr: I have strict parents and it’s causing me to have anxiety with my relationship",
        "created_utc": 1678640462,
        "upvote_ratio": 1.0
    },
    {
        "title": "USDT now available for exchange on Sushiswap's platform with a 0.997 exchange rate for USDC/DAI holders.",
        "author": "Fragrant-Relation470",
        "url": "https://www.reddit.com/r/relationships/comments/11pjjfr/usdt_now_available_for_exchange_on_sushiswaps/",
        "text": "[removed]",
        "created_utc": 1678640449,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22F) have an ex (25M) that I am talking with again, and it's bitter sweet.",
        "author": "MeltingPurpleSlush",
        "url": "https://www.reddit.com/r/relationships/comments/11pjgol/i_22f_have_an_ex_25m_that_i_am_talking_with_again/",
        "text": "As the title says, I've gotten back into contact with my ex. Our relationship ended about 2 years ago, and I have never experienced this level of hardship when it comes to getting over someone. We were only together for six months when I broke up with him due to feeling like I was being taken advantage of. He used my money without permission (actually took pictures of my debit card behind my back). He cut me off from all if my friends, because he didn't like me spending time with other people... not even my family. There was so much more as well, but I'm trying to keep this short. I asked for advice on this relationship before and I was advised to leave. I did, and since then I have desperately tried to get over him. I still cry to this day over how much I miss him. He gave me this feeling that I associate with what I believe being in love feels like. I have yet to feel it with anyone else. Anyways, we got into contact again, because he requested me on Instagram. Deep down I hoped he had maybe changed, but speaking with him only makes me realize that he's exactly the same... and I still love him regardless. It's extremely frustrating.\n\nI guess my question is... what is your opinion on love. Do you think that you should fight against all the problems that don't work in order to keep the person who has given you these strong feelings? I guess my biggest fear is that he's the only one I will feel this for. That he is the \"one\" and I'm giving that up. Anyways, just curious as to what everyone thinks... because it's a question I have been unable to answer for myself. \n\nTL;DR Do you believe there is such thing as the one? That you only fall in love once?",
        "created_utc": 1678640276,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F25) co worker (M30) is accusing me of blaming him for my mistake",
        "author": "Repulsive_Exam9239",
        "url": "https://www.reddit.com/r/relationships/comments/11pjghw/my_f25_co_worker_m30_is_accusing_me_of_blaming/",
        "text": "[removed]",
        "created_utc": 1678640265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning Down Invitations Often",
        "author": "J-Hobbs",
        "url": "https://www.reddit.com/r/relationships/comments/11pjdo6/turning_down_invitations_often/",
        "text": "\nMy friend Z (31) asks me (M, 31) to hang out at least two times per week. I communicate with my friends every other day VIA social media.\n\nI'm an introvert. I don't like to go out often. I like to keep to myself and go out to socialize once to twice per month. I live alone, and wouldn't mind company here but people tend to get bored fast sitting on the couch and talking/watching virtual entertainment. \n\nAlso, it sounds like I'm making excuses but I'm battling linglong depression as the last five years of my life have been very difficult. Regardless, I don't like to go out often. I will go for more walks alone, by myself rather than with a friend.\n\nI've told my friends this. I've told them: I'm an introvert, I don't like to go out often, I enjoy my solitude. I've also shared with my friends my depression and am very open about my issues: lost my parents five years ago, gf left me three months ago.\n\nBasically, my friends continue to invite me out. And I appreciate it. I want to be invited. However, they often say that I always make excuses. Sometimes I do but I have a lot of problems and feel that if I turn down an invitation it shouldn't be regarded as rude or an excuse. \n\nI also suffer from chronic health issues that prevent me from living my life to the fullest.\n\nWhat do you think?\n\n\nTL;dr Friends invite me out often, I am an introvert battling mental and physical health issues.",
        "created_utc": 1678640080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend Asks To Hang Out Too Much",
        "author": "J-Hobbs",
        "url": "https://www.reddit.com/r/relationships/comments/11pjc5q/friend_asks_to_hang_out_too_much/",
        "text": "[removed]",
        "created_utc": 1678639980,
        "upvote_ratio": 1.0
    },
    {
        "title": "M 66 asking if he should end engagement to F 49 due to her M 16 son’s misbehavior",
        "author": "AmbitiousStudy148",
        "url": "https://www.reddit.com/r/relationships/comments/11pj6fc/m_66_asking_if_he_should_end_engagement_to_f_49/",
        "text": "[removed]",
        "created_utc": 1678639613,
        "upvote_ratio": 1.0
    },
    {
        "title": "me (21f) and my boyfriend (22m) are at a crossroads of whats best for our relationship",
        "author": "geminibabyyy444",
        "url": "https://www.reddit.com/r/relationships/comments/11pj5do/me_21f_and_my_boyfriend_22m_are_at_a_crossroads/",
        "text": "tl;dr my mental health is straining our relationship and im unsure what to do for whats best for him/us. \n\nive been seeing my now boyfriend for about 8-9 months and he met me when i was in a wonderful place in my life and has given me one of the best relationships ive ever had. i unfortunately took an edible with him 6 months ago and it left me with some trauma because of how bad of a trip ive had. i sometimes blame him for bringing the edible to my house and \"ruining my life\" even though i know it isnt true and i am to blame for taking it. i love him a lot and we dont want to break up but my mental health is the worst its ever been and i dont even feel like the same girl he started dating. we have been wondering if to take a break for me to get the help i need despite us both not wanting to be apart (im going monday to talk about trying zoloft and a therapist on the 20th). this is a really hard decision for us to make and i just wonder if its even the right thing to do. we are taking a few days to decide whats best but in the end we still want to be together just maybe once i can heal some and get some real help. thanks to anyone who reads and just can send me some good vibes or advice.",
        "created_utc": 1678639546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have I been ghosted or should I be concerned?",
        "author": "Boredgirl03",
        "url": "https://www.reddit.com/r/relationships/comments/11pj3xe/have_i_been_ghosted_or_should_i_be_concerned/",
        "text": "[removed]",
        "created_utc": 1678639457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i wrong for feeling uncomfortable that my girlfriend talks to her baby dad constantly?",
        "author": "Mannuel500",
        "url": "https://www.reddit.com/r/relationships/comments/11pj3w5/am_i_wrong_for_feeling_uncomfortable_that_my/",
        "text": "[removed]",
        "created_utc": 1678639455,
        "upvote_ratio": 1.0
    },
    {
        "title": "me (21f) and my boyfriend (22m) are at a cross road of what to do for our relationship. any advice/kind words is appreciated.",
        "author": "geminibabyyy444",
        "url": "https://www.reddit.com/r/relationships/comments/11pj30o/me_21f_and_my_boyfriend_22m_are_at_a_cross_road/",
        "text": "[removed]",
        "created_utc": 1678639400,
        "upvote_ratio": 1.0
    },
    {
        "title": "I kissed my best friend (update)",
        "author": "Zealousideal_Menu219",
        "url": "https://www.reddit.com/r/relationships/comments/11pj0lp/i_kissed_my_best_friend_update/",
        "text": "This is part two because I'm not quite getting help on the update.\n\nOkay, so, I(trans ftm, 18) asked my friend(genderfluid 18) who kissed me if I can tell my partner(F19) about it or if they'd want to keep this between us. They said they'd like to keep it a secret. Is this a red flag? I've been best friends with my friend since forever. Or at least that's how it feels. It's only been a year I've known him. Maybe two? Although, I've known my partner for almost 4 now though. Please give me advice on what to do next.\n\nTL;DR\nI asked the friend I kissed if it should be just us or if I can tell my partner. They said secret. Red flag or no?\n\nPart one:\nhttps://www.reddit.com/r/relationships/comments/11p0e5u/i_kissed_my_best_friend/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "created_utc": 1678639241,
        "upvote_ratio": 0.99
    },
    {
        "title": "I kissed my best friend (update)",
        "author": "Zealousideal_Menu219",
        "url": "https://www.reddit.com/r/relationships/comments/11piwbv/i_kissed_my_best_friend_update/",
        "text": "[removed]",
        "created_utc": 1678638950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice",
        "author": "AmbitiousStudy148",
        "url": "https://www.reddit.com/r/relationships/comments/11pitmj/need_advice/",
        "text": "[removed]",
        "created_utc": 1678638774,
        "upvote_ratio": 1.0
    },
    {
        "title": "(M25) I keep getting rejected when I try to ask (F25) women to dance. What can I do differently?",
        "author": "ThrowRAsadclubs",
        "url": "https://www.reddit.com/r/relationships/comments/11pisux/m25_i_keep_getting_rejected_when_i_try_to_ask_f25/",
        "text": "I went to my favorite club tonight and I had such a bad time. Yesterday I got several girls to dance with me but today I just kept getting rejected. I went up to this girl and I told her that I liked her style and asked if she wanted to dance. She gave me an expression as if I was just some weirdo and she said I’m good. She looked really uncomfortable. \n\nI don’t mind rejection. Nobody wants to be rejected though. It’s just the way that I get rejected that messes with me. It’s never like a no thank you. It’s always them giving me a weird face and saying something rude. It’s a club. What makes matters worse. That same girl tried her best to start grinding on this other guy after she rejected me. The other guy wasn’t interested but I guess he knew her. \n\nI just feel like maybe I have a bad reputation at that club or maybe I’m a lot more creepy than I think I am. I don’t know, but I don’t know if I want to keep going. The crazy thing is that I’ve had a lot more success just getting behind women and smacking their butts than I ever have actually trying to ask them do dance. I’ve come to the conclusion that they don’t like to be asked. But I also feel like I’m just ugly or something. \n\nTl;Dr women reject me when I ask them to dance",
        "created_utc": 1678638725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I (26F) in a one sided romanticship with a (28M)?",
        "author": "sweet_like_cinnamon_",
        "url": "https://www.reddit.com/r/relationships/comments/11pipe0/am_i_26f_in_a_one_sided_romanticship_with_a_28m/",
        "text": "Td;lr: He hasn’t committed and gives me a ton of reasons why I’m the cause\n\nSo we started dating a year ago but have been on and off for many reasons. He lives with a abusive/toxic roommate and that doesn’t end until August and she did a lot of things to keep us apart. She gaslighted him, texted on his phone to other girls while he was sleep, verbally abused me anytime I would come see him, and physically abused him. He has photos of the abuse. I’m going to table that because it’s a whole story in itself. \n\nThat aside, I feel I’m in a one sided romanticship. We haven’t put an official title on things and he constantly says I’m the reason and I’ve caused it. I’ve been through a lot of childhood trauma of manipulating parents that have caused me to have issues trusting people who say they love me. We are our first loves. He tells random strangers and people at his work that we’re together but when it comes to close friends and family, he doesn’t. There’s this family that visited from out of states that him and his toxic roommate are friends with and he called me a friend to them just last week. He doesn’t really understand it gets my hopes up when he does that. We’ve been doing this for a year. \n\nAnytime I tell him what bothers me or finally have enough he calls them “anxiety texts” and says those are a reason he won’t commit. He loved when I told my family about him. He even added them in social media and just got happy about it. When I asked for the same thing back he said he can’t tell his family until I start showing “better behavior” but he is glad to tell them about me now but he’ll include all the bad things I’ve been doing if he does. \n\nHe doesn’t make time to see me. I have to drive an hour to see him even though I don’t currently have a job right now. Everything is on his time. When he didn’t have a job and I did, I would still come see him. But now he says he’s “too busy and I need to understand that.” Whenever I try to break it off he threatens to call the police in my mother even though he knows I’ll be homeless. Not sure what to do. \n\nHe also called me manipulative and condescending. He’s never been in a relationship before but says he’s so good at relationships and gives others relationship advice.",
        "created_utc": 1678638504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (25M) GF (25F) going too fast?",
        "author": "Guilty_Storage_7088",
        "url": "https://www.reddit.com/r/relationships/comments/11pimci/is_my_25m_gf_25f_going_too_fast/",
        "text": "This has been on my mind lately. I can't tell if it's me being emotionally disconnected or she really is falling head over heels too fast, or both.\n\nI think my GF is *too* into me for where we are. We've only been dating/going out for two months now. It's her first relationship so I think the feelings are really strong.Let me see if I can think of examples\n\nWithin a month \n\n\\- she made like a digital painting of me and sent it to me (not too difficult, but still)\n\n\\- Set me as her phone screensaver\n\n\\- When I said \"have a safe flight\" she said it made her get very emotional. In general I think she sees pretty small gestures as really big deals, which makes me kinda uncomfortable\n\n\\- Was texting throughout the day (including in the middle of the workday)\n\n\\- Sent goodnight texts every night \n\nIn general I think her feelings are super strong and idk if it's \"too much\"? Like, I remember my first relationship and I think I was similar, but I think that was unhealthy? I was clingy, always thinking about her, kind of intoxicated and putting her on a pedestal. I set really high standards that couldn't be lived up to, and it must've felt uncomfortable because it's not real. \"have a safe flight\" is not a big romantic gesture or anything, so it just feels uncomfortable for it to be interpreted that way, does that make sense?\n\nIdk exactly what my worry is. Maybe that she can get *really* hurt if things don't work out (we're still so early... we dated for a week and made it official which seems SUPER fast). Maybe just getting idealized is not great. I just think it's unhealthy for a relationship to not see your partner for who they really are. idk...\n\nTL;DR: My GF has really strong feelings really early into the relationship, and I can't tell if I'm crazy thinking that it's unhealthy behavior overall and comes from inexperience",
        "created_utc": 1678638294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daughter (30) has bf ( 48). I’m struggling to accept and she wants me to meet him.",
        "author": "garbanzo1962",
        "url": "https://www.reddit.com/r/relationships/comments/11pijm7/daughter_30_has_bf_48_im_struggling_to_accept_and/",
        "text": "[removed]",
        "created_utc": 1678638111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting over first love ex who keeps on coming back into my life",
        "author": "Pristine-Ad-6853",
        "url": "https://www.reddit.com/r/relationships/comments/11pij4k/getting_over_first_love_ex_who_keeps_on_coming/",
        "text": "\nI (23 y.o) and my ex (23 y.o.) had a classic  “first love” story. \nWe met through mutual friends and started dating at 18. It was my first serious relationships and it was very teenager-ish but fun and loving. We were both in college, life was good and we were dumb &amp; young.\nI have to say, that relationship itself had potential but i was very cold and couldn’t give 100% commitment and he desperately needed love and affection all the time. Like i had to prove my love to him: always call, text, saying cute things and i was in my “not like other girls” phase so we were arguing all the time. He was very dramatic and hysterical even. He yelled often and got into drama queen mood. I hated it. I thought that relationships should feel easy and not dramatic. I should be laughing and not crying. He loved calling me cold. We broke up every year and got together every spring on his birthday:) \nI had other guys and every time i chose to start again with my ex. It was like coming back to your home place where everything is known and no surprises waiting for you. \nLast april everything started as usual: i wished him a happy birthday and we started talking again. I was 100% sure that we will be back together. He drove to my house, we spoke all night, i felt like talking to an old friend and it was so refreshing. At one point he told me that he’s moving to Israel. It was a shocker. I laughed it off but it was definitely a sad news. So i decided to get into “femme fatale” mood and have a short last time fling so that he will be thinking about me while living his new life.\nWe decided to rent a flat for a few days and have there our late birthday celebration like in good ole days. We booked a flat, paid and 8 hours before i got a call from him. He sounded very guilty and so frustrated and he said “I don’t wanna lie to you but i have a crush on another girl and i wanna be faithful to her”. It DESTROYED me. For context: this man has been my loyal dog . During our “break ups” he never had anyone. One time he went on a tinder date and got one night stand that was “so bad that i want to forget”. I knew always that i’m his main ex and he will always love me. And no one else. And hearing about him having a crush so serious that he doesn’t even wanna sleep with me – was a disaster. I was very sad, angry and mentally unstable because it felt like betrayal. While he was sitting in a car all night talking to me he already was talking to this new girl. I got into my crazy mode.  I also was graduating from college and stress was doubled = next day started with me having a MASSIVE mental break down that i never had in my life before or during over relationship. I called him crying and looking for closure. I was hysterical and he came to my place. He was very distant, cold and even arrogant because he loved seeing me so desperate for his love since he never got to se me so vulnerable in our relationship.\nWe cuddled and then had sex. I was happy and he was still cold. And at that point i realized that it doesn’t work anymore. He doesn’t want me like he always used to. \nMy mental health got worse. I texted him every day, tried seeing him and was VERY desperate to prove to myself that i’m still loved. \nOne day we met at a park and i burst into tears in his arms and he told me the WORST thing that he could: “Now i feel the same love for you for someone else”. \nThat was our last conversation. It took a toll on my mental and physical state. Probably because we never fully broke up and moved on and he was the first one to do so and not me. I got some health problems from a stress. It was like a delayed post break up stress. \nHe moved to Israel with her since she’s jewish. 6 months later they broke up and she came back and he stayed with his family. A week ago i got a video call from him and we talked like nothing happened. He told me about his life there. It was SO random that i couldn’t even talk properly. He even briefly talked about us getting “fake” marriage so i could get a passport and live there. It was weird. And i was left confused. After that call we didn’t talk and i don’t know if we will. \nBUT my question is– why does it all mean and how i can move on and leave him behind without coming back in any form? \n\nT.L;DR: my ex of 5 years who we had the best/worst first love type relationship came back into my life by randomly calling even tho he lives in another country and had a failed relationship with his new girl that lasted 5 months",
        "created_utc": 1678638079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on a situation in my new relationship. I’m 23F, he’s 30M",
        "author": "Ok-Abalone5478",
        "url": "https://www.reddit.com/r/relationships/comments/11pihsh/need_advice_on_a_situation_in_my_new_relationship/",
        "text": "[removed]",
        "created_utc": 1678637996,
        "upvote_ratio": 1.0
    },
    {
        "title": "am I expecting too much from my boyfriend",
        "author": "Full_Analyst_7366",
        "url": "https://www.reddit.com/r/relationships/comments/11piatb/am_i_expecting_too_much_from_my_boyfriend/",
        "text": "I have been dating my boyfriend around 5 months, at the start everything was great, we were going on dates, he was a proper gentleman and things progressed quickly. We are now seeing each other pretty much every night, he stays over at my house pretty much 6/7 days a week. However, we hardly go on dates anymore, I have brought this up numerous times, but we still don't go on dates or even leave the house apart from to do a food shop. But he no problem making plans with his friends to go places. When it comes to seeing me, all we do is sit in my house.\n\nHe also stuggles to communicate how he is feeling, every time we have an argument about an issue, he just shuts down and avoids talking about the situation and will often go days without speaking to me even though I am upset about something. \n\nI haven't been feeling my best recently, I have a lot going on with work and studying and generally feeling down in general (I have suffered with anxiety and depression for a few years now) I've had a pretty shit week, my car broke down and I've had to get rid of it, I failed my exam and also went for a job interview and was unsuccessful. I am now resenting my boyfriend for not doing more to make me feel better, for example, plan a day out or a nice meal to take my mind off things. Also, we are arguing a lot at the minute and he just avoids speaking to me about why I am upset which is just adding to my stress.\n\nI don't know if my feelings are valid or whether I am punishing my boyfriend for things out of his control because I am feeling down in myself at the minute. Are my feelings valid? Am I expecting too much from him? \n\nTL;DR I have suffered with my mental health for years, my boyfriend isn't doing much to help. Am I expecting too much from him?",
        "created_utc": 1678637531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have a healthy friendship or relationship with a “taker”?",
        "author": "Sea_Calligrapher8255",
        "url": "https://www.reddit.com/r/relationships/comments/11pi9l8/is_it_possible_to_have_a_healthy_friendship_or/",
        "text": "[removed]",
        "created_utc": 1678637451,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it worth breaking up over?",
        "author": "Full_Analyst_7366",
        "url": "https://www.reddit.com/r/relationships/comments/11pi91s/is_it_worth_breaking_up_over/",
        "text": "[removed]",
        "created_utc": 1678637417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have a healthy relationship with a “taker”?",
        "author": "Sea_Calligrapher8255",
        "url": "https://www.reddit.com/r/relationships/comments/11pi723/is_it_possible_to_have_a_healthy_relationship/",
        "text": "[removed]",
        "created_utc": 1678637286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why I (28M) feel too jealous or anxious when my gf (23F) doesn’t respond?",
        "author": "Bani2008",
        "url": "https://www.reddit.com/r/relationships/comments/11pi5fx/why_i_28m_feel_too_jealous_or_anxious_when_my_gf/",
        "text": "\nFor the last week or so I’ve been feeling jealous or anxious when my girlfriend doesn’t respond my texts. We’ve been in a relationship for a year and we communicate very well, but lately I’ve been feeling that for some reason that I don’t know. For example, if I text her and it passes 20-25 minutes I start feeling anxious about the situation.\n\nI’ve had many other relationships and I haven’t felt like that before. That’s not something I want to experience. I understand she has things to do and it would be unfair if she has to be on top of her phone trying to answer me all the time.\n\nHow can I overcome that in your opinion?\n\nTl;dr Why I (28M) feel too jealous or anxious when my gf (23F) doesn’t respond?",
        "created_utc": 1678637178,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (15M) girlfriend (15F) came out as bisexual and I don't think I can trust her anymore.",
        "author": "Sad_Mud_1953",
        "url": "https://www.reddit.com/r/relationships/comments/11pi1f0/my_15m_girlfriend_15f_came_out_as_bisexual_and_i/",
        "text": "Ever since we started talking, I made sure that I told her every single detail about myself so that she felt comfortable telling me the same.\n\nI spilled my guts out but she kept such a crucial part of her identity hidden from me. I don't think I can trust her anymore. \n\nShe told me that this was important to her and that I should be happy that she could finally open up to me. I just think this is fucked up. This should've been the first thing she told me when we started talking (4 months).\n\nI'm also worried about all the girls she's close with. If she's so close with them, what would stop her from leaving me for them?\n\nI have no problem with the fact that she's bi. I'm heartbroken that she told me so late. I'm afraid she might be hiding even more. I'm absolutely hurt she took so long to tell me such an important detail. What should I do? Should I break up with her?\n\nTL;DR: Girlfriend came out as bisexual and I'm scared she's hiding more. I don't think I can trust her anymore.",
        "created_utc": 1678636913,
        "upvote_ratio": 1.0
    },
    {
        "title": "MY GF's FRIEND KEEPS CALLING HER BEAUTIFUL",
        "author": "Dangerous-Society693",
        "url": "https://www.reddit.com/r/relationships/comments/11pi09b/my_gfs_friend_keeps_calling_her_beautiful/",
        "text": " TL:DR My G/F (27) has a friend that she has know for some time, which doesn't bother me she is allowed to have guy friends as long as they are respectful of our relationship. We have been dating for 5 months and everything has been perfect. On the morning of her birthday I woke up and saw that this friend had texted her \"Happy Birthday Beautiful\" it shook me to my core. I addressed the issue I had with her not correct him on that being inappropriate because of our relationship, she had said she didn't see anything wrong with then decided to tell me she had dated him on and off 4 months before dating me. I had told her that I just want you to let him know that out of respect for our relationship that he cant say stuff like that. \n\nThen she tells me that he doesn't even know we are dating. I said you need to tell him now which she was strongly against because it \"was of no consequence\" which seems fishy to me because if it wont hurting anything then why not just do it. She claims he hasn't said anything like this in a very long time however this morning while she was in the bathroom he had texted her again \"Good Morning Beautiful\" now my bull shit flag is raising even higher. What do I do?",
        "created_utc": 1678636847,
        "upvote_ratio": 1.0
    },
    {
        "title": "MY GFs FRIEND KEEPS CALLING HER BEAUTIFUL",
        "author": "Dangerous-Society693",
        "url": "https://www.reddit.com/r/relationships/comments/11phyfi/my_gfs_friend_keeps_calling_her_beautiful/",
        "text": "[removed]",
        "created_utc": 1678636732,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(15M) girlfriend(15F) came out as bisexual, I don't think I can trust her anymore.",
        "author": "Sad_Mud_1953",
        "url": "https://www.reddit.com/r/relationships/comments/11phxdh/my15m_girlfriend15f_came_out_as_bisexual_i_dont/",
        "text": "[removed]",
        "created_utc": 1678636657,
        "upvote_ratio": 1.0
    },
    {
        "title": "My wife (f24) just told me (m25) I wasn’t her first choice.",
        "author": "dinosaw-1",
        "url": "https://www.reddit.com/r/relationships/comments/11phvrw/my_wife_f24_just_told_me_m25_i_wasnt_her_first/",
        "text": "We have known each other for around 5 years. We met in college and initially we were just friends. I started liking her after a couple of months but I was too shy to confess ( I had problems as a child so my self esteem was -1/10). In our friend group, there was this other guy. He was the opposite of me. He was an extrovert, I was an introvert, he was the funny type, the center of the friend group, while I was one of those followers you wouldn't even notice if they were absent.\n\nMy wife wasn't the classic beauty but for me she has always been the brightest star in the sky. She is kind, funny, compassionate, caring. She is the kind of woman anybody would want at his side.\n\nThe year we graduated college, I was finally starting to come out from my shell. I talked more, voiced my opinion with my friends; all those things that until the year before looked impossible for me, suddenly looked possible.\n\nI was still scared but one day I decided to confess my feelings to my wide. She didn't answer immediately and, thinking back, I question why the past me never had doubt about her reaction. She told me she didn't expect it and that she needed some time to think about it.\n\nOne day she called me and she agreed to going out with me and we had been dating ever since.\n\nThe past 2 years have been the happiest of my life and I have to admit that her reciprocating my feelings was a big boost for my self esteem.\n\nMy wife and I have been happy together until now. We had fun, we laughed, joked and faced every problem together.\n\nRecently, though, she confessed me the truth: I wasn't her first choice. Apparently during that week between my confession and her reply, she confessed to the other guy and asked him out but he rejected her. She admitted that she initially went out with me simply because I was a kind guy and she wanted someone to be with but that after she knew me better, she fell in love with me for real.\n\nI know it doesn't make sense logically but I'm kinda of upset. I love her and she loves me but in my mind I constantly feel this voice that tell me I wasn't worthy enough and that she simply \"settled\" for me after her first choice rejected her.\n\nI can't seem to focus on anything else and this has been influencing negatively my private life and my work. \n\nTL;DR : My wife confessed she originally settled for me after the guy she liked rejected her.",
        "created_utc": 1678636543,
        "upvote_ratio": 1.0
    },
    {
        "title": "My GF friends keeps calling her beautiful",
        "author": "Dangerous-Society693",
        "url": "https://www.reddit.com/r/relationships/comments/11phvo5/my_gf_friends_keeps_calling_her_beautiful/",
        "text": "[removed]",
        "created_utc": 1678636538,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(20F) cannot stop my jealosy and overthinking about my boyfriend(20M)'s new girl friends",
        "author": "Anxious_Minute_4958",
        "url": "https://www.reddit.com/r/relationships/comments/11phux2/i20f_cannot_stop_my_jealosy_and_overthinking/",
        "text": "[removed]",
        "created_utc": 1678636491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking stage",
        "author": "AdLoud7747",
        "url": "https://www.reddit.com/r/relationships/comments/11phn9e/talking_stage/",
        "text": "[removed]",
        "created_utc": 1678635962,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (35/f) father in law (75/M) has a problem with me and I don't understand why.",
        "author": "bannedbooks123",
        "url": "https://www.reddit.com/r/relationships/comments/11ph9y6/my_35f_father_in_law_75m_has_a_problem_with_me/",
        "text": "My (35/F) husband (40/M) have been married for one year and we have a 3 month old daughter. His parents (68/F) (75/M) are in town visiting and helping out with our rental properties. They don't live close but they are retired and grandma wanted to spend some time with our daughter. \n\nI was happy at the idea of having a little help because we don't get much of a break these days. My parents are deceased and my maternity leave was ending. Hubby and I hadn't even been on a date since I don't remember when. They have been staying at our house for the past three weeks and I thought we all got along. \n\nThey just finished working on one of our rental properties and the in-laws are going to stay there for the remainder of their stay (until the end of the month). That was always the plan from the get go. \n\nWe went out to dinner as a family and I was really looking forward to that dinner. I thought we were having a good time and I noticed grandpa seemed mad. I asked, \"is the food not good?\" And he responded, \"just shut up.\" I thought that was pretty rude but said nothing and then we ate in silence. It seemed to come out of left field. Then, he made a remark, \"I'm so happy we have our own place to stay.\" \n\n\nWhen we were home, my husband told me that his dad got mad that I did something with my hands that he didn't like and he took it the wrong way. I do have a weird tic where sometimes I move my hands around and I'm not always aware of it. I know it's a little weird and I've been told it's barely noticeable until you spend more time with me. I think I'm a little neurodivergent and I'm socially awkward and always have been. I cannot even pinpoint a time in dinner where I would have done that or why. \n\n\nI overheard my MIL say to my husband that she's mad at FIL because he shouldn't \"make his son choose between him or his wife.\" I tried to ask my husband about it and he just tries to blow it off, \"he's just a cranky old man and I wouldn't worry about it.\" But, I have a hard time not worrying because I wanted them to like me and I don't understand why he would suddenly have a problem with me. I thought we had a good repoire.I feel like hubby isn't telling me something. MIL has come over since that dinner but I haven't seen FIL. \n\n\nTl;Dr\nFIL has a problem with me and I don't understand why.",
        "created_utc": 1678635038,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (19F) boyfriend (19M) and I aren’t as intimate anymore and it’s because of my anxiety",
        "author": "BackseatTango",
        "url": "https://www.reddit.com/r/relationships/comments/11ph9vz/my_19f_boyfriend_19m_and_i_arent_as_intimate/",
        "text": "[removed]",
        "created_utc": 1678635033,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I detach from my partner and stop being so attached?",
        "author": "CommitteeAccording57",
        "url": "https://www.reddit.com/r/relationships/comments/11pgxa9/how_can_i_detach_from_my_partner_and_stop_being/",
        "text": "1 (f17) have a good relationship with my partner (m18) but sometimes I feel like I'm too attached. For clarity we have only been together for 2 months. I feel like he is loosing feelings even though he is clearly not, know he loves me as much as I love him &amp; these feelings that he doesn't love me just comes up when I'm not with him. When I'm with him it's perfect &amp; he shows his love, but when we are apart (which isn't often, we meet each other at least 3 times a week) I feel like he doesn't like me as much even tho we text all the time. I am so anxious that he will leave me and l'm too attached. How can I be a little more detached and independent whilst in a relationship. I feel like he is my whole world, and when we aren't in contact, all I can do is wonder about him. I have a lot of hobbies but I can't do them as good as he takes over my mind. What do I do?\n\nThis happens often to me in relationships and I think it may be because of my attachment style.\n\nTL;DR summary; I have problems to detach my self &amp; my life from my partner. I would like help and advice on how to stop this behavior since I'm too attached &amp; I feel like he is loosing feelings when I'm not around him.",
        "created_utc": 1678634156,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23F) want to end my relationship with my bf (34M) but im scared",
        "author": "Deezercha__",
        "url": "https://www.reddit.com/r/relationships/comments/11pgweq/i_23f_want_to_end_my_relationship_with_my_bf_34m/",
        "text": "\n\nTL;DR My partner is being shit, and im scared of leaving due to his anger issues.\n\nHi.\n\nAlso, it's pretty much what the title says.\n\nI ( 23f) am with my boyfriend (34m) for about 4 months.  We met on a dating app, and it was just chit chatting and having normal conversations. We got along pretty well, I'm not gonna lie. Back then, he was in a really bad place due to some personal issues regarding jobs and what not, so I suggested he starts looking for  a job and, you know, work on that bad mental health place, you know how it goes. \n\nBefore we started dating, we lived in different cities. \n\nNow, we're in the same industry,  and it's basically live sound industry,  jumping around and doing big events, concerts, and the list goes on, so with the experience he has, it wasn't a hard task to find a well paid job.   We now work for the same company.  Due to the nature of our job, it is sometimes hard to maintain a relationship, but he decided to move from a different city to mine, start working here, and we'll, start dating me. \nAt a time, I decided to maybe put my job aside and have some personal life, some fun, something other than dying at work because I absolutely adore it.\n\nIt's becoming a nightmare,  and I don't know what to do. I don't feel like this is right for me, and I will give you a list of things or certain situations that happened,  so please do let me know about your opinion.  And before I start, I know he's way older than me. I just had a really bad experience with people my age, and I figured this might be a better option. \n\nThe list:\n\n1. I personally believe he moved here too early. It wasn't even a month.\n\n2. Whenever we argue,  he yells and hits things, even though I said that's something I hate and will not he tolerating \n\n3. It turns out I'm the one who never has any tolerance for anything, and I'm always guilty of something\n\n4. He never listens to me, and every single time I say something bothers me, he just dismisses it, doesn't pay attention, and his favourite thing  to do is to reverse the situation and starts going on about how I'm not perfect either, and all the things I do or I did to him\n\n5. Every time I have to cancel our plans due to my university ( I do two masters and have a full-time job), it's chaos.  He starts yelling, whining,crying, throwing up or whatever to show what a piece of shit I am, and how that's affecting him\n\n6. He wants to spend every waking moment with me. Thank god my friends are good people, and understand, but I feel extremely guilty for just..ignoring them.\n\n7. He checks my phone ( instagram, WhatsApp, Galery, calls, messages) because he used to get cheated on, and I'm not okay with this at all.\n\n8. I used to be in a lot of physically abusive relationships,  and he thinks it's funny to purposely make me flinch. \n\n9. Valentines Day and Women's Day we spent arguing. He wasn't bothered to get me a chocolate bar, let alone anything bigger. Didn't even send a message.\n\n10. Every time I tried talking to him about issues, everything he said was basically, \" Every day there's something affecting you. You're really supposed to visit a psychologist. \" \n\nNow, on top of that, when I was on the edge of ending my life, he offered me to suck his d***, because that's gonna make me feel better.  Not to mention, I was  crying,  and originally didn't want to see him that day because I knew sex was all he wanted. \nWhen I don't want to hang out,  he says he'll stop by anyway. \n\nI don't know what to do, and I don't know how to leave. I feel extremely guilty , I know he'll come around, and we also work at the same company.  He gets aggressive and easily mad, and I just, don't know how to proceed.  He wants to move in, and I want to get the he'll out of this relationship. \n\nAm I in the wrong? How do I proceed further?",
        "created_utc": 1678634100,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (31F) fiancee (32M) is a cross dresser. Recently he is pushing boundaries.",
        "author": "mintlx",
        "url": "https://www.reddit.com/r/relationships/comments/11pgw8r/my_31f_fiancee_32m_is_a_cross_dresser_recently_he/",
        "text": "I am ok with crossdressing because he does it on his own time. He usually goes out all dressed up maybe once a month. Recently he told me he wants to grow his hair into a bob. I asked him why he cant use wigs and he said it is too unnatural. I told him I dont want him to look like a woman neck up constantly. He told me he is not a woman and he will just have longer hair and it doesnt change anything. But I think it will change how I look at him because it will make him very feminine. This is where we are at. What do I do?\n\nTL; DR Fiancee is pushing my boundaries and I dont know what to do.",
        "created_utc": 1678634087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daughter’s bf is 18 yea older than her- don’t know how to deal",
        "author": "garbanzo1962",
        "url": "https://www.reddit.com/r/relationships/comments/11pgvyb/daughters_bf_is_18_yea_older_than_her_dont_know/",
        "text": "[removed]",
        "created_utc": 1678634067,
        "upvote_ratio": 1.0
    },
    {
        "title": "[25M] lied about rebound during break up to [28F]",
        "author": "Calatrava5227R",
        "url": "https://www.reddit.com/r/relationships/comments/11pgvx8/25m_lied_about_rebound_during_break_up_to_28f/",
        "text": "I had a rebound relationship 2 weeks after a break up for appx 2 weeks. But after realizing that I still loved my ex, I went back to her. However, I felt guilty for sleeping with the rebound and told my ex (current gf) that I had slept with someone. She was mad and felt betrayed.\n\n(Rightfully so since we still did talk during the break up and expected to meet during the summer after a LDR. But I acted the way I did since she broke up with me for the 3rd time and this time I didn't think we could have a future).\n\nSo, she asked me to tell everything what happened. I didn't want to lose her and so I lied to her that I didn't go on dates with the other girl, and that although we slept, I came out and went back home in just a few minutes. She believes what I said and understanding it as a one-night stand, isn't thinking about the issue anymore.\n\nBut I just feel so guilty for telling The One I love a lie regarding someone whom I had slept with. What should I do? I don't want to hurt her or our relationship. It's just too precious. Is the right thing to do to confess my lies and tell her the truth? I'm in agony esp since she doesn't understand the concept of a rebound... to her, it would be an emotional affair that betrays love and trust.\n\nTL;DR: Lied about a rebound relationship. Stated that I only had a 5 min one night stand. I'm afraid of telling the truth for what it may cause. But not telling it is also awful since she is The One and I don't want to live a complex life with such a lie.",
        "created_utc": 1678634065,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (27F)removed myself from a friend group due to one friend (26F) and hoping my decision was right",
        "author": "SerrySweet",
        "url": "https://www.reddit.com/r/relationships/comments/11pgvc7/i_27fremoved_myself_from_a_friend_group_due_to/",
        "text": "[removed]",
        "created_utc": 1678634027,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I detach from my partner?",
        "author": "CommitteeAccording57",
        "url": "https://www.reddit.com/r/relationships/comments/11pgt7w/how_can_i_detach_from_my_partner/",
        "text": "[removed]",
        "created_utc": 1678633883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you forgive the other woman??",
        "author": "Repulsive_Exam9239",
        "url": "https://www.reddit.com/r/relationships/comments/11pgs82/can_you_forgive_the_other_woman/",
        "text": "[removed]",
        "created_utc": 1678633817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a red flag that my (26f) boyfriend (37m) wants to retire by (probably before) 40 with no plans to do anything else after?",
        "author": "uproottoot",
        "url": "https://www.reddit.com/r/relationships/comments/11pgr2q/is_it_a_red_flag_that_my_26f_boyfriend_37m_wants/",
        "text": "TLDR: Boyfriend (37m) wants to retire very young and have a family with me, but he has no want to get another job or have any goals. Is this a red flag?\n\nBoyfriend (37m) wants to retire very young and have a family with me, but he has no want to get another job or have any goals. He will work part time doing options and other types of stocks and makes enough to live on and is currently an engineer on top of this. However, he wants to retire early from engineering and do stocks to somewhat supplement his current income. My boyfriend is financially smart and stable I think. There were some issues with him not being comfortable sharing his finances with me, but eventually did after I said I had showed him all my financial info and we had been together for 2 years AND talking marriage. His reasoning for being so vague is he didn’t want a woman to want him for money. I was extremely upset and told him I had been with him for over 2 years without knowing his financials, but him knowing mine, which are great. \n\nAnyway, back to the possible red flag. He just wants to be a homeowner and have time to do what he wants with no particular goals. I think that’s great! However, several people and a part of myself is worried this is a red flag now. I don’t want to say he doesn’t have ambition, but it just good with hanging out for the rest of his life without making more or less financially or having his own goals to pursue. I mean he does want to have a family, but mainly talks about doing his own hobbies, traveling on his own and maybe with me if I have the time, and taking care of a house. It just feels very separate from me and I will still continue working, but he says he wants me to come travel with him, but need to work until I’m 35 (which I was planning on anyway and probably after). \n\nI just get worried that I might end up in not a great situation. So, is this a red flag?",
        "created_utc": 1678633747,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (31F) finacee (32M) is a crossdresser. Some boundaries are being pushed. Need advice.",
        "author": "mintlx",
        "url": "https://www.reddit.com/r/relationships/comments/11pgqrr/my_31f_finacee_32m_is_a_crossdresser_some/",
        "text": "[removed]",
        "created_utc": 1678633727,
        "upvote_ratio": 1.0
    },
    {
        "title": "[25M] lied about rebound during break up to [28F]",
        "author": "Calatrava5227R",
        "url": "https://www.reddit.com/r/relationships/comments/11pgod0/25m_lied_about_rebound_during_break_up_to_28f/",
        "text": "[removed]",
        "created_utc": 1678633567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this ethical? I made a dating app bot to get dates and it actually works",
        "author": "curatorezm",
        "url": "https://www.reddit.com/r/relationships/comments/11pgjs3/is_this_ethical_i_made_a_dating_app_bot_to_get/",
        "text": "[removed]",
        "created_utc": 1678633257,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22F) cannot make friends and it is destroying my confidence :(",
        "author": "soft_skies",
        "url": "https://www.reddit.com/r/relationships/comments/11pggvn/i_22f_cannot_make_friends_and_it_is_destroying_my/",
        "text": "[removed]",
        "created_utc": 1678633069,
        "upvote_ratio": 1.0
    },
    {
        "title": "High class Bangalore escorts model service​",
        "author": "aaliyajha01",
        "url": "https://www.reddit.com/r/relationships/comments/11pgfq3/high_class_bangalore_escorts_model_service/",
        "text": "[removed]",
        "created_utc": 1678632984,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (31F) fiance (32) is a cross dresser. But recently he is pushing boundaries. What do I do?",
        "author": "mintlx",
        "url": "https://www.reddit.com/r/relationships/comments/11pgdgd/my_31f_fiance_32_is_a_cross_dresser_but_recently/",
        "text": "[removed]",
        "created_utc": 1678632827,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 29M ran into 28F who use to bully me",
        "author": "oldpropyiut",
        "url": "https://www.reddit.com/r/relationships/comments/11pgbf4/i_29m_ran_into_28f_who_use_to_bully_me/",
        "text": "I asked out this girl when I was 21 and she was 20 and she rejected me. She was an absolute a** towards me but not in a way that you’d think. It was passive aggressiveness all day everyday. She even pretended to act close to me after rejecting me and asked me to share my answers on an assignment then she went and told the prof about it and I got kicked out of the class for using an online source and I stepped out of school. \n\nAt the end of it, I went back to school and got my degree and have already bought my own home with a great car. I saw her at the mall today and she came up to me and started chatting. She ASKED ME OUT LOL. Not right away but near the end of the convo after I shared how my life’s going and allez turns out she’s a waiter and thinking of going back to school. \n\n\nTDLR - girl who rejected me asked me out years later after bullying me",
        "created_utc": 1678632678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newly “seeing each other” and super insecure",
        "author": "bookdom",
        "url": "https://www.reddit.com/r/relationships/comments/11pgb82/newly_seeing_each_other_and_super_insecure/",
        "text": "[removed]",
        "created_utc": 1678632665,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (23 F) boyfriend’s (24 M) family makes me second guess a future with him",
        "author": "strawberrybearaffair",
        "url": "https://www.reddit.com/r/relationships/comments/11pg9t7/my_23_f_boyfriends_24_m_family_makes_me_second/",
        "text": "I want to start this out by saying that I love my boyfriend very much and want a future with him. We've been dating a year and a half and have recently been talking about marriage. The only thing keeping me from 100% committing to marrying him is his family. For context, he has a very large family with 9 siblings and over 20 nieces and nephews. I on the hand am an only child of a single mother. Since i first met his family they didn't seem to like me. They never did anything overtly rude at first but never tried to get to know me or talk to me. When i talked to them they always shut down the conversation very quickly. At first i thought that that was just their personalities but then i realized i was the only person they ever did that with. After a few months they started doing more obviously rude things/ doing things to exclude me that i won't get into right now. I've never been able to figure out why they do this because i've never done anything rude to them and have bought all of them and their children gifts for holidays and birthdays.\n\nFor the second half of this post i want to clarify that i am in no way judging anyone and i understand that every person/family has their own issues and aren't perfect.\n\nThe only word i can use to describe his family is chaotic.\nIt seems like every day something is happening. His siblings have all had quite a few arrests or issues with the law in general. Almost weekly someone is arrested or has court. That itself isn't a problem for me. The problem comes in when it begins to impact our life. Our plans routinely get canceled because someone's been arrested and needs money or someone to watch their kids. We are constantly babysitting for his family which is fine but his siblings will come home hours after expected or sometimes just come home the next day, leaving us stuck with their kids. His brother is always getting evicted and has to come and stay with us. And his sister is always needing to borrow large amounts of money from him or his parents.\n\nI understand that family comes first but he will do whatever they ask of him. It's getting to the point where most of his free time is spent taking care of his siblings or their kids. He also never defends me when his family is\nrude or excludes me from things. I love him and want to be with him but i can't imagine my life forever revolving around his family. \nI don’t know what to do at this point \n\nTLDR; his family is very “chaotic” and he spends most of his free time and money fixing their problems or watching their children. I love him and want to marry him but i can’t imagine my family revolving around them",
        "created_utc": 1678632568,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a boyfriend (M20) but I think I have a crush (M18)",
        "author": "Oh-Jasi",
        "url": "https://www.reddit.com/r/relationships/comments/11pg9dk/i_have_a_boyfriend_m20_but_i_think_i_have_a_crush/",
        "text": "[removed]",
        "created_utc": 1678632535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Break",
        "author": "Naum1e",
        "url": "https://www.reddit.com/r/relationships/comments/11pg7ug/break/",
        "text": "[removed]",
        "created_utc": 1678632418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me [28] prepare for an impeding breakup with my boyfriend [28]",
        "author": "Due-Improvement-183",
        "url": "https://www.reddit.com/r/relationships/comments/11pg4ih/please_help_me_28_prepare_for_an_impeding_breakup/",
        "text": "[removed]",
        "created_utc": 1678632163,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Ghosting\" an old friend? How do I gently cut contact?",
        "author": "bananaoils",
        "url": "https://www.reddit.com/r/relationships/comments/11pfttw/ghosting_an_old_friend_how_do_i_gently_cut_contact/",
        "text": "TLDR old friendship is not good for me, but she has few other friends, we are both SAHMs who live very close, and multiple others have \"broken up\" with her over the past year and I don't want to kick her while she's down. How do I end this?\n\nMy friend and I (both mid-20s f) have known each other for 10+ years. We were close in high school but lost contact during college for a while while we pursued very different lifestyles.\n\nWhen she got engaged a few years ago, she suddenly rekindled contact to ask me to be in her bridal party. I got the feeling she hadn't made many longterm friends and that ended up being the case.\n\nSince then, after seeing her changes at the pre-wedding events and the wedding itself, I've realized that this isn't a friendship I want to be a part of, and I don't feel like a better person when I'm around this friend.\n\nUsually I'd just \"break up\" as nicely as possible, but literally three other people have done that to her in the past year. Two were family and one is another old friend of hers who she also re-engaged to be a bridesmaid.\n\nTo make things stickier, we are both now SAHMs to infants and she moved 5 minutes away from me. She is unfortunately unstable and having a hard time and I think I am one of her only friends, so i feel that the better idea in this case would be a slow fade out of contact. Am I wrong?\n\n----------\n\nIf anyone wants specific examples:\n\nI got covid the weekend before the wedding and told her and the other friend who later cut contact. She ended up telling me to come anyway if symptoms weren't bad and not to tell anyone else because they wouldn't understand. She ended up lying about it to the one who knew and said I was coming later, and even made up a hotel I was staying at. To her credit, when this friend challenged her, she vented to me that she was just trying to make sure my medical info was kept private\n\nEvery time we hang out I feel as if it is a competition. I feel as if she asks probing questions about my weight, former salary, husband's salary, etc., and now that we both have infants I'm seeing some milestone competitiveness that makes me uncomfortable.\n\nI put a lot of effort into the pre-wedding events, her baby shower, etc., and didn't quite feel appreciated. I realize this is on me, but these were very elaborate and time-consuming events. She\n\nHer and her husband regularly ask for favors: painting the nursery, fixing their appliances, borrowing our vehicle, etc.\n\nWhen i told her I was pregnant she asked a ton of questions and kept insisting based on how many weeks I was that i was pregnant at her bachelorette (implying I was drinking, essentially). I had to all but tell her the conception date to explain how pregnancy timing works. She did not seem happy for me.\n\nEtc., etc., etc.",
        "created_utc": 1678631353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me [28] prepare for an impeding breakup with my boyfriend [28]",
        "author": "Due-Improvement-183",
        "url": "https://www.reddit.com/r/relationships/comments/11pfsll/please_help_me_28_prepare_for_an_impeding_breakup/",
        "text": "[removed]",
        "created_utc": 1678631257,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really like it when my wife spends time with friends",
        "author": "Naive-Selection-7113",
        "url": "https://www.reddit.com/r/relationships/comments/11pfrdg/i_really_like_it_when_my_wife_spends_time_with/",
        "text": "Tldr: I really like it when my wife spends time with friends lol\n\n34f (married near 11) always comes home so happy, excited and motivated and ready for intimacy when she come home. Hearing about negatives and positives of other people partners home lives sex lives always makes everything amazing. I know she always talks me up because I have had a few of her friends be...excited to tell me how they wish I was with them (which is super weird) but then she's jst fired up and excited to come home and see me every rime. \n\nI'm a big introvert, work shifts/nights and am happy enjoying my time at home and she is full extrovert and lives for interaction and covid isolation were terrible for her because she just thrives In social  settings but I have to remind, encourge and help arrange  things for her and her friends even though she usually does most of our organization. \n\nI want to foster her social life because it is such a big benefit to both  of us.",
        "created_utc": 1678631165,
        "upvote_ratio": 1.0
    },
    {
        "title": "I received random Facebook messages stating my gf was seeing someone",
        "author": "FilthyMM_",
        "url": "https://www.reddit.com/r/relationships/comments/11pfozn/i_received_random_facebook_messages_stating_my_gf/",
        "text": "[removed]",
        "created_utc": 1678630981,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really like it when my wife spends time with friends",
        "author": "Naive-Selection-7113",
        "url": "https://www.reddit.com/r/relationships/comments/11pfoa7/i_really_like_it_when_my_wife_spends_time_with/",
        "text": "[removed]",
        "created_utc": 1678630923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long-time friend says it's my fault if her daughter self harms",
        "author": "trucamoocha",
        "url": "https://www.reddit.com/r/relationships/comments/11pfnjy/longtime_friend_says_its_my_fault_if_her_daughter/",
        "text": "TL,DR: my friend got kicky out by her boyfriend abd she wanted to move in with me, to which I said no. Her daughter  came by later on demanding that I store her mother's stuff and blaming me for her parents divorce. I lost my patience and told her off, and now I'm being blamed for any potential self harm.\n\nI'm ( f39) successful and this caused problems in my relationship with my friend Leanna ( f44). Ever since I refused to do business together, she has blamed me for every failure in her life, including her divorce. Something's I brushed it off but I has gotten under my skin at moments. She says had I accepted her proposal, she would have been successful too and her ex wouldn't have left her (he acts like a gambler and took risks with their business and their marriage and lost everything). \n\nI didn't like her proposal because:1) it was handed to me at my own birthday party that they organized and 2) it wasn't a good business idea. They handed me a usb and when I said I would see it later, they pulled a laptop from her ex husband's shoulder bag and wanted me to use my time for their business endeavors. During that party, I didn't taste the cake because they allowed their youngest child to repeatedly wipe it with their fingers and lick. Her ex did it too.\n\nI'm successful after years of struggling to make myself visible career wise. I achieved some major goals with my companies so I decided to take a year off and take a mental health break. I moved into a tiny studio at a lower cost area where there's almost no amenities. I love this place. \n\nLeanna hated it. She was vocal about it looking \"cheap\" and criticized the lack of decoration. I've kept it as is. It looks bare but I'm okay with that. It came with a small dining room set, a couch and a bed aside from the refrigerator and stove.  She criticized that the things inside the apartment weren't fashionable and that I bought plates and cups from the local dollar store. For background, she's not wealthy or chic or anything. She just loves to criticize as a passive aggressive method.\n\nI'm not great at inviting people in because I prefer privacy and solitude. However, if I do, I always lock my computer and external memories inside a sentry cabinet that I bought for my home office because I need to protect my station now that it got financed and with contracts with very large companies. \n\nImportant to the story: I turned the hole in the wall walking closet in my studio into a professional looking office for my zoom calls. I always lock the office if I have people coming in.\n\nShe has asked me many times about what's behind that door. I always say it's my walk in closet. \n\nLast week, I came out of the bathroom and caught her with her hand shaking the door handle.  She got red faced. I didn't say anything, but I made up an excuse for her to leave.\n\nThree days ago, she called me with a mysterious tone and refused to tell me what was going on and said she would tell me when we got here. I came out and didn't let her in. I had a very bad feeling the minute she showed up with all of her belongings inside her car. \n\nShe said her fiance kicked her out. I didn't say anything until she directly asked to stay with me. I said no. I live in a studio where I have no space. My bed is actually about 20 feet from the kitchen. She kept arguing and making ways around what I said. She said \"what about your walk on closet?\". I said no. Also, if I want to have a date I can't bring him in with her at my place. I told her she needed to go stay with her parents, who live 4 hours away. \n\nShe left, but sent me texts with multiple instances in which I was a bad friend. She said what good it is to have friends if they don't do anything fir you and that \"she knows I'm lying\" by carrying on a frugal lifestyle and sent me lots of links about my career and an article on one of my companies yearly turnover ( long story). Her daughter(who's an adult) who removed me from social media years ago ( I think it's because I refused to do business with her mother) showed up work some plastic containers and a \"thanks for nothing\" attitude and said she was gonna leave stuff at my place so her mom could come pick it up when she was settled. I said no. Leanna was disrespectful and I wasn't interested and why can't she store her mothers things at her own place. The daughter has a fit starts blaming me for her parents divorce. I asked her to listen to herself and to reason. \n\nSo I confronted her with the fact that if he's telling me that because her mother missed out on a supposed chance to make money out of our friendship and her dad left the family, that mean he's a f****** gold digger. That made it worse and she started crying and hitting the steering wheel and screaming. I told her she needed to leave and when she refused I lost my cool and I promised I would drag her out of the car and do my thing because I had it with them. Lianna called me blaming me for a supposed nervous breakdown of her daughter's and said I'm a cold witch and that her daughter could be on the road to self harm. \n\nAs far as I know this friendship is pretty much over but I'm still confused because I don't know why things turned out so badly so suddenly. I've been dealing with mild depression for years so I don't know if I even did something wrong. My thoughts aren't clear right now.",
        "created_utc": 1678630867,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [28F] received shocking news regarding my fiance [29M] and his ex [30F]?",
        "author": "ThrowRAcookie8",
        "url": "https://www.reddit.com/r/relationships/comments/11pffhl/i_28f_received_shocking_news_regarding_my_fiance/",
        "text": "[removed]",
        "created_utc": 1678630250,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M24) think I’m starting to catch feelings for my friend (F18) and I don’t know what to do",
        "author": "THROWAWAY_30319",
        "url": "https://www.reddit.com/r/relationships/comments/11pfakc/i_m24_think_im_starting_to_catch_feelings_for_my/",
        "text": "Tldr; I feel like I’m catching feelings for a friend but I’m concerned it’s not okay because she’s much younger than me. \n\nWe’ve been friends for about 7 months and both work together (it’s not a career defining job or anything so working together isn’t an issue). I wouldn’t say I was initially particularly interested in her, things started off very platonic. As I’ve got to know her though.. I really feel a connection with her. She’s sweet and funny and we bounce off each other so well. We hang out outside of work at least once a week, whether it’s getting food or just walking around town together chatting. We text fairly regularly too. \n\nThe issue is obviously the age gap. She’s 6 years younger than me and is still very much a developing young woman, where as I’m almost in my mid twenties. I don’t know if it’s entirely appropriate for us to date but then again.. it’s not like I’ve taken advantage of her or anything. I haven’t pressured her into anything. I’ve not done anything inappropriate. We’ve been friends for ages and our relationship has grown and developed very naturally.. so part of me feels like I shouldn’t feel bad for starting to catch feelings. \n\nIdk, am I overthinking this?",
        "created_utc": 1678629863,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was the other woman and I feel horrible for his gf",
        "author": "Repulsive_Exam9239",
        "url": "https://www.reddit.com/r/relationships/comments/11pf9jk/i_was_the_other_woman_and_i_feel_horrible_for_his/",
        "text": "[removed]",
        "created_utc": 1678629774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this ethical? I made a dating app bot to get dates and it actually works",
        "author": "kuvumishamo",
        "url": "https://www.reddit.com/r/relationships/comments/11pf54s/is_this_ethical_i_made_a_dating_app_bot_to_get/",
        "text": "Dating apps have always favored women, so I decided to tip the scales. Got tired of filtering through all the flakes, attention wh*res, and endless swiping on dating apps. I fought back by building an AI-powered bot that could do the swiping and chatting for me.\n\nThis bot is designed to learn my preferences based on my previous matches, allowing it to understand my type of girl and engage in meaningful conversations that are tailored to my interests.\n\nThe results have been astounding. In the first month, the bot scheduled 13 dates for me, all of which were with girls who matched my preferences and had similar interests to mine. I no longer have to waste time swiping aimlessly or struggling to come up with conversation starters.\n\nTL;DR: made a dating app bot that gets me dates, thrilled it works but part of me feels like it’s dishonest and unethical.",
        "created_utc": 1678629446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this ethical? I made a dating app bot to get dates and it actually works",
        "author": "kuvumishamo",
        "url": "https://www.reddit.com/r/relationships/comments/11pf3p6/is_this_ethical_i_made_a_dating_app_bot_to_get/",
        "text": "[removed]",
        "created_utc": 1678629327,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i (f20)ask my boyfriend (m20) to stop liking pictures of girls he used to hookup with, without sounding controlling",
        "author": "i6m6b",
        "url": "https://www.reddit.com/r/relationships/comments/11pf3i1/how_can_i_f20ask_my_boyfriend_m20_to_stop_liking/",
        "text": "[removed]",
        "created_utc": 1678629313,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know what I’m doing with the girl I’m dating",
        "author": "narixis234",
        "url": "https://www.reddit.com/r/relationships/comments/11pezi4/i_dont_know_what_im_doing_with_the_girl_im_dating/",
        "text": "I’m 26M she’s 24F. I’m Ngl, I think I quite like her. And I think she likes me. We’ve seen eachother for around a month now. Sleeping together etc. \n\nOnly issue is. I move away in November. Only an hour and a bit but still away. I’ve also asked what she’s looking for and she said she doesn’t know. Said she ‘doesn’t think she has time for anything serious right now and cba to be treated like shit. But she’s enjoying seeing me and just wants positive right now’. \n\nI also don’t really know what I want yet. And it’s early. So I know I shouldn’t think that far ahead. But my housemate met his now gf 3 months ago and is introducing her to his parents next week. \n\nThere’s also an issue that she partakes in recreational drugs and I’m not into that at all. \n\nI’d like a gf if I’m honest. But with me being unsettled and not sure where I’m going, I don’t know how it’ll work. I worry I’m too old for flings. I worry about ending up hurt if we keep seeing eachother. \n\nI know being hurt is part of dating. But I don’t really know what to do if I’m totally honest. \n\nAny advice? Thanks \n\nTl;dr not sure what to do with the girl I’m dating",
        "created_utc": 1678628995,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (28M) ex (26F) is trying to catch my attention and I don’t know what to make of it.",
        "author": "unprocessed-info",
        "url": "https://www.reddit.com/r/relationships/comments/11peub3/my_28m_ex_26f_is_trying_to_catch_my_attention_and/",
        "text": "We split up a month Ago, we share a young child so the contact is always there, albeit more sporadic now we still talk every couple of days and I only told her last week I wanted to try fix things and she said no. \n\nWhen we broke up two years ago, she started to send me videos and pictures of us to let me know she wanted me back and it worked for her. \n\nI changed the profile picture on the only one my socials we talk on this morning to a picture of me and the kid. She saw my message replied, and immediately changed her picture , a really pretty one where she’s actually wearing a piece of my clothing that she knew I wanted back and I don’t know what to make of it. Is she looking for me to say something about it? \n\nTl/dr: Child’s mother and I split, she’s dropping hints at something but I don’t know what it is. Would love a woman’s perspective on this",
        "created_utc": 1678628565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I(29M) ask her why she(33F) grew so distant?",
        "author": "TangeloDry8529",
        "url": "https://www.reddit.com/r/relationships/comments/11peu82/should_i29m_ask_her_why_she33f_grew_so_distant/",
        "text": "So while I(29M) was in greece last October I met this Women(33W) and we kinda clicked very well. I was touring with my motorcycle for around 4 weeks and she joined me for the last 2 weeks of it. We started a FWB thing during that time that continued even after I came back. She even came to visit me in my homecountry for a week just 2 months ago and there I could feel that she wasn't into me that much anymore, which would have been okey. We still had sex but it wasn't the same anymore, especially comparing it to the times before and even just the sex on the phone was somehow more intimate. I would have enjoyed the time even just as friends but she didn't communicate much even after me asking, so I thought it's just in my head. For almost a month our encounter is just friendship after that, with a few sexual comment on both side. Just to be sure, even before that we decided to stay friends when we end our FWB situation because we cared for each other. We really had good contact up to that point. But from then on our calls were really short since she was always busy or doing something.\n\nThan one day I call her she declines and I wait for her to call me back. After 2 days I get a bit worried and aks if she is alright, she tells me yes and than ignores on of my next question without getting back. \n\nAfter 3 days I ask her if everything is okey and she says yes calls me and we have a normal talk. The next time she ignores my call again, probably 2-3 days later. This time I don't ask and just wait, after a few days she asks me if everything is okey and I tell yes( my fuck up, didn't want to come of as desperate and people sometimes have many things going on). After she ignores my text again for 6 hours just to write a one word answer. So a week after that I call her and she again has soemthing going on and I understand and let her be. She says that she is missing me, I say the same and we hang up. Since than she never got back to me again. It's over a week almost reaching 2 and this is the longest time we didn't have contact since we met. \n\nNormally everone who would ask me something like this my response would be the ball is in her hands, don't let her treat you like that, it's just not respectful. Would I be right to just let this go or should I ask one more time why she grew this distant.\n\nTldr: Met a girl on Holiday and we clicked very vell. Had contact for a while now she is growing distant fast.",
        "created_utc": 1678628559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I(29M) ask her why she(33F) grew so distant?",
        "author": "TangeloDry8529",
        "url": "https://www.reddit.com/r/relationships/comments/11pesvj/should_i29m_ask_her_why_she33f_grew_so_distant/",
        "text": "[removed]",
        "created_utc": 1678628448,
        "upvote_ratio": 1.0
    },
    {
        "title": "(33M) (30F) ENM Marriage Gone Wrong",
        "author": "buhday33",
        "url": "https://www.reddit.com/r/relationships/comments/11pepnh/33m_30f_enm_marriage_gone_wrong/",
        "text": "Hi All,\n\nI'm really struggling and need some reassurance. My now, and soon to be ex-wife of 4 years and I decided to try opening up our marriage to spice things up a bit. I knew this was something she wanted as she had mentioned it before, and to be honest, I thought it might be fun as well. However, I was a little hesitant due to thinking it may have a negative impact on our marriage (i.e. talking to others would take attention away from us, etc.) I decided to go along with it to make sure she was satisfied.\n\nGrowing up in church, monogamy and all things associated were engrained into my subconscious. I loved this woman, and still do. I was afraid she might leave me based on a couple of incidents in our past. She lied to me a few times, and even went to see a guy behind my back on one occasion. Naturally I had some insecurities about myself and our marriage after these events.\n\nAt first, she was only bi curious. We invited a couple of different girls into our bedroom. It was fun, I enjoyed it, but felt a little guilty for having sex with someone else, even though my wife was there participating and enjoying it. I was open to continuing though because it was something her and I were sharing together, and I felt it was bringing us a little closer.\n\nThen it started snowballing into her wanting a sugar daddy (which is crazy because we both make really good money together and can pretty much have anything we want), then it turned into she wanted to have FWB with several men. This is all within a 2-week period. \n\nWe started this back in late January. She was going out with someone new almost every night. I was having trouble finding someone to go out with. So, I'm at home alone most nights while she's out, and she's having sex with new partners. I was miserable. I couldn't stand the thought of another man being with my wife, and I knew if I were to go out and have physical intimacy with someone else, it would feel strange and at the end of the day, the only person I would want is her. I felt awful for even trying to make plans with another woman even though my wife knew what I was doing and encouraged it. I went through this pain over the next month and a half.\n\nThere were some positives - our sex life improved, and it also motivated me to find new things to try in the bedroom. I actually found something just before we decided to separate where I could actually make her orgasm.\n\nI talked to my wife several times and expressed that I didn't like this and that I wanted her to want me again, and only me. My feelings were dismissed a lot. I was told they were stupid because she'd never leave me. I was called a p\\*\\*\\*\\* because I was upset/crying. She knew I was upset and continued to do it anyways. She kept telling me that I came 1st, but when I asked her to stop, she got mad/defensive. If I truly came 1st, wouldn't she be willing to stop and focus on me?\n\nI had a therapy session this week and my therapist suggested maybe trying some time apart would do some good. I mentioned that to my wife, she was concerned why I wanted to go back home for a few days. I was honest, told her I wanted to go see my family and clear my head - then, the flood gates opened. I let out all of my feelings, told her I wanted this to stop and I wanted us to focus on her and I only and I wanted to stop this lifestyle. She said that would be a problem if I wanted her to stop.\n\nAt that point, I said I was done and was walking away. She got mad, saying it wasn't fair because she allowed me to have sex with 2 other women while she watched, called me a hypocrite, said I was a p\\*\\*\\*\\* and always will be. Said she was going to finally due what she wanted for once and she felt she always had to accommodate for me.\n\nI was nothing but good to this woman. I gave her everything she ever wanted. Never laid a hand on her, always treated her with respect/chivalry. I felt like I gave my all in this marriage. Yet, I'm just struggling thinking this is all my fault, when I know logically it wasn't. Her own mother even told me not to think I wasn't good enough for her, and that I was. She said we just met at the wrong time and she had a 'wild' streak she needed to work through. I can't wait on her to do that. \n\nHow can I get through this and feel better about myself and my decision to leave? I'm heartbroken. My self esteem is low, and I feel like I'll never find a good woman who will love and appreciate me and everything I have to offer.\n\n**TL:DR** \\- Wife and I agreed to open marriage, I didn't like it once we got into it. I asked her for us to stop, she denied, and I said I was walking away. Need advice on how to cope and realize that I did the right thing even though it hurts.",
        "created_utc": 1678628171,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F20) just realized how bad my past actions were and I have no idea where to go from here",
        "author": "osstossitaway",
        "url": "https://www.reddit.com/r/relationships/comments/11peomd/i_f20_just_realized_how_bad_my_past_actions_were/",
        "text": "[removed]",
        "created_utc": 1678628088,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (F24) heal after an emotionally abusive partner (M27)",
        "author": "dhalila_",
        "url": "https://www.reddit.com/r/relationships/comments/11peofx/how_do_i_f24_heal_after_an_emotionally_abusive/",
        "text": "How do I repair my confidence after a damaging relationship that made me feel never good enough to be loved? I know I am a very sweet and loving person and I am pretty but… This relationship made me feel like every other girl is better than me. Every other girl is prettier, sexier, and just better in every way. Every other girl is right and I am wrong. I feel so stupid for letting someone take the best of me for granted and throwing it in the trash. I feel terrible. How do I heal after such emotional abuse? Thank you!\n\nTl;DR How to heal from a relationship that made me feel never good enough to be loved?",
        "created_utc": 1678628070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beyond confused when it comes to my (M22) current situationship (F21)",
        "author": "Forsaken-Fisherman-2",
        "url": "https://www.reddit.com/r/relationships/comments/11pem4q/beyond_confused_when_it_comes_to_my_m22_current/",
        "text": "[removed]",
        "created_utc": 1678627882,
        "upvote_ratio": 1.0
    },
    {
        "title": "i talk to this guy for already 4 months but he told me he dont wanna be in a relationship with a teenager",
        "author": "No-Profile8280",
        "url": "https://www.reddit.com/r/relationships/comments/11pekom/i_talk_to_this_guy_for_already_4_months_but_he/",
        "text": "[removed]",
        "created_utc": 1678627769,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (24f) heal after an emotionally abusive relationship with my bf(27m)?",
        "author": "babygirlbabyboyyy",
        "url": "https://www.reddit.com/r/relationships/comments/11pek3s/how_do_i_24f_heal_after_an_emotionally_abusive/",
        "text": "[removed]",
        "created_utc": 1678627717,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting the feeling that my bf is gay",
        "author": "Niki533o",
        "url": "https://www.reddit.com/r/relationships/comments/11pek1w/i_keep_getting_the_feeling_that_my_bf_is_gay/",
        "text": "Yesterday, my bf(26M) and I(24F) went out for a double date with his best friend(25M) and his girl. while we were out, we all got drunk and his best friend and him always do things that make me question whether they're gay. Like once his best friend kissed my bf on his cheek while we were returning from a night out. And yesterday my bf told me he had kissed a guy before but that's how he knew that he wasn't gay. \n\nI took that as a pretty normal thing and the night went on. I saw a model at the bar we were at and just told him that she was very beautiful and that she's a model and he said that I'm bi cz I said that and then went on to tell me that he's the perfect guy for a bi girl cz he looks like a girl and that thats why I loved him. \n\nI'm also in a band with them and I had gone to the dining area to eat and once I got back they had written a song about how they fucked while I was gone. I mean idk but his best friend has kissed guys before and idk what is up with my bf. Whether it's a joke that just comes across as weird or not.\n\ntldr; I just keep getting this weird gut feeling that he is gay sometimes but Idk if I am overthinking things that may be a joke?",
        "created_utc": 1678627712,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting the feeling that my bf is gay",
        "author": "Niki533o",
        "url": "https://www.reddit.com/r/relationships/comments/11pei4q/i_keep_getting_the_feeling_that_my_bf_is_gay/",
        "text": "[removed]",
        "created_utc": 1678627543,
        "upvote_ratio": 1.0
    },
    {
        "title": "i talk to this guy for already 4 months but he told me he dont wanna be in a relationship with a teenager",
        "author": "No-Profile8280",
        "url": "https://www.reddit.com/r/relationships/comments/11pec9e/i_talk_to_this_guy_for_already_4_months_but_he/",
        "text": "[removed]",
        "created_utc": 1678627053,
        "upvote_ratio": 1.0
    },
    {
        "title": "The way my (34f) boyfriend (30m) is speaking to his new boss makes me uncomfortable",
        "author": "brokenbear1968T",
        "url": "https://www.reddit.com/r/relationships/comments/11pec97/the_way_my_34f_boyfriend_30m_is_speaking_to_his/",
        "text": "\n\nMy (F34) Boyfriend (M30) work together. He has recently been asked by the boss of a different location to do some work for her there. There were a couple of them in the initial group chat and the messages between her and another male were definitely over a line, very flirty with lots of innuendo. However my boyfriend started messaging her privately and the conversations are making me really uncomfortable. She's the boss and has never met him but was asking about his relationship status, they've discussed the issues he and I are currently having, she's told him all about her relationship issues. He doesn't seem to see anything wrong in it but I find it totally inappropriate to be sharing that level of detail about your private life, especially as he is constantly telling me not to talk about him to others. \nHe knows I won't discuss our relationship with colleagues, I never do but he does and it should be noted that one of our recent problems was that he was talking to another women in work a lot and sharing personal stuff with her. He would go up to her when he saw me and make a point of talking to her, he also made comments about meeting her and when I told him he was cruel to drag her in to it and I'd speak to her so she knew there was no issue between us he told her I didn't like them talking and was going to confront her (genuinely have absolutely no issues with her at all, and I do not want him to create a false one with his games)\n\nAt times he behaves like this is all tit for tat as I speak to my ex. He is my children's father so I have no choice and I've told him I just want to keep it civil there. \n\nTl:Dr my (34f) boyfriend (30m) seems to be crossing boundaries with conversations with his new boss but doesn't see an issue in his behaviour. AIBU to be uncomfortable?",
        "created_utc": 1678627052,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my boyfriend (M23) may have cheated on me (F25).",
        "author": "xosimmerr",
        "url": "https://www.reddit.com/r/relationships/comments/11pe928/i_think_my_boyfriend_m23_may_have_cheated_on_me/",
        "text": "\nMy boyfriend and I have been dating for almost 2 years. He’s a pretty distant person, but we make it work. Yesterday he texted me saying he was going to a coworkers house (a male) at around 8:45/9pm. This is a little odd for him as he really does not go out around this time as he’s usually in bed by 10. I said okay, and asked him what they were going to do. He said, “I don’t know, i’m about to find out.” Which was a little odd to me? I’ve had this terrible gut feeling all day and morning that he may have cheated on me. I have very bad ptsd as I was in a abusive relationship before this and he would say similar things when he would cheat on me. I’m not sure if I am overreacting or it’s my anxiety, but I can’t help but think he cheated on me. I have a very hard time talking to him about this stuff because I don’t want him to get upset or think i am accusing him of cheating and even if he is, it’s not like he’ll tell me. He also said about a week ago that he would not be able to see me for about 3 weeks as he as he was busy with school. What is your guys take? Should I bring it up to him or drop it?\n\nTLDR: My boyfriend went over to male coworkers house at 9pm and I’m worried he may have cheated on me.",
        "created_utc": 1678626775,
        "upvote_ratio": 1.0
    },
    {
        "title": "my friends and I have different views. what to do",
        "author": "Accurate_Tree_8081",
        "url": "https://www.reddit.com/r/relationships/comments/11pe8m4/my_friends_and_i_have_different_views_what_to_do/",
        "text": "I (18F) am in my last year of highschool, just like my school friend group (all 18F). \nThe problem is that I've realised how different my views, values and beliefs are to my friends. And I don't know if it's possible to keep this friendship going because I can't help but feel resentment. What do I do? \nFor example, today we argued about job opportunities, networking as being a privilege or not. Most of my friends thought that you should just 'try harder' and if you're bad at making connections it's because you have bad social skills. As an immigrant I don't really agree with this based on my parents experiences. But that's just an example of our conflict. \n\n My friends keep on asking philosophical questions and expecting me not to be emotionally effected by our conversations , but I can't help holding a grudge. Is our relationship salvageable past highschool, and in the meantime how do I spend the rest of the year without getting really bitter? \n\nTL;DR:\nMy friends and I have really different viewpoints and opinions and the conflict is getting to me, what do I do?",
        "created_utc": 1678626735,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M24) think I’m starting to catch feelings for my friend (F18) and I don’t know what to do",
        "author": "THROWAWAY_30319",
        "url": "https://www.reddit.com/r/relationships/comments/11pe8ku/i_m24_think_im_starting_to_catch_feelings_for_my/",
        "text": "[removed]",
        "created_utc": 1678626732,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my boyfriend (M23) might have cheated on me (F25)",
        "author": "xosimmerr",
        "url": "https://www.reddit.com/r/relationships/comments/11pe6ec/i_think_my_boyfriend_m23_might_have_cheated_on_me/",
        "text": "[removed]",
        "created_utc": 1678626547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me pls! (Both 16yo)",
        "author": "Academic-Zucchini274",
        "url": "https://www.reddit.com/r/relationships/comments/11pe683/help_me_pls_both_16yo/",
        "text": "Towards the end of November/early December, I (16m) realized that this girl(16f) (who I had been in the same class with for two years and was going to spend another two years with) started looking at me from afar in class. I reciprocated the gaze, which was sometimes prolonged. Before that moment, we hardly ever talked, but one of those days she got up and asked me a completely random and disconnected question. This left me stunned and from that moment on, the situation between us two only got better. We didn't write to each other on social media, I would occasionally send her something and she reacted positively. I found out that we have a lot in common in terms of musical tastes, etc... However, the situation has evolved negatively.\n\nLet me preface this by saying that no one had ever shown such an interest in me before, I was happy and took advantage of it to ask her out. She told me she would feel embarrassed and that we would instead meet at the home of a mutual friend over the weekend. My response was positive, I told her it was okay. The fact is that from that moment on (about 3 weeks ago) she started completely ignoring me in class and it made me feel pretty bad. Only one day everything was as before, but then the thing vanished, it was a special day, I don't know.\n\nThis week, that friend I mentioned before had their birthday and next week she'll have hers. I bought a gift for both of them and I want to give it to them next weekend. I also want to write a small letter to her in which I might clarify my position and apologize if I have caused her any discomfort. What do you think?\n\n(She organized a small party at her house with only 5/6 people, she obviously did not invite me because of what i wrote before probably)\n\nTL;DR: I noticed a girl in my class showing interest in me, and we started talking more and sharing common interests. I asked her out, but she said she would feel embarrassed and suggested we meet at a mutual friend's house instead. After that, she started completely ignoring me in class, except for one day when things were normal. I bought her and our mutual friend gifts for their birthdays, and I want to give her a letter apologizing if I caused her any discomfort and clarifying my position. I'm seeking advice on how to deal with the situation.\n\nSo, is she embarassed about the question i asked her and acting like this for that mistake of mine? Maybe she wasn't expecting that. Can i fix this with a small gift and a letter with some explanations? She is a bit shy but not so much. Hope you can help me. This is making me so bad.",
        "created_utc": 1678626531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. Pregnant Ex left and hooked up with her best friend.",
        "author": "ReaperProspect",
        "url": "https://www.reddit.com/r/relationships/comments/11pe3v7/help_pregnant_ex_left_and_hooked_up_with_her_best/",
        "text": " \n\nFor Context\n\nI 24M was with my GF 23F now ex for 1 month. during this time I have gotten her pregnant under the idea of mending our already broken relationship and allowing me to be there for our 1 year old daughter. Its a lot more than just 1 month sealing our relationship. there was a time where we actually talked about working on things for the better. well fast forward to a day after Christmas. I receive the we should just be coparents chat and overtime i was overcoming with depression. Her reason was she said she felt she rushed into things and now she wants to just be alone for a while. Meanwhile im here sweating bullets because of becoming a single dad to 2 kids that i wanted more than anything to dedicate my life too. In time i come to terms with this. Well now fast forward to now. I just out of she got into a relationship with her best friend and she never intended to find out. i found out when someone sent me a screenshot with her bio stating she found true love (not in those words but same difference). Ive never felt more used in my life and now im sitting here trying to cope by lifting weights and smoking pot. But right now i feel numb to the core. This women was so loving and caring during the time we were in our relationship but after that I just I just feel I cant be part of this coparenting thing anymore. I want to be there mostly for my kids but ive been actively cut out of their lives and now i feel i can never fit back in. In the moment I want to terminate my rights and go far off to another state and start a new life. but I know i would only be hurting my kids in the long term but i know for a fact if i have to deal with this women with already how cruel shes been to me. Not even allowing my son in her to be named a sliver out of me. I feel i just need to cut my losses. I dont care if i have to pay Childsupport. I feel ive been taken advantage of and i have no friends to vent to. No legal advice to fall back on. Nothing but this. Im desperate but even now. Ill always try to find a way to support my kids but after today i just think its better to leave before i get too attached as morbid as it may seem.\n\nThis was not a matter of mistakes, I knew i wanted to start a family with her, The last time we were intimate with eachother was in november. She was sweet thoughtful and caring the entire time. But after the pregnancy she became distant. I did everything in my power to be there for her. I took care of her when she was violently sick, I went to her appointments, I never said no to her requests and pampered her to the best of my ability. And it feels just a stab in the back to be treated just like I dont matter. That she can have the kids and I have work just to see them. That what was suppose to rekindle our relationship as torn mental and emotional scars too deep i feel therapy isnt a option anymore. Course I dont think about ending it, A life better lived is the sweetest revenge. But at this point I dont know what to do. Do i take the chances and cut this from my life for good, I hurt my daughter, my unborn son, the women i loved and still somehow still care for, But im miserable and i can not continue living like this while im here breaking down one day at a time that i know for sure one day i just drive off in one direction and close my eyes. I cant forgive myself for what id do to my kids but i rather they know their dad be out their alive somewhere than a plot of soil they can see when they want too. \n\nOr do I cut it out before it spreads. Do i leave this and start something new. I know i will not be the same if I do. Every day im not with my daughter feels like im drowning but ive tried to express this to myself that its just a break and that eventually i can be with my daughter and son every day. day and night. I know this sounds extremely selfish but i wasnt the one that wanted to leave. I devoted my life to someone and in turn i devoted my life to my kids. But im not blind I see the writings on the walls. Im being pushed out more and more out my kids lives. She burnt bridges with my family so they dont want to deal with her. She has her parents against me because i wasnt with her when she left me the first time. I have no say in my kids lives and now im expected to be there for her whenever she needs. I know I deserve better. But the toll with how close everything is, I just cant handle it. Ive just been used to start a family and i feel violated but cant express it. Not to take this out of context but shes the type to brag how babydads have it so much more easier but im not the one who stepped out. Granted she broke things off before going on with this other guy but why do i have to pay the price? why do i have to keep working on things when she keeps making false promises. I didnt want this. i wanted to start a family and be faithful to my partner. now all i have is my kids i have to keep lying too that im doing well when really im not. Im not ok and i dont know how to express it other than violently screaming with everything that has been done to me.\n\n&amp;#x200B;\n\nTLDR I impregnant gf again. she leaves me again and hooks up with her best friend. Should I stay or should I go from my kids lives.",
        "created_utc": 1678626332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me pls! (both 16yo)",
        "author": "Academic-Zucchini274",
        "url": "https://www.reddit.com/r/relationships/comments/11pe3i8/help_me_pls_both_16yo/",
        "text": "[removed]",
        "created_utc": 1678626307,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 25(F) don’t know what to do with my life anymore…",
        "author": "Ok-Dentist-5657",
        "url": "https://www.reddit.com/r/relationships/comments/11pe2mr/im_25f_dont_know_what_to_do_with_my_life_anymore/",
        "text": "[removed]",
        "created_utc": 1678626232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [24/F] wrong for not telling my boyfriend [29/M] that I've casually hooked up with some of my guy friends?",
        "author": "annaqtpie",
        "url": "https://www.reddit.com/r/relationships/comments/11pe22m/am_i_24f_wrong_for_not_telling_my_boyfriend_29m/",
        "text": "I've been dating my boyfriend for about half a year now and he knows most of my friends. We are a pretty big group and have been hanging out since freshmen year of college. He actually loves hanging out with them, especially the guys. They even hangout without me sometimes (which I love!).\n\nLast night, during a drinking game he found out that I've hooked up multiple times with most of the guys in our group. Five guys to be exact. They jokingly called me their favorite blowjob call when they are single.\n\nHe controlled himself in front of them and made a few jokes about it but he confronted me after we were done hanging out. I didn't think it's an information he should've known (past sexual history) because I find it pointless but he disagrees, specifically about my guy friends.\n\nI assured him nothing serious has happened between me and my friends, especially since dating him but he is still furious at me. Not sure how to approach it because I genuinely don't think past sexual history should ever be discussed.\n\nTL;DR: My boyfriend found out I've hooked up with a few of my close guy friends and was blindsided by it. Is still mad at me because I didn't disclose that information.",
        "created_utc": 1678626184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I considered dateable?",
        "author": "HappyFall1959",
        "url": "https://www.reddit.com/r/relationships/comments/11pdvw0/am_i_considered_dateable/",
        "text": "[removed]",
        "created_utc": 1678625674,
        "upvote_ratio": 1.0
    }
]