[
    {
        "title": "My 18F gf dissociates constantly and I 18F don’t know what to do",
        "author": "Temporary-Can9580",
        "url": "https://www.reddit.com/r/relationships/comments/11skl3b/my_18f_gf_dissociates_constantly_and_i_18f_dont/",
        "text": "My gf 18F (let's call her Mel) dissociates constantly. Mel and I met back in mid December of 2021. We immediately clicked and a mutual friend set us up, a few weeks later we were dating. We got together in January of 2022 and lasted until March of 2022. During those months of the first time we dated things were good up until just after Valentine's Day. After that point, I started to notice she often dissociated and would become distant. There was times she wouldn't talk to me for an entire day. I tried to be understanding because as someone that has mental issues, I understand it's not easy. Mel would still hangout with me after school despite being in on of her episodes, and one time I was trying to get her attention and she wouldn't acknowledge me (this was a week before we broke up) and she got fed up with me. Mel yelled at me \"what the fuck is the wrong with you\" and dug her nails into my arm and ripped my skin. I'm still not sure if I was to blame for this, but I walked out and cried sitting on the curb while waiting for my mom to pick me. The next week, she ignored me for three days and then broke up with me. This hurt as I loved her and I still do. While breaking up with me, Mel said \"I can't have another him.\" She compared me to someone else and that alone was enough to break my heart. After the breakup I spiraled and was later diagnosed with BPD. Months went by and the pain dissolved but I never lost feelings for her. Fast forward to Christmas Eve 2022, she texts me and I decide to text back. The conversations were causal and I didn't know she still had feelings until New Years' Eve. We weren't in person together but we were texting. Mel and I were both high as it got closer to 2023 and while not being sober, the conversation swayed and we ended up confessing to each other that night. We decided to not be officially together since we wanted it to to work. A few weeks later, we both started to regret deciding to take it slow so I asked her to be my gf on January 17th. Things were great up until recently. I've started to notice the dissociation is occurring more and more again. It feels like the the same pattern as last time. Despite this, she has been a much better gf than the first time. I told Mel that I've been diagnosed with BPD. She actively tries to help me through my episodes and insecurities. When she isn't dissociating she's an amazing gf, but when she is it feels like I'm talking to a stranger. Whenever we aren't together in person she likes to get high a lot (I only smoked that one night with my friend). In a way it feels like she's chosen weed over me. She claims she loves me but but it doesn't feel like it most of the time. I know my personality disorder heavily affects my judgement so I really don't know what to do. Mel and I got together the first time when we were both 16 and I I really love this girl and she says she feels the same, but I can't help but feel I'm wasting my teenage years on a relationship that is harmful to my well-being. What do I do?\n\nTldr - My gf dissociates and I don’t know how to manage it",
        "created_utc": 1678942500,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (26m) says I'm (26f) taking him for granted. Majorly due to communication issues from my end. How to show i really do care and love him.",
        "author": "Dependent_Active_960",
        "url": "https://www.reddit.com/r/relationships/comments/11skivq/my_boyfriend_26m_says_im_26f_taking_him_for/",
        "text": "[removed]",
        "created_utc": 1678942295,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I protect my bf in school who is bullied just because of his sexual orientation?",
        "author": "No-Kitchen-8132",
        "url": "https://www.reddit.com/r/relationships/comments/11skfs1/how_do_i_protect_my_bf_in_school_who_is_bullied/",
        "text": "My bf is asexual and I know this since we started seeing each there, we started as close friends and he told me that he is ace back then and his sister explained it to me in detail(she had to met us since he was too shy to talk to me and ask to be his friend since I'm older than him and from other class), I had no problem with it, still don't. But soon I learned that he is pretty shy in general and every now and then gets poked on just because he is ace. He is such a sweetheart to everyone and never did anything wrong, just hangs out with his sister and few friends and hates most of the other classmates and high school environment since there is a lot of talking about sex.\n\nHe was picked on before more frequently, because most of his friends are female and he didn't get a gf for a long time, his sister told me that one time he was alone with one girl at his place, they were sitting on bed and watching TV if I remember correctly, when she started to make moves on him, he didn't react at all, she got undressed in bra and pants not knowing that he is ace and approached him, he just hugged her tightly and looked a bit distressed and sad, thankfully she was very polite and just returned the hug. She regretted what she did later and was much sad because of it, they stayed friends.\n\nWe just spend time hugging, cuddling, gently kissing, watching anime while holding hands, playing, stuff like that.\n\nMost of the class is mean to him for no reason, no one except his friends doesn't want to spend time with him, last week I saw him drawing something on desk, I came to him and he had tears in his eyes, I asked him what happened and he was trying to draw heart for me(he likes to write me letters frequently, it's so sweet, he does this since he can't always express his feeling directly because he is shy and always blushes and stutters a bit), but he didn't know how to do it and that day he asked his classmate to teach him how to draw it during brakes because she was the only one in class at that time and sits in front of him, she just brushed it off and told him to run off in a very mean way, he started crying immediately and walked off, she realized what she did and apologized to him but he was still upset. I talked to her the day after and she told me that she was in a bad mood and later apologized to him again and gave him a hug.\n\nBoys are even worse in our school and even pick on his friends, his sister protects him and me when I can/know but he can't take it, he will probably be homeschooled since this is going on for 2 years and he hates high school, I'm so sad about him.\n\nTL;DR: My boyfriend is picked on in school just because of his sexual orientation, he is very shy and doesn't want to tell the teachers because he fears that it will be worse, how can I explain others about it and protect him for the time being?",
        "created_utc": 1678942017,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23m) have no idea what even happening with my gf(21f)",
        "author": "the_juice07",
        "url": "https://www.reddit.com/r/relationships/comments/11skdsz/i_23m_have_no_idea_what_even_happening_with_my/",
        "text": "I have no idea really what’s happening\n\nFor the past year my girlfriend (21f)every other day accuses me(23m) of talking to someone else and tells me to screen share while on FaceTime and searches my phone I’ve told her when these things happened that I really feel like she doesn’t trust me and she just kept telling me that if I had nothing to hide than it shouldn’t be a problem and I definitely see the logic I’m that statement so each time even though i tell her every time it makes me feel like she doesn’t trust me she says the same things. It went all the way up until right now I told her I will no longer be indulging in her random searches because I’m at my breaking point with feeling like she’ll never trust me. She went on to say that she won’t do it anymore but she now feels uncomfortable being intimate with me because she feels her body is more private to her than a phone. So if we are putting a restriction on the phones she doesn’t feel right in showing her body. She said that she believed this was an open relationship but if we’re now being private with our phones now she reserves the right to be private with her body(again that’s her choice and I will not force her to do anything with her body) but I feel that she’s just being dismissive of my feelings.\n\nTl:dr I told my girlfriend that I was uncomfortable with her constant phone searches and she in turn said she was gonna be less intimate making me feel like she’s just dismissing my feelings",
        "created_utc": 1678941845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I owe him my support even if it is intensely painful for me?",
        "author": "ad_luna",
        "url": "https://www.reddit.com/r/relationships/comments/11skcut/do_i_owe_him_my_support_even_if_it_is_intensely/",
        "text": "I (71F) have a friend (65M) of 40+ years. Over the past 15 years he has become reclusive and a hoarder. He lives 2 hours away, so we communicate through email, texts, and phone calls and have only met F2F about 3 times in the last decade. He has a few medical issues that have, over the past few years gotten more serious and have required a few of surgeries. Because he has drank to excess everyday for years and taken whatever Rx meds he can talk his doctors into prescribing (Xanax, muscle relaxants, etc.) they have contributed to the downward decline of his health. He not only refuses to do anything to get better, he is convinced that he knows better than than his PCP, his cardiologist, and his gastroenterologist and frequently ignores their advice to make the lifestyle changes that could improve his health. We have discussed his plan to commit suicide when he decides he can't take the pain anymore.\n\nI've told him numerous times how his death will be excruciatingly painful for me as he is one of my few remaining friends.  I've tried everything I can think of to encourage him to make positive changes, such as getting out of the house, cutting way down on the alcohol and drugs, and following his doctors' advice. It just pisses him off that I \"lecture\" him and we end our conversations on a sour note.\n\nWhen I fail to respond quickly enough to his emails, texts, etc. he'll send me something that suggesting he's about to \"do it\" or he'll send me a photo such as the the bloody ones where he has deliberately cut himself!! I am aware that that is manipulative behavior, but, since I care about him, I always call immediately! That usually just turns into me listening to him talk, and talk, but rarely about his serious issues. He just wanted to talk to someone and I'm an easy mark.\n\n\\---\n\n\\*\\*TL;DR;\\*\\* : My question is this, \"Should I save myself the constant worry, anxiety, and emotional pain by cutting down, or even off, communication with him?\" Would that make me a bad person? Or should I just \"suck it up\" and keep allowing him to practice the emotional blackmail that has been constant and draining?",
        "created_utc": 1678941759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice wanted: are break ups supposed to be so hard?",
        "author": "sammyh25",
        "url": "https://www.reddit.com/r/relationships/comments/11sk9hi/advice_wanted_are_break_ups_supposed_to_be_so_hard/",
        "text": "[removed]",
        "created_utc": 1678941460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice needed: are break ups supposed to be so hard?",
        "author": "sammyh25",
        "url": "https://www.reddit.com/r/relationships/comments/11sk7si/advice_needed_are_break_ups_supposed_to_be_so_hard/",
        "text": "[removed]",
        "created_utc": 1678941306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice wanted, break ups are so hard idk if I’m doing the right thing",
        "author": "sammyh25",
        "url": "https://www.reddit.com/r/relationships/comments/11sk6q3/advice_wanted_break_ups_are_so_hard_idk_if_im/",
        "text": "[removed]",
        "created_utc": 1678941209,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23m) have no idea what even happening with my gf(21f)",
        "author": "the_juice07",
        "url": "https://www.reddit.com/r/relationships/comments/11sk6fq/i_23m_have_no_idea_what_even_happening_with_my/",
        "text": "[removed]",
        "created_utc": 1678941181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice wanted!",
        "author": "sammyh25",
        "url": "https://www.reddit.com/r/relationships/comments/11sk3le/advice_wanted/",
        "text": "[removed]",
        "created_utc": 1678940931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I try to help or save myself?",
        "author": "ad_luna",
        "url": "https://www.reddit.com/r/relationships/comments/11sk2no/do_i_try_to_help_or_save_myself/",
        "text": "[removed]",
        "created_utc": 1678940844,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [29F] boyfriend [34M] and I can't agree on a state to live.",
        "author": "AllhandsNotools",
        "url": "https://www.reddit.com/r/relationships/comments/11sk2dl/my_29f_boyfriend_34m_and_i_cant_agree_on_a_state/",
        "text": "My boyfriend [34M] and I [29F] have been dating for almost 7 years now. We've been long distance for 6.5 of those years because i was doing my PhD in one state and he decided to leave his job to travel the country in a skoolie. I just earned my degree and moved into the skoolie with him so we are currently nomadic and unemployed. I have been looking all over the country for jobs that are in his \"approved\" states. Criteria for approved states are low property cost to buy lots of acreage, easy to buy a gun, and the ability to be far from people so he can make a lot of noise running his business rennovating school buses and vans. The problem is, the jobs for my niche industry are in many states that are not approved. I've been trying hard to avoid some of his least favorite states - like California even though there would be a ton of opportunity for me there. After a few months of interviewing, I've finally landed a good offer .... in the northeast, which is an unapproved region because its very populated and expensive. I've been completely transparent about where I was able to get interviews and he was very supportive throughout the process and agreeing to make concessions on where to live, until now when the reality is setting in that we may be moving to a state he dislikes. I don't want him to have to sacrifice his priorities and be miserable. However, I just went through a grueling PhD program, feel like I deserve to get a job I'm excited about instead of settling, and need to break into my industry in this first job before I can be super picky about changing locations later. Is there a way to balance between both our priorities instead of 1 person ending up unhappy?\n\nTLDR: The locations where I can find jobs in my industry and not aligning with where my boyfriend prefers to live.",
        "created_utc": 1678940821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (27f) am in love with my (34m) boyfriend, but I don’t think he actually loves me 🥴",
        "author": "Acceptable_Bar_3227",
        "url": "https://www.reddit.com/r/relationships/comments/11sjzg6/i_27f_am_in_love_with_my_34m_boyfriend_but_i_dont/",
        "text": "I have been with my boyfriend for a year and a half now. All relationships has its ups and downs, but I’m starting to think that he doesn’t actually love me (faking the relationship). I feel like I’m chasing after this version of him (when he was more present, open with me, affectionate, etc) or to reestablish emotional intimacy. I expressed these feelings to him, cried, and he just sat there with a blank stare. I’m not sure what to make of it. I try to remind myself that if he wanted out, he would just break up with me…but I don’t actually believe that he would. Im not sure where to go from here or how to process it all. I don’t feel like a priority or someone he truly values and wants to spend quality time with me. It’s almost like I’m burden. I’m stuck between going with my gut and accepting the possibility that we are incompatible or chalking this up to relationship anxiety, and to continue working on it. Thoughts?\n\nTL;DR: I am in love with my bf and I think he has been faking his feelings for me. I don’t know if it’s relationship anxiety or something else. Thoughts?",
        "created_utc": 1678940558,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (27f) am in love with my (34m) boyfriend, but I don’t think he actually loves me.",
        "author": "Acceptable_Bar_3227",
        "url": "https://www.reddit.com/r/relationships/comments/11sjsxu/i_27f_am_in_love_with_my_34m_boyfriend_but_i_dont/",
        "text": "[removed]",
        "created_utc": 1678940012,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner (30f) disagrees with me (33m) that it’s inappropriate to sleep at someone’s house if you know they have a crush on you.",
        "author": "Confident-Maybe721",
        "url": "https://www.reddit.com/r/relationships/comments/11sjqfj/my_partner_30f_disagrees_with_me_33m_that_its/",
        "text": "[removed]",
        "created_utc": 1678939806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why won’t my boyfriend 41M have sex with me 38F ?",
        "author": "Throwra-town",
        "url": "https://www.reddit.com/r/relationships/comments/11sjmnf/why_wont_my_boyfriend_41m_have_sex_with_me_38f/",
        "text": "[removed]",
        "created_utc": 1678939483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I apologize to my ex (20F) Ex is (20M) 1year relationship,TLDR",
        "author": "space-racer8421",
        "url": "https://www.reddit.com/r/relationships/comments/11sjlnx/should_i_apologize_to_my_ex_20f_ex_is_20m_1year/",
        "text": "[removed]",
        "created_utc": 1678939397,
        "upvote_ratio": 1.0
    },
    {
        "title": "ive changed? feel needy, more emotional?",
        "author": "newstableiswut",
        "url": "https://www.reddit.com/r/relationships/comments/11sjl5m/ive_changed_feel_needy_more_emotional/",
        "text": "[removed]",
        "created_utc": 1678939351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Break up advice needed.",
        "author": "Possumcatcher",
        "url": "https://www.reddit.com/r/relationships/comments/11sjkx3/break_up_advice_needed/",
        "text": "[removed]",
        "created_utc": 1678939329,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F23) ex friend (F22) keeps creating fake Instagram accounts to get to me",
        "author": "Dazzling_Ad_1013",
        "url": "https://www.reddit.com/r/relationships/comments/11sjhjj/my_f23_ex_friend_f22_keeps_creating_fake/",
        "text": "I cut off a close friend last summer because she stole from me, lied, and was toxic. I blocked and removed her from my life and ever since then, she keeps creating fake pages to comment under my Instagram photos mean and petty stuff. Her comments are petty and very particular. What would you do in this situation? I always block her and never engage with her but she always finds a way to create a new page\n\nI know she probably is wanting my attention and wants me to reply back to her, but I have never said anything to her back. I’ve let it slide but at this point it’s getting frustrating because she won’t leave me alone. It’s sad that she’s acting this way because when we were friends, this was never the case. This bad side of hers came out after I cut her off.\n\nI didn’t want to cut her off since she was a close of friend of mine. It was a pretty traumatic experience to go through and I’ve healed from the situation. However every once in a while when she decides to pop up back under fake pages, it just opens back up the anger I have towards her. I genuinely want her to just move on and stop living in the past.\n\nTLDR: close friend of mine keeps creating fake insta pages to get at me",
        "created_utc": 1678939072,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get it through to my boyfriend that he needs to ask for consent and communicate?",
        "author": "sapphicangelx",
        "url": "https://www.reddit.com/r/relationships/comments/11sjgop/how_do_i_get_it_through_to_my_boyfriend_that_he/",
        "text": "\nMe (F19) and my bf (M20), have been dating for 8 months and have had this conversation multiple times but I can’t seem to get it though to him. Every time I think it’s over, he does something new to make me feel uncomfortable and not be able to fully trust him. He does little things behind my back and shares information with others that I believe it confidential and does things without asking me or communicating with me about it. It makes me feel really uncomfortable and borderline unsafe, like I can’t trust him with any information. That nothing between us is sacred. Like i said, everything I try to say to him, it seems like he just does not care about my boundaries. I love him but I don’t know how to get through to him. He’s going to therapy for his past traumas and getting relationship advice from his therapist. I’m his first serious relationship. We dated a couple years ago and it was really rocky. We’ve both grown a lot and become better people but this is one thing he doesn’t seem to be working on. I need advice.\n\nTldr: bf doesn’t know how to communicate or ask for consent and I need advice on how to get him to respect my boundaries",
        "created_utc": 1678938999,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the men out there.. Do you feel that if you aren’t married by a certain age, that you will never get married/start a family?",
        "author": "Difficult_Respect885",
        "url": "https://www.reddit.com/r/relationships/comments/11sjcgt/for_the_men_out_there_do_you_feel_that_if_you/",
        "text": "[removed]",
        "created_utc": 1678938653,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do w exes stuff that I want to give back during nc?",
        "author": "RegisterMinimum8327",
        "url": "https://www.reddit.com/r/relationships/comments/11sj9ku/what_do_i_do_w_exes_stuff_that_i_want_to_give/",
        "text": "Tl;dr\nrelationship that started out amazing, things got tough after the honeymoon stage. Broke things off 3 weeks ago and went nc since. \nI still have hope for the future, but I’m not holding on to it.\nWant to give him back some of his stuff he left and not sure how, since I don’t want to break no contact.\n\n\nSo exactly 3 weeks ago me (28f) and my ex (34m) broke up after about a year together. The relationship started as a fairytale, we were madly in love and saw each other as soul mates and planned our lives together. Seriously, it was a soul connection, we felt like we could be the most bare and authentic selves with each other, admired each other and just thought “this is our endgame”.\nAfter a few months everything went downhill, we tried to work on things but we weren’t really making any progress. We were fighting a lot and at some point I felt like he just gave up, he literally told me that he has no belief in this relationship and no force in him to fight for it… I was so invested at this point that I nearly begged and said that I will fight for the both of us and make it work (first mistake here- learn from my mistakes and never try to fight for someone who is not willing to put in the effort).\nObviously it doesn’t work like that and I became very anxious and needed a lot of reassurance from him, something that just pushed him even further away. \nAt some point I brought up a breakup and then it seemed like he got scared as well and wanted to work on things, but we just weren’t able to get out of that cycle of fighting and making up.\n\nI will admit that I see my fault in it as I was too needy and clingy, and it made him feel uncomfortable and like he has no freedom. I’m also aware of the fact that it was caused by the fact that he made me feel unsafe in the relationship and when I pointed it out he blamed it on me still (tbh that’s what happened in most of our fights- firstly he always blamed it on me and it took a lot of time and energy from me to make him understand my side as well. Where when it was the other way around and he pointed out something that was bothering him I always took accountability, and I guess he just got used to it which made him more comftarble blaming me).\n\nSo 3 weeks ago we’ve gotten into a fight and decided to break things off for good, even though it hurt so bad. we cried together, talked about how meaningful it’s been for the both of us and that’s when I felt the realness of the situation and the pain hit hard, so I tried to talk with him about trying one more time. But this time he didn’t agree. \nSo I guess it counts as if he dumped me.\nAlso I called him a few hours later crying to try and talk it out again and he stood his ground. He said he needed time, I told him I won’t be waiting but that he can contact me when he’ll “get enough time”.\n\nIm taking my time to heal, understand what happens more clearly and gain myself back after feeling drained and unworthy by the person I loved.\nIt’s been the worst 3 weeks of my life, the pain was excruciating, but I got to the realization that it was 100% the best thing to do. But obviously it still hurts.\n\nI don’t think that he’s a bad or a toxic person, but the interaction and the relationship became toxic and we weren’t benefiting from it anymore.\n\nI do have a lot of anger in me, since tbh I still feel like he hurt me way more by making me feel unsafe, unworthy and didn’t take accountability for anything. Although I recognize how my behavior contributed to it.\n\nIf I’m completely honest I still hope that at some point he will remember how special this connection was and think about what he did, take responsibility and come back so we can work things out *together* (I wouldn’t take less). But im also getting close to being ok with the idea that it might never happen. Also, there’s another side in me, which is getting stronger and stronger every day that thinks that I should never go back, even if he begged, because I shouldn’t have begged for the bare minimum, this can’t be my soul mate if he made me feel so disposable.\n\nSo, as I said, it’s been 3 weeks of absolutely nc.\n\nI have a set of his pants and some other small things that I want to give him back. One of his friends lives close to me so I can just contact him and ask him to give it to my ex the next time he sees him.\nIdk if it counts as breaking nc…?\nI don’t want him to think that I’m doing it to provoke any action from him (although a small part of me does think about it, but it’s not really my main purpose. I just don’t want his stuff here).\nI won’t throw it away because I feel it’s disrespectful.\n\nSo… yeah. What do you think I should do?",
        "created_utc": 1678938415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have a youthful free-spirited romance at 27?",
        "author": "BloodyBloodshot",
        "url": "https://www.reddit.com/r/relationships/comments/11sj778/is_it_possible_to_have_a_youthful_freespirited/",
        "text": "I've never had a girlfriend and I am almost 30. I missed out on the youthful and adventurous romance a lot of 16, 19, and 21 year old people got to have.\n\nIs it in theory possible to have a romantic relationship with a person my age where we can just have fun? No pressure of getting married. No pressure of having kids.\n\nCan I have a romance where the only goal is to have fun together? Because that's all I want to do right now given how much I have missed out on my life. I honestly don't want to think about marriage for the next 10 years.\n\nI want to have fun. I want those adventurous romances I just never got the opportunity in having. I resent the idea that in just year 3 a person my age wants to bring up marriage.\n\nThis is the reason I prefer dating someone slightly younger.\n\nTLDR; Is it possible to have the type of romances I missed out on as a young adult as I am in my late 20s now?",
        "created_utc": 1678938232,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found out my sister (31F) is cheating on her fiancé (31M)",
        "author": "One-Explanation-6177",
        "url": "https://www.reddit.com/r/relationships/comments/11sj77c/i_found_out_my_sister_31f_is_cheating_on_her/",
        "text": "My sister and I have an incredibly close relationship. Last week, I was over at her house for dinner and while she was in the kitchen preparing the food, our dad FaceTimed her phone that she left in the living room where I was. I didn’t pick up the call in time, so while I was navigating through my sister’s phone to call him back (we do this often, I have the passcode to my sister’s phone so nothing sketchy) I spotted a text thread with a message preview talking about how amazing “the sex” is from a random phone number that was very obviously not her fiancé’s. I know I shouldn’t have done this, but I opened up the message thread and glanced through a handful of text messages sent in the last couple of weeks that made it 100% clear she is having an affair. \n\nIt’s been a week now and I haven’t told a single soul (other than confronting my sister) and it’s absolutely killing me inside. My sister seemed extremely remorseful, pretty much chalked it up to a dumb stupid mistake because of cold feet and made it very clear that she’s not saying anything to her fiancé about it and begged me not to either. I have known her fiancé now for the three years they have been together and I respect him immensely. He’s a really great guy and as far as I can tell, treats my sister like a queen. I’m incredibly close with my sister, so if there were any problems between the two of them, I would certainly know about it (not that it excuses having an affair). The wedding is literally two months away and I am completely beside myself. A part of me feel like he should know, but it’s not my place…or is it? That’s my sister and I could never betray her, but I feel so horrible. How can I possibly go to the wedding and give a speech as her maid of honor attesting to their love when I know what I know? I have no idea what to do and I’m losing my mind over it.\n\nTLDR: I found out my sister is cheating on her fiancé and I don’t know if I should tell him or not because she won’t.",
        "created_utc": 1678938232,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F, 33) boyfriend's (M, 35) depression &amp; anger is wearing me down",
        "author": "Peridot14",
        "url": "https://www.reddit.com/r/relationships/comments/11sj6yk/my_f_33_boyfriends_m_35_depression_anger_is/",
        "text": " I (34f) say this as someone with anxiety,depression, OCD, and ptsd from childhood trauma. My partner (35 m) &amp; I have been together for 7 years. His job position changed and his schedule isn’t good, and has really had a hugely negative affect on him since the change in late 2019. Sometimes I feel like, while he loves me, he would rather be angry and miserable rather than go out of his comfort zone to try and have a more positive viewpoint and work toward the future. I have always been called a very patient and empathetic person, but I’m starting to experience what feels like compassion fatigue. We’re both queer POC- life has not handed us the easiest paths. I feel for that. But also everyday you make choices and plan ahead or else what’s the point? He’s sensitive to talk to about these things without getting frustrated, and I’m tired of being talked to like an annoyance- even if he doesn’t realize his tone in the moment. I don’t even want kids and I’m not the kind of person to go wedding crazy, but it’s been 7+ years and Ultimatums further upset him.\n\nHe was on an antidepressant after my insistence(SSRIs have done wonders for me)and had been seeing a therapist who kind of dropped him, making me think they weren’t really getting to the root of things. I had a momentary internal breakdown this evening when I inquired about plans he said he would make for a surprise trip for a belated Christmas present to me. This I thought this was sweet because he acknowledged that I am always the one to plan getaways and this time he was going to surprise me. When gently pressed/ inquired, he revealed that he hasn’t picked anything and hasn’t even really settled on a time- and I need real notice for my schedule as I also have not very flexible hours. The sad thing is that we tend to fundamentally agree on important things, but he gets so anxious about the future or decision making of any kind that it sends him into a stress tailspin that leads to ADD distractions. When I say “would you want to do \\_\\_\\_\\_\\_?” It’s always “if you want to. Whatever you want to do” etc with a sigh in the tone. Or if I ask for help with something it’s like I am the most annoying person alive. Multiple people in my life have noticed this and it bothers them. Doesn’t make someone feel wanted/ respected. Sexually though he’s still just as desirous, which then makes me feel like a piece of meat. He is also partially frustrated by my lack of libido- but I am not the kind of person to be able to separate sex from emotions and I don’t want to be vulnerable with someone with an attitude like that.\n\nWhen have you had to decide that being supportive to someone with depression is no longer enough? I had the very depressing thought that “what’s the point of planning the future alone, together?” I have really loved this man and feel for him but now I’m really feeling like I need to look out for me.\n\nTLDR; at what point do you make the switch from being empathetic to someone's suffering to not taking excuses for their behavior that's causing your own suffering?",
        "created_utc": 1678938211,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found out my sister (31F) is cheating on her fiancé (31M).",
        "author": "One-Explanation-6177",
        "url": "https://www.reddit.com/r/relationships/comments/11sj44b/i_found_out_my_sister_31f_is_cheating_on_her/",
        "text": "[removed]",
        "created_utc": 1678937988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my bestfriend (34F) doing this to me (32M) on purpose?",
        "author": "DuhCrispyBacon",
        "url": "https://www.reddit.com/r/relationships/comments/11sishy/is_my_bestfriend_34f_doing_this_to_me_32m_on/",
        "text": "TL;DR: Best Friend of many years sabotaging dating life. \n\n&amp;#x200B;\n\nJust a little context, we've been bestfriends since 2014 and she is married from before we even met. She has a loving husband and kids. They live with me while their house is being renovated. \n\nI've been in a couple of romantic relationships throughout our friendship. I'm currently single and as a friend I've asked for her help by asking her friends or dates and she also looks through Tinder and eHarmony with me. \n\nHowever it seems like she has no available friends or able to find a date. And when we go through the dating apps she finds things wrong with every match. \n\nAlot of people say that Male\\\\Female friendships don't work but ours does. But with her basically sabotaging my dating life, IDK now. \n\nObviously we've gotten closer with them living with me and yes we joke around and have playful flirting moments. But she knows there is a line I would never cross. \n\nI just don't know anymore. Do I just need to be blunt with her and ask if she is doing it on purpose and risk it becoming awkward or do I just stop asking her for help with my dating life?",
        "created_utc": 1678937070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my BestFriend (34F) doing this to me (32M) on purpose?",
        "author": "DuhCrispyBacon",
        "url": "https://www.reddit.com/r/relationships/comments/11siqc8/is_my_bestfriend_34f_doing_this_to_me_32m_on/",
        "text": "[removed]",
        "created_utc": 1678936902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal that I [24 F] have to beg my boyfriend [40s M] for attention?",
        "author": "ShyMediocre",
        "url": "https://www.reddit.com/r/relationships/comments/11sikps/is_it_normal_that_i_24_f_have_to_beg_my_boyfriend/",
        "text": "\"Beg\" is a strong word but I feel like I have to pine for his attention constantly. I didn't have to do this before. He doesn't text anymore. He only talks on the phone when I call him. He's always too busy to go out to eat or too tired to drive. We've been together for a few years now so I'm not sure what to do. I have loved him for years but he's starting to just ignore my existence. \n\nI just feel sad and empty constantly and not sure what to do. \n\n---\n**tl;dr**: I miss flowers and the general feeling of being loved. I don't know how to make the love of my life appreciate me again.",
        "created_utc": 1678936476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I (37f) wrong to be hurt that a couple of close friends (32f) (34f) haven’t offered to visit or help with anything since I had a debilitating accident?",
        "author": "thepartypossum",
        "url": "https://www.reddit.com/r/relationships/comments/11sik3z/am_i_37f_wrong_to_be_hurt_that_a_couple_of_close/",
        "text": "[removed]",
        "created_utc": 1678936428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I text my ex after breaking up with her? (M23 F23)",
        "author": "ThrowRA023852035235",
        "url": "https://www.reddit.com/r/relationships/comments/11si7vj/should_i_text_my_ex_after_breaking_up_with_her/",
        "text": "I broke up with my first love about a week ago. I am substantially regretting it. I miss her so much.\n\n**The Problem:** We had a lot of issues in our relationship. She had a lot of baggage from our past relationship that was emotionally/physically abusive and family trauma. This led her to having a somewhat misandrist mentality, often saying how she would hate men, and would perpetuate a double standard when it came to certain things. She would say things like \"short man energy\", made a few comments about me being short calling me \"little man\", etc, but would hate when comments about a woman's body were made. And she would have an issue of randomly being rude to me in front of people (like being snippy or a bit aggressive).\n\n**But the biggest issue was how we argued.** She would get really passive aggressive and frustrated very quickly. And our arguments would escalate because of that. She would often gaslight me, making up things that weren't true or having distorted perceptions about things that happened 15-20 minutes ago. And generally, she was quite stubborn and self righteous.\n\n**Ultimately, the reoccurring nature of all these problems led me to get fed up deep down and my patience thinned.** Whenever she did something to slightly irritate me or if we got into an argument, I would be quick to hint at breaking up. One time I did and was about to leave her apartment in the middle of the night after a huge fight. But she begged me to stay. She would beg every time. She would get really insecure after and I would try to deny my feelings and say I didn't mean any of it. This had happened a couple of times in the last few months of our relationship and I was lying to both her and myself.\n\n**The Regret:** But I am really regretting breaking up with her now. Majority of the time, she did try to put in effort. She would reassure me when I felt insecure about anything. She would cook for me when I was hungry even if she didn't feel like it. She would never get insecure about me cheating on her. She was always so physically affectionate - would treat me like a baby boy sometimes. She would do anything to have me stay another night - like drive me 45 minutes to my house so.I can pack my things and drive back with her. She would send me good morning texts almost everyday. She said she hated PDA, but when we dated, she loved it with me. She would treat me to things I liked. She would even just look at me in awe sometimes and just say how beautiful I am. **And she would always say that she felt like we were soulmates...that we were meant to be together.** I just feel like no one will ever love me or feel attracted to me the way she was.\n\nWhat made my perception of the relationship so two-sided was that when things were bad, they were really bad. And when things were good, they felt really good. **It felt like I was dating 2 people sometimes the way she would change when she was angry.**\n\n**The Break Up:** I called her and told her that it wouldn't work out and I was breaking up with her. It was shitty to do over the phone, but I knew I wouldn't have been able to do it over the phone. She was shocked and didn't get emotional or cry. Just disappointed, upset, and angry. She said \"you've been feeling like this the past few months?\" and I said yes. I could tell she was hurt. She didn't say anything or try to argue. And hung up.\n\nSome days later, she texted if we could meet in person so she could get closure - as she didn't get to say the things she wanted to. I told her that I didn't feel comfortable seeing her in person and that I gave her the chance to speak when I called, but she chose to say nothing.\n\nNo response. A couple days later, I felt real guilty about breaking up over the phone. So I texted her that I wasn't trying to get back with her, but I really did feel sorry for breaking up over the phone. And that I felt I wouldn't have been able to do it in person. No response from her at all.\n\n**What should I do?** I am thinking about reaching out and asking her if we can speak in person. **Should I bother? Or should I just accept this is over?** I'm afraid she wouldn't believe me if I said I wanted her back, because this isn't the first time I've broken up with her or suggested it. **But I also feel if she did take me back, she would exploit this moment in future arguments and push the power dynamic in her favor.** I'm scared that my first love will be seen as a memory forever. I've never been through this and it hurts so much. I don't want to regret this for the rest of my life.\n\nTLDR: Gf and I have had a lot of issues in our relationship, especially conflict resolution. I broke up with her, but I feel a lot of regret. I want to reach out, but this isn't the first time I've hinted at breaking up. I feel if I reach out, she won't believe that I want her back. And two, if she did take me back, I feel she would exploit this moment in future arguments and push the power dynamic in her favor. **But she also treated me so good when things were fine and I feel no one will love me the way she did when we weren't fighting.** What should I do?",
        "created_utc": 1678935530,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (22F) tell my best friend (22f) that I can't pay for her all the time?",
        "author": "anonymous_leopard1",
        "url": "https://www.reddit.com/r/relationships/comments/11si7ao/how_do_i_22f_tell_my_best_friend_22f_that_i_cant/",
        "text": "[removed]",
        "created_utc": 1678935486,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (24F) am realizing that my boyfriend's (27M) financial illiteracy might be a dealbreaker.",
        "author": "ShesAnNPC",
        "url": "https://www.reddit.com/r/relationships/comments/11si471/i_24f_am_realizing_that_my_boyfriends_27m/",
        "text": "In May, I (24F) will have been dating my boyfriend (27M) for 3 years. When we first moved in together, our focus was primarily on making sure we could pay our rent and bills on time. That was easy, nothing eventful there. However, as time went on, I realized there were goals I wanted to achieve, specifically financially. Taking on two jobs (one full-time and one part-time), I'd fixed the credit I tarnished when I was a late teenager, I put away almost 2 thousand in savings, and I'm finally learning how to invest in the stock market. In short, my financial well-being took a total 180-degree turn during my relationship and I don't plan on stopping the improvement.\n\nI can't say the same for my boyfriend. He's only ever had one credit card that ended up going into collections and isn't being paid off... So his credit is already screwed. (His only other bill is wifi. He doesn't have a car note and for some reason, he doesn't have car insurance either) If it's not money being put away for rent, I'm not sure where else it's going, because sometimes I'm the one buying things for him when he runs out of money. It was only after I realized he was getting closer to his thirties that I'd ask him about fixing his financial stability, paying off his collections, or educating himself about finances in general. But he argues that he doesn't have the money for it, or that he's busy pursuing his computer science degree (he's taking one class currently, and doesn't have his associate's yet). Whenever he wants to go out to eat I'd tell him the usual \"We just went grocery shopping, we can eat at home\" or \"Have you contributed anything to your collections account yet?\" And this happens so often that I can't help but feel like I'm nagging him. The amount of conversations and fights we've had about money is endless, and I feel foolish having these fights at my age.\n\nDon't get me wrong, he is the sweetest man I've ever come to know. He's been there for me when I had nothing. When he can't afford florist bouquets, he'd make his own. He'd write love letters. He looks at me every single day with the same eyes as when he first met me. My parents absolutely love him, including my sister (and she hates everyone). I can't help but feel guilty having the thoughts that I do. He's been hinting that he wants to marry me someday. And I told him I can't do that until he gets his credit and finances in order. But we've had this conversation for over a year now. I'm afraid of what will happen if this behavior doesn't change. I'm upset that it takes so much convincing from me for him to even look at his own credit score.\n\nI love him, but I'm not sure how much longer I can continue nagging for him to get himself together. If he were to propose to me tomorrow, I know I'd reject him. Am I wrong for considering leaving him for this? How much longer do I wait, or what can I do?\n\n&amp;#x200B;\n\nTLDR: My boyfriend is not financially literate and I think it's a dealbreaker.",
        "created_utc": 1678935254,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (24F) don't know how much more of my life I can give away to my financially unstable boyfriend (26M).",
        "author": "ShesAnNPC",
        "url": "https://www.reddit.com/r/relationships/comments/11shzco/i_24f_dont_know_how_much_more_of_my_life_i_can/",
        "text": "[removed]",
        "created_utc": 1678934904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Torn between whether I (28f) should work on my relationship with my bf (29m) or call it quits?",
        "author": "sandbanks6",
        "url": "https://www.reddit.com/r/relationships/comments/11shv3r/torn_between_whether_i_28f_should_work_on_my/",
        "text": "We’ve been dating for 8 years. Things have been rocky on and off for years now. Without making this a very long post, I’ll try to cliff notes a couple big issues. (Or you can read my post history). \n\n-We’ve tried changing our relationship dynamic: engaged in threesomes and open relationship which I didn’t want and very much hurt me mentally and emotionally. But I was somewhat manipulated and coerced into it and continuing to do it because I didn’t want to lose him. This was maybe 5 years ago and lasted on off for a couple years. \n\n-bf spends all day sleeping and hasn’t worked in 10 years (on disability for depression/anxiety). He hasn’t made a single effort into trying to work or do anything (until this past month after realizing our relationship was on the fritz). We don’t spend time together…ever..bc he’s sleeping all day. \n\n\nWe both have our own issues we deal with. Right now our relationship is is a bad state. We haven’t had sex in almost 6 months now. Barely even kissed either. He’s tried (not recently) but I just don’t have the interest in him like that atm. \n\nWe’re in a vicious cycle of: he doesn’t want to spend time with me because I’m cold and unaffectionate with him and I’m cold and unaffectionate because he never wants to spend time with me and we never interact. I’m not sure which started the cycle, or if it was combo. I think other factors may have contributed now that I think of it. We had a large right around 6 months ago (over the most trivial thing) and he ended up saying A LOT of hurtful things to me/about me. This happens a lot anytime we fight.  Large or small fight..he takes a lot of jabs and says things either he truly believes or knows will hurt me, such as (and I quote): \n“The level of fucked up that you are that I’ve put up with.”\n“Years of dating a useless mute”\n”There’s a lot of things that are unfortunate about you that I put up with”.\n”You have no personality and you’re miserable to be around”\n….To name a few. \nWords hurt. Words hurt me a lot and it’s hard not to dwell on it. We can be having a good day, but In the back of my mind I know he’s said these things about me and hurt me this way. \n\nWe’ve had serious conversations about how we feel about everything and I brought up the possibility of breaking up. This isn’t something he wants. He claims that the issues he’s facing such as the intimacy issues and me being unaffectionate are current issues happening so that justifies his behavior of not wanting to spend time with me. But my issues of being affected by the threesomes/open relationship and the hurtful words are in the past and I should get over it. \nI’m in the process of trying to get into therapy because I believe I have a lot of issues, maybe some attachment issues etc. but, is this something that I can just “get over” and be okay with and continue my relationship? I can’t just forget the things that happened and how they made me feel, can I? \n\nI want to get married and have kids. Right now, I cannot see any of that happening with my current bf. However I still love him throughout everything. We’ve spent so much of our life together. I cannot fathom entering the dating scene and going through the awful awkward getting to know you stages. \nIve probably deleted a lot of posts or posted on other accounts, but I’ve been asking for advice on this same thing over and over again for YEARS and I feel like that should be a clear indicator. \nI can be sobbing all night and hyperventilating at how sad and hurt I am over something that happened and want to break up, but then the next day he’ll apologize tell me he doesn’t want to lose me and be SO sweet to me to the point where I can’t bring myself to imagine ever leaving him…which maybe that’s a therapy problem. \n\nIt’s a long winded post, but basically \nTl;dr after 8 years of on and off rockyness within my relationship I know know if it’s better to just end it or try to work on /fix myself in therapy in order to fix the relationship.",
        "created_utc": 1678934603,
        "upvote_ratio": 1.0
    },
    {
        "title": "He (M24) left me (F17)",
        "author": "ThrowRAchax",
        "url": "https://www.reddit.com/r/relationships/comments/11shu6g/he_m24_left_me_f17/",
        "text": "I’d like to start off by saying that everything I’m about to explain happened 2-3 years ago. I’m not proud of some of the things I did but I can’t change the past and I’ve matured a lot since then. \n\nIn 2020,  I met a guy  online. I was 17 and he was 24.  We both lived in different countries (he was a European). He was a paramedic and I was still in High school.  We immediately hit it off and we talked 24/7 for 4 months. I had never dated anyone before. He was the first guy I ever truly cared for and he made me feel loved. After 4 months of talking (we never dated), I found out he was in a long distance relationship with an American. She was 31. \n\nI didn’t take it well. I accused him of using me which he replied to by sending me all the nudes she had sent him and telling me that he didn’t need me.  He also started posting her on his story with captions like “stop looking at her smile B” and showing off all the gifts he was sending her. \n\nI didn’t block him but I stopped talking to him. Instead of moving on, I acted like I was perfectly fine to show him that I didn’t care. \n\nA few months after, I decided to contact his girlfriend to let her know that this guy was talking to me and flirting with me while they were dating. This backfired on me because she thought I was jealous of her and she told me to go kill myself. \n\nFew months later, fake accounts started adding me on Snapchat. All of them were made to insult me. I don’t have any enemies in real life and I barely have any friends. I can’t confirm that it was him or his girlfriend, but I think it was.\n\nI am now turning 21 soon and I regularly think about this whole situation. I’ve never talked about it with anyone because I’m embarrassed. I don’t like admitting that I loved someone that I’ve never met and that I only talked to for a few months. I know I am pathetic but how do I move on from this. \n\nTldr; I can’t move on and it’s been 3 years.",
        "created_utc": 1678934534,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some advice. PLEASE guys are so hard to read. 31F 40M",
        "author": "Personal_Media1775",
        "url": "https://www.reddit.com/r/relationships/comments/11shspa/i_need_some_advice_please_guys_are_so_hard_to/",
        "text": "Help me I like him.\n\nI’m 31F and he’s 40M\nWe work together and I’ve found him attractive since i started there. I’ve been with the company for 9months. \nNever told him how I felt so unless he caught me checking him out I don’t know. \nBut he would make little\nComments about how he needs a woman in his life or he got sick one time and I told him To make him a hot tottie he said he needs a women.  He say he’ll miss me while\nI’m gone or to get done early so he can see me one more time. \nWell last week me and another co worker were talking and they said when they got done he was at the gym so when I got back at the end of the day he was up there so I told him that he was trying to make it where we couldn’t do our jobs he asked what I meant I said because he already looks good and the way he’s going we’re definitely not going to be able to pay attention at work so then he pulled his phone out and showed me a shirtless picture of him and said it was from when he use to work out all the time and the asked me to look up and he flexed his pecs at me it took everything to keep my composure. Well we went outside and to go help a fellow coworker and he was standing on my right side and then got behind me and out his hands on my waist and squeezed and the moved to the left. \nSo two days ago I told him that he was a kinda a jerk for doing what he did because I find him attractive and unfortunately I do like him and that he can’t do that he said he would try to do better so as we were walking away I checked him out he watched me do it and responded with try not to fall in love with him I laughed and said I’ll try. So today I see him and I tell him I have to talk to him so we walk outside and I tell him\nI got him a coffee in my car and he says aww it’s like you like me so I said you know I do I told you I shouldn’t but I do so as we get to my car he ask so what do you want to do to me and says my first name I told him that would be unprofessional for me to say (I wanted to tellHim) so we go to go back inside I stopped him and asked him asked how he thinks I would do in the dating world cause I don’t find myself very beautiful he said that it’s not always about beauty that attracts it’s personality and my personality isattractive \n\nTL DR:: I’m 31 F 40 M I like my boss and what to know if it’s mutual. \nPlease don’t bash we’re both adults you can’t help who you like. (Again I like him)",
        "created_utc": 1678934435,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [34f] boyfriend [37m] is cagey about moving in and long term plans.",
        "author": "throwaway0982509",
        "url": "https://www.reddit.com/r/relationships/comments/11shs5g/my_34f_boyfriend_37m_is_cagey_about_moving_in_and/",
        "text": "I feel like an idiot typing this because I know what I would say to the same person in my situation.\n\nWe have been together for 6 years. The first five he was in undergraduate school about two hours away and was tied to a specific area. The last year he has been in a job he doesn't love, but I support, and is about 30-45 minutes from where I live. We have discussed moving in together finally now. Our area is extremely high cost of living and on our own, we could not afford the same place we could together. We both currently live with our families to save money. I have been ready for years to make the living together leap, but there has been one reason or another why he doesn't (most notably, where he will end up working - I work remote, so it doesn't matter).\n\nToday I got news that I need a prescription medication that my insurance does not cover. To pay out of pocket, it is $900/mo. My boyfriend's company pays for all of his (and his eventual family's) insurance 100%. When I brought up my situation to him, he just blew by it like it didn't even occur to him that he could solve my issue in a uh, marriage certificate (which I would never use as a reason to get married, but we have talked about this being a thing before).\n\nWe have talked about the future, talked about getting engaged, talked about kids, etc... like it's a foregone conclusion but at this point I'm feeling naive. He watches this Reddit so he'll probably see this and know that it is him. I love you, but I am so confused and kind of hurt at this point.\n\nMy question is what is the best way to frame my frustration about this that doesn't put him back on his heels?\n\ntl;dr: My boyfriend of 6 years continues to seem cagey about moving in together. How do I have a discussion with a partner that I know will put him back on his heels and feel attacked about his choices/discover why?",
        "created_utc": 1678934396,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner isn’t splitting finances",
        "author": "mugshotmageech",
        "url": "https://www.reddit.com/r/relationships/comments/11shqhb/my_partner_isnt_splitting_finances/",
        "text": "[removed]",
        "created_utc": 1678934276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I wrong to be hurt that a couple of close friends haven’t offered to visit or help with anything since I had a debilitating accident?",
        "author": "thepartypossum",
        "url": "https://www.reddit.com/r/relationships/comments/11shntq/am_i_wrong_to_be_hurt_that_a_couple_of_close/",
        "text": "[removed]",
        "created_utc": 1678934089,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [34f] boyfriend [37m] is cagey about moving in and long term plans.",
        "author": "throwaway0982509",
        "url": "https://www.reddit.com/r/relationships/comments/11shmwe/my_34f_boyfriend_37m_is_cagey_about_moving_in_and/",
        "text": "[removed]",
        "created_utc": 1678934021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the seem like a have your cake and eat it too type situation?",
        "author": "xoxo_banana30",
        "url": "https://www.reddit.com/r/relationships/comments/11sh70w/does_the_seem_like_a_have_your_cake_and_eat_it/",
        "text": "[removed]",
        "created_utc": 1678932926,
        "upvote_ratio": 1.0
    },
    {
        "title": "What tf is up with my boyfriend?!",
        "author": "Competitive_Tie_8383",
        "url": "https://www.reddit.com/r/relationships/comments/11sh6mr/what_tf_is_up_with_my_boyfriend/",
        "text": "[removed]",
        "created_utc": 1678932901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me I like him. 31F 40M",
        "author": "Personal_Media1775",
        "url": "https://www.reddit.com/r/relationships/comments/11sh6hg/help_me_i_like_him_31f_40m/",
        "text": "I’m 31F and he’s 40M\nWe work together and I’ve found him attractive since i started there. I’ve been with the company for 9months. \nNever told him how I felt so unless he caught me checking him out I don’t know. \nBut he would make little\nComments about how he needs a woman in his life or he got sick one time and I told him To make him a hot tottie he said he needs a women.  He say he’ll miss me while\nI’m gone or to get done early so he can see me one more time. \nWell last week me and another co worker were talking and they said when they got done he was at the gym so when I got back at the end of the day he was up there so I told him that he was trying to make it where we couldn’t do our jobs he asked what I meant I said because he already looks good and the way he’s going we’re definitely not going to be able to pay attention at work so then he pulled his phone out and showed me a shirtless picture of him and said it was from when he use to work out all the time and the asked me to look up and he flexed his pecs at me it took everything to keep my composure. Well we went outside and to go help a fellow coworker and he was standing on my right side and then got behind me and out his hands on my waist and squeezed and the moved to the left. \nSo two days ago I told him that he was a kinda a jerk for doing what he did because I find him attractive and unfortunately I do like him and that he can’t do that he said he would try to do better so as we were walking away I checked him out he watched me do it and responded with try not to fall in love with him I laughed and said I’ll try. So today I see him and I tell him I have to talk to him so we walk outside and I tell him\nI got him a coffee in my car and he says aww it’s like you like me so I said you know I do I told you I shouldn’t but I do so as we get to my car he ask so what do you want to do to me and says my first name I told him that would be unprofessional for me to say (I wanted to tellHim) so we go to go back inside I stopped him and asked him asked how he thinks I would do in the dating world cause I don’t find myself very beautiful he said that it’s not always about beauty that attracts it’s personality and my personality isattractive \n\nTL DR:: I’m 31 F 40 M I like my boss and what to know if it’s mutual. \nPlease don’t bash we’re both adults you can’t help who you like. (Again I like him)",
        "created_utc": 1678932889,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have overwhelming jealousy and a sense of anxiety when my gf does almost anything with other people and it doesn't invovle me",
        "author": "Dry-Huckleberry-6282",
        "url": "https://www.reddit.com/r/relationships/comments/11sh6a6/i_have_overwhelming_jealousy_and_a_sense_of/",
        "text": "[removed]",
        "created_utc": 1678932875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girlfriend has been gaining weight and feeling insecure and I don’t know how to answer my gf’s questions.",
        "author": "LilNugglet",
        "url": "https://www.reddit.com/r/relationships/comments/11sh55z/girlfriend_has_been_gaining_weight_and_feeling/",
        "text": "Anon account bc i stupidly used my real name for my main account. (I was 17 and stupid). So like the title says, my girlfriend has been gaining weight recently and its starting to get to her. Not to say she eats a lot, she eats a normal amount. The other day she had it real bad when she couldn’t fit into a dress she could previously fit into, and her grandmother called her out for gaining weight. Thing is, she does make efforts to loose weight, but it logically really isn’t enough. She goes for walks here and there but its not enough to burn the calories she takes in daily in order to loose weight. She also does not believe in a diet. When she asks me why she isn’t losing weight, I don’t know how to tell her she’s not doing enough to loose weight because she will get insecure and sad, and feel like I am invalidating her efforts. Personally I’m fine with the way she looks and I always reassure her I’ll always love her no matter what, but there is a side of me that wants to tell her the solution to her problem. What should I say?\n\nTl;dr GF gaining weight, feels insecure, doesn’t exercise enough to loose weight, I don’t know how to tell her that",
        "created_utc": 1678932793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxious Partner is Never Wrong",
        "author": "gnarlidrum",
        "url": "https://www.reddit.com/r/relationships/comments/11sh3j7/anxious_partner_is_never_wrong/",
        "text": "My (21m) partner (20f) has severe anxiety and has not once in a year admitted to ever being wrong. The anxiety is relevant because any time I even begin to confront her about a specific issue, she feels it’s *her* I’m attacking and not the topic at hand and begins to shut down. \n\nThis goes from larger family/relationship issues to small debates about grammar/spelling that start as just-for-fun debates; then turning into me supposedly attacking her when I continue to stand my ground. \n\nI remember not one occasion, big or small since last may, that she admitted to being wrong about *anything*, when she legitimately corrects me and I admit it each time.\n\nI want to be better, and know how to handle these situations when she is apparently *not ever* wrong.\n\nTL;DR\n\nPartner hasn’t been wrong in a year. How to handle situations with a partner who is never wrong and feels personally attacked when confronted if they are…?",
        "created_utc": 1678932678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is he interested in me, even just a little bit, after his comment? 26 F 25 M",
        "author": "ThrowRAtwentyfive",
        "url": "https://www.reddit.com/r/relationships/comments/11sh2wi/is_he_interested_in_me_even_just_a_little_bit/",
        "text": "[removed]",
        "created_utc": 1678932635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxious Partner is Never Wrong",
        "author": "gnarlidrum",
        "url": "https://www.reddit.com/r/relationships/comments/11sh1mx/anxious_partner_is_never_wrong/",
        "text": "[removed]",
        "created_utc": 1678932550,
        "upvote_ratio": 1.0
    },
    {
        "title": "I kicked/hit my husband, and he told his parents",
        "author": "RevolutionaryFile318",
        "url": "https://www.reddit.com/r/relationships/comments/11sgz9s/i_kickedhit_my_husband_and_he_told_his_parents/",
        "text": "TL;DR  I kicked and hit my husband while we were in bed due to pure exhaustion and rage over being ignored, he told his parents I went crazy and beat him despite me keeping everything he's done to me to myself.\n\nMy husband recently went out of town for a week to Vegas, leaving me with our 1.5 year old (while also working). Of course she got sick as soon as he left, and it was a hellish week for me. Once he got back, I had already told him my expectations of getting rest since he just had a week off. He comes back, and unbeknownst to me, changed his schedule so he had to go in early the first two days he was back. Okay, whatever. Then the rest of the week excuse after excuse as I was up with our kid every night (she decided to wake up from 12-3 for a couple of weeks) and every morning. I was so tired I was crying multiple times a day with no one to help me. Friday he even had drinks with a coworker till 2am while I was up with her. \n\nThen comes Sunday night. Finally I'm hoping to get some rest. I have work the next day (in the afternoon) and he is off Mondays so I figured I'd be able to rest. He gets off late that night (he works second shift), I'm up with baby when he gets home around 1am. I hand her off and try to get some sleep, but despite how exhausted I am I couldn't fall asleep for a while. \n\nCue the husband coming to bed... This man snores so damn loud it is infuriating (and won't go see a doctor). I had to put my hands over my head to go back to sleep. It's like 4am at this point. Then I wake up 3 hours later to our dog barking and his dad is here to take his car to get worked on (???? Not sure why this is even happening). He gets up to give him the keys, lays back down, and immediately drifts off and starts snoring. I LOST it. I'm not proud of this, but I tried to explain to him, through my tears, that I was literally losing my mind from lack of sleep and I needed him to go elsewhere (I'm the only one that wakes up to the monitor, no point in me leaving when he can sleep anywhere easily). He rolls over and SHUSHES me. I feel white hot rage. He ignores me further. I didn't know what to do, and I started kicking his legs and even punched his butt/hips. He ignores me, so I go to the other room (yeah I should have done this in the first place but like I said I am the one who wakes up to the monitor and gets her in the morning and it takes me forever to fall asleep if I move). He ends up coming in the guest room to check on me while I'm mid panic attack and we make up for the most part. \n\nHe ends up taking a nap for some reason, I never get any sleep, go to work, proceed as normal. \n\nOnce I got home, I was on his phone and saw a thread with his dad where my husband tells him about our morning. He said something along the lines of: \"this is what I deal with constantly. She got mad that she was woken up and started beating me. Literally went looney tunes for no damn reason.\" \n\nI know you should never resort to physical violence, and I definitely do feel bad (I want to add that we have a bit of a different dynamic with our sex life that sometimes makes the boundaries less clear- still not an excuse for hitting out of anger, but it has happened once or twice on both of our ends). But honestly I'm just fucking mad. I've dealt with his lies, addictions, emotional affair, hurtful words and more all by myself. We see his family often, and this is just embarrassing really. I want to explain myself and tell them some of the shit he's done but obviously that's stupid and I won't do that. I also know most of you will say we are toxic and to cut ties, but we have a child and will not be doing that before putting in work to make things better.\n\nI want to feel more apologetic, but I'm just pissed. I'm pissed that despite me begging for sleep he didn't consider my needs, I'm mad that he completely blew me off and then told his side as if I just went crazy over nothing. I'm mad that he is ruining my relationship with his family.\n\nI have my first therapy appointment next week and will bring this up, I definitely need to work on my anger issues. I just wanted to put this down in writing and  maybe get some feedback on how to navigate the situation with his parents after this. I don't want to see them ever again, I'm very embarrassed, but obviously that's not an option. He has told them I have some anger issues before so this is only fuel on fire (I developed post partum rage and resentment largely due to his lack of support so it hurts that I'm painted crazy/angry now). I have not ever resorted to violence before, and will not in the future (just in case that isn't clear). Do I even deserve to be angry or am I being self indulgent?",
        "created_utc": 1678932380,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [27f] caught my boyfriend [28m] on Grindr",
        "author": "AcidRoulette",
        "url": "https://www.reddit.com/r/relationships/comments/11sgxp5/i_27f_caught_my_boyfriend_28m_on_grindr/",
        "text": "My (27f) boyfriend (28m) made a Grindr account 7 months ago, had it for a week (so he said) and then deleted it and I just found out. \n\nMy boyfriend and I have been together for a little over a year and have had a pretty good relationship, I have bipolar disorder and can sometimes not be feeling great, or whatever, also I got pregnant by him very quickly in the relationship and we had an abortion that we both fully agreed on. Since then our sex life hasn’t been great, but both of us don’t really have high sex drives anyway so it really isn’t a big thing. \n\nI also found out he was sending dick pics to a couple girls he met on stripchat or something. And all of this he said the same thing, it went on for a week at most and then he felt really bad and deleted everything. He said he never met up with anyone, never did anything it was just on the phone. I found all of this on an old phone he had that I was going to get some pictures off of. I confronted him about it and he like admitted it but not really, he just said “I don’t know why” and like the Grindr thing, I asked him so many times if he was bisexual, I’m bisexual I really don’t care love is love like I just want honesty. Before we started dating I also know he sent dick pics to a male gay co worker for money. When I asked about the Grindr I immediately said “like what? Was it a money thing?” And I regret that because of course he was like “yes yes I don’t know i needed extra money” he’s a smart dude like, just has always had bad luck and stuff with jobs/money. I love him and already know I’m going to stay. I just really want to know WHY?\n\nTL;DR caught my bf on Grindr and stripchat and says he doesn’t know why",
        "created_utc": 1678932272,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (31) bf is turning 47 this weekend, we can't get his friends + family all together because of time &amp; location, is it very cringe to arrange a Skype for us all to sing happy birthday to him? Would people rather not be bothered/will people be embarrassed for him?",
        "author": "CloudIcy5347",
        "url": "https://www.reddit.com/r/relationships/comments/11sgs6s/my_31_bf_is_turning_47_this_weekend_we_cant_get/",
        "text": "[removed]",
        "created_utc": 1678931913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some insight on why my boyfriend was on Grindr",
        "author": "AcidRoulette",
        "url": "https://www.reddit.com/r/relationships/comments/11sgrwl/need_some_insight_on_why_my_boyfriend_was_on/",
        "text": "[removed]",
        "created_utc": 1678931893,
        "upvote_ratio": 1.0
    },
    {
        "title": "After three months of dating my (33m) therapist girlfriend (28f) I leaned on her for support one weekend and she got the ick",
        "author": "Settovibrate1",
        "url": "https://www.reddit.com/r/relationships/comments/11sgqfn/after_three_months_of_dating_my_33m_therapist/",
        "text": "It wasn’t even bad. I was just frustrated with work stuff and was feeling less than myself. When breaking up with me she pointed out her attraction to me started to change a couple weeks ago.  When I pointed out that it was during the period I was feeling off she broke down and kept calling herself a terrible person. \n\nI was there for her and supported her countless times over the three months, but the one time I need her that was it. I know I should feel like I dodged a bullet but this still sucks.\n\nTldr: therapist girlfriend broke up with my because I was sad and quiet for a weekend",
        "created_utc": 1678931794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if this is the right sub but",
        "author": "skiddaddleskdleurpe",
        "url": "https://www.reddit.com/r/relationships/comments/11sgpjf/not_sure_if_this_is_the_right_sub_but/",
        "text": "[removed]",
        "created_utc": 1678931735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (24f) try to save the marriage or leave",
        "author": "chaoscrochet",
        "url": "https://www.reddit.com/r/relationships/comments/11sgpbq/should_i_24f_try_to_save_the_marriage_or_leave/",
        "text": "Is my (24f) marriage over with my husband (26m) or should I try save it.\n\nSo we’ve been married for three years now. Covid wedding. We did great when we first got married but husband job hopped so his job he has now he isn’t making much but has already started getting raises and will make a lot in a few years but is still on the bottom for now. I’ve had a few health issues so I wasn’t able to get into the career I wanted but am happy now. Lately he’s been having mood swings and getting upset with me. He got mad that I haven’t been working out and saying I need to get in better shape. I’m 5’5 and only 150 lbs. \n\nI’m currently waiting for an appointment with general surgery so I can’t do physical activity that will make it worse right now. He’s been threatening me with divorce the last few months whenever I wouldn’t do what he wants me to do. I admit I don’t clean as much as I should due to my health issues and adhd. But he doesn’t help clean either stating it’s my mess not his. \n\nWe don’t have kids just a dog. But tonight he sent me a text stating I have to start exercising daily. I have to respect him and his ideals. I have to listen to him and take action when he speaks. If I argue with him he will take it as our marriage is over. He says I haven’t been trying to improve myself but I’ve been working on my mental health. Eating better. I started my own business as a side hustle. I went to the doctors and got diagnosed with health issues and I’ve been following doctors plan of care to take care of myself. \n\nI feel as those these podcasts he listens to have convinced him a wife is supposed to be a blow up sex doll who takes care of every need. When we aren’t arguing I do love him. I just wish he would listen and talk to me instead of making demands and ultimatums. \nI have friends who have offered to let me rent with them in June I just don’t know what to do.\n\nTD;LR my husband is acting different and I don’t know whether to stay and work it out or leave.",
        "created_utc": 1678931719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I tell my mom I’m gay?",
        "author": "nonythemouse",
        "url": "https://www.reddit.com/r/relationships/comments/11sgn0t/should_i_tell_my_mom_im_gay/",
        "text": "[removed]",
        "created_utc": 1678931565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (24f) marriage over with my husband (26m) or should I try save it.",
        "author": "chaoscrochet",
        "url": "https://www.reddit.com/r/relationships/comments/11sgkww/is_my_24f_marriage_over_with_my_husband_26m_or/",
        "text": "[removed]",
        "created_utc": 1678931417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I text him?",
        "author": "Financial-Divide-951",
        "url": "https://www.reddit.com/r/relationships/comments/11sgdrp/should_i_text_him/",
        "text": "[removed]",
        "created_utc": 1678930919,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to text an old fling?",
        "author": "Financial-Divide-951",
        "url": "https://www.reddit.com/r/relationships/comments/11sgcz8/how_to_text_an_old_fling/",
        "text": "[removed]",
        "created_utc": 1678930866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I (24F) do about my friend (24M) and our feelings",
        "author": "Proper_Ad4985",
        "url": "https://www.reddit.com/r/relationships/comments/11sgciz/what_do_i_24f_do_about_my_friend_24m_and_our/",
        "text": "Both of us got out of relationships not long ago and have known eachother for over 10yrs \n\nWe have always been good friends and gone to each others events and houses and such, both of our ex partners got on well together too which was great \n\nFast forward to recently, we have been hanging out quite a bit either with other friends or just eachother, I slept at his house a little while ago and we drank and such and he cuddled me and stroked my hair and kissed my head (I think he thought I was asleep?) and only the other week we were at a party together and both got tired at the same time and he asked if he could cuddle me.. same as last time, he stroked my hair and would kiss my head until we both fell asleep\n\nOur mutual friends have always joked to me that they thought we would be perfect together, and I won’t deny I had a massive crush on him for years and maybe still do, but I am worried that he possibly just does this stuff with me due to context (lonely, drunk etc) and not because he actually reciprocates. I’d hate to ruin the friendship we have by bringing any of this up\n\nTL;DR I have a crush on a very old friend and I think he likes me back but I am scared of ruining the friendship if I am perceiving things wrong",
        "created_utc": 1678930834,
        "upvote_ratio": 1.0
    },
    {
        "title": "my boyfriend broke up with me because of his mental health",
        "author": "Same_Confection8984",
        "url": "https://www.reddit.com/r/relationships/comments/11sgc68/my_boyfriend_broke_up_with_me_because_of_his/",
        "text": "\nme f18 and my bf m19 of almost 2 years just broke up. we are still in communication. we say good morning, night, and i love u. we chat a bit throughout the day. we haven’t decided on how we’re going about physically seeing each other though. it’s only been a few days. \n\ni am just curious if anyone else has been in this situation. how long did it take? did you get back together?\n\ni really feel like we will. i can’t imagine life any other way. i know 2 years isn’t an insane amount of time, but it’s my first relationship ever and his first real healthy relationship. both of us are incredibly distraught over this. he is the type to want to be alone when he’s sad. and us taking this semi break break up whatever is because of that. and because he feels guilty about how hard this has been on me. i am not one to like being alone. quite the opposite.\n\nanyways, i just need some insight. someone to tell me they understand the situation. that they can relate. i am worried we’re going about this mental health breakup all wrong.\n\ntl;dr:\nbasically i f18 was broken up with for the sake of my bf m18 mental health. we still speak a small amount and we don’t see each other in person. i just want to know someone else has gone through this and can maybe share some insight.",
        "created_utc": 1678930815,
        "upvote_ratio": 1.0
    },
    {
        "title": "After three months of dating my (33m) therapist girlfriend (28f) I leaned on her for support one weekend and she got the ick",
        "author": "Settovibrate1",
        "url": "https://www.reddit.com/r/relationships/comments/11sgc49/after_three_months_of_dating_my_33m_therapist/",
        "text": "[removed]",
        "created_utc": 1678930811,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (26F) boyfriend (27M) is on day 3 of the silent treatment.",
        "author": "xokennedi",
        "url": "https://www.reddit.com/r/relationships/comments/11sgc3y/my_26f_boyfriend_27m_is_on_day_3_of_the_silent/",
        "text": "[removed]",
        "created_utc": 1678930811,
        "upvote_ratio": 1.0
    },
    {
        "title": "there is a small chance i have a girl friend",
        "author": "bowling_ball69",
        "url": "https://www.reddit.com/r/relationships/comments/11sgblm/there_is_a_small_chance_i_have_a_girl_friend/",
        "text": "[removed]",
        "created_utc": 1678930775,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(20M) had some of my girlfriends(19F) past revealed to me recently and i just can’t help but feel disgusted",
        "author": "Full-Establishment44",
        "url": "https://www.reddit.com/r/relationships/comments/11sgaop/i20m_had_some_of_my_girlfriends19f_past_revealed/",
        "text": "[removed]",
        "created_utc": 1678930709,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (26F) boyfriend (27M) is on day 3 of the silent treatment.",
        "author": "xokennedi",
        "url": "https://www.reddit.com/r/relationships/comments/11sga9q/my_26f_boyfriend_27m_is_on_day_3_of_the_silent/",
        "text": "[removed]",
        "created_utc": 1678930681,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) boyfriend (22M) of 5 months, is texting other girls on Snapchat, and I need help determining if hes actually cheating or this is a misconception.",
        "author": "okikittens",
        "url": "https://www.reddit.com/r/relationships/comments/11sg9gh/my_18f_boyfriend_22m_of_5_months_is_texting_other/",
        "text": "Hello, so me 18F have a boyfriend 22M and everything has been amazing but he texts girls on snapchat. So probably around 2 months of officially dating he had given me the password to his phone, then one day while he was gaming, I went onto his phone seen that there where other girls in his recent chats. And me being snoopy clicked on them the oldest one was from 2 weeks prior. And I found nothing except a saved selfie from a girl which had text over it saying \"I got new glasses\", then above where lingerie pictures and nudes from 2 years ago saved in chat. I got pretty upset and we talked about it, he said \"She just hit me up, I didn't mean to save that photo, those pictures are from 2 years ago I didn't even remember they where there, I've never even met this girl before.\" I believed him and told him you cant do this to me it makes me really uncomfortable and even threatened to break up with him. He also removed her right away as soon as I found out.\n\nThen a few weeks ago we where drinking at a concert and while drunk I used his phone in the cab and went on his snapchat again saw more girls, no chats saved but once again one of them had nudes saved in chat from years ago. And another was a girl with a lot of followers he replied to her story saying \"Sheeeesh\" on a selfie which she had not opened. I got obviously upset again, and we got in a pretty big fight but he was really drunk and I kinda calmed the situation down to the best of my ability. \n\nTL;DR! I'm honestly sitting here confused. Hes always posting me, saying good morning everyday, takes me on lots of dates every time I see him and pays for everything, always sending me paragraphs. So I'm not sure if this is all just one big misunderstanding or what?",
        "created_utc": 1678930624,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to reconnect with my childhood friend, but can’t seem to find him anywhere? Help?",
        "author": "Recent-Sky3311",
        "url": "https://www.reddit.com/r/relationships/comments/11sg808/i_want_to_reconnect_with_my_childhood_friend_but/",
        "text": "So I’m 22f and I’ve felt nostalgic recently over my childhood days. I’ve reached out to some of my old friends from elementary/middle school. Some of them I’ve already had on social media since many years ago. Others I searched up online and added them. There’s this one guy in particular though (21m) that I’ve searched up everywhere and I can’t find him. Me and him were close friends in 2008-2009, when we were both about 7-8 years old. My mom was friends with his mom and she used to babysit him after school and during the summers, so me and him used to see each other almost everyday. Eventually we just grew apart. \n\nNow, I’ve tried searching him up, but I can’t find him on any social media. Could he just not have social media? It’s hard to believe that someone in their early 20’s would choose to not have any social media at all, especially in this day and age. I found his mom and dad’s Facebook pages, and they’ve posted pictures of him and the rest of their family throughout the years. What’s weird was that the last picture they posted of him was in late 2020. From there, they haven’t posted him anymore. How could I find my old friend?\n\nTl;dr: tried searching up my old friend on social media but can’t find him anywhere, his parents haven’t posted any pics of him since 2020.",
        "created_utc": 1678930524,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) boyfriend (22M) of 5 months, is texting other girls on Snapchat, and I need help determining if hes actually cheating or this is a misconception.",
        "author": "ThrowRAkitten1125",
        "url": "https://www.reddit.com/r/relationships/comments/11sg7ib/my_18f_boyfriend_22m_of_5_months_is_texting_other/",
        "text": "[removed]",
        "created_utc": 1678930491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the guy[24M] I [23 F] am going out with showing a green flag or softening the blow?",
        "author": "Spiritual_Hotel_8223",
        "url": "https://www.reddit.com/r/relationships/comments/11sg7cb/is_the_guy24m_i_23_f_am_going_out_with_showing_a/",
        "text": "[removed]",
        "created_utc": 1678930481,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I (24F) do about my friend (24M) and our feelings",
        "author": "Proper_Ad4985",
        "url": "https://www.reddit.com/r/relationships/comments/11sg6vm/what_do_i_24f_do_about_my_friend_24m_and_our/",
        "text": "[removed]",
        "created_utc": 1678930448,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) boyfriend (22M) of 5 months, is texting other girls on Snapchat, and I need help determining if hes actually cheating or not?",
        "author": "ThrowRAkitten1125",
        "url": "https://www.reddit.com/r/relationships/comments/11sg6a0/my_18f_boyfriend_22m_of_5_months_is_texting_other/",
        "text": "[removed]",
        "created_utc": 1678930407,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) boyfriend (22M) of 5 months, is texting other girls on Snapchat, and I need help determining if hes actually cheating or not?",
        "author": "ThrowRAkitten1125",
        "url": "https://www.reddit.com/r/relationships/comments/11sg48c/my_18f_boyfriend_22m_of_5_months_is_texting_other/",
        "text": "[removed]",
        "created_utc": 1678930270,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [19F] don't want to have sex with my boyfriend [19M] anymore",
        "author": "IntrovertNeptune",
        "url": "https://www.reddit.com/r/relationships/comments/11sg422/i_19f_dont_want_to_have_sex_with_my_boyfriend_19m/",
        "text": "tl;dr I don't want to have sex with my boyfriend anymore, but I don't want to break up with him, and he doesn't want to break up either.\n\n\nI've been with my boyfriend for about 10 months. I told him I was asexual the moment we started dating, and he was fine with that because he didn't have a sex drive either. A month in, he said he did have an interest in sex, and two months later we had sex for the first time. I was completely indifferent about it since it made him happy. \n\n\nRight before I left to go to university, he coerced me into sex. He begged for over an hour, and I cried the second I got on top of him. He asked me if he should keep going, and I just said that I didn't care, and he went until he finished while I was crying.\n\n\nA couple of weeks ago, he did the same thing, except I didn't cry until afterwards.\n\n\nI'm just not interested in sex, but my boyfriend is really horny. Everything else in our relationship is amazing, but it's the sex that's the issue. I don't want to have sex anymore. I was always indifferent or \"whatever\" about sex with him since it made him happy, but now I just don't want to anymore. I still give him handjobs, but not sex. \n\n\nI told him this, and he seemed sad, but he doesn't want to break up (neither do I). I told him he'll probably end up feeling resentful in the long run if we don't have sex. He just said he didn't know, and he doesn't want to break up with me.\n\n\nI also found out that he wants children eventually. I don't want children; I'm child free, and very firm on that position. I won't give birth, and I won't adopt. I told him that if we wants children in the future, we probably aren't going to work out. He said that I'm more important than having children, but I told him he'll probably be resentful in the future as well, since you can't compromise on children.\n\n\nI'm not sure what to do. I love him so much, and everything in our relationship is great, but I don't want to have sex with him anymore. What should I do?",
        "created_utc": 1678930258,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [19F] don't want to have sex with my boyfriend [19M] anymore",
        "author": "IntrovertNeptune",
        "url": "https://www.reddit.com/r/relationships/comments/11sg1x7/i_19f_dont_want_to_have_sex_with_my_boyfriend_19m/",
        "text": "[removed]",
        "created_utc": 1678930120,
        "upvote_ratio": 1.0
    },
    {
        "title": "breakup pain",
        "author": "throwaway835a",
        "url": "https://www.reddit.com/r/relationships/comments/11sfsu7/breakup_pain/",
        "text": "[removed]",
        "created_utc": 1678929513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i getting ghosted? Gay male",
        "author": "vidcid",
        "url": "https://www.reddit.com/r/relationships/comments/11sfs2h/am_i_getting_ghosted_gay_male/",
        "text": "Been talking with a guy for 2 or 3 weeks. We both expressed how nervous we were to call. He plans to call during his break, before his break comes, i express im not feeling well, he tells me to go and get some fresh air. He says call when ready, but i just get so nervous i shut down. Couple hours later, and i apologize and explain why, no response, next day comes i send him a good morning and another apology, 9 hours later and still no response, i know hes at work but we usually talk all day...i feel awful.\n\nTL;DR i got scared and didnt call when he wanted, now im getting no texts, is he ghosting? Or just mad.",
        "created_utc": 1678929461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being insecure?",
        "author": "Nightbringer_ren",
        "url": "https://www.reddit.com/r/relationships/comments/11sfrrf/am_i_being_insecure/",
        "text": "[removed]",
        "created_utc": 1678929440,
        "upvote_ratio": 1.0
    },
    {
        "title": "my boyfriend and i make 6 months tomorrow!!!",
        "author": "owofr3shavacado",
        "url": "https://www.reddit.com/r/relationships/comments/11sfqnh/my_boyfriend_and_i_make_6_months_tomorrow/",
        "text": "[removed]",
        "created_utc": 1678929368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i being ghosted? Gay male",
        "author": "vidcid",
        "url": "https://www.reddit.com/r/relationships/comments/11sfprr/am_i_being_ghosted_gay_male/",
        "text": "[removed]",
        "created_utc": 1678929311,
        "upvote_ratio": 1.0
    },
    {
        "title": "my boyfriend and i make 6 months tomorrow!!!",
        "author": "owofr3shavacado",
        "url": "https://www.reddit.com/r/relationships/comments/11sfp0a/my_boyfriend_and_i_make_6_months_tomorrow/",
        "text": "[removed]",
        "created_utc": 1678929263,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to improve my dating life.",
        "author": "itsthebry",
        "url": "https://www.reddit.com/r/relationships/comments/11sfowi/i_need_to_improve_my_dating_life/",
        "text": "[removed]",
        "created_utc": 1678929257,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ever-growing lust for Indian/Malaysian women",
        "author": "jacobsrw",
        "url": "https://www.reddit.com/r/relationships/comments/11sflhc/my_evergrowing_lust_for_indianmalaysian_women/",
        "text": "[removed]",
        "created_utc": 1678929029,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (26F) and he is a (25M). I feel like I’m getting to bothered about who he follows on his social media",
        "author": "ShySaggitarius1",
        "url": "https://www.reddit.com/r/relationships/comments/11sfk0j/im_26f_and_he_is_a_25m_i_feel_like_im_getting_to/",
        "text": "[removed]",
        "created_utc": 1678928928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (27F) feel bad about not telling my husband (35M) everything about me.",
        "author": "throwRA198663",
        "url": "https://www.reddit.com/r/relationships/comments/11sfdxr/should_i_27f_feel_bad_about_not_telling_my/",
        "text": "My husband, M, and I have been together 2 years, we recently married and are in the process of moving. \n\nWhen I was younger like, teens and younger, there were some cruddy things that happened. I chose to focus on the positive and went through therapy, but otherwise not mention it. As a result only my parents really know any of that stuff. Besides, I wasn't diagnosed with anything- I just learned coping skills. \n\nI was at my Mom's house recently and talking about moving into our new place, we pulled out an item from that time period and she apologized for it being hard. I said no need everything has worked out. She asked me what M thought about that and I replied I never told him. \n\nShe said she was shocked at me. I was confused, I asked why and she went into a diatribe about how you should be completely transparent with your partner and how he should know everything about me. I pointed out she had always told me that certain things in life were a need to know basis, this was stuff that happened YEARS ago, and not only that she had always been a huge supporter of having cash to run away with if I was ever in a bad relationship? \n\nShe replied that this situation was very different. Now it has me worried I've been an AH and not told him something I should have been open about? Help?\n\nTDLR; I have left out unpleasant experiences in my past. Does my partner really need to know them?",
        "created_utc": 1678928513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask her out again?",
        "author": "NathanWood123",
        "url": "https://www.reddit.com/r/relationships/comments/11sfbnn/should_i_ask_her_out_again/",
        "text": "[removed]",
        "created_utc": 1678928378,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the appropriate length of time to get over someone?",
        "author": "elfallopian",
        "url": "https://www.reddit.com/r/relationships/comments/11sfbgn/what_is_the_appropriate_length_of_time_to_get/",
        "text": "[removed]",
        "created_utc": 1678928364,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (22f) bf (20m) is infinitely more successful than I am and it makes me feel kind of insecure",
        "author": "ThrowRA_utterfailure",
        "url": "https://www.reddit.com/r/relationships/comments/11sf8fl/my_22f_bf_20m_is_infinitely_more_successful_than/",
        "text": "Long story short, he is extremely intelligent and hardworking. He's already doing way more than I ever did in undergrad. He is involved in so much on campus and has been accepted to several very prestigious and competitive programs in his field, which open the doors to even more impressive opportunities. The stipends he gets from these programs are half of my yearly salary. His work sounds so interesting and important and his professors are saying he's likely to be admitted to top graduate schools. Socially, he's super easy to talk to and good at making friends and honestly just surpasses me in every way.\n\nI don't know why he's with me. It honestly seems like he could do so much better. I've never done anything half as impressive as him and I'm not really going anywhere in life. I'm very happy for and proud of him, but it does make me feel down sometimes to hear him talking about all the stuff he's doing while I'm doing nothing important. It's especially embarrassing since I'm older and feel like I should have my life together. What should I do? I want him to have the better person that he deserves. I've tried therapy multiple times in the past but it hasn't helped me.\n\n&amp;#x200B;\n\ntldr: bf is way more successful than I am and it makes me feel bad sometimes",
        "created_utc": 1678928149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting my female friend's dad soon; need to know what I should say if he asks...",
        "author": "Not4Russian",
        "url": "https://www.reddit.com/r/relationships/comments/11sf6np/meeting_my_female_friends_dad_soon_need_to_know/",
        "text": "So I (16m) have been friends with this girl (16f) for a few months now. I have feelings for her but don't know if she feels the same way (I'm terrible at picking up on hints, so that may be why). Anyways, she happens to be in ROTC for our school, so she had the option to go to the military ball with a plus one. She asked me to go with her, I think because I'm her only male friend. I said yes of course and had everything signed so we could go. The ball is in about two weeks and she told me today that her dad wants to meet me and talk to me. I'm terrified of what might happen. I've seen in movies in stuff when the girls dad always intimidates the boy, and it's even worse thinking that he may not particularly favor the idea of his daughter dating a white boy. If he asks, I'd like to hear some tips on how I might answer the following questions.\n\n1: \"What are your intentions with my daughter?\"\nObviously, I have a crush on his daughter and want to be with her, but I can't just say that.\n\n2: \"Do you want to have sex with my daughter?\"\nI'm a teenage boy, it's crossed my mind. Should I be honest?\n\n3: \"Do you want to date my daughter?\"\nAgain, yes, but I don't wanna say that.\n\nAny help at all would be much appreciated!\n\nTL;DR: Meeting my crush's dad soon, need to know how I should answer if he asks sensitive questions.",
        "created_utc": 1678928030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love bombing me for months and then just ghosting me 22F 22M",
        "author": "justpriv",
        "url": "https://www.reddit.com/r/relationships/comments/11sf519/love_bombing_me_for_months_and_then_just_ghosting/",
        "text": "So I had this guy we were talking for months, before we saw each other for the first time we we’re talking everyday for a month, we got to know each other he gave me compliments about my character we opened up to each other there was really like a connection I felt like we were very compatible, well then we went out for the first time everything was “perfect”, in total before him ghosting me i think we went out like 5 times, so we talked every day he was like always love bombing me so hard really made me believe im the girl for him lmao, this was going on for months, talking everyday, seeing us etc, but what i never will understand is him love bombing me so hard apparently really liking me and him self being very sexual when we we’re talking but then never wanting to sleep with me, its kinda hard to explain everything, when we talked on the phone he was like yeah i really wanna kiss u right know being with you at my home etc we had some sexual conversations but never ended up having sex, also when we we’re kissing at the begging where we got to know each other he was very sexual and I REALLY thought we are going to have sex soon lmao , sex wasnt for me important in that moment beacuse i really liked him and wasnt only interested in sex, and then boom just like that one day he ghosted me, and i will never understand why love bombing me for months and not wanting to sleep with me like even if he wasnt serious with me why didnt he take advantage of the situation and have sex with me. Theres much more around the story, there could be like 5 different theories but it sucks to not know why\n\nTldr: months of love bombing me but didnt want to have sex and ghosted me",
        "created_utc": 1678927917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telling my (M27) father (68M) I don't want him to take a job at the company I work for...",
        "author": "Efficient_Sound_6944",
        "url": "https://www.reddit.com/r/relationships/comments/11sf4ms/telling_my_m27_father_68m_i_dont_want_him_to_take/",
        "text": "when he helped me get my first job with our previous employer.\n\nI was floundering after college and was unable to find work with my degree. He was close with my manager and put my name in for an entry level position in a completely unrelated white collar field. I started as an intern, paid my dues, worked hard to get a couple of promotions.\n\nIt wasn't an awful experience, but I was always \"so and so's kid\", never really made any work pals, felt isolated and depressed there (not entirely because of this situation, but it definitely didn't help). I was happy at least to be working and have the ability to move out of my parents house.\n\nEventually my manager left to take a leadership position with a different company and asked me to come along. I was nervous but excited to strike out on my own.\n\nThings are very different in my new role. I have a few people I work with that I can actually talk and joke around with. We go out for happy hours, lunch. People come to me for help advice and I feel like I'm taken somewhat seriously. I'm about to receive another promotion to project manager.\n\nMy father has since retired, but my manager has been approaching him to take a consulting role with the company.\n\nI love my dad. I'm incredibly grateful that he stuck his neck out for me a few years ago. But I really don't want him to take this job. He doesn't need the money. He's just a workaholic and doesn't want to spend that much time with my mother or his thoughts.\n\nI feel ashamed at how much stress this is causing me.\n\nWhat do I do? Despite all this we're not close and have always had trouble communicating. I know I should talk to him but I can't even begin to think of how to broach this topic with him without sounding like a petulant child. Maybe because I am being a petulant child. I don't know.\n\nTL;DR: Need to tell my dad I don't want to work with him again for my own mental health and sense of self worth.",
        "created_utc": 1678927891,
        "upvote_ratio": 1.0
    },
    {
        "title": "22M Friend can’t accept that I 19F will never date him.",
        "author": "IHave-noWords",
        "url": "https://www.reddit.com/r/relationships/comments/11sf4lc/22m_friend_cant_accept_that_i_19f_will_never_date/",
        "text": "Tldr; Friend can’t accept that we will never be together (date) and hates it when I set boundaries. And isn’t talking to be currently because I like somebody. Should I drop him, I 19F him 22M\n\n\n\nI’m 19 he is 22\n\n\n•I’ve been friends with this guy for 6 years been friends with since age 13, were 3 and a month apart. He was 16, we met online.\nAge wasn’t taken into consideration because we were only just interested in the same things. And had similar personalities at the time.\n\n* he vented to me and I vented to him so basically he knows everything about me. Well I’ve told him things, he probably won’t remember. We dated either when I was 13,14 for two weeks. I remember it vividly. This was only because he asked me to give it a chance. I think” regardless I didn’t have feelings for him. And had a problem saying no. He had expressed that he liked me several times before we dated  I just never liked him like that. There were times I was uncomfortable with even showing any affection back. Because he would make it uncomfortable for me. Like saying I love you . I Did love him  and do love him but as a friend only. Anyways so we ended up breaking up and ghosted each other after that.My point now is that he looks at that a real relationship. Even though I didn’t like him and he knows this. He says he didn’t really like me either and that he was desperate but then he says one thing but does another. He says these things when we’re fighting. But told me recently that he doesn’t want to hear about anyone I’m dating or like. Then keeps telling me maybe we have a change together.\n\n* He got upset/ keeps getting upset when I set boundaries. Like I don’t understand I explain why certain things make me uncomfortable and he get mad. And stops talking to me. I told him I didn’t want him to send me inappropriate pictures. That he wanted me to see so I could be honest “because he was insecure. Thing like that and he gets mad that I set boundaries.\n\n* \nHe now mad at me currently because \n I like someone which I didn’t tell him he assumed \n\n. Is this able to salvaged or do I just need to stop being his friend permanently.",
        "created_utc": 1678927888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love bombing me and then just ghosting me 22F 22M",
        "author": "justpriv",
        "url": "https://www.reddit.com/r/relationships/comments/11sf1cc/love_bombing_me_and_then_just_ghosting_me_22f_22m/",
        "text": "[removed]",
        "created_utc": 1678927682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telling my (M27) father I don't want him to take a job at the company I work for...",
        "author": "Efficient_Sound_6944",
        "url": "https://www.reddit.com/r/relationships/comments/11sf0f3/telling_my_m27_father_i_dont_want_him_to_take_a/",
        "text": "[removed]",
        "created_utc": 1678927619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (27F) feel the need to tell my husband (35M) everything?",
        "author": "throwRA198663",
        "url": "https://www.reddit.com/r/relationships/comments/11sezed/should_i_27f_feel_the_need_to_tell_my_husband_35m/",
        "text": "[removed]",
        "created_utc": 1678927551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving in…",
        "author": "Perfect-Bend-4447",
        "url": "https://www.reddit.com/r/relationships/comments/11seyy8/moving_in/",
        "text": "\nHello. Recently my boyfriend (34m) and I (26f) have been talking about me potentially moving in down the line, around the 5-6 month mark of dating. As we’ve had very honest conversations about finances, chores, and expectations of living together, and even what to do about wanting alone time, I felt very confident it was a good decision. I’ve even discussed it at length with my therapist who agrees this is easily the healthiest relationship I’ve ever experienced, and my boyfriend is very much a keeper. We both however also think it’s logical to have an ‘out’ so to speak to keep pressure off the relationship. At any time I could move out very easily, and as it’s his owned home so there isn’t a leasing issue involved. \n\nThe trouble comes in when we mentioned me potentially getting a puppy. He has a stay at home job and is happy to watch the dog along with his own, and I’d be taking time off to help get it settled. Neither of us saw an issue with this, as in his eyes it’s as if I’m just moving in with a dog in the first place.\n\nOther people outside of the relationship though have expressed reasonable doubts regarding how fast this is going, and it’s making me nervous. I know I want to spend more time with him, as it is I spend over half the week at his home already. We have little disagreements here and there but I love how we can communicate and work through them, mostly because we both see where the other is coming from even if we don’t hold the same beliefs.\n\nAt the end of the day we share common goals of kids, marriage, having dogs, and even both have the same general beliefs regarding religion and politics.\n\nIt’s not perfect, and I’m not expecting it to ever be, but things are uncompromisingly safe. I do love him, but I am wondering what other people’s experience is with moving in jitters?\n\nTL;DR Talking about potentially moving in at around six months and started feeling a little nervous after other people started doubting our timeline on things. I’m already spending more than half the week there as it is. Is this common?",
        "created_utc": 1678927523,
        "upvote_ratio": 1.0
    }
]