[
    {
        "title": "22M broke up with 21F",
        "author": "Dentist-Severe",
        "url": "https://www.reddit.com/r/relationships/comments/11re7fn/22m_broke_up_with_21f/",
        "text": "[removed]",
        "created_utc": 1678818573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (31 M) and my partner (29 F) have been together for 10 years and are having another meltdown in our relationship. I need advice.",
        "author": "throwaway_lotus12",
        "url": "https://www.reddit.com/r/relationships/comments/11re50f/me_31_m_and_my_partner_29_f_have_been_together/",
        "text": " Hi,\n\nI am desperately looking for advice on what to do.\n\nI  have been with my partner for 10 years. We have been through tough  times before where we nearly seperated, and for the last few months we  are struggling again. I'm not sure if I have the energy to keep pushing  for it to work, and I worry that maybe we are just amazing friends but  nothing more.\n\nWe  still care for each other, and have been talking through if we can make  it work for a few months now. She feels that we can figure it out, but I  am not so sure.\n\nWe get on really well, but have been talking about the fact that romantically we don't feel like we're getting what we want.\n\nFor more context:\n\nShe  is a very anxiously attached person, and I feel like I have always  given a lot to make her feel safe, to the point that I feel that  sometimes I have minimised myself to a degree. We get on really well,  but in the last year I have come out of a serious depression and I am  now voicing more seriously what I want - which is more independence and  trust, as I find constantly reassuring her very draining.\n\nIt  also makes me feel guilty when I ask for time on my own, or with  friends. She is supportive, and not manipulative, but she is very  anxious and can feel rejected when I want some time to myself.\n\nShe  also works away a lot (around 5-6 months of the year), so I give her a  lot of freedom and don't stand in the way of her work. I just don't feel  like I can ask for the same freedom without feeling guilty.\n\nI  have also come out as bisexual a few years ago, and feel like I could  be missing opportunities to be my genuine self and explore different  relationships. However, I don't want to fall in the the 'grass is always  greener' trap. I worry it could be a huge mistake to throw away a 10  year relationship with someone I get on with so well.\n\nTL;DR\n\nMe  and my girlfriend feel like we're not romantically getting what we  want. I am feeling drained from supporting her anxieties and I feel like  I just need my own space.\n\nAm I being an idiot for considering ending a 10 year relationship?",
        "created_utc": 1678818422,
        "upvote_ratio": 1.0
    },
    {
        "title": "What personality type typically are people with BPD attracted to?",
        "author": "Mean-Negotiation3147",
        "url": "https://www.reddit.com/r/relationships/comments/11re2lw/what_personality_type_typically_are_people_with/",
        "text": "[removed]",
        "created_utc": 1678818274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend not physically present for birthday",
        "author": "Inevitable_Bat_8245",
        "url": "https://www.reddit.com/r/relationships/comments/11rdz12/boyfriend_not_physically_present_for_birthday/",
        "text": "My bf (28m) hasn't been there for my (27f) birthday for five years now, or since we started dating. Either covid or family or something has always come up, and this year he has a family gathering on my birthday again. Is it crazy for me to ask him to be present for my birthday this year? He knows it's a big deal to me and I feel like the parents could understand if he missed it this once.  It's not like I expect it every year but it would be nice for him to be with me and not at his family reunion this year.  Is this too much to ask?\n\nTl;dr\nWant my bf to be physically there for my bday this year",
        "created_utc": 1678818053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend not physically present for my bday",
        "author": "Inevitable_Bat_8245",
        "url": "https://www.reddit.com/r/relationships/comments/11rdup5/boyfriend_not_physically_present_for_my_bday/",
        "text": "[removed]",
        "created_utc": 1678817789,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend has stared at a guy at the gym for 1.5 years of our 3 year relationship.. is that cheating? Should I leave",
        "author": "throwayagkeek",
        "url": "https://www.reddit.com/r/relationships/comments/11rdrfi/my_girlfriend_has_stared_at_a_guy_at_the_gym_for/",
        "text": "[removed]",
        "created_utc": 1678817595,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend compares my body to porn actresses",
        "author": "Jazzlike_Volume_8193",
        "url": "https://www.reddit.com/r/relationships/comments/11rdr4v/my_boyfriend_compares_my_body_to_porn_actresses/",
        "text": "My boyfriend [23M] is addicted to porn. I [20F] never made the situation be about me, it's just about the dopamine rush it's like a drug. And so im helping him in all the ways i can. But today it changed that he said that he started comparing my body to that of porn actresses and told me that I'm not his type after a year of relationship and that he preferred it when I was super skinny. I'm not fat but I'm not a stick either.\n\nI don't know what to do after that I've never felt so insecure.\nDo i change for him to make him happy? I’m feeling disgusted about my body now\nTL;DR! : my boyfriend compares my body to porn actress bodies.",
        "created_utc": 1678817578,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I approach a guy im interested in?",
        "author": "PrestigiousCandy8199",
        "url": "https://www.reddit.com/r/relationships/comments/11rdqay/how_do_i_approach_a_guy_im_interested_in/",
        "text": "I F15 keep thinking of this guy M16 whos really good looking, nice &amp; fun. Id love to get to know him, but I have no idea how to approach him. He sees me in the hallways almost everyday &amp; I see him, but I have no idea what he thinks of me. I dont want to be cringy or embarrassing. Ive never spoken to him, but my friend used to be his friend so I have some kind of an connection. That was 2-3 years ago tho. He leaves the school in 3 months so I have to do it now or never. I have his socials, but messaging him would feel weird bc our school is small so he will see me often &amp; I dont know if he has been looking at me that way too.\n\nTL;DR: I want to get to know a guy who ive never spoken to? How do i do that wo being embarrassing or creepy.",
        "created_utc": 1678817525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (31 M) and my partner (29 F) have been together for 10 years and are having another meltdown in our relationship. I need advice.",
        "author": "throwaway_lotus12",
        "url": "https://www.reddit.com/r/relationships/comments/11rdob0/me_31_m_and_my_partner_29_f_have_been_together/",
        "text": "[removed]",
        "created_utc": 1678817407,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I approach a guy im interested in?",
        "author": "PrestigiousCandy8199",
        "url": "https://www.reddit.com/r/relationships/comments/11rdmqo/how_do_i_approach_a_guy_im_interested_in/",
        "text": "[removed]",
        "created_utc": 1678817311,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I approach someone who I dont know has any interest in me?",
        "author": "PrestigiousCandy8199",
        "url": "https://www.reddit.com/r/relationships/comments/11rdk59/how_do_i_approach_someone_who_i_dont_know_has_any/",
        "text": "[removed]",
        "created_utc": 1678817153,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 19M like 18F",
        "author": "Any-Lengthiness5305",
        "url": "https://www.reddit.com/r/relationships/comments/11rdhbl/i_19m_like_18f/",
        "text": "[removed]",
        "created_utc": 1678816987,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend is comparing me to porn actress and I don’t know what to do",
        "author": "Jazzlike_Volume_8193",
        "url": "https://www.reddit.com/r/relationships/comments/11rdfqn/my_boyfriend_is_comparing_me_to_porn_actress_and/",
        "text": "[removed]",
        "created_utc": 1678816894,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend (24m) wanted to have sex with me (30f). I have a partner (25f) that we are in getting married.",
        "author": "shizukudjent",
        "url": "https://www.reddit.com/r/relationships/comments/11rdb0m/my_friend_24m_wanted_to_have_sex_with_me_30f_i/",
        "text": "[removed]",
        "created_utc": 1678816618,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 25F have been giving my boyfriend 33M of 8 months up to 1K but he is now acting selfish when I need the money back",
        "author": "Girl__of__mystery",
        "url": "https://www.reddit.com/r/relationships/comments/11rd98x/i_25f_have_been_giving_my_boyfriend_33m_of_8/",
        "text": "I am 25F he is 33M we have been in a relationship for 8 month. \n\nWe have great chemistry, he makes me laugh which I think is very important, I feel save when with him, he can cook and overall we can talk about everything.\n\nHowever, early on in the relationship he has been asking for financial support.\n\nIt started with 200 I didn’t give it then and he said it was only a test. We had a little argument about it and he promised not to ask again to maintain the peace.\n\nFast forward he asked for 300 which I gave him as it was an emergency he said. After that it was 200, then 100, then 1000 then 150.\n\nWhen I have the 1000 I was hesitant and told him I would need it the following month. He promised he would give it. Last month which was when he was supposed to give it back he said he had to use it to set up something for his son (he has a son from a woman that is now married but he was not in the sons life originally and now wants to be involved so he is setting court things and stuff). Now is March and it’s when he was supposed to pay me back. I told him I urgently needed it back because I had many expenses this month. I when I told him he said “next month” because apparently he has some kind of debt of 4k he has to pay.\n\nNow this guy makes 2k + a month. Has paid his rent for a year in advance so I was so upset when he said that because it’s like he is being selfish to my needs. \n\nLast time we went on a date I had to pay because he had “no money” qnd after the date he still asked me 200 as a gift to go out with his friends.\n\nHe says he loves me and all and his parents know about me but I can’t help the fact that he seems selfish he knows I have my own expenses and keeps asking.\n\nI spoke to him about this and all and he doesn’t seem to get it. He has tried to make it up other ways by cooking for me and dropping me where I need but still the issue remains. Can’t help but feel used.\n\nHe says he sees me as his wife etcc I do love him and want to help but I am scared of what will be in the future. He had cancer a year ago so that’s why he had the debt.\n\nI would like some advice on how I should face this situation as I do love him and don’t want to loose him but also don’t want to be in a relationship where I am not considered.\n\nTDLR; F25 been dating 33M for 8 months but he keeps asking for money despite having a good job.",
        "created_utc": 1678816509,
        "upvote_ratio": 1.0
    },
    {
        "title": "27F Replying to first love and ex girlfriend 24F",
        "author": "Right_Frosting",
        "url": "https://www.reddit.com/r/relationships/comments/11rd587/27f_replying_to_first_love_and_ex_girlfriend_24f/",
        "text": "[removed]",
        "created_utc": 1678816257,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost my (m25) virginity to my friend (f24) who then decided to send a list of the mistakes I made in bed. I’ve been avoiding her since. Am I being too sensitive?",
        "author": "tuff-tyke",
        "url": "https://www.reddit.com/r/relationships/comments/11rd568/i_lost_my_m25_virginity_to_my_friend_f24_who_then/",
        "text": "\nWe’ve been friends for a year.  She knew I was a virgin. I knew she had a high sex drive. She hasn’t really had the chance to meet anybody so she asked me if I wanted to hook up since she was tired of masturbating. A month or so we hooked up. I enjoyed the experience and I thought she did too. Boy was I wrong. She basically sent me a list of everything I did wrong. This is what I had to read just a day after losing my virginity: \n\n1. Thrusting is not just rapid in and out movements like you're impaling my vagina, but also moving your hips like you're hula hooping.\n\n2. If you notice me plucking one of your pube hairs from my tongue or teeth during a blowjob, just allow it to happen without providing an awkward apology. \n\n3. Hands off my head when I'm blowing you.\n\n4. Repeatedly asking me if it feels good becomes distracting when it's actually feeling good.\n\n5. Kissing and groping is still possible during penetration otherwise our upper bodies might as well just leave the room.\n\n6. Talking dirty sounds unnatural coming from you. It’s like hearing your favorite cartoon character use the word \"fuck\".\n\n7. I'm not naked for no reason so no need to close your eyes when I'm riding you. \n\n8. Consistency is key during oral, so if I breathe heavier, moan harder or grind all over your face, don't change what you're doing down there otherwise you're never gonna make me cum.\n\n9. Consent is always great but you don't need my permission to switch positions. \n\nI understand that I wasn’t going to be perfect seeing as how it was first time but damn.  Cut me SOME slack.  Not to sound like drama king or anything but my feelings are a little hurt and the little confidence I had is definitely shot.   I’ve been kinda ignoring and avoiding her as a result.  We normally talk at least 3-4 a week and play PS5 every Friday but I’ve been making excuses to get out of talking to her because I don’t want her to know that she hurt my feelings.  Am I being too sensitive about the whole thing?\n\nTL;DR - Lost my virginity to my friend and she critiqued me about it…",
        "created_utc": 1678816254,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (19M) still love my ex (19F) after her new relationship ended",
        "author": "ThrowRAClear-Fill",
        "url": "https://www.reddit.com/r/relationships/comments/11rd43m/i_19m_still_love_my_ex_19f_after_her_new/",
        "text": " \n\nMy ex and I were together for 3 years before our relationship ended. She fell in love with another guy while we were together, and we parted ways soon after she told me that she no longer felt the same about me anymore.\n\nOver the course of the next six months, we were essentially in our own separate worlds apart from each other, both grieving the breakup. She got together with the other guy soon afterward, and I couldn't help but feel a sense of betrayal from the whole situation. After years of promising we'd always be together and both sides saying that everything in our relationship was perfect, in the span of a few months, it felt all undone. However, she did admit she was feeling doubtful of our relationship before the other guy entered the picture. I know some of that was just the naivety of being young and it being our respective first serious relationships, but I felt the trust our dynamic was built on had been completely shattered.\n\nFast forward to a few days ago, she reached out saying she was dumped and blocked everywhere by her boyfriend. They had a huge fight with accusations being slung mainly by him, and she was blocked before she could fully respond back and explain her side. She's never had many friends, and saw me as the only option she could turn to in her grief. While trying to help her, we decided to call and I learned all about the relationship she was just in.\n\nWhile they did have great chemistry, have fun together, and just overall enjoy each other's company, there was some evident mistreatment. My ex and I were always very close and planned to continue a friendship in the distant future. The new guy said he was cool with it, but then proceeded to disallow any mentions of me from her, demanding screenshots of her phone so he knew we weren't texting, had her unfriend me on social media sites, delete pictures with me in them, etc. She was NOT ok with any of this, and only did it because of his anger and wanting to not cause fights. She tried to stand her ground but failed. They apparently fought frequently and he would try and make her feel guilty for everything. They broke up over conflicting religious beliefs, but that's a whole other subject.\n\nShe thinks he may come back and try to apologize/restore the relationship, but I'm doing all I can to tell her to be safe with this. I don't want to see her get hurt, and a part of me does obviously despise this guy. And of course... I still love her. I'm really just unsure what to do. After everything, I want to be with her, but she's made it clear she still loves the other guy (though I'm unsure if she knows entirely how I feel about her). She's grieving right now and is preparing to have an eventual talk with him, and I agree they should resolve their business. We agreed that she has to stand her ground regarding me and her staying friends, but I don't foresee him agreeing to this demand. However, talking with her and giving her emotional support is beginning to eat me up inside that I'm not telling her about my feelings. While calling, I can tell we still have the same chemistry we always had and it genuinely felt like I was snapped back right to when we were together. She and I would definitely have to talk things out if we were to continue a relationship, but despite all the grief I felt for months, I honestly feel that's what my heart wants.\n\nTl, dr: I still love my ex who is currently single after recently having a mentally abusive relationship (with another guy). He dumped her suddenly and she's anticipating his return. I've been helping her, unsure if I should at any point confess my still lurking feelings.",
        "created_utc": 1678816193,
        "upvote_ratio": 1.0
    },
    {
        "title": "I posted photos of me(28) and my GF(26) on Instagram without her approval",
        "author": "bcrocp",
        "url": "https://www.reddit.com/r/relationships/comments/11rd42s/i_posted_photos_of_me28_and_my_gf26_on_instagram/",
        "text": "I  am in a long-distance relationship with my girlfriend and it's kinda new. She visited me on my birthday last Friday and stayed for the weekend and everything was great.\n\nWe took a lot of photos before I dropped her to the airport on Sunday.  Next morning I quoted a few of these photos on WhatsApp and said they're really cute and we both look great. She also quoted a three of these photos and said the same thing, that they're really cute. She also specifically requested me to get her approval if I happened to post any of these photos of us together on Instagram.\n\nLast night she said she was not feeling good and it has nothing to do with me. And I was looking at the three photos she quoted and decided to post two of them on Instagram without asking her as she already said that \"they're cute\". I thought posting the photos of us together would cheer her up. I wrote her right after I posted but she was already asleep.\n\nThis morning she saw the photos and said that she doesn't like how she looked in the first photo and I should have asked her before posting. I thought that it was not that big of a deal at first and did not delete the photos as I geniunely thought that she looks really pretty in both photos. After a few hours she asked me to delete the photos and I did.\n\nWe argued for hours abou  me posting these without her approval and I apologized but also stated  that I thought she would like them as she already stated that \"they're cute\".\n\nNow she want break up with me for posting these photos without her approval. I know I'm at fault for nothing getting her approval and apologized countless times for it and also deleted the photos.\n\nI would appreciate any suggestions to make up for my mistake as I do not want to break up with her.\n\ntl;dr My girlfriend wants to break up with me for posting the our photos without her approval which she previously stated \"cute\".",
        "created_utc": 1678816191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where/what stage am I (M18) in with a girl (F18",
        "author": "luxcyx_",
        "url": "https://www.reddit.com/r/relationships/comments/11rd42h/wherewhat_stage_am_i_m18_in_with_a_girl_f18/",
        "text": "[removed]",
        "created_utc": 1678816190,
        "upvote_ratio": 1.0
    },
    {
        "title": "I posted an R4R to see if he was still responding to ads",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678816128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crush brought a date over to my house, am I screwed?",
        "author": "Life-Principle-3771",
        "url": "https://www.reddit.com/r/relationships/comments/11rd1gn/crush_brought_a_date_over_to_my_house_am_i_screwed/",
        "text": "Over the past couple of months I (m, 27) have been talking with a girl (F, 25) at my work. She is aware that I like her, in the past she has indicated that she had a bf. I live across the street from my job and we hang at my place and watch a movie/play xbox a couple times a week.\n\nThe other day we were watching a movie at my place and she tells me she is now \"dating around\".  She has a date later that night and wants to know if this guy can come pick her up from my place. I tell her it's fine (idk what else to say). The guy comes over,  we chat for a few minutes and drink a beer, they head out.  \n\nI feel like this means that my chances here are zero. Is my thinking here correct? Oh well that's life.\n\ntl;dr My crush was hanging out at my house and brought a date over. Are my chances here zero?",
        "created_utc": 1678816030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did my partner leave out of guilt?",
        "author": "Purple4ardvark",
        "url": "https://www.reddit.com/r/relationships/comments/11rd0e2/did_my_partner_leave_out_of_guilt/",
        "text": "[removed]",
        "created_utc": 1678815967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crush brought a date over to my house, am I screwed?",
        "author": "Life-Principle-3771",
        "url": "https://www.reddit.com/r/relationships/comments/11rcy2y/crush_brought_a_date_over_to_my_house_am_i_screwed/",
        "text": "[removed]",
        "created_utc": 1678815833,
        "upvote_ratio": 1.0
    },
    {
        "title": "I posted photos of me(28) and my GF(26) on Instagram without her approval",
        "author": "bcrocp",
        "url": "https://www.reddit.com/r/relationships/comments/11rcx0t/i_posted_photos_of_me28_and_my_gf26_on_instagram/",
        "text": "[removed]",
        "created_utc": 1678815769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sister used to be close to me, now she doesn't acknowledge me",
        "author": "TheHumWithin",
        "url": "https://www.reddit.com/r/relationships/comments/11rcwbo/sister_used_to_be_close_to_me_now_she_doesnt/",
        "text": " **TL;DR** When my sister and I were young we were really close. She became very distant when she was 15. She acts nice when I have guests or she needs something, then goes back to how she was. I'm tired of trying to figure out why after years.\n\nMy sister(27F) and I(29M) used to be very close when we were younger. Then I noticed that when she was around 15-16, she drifted away.\n\nWe went from playing video games and talking daily to just nothing. I would ask quite often if she wanted to hang out or something she wanted to do but... nothing.\n\nI eventually got used to the idea that she was just changing and that things were different now. It's part of growing up. I thought that one day, once she's ready we could rekindle our friendship or start from scratch. I would have done anything for that.\n\nShe'd give glimpses of our old friendship by knocking on my door and asking about how I was and so on, but it was only later on, after enough of these events I noticed a pattern. It was only when she wanted to borrow something or needed help. Then the moment she was done using whatever she borrowed that she would she act like she was before - cold and distant.\n\nHowever, if I brought my friends over or partner, she would welcome them in and be very friendly and suddenly hug me like she used to and act like the sweetest sister, and it felt genuine enough that I could just believe it for those moments and felt like I really had her back for that time. But the moment they'd leave she'd go right back to her disinterested self with no patience or energy to know to me. I'd try everything from being talkative to quiet, talking about me hobbies, asking about her hobbies. I was always trying to understand what she did and didn't like about being around me -Trying to gauge some way that I can talk to her without setting off this \"trigger\".\n\nWe have had conversations about this, and each time it's a different reason why she's like this with only me - It's me, her, family, work, etc - but it's only me she's this cold with. At the end of each of these fights/talks, she promises we can fix it because she says she loves me. But then it's straight back to how she was with me, no attempt to be friendly.\n\nI'm currently living with my partner(43M) in his home, and she lives with family and her partner(26?M)\n\nI've given up on trying fix this, as there are too many stories and factors to this all, and just emotionally exhausted from trying. I can give more context later, if asked. But I'm just curious if anyone else has had this happen: A mysterious disconnect from a once very loving Sibling?",
        "created_utc": 1678815727,
        "upvote_ratio": 1.0
    },
    {
        "title": "I posted an R4R ad, to see if he was still responding to them.",
        "author": "ScrewwLoose",
        "url": "https://www.reddit.com/r/relationships/comments/11rctyx/i_posted_an_r4r_ad_to_see_if_he_was_still/",
        "text": "[removed]",
        "created_utc": 1678815593,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Gf(23F) cheated on me(26M) on videochat",
        "author": "andyou7",
        "url": "https://www.reddit.com/r/relationships/comments/11rctgd/my_gf23f_cheated_on_me26m_on_videochat/",
        "text": "So, at the end of last year, in december I found a girl on tinder. We quickly started texting and sending messages on instagram. There was a lot of attraction and chemie between us. I was living 500km far away from her but she was still interested and there was a chance that she will move in with me if everything works out.\n\nWe had an amazing date on the 23 of december, and we spent chrismas together. She said to me that she felt in love right away. For me it took like 1 month.\nThen I went back to my city. We started organizing the next dates. We did a lot of videocalls. Every day, between 2-14 hour long calls.\n\nThen one day she felt asleep on the call so, I didnt end it, instead I also went to sleep next to her. She had her lights on. Since then we went to sleep everyday together on videocall.\nThen, time passed. We meet up every second weekend. She planned to move to me in the next half year.\n\nBut then the problems arrived. While sleeping with her, I heard a lot of things at night. She always watched shows while falling asleep. But at one night, the call was canceled at 3 o clock. And after that everyday. The same. I asked what was that. I set up an alarm to see what happens and recorded the call. I know its illegal to record someone, but I had to know what happens while Im asleep.\n\nA few things. I saw a lot of red colors on her Iwatch. I Asked her what could it mean. Its the oxygen level in your blood. She sent me her meassures. She had like 70-80% at night. Super low, a lot of meassure only at night. No other. The thing is, she liked getting choked and strangled in sex, so I was really curious that she might been cheating on me on the whole time.\nShe painted her nails fluorescent.\n\nSo, next midnight she was very drunk and forgot to turn of the lights and put a movie in the background.\nAt 1am she turned off the lights\nAt 1am 40 a man entered in her room and I only heard a few words. I put the recording in vlc to boost the sounds. He told her: Hey sweety, wake up.\nThen she started to moaning. She put a teddybear on the camera. Then she turned down it to only see the darkness on the bed.\n\nAt 2 o clock they put back the camera. I could see the red on her watch. She was getting choked. A lot of background noises.\nAt 2 o clock 10min she started to say to me, Baby are you awake? Very loud.\nShe waked me up while getting fcked.\nThen she went in doggy pose. Turned on the light. I was half awake. They abused me. Only later found out due the recording that she  was also was in action. She put the camera so, that I could only see thwle upper body of her. She told me she cant fall asleep and will take some sleeping pills.\nShe put down the light. Red light back on the watch. I didnt know what they did, only later.\nShe spoke to me while getting fcked. She didnt know the recordint is only one sided and the noise cancelling isnt working while speaking. A lot of moaning at the end every sentence. She told me ahe wants a child from me, future together. Good things to fall asleep.\nI couldnt watch more of the recordings. Next day she told me everything after telling her I know the truth. That she was afraid her boss kicking her out. So she gave him a key to her apartment.\n First time in my life I feel betrayed. Heartbroken. Why\nShe told me\" her heart was only mine, but her pssy...\"\nIm not sure should I do next.\n\nTL:DR: My gf cheated on me weeks long while we were on videocalls. With her boss. He had a key to her. He is a sick fk. My gf also enjoyed it so I broke up.",
        "created_utc": 1678815561,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I be concerned? f24 m30",
        "author": "DangerousSeesaw97",
        "url": "https://www.reddit.com/r/relationships/comments/11rctcw/should_i_be_concerned_f24_m30/",
        "text": "So my boyfriend and I go to this coffee shop a fair bit. There's a girl who works there that also goes to the climbing gym that we go to. We recognised her from there and have been talking to her each time we've gone to the coffee shop.\n\nThe other week my boyfriend was there and saw her climbing. They kinda linked up and climbed together which I wasn't too fussed about!\n\nBut we went to the coffee shop again today and saw her. My boyfriend and her got talking about climbing (didn't really include me in the conversation because I'm a bit of a beginner!) And before leaving, my boyfriend said they should exchange numbers. So I kinda just stood there whilst they exchanged numbers and felt kind of awkward about the whole thing.\n\nWhy am I feeling insecure about this? Should I be worried or am I feeling anxious for no reason...\n\nTl:Dr \nBoyfriend took another girls number",
        "created_utc": 1678815555,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I (21f) do to save this relationship?",
        "author": "anonymous_leopard1",
        "url": "https://www.reddit.com/r/relationships/comments/11rcslv/what_can_i_21f_do_to_save_this_relationship/",
        "text": "Hi everyone, this is my first post here 👋🏼 I really am in need of advice, and sorry this is so long!\n\n&amp;#x200B;\n\nSo, I had a friend from college (Maria, 23f) who I met during our sophomore year. We started becoming close and quickly became good friends. I always did have a weird gut feeling that something was off, but I honestly just ignored it and kept being friends with her. Throughout our friendship, it's safe to say that I have been there for her a lot more than she's been there for me (maybe like 80/20?). I know that's enough to realize that this is not a balanced friendship, but coming from a tough upbringing with little to no love, I honestly just wanted to move past the flaws thinking this friendship would blossom eventually.\n\n&amp;#x200B;\n\nTwo years ago, Maria started dating this guy (26m) and told me that they would break up once he graduates and moves away because he didn't want to try doing long distance. I already told her that was a red flag from him but she continued to date him anyway (which is fine, it's her life). Once they broke up however, she found out that he had been hooking up with a lot of girls (I'll spare the little details, I don't want to get too specific) and basically went off the wire. Maria would somehow find out the girls he hooked up with, their socials, and would show me pictures of these girls constantly asking me for validation that she was better looking than them. She was obsessively trying to find out little things about his life and would always talk about him. This went on for about 6 months, and basically I think I became her unpaid therapist (again, dumb of me, but I just genuinely wanted to help and had good intentions). In this time, she really did not care to ask me or other friends in the friend group how our personal lives were going, and after every night out, we found ourselves consoling her about this dude.\n\n&amp;#x200B;\n\nThen, about a month later, Maria went on vacation with some friends to where this guy was. I told her not to meet him and just have a good vacation with her friends (boy, I was wrong!). She ended up hooking up with him again, getting back together and ruining the vacation with my friends. Before the vaca, I told her countless times and reminded her why it wouldn't be good to get back with him. Now that she was dating him long distance, she became so paranoid about him and would STILL talk about feeling insecure, showing me pictures of the girls he hooked up with almost a year ago, etc etc. I would do my best to make her feel better but honestly it just felt like I was a wall to her. Also, during the previous trip she lashed out at one of my friends because she was so stressed about this guy, making the friend group dynamic even worse.\n\n&amp;#x200B;\n\n6 months later, he broke up with Maria because of how obsessive, anxious and insecure she was about their relationship. In this time, I again made sure to be a good friend because I knew how hurt she was and I've seen her spiral. Basically, I gave ALOT of my time to making her feel better and would constantly remind her of her worth.\n\n&amp;#x200B;\n\nA quick aside now: She has this one good friend from her freshman year that I think is a bit selfish and really only cares about her schedule/what she wants to do (Julie, 22f). Julie has another best friend named Ingrid (21f) that Maria started to get to know better three months before the latest breakup with her ex. So Maria, Julie and Ingrid are kind of like a trio. Ingrid is equally if not more selfish than Julie - she's very vain, always talks about herself and will lose all form of respect/decency and yell/throw tantrums if anyone dare speak up against her. Basically they're all classic mean girls (which I was naive enough to not understand at the time).\n\n&amp;#x200B;\n\nBack to the story. I started to hang out with Maria, Julie and Ingrid a bit more. Their dynamic was strange too, but again, I was excited to have a girl group I guess. Maria used to tell me that she was the most comfortable telling me about her breakup because Julie and Ingrid didn't want to hear it after a while and would get irritated if Maria would talk about the dude too much. Her relationship with Julie is also a bit rocky but they're all fake so it feels like nothing happened between them. Anyways, long story short, Maria would invite me to hang with all three of them and I quickly realized we would just end up doing what Julie and Ingrid wanted to do. I tried to dictate some plans and invite them over to my place, but they would never want to because it wasn't convenient or would cancel last moment. Basically, all hangouts had to be on their terms. Sometimes, Julie wouldn't make eye contact with me and would just look at Maria and Ingrid when speaking, making me feel kinda out of place. Also, Julie was either really happy or really moody, and I didn't know how to act around her. They would also change up plans just randomly and this was really draining.\n\n&amp;#x200B;\n\nSo for a few months, I put up with all their bs until one day when I kinda just got sick of it. We had a plan for the evening and I came right after an important commitment on time. Maria then suddenly said wait Ingrid can only do it at this location so we have to go there (when Ingrid only wanted to go to this location to have drinks and I was already at Maria's house). I got frustrated because I was tired of studying and drained from my commitment and I asked Maria if we could just do it at her place instead of changing the plan. She kept favoring Ingrid and her wants and needs so I just got fed up and said \"it's always just about you guys, right?\" and then Maria started arguing with me. I literally got so upset and left, feeling dejected like my schedule/time did not matter at all. The next day, Maria wanted to talk it out which I did too, I needed some space the day before. She asked me if Ingrid could also join, and there was no way I was about to be targeted by two girls so I said no. Then Maria and I talked, she basically did not give two sh!ts about my perspective, and brought up past things I had no idea about, and defended Ingrid. Tbh, I think she worships Ingrid and Julie secretly. After this, we took space and we didn't really talk. I gave up on trying to make things better because I knew I wouldn't be understood. Julie, Maria, and Ingrid started posting their hangouts a lot more on social media (I know it was so I could see them) and completely ousted me from their group.\n\n&amp;#x200B;\n\nIt's been a few months now, and I have found out Maria's been twisting the story to friends that I INTRODUCED HER TO, and I know she's told a bunch of people who really have no business knowing about this. In this time, I have done a lot of personal work and realized what boundaries I need to set and have been on the road to recovery. My question is, though, what can I do to fix this or save the relationship? I know it seems like a long shot but would love some advice. \n\nThanks guys.\n\nTL;DR I had a really bad falling out with one of my friends that I was friends with for a majority of my college time. Is there any way I can fix this relationship?",
        "created_utc": 1678815510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dad wants to kick me out of house for job choice",
        "author": "Gooderrrthanabitch",
        "url": "https://www.reddit.com/r/relationships/comments/11rcske/dad_wants_to_kick_me_out_of_house_for_job_choice/",
        "text": "[removed]",
        "created_utc": 1678815507,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (F18) annoyed with my (M19) boyfriend over quality time",
        "author": "Own_Cucumber_5954",
        "url": "https://www.reddit.com/r/relationships/comments/11rcsfa/im_f18_annoyed_with_my_m19_boyfriend_over_quality/",
        "text": "I (F18) and my boyfriend (M18) have been in a relationship for 2 years. Me and my boyfriend met through mutual friends so it’s difficult to ask for advice when we have the same friends. Our relationship is long distance most the time when we’re together everything is fine but apart is when most issues happen. He’s great at telling me he loves me but I’m the only one initiating call or hangouts. Recently I was on call with our mutual friends they we’re talking about calls they all had recently and the conversations It hurt because he hasn’t been trying to talk to me recently and all the conversations they describe are interesting and have depth something I feel our conversations lack. When I brought this up he got annoyed saying I have high standards which I can get because we have these issues alot he says he feels that he’s never enough no matter how much he tries. So we dropped it and picked up the conversation the next day he told me he feels a little lost right now and that he gets no joy out of his normal routine I suggested he may have depression and mentioned recently I’ve been depressed alot more and experiencing alot move suicidal thoughts this conversation was last night. After wards we agreed to be there for each other alot more well today im free and he’s free so i suggested hanging out he said no because he’s biking but he’s been biking all the weekend before so it makes me feel like I matter less. How can I improve my relationship.\n\nTLDR : my boyfriend hasn’t been open with me or spending time with me even after we had a discussion about my mental issues I’m facing rn.",
        "created_utc": 1678815499,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I be concerned? F25 M30",
        "author": "DangerousSeesaw97",
        "url": "https://www.reddit.com/r/relationships/comments/11rcr8l/should_i_be_concerned_f25_m30/",
        "text": "[removed]",
        "created_utc": 1678815428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (F18) annoyed with my (M19) boyfriend over lack of quality time",
        "author": "Own_Cucumber_5954",
        "url": "https://www.reddit.com/r/relationships/comments/11rcpw4/im_f18_annoyed_with_my_m19_boyfriend_over_lack_of/",
        "text": "[removed]",
        "created_utc": 1678815347,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Gf(23F) cheated on me(26M) on videochat",
        "author": "andyou7",
        "url": "https://www.reddit.com/r/relationships/comments/11rcpob/my_gf23f_cheated_on_me26m_on_videochat/",
        "text": "[removed]",
        "created_utc": 1678815334,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 'catfished' bf by posting an R4R ad to see if he'd respond.",
        "author": "ScrewwLoose",
        "url": "https://www.reddit.com/r/relationships/comments/11rcp43/i_catfished_bf_by_posting_an_r4r_ad_to_see_if_hed/",
        "text": "[removed]",
        "created_utc": 1678815305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sister used to be close to me, now she doesn't acknowledge me",
        "author": "TheHumWithin",
        "url": "https://www.reddit.com/r/relationships/comments/11rcnqk/sister_used_to_be_close_to_me_now_she_doesnt/",
        "text": "[removed]",
        "created_utc": 1678815221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is silence the best revenge?",
        "author": "Infamous_Presence_15",
        "url": "https://www.reddit.com/r/relationships/comments/11rcb8g/why_is_silence_the_best_revenge/",
        "text": "[removed]",
        "created_utc": 1678814471,
        "upvote_ratio": 1.0
    },
    {
        "title": "What in the heck is wrong with me (40f/43m ex)",
        "author": "whatintheworld9762",
        "url": "https://www.reddit.com/r/relationships/comments/11rcao7/what_in_the_heck_is_wrong_with_me_40f43m_ex/",
        "text": "[removed]",
        "created_utc": 1678814438,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do after getting out of a controlling 3 year relationship",
        "author": "leenieweenie1109",
        "url": "https://www.reddit.com/r/relationships/comments/11rc8xq/what_do_i_do_after_getting_out_of_a_controlling_3/",
        "text": "[removed]",
        "created_utc": 1678814336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Retroactive Jealousy",
        "author": "thisish0me",
        "url": "https://www.reddit.com/r/relationships/comments/11rc6zh/retroactive_jealousy/",
        "text": "[removed]",
        "created_utc": 1678814210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homewreckers?",
        "author": "silv1377",
        "url": "https://www.reddit.com/r/relationships/comments/11rc1z6/homewreckers/",
        "text": "I have recently seen a post from a single woman who always ended up being the mistress.\n\nPeople atacked her in the comments quite a lot. \n\nI don't understand why is the 3rd person being judged and not the cheater? \n\nIf the 3rd person is most likely single, how is it their job to protect the relationship of other 2 people? Why is the anger projected on the 3rd person and not the SO who made a conscious decision to not respect the vowes, the relationsip nor the person they are in a relationship with? \n\nWe are all allowed to be happy. If the 3rd person is happy with your person, why are they to blame and your person who actually chose to hurt you most times deserve a 2nd chance? \n\nAm I too imature by thinking this way? \n\nAnd for context, I am in a long-term relationship and my boyfriend does not have another relationship.\n\nTL;DR : Why is the 3rd person judged when the cheater most likely gets second chances?",
        "created_utc": 1678813899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homewreckers?",
        "author": "silv1377",
        "url": "https://www.reddit.com/r/relationships/comments/11rbxof/homewreckers/",
        "text": "[removed]",
        "created_utc": 1678813647,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (31F) very resentful towards my fiance's (31M) parents for getting him in trouble with the IRS and leaving him to deal with the mess",
        "author": "chickensandwiches22",
        "url": "https://www.reddit.com/r/relationships/comments/11rbx5e/im_31f_very_resentful_towards_my_fiances_31m/",
        "text": "My fiance moved out of state pretty early and got a very well paying job right out of high school/during college. He's a very hard worker, independent and despite being wealthy, his parents haven't helped him with anything. He covered all his housing, bills, car, insurance, groceries, etc. all on his own. \n\nI found out last year and during this time while he was out of state around 2012, his parents filed him as a \"dependent\" when he was not. He was financially independent of them and living hundreds of miles away in another state. He filed his taxes as he normally would and got a letter from the IRS claiming he owed over $20k because of this. \n\nMy fiance had to hire an attorney, deal with the IRS and pay this all off all on his own. I was SEETHING when I found out what his parents did and them making no effort to rectify the situation, despite them being wealthy and painfully frugal. \n\nTo be honest, it makes me not like them as people. I see it as they screwed their son over to get a bigger tax return and ended up costing him more money. There's a few thousand in debt left to the IRS, which I will acquire once we get married next month. I'm not sure how to move past this and not dislike them. \n\nTLDR: my fiance's parents screwed him over with the IRS, costing him over $20k and legal fees, all to get a few thousand dollars in having him as a dependent and I kind of hate them now because of it.",
        "created_utc": 1678813615,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much info do you owe your current partner about your past relationships?",
        "author": "escapegoat19",
        "url": "https://www.reddit.com/r/relationships/comments/11rbsp6/how_much_info_do_you_owe_your_current_partner/",
        "text": "[removed]",
        "created_utc": 1678813349,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex (m31) is harassing me! (F32)",
        "author": "ThrowRa04319",
        "url": "https://www.reddit.com/r/relationships/comments/11rbnqz/my_ex_m31_is_harassing_me_f32/",
        "text": "Since we split he's been sending all sorts of nasty messages. I blocked him but then he emailed me up to 30 times a day calling me names, saying I'm abusive and a horrible person. Now he's demanding money from which I can't afford in the first place. But he lived with me for a while and is demanding money back for food, gas and electric he used while living here. I told him I'll give him some back bit over a monthly or weekly basis and he won't accept that. He won't leave me alone and now has started liking my posts from years ago which has my sister tagged in them as they are still on friends on FB. It's getting to the point I just want to move out the city and just let them be fucking lovers. She feels sorry for him. And I'm left to be harassed.\n\nTl;Dr: being harassed by ex",
        "created_utc": 1678813063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex(m31) is harassing me! (F32)",
        "author": "ThrowRa04319",
        "url": "https://www.reddit.com/r/relationships/comments/11rbksl/exm31_is_harassing_me_f32/",
        "text": "[removed]",
        "created_utc": 1678812884,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (26F) am not sure if I can provide emotional support to my partner (25nb) of 6 months because of their past.",
        "author": "New-Vegetable-1923",
        "url": "https://www.reddit.com/r/relationships/comments/11rbgls/i_26f_am_not_sure_if_i_can_provide_emotional/",
        "text": "[removed]",
        "created_utc": 1678812632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it just hard to understand him and trying to understand him is literally draining or maybe I am not doing it the right way?",
        "author": "Busy_Independent_186",
        "url": "https://www.reddit.com/r/relationships/comments/11rbg3x/why_is_it_just_hard_to_understand_him_and_trying/",
        "text": "I have a friend (who is in his late teens, male) who's literally one of the best personalities I have ever met. He is genuinely great. He is very intellectual, has a good sense of humour, not a nerd but stores abundance of knowledge in that noggin of his. Will do anything to help you if you're his friend, will be there for you but he is someone who loves to have his own space, he loves isolation much more than socialising. Way too independent and mature of his age. Mostly sorts things out by himself. Had only guy friends up until senior year of high school but falls in love with a girl and comes into a relationship, after a few months covid hits and the relationship has its own ups and downs because lack of understanding, lack of meeting but they try and get back to each other. They helped each other to to grow and to pursue each other's interest.\n\nThe relationship hit a rough patch quite a few times in those 2 years but failing to be good lovers at times doesn't mean they'd not be good friends to each other. So, they carried it on like that..Soon time came for college and the guy somewhat grew distant, there existed lot of miscommunication and constantly reasoned it for not having \"mutual grounds\". He eventually broke off and moved to another country to study astronomy (the guy has a keen interest, pure intelligence and interest and will surely be a great scientist one day). Well the girl went on to study computer science engineering. She is good at heart. Despite going through rough patches was always there for him. Although I should say she was someone who was too caring and too protective. which at some point was just irritating I guess? She did try to not have him leave like that, gifted him an embroidery piece of art which he gladly accepted but made no further comments on them. He left without telling her and they didn't contact each other for 3 months.\n\nDespite all these none of them blocked each other on social medias and saved each others' newly replaced contact numbers (they were able to view each other's whatsapp status from their new numbers). But after 3 months due to a particular incident she had to contact him to inform about it. It was a short and quick conversation over text for 2 mins and nothing after. After a month of that, it was his birthday. Both got busy in their lives and looked happy. I know the girl missed him at some point every day but it was better the way it was. She wanted him to be happy but it was heartbreaking for her to be in such a situation where she is not reciprocated the love she has for someone.\n\nAnd on his birthday she put up a beautiful story for him wishing him happy birthday to the person who really taught her a lot and made her smile at some point. At one point in the past they were genuinely happy before responsibilities, career decisions etc factors entered their lives. He thanked her with a heart emoji and later in the evening they had their first video call after 3 months of not at all being in touch. He looked different yet there was not at all any kind of awkwardness, no bitterness. They caught up on each others' lives. He seemed curious about where she was staying, how she was doing, and how are the people she's living with? She asked the same. It didn't last long.\n\nSoon they started texting at times, not often but 4-5 times a month. It was interactive, sometimes it just ended blatantly with no further extension of conversation from him. He is not such a great communicator. Sometimes they video called which went on for hours more than 2 hours atleast. But the girl had vacations coming up. Even after catching up with him after so long, He wasn't the one to text first most of the times, it was her but he always replied almost instantly. I should say he tried to carry on a conversation this time. Something looked changed. He was better, improving. But when she came home for vacations. He was texting of her whereabouts till the day she left for home but after that there hasn't been a single text. She's contacted twice and his reply doesn't extend more than just one word \"okay\". Recently she texted him the news of a new born in the house and he just said \"okay\" as soon as the message got delivered.\n\nShe hates situationships. The break up gave her a life perspective shift. But she likes him for he's been there for her. He even woke her up twice or thrice early morning when she asked him too without asking a question, she discovered through the video call that her gift of an embroidery art is placed on his desk, this was when they initially started talking after a gap of 3 months. But now there's absolutely no efforts of conversation from him.   \n\n\nTL;DR How can one understand what he's going through for such a behaviour considering they are still broken up and both are just avoiding and doesn't seem like will talk about what ever equation they are in rn? Its just not possible to understand him as he doesn't disclose or like to talk much about himself makes it more difficult. what would you suggest the girl or what are your views in general?",
        "created_utc": 1678812606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling Stuck: Dealing with Conflict / Emotional Overload in Relationship",
        "author": "JH_0930",
        "url": "https://www.reddit.com/r/relationships/comments/11rbce5/feeling_stuck_dealing_with_conflict_emotional/",
        "text": " I (24 f) fight with my partner (23 m) at least once a week and I don't know what to do. This is my first long-term relationship. There are some occasions where ten blissfully peaceful days go by, but then something comes up and, disclaimer, I'm usually the person who brings up the issue. I feel stuck, exhausted, and sad about it (and I know he does too). The days when we're just vibing are lovely, but when we fight, I feel like it's so hard to pull myself out of the rut. Sometimes my anger gets the best of me, other times, I just get overwhelmed by emotions (usually occurs when other stressful things have already occurred) and resort to unhealthy coping mechanisms - like wanting to run away and picking at my skin (bad, but please continue reading below). I don't want to make this into a pattern, but we've been together for over a year and haven't really caught that much of a break. Some things have improved, but our conflict resolution really hasn't. I go to therapy (\\~4 years now), read self-help books and watch videos, but I still feel like I'm behind on developing the skills to emotionally regulate myself, which definitely contributes a significant amount to our emotional stress. I had parents that provided for me materially but have experienced a fair share of traumatic events both related and unrelated to family throughout my childhood-teenaged years; it still affects me to this day. But in spite of therapy and lots of reading, I feel like I haven't improved by much. Nowadays, when a conflict occurs or we're having a heavy-handed conversation, I feel like the emotions are compounded because of past hurts. What else can I do?  \n\n&amp;#x200B;\n\nTl;dr I've been in therapy for 4 years, read self-help books and watch videos, but my conflict resolution skills in my relationship are going nowhere; I feel like issues are compounded by past hurts. Advice?",
        "created_utc": 1678812375,
        "upvote_ratio": 1.0
    },
    {
        "title": "think my boyfriend killed himself",
        "author": "user03016",
        "url": "https://www.reddit.com/r/relationships/comments/11rbadu/think_my_boyfriend_killed_himself/",
        "text": "[removed]",
        "created_utc": 1678812255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling insecure that my(34f) bf(35m) is still bringing around a girl that he’s slept with",
        "author": "gigi779",
        "url": "https://www.reddit.com/r/relationships/comments/11rb1ya/feeling_insecure_that_my34f_bf35m_is_still/",
        "text": "[removed]",
        "created_utc": 1678811733,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend doesn’t feel love from me anymore",
        "author": "Necessary_Wave_9480",
        "url": "https://www.reddit.com/r/relationships/comments/11rb0rx/my_boyfriend_doesnt_feel_love_from_me_anymore/",
        "text": "My boyfriend 24M and Me 24F, i’ve been dating eight months and we’ve gone through a lot of trouble within the first year of our relationship pretty much he is a recovering alcoholic, and while I know that’s so hard, we have made it work thus far, however, given with his sobriety and stuff I was always afraid that he fell in love with me when he was drinking to this day now that he’s sober and doing a lot better he tells me all the time he’ll in love with me he is truly but he’s also the kind that is going through so much mentally that he’s blaming me for literally everything and telling me he doesn’t feel like our relationship is real. He feels like it’s forced and he doesn’t feel any love for me. Meanwhile, he has put me through the ringer and I stayed, and I loved him and supported him and I bent over backwards for him but for some reason because I can’t read his mind I am always wrong and when I do do the things that he asked me for he always just tells me he doesn’t want me to do that or that I’m only doing it because he said so, which is not true at all… he told me he doesn’t wanna do this, but he feels like he has to because he feels like this relationship is mentally fucking him up but I literally have not even done one thing wrong I have always told him that I don’t wanna make him feel this way and that I will improve and I just want him to know how in love with him that I am, and he says that he thinks our relationship is better virtual than it is in person because he feels like I’m not present with him in public. I’m like if we’re going out and doing certain events together, isn’t that being present with him? He snaps at me for the littlest things point being and I try and do everything I can to apologize and make it up to him and change but he literally has no faith and doesn’t think I’m capable of showing him the love that he wants. How do I convince him of that? Obviously I’m not handling this break up well… I know the whole bullshit thing. If it’s meant to be, it will be and I don’t really want to hear that again. He and I both know I only get into relationships if it’s going to be long-term because I can’t handle the heartbreak it’s too much for me because everybody always leaves… \n\nTLDR:How do I fix this?",
        "created_utc": 1678811660,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to move on from ex",
        "author": "xDzree-",
        "url": "https://www.reddit.com/r/relationships/comments/11ratit/how_to_move_on_from_ex/",
        "text": "[removed]",
        "created_utc": 1678811217,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is my reply?",
        "author": "cowhats1",
        "url": "https://www.reddit.com/r/relationships/comments/11rarre/how_is_my_reply/",
        "text": "So my boyfriend (24M) and I (22F) have been seeing each other for over a year. This past weekend, we hung out and he was sick with a cold. The day after I left his house I started feeling under the weather, I have a sore throat and mild congestion. I don’t feel that sick though. \n\nI asked him how he’s feeling this morning and let him know that I’m feeling under the weather. And he said “I’m sorry for getting you sick 😢”\n\nI was going to reply with, “aw it’s okay! not your fault 💕💕 maybe I caught it at work or the party” \n\nI know he didn’t mean to get me sick, which is what I mean by that. Is this a good reply? I don’t want him to feel bad because I’ve already gotten him since twice since we started dating.\n\nTL;DR: need advice on a reply",
        "created_utc": 1678811110,
        "upvote_ratio": 1.0
    },
    {
        "title": "My GF(20F) seems a lot colder and distant to me(20M) these past couple months",
        "author": "Fluffy_Soft_530",
        "url": "https://www.reddit.com/r/relationships/comments/11raq2g/my_gf20f_seems_a_lot_colder_and_distant_to_me20m/",
        "text": "TL;DR! For context, I went to the same university as her last year but I have taken a year out at home due to personal reasons but she is still up at the uni. \nBut recently, since around just before Christmas I’ve noticed a change in her behaviour.\n\nShe takes hours and hours to respond to texts, sometimes even leaving me on read for 7+ hours. Whenever I come up to visit her (she hasn’t come down to visit me since around mid December), she seems very distant and the way she talks to me is in a very cold manner and she never seems to want to initiate any sort of intimacy or sometimes even swerves my kisses when I try to.\n\nHer excuse to all this is that when I’m up with her she just gets overwhelmed after too long together and wants her own space which I understand but it’s not cheap to visit her so often.\nAnd today she just texted me asking if she can miss our anniversary which is next week and come down the next day as her friend wants to do something for her birthday. This would be our first anniversary so it’s pretty special and we planned the train tickets about 2 weeks ago as well. And the past couple days she’s turned off her location a couple times for no reason.\n\nShe also never seems to say I love you whenever we are with each other or even on the phone unless I say it first.\nAny advice or thoughts on this situation would be much appreciated, thanks!",
        "created_utc": 1678811005,
        "upvote_ratio": 1.0
    },
    {
        "title": "My GF(20F) seems a lot colder and distant to me(20M) these past couple months",
        "author": "Fluffy_Soft_530",
        "url": "https://www.reddit.com/r/relationships/comments/11rao0e/my_gf20f_seems_a_lot_colder_and_distant_to_me20m/",
        "text": "[removed]",
        "created_utc": 1678810879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girlfriend having feelings for someone else.",
        "author": "V16mike",
        "url": "https://www.reddit.com/r/relationships/comments/11rao0f/girlfriend_having_feelings_for_someone_else/",
        "text": "[removed]",
        "created_utc": 1678810879,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (F24) fix things with my BF (M25) after hurting his feelings?",
        "author": "Extra_Message6592",
        "url": "https://www.reddit.com/r/relationships/comments/11ranyy/how_do_i_f24_fix_things_with_my_bf_m25_after/",
        "text": "My bf and I have been dating for almost 4 years now. In our relationship, I'm the more sensitive one driven mainly by my emotions while he is the rational one. Due to hardships in our relationship in the past, I have accumulated some insecurities about being with him. I love this man but I never feel good enough for him. Lately, I've felt like I'm still a child while being with him. My boyfriend (M25) owns a house and has a high-paying job. Meanwhile, I (F24) live with my parents and am practically job-less as I am a full-time graduate student. He loves video games, and I happily wanted to be the girlfriend he could game with, but to my luck, I am utterly horrible at video games. Playing with me is not fun for him because I constantly die. My boyfriend also knows how to cook food for himself and will often cook for me when I go to his house. I usually bake him his favorite cake, but I haven't had the chance to make him a meal he really loves. His cooking is better than mine as of now, but I continue to practice by cooking for my family at home. As a graduate student working with modeling software, I often deal with technology issues, and he's always helping me tackle these issues even though he doesn't have to. I appreciate it a lot but I feel bad because I feel like I can't provide anything to him in return. I can't be financially helpful, I make games stressful, my cooking is not anything special, and I'm not the strongest helper with yard work (something he does ask for my help in).Maybe it's because I'm about to get my period or maybe it's because I see how impressed he is with his friend's gf, but I don't feel like I can ever be good enough for my bf. The least I could do is be a pretty gf, but I'll never have the ideal body type he likes in women. \n\nThese insecurities overwhelmed me last week and I became quiet and distant with him. He noticed something was wrong, and would ask what was wrong, but I couldn't bring myself to communicate to him my thoughts. He was trying to cheer me up by offering to accompany him to run errands and by just offering me to lay down next to him, but I rejected the offers. I was starting to realize that I was at a point of breaking down crying so I gathered all my things from his house (my plushies, my bath towel, and spare clothes I had) and told him I was going to head home. Usually, when I shutdown emotionally, I don't like to be touched. I get incredibly uncomfortable from touch. However, he wanted to give me kisses before leaving and I rejected them and said \"no. don't kiss me. I don't feel affectionate right now\". He looked hurt by that, and I just left. I felt remorse by my behavior and after an ugly cry session, I apologized and I told him why I was acting the way I was. His responses to my concerns were very neutral. And ever since that day, he refuses to see me in person. He's been dry-texting me as well and sounds very disinterested when I make comments about me helping him save money or about upcoming weekend plans. \n\nIt's been five days like this and it's killing me. I offered to talk about his and I's feeling in person but he doesn't want to see me. I could just go to his house regardless but I feel like that would make things worse. I thought giving him space would help, but I don't think it is. Now, I am super anxious that he will break up with me for my dumb, emotional behavior. How can I amend things with him? Does he need more space?\n\nTLDR: Last week, I was being emotionally distant with my BF because I was overwhelmed with the thought that I was not good enough for him, and I rudely refused to kiss him when he was trying to make me feel better. I apologized later that same day, but now he won't see me in person and is dry-texting me. What can I do to fix things with him?",
        "created_utc": 1678810876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling insecure about my (34) bf (35) still bringing around a girl that he’s slept with",
        "author": "dns887",
        "url": "https://www.reddit.com/r/relationships/comments/11ran8r/feeling_insecure_about_my_34_bf_35_still_bringing/",
        "text": "[removed]",
        "created_utc": 1678810835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I (28 m) avoid meeting a girl (28f) after I slept with her?",
        "author": "Different_Star7433",
        "url": "https://www.reddit.com/r/relationships/comments/11ral2x/can_i_28_m_avoid_meeting_a_girl_28f_after_i_slept/",
        "text": "Me ( 28m) and the girl (28f) were just friends , since 2 years. And sometimes we did hang out but she probably liked me more than a friend, but never told me. One night, few weeks ago, by mistake, we slept with each other. I texted her after , that we were only friends and I didn't like her that way. She sent many very upset texts but then apologized so it was ok. She asked me to continue being friends and I see no problem with being friends but I don't feel a need to meet her. She is trying to manipulate me into feeling guilty ,saying \"so we had sex and you can't even meet as friends now\"? I am postponing the meeting since weeks because I don't want her to think I am interested in her and I have no real desire to meet. What is the right thing to do now?\n\nTldr : I feel no desire to meet a friend anymore but we had sex so what should I do?",
        "created_utc": 1678810715,
        "upvote_ratio": 1.0
    },
    {
        "title": "My GF(20) seems a lot colder and distant to me(20) these past couple months",
        "author": "Fluffy_Soft_530",
        "url": "https://www.reddit.com/r/relationships/comments/11rakau/my_gf20_seems_a_lot_colder_and_distant_to_me20/",
        "text": "[removed]",
        "created_utc": 1678810668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationship problems after discussing our future together (28M 26F) (Long)",
        "author": "The-mk6",
        "url": "https://www.reddit.com/r/relationships/comments/11raia3/relationship_problems_after_discussing_our_future/",
        "text": "I (28M) have been talking to this girl (26F) for several months now after meeting in person a couple of times. However, after those few times in person I had to travel back home a few states away but we continued to text daily and talk on the phone a couple times a week. Conversations were great and we had really opened up to each other and everything was going smooth. \n\nFast forward to now, a bit more than 2 months of long distance communication. I decided to make the trip out to see her for a week and we were both very excited. As the time to go see her got closer she had told me that she was more nervous than excited and just wanted things to go well. We talked about that and just put it up to the fact that we have not been physically with each other so it will be like meeting for the first time again. We both agreed that it will be just fine and things will be great and both of us showed enthusiasm and excitement about it. \n\nI went to her place on the afternoon that I made it to her city and we met. Almost immediately I felt like she was blocking me off and wasn’t trying to connect. I was the only one starting conversations. We went out with her friends to some bars and the whole time it still felt like she was blocking some emotions. Her friends seemed to like me and we hit it off but she was just very timid. Later that night back at her place we finally had some alone time and got to talk. It went better and she was more open to talking. \n\nIt was right back to blocking emotions the very next day. The second night I was there we were alone again and got to talk. This is when I brought up the conversation about a relationship between us. We had discussed it in the past and she seemed open. However, once I brought it up to her she stated that she’s been independent for so long that she’s comfortable that way. But she went on to say that she would like to be in one eventually and thinks that I would be a great partner. She said she doesn’t want to make me wait while she figured it out by herself because she thinks it wouldn’t be fair to me. Despite every single good thing she said she loved about me she still felt that she can’t commit at the present moment until she figures herself out. She said she had no idea how long it will take her. \n\nWe ended up agreeing it’s best if I didn’t see her for the remainder of the trip. I felt I hadn’t discussed enough with her and I believe things may have been too rushed so I asked if she would be willing to sit down and discuss things that went unsaid. She agreed and we are meeting tonight. I just want some thoughts on if she truly is stuck in an independent state and is blocking emotions to protect herself or if she just didn’t see a connection with me within literal minutes or meeting in person. Regardless of our previous great connection\n\nTL;DR: I want a relationship after we had a good connection with each other but she seems to be blocking emotions and I’m not sure why.",
        "created_utc": 1678810549,
        "upvote_ratio": 1.0
    },
    {
        "title": "M(22), afraid of commitment and getting hurt",
        "author": "meowmeown_i_gga",
        "url": "https://www.reddit.com/r/relationships/comments/11rahh7/m22_afraid_of_commitment_and_getting_hurt/",
        "text": "TL:DR: M(22) scared of getting hurt by someone I see a long term future with.\n\nHey folks,\n\nI, M(22), just met a person who fits all the criteria and I want in a SO. She's confessed she likes me, and actively plans for a future together.\n\nI'm very scared of commitment and getting hurt again. I lost my first love when I was 17 to cancer and since then I've been hooking up/dating around but never considered a future.\n\nShe's gonna be moving to another city about 2 hours away in 3 months and then to Europe for her master's in a year.\n\nI'm afraid of her and know she's a fit and we're compatible: we communicate, share interests, values and long term goals.\n\nHow do I overcome this fear of getting hurt?",
        "created_utc": 1678810505,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21f) need some help. Is this excessive, toxic behavior?",
        "author": "anonymous_leopard1",
        "url": "https://www.reddit.com/r/relationships/comments/11rah7i/i_21f_need_some_help_is_this_excessive_toxic/",
        "text": "Hi everyone, this is my first post here 👋🏼 I really am in need of advice, and sorry this is so long!\n\n&amp;#x200B;\n\nSo, I had a friend from college (Maria, 23f) who I met during our sophomore year. We started becoming close and quickly became good friends. I always did have a weird gut feeling that something was off, but I honestly just ignored it and kept being friends with her. Throughout our friendship, it's safe to say that I have been there for her a lot more than she's been there for me (maybe like 80/20?). I know that's enough to realize that this is not a balanced friendship, but coming from a tough upbringing with little to no love, I honestly just wanted to move past the flaws thinking this friendship would blossom eventually.\n\n&amp;#x200B;\n\nTwo years ago, Maria started dating this guy (26m) and told me that they would break up once he graduates and moves away because he didn't want to try doing long distance. I already told her that was a red flag from him but she continued to date him anyway (which is fine, it's her life). Once they broke up however, she found out that he had been hooking up with a lot of girls (I'll spare the little details, I don't want to get too specific) and basically went off the wire. Maria would somehow find out the girls he hooked up with, their socials, and would show me pictures of these girls constantly asking me for validation that she was better looking than them. She was obsessively trying to find out little things about his life and would always talk about him. This went on for about 6 months, and basically I think I became her unpaid therapist (again, dumb of me, but I just genuinely wanted to help and had good intentions). In this time, she really did not care to ask me or other friends in the friend group how our personal lives were going, and after every night out, we found ourselves consoling her about this dude.\n\n&amp;#x200B;\n\nThen, about a month later, Maria went on vacation with some friends to where this guy was. I told her not to meet him and just have a good vacation with her friends (boy, I was wrong!). She ended up hooking up with him again, getting back together and ruining the vacation with my friends. Before the vaca, I told her countless times and reminded her why it wouldn't be good to get back with him. Now that she was dating him long distance, she became so paranoid about him and would STILL talk about feeling insecure, showing me pictures of the girls he hooked up with almost a year ago, etc etc. I would do my best to make her feel better but honestly it just felt like I was a wall to her. Also, during the previous trip she lashed out at one of my friends because she was so stressed about this guy, making the friend group dynamic even worse.\n\n&amp;#x200B;\n\n6 months later, he broke up with Maria because of how obsessive, anxious and insecure she was about their relationship. In this time, I again made sure to be a good friend because I knew how hurt she was and I've seen her spiral. Basically, I gave ALOT of my time to making her feel better and would constantly remind her of her worth.\n\n&amp;#x200B;\n\nA quick aside now: She has this one good friend from her freshman year that I think is a bit selfish and really only cares about her schedule/what she wants to do (Julie, 22f). Julie has another best friend named Ingrid (21f) that Maria started to get to know better three months before the latest breakup with her ex. So Maria, Julie and Ingrid are kind of like a trio. Ingrid is equally if not more selfish than Julie - she's very vain, always talks about herself and will lose all form of respect/decency and yell/throw tantrums if anyone dare speak up against her. Basically they're all classic mean girls (which I was naive enough to not understand at the time).\n\n&amp;#x200B;\n\nBack to the story. I started to hang out with Maria, Julie and Ingrid a bit more. Their dynamic was strange too, but again, I was excited to have a girl group I guess. Maria used to tell me that she was the most comfortable telling me about her breakup because Julie and Ingrid didn't want to hear it after a while and would get irritated if Maria would talk about the dude too much. Her relationship with Julie is also a bit rocky but they're all fake so it feels like nothing happened between them. Anyways, long story short, Maria would invite me to hang with all three of them and I quickly realized we would just end up doing what Julie and Ingrid wanted to do. I tried to dictate some plans and invite them over to my place, but they would never want to because it wasn't convenient or would cancel last moment. Basically, all hangouts had to be on their terms. Sometimes, Julie wouldn't make eye contact with me and would just look at Maria and Ingrid when speaking, making me feel kinda out of place. Also, Julie was either really happy or really moody, and I didn't know how to act around her. They would also change up plans just randomly and this was really draining.\n\n&amp;#x200B;\n\nSo for a few months, I put up with all their bs until one day when I kinda just got sick of it. We had a plan for the evening and I came right after an important commitment on time. Maria then suddenly said wait Ingrid can only do it at this location so we have to go there (when Ingrid only wanted to go to this location to have drinks and I was already at Maria's house). I got frustrated because I was tired of studying and drained from my commitment and I asked Maria if we could just do it at her place instead of changing the plan. She kept favoring Ingrid and her wants and needs so I just got fed up and said \"it's always just about you guys, right?\" and then Maria started arguing with me. I literally got so upset and left, feeling dejected like my schedule/time did not matter at all. The next day, Maria wanted to talk it out which I did too, I needed some space the day before. She asked me if Ingrid could also join, and there was no way I was about to be targeted by two girls so I said no. Then Maria and I talked, she basically did not give two sh!ts about my perspective, and brought up past things I had no idea about, and defended Ingrid. Tbh, I think she worships Ingrid and Julie secretly. After this, we took space and we didn't really talk. I gave up on trying to make things better because I knew I wouldn't be understood. Julie, Maria, and Ingrid started posting their hangouts a lot more on social media (I know it was so I could see them) and completely ousted me from their group.\n\n&amp;#x200B;\n\nIt's been a few months now, and I have found out Maria's been twisting the story to friends that I INTRODUCED HER TO, and I know she's told a bunch of people who really have no business knowing about this. In this time, I have done a lot of personal work and realized what boundaries I need to set and have been on the road to recovery. However, just knowing how much I've given to the relationship and remembering how I was treated is very triggering from time to time, and makes me lose trust in friendship. Please don't roast me for prolonging how much I dealt with her because I seriously was naive, and have only grown. But, my question is, this is extremely toxic behavior, right? I've literally only had good intentions for the friendship :'(\n\n&amp;#x200B;\n\nThanks guys.\n\n&amp;#x200B;\n\nP.S. I've also catered to a lot of her favors, and some have been big ones. I just don't want to detail them here for privacy.\n\nTL;DR I had a really bad falling out with one of my friends that I was friends with for a majority of my college time. Is it toxic?",
        "created_utc": 1678810488,
        "upvote_ratio": 1.0
    },
    {
        "title": "M(22), afraid of commitment and getting hurt",
        "author": "meowmeown_i_gga",
        "url": "https://www.reddit.com/r/relationships/comments/11rag31/m22_afraid_of_commitment_and_getting_hurt/",
        "text": "[removed]",
        "created_utc": 1678810422,
        "upvote_ratio": 1.0
    },
    {
        "title": "balancing work in the kitchen [mid 30s] between me [f] and him",
        "author": "confusedgf48562",
        "url": "https://www.reddit.com/r/relationships/comments/11rag17/balancing_work_in_the_kitchen_mid_30s_between_me/",
        "text": "[removed]",
        "created_utc": 1678810418,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf (18M) said it’s disappointing that I (18F) don’t want to help him with his hobby and I’m not sure if I should just go along with it.",
        "author": "Serious-Mulberry2305",
        "url": "https://www.reddit.com/r/relationships/comments/11rae8s/my_bf_18m_said_its_disappointing_that_i_18f_dont/",
        "text": "My bf is really into boxing and other martial arts. He bought new boxing gloves recently to replace his older ones and was really excited to use them (he attends boxing classes weekly) and subsequently started to ask me to help him with exercises again due to this new motivation. He’s done this in the past which i begrudgingly complied with despite the fact I’m not really into martial arts or drills, but as it benefited him I agreed. \n\nHowever this time I stood my ground and expressed that I’m really not into doing it and he always has to end up correcting how I punch or stand, and I just don’t feel good while doing it. His response was “you don’t have to enjoy it” and that there’s nothing wrong with doing something I don’t like, which is true I guess. But I just maintained the fact that I just didn’t feel up to it, and was very apologetic mind you. \n\nHe sighed a couple times and is now in a bad mood as I rejected him. We’re sat in silence and I’m not sure if I was in the wrong. I think he feels bad because I’m not willing to do something to help him out. Maybe he thinks I’m lazy. Any advice?\n\nTLDR: I don’t know if I should put aside my own feelings to help my bf with his hobby",
        "created_utc": 1678810311,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf (18M) said it’s disappointing that I (18F) don’t want to help him with his hobby and I’m not sure if I should just go along with it.",
        "author": "Serious-Mulberry2305",
        "url": "https://www.reddit.com/r/relationships/comments/11rad2s/my_bf_18m_said_its_disappointing_that_i_18f_dont/",
        "text": "[removed]",
        "created_utc": 1678810240,
        "upvote_ratio": 1.0
    },
    {
        "title": "(F20) I don’t feel mentally stimulated by my two year relationship (M20)",
        "author": "Sadairi123",
        "url": "https://www.reddit.com/r/relationships/comments/11rabqi/f20_i_dont_feel_mentally_stimulated_by_my_two/",
        "text": "\nHe doesn’t have critical thinking, he does engage in philosophical ideas, or get passionate about politics or just anything deeper. These are things I LOVE talking about \n\nWe talk about our lives, his passion for cars, my hobbies and the rest is basically me talking to myself. \n\nThe entire time I’ve felt somethings not right, a little unfulfilled or unsatisfied. \n\nThe passion and romance and EQ that comes naturally to me doesn’t to him. \n\nI don’t think I’ve ever really had a stimulating conversation with him before. Is it time to end it? Has anyone experienced this\n\nTd;lr my boyfriend mentally bores me",
        "created_utc": 1678810164,
        "upvote_ratio": 1.0
    },
    {
        "title": "is my mom a bad mom?",
        "author": "AtmosphereBrief1871",
        "url": "https://www.reddit.com/r/relationships/comments/11raaa4/is_my_mom_a_bad_mom/",
        "text": "Is my mom a bad mom?\n\n\n I dont even know where to start from 😕\nI am now a (25)F  who still lives with her mom (41)F\n\nGrowing up my mom was my role model, she worked so hard to make sure my 3 sibblings and I had everything we needed to survive. She was encouraging and was involved in our school activities. But in 2011 she separated from my biological dad do to domestic abuse and a few months after my mom had a boyfriend who is still my mom's current partner and have a son who is 12yrs old. \n\nSomething changed though back in 2012-2015 and I dont remember the exact day it happened as I was still too young. So before my moms boyfriend moved in to the place we were living at  one day at about 5pm my mom left in a van as I looked through our room window. I dont remeber anything before that just that exact moment...and I remember feeling upset and betrayed becuase she just left us to have a one night stand with some guy at her job. So pretty much she cheated on her boyfriend becuase she was already in a relationship. After this event I no longer looked uo to her. She probably thinks no one noticed or saw her but I did and I remember the guys name she had the one night stand  with. \n\nThat was the first time she cheated then a 2nd time and she didnt get caught at least not by her boyfriend but by me yes. I started to notice patterns in her behavior like when she was cheated. It was so obvious to me, she was on her oohien to much or be in a bad mood or call the guy she was cheating with  whenever her  boyfriend would go run errands and stuff. \n\nI honestly lost track of all the times she cheated but the one that really affected me was the most recent ...well not so recently cuz shes currently talking to someone new already. Anyways the oen that affected me the most was 1 years ago. So she was talking to this guy that apparently she was recalling inlove with him and was planning on leaving to Washington with this guy...she met him through work and even had communication with his mom and stuff... so my mom had the amazing idea to meet uo with this guy as a motel ...and guess what? She used me and my twin sister to cover for her with her boyfriend the father of my little brother. So this is what she asked me to do...\n\nTo hide her suite case in my room and not say antrhing...I never opened that suite case idk what she had in there and honestly I was scared of what I would find in there. But everyday she'd come inside and put stuff in there. Also she would use our room to call the guy.  Anyways so the big day comes and she lied to her boyfriend about where she would be... she told my step-dad( boyfriend)that she would look for a new job and he beleived her. So she ends up leaving at 7am with the guy and she calls me about 12pm from the motel ...omg I felt so mad and disgusted that she called me just to ask me if my step dad had asked about her. Anyways obviously she has sex with that guy ...the worst part was not even that...she she gets home she gets caught! By my steo dad and there was a whole mess all my sibblings crying...I wasnt becuase she had already hurt ne before so I didnt feel pain anymore from that...just a bit of anger of her immaturity. Anyway she denied it all and asked us to lied and say that she was home all day and stuff. \n\nA day later she asked me to go get her a plan B becuase she has unprotected sex with this guy OMG!! I was so mad at her...and I went to go buy it ☠ \n\n\nShe has never apologized to me for using me or my siblings for that stuff...thats what bothered me that she used us. I could care less what she does but to use her kids becuase we were young when all this happened. As a result of all this my relationship with her is broken...I dont trust her I have very little empathy for her. There was a time when I cried alot becuase I needed her and she wasn't there. My mom always makes me feel bad that she does that becuase of her rough childhood and becuase of her job is so tiring. She's always complaining saying \" I wish I have had only your 2 brothers...and not you\" ...that hurt the first time but after hearing it so much i stopped caring. \n\nMy step-dad well he is aware of all the cheating and he doesnt wanna leave her even though my my had already told him he is ugly and doesn't love me. Those are her words...and I do feel bad for my step-dad becuase he treats her with love. \n\nIm sorry is a long story.... I just dint know how to feel...I hate her but then im like dam she's my mom. Also, I've been working sicne i was 18 so I pay for my own stuff I have never asked her for anything. I pay my own rent buy my own food and stuff..\n\ntl;dr Even though we live under the same roof...we hardly talk like mother and daughter...its more like an acquientance  relationship. Im planning to move out soon since my sibblings are pretty grown up...im very close to them thats why I havent left.\n\nIdk am I a bad daughter for feeling hate for her or feeling thsi way 😕 I havent talked to anyone 😔 about this",
        "created_utc": 1678810077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice about friend drama.",
        "author": "anonymous_leopard1",
        "url": "https://www.reddit.com/r/relationships/comments/11ra9bi/need_some_advice_about_friend_drama/",
        "text": "[removed]",
        "created_utc": 1678810017,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (20M) got mad at me (21F) for falling asleep in calls..",
        "author": "wendyhues",
        "url": "https://www.reddit.com/r/relationships/comments/11ra90t/my_boyfriend_20m_got_mad_at_me_21f_for_falling/",
        "text": "Tl;Dr boyfriend gets mad at girlfriend for falling asleep in calls\n\nMe &amp; my boyfriend are in long distance and I’m currently doing intern at a hospital 9-5 every Tuesday to Friday so I’m always really drained when I get back home. By the time we call it’s always late at night for me and I can’t help falling asleep and my boyfriend got mad at me and we argued. I’ve explained to him internship is tiring but he thinks that I should not be falling asleep if I wanted to call him so bad and if I missed him so bad. He told me to not call him if I didn’t want to but the last time I did this he got mad at me because he thinks I find him boring when I never even implied that..this is one of the many things we argue about and I’m tired I don’t know how to resolve this without him being passive aggressive and trying to make it sound like I don’t care about this relationship and I just care about myself",
        "created_utc": 1678810000,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you knew your best friend [M 33] was seeing / talking to someone that's cheating on their partner of 4 years [M 26] would you distance yourself or look at ?",
        "author": "No-Employer-5007",
        "url": "https://www.reddit.com/r/relationships/comments/11ra6l1/if_you_knew_your_best_friend_m_33_was_seeing/",
        "text": "[removed]",
        "created_utc": 1678809858,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (20M) got mad at me (21F) for falling asleep in calls..",
        "author": "wendyhues",
        "url": "https://www.reddit.com/r/relationships/comments/11ra5b6/my_boyfriend_20m_got_mad_at_me_21f_for_falling/",
        "text": "[removed]",
        "created_utc": 1678809778,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Tips for Attracting Someone: Strategies for Finding Love and Building Relationships That Last",
        "author": "ravi_gajera8762",
        "url": "https://www.reddit.com/r/relationships/comments/11ra4jf/5_tips_for_attracting_someone_strategies_for/",
        "text": "[removed]",
        "created_utc": 1678809731,
        "upvote_ratio": 1.0
    },
    {
        "title": "My gf cheated and I don’t know how to get over it?",
        "author": "steveburns324",
        "url": "https://www.reddit.com/r/relationships/comments/11ra3ej/my_gf_cheated_and_i_dont_know_how_to_get_over_it/",
        "text": "[removed]",
        "created_utc": 1678809672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my mom a bad mom?",
        "author": "AtmosphereBrief1871",
        "url": "https://www.reddit.com/r/relationships/comments/11ra2s7/is_my_mom_a_bad_mom/",
        "text": "[removed]",
        "created_utc": 1678809638,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am worried about my boyfriends 23M EX 19F",
        "author": "ThrowRA_123456782002",
        "url": "https://www.reddit.com/r/relationships/comments/11r9vo2/i_am_worried_about_my_boyfriends_23m_ex_19f/",
        "text": "[removed]",
        "created_utc": 1678809213,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I tell my boyfriend to be more affectionate with me without offending him",
        "author": "tryingmyhardes",
        "url": "https://www.reddit.com/r/relationships/comments/11r9ubg/how_do_i_tell_my_boyfriend_to_be_more/",
        "text": "[removed]",
        "created_utc": 1678809132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heya advice for me and my partner I’m (M21) he’s (M35)",
        "author": "Ferret_guy0",
        "url": "https://www.reddit.com/r/relationships/comments/11r9sh3/heya_advice_for_me_and_my_partner_im_m21_hes_m35/",
        "text": "[removed]",
        "created_utc": 1678809025,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [22F] wants to end friendship with my bestfriend [22F] because she hides her pregnancy from me",
        "author": "mirageclyy",
        "url": "https://www.reddit.com/r/relationships/comments/11r9hm3/i_22f_wants_to_end_friendship_with_my_bestfriend/",
        "text": "Me [22] and my bestfriend [22] known each other since highschool. We become bestfriends since then.\n\nSo fast forward after highschool she wen't to college and I didn't go to college i just straight up get a job to help sustain myself. We stay in contact and we still find time to hangout and see each other even though were both busy.. but as time passed by we rarely see each other because we are both busy but we still stay in contact. \n\nSo 2 years passed by her mom passed away because of illness, after her mom passed away she changed so much she became a s**t she sleeps with different men but at some point she became bored about it, then she met this guy who is a 35 year old nurse she met at the hospital cause she got confined at the hospital because she sick at that time she has stomach pain. \n\nSo fast forward when she get discharged from the hospital she started to date this guy they date for 3 months after 3 months she move in with this guy. She hides it from me at first but then she told me all of this after 4 months of living with that guy.\n\n We got some misunderstanding about it we fought a little because i feel like she don't trust me i asked her if shes out of her mind moving in with a guy she just knew for 3 months and i ask her why it seems like she is ruining her life because she quit college like i ask her what is going on with her then she gets upset with me. At this point i feel like shes not the friend that i know, but then after some time we fix it and i apologize, we are okay again. \n\nSo fastforward after 6 months of them living together she became pregnant she hides it from me again, she hides it on me for 9months. I just found out after she gives birth she post it on facebook. I just feel betrayed, and i feel like she make me look like a fool  because all this time we are talking i did'nt even know she is pregnant she didnt say it to me. \n\nI want to end our friendship because i am always patient and understanding to her, im always there when she need me but she changed a lot she keeps on lying and hiding things from me which means to me that i can't trust her anymore. \n\nTl;dr: I want to end our friendship, i need some advice. Thank you.  \n\nPs: apologies for my bad english. Thankyou for taking your time to read this.",
        "created_utc": 1678808368,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [22F] wants to end friendship with my bestfriend [22F] because she hides her pregnancy from me",
        "author": "mirageclyy",
        "url": "https://www.reddit.com/r/relationships/comments/11r9eqs/i_22f_wants_to_end_friendship_with_my_bestfriend/",
        "text": "[removed]",
        "created_utc": 1678808179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Something New this Week?",
        "author": "anjelaeyes",
        "url": "https://www.reddit.com/r/relationships/comments/11r9eel/looking_for_something_new_this_week/",
        "text": "[removed]",
        "created_utc": 1678808157,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 31F dating 36M please give me some advice what would you do. Be nice please",
        "author": "Ok_Neck_7399",
        "url": "https://www.reddit.com/r/relationships/comments/11r9auh/im_31f_dating_36m_please_give_me_some_advice_what/",
        "text": "I need some advice on my relationship.\n\nI’m 31Female and my Bf is 36Male\nWe’ve been together for 8 years and I love him very much. \nBut our life isnt fantastic I’ve hinted at the problems said them directly and nothing happens. \nI do all the household chores have since we’ve been together at first I didn’t mind I thought he would pitch in eventually. (Cook, clean grocery shopping, feeding the pets) \nHe works any where between 4 to 8 hrs 4 days a week and then comes home and plays video games or watches tv. I got a new job 9months ago and told him\nHe was going to have to pitch it more now cause I work 10hr days 4 days a week. \nAnd if I bring it up to much or something that happened bothers me he’ll get mad. \nWhen he’s in good moods everything is great. But he’s bad moods are bad he can be mean and I’ll tell him he’s hurting my feelings and he won’t care. So I’ll be upset all day and then he’ll act like nothing happened hrs later. \nWell I’ve been feeling really guilty lately because I’ve been crushing on my boss.  I didn’t go looking for it I swear it just happened I’ve been thinking about him recently. \nA couple days ago me and my boss were talking about the gym and he showed me a picture of him shirtless and then he flexed his pecs at me and then later we’re outside helping a fellow coworker and he was standing on my right side and then put his hands on my waist like he was going to move me but just squeezed and moved to my left side. \nHe makes little comments at work that he’ll miss me or I’m his favorite one time he even said that he would\nTape me up and take me home. \nHe’s very attractive (he’s samoa EVERYONE finds him attractive) and I do check him out but that’s all I’ve ever done I haven’t made no comments like him because I do have a boyfriend. \nWell yesterday I told my boss that he did a jerk move by showing me the picture of him and the flexing because I do find him attractive and I unfortunately do like him and that he can’t do that he said he would do better. Well he caught me checking him out and told me try not to fall in love with him I laughed and said I’ll try. \nPLEASE PLEASE Don’t bash me I’m doing it to my self already I feel like poop I want to cry cause I don’t know what to do. I love my bf but I like my boss. (Nobody knows what goes on in mine and my bfs life I keep it to my self so my boss doesn’t know. \n\nTL DR:: I’ve been with my boyfriend for 8 years I’m 31F he’s 36M and I do everything for us household wise we haven’t been on a date in years and lately I’ve been crushing on my boss he’s 40M I feel so freaking guilty. Please give me some advice. \nWhy is my bf like this? What does my boss want from me?\nIt’s taking everything in me not to cry while Posting this. I can’t tell my bf he’ll just assume I’ve done something already with my boss",
        "created_utc": 1678807932,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I be concerned?",
        "author": "DangerousSeesaw97",
        "url": "https://www.reddit.com/r/relationships/comments/11r98c7/should_i_be_concerned/",
        "text": "[removed]",
        "created_utc": 1678807783,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(25M) failed as a brother and sick of getting exploited",
        "author": "IntrepidArugula3908",
        "url": "https://www.reddit.com/r/relationships/comments/11r96pv/i25m_failed_as_a_brother_and_sick_of_getting/",
        "text": "Last weekend; I got a call from my sister (22F). She was sobbing because mom &amp; dad beat her for having a relationship. Well, she lied or I want to described it as she told me truth as per her convenience. After a call with my mom, I got to know about her abortion, breakup and her resignation.\n\nIt's been two days; I blocked all of my family members and told them not to contact me anymore.\n\nI have a small family of stubborn dad, selfish sister and naive mom. I grew apart from them since I left to kota and now due to my job, I don't get chance visit them often. I look like an ideal son as per society standard but in reality I am well trained donkey for them. My dad spoiled sis who doesn't recognise his love so he keeps spoiling her by gifting her lots of things over the years. No emotions for me at all. Instead, he demanded me to send back 60k (30k to him &amp; mom) as soon as I started earning. Mom used to give it back So, I gifted her gold bangles &amp; necklace. She told me all of them in a bank locker because she doesn't want my dad or sister to find out. I feel sad for her.\n\nOn the other hand, my sister is completely opposite of my personality. She is rebel, had multiple relationships, drink liquors &amp; smoke and what not. My dad called me \"nashedi\" as I confess about drinking after college placement. In fact, that's the first &amp; only time I ever consumed alcohol. I gave my sister \\~5k per month, paid for random online orders, gave 50k once for a trip. She saved her salary and even asked me to contribute to her savings as she wants to pursue masters abroad. she is a living parasite. Right now, she quit a job due to depression(?) caused by her ex. They were together for 3 years and he dumped her back in February. Last time she called me to rant about him. How he treated her, she used to beg him for attention and how he flirted with other girls when they were together. I assured her about future, gave advice to focus on carrier and stay away from unnecessary drama.\n\nNow I feel guilty for hiding information about her relationship from my mom. I came to know about her relationship last year and like an idiot I never confronted her....\n\nYepp, She never told me about resignation or abortion and looking at the current mess she is in I don't have mental capacity to stand for her. All I know she is a master manipulator and there's no guarantee she is going to a sane person. I can't empathise with her anymore.\n\nFew months back, I went through a turbulent phase and now somehow things are getting better for me. I made an exit plan from this situation. First, I will get an internal transfer to any location outside India. My arrange marriage search is going on in parallel. As soon as I find my life partner, I will request mom to move in with us. I just fucking want to cut off my dad &amp; sister from my life. I don't care what will society say about me. It's better to called as unfruitful son than living a life like a donkey.\n\nTL;DR : Family refuse to see me as a person. I don't want to be so called MAN of the house so I am     \ngoing no contact with them.",
        "created_utc": 1678807679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should we say something to our best-friend for his own good?",
        "author": "SkubaSteve00",
        "url": "https://www.reddit.com/r/relationships/comments/11r969c/should_we_say_something_to_our_bestfriend_for_his/",
        "text": "[removed]",
        "created_utc": 1678807649,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [23M] can't deal with my partner's [21F] trauma healing strategy",
        "author": "thrownfarfaraway1365",
        "url": "https://www.reddit.com/r/relationships/comments/11r964z/i_23m_cant_deal_with_my_partners_21f_trauma/",
        "text": "So recently in a long distance relationship of 4 months (12 months of being super close), my partner has taken up being a camgirl as a way to heal some of her sexual trauma in the past. Initially she started it without telling me the reason behind it. I broke down the other day and told her I want it to stop because it was making me super uncomfortable to the point of nausea. Once she told me the reason, I felt a little bit better about it but I'm sinking back into that same feeling the other day again.\n\nI want her to heal from her trauma but I need this to affect me in the smallest way possible, if at all. I've just come off my antidepressant medication which makes it all feel worse. She only plans to do it for a few months but I don't know if I can last that long. I really don't want to break up with her as I love her in every single way until now.\n\nI suggested therapy but she claims it will take too long to find help through it. I'm struggling with this a lot and currently can't look at her the same way as I used to or want to.\n\nI would like to know any other possible ways that we could maybe reach a compromise, without breaking up, or just other general advice that may soothe the way I feel about it.\n\n---\n**tl;dr**: My girlfriend has taken up camgirling as a way to heal from past trauma. This makes me extremely uncomfortable but I don't want to break up.",
        "created_utc": 1678807641,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18m) slept with a uni housemate (23m) who sees himself as straight. He now hates me and my living situation is miserable.",
        "author": "ThrowRA54_32",
        "url": "https://www.reddit.com/r/relationships/comments/11r91iq/i_18m_slept_with_a_uni_housemate_23m_who_sees/",
        "text": "I'm 18m and I'm a uni student in the UK (first year) and I'm living in student accommodation. I made a really stupid mistake around a month ago and hooked up with a flatmate who is also on the same course as me (he's 23m but is in the same year as me). I'm openly gay, he has always appeared to be straight. It was an extremely bad experience and he's been horrible to me ever since. At first he was literally bullying me but people were noticing how strange he was acting toward me and I guess he decided he needed to be less obvious so people wouldn't ask questions, so now it's much less direct. I posted before so there is more about what actually happened in my previous posts but I'm trying not to make this too long. \n\nI'm in a mess and I'm desperate for some advice on how to deal with it. I hope its okay to ask here. Its not something I feel comfortable being fully honest about irl so no one really knows whats going on. I do have an appointment with my uni wellbeing (counselling) service coming up but i dont even know what to say to them. I've requested to move to a different flat and the accommodation managers know about the bullying but not anything else. I can move but it won't be until April (easter break). I will also still be in the same course as him for more than 2 more years. \n\nI don't get along with my family and my financial situation is not good so I don't have many other options of places to stay while I'm waiting to move out other than friends sofas and I feel very uncomfortable imposing like that. While I'm in the flat, I'm spending my time locked in my room and I don't want to use the kitchen unless he's out or store food in there as he has messed with my food before. I'm type 1 diabetic and it's been really hard to manage it recently so I've ended up in hospital a couple of times in the last few weeks. To be fair I was finding it hard to manage before all this but it does seem to be getting worse. I've also been feeling very low and like I don't want to be around other people even when he isn't there. \n\nClasses are difficult because he is often there (not always, his attendance isn't great so I never know if he'll be there until I show up and even then he sometimes comes in halfway through). He's a very loud, outspoken person so when he's in a the flat or in class it's impossible not to hear him. It could be paranoia but it seems like he's got louder in classes. He quite often starts laughing if I answer a question or something to the extent that lecturers have told him to pack it in, then he says he was laughing at something unrelated. There's this thing at my uni (not official obviously) where students submit \"confessions\" or gossip about other students anonymously and horrible stuff has been posted about me there several times now since all this happened and I think it must be him because I've never been mentioned on there before. I'm really not well-known and I get along fine with most people. \n\nI don't know what to do. I know when I posted before I was advised to tell someone exactly what happened and I promise I'm not just ignoring that advice, it's just really hard because I feel so wrong about telling someone something he is clearly so ashamed by no matter how much of an asshole he is being. I also just really hate the idea of anyone knowing because even though everyone knows I'm gay, I'm ashamed of it too and if I could I would much rather pretend like it never happened. \n\nLast night I was feeling in a really dark place so to make myself feel better I tried to come up with ideas of things I could do to improve my situation without doing something too drastic. I thought I could possibly either transfer university or even drop out of my course and I submitted a query about how I would do that and also emailed my tutor (no reply yet). I know the best option is probably to wait until I move flat to see if that helps make things easier but last night even a few weeks seemed like too much so I didn't want to think about that. I have an appointment with the wellbeing service for counselling which is coming up soon and I could talk to them but I don't actually know how they would help. I don't think I could report him for anything because I don't think there's anything he's doing that is actually that severe plus he could deny it. He was being more obvious a few weeks ago but he's toned it down since then and it would probably just seem like I'm being paranoid or too sensitive. \n\nI have tried talking to him. I tried talking to him directly at first and I've also tried messaging him but it didn't help. I know it sounds stupid but I'm scared of him. I was never fully comfortable around him because he's one of those \"blunt\" people who are actually just really hurtful and he's also physically much bigger and stronger and he can be quite angry and aggressive. I don't think talking to him is going to help. I don't know if telling someone else would help and it could actually make things worse because I don't know how he would react if he found out I told someone what actually happened. Several people have noticed that hes much harsher with me than anyone else but I don't imagine they have any idea of what the reason is. One of my housemates tried to stick up for me and he ended up kicking off at her. \n\nI feel really stuck and I realise that a lot of this is my own fault for making a stupid choice and I can't even describe how much I regret it. I know no one can fix this for me but I'd really appreciate any advice on what I can do to survive the next couple of years because it currently feels like a hopeless situation. \n\nTl, dr: I slept with a uni flatmate/classmate who now hates me, it's making my life miserable and I don't know what to do to make things more bearable.",
        "created_utc": 1678807346,
        "upvote_ratio": 1.0
    },
    {
        "title": "(M24) What does this mean if she stops posting but is active on Social Media after I sent her DM?",
        "author": "LegendsBKYLN",
        "url": "https://www.reddit.com/r/relationships/comments/11r8w8m/m24_what_does_this_mean_if_she_stops_posting_but/",
        "text": "[removed]",
        "created_utc": 1678807022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you guys have any sweet memories from your past relationship?",
        "author": "Rutika02",
        "url": "https://www.reddit.com/r/relationships/comments/11r8vel/do_you_guys_have_any_sweet_memories_from_your/",
        "text": "[removed]",
        "created_utc": 1678806970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (27m) ex (28f) trying to make me jealous?",
        "author": "Middle_Cartographer2",
        "url": "https://www.reddit.com/r/relationships/comments/11r8r59/is_my_27m_ex_28f_trying_to_make_me_jealous/",
        "text": " We've mutually ended an almost 2 year relationship in early January, on good terms. We kept our distance for a short while for the shock to go away, then we saw each other for (the best) sex. No strings attached as agreed.\n\nShe has since been seeing other guys and she messages me about them (even sent me photos of the guys) and her experiences with them. She told me she wants to have sex with me, and said we can no longer have unprotected sex because she did it with one of the other guys, without having done any STD testing.\n\nI admit I was a bit taken aback by this and reacted badly, probably out of jealousy. By comparison, she had waited much longer until she did it unprotected with me and still ended up giving me chlamydia (back then).\n\nThere are a lot more details and she was always a reckless uncaring person to me. So besides the fact that I was really dissappointed to see someone let themselves go so low, is she trying to reel me back in, or is she trying to purposefully hurt me?\n\nI am now considering cutting all ties other than platonic birthday messages or whatever, as it all seems to be more than just the FWB we agreed to...\n\nTL;DR is my ex gf trying to hurt me by explicitly telling me about her sex experiences with other men?",
        "created_utc": 1678806705,
        "upvote_ratio": 1.0
    }
]