[
    {
        "title": "I (21F) baby daddy and partner",
        "author": "lolipop2036",
        "url": "https://www.reddit.com/r/relationships/comments/11oeu08/i_21f_baby_daddy_and_partner/",
        "text": "[removed]",
        "created_utc": 1678523330,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel deeply unlovable",
        "author": "Shortie616",
        "url": "https://www.reddit.com/r/relationships/comments/11oeqpg/i_feel_deeply_unlovable/",
        "text": "[removed]",
        "created_utc": 1678522998,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it worth giving it another chance?",
        "author": "Exciting_Display7460",
        "url": "https://www.reddit.com/r/relationships/comments/11oeobw/is_it_worth_giving_it_another_chance/",
        "text": "[removed]",
        "created_utc": 1678522764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice",
        "author": "SeaworthinessWarm842",
        "url": "https://www.reddit.com/r/relationships/comments/11oenny/need_advice/",
        "text": "[removed]",
        "created_utc": 1678522694,
        "upvote_ratio": 1.0
    },
    {
        "title": "My husband (28M) is pressuring me (26F) to have children now, even though it is not what we previously agreed upon.",
        "author": "No-Natural1891",
        "url": "https://www.reddit.com/r/relationships/comments/11oek6a/my_husband_28m_is_pressuring_me_26f_to_have/",
        "text": "My husband (28M) and I (26F) have been married for almost 2 years. He is in the military and we live 3,000+ miles away from where we grew up/our family&amp;friends. Before we got married, we had numerous discussions about finances, responsibilities, kids, etc. We had agreed that we would wait until his contract was up, and we were back home (when he is 30 and I am 28) to start trying for kids. I have struggled with my mental health for many, many years. I’ve been in therapy since, and do my best every day to combat my struggles. With moving so far away, having to find a new job, balancing school, and adult life, it has really affected me. He knows this. But a lot has changed recently, and not good changes. He is pressuring me to have children now. He says that he is “getting old” and that his friends having babies is making him want them even more. I told him I understand how he feels (to a degree) but that it doesn’t mean I am ready. I discuss my struggles with him, and the fact that I am not ready to be responsible for another life. Some days it’s too hard to even get out of bed and go to work. He doesn’t understand. He tells me that I am selfish, and that he is allowed to change his mind from what we agreed on before getting married. I told him that I’m allowed to not change my mind. And that I am not ready for the physical, mental and emotional changes that pregnancy and motherhood brings. Yes, he is the main, not sole, breadwinner. And I do appreciate him for that. But I also do 95% of housework; cooking, cleaning, laundry, grocery shopping, etc. On top of working part-time and going to school online full-time. I know what having a child with him will mean: caring for it mostly on my own. And again, *I am not ready*. I don’t know if I’m wrong or selfish for this. He makes me feel as if I am. I don’t want to keep him from what he wants, but it feels unfair that he expects me to sacrifice my mental health even further, because he wants a child. A child that he will not have to carry for 9 months, a child that he will NOT wake up for in the middle of the night. I feel like a bad person for not being excited when thinking about having a child with my husband right now. I guess I am just looking for advice, anyone to relate, or to vent. If you have read my rambling, thank you. \n\nTL;DR- my husband (28M) wants to have children with me (26F) now, even though we agreed to wait a few years, and I feel pressured when I am not ready.",
        "created_utc": 1678522348,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you think there is a pattern or trend when it comes to your choice of romantic partners?",
        "author": "BakiBoke2020",
        "url": "https://www.reddit.com/r/relationships/comments/11oed2o/do_you_think_there_is_a_pattern_or_trend_when_it/",
        "text": "[removed]",
        "created_utc": 1678521663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think there is a pattern or trend when it comes to your choice of romantic partners?",
        "author": "BakiBoke2020",
        "url": "https://www.reddit.com/r/relationships/comments/11oebip/do_you_think_there_is_a_pattern_or_trend_when_it/",
        "text": "[removed]",
        "created_utc": 1678521532,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my long-distance boyfriend is cheating on me...",
        "author": "Ok_Teacher8919",
        "url": "https://www.reddit.com/r/relationships/comments/11oe9w7/i_think_my_longdistance_boyfriend_is_cheating_on/",
        "text": "My boyfriend (18m) recently had his 18th birthday. He became really distant and he'd even ignored my messages. He told me that he's gonna go clubbing with his friends a few days after his birthday. I admit that I overreacted when he said that, however, in the end, I told him it's his choice if he wants to go and I told him not to drink too much. Since then, he stopped saying he loves me. Whenever I send him a picture, he doesn't screenshot it anymore (in instagram).\nToday, he didn't chat me much. But I figured out it's fine because I saw in his insta story that he's out playing billiards with his friends. But a few hours later, I saw his friend posted vids in the club and my boyfriend stopped replying to my message (btw I didn't send him a lot of message, I only told him to have fun but whenever I say that he'd usually reply with an okay or something). One more thing, I'm worried his friends might hook him up with someone because they don't know about me. Yep, they don't know me at all, my boyfriend doesn't wanna tell them because I'm \"far\".\nAnyway, it's now around 3am in his timezone. I'm not waiting for any reply from him but I'm worried about how I'm gonna confront him about this.\n\nTl;dr my boyfriend has been distant these passed few days and then he went clubbing with his friends without telling me",
        "created_utc": 1678521363,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is a tough question but I’m ready to hear the answer. Am I just not cut out for this? (21M)",
        "author": "throwaway7283839",
        "url": "https://www.reddit.com/r/relationships/comments/11oe7hv/this_is_a_tough_question_but_im_ready_to_hear_the/",
        "text": "Are some people just not cut out for relationships? I truly feel like I just get way too attached to people in a short amount of time to the point where a break up just destroys me. It doesn’t feel natural. I had a break up over a year and a half ago now and I still think about it every day and have trouble moving on. The anxiety I have from it is so bad that I had to pull back from mutual involvements on campus because seeing her (22F) almost sent me into panic. I keep thinking I’ve made progress but then I run into her somewhere and I feel like I’m going to have a panic attack. We were friends for a long time but only dated for a couple months and something about it has just shook me up in such a way I could’ve never imagined. I’ve been in therapy for almost a year and a half and it just feels so hopeless. If I’m going to respond like this to such a short break up I just can’t imagine what a longer relationship would do to me. It just feels like I’m never going to get through this and I just genuinely need to hear if because of my mental state I just need to give up on finding love. I genuinely just don’t know what to try and I just feel like this might be one of those grim realities of life that I just can’t handle being in a relationship.\n\nSorry if this sounds rant-ish I just really need advice.\n\nTL;DR had a break up a year and half ago from a very short relationship. Don’t know what to do to move on or fathom being in another relationship.",
        "created_utc": 1678521123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me [17 M/F] with my gf [16 /F] should i go with my gf's bff birthday party? --- **tl;dr**: having a hard time to choose if i should go with my gf or bros",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11oe4fh/me_17_mf_with_my_gf_16_f_should_i_go_with_my_gfs/",
        "text": "\n\nNext Saturday will be the birthday celebration of my bro(A) and my gf's bff(G) also my friend. My gf's bff will celebrate her party on a beach(which i would like to go to) and try something different. I'm only going to her(G) birthday party cuz she invited me and my gf insist to have fun and celebrate with, and also going to the beach. on the other hand, my bro(A) invited me to his place on sat to celebrate his birthday, nothing new just gonna party and have some fun(I'm not allowed to drink)\n\nThis past few weeks has been different one of my friend(C) has been ignoring and being distant to me for whtvr reason. this has affected me deeply cuz he's been my friend for 5 years and he thought I won't notice that he's being distant.\nHe is always the light in our circle, the bro to laugh with and life of the party. I feel that he is backstabbing me, but those are normal to us because with don't really mean it and he always talk behind others back and also saying Infront of them abt things that he/she did. But this time has been different it affected my friendship with the whole circle, and I always feel that if they are being distant to me cuz I'm kinda observant.\n\nI also think that I'm the one who's being distant because I'm been spending too much time with my girlfriend, but I always go with the bros when they are out at night. \n\nI've told to my bro(A) that i think i wont be able to go to his birthday party(I haven't tell him reason why) it's also because gf's friend(G) invited me first and I told her i could go along if my gf will go.\n\nI think that my gf's bf(G) would mind and its fine with it if I wont be able to celebrate with them. but I'm not sure if my gf would get hurt/mad/jealous if I would choose to go with bros. last week my gf has been mad at me cuz I said i wouldn't go with her cuz she would have her bff go with her if i wasn't available (i was joking that i wouldn't go with her)  and said that i would go with the bros then she got hurt and got mad at me. then, while we were walking home she waited for the bros to get as far as possible before we walk cuz i think she doesn't want me to focus on them and she want me to focus on her(even tho i was walking with her and all of my attention to her)\nso going with her to celebrate her bff's birthday party would make it up to her.\n\nI think that is possible to go to both party cuz my bro's(A) would celebrate at 3pm till night and i think I could go there after. but i am not sure what time my gf's bff (G) party would end.\n\ntl;dr: should I go with my gf and her bff's(mutual friend) birthday party or should I go with the bro's birthday party with my circle on it? (which i kinda felt i didn't belong anymore, cuz' I think I've been spending too much time with her. and 1 friend has been ignoring me) \nI think I'm not relevant anymore to both sides.\n\nany advice?? I don't want my bro(A) or my gf(N) to get mad at me for choosing the other.",
        "created_utc": 1678520825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me [17 M/F] with my gf [16 /F] should i go with my gf's bff birthday party? --- **tl;dr**: having a hard time to choose if i should go with my gf or bros",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11oe1ur/me_17_mf_with_my_gf_16_f_should_i_go_with_my_gfs/",
        "text": "Next Saturday will be the birthday celebration of my bro(A) and my gf's bff(G) also my friend. My gf's bff will celebrate her party on a beach(which i would like to go to) and try something different. I'm only going to her(G) birthday party cuz she invited me and my gf insist to have fun and celebrate with, and also going to the beach. on the other hand, my bro(A) invited me to his place on sat to celebrate his birthday, nothing new just gonna party and have some fun(I'm not allowed to drink)\n\nThis past few weeks has been different one of my friend(C) has been ignoring and being distant to me for whtvr reason. this has affected me deeply cuz he's been my friend for 5 years and he thought I won't notice that he's being distant.\nHe is always the light in our circle, the bro to laugh with and life of the party. I feel that he is backstabbing me, but those are normal to us because with don't really mean it and he always talk behind others back and also saying Infront of them abt things that he/she did. But this time has been different it affected my friendship with the whole circle, and I always feel that if they are being distant to me cuz I'm kinda observant.\n\nI also think that I'm the one who's being distant because I'm been spending too much time with my girlfriend, but I always go with the bros when they are out at night. \n\nI've told to my bro(A) that i think i wont be able to go to his birthday party(I haven't tell him reason why) it's also because gf's friend(G) invited me first and I told her i could go along if my gf will go.\n\nI think that my gf's bf(G) would mind and its fine with it if I wont be able to celebrate with them. but I'm not sure if my gf would get hurt/mad/jealous if I would choose to go with bros. last week my gf has been mad at me cuz I said i wouldn't go with her cuz she would have her bff go with her if i wasn't available (i was joking that i wouldn't go with her)  and said that i would go with the bros then she got hurt and got mad at me. then, while we were walking home she waited for the bros to get as far as possible before we walk cuz i think she doesn't want me to focus on them and she want me to focus on her(even tho i was walking with her and all of my attention to her)\nso going with her to celebrate her bff's birthday party would make it up to her.\n\nI think that is possible to go to both party cuz my bro's(A) would celebrate at 3pm till night and i think I could go there after. but i am not sure what time my gf's bff (G) party would end.\n\ntl;dr: Should I go with my gf and her bff's(mutual friend) birthday party or should I go with the bro's birthday party with my circle on it? (which i kinda felt i didn't belong anymore, cuz' I think I've been spending too much time with her. and 1 friend has been ignoring me) think I'm not relevant anymore to both sides, but i think they will be happy if i go. \n\nany advice?? I don't want any of them to get mad or jealous for choosing the other.\n\nany advice?? I don't want my bro(A) or my gf(N) to get mad at me for choosing the other.",
        "created_utc": 1678520560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me [17 M/F] with my gf [16 /F] should i go with my gf's bff birthday party? --- **tl;dr**: having a hard time to choose if i should go with my gf or bros",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11odxzf/me_17_mf_with_my_gf_16_f_should_i_go_with_my_gfs/",
        "text": "[removed]",
        "created_utc": 1678520158,
        "upvote_ratio": 1.0
    },
    {
        "title": "my bf is abusive and his friends hate me",
        "author": "livelaughlovvee",
        "url": "https://www.reddit.com/r/relationships/comments/11odty9/my_bf_is_abusive_and_his_friends_hate_me/",
        "text": "tl;dr\n\ni’m (f21) and my boyfriend (m23) is really abusive towards me and hits me n stuff when he’s mad and then apologises, forces me to sex n stuff like that. the typical narcissistic manipulative shit just so u know how he treats me. and i sometimes overhear him on the phone with his friend and they’re talking n his friend goes ‘yeah i don’t think you’ve found ‘’the one’’ yet’ like?? i know we’re obviously not meant to be but i’m literally right here? i can hear you? so that kinda hurt, especially since my bf is the one treating ME like shit. i haven’t done anything to them? or to him?? idk if they even know what he does to me or if they just don’t care bc they’re the same?\n\nand yesterday i overheard their conversation again and his friend said something similar like shut the fuck up? i just wanna break up w him, i’ve been trying to for ages now but he’s like ‘no’ and makes it so hard for me to leave, he gaslights me so hard i just wanna cry.\n\ni wanna have someone that treats me well and who’s friends are good to me as well?? like all i’ve been doing is BE A GOOD PERSON but no one appreciates it",
        "created_utc": 1678519773,
        "upvote_ratio": 0.99
    },
    {
        "title": "my bf is abusive and his friends hate me",
        "author": "livelaughlovvee",
        "url": "https://www.reddit.com/r/relationships/comments/11odtks/my_bf_is_abusive_and_his_friends_hate_me/",
        "text": "[removed]",
        "created_utc": 1678519733,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am very conflicted about my relationship. I now have thoughts of cheating.",
        "author": "Ambitious-Movie7144",
        "url": "https://www.reddit.com/r/relationships/comments/11odt2r/i_am_very_conflicted_about_my_relationship_i_now/",
        "text": "I’m very conflicted about my relationship of 11 months. I’m a 22 M, she’s a 22 F. I don’t know what to do and have begun to have thoughts about cheating. I know I would never allow myself to do it, but just the fact that I’m having these thoughts is making me feel lost and unhappy. I do love her and care about her but I really am very split here and have thought about breaking up a few times, but have never reached a point where I'm 100% ready to break up. Maybe part of that is I don’t want to hurt her. Here are my reasons to stay and reasons to leave. Would you stay in the relationship or leave? I appreciate any advice given to me and I really do want to do what is right.\n\n**Reasons to stay**\n\n1. I do love her which is the biggest reason I haven’t left her already.\n2. She has a great sense of humor and we click in the comedy department.\n3. We have a lot in common and I honestly feel like it would be hard to find someone I share as much in common with as I am definitely a complete nerd.\n4. She is very kind and sweet when she is in a good headspace.\n5. Everything checks out in the bedroom.\n6. We both genuinely care about each other.\n7. She is very good and generous to me and always puts my wants first when it comes to anything.\n8. She isn’t clingy and gives me my alone time when I need it (something I value a lot and have had issues with in past relationships)\n9. She would never try to hurt me on purpose. While she does hurt me it’s always due to her mental state and never due to intentional actions.\n\n**Reasons To leave**\n\n1. The biggest reason which is broken down below is her mental/emotional health.\n2. This is a huge reason. She tells me I can do better than her. Initially I didn’t believe it but the more she says it the more I feel it. She definitely has bad self-esteem issues.\n3. She is definitely more into me than I am into her.\n4. She is not the most emotionally stable and frequently lashes out and emotionally explodes/breaks down which leads to fights. I try my best to calm her down and sometimes I am able to. A lot of times when I tell her “let’s calm down first and talk about it when we are both in a clear and calm state” she pushes for the argument and I give in and eventually fight back. She promises she will get better but this is all recurring. I definitely believe she has past trauma she hasn’t dealt with and refused to go to therapy.\n5. She has said a few times she self-sabotages the relationship sometimes, it has to do with her not being comfortable in a relationship as she has unresolved issues from past relationships.\n6. Although most of the time we share together is enjoyable, when it gets bad it gets very bad. Usually ever 2 weeks there is an issue she causes.\n7. This is a selfish reason but also the least important reason, but I honestly could do better looks wise. While I do think, she’s cute, I am starting to develop a wandering eye and do find myself more attracted to other girls frequently.\n8. I’m not sure if this is a selfish reason or not. I’ll leave it for you to decide. She lost her pet over a year ago which is truly sad and I do have sympathy, but she talks about her pet all the time to an unhealthy and uncomfortable degree. I can’t say anything about it, because I don’t want to be rude. I didn’t mind it at first, but after months of being together the topic has never ceased to come up whenever we are together. I believe she just has a difficult time with moving on from a lot of things in her past.\n9. I don’t know if I see a long-term future with her.\n\n**Gray area**\n\n1. She has very few friends and I have a very large and close friend group. Almost all of her friends now are from my friend group. And she deeply appreciates that my friends welcomed her into the group. I’d feel terrible if she went back to having no friends but if we broke up I’d definitely not stay friends with her and my friends would definitely not speak with her anymore as well.\n2. She really is very happy with me and deeply appreciates everything I do for her. She knows she messes up a lot and is very grateful that I have stuck around this long and been here for her. When she says she is getting better, asks me to trust her and give her time to change I want to believe her, but it's getting hard to.\n\nTL;DR; : There are many pros, but the biggest con is her mental/emotional health.",
        "created_utc": 1678519683,
        "upvote_ratio": 1.0
    },
    {
        "title": "my bf is abusive and his friends doesn’t like me?",
        "author": "livelaughlovvee",
        "url": "https://www.reddit.com/r/relationships/comments/11odsbv/my_bf_is_abusive_and_his_friends_doesnt_like_me/",
        "text": "[removed]",
        "created_utc": 1678519601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out my (26F) boyfriend (32M) complains on Reddit about how I don’t make as much money as him",
        "author": "ThrowRAbfwkholic",
        "url": "https://www.reddit.com/r/relationships/comments/11odrxi/found_out_my_26f_boyfriend_32m_complains_on/",
        "text": "\nMy boyfriend and I have been dating for a little more than a year. In short, he’s the first guy I’ve ever felt like I might seriously marry. He treats me so well, things feel easy and exciting, and I feel like we’re intellectual and personality equals with similar values, or so I thought. \n\nAbout me: I’m 26 and finishing my BA degree this semester. I did a lot of start/stop with school due mostly to the fact that I prioritized working over my education. A matter of fact, as valuable as I see education, I’m only completing my degree to raise the ceiling on my career prospects. While going to school full time, I also work full time in an admin role in the field I plan on staying in. I’ve been offered higher positions before (even ones they want a bachelors for), but have made it clear that I don’t want to take on managerial responsibilities and time commitments until I finish this degree; I’m already spread thin as it is. Once I’m done, it’s full speed ahead career-wise, and I feel pretty confident about securing a higher level position given my established years of experience and newly updated education. I’ve explained this to my boyfriend. \n\nAbout him: it’s maybe important to note that my boyfriend is first gen from an Asian family. He lives and breathes academic and career validation, and his family places a great deal of pressure on him. He is the classic definition of a workaholic, which isn’t a huge issue for me because we are both extremely busy and the time we do spend together is quality- plus we talk regularly throughout the day. His dedication to his career is something I love about him, and he’s been very successful with a high-level position. He’s also completing his MBA in a fully-employed program and is VERY passionate about finance and financial security, things I admittedly know little to nothing about, but have never been unwilling to learn. \n\nThe issue: Without going into how I found it (I didn’t snoop through his phone, swear), I found his Reddit account. It wasn’t anything alarming until I saw he made a post asking for advice about me. Essentially, he used words like “intelligent, selfless, amazing” to describe me, and then went on to say that he is concerned I don’t have enough “drive” to have a better career. In this post, he didn’t claim it was about money. It was jarring for me, but I chose to let it go. He’s allowed to have concerns and voice them “anonymously” if it helps him. \n\nHowever, this past week, he made another post in a financial independence subreddit. This time, he made it about money. He outlined how much money he makes (which I’ve never even asked him), how much he thinks I make, and expressed concern that we wouldn’t be able to have kids with our income (which, mind you, would be a combined $300k). He said he wants to retire early and I don’t have that “fire” in me to go further. He said his decision to propose to me hinges on this issue. He also conveniently left out that I’m still in school, so I was confused why he would seek out anonymous advice if he was going to omit that key detail. Not only that, he’s never actually talked to me about this, even though it’s obviously an issue for him. I even asked him if he has an issue with my current job after he kept bringing up the lucrative careers of his friends’ partners and he said no. I gave him an opportunity to talk to me about it on a silver platter.\n\nThe comments were pretty negative towards him- telling him his priorities are completely wrong and that he’d be dumb to give up a solid partner in exchange for a more high-earning one. I’m now doubting my entire relationship with him; I wonder if he sees me as inferior to him, or what he would want our future to look like should we ever get married. I always planned on having a career- I never planned on being financially reliant on my husband or a SAHM. I don’t know how he’d expect things to work with having kids or building a real life together if both of us are stretched thin workaholics. I want to raise my kids, not hand them to a nanny the moment they pop out. More importantly, I don’t want a partner who puts a dollar amount on my worth to him or secretly looks down on me because I don’t make as much money as him. I do get the feeling he’s more concerned about status than he is about financial security, which is unappealing to me. I come from a pretty privileged background, my dad is a doctor, but I don’t get joy from having feelings of superiority over other people. \n\nFrankly, I feel like shit. I’m stressing out with work and midterms while also tending to my basic needs and this relationship, and his post just made me feel like none of it will ever be enough. I feel like I’m spiraling and letting it get in my head- crying on and off and can’t sleep. It’s just making things more stressful. My hands are tied and I don’t know what else I can do at this moment. It makes me feel unworthy. It’s even more strange to think that if I hadn’t seen his Reddit, I would have NO clue he feels this way.\n\nShould I confront him about this? Should I just leave him with the knowledge that he sees himself as superior to me? Should I just get over it or wait to see if he brings it up? I don’t know if I’ll be able to keep this knowledge in and move past it, especially when I know it’s been on his mind enough to make multiple posts about it. I’m so afraid that even when I take the next career step, it still won’t be enough. How should I handle this?\n\nTLDR: My boyfriend has posted on Reddit several times complaining that I don’t make as much money as him or have a better career even though I’m still in school. He hasn’t talked to me about this at all. How do I move forward?",
        "created_utc": 1678519561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out my (26F) boyfriend (32M) complains on Reddit about how I don’t make as much money as him",
        "author": "ThrowRAbfwkholic",
        "url": "https://www.reddit.com/r/relationships/comments/11odmwf/found_out_my_26f_boyfriend_32m_complains_on/",
        "text": "[removed]",
        "created_utc": 1678519041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. Just found out the girl (f24) I’m dating isn’t a virgin, but I (m25) am.",
        "author": "throwra-yx2",
        "url": "https://www.reddit.com/r/relationships/comments/11odmk6/help_just_found_out_the_girl_f24_im_dating_isnt_a/",
        "text": "\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m tired of being made fun of for being a virgin. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678519004,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am very conflicted about my relationship. I now have thoughts of cheating.",
        "author": "Ambitious-Movie7144",
        "url": "https://www.reddit.com/r/relationships/comments/11odmdk/i_am_very_conflicted_about_my_relationship_i_now/",
        "text": "[removed]",
        "created_utc": 1678518985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. Just found out the girl I’m dating isn’t a virgin, but I am.",
        "author": "throwra-yx2",
        "url": "https://www.reddit.com/r/relationships/comments/11odm2o/help_just_found_out_the_girl_im_dating_isnt_a/",
        "text": "[removed]",
        "created_utc": 1678518952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm extremely conflicted about my relationship and am developing thoughts of cheating.",
        "author": "Ambitious-Movie7144",
        "url": "https://www.reddit.com/r/relationships/comments/11odkou/im_extremely_conflicted_about_my_relationship_and/",
        "text": "[removed]",
        "created_utc": 1678518816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me 21 (F) &amp; my boyfriend 21 (M) broke up without wanting it. I want him to just come back",
        "author": "Traditional_Jury_901",
        "url": "https://www.reddit.com/r/relationships/comments/11odfje/me_21_f_my_boyfriend_21_m_broke_up_without/",
        "text": "Me 21 (F) &amp; my boyfriend 21 (M) broke up without wanting it. I want him to just come back\n\nWill he ever come back?\n\nHe's the one for me. I love him. Nobody knows him like I do, he tries to show himself as this bad man because he thinks that's easier for the person to hate him so that he won't be in his life anymore. He thinks he ruins people. His experience with people is not good. This has been his defense mechanism, he will suffer in silence. I know him like he doesn't even. Only if he could see himself through my eyes. So I'll get better, I'll be a complete individual &amp; then I'll fight for my love.\n\n\n Make him believe he's not a bad man, give him a forever home. He might think, still since my end note is to fight for me, I will not get better &amp; I will not work on myself &amp; be complete but that's the thing about love, right?! You don't let go of love. So I'll be a better person &amp; then love him all over again. Somewhere I feel like he will never come back, &amp; that hurts me so much but i just can't give up on him, you know, he saved my life, taught me how to live. I love him so damn much, I know he does as well but he's so stubborn that he won't accept that fact or come back ever because he thinks he'll ruin me. \n\n\nHe deserves patience, utmost care &amp; people who don't give up on him based on this facade of his, Because he's a good man, a troubled man but good man. People don't get love let alone true love. I got mine, the one &amp; lost him due to impatience, &amp; less strength, because I was immature. I'm extremely lucky that someone like him loves me so much, cares so deeply to let me go, I'll respect his decision. Be better and a complete human being for myself because I need to fight &amp; care for myself &amp; then be there for him. Even if he ever falls out of love with me, I'll keep supporting him from the shadows. I didn't take his hand to let him go. \n\n\nI'm gonna keep my promises till my last breath because I meant every one of it. \nBoth of us love each other, but he made me break up with him because I was getting too consumed with him but that's how I love, every emotion I feel, I feel too intensely.  I've been down lately, &amp; we have been having constant fights, me asking for the bare minimum &amp; a lil more &amp; him stressed about balancing that with his career &amp; life. He gives in more efforts for a  few days &amp; go back to the new normal, he tries but he can't. Even few hours back he hugged me, told me I'm the best thing to ever happen to him but staying with changed me, I'm not ME anymore. But he doesn't know the ways he saved me, I was getting ME back with his love, support. Since I have been down feeling down about us, feeling lonely even being in a relationship, he mistook it as him ruining me, his experience with people ain't good &amp; everyone didn't see him for who he was, misjudged him, called him the bad guy, he suffered in silence but never bothered a soul.\n\n\n I know him. People don't get love, let alone true love, I got mine, the one, &amp; I'm not giving up , I'll keep fighting for him. \n\n\n\n\n\n\n\ntl;dr e 21(F) &amp; my boyfriend 21(M) has been together for 10 months now, though it has been just 10 months, we have gone through thick &amp; thin together but still stayed with each other.Men of Reddit, any insights that could help me?",
        "created_utc": 1678518304,
        "upvote_ratio": 1.0
    },
    {
        "title": "need advice. should i go with my gf?",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11oddde/need_advice_should_i_go_with_my_gf/",
        "text": "[removed]",
        "created_utc": 1678518093,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I go with my gf or the bros",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11odcl0/should_i_go_with_my_gf_or_the_bros/",
        "text": "[removed]",
        "created_utc": 1678518029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overthinking or does he not like me anymore?",
        "author": "lerlune",
        "url": "https://www.reddit.com/r/relationships/comments/11od995/am_i_overthinking_or_does_he_not_like_me_anymore/",
        "text": "[removed]",
        "created_utc": 1678517713,
        "upvote_ratio": 1.0
    },
    {
        "title": "bros or hoe?",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11od8nu/bros_or_hoe/",
        "text": "[removed]",
        "created_utc": 1678517651,
        "upvote_ratio": 1.0
    },
    {
        "title": "bros or hoes?",
        "author": "Lonewalkerz2",
        "url": "https://www.reddit.com/r/relationships/comments/11od69e/bros_or_hoes/",
        "text": "[removed]",
        "created_utc": 1678517413,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23F) need help moving on after a violent meltdown",
        "author": "Slow-Wonder-6416",
        "url": "https://www.reddit.com/r/relationships/comments/11od3bt/i_23f_need_help_moving_on_after_a_violent_meltdown/",
        "text": "[removed]",
        "created_utc": 1678517119,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting special occasional gifts for my partner, and she seems to forget to get any for me?",
        "author": "Useful_Ambassador_28",
        "url": "https://www.reddit.com/r/relationships/comments/11oczuv/i_keep_getting_special_occasional_gifts_for_my/",
        "text": "I (M23) am in a new relationship with a F23 and it’s going great. No red flags, no anxiety.\nBut one thing has been confusing me a bit.\n\nOn multiple occasions, she’s said she has a gift for me, including on Christmas and valentines. I got her some Christmas gifts and valentines gifts as well, wrapped them up with a card, and have them to her. She liked them, but didn’t have anything in return. \nI personally don’t really want or need or feel owed anything in return - and gift receiving is a bit awkward for me and one of my least important love languages. I much prefer giving gifts, and deep down probably prefer just spending time with my partner as the gift I receive.\n\nBut it’s just super confusing, as she says she left her gift for me at work and will get it later, or asks for my pants size. Then nothing happens. Again I don’t want anything, but I feel it’s odd and that I’m missing something.\n\nWe were talking to a mutual friend the other day and I mentioned how much I like writing hand written cards to people, and noticed my gf get quiet and lost in thought. I thought  she might feel guilty, so I specified how I like sending letters and stuff to family and people abroad randomly as I wasn’t talking about gifts and such. So now I feel like I’m over thinking things when I really don’t see it as a big dead, and am thus turning to Reddit for advice! \n\nAm I missing something? Does she maybe want me to ask her about gifts? Does she think I wouldn’t appreciate them since I’m not bringing it up either way? I’m trying to be a supportive boyfriend and am still learning, so I’d love to hear your thoughts.\n\nTLDR: Girlfriend keeps mentioning she has gifts for me for holidays but then doesn’t bring it up again. I have no expectation for gifts and am more than okay being the giver, but am confused If I’m missing something",
        "created_utc": 1678516769,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my gf clothes but she says she won’t look at them the same after I put it on other people",
        "author": "CallMePineTree",
        "url": "https://www.reddit.com/r/relationships/comments/11oczmr/i_made_my_gf_clothes_but_she_says_she_wont_look/",
        "text": "[removed]",
        "created_utc": 1678516745,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: domestic violence. My (26f) abusive ex-husband (28m) is engaged. Should I warn her (19f)?",
        "author": "whale-whale",
        "url": "https://www.reddit.com/r/relationships/comments/11ocyut/tw_domestic_violence_my_26f_abusive_exhusband_28m/",
        "text": "He was awful to me. We married too young - I was 20. When he had me trapped in marriage, a switch flipped and he became increasingly violent. He threatened to kill me. He broke my wrist. He was incredibly manipulative. He isolated me from friends and family. He was found guilty of DV in criminal court - if you know anything about US law, you know that is not easy. \n\nBad idea, I know, but I randomly googled him and found their wedding registry. She’s a child. What do I do? \n\nTl;dr my abusive ex husband is engaged. Should I warn her?",
        "created_utc": 1678516664,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: domestic violence. My (26f) abusive ex (28m) is engaged. Should I warn her (19f)?",
        "author": "whale-whale",
        "url": "https://www.reddit.com/r/relationships/comments/11ocpk8/tw_domestic_violence_my_26f_abusive_ex_28m_is/",
        "text": "[removed]",
        "created_utc": 1678515739,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: domestic violence. My (26f) abusive ex (28m) is engaged. Should I warn her (19f)?",
        "author": "whale-whale",
        "url": "https://www.reddit.com/r/relationships/comments/11ocnmh/tw_domestic_violence_my_26f_abusive_ex_28m_is/",
        "text": "[removed]",
        "created_utc": 1678515555,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish I had a car :( I need advice please",
        "author": "fatoumataaa28",
        "url": "https://www.reddit.com/r/relationships/comments/11ocm0r/i_wish_i_had_a_car_i_need_advice_please/",
        "text": "[removed]",
        "created_utc": 1678515394,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many/how frequent fights in a relationship does it take to break up?",
        "author": "unemotionals",
        "url": "https://www.reddit.com/r/relationships/comments/11ociwe/how_manyhow_frequent_fights_in_a_relationship/",
        "text": "Me [23F] and bf [32M] of over 2 years have had a rough 2nd year of our relationship. We’re working on stuff now, but we were broken up for a month.\n\nAnyways it’s been 2 months since we’ve been back together and things were really perfect for the first month, but tbh the 2nd month is going to shii…. We’re devolving into old patterns, he’s really stubborn, and doesn’t really ever seem to understand me, or if he does, it doesn’t seem like he cares.\n\nObviously I’m not perfect either, I’m in therapy but a lot of my problems stem from when I bring up an issue to him,\nI’m very critical and passive aggressive. Therapy has kind of helped, but honestly I lack self control in the moment. \n\nThe fights are once again starting to get more and more frequent, and I’m finding myself overly stressed again. I also know I don’t want to live this way forever, I’m just not sure how to tell if it’s the end…? \n\nI know he really loves me and cares about me, he shows me in different ways. He has his sh**ty traits, just like I do, but man, I’m finding it hard to stand him. Staying over at his place on weekends is starting to make me uncomfortable and stress me out. \n\nWhen is it time to accept it’s time to move on, and how do you tell? I feel like if I end it, I possibly missed out on something that might have turned into a really good &amp; fulfilling relationship again? \n\nTLDR: Fighting a lot the 2nd month after getting back with my bf of 2 years after a break up. I’m very critical and passive aggressive, he does shit that pisses me off and feels like I shouldn’t be mad over it, causing me to be even more hostile cuz i’m invalidated. Is there hope?",
        "created_utc": 1678515086,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "TotalCalligrapher211",
        "url": "https://www.reddit.com/r/relationships/comments/11oci3k/question/",
        "text": "[removed]",
        "created_utc": 1678515011,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a long distance relationships",
        "author": "TotalCalligrapher211",
        "url": "https://www.reddit.com/r/relationships/comments/11ocfea/i_have_a_long_distance_relationships/",
        "text": "[removed]",
        "created_utc": 1678514739,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-x2",
        "url": "https://www.reddit.com/r/relationships/comments/11ocf19/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "\nI already know this sub is full of inconsiderate assholes so I probably won’t get much help but it’s whatever.\n\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m tired of being made fun of for being a virgin. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678514707,
        "upvote_ratio": 1.0
    },
    {
        "title": "overthinking and separation anxiety",
        "author": "Revolutionary-Sock18",
        "url": "https://www.reddit.com/r/relationships/comments/11occek/overthinking_and_separation_anxiety/",
        "text": "[removed]",
        "created_utc": 1678514465,
        "upvote_ratio": 1.0
    },
    {
        "title": "(20M) boyfriend won’t accept break up (19F)",
        "author": "ThrowRApizzaCrust",
        "url": "https://www.reddit.com/r/relationships/comments/11oc6at/20m_boyfriend_wont_accept_break_up_19f/",
        "text": "I am trying to break up with my boyfriend who I have been in a 2 year relationship with. It is long distance only met in school afterwards nothing. Never seen him outside of high school I’m in my second year of college now and nothing. After I brought up the breakup he started saying he can’t live without me and how we can fix things between us. But I just don’t want to do it anymore.\n\nI just don’t think I can continue on like this. The moment I told him I was done with it he suddenly said he wanted to fly out to meet my parents and try to make things right. He has never met my parents and frankly he never wanted to meet them to begin with. I never told my parents about my relationship because i knew my mother would say I was stupid for putting myself in a relationship like this and mention how I was wasting my time. He’s trying to convince me to tell my parents about me and him but to be honest I don’t want to because i feel completely done with him. Suddenly when i don’t want anything to do with him anymore he wants to fix everything. He keeps mentioning how he needs me and how he wants to be with me. But i dont want to be with him anymore. I feel like the both of us have wasted each others time and deserve something better. I have told him this however, he’s hell bent on saying that i haven’t wasted his time. I feel like i have. I just don’t want this anymore. At all.\n\nHe started saying a lot of suicidal things. Like if I leave him he’ll be miserable. He’s trying to find solutions to make the relationship work and honestly I’m feeling guilty now. Guilty because I’m scared of what he’ll do to himself. I also feel like he’s trying to make the relationship last longer however if it continues I’ll drive myself crazy. I don’t know what to do. My mental health is in shambles and him saying all these cryptic things is adding onto my guilt. It’s making me want to stay but only in fear that he’ll do something to himself.\n\nPlease help what do I do.\ntl;dr: boyfriend won’t accept breakup, I feel miserable and want to end this.",
        "created_utc": 1678513891,
        "upvote_ratio": 1.0
    },
    {
        "title": "M 18 gf broke up with me after over a year of dating",
        "author": "TabMaster69",
        "url": "https://www.reddit.com/r/relationships/comments/11oc5xn/m_18_gf_broke_up_with_me_after_over_a_year_of/",
        "text": "[removed]",
        "created_utc": 1678513857,
        "upvote_ratio": 1.0
    },
    {
        "title": "(20M) boyfriend won’t accept break up (19F)",
        "author": "ThrowRApizzaCrust",
        "url": "https://www.reddit.com/r/relationships/comments/11oc503/20m_boyfriend_wont_accept_break_up_19f/",
        "text": "[removed]",
        "created_utc": 1678513771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend cheated while we were exclusive but not yet official, should we stay broken up?",
        "author": "soupymoopy",
        "url": "https://www.reddit.com/r/relationships/comments/11oc4eg/boyfriend_cheated_while_we_were_exclusive_but_not/",
        "text": "My (ex) boyfriend and I started dating in November 2022. I am 25F and he is 26M (and currently a family doctor medical resident). In December 2022, we agreed that we were exclusive. We both got our STI tests done so that we could begin having unprotected sex together. Come mid-January 2023, he went out of town and stayed with a friend. After going out to the bar with his friends, he came back with a girl and had sex with her on his friend's couch. He said it wasn't originally his intention, and that his friends had brought her and her friends back to continue the party. But eventually, around 4am, only her and him were left awake and he decided to initiate having sex with her. He said that after they had started having sex and he realized what he was doing, he felt very guilty, got soft, and the sex ended. He drove her home early the next morning. That morning, he had texted me at 8am telling me about a detailed \"wild night\" he had, leaving out the cheating. \n\nOnce he came back to town a few days later, we had unprotected sex together, as usual. He didn't suggest using a condom and he didn't get re-tested for STIs since having had sex with the random girl from the bar - taking the chance of risking my heath to keep his secret because he decided the risk was minimal. At this point we had been dating for 3-months so I pushed that we needed to make the decision of whether we were going to put a label on us, or go our separate ways. He had assumed up until this point that we wouldn't get this far. However, after some deep conversations, we decided to take the next step together and became officially boyfriend and girlfriend in February 2023. At this point, he had never had a serious girlfriend before and had only seeked out casual FWB relationships before me. He didn't think we would likely end up becoming official, but serious feelings ended up developing for him. \n\nNow, in March 2023, I started having suspicions that he had a secret. I asked him, \"is there something you need to tell me?\". Eventually, he started crying and admitted that he cheated on me in January while we were suppose to be exclusive. He said he couldn't remember if he used a condom. I was horrified and immediately broke up with him and went to go get an STI test done the next day. After a few days, I reached out to him to get answers and he said he does remember the whole thing and that he did use a condom. So, that implies that he wasn't that drunk and he clearly knew better. He said that he doesn't understand why he did what he did, that he is extremely remorseful, and now realizes that he loves me - a feeling he had never experienced for a romantic partner before. \n\nI feel extremely betrayed that not only did he cheat on me and not immediately tell me, but that he also took the chance in risking my sexual health because he didn't want me to find out. As a doctor, he felt that the risk of him having contracted an STI was minimal, and therefore my risk was minimal. \n\nAt this point, we are broken up. He is currently seeking therapy and wants to do everything in his power to make it work. I don't know what to do. On one hand, I believe his feelings are genuine for me and our relationship once it had become official had been amazing - as for teh cheating, we weren't technically official yet and he assumed it wouldn't work out when he did it. But on the other hand, he disrespected me while we were exclusive and made a decision about my health on my behalf. \n\nTL;DR: What is reasonable to do? I feel pathetic that I am even considering giving him another chance, should he make progress in therapy.",
        "created_utc": 1678513709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I wrong to be upset? F20/m21",
        "author": "Jumpy-Bug-4062",
        "url": "https://www.reddit.com/r/relationships/comments/11oc1gc/am_i_wrong_to_be_upset_f20m21/",
        "text": "I've been with my boyfriend for a little over two years. I had to use his laptop one day and he left his reddit comments open. I found out that he's been posting in subreddits looking for conversations with females while telling me he's sleeping and basically ignoring my messages. He's claiming he's looking for friends in the posts but in his comment/post history he does not mention being in a relationship at all. We lost our virginity together and he even says he's still a virgin in a comment (which is obviously a lie). He's also talking about being lonely in life and not trusting anyone, but what about me? \n\nI don't really understand why he's doing this...our Relationship is pretty solid or so I thought. He struggles with mental health issues and I've tried my hardest to keep us both afloat during everything. \n\nHe has a more feminine energy so i understand why he would gravitate towards females as friends but why go about it like this? \n\nIdk how to handle it. Do I ignore it? Do I bring it up? I wasn't snooping and intentionally seeking this out as it was open when I turned the laptop on. \n\nI just feel like I don't know who this person is that he's portraying himself to be online\n\nTL;DR - my boyfriend of 2 years is seeking females companionship online and hiding it from me",
        "created_utc": 1678513433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend cheated while we were exclusive but before we were official, should we stay broken up?",
        "author": "soupymoopy",
        "url": "https://www.reddit.com/r/relationships/comments/11oc0ap/boyfriend_cheated_while_we_were_exclusive_but/",
        "text": "[removed]",
        "created_utc": 1678513321,
        "upvote_ratio": 1.0
    },
    {
        "title": "18 m Gf broke up with me yesterday after over a year of dating",
        "author": "TabMaster69",
        "url": "https://www.reddit.com/r/relationships/comments/11oc09k/18_m_gf_broke_up_with_me_yesterday_after_over_a/",
        "text": "[removed]",
        "created_utc": 1678513318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong for me to be upset? F20/m21",
        "author": "Jumpy-Bug-4062",
        "url": "https://www.reddit.com/r/relationships/comments/11oc04v/is_it_wrong_for_me_to_be_upset_f20m21/",
        "text": "[removed]",
        "created_utc": 1678513305,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i get back w my ex or should i js let it go?",
        "author": "Bubbly_Ad7269",
        "url": "https://www.reddit.com/r/relationships/comments/11obzjw/should_i_get_back_w_my_ex_or_should_i_js_let_it_go/",
        "text": "[removed]",
        "created_utc": 1678513250,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m unhappy in my relationship and have no idea how to voice it",
        "author": "demon_jaz",
        "url": "https://www.reddit.com/r/relationships/comments/11obykg/im_unhappy_in_my_relationship_and_have_no_idea/",
        "text": "[removed]",
        "created_utc": 1678513157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partner [34M] doesn't save photos of me [34F] that I send him",
        "author": "JayJLeas",
        "url": "https://www.reddit.com/r/relationships/comments/11obrbp/partner_34m_doesnt_save_photos_of_me_34f_that_i/",
        "text": "I [34F] have been in an LDR with my partner [34M] for 3 years now, and it's difficult but worth it. I feel like I often get upset by stupid things these days that wouldn't even matter if he wasn't half a world away. I wish I wasn't so emotional.\n\nMost recently, I found out that he doesn't save the photos I send him, basically at all. I save every photo he sends me, even if it's not of him, because I love him, and that's part of loving someone in my mind. I struggle to even get the nerve up to send him photos because I have low self-esteem, but I figure surely he'd want to see me as I always want to see him. But I guess he doesn't? He said he doesn't feel the need to save them. But it really hurts. I feel rejected, and I guess it doesn't help that he barely reacts or responds to photos unless prompted, and most recently, when I asked him if he wanted a photo, he declined. \n\nI'm honestly not sure what advice I'm even looking for... maybe just how to stop being so sensitive to perceived rejection or not be so emotional over stupid stuff? TIA.\n\nTL;DR: LDR partner doesn't save photos I send him because he thinks it's unnecessary, and I feel hurt.\n\nPlease, no anti-LDR rhetoric or suggestions we break up. Thank you.",
        "created_utc": 1678512484,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [34F] partner [34M] doesn't save photos of me I send him",
        "author": "JayJLeas",
        "url": "https://www.reddit.com/r/relationships/comments/11obo6s/my_34f_partner_34m_doesnt_save_photos_of_me_i/",
        "text": "[removed]",
        "created_utc": 1678512182,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (16m) girlfriend (15f) has completely changed",
        "author": "Specific-Print-5507",
        "url": "https://www.reddit.com/r/relationships/comments/11obmgq/my_16m_girlfriend_15f_has_completely_changed/",
        "text": "Just for some backstory me and her have been dating for almost eleven months now. Growing up she's went through a lot and because of that she has trouble opening up and communication. Also, near the beginning of our relationship she became really distant because she said she realized she loved me but believed she didn't deserve it, so she was distant. She stopped being distant after a month or two and we fell in love even more. It was amazing and we did so much together, until a month or two ago. She had a falling out with her ex best friend and her best friend told her that I had talked about breaking up with multiple times, even though I hadn't. For a day she almost completely disappeared and we talked about it that night and she told me what happened. We talked about it and she realized it wasn't true and I thought it'd be normal again but it wasn't. She went from wanting to be together whenever possible, wanting to call even when I couldn't talk to just to sleep on call together to going ghost for the night most of the times I ask to call, not answering if I call most of the time, and just not texting me much at all. At school, I feel like her last choice to be with and if we are together it doesn't really feel like she's listening to what I'm saying. We have hung out a few times during this time period and it's been nice, it's felt like it used to. I did try talking about this with her and she said wants alone time sometimes, and promised she'd tell me when she wants it, but she has yet to do that. She just tells to me to go with my friends nearly everytime we're together at school and if I ask why she gets mad. This past week I've been trying to be able to talk to her about this, and she always can't. She's out of town for the weekend, and I asked to at least maybe call to talk about this because it's taking a large toll on me and I've been hurting a lot. She told me she needs to talk as well, but wants to in person. I'm so afraid of losing her. She was my first almost everything and is my entire world. I don't know what to do, I'm hurting and feel so lost. Advice and tips on how to deal with my anxiety and emotions until I see her again would be awesome.\n (I'm sorry for the formatting I'm on mobile and and it's very laggy)\n\nTLDR: girlfriend has completely changed with me after falling out with best friend, don't know what to do",
        "created_utc": 1678512017,
        "upvote_ratio": 1.0
    },
    {
        "title": "In my Feelings",
        "author": "Head_Term2973",
        "url": "https://www.reddit.com/r/relationships/comments/11objxu/in_my_feelings/",
        "text": "[removed]",
        "created_utc": 1678511794,
        "upvote_ratio": 1.0
    },
    {
        "title": "I, (19F) am worried the way I love people is toxic.",
        "author": "Mundane-Sir-7206",
        "url": "https://www.reddit.com/r/relationships/comments/11objbn/i_19f_am_worried_the_way_i_love_people_is_toxic/",
        "text": "[removed]",
        "created_utc": 1678511737,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it normal that my girlfriend doesn't want to talk about a bad day",
        "author": "BrotherZike",
        "url": "https://www.reddit.com/r/relationships/comments/11obizy/is_it_normal_that_my_girlfriend_doesnt_want_to/",
        "text": "[removed]",
        "created_utc": 1678511716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me 21 (F) &amp; my boyfriend 21 (M) broke up without wanting it. I want him to just came back. I love him.",
        "author": "Traditional_Jury_901",
        "url": "https://www.reddit.com/r/relationships/comments/11obidu/me_21_f_my_boyfriend_21_m_broke_up_without/",
        "text": "Will he ever come back?\n\nHe's the one for me. I love him. Nobody knows him like I do, he tries to show himself as this bad man because he thinks that's easier for the person to hate him so that he won't be in his life anymore. He thinks he ruins people. His experience with people is not good. This has been his defense mechanism, he will suffer in silence. I know him like he doesn't even. Only if he could see himself through my eyes. So I'll get better, I'll be a complete individual &amp; then I'll fight for my love.\n\n\n Make him believe he's not a bad man, give him a forever home. He might think, still since my end note is to fight for me, I will not get better &amp; I will not work on myself &amp; be complete but that's the thing about love, right?! You don't let go of love. So I'll be a better person &amp; then love him all over again. Somewhere I feel like he will never come back, &amp; that hurts me so much but i just can't give up on him, you know, he saved my life, taught me how to live. I love him so damn much, I know he does as well but he's so stubborn that he won't accept that fact or come back ever because he thinks he'll ruin me. \n\n\nHe deserves patience, utmost care &amp; people who don't give up on him based on this facade of his, Because he's a good man, a troubled man but good man. People don't get love let alone true love. I got mine, the one &amp; lost him due to impatience, &amp; less strength, because I was immature. I'm extremely lucky that someone like him loves me so much, cares so deeply to let me go, I'll respect his decision. Be better and a complete human being for myself because I need to fight &amp; care for myself &amp; then be there for him. Even if he ever falls out of love with me, I'll keep supporting him from the shadows. I didn't take his hand to let him go. \n\n\nI'm gonna keep my promises till my last breath because I meant every one of it. \nBoth of us love each other, but he made me break up with him because I was getting too consumed with him but that's how I love, every emotion I feel, I feel too intensely.  I've been down lately, &amp; we have been having constant fights, me asking for the bare minimum &amp; a lil more &amp; him stressed about balancing that with his career &amp; life. He gives in more efforts for a  few days &amp; go back to the new normal, he tries but he can't. Even few hours back he hugged me, told me I'm the best thing to ever happen to him but staying with changed me, I'm not ME anymore. But he doesn't know the ways he saved me, I was getting ME back with his love, support. Since I have been down feeling down about us, feeling lonely even being in a relationship, he mistook it as him ruining me, his experience with people ain't good &amp; everyone didn't see him for who he was, misjudged him, called him the bad guy, he suffered in silence but never bothered a soul.\n\n\n I know him. People don't get love, let alone true love, I got mine, the one, &amp; I'm not giving up , I'll keep fighting for him. \n\n\n\n\n\n\n\ntl;dr Me21(F) &amp; my boyfriend 21(M) has been together for 10 months now, though it has been just 10 months, we have gone through thick &amp; thin together but still stayed with each other.Men of Reddit, any insights that could help me?",
        "created_utc": 1678511659,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-lone1",
        "url": "https://www.reddit.com/r/relationships/comments/11obhgl/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "I already know this sub is full of inconsiderate assholes so I probably won’t get much help but it’s whatever.\n\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m tired of being made fun of for being a virgin. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678511567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me 21 (F) &amp; my boyfriend 21 (M) broke up without wanting it. I want him to just come back",
        "author": "Traditional_Jury_901",
        "url": "https://www.reddit.com/r/relationships/comments/11obgbd/me_21_f_my_boyfriend_21_m_broke_up_without/",
        "text": "[removed]",
        "created_utc": 1678511458,
        "upvote_ratio": 1.0
    },
    {
        "title": "unsure what to do now any help? m25 struggling with gf25 who has cheated in the last year",
        "author": "Active-Beginning7395",
        "url": "https://www.reddit.com/r/relationships/comments/11obfcf/unsure_what_to_do_now_any_help_m25_struggling/",
        "text": "[removed]",
        "created_utc": 1678511375,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know if i’m still in love with my (19) Girlfriend (20)",
        "author": "Numerous_Advice2529",
        "url": "https://www.reddit.com/r/relationships/comments/11obde6/i_dont_know_if_im_still_in_love_with_my_19/",
        "text": "We've been dating over a year now, and i love talking to her, but it seems we've been drifting apart lately, and i'm really not sure if i'm still in love like i used to be. Is this just a stage you got through or what? \n\nI'm so close to her family and my family loves her, i don't want to breslin her heart because i know how much she loves me. But i also don't want her to be with me if i don't love her anymore. It scares me to death to think about leaving her and it makes me want to cry every time. But i don't have the same spark anymore, and im also not sexually attracted to her anymore at all.\n\n(we don't live together)\n\n TL:DR idk if im still in love with my girlfriend of 1.5 years, do i stay or leave?",
        "created_utc": 1678511193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me 21 (F) &amp; my boyfriend 21 (M) broke up without wanting it. I want him to just come back",
        "author": "Traditional_Jury_901",
        "url": "https://www.reddit.com/r/relationships/comments/11obcqj/me_21_f_my_boyfriend_21_m_broke_up_without/",
        "text": "[removed]",
        "created_utc": 1678511127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know if i’m still in love with my (19) Girlfriend (20)",
        "author": "Numerous_Advice2529",
        "url": "https://www.reddit.com/r/relationships/comments/11obckc/i_dont_know_if_im_still_in_love_with_my_19/",
        "text": "[removed]",
        "created_utc": 1678511114,
        "upvote_ratio": 1.0
    },
    {
        "title": "myself m25 unsure what to do with f25 who is my partner for the last 9 years who has cheated in the last year",
        "author": "Active-Beginning7395",
        "url": "https://www.reddit.com/r/relationships/comments/11obcdy/myself_m25_unsure_what_to_do_with_f25_who_is_my/",
        "text": "[removed]",
        "created_utc": 1678511099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there loyalty within relationships nowadays with todays society?",
        "author": "Expert_Leg2575",
        "url": "https://www.reddit.com/r/relationships/comments/11obacz/is_there_loyalty_within_relationships_nowadays/",
        "text": "I (24M) am wondering this question on \"if loyalty exists within relationships\" because of past relationships I have been a part of. It seems to be the new \"Normal\" on people cheating within relationships and having the \"Grass is Greener around the corner\" syndrome of wanting something new and fresh each time. I find that a 3–4-month relationship is hard to gain, and a year relationship is a very long time and rare.\n\nI put Lifestyle down because it is now a different normal than old relationships that do not have to deal with dating apps.\n\nI find that woman that are willing to settle down, have a relationship and potentially want to start a marriage/life is hard to come by nowadays. Hopefully that is not the case.\n\ntl:dr Is there woman that are still loyal within this new dating lifestyle?",
        "created_utc": 1678510916,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (32M) accidentally proposed to my girlfriend (29F) while sleep talking. She said yes and now she’s planning our wedding. I don’t know how to tell her the truth",
        "author": "throawaycowcat",
        "url": "https://www.reddit.com/r/relationships/comments/11ob9bx/i_32m_accidentally_proposed_to_my_girlfriend_29f/",
        "text": "Hi everyone, I’m sorry if this sounds unbelievable but I really need some help. I’ve been dating my girlfriend for three years and we live together. She’s amazing and I love her very much.\n\nBut here’s the problem: I have a habit of sleep talking. Sometimes I say random things, sometimes I have conversations with myself or with her. She usually finds it amusing and records me for fun.\nBut a few nights ago, something terrible happened. Apparently, I asked her to marry me in my sleep. And she said yes. And she thought it was real.\nShe was so happy and excited that she didn’t question it or wake me up to confirm it. She just cuddled with me and fell asleep.\n\nThe next morning, I was in for some big news, and it was my own damn news. She had already called her parents and friends and posted it on social media. She had already started looking for venues and dresses and rings.\n\nI was speechless. I didn’t know what to do or say. I didn’t want to hurt her or break her heart. But I also didn’t want to marry her.\n\nDon’t get me wrong, I love her and I can see a future with her. But I’m not ready for marriage yet. It’s a huge commitment and responsibility that I’m not prepared for.\n\nI don’t know how to tell her the truth without ruining everything. How can I explain that it was a mistake? How can I make her understand that it doesn’t mean that I don’t love her? How can we go back to normal? Man I feel like I’m actually just screwed and there’s really no good outcome from this. I’m just trying to play some RuneScape.\n\ntl;dr: I accidentally proposed to my girlfriend while sleep talking. She said yes and now she’s planning our wedding. I don’t know how to tell her the truth.",
        "created_utc": 1678510839,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18F) think I'm too masculine for my guy friend (21M)",
        "author": "THROWRA-jizzgoblin",
        "url": "https://www.reddit.com/r/relationships/comments/11ob98n/i_18f_think_im_too_masculine_for_my_guy_friend_21m/",
        "text": "[removed]",
        "created_utc": 1678510830,
        "upvote_ratio": 1.0
    },
    {
        "title": "He(31M) thinks we have broken up, but not really. I(29F) am confused. Currently in NC now. I need advice.",
        "author": "Responsible-Spare757",
        "url": "https://www.reddit.com/r/relationships/comments/11ob6m1/he31m_thinks_we_have_broken_up_but_not_really/",
        "text": "*\\*long post ahead\\**\n\nMy (29F) boyfriend(31M) is Korean. I am a woman somewhere from the SEA. We are now 1 year and 1 month old.He has a business and ,I am a Juris Doctor degree holder, currently unemployed while waiting for the bar results to be released. I am currently unemployed because I thought I should enjoy the things I was not able to do during my review like driving school, netflix and etc. So compared to my boyfriend who works daily (except on weekends), I have so much time on my hands. For some maybe MBTI matters...I am an INTJ-T and he is an ENFP.\n\nI met my boyfriend in an app last December 2021. We became an LDR couple by January 2022. He came to my country around June of the same year to meet me. I promised to go to his country but at that time I was busy preparing for my bar exam.\n\nMy boyfriend is sweet and he shares lots of theories and scientific stuff with me. I appreciated it much as it was the first that  met someone who is not creepy. He was very vocal about his feelings and never failed to say ILY to me. I am an introvert and I have been with men who found it cringey whenever I try to express my love for them. So I felt relieved that my boyfriend did not feel that way towards me. Me and my boyfriend both got cheated on. And he is very vocal about his feelings of being cynical about everyone. And we were open about being married to each other. Personally, I am a person who has a mindset of “I date to marry.”\n\nMy Bar was in November of 2022. The whole month. By December, I planned to go to Korea. However, things happened and I got kicked out of the house. My money that was supposed to be for my Korean trip got depleted big time. I felt he was disappointed. Me too. We have not meet each other again since June of 2022. So we usually spend time watching netflix via a streaming site we we could talk to each other via audio or chat.\n\nJanuary 2023 came. I felt like he grew cold to me.I was alarmed at first but I thought maybe he was just busy with work.\n\nFebruary arrived and things got worse. He started acting mean to me sometimes, gave me sarcastic replies and has low tolerance whenever we argue.\n\nHe told me that if I really want to watch movies with him, I should just ask him if I really really want it. Before, I would ask him if he is free to watch with me. He would get annoyed a bit and would say WHY ARE YOU DOUBTING ME?YOU KNOW MY SCHEDULE. OF COURSE I AM FREE. Right now, while watching netflix, the mood would just change. I would feel like he is cranky or tired. And whenever I joke he would get mad. SO i stopped asking him to spend time with me sometimes. I thought maybe i should just wait for him to invite me to watch netlflix when he is a in a good mood.\n\nWe always argue about the small and big stuff. Sometimes, I would praise him and maybe because of language barrier, he would take it as an insult and get mad at me. My boyfriend has a good level of English. I am from a country where English is a second language and is often used more than the native one. So I tried to use simpler terms mostly.\n\nBefore, when he does not understand something, he would ask me for clarification. I would explain to him and he would understand it. No arguments at all. But now it feels like he became a war freak with me. One time I complimented him while we were watching a movie using a streaming app. After I gave him a compliment, he went silent. I am extra sensitive so I know what happens even though he is in Korea. So I asked him what happened. He merely replied with a NEVER MIND. I thought he really got angry with my innocent praise and maybe he misunderstood it so I tried explaining it to him. I sent my explanation and he replied with an IDC. I thought that was childish of him.\n\nBefore, when we would argue, we would fix the problem on the spot. Whenever he feels that I have a problem, he would tell me that I can always tell him whatever it is. As an introvert, I am so used to dealing with my problems all by myself. Even in my past relationships, the men were not worried enough to ask me how I feel. I felt happy because my boyfriend is thoughtful. However, in December of 2022, we had an argument while streaming a movie together. I told him I was feeling worried about something. He said that feeling was RIDICULOUS. It was the first time he told me that. Usually, he would be welcoming most of my thoughts and never gaslighted me.\n\nAfter that, I noticed he now has a low tolerance for entertaining my drama about life and about other people. He would say YOU ARE BEING NEGATIVE AGAIN or YOU ARE ALWAYS LIKE THAT. One time I told him how people around me would insult me right to my face. They would directly tell me negative comments and etc. Even people who I did not know insulted me. I told that to him. I thought I could get an emotional support from him. But he said THAT IS YOUR SUFFERING. YOU ARE ALWAYS PREDICTING THAT PEOPLE THINK NEGATIVELY OF YOU. Why am I predicting? Those people insulted me directly and verbally. I got disappointed.\n\nMe and boyfriend operate on a “routine basis”. There are specific hours where he would text and I would reply. In other words, predictable. We never failed to text everyday and watch Netflix every night after his work. For over a year that we were talking, I unconsciously memorized his routine. Maybe that is the same for him too. Last year, after studying, I fell asleep for 3 hours. When I woke up he was angry because I did not reply to him immediately. One time, I spent my whole afternoon editing my CV and resume for job hunting. He got mad because I did not reply immediately. Those happened while we were still 2 or three months in the relationship. I thought he was too clingy. To avoid dramas, I tried to reply to him as fast as I could.I would set my notifications at a higher volume.\n\nThis February, there were times he would deviate from his usual routine. As someone who got used to his schedule, I got curious at first. But then the deviation continued and I got worried. One time he texted me that he arrived home from his work after the afternoon of not talking to me. I asked him if he wants to watch Netflix. He did not reply and just sent Insta reels. I thought it was rude. I told him that it was rude because I did not receive any messages from him that afternoon and he would just ignore me without answering my question. I wanted an explanation for his behavior that night. But he called me as being OBSESSED about his time and life.I thought maybe at that time I should call him obsessed too for being angry with me numerous times in the past just because I did not reply for an hour or so. He said he got rly busy at work. It feels like whenever we argue, I lose my existence. He can ignore me for very loongggg hours now. No texts from 11Am until the evening.\n\nThe worse thing that had happened to him since February was he started accusing me of a lot of stuff. In my country, wifi being slow is a normal thing. So for a Korean who can download a movie within 30mins, that is weird. For us, in my country, it has already become a joke how our wifi or data can be real slow even if our wifi provider is the best one in the nation. So mostly, during our Netflix time, I would UNINTENTIONALLY go OFFLINE or LEAVE our streaming room because I got disconnected explained to him about the wifi situation in the country. One night I got disconnected. After a few minutes, the wifi got restored and I went back to the streaming site.I talked to him there but he did not reply even though he was still online.The next day, he ignored me the entire afternoon.He said he did not trust my excuse about my wifi disconnection and that I was just playing him.When I finally sent him a screenshot showing the disconnection, he just said OH with sad emoji. He ignored me for that only. I told him I got really hurt by what he did,for immediately thinking bad about me instead of asking me about what happened. He never apologized for it.\n\nEvery time I would reply late or deviate from the hours I would usually send him a reply, he would ask me if I was ghosting him. He does not trust me anymore I think.\n\nI couldn’t count anymore last February how many times I cried just because he ignored because of a thing that can be settled with a proper talk, or how many times I felt he expressed his distrust towards me, or how many times he accused me of doing things behind his back, or how many times he told me harsh stuff. I told him a lot of times that if he does not love me then he does not need to date me and that he should let me go. But he did not.\n\nLast Saturday, he told me how he trusted me more before and that he is having doubts about his future with me. I got annoyed by it. I felt fear. My degree is something that is inflexible when taken outside of my own country. He wants to move to Canada and I want live abroad too. That means I would be going with him. But the thing is, if I go abroad, job offers would be limited. If I want to put my law degree in use, I would have to start from scratch again or enroll in a university again. Moreover, I am an only child who is not close to her relatives. My parents are old now. That means I would be living in abroad all by myself with him.And I have a dream of building a happy family. My parents are annulled. So most of my life I have to spend events in two houses and whenever I graduate, I could only bring one of them on stage because they hate each other. So I want a different life where I can grow old with my husband.\n\nHe always told me before that I should stay with him. That is what I did. Even though I got insults from him, he treated me meanly sometimes or he accuses me of things,…I stayed. For someone like me who usually can cut ties easily once treated badly, I was surprised myself that I stayed long. I really want him. That I am sure of.So when he said he is doubting his future with me, I felt scared about the possibilities like being left alone in Canada, or being divorced by him, or being left to care for the children all by myself, or that I would regret that I would be sacrificing my bright future.\n\nThe next day (Sunday) he greeted me with a good morning as usual, sent insta reels like usual. I felt annoyed when I woke up. It feels like he was not concerned of what he said the night before about our future, while me…I did not know where to place myself. He just acted normally that day.\n\nAs an avid planner, I always think long-term. Going to Canada with him will not be an easy feat. *(Before I met him, I actually wanted to pursue Master's in Switzerland)* I did some research and it seems that I would be taking a year worth of law classes there again and be assessed by some Board to get accredited to practice law. I started looking for Canadian universities even. I was planning to move full force once I pass my bar this coming April. I was even preparing to review for the IELTS. And now he is saying he doubts his future with me? I just got really mad last Sunday. So I proposed that what if we start thinking about breaking up.\n\nHe does not trust me and he doubts his future with me, and yet he says he loves me and demands me to stay beside him. I promised to stay by his side but when he told me his doubts about our future together, is there really a reason for me to stay? I am gambling a lot of things while thinking of having a future with him and he is just acting like normal.\n\nI proposed that we should start thinking about breaking up. I explained my side as to how I want to fight for the relationship but I cannot do it alone if I am the only one trusting and thinking positive about our future. He just replied with a **DO WHATEVER YOU WANT**. It felt like he does not care if we’ll be together, and he does not care if we break up. I wanted us to have a heartfelt convo at the time. Should we break up or not? Discuss our sides, our thoughts, and what we want from each other. After much discussion, we can arrive at an agreement whether to really break up or not. But he just replied with a DO WHATEVER YOU WANT. For me, it reflected of how less he cares for our relationship. Because I got mad with his reply, I blocked him on Instagram. Before blocking him, our convo on insta was open-ended. No agreement as to whether we should break up or not.However, when I checked his profile, I honestly felt shocked when it showed that we automatically unfollowed each other and that I had to request to follow him again.I felt *OH SH\\*T*. I have been blocking people in the past, but I did not realize that that would be the effect since I don't visit the accounts of the people that I blocked before. I don't care much about the number of my FOLLOWS and FOLLOWERS so I really don't keep track of the numbers- whether they are increasing or decreasing. \n\nI thought, *\"Maybe I should leave it as it is. Maybe he will understand because he used to deactivate his accounts in the past too whenever we would argue.\"* I failed to see that BLOCKING is harsher than deactivation. \n\nAfter that I thought I should use the time away from him to think about our relationship. That Monday, I checked Insta again and his account disappeared; either he blocked me too or deactivated.So I sent a message using Imessage to ask if he was ready to talk about the proposal. He replied that he hopes I can find a new love and a bright future and to not remember him etc etc etc. At first, I got confused. We were just gonna talk about our thoughts about the proposal. I tried to tell him that we can talk and fix things to which he replied *I NEED TIME BY MYSELF.* I thought what he meant was he needs more time alone to think about my proposal. He said that if I say one more word, he will delete me and that he is suffering from the painful break up. That is where I understood what happened. Maybe he thought I was breaking up with him. And my blocking made his overthinking worse.\n\nI hurriedly replied to him that there is a misunderstanding and that there is no break up yet and that my proposal was just LITERALLY about thinking of the possibility to break up.But I dunno if he was able to read that message. I believe he has two phones. But until now (Saturday- 5 days after he thought I broke up with him) he has not replied yet.\n\nLast Monday, I just wanted to tell him about my decision about the possibility of breaking up. I wanted to tell him that we can still fix things and we can try continuing but we should realize our faults without gaslighting each other. But because of my proposal and my subsequent blocking, maybe he thinks we have broken up for good. The last message I sent to him on Imessage was telling him that there was a misunderstanding and that I will give him time and I will wait for him.\n\nI don’t know. I am confused as well. He thinks we have broken up, but on my part we have not yet. I am even confused as to whether am I the dumper or is he the dumper?I don’t know how long should I wait for him. My male friends told me to give him time to calm and if he really loves me much, he would talk to me. But I should be prepared for whatever he is going to say.\n\nI am worried because he thinks we have broken up. The only thing he has to do is to just move on. While on my part, I am not sure if I should just move on or wait for him.\n\nI am still on DELIVERED on Imessage. So he has not blocked me yet. His accounts on the streaming app are still there with the nicknames that I gave him as his usernames. His kakao account is still there with my avatar as his profile picture and a day counter ever since we became a couple (But I feel like he has another kakao account). We talked on insta more because we could send cat memes and cat reels easily.\n\nShould I let him have his time? Maybe because he thinks we have broken up, he would date someone else or he would realize that I am actually a NO GOOD for him? Or should I continue to find a way to reach out to him so he can cut his agony short about this \"break up\" and we can fix things immediately.\n\nTL;DR! We had a miscommunication. He thinks I have broken up with him. But I really did not. Now he is not talking to me and I don't know what to do.",
        "created_utc": 1678510594,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (24f) bf (22m) wants me to not spend money when we're together",
        "author": "strauubewii",
        "url": "https://www.reddit.com/r/relationships/comments/11ob66v/my_24f_bf_22m_wants_me_to_not_spend_money_when/",
        "text": "My bf and I are currently doing long distance. He plans to fly to my country in two months right after my nursing licensure test this coming May. I told him to please come in three months instead because I want to get a job right after my test and save up money for a month. I told him I won't be comfortable with him here without me having my own money. He plans to rent an airbnb, rent a car, spend a few nights in a dome 3 hours away, etc. I explained to him what if I spontaneously want to buy something I see. He went on to say \"then I'll buy it for you or I'll give you money.\" I don't know else how to convince him. I told him I'm not comfortable with it but he doesn't take it seriously. Any advice?\n\nTl;dr My bf wants me to not spend money when he goes to my country to be with me",
        "created_utc": 1678510556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will he ever come back?",
        "author": "Traditional_Jury_901",
        "url": "https://www.reddit.com/r/relationships/comments/11ob2qe/will_he_ever_come_back/",
        "text": "[removed]",
        "created_utc": 1678510234,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-dagger",
        "url": "https://www.reddit.com/r/relationships/comments/11oavit/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "\nI already know this sub is full of inconsiderate assholes so I probably won’t get much help but it’s whatever.\n\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678509587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arbitrum's Airdrop Guide for Beginners: Claiming Your Tokens Made Easy",
        "author": "WoodenMud1418",
        "url": "https://www.reddit.com/r/relationships/comments/11oas9k/arbitrums_airdrop_guide_for_beginners_claiming/",
        "text": "[removed]",
        "created_utc": 1678509296,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-restless",
        "url": "https://www.reddit.com/r/relationships/comments/11oaixo/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "I already know this sub is full of inconsiderate assholes so I probably won’t get much help but it’s whatever.\n\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678508470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I(31F) wrong for being angry at my ex(31M) for having his ex wife stay with him for a month while he grieves his dads death. Together 2 years",
        "author": "Itzpositivelysquishy",
        "url": "https://www.reddit.com/r/relationships/comments/11oaeis/am_i31f_wrong_for_being_angry_at_my_ex31m_for/",
        "text": "[removed]",
        "created_utc": 1678508069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I wrong for being angry at my ex for having his ex wife stay with him for a month while he grieves his dads death?",
        "author": "Itzpositivelysquishy",
        "url": "https://www.reddit.com/r/relationships/comments/11oacsm/am_i_wrong_for_being_angry_at_my_ex_for_having/",
        "text": "[removed]",
        "created_utc": 1678507907,
        "upvote_ratio": 1.0
    },
    {
        "title": "He’s going to the Navy:(( M(21) M (19)",
        "author": "ander999-",
        "url": "https://www.reddit.com/r/relationships/comments/11oacpo/hes_going_to_the_navy_m21_m_19/",
        "text": "[removed]",
        "created_utc": 1678507900,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-trustnoone",
        "url": "https://www.reddit.com/r/relationships/comments/11oabkw/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678507806,
        "upvote_ratio": 1.0
    },
    {
        "title": "aita - partner took my puppy and lied to me.",
        "author": "Paigemaviss",
        "url": "https://www.reddit.com/r/relationships/comments/11oa9xv/aita_partner_took_my_puppy_and_lied_to_me/",
        "text": "[removed]",
        "created_utc": 1678507659,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA",
        "author": "Paigemaviss",
        "url": "https://www.reddit.com/r/relationships/comments/11oa84o/aita/",
        "text": "[removed]",
        "created_utc": 1678507497,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21F) want to propose to my gf (22F)",
        "author": "Hot-Cryptographer358",
        "url": "https://www.reddit.com/r/relationships/comments/11oa82u/i_21f_want_to_propose_to_my_gf_22f/",
        "text": "[removed]",
        "created_utc": 1678507492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (40f) am feeling guilty because I refuse to lend my boyfriend (48m) any more money and he often doesn't have enough for food",
        "author": "Affectionate_Boot325",
        "url": "https://www.reddit.com/r/relationships/comments/11oa5hg/i_40f_am_feeling_guilty_because_i_refuse_to_lend/",
        "text": "We've been together for 5 years, but we don't live together (my choice....for a variety of financial issues). Background: he had an excellent career making very good money. He has a degree. I have a mediocre job making enough to get by (no degree).\n\n&amp;#x200B;\n\nI'm very far from a gold-digger (I'm actually pretty minimalistic and low maintenance). But for the first few years, he had lots of money and he's a spender. He always wanted to go out to eat or on vacations and since we were partners he wanted me to come with him, so he'd pay. For my part I helped him as much as I could around his house, etc. He's always been very bad with money (no savings, rents a big fancy condo, leases an expensive car, etc). I am good with money and have tried over the years to help but he doesn't ever listen.\n\n&amp;#x200B;\n\nLast year he decided he wanted to go back to school for a different degree (it will complement his current degree, but it wasn't \"necessary\"). I tried to suggest that he wait...that he save up money for tuition. That he have an emergency fund. Etc. He was adamant he was going to do it and that it would be very beneficial and that he didn't want to wait...he tends to be kind of impulsive. So he was determined to work and go to school, but that didn't work out. There just wasn't enough time, so now he doesn't have a job. He manages to scrape together enough by borrowing money from his parents and relatives, but it's definitely not enough.\n\n&amp;#x200B;\n\nI've helped him a lot. I've lent him thousands and I've bought him groceries, etc. He got rid of the fancy car but he still rents the condo (for now). But I do NOT make a lot of money and it's becoming a true drain on my finances to constantly be lending him money or paying for groceries for him or buying him dinner, etc.\n\n&amp;#x200B;\n\nHe's trying hard to find a part-time job (and he'll make good money...if he can find a part time job in his previous career) for while he goes to school. And he works HARD at school. I know this means everything to him. So I am feeling really shitty about refusing to lend him any more money. He practically begged me tonight and I said no...that I would buy him a meal tonight but I'm not lending him any money. I also have not given him my credit card number.\n\n&amp;#x200B;\n\nPlease give it to me straight. Am I being a horrible person? I CAN lend him money (as in I do have some money in the bank) but I'm just tired of it. He can't pay me back, and I don't make that much. Another source of irritation is the fact that he has, in the heat of arguments before, kind of put me down for not having a degree. So sometimes I don't really feel like lending him money that I make at my non-degree-requiring-job. But on the other hand he has been very generous with me in the past, and if in the future he makes good money again I know I'll benefit from it. \n\n&amp;#x200B;\n\nI just need some clarity here from an outside source please.\n\n&amp;#x200B;\n\ntldr: I don't want to keep lending my boyfriend money",
        "created_utc": 1678507269,
        "upvote_ratio": 1.0
    },
    {
        "title": "A work rumor might have ruined my relationship",
        "author": "fearthebravedog",
        "url": "https://www.reddit.com/r/relationships/comments/11oa32r/a_work_rumor_might_have_ruined_my_relationship/",
        "text": "My boyfriend (25m) and I (21f) are on terrible terms right now and I just don't know what to do, I have never been in a situation like this and am kind of freaking out. \n\nI work in a restaurant with a bar and am also in college. Our relationship is very good and healthy and I pretty much live with him. He is very sweet, funny, intelligent, and very hot. We have been together for 2 years, no major problems. We have had small problems that were easily solvable. \n\nThere is a guy(29m) at work that has been there for around 5 months. There is a group of friends I have at work who I hangout with sometimes after work. He is included in this group now and usually goes. He likes to flirt and has hit on me several times. I shut it down when he takes it too far. When we are at friend's houses he always wants to talk to me, sit next to me, touch me in 'joking' ways except when my bf is there of course. Someone gave him my number, or he may have gotten it from work somehow. He texts me every once in a while. Unless he asks me a specific question about something I ignore him. It is annoying sometimes but is not frequent. I have talked to my boyfriend about this. He will get upset about it sometimes but he never acts like that when bf is around. He has offered to talk to him. I told him not to, that I could handle it and it would just hurt me at work. He hadn't done anything, just doesn't like him. \n\nA few nights ago at work I had a break so I went to the walking to vape. He followed me and started talking to me while in there. He was sitting directly across from me. A guy we work with walked in and he had his hand on my leg. I didn't think much of this at the time because it wasn't that unusual. He would do something like this and I would tell him to stop, he would laugh about it and apologize. This has turned into a huge rumor at work that we are sleeping together. Someone told my boyfriend about this but it has been twisted into him being all over me or making out. \n\nLast night when I got home he accused me of cheating on him and sleeping with this guy and we got into a huge fight. I told him what actually happened and have been trying to convince him. He doesn't know what to believe right now. I can't blame him really when it is a rumor and he was told this. I gave him my phone and blocked him. I have offered to quit my job but he hasnt told me one way or the other but I don't want to go back to that place anyway. My boyfriend texted him and later they got into a screaming match. He told my boyfriend that he could have fucked me anytime he wanted to. I guess I am lucky he didn't lie and say we were since they were fighting. This is my first real relationship and I love him. I am scared of losing him over this or our relationship being permanently damaged. I don't know what else to do to convince him or how to fix this. Any advice on dealing with this and helping my relationship?\n\nTL;DR - there is a rumor going around work that I am sleeping with a coworker. It has gotten back to my bf and he accused me of cheating\n\nJust to be very clear we have never kissed or had sex ever",
        "created_utc": 1678507060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a sweet lady to talk to ,my fiance left me and our 11 month old baby",
        "author": "4twenty4life77",
        "url": "https://www.reddit.com/r/relationships/comments/11oa0d1/need_a_sweet_lady_to_talk_to_my_fiance_left_me/",
        "text": "[removed]",
        "created_utc": 1678506818,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-cash1",
        "url": "https://www.reddit.com/r/relationships/comments/11o9yu6/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "I’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678506687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worried About First Relationship",
        "author": "JustFeelingLost",
        "url": "https://www.reddit.com/r/relationships/comments/11o9x8u/worried_about_first_relationship/",
        "text": "Hello Reddit I need some advice right now.  I (23M) have recently entered my first ever relationship and I am suddenly feeling stressed out.  She (23F) identifies as a Biromantic Asexual and this is what is making me feel nervous.  I’m trying to figure out exactly what this means, she says that she does find me attractive but does not enjoy sex.  I’m a virgin and I have never felt insecure or bad about it, what made me insecure was the lack of a relationship in my life.  However sex is something I want to experience, since I don’t even know if I’d enjoy it or not.  I like being around her and after making out after a date I asked her to be my girlfriend in the heat of the moment and she said yes. Now I’m thinking I asked too early, the last thing I want to due is hurt her feelings.  I just feel really confusing, stressed out, and shitty at the moment.\n\nTL;DR: Just entered first relationship, girlfriend came out as biromantic asexual.  Nervous about what this means as a virgin and worried that I will end up hurting her feelings after just asking her to be my girlfriend.",
        "created_utc": 1678506555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gift Ideas for GF whose turning 30.",
        "author": "anannyap",
        "url": "https://www.reddit.com/r/relationships/comments/11o9umt/gift_ideas_for_gf_whose_turning_30/",
        "text": "[removed]",
        "created_utc": 1678506324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I leave her alone or try to make things work?",
        "author": "Jbarna21",
        "url": "https://www.reddit.com/r/relationships/comments/11o9tbn/should_i_leave_her_alone_or_try_to_make_things/",
        "text": "[removed]",
        "created_utc": 1678506218,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so unbelievably happy",
        "author": "Interesting-Pause162",
        "url": "https://www.reddit.com/r/relationships/comments/11o9rkm/i_am_so_unbelievably_happy/",
        "text": "[removed]",
        "created_utc": 1678506058,
        "upvote_ratio": 1.0
    },
    {
        "title": "At which point should a partners sudden desire to change their appearance become alarming?",
        "author": "illusionofallusion",
        "url": "https://www.reddit.com/r/relationships/comments/11o9p5a/at_which_point_should_a_partners_sudden_desire_to/",
        "text": "\nMy 30M bf and I 24F have been together 10 months now. \n\nLately he has spoken of wanting to take TRT and gain muscle which before this he always bragged about loving his natural ability to have gained what he has. He also has changed his hair recently and has began shaving his body hair again since when we first started dating last summer. \n\nI have no problem with him taking care of himself and even wanting to improve his test levels as he ages. But he kind of got lax on these things several months into us dating and stopped being so well kept and now suddenly wants to do all those things again, which again, is no big deal. \n\nMy question to others is when in a relationship should one be alarmed by a sudden desire to improve personal hygiene and appearance? Has this ever happened to anyone else? If so, what is the best thing I can do in this situation? Thank you!\n\nTLDR; my boyfriend has suddenly wanted to improve his overall appearance to include muscle mass and hair/body hair shaving. When is this normal in a relationship and when does it become a red flag?",
        "created_utc": 1678505851,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 years relationship",
        "author": "murniadi",
        "url": "https://www.reddit.com/r/relationships/comments/11o9n6c/5_years_relationship/",
        "text": "[removed]",
        "created_utc": 1678505682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nansnzn",
        "author": "Interesting-Pause162",
        "url": "https://www.reddit.com/r/relationships/comments/11o9m30/nansnzn/",
        "text": "[removed]",
        "created_utc": 1678505590,
        "upvote_ratio": 1.0
    },
    {
        "title": "breaks?",
        "author": "Great_Procedure1908",
        "url": "https://www.reddit.com/r/relationships/comments/11o9lx0/breaks/",
        "text": "[removed]",
        "created_utc": 1678505574,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-donn",
        "url": "https://www.reddit.com/r/relationships/comments/11o9i5y/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "\nI’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678505241,
        "upvote_ratio": 1.0
    },
    {
        "title": "I, 29 F found unsettling things in my boyfriend, 28 browser history.",
        "author": "No-Necessary608",
        "url": "https://www.reddit.com/r/relationships/comments/11o9f0g/i_29_f_found_unsettling_things_in_my_boyfriend_28/",
        "text": "[removed]",
        "created_utc": 1678504958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I text her back or play it cool and leave her alone?",
        "author": "Jbarna21",
        "url": "https://www.reddit.com/r/relationships/comments/11o9eqh/should_i_text_her_back_or_play_it_cool_and_leave/",
        "text": "[removed]",
        "created_utc": 1678504935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facebook block",
        "author": "Ok_Appearance3005",
        "url": "https://www.reddit.com/r/relationships/comments/11o95t4/facebook_block/",
        "text": "[removed]",
        "created_utc": 1678504187,
        "upvote_ratio": 1.0
    },
    {
        "title": "My coworker (21F) and I (21M) broke up, but I am bothered by how fast she moved on",
        "author": "exthrowaway4567",
        "url": "https://www.reddit.com/r/relationships/comments/11o952l/my_coworker_21f_and_i_21m_broke_up_but_i_am/",
        "text": "Myself (21M) and my ex-girlfriend (21F) broke up on 24th February, after long ongoing issues. These were mainly centered around the fact that she wanted to get married for religious reasons as soon as possible, which my parents were against as they wanted me to finish university first.\n\nWe both are part of an apprenticeship, where you study for a degree and work at the same time for what is essentially a 9-5 job. We met on the apprenticeship and became friends very quickly, leading to us getting together at the end of the first month.\n\nWe stayed together for a year and 4 months, due to the aforementioned issues, however we had broken up (unsuccessfully) a couple of times during the relationship due to either arguments or the situation mentioned before, where my parents didn't want me to marry so early and where I wasn't really on board with the whole marriage idea yet.\n\nWe finally made it official on 24th February, and we both were extremely sad. I wiped away her tears all day on that Friday and consoled her telling her it wasn't meant to be and that it would get better. We decided to remain friends, however, as we both moved to a small town and don't know too many people outside of the group of 6 mutual friends we have.\n\nI was meant to visit my parents last Friday (3rd March), however she asked me to stay as there was a party that Friday night and she wasn't feeling too good about going by herself as she still \"felt very raw\". Before the party even started, I was back at her house again wiping her tears away and consoling her for 2 hours, missing the beginning of the party but not minding doing so because she looked like she really needed me. She decided not to go to the party, which was fair enough, so I left her once she was fine and insisted for me to go and have fun there. I kept texting her all night asking if she was alright and if she needed me. \n\nI get back at 1am on Saturday and see that she is online on Snapchat, so I message her asking if she's alright and if she wants to call to talk about her feelings. I stay up for half an hour in case she responds, but even though she's online, she doesn't reply. I get a text when I wake up on Saturday from her asking about the party, and I start chatting to her. I told her that I asked her if she was fine last night and if she was purposely ignoring me, and then I found out that she was in fact on a call till 4 am with a guy she met on a dating app. \n\nOver the next few days, I found out she'd installed dating apps on the Tuesday (4 days after our breakup) and had been talking to a bunch of men on them. She said that it meant nothing and she was only doing it to help herself move on and she wasn't even looking to date at all as she wasn't anywhere near over me. I still felt very sad about this, as it had taken her so little time (in my eyes) after almost a year and 4 months together to install the dating apps and start chatting to other men. I know she didn't owe me anything and she was within her rights to do it, but it felt gut wrenching to realise that the entire relationship was only worth 4 days of sadness after it had ended, and that I was there wiping her tears away and being extra kind to her thinking that she was going through a lot whilst she had been on long calls with people she met through the app and was ignoring my checkups on her to chat to other people. I think what especially made me angry was the fact that she got me to cancel my trip back because she didn't want to be alone, only to not go to the party anyways and for me to have missed some of the party taking care of her only for her to be messaging and calling people whilst I was worried about her. \n\nOn Tuesday, I found out from her that she had arranged to go on dates with people, with one of them being this Sunday (12th March), despite her fully telling me that she wasn't in anywhere near the headspace to go on dates as she was so cut up about us. She also told me today that she was completely over me romantically.\n\nI know that she is well within her rights to do all of these things, and she owes me nothing as I'm not her boyfriend anymore, but the timescales of what happened really hurt me. I thought that the year and 4 months we spent together was worth more than 4 days of sadness and a week to plan dates and get over me. It might be because its my first relationship, but the timescales really cut me deep and made it feel like the relationship wasn't worth much if she's over everything so quickly. I feel irrationally angry at her, and I can't bear to see her at work as I've been doing the past week because all I feel is anger at how quickly she's gotten over a relationship I put my heart and soul into. I don't understand how I'm meant to work with her for the next year and a half until the apprenticeship ends.\n\nI would welcome any feedback or words of wisdom. Please be kind, this was my first relationship and I might be feeling this way purely because I had many firsts with her, and was planning to spend the rest of my life with her. I know I'm not owed anything by her, it just hurts.\n\nTL;DR: My ex and I broke up recently after a year and 4 months. It makes me angry how it took her only 4 days to download dating apps, and only a week to plan dates with other people, especially whilst I've been going out of my way to console her about the end of the relationship and give her a lot of time and support when she feels sad about us.",
        "created_utc": 1678504119,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) a virgin. She (f24) isn’t. Now I want to break up.",
        "author": "throwra-waitgame",
        "url": "https://www.reddit.com/r/relationships/comments/11o92gy/im_m25_a_virgin_she_f24_isnt_now_i_want_to_break/",
        "text": "I’ve been this woman for the past couple months. I’m new to dating. She isn’t. She’s been with as many as fifteen guys. When I found this out, I lost hope in the relationship. I already had doubts about finding anybody on my timeline due to being late. This only confirms it. I’m pretty sure every girl in my age range has been with multiple guys so it’s no point in trying. I may as well give up and save myself the time and trouble. I don’t feel like being compared or having to worry about it. I’m also upset that almost everyone else has got to have fun except me. I’m not going to therapy as it’s for weak people. This relationship was pretty much over the moment she told me that. I’ve come to the conclusion that I’m either going to be with another virgin or nobody at all. \n\nTL;DR - She isn’t a virgin so I want to break up.",
        "created_utc": 1678503901,
        "upvote_ratio": 1.0
    }
]