[
    {
        "title": "Maybe I overreacted",
        "author": "numbercrunch420",
        "url": "https://www.reddit.com/r/relationships/comments/11r8pps/maybe_i_overreacted/",
        "text": "[removed]",
        "created_utc": 1678806622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe I overreacted?",
        "author": "numbercrunch420",
        "url": "https://www.reddit.com/r/relationships/comments/11r8n5w/maybe_i_overreacted/",
        "text": "[removed]",
        "created_utc": 1678806468,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (27F) friends don't want me dating. Is this excessive?",
        "author": "robynhood96",
        "url": "https://www.reddit.com/r/relationships/comments/11r8m3r/my_27f_friends_dont_want_me_dating_is_this/",
        "text": "For context: I am single for the first time since I was 19 and a sophomore in college. I dated a man for six years until Oct 2021 when I finally broke it off because the relationship turned severely toxic due to his addiction issues (he is now sober and we are still good friends, I'm very proud of him). Not even a week later, I slept with someone I knew in middle school/high school and we spent all our time together and 3 months later (Feb 2022) we were in a relationship. He was a bare minimum boyfriend and even though he was nice and kind, didn't really treat me the way you should. All my friends encouraged this relationship and said it would be good for me. In Nov 2022, he broke up with me and although it was for the better I was obviously heart broken. It's been 3.5 months and I am thriving. I've lost 23lbs, died my hair, doing great at work &amp; social life and finally saving money.   \n\n\nHere is where the issue comes in. My friends aggressively don't want me to entertain the thought of anything potentially romantic OR sexual with any male (girls are okay since I am bisexual and never got to explore that side of my sexuality). They are constantly telling me I need to be alone for a year or more, that I must be single and I need to learn to be alone and love myself first and foremost out of a relationship. These are ALL women in their mid to late 20s. None of my guy friends have echoed this sentiment.   \n\n\nThat is all fine and dandy to me. I have no desire to date anyone right now. I do not want a relationship and honestly it would take a LOT for anyone to get me to even consider committing to them again. I have a lot of trauma to work through from my childhood and toxic relationship.   \n\n\nThe issue comes where, to me, it feels almost controlling and overly aggressive from some of my friends. For example, I downloaded some dating apps cause I was bored and when someone messaged me something wildly gross and inappropriate, I immediately screenshot it and sent it to my group chat to laugh about. Most friends laughed but my one friend immediately lectured me for even opening a dating app and told me I shouldn't even have them on my phone and I need to delete my profile (mind you, I don't actually go on them nor am I actively trying to meet someone -- sometimes I'm bored idk how to explain it). When my friends found out I had a one night stand, half of them were excited for me and the other half were disappointed I even slept with someone and pursued anything sexual. I was asked out on a date recently and most of my friends told me that I need to say no and I shouldn't be going on any dates, whatsoever. That again, I need to be alone and need to be single for a year or more.   \n\n\nI do want to be single but I don't see an issue going on a date with someone especially an old friend I reconnected with and I know is a good person. If I went on a date with anyone right now, I would be very upfront that I do not want anything serious but if something slowly naturally progresses I don't want to stop it. I understand where they are coming from but it has now got to the point I don't even want to tell them what is going on in my life and god forbid I actually develop a crush on someone, they would not be happy and would be very disappointed in me.   \n\n\nI now feel like I am making choices based on not upsetting my friends versus what is best for me. What are your thoughts? Is this normal? Or am I just being stupid?   \n\n\nIt feels like a lot of pressure to me and it's stressing me out.  \n\n\nTL;DR - My friends aggressively don't want me dating and I understand their reasoning but it feels controlling.",
        "created_utc": 1678806400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe I'm overthinking things?",
        "author": "numbercrunch420",
        "url": "https://www.reddit.com/r/relationships/comments/11r8lxf/maybe_im_overthinking_things/",
        "text": "[removed]",
        "created_utc": 1678806390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I (28f) gravitate towards emotionally unavailable men/taken men?",
        "author": "snowpiuh",
        "url": "https://www.reddit.com/r/relationships/comments/11r8kbw/why_do_i_28f_gravitate_towards_emotionally/",
        "text": "I understand what I’m doing is wrong. I’m really not looking to be judged in that sense. \n\nWay back almost 10 years ago I met my most recent BF at university. He had a gf, but we still hung out and things. We stopped talking, a few years later reconnected and started dating (he was single). During the time of us dating, we had A LOT of ups and downs. We had broken up for a little etc. I started casually seeing a guy who was in a relationship. He treated me well. But it was just more of a causal sex kinda thing and hangout once a weekend. That ended for obvious reasons. I don’t have any friends really, so the lack of interaction now with him hurt. \n\nNow, I have a friend who is married. We have so much in common. Basically the same person but male vs female. His relationship isn’t the best intimacy wise and I kind of fill that void for him. I seen him intimately maybe once a week. We talk almost everyday too. He’s very sweet to me. He helps me with my problems. He talks highly about me. I’ve definitely caught feelings and I know nothing will come of that because he’s married and has kids. \n\nI just feel like it’s a cycle for me and I don’t intend for this to happen. I don’t seek them out. I would obviously want to be with someone who is able to want me back. But it never seems to happen. I don’t want to always be the other women, but this seems to be the men that actually want to talk to me and spend time with me. \n\nI set myself up for heartbreak time and time again and I don’t know how to break this cycle. \n\nTl; dr - I seem to attract the attention of taken men and am always the other woman",
        "created_utc": 1678806296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling despair over someone it ended with months ago",
        "author": "latteconnoisseur",
        "url": "https://www.reddit.com/r/relationships/comments/11r8hyo/feeling_despair_over_someone_it_ended_with_months/",
        "text": "So I (21F) matched with this guy (22M) on a dating app a few months ago (August) and we went on a date and the conversation was good but I was very iffy about him, but then he just ended it (September). At first I really didn't feel sad at all but then starting about 2 months ago I have not been able to stop wondering about him. I keep wondering if maybe with more time I would've come to like him, if he would've been an amazing boyfriend, if I just didn't have the right mindset, and there's been a lot of self-blaming about it ending, wondering what I did wrong and micro analyzing every single thing I did. I never got real answers on why it ended and I think that's why I've been blaming myself a lot. How do I stop myself from ruminating on and wondering about him? How do I stop the self-blaming and learn to just give myself closure and acceptance? I don't have a way to contact him, and I don't think I want to contact him. I know I need to remind myself that we were only 1 date in and I can't know what long-term with him would've looked like. I do have a lot of anxiety around dating in general (Haven't dated anyone before, haven't even held hands before) and I wonder if that caused me to unintentionally push him away and it scares me that I'm just going to keep doing that with every guy who comes along. \n\n&amp;#x200B;\n\nTL;DR: I've started thinking about someone from bumble months after it ended, and blaming myself for him leaving.",
        "created_utc": 1678806145,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend(20M) wanted to break up with me after I (20F) complained about him being friends with his ex, any opinion?",
        "author": "Ok_Key5750",
        "url": "https://www.reddit.com/r/relationships/comments/11r84rw/my_boyfriend20m_wanted_to_break_up_with_me_after/",
        "text": "[removed]",
        "created_utc": 1678805321,
        "upvote_ratio": 1.0
    },
    {
        "title": "why didn't she [f25] ever travel with her bf [m29]?",
        "author": "eternaldeepblu",
        "url": "https://www.reddit.com/r/relationships/comments/11r82f6/why_didnt_she_f25_ever_travel_with_her_bf_m29/",
        "text": "I have this friend and we went on a vacation recently, and she revealed that she had never gone on a vacation before..\n\nShe had a boyfriend for a few years, both worked and had decent enough jobs to support living on their own... they wanted to travel, but never did in the few years they dated.\n\nAnd I know they love traveling, had some friends who would let them stay with them.\n\nIs there something I'm missing? Curious why financially they wouldn't ever be able to travel.\n\ntl;dr wondering why they never took any sort of vacation; my friend never traveled until i invited her on a vacation.",
        "created_utc": 1678805166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just broke up with my girl of one year, probably getting back together friends greatly disappointed.",
        "author": "Unusual-Law-6073",
        "url": "https://www.reddit.com/r/relationships/comments/11r821p/just_broke_up_with_my_girl_of_one_year_probably/",
        "text": "[removed]",
        "created_utc": 1678805142,
        "upvote_ratio": 1.0
    },
    {
        "title": "why didn't she [f28] ever travel with him [m29]?",
        "author": "eternaldeepblu",
        "url": "https://www.reddit.com/r/relationships/comments/11r8119/why_didnt_she_f28_ever_travel_with_him_m29/",
        "text": "[removed]",
        "created_utc": 1678805084,
        "upvote_ratio": 1.0
    },
    {
        "title": "why didn't she ever travel?",
        "author": "eternaldeepblu",
        "url": "https://www.reddit.com/r/relationships/comments/11r8073/why_didnt_she_ever_travel/",
        "text": "[removed]",
        "created_utc": 1678805031,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend(20M) and his ex-girlfriend are still best friends, and he wanted to break up with me after I (20F) complained",
        "author": "Ok_Key5750",
        "url": "https://www.reddit.com/r/relationships/comments/11r7zeo/my_boyfriend20m_and_his_exgirlfriend_are_still/",
        "text": "[removed]",
        "created_utc": 1678804978,
        "upvote_ratio": 1.0
    },
    {
        "title": "When going on a \"break\"?",
        "author": "tzopjal",
        "url": "https://www.reddit.com/r/relationships/comments/11r7y3s/when_going_on_a_break/",
        "text": "[removed]",
        "created_utc": 1678804898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ruined someone else 5 year relationship, I feel awful, what to do?",
        "author": "Cool-Butterscotch906",
        "url": "https://www.reddit.com/r/relationships/comments/11r7x7u/i_ruined_someone_else_5_year_relationship_i_feel/",
        "text": "[removed]",
        "created_utc": 1678804840,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend(20) and his ex-girlfriend are still best friends, and he wanted to break up with me after I (20) complained",
        "author": "Ok_Key5750",
        "url": "https://www.reddit.com/r/relationships/comments/11r7se1/my_boyfriend20_and_his_exgirlfriend_are_still/",
        "text": "[removed]",
        "created_utc": 1678804537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wedding Planning is destroying my relationship.",
        "author": "Turbulent_Tip_9806",
        "url": "https://www.reddit.com/r/relationships/comments/11r7m4i/wedding_planning_is_destroying_my_relationship/",
        "text": "This is going to be a long rant so please bare with me. I (26F) have been with partner (28M) going on 7 years. We are legally married but are planning our big wedding at the end of the year. My partner is from a different country and I was born and raised in the US. He makes significantly more than I do and is covering the cost of majority of the wedding. I have had helped from my father who is a single parent and the only parent that I have and my partner has covered the cost for the rest. I’ve pitched in for smaller things (Month of planner, engagement photos etc) I plan on covering the cost of some additional things in the future. I won’t mention my income but let’s just say my partner makes about triple what I make. We got into an argument about me not pitching in as much. I won’t disagree because I know I can do more and help with more but I’ve literally planned out this wedding with some of his help but I’ve been carrying the load also why working a FT job. I want to boost my income and help with more but i just feel like he’s not seeing what I’ve done and it’s just what I haven’t done. I feel like I have 2 jobs alone while planning this wedding.\n\nWe have been fighting over this wedding since we planned it and I’m becoming mentally and emotionally drained from everything. The planning, the differences, families opinions, money I’m just tired. When I try to have a conversation with him, it always ends up in an argument with his temper getting the best of him and we can go days without talking to each other. I really think he never truly listens when I explain to him how I feel and he never takes any accountability. The conversation always gets turned back on to me on what I did or didn’t do. \n\nI’m seeing a major shift in my mood and behavior. I feel like I’m loosing myself and loosing feelings for him on top of it. I get anxious by being around him sometimes and feel like I’m always on edge. I haven’t been in the best mental state all. I feel so alone in this marriage and spend most of my days just crying my eyes out. \n\nWe’ve tried therapy but he never seems like he’s into it. I’ve fought hard to make this work and have expressed my feelings a million times to him but he’s stone cold and it feels like he doesn’t care. I said to him this wedding feels extremely transactional and it doesn’t feel like we’re doing this out of love anymore. I’m getting to the point where I feel like I just want to walk away from all of this.\n\nTLDR: Planning my wedding is ruining my relationship with my partner.",
        "created_utc": 1678804148,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it mind blowing when they know they are home wrecking? 26F29M33f",
        "author": "Remote-Shirt1101",
        "url": "https://www.reddit.com/r/relationships/comments/11r7ku1/is_it_mind_blowing_when_they_know_they_are_home/",
        "text": "how do you feel when you know you are home wrecking? 26F29M33F\n\nGo to my profile and see my past post\n\n\n\nI dont think I would ever come over a married guy house at night and drink his whiskey and talk about my dating story with girls till midnight to get what I need\nI dont think I would ever invite a married guy into my place and cook and watch movie together and talk about my dating story till midnight. When I know they are even doing LDR\n\nBut 100%peoole said its my husband fault.\nU know ... men are men. And I know some people love attention from married woman/man.\n\nI just dont get why 33 years old woman with this reputation(have her male friends partners hate her) behave and act like this to break other relationships.\nI am completely speechless and lost ....\nMy relationship was fine until this thing happened. I didn't want a divorce lol. And... she's just being popular on SNS and gonna release her Netflix show soon.\nI cant do anything here in opposite country.\n I spent 3years and tons of money into this relationship and I am so sad lol\n\nTL;DR  do people feel catharsis when they know they are home wrecking other relationship?",
        "created_utc": 1678804062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it over between me and my gf?",
        "author": "lohexaj273",
        "url": "https://www.reddit.com/r/relationships/comments/11r7hg6/is_it_over_between_me_and_my_gf/",
        "text": "Long story short, she did something and I decided to get some space from her which was a bad idea. She didn't like not being spoken to. I know I fucked up. We talked and I was so prideful that I didn't just apologize and it got worse. She told me that she needed time to think about things and two weeks passed without any real contact. I contacted her again and she was busy with some important stuff and a lot understandable issues. She told me that she still wanted to talk so I waited. I waited again and two more weeks passed and I finally got in contact with her after texting her. We talked back and forth for like 3 messages about catching up, but then I texted her and I told her that I missed her. I haven't gotten a response back. She was super busy and I wanted to talk with her to help relieve her stress, but I think telling her that I missed her made her not want to talk to me because she might have felt like I added more stress. Should I call her? Are we done? I get a response text every two or three days. She doesn't usually take that long, but after I messed up, I only seem to get a response when she absolutely has nothing else on. Is that my hint to move on? I really don't want this relationship to end, but I'm not getting a response and I'm hurting bad. I wanted to send her a huge paragraph explaining how sorry that I am and that opened up conversation last time, but I feel like it will put me in a worse position because me being needy was part of the problem. I tried calling her like she asked me to, but she didn't answer.\n\nTL:DR My gf has had a real conversation with me in a month, after an argument. She's busy, but not busy enough to call or respond to a text. I want to save this relationship, but I'm not sure if she's already moved on. Should I call her or just let it go?",
        "created_utc": 1678803847,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you feel when you know you are home wrecking? 26F29M33F",
        "author": "Remote-Shirt1101",
        "url": "https://www.reddit.com/r/relationships/comments/11r7h43/how_do_you_feel_when_you_know_you_are_home/",
        "text": "[removed]",
        "created_utc": 1678803825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't do relationships, always end up in them",
        "author": "IvarTheBloody",
        "url": "https://www.reddit.com/r/relationships/comments/11r7gx6/cant_do_relationships_always_end_up_in_them/",
        "text": "Male 26, I literally cannot do relationships and I don't know why, yet every time I meet a girl I end up in one, rush into it head first then realise after a month that I can't stand relationships and all I want is to break up or hopefully get dumped.\n\nI met this great girl 2 month ago, she is honestly perfect, she's kind, gorgeous, actually genuinely loves me but all I can think about is how I absolutely hate the complete lack of freedom that comes with relationships.\n\nI like to do what I want to do without having to constantly think of somone else.\n\nI work a shit load, 40h a week job and doing uni full time, any time I do have is spent with her, sleeping with her, watching TV with her, going out drinking with her and her mates, I'm just so fucking done of having no alone time.\n\nI'm a total gym rat yet haven't been more than 3 times this month because I'm always with her, at work or at uni.\n\nIt's not just her though, I do this every time and have the same thoughts in every relationship I've ever had.\n\nIt doesn't help that I'm tall, pretty good looking and can talk shit for day's, all I really want is something nice a easy yet every girl I sleep with fucking falls for me.\n\nHell this girl was only meant to be a short term thing because by her own admission she doesn't do long term and was seing 4 other guys casually when she went on a date with me, next thing I know she's fucked the other guys off and says she loves me.\n\nHow do I fix this without hurting her? How do I stop getting in fucking relationships?\n\nI'm definitely to blame for half of it, every time I meet a girl I fall for her, tell her I love her too quickly, make plans for the future, talk about are life together.\n\nThen same as always after a month my brain catches up with my heart and I realise I'm a fucking idiot that doesn't do relationships.\n\nSo please, any advice would be much appreciated.\n\nTL;DR Need help, always fall head over heals, get in heavy relationships within weeks then realise after a month I hate relationships and all I want is my freedom back.",
        "created_utc": 1678803811,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the hell is wrong with me",
        "author": "IvarTheBloody",
        "url": "https://www.reddit.com/r/relationships/comments/11r7cbh/what_the_hell_is_wrong_with_me/",
        "text": "[removed]",
        "created_utc": 1678803508,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf [18M] threatens to hit me [18F] and I don’t know how to feel",
        "author": "Peeton_Jazzy",
        "url": "https://www.reddit.com/r/relationships/comments/11r74wa/my_bf_18m_threatens_to_hit_me_18f_and_i_dont_know/",
        "text": "Tl,dr: my boyfriend threatens to hit me when we get into heated arguments. He thinks threatening me makes things better, and me not agreeing with him means I don’t care about him \n\n\nI asked my bf if he could stop threatening to hit me during arguments. He told me \"no\" because in his opinion, I stop talking and actually listen to him when he threatens me. I told him it scares me and makes me sad when he does it, and he told me \"that is the point\". He claims he would never actually hit me, and tells me I've been watching too many movies. He also says he'd be understanding if I hit him, and \"you could hit me just as much as I could you\". (Even tho I've never thought about hitting him or even threatening him) Me pulling my hair out of anger when I was 7 is equivalent to him threatening me now, according to him. \"Pulling your hair, really? You don't know what you're capable of\"\nI told him that if he ever got physically violent, I would leave the relationship. He responded by telling me\n\"you always take the easy way out instead of trying to understand why you deserved to get slapped\"\nEventually he told me that he understands why I'd be scared, and then he got mad that I didn't understand his side of things.\n\"I did not feel like you were even listening to me even though I listened and agreed with you\"\n\"But you continue to invalidate me over something that hasn't happened\" (actually getting hit)\n\"Again you were too focused on how you felt about the matter of your own safety\"\n\"Which I get but not in a situation that hasn't happened yet\"\n\"I'm sorry\"\nI didn’t respond\nAn hour later he sent me heart emojis and asked to go to bed on a call together.\n\n.. I don't know if I was genuinely in the wrong here or not. I don't talk to people about my relationship cuz my boyfriend doesn't like it. But",
        "created_utc": 1678803017,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf [18M] threatens to hit me [18F] and I don’t know how to feel",
        "author": "Peeton_Jazzy",
        "url": "https://www.reddit.com/r/relationships/comments/11r74ky/my_bf_18m_threatens_to_hit_me_18f_and_i_dont_know/",
        "text": "Tl,dr: my boyfriend threatens to hit me when we get into heated arguments. He thinks threatening me makes things better, and me not agreeing with him means I don’t care about him \n\n\nI asked my bf if he could stop threatening to hit me during arguments. He told me \"no\" because in his opinion, I stop talking and actually listen to him when he threatens me. I told him it scares me and makes me sad when he does it, and he told me \"that is the point\". He claims he would never actually hit me, and tells me I've been watching too many movies. He also says he'd be understanding if I hit him, and \"you could hit me just as much as I could you\". (Even tho I've never thought about hitting him or even threatening him) Me pulling my hair out of anger when I was 7 is equivalent to him threatening me now, according to him. \"Pulling your hair, really? You don't know what you're capable of\"\nI told him that if he ever got physically violent, I would leave the relationship. He responded by telling me\n\"you always take the easy way out instead of trying to understand why you deserved to get slapped\"\nEventually he told me that he understands why I'd be scared, and then he got mad that I didn't understand his side of things.\n\"I did not feel like you were even listening to me even though I listened and agreed with you\"\n\"But you continue to invalidate me over something that hasn't happened\" (actually getting hit)\n\"Again you were too focused on how you felt about the matter of your own safety\"\n\"Which I get but not in a situation that hasn't happened yet\"\n\"I'm sorry\"\nI didn’t respond\nAn hour later he sent me heart emojis and asked to go to bed on a call together.\n\n.. I don't know if I was genuinely in the wrong here or not. I don't talk to people about my relationship cuz my boyfriend doesn't like it. But",
        "created_utc": 1678802999,
        "upvote_ratio": 1.0
    },
    {
        "title": "mental illness as an excuse?",
        "author": "Outrageous_Might8181",
        "url": "https://www.reddit.com/r/relationships/comments/11r736y/mental_illness_as_an_excuse/",
        "text": "[removed]",
        "created_utc": 1678802903,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf [18m] threatens to hit me [18f] and I don’t know if I’m wrong for being scared",
        "author": "Peeton_Jazzy",
        "url": "https://www.reddit.com/r/relationships/comments/11r70mu/my_bf_18m_threatens_to_hit_me_18f_and_i_dont_know/",
        "text": "[removed]",
        "created_utc": 1678802734,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ruined someone else 5 year relationship and I feel awful, what to do?",
        "author": "Cool-Butterscotch906",
        "url": "https://www.reddit.com/r/relationships/comments/11r6xij/i_ruined_someone_else_5_year_relationship_and_i/",
        "text": "[removed]",
        "created_utc": 1678802535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boundaries or controlling? Going to the club while being in a relationship",
        "author": "wonderful-unknown23",
        "url": "https://www.reddit.com/r/relationships/comments/11r6uhm/boundaries_or_controlling_going_to_the_club_while/",
        "text": "I (25F) have been dating my boyfriend (25M) for 3 years now and we are basically on the brink of a breakup and I am stuck trying to figure out what to do. Since we started dating he has always had an issue with me going out to the clubs without him because he thinks it’s a place I put myself in to get hit on by other men. As I’ve gotten older, the club scene just isn’t my thing anymore and the only time I really go out is when I go on vacations with my girl friends which he has an issue with. Anyway, we got into a huge argument because he says he has boundaries about me going out to the club without him because of men that would potentially hit on me and says my friends that I go out with are promiscuous and extremely flirty. Bc my friends that are single sometimes go home with people while we go out.\n\nJust flat out saying he doesn’t trust my friends that I go with and wants me to do more “mature” things while I’m out on vacation like going out to eat, the spa, etc. I have never given him a reason not to trust me, but he claims that I need to sacrifice that part of my life (going out) for our relationship to work bc according to him I didn’t sacrifice anything since we started dating. in my opinion, I think it is controlling &amp; insecure bc we are so young and I don’t go to the clubs every weekend just strictly on vacation. I think it’s such a silly think to break up over but he is adamant that he’s never going to compromise on this. He also explaining to me that to him cheating is also when another men buys me drinks bc he wants to be the one to provide it or even hanging out with a guy friend alone. I kept telling him it is almost insecure and not a boundary but he says he’s not budging on this. He kept telling me that I have destroyed his confidence, have given him extreme anxiety and that I broke him every time i went out and did that. Do you think we are doomed and should break up? Is this really a boundary or is he coming from a place of insecurity and control?\n\nTL;DR - boyfriend has an issue with me going to the club with my single friends on vacation and said it’s a boundary he has, but I think it’s controlling.",
        "created_utc": 1678802354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice - how to approach a guy short after he broke up with his ex (22F and 25M)",
        "author": "Special_Sentence_466",
        "url": "https://www.reddit.com/r/relationships/comments/11r6s4q/need_advice_how_to_approach_a_guy_short_after_he/",
        "text": "I (22F) know a guy described in the head for a year. First time we ever talked he had a girlfriend, but even then I felt something to him because the talk was awesome - but I never did anything with it back then.   \n\n\nLately we met again on a party and we shared a very honest, long talk about life where he confessed to me about breaking up and stuff, actually he's a person which fits me very much and, as I am a single woman, I started to think about him as a potential boyfriend or at least a partner, very close person - I just feel I want him close to me.   \n\n\nWe are chatting every day, sometimes talking on phone, but I feel he is kinda \"backed\", I don't know how to describe it, I feel as if he was not certain of my intentions maybe. I have no idea what can I do to make him sure that I do not want to do anything bad to him?   \nImportant - his ex cheated on him. That's why they broke up. \n\n&amp;#x200B;\n\ntl;dr I have strong feelings to a guy who's single after breaking up with a girl two monghs ago - how to approach him to make it successful?",
        "created_utc": 1678802193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (23M) hides his snapchat from me (20F)",
        "author": "throwRAmistrustt",
        "url": "https://www.reddit.com/r/relationships/comments/11r6k4e/boyfriend_23m_hides_his_snapchat_from_me_20f/",
        "text": "[removed]",
        "created_utc": 1678801643,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23M) don’t know if I’ve made the right choice",
        "author": "Holzy2000",
        "url": "https://www.reddit.com/r/relationships/comments/11r6if9/i_23m_dont_know_if_ive_made_the_right_choice/",
        "text": "[removed]",
        "created_utc": 1678801519,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F21) lied to my boyfriend (M22). Is forgiveness possible?",
        "author": "ThrowRA_PinkSock",
        "url": "https://www.reddit.com/r/relationships/comments/11r6h9d/i_f21_lied_to_my_boyfriend_m22_is_forgiveness/",
        "text": "My boyfriend (M22) and I (F21) have been together for about a year and a half now. Six months into our relationship, I was over my boyfriends house and I got a call. I saw it was a guy I had met on Tinder over a year prior. This Tinder Guy and I shared no emotional or physical intimacy. I knew quickly I didn’t want a relationship with him and I told him that to him. Tinder Guy said he wanted to stay friends. I was cool with that but then he tried to kiss me several times the next time we hung out, I rejected him several times. This made me uncomfortable and at this point I didn’t want to even be friends with him. I have anxiety (which I’m working on in therapy) hence I struggle with confrontation, I was too scared to tell him that I didn’t want to talk to him and too cowardly to block him. Unfortunately, I thought a better idea would be to gradually cut him off. After a while, I was completely ignoring him. I thought he got the hint… but sometimes he’d call me out of the blue after months of us not speaking. I would always just ignore it. He stopped trying to contact me by the time my boyfriend and I got together… But then out of the blue, he called me when my boyfriend and I were together. My boyfriend heard the call and asked who it was. \n\nI went into full panic mode and all rational thought left me. I was terrified of a confrontation. I know how it would’ve sounded if I said “a guy from Tinder”. I was terrified he would assume that I was cheating on him or something. So many negative thoughts were racing. I panicked and lied to him and said it was a friend from school thinking that he would leave it at that. But he felt suspicious and asked me again later on. I panicked even more because I already had lied and I felt like I had to sell it. I picked out one of my guy friends from school, said it was him, and gave him more details about this friend. Everything I said about him is true but he wasn’t the one that called me. Tinder Guy has since been blocked on everything. I lied to him again when I texted him apologizing for seeming suspicious. He even apologized to me for seeming jealous. \n\nI’m so ashamed, disgusted and angered by the way I lied to him. I’m in awe at myself. I am overcome with guilt. After being with him for so long, I’ve come to understand how open, transparent and honest he is with me… he deserves the same. I haven’t lied to him since but how can I genuinely say that he can trust me when I’ve lied to him? I want to come clean and show him I’m capable of learning from/owning up to my mistakes… but I’m afraid telling him will do nothing but just hurt our relationship. I’m terrified he’ll break up with me… especially since it’s been so long since I’ve told the lie. I guess I need an outside perspective… Is the lie breakup worthy? Is forgiveness possible?\n\nTL;DR: Received an unsolicited call from a Tinder Guy from the past (no emotional/physical intimacy) and I lied to my boyfriend about it.",
        "created_utc": 1678801440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out this girl I liked also likes me back and I can’t sleep",
        "author": "Particular-Account-3",
        "url": "https://www.reddit.com/r/relationships/comments/11r6flw/just_found_out_this_girl_i_liked_also_likes_me/",
        "text": "[removed]",
        "created_utc": 1678801317,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend won't stop calling and now her dad just died",
        "author": "tarsier_party",
        "url": "https://www.reddit.com/r/relationships/comments/11r6evk/my_friend_wont_stop_calling_and_now_her_dad_just/",
        "text": "I'll do my best to keep this as short as possible, but it's gonna be hard.\n\nI've known \"Alyssa\" since the 6th grade. We had a lot in common then but our lives are wildly different now - we're in our late 30s. About 8 years ago, with the help of her family, I helped convince her to finally leave her abusive boyfriend in AZ and move back to her parents' home in NY. Since then, Alyssa has basically stopped doing anything other than visiting various doctors and urgent cares and collecting prescriptions (not even necessarily narcotics - it seems more of a hypochondriac thing than an addiction to any one substance). She's convinced she can't work. I get that she's been through a lot, and it's hard for me to say if she truly can or can't work, but she's also made no effort to apply for SSDI, which would be her only hope for getting out of her parents' house. She also seems resistant to any suggestions for how to make some money and maybe gain some independence. (For example, she complained about the piles of excess clothes on her floor that she didn't feel like folding, so I suggested she sell them on Thredup or something and she flatly refused.)\n\nAlyssa and I used to talk maybe once a month, but about a year ago, she started calling me at least 2 times a week. She would go into long, rambling monologues about her problems at home, which were mostly centered around a) the fact that she doesn't work or have any hobbies or do much of anything and b) her jealousy of her 7-year-old niece \"Julia\", who started living with her and her parents after Alyssa's heroin addict sister lost custody of Julia - a lot of it is a self-pitying, why-me kind of thing. She's on so many medications that she frequently forgets the things she's already told me, which means many of these long conversations are also repeats of past conversations. I really don't enjoy any of it, but typically at some point in the conversations she'll also drop something like \"You're the only person who listens to me\" or \"I'm so lucky to have you in my life, I don't know what I would do if I didn't have you.\"\n\nLast week, her dad died unexpectedly - he was in his 60s and had only been sick for two days. Since then, the calls have become even more frequent, more rambling, and more self-pitying. She tries to call me while I'm at work, where I'm really not up for listening to any of her whining, and then she tries to call me at home, which cuts into the time I get to spend with my own family. I often don't pick up but she tries again and again. She's awful but I feel like I'm her only lifeline and that I would be a total a-hole for discarding someone I've known for almost 30 years. \n\nTL;DR: What if I just stopped picking up her calls altogether?",
        "created_utc": 1678801267,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to stop taking my friend's calls but her dad just died",
        "author": "tarsier_party",
        "url": "https://www.reddit.com/r/relationships/comments/11r6db8/i_want_to_stop_taking_my_friends_calls_but_her/",
        "text": "[removed]",
        "created_utc": 1678801156,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend(20F) is always worried about things in her life and also gets mad and upset whenever I(20M) advice something, please help it’s urgent.",
        "author": "ParkGroundbreaking79",
        "url": "https://www.reddit.com/r/relationships/comments/11r6c9k/my_girlfriend20f_is_always_worried_about_things/",
        "text": "\n\n\nHi, I (21M) and my girlfriend (20F) are dating now on 5 months, it’s her last semester and she’s worried about her future and this semester’s exam, she loves to go out a lot but gets worried occasionally, I help her with planning and I am always here for her but she doesn’t work on them after talking about it.\n\nI’ve advised her to take therapy, prioritise things, making to-dos, taking baby steps but she doesn’t and doesn’t even like when I talk to her about it, what should I do? Please suggest, Thankyou.\n\nTl;dr: my girlfriend is constantly worried and upset but gets mad whenever I talk about it.",
        "created_utc": 1678801081,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend's dad just died and I'm tired of talking to her - is that terrible?",
        "author": "tarsier_party",
        "url": "https://www.reddit.com/r/relationships/comments/11r6blp/my_friends_dad_just_died_and_im_tired_of_talking/",
        "text": "[removed]",
        "created_utc": 1678801033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marrying someone with financially dependent family",
        "author": "Low_Organization9364",
        "url": "https://www.reddit.com/r/relationships/comments/11r6a0n/marrying_someone_with_financially_dependent_family/",
        "text": "[removed]",
        "created_utc": 1678800922,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend(20F) is always worried about things in her life and also gets mad and upset whenever I(20M) advice something, please help it’s urgent.",
        "author": "ParkGroundbreaking79",
        "url": "https://www.reddit.com/r/relationships/comments/11r66wj/my_girlfriend20f_is_always_worried_about_things/",
        "text": "[removed]",
        "created_utc": 1678800699,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F18) am worried that my boyfriend(M18) might be gay, does it sound like he might be?",
        "author": "ThrowRAkonverse",
        "url": "https://www.reddit.com/r/relationships/comments/11r5zfb/i_f18_am_worried_that_my_boyfriendm18_might_be/",
        "text": "TL;DR My boyfriend doesn’t seem to like boobs very much, likes ass a lot, and he’s pretty in touch with his feminine. I think he might be gay\n\n\nI(F18) got into an argument with my boyfriend (M18) last king because he asked me if I could send more pictures of mostly my ass ( aka less of my boobs. I usually send some of both when I send photos in my underwear). Now I’m pretty flat-chested, I have an A cup maybe a small B cup at most. I’m pretty insecure about it and he knows that so I was very hurt by him asking this. I’ve always known he liked ass a good amount, even though he told me he liked them equal I could tell he liked ass more. But I love ass myself so I didn’t have an issue with it overall.\n\n\nHe slept with his ex girlfriend a few times, and he told me they only did doggystyle. He also told me he didn’t cum any of the times he slept with her and it didn’t feel all that good he just liked that she felt good and that the feeling was so intimate. I thought this was a bit weird because I always thought sex was better for guys the first few times because they can enjoy it even if both people are inexperienced but I figured I’m a virgin so what do I know? But I woke up this morning and I remembered that a lot of girls talked about how they had closeted boyfriends and them liking ass but not boobs was a major indicator. Now he also told me he ate her out a few times and he talks about wanting to eat me out and make me wet all the time. I don’t know if this is just for show but he does seem to care about my pleasure even if it doesn’t directly benefit him. His aversion to boobs is just very weird. I thought the doggystyle thing was weird because he didn’t want to see the woman he’s sleeping withs face ( and I told him there’s no way our first time is going to be doggystyle for this reason) but now I’m wondering if it’s because all he wants to see is ass.\nI know that part of why I like him because he’s not traditionally masculine, but I’m wondering if this is even more reason for concern. He’s pretty sensitive, likes stuffed animals, he doesn’t have that deep or masculine of a voice( he sounds almost exactly like my middle school crush who ended up being bi), and he’s pretty in touch with what women like. He has two little sisters, and one is a teenager so I always thought that was it. But he’s also told me I can test makeup on him and play with his hair. He also sends me snaps that are a little “fruity”.\n\n\nI’m not sure if he is gay, or if I suspected he was what I would even do about it. If he’s bi I 100% don’t care as I’m bi myself. But I don’t really know what’s doing on here. Does this sound off to you or am I reading too much into all these things?",
        "created_utc": 1678800164,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (F18) am worried that my boyfriend(M18) might be gay, does it sound like he might be?",
        "author": "ThrowRAkonverse",
        "url": "https://www.reddit.com/r/relationships/comments/11r5y96/i_f18_am_worried_that_my_boyfriendm18_might_be/",
        "text": "[removed]",
        "created_utc": 1678800080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Queen",
        "author": "onmyhealingjourneyde",
        "url": "https://www.reddit.com/r/relationships/comments/11r5wsp/queen/",
        "text": "[removed]",
        "created_utc": 1678799982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Queen",
        "author": "onmyhealingjourneyde",
        "url": "https://www.reddit.com/r/relationships/comments/11r5u7d/queen/",
        "text": "[removed]",
        "created_utc": 1678799793,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Boyfriend Ruined My Milestone Celebration By Inviting His Friends Without Even Telling Me",
        "author": "tablepeachy",
        "url": "https://www.reddit.com/r/relationships/comments/11r5qkk/my_boyfriend_ruined_my_milestone_celebration_by/",
        "text": "TL, DR: My Boyfriend destroyed my special celebration by not telling me that he invited all his friends to crash my \"best kept secret\" spot on a forest that I visit. He let them eat all our food, and generally act like parasitea while completely ignoring my feelings. I had planned on a solo trip but he insisted and did this in return. He can't create his own career path and I've drawn the line between him andy finances.\n\nMy( f38) boyfriend ( m40) works a low paying job and he told me so  from the beginning because he was concerned that I'm successful and financially independent and might want expensive dates. I reassured him that wasn't the case and we started our relationship. \n\nWhat started as an emotional oasis for me slowly went south. I don't like that he cuts corners and I've caught him in lies about his degree. He lies constantly, to the point where I've told him he needs to get professional help. I work very hard for my goals and he only wants things but I see no sacrifice.He borrowed money from me, supposedly to pay utility bills but later on that day, spent it all in Hot Topic. I went speechless and made him return my money ASAP.\n\nI recently won a huge contract. My steady work has been life changing but this contract is life changing for my entire family\n\n I always wanted to achieve something nice and celebrate it by enjoying a trip to the forest, taking Tumblr-quality pictures and being immersed in nature. He pleaded with me to take him along but I wasn't sure. I caved on and now I'm regretting it.\n\nFor background, I own a company that is thriving. I'm blessed to enjoy a big salary and I'm getting around to renting houses on a monthly basis so that I can hop here and there. I use the temp moves to meet clients and close some deals, but not always. We'vr had problems because although I can easily pay for everything, he hardly takes out his wallet. It's not about paying, but equal effort. He could take me on a pizza date and I would be grateful. I noticed he tries to avoid working. \n\nHe got upset because I wasn't interested in his idea about him becoming my stay at home guy. We are not at that stage. I also don't like the way he treated me when his friends were around because his jokes were disrespectful.\n\nSo he begged me to take him on my forest adventure. I'd rented a van, got all out camping gear and had an amazing time taking pictures of puddles in grass, even creating special effects. That was until his friends arrived...I was never told he'd invited them. I was furious. He offered them our food, gave them our sushi and generally treated me like a piggy bank. I was so upset I went hiking alone and avoided everyone. I  couldn't sleep because I was upset and he was refusing to talk to me, so I got up, collected my sleeping bag and   other stuff and hit the road. I feel so dissatisfied with him and so disappointed in myself. He says I embarrassed him by acting rude towards his friends ( because I left) and greedy because I was angry they ate out food. \n\nI'm feeling empty and unloved and I'm unsure if we should talk this over. I really want to disappear from his life and ghost but I don't know if I'll regret not being upfront. \n\nI'm frozen right now. I can easily fuck his life over but that's not gonna solve anything. I wanna focus on feeling emotionally stronger. \n\nHow can I help myself stop feeling used? This is having an impact on me and I would really appreciate some encouragement.",
        "created_utc": 1678799529,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [24] risked it all going after one of my good friends sisters [21] only to find out she’s going abroad for a year in the fall",
        "author": "bananalightning",
        "url": "https://www.reddit.com/r/relationships/comments/11r5qhf/i_24_risked_it_all_going_after_one_of_my_good/",
        "text": "So this is just the sort of thing that would happen to me, I’ve always considered myself quite cursed when it comes to romance, my two previous relationships ended pretty poorly with my first ex having serious commitment issues stemming from an absent father, and my second ex cheating on me while she was in Europe for a summer. Needless to say I hate dating.\n\nAnyways, a few weeks back, one of my good friends sisters was in town visiting. (We’ll call my friend ‘M’ and her sister ‘C’). I instantly hit it off with C, in my eyes she is one of the most beautiful women I’ve laid my eyes on, and I love how much fun and laughs we have together. M was not a huge fan of this whole situation as she is quite the overprotective big sister, but she wasn’t mad or anything either.\n\nThe story starts to get complicated now. First, C doesn’t live in my city, she lives in a nearby city that is 2.5 hours away. Fortunately because of my work and her sister we visit each others cities around 2 times a month. Also I am actually moving to her city in the summer. As such things weren’t all doom and gloom.\n\nWe’ve been talking a little over a month, and seen each other 3 of those weekends with things getting progressively better. However over the last weekend I spent with her I had two unfortunate developments. The first one is that M, my friend, is very much still opposed to the relationship out of fears one of us will hurt the other, to the point it is putting some strain on C. Secondly, C got accepted to a year long study abroad program in Europe.\n\nWhen I heard this news it was like getting a sucker punch to the gut. From this dream that I’d be moving there and we’d be together to finding out actually I’d move there, we’d have 2 months, and then she’d go away for a year is heartbreaking. Also to find out my friend doesn’t support it stings a bit as I would hate to lose that relationship too.\n\nIn my eyes the year abroad is a death sentence. Ironically pretty much all my friends in long term relationships did long distance for study abroad, but that was a semester, not a full year. When I mentioned the abroad thing to C, she just said “oh a year is not too long, it’ll fly by, and we can visit each other”, which while reassuring and cute, sounds more like she’s being naive and in denial to me.\n\nNow, I dont really know what to do. I am hopelessly in love with this girl, like embarrassingly so, I haven’t felt this way about someone since my first ex. However it is clear that the situation is stacked drastically against me. My options I suppose are:\n- Fully end the relationship now to save myself as much heartbreak as possible\n- Enjoy the 6 months we’d have together and end things (or have some sort of open relationship) when she goes abroad hoping we can reconnect after she’s back\n- Enjoy the 6 months and give LD a shot in spite of my past trauma and concerns\n\nAny advice or even just kind words would be appreciated, I’m honestly really frustrated at this whole ordeal and can’t believe my luck.\n\nTLDR; Started dating a good friends sister in spite of the backlash, only to find out she’s going abroad for a whole year in 6 months. What should I do?",
        "created_utc": 1678799524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I cut my “best friend” off?",
        "author": "Commercial-Math9373",
        "url": "https://www.reddit.com/r/relationships/comments/11r5cg6/should_i_cut_my_best_friend_off/",
        "text": "hello everyone,\n\nI have been in my head a lot about this situation and I think it’s time I actually get other opinions on whether or not I should remove my “best friend” from my life. \n\n\nWe started off dating about two years ago, but it was super shaky from the beginning because she was very quick to throw the L word around and it automatically made me suspicious. We had a lot of fall outs through the years, but we’d bounce back because I think neither one of us could genuinely handle being alone. I noticed she was very quick to make several accounts to talk to me if I decided that I didn’t want to be friends or date anymore, and we’d always end up talking again. It was a very dramatic situation.\n\n \n\nOnce we decided at the beginning of 2022 that romantically we weren’t good for each other, we decided to become best friends because we felt like that was our best fit, we both liked the same things, the same foods and the same activities. \n\nA couple of things I’d noticed in both the friendship and relationship is that she’d low key morph everything that I like into something she now liked or copying way too many things that I did for my liking. It was beyond the point of being cute, it was now creepy. I felt like she had no individuality. She likes to act like someone she’s not, and it really doesn’t sit well with me. If she thought I was talking to anyone, she was very quick to send me old pictures of us when we were dating, which made me super uncomfortable. \n\nIn the summer of 2022 she found someone she liked, and we didn’t see each other for the entire summer, and she blamed it on the fact that the girl she was now talking to didn’t “let her” see me. At this point I noticed that she really only cared to hang out with me if there wasn’t anyone else. No person I would talk to romantically could ever stop me from seeing my best friend. After that ended, she came running back to me and talking as if nothing had ever happened. Stupidly, we began messing around for a month after that, and I realized I was tired of the cycle of being friends and dating over and over again. So I told her I needed space and I felt like I’d help us both out by parting ways because it’s impossible for us to move on this way, to which she still texted me just about every day even when I didn’t respond. This was in October. \n\nI gave myself a couple of months to really think about what I wanted out of this friendship and how we could both benefit seeing that we both loved the same things and had a person we could go on adventures with. In December we met up and talked it all over and I set boundaries so that we could both move on without losing the friendship entirely that it seemed we both valued (pretty much ways we would keep ourselves from falling back into that same cycle, such as not obligating each other to texting every single day like we used to do, and keeping things very platonic). We were way too good at switching the title from dating to just friends and still consistently having the same routine that we did while dating. She agreed and stated she felt the same way.\n\nSince then, those boundaries have been walked over and when I finally brought it to her attention after she touched me sexually without my consent, she at first apologized but then began to blame me for not stating that what she was doing was wrong as if we are not both adults. \n\nShe had made romantic advances before, mentioning that she fantasized about me, stating she wanted to kiss me, and overall not moving on from the past even though I have not entertained it once and I made it very obvious that I was uncomfortable when certain gestures were made. \n\nWhat sucks to me about this whole thing is, I try to forget that she’s my ex, but it seems as though she’ll keep reminding me. I felt like the friendship was okay, just some things to work on of course. But to me it’s not me wanting to cut off my “best friend”, it’s me wanting to cut off my ex. I really wanted this friendship to work, but even when it was working I wasn’t necessarily comfortable with her. The cons to the friendship would be simple things as cutting me off when I’m talking (almost every time I say anything, no joke), constantly making every conversation about her, not having her own individuality, and coming off as very obsessive. \n\nThis time when I brought it up to her that I wasn’t comfortable, I told her I needed space, and once again, she couldn’t go one day without texting me over and over. We were thinking about moving in together (which is something she automatically brought up when I told her about how uncomfortable she made me) stating that she wouldn’t act this way when we move and to not worry about that, but I definitely don’t see that happening. I can’t even get space virtually, there’s no way I’d get space in my own home. I’ve noticed that since I’ve met her, she always been the one to force a conversation or cross boundaries when someone simply wants space. The biggest problem is she’s completely unaware, no matter how many times I tell her, she just does not either get it or she doesn’t care. Here’s the thing, I obviously care about her, but am I being delusional? She has shown me who she is, yet I have somehow managed to believe she will respect boundaries. I am tired of having conversations with her and I’m honestly tired of making up. When I spoke to her in December about being 100% platonic I didn’t expect her brain to flick and say hey I have no feelings, but I did expect respect of the boundaries we both set, my privacy and definitely my body. \nIt’s unfortunate, but should I cut off my “best friend”? \n\ntl;dr My best friend of a couple years has been a good friend, but we have had plenty of tough spots that have drained me overtime.\nWe actually started off as dating and transitioned into friends repeatedly, and at the end of 2022 in October I was tired of going in the same cycle so I took some space from the friendship, which during this she texted me nearly every day constantly even with no response. Each time we would argue or have a disagreement, she wouldn’t know how to give space ever. We were talking about moving in but even though I really wanted to, I am not doing that because I feel like I’d be overwhelmed. In December we spoke about boundaries (not doing the same things we did in the relationship) and being fully platonic. Since then those boundaries have not been respected, and the other day she touched me sexually without my consent, and when I brought it up she apologized at first, but then blamed me for not telling her that what she was doing was wrong earlier although we’re both adults. I told her I needed space because I have noticed that since I’ve met her she hasn’t respected any boundaries and I feel as though she can’t move on from the past. And of course, she has been texting me non stop and has not gone one day without texting me regardless of the space I asked for. What should I do?",
        "created_utc": 1678798492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if i like my girlfriend anymore",
        "author": "Masaslo",
        "url": "https://www.reddit.com/r/relationships/comments/11r51i4/i_dont_know_if_i_like_my_girlfriend_anymore/",
        "text": "Im 19 male and my 18F girlfriend is beginning to annoy me a lot and I don't really know if i want to continue the relationship. We've been dating for about 6 months and its going fine but nothing is really happening and I feel like I lost all feeling.\n\nAt the end of the school year she's going to America for a year and I don't have the money to travel between my country and America so I've kind of excepted that the relationship is not forever but weirdly enough i am kind of looking forward to it. I feel really bad about it but I think being single is gonna feel better.\n\nThis is also my first relationship with a girl so when she approached me i just took my chance and didn't really check if we were actually a match or not. I don't really find her attractive anymore as well, i feel like the internet kind of ruined my expectations.\n\nShe also seems a lot more attached to me than I to her so I don't know if i should brake up or wait till the end of the year to spare her the brake up.\n\nTl;Dr: I don't know if i should brake up with my girlfriend or wait until the relationship runs its course by its own.",
        "created_utc": 1678797616,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [26 F] husband [29 M] went to a strip club and didn't tell me even though we discussed he would if he ever went.",
        "author": "PookiePie666",
        "url": "https://www.reddit.com/r/relationships/comments/11r4y8f/my_26_f_husband_29_m_went_to_a_strip_club_and/",
        "text": "We're 1 year married, but 6 years together. My husband was in a frat and majority of his friends are from the frat so they can get rowdy. Growing up I have always been a boy's girl. I have often been the only female on the trips and have even gone to a strip club with all of them so I know what to expect. I don't like the idea of him going but I trust him to not engage in dances, etc. \n\nBack when we were dating, he would go to strip clubs on these boys trips but he didn't mention it to me until after the fact. He told me the guys would make a pact to not tell their gfs. I understand that it is a social norm for guys to go to these things and I didn't want my bf to cover these things up like maybe his friends would. So I said, I don't have a problem with you going, just tell me that you are before you go.\n\nWith that deal in place, he has texted me and told me he's going when it was his friend's bachelor party, I asked him how it was when he came home and that was that. \n\nFast forward to his bachelor party (we eloped and are already married and have a wedding celebration in April) last week. Because of said \"rowdy\" crew, I fully expected him to go to a strip club but I didn't get a message from him that he was. So when I get home from my bachelorette (we had it on the same weekend in different places), I asked him if he went and he said yes he went to two. I asked why didn't he message me? We had a compromise. He said his phone died and he didn't want to ruin my bachelorette or have me overreact like his friends' partners do. I told him last time he texted me he was going, I didn't overreact and I expected him to go to one. So he gives me the details and says at the second place he just sat at the VIP table in the back and the guys went to the front. I was already disappointed in him that he didn't tell me he was going and he had days of opportunity after the trip to tell me as well. But until I brought it up, that's when he told me. \n\nThe next day I asked him if he got a dance because I was surprised he was the bachelor and didn't get one. He said he had two but he didn't enjoy them and his friends bought them. I told him it doesn't matter if he doesn't like it. He made me believe in our convo the day before he was sitting in the back in VIP.\n\nSo I consistently get re-upset thinking about this. And would love another perspective on this. I'm upset that we had a deal and he didn't uphold his end. I thought it was an easy compromise and I feel like I have more to lose emotionally. And though I expected him to go to a strip club, I thought he would be honest and tell me the first time I asked if he went that he also got lap dances. When we got engaged I told him I only ever want him to tell me the truth, even if it's not good news so I can judge him for the person he is. I feel this ruptures that request.\n\nThanks so much for reading and sharing your thoughts!\n---\n**tl;dr**: Husband and I had a deal to tell me if he was going to a strip club vs hiding it from me like some of his friends do to their partners. He didn't hold up his end of the deal + got 2 lap dances. I had to ask and uncover each thing and I would rather had him be open and honest. Feels like he was hiding it and I feel disappointed.",
        "created_utc": 1678797344,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if i like my girlfriend anymore",
        "author": "Masaslo",
        "url": "https://www.reddit.com/r/relationships/comments/11r4w4n/i_dont_know_if_i_like_my_girlfriend_anymore/",
        "text": "[removed]",
        "created_utc": 1678797179,
        "upvote_ratio": 1.0
    },
    {
        "title": "(F21) I've been very insecure in my relationship with bf (M20) and i don't know if its my gut feeling or not.",
        "author": "sadzay",
        "url": "https://www.reddit.com/r/relationships/comments/11r4sah/f21_ive_been_very_insecure_in_my_relationship/",
        "text": "sorry if the formatting is off im using mobile. tl;dr at the end.\n\nA little backstory, Ive been with my boyfriend for about 9 months now and will be until i move there next year, we met while I was on an exchange semester and became long distance right after. Ever since we became long distance I've been getting increasingly insecure in the relationship for no apparent reason. So far he has not given me many reasons to not trust him except some little things i have overthought into oblivion.\n\nSo one of the main problems is that, he has a girl best friend and i know thats cliche but hear me out. They met only a year before we did and instantly he developed a crush on her but she rejected him so \"he got over it\" and they went on as best friends, i have had no reason to not trust him on this since we talked about it before and he reassured me + she has a bf now however he talks about her very frequently since they hang out often, in which he skipped on our planned calls a couple times for it, i tried not to overthink that since it was all three of them meeting up. And all three of them talk in great detail about sex which makes me uncomfortable since i have to hear \"oh she did this and that\" pretty often. \n\nThe one incident i cant forget is when she got with her bf and he found out about it he was really bummed since her boyfriend is pretty similar in personality to my bf, \" why couldnt she date me then, all the reasons she gave abt not dating me are all the things her boyfriend has as well\" and i consoled him bc he was sad but i just could not forget it, later when i brought this up while having the \"best friend talk\" he got sad only bc she told him she got with her bf a little later, but i do not believe him on this since his exact words were the ones i wrote above.\n\nThere are small other things that are not related to the best friend as well like still keeping in contact w his ex crushes and him following and unfollowing an OF girl at the beginning of the rship. I am aware this all sounds a bit bad on his part but he has reassured me many times about all of these. \n\ntl;dr : im afraid my bf cares more about his best friend than me and/or still has feelings for her. \n\nSince we are long distance for at least one more year, I just cant shake this bad feeling. What should I do?",
        "created_utc": 1678796895,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [15F] brother [19M] is interested in me",
        "author": "Mimury",
        "url": "https://www.reddit.com/r/relationships/comments/11r4noe/my_15f_brother_19m_is_interested_in_me/",
        "text": "While we are alone at home he always makes sexual jokes to me or touches my butt whenever he gets the chance.\n\n I can't even bend over while he is in the house and its stressing me too much. I don't want to complain him to my parents because they are too harsh and im afraid they might throw him out of house. \n\nEven though he has a job i don't want him to get him thrown out. If i threat him with telling my parents he knows i won't and just says \"Yeah sure\" i don't know how i can make him stop peacefully\n\nTLDR: My brother likes me in a sexual way and touches my butt and i cant make him stop",
        "created_utc": 1678796510,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (28NB) partner (22NB) left me and I feel sad and angry like I've never been.",
        "author": "elpacholoco11",
        "url": "https://www.reddit.com/r/relationships/comments/11r4n2g/my_28nb_partner_22nb_left_me_and_i_feel_sad_and/",
        "text": "As the title say, my partner (V.) yesterday left me (for the second time -- more over this below).\n\nFor context, V. and I had been close friends from 2018, and after 3 years of beautiful friendship, in 2021 we got together in the summer, after V. broke up with their ex with which they had a very co-dependent relationship (their definition, not mine). Things were going great, until I moved to another city for work, with the promise of making the distance work. After 1 month of this, in Oct 2021 V. broke up with me, on the phone, out of the blue basically without giving any explanation, other than that they were thinking again about their ex, in a call where they barely spoke. After a couple of weeks V. got back with the ex, and I later discovered that what happened is that said ex sent flowers to V. two days before the breakup.\n\nWe spoke in person a couple of times from there, to try to clear the air a bit more -- V. kinda apologized about how they behaved, but nothing more. Then, in May 2022 V. called me and asked to reconcile, after having broken up with the ex. We spent the summer talking and trying to rebuild at least a friendship and trust, and I had always been clear about something: I still have feelings for you, and if at one point we end up trying again the relationship stuff, I want to be sure that this time you are not going to do it lightly (i.e. we don't start anything unless you're \\*sure\\* you want this), and that you will take responsibility in the relationship to try to make things work.\n\nThis happened between Nov and Dec 2022, where we got back together, after things and trust developed again in the previous months. We spoke again a few times about the fundamental things mentioned above, i.e. being sure about the relationship and responsibility. I did a gigantic effort to trust V. again, to forgive them for how they treated me, to close that chapter and start fresh, to be clear about what I wanted, and to trust their commitment to reconciliation at first, and about trying the relationship again later.\n\nYesterday we met, and V. told me out of the blue that they were breaking up with me, after having always told me that things were good in the past months when we spoke about it. That they care about me, but never loved me, and that they knew from the beginning -- both the first time and the second -- but that they came back with me because at the time (Nov-Dec 2022) it felt like the right thing to do for them, even though, again, they knew there were not romantic feelings for me.\n\nI'm sad, and incredibly angry. I poured my heart into giving V. trust, love, and building an environment where they could feel these things. V. also suffers from depression, and I know that I did everything I could to respect their spaces and times, be there when they needed it, everything -- often sacrificing a lot of my own well-being, because I trusted that I was doing this for a person that had been sincere with me about wanting to rebuild a relationship again. And now I feel like they did not respect my conditions for reconciliation, lied to me, and did not care about me in general. I don't understand how you can \\*promise\\* to respect that if we were ever to be in a relationship again you would have done it only if you knew you wanted it, and then tell me that you actually knew you didn't love me and you came back with me only because at that moment you felt good about it. Especially after you hurt me like hell when you broke up with me the first time, and promised not to do it again.\n\nSorry for the long post, I just don't know if this anger is justified or if I'm overreacting. I don't know if V.'s behavior is normal, or just kinda bad but I should just be ok with it and move on, or something that was really bad. I feel like shit and I cannot think clearly. I would just like your advice on what to think, and what to do. Not in terms of coming back together -- I'm done, I'm too hurt -- but if I should tell V. how angry I am (yesterday I was destroyed and I didn't, and I feel like I want to scream at them) and if I should cut communications entirely.\n\nThanks to everybody who will take time to read/respond. I really appreciate it.\n\n&amp;#x200B;\n\nTL;DR: partner broke up with me (again) out of the blue, telling me they never loved me, always new, and I feel like they betrayed my trust. I don't know what to think, and how to act.",
        "created_utc": 1678796461,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (28NB) partner (22NB) left me and I feel sad and angry like I've never been.",
        "author": "elpacholoco11",
        "url": "https://www.reddit.com/r/relationships/comments/11r4kvb/my_28nb_partner_22nb_left_me_and_i_feel_sad_and/",
        "text": "[removed]",
        "created_utc": 1678796289,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [15F] Brother [19M] is interested in me",
        "author": "Mimury",
        "url": "https://www.reddit.com/r/relationships/comments/11r4iz9/my_15f_brother_19m_is_interested_in_me/",
        "text": "[removed]",
        "created_utc": 1678796123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boundaries about going to eye club while being in a relationship",
        "author": "wonderful-unknown23",
        "url": "https://www.reddit.com/r/relationships/comments/11r49ck/boundaries_about_going_to_eye_club_while_being_in/",
        "text": "I (25F) have been dating my boyfriend (25M) for 3 years now and we are basically on the brink of a breakup and I am stuck trying to figure out what to do. Since we started dating he has always had an issue with me going out to the clubs without him because he thinks it’s a place I put myself to get hit on by other men. As I’ve gotten older, the club scene just isn’t my thing anymore and the only time I really go out is when I go on vacations with my girl friends. Anyway, we got into a huge argument because he still says he has boundaries about me going out to the club without him because of men that would potentially hit on me and says my friends that I go out with are “hoes”Bc my friends that are single like to flirt and sometimes go home with people while we go out. Just flat out saying he doesn’t trust my friends that I go with and wants me to do more “mature” things while I’m out on vacation like going out to eat, the spa, etc. I have never given him a reason not to trust me, but he claims that I need to sacrifice that part of my life (going out) for our relationship to work bc according to him I didn’t  sacrifice anything since we started dating. in my opinion, I think it is controlling &amp; insecure bc we are so young and I don’t go to the clubs every wee just strictly on vacation. I think it’s such a silly think to break up over bc he is adamant that he’s never going to comprise on this. He also explaining to me that to him cheating is also when another men buys me drink bc he wants to be the one to provide it. I kept telling him it is almost insecure and not a boundary but he says he’s not budging on this. He kept telling me that I have destroyed his confidence and that I broke him every time i went out and did that. do you think we are doomed and should break up? Is this really a boundary or is he coming from a place of insecurity? \n\nTL;DR - boyfriend has an issue with me going to the club with my single friends on vacation and said it’s a boundary he has, but I think it’s controlling.",
        "created_utc": 1678795323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boundaries about going out to the club while being in a relationship",
        "author": "wonderful-unknown23",
        "url": "https://www.reddit.com/r/relationships/comments/11r470s/boundaries_about_going_out_to_the_club_while/",
        "text": "[removed]",
        "created_utc": 1678795145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this what love is all about? 🙂",
        "author": "SpaceWhalee_",
        "url": "https://www.reddit.com/r/relationships/comments/11r41rd/is_this_what_love_is_all_about/",
        "text": "[removed]",
        "created_utc": 1678794678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (19M) and my girlfriend (20F) are experiencing a really tough time in our relationship",
        "author": "OnlyPaint9326",
        "url": "https://www.reddit.com/r/relationships/comments/11r3usg/me_19m_and_my_girlfriend_20f_are_experiencing_a/",
        "text": "For a bit of context, we’ve been dating since September last year and are in a LDR. Things were good at the start, but about 3 months in our personal lives started getting in the way. \n\nWe both struggle with depression at times, and there have been a few instances where she did not speak with me at all and I was left wondering what was going on because she shut down due to her depression. She told me she was going to try and find some time to talk things out 2 weeks ago. It’s been 5 weeks since we actually had a proper conversation, I messaged her a few times this week to check up on her and she didn’t reply until tonight when I messaged her again. My gut feeling was right, she’s at her lowest. \n\nI feel bad for her, I’m not sure what to do. I love her, she’s an amazing person and never did me any wrong, she just doesn’t know how to deal with her problems. Tonight she said she “can’t keep me because she can’t take care of herself”. It hurts me. It fucking sucks. I guess this is more of a vent, but I don’t want to give up on her. Does anyone have any advice on what I should do?\n\n\nTLDR: My girlfriend is going through a really tough time and it seems that our relationship is over, what should I do?",
        "created_utc": 1678794052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (19M) and my girlfriend (20F) are experiencing a really tough time in our relationship",
        "author": "OnlyPaint9326",
        "url": "https://www.reddit.com/r/relationships/comments/11r3tw4/me_19m_and_my_girlfriend_20f_are_experiencing_a/",
        "text": "[removed]",
        "created_utc": 1678793975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girlfriend (25F) keeps insisting that I (24F) get a haircut but I really don’t want one",
        "author": "hairscaregirl",
        "url": "https://www.reddit.com/r/relationships/comments/11r3sdn/girlfriend_25f_keeps_insisting_that_i_24f_get_a/",
        "text": "My hair has always been insanely long, it reached my knees by the time I was a teenager and I maintained that length all through college. Back during quarantine I was bored and decided to start growing it out again, curious of just how long it could possibly get. It now reaches my lower calves and in another year or so it’ll probably be all the way down to the floor. Now I love it, I keep the ends healthy, and it’s up pretty much all the time so it’s in good condition. But my girlfriend has recently started saying that it’s weird that it’s that long and that I should at least cut it back to knee length. I told her I didn’t want to but she kept insisting that I really should. She says that if it’s too long to wear down normally than it’s too long and time to cut it. We’ve been arguing about this for a little while but I just don’t want to cut my hair, I’m really curious just how long it can get. What should I say?\n\nTl;dr: I have a lot of hair, my girlfriend considers it too much hair, but I don’t want to cut it to appease her",
        "created_utc": 1678793832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me (19M) and my girlfriend (20F) are experiencing a really tough time in our relationship",
        "author": "OnlyPaint9326",
        "url": "https://www.reddit.com/r/relationships/comments/11r3rhd/me_19m_and_my_girlfriend_20f_are_experiencing_a/",
        "text": "[removed]",
        "created_utc": 1678793748,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I (23f) ask my bf (21m) who the girl he follows is",
        "author": "Best-Wear5242",
        "url": "https://www.reddit.com/r/relationships/comments/11r3rcv/how_should_i_23f_ask_my_bf_21m_who_the_girl_he/",
        "text": "My boyfriend and I had a conversation a few months ago about basically going on a purge on our Instas to get rid of any random people that don’t really matter, people we’ve seen in the past, or people we don’t know too well or anything like that. We ended up doing just that and I was really happy with clearing out our following lists lol \n\nAnyway there’s this one person that I’m specifically wondering about. It’s a girl and he follows on both her “main” account and her “spam” account. The spam account part kind of bothered me I guess since of course it’s usually only close people that follow them. I’m just curious to know who she is since I don’t know her at all, the account is private, and my bf is my only mutual with her. \n\nIm just not sure how to go about it because we went through everything a few months ago but I don’t want him to be upset or anything. I guess I’m just a little nervous about it. Any advice would be appreciated! Thank you!!\n\nTl;dr my boyfriend follows a girl’s spam account and I don’t know who she is. Nervous about asking him who she is any advice?",
        "created_utc": 1678793735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird I’m attracted to my step brother?",
        "author": "BasilRevolutionary12",
        "url": "https://www.reddit.com/r/relationships/comments/11r3n1g/is_it_weird_im_attracted_to_my_step_brother/",
        "text": "My (17f) mum has been dating her fella (gonna call him Fred) for 6 months and they’re currently pregnant. I knew Fred’s son (18m) from school n didn’t even like him for the first 2/3 years. However I’ve spoken to him recently and realised I am very attracted to him. I’m a bit unsure of what to think as we’re going to share a sibling in 5 months but Fred and I aren’t related and have never had a sister/brother dynamic between us. Would really appreciate someone’s view on this \n\nTl;dr: I fancy my unborn siblings older brother.",
        "created_utc": 1678793361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird I’m attracted to my step brother?",
        "author": "BasilRevolutionary12",
        "url": "https://www.reddit.com/r/relationships/comments/11r3klk/is_it_weird_im_attracted_to_my_step_brother/",
        "text": "[removed]",
        "created_utc": 1678793132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heated argument with gf that I feel super guilty about.",
        "author": "Ok_Ad_9986",
        "url": "https://www.reddit.com/r/relationships/comments/11r3fyq/heated_argument_with_gf_that_i_feel_super_guilty/",
        "text": "A little background first,\n\nMe (20M)and my gf(20F) have been dating for around 2.5 years now. We moved in together in our little condo around a year ago and we are both Uni students (Almost 2nd year). Recently I have been pretty depressed and anxious over Uni and some other stuff that she knows about.\n\n\nCouple nights ago we got into a pretty heated argument. At some point I yelled at her:” You don’t know me, and Im not gonna make you understand because you’re too dumb for that apparently.” I clearly saw her tear up after I said that. \nAfter that I just left the house cuz I knew i would say some more stupid stuff that I would regret later.\n\n \nI called my friend (21M) to go for a drive. Surprisingly enough he also was arguing with his gf that night. He was in his car and I was in mine. we decided to hit some of the empty roads and speed, I know right? What kind of an idiot does that after a heated argument? Me, I am that idiot. Anyways we pushed it too far and my friend endded up crashing his car (he is perfectly fine but his car is toast), I got lucky and swerved out of the way before he hit me. Nothing happened to me or my car but I was absolutely horrified and in disbelief. \n\n\nAfter his car got towed away, his girlfriend picked him up and  she called my girlfriend and told her about what happened. \nI drove away without realizing that my gf is rsuhing there(She called me well over 20 times but my phone was on no disturb from before.) \n\n\nI went to the spot that I always go to when I’m sad or anxious. She knew i would go there and found me there shortly after. She ran towards me and embraced me while crying her eyes out and told me:”No matter what we say to each other or what happens between us I will always love you and I want you to be safe. You know that I love you. I’m sorry ok? ok?” \n\n\nI cried like a freakin’ baby in her arms after that. She’s my sweet angel, and I have truly messed up. She is not dumb, she’s much smarter than I am, she is a much better person. She knows me better than anyone And everything I said was utterly stupid and wrong. I have never been this ashamed of myself before. I feel like such a failure for what I said to the only person that I care about and love and also for not thinking about her when I was speeding. I am truly in love with this girl. \n\n\nWe are seemingly on good term now, I apologized and she doesn’t speak about what happened at all but I know that I broke her heart and this is consuming me and tearing me apart. The fact that she doesn’t talk about it makes me feel worse.\nI am going to get her the necklace she told me she likes and take her out to dinner to make up for the way I treated her but I know it’s not enough. I genuinely don’t know what to do to make her feel better. I need help, I need her to know that I love her and I appreciate every single millisecond that I breathe by her side. It is hard for me to discuss this with her as I am heavily embarrassed by it and I can hardly initiate a discussion regarding that matter. \n\n\nWhat can I do? What should my approach be? Should I write her something like a love poem? Do I just talk to her and explain myself more vividly?  Need it to be the perfect approach whatever it is. \nI would really appreciate any advice and input.\n\nTL;DR: heated argument with girlfriend, during which I said hurtful things and then left the house. went for a drive with a friend, who ended up crashing his car. The girlfriend found me later and comforted me, but I feel guilty and ashamed for my behaviour. I want to make it up to her but don’t know how.",
        "created_utc": 1678792729,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (25F) boyfriend (25M) has a porn addiction and it affects our sex life",
        "author": "thr0waway_444",
        "url": "https://www.reddit.com/r/relationships/comments/11r3ct1/my_25f_boyfriend_25m_has_a_porn_addiction_and_it/",
        "text": "My (25F) boyfriend (25M) has a porn addiction and it affects our sex life\n\nMy boyfriend (25M) and I have been together for 2 years and he came clean to me that he has a porn addiction. \n\nI’ve had a lingering feeling he had one based on the fact that he couldn’t perform during sex and would sometimes turn me down when I initiate because he’s not in the mood and results in him turning to other means. He would only finish if he’d jerk off on his own and that I wouldn’t touch him. \n\nI’ve tried everything to keep him interested from maintaining my appearance, initiating sex, and sending him photos/videos to no avail, rather choosing videos of women on the internet. It takes a lot for me to be intimate with someone, having my own share of body dysmorphia, but hearing this has shattered my self esteem and questions the way he views me. \n\nIt breaks my heart not only knowing that I tried everything I can to be the best partner but that I’d never be enough for him no matter what I look like or what I do. \n\nHas anyone else dealt with something similar and have some advice on porn addiction?\n\n\nTl;DR: Partner has a porn addiction which affects our sex life and his ability/interest to perform.",
        "created_utc": 1678792448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving on feels wrong - advice is needed",
        "author": "Empty_Confection4988",
        "url": "https://www.reddit.com/r/relationships/comments/11r3crd/moving_on_feels_wrong_advice_is_needed/",
        "text": "I’m (26) struggling with my overall  situation and would love to get some outside opinions to see everything a bit more clear. I my head  everythings still a mess but I'm trying to  type it down as easy to understand as possible:\n\nLast year in january my boyfriend (28) of 5 years passed away. He was in a special task force and did not survive an armed operation. The person  who fired the fatal shot is already serving his rightful sentence and I  pray everyday that he will never see daylight again.\n\nTwo months prior to his death I gave birth to our beautiful daughter Paige. We just bought a stunning apartment and were ready to finally be our  own little family.\n\nThat wasn’t the way we planned it. Our plan was to be a perfect little family. We planned on getting married once Paige is old enough to be our flower girl. We wanted to travel the world as a family. He considered giving up his job for something safer once he knew about my pregnancy.\n\nI was at home singing soothing songs to our baby girl when I heard a knock on our door.\n\nHis supervisor told me what happened and gave me his folded uniform. Safe to say my entire world shattered in front of my eyes. I was just functioning the following weeks. I went to court, planned his funeral, did all the document stuff I had to do - all this while taking care of a  newborn.\n\nI had great help from my best friends, his best friends and my father but I was a literal mess. After everything settled down a bit I started therapy.\n\nMy little one is now a little over a year old. The first anniversary of  his death was in January. I was able to extend my parental leave at work a bit and took some unpaid time off to cope with the circumstances. I  was having a horrible year filled with anxiety, grief, panic attacks and   depressive episodes all while trying to be a good mother for my little   girl.\n\nI started working again  last  month. I feel bad for giving my baby to a daycare center but I  just  needed to start working again. I started to feel cut off from  society. At some point last year I wasn’t talking to any adult person.  All I did  was care for my daughter. I let myself go and started to lose  my sanity.  Therapy helped with keeping everything somewhat together but I’m still  struggling with everything.\n\nThe  first few days at my office felt so weird. My desk was decorated with lots of gifts, stuff for my self care and for my daughter I was warmly welcomed back. My desk looked the same. No one moved anything. It all   felt so normal yet so different.\n\nI  cried happy tears when I picked Paige up the first time. I missed her so much. I still miss her everyday when I am at work but I enjoy going to work. I love my job and it makes me feel like a grown up with her   shit together - not like a mess who sits at home crying her eyes out. I enjoy having lunch with my co workers. I enjoy talking about grown up  topics.\n\nI'm still supported by my  friends and by my dad but my grandparents think I should stay at home   longer (until my daughter is in kindergarden) just to support my daughter. She already lost her father and should be able to spend as much time with her mother as she can. I agree with them and try to make   my daughters life as easy and enjoyable as I can. I'm second guessing my  decision to start working again already.\n\nNow to my second struggle:\n\nMy  best friend forced me to go out last weekend. My dad took care of Paige  and we went to a local bar. It was a nice evening. It was the first   time in forever I got all dressed up and looked actually pretty. I  haven't felt anyhing but ugly since his passing. My post partum body wasn't anything one might find attractive.\n\nWe  had a few drinks and played some pool when a handsome guy approached me. We talked for a bit and he asked me for my number. I was hesitant at  first but typed my number down anyway. I don’t know why I did it   because I did regret it not even 5 minutes later.\n\nToday's  morning I received a text from said guy. He asked if I want to grab dinner sometime soon because he thinks I’m really pretty and he enjoyed  the bit of conversation we had. My friends think I should give it a shot   and it will be good for me to go out again.\n\nI  know that it’s well meant but I don’t know if I’m ready to go on dates again. I still love my partner more than anything. We never broke up so  I’m more or less still a taken woman - even if the other partner isn’t   alive anymore.\n\nAnother part of me  thinks that my partner wouldn’t want me to stay depressed and alone for   the rest of my life. He was a life loving person and would want me to   enjoy my life to the fullest.\n\nHow  does one date after such a loss? When is the right time to go out  again?  If I go out on a date - should I tell him upfront I'm a widowed  mother  of a one year old?\n\nIt's all a mess in my head right now and I feel like whatever I'll do next is wrong.\n\n&amp;#x200B;\n\nTL;DR: My partner died little over a year ago. I started working again and tried to life my live a little. Everything I do feels wrong - giving my daughter to a daycare, staying at home, going on dates, not going out on dates again- nothing feels good.",
        "created_utc": 1678792443,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (25F) boyfriend (25M) has a porn addiction and it affects our sex life",
        "author": "thr0waway_444",
        "url": "https://www.reddit.com/r/relationships/comments/11r39wh/my_25f_boyfriend_25m_has_a_porn_addiction_and_it/",
        "text": "[removed]",
        "created_utc": 1678792186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accountability or Access?",
        "author": "Plastic_Toe8739",
        "url": "https://www.reddit.com/r/relationships/comments/11r33tf/accountability_or_access/",
        "text": "Me (22f) and my ex (23m) tried getting back together in October. Life happened he ghosted me(November). I reached out to ask why he ghosted me in  December and we talked it over and he chalked it up to him being busy and  “didn’t have enough energy” to try again blah blah. He apologized and wanted to be friends instead and I told him no. I wished him the best and never spoke to him again, asking that he never contact me again. Fast forward to March he decides to like one of my tweets on Twitter and follows me the next day. I ignore it because this is the pattern he always does. he messages me a paragraph about how he respects me and still supports me from a distance and he’s sorry. He misses hanging out with me but for my sake will stay away so I don’t get mixed signals. I’ve been trying to heal and move on so this message is sudden for me after months of no contact. Is this something guys do? Is he trying to take accountability for his wrongs or is he trying to see if he still has access to me. \n\n\nTL;DR: My ex reached out and apologized to me after he ghosted me and months of no contact, but I’m confused by his intentions?",
        "created_utc": 1678791626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I right to be dissapointed/mad at my GF?",
        "author": "Datsun1195",
        "url": "https://www.reddit.com/r/relationships/comments/11r2rkd/am_i_right_to_be_dissapointedmad_at_my_gf/",
        "text": "[removed]",
        "created_utc": 1678790435,
        "upvote_ratio": 1.0
    },
    {
        "title": "My EX GF (26F) found what I think is the love of her life 1 week after breaking up with me (24M) and I don't know how to handle it",
        "author": "marauder961",
        "url": "https://www.reddit.com/r/relationships/comments/11r2pwi/my_ex_gf_26f_found_what_i_think_is_the_love_of/",
        "text": "My EX GF (26F) broke up with me (24M) almost a month ago after 2 years and a half. She had many reasons but the most serious one I think was that her love for me was missing. She waited two months then she decided to broke up with me because It didn't return.\n\nThe break up shocked my entire being but right now, even though I still have some physical problems, I think (hope?) I am half-way healed.\n\nThere are still things that haunts me.\n\nThe first one is my future life with her. Before the break up I was studying hard to get a job so that we could go live togheter as soon as possible. I was dreaming about waking up with her, cuddle her wearing pajamas every time I could, coming home after work to cook, eat and watch film togheter and travel when we had free days. Another one odd thing I miss is her family. She has a big one and every one was so kind to me during. I've already did all these thing with her, I just wanted to keep living like this for the rest of my life.\n\nA little premise: we are friends right now. For her it's no problem while for me it's still weird and occasionally painful but I think that it's helping me more than no contact. I'm also making her questions sometimes because I still don't fully understand why she broke up with me and I would like to know.\n\nThe second thing now. A week after our break up she fall in love with another guy. In our last month toghter his name pop off from time to time. The thing that is \"killing\" me is that now is that I've never seen her so happy. My friends keep telling me that it's normal in the beginning of a relationship but I don't remember her being so happy when we got toghter. Another proof is that when we were knowing each other she told me that she was not made for long range relationship and that if we would have stayed a couple months apart without seeing eachother she would have left me. This guy is 6 hours of train from her, they are seeing eachother a couple of times a month and she still wants to be with him. Out of curiosity I asked her what she found in him and she said that they were almost identical.\n\nI'm really happy for her because he seems her soulmate and I want only the best for her but I can't hide the fact that it's so damn painful thinking that she found someone that made her happier than I ever did. I'm afraid that I got her for granted and she slowly started to lost interest in me.\n\nI'm also worried that I'll never find another girl attractive and cute, quirky and open minded like her.\n\nI made this post because I don't know how to handle this situation. She was my first relationship and I think I was really in love with her. \n\nTL;DR My EX GF (26F) broke up with me (24M) after 2 years and a half a month ago. I'm still in love with her and I miss the future we would liked to have. 1 week after the breakup she fell in love with a guy and he seems her soulmate. I'm really happy for her but at the same time I feel really bad about it. How do I handle this?",
        "created_utc": 1678790273,
        "upvote_ratio": 1.0
    },
    {
        "title": "which one is the mature choice",
        "author": "TheRealSnitty254",
        "url": "https://www.reddit.com/r/relationships/comments/11r2pl0/which_one_is_the_mature_choice/",
        "text": "[removed]",
        "created_utc": 1678790240,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (26F) boyfriend (27M) didn't tell me about his birthday party plans. Am I overreacting?",
        "author": "impossible-daisy",
        "url": "https://www.reddit.com/r/relationships/comments/11r2mvz/my_26f_boyfriend_27m_didnt_tell_me_about_his/",
        "text": "[removed]",
        "created_utc": 1678789969,
        "upvote_ratio": 1.0
    },
    {
        "title": "25F 30M Baby rabies - how to get rid of/lessen my (25F) case",
        "author": "ekot1234",
        "url": "https://www.reddit.com/r/relationships/comments/11r2m74/25f_30m_baby_rabies_how_to_get_rid_oflessen_my/",
        "text": "25F, 29M\n\nDating almost 2 years. I (25F) moved in with him at around 6-7 months in due to my mom getting Covid multiple times and it just made sense. We have a healthy relationship besides the typical disagreement. \n\n\nRelevant info is I have a IUD for birth control that’s good for another 5 years. \n\n\nWe’ve already discussed getting engaged, getting married, kids, pets, etc. \n\n\nEngagement timeline is max 2 more years. (Need a little more financial stability)\n\n\nWedding timeline is max 3-4 years. (Would be a courthouse wedding and small family get together afterwards so not too costly)\n\n\nKids timeline is max 5 years. \n\n\nPets timeline is sometime before or after were married.\n\n\nNow I know that it is different for every couple, but I’ve had a bad case of baby rabies for a while now. We are not in the best place financial and I know that logically it does not make sense to rush things and just make us more stressed. I am aware that it’s hormones too. \n\n\nBut I keep wanting a kid and a pet. Again, the logical part of my brain keeps telling me that we’re not ready financially and I know that it’s right. \n\n\nHow do I make the baby rabies stop or lessen in intensity? It’s driving me crazy and I can only imagine driving BF crazy too. \n\nTL;DR! I (25F) have bad baby rabies and it’s driving me and BF (29M) crazy. Please help.",
        "created_utc": 1678789900,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to mildly send back my GF to friend zone?",
        "author": "Tchailopikk",
        "url": "https://www.reddit.com/r/relationships/comments/11r2m6d/how_to_mildly_send_back_my_gf_to_friend_zone/",
        "text": "I have decided this is the best I can do after my first-ever relationship. \n\nReason: I guess some mistreatment such as emotional extortion or invalidation of my inner self.\n\nReason not to: I reached the point of dreaming I couldn't leave her owing to I wouldn't find anyone again ever in my life and, therefore, no more hugs or loving cares.\n\nI am a twenty-two year-old man and my girlfriend is a year younger.\n\nIf you need me to share something more, please tell me in the comments.\n\nTL;DR: I want to leave my gf since I think she is toxic, but I have fear of her reaction/being endlessly alone.\n\nThanks in advance.",
        "created_utc": 1678789898,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I [21M] tell my girlfriend [19F] that I don’t like one of her friends?",
        "author": "Izur777",
        "url": "https://www.reddit.com/r/relationships/comments/11r2lhx/how_do_i_21m_tell_my_girlfriend_19f_that_i_dont/",
        "text": "So long story short, my girlfriend that I’ve been dating for almost 4 months now has a friend from high school, lets call him Bob. When we started dating, she told me that Bob would occasionally ask her for nude photos or even ask her for sex. I didn’t think much of it at first, she told me he only really asks when he’s “lonely”. But, she still considers Bob a friend, and keeps in contact with him on Snapchat. And now that I think about more I’m a little bothered that she still talks to the guy. For one, I don’t understand why she’d want to be friends with someone who could potentially ask for nudes/sex while she’s in a relationship. Secondly, I don’t understand why this guy would ask her for nudes/sex if the answer he got was always a “no”… but I think that might just be me overthinking and getting a little too insecure, IDK tho. Regardless, this Bob guy just seems a little slimy and I don’t really like the dude. I just don’t know how to have this conversation with my girlfriend.\n\ntl;dr I don’t like that my girlfriend is friends with a guy who asks her for nudes/sex, but don’t know how to tell her.",
        "created_utc": 1678789831,
        "upvote_ratio": 0.99
    },
    {
        "title": "(F21) I've been very insecure in my relationship with bf (M20) and i don't know if its my gut feeling or not .",
        "author": "sadzay",
        "url": "https://www.reddit.com/r/relationships/comments/11r2lcz/f21_ive_been_very_insecure_in_my_relationship/",
        "text": "sorry if the formatting is off im using mobile. tl;dr at the end.\n\nA little backstory, Ive been with my boyfriend for about 9 months now and will be until i move there next year, we met while I was on an exchange semester and became long distance right after. Ever since we became long distance I've been getting increasingly insecure in the relationship for no apparent reason. So far he has not given me many reasons to not trust him except some little things i have overthought into oblivion.\n\nSo one of the main problems is that, he has a girl best friend and i know thats cliche but hear me out. They met only a year before we did and instantly he developed a crush on her but she rejected him so \"he got over it\" and they went on as best friends, i have had no reason to not trust him on this since we talked about it before and he reassured me + she has a bf now however he talks about her very frequently since they hang out often, in which he skipped on our planned calls a couple times for it, i tried not to overthink that since it was all three of them meeting up. And all three of them talk in great detail about sex which makes me uncomfortable since i have to hear \"oh she did this and that\" pretty often. \n\nThe one incident i cant forget is when she got with her bf and he found out about it he was really bummed since her boyfriend is pretty similar in personality to my bf, \" why couldnt she date me then, all the reasons she gave abt not dating me are all the things her boyfriend has as well\" and i consoled him bc he was sad but i just could not forget it, later when i brought this up while having the \"best friend talk\" he got sad only bc she told him she got with her bf a little later, but i do not believe him on this since his exact words were the ones i wrote above.\n\nThere are small other things that are not related to the best friend as well like still keeping in contact w his ex crushes and him following and unfollowing an OF girl at the beginning of the rship. I am aware this all sounds a bit bad on his part but he has reassured me many times about all of these. \n\ntl;dr : im afraid my bf cares more about his best friend than me and/or still has feelings for her. \n\nSince we are long distance for at least one more year, I just cant shake this bad feeling. What should I do?",
        "created_utc": 1678789818,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to mildly send back my GF to friend zone?",
        "author": "Tchailopikk",
        "url": "https://www.reddit.com/r/relationships/comments/11r2kmw/how_to_mildly_send_back_my_gf_to_friend_zone/",
        "text": "[removed]",
        "created_utc": 1678789748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I wrong for wanting boyfriend with me after my cat died?",
        "author": "Humble_Grand_5626",
        "url": "https://www.reddit.com/r/relationships/comments/11r2j84/am_i_wrong_for_wanting_boyfriend_with_me_after_my/",
        "text": "I feel really flat about my cat passing away today. She was a beautiful cat who I have had since I was 7, F(24) have had her in my life for 16 years! \nI let my boyfriend M(25) know what had happened and he called me after work - he was supportive and understanding.\nI asked him if he could come over to be with me as I’m feeling sad and a-bit shocked my cat had passed so suddenly (she was hit by a car). \n\n\nHe initially said ‘yes’ but over an hour later when I asked him if he was on his way he called me to explain how he does not want to come over as he feels uncomfortable about the situation and that death is a ‘very sensitive topic for him’ (For context, he lost his elderly grandpa who he was very very close with a few years back and it was quiet devastating for him, he has also said in the past that death is his biggest fear). \n\n\nI consoled him and let him know I understand that death makes him feel quite upset and anxious but at the same time I also tried to explain to him that it too makes me sad and I feel similar ways to him; albeit, it’s not my my biggest fear but it still is a very scary notion to me that those I love may not be here one day….\n\n\nHis reply after trying to explain this to him was that “I do not feel the same way as him about this topic and that it’s unfair that I am making him come over to be with me as he is feeling really uncomfortable”. \nAfter this reply of his I said to him that “I feel hurt he won’t be with me to support me at this time”. \n\n\nHe said that me feeling hurt over this was silly and that I should take his view into account. He said he would come over but wants me to know that he is not happy about it and believes I am being somewhat selfish! \n\n\nAm I the as***le for wanting him to be with me? Am I being to sensitive?\n\n\nTL;DR , I’m confused as to if I’m being selfish because I won’t my boyfriends support after the passing of my cat. I know the topic of death makes him uncomfortable, but still want him to be by my side tonight.",
        "created_utc": 1678789596,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to mildly send back my GF to friend zone?",
        "author": "Tchailopikk",
        "url": "https://www.reddit.com/r/relationships/comments/11r2hru/how_to_mildly_send_back_my_gf_to_friend_zone/",
        "text": "[removed]",
        "created_utc": 1678789441,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I learn to be more emotionally open? I want to tell my partner and my friends and family how much they mean to me, but I find it so hard.",
        "author": "mrsvixstix",
        "url": "https://www.reddit.com/r/relationships/comments/11r2da1/how_can_i_learn_to_be_more_emotionally_open_i/",
        "text": "[removed]",
        "created_utc": 1678788974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [26M] want to ask out my friend [26F] of nearly 12 years on a date, but I'm worried I'll make her uncomfortable?",
        "author": "Throneaway85",
        "url": "https://www.reddit.com/r/relationships/comments/11r2c2t/i_26m_want_to_ask_out_my_friend_26f_of_nearly_12/",
        "text": "Hey all, I'll try to keep this as concise as I can but give you all enough context. If you dont care for too much detail, the TLDR is fine.\n\n____________________\n\nMy friend and I have known each other since we were about 14 or so. We became friends in high school and had the same friend circle, some of which are still in that same circle today. We dated (high school dating, so nothing really too serious) our sophomore year, broke up about 8 months in or something, then became friends again the summer after. Since then, we've hung out in groups and solo over the next decade.\n\nFor, I want to say, 7 years of that time, she dated another friend of ours. To keep this from becoming about that huge, insane mess, he was an absolute shit head to her and despite the length of their relationship, she was apparently checked out of it for a while as he treated her awfully. He has since been mostly phased out of most of our lives.\n\nDuring this stretch as well, I dated a few different people. One of which I dated for about 3 1/2 years and nearly married. I have a pretty good history of staying friends will all of my exes, and this one is no different. Granted, we broke up only 3-4 months ago, we are both handling it very well as far as I can tell.\n\nSo in this time since my breakup, I've been spending doing some casual dating and spending a lot of time with my friends. Some of that is at people's houses, but when we go out to the bars, normally I go with the friend this post is about and maybe one or two other people. We get along really well - for the most part we always have despite some hiccups here and there (my autistic ass at one point not realizing I was being mean LMAO). It's been a blast the past few months just hanging out with her when we get the chance to go to the bars and stuff. She's honestly always been someone I've been extremely comfortable talking to.\n\nAnyways, here's the thing. In full honesty, I've seen her in a platonic since basically high school. I'm not sure what changed, maybe it was the alcohol, but one of the recent times we were out at the bar I was in the middle of just a normal conversation with her and something clicked in my brain. I kept myself from being impulsive that night, went home to sleep off the drink. Few days pass, still kind of feel like a crush started to develop. Here we are now, a number of weeks later, and for some reason I can't help but want to take her out to go do something just the two of us and show her that I am interested!\n\nWe have a couple small group things coming up (like a concert with me, her, and two mutual friends as well as a vacation trip in a few months with the same group). So, it's not like I wont have opportunities to talk to her a lot in person. Do you think this is something I should just try to ignore, or is it worth just shooting the shot? I know she has had other guys in the friend group ask her out but she hasn't had interest in them specifically. It also hasn't affected their friendship, which is nice. I don't know, I'm a pretty picky guy, but I think I'm getting a crush on her again after all these years.\n\nWhat are your thoughts? Is it inappropriate? Bury it and just keep what's going on, or maybe try to see what she thinks? I don't want to make her feel like \"oh great, another friend wants in my pants\" or whatever, so a lot of my worry is less about rejection and more about if it'll make her feel uncomfortable.\n\n___________________________\n\n**TL;DR** A friend of 12 years and I are both relatively recently single and have been spending a decent amount of time together. While I normally think of her in a platonic way, I'm developing at least a crush and at most some feelings for her. Should I leave it well enough alone or live a little?\n\nThanks everyone!",
        "created_utc": 1678788857,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA? - My boyfriend is upset that I want to see him after my cat just died.",
        "author": "Humble_Grand_5626",
        "url": "https://www.reddit.com/r/relationships/comments/11r29yk/aita_my_boyfriend_is_upset_that_i_want_to_see_him/",
        "text": "[removed]",
        "created_utc": 1678788634,
        "upvote_ratio": 1.0
    },
    {
        "title": "F39 ghosted 2mnths ago after 9mnths by M30. He cares about his reputation so none of our common friends know what he’s done. Do I announce it?",
        "author": "23MB303",
        "url": "https://www.reddit.com/r/relationships/comments/11r221s/f39_ghosted_2mnths_ago_after_9mnths_by_m30_he/",
        "text": "We met when I was just out of an abusive relationship with a narc. I wasn’t keen but he took his time to earn my trust. Almost a year together and I thought that might finally be it. Long story short after a lot of future faking he ghosted me, today is 2 months. I now know he’s BPD.\n\nThe help I need with is, he’s keeping his tabs on me, checking my insta stories and when he doesn’t all his friends do. I want everyone to know what he has done, because I bet he hasn’t told truth to anyone of what he has served me. One of my friends met him randomly at a party and confronted him and he was trying to deny it was ghosting! He puts A LOT of effort into maintaining very good reputation “what a guy! What an amazing person” - that’s what he likes to hear and it triggers me so bad. Sometimes I just want to send all his friends a message letting them know what he has done, or share a suggestive story or something. What would reddit do?\n\nTL;DR\nF39 ghosted 2mnths ago after 9mnths by a BPD M30. He cares about his reputation so none of our common friends know what he’s done. Do I announce it?",
        "created_utc": 1678787827,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf of 2 years texted a hooker (m22)(f22)",
        "author": "justher2000",
        "url": "https://www.reddit.com/r/relationships/comments/11r1wim/my_bf_of_2_years_texted_a_hooker_m22f22/",
        "text": "[removed]",
        "created_utc": 1678787221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tl;dr F39 ghosted 2mnths ago after 9mnths by M30. He cares about his reputation so none of our common friends know what he’s done. Do I announce it?",
        "author": "23MB303",
        "url": "https://www.reddit.com/r/relationships/comments/11r1wby/tldr_f39_ghosted_2mnths_ago_after_9mnths_by_m30/",
        "text": "[removed]",
        "created_utc": 1678787199,
        "upvote_ratio": 1.0
    },
    {
        "title": "me (28F) 20 weeks pregnant and he (37M) has left me I'm sure for his ex.",
        "author": "ThrowRAGL1",
        "url": "https://www.reddit.com/r/relationships/comments/11r1uzp/me_28f_20_weeks_pregnant_and_he_37m_has_left_me/",
        "text": "[removed]",
        "created_utc": 1678787068,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(f22) bf(m22) of 2 y texted a hooker",
        "author": "justher2000",
        "url": "https://www.reddit.com/r/relationships/comments/11r1t0h/myf22_bfm22_of_2_y_texted_a_hooker/",
        "text": "[removed]",
        "created_utc": 1678786852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghosted for the 1st time 2 months ago after 9 months of steady and upwards and he continues to confuse me.",
        "author": "23MB303",
        "url": "https://www.reddit.com/r/relationships/comments/11r1sk2/ghosted_for_the_1st_time_2_months_ago_after_9/",
        "text": "[removed]",
        "created_utc": 1678786807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I (41F) wrong for putting my niece (21F) in her place for trying to take my money?",
        "author": "Letsgowithlego",
        "url": "https://www.reddit.com/r/relationships/comments/11r1kxf/was_i_41f_wrong_for_putting_my_niece_21f_in_her/",
        "text": "[removed]",
        "created_utc": 1678785987,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [M21] little sisters [18F] best friend [19F] keeps trying to seduce me, my sister said she wouldn't be okay with us being together.",
        "author": "throwRAIloveThc",
        "url": "https://www.reddit.com/r/relationships/comments/11r1556/my_m21_little_sisters_18f_best_friend_19f_keeps/",
        "text": "My younger sister has been friends with her for as long as I could remember. I have always been kind to her friend, but we never really started getting close up until a couple months ago. She comes around more often and I see her a couple times a week .\n\nI know she's kind of young being that I am 2 years older than her, but we both get along super good and I think she and I would do just fine together since we are looking for the same thing in a relationship (we both want someone serious and we want to have kids soon). \n\nI do like her just as much as she likes me, but my sister definitely does not approve of us potentially being together. I know because my sister told ger best friend to stop hitting in me so much in front of her, and she thinks that it would be weird of us to date. \n\nHer friend does a lot to try and get me into bed with her and I admit, we have messed around and I went down onnher once, but it didn't go much farther than that at the time. Now I am torm because I really like her, but my sister wouldn't forgive me if I went behind her back to be with her friend when I told her I wouldn't pursue it before.\n\nWhat can I do to get my sister to understand my feelings for her friend? I don't think things would end bad, but my sister thinks otherwise. \n\nTLDR: Younger sister's best friend wants to be with me, I like her a lot, but my sister said she would appreciate it ifI didn't pursue her friend.",
        "created_utc": 1678784365,
        "upvote_ratio": 1.0
    },
    {
        "title": "F23 M21",
        "author": "Current_Good_5967",
        "url": "https://www.reddit.com/r/relationships/comments/11r11e9/f23_m21/",
        "text": "[removed]",
        "created_utc": 1678783940,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fairly share the bills?",
        "author": "odelaxy",
        "url": "https://www.reddit.com/r/relationships/comments/11r119q/how_to_fairly_share_the_bills/",
        "text": "[removed]",
        "created_utc": 1678783925,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Maybe) loosing feelings for my girlfriend",
        "author": "Fabulous_Card4036",
        "url": "https://www.reddit.com/r/relationships/comments/11r0vym/maybe_loosing_feelings_for_my_girlfriend/",
        "text": "So me (M16) and my girlfriend (F16) have been dating for about 6 months, recently we haven’t had much intimacy for some reason. (We decided against sex before marriage, but I’m talking about soft-core things like making out and stuff like that). It’s not like there haven’t been so many times where we had the chance and nobody was at my house. It’s more: I’m feeling it, it’s a good time to do things, and she doesn’t feel comfortable with anything for that day and shuts down the idea of us doing anything. It’s been like this for about 2 weeks, she doesn’t let anything happen because she doesn’t feel comfortable (understandable). But I’ve noticed some changes in my behavior. I’ve started being less patient with her when she gets on my nerves, I’ve started (unwillingly) being more cold to her, and subconsciously resenting her, started being less willing to do things for her, I’ve started to just kinda stop caring about her. I’m wondering if it’s because I haven’t had a sexual release with her in a longer-ish period of time, therefore I don’t feel the obligation to satisfy her needs if she can’t even satisfy mine and I kinda go cold with her. Im also wondering if that’s a normal thing for someone to do: being withheld from sexual pleasure from their partner, therefore stop caring about them as a whole. And I’m not TRYING to loose feelings or make her feel unloved, I just don’t feel the need to because I just don’t get any sexual positives from the relationship and it feels like I’m just doing everything FOR HER. Is this normal?\n\nPS: we had a talk about this, she she got super mad at me and said that this makes her feel like I only want her for her body and that’s all she offers in the relationship and she won’t just go out if her comfort zone just for my pleasure. Understandable. But I feel like there’s a balance from staying within your comfort zone, and completely withholding sexual pleasure from your partner. \n\nTL;DR Girlfriend stopped intimacy with me, I subconsciously stop caring about her as a result of that.",
        "created_utc": 1678783335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to be amicable for our futures, but losing patience.",
        "author": "unexpectedhalfrican",
        "url": "https://www.reddit.com/r/relationships/comments/11r0rdv/trying_to_be_amicable_for_our_futures_but_losing/",
        "text": "I (31f) am divorcing my wife (36f) of 10 years. Though I was the one who asked for the split, the decision was mutually made, and we decided to be amicable and responsible about it because while we are no longer in love, we still care about each other. \n\nThe situation we decided on was to continue living together (though in separate rooms) until we paid off all our shared debt (roughly 12k at this point, I have already paid off about that much as well) and saved up a bit so we would both be starting off our new lives comfortably. Initially this should have taken around two years. Long, but better in the long run.\n\nHowever, I started a new job about a year ago and I now make roughly 2-4x what my wife makes, so I knew the debt payoff would fall largely to me. I'm mostly okay with this since it meant we could be separated in less than a year. \n\nI try very hard not to police my wife's expenses because she takes great offense when I do. I know she doesn't like not being the breadwinner anymore, and she doesn't want to feel like I have her on a leash. I don't want that either, however she has continued to spend on the credit cards that I am trying to pay off, sometimes running up hundreds of dollars on cards that I previously *had* paid off. This is infuriating for obvious reasons. I had to beg her to stop spending and she mostly did. One problem down. \n\nThe other issue is household issues. I work anywhere from 70-80 hours per week, including multiple 16 hour shifts per week, sometimes even picking up shifts on my days off in order to continue paying off our debt at the rate I am (roughly 1k every other week). My wife works *at most* 40 hours per week, but frequently less, although her job is much more labor-intensive. When she isn't working, she usually watches reality tv while facetiming with her friend, or she goes out on dates with her new gf. When I'm not working, I'm sleeping.\n\nI assumed (stupidly on my part) that since I worked more and longer hours and brought in the most money, she would clue in and pick up the slack with housework. I am barely ever home (and when I am, I am sleeping), so it's not like I expected dinner every night, just that she basically clean up after herself. I don't cook. I order out or eat at work. She bakes extensively and cooks for herself. The kitchen was left in such a state for so long, I refused to go in it. She got 2 cats, 1 without even consulting me, so she promised to clean up after them. She feeds and cleans their litter box, but frequently does not vacuum their fur or bits of cardboard from their scratching posts. I clean the bathroom on my day off and take out the trash that has piled up throughout the week.\n\nRecently, the apartment was in such a state that it was taking a massive toll on my mental health. There wasn't a clear path to my room. Every surface of the kitchen was covered in trash and dirty dishes. The dining room table was covered in junk. I didn't want to come home anymore. I was debating taking out a personal loan (even with the state of interest rates these days) so that everything could be paid off *now* and she could gtfo and I would just pay everything off myself. Finally, I spent one of my precious days off cleaning the apartment top to bottom. I barely got a thank you. \n\nBasically, I want to know...am I crazy? Am I expecting too much? How do I deal with this? It seems fair to me that since she works fewer hours and I'm the one paying the majority of the bills, she should pick up the majority of the housework. Is that wrong? Am I being arrogant or unfair? And if not, what can I do to help with this situation? I'm so frustrated and annoyed and I don't feel like it's fair that I work all the hours, pay all the bills, AND do all the housework.\n\nTL;DR: I am divorcing my wife but we are living together until our mutual debt is paid off. I work double the hours, make 2-4x the money, pay 75% of the bills, pay 100% of the debt, and now seem to be expected to do 100% of the housework too. My soon to be ex's job is more labor-intensive but half the hours and 1/3 of the pay. Am I expecting too much from her?",
        "created_utc": 1678782849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I crazy",
        "author": "Subject_Swordfish_54",
        "url": "https://www.reddit.com/r/relationships/comments/11r0raz/am_i_crazy/",
        "text": "[removed]",
        "created_utc": 1678782840,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked for his name... He replied \"why\".. I'm so crushed. I had a huge crush on him",
        "author": "upbeatbeans",
        "url": "https://www.reddit.com/r/relationships/comments/11r0nuo/i_asked_for_his_name_he_replied_why_im_so_crushed/",
        "text": "\n\n\nTLDR; The guy (20s) I'm (20s F) interested in goes to one the classes I take in uni. I tried to make small talk and in ten seconds when I asked for his name, he replies \"why\" \n\nDoesn't that mean he has absolutely no interest whatsoever\n\n\n\nI said never mind... Got so embarrassed and left the place\n\nIt's not like I asked any personal details. Why does he have to be like this.. I'm moving, leaving town soon so I decided to shoot my shot before I get my credit transfer in uni\n\nI should leave him alone from now on, I'm guessing, cos I feel like this is his way of telling me that",
        "created_utc": 1678782485,
        "upvote_ratio": 1.0
    }
]