[
    {
        "title": "Does faith or belief matter at all, I believed the big bang was likely, I believed I could cross the road in time, I believed many things that were later found to be untrue, so does only KNOWING matter?",
        "author": "Leia-1",
        "url": "https://www.reddit.com/r/religion/comments/11tpw87/does_faith_or_belief_matter_at_all_i_believed_the/",
        "text": "[removed]",
        "created_utc": 1679056656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evangelio de Hoy Viernes 17 de Marzo de 2023 en el Cenaculo | www.youtub...",
        "author": "PrayintheCenacle",
        "url": "https://youtube.com/watch?v=MxmASBRJHJQ&amp;feature=share",
        "text": "",
        "created_utc": 1679055398,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navratri - A festival of devotion",
        "author": "MaleficentFinance633",
        "url": "https://www.viralbake.com/navratri-a-festival-of-devotion/",
        "text": "",
        "created_utc": 1679055246,
        "upvote_ratio": 1.0
    },
    {
        "title": "The quest for the truth and me ending up accepting that we may never know.",
        "author": "Rizogalos",
        "url": "https://www.reddit.com/r/religion/comments/11tnzq9/the_quest_for_the_truth_and_me_ending_up/",
        "text": "Even though I was raised as a Christian, I ended up losing my faith because I simply began to doubt how much truth there was in this religion.\n\nKnowing that in general the world believes in something, (myths, legends, theories, ideas, religions) I began to wonder if there is a reason why my religion (Christianity) is the right and true one.\n\nLearning some little things about how Christianity spread, about how many disagreements and different interpretations there are about the bible, about some books being accepted/rejected by different Christian denominations, about the various translations, about the MAYBE contradictions that exist in the verses and in general about the role of the church (such as making various rules and admiring Christian people whose words were NOT always correct), they really made me believe that Christianity is just a religion where inhumans tried to understand the unknown , to give meaning to their lives and to put some rules in people's lives.\n\n\nwhenever I generally started looking for what else there is besides religion. I started reading various theories as it is\n\nthe simulation theory: https://www.youtube.com/watch?v=fHzqPBus_aE\n\nthe prison earth theory https://www.youtube.com/watch?v=oZZ7zHj31Y0\n\nthe theory of the soul as quantum information after death https://www.youtube.com/watch?v=Sp7nMzHhJHw\n\nand more generally stories of people who claim to have seen the truth after meditation, drugs https://old.reddit.com/r/Psychonaut/\n\nStories of people who had after-death experiences.\n\nSo, taking into account all that I mentioned I feel confused about life, a bit anxious but I think gradually I will feel better. Avoiding hearing/learning about something so it doesn't cause worry isn't the answer, so I think it's good for me to think/talk about it.\n\nWhat do you think? I've come to the conclusion that it's good to learn to read about these TOO, but it's good to focus on things we can control/improve/know and accept that everything else is just theory and we might learn something while we live or/ and after death but maybe not.",
        "created_utc": 1679051231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has the revolution in “Information &amp; technology” affected religion?",
        "author": "Fickle-Dance-752",
        "url": "https://www.reddit.com/r/religion/comments/11tmohb/how_has_the_revolution_in_information_technology/",
        "text": "Since the widespread use of the internet and easy access to information, I no longer feel compelled to blindly accept the opinions of religious individuals or pastors attempting to persuade me with falsehoods. I have observed members of my community fabricating implausible stories of modern-day miracles, such as meeting the Mahdi or experiencing inexplicable healing. Fortunately, with the internet, I can engage in discussions with people and gain their perspectives on such matters. By utilizing this resource, I can now seek out information and make more informed decisions based on facts rather than hearsay.\n\nHow did the internet affect you religious views?",
        "created_utc": 1679047113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Must read for a Christian",
        "author": "Ambitious-Toe4162",
        "url": "https://www.reddit.com/r/religion/comments/11tmmuu/must_read_for_a_christian/",
        "text": "I've been observant of God for many years, and after studying the subject in depth I came to the following observation:\n\nThe only part of the bible you need to study is the Sermon on the Mount.\n\nFeel free to take it how you want, but it does ring true in my life and it is my favorite part of the bible.",
        "created_utc": 1679046960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between karma/reincarnation in hinduism and buddhism",
        "author": "Uphihion",
        "url": "https://www.reddit.com/r/religion/comments/11tlrz3/difference_between_karmareincarnation_in_hinduism/",
        "text": "Hi!\n\nI'm trying to learn more about hinduism and buddhism and have a question. Both religions use the terms karma and reincarnation but they seem to use them in slightly different ways and they don't really seem to mean the same thing in buddhism as they do in hinduism. What do these terms mean in respektive religion and what are the differences? Thanks!",
        "created_utc": 1679044088,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know what to do now",
        "author": "Janinecka",
        "url": "https://www.reddit.com/r/religion/comments/11tl25y/i_dont_know_what_to_do_now/",
        "text": "I'm still a child, my parents are christians and they expect me to be a Christian as well but I don't really want to, but I'm also afraid it could be true and I would once go to hell for this decision and I'm extremely afraid and I don't know how to make this choice, I feel like whatever I do, I'm wrong. When I try to be a Christian, I feel like it's not something I want, but when I tried not being a Christian, it also felt wrong.",
        "created_utc": 1679041468,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent do you bring your own judgment to the table?",
        "author": "Far_Illustrious23",
        "url": "https://www.reddit.com/r/religion/comments/11tkkrz/to_what_extent_do_you_bring_your_own_judgment_to/",
        "text": "**Please DO NOT send me any DM's on this topic.** Post all your comments here please.\n\nMy own judgment is the majority of how I approach this world. I think God gave us judgment for a reason. You don't need someone to teach you to help the poor, that murder is wrong, that no single race is superior to the others. It is natural to know what a good person is, if not to be a good person yourself.\n\nIf I read the Bible, the Koran, or any other book, I read it with the lens of my own judgment. Of course, I might look to other resources for historical context, but overall, I'm using my own judgment.\n\nDid Jonah live in the belly of a whale?\n\nMy personal judgment says no, that did not literally happen, because it's not possible to live in the belly of a whale.\n\nMy personal judgment also says that's not the point of the story. The point of the story is that you can make mistakes and turn back. You don't need to be stuck in a metaphorical whale's belly forever. Jonah understood his mistakes and made it out. So can you.\n\nUltimately, I think God gave you a brain for a reason, because he wants you to use it.\n\nI'm curious to hear other people's thoughts on this.",
        "created_utc": 1679039652,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am creating a Christian game of the parable of Jesus: The Lost Sheep. The Lost Sheep is looking for the way home. Can she find her way in time? For further information, sign up: https://biblegamesproject.com/ #gamedev, #madewithunity, #screenshotsaturday, #gaming, #indiegame, #biblegame, #bible",
        "author": "BibleGamesProject",
        "url": "https://v.redd.it/69ahdfm3w8oa1",
        "text": "",
        "created_utc": 1679035220,
        "upvote_ratio": 1.0
    },
    {
        "title": "The oldest fire in the world (Zoroastrianism)",
        "author": "MoreGull",
        "url": "https://i.imgur.com/zIrkXIf.jpg",
        "text": "",
        "created_utc": 1679027374,
        "upvote_ratio": 1.0
    },
    {
        "title": "TheIrishElm32(the.irish.elm) is LIVE",
        "author": "TheIrishElmMedium",
        "url": "https://www.tiktok.com/t/ZTR7Q9VBm/",
        "text": "",
        "created_utc": 1679025467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everyone, I made a video essay about Zoroastrianism from an insider perspective. Please check it out!",
        "author": "Ashemvidam",
        "url": "https://youtu.be/si95MBdUm7k",
        "text": "",
        "created_utc": 1679025149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you consider it a red flag if someone refuses to talk about their religion or even what their faith is?i",
        "author": "misanthropicsuccubus",
        "url": "https://www.reddit.com/r/religion/comments/11tg69e/do_you_consider_it_a_red_flag_if_someone_refuses/",
        "text": "For those who are religious or non religious do you consider it bad if you meet someone whose private about their faith and won't discuss it. Also how long would you allow a person to be private with their faith and how close would you have to be to consider it harmful if you were friends with that person?",
        "created_utc": 1679024794,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Judaism has given me hope in life",
        "author": "GeorgeMGTOW",
        "url": "https://www.youtube.com/watch?v=Mf8aQG-5rSc",
        "text": "",
        "created_utc": 1679018024,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on the Mahabharat being true?",
        "author": "TheGrandGarchomp445",
        "url": "https://www.reddit.com/r/religion/comments/11tdi9m/what_are_your_thoughts_on_the_mahabharat_being/",
        "text": "I've been reading the Mahabharat. It seems pretty realistic except for a few supernatural things. There are some good arguments for it not being fake. For example, the astras, weapons of mass destruction, could be fake. However, my parents have an interesting explanation for that. They say that those weapons could have been so strong that people decided to let them die out for the sake of peace. What are your thoughts on this and other possibly fake stuff from the Mahabharat?",
        "created_utc": 1679017366,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is most likely right?",
        "author": "blue_boi226",
        "url": "https://www.reddit.com/r/religion/comments/11td7zj/what_is_most_likely_right/",
        "text": "[removed]",
        "created_utc": 1679016586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Religious Literacy Decrease Polarization?",
        "author": "kl_ipub",
        "url": "http://ipubforum.com/2023/03/10/will-religious-literacy-decrease-polarization/",
        "text": "",
        "created_utc": 1679016548,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the Plagues of Egypt, was Egypt meant to be the land just around the Nile or the rest of the Egyptian Empire in the New Kingdom (when most people suggest it would have happened)?",
        "author": "Awesomeuser90",
        "url": "https://www.reddit.com/r/religion/comments/11td0h3/in_the_plagues_of_egypt_was_egypt_meant_to_be_the/",
        "text": "Egypt in the New Kingdom period about 3500 years ago extended from Southern Turkey to Sudan. Would the Plagues of Egypt be normally interpreted to include all of this population or just the Nile region?",
        "created_utc": 1679016032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extremely small religious minorities, what does your community believe?",
        "author": "jockmcgraw",
        "url": "https://www.reddit.com/r/religion/comments/11tcswd/extremely_small_religious_minorities_what_does/",
        "text": "By extremely small, I mean groups such as the Samaritans, Zoroastrians, Yazidis, Druze, smaller Jewish sects, various Indigenous faiths, etc\n\nMy own faith is a bit different. We are an ethno-religion with non-ethnic members, like myself. I do not hold the same status as an ethnic Karaite, like the communities in Russia, Poland, Lithuania, Ukraine, etc. Those communities though, also have non-ethnic members. We view ourselves as a sub-sect of the Israelite religion, descended from Judaism, but ethnically/religiously distinct. Many of us are Jews, like myself, but many of us are also ethnic Russians, Ukrainians, Tatars, Georgians, etc. \n\nWe believe in only the Tanakh in its plain meaning. We do not have clerics and we believe interpretation is up to the individual Karaite (ethnic member) or Karaitzer, Karaite Subbotnik, Karaimite, etc (Various terms for religious, non-ethnic Karaites). Though, this view outside of Eastern Europe does not exist and conversions have been re-allowed, with a program that I myself am apart of.",
        "created_utc": 1679015464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparative natural hamartiology: common \"sins\" across religions",
        "author": "kaioaf",
        "url": "https://www.reddit.com/r/religion/comments/11tckh3/comparative_natural_hamartiology_common_sins/",
        "text": "What actions and ideas are widely disapproved of or downright prohibited across different religions?\nCould the discouragement or downright prohibition of said actions and ideas have deep biological or social cohesion-related reasons?",
        "created_utc": 1679014845,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one is a Muslim, a Christian, an Atheist, an Agnostic etc.",
        "author": "blazethatfreezes",
        "url": "https://www.reddit.com/r/religion/comments/11tbol6/no_one_is_a_muslim_a_christian_an_atheist_an/",
        "text": "At the core, you are non-conceptual Awareness.\n\nAll these identities are concepts your egoic mind attaches itself to for its own continuation.\n\nEdifices like being religious or irreligious are a dualistic expression of ego.\nBelievers versus non-believers, saint vs sinner, sin and virtue... Right religion, wrong religion.\n\nAll of this is a trick from the ego. \nIt needs attributes to exist.\nIt needs a sense of duality to enforce its illusory existence.\nThe egoic mind feeds itself through the comparison to others and the attachment to concepts.\n\nTo the egoic mind, the truth is boring.\n\nIf you embraced being nothing but Pure Consciousness without attributes, witnessing itself,\nyour ego would dissolve.\n\nRequiring fuel to uphold the illusion of its existence, it keeps clinging to stories like faith or anti-faith.\n\nSome here may have already awoken to the fact that Nisargadatta Maharaj was right when he said:\n\n”This is all a big hoax, a big fraud.“",
        "created_utc": 1679012999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a specific mystical denomenation?",
        "author": "Zarathustra6172",
        "url": "https://www.reddit.com/r/religion/comments/11ta5hv/looking_for_a_specific_mystical_denomenation/",
        "text": "[removed]",
        "created_utc": 1679009607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Underrated books about religion/your religion?",
        "author": "Classic-Asparagus",
        "url": "https://www.reddit.com/r/religion/comments/11t8fx0/underrated_books_about_religionyour_religion/",
        "text": "I’m currently taking a world religions class, and it’s very fascinating. I am still exploring what religion, if any, speaks to me, so I am wondering if you all could recommend me some books that you enjoyed on the subject of religion? Can be anything (obscure religious traditions, autobiography or fictional narrative centered around religion, poetry, graphic novel/comic/manga, guidebook on religion, etc.), as broad or as general in scope as you want, as long as the main subject is religion. Thanks!",
        "created_utc": 1679005803,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one actually sell summon demons or anything supernatural?",
        "author": "leozaur1808",
        "url": "https://www.reddit.com/r/religion/comments/11t51yf/how_does_one_actually_sell_summon_demons_or/",
        "text": "This may sound like a troll post, yet it is not, and I am as serious as one who does not believe in anything supernatural can possibly be. Despite this, I am willing to try summoning a demon, just out of curiosity and pure interest in a topic. After the results of the summoning are obtained and if they appear to be positive, which means that the summoning has been successful, I want to try proposing a deal with one, just to see whether it works or not and to satisfy some of my small desires.\n\n&amp;#x200B;\n\nI have tried searching the web, but I could not find anything that resembles an algorithm to do that, just some SEO optimized blog posts, providing little value for a reader and aimed to gain internet traffic.",
        "created_utc": 1678997962,
        "upvote_ratio": 1.0
    },
    {
        "title": "what should i do when i say something and the someone goes \"wait are you jewish\"?",
        "author": "75987721",
        "url": "https://www.reddit.com/r/religion/comments/11t4n4b/what_should_i_do_when_i_say_something_and_the/",
        "text": "[removed]",
        "created_utc": 1678997007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many religions start from a prophet, yet we all disagree who is correct.",
        "author": "beatbox2sleep",
        "url": "https://www.reddit.com/r/religion/comments/11t4ayv/many_religions_start_from_a_prophet_yet_we_all/",
        "text": "How can anybody be so sure to the point they're willing to fight someone when there are so many commonalities between religions.\n\nI find it quite silly people are so defiant to listen about other religions then boast theirs to be correct when Christianity; Judaism; Islam; Sikhism have all been brought forth by a prophet who claimed either to be a messenger of god or the embodiment of god. Mohammed was told the Quran from  Gabriel. Moses wrote his books as dictated by god. Jesus claimed he was god. Nanak said he was the first guru as granted by god upon birth. It is all based entirely on hearsay, even the Torah.\n\nMost or all of these religions say basically the same thing about how to live life albeit with a few regional differences here and there such as what to eat, how to wear your hair, etc. Yet, millions of people follow these beliefs as absolute truth then in some cases are extremely offended by any differing opinion. It seems ridiculous to me that people don't simply talk about the similarities and differences between religions. In my opinion, skepticism is more healthy than absolute faith. How do we know the ideas and words haven't been deviated since conception?\n\nFurther, some commonalities shared by the Quran, Torah, and Bible are also found in Sumerian. You take that further and you get into the Egyptian Book of the Dead, the history of Ra then Osiris who came BEFORE the common religion of Egypt which supposedly taught law (I use that term loosely) not spirituality. Sprinkle in the fact humans have been around for at least 300k years (and I think at least one million) with esssentially only 2000 years of history, it is easy to assume that all of what we consider now to be \"religion\" have been entirely misconstrued by word-of-mouth over the course of tens of thousands of years. Either that, or your prophet on the mountainside truly did speak with god who told them the history of our past.\n\nThen, even just that, the concept of a prophet in communication with god... they share the history of the region and give advice on how to live. Personally, I've been able to think about how humans could've lived but I wouldn't consider that to be in communication with god on our true forgotten past - I just come to logical conclusions based on what I know of our current society and anthropological data. I imagine an us and everything on Earth in perfect harmony. Does that mean I'm receiving that vision from god? It is just as easy to assume that prophets made everything up and thought they were receiving the information from god because they lacked the self-awareness to understand it was actually coming from their own cognitive processes. It is also possible that through mitochondrial DNA we can actually access a certain level of memory within our genetic structure. Again, this isn't to say it is impossible to have communicated with something but it begs the question of extra-terrestrial intervention. I think it is more likely aliens brought people the information of Earth's history and which strategies of civilization worked the best and what fucked things up and how to avoid them.\n\nWith all that in mind, how you can tell anyone their religion is wrong when yours is just as whacky? I don't even want to get into Mormonism (that's what my family was into when I was a kid). Even the idea of spiritual beings (which I consider to be within the possibility of a different dimension such as a light entity which lives at a speed of vibration unimaginable to the human mind) assumes that they are physical things, leaving the concept of a creator of our universe again beyond the scope of even supposed angels, or, perhaps precisely within the scope of their expertise. 🤷‍♂️ Who tf knows? Stop yelling at people because they believe something different than you do.",
        "created_utc": 1678996239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Antroposofia",
        "author": "MatureMan70",
        "url": "https://i.redd.it/xhdxhwu8n5oa1.jpg",
        "text": "",
        "created_utc": 1678995898,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's so special about Heaven and Hell?",
        "author": "amlextex",
        "url": "https://www.reddit.com/r/religion/comments/11t3ynr/whats_so_special_about_heaven_and_hell/",
        "text": "I have my own idea of what they might entail, but I was wondering how your belief describes both places.",
        "created_utc": 1678995433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kid from the UK visiting the Grand Mosque.",
        "author": "Fickle-Dance-752",
        "url": "https://v.redd.it/z9q89gjs07oa1",
        "text": "",
        "created_utc": 1678994601,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your favourite religious podcasts?",
        "author": "KnotTW0",
        "url": "https://www.reddit.com/r/religion/comments/11t325b/what_are_your_favourite_religious_podcasts/",
        "text": "I'll recommend some first:\nSri ramana teachings \nSelf inquiry \nRam dass be here now\nVedanta talks\nWisdom of the masters\nBuddhist society of western australia \nGuru viking\nI cant believe it's not buddha.",
        "created_utc": 1678993315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't understand how belief is a choice",
        "author": "idontfitincarswell",
        "url": "https://www.reddit.com/r/religion/comments/11t2v3a/i_dont_understand_how_belief_is_a_choice/",
        "text": "(I just want to say I'm not posting this in an attempt to debate or post \"gotchas\". I guess I'm an \"agnostic atheist\" in that I don't believe I possess the spiritual or intellectual capacity to evaluate whether there is a God, and my default assumption is that no religion is necessarily more factually correct than any other. I'm genuinely interested in learning about religion, but the idea of hell makes it so hard for me. I have obsessive compulsive disorder and I obsess over hell a lot, and at the end of the day I want to avoid infinite torture like anyone else.)\n\nOne thing I often read from Christians online is that God doesn't necessarily send people to hell, it's the people themselves who chose to not accept Jesus as their lord and saviour, and therefore chose to be separate from God in the afterlife. I'm just paraphrasing, and I'm sure there is a huge diversity of beliefs about this among Christians, but I have come across that point a lot.\n\nI don't quite understand this idea that someone \"chooses\" not to believe in God. I can't choose what I'm convinced of. I wouldn't feel comfortable saying that Jesus is my lord and saviour because I'm not convinced that any one religion is more factually correct than another, and I can't force myself to be convinced of something. For example, I have had a Muslim and a Christian both tell me personally that I'm going to be tortured in hell for eternity, and both for different and mutually exclusive reasons (no matter what you believe there will always be someone who thinks you're going to hell).\n\nIf I am fully convinced that Christianity is true, to the point where I have spiritual experiences that confirm my faith to me, and then I die and go to Islamic hell, then is it fair to say I chose to be tortured for eternity? Similarly, if I am fully convinced that Islam is true, to the point where I have spiritual experiences that confirm my faith to me, and then I die and go to Christian hell, then is it fair to say I chose to be tortured for eternity?\n\nI have known people of different religions who have claimed to have mutually exclusive religious experiences. The Christian and Muslim I mentioned in the last example have both told me that they speak to God. If only one of them is right, then why does God allow someone to have spiritual experiences and to be convinced that they're speaking to the wrong God? The way I see it (and I don't mean to offend anyone by saying this, this is purely just the observation I'm making), they can't both be right but they can both be wrong.\n\nI'm sorry if this has offended anyone. I have OCD and I obsess over this so much and I just want to avoid being tortured for eternity above all else. Please let me know if you know/can say anything that will clarify things for me. Thank you so much for reading.",
        "created_utc": 1678992894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to recover my faith, but I have my doubts",
        "author": "httptofu",
        "url": "https://www.reddit.com/r/religion/comments/11t2hsg/i_want_to_recover_my_faith_but_i_have_my_doubts/",
        "text": "In short, my family is mostly Catholic except for my mother's side, who are Evangelicals. I spent a large part of my childhood in a Salesian Catholic school, which instilled in me Catholicism.  there was a time when I was a believer, but after a while I was losing my faith.  Now I am an atheist, I do not believe in the existence of any god, I do not believe in the Bible or miracles, everything has a logical and historical explanation in my opinion.\n\n These last few days I have realized that I really miss my faith and belonging to a community like I did before, I want to believe again, but there is really nothing that makes me believe in God and miracles.  I do believe and appreciate Jesus, I don't believe in miracles and their divine origin that they always talk about, but he did deliver a good message of love and acceptance.  I also don't believe in the message of being good in order to be saved, personally I believe that you have to be good not to expect a reward in return, otherwise it's simply not good.\n\n I plan to go to church this Sunday, maybe it will help me, but I also want to find out more about the different branches of Christianity that may agree with my beliefs, Catholicism and evangelism do not, but maybe there are some that I feel comfortable with.  the biggest problem is clearly my disbelief towards the existence of a god.  what do you recommend me to do?",
        "created_utc": 1678992046,
        "upvote_ratio": 1.0
    },
    {
        "title": "am i loosing my religion?",
        "author": "lostinthetrash4ever",
        "url": "https://www.reddit.com/r/religion/comments/11t2d5v/am_i_loosing_my_religion/",
        "text": "Lost a person in my life because i told her i fucked up about something big time and now i just... i cant do this\nI believe God is just and fair, but i cant follow anymore.\nIts a week until Ramadan and im going crazy.\nDetoxing from drugs. Lost the person who cheered me on. Wishing for death, yet i know its a sin..\n\nGod can forgive but can ppl? Can i ? Forgive me?",
        "created_utc": 1678991749,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Way of Victory",
        "author": "StevenLeRoyChilds",
        "url": "https://www.reddit.com/r/religion/comments/11szyrh/the_way_of_victory/",
        "text": "[removed]",
        "created_utc": 1678986488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that okay?",
        "author": "cheezyhun",
        "url": "https://www.reddit.com/r/religion/comments/11szo8g/is_that_okay/",
        "text": "[removed]",
        "created_utc": 1678985865,
        "upvote_ratio": 1.0
    },
    {
        "title": "The World Fairness Agreement",
        "author": "StevenLeRoyChilds",
        "url": "https://www.reddit.com/r/religion/comments/11szm8i/the_world_fairness_agreement/",
        "text": "[removed]",
        "created_utc": 1678985737,
        "upvote_ratio": 1.0
    },
    {
        "title": "To antitheists, what is your proof that eradication of religion would be a societal progress? I mean 20th century atheists like china and soviet union have more blood on their hands than the entire history of islam and christianity combined",
        "author": "Exotic-Put9396",
        "url": "https://www.reddit.com/r/religion/comments/11sywnf/to_antitheists_what_is_your_proof_that/",
        "text": "Is there any documented proof that an atheist (not secular) society or nation has fared better? Do you think eradication of religion is the answer or do you think it should only have a minimal impact on people’s life?",
        "created_utc": 1678984177,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some Celtic Christian practices?",
        "author": "itsmisscherry",
        "url": "https://www.reddit.com/r/religion/comments/11sx3cc/what_are_some_celtic_christian_practices/",
        "text": "\n\nPls no answers from Google!! ❤️",
        "created_utc": 1678980075,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Brief List of VITs: Very Important Theists",
        "author": "GasparC",
        "url": "/r/exatheist/comments/11ljw3p/a_brief_list_of_vits_very_important_theists/",
        "text": "",
        "created_utc": 1678979893,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this ? Found this in a building I’m painting .",
        "author": "coltonnpowers",
        "url": "https://i.redd.it/j3banvjzr5oa1.jpg",
        "text": "",
        "created_utc": 1678979474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on this statement about God by Ben Shapiro?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/11svxo1/what_are_your_thoughts_on_this_statement_about/",
        "text": "\"If we're just balls of meat wandering around in space, how exactly do we make choices? God is necessary for these thoughts, or at least the possibility of God. Trash God altogether and you can't explain why you would believe in objective truth or morality or even your own ability to choose\".",
        "created_utc": 1678977407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Morning Declaration and Invocation",
        "author": "StevenLeRoyChilds",
        "url": "https://www.reddit.com/r/religion/comments/11stsxi/morning_declaration_and_invocation/",
        "text": "[removed]",
        "created_utc": 1678972386,
        "upvote_ratio": 1.0
    },
    {
        "title": "We can stop all wars, all poverty, all hatred and all crime with “The World Fairness Agreement.”",
        "author": "StevenLeRoyChilds",
        "url": "https://www.reddit.com/r/religion/comments/11stpwn/we_can_stop_all_wars_all_poverty_all_hatred_and/",
        "text": "[removed]",
        "created_utc": 1678972180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im curious about something, why do people force their own family members or others into things that they don't clearly believe?",
        "author": "HailFucktopus",
        "url": "https://www.reddit.com/r/religion/comments/11stna1/im_curious_about_something_why_do_people_force/",
        "text": "[removed]",
        "created_utc": 1678971989,
        "upvote_ratio": 0.99
    },
    {
        "title": "காக்கும் கடவுள் மகா பெரியவா.",
        "author": "Snathan-22",
        "url": "https://www.reddit.com/r/religion/comments/11soz41/கககம_கடவள_மக_பரயவ/",
        "text": "[removed]",
        "created_utc": 1678958322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is God just a metaphor for the Truth?",
        "author": "ki4jgt",
        "url": "https://www.reddit.com/r/religion/comments/11sonw5/is_god_just_a_metaphor_for_the_truth/",
        "text": "I've converted to Taoism over the past year, and I've started to wonder if God is a stand-in for the truth.\n\nThe Truth has always been, and will always be. It cannot be bent or broken. It cannot be overpowered. It's omnipresent. It's omniscient. It's omnipotent. If Allah/Yahweh himself were to try, he could not bend the truth. He could not rewrite a single bit of it. Any changes he made would become a part of it. In a universe of absolute falsehood, the Truth would be there, due to the fact that the universe being absolutely false, would be truth.\n\nIs God just man's attempt to understand truth?",
        "created_utc": 1678957247,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your religion/denomination and what practices are important to you?",
        "author": "Healer1285",
        "url": "https://www.reddit.com/r/religion/comments/11sm3my/whats_your_religiondenomination_and_what/",
        "text": "I’m a nurse and often work with people from religious backgrounds who use their practices to assist with their treatment, emotions and mental health during their health care. For some, especially elderly, I’ve found that it can help when the nurse prays with they etc. \nSo as per the title what religion/denomination are you? And what practices/prayers are important?\nEg catholic- saying the rosary\n\nI want to have a better understanding and knowledge base so I can help when needed.",
        "created_utc": 1678947643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perseverance",
        "author": "RonshuBarbar",
        "url": "https://www.reddit.com/r/religion/comments/11sipt5/perseverance/",
        "text": "I hope the apostle Paul was right because I just mutilated my penis.",
        "created_utc": 1678936863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pope Francis is saying nothing new(Part 4). Theological and Papal precedents in critiquing capitalism and economic injustice",
        "author": "Anglicanpolitics123",
        "url": "https://www.reddit.com/r/religion/comments/11shwjy/pope_francis_is_saying_nothing_newpart_4/",
        "text": "This is part 4 of my series \"Pope Francis is saying nothing new\". In this portion I'm going to be focusing on Pope Francis's critiques of unbridled capitalism and his perspectives on demanding economic justice for those exploited. There are those who see his critiques and instantly assume \"Marxism\". \"Communism\". But as will be shown, there is theological and even Papal precedents for what he is saying, and it informs his views and perspectives on things. So here goes.\n\n**Theological and Papal Precedent:**\n\n* \"*By degrees it has come to pass that working men have been surrendered, isolated and helpless, to the hardheartedness of employers and the greed of unchecked competition. The mischief has been increased by rapacious usury, which, although more than once condemned by the Church, is nevertheless, under a different guise, but with like injustice, still practiced by covetous and grasping men. To this must be added that the hiring of labor and the conduct of trade are concentrated in the hands of comparatively few; so that a small number of very rich men have been able to lay upon the teeming masses of the laboring poor a yoke little better than that of slavery itself*. \"\\_Pope Leo XIII(Rerum Novarum, prg 3)\n* \"*When directing Our special attention to the changes which the capitalist economic system has undergone.....We have in mind the good not only of those who dwell in regions given over to \"capital\" and industry, but of all mankind. In the first place, it is obvious that not only is wealth concentrated in our times but an immense power and despotic economic dictatorship is consolidated in the hands of a few, who often are not owners but only the trustees and managing directors of invested funds which they administer according to their own arbitrary will and pleasure. This dictatorship is being most forcibly exercised by those who, since they hold the money and completely control it, control credit also and rule the lending of money. Hence they regulate the flow, so to speak, of the life-blood whereby the entire economic system lives, and have so firmly in their grasp the soul, as it were, of economic life that no one can breathe against their will*.\"\\_Pope Pius XI(Quadragesimo Anno, prg 104-106)\n* \"*This accumulation of might and of power generates.. three kinds of conflict. First, there is the struggle for economic supremacy itself; then there is the bitter fight to gain supremacy over the State in order to use in economic struggles its resources and authority; finally there is conflict between States themselves, not only because countries employ their power and shape their policies to promote every economic advantage of their citizens, but also because they seek to decide political controversies that arise among nations through the use of their economic supremacy and strength. The ultimate consequences of the individualist spirit in economic life are those which you yourselves, Venerable Brethren and Beloved Children, see and deplore: Free competition has destroyed itself; economic dictatorship has supplanted the free market; unbridled ambition for power has likewise succeeded greed for gain; all economic life has become tragically hard, inexorable, and cruel. To these are to be added the grave evils that have resulted from an intermingling and shameful confusion of the functions and duties of public authority with those of the economic sphere - such as, one of the worst, the virtual degradation of the majesty of the State, which although it ought to sit on high like a queen and supreme arbitress, free from all partiality and intent upon the one common good and justice, is become a slave, surrendered and delivered to the passions and greed of men. And as to international relations, two different streams have issued from the one fountain-head: On the one hand, economic nationalism or even economic imperialism; on the other, a no less deadly and accursed internationalism of finance or international imperialism whose country is where profit is*\".\\_Pope Pius XI(Quadragesimo Anno, prg 108-109)\n* \"*Property, that is, \"capital,\" has undoubtedly long been able to appropriate too much to itself. Whatever was produced, whatever returns accrued, capital claimed for itself, hardly leaving to the worker enough to restore and renew his strength. For the doctrine was preached that all accumulation of capital falls by an absolutely insuperable economic law to the rich, and that by the same law the workers are given over and bound to perpetual want, to the scantiest of livelihoods….That these false ideas, these erroneous suppositions, have been vigorously assailed, and not by those alone who through them were being deprived of their innate right to obtain better conditions, will surprise no one.*”\\_Pope Pius XI(Quadragesimo Anno, prg 54)\n* “*The right ordering of economic life cannot be left to a free competition of forces. For from this source, as from a poisoned spring, have originated and spread all the errors of individualist economic teaching. Destroying through forgetfulness or ignorance the social and moral character of economic life, it held that economic life must be considered and treated as altogether free from and independent of public authority, because in the market, i.e., in the free struggle of competitors, it would have a principle of self direction which governs it much more perfectly than would the intervention of any created intellect. But free competition….clearly cannot direct economic life - a truth which the outcome of the application in practice of the tenets of this evil individualistic spirit has more than sufficiently demonstrated. Therefore, it is most necessary that economic life be again subjected to and governed by a true and effective directing principle. This function is one that the economic dictatorship which has recently displaced free competition can still less perform, since it is a headstrong power and a violent energy that, to benefit people, needs to be strongly curbed and wisely ruled. But it cannot curb and rule itself. Loftier and nobler principles - social justice and social charity - must, therefore, be sought whereby this dictatorship may be governed firmly and fully*.”\\_Pope Pius XI(Quadragesimo Anno, prg 88)\n* “*Certain concepts have somehow arisen out of these new conditions and insinuated themselves into the fabric of human society. These concepts present profit as the chief spur to economic progress, free competition as the guiding norm of economics, and private ownership of the means of production as an absolute right, having no limits nor concomitant social obligations….This unbridled liberalism paves the way for a particular type of tyranny, rightly condemned…., for it results in the \"international imperialism of money.’Such improper manipulations of economic forces can never be condemned enough; let it be said once again that economics is supposed to be in the service of man*”\\_Pope Paul VI(Populorum Progressio, prg 26)\n* “*In all cases of this sort, in every social situation of this type, there is a confusion or even a reversal of the order laid down from the beginning by the words of the Book of Genesis: man is treated as an instrument of production, whereas he—he alone, independently of the work he does—ought to be treated as the effective subject of work and its true maker and creator.* *Precisely this reversal of order, whatever the programme or name under which it occurs, should rightly be called “capitalism*\\*\\*\\*”\\*\\*\\**—in the sense more fully explained below. Everybody knows that capitalism has a definite historical meaning as a system, an economic and social system, opposed to “socialism” or “communism”. But in the light of the analysis of the fundamental reality of the whole economic process—first and foremost of the production structure that work is—it should be recognized that the error of early capitalism can be repeated wherever man is in a way treated on the same level as the whole complex of the material means of production, as an instrument and not in accordance with the true dignity of his work—that is to say, where he is not treated as subject and maker, and for this very reason as the true purpose of the whole process of production.* \\_Pope John Paul II(Laborem Exercens, prg 7)\n* “*The realities of marginalization and exploitation remain in the world, especially the Third World, as does the reality of human alienation, especially in the more advanced countries. Against these phenomena the Church strongly raises her voice. Vast multitudes are still living in conditions of great material and moral poverty. The collapse of the Communist system in so many countries certainly removes an obstacle to facing these problems in an appropriate and realistic way, but it is not enough to bring about their solution. Indeed, there is a risk that a radical capitalistic ideology could spread which refuses even to consider these problems, in the a priori belief that any attempt to solve them is doomed to failure, and which blindly entrusts their solution to the free development of market forces*”\\_Pope John Paul II(Centesimus Annus, prg 42)\n* “*The Church's social doctrine also makes possible a clearer appreciation of the gravity of the “social sins which cry to heaven because they generate violence, disrupt peace and harmony between communities within single nations, between nations and between the different regions of the continent….These sins are the sign of a deep crisis caused by the loss of a sense of God and the absence of those moral principles which should guide the life of every person. In the absence of moral points of reference, an unbridled greed for wealth and power takes over, obscuring any Gospel-based vision of social reality. Not infrequently, this leads some public institutions to ignore the actual social climate. More and more, in many countries of America, a system known as “neoliberalism” prevails; based on a purely economic conception of man, this system considers profit and the law of the market as its only parameters, to the detriment of the dignity of and the respect due to individuals and peoples. At times this system has become the ideological justification for certain attitudes and behavior in the social and political spheres leading to the neglect of the weaker members of society. Indeed, the poor are becoming ever more numerous, victims of specific policies and structures which are often unjust.*”\\_Pope John Paul II(Ecclesia America, prg 56)\n* “*Various places are witnessing the resurgence of a certain capitalist neoliberalism which subordinates the human person to blind market forces and conditions the development of peoples on those forces. From its centres of power, such neoliberalism often places unbearable burdens upon less favored countries. Hence, at times, unsustainable economic programmes are imposed on nations as a condition for further assistance. In the international community, we thus see a small number of countries growing exceedingly rich at the cost of the increasing impoverishment of a great number of other countries; as a result the wealthy grow ever wealthier, while the poor grow ever poorer.*\\_Pope John Paul II(1998 Homily,Apostolic Journey to Cuba)\n* “*And still today many industrial or transnational corporations base their ability to compete in international markets on what they call low labor costs, which in reality means starvation wages. All of this explains the firm opposition of important sectors of capital to initiatives, whether of the people or of the government, that, through trade union organizations, seek to improve the living conditions, or to raise the wages, of the working class. The ruling class, especially the rural elite, cannot allow unions to be organized among either rural or urban laborers so long as, from a capitalist point of view, they believe their economic interests are at risk. This viewpoint makes repression against popular organizations something necessary in order to maintain and increase profit levels, even though it is at the cost of the growing poverty of the working class*.”\\_St Oscar Romero(Fourth Pastoral Letter, prg 16)\n* “*Absolutizing wealth and private property brings about the absolutizing of political, social, and economic power, without which it is impossible for the rich to preserve their privileges…In our country this idolatry is at the root of structural and repressive violence. In the final analysis, it is the cause of a great part of our economic, social, and political underdevelopment.This is the capitalism condemned by the church….*”\\_St Oscar Romero(Fourth Pastoral Letter, prg 45)\n* “*When I feed the poor they call me a saint. When I ask why they are poor they call me a communis*t”\\_Servant of God Dom Helder Camara(Essential Writings)\n* “*Monolithic and obsessional anti communism is responsible for many absurdities. The prime one is maintaining injustices because tackling them might ‘open the door to communism*’”\\_Servant of God Dom Helder Camara(Spiral of Violence, pg 32)\n* “*The capitalist empires with their affirmations of sacrifice for the free world, of defence of private enterprise, of safeguarding order from subversion and chaos, are in fact defending their political prestige and the economic interests arising from it; they are indeed at the service of economic power and the international trusts*”\\_Servant of God Dom Helder Camara(Spiral of Violence, pg 50-51)\n\nAs can be seen, there was a very vast and extensive theological literature and precedent condemning the excesses of unbridled capitalism and demanding economic justice. This didn’t stem from a “communist” or “marxist” impulse. It stemmed from the traditional belief found in the Biblical text and the Church Fathers of defending the rights of the poor combined with a critique of materialistic ideologies of which capitalism certainly is one of them. These theological precedents in turn influence Pope Francis. When he delivers these critiques he doesn’t seem himself as upholding a communist or marxist view of the world. He just sees himself as upholding traditional Christianity with the precedents demonstrated. Here are examples:\n\n* “*We have created new idols. The worship of the ancient golden calf(Ex 32:1-35) has returned in a new and ruthless guise in the idolatry of money and the dictatorship of an impersonal economy lacking a truly human purpose*”\\_Pope Francis(The Joy of the Gospel, prg 55)\n* “”*While the earnings of a minority are growing exponentially, sotoo is the gap separating the majority from the prosperity enjoyed by those happy few. This imbalance is the result of ideologies which defend the absolute autonomy of the marketplace and financial speculation. Consequently they reject the rights of states, charged with vigilance for the common good, to exercise any form of control. A new tyranny is thus born, invisible and often virtual which unilaterally and relentlessly imposes its own laws and rules*(The Joy of the Gospel, prg 56)\n* “*The marketplace by itself cannot resolve every problem, however much we are asked to believe this dogma of neoliberal faith. Whatever the challenge, this impoverished and repetWhile the earnings of a minority are growing exponentially, so too is the gap separating the majority from the prosperity enjoyed by those happy few. This imbalance is the result of ideologies which defend the absolute autonomy of the marketplace and financial speculation. Consequently, they reject the rights of states, charged with vigilance for the common good, to exercise any form of control. A new tyranny is thus born, invisible and often virtual, which unilaterally and relentlessly imposes its own laws and rules…The thirst for power and possessions knows no limits. In this system, which tends to devour everything which stands in the way of increased profits, whatever is fragile, like the environment, is defenseless before the interests of a deified market, which becomes the only ruleitive school of thought always offers the same recipes. Neoliberalism simply reproduces itself by resorting to the magic theories of ‘spillover’ or ‘trickle’-without using the name- as the only solution to societal problems. There is little appreciation of the fact that the alleged ‘spillover’ does not resolve the inequality that gives rise to new forms of violence threatening the fabric of society*”(Fratelli Tutti, prg 168)\n* *“It striking how neoliberal currents of thought have sought to exclude from the political arena any substantive debate about the common good and the universal destination of goods. What they promote instead is essentially the efficient management of a market and minimal government control. But the problem is that when the economy’s primary purpose centers on profit it is easy to forget that the earth’s resources are for all, not the few. The obsession with profit weakens the institutions that can protect a people from reckless economic interests and excessive concentration of power*.”(Let us Dream, pg 108)\n* “*Once capital becomes an idol that presides over a socioeconomic system, it enslaves us sets us at odds with each other, excludes the poor, and endangers the planet we all share. Little wonder that Basil of Caesarea, one of the Church’s first theologians, called money the ‘devil’s dung*’”(Let us Dream, pg 110)\n* “*Economic powers continue to justify the current global system where priority is given to speculation and the pursuit of financial gain, which fail to take the context into account, let alone the effects of human dignity and the natural environment. Here we see how the environmental deterioration and human and ethical degradation are closely linked. Many people will deny doing anything wrong because distractions constantly dull our consciousness of just how limited and finite our world really is. As a result, whatever is fragile, like the environment, is defenseless before the interests of a deified market, which becomes the only rule*”(Laudato Si, prg 56)\n* “*Each day you are caught up in the storms of people’s lives. You have told me about their causes, you have shared your own struggles with me, ever since I was in Buenos Aires, and I thank you for that. You, dear brothers and sisters, often work on little things, in local situations, amid forms of injustice which you do not simply accept but actively resist, standing up to an idolatrous system which excludes, debases and kills. I have seen you work tirelessly for the soil and crops of campesinos, for their lands and communities, for a more dignified local economy, for the urbanization of their homes and settlements; you have helped them build their own homes and develop neighborhood infrastructures. You have also promoted any number of community activities aimed at reaffirming so elementary and undeniably necessary a right as that of the three “L’s”: land, lodging and labor*.”(World Meeting of Popular Movements, 2015)\n* “*The earth, entire peoples and individual persons are being brutally punished. And behind all this pain, death and destruction there is the stench of what Basil of Caesarea – one of the first theologians of the Church – called “the dung of the devil”. An unfettered pursuit of money rules. This is the “dung of the devil”. The service of the common good is left behind. Once capital becomes an idol and guides people’s decisions, once greed for money presides over the entire socioeconomic system, it ruins society, it condemns and enslaves men and women, it destroys human fraternity, it sets people against one another and, as we clearly see, it even puts at risk our common home, sister and mother earth*.”(World Meeting of Popular Movement, 2015)\n* “*Working for a just distribution of the fruits of the earth and human labor is not mere philanthropy. It is a moral obligation. For Christians, the responsibility is even greater: it is a commandment. It is about giving to the poor and to peoples what is theirs by right. The universal destination of goods is not a figure of speech found in the Church’s social teaching. It is a reality prior to private property. Property, especially when it affects natural resources, must always serve the needs of peoples. And those needs are not restricted to consumption. It is not enough to let a few drops fall whenever the poor shake a cup which never runs over by itself..I have seen first hand a variety of experiences where workers united in cooperatives and other forms of community organization were able to create work where there were only crumbs of an idolatrous economy. I have seen some of you here. Recuperated businesses, local fairs and cooperatives of paper collectors are examples of that popular economy which is born of exclusion and which, slowly, patiently and resolutely adopts solidarity forms which dignify it. How different this is than the situation which results when those left behind by the formal market are exploited like slaves!* .”(World Meeting of Popular Movement, 2015)\n* “*New(forms of) colonialism takes on different faces. At times it appears as the anonymous influence of mammon: corporations, loan agencies, certain “free trade” treaties, and the imposition of measures of “austerity” which always tighten the belt of workers and the poor. We, the bishops of Latin America, denounce this with utter clarity in the Aparecida Document, stating that “financial institutions and transnational companies are becoming stronger to the point that local economies are subordinated, especially weakening the local states, which seem ever more powerless to carry out development projects in the service of their populations…Similarly, the monopolizing of the communications media, which would impose alienating examples of consumerism and a certain cultural uniformity, is another one of the forms taken by the new colonialism. It is ideological colonialism. As the African bishops have observed, poor countries are often treated like “parts of a machine, cogs on a gigantic wheel*”(World Meeting of Popular Movements, 2015)\n* *“The economic system that has the god of money at its centre, and that sometimes acts with the brutality of the robbers in the parable(of the good samaritan), inflicts injuries that to a criminal degree have remained neglected. Globalised society frequently looks the other way with the pretence of innocence. Under the guise of what is politically correct or ideologically fashionable, one looks at those who suffer without touching them. But they are televised live; they are talked about in euphemisms and with apparent tolerance, but nothing is done systematically to heal the social wounds or to confront the structures that leave so many brothers and sisters by the wayside. This hypocritical attitude, so different from that of the Samaritan, manifests an absence of true commitment to humanity.”(World Meeting of Popular Movements, 2017)*",
        "created_utc": 1678934705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jews most favorably viewed religious group in U.S., Pew study says",
        "author": "bobbyw24",
        "url": "https://www.washingtontimes.com/news/2023/mar/15/jews-most-favorably-viewed-religious-group-us-pew-/",
        "text": "",
        "created_utc": 1678918857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing faith: an oxymoron",
        "author": "BayonetTrenchFighter",
        "url": "https://youtu.be/e4JEWGyhymQ",
        "text": "",
        "created_utc": 1678912756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Help!",
        "author": "yourbestfriendhere",
        "url": "https://www.reddit.com/r/religion/comments/11s86vd/please_help/",
        "text": "[removed]",
        "created_utc": 1678912005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aren't you scared of possibly going to hell?",
        "author": "Alice94cats",
        "url": "https://www.reddit.com/r/religion/comments/11s80qs/arent_you_scared_of_possibly_going_to_hell/",
        "text": "Serious question. I've been thinking a lot about afterlife recently, because my cat has died and I want to believe he's in Heaven.\n\nThat led me to think that Heaven must be very crowded with beings from billions of years.\n\nAnd then it hit me suddenly that maybe it's not that crowded and that only very few people manage to go to Heaven. Maybe I'm not good enough.\n\nWhat do you think? Aren't you scared?",
        "created_utc": 1678911633,
        "upvote_ratio": 1.0
    },
    {
        "title": "After Mass, me, digital animation, 2023",
        "author": "sunday-suits",
        "url": "https://i.redd.it/g0kympg2ywna1.gif",
        "text": "",
        "created_utc": 1678908100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Islam - Are atheists to be put to death by default?",
        "author": "Martiallawtheology",
        "url": "https://www.reddit.com/r/religion/comments/11s5s52/islam_are_atheists_to_be_put_to_death_by_default/",
        "text": "This post is inspired by the numerous claims about atheists being put to death by religions by default, for being atheists. \n\nIn Islamic theology, there have been an aspect of the Shariah which is called the Murtad law of Hadd which is punishment for leaving Islam. Murtad linguistically means one who does Irtidad which is to leave Islam. Becoming an atheist or anything else does not matter in this law. This aspect has been in debate since maybe for over a 1000 years because it's not in the Qur'an. \n\nAnyway, this is for apostasy, not for being an Atheist or Buddhist. And that too, disputed. \n\nThis is not in the Qur'an, where the Qur'an does address those who leave the religion and there are no punishments stipulated in that. And, the Qur'an says directly that la ikraaha fiddheen, which means there is no Karaha or force of any kind, in the system. \n\nAlso it is well known that the apostasy laws or death punishment for apostasy comes from a hadith attributed to a guy called Ikrima who claims Ali, the son in law and cousin of the prophet Muhammed killed a guy for leaving Islam. Well, keeping aside the science of ahadith which is generally stringent in identifying each narrators reputation has ignore this persons reputation in it's chain, one must note that Ikrima is a well known Khawarij, who were the terrorists of the time creating enmity between people and the same group who is said to have murdered Ali Himself. This is like getting advice about the frying chick from the fire. \n\nAnyway, even if one really needs to adopt the apostasy laws, it's not for atheists in general. It's for apostates. This is a distinction a lot of people seem to be missing for some reason. \n\nAtheist scholar Fred Donner being a philosophical naturalist states that the early so called \"Muslims\" did not call themselves Muslim. They called themselves Mummers or Believers. So he calls it the \"believers movement\". So the famous \"ridda wars\" as said so in the ahadith, either could be false from an atheistic point of view due to the fact that ahadith studies are not accepted by atheist scholars in general, or it was for leaving the group (Christians, Jews, Muslims) and joining the enemy. This was also called Jasoosiathun which is a kind of betrayal of your state. So this topic is nuanced. Especially it being a clash of the titans, vis a vis, early Hanafi and Maliki schools vs latter Shafii and Hanbali schools, the latter being the one's who instigated the apostasy laws. \n\nIn this particular matter, one could refer to Atheist scholars like Samuel Zinner and Van Puten for Qur'anic, absolutely naturalistic explanations. They hold no candle for God or worshiping anything. \n\nWith any of these yardsticks, there are no laws about killing atheists by default. In this I have only addressed Islam, and not other theologies. \n\nCheers.",
        "created_utc": 1678906883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparing University life in the United States Vs University life in a conservative Muslim country.",
        "author": "LabProfessional5610",
        "url": "https://www.reddit.com/r/religion/comments/11s4k4q/comparing_university_life_in_the_united_states_vs/",
        "text": "3 Years ago, I got a scholarship to study abroad in the states, and it was my dream for years to be able to continue overseas. However, due to unfortunate circumstances with regards to Covid and inflation, I felt it was necessary for me to take a step back and go over the things that went wrong with my studies, so I decided it was best to transfer all my credits back home to a (or so I thought “ American University of the Middle East “). \n\nEver since I came back, there there is nonstop comparison in my mind of how University life looks here compared to out there. I mean there’s such a vast difference from the atmosphere, to the people, to the opportunities. It’s overwhelming to even count it. But just to keep it short, there’s one thing that has been irritating me, and has put me into unimaginable anger and frustration….\n\nGender Segregated classes….\n\nI cannot even stress how much that pisses me off. I tolerated gender segregated classes during my middle school years and during my high school years.\n\n I had the pleasure of spending my elementary years in the United States as a kid. So at least I got to experience a couple of years while I was a kid and three years I spent during my scholarship abroad . But never in my life , have I ever thought it was going to implemented in a university setting. \n\nI mean just the atmosphere that I sit in is fucking depressing. Now don’t get me wrong. I fixed the issue that I was having in terms of the quality of my studying, so I’m progressing nicely as of now. But there is just no comparison in terms of where I was and where I am now. \n\nThey constantly talk about group work and how it is important for engineers to work together. But they do not fucking teach us how to get along with the other gender. So if I were to be honest with you, on I daily bases , all I see is constant awkwardness between the two genders . Be walking into a class where girls are coming out, getting into an elevator, or trying to help someone with in issue. \n\nThere’s this one time an idiot male who had to think twice if he should help a girl that slipped in a pool and is drowning and he just stood there thinking if he should wait for someone else to jump in because touching her is haram. \n\nOr that one time where a girl made a seen in the elevator, because some guy accidentally touched her hand while heading out the door. If I were to tell you guys the things that I see, you would have to see for yourself to actually believe it. \n\nIt is just so ridiculous. 🤦🏻‍♂️🤦🏻‍♂️\n\nI used to have a female cousin that decided to completely throw away her hijab. Family didn’t receive it well, and I haven’t seen her since , even though as a kid I used to be around her a lot. But boy , now  I fucking understand why she decided to do what did . Boy, I don’t blame her anymore for making that choice. \n\nAnd I might just do exactly what she did , once I’m financially independent. I no longer find comfort in this religion whatsoever .",
        "created_utc": 1678904354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Followers of the Abrahamic Faiths, what do you believe about gods of other faiths?",
        "author": "GolemOfPrague33",
        "url": "https://www.reddit.com/r/religion/comments/11s4ibg/followers_of_the_abrahamic_faiths_what_do_you/",
        "text": "Please share your honest opinion, do not worry about causing offense. I’m open to your honest thoughts. \n\nAre they demons? Non-existent? Your own god acting through other channels? \n\nThank you for your answers.",
        "created_utc": 1678904248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hollywood is selling nihilism, but it could change to inspire hope",
        "author": "BayonetTrenchFighter",
        "url": "https://www.deseret.com/faith/2023/3/12/23632963/oscars-2023-nominations",
        "text": "",
        "created_utc": 1678904101,
        "upvote_ratio": 1.0
    },
    {
        "title": "President Russell M. Nelson will receive Gandhi-King-Mandela Peace Prize",
        "author": "BayonetTrenchFighter",
        "url": "https://www.deseret.com/faith/2023/3/14/23638565/president-russell-m-nelson-will-receive-gandhi-king-mandela-peace-prize-moorehouse-college",
        "text": "",
        "created_utc": 1678903831,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Irrespective of which religious path one embraces, …",
        "author": "beatsbyusrnm",
        "url": "https://www.reddit.com/r/religion/comments/11s39so/irrespective_of_which_religious_path_one_embraces/",
        "text": "… the aim of religion must be to pierce through the veil of delusion to discover the underlying Oneness, and ultimately to merge with the One. This is the foremost, nay, the only duty of man.” - Anandamayi Ma",
        "created_utc": 1678901661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are the obvious truths about the immortal soul doctrine so widely ignored?",
        "author": "unhallowed_sceptre",
        "url": "https://www.reddit.com/r/religion/comments/11s35nz/why_are_the_obvious_truths_about_the_immortal/",
        "text": "In practically every sub forum dedicated to Christianity or just the general topic of religion, you will find numerous threads debating about what happens in the afterlife and whether eternal conscious torment (ECT) is \"fair.\" Yet, virtually everything brought up in these discussions relates to abstraction and thought experiments, rarely do I see anything about what the scripture says.  \n\nMy question is, where does the idea of the immortal, indestructible, immaterial soul come from if not the Socratic dialogues (primarily the Phaedo) and book 10 of Plato's Republic? ECT apologists have to believe that the concept of hell is original to the Bible (meaning it appeared somewhere in the Tanakh, which I never see them argue for) or concede that its origins lie elsewhere. Anyway, I've gone over the subject at length on [my blog](https://open.substack.com/pub/laborer/p/annihilation-of-the-wicked-part-3?r=1nubzz&amp;utm_campaign=post&amp;utm_medium=web). It took me countless hours of reading and research, but I want to make sure I haven't lost my mind trying to make sense of all this. How is it that I hardly ever see atheists so much as dispute immortality of the soul when the whole concept of hell torments falls apart if it isn't true?",
        "created_utc": 1678901427,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SG123678] How to wait until marriage",
        "author": "someguy123678",
        "url": "https://www.reddit.com/r/religion/comments/11s22nm/sg123678_how_to_wait_until_marriage/",
        "text": "[removed]",
        "created_utc": 1678899086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evangelicals Are the Most Beloved US Faith Group Among Evangelicals",
        "author": "TheYuroLawl",
        "url": "https://www.christianitytoday.com/news/2023/march/evangelical-reputation-negative-us-survey-religious-groups-.html",
        "text": "",
        "created_utc": 1678898098,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm trying to avoid the COVID-19 vac. A company enforces it that ill be working for. I was given these sheets to fill out. What domination should I use? How effective is this method? I work construction btw.",
        "author": "toy200275",
        "url": "https://www.reddit.com/r/religion/comments/11s1dsh/im_trying_to_avoid_the_covid19_vac_a_company/",
        "text": "If anyone has suggestions that may be helpful while filling out these forms please share. I do not trust the long-term effects that may come from this vaccine. I have heard plenty of stories of people suffering health issues that were perfectly fine before receiving the vaccination.\n\n\nhttps://imgur.com/gallery/8oD0d7A",
        "created_utc": 1678897601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody ever get really uncomfortable anytime someone is hyper religious?",
        "author": "Alexispuree",
        "url": "https://www.reddit.com/r/religion/comments/11rz6cm/does_anybody_ever_get_really_uncomfortable/",
        "text": "I work in a psych ward and I noticed that the majority of people with diagnosed mental disorders are christian or catholic. I don’t see anything wrong with religion but I feel this way with most people who are christian or something of the sort. I’m a spiritual person. I believe in putting out good energy and treating people well and “good and bad karma” if you will. But I always felt that people who were believed in god were delusional and blind to reality. So when my patients say to me “god loves me” or “god did this for you” it makes me extremely uncomfortable. I’m not one to say “I don’t believe you” so I just smile and not because the last times (plural and EVERY time)  I got into a debate with someone who was christian it was a one sided debate and they immediately fight with you and are willing to die on that hill. Which is fine so be it. I genuinely feel like religions that you believe in a god or an “all mighty” are deranged. An excuse to explain what they can’t explain. An imaginary friend. \n\nI’d rather be a Buddhist",
        "created_utc": 1678892923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions About Krishna",
        "author": "AbiLovesTheology",
        "url": "https://www.reddit.com/r/religion/comments/11rz5yj/questions_about_krishna/",
        "text": "Hello everyone.\n\nI have some questions about how you (Hindus in the group) view Krishna.\n\n1. I heard some Hindus **don't** believe Vishnu came to earth in human form. If you believe this, what is the significance of Janmashtami to you and how do you explain Krishna's death in the Mahabharata? How do you explain the events in the Bhagavad Gita?\n2. Other Hindus believe Vishnu **did** come to earth in human form as Krishna. How do you explain how he can be a deity and human at the same time?\n\nI am trying to find out my position about him.",
        "created_utc": 1678892898,
        "upvote_ratio": 1.0
    },
    {
        "title": "[eBook]Christianity Where To?",
        "author": "Tommotion89",
        "url": "https://windywell.gumroad.com/l/christianity-where-to",
        "text": "",
        "created_utc": 1678888388,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a God were to let a murderer who was a believer into heaven, what would this tell you about that God?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/11rvgf8/if_a_god_were_to_let_a_murderer_who_was_a/",
        "text": "Put aside the idea that ONLY people who believe can be let into Heaven. Let's suppose that that isn't a thing and the doctrine says you get in based on your actions. Obviously a murderer like Jeffrey Dahmer would have done more bad than good. But nevertheless, they are let in. What would this tell you about that God? That they are infinitely compassionate an forgiving or something else?",
        "created_utc": 1678884694,
        "upvote_ratio": 1.0
    },
    {
        "title": "An atheist may say \"I don't have to respect people's religious beliefs. But I do respect people's right to have their beliefs\". Well, why should anyone respect the non-beliefs of atheists?",
        "author": "Want_My_MTV",
        "url": "https://www.reddit.com/r/religion/comments/11ruz2g/an_atheist_may_say_i_dont_have_to_respect_peoples/",
        "text": "If an atheist isn't going to respect the beliefs of a Christian, Muslim, Jew, etc because they either don't agree with their beliefs or think they're immoral, then why should said Christian, Muslim or Jew respect the atheist and their lack of belief?",
        "created_utc": 1678883435,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your religion's view on Adoption?",
        "author": "Solid-Guitar-2728",
        "url": "https://www.reddit.com/r/religion/comments/11runa7/what_is_your_religions_view_on_adoption/",
        "text": "[removed]",
        "created_utc": 1678882562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Sikhs use or appreciate statues or idols?",
        "author": "MrsAppleForTeacher",
        "url": "https://www.reddit.com/r/religion/comments/11rrwv8/do_sikhs_use_or_appreciate_statues_or_idols/",
        "text": "I have a statue of Buddha and one of Ganesha in my classroom (along with crosses because it’s a Catholic school). I have 2 Sikh students- is there any statue they would appreciate seeing in the room? I’m looking to be inclusive and welcoming.",
        "created_utc": 1678874423,
        "upvote_ratio": 1.0
    },
    {
        "title": "God is NOT real.",
        "author": "jacobpmacauley",
        "url": "https://www.reddit.com/r/religion/comments/11rq5tz/god_is_not_real/",
        "text": "[removed]",
        "created_utc": 1678868434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Benefit from Hindu Sacred Texts: A Guide to Spiritual Growth and Wisdom",
        "author": "Exoticindianart",
        "url": "/r/HinduBooks/comments/11ropjo/how_to_benefit_from_hindu_sacred_texts_a_guide_to/",
        "text": "",
        "created_utc": 1678864552,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Judaism, can the deceased watch over you?",
        "author": "Secret-Anywhere2672",
        "url": "https://www.reddit.com/r/religion/comments/11ropmy/in_judaism_can_the_deceased_watch_over_you/",
        "text": "[removed]",
        "created_utc": 1678863429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pope John Paul II and pedophile priests becomes Poland’s top political issue",
        "author": "enkrstic",
        "url": "https://www.politico.eu/article/poland-politics-pope-john-paul-ii-election/",
        "text": "",
        "created_utc": 1678858979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Música Cristiana,canciones cristianas de alabanza y adoracion,Instrument...",
        "author": "Mobile-March-7054",
        "url": "https://youtube.com/watch?v=HSLYR2qyUQ0&amp;feature=share",
        "text": "",
        "created_utc": 1678856071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Responses to last post",
        "author": "Content_Winter_8782",
        "url": "https://www.reddit.com/r/religion/comments/11rmczj/responses_to_last_post/",
        "text": "[removed]",
        "created_utc": 1678855546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zynab , Grand daughter of the prophet Muhammad",
        "author": "Fickle-Dance-752",
        "url": "https://www.reddit.com/r/religion/comments/11rlweb/zynab_grand_daughter_of_the_prophet_muhammad/",
        "text": "From a shia perspective, one of the most interesting women in islam in my opinion is zynab.\n\nDuring the time of the caliphate “Yazid”. Zynab was one of the people to stand up against Yazid during tge court of her killed brother “Hussain”\n\nAfter the battle of Karbala the captured family of the prophet and the heads of those who were killed were taken to the Levant by the forces of Yazid.[4] On the first day of the month of Safar,[5] according to Turabi, they arrived in the Levant and the captured family and heads were taken into Yazid's presence. First, the identity of each head was told to him. Then he paid attention to a woman who was objecting. Yazid asked, \"Who is this arrogant woman?\" All the audience paused for a moment. The woman rose to answer and said: \"Why are you asking them [the woman]? Ask me. I'll tell you [who I am]. I am Muhammad's granddaughter. I am Fatima's daughter.\" People at the court were impressed and amazed by her.\n\nAccording to the narration of Al-Shaykh Al-Mufid, in Yazid's presence a man with red skin asked Yazid for one of the captured women to be his slave.[6] Yazid hit the lips and teeth of Hussein with his stick while saying: “The Hashemites staged a drama for domination For there was no Divine news nor any revelation, Wish my ancestors killed in Badr would see The pain of Khazraj caused by pointed spears”, Zaynab bint Ali began to give her sermon.[7][8]",
        "created_utc": 1678854113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christians, Are God and Jesus the same person or are they two different people?",
        "author": "Which-Recipe203",
        "url": "https://www.reddit.com/r/religion/comments/11rkreq/christians_are_god_and_jesus_the_same_person_or/",
        "text": "[removed]",
        "created_utc": 1678850851,
        "upvote_ratio": 1.0
    },
    {
        "title": "MEHFIL SHAB E BARAT RAZA SAQIB mustafai #maloomateaama1",
        "author": "Pretend-Ad-7822",
        "url": "https://youtube.com/watch?v=PYDDEGS0BnY&amp;feature=shares",
        "text": "",
        "created_utc": 1678847651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rohe kainat ban k wo shah e ziwaqr agay mushtaq qadri #maloomateaama1",
        "author": "Pretend-Ad-7822",
        "url": "https://youtube.com/watch?v=28j0U2QcU8o&amp;feature=share",
        "text": "",
        "created_utc": 1678847235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pope Francis is saying nothing new(Part 3). The precedent of the Second Vatican Council in influencing his ideology in quotes",
        "author": "Anglicanpolitics123",
        "url": "https://www.reddit.com/r/religion/comments/11rj1xu/pope_francis_is_saying_nothing_newpart_3_the/",
        "text": "This is part 3 in a series I am doing on \"Pope Francis says nothing new\". In this part I want to focus on one of the most important parts in the history of the Catholic Church. And that is the Second Vatican Council. Vatican II was a major council called by Pope John XXIII and completed by Pope Paul VI. Its teaching documents form the constitution of the modern Catholic Church which is significant. What it says on a whole range of social topics has a deep impact on Pope Francis because he sees himself as a man of the council. You cannot understand Pope Francis in any intelligent manner without an understanding of Vatican II. Unfortunately most people have not read anything from the Second Vatican Council and so they might just assume the Pope is just saying anything that comes to his mind when he speaks. That's false. So let me jump right in:\n\n**The Second Vatican Council:**\n\n* \"*The joys and hopes, the grief and anguish of the people of our time, especially of those who are poor or afflicted, are the joys and hopes, the grief and anguish of the followers of Christ as well. Nothing that is genuinely human fails to find an echo in their hearts. For theirs is a community of people united in Christ and guided by the holy Spirit in their pilgrimage towards the Father's kingdom, bearers of a message of salvation for all of humanity. That is why they cherish a feeling of deep solidarity with the human race and its history*\"\\_(Gaudium et Spes, prg 1)\n* \"*The council lays stress on respect for the human person: everybody should look upon his or her neighbor(without exception) as another self, bearing in mind especially their neighbor's life and the means needed for a dignified way of life, lest they follow the example of the rich man who ignored Lazarus who was poor. Today, there is an inescapable duty to make ourselves the neighbor of every individual, without exception, and to take positive steps to help a neighbor whom we encounter, whether that neighbor be an elderly person abandoned by everyone, a foreign worker who suffers the injustice of being despised, a refugee, an illegitimate child wrongly suffering for a sin of which the child is innocent, or a starving human being who awakens our conscience by calling to the words of Christ: 'As you did it to one of the least of these my brothers or sisters, you did it to me*'\"(Gaudium et Spes, prg 27)\n* \"*The varieties of crime are numerous: all offenses against life itself, such as murder, genocide, abortion, euthanasia, and willful suicide; all violations of the integrity of the human person, such as mutilation, physical and mental torture, undue psychological pressures; all offenses against human dignity, such as subhuman living conditions, arbitrary imprisonment, deportation, slavery, prostitution, the selling of women and children, degrading working conditions where people are treated as mere tools for profit rather than free responsible persons: all these and the life are criminal: they poison civilisation*\"\\_(Gaudium et Spes, prg 27)\n* \"*All women and men are endowed with a rational soul and are created in God's image; they have the same nature and origin and, being redeemed by Christ, they enjoy the same divine calling and destiny; there is here a basic equality between all and it must be accorded ever greater recognition. Undoubtedly not all people are alike as regards physical capacity and intellectual and moral powers. But any kind of social or cultural discrimination in basic personal rights on the grounds of sex, race, color, social conditions, language, or religion, must be curbed and eradicated as incompatible with God's design.*\"(Gaudium et Spes, prg 29)\n* \"*God destined the earth and all it contains for all people and nations so that all created things so that all created things would be shared fairly by all humankind under the guidance of justice tempered by charity. No matter how property is structured in different countries, adapted to their lawful institutions according to various and changing circumstances, we must never lose sight of this universal destination of earthly goods. In their use of things people should regard external goods they lawfully possess not just as their own but common to others as well, that they can benefit others as well as themselves....This has been the opinion of the Fathers and Doctors of the church, who taught that people are bound to come to the aid of the poor and to do so not merely out of their superfluous goods. Persons in extreme necessity are entitled to take what they need from the riches of others. Faced with a world today where so many people are suffering from want, the council asks individuals and governments the sayings of the Fathers: Feed the people dying of hunger, because if you do not feed them you are killing them, ans it urges them according to their ability to share and dispose of their goods to help others*\"(Gaudium et Spes, prg 69)\n* \"*The council exhorts Christians, as citizens of both cities, to perform their duties faithfully in the spirit of the Gospel. It is a mistake to think that, because we have here no lasting city, but see the city which is to come, we are entitled to evade our earthly responsibilities; this is to forget that because of our faith we are all the more bound to fulfill these responsibilities according to each one's vocation*\"(Gaudium et Spes, prg 43)\n* \"*But believers themselves often share some responsibility for this situation. For, in general, atheism is not present in people's minds from the beginning. It springs from various causes, among which must be included a critical reaction against religions and, in some places, against the christian religion in particular. Believers can thus have more than a little to do with the rise of atheism. To the extent that they are careless about their instruction in the faith, or present its teaching falsely, or even fail in their religious, moral, or social life, they must be said to conceal rather than to reveal the true nature of God and of religion*\"(Gaudium et Spes, prg 19)\n* \"*Justice and equity also demand that the sort of mobility which is a necessary feature of developing economies should not be allowed to jeopardize the livelihood of individuals and their families. Every kind of discrimination in wages and working conditions should be avoided in regard to workers who come from other countries or areas and contribute by their work to the economic development of a people or a region. Furthermore, no one, especially public authorities, should treat such workers simply as mere instruments of production, but as persons; they should help them to bring their families with them and to obtain decent housing conditions and they should try to integrate them into the social life of the country or area which they have come to*\"(Gaudium et Spes, prg 66)\n* \"*Peace is more than the absence of war: it cannot be reduced to the maintenance of a balance of power between opposing forces nor does it arise out of despotic dominion, but it is appropriately called 'the effect of righteousness'(Is 32:17). It is the fruit of that right ordering of things with which the divine founder has invested human society and which must be brought about by humanity in its thirst for an ever more perfect reign of justice*\"(Gaudium et Spes, prg 78)\n* \"*Therefore we declare once again: the arms race is one of the greatest curses on the human race and the harm it inflicts on the poor is more than can be endured*\"(Gaudium et Spes, prg 81)\n* \"*Governments who are at once the guardians of their own people and the promoters of the welfare of the whole world, rely to a large extent on public opinion and public attitudes. Their peace-making efforts will be in vain, as long as people are divide and at odds with each other because of hostility, contempt and distrust, or because of racial hatred and ideological obduracy. Hence there is a very urgent need for re-education and a new orientation of public opinion, should regard it as their most important task to instill peaceful sentiments in people's minds. Every one of us needs a change of heart; we must set our gaze on the whole world and look to those tasks we can all perform together in order to bring about the betterment of our race*\"(Gaudium et spes, prg 82)\n* \"*That women and men, working in harmony should renew the temporal order and make it increasingly more perfect: such is God's design for the world. All that goes to make up the temporal order-personal and family values, culture, economic interests, the trades and professions, political institutions, international relations, and so on, as well as their gradual development-all these are not merely helps to humanity's last end, they possess a value of their own, place in in them by God, both in themselves or as parts of the integral temporal structure: 'And God saw all that he had made and found it very good'(Gen 1:31). This natural goodness of theirs receives an added dignity fro their relation with the human person, for whose use they have been created......Lay people ought themselves to take on as their distinctive task this renewal of the temporal order.....As citizens among citizens they must bring to their cooperation with others their own special competence, and act on their own responsibility; everywhere and always they have to seek the justice of the kingdom of God*.\"(Decree on the Apostolate of Lay People, prg 7)\n* \"*The presence of Christians among\\[people\\] should be one that is animated by that love with which we are loved by God, who desires that we should love each other with that self-same love. Christian charity is extended to all without distinction of race, social condition, or religion and seeks neither gain nor gratitude. Just as God loves us with a gratuitous love, so too the faithful in their charity, should be concerned for people, loving them with the same love with which God sought out humanity. As Christ went about all towns and villages healing every sickness and infirmity, as a sign that the kingdom of God has come, so the Church through its children, join itself with people of every condition, but especially with the poor and afflicted, and willingly spends itself for them. It shares their joys and sorrows, it is familiar with the hopes and problems of life, it suffers with them in the anguish of death*.\"(Ad Gentes Divinitus, pr 11)\n* \"*All missionaries..should be trained and formed according to their individual states, lest they be found unequal to the demands of of their future tasks. From the very beginning their doctrinal training should be such that they understand both the universality of the church and the diversity of peoples. This holds for all the studies which prepare them for their future ministry, and indeed for other sciences in which they might usefully be instructed so that they might have a general knowledge of peoples, cultures and religions, not only with regard to the past, but also with respect to the present time. Whoever is to go among another people must hold their inheritance, language and way of life in high esteem*\"(Ad Gentes Divinitus, prg 26)\n* \"*Finally those who have not yet accepted the Gospel are related to the people of God in various ways. There is, first, that people to whom the covenants and promises were made, and from whom Christ was born in the flesh(Rom 9:4-5), a people in virtue of their election beloved for the sake of the fathers, for God never regret his gifts of his call. But the plan of salvation also includes those who acknowledge the Creator, first among whom are the Muslims: they profess to hold the faith of Abraham, and together with us they adore the one, merciful God, who will judge humanity on the last day. Nor is God remote from those who in shadows and images seek the unknown God, since he gives everyone life and breath and all things(Acts 17:25-28) and since the Saviour wills everyone to be saved*\"(Lumen Gentium, prg 16)\n* \"*The Catholic Church rejects nothing of what is true and holy in these religions. It has a high regard for the manner of life and conduct, the precepts and doctrines which, although differing in many ways from its own teaching, nevertheless often reflect a ray of that truth which enlightens all men and women*\"(Nostra Aetate, prg 2)\n* \"*The Church....has high regard for the Muslims. They worship God, who is one living and subsistent, merciful and almighty, the Creator of heaven and earth, who has also spoken to humanity. They endeavor to submit themselves without reserve to the hidden decrees of God, just as Abraham submitted himself to God's plan, to whose faith Muslims eagerly link their own....Over the centuries many quarrels and dissensions have arisen between Christians and Muslims. The sacred council now pleads with all to forget the past and urges that a sincere effort be made to achieve mutual understanding; for the benefit of all, let them together preserve and promote peace, liberty, social justice and moral values*\"(Nostra Aetate, prg 3)\n\nHere we have laid out in very extensive quotes the Second Vatican Council's perspectives on a range of things from social justice, to missionary work and evangelisation, to interfaith relations. These form the basis of Pope Francis's own views on the topic as seen in his own Papal teachings:\n\n* \"*If the whole Church takes up this missionary impulse, she has to go forth to everyone without exception. But to whom should she go first? When we read the Gospel we find a clear indication: not so much our friends and wealth neighbours, but above all the poor and the sick, those who are usually despised and overlooked, 'those who cannot repay you'(Lk 14:14). There can be no room for doubt or explanations which weaken so clear a message. Today and always, 'the poor are the privileged recipients of the Gospel' and the fact that it is freely preached to them is a sign of the kingdom that Jesus came to establish. We have to state without mincing words, that 'there is an inseparable bond between our faith and the poor*\"(The Joy of the Gospel, prg 48)\n* \"*Let us go forth then; let us go forth to offer everyone the life of Jesus Christ. Here I repeated for the entire Church what I have often said to the priests and laity of Buenos Aires. I prefer a Church which is bruised, hurting and dirty because it has been out on the streets rather than a Church which is unhealthy from being confined and from clinging to its own security. I do not want a Church concerned with being at the centre and then ends by being caught up in a web of obsessions and procedures*\"(The Joy of the Gospel, prg 49)\n* \"*Just as the commandment 'Thou shalt not kill' sets a clear limit in order to safeguard the value of human life today we also have to say 'thou shalt not' to an economy of exclusion and inequality. Such an economy kills. How can it be that it is not a news item when an elderly homeless person dies of exposure, but it is news when the stock market loses two points? This is a case of exclusion. Can we continue to stand by when food is thrown away while people are starving? This is a case of inequality. Today everything comes under the laws of competition and the survival of the fittest, where the powerful feed upon the powerless. As a consequence, masses of people find themselves excluded and marginalised: without work, without possibilities, without any means of escape*\"(The Joy of the Gospel, prg 53)\n* \"*I regret that ideologies lead us at times to two harmful errors. On the one hand, there is the error of those Christians who separate the Gospel demands from their personal relationship with the Lord, from their interior union with him, from openness to his grace.....The other harmful ideological error is found in those who find suspect the social engagement of others, seeing it as superficial, worldly, secular, materialist, communist or populist. Or they relativise it, as if there are other more important matters, or they only thing that counts is one particular ethical issue or cause that they themselves defend. Our defense of the innocent unborn, for example, needs to be clear, firm and passionate, for at stake is the dignity of a human life, which is always sacred and demands love for each person, regardless of his or her stage in development. Equally sacred however are the lives of the poor, those already born, the destitute, the abandoned and the underprivileged, the vulnerable inform, elderly exposed to covert euthanasia, the victims of human trafficking, new forms of slavery, and every form of rejection. We cannot uphold an ideal of holiness that would ignore injustice in a world where some spend with abandon and live only for the latest consumer goods, even as others look on from afar, living their entire lives in abject poverty*\"(Gaudete Exsultate, prg 101)\n* \"*A substantial number of young people for all sorts of reasons, do not ask the Church for anything because they do not see her as significant in their lives. Some even ask expressly to be left alone, as they find the presence of the Church a nuisance, even an irritant. This request does not always stem from uncritical or impulsive contempt. It can also have serious and understandable reasons: sexual and financial scandals; a clergy ill-prepared to engage effectively with the sensitivities of the young...the Church's difficulty in explaining her doctrine and ethical positions to contemporary society*\"(Christus Vivit, prg 40)\n* \"*Although many young people are happy to see a Church that is humble yet confident in her gifts and capable of offering fair and fraternal criticism, others want a Church that listens more, that does more than simply condemn the world. They do not want to see a Church that is silent and afraid to speak, but neither one that is always battling obsessively over two or three issues. To be credible....there are times when she needs to regain her humility and simply listen, recognising that what others have to say can provide some light to help her better understand the Gospel. A Church always on the defensive, which loses her humility and stops listening to others, which leaves no room for questions, loses her youth and turns into a museum*\"(Christus Vivit, prg 41)\n* \"*Faced with...uncertainty, ideology and the rigid mindset have an allure that we must resist. Fundamentalism is a means of assembling thought and behavior as a refuge that supposedly protects a person from a crisis Fundamentalist mindsets offer to shelter people from destablising situations in exchange for a king of existential quiestism. They offer you an attitude of a single, closed way of thinking, as a substitute for the kind of thinking that opens you to the truth. Whoever takes refuge in fundamentalism is afraid of setting out on the road to truth. He already 'has' the truth and deploys it as a defense, so that any questioning of it is interpreted as an aggression against his person. Discernment on the other hand, allows us to navigate changing contexts and specific situations as we seek the truth*\"(Let us Dream, pg 55)\n* \"*On the margins I have discovered so many social movements....that bring people together to make them become protagonists of their own histories, to set in motion dynamics that smacked of dignity....I call the 'social poets'. In mobilising for change, in their search for dignity, I see a source of moral energy, reserve of civic passion...It was precisely here that the Church was born...in the margins of the Cross where so many of the crucified are found. If the Church disowns the poor, she ceases to be the Church of Jesus. She falls back on the old temptation to become a moral or intellectual elite. There is only one word for the Church that becomes a stranger to the poor: 'scandal'. The road to the geographic and existential margins is the route of the Incarnation: God chose the peripheries as the place to reveal, in Jesus, his saving action in history*\"(Let us Dream, pg 120)\n* \"*War is a failure of politics and of humanity, a shameful capitulation, a stinging defeat before the forces of evil. Let us not remain mired in theoretical discussions, but touch the wounded flesh of the victims. Let us look once more at all those civilians whose killing was considered 'collateral damage'. Let us ask the victims themselves. Let us think of the refugees and displaced, those who suffered the effects of atomic radiation or chemical attacks, the mothers who lost their children and the boys and girls maimed or deprived of their childhood. Let us hear the true stories of these victims of violence, look at reality through their eyes and listen with an open heart to the stories they tell. In this way, we will be able to grasp the abyss of evil at the heart of war. Nor will it trouble us to be deemed naive for choosing peace*\"(Fratelli Tutti, prg 261)\n* \"*Just look at the figures, what a nation spends on weapons and your blood runs cold. Then compare those figures with UNICEF's statistics on how many children lack schooling and go to bed hungry, and you realise who pays the price for arms spending. In the first four months of this year(2020) 3.7 million people died of hunger. And how many have died from war? Arms spending destroys humanity. It is a very serious coronavirus, but because its victims are hidden from us we don't talk about it*\"(Let us Dream, pg 4)\n* \"*Peace in society cannot be understood as pacification or the mere absence of violence resulting from the domination of one part of society over others. Nor does true peace act as a pretext for justifying a social structure which silences or appeases the poor, so that the more affluent can placidly support their lifestyle while others have to make do as they can. Demands involving the distribution of wealth, concern for the poor and human rights cannot be suppressed under the guise of creation a consensus on paper or a transient peace for a contented minority. The dignity of the human person and the common good rank higher than the comfort of those who refuse to renounce their privileges. When these values are threatened, a prophetic voice must be raised*\"(The Joy of the Gospel, prg 218)\n* \"*Our relationship with the followers of Islam has taken on great importance, since they are now significantly present in many traditionally Christian countries where they can freely worship and become fully a part of society. We must never forget that the profess to hold the faith of Abraham and together with us they adore the once merciful God , who will judge humanity on the last day. The sacred writings of Islam retained some Christian teachings; Jesus and Mary receive profound veneration and it is admirable to see how Muslims both young and old, men and women, make time for daily prayer and faithfully take part in religious services*\"(The Joy of the Gospel, prg 252)\n* \"*In order to sustain dialogue with Islam, suitable training is essential for all involved, not only so that they can be solidly and joyfully grounded in their own identity, but so that they can also acknowledge the values of others, appreciate the concerns underlying their demands and shed light on shared beliefs.....Faced with disconcerting episodes of violent fundamentalism, our respect for true followers of Islam should lead us to avoid hateful generalisations for authentic Islam and the proper reading of the Quran are opposed to every form of violence*\"(The Joy of the Gospel, prg 253)\n* \"*A journey of peace is possible between religions. Its point of departure must be God's way of seeing things. God does not see with his eyes, God sees with his heart. And God's love is the same for everyone, regardless of religion. Even if they are atheists, his love is the same. When the last day comes and there is sufficient light to see things as they really are, we are going to find ourselves quite surprised*\"(Fratelli Tutti, prg 281)",
        "created_utc": 1678846493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever wondered what lies beneath the Temple Mount?",
        "author": "Cyber_Destroyer",
        "url": "https://youtu.be/Xqr4VE27Z6M",
        "text": "",
        "created_utc": 1678841515,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (an atheist) child told me she wants to go to church, no clue where to start.",
        "author": "sparkingrock",
        "url": "https://www.reddit.com/r/religion/comments/11rfddx/my_an_atheist_child_told_me_she_wants_to_go_to/",
        "text": "My 7 year old daughter has been asking a lot of questions about god lately, her father and I are both atheists he was raised catholic and is no longer practicing but I was raised without any religion. She knows very little about religion outside of what she hears from her friends or from attending the baptisms of her cousins. We are open with her that we don’t believe in god but lots of people do and that’s perfectly fine. Tonight she told me she believes in god and wishes she could go to church, so I told her I would take her. I’m honestly not even sure where to start though, like can I just walk into any old church on Sunday morning with her and sit down? I’m way out of my element here but don’t want to deny her that experience if it’s truly something that she is interested in doing. Any advice would be super appreciated!",
        "created_utc": 1678838576,
        "upvote_ratio": 0.75
    },
    {
        "title": "What is God for you?",
        "author": "Pupkin333",
        "url": "https://www.reddit.com/r/religion/comments/11reidu/what_is_god_for_you/",
        "text": "Hey guys, what is God for you?",
        "created_utc": 1678819223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for an interviewee :)",
        "author": "Same_Expression_2675",
        "url": "https://www.reddit.com/r/religion/comments/11regbd/looking_for_an_interviewee/",
        "text": "[removed]",
        "created_utc": 1678819101,
        "upvote_ratio": 1.0
    },
    {
        "title": "காஞ்சி மஹா பெரியவா அருளிய சுலோகம், ( SLOGA FOR CURE FROM DISEASES INCLUDING CANCER )",
        "author": "Snathan-22",
        "url": "http://kmp2022.in",
        "text": "",
        "created_utc": 1678813963,
        "upvote_ratio": 1.0
    },
    {
        "title": "if u kys will u go to heaven or will u stay in hell for eternity?",
        "author": "OkRecipe8849",
        "url": "https://www.reddit.com/r/religion/comments/11rbo5d/if_u_kys_will_u_go_to_heaven_or_will_u_stay_in/",
        "text": "help",
        "created_utc": 1678813087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your religion's stance on (moderate) recreational drug use?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/11rasjj/your_religions_stance_on_moderate_recreational/",
        "text": "And when I mean drug use, I'm not referring to \"hard drugs\". But something more akin to marijuana. And using such drugs in a moderate indulgence manner.\n\nAnd whatever your religion's stance is, what are your thoughts on religions with the opposite view?",
        "created_utc": 1678811156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christians aren't even supposed to be peddling their religion",
        "author": "bofpisrebof",
        "url": "https://twitter.com/MintyCatAttack/status/1635476503335956480",
        "text": "",
        "created_utc": 1678810536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Name some things you like about different faiths.",
        "author": "Starving_Artist2023",
        "url": "https://www.reddit.com/r/religion/comments/11r9uc4/name_some_things_you_like_about_different_faiths/",
        "text": "[removed]",
        "created_utc": 1678809133,
        "upvote_ratio": 1.0
    },
    {
        "title": "i am tired about life. I am tired about worrying. I cant have faith.",
        "author": "Rizogalos",
        "url": "https://www.reddit.com/r/religion/comments/11r89no/i_am_tired_about_life_i_am_tired_about_worrying_i/",
        "text": "so much corruption and deception.\n\nand yet, i am trying to figure out what is the meaning of life and which religion/theory is the truth.\n\nPeople share different ideas not only about the creation of life but also about politics. People have beliefs, ideas and disagreements between them.\n\nThere are people who have claimed to have the truth through psychedelics. other people claim to have the truth with religion.\n\nso, according to christianity i must consider them all as false and simply put my faith in Jesus even though there is no evidence that he is the truth.\n\nChristians will mention scriptures and prophecy fullfilment as a strong evidence for christianity, but dont these things also apply to other religions.\n\nSo, I cant see why I must simply accept as Jesus the truth. it really seems suspicious to me to believe people that claimed to have had the word of God. It really seems illogical to me.\n\nDifferent interprations, science/bible contradictions, disagreements between christians. All that suggest to me that christianity is just another religion created by humans and some were decieved to believe that it was God's command.\n\nI want Jesus to be the truth because I have hope. But i think i cant have faith for the reasons i mentioned. I want Jesus to be the truth because its good to know that someone is taking care of me.\n\nWithout faith, my mind is filled with what ifs. What if there is no God? what if there is a God who is not mentioned in any religion? what will happen if i die? what if we are living in a simulation? what if i am trapped in prison earth (read prison earth theory)?\n\ni just cant enjoy life anymore.",
        "created_utc": 1678805632,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Egg",
        "author": "LowRevolutionary4251",
        "url": "https://www.reddit.com/r/religion/comments/11r48uy/the_egg/",
        "text": "[removed]",
        "created_utc": 1678795291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humour in religious scripture",
        "author": "miniatureconlangs",
        "url": "https://www.reddit.com/r/religion/comments/11r447v/humour_in_religious_scripture/",
        "text": "Humour is an important aspect of human linguistic communication. Naturally, we would expect some humour in sacred texts (and non-textual traditions!) as well. *However*, in some cultures, religious scripture may have such a status that it's felt that humour is not fit for such contexts and therefore, the modern believer may fail to spot that something in fact is a joke.\n\nAlso, given the age of, say, the Tanach or the vedic literature, it's quite conceivable that a modern reader may fail to identify that something is a joke, because the type of humour - and the assumed background knowledge - no longer fits the readers' humour.\n\nAre there any passages that you're aware of in any scripture that you think is cryptic *unless* understood as intended as a joke? I'm not asking about things like \"oh, that explains the creation account in Christianity\" - let's grant that people did believe outlandish things, that's low-hanging fruit and it's barely even an attempt at taking the author seriously. Let's go for things where we actually maybe gain an understanding of the author's views by positing that it's a joke.\n\nAny religious scripture is welcome. My personal interests do focus on rabbinic literature, but any abrahamic, dharmic, ancient 'pagan', literature is welcome, and even jokes in living oral traditions would be interesting.",
        "created_utc": 1678794894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can y'all list specific daily conduct required of each religion? Some of them seem useful.",
        "author": "hapa_hop5",
        "url": "https://www.reddit.com/r/religion/comments/11qz0rm/can_yall_list_specific_daily_conduct_required_of/",
        "text": "[removed]",
        "created_utc": 1678776416,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have psychosis, I hear a voice that takes care of me and loves me, while there’s another ugly voice… what and who are they?",
        "author": "Pale-Petal",
        "url": "/r/starseeds/comments/11qxoqh/i_have_psychosis_i_hear_a_voice_that_takes_care/",
        "text": "",
        "created_utc": 1678772045,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is most frustrating about the meaning of life and your purpose for living?",
        "author": "Cridaber13",
        "url": "https://www.reddit.com/r/religion/comments/11qssb0/what_is_most_frustrating_about_the_meaning_of/",
        "text": "[removed]",
        "created_utc": 1678757706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you tried 12 steps program as a religious person?",
        "author": "lostinthetrash4ever",
        "url": "https://www.reddit.com/r/religion/comments/11qrw84/have_you_tried_12_steps_program_as_a_religious/",
        "text": "AA/NA/OA etc",
        "created_utc": 1678755494,
        "upvote_ratio": 1.0
    }
]