[
    {
        "title": "The Fall of Man l Voddie Baucham preaches on the fall of man and consequences thereof. However, the grace God in His redemptive plan is revealed in the passage that follows.",
        "author": "Reformed2ndLBCF",
        "url": "https://www.youtube.com/watch?v=cufnp5qn_Vs",
        "text": "",
        "created_utc": 1674074185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trinity is not a biblical doctrine",
        "author": "Giant_Sin_Basket",
        "url": "https://www.reddit.com/r/religion/comments/10fhntg/trinity_is_not_a_biblical_doctrine/",
        "text": "[removed]",
        "created_utc": 1674073449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Christianity a solar(ish) religion?",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/10fheff/is_christianity_a_solarish_religion/",
        "text": "Aesthetically speaking it seems Christianity prefers color such as yellow or gold, and Jesus' Halo looks like the sun. In Orthodox and Catholic churches those seem to be the colors preferred, yellow and golden. Evangelicals also prefer to use pictures of the sun or daylight to decorate Church presentations and videos most of the time.\n\nI know that some occultists tried to claim that Jesus was a solar myth, but that has been debunked by schoolars. However, it is true there seems to be a \"solar\" flavor in Christianity.\n\nI suspect that a lot of this style came from the Sol Invictus Immperial cult, but I cannot prove that and it seems that the Gospels already had some descriptions of Jesus as \"the Light\" already. Light is also described as a way to revelate things: \"For there is nothing covered that will not be revealed, nor hidden that will not be known.\" Luke 12:2-3\n\nSo theologically speaking it seems that there is no foundation to claim Christianity is solar, but aesthetically and culturally speaking it seems unconsciuosly Christians associate the Sun with their faith.",
        "created_utc": 1674072822,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean to be a 'non-trinitarian' Christian?",
        "author": "IXBlackHeartXI36",
        "url": "https://www.reddit.com/r/religion/comments/10fgpc0/what_does_it_mean_to_be_a_nontrinitarian_christian/",
        "text": "I've seen this mentioned before, but I have no clue what it could mean. I believe I first heard about when I asked about Noahidism on here. Someone claimed that Christians would probably qualify automatically as long as they were 'non-Trinitarian'.\n\nThe only two models I've ever heard of for the Christian god is that Jesus was essentially an avatar of God, or that Jesus is basically just a really special person in heaven's hierarchy. Aka, 'the son of God'. I know of no other models, outside of ones mentioned in history books. \n\nWhat on earth does it mean to be a 'non-trinitarian Christian'? Some people seem to think that all Christians are 'trinitarian', so then what does 'non-trinitarianism' look like? Are there any other models for God besides the ones I listed? Also, I've sorta always been weirded out by things I've seen claiming that Mormons see God and Jesus as separate individuals, as if that's something weird. Its never been weird to me, in fact its the view I held when I was Christian. Then again, my first preacher my have secretly been a Mormon (he told my father once that god originated from some planet, which I was weirded out by because I could find no mention of this anywhere in this digital bible we had that came with a search function, of course my father was a schizophrenic so who knows if that was true or not, then again he never once demonstrated any knowledge of mormonism, or even awareness of its existence, so he may not have been able to make that up, either way they're both long dead now so there's no way of knowing). Of course, I'll be honest I didn't listen to the guy much; I often slept through church and I never could understand anything he was talking about. Guess I just was never a very good Christian. I mean, I was shocked when I found out that the bible condemns homosexuality. I was seriously completely unaware of that, and it ran against everything I thought I knew about the religion. Sorry for the rant, I'm done now.",
        "created_utc": 1674071170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about Numbers 31:18 and other verses",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10fghza/questions_about_numbers_3118_and_other_verses/",
        "text": "Hello! I actually have a few questions...\n\nThe first is about Numbers 31:18...\n\n[https://biblehub.com/numbers/31-18.htm](https://biblehub.com/numbers/31-18.htm)\n\nThere is no way it's saying to use these girls as sex slaves, but is it still saying take them as slaves? The mentioning of them having never slept with a man before is such a odd detail, but, again, I don't think it's implying you should have sex with them...\n\nHere are some other verses that have been claimed to show support for pedophilia in Christianity. Do  they? o.0 The first verse linked below seems to relate to the question I asked above taking young girls as slaves.\n\n[https://www.biblegateway.com/passage/?search=Deuteronomy%2020%3A10-14&amp;version=NIV](https://www.biblegateway.com/passage/?search=Deuteronomy%2020%3A10-14&amp;version=NIV)\n\n[https://www.biblegateway.com/passage/?search=Judges%2021%3A7-23&amp;version=ESV](https://www.biblegateway.com/passage/?search=Judges%2021%3A7-23&amp;version=ESV)\n\n[https://www.biblegateway.com/passage/?search=Exodus+21:7-10](https://www.biblegateway.com/passage/?search=Exodus+21:7-10)\n\nFinally, is this quote approving of child marriage? It sounds like it is still saying it's a bad thing, but that it's valid.\n\n\"\\[a High Priest\\] must not marry a woman who is adolescent[5](https://halakhah.com/yebamoth/yebamoth_60.html#60a_5)  or \"wounded\",[6](https://halakhah.com/yebamoth/yebamoth_60.html#60a_6)   but if he married her, the marriage is valid', which clearly proves  \\[that he may continue to live with the woman because in any case\\] she  would ultimately have become adolescent and would ultimately have been  'wounded' by living with[7](https://halakhah.com/yebamoth/yebamoth_60.html#60a_7)  him; here also[8](https://halakhah.com/yebamoth/yebamoth_60.html#60a_8)  \\[she should be permitted to live with him because\\] ultimately she would have become a be'ulah by living with[7](https://halakhah.com/yebamoth/yebamoth_60.html#60a_7)  him! — This is a difficulty.\"\n\nFrom... [https://halakhah.com/yebamoth/yebamoth\\_60.html](https://halakhah.com/yebamoth/yebamoth_60.html)\n\nAnd what is the text talking about at the beginning at the top of the page?\n\n\"that he pays no fine  in the case of a seduced woman.\"  \n\n\nPlease don't ban me for these posts. I'll try to make this the last post I make on here for awhile. I'm just reading all these different things and wanted to get the answers and straighten it all out. I figured this part of Reddit would be the best place to ask. Thank you!",
        "created_utc": 1674070693,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think an omnipotent God could exist",
        "author": "catboy519",
        "url": "https://www.reddit.com/r/religion/comments/10ff02n/i_think_an_omnipotent_god_could_exist/",
        "text": "Could God create a rock so heavy He cannot lift it? This is the argument many probably heard\n\nMy try on it is: Yes God could create that, but won't do it, and since God never did create this rock, there is nothing He cannot lift, therefore there is nothing God cannot do.\n\nIn other words: God could make Himself no longer omnipotent, and obviously won't do that.\n\nSo does this argument still stand?",
        "created_utc": 1674067166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a common myth of an evil spirit / god being bound and then released at the End of the World?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10fdupf/is_there_a_common_myth_of_an_evil_spirit_god/",
        "text": "Hi. I have just noticed a curious parallel between the Book of Revelation and the Poetic Edda, written by the Icelandic (Christian) Snorri Sturluson, supposedly a depiction of Norse polytheistic belief.\n\nNear the Apocalypse, God binds the Devil for a thousand years:\n\nHe seized the dragon, that ancient serpent, who is the Devil and Satan, and bound him for a thousand years and threw him into the pit and locked and sealed it over him, so that he would deceive the nations no more, until the thousand years were ended. After that, he must be let out for a little while.\n— Revelation 20:2-3\n\nHe then lets the Devil out, and a great battle is had, which the Devil loses, and is then tortured till for the rest of time:\n\n7 When the thousand years are over, Satan will be released from his prison 8 and will go out to deceive the nations in the four corners of the earth—Gog and Magog—and to gather them for battle. In number they are like the sand on the seashore. 9 They marched across the breadth of the earth and surrounded the camp of God’s people, the city he loves. But fire came down from heaven and devoured them. 10 And the devil, who deceived them, was thrown into the lake of burning sulfur, where the beast and the false prophet had been thrown. They will be tormented day and night for ever and ever.\n— Revelation 20:7-10\n\n\nSat in a drinking hall, one of the giants, Skathi, boasts to Loki how the Gods will bind him on a rock with his son's entrails:\n\nSkathi spake:\n49. \"Light art thou, Loki, | but longer thou mayst not\nIn freedom flourish thy tail;\nOn the rocks the gods bind thee | with bowels torn\nForth from thy frost-cold son.\"\n\nLokasenna (Edda)\n\n\nAnd at Ragnarok, the end of the world (as we know it), Loki escapes and partakes in the assault on the Gods, after which the world is reborn:\n\n51. O'er the sea from the north | there sails a ship\nWith the people of Hel, | at the helm stands Loki;\nAfter the wolf | do wild men follow,\nAnd with them the brother | of Byleist goes.\n\nVoluspa (Edda)\n\n\nIs this a recurring theme across mythologies, of an evil spirit/god being bound and then released at the End of the World? Can anyone relate any other similar tales?",
        "created_utc": 1674064540,
        "upvote_ratio": 0.99
    },
    {
        "title": "Hold on to me (A short video to help Christians with their faith!)",
        "author": "boneyardminister",
        "url": "https://odysee.com/@SolaFide:8/hold-on-to-me:c?r=4LUeVypWw6ToAwLkUiE45XTRS7NXPytB",
        "text": "",
        "created_utc": 1674057820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are you religus?",
        "author": "thelittleweido",
        "url": "https://www.reddit.com/r/religion/comments/10f8wbf/why_are_you_religus/",
        "text": "I as an atheist thought that this might be the place to come and ask. I have religus people in my life like my mother and father but I wanted to extend the base of my knowlege on this subject. So while I know that many of you might not agree with my lifestyle I was wondering why you chose to be religus and what does it bring into your life.\n\nI am sorry for any spelling error as I am not a native speaker",
        "created_utc": 1674052668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do Jews believe that angels have no 'free will'?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10f7h13/why_do_jews_believe_that_angels_have_no_free_will/",
        "text": "Hi. Why do Jews say that angels have no 'free will'? Is this stated somewhere in the Bible? What is the source for this idea that angels are just 'avatars' or 'servants' of God, as someone else put it? Is it written anywhere or is it oral tradition? The reason I ask mainly is because this is the source of the idea that the Devil cannot 'fall' or disobey God, because the Devil is an angel and so, in Judaism, has no 'free will'.\n\nThe Jewish idea of the 'Devil' I'm told is a servant of God who is merely there to test people. This is very different from the pervasive 'Ruler of this World' paranoia, I think it's fair to say, of the Devil found in the New Testament, and hence Christianity.\n\nAs Christianity is largely based on the Hebrew religion, this seems rather important for testing the Christian idea of the 'Devil' as this angel who chose to disobey God, 'fell', and so actively perverts Creation--for which reason Christ was sent to 'undo the Devil's work' (Gospel of John, maybe, I can't remember).\n\nSo if angels do not have 'free will', then the Christian narrative of the 'Devil' is essentially heretical. (My own, perhaps premature, theory is that it is Zoroastrian in origin.)",
        "created_utc": 1674048705,
        "upvote_ratio": 0.99
    },
    {
        "title": "Not qualified. Need advice.",
        "author": "chowto",
        "url": "https://www.reddit.com/r/religion/comments/10f606v/not_qualified_need_advice/",
        "text": "I love my grandson with all my heart.  He's 8 year's old and recently he is telling me about conversations that he is having with his friends about God, the afterlife, etc.  I can tell that he is looking to me for answers.  \n\nI believe in and love God but, even though I've tried, I have never been able to get settled in my heart much else as far as the different religions go.\n\nLooking for advice.",
        "created_utc": 1674044222,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some religions that have commandments about food?",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/religion/comments/10f51he/what_are_some_religions_that_have_commandments/",
        "text": "This is based on the story that \"it seems that obesity treatment for American children will be officially recognized\".    \nI have long been concerned about the strong tendency toward obesity in the United States.    \nI also know that the obesity trend in America was taken up as a problem in the media.    \n　　　    \n\nSo     \nI asked why children get fat in reddit.    \n&gt;・Lack of food education knowledge,    \n・Lack of knowledge of the harm caused by junk food,    \n\n This seems to be the cause.    \n　　　    \n\non the other hand    \n Shokuiku education is already widely deployed around the world.    \n Food education has already achieved many successes.    \n　　　    \n\nTherefore    \n This time, I thought that even in the United States, public organizations should provide all children with a complete lunch that is complete with all the nutrients.    \n\n But    \n I received an opinion that religious precepts for food create conflict.    \n　　　    \n\nTherefore    \n Please let me hear from you.    \n What are some religions that have commandments about food?    \n\n Also    \n What is the content of that commandment?    \n Beef, pig, lambdan, etc.?",
        "created_utc": 1674041093,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ancient Egyptians worshipped over 1,400 different gods and goddesses in their shrines, temples, and homes. Many of the Egyptian gods and goddesses were #Anthropomorphic , which means that they were usually depicted as part human and part animal.",
        "author": "drcpanda",
        "url": "https://www.ees.ac.uk/gods-of-egypt",
        "text": "",
        "created_utc": 1674038992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Original sin",
        "author": "limanyasmaa",
        "url": "https://www.reddit.com/r/religion/comments/10f37e6/original_sin/",
        "text": "[removed]",
        "created_utc": 1674034301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christianity, Consubstantiation, the Trinity, and the Unforgivable",
        "author": "Cloud_Seeder",
        "url": "https://www.reddit.com/r/religion/comments/10f03b2/christianity_consubstantiation_the_trinity_and/",
        "text": "Consubstantiation is defined as, “of one essence or substance.” (Bridge, James. \"Homoousion.\" *The Catholic Encyclopedia* Vol. 7)\n\nThere is “One God, the Father almighty . . . one Lord Jesus Christ . . . consubstantial with the Father . . . \\[and\\] the Holy Spirit, the Lord, the giver of life, who proceeds from the Father and the Son.” (*Nicene Creed*)\n\nThe author of *Matthew* (12:31) quotes Lord Jesus Christ as saying,   \n “All manner of sin and blasphemy shall be forgiven unto men, but the blasphemy against the Holy Ghost **shall not be forgiven** unto men.”\n\nWhat say you:\n\n1. Why is blasphemy of the Holy Ghost unforgivable? \n2. Why is blasphemy of God and Jesus forgivable? \n3. Is the Holy Ghost not consubstantial with the other gods?",
        "created_utc": 1674022655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Patience",
        "author": "Calm-Field9753",
        "url": "https://joecamerota.medium.com/patience-89df8348073e",
        "text": "",
        "created_utc": 1674021476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jesus and god are assholes. They never answer my prayers. If I tell them that when I see them; what will they say? Would they be merciful or burn my ass and not care?",
        "author": "Love27373737",
        "url": "https://www.reddit.com/r/religion/comments/10eybf9/jesus_and_god_are_assholes_they_never_answer_my/",
        "text": "[removed]",
        "created_utc": 1674017184,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a non-believer was about to accept God into their heart, but the rapture happened before they could, would they still go to hell, or would God acknowledge them and let them into heaven?",
        "author": "Aggressive-Tree-1437",
        "url": "https://www.reddit.com/r/religion/comments/10exbdc/if_a_nonbeliever_was_about_to_accept_god_into/",
        "text": "[removed]",
        "created_utc": 1674014272,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to start??",
        "author": "Towel43",
        "url": "https://www.reddit.com/r/religion/comments/10etm9i/how_to_start/",
        "text": "Hi everyone, I was born catholic but was not raised as a catholic. Recently I’ve been wanting to get in touch with my religious side, for myself and my daughter. I do not like your stereotypical-type church. I need something to relate to and have her of churches that talk about the bible in relatable ways… is there a way to find this? I don’t know how exactly to get back into it. Any help is appreciated :)",
        "created_utc": 1674004153,
        "upvote_ratio": 1.0
    },
    {
        "title": "News on Pope's reaction on the third secret leaked through \"Đavolja noć\"",
        "author": "krakarakakaus",
        "url": "https://www.reddit.com/r/religion/comments/10es578/news_on_popes_reaction_on_the_third_secret_leaked/",
        "text": "[removed]",
        "created_utc": 1674000438,
        "upvote_ratio": 1.0
    },
    {
        "title": "does God need our love or do we need Gods love?",
        "author": "BarberOwn1935",
        "url": "https://www.reddit.com/r/religion/comments/10eriw3/does_god_need_our_love_or_do_we_need_gods_love/",
        "text": "[removed]",
        "created_utc": 1673998948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any Near Death Experience where there was NOT heaven or hell?",
        "author": "catboy519",
        "url": "https://www.reddit.com/r/religion/comments/10eqvlt/are_there_any_near_death_experience_where_there/",
        "text": "asking because youtube is full of \"I saw heaven\" \"I saw hell\" but in order to figure out if thats all true, I'm wondering if anyone also had a Near Death / Out Of Body experience, but there was no heaven or hell or gods or demons or angels. Or maybe you were dead, but you were not conscious and therefore you dont remember anything?",
        "created_utc": 1673997387,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would like to have a religious Catholic marriage ceremony, do i get a marriage certificate?",
        "author": "moonyme94",
        "url": "https://www.reddit.com/r/religion/comments/10eqcsp/i_would_like_to_have_a_religious_catholic/",
        "text": "Is that the same as non religious certificate? Or i have to get two?\nMe and my fiance were thinking to sign the papers in the UK, and then have a religious ceremony elsewhere abroad.\nNot sure if thats possible. \nAlso back at home if you had a religious ceremony it means if you are getting a divorce you need get a confirmation from the priest, is it the same now?( i only have outdated info)",
        "created_utc": 1673996133,
        "upvote_ratio": 1.0
    },
    {
        "title": "How low can certain people go?",
        "author": "Shizzachan",
        "url": "https://www.reddit.com/r/religion/comments/10epnen/how_low_can_certain_people_go/",
        "text": "Somebody texted me a very obvious spam link to me pretending to be a Christian and trying to hack me simply because of what I said… some people in this subreddit are ridiculous",
        "created_utc": 1673994453,
        "upvote_ratio": 1.0
    },
    {
        "title": "If God is omniscient,then why does he get angry and punish man for committing sin?",
        "author": "Dancing_Penguin22",
        "url": "https://www.reddit.com/r/religion/comments/10enrzh/if_god_is_omniscientthen_why_does_he_get_angry/",
        "text": "  I want to know why God got upset at Adam and Eve for eating the forbidden fruit when he already knew that they would eat it. It's like keeping candy in front of a four year old and telling the child not to eat the candy when you clearly know that the child will eat it. You then punish the child afterwards for eating the candy which you CLEARLY knew that the child would eat. \n\nSecond,why did God flood the earth because everyone was committing sin (except Noah and his family)when he clearly knew that man will always commit sin. \n\nHelp me understand",
        "created_utc": 1673990136,
        "upvote_ratio": 1.0
    },
    {
        "title": "The third secret of Fatima leaked...",
        "author": "krakarakakaus",
        "url": "https://www.reddit.com/r/religion/comments/10enctx/the_third_secret_of_fatima_leaked/",
        "text": "[removed]",
        "created_utc": 1673989183,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Islam, War is Justified!",
        "author": "introspectivepurpose",
        "url": "https://www.reddit.com/r/religion/comments/10en1sk/in_islam_war_is_justified/",
        "text": "[removed]",
        "created_utc": 1673988470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is God good?",
        "author": "123BobsUrUncle",
        "url": "https://www.reddit.com/r/religion/comments/10emi9d/is_god_good/",
        "text": "I would love to have a lengthy civil discussion about whether God can be considered morally good.\n\nThe basis of my argument is this:\nNot saving someone from being hurt when you could is a sin of omission, so doesn’t God commit a sin with every person He forces to suffer, be it physically or mentally?",
        "created_utc": 1673987213,
        "upvote_ratio": 1.0
    },
    {
        "title": "What qualifies someone to be a preacher of a church?",
        "author": "Ishouldprobbasleep",
        "url": "https://www.reddit.com/r/religion/comments/10ekthw/what_qualifies_someone_to_be_a_preacher_of_a/",
        "text": "I see a lot of young people I went to school with becoming preachers of different churches in my town and I can’t figure out what has qualified them to preach. No formal training, no education, nothing. They just one day decided to turn their lives around and now believe they are wise enough to preach to the masses. I even listen in sometimes on their Facebook lives and they are mostly just reading verses from the Bible and yelling about it, they all sound alike, preach alike, etc.",
        "created_utc": 1673983315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding Islamic Education in Russia: The Struggle over Identity and Belonging in Russia’s Muslim-Majority Regions",
        "author": "CEPAORG",
        "url": "https://cepa.org/comprehensive-reports/understanding-islamic-education-in-russia-the-struggle-over-identity-and-belonging-in-russias-muslim-majority-regions/",
        "text": "",
        "created_utc": 1673982436,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why is there so little academic focus on the study of Western esotericism among religious studies scholars?",
        "author": "EmptySky93",
        "url": "https://www.reddit.com/r/religion/comments/10ek85x/why_is_there_so_little_academic_focus_on_the/",
        "text": "I have been privately focusing on studying Western esotericism, the occult, magick, and mysticism in my broader quest to study and understand comparative religion and religious studies over the years. However, I am not an academic, and I've very much wondered why there is so little scholarly focus on the Western Esoteric Tradition among religious studies scholars—at least as far as I can tell.\n\nI suppose I may be biased. I am a Thelemite and see that Thelema and the Western Mystery Tradition as a whole contains a vast wealth of knowledge and information that would be of use to those studying religion at an academic level.",
        "created_utc": 1673981931,
        "upvote_ratio": 1.0
    },
    {
        "title": "The evidence that Islam is the truth",
        "author": "Hakim2000",
        "url": "https://www.reddit.com/r/religion/comments/10ejtjv/the_evidence_that_islam_is_the_truth/",
        "text": "[removed]",
        "created_utc": 1673980963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am wrong to think that prayers without effort or handwork doesn't work?",
        "author": "phy196",
        "url": "https://www.reddit.com/r/religion/comments/10ejdd5/am_wrong_to_think_that_prayers_without_effort_or/",
        "text": "[removed]",
        "created_utc": 1673979898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monotheists, would be comfortable if the society you lived in was cast majority pagan/polytheistic?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/10eilpv/monotheists_would_be_comfortable_if_the_society/",
        "text": "This question is obviously for monotheistic people that live in a mostly monotheistic majority religion society/country. \n\nWould you be perfectly fine if you lived somewhere that didn't have any churches of your faith? And finding another person of your faith irl would be quite rare? And seeing temples to the various gods all around town? And mentions of the gods everywhere in culture? Etc. \n\nWould you feel any different? Would your view on these pagan religions change compared to your current views?",
        "created_utc": 1673978122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everything is a door to enlightenment",
        "author": "daniel_shkolnik",
        "url": "https://www.reddit.com/r/religion/comments/10eikhy/everything_is_a_door_to_enlightenment/",
        "text": "Something I've been thinking on for a while now: \n\nImagine that all the objects around you—that painting, that plant, that bowl—are little doors with handles. And if you were to turn the handle and open them, like in a children's pop-up book, what you'd find on the other side is the astounding and dazzling river of existence.\n\nWe may think some things are sacred and others profane. Some things are more holy or spiritual than others. And certainly, when we cross the threshold of a certain sacred place, like the arches of a cathedral, or the wall of a cemetery, or into our childhood room—there is usually a clear, bodily sensation of something \"deeper\" about the space.\n\nBut this division is an illusion. That same depth of feeling is accessible in any place, in any circumstance, at any time—provided that we are awake to it.\n\nSpiritual community builder and ritualist Casper ter Kuile once told me that instead of thinking of the sacred as divided by vertical lines (like passing into a cathedral), we can think of it as a horizontal one, that is: it doesn't matter where you are, as long as you dive deep enough into a place, even a bus stop can become a sacred space and a gateway to awakening.\n\nIn fact, a friend of mine the other week told me about being overjoyed, eyes brimming with tears, as he stood in a supermarket aisle, astounded by the abundance of choices he had.\n\nAny facet of the world is a doorway that leads to the very heart of life. Even a cereal box.\n\nThis is true not only of physical things and spaces, but of any emotion or concept. Faith, suffering, love, joy, motion, stillness, God, no-God, many gods—any of these can serve as entry points into the rest of reality.\n\nIt's said that a vast net of jewels hangs over the the palace of the Hindu god Indra. Every jewel contains the reflection of every other jewel. And when you look at any of those tiny reflected jewels, you see—again—that it contains the reflection of every other jewel. Like dew drops on a spider's web. Like a fractal. On and on and on.\n\nEverything contains everything else. And so it doesn't matter what God you dedicate yourself to, or what spiritual teacher you sit with, or how you practice. As long as you are honest in your practice and take it to its ultimate conclusion, they are all doorways.\n\nMore on this here:\n\n[https://www.stableawakening.com/post/everything-is-a-door-to-enlightenment](https://www.stableawakening.com/post/everything-is-a-door-to-enlightenment)",
        "created_utc": 1673978040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Umfrage",
        "author": "Simple_Cut766",
        "url": "https://easy-feedback.de/umfrage/1593239/8xOl8J",
        "text": "",
        "created_utc": 1673977966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about a quote from the \"book of marriage\" from \"Sahih Muslim\"",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10ei0i3/question_about_a_quote_from_the_book_of_marriage/",
        "text": "Hello! I guess this post is a sister/brother post to my previous post that should still be up. Regardless, I wanted to ask what this quote from the \"Sahih muslim.\" I'm putting those things into \" because I have no idea what the proper way to refer to them is, and I don't want to offend any Muslims on. The quote is...\n\n&gt; 0 Abu Sa'id, did you hear Allah's Messenger (ﷺ) mentioning al-'azl? He  said: Yes, and added: We went out with Allah's Messenger (ﷺ) on the  expedition to the Bi'l-Mustaliq and took captive some excellent Arab  women; and we desired them, for we were suffering from the absence of  our wives, (but at the same time) we also desired ransom for them. So we  decided to have sexual intercourse with them but by observing 'azl  (Withdrawing the male sexual organ before emission of semen to  avoid-conception). But we said: We are doing an act whereas Allah's  Messenger is amongst us; why not ask him? So we asked Allah's Mes-  senger (ﷺ), and he said: It does not matter if you do not do it, for  every soul that is to be born up to the Day of Resurrection will be born \n\nI've read that this has been interpreted as allowing taking women as sexual slaves, but I've also seen things saying that that kind of thing is absolutely prohibited in Islam. I specifically found a stackexchange post explaining how that is prohibited in Islam. My main question is what the very last sentence is suppose to mean. I presume I know who is saying the last part, but, again, I don't know how to properly reference him in a way that might offend any Muslims on here. Is he saying that it (taking the women as slaves) is okay because... well, I'm not sure what he means about the every soul and Day of Resurrection part, but I still wanted to ask for someone to clarify. Here is the verse in a proper link below...\n\n[https://sunnah.com/muslim:1438a](https://sunnah.com/muslim:1438a)",
        "created_utc": 1673976708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient Egyptian religion",
        "author": "ptahhotep_",
        "url": "https://en.wikipedia.org/wiki/Ancient_Egyptian_religion#History?wprov=sfla1",
        "text": "",
        "created_utc": 1673976024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Islam supports bestiality? (Or, a verse that has been misinterpreted?)",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10ehedp/islam_supports_bestiality_or_a_verse_that_has/",
        "text": "Hello! I wanted to ask if these Quranic verses really do \"provide indirect support for bestiality,\" as the webpage I will link to at the end of this post claims. The verses are... \n\n&gt;Successful indeed are the believers, Who are humble in their prayers,   And who keep aloof from what is vain, And who are givers of poor-rate, And who guard their   private parts, Except before their mates (*azwajihim*) **or those whom their   right hands possess**, for they surely are not blameable, But whoever seeks to go   beyond that, these are they that exceed the limits; And those who are keepers of their   trusts and their covenant, And those who keep a guard on their prayers; These are they who   are the heirs, Who shall inherit the Paradise; they shall abide therein. S. 23:1-11 Shakir  \n for, behold, of their Sustainer's chastisement none may ever feel \\[wholly\\] secure; and   who are mindful of their chastity, \\[not giving way to their desires\\] with   any but their spouses (*azwajihim*) - **that is, those whom they rightfully possess**   \\[through wedlock\\] - : for then, behold, they are free of all blame, whereas such as seek   to go beyond that \\[limit\\] are truly transgressors; and who are faithful to their trusts   and to their pledges: and who stand firm whenever they bear witness; and who guard their   prayers \\[from all worldly intent\\]. These it is who in the gardens \\[of paradise\\] shall be   honoured! S. 70:28-35 Asad  \n \n\nThe webpage goes on to say...\n\n&gt; What makes these texts quite interesting is that some Muslims have used these to prove that Islam does not permit bestiality. They claim that the references limit lawful relations to a man’s spouses or slave girls, and anything beyond this is clearly exceeding the limits which Allah has ordained ([source](http://f24.parsimony.net/forum54389/messages/68077.htm)).   \n&gt;  \n&gt;The problem with this attempt is that the Arabic words for spouses/mates and \"those whom your right hands possess\" are not limited to wives or female slaves, at least not in these specific texts. The context of these verses refer to all the believers, whether male or females, and implies that the words refer to either spouse, i.e. to husbands or wives, and to whatever a person owns or possesses such as animals, property etc. There is even one place in the Quran that presents a list of persons and things that a man possesses:  \n&gt;  \n&gt;Fair in the eyes of men is the love of THINGS they covet: women and sons, heaped-up   hoards of gold and silver, horses branded for blood and excellence, and wealth of cattle   and well-tilled land. Such are the POSSESSIONS of this world's life, but in nearness   to Allah is the best of the goals to return to.\" S. 3:14  \n   \n&gt;  \n&gt;Even though the above text doesn’t use the same Arabic expression found in Suras 23 and 70, the meaning is the same since \"those whom your right hands possess\" obviously encompass all the above persons and items. That is unless, of course, Muslims want to argue that a person’s possessions are different from what his right hand owns!  \n&gt;  \n&gt;Furthermore, there are places in the Quran where the phrase \"those whom your right hands possess\" includes more than just the female captives (cf. Suras 4:36; 16:71; 30:28).  \n&gt;  \n&gt;In fact, one Muslim admitted that the expression \"right hands possess\" does include everything which a person may own such as animals etc., even though he tries to refute the notion that Islam allows bestiality. Near the end of his audio presentation, Osama Abdallah says by way of response to a paltalk([\\*](http://www.paltalk.com/))  debater named Christian Prince([\\*](http://www.investigateislam.com/)):  \n&gt;  \n&gt;Also Allah almighty allowed only sex to be done with the female right hand possessions   from out of all of the right hand possessions which include male, males, females, and   animals; and other objects like furniture, for instance, or weapons, or, or objects that   could be used, for instance, for sex, you know I don’t want to get graphic but you   get the picture, where small objects could be used for sexual pleasures. These are all,   ah, right hand possessions. But God almighty in the noble Quran made it clear that out of   the right hand possessions, only females are allowed to be, to have, for the Muslims to   have sex with them. And only the male Muslims, not the female, ohm, Muslim masters. And   not, and certainly the female Muslim masters are not allowed to have sex with the, with   the male slaves. ([Audio source](http://www.answering-christianity.com/no_sex_with_animals.mp3))  \n   \n&gt;  \n&gt;Even the late Muhammad Asad provides indirect attestation for our exegesis when he writes  regarding Sura 23:6:  \n&gt;  \n&gt;Lit., \"or those whom their right hands possess\" (aw ma malakat aymanuhum).   Many of the commentators assume unquestioningly that this relates to female slaves,    and that the particle aw (\"or\") denotes a permissible alternative. This   interpretation is, in my opinion, inadmissible inasmuch as it is based on the assumption   that sexual intercourse with ones female slave is permitted without marriage: an   assumption, which is contradicted by the Quran itself (see 4: 3, 24, 25 and 24: 32,    with the corresponding notes). Nor is this the only objection to the above-mentioned   interpretation. **Since the Quran applies the term ‘‘believers\" to men and   women alike, and since the term azwaj (\"spouses\"), too, denotes both the male   and the female partners in marriage, there is no reason for attributing to the phrase ma   malakat aymanuhum the meaning of \"their female slaves\"**; and since, on   the other hand, it is out of the question that female and male slaves could have been   referred to here it is obvious that this phrase does not relate to slaves at all, but has   the same meaning as in 4: 24 - namely, \"those whom they rightfully possess through   wedlock (see note on 4: 24) - with the significant difference that in the present context   this expression relates to both husbands and wives, who \"rightfully possess\" one   another by virtue of marriage. On the basis of this interpretation, the particle aw which   precedes this clause does not denote an alternative (\"or\") but is, rather, in   the nature of an explanatory amplification, more or less analogous to the phrase \"in   other words\" or \"that is\", thus giving to the whole sentence the meaning,   \"save with their spouses - that is, those whom they rightfully possess \\[through   wedlock\\]\", etc. (Cf. a similar construction 25: 62 - \"for him who has the   will to take thought -that is \\[lit., \"or\"\\], has the will to be grateful\".)   (Asad, fn. 3; [online source](http://www.geocities.com/masad02/021);   bold emphasis ours)  \n   \n&gt;  \n&gt;Asad’s candid admission destroys any attempt of using Sura 23:5-6 to refute the permissibility of bestiality, since he admits that neither the term *azwaj* (spouse) nor *ma malakat aymanuhum* (right hands possess) are necessarily limited to wives or  female slaves. His admission implies that these terms are inclusive, that they encompass  anyone or anything which necessarily falls under these specific groups, i.e. all lawful  spouses and everything that a person owns or possesses. Since animals also fall under  the category of \"what\" or \"whom their right hands possess\" one can therefore make a case that these specific passages are actually condoning sexual relations with one’s animals, as well as with one’s male and female slaves (i.e., men with men and women with women relations)! After all, the Quran nowhere explicitly condemns homosexuality or lesbianism.\n\nWhat is the refutation to the claim that these verses in-directly approve of bestiality? Also, I'm pretty sure the website I'm linking to is a anti-Islam website, which isn't very trustworthy/reliable, but I still wanted to ask what the counter-claim to the above claims are. And the webpage this is from is...\n\n[https://www.answering-islam.org/Shamoun/bestiality.htm](https://www.answering-islam.org/Shamoun/bestiality.htm)\n\nAlso, I've seen stuff saying bestiality is absolutely prohibited in Islam. So, there's that. I also don't personally think it allows it, but, again, wanted to ask. The part about \"private parts\" in the verse referenced in the text is a little odd, but I imagine it doesn't relate to allowing sex with animals.\n\nThank you, in-advance, and I look forward to your responses!",
        "created_utc": 1673975244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Islam from an academic perspective?",
        "author": "addibruh",
        "url": "https://www.reddit.com/r/religion/comments/10egvmt/islam_from_an_academic_perspective/",
        "text": "Hello, I am interested in learning more about Islam but most information I have found seems to be biased one way or another. What I’m really interested in is more of the academic approach where historical context is not lost and the meaning of the teachings are not explained to serve an agenda. I have not really found anything like this yet and have doubts about the translations of the Quran I am finding and the commentaries that go along with it. I think the word exegetical describes what I am looking for which means like the academic process of uncovering the authors original meaning",
        "created_utc": 1673974010,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Jewish explanation for wild animal suffering, etc.?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10egltj/what_is_the_jewish_explanation_for_wild_animal/",
        "text": "Hi. What is the Jewish explanation for wild animal suffering, natural disasters, disease—basically every possible 'evil' that cannot be attributed to human misuse of 'free will'? Why does evolution seem to produce such suffering beings? Why must lion eat lamb, when in Eden it does not seem to have been so? If you read Genesis, it says that the vegetation was for all to eat. This implies that after the Fall, biology somehow changed and lion started eating lamb, man started eating lamb, and so forth.\n\nA Christian explanation for this, at least from two Christians I have spoke with, is that God created the angels. One of the angels, Satan (yes, I know in Judaism he apparently has a different role) got arrogant and desired God's throne, so to speak. So he lead a rebellion in heaven (Book of Revelation I believe) to turn the angels against God—to abuse their free will and run the world how they want. Throughout the New Testament the Devil is called the 'Prince of this World', and things like that. The idea being that evil in the world comes from the Devil. Now the Gospel of John I think says that Christ incarnated to 'undo the Devil's work.\n\nNow why doesn't God intervene right away? Apparently because he doesn't want his angels to think him a tyrant ('free will' idea); he wants his angels, and us, to know that any way but his way is not good. So he lets the Devil do his worst—till one day, God has made his point, and then Christ returns again and all will know that God was right. Those who reject him still will perish.\n\nThen, as in the time of Eden (and as described by Isaiah and Revelation), the lion will lie with the lamb, and there will be no cruelty on God's Holy Mountain. All will be aright again, if not better.\n\nThat sounds to me like a fairly coherent explanation (also a happy ending and compelling story-arc) for evil in the world.\n \n(The panentheist in me maybe takes issue with the 'how can evil will exist?' part, but we can maybe sidestep that for another day; some would argue 'evil' results more from a lack of certain things, maybe such as empathy; but I think sadists actually possess not just a lack of empathy, but an active joy out of harming—but who knows, I don't know how psychology perfectly works. Maybe we all have a joy at causing harm rooted in some hunter-gatherer in us, a beast within, restrained by our higher empathy, domesticated lifestyles and more evolved brains. This is a bit of a tangent.)\n\nWhat is the Jewish alternative to this Christian narrative I have detailed? Why would God create what seems like the ecologically vegan Eden, only for the world to then become carnivorous, parasitic, violent, and then somehow peaceful and ecologically vegan again ('Holy Mountain' part)?\n\nHopefully I have not misunderstood anything.",
        "created_utc": 1673973337,
        "upvote_ratio": 0.99
    },
    {
        "title": "Christian Denominations Family Tree - Part 1",
        "author": "Vulture12",
        "url": "https://youtu.be/uzuYZi749CM",
        "text": "",
        "created_utc": 1673971626,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many religious \"believers\" would be able to pass a lie detector test if you asked them questions about their religion?",
        "author": "Zavisxxrh",
        "url": "https://www.reddit.com/r/religion/comments/10efgs7/how_many_religious_believers_would_be_able_to/",
        "text": "Do most of them believe in their own bullshit? Or is it more about them wishing and hoping it's true?",
        "created_utc": 1673970517,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the difference between orthodox, Christian, Catholic?",
        "author": "moonyme94",
        "url": "https://www.reddit.com/r/religion/comments/10efdwp/what_the_difference_between_orthodox_christian/",
        "text": "What the difference between orthodox, Christian, Catholic?",
        "created_utc": 1673970318,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the best quotes I’ve heard.",
        "author": "lizard1466",
        "url": "https://i.redd.it/fuqksdcaznca1.jpg",
        "text": "",
        "created_utc": 1673969674,
        "upvote_ratio": 1.0
    },
    {
        "title": "For people who believe in Biblical Prophecy, specifically in the idea that current and near future events are accurately prophesied in the bible...",
        "author": "Vic_Hedges",
        "url": "https://www.reddit.com/r/religion/comments/10eejye/for_people_who_believe_in_biblical_prophecy/",
        "text": "Are there any prophecies that remain to be fulfilled?\n\nIf so, is there some date in the future at which point you would have to accept that those prophecies have failed, should the events not come to pass?",
        "created_utc": 1673968184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Noahide-ism / Righteous Gentiles",
        "author": "BeginningExtent6455",
        "url": "https://www.reddit.com/r/religion/comments/10ecqzn/question_about_noahideism_righteous_gentiles/",
        "text": "I came across the Wikipedia page on this a while ago while researching something else and was intrigued.   I had a bunch of questions like, is this at all compatible with other (Abrahamic) religions?  Are there doctrinal positions on this is in the different sects of Judaism?  etc.  I tried to ask about it on the r/noahide subreddit, they don't let people just post but I messaged the mods and the answers they gave were pretty... intense.  I got the general idea that whoever's blog they linked to is of the opinion that other religions cannot be practiced at the same time and following the Laws of Noah is mandatory for everyone, with a few dissenting opinions hinted at but only grudgingly.  To the point where I was kind of like \"at least getting proselytize to by Witnesses is usually a polite conversation\".  \n\nBut like, I think that as a Christian I'm perfectly capable without contradiction (and am encouraged to) follow the laws of Noah because I don't see my religion as idolatrous obviously \n\nSo anyway,  any thoughts on the subject would be appreciated",
        "created_utc": 1673963456,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the ‘problem of good’mean?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10ebcgn/what_does_the_problem_of_goodmean/",
        "text": "I see some people refer to this. But what does it actually mean?",
        "created_utc": 1673959347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which heaven would you most like to go to, and why?",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/10eaw5y/which_heaven_would_you_most_like_to_go_to_and_why/",
        "text": "[removed]",
        "created_utc": 1673957923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we stop with this!?",
        "author": "heoeoeinzb78",
        "url": "https://www.reddit.com/r/religion/comments/10ealxy/can_we_stop_with_this/",
        "text": "Bismillah hir-rahman-nir-raheem, Alsalāmu alaikum wa rahmatullāhi wa barakātu.\n\nI just wanted to say can we stop with posting pictures and making cartoons of Prophet Muhammad ﷺ. It's so disrespectful and disgusting to see things like that. So many people so called are so \"civilized and modern\" yet don't have enough common sense to respect another religion. If someone does the same for any Prophet, even Prophet Jesus I would still be mad. It's disrespectful, and rude. I would never do something like that and make pictures or cartoon's insulting any religion. If you don't agree with Islam than don't agree, but making such things and promoting it just shows how low people can fall. \n\nFor you is your religion, and for me is my religion. - Qur'ān, 109:6",
        "created_utc": 1673956975,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a weird religion",
        "author": "BornYoghurt8710",
        "url": "https://www.reddit.com/r/religion/comments/10e5m8r/i_have_a_weird_religion/",
        "text": ". I believe life is a simulation and we our consciousness will wake after death. Reality isnt real and magical phenomena were just glitches in programming.",
        "created_utc": 1673938804,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your religious (or personal) take on music and art ?",
        "author": "Only_Feedback_6049",
        "url": "https://www.reddit.com/r/religion/comments/10e51tj/whats_your_religious_or_personal_take_on_music/",
        "text": " \n\nI've been thinking more about my buddism lately and was wondering how other religions relate to his domain and their take on music and art.\n\nEdit: Also, please let us know what you think of religions that may share an opposite view from your religion.\n\nPlease be respectful!",
        "created_utc": 1673936785,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some religions that does not condemn sodomy",
        "author": "imfinnacry",
        "url": "https://www.reddit.com/r/religion/comments/10e3b7r/what_are_some_religions_that_does_not_condemn/",
        "text": "A lot of talk surrounding religion often clashes with modern rights of sexual orientation expression, but what the additionally means is that the act of sodomy is condemned even for heterosexual partners as well. \n\nWhat are some religions that does not prohibit the act of sodomy?",
        "created_utc": 1673931271,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friends Yin and Yang☯",
        "author": "Agreeable_Air4238",
        "url": "/r/FlexIT/comments/10dwxye/my_friends_yin_and_yang/",
        "text": "",
        "created_utc": 1673931174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a religion with no code of conduct for it's followers?",
        "author": "Additional-Voice-999",
        "url": "https://www.reddit.com/r/religion/comments/10e3327/is_there_a_religion_with_no_code_of_conduct_for/",
        "text": "Maybe this is a stupid question and completely undermines the point of religion all together. For further information I'm a deist who has a serious problem with all the rules religions posit, but I would also be interested in exploring a religion that didn't make me want to enter into an eternal coma.",
        "created_utc": 1673930579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update from previous post about accidentally eating pork as Muslim",
        "author": "Affectionate_Hat9351",
        "url": "https://www.reddit.com/r/religion/comments/10e0vpg/update_from_previous_post_about_accidentally/",
        "text": "Also update on the same day, my other coworker offered me a drink and I asked was it lemonade and she said yes right before I took a sip another coworker said it was something else and I asked her again what was it and she then said alcohol. So for the people saying I’m being dramatic just take note this all happened on the same night. So that’s why I just left. \n\nI plan to question them when I go back to work because tbh it’s kind of messed up and the fact that some felt like I was being dramatic really ticked me off. I don’t care if they are religious or not etc I just know I am.",
        "created_utc": 1673924236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leading Psychiatrists Unwittingly Acknowledge Psychiatry Is a Religion, Not a Science",
        "author": "codex-veritas",
        "url": "https://www.reddit.com/r/religion/comments/10e0tg3/leading_psychiatrists_unwittingly_acknowledge/",
        "text": "[removed]",
        "created_utc": 1673924055,
        "upvote_ratio": 1.0
    },
    {
        "title": "what / who is God to you ?",
        "author": "BlarfBarkhouse",
        "url": "https://www.reddit.com/r/religion/comments/10e0h0j/what_who_is_god_to_you/",
        "text": "[removed]",
        "created_utc": 1673923068,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Unorthodox Russian Vision of Heaven and Hell",
        "author": "CEPAORG",
        "url": "https://cepa.org/article/an-unorthodox-russian-vision-of-heaven-and-hell/",
        "text": "",
        "created_utc": 1673921529,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on this closing argument by William Lane Craig in a debate between him and Christopher Hitchens on the question \"Does God Exist?\"?",
        "author": "Mad_Season_1994",
        "url": "https://v.redd.it/af54upzvdica1",
        "text": "",
        "created_utc": 1673920141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hellenistic Pagan, AMA",
        "author": "FutureAd108",
        "url": "https://www.reddit.com/r/religion/comments/10dx1c3/hellenistic_pagan_ama/",
        "text": "[removed]",
        "created_utc": 1673913960,
        "upvote_ratio": 1.0
    },
    {
        "title": "لماذا تزوج النبي محمد (ص) من عدد كبير من الزوجات؟",
        "author": "Ahmed-Alhasan313",
        "url": "https://www.ma3loma.website/2023/01/blog-post_16.html",
        "text": "",
        "created_utc": 1673907465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know which religion/belief is correct, if there is a correct one?",
        "author": "IsaacBoaz123456",
        "url": "https://www.reddit.com/r/religion/comments/10dt2hb/how_do_we_know_which_religionbelief_is_correct_if/",
        "text": "[removed]",
        "created_utc": 1673905068,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm struggling with my faith",
        "author": "IsaacBoaz123456",
        "url": "https://www.reddit.com/r/religion/comments/10drrdm/im_struggling_with_my_faith/",
        "text": "[removed]",
        "created_utc": 1673902886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interfaith server welcoming all",
        "author": "DiscreetHearth",
        "url": "https://discord.com/invite/theology",
        "text": "",
        "created_utc": 1673900567,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am very confused",
        "author": "Thedogmaster2156",
        "url": "https://www.reddit.com/r/religion/comments/10dpveh/i_am_very_confused/",
        "text": "So this is about the Abrahamic faiths. I was born and raised a Jew. But Muslims and Christians have showed me things that I find interesting. They have used topics like fear but also good things and good evidence. But they both believe I will burn eternally for not accepting their prophet. I find their religions interesting but I am unable to convert. And I just don't know what to do. I want to find the correct faith. Can anyone help?",
        "created_utc": 1673899480,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on this discussion about circumcision and its ethical issues?",
        "author": "Mad_Season_1994",
        "url": "https://v.redd.it/xu6lf57wlgca1",
        "text": "",
        "created_utc": 1673898485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicist Max Planck on the Role of Faith in Science",
        "author": "owlthatissuperb",
        "url": "https://superbowl.substack.com/p/church-of-reality-max-planck-on-idealism",
        "text": "",
        "created_utc": 1673898147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for all religious people especially abrahamic faiths",
        "author": "kayimon",
        "url": "https://www.reddit.com/r/religion/comments/10dpac0/question_for_all_religious_people_especially/",
        "text": "[removed]",
        "created_utc": 1673898134,
        "upvote_ratio": 1.0
    },
    {
        "title": "sikhism questions",
        "author": "kayimon",
        "url": "https://www.reddit.com/r/religion/comments/10doznp/sikhism_questions/",
        "text": "[removed]",
        "created_utc": 1673897442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jesus in Islam and perhaps Judaism.",
        "author": "NorsePlayJaestro",
        "url": "https://www.reddit.com/r/religion/comments/10dnjcq/jesus_in_islam_and_perhaps_judaism/",
        "text": "Correct me if I'm wrong; Muslims believe Jesus existed right? But only as a prophet and not as a savior as the christians believe.   \n\n\nAnd what about the jews? What is their concensus about Jesus? Did he exist to them. If yes; was he just a rambling fool, a blasphemer or just misguided?  \n\n\nI hope I'm not stepping on any toes or disrespect anyone. I am just curious and eager to learn.",
        "created_utc": 1673894213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do We Have Guardian Angels?",
        "author": "sportifynews",
        "url": "https://www.youtube.com/watch?v=mlOIXIZFqEc",
        "text": "",
        "created_utc": 1673894113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monotheists, what do find beautiful in a pagan/polytheist religion? Polytheists/pagans, vice versa?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/10dn7vp/monotheists_what_do_find_beautiful_in_a/",
        "text": "And atheists, pick whatever.\n\nFor me, I would say that many monotheists are part of a religion that have great social solitarity and community. And that's something I wish I had more of in my religion.\n\nWhat about y'all?",
        "created_utc": 1673893570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would god be all knowing if it existed?",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/religion/comments/10dn2xn/would_god_be_all_knowing_if_it_existed/",
        "text": "If god exists, would they know the future, past and present?",
        "created_utc": 1673893300,
        "upvote_ratio": 1.0
    },
    {
        "title": "i (-18 male) told my parents that i am religious (christian) and that i started just a 3 day only liquid fast and now they are treating me by saying what youtube bs this is. i will take ur electronic devices and internet away if you dont stop this bs. i wasn't really religious before but now i am",
        "author": "Sunder123333jb",
        "url": "https://www.reddit.com/r/religion/comments/10dmi6o/i_18_male_told_my_parents_that_i_am_religious/",
        "text": "[removed]",
        "created_utc": 1673892294,
        "upvote_ratio": 1.0
    },
    {
        "title": "surah insan",
        "author": "mmiajl",
        "url": "https://v.redd.it/7fcn6erk0gca1",
        "text": "",
        "created_utc": 1673891314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fill Out Surveys For Easy FAST Cash",
        "author": "Funny_Smack_85",
        "url": "https://make.cheap/passiveincome/",
        "text": "",
        "created_utc": 1673890662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost in life",
        "author": "DarthSmitheous",
        "url": "https://www.reddit.com/r/religion/comments/10dilvd/lost_in_life/",
        "text": "Hi all,\nI just wanted to see if anyone out there has experienced similaritys in life. I'm a 25 yr old female and feeling relatively lost in life. I never grew up with a religion minus being in a CoE school. Right now in life I feel lost and debating if religion may be something that helps me direct myself more in life and feel less alone etc. \nHas anyone else experienced this loss in life where they don't know where to go next? Have you found religion to help you and if so how? I'm just interested in hearing what life might have more to offer for me. \nSorry if this seems very bland and not all that clear!",
        "created_utc": 1673885814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion",
        "author": "marklabar123",
        "url": "https://www.reddit.com/r/religion/comments/10dgm3d/religion/",
        "text": "[removed]",
        "created_utc": 1673881108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life is a Journey From Allah To Allah",
        "author": "karimdul",
        "url": "https://youtube.com/watch?v=_UOFBFHUZjQ&amp;feature=share",
        "text": "",
        "created_utc": 1673879281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian missionaries target the birthplace of Buddha in Nepal",
        "author": "lydiardbell",
        "url": "https://www.bbc.com/news/world-asia-64235873",
        "text": "",
        "created_utc": 1673877602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian stumped by a thought experiment",
        "author": "dexralf",
        "url": "https://www.reddit.com/r/religion/comments/10df6zf/christian_stumped_by_a_thought_experiment/",
        "text": "[removed]",
        "created_utc": 1673877457,
        "upvote_ratio": 1.0
    },
    {
        "title": "To Unlearn",
        "author": "Calm-Field9753",
        "url": "https://medium.com/@joecamerota/to-unlearn-a46e1d17730b",
        "text": "",
        "created_utc": 1673872616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion google form",
        "author": "tjfckingll",
        "url": "https://www.reddit.com/r/religion/comments/10dcdn2/religion_google_form/",
        "text": "[removed]",
        "created_utc": 1673869032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consultation for a speech titled \"What Comes After Death?\"",
        "author": "dmv6810",
        "url": "https://www.reddit.com/r/religion/comments/10dc55q/consultation_for_a_speech_titled_what_comes_after/",
        "text": "[removed]",
        "created_utc": 1673868216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proof that consciousness must be inherent in the universe",
        "author": "According_Boss8421",
        "url": "https://www.reddit.com/r/religion/comments/10dc4x2/proof_that_consciousness_must_be_inherent_in_the/",
        "text": "[removed]",
        "created_utc": 1673868192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never question your faith",
        "author": "Magpyecrystall",
        "url": "https://www.reddit.com/r/religion/comments/10db9lh/never_question_your_faith/",
        "text": "Never ask critical questions. Don’t look for inconsistencies. Never use facts or plausibility to guide your path to truth. If you do, you’ll soon find yourself in great peril. Keep doubt out of your life or you’ll be left with nothing but basic facts and logic, and you don’t want that. \n\nYou want to stick to the comforting beliefs of your forefathers, your community, your tribe. There should be no room for change, no place for intellectual analysis in true faith. On the contrary, you should vigorously fight those who dare ask questions. If humiliation and shaming does not work, try mentioning damnation and internal torment. If they still won’t concede then disassociate. There should be no room for thinkers in a truthful and righteous congregation. \n\nStay strong and look up alternative media. Find your sources of confirmation. Make sure your daily consumption of news and shared media is from like-minded folk. Never spend time reading your opponents views. Reasoning has no place in a strictly faith-based environment. \n\nYou can do it.",
        "created_utc": 1673865104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a catholic man (me) date a Jehovah’s Witness woman?",
        "author": "SurelyRavioli",
        "url": "https://www.reddit.com/r/religion/comments/10dabaa/can_a_catholic_man_me_date_a_jehovahs_witness/",
        "text": "[removed]",
        "created_utc": 1673861538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crowd loses it as cult leader Bajinder Singh uses oil to remove demons",
        "author": "BeyondKaliYuga",
        "url": "https://v.redd.it/f3ugs80yw7ca1",
        "text": "",
        "created_utc": 1673860162,
        "upvote_ratio": 1.0
    },
    {
        "title": "I miss god.",
        "author": "PhiloSingh",
        "url": "https://www.reddit.com/r/religion/comments/10d8zbj/i_miss_god/",
        "text": "I wasn’t sure what sub to post this to but I just wanted to express what I’ve been feeling lately which is this kinda depressing and nihilistic life that I’ve been living for the last couple of weeks and I think a lot of it ties into me no longer believing in God. \n\nI know for some reason on Reddit there’s this huge collective hatred against religion but as I’ve lost my old believe I’m starting to realize how important they really were to me, it was nice to think that all the people that I’ve lost and I’m going to lose can see me again some day and that there’s this positive being (god) that’s guiding me through life. I now realize how much god actually helped me through my life but I just do think I’ll be able to ever believe in god again as logically most religious claims just don’t have enough evidence behind them and often have glaring contradictions which I can’t ignore when I rationalize a belief in god. \n\nSo I don’t really know what to do , I’d love to believe in god of again but I know that realistically I wouldn’t be able to accept it deep down, so I’m left feeling kinda lost. I just wanted to make this post for this reason and see if anyone wanted to post some of their insight in the comments.",
        "created_utc": 1673856554,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I messed up",
        "author": "IndividualPlace1336",
        "url": "https://www.reddit.com/r/religion/comments/10d696g/i_think_i_messed_up/",
        "text": "[removed]",
        "created_utc": 1673847273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to stop believing?",
        "author": "Eatandrink",
        "url": "https://www.reddit.com/r/religion/comments/10d5ebe/is_it_possible_to_stop_believing/",
        "text": "[removed]",
        "created_utc": 1673844575,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am No Traitor and I am Ready to Die: The Murder of an Archbishop that Shocked the Medieval World in 1170",
        "author": "CreativeHistoryMike",
        "url": "https://creativehistorystories.blogspot.com/2023/01/i-am-no-traitor-and-i-am-ready-to-die.html",
        "text": "",
        "created_utc": 1673841510,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does your religion say about men and women touching?",
        "author": "Head_Substance_1907",
        "url": "https://www.reddit.com/r/religion/comments/10d49lz/what_does_your_religion_say_about_men_and_women/",
        "text": "TLDR: what contact does your religion believe is appropriate between men and women and why?\n\nI have heard a mix of guidelines, such as a woman would only touch men she can’t marry (brothers, father, her male children, etc.) or that this set of men changes after marriage. I know that Orthodox Jews follow a practice like this and Muslims have similar guidelines for who can see a woman without hijab, but I’m curious about the reasoning. I follow some folk practices that I adapt and create for myself, adopting things from other religions if they fit my tenets. I’m considering setting the boundary that I will not touch men that I’m not related to (excluding in-laws) but I’d like to hear some different perspectives first. \n\nI was raised Christian, so I’m very familiar with their practices. Feel free to comment anyway, but it’s not likely to be new information.",
        "created_utc": 1673841086,
        "upvote_ratio": 1.0
    },
    {
        "title": "He Gets Us campaign donors",
        "author": "Peregrine7710",
        "url": "https://www.reddit.com/r/religion/comments/10d3qo0/he_gets_us_campaign_donors/",
        "text": "[removed]",
        "created_utc": 1673839534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being dramatic? (accidentally ate pork as muslim)",
        "author": "Affectionate_Hat9351",
        "url": "https://www.reddit.com/r/religion/comments/10d3ldr/am_i_being_dramatic_accidentally_ate_pork_as/",
        "text": "I was out with coworkers and they ordered pizza and as I bit into a slice I noticed how weird the sauce was underneath and then realised there was pepperoni underneath I freaked out and I asked my manager why didn’t he tell me and he was like “I thought you heard me when I said half the pizza is pepperoni “ which I didn’t even know they ordered pizza until it came. I left the table and balled my eyes out in the bathroom. A coworker came in and checked on me and agreed they were wrong and should’ve made me aware the pizza was not all cheese. It’s not their fault really tbh I’m an adult, but damn it would’ve been nice if they told me. But will Allah forgive me ??",
        "created_utc": 1673839104,
        "upvote_ratio": 1.0
    },
    {
        "title": "?! Is it even razonable to criticize religion by its past ?!",
        "author": "Copperbug",
        "url": "https://www.reddit.com/r/religion/comments/10d34cf/is_it_even_razonable_to_criticize_religion_by_its/",
        "text": "[removed]",
        "created_utc": 1673837735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Response to Pastor Steven Anderson about Sikhism",
        "author": "Ask_A_Sikh",
        "url": "https://v.redd.it/nn1grga82bca1",
        "text": "",
        "created_utc": 1673831464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Existence of god?",
        "author": "chadg05",
        "url": "https://www.reddit.com/r/religion/comments/10d0fe5/existence_of_god/",
        "text": "[removed]",
        "created_utc": 1673830245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isaiah.",
        "author": "NachoCoronaOne",
        "url": "https://i.redd.it/f9izmrbmecca1.jpg",
        "text": "",
        "created_utc": 1673829548,
        "upvote_ratio": 1.0
    }
]