[
    {
        "title": "Differences of religion in a relationship",
        "author": "Actual-Suggestion-73",
        "url": "https://www.reddit.com/r/religion/comments/zxmwps/differences_of_religion_in_a_relationship/",
        "text": "[removed]",
        "created_utc": 1672266017,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is the River Euphrates drying up?",
        "author": "Parallel47",
        "url": "https://youtube.com/watch?v=YD2oAxqxgsY&amp;si=EnSIkaIECMiOmarE",
        "text": "",
        "created_utc": 1672263804,
        "upvote_ratio": 1.0
    },
    {
        "title": "We're Learning about Egyptian Polytheism on Discord",
        "author": "OldKem",
        "url": "https://www.reddit.com/r/religion/comments/zxlx06/were_learning_about_egyptian_polytheism_on_discord/",
        "text": "This is a casual server that especially focuses on the last form and iteration of Egyptian polytheism, during late antiquity (4th-6th century AD). This includes Greco-Egyptian and larger Mediterranean religious elements, as well as polytheistic mysticism from this era.  We welcome anyone at any level of knowledge, to share, discuss, and learn together. There is a short verification process, so please answer a few questions upon entering.\n\nJoin here: [https://discord.gg/mYgsgtFW5z](https://discord.gg/mYgsgtFW5z)\n\n➤ Ask practicing polytheists questions.\n\n➤ Discuss or learn about the theology and praxis of the Egyptians, Greco-Egyptians, and larger Mediterranean polytheists, in the ancient past and in the current day.\n\n➤ Share or ask about devotional practices and religious experiences of practicing polytheists.\n\n➤ Learn about, discuss, and apply late antique polytheistic mysticism, referencing texts including The Corpus Hermeticum, The Enneads, On the Egyptian Mysteries, and the Chaldean Oracles.\n\n➤ Discuss ancient religious philosophies like Neoplatonism, Pythagoreanism, and Stoicism, and their use in polytheistic faith.",
        "created_utc": 1672263712,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is keeping me from accepting Islam",
        "author": "PassportNerd",
        "url": "https://www.reddit.com/r/religion/comments/zxlezh/what_is_keeping_me_from_accepting_islam/",
        "text": "I'm a 21M who see's the value in religion though I rejected the Roman Catholic faith I was brought up with. Islam appeals to me, but there are some parts of it that are making me hesitant to adopt the faith. \n\n1) I disapprove of what Islam says about gay people, though I am not gay myself. I have known people who's biggest struggle in life was being rejected by their family for their sexuality that did not involve violating anyone's' rights, so why would it be a problem? \n\n2) I think restricting all sexual activity outside of marriage is outdated since we have contraception and medicine to make pregnancy not a life-threatening thing to women. \n\n3) I do not like how alcohol is so forbidden in Islam. I understand how alcohol can be a destructive substance, but I enjoy the occasional beer with a meal. Giving up pork and stuff like that is something I can live with. \n\n4) My family went ballistic when I brought home a Quran I borrowed from the library, so imagine subscribing to the faith.",
        "created_utc": 1672262549,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is the key to building paradise on Earth?",
        "author": "Young_Sorcerer",
        "url": "https://www.reddit.com/r/religion/comments/zxkhet/what_do_you_think_is_the_key_to_building_paradise/",
        "text": "Greetings to all good denizens of Reddit Religion. Today I pose a question to you - how may we build perfection on Earth? In the age of nanotechnology, genetic engineering, and advanced artificial intelligence it is becoming a more and more relevant question. We are careening toward a technologically super-advanced society, possibly resulting a in a post-human super-species.\n\nJews say it's following Noah's laws.\n\nChristians say we must have faith in Jesus to save us.\n\nCommunists say we need a globally equal society.\n\nRaelians say it's sexual liberation.\n\nMaybe in reality it is a combination of all four, in conjunction with advanced technology? We need to look up to Jesus as a symbol of wisdom and healing. We must discard the detritus, such as hell and damnation.\n\nI would like to know what other religions such as Islam and Hinduism say about building Paradise. Is it all in God's hands, or are we really One Consciousness that must work together to create the utopia we dream of?",
        "created_utc": 1672260375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science and Religion Compatibility Test. A Real Interesting Thing, I'd Say.",
        "author": "SomeCrusader1224",
        "url": "https://i.redd.it/deqfv0vi6p8a1.png",
        "text": "",
        "created_utc": 1672259223,
        "upvote_ratio": 1.0
    },
    {
        "title": "If God is real, why does anybody worship him, let alone love him?",
        "author": "WimBlaza",
        "url": "https://www.reddit.com/r/religion/comments/zxjyz0/if_god_is_real_why_does_anybody_worship_him_let/",
        "text": "I’ve often wondered this about any religion, not one in particular. If everything in the world is God’s plan and by his design/choosing, then he is responsible for some of the most despicable acts of all time. Stephen Fry made a good point about this I believe but I’ve yet to see anyone address the question. Fry’s example was a child born with eye cancer. The child would have an incredibly short and painful life without ever feeling anything else, and every last detail of this innocent child’s death was handcrafted by God himself, supposedly. So if this is the case, why do any religions worship a god who does such evil things every second but wants humans to live by strict moral codes?",
        "created_utc": 1672259179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demacrat’s Hate God… LOL!",
        "author": "bkub111",
        "url": "https://i.redd.it/5i2l0vj1nq8a1.jpg",
        "text": "",
        "created_utc": 1672258498,
        "upvote_ratio": 1.0
    },
    {
        "title": "What could be lurking in the 4 dimensional space?",
        "author": "SlowMoeFoe",
        "url": "https://v.redd.it/q1f4sp45ao8a1",
        "text": "",
        "created_utc": 1672257264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some people claim Islam came from Christianity, if Islam seems so much closer to Judaism? How do Muslims explain the origin of their own religion?",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/zxioks/why_do_some_people_claim_islam_came_from/",
        "text": "It is clear that Islam is far closer to Judaism than to Christianity. They do believe Jesus as a prophet, but they do not consider him God or even the Son of God. Muslims also have a diet similar to that of Jewish people, and very semitic roots, and the strong aversion for idols and icons.\n\nI suspect Muslims came from Ebionite Christian Jews. Those Christians were fully Jewish on Law and tradition, yet also accepted Jesus, although it is debatable how they saw Jesus.\n\nOr maybe Islam came from lost Ishmaelite sect? I doubt Judaism was the only religion of its kind that survived up to one point and then all other semitic religions cames from it. Maybe some forms of Ishmael's Monotheism survived in some Arab tribes?\n\nI'm speculating because I literally find only contradictory information about Islam, and it seems its origin are kind of obscure. We all know how Muhammad founded it, but obviously Islam did not rise in a void. It should be based in some sect or faith somehow, and it shares a lot of tradition with Judaism to be seen as an isolate.",
        "created_utc": 1672256130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m Swedenborgian AMA",
        "author": "TimberwithSandalwood",
        "url": "https://www.reddit.com/r/religion/comments/zxgqtb/im_swedenborgian_ama/",
        "text": "These seem like fun so I figured I’d give it a shot.\n\nI’m Swedenborgian. I subscribe to the explanations about Christianity provided by an 18th century scientist and theologian Emanuel Swedenborg. We believe his writings to be divinely inspired.\n\nWhile it’s based in Christianity, it has many many differences, even in core doctrine. I have often been told I’m not Christin because of these differences, but Christianity is the closest fit.\n\nIf anyone is interested in asking a question, I’ll do my best to reply in a timely manner.",
        "created_utc": 1672251618,
        "upvote_ratio": 1.0
    },
    {
        "title": "why does God care",
        "author": "SagewithBlueEyes",
        "url": "https://www.reddit.com/r/religion/comments/zxgq9j/why_does_god_care/",
        "text": "In the Abrahamic traditions, God cares very deeply about humanity and about what humanity does, to the point of micromanagement. God dislikes what Sodom and Gamorrah do, destroys them. Turns people to salt for disobeying him, floods the world and kills theoretically millions, kills potentially thousands if not millions of innocent children in Egypt. Those are just the major events, inIslam God forbids music, walking and drinking simultaneously, pictures amongst other minor petty things. But why? Why would the suzerain of all existence care about the actions of insignificant like us. If a ant builds a colony 4 countries over from yours you don't care, why would an omnipotent being who rules and creates a near infinite universe honestly care about the actions of being equivalent to dust to him? This is mostly aimed at Abrahamic faiths but anyone is free to answer.",
        "created_utc": 1672251586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Islam and Christianity, kinda cool....",
        "author": "heoeoeinzb78",
        "url": "https://www.reddit.com/r/religion/comments/zxghqt/islam_and_christianity_kinda_cool/",
        "text": "Alsalāmu alaikum wa rahmatullāhi wa barakātu. Hope everyone is doing well!\n\nSo I was reading the Bible, just cause I have interest in different religions, so I started reading Genesis 19, the chapter which talks about the story of Prophet Lut (peace and blessings be upon him), and I was really shocked. The reason I was shocked is because the story was super similar to the story in the Qur'ān, plus minus a few things. I've read the tafseer of the Qur'ān, which explains the meaning of the Qur'ān and why the verse was revealed and all, so I remembered the spefic details. How two angles went to his house,  then how people surround his house, the way prophet lut, peace be upon him, tells the people to marry my daughters, the way they escaped the mess,  and in verse 26, where the wife of prophet lut looked back! That's in the Qur'ān, and I find that so crazy. The Qur'ān explains this story in much more detail tho I've noticed. \n\nBut then the Bible goes a whole other way by saying:\n\n33 That night they got their father to drink wine, and the older daughter went in and slept with him. He was not aware of it when she lay down or when she got up.\n\n34 The next day the older daughter said to the younger, “Last night I slept with my father. Let’s get him to drink wine again tonight, and you go in and sleep with him so we can preserve our family line through our father.” 35 So they got their father to drink wine that night also, and the younger daughter went in and slept with him. Again he was not aware of it when she lay down or when she got up.\n\nWell I don't agree with this at all, I don't think a prophet of God would be doing a major sin like that, I feel this is just wrong...but really cool how Christians and Muslims, our books are so simmliar!\n\nAllah Knows Best.",
        "created_utc": 1672251028,
        "upvote_ratio": 1.0
    },
    {
        "title": "My conscience is getting sensitive",
        "author": "thebrightsun123",
        "url": "https://www.reddit.com/r/religion/comments/zxge9d/my_conscience_is_getting_sensitive/",
        "text": "Over the last two years, my conscience seems to be getting more sensitive, ever since the pandemic. Before, I could see another girl behind my gf's back and not have any shame, thinking, well she is probably doing the same thing, but lately with my new gf that I have been with for only 2 months, this is 100% not the case, I can't bear to think of doing such things, I feel comfort in knowing I will be faithful to her, I picture myself being with someone else while my gf is at work, and just the thought makes me sick. What happened to me? Has anyone else all of a sudden become aware of their conscience. And not thinking about yourself, but how others might feel. The lockdown we had for about a year seems to have changed me, maybe it was a form of a retreat that made me examine my soul, it's like God is almost whispering to me on a daily basis now",
        "created_utc": 1672250804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does chanting and observing religious song and dance, and even costume and art feel almost like a religious experience?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/zxfkxh/why_does_chanting_and_observing_religious_song/",
        "text": "Hi. Can anybody tell me, in a fairly rational manner, why they think that chanting or singing or listening to beautiful music, or beholding beautiful music being sung and dance being had borders on a 'religious' experience? Why is it so soothing or powerful? Not as if my chest is ripped out, but it certainly makes a conservative of me, for all my philosophical nihilism! There is something to be cherished and protected, even if all must end.\n\nFor myself, I am wont to chant Da Pacem Domine and Slavite Gospoda, among other things, especially when I need of cooling down, as it were. I chant them a few times, and oddly I am calmed. I suppose it is like the Hare Hare Krishna or Ohm that people do. Does anybody know what the reason is behind this? Is there science behind this? Or is it a mystery?\n\nI think even atheists or the religiously confused--of which either camp I am--can benefit from this. Helps with most of the music of this kind that I listen to or chant that I barely have a clue what they are saying! Means that I do not feel conflicted, and it adds to the mystery of it.\n\nI think if there is to be religion after the 'death of God', this is maybe part of it. I can barely shake the beauty of some religious song and dance--and the costumes! And the art. Even if I don't know what to worship, that we should worship in one of these ways seems to me not a bad thing; perhaps we could do with more of it, certainly instead of 'celebrity'-worship.\n\nI listen to both European Christian and (neo-)pagan music, just so nobody thinks I have a pro-Christian bias :) Some of it is truly excellent--usually the Eastern European stuff. Some if it--the American and British--is often poor and plastic. That is what I find anyway! Maybe we have lost the knack of it, so to speak. Latin, Greek, Russian, Serbian, Ukrainian, Polish, Lithuanian, Latvian--maybe these languages, and even a certain latent religiosity on these peoples' parts, lend themselves better to religious song, dance and costume than us Brits or Americans (I am a Brit). I tend to find British neo-paganism unimpressive in its religious shows and frankly cringeworthy. No hippie ever incited awe in me--well, one did, but then he turned out to be a fraud! Anyway, I'm getting a little opinionated here, but hopefully I'm entitled to it. Take it or leave it; it's not entirely relevant to my question, I just felt like sharing it. Quality over quantity is an issue I think neo-paganism is very much a victim of is what I am saying, and maybe protestantism too. What is religion if it fails to incite awe with its ritual, song, dance, costume, art? This is why a lot of Catholics object to Anglicanism I believe; they want the mass to be magical.\n\n(I'm not interested in religion-specific preaching, thank you, You won't convert me.)",
        "created_utc": 1672248903,
        "upvote_ratio": 0.99
    },
    {
        "title": "What does another religion do better than your own religion?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/zxdzjl/what_does_another_religion_do_better_than_your/",
        "text": "And if you think your religion does everything perfectly (or least better than all other religions), then why do you think so?\n\nIt could be how another religion is organized, their social goals, how they adapted to the current times, or just certain accomplishments.",
        "created_utc": 1672245124,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a bit of help",
        "author": "Drink-Consistent",
        "url": "https://www.reddit.com/r/religion/comments/zxdr0l/i_need_a_bit_of_help/",
        "text": "So ne (M,15) is born Orthodox Christian from Bulgaria living in Germany since I’ve been born and raised by mom and Grandma have been Religious to my religion. Since a few months I have felt weird when I go to church (on the rare occasions I do). I don’t get that same feeling anymore while at the same time I have gained interest and knowledge to Islam. For now k have given myself time till I’m 18 to see what fits best to me and then choose. I want to know what you would do in my position",
        "created_utc": 1672244557,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 2017, a monument of the Ten Commandments was installed at the Arkansas State Capitol. Do you see this as a violation of separation of church and state and giving preference to one religion over another? Why, why not?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/zxd757/in_2017_a_monument_of_the_ten_commandments_was/",
        "text": "In response to this, the Satanic Temple (NOT the Church of Satan) created a statue of Baphomet and wanted it to be placed alongside said Ten Commandments monument. But their request was denied.",
        "created_utc": 1672243249,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Four Horsemen of the Apocalypse - Who Are They &amp; What Do They Represent? || MUST WATCH NOW!!!",
        "author": "sportifynews",
        "url": "https://www.youtube.com/watch?v=NKPGfFhTNxE",
        "text": "",
        "created_utc": 1672238967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any witches can answer some questions?",
        "author": "Narwhal_Songs",
        "url": "/r/witchcraft/comments/zwnthz/any_muslim_witches_can_answer_some_questions/",
        "text": "",
        "created_utc": 1672234697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can god still help me or is it too late?",
        "author": "amfi695047",
        "url": "https://www.reddit.com/r/religion/comments/zx8rc8/can_god_still_help_me_or_is_it_too_late/",
        "text": "[removed]",
        "created_utc": 1672231714,
        "upvote_ratio": 1.0
    },
    {
        "title": "question for everyone with every religion:",
        "author": "AngryApple24",
        "url": "https://www.reddit.com/r/religion/comments/zx64wd/question_for_everyone_with_every_religion/",
        "text": "[removed]",
        "created_utc": 1672222586,
        "upvote_ratio": 1.0
    },
    {
        "title": "a doubt of the dawn",
        "author": "Neuraty",
        "url": "https://www.reddit.com/r/religion/comments/zx3p97/a_doubt_of_the_dawn/",
        "text": "[removed]",
        "created_utc": 1672213300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion",
        "author": "Eli-bii",
        "url": "https://www.reddit.com/r/religion/comments/zx3d6r/religion/",
        "text": "[removed]",
        "created_utc": 1672212055,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you met the person who was supposed to be the second coming or the savior of the world... what questions would you ask them?",
        "author": "idkalki",
        "url": "https://www.reddit.com/r/religion/comments/zx2ngs/if_you_met_the_person_who_was_supposed_to_be_the/",
        "text": "[removed]",
        "created_utc": 1672209505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for christian’s: Have you ever doubted the existence of god, and how did you disprove/overcome those doubts?",
        "author": "libralovesurmom",
        "url": "https://www.reddit.com/r/religion/comments/zx0au4/question_for_christians_have_you_ever_doubted_the/",
        "text": "[removed]",
        "created_utc": 1672201902,
        "upvote_ratio": 1.0
    },
    {
        "title": "ABOVE ALL ELSE, GUARD YOUR HEART, FOR EVERYTHING YOU DO FLOWS FROM IT.’ (THE BIBLE–PROVERBS 4:23)",
        "author": "Amazingheart0812",
        "url": "https://quotationcelebration.wordpress.com/2016/08/05/above-all-else-guard-your-heart-for-everything-you-do-flows-from-it-the-bible-proverbs-423/",
        "text": "[removed]",
        "created_utc": 1672195669,
        "upvote_ratio": 1.0
    },
    {
        "title": "What religion would be the best to join for a single mother hoping to find a husband?",
        "author": "temp225566",
        "url": "https://www.reddit.com/r/religion/comments/zwxx4h/what_religion_would_be_the_best_to_join_for_a/",
        "text": "?",
        "created_utc": 1672194935,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most important texts in your religious tradition? What role do they play?",
        "author": "Kangaru14",
        "url": "https://www.reddit.com/r/religion/comments/zwv8po/what_are_the_most_important_texts_in_your/",
        "text": "What texts are the most central and influential in your religious tradition? How does your religion utilize and relate to these texts? What role do they have in religious practices? How do they inform religious beliefs?\n\nWhen and how did these texts originate and develop? Why were these texts created?\n\nWere these texts originally oral or were they written down from the start? Are there important texts in your tradition that are principally oral today?\n\nDoes your religious tradition have canonical texts? Is it an open or closed canon? What makes a text canonical?\n\nWhat are the primary methods, frameworks, or principles for textual interpretation in your tradition? Who has the authority or expertise to properly interpret these texts?",
        "created_utc": 1672187522,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is this type of theism?",
        "author": "Dazzling_Dog8820",
        "url": "https://www.reddit.com/r/religion/comments/zwunhg/what_is_this_type_of_theism/",
        "text": "what is the theism for when you you see all gods in a specific pantheon as aspects of 1 god?",
        "created_utc": 1672186007,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your philosophy of life? Here is mine.",
        "author": "atheist1009",
        "url": "http://philosofer123.wordpress.com",
        "text": "",
        "created_utc": 1672183348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Video Essay: The Bible Is Not Sexist",
        "author": "Hummussed",
        "url": "https://youtu.be/urn3mNcikYE",
        "text": "",
        "created_utc": 1672183321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nativity",
        "author": "No_To_Drugs",
        "url": "https://i.redd.it/0oijuk81e06a1.jpg",
        "text": "",
        "created_utc": 1672183128,
        "upvote_ratio": 1.0
    },
    {
        "title": "non-Christian Perspectives on forgiveness?",
        "author": "tychicus12",
        "url": "https://www.reddit.com/r/religion/comments/zwrrlw/nonchristian_perspectives_on_forgiveness/",
        "text": "[removed]",
        "created_utc": 1672178970,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the mastery of Self and freedom from the slavery of matter and thought?",
        "author": "gitagoudarzibahramip",
        "url": "https://www.reddit.com/r/religion/comments/zwr9fy/what_is_the_mastery_of_self_and_freedom_from_the/",
        "text": "[removed]",
        "created_utc": 1672177772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Converting to Judaism in the new year. Father is unsupportive. Mother was unsupportive when I was younger and would talk about Judaism when I was a child, but is now too sick to even understand what’s going on. Siblings were not involved in the childhood religion fiasco and are supportive. Advice?",
        "author": "sharonmckaysbff1991",
        "url": "https://www.reddit.com/r/religion/comments/zwr8xu/converting_to_judaism_in_the_new_year_father_is/",
        "text": "I was born to Christian parents but had knowledge of Judaism that I believe came from a past life. As a young child I would sing the Hebrew alphabet and be told to stop. I would also hum “Victory” which is a well-known Hanukkah song, but I usually did so in private, such as after I went to bed. If in school I learned to sing a song that was in Hebrew (or if it was in English and made clear references to Judaism) I would instantly feel a connection to it, but would never speak of it. By the time I was in third grade, I had forgotten all but the first few letters of the Hebrew alphabet but had learned to STFU because I knew that if I kept on, my parents would continue their antisemitic crap. Keeping quiet allowed me to retain what I hadn’t forgotten, and I continued to maintain somewhat of a scholarly interest in Judaism that I did not pursue until I was no longer in my parents’ care.\n\nThis year, I decided that I am **done** with lying to myself and saying I was Christian, and will look into converting to Judaism after the new year. The rest of the information you need is in the title of this post. Does anyone have any advice?",
        "created_utc": 1672177741,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Legend of the ‘Rooster’s Mass’",
        "author": "IndependenceFun4627",
        "url": "https://medium.com/the-engage/the-legend-of-the-roosters-mass-3de249370ba5",
        "text": "",
        "created_utc": 1672175149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resultado enquete: Você tem dificuldade em perdoar?",
        "author": "Otherwise-Oil1702",
        "url": "https://blogcompartilhandoaverdade.blogspot.com/2022/12/resultado-da-nossa-enquete-voce-tem.html",
        "text": "[removed]",
        "created_utc": 1672174639,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a Daemonolatress --- AMA",
        "author": "ChikoritaLeaf",
        "url": "https://www.reddit.com/r/religion/comments/zwppet/im_a_daemonolatress_ama/",
        "text": "Greetings!\n\nI've thought about doing this sort of thing on and off. So, may as well now.\n\nA few notes:\n\n1. I am always learning and always reading --- so this is a snapshot of where I am *right now*, as well as my current understanding of my religion.\n2. I am thinking of doing this again in several months to a few years once I've grown more, if there's an interest.\n3. I work 3rd shift, and my wife works days, so I'll try to answer as many questions as I am able in the time I have. I will give an honest effort at answering everyone, though it may take a while as I can be *very* wordy.\n\nSo, some basics out of the way: I'm a 31-year-old trans woman. My religion is Daemonolatry. Daemonolatry can be described as a religion under the \"theistic Satanism\" category.\n\nSo, ask me anything!",
        "created_utc": 1672174055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is god reading our thoughts all the time?",
        "author": "Gunner-Alert",
        "url": "https://www.reddit.com/r/religion/comments/zwor5c/is_god_reading_our_thoughts_all_the_time/",
        "text": "[removed]",
        "created_utc": 1672171737,
        "upvote_ratio": 0.99
    },
    {
        "title": "Mistook holiday wishes",
        "author": "cactus16x",
        "url": "https://www.reddit.com/r/religion/comments/zwoltw/mistook_holiday_wishes/",
        "text": "Coming from a dominantly Christian country, i recently wished merry Christmas to a family friend via text. Turns out they do not celebrate Christmas, I learnt this from a family member they've called since then. I feel awful for this, I had no bad intentions towards them.. Any way to fix this?",
        "created_utc": 1672171373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a question",
        "author": "AlysBran",
        "url": "https://www.reddit.com/r/religion/comments/zwofyc/just_a_question/",
        "text": "Sorry if this is the wrong sub, but I've been having a doubt for a while and figured that since you guys know so much about old cultures, you could at least point me in some direction.\n\nWhy is the Autumn equinox so tied with legends of ladies rising in the sky?\n\nI grew up catholic, and we celebrate the rise of the virgin Mary to heaven in this time of the year.\n\nI recently heard about  the legend of Chang'e and the jade rabbit. \n\nAre these the two instances of ladies rising in the skies in this time of the year?",
        "created_utc": 1672170975,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who are atheist, agnostic or otherwise irreligious, what's the main problem/issue you have with religion as a concept/idea?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/zwm6w5/for_those_of_you_who_are_atheist_agnostic_or/",
        "text": "I'm not asking why you don't believe in this religion or that one. I'm asking what, if any, umbrage you have with the very idea of religion.",
        "created_utc": 1672165258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christians of Reddit: what did Jesus look like?",
        "author": "No_End_4050",
        "url": "https://www.reddit.com/r/religion/comments/zwl6th/christians_of_reddit_what_did_jesus_look_like/",
        "text": "I didn't want to be too long-winded with the title, so I'll inquire here in the body:\n\nMany historians' opinions differ on whether or not there was a historical Jesus; a living, breathing being that can be credited with kicking off Christianity as we know it.  \n\nThose historians who claim that a historical Jesus did exist are in general agreement that, considering his likely ethnicity and implied geographical footprint, he was likely a squat, dark-skinned, dark-haired (curly to boot) Jewish male.\n\nSo why do so many Western churches freely worship an anglicized, whitewashed version of Jesus (you know the one: fair white skin, long, straight hair, a soft beard)? \n\nRegardless of whether you believe in Jesus or not, it's hard to argue that the westernized depiction of Jesus is in any way historically accurate.\n\nSo why do so many Christians believe in this image?",
        "created_utc": 1672162752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello i am a satanist ask me questions",
        "author": "alwaysanovicee",
        "url": "https://www.reddit.com/r/religion/comments/zwal82/hello_i_am_a_satanist_ask_me_questions/",
        "text": "[removed]",
        "created_utc": 1672128880,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"there will still be toys and construction cites, hence no joy is to come from it\"",
        "author": "depresinthenameof",
        "url": "https://www.reddit.com/r/religion/comments/zwacbz/there_will_still_be_toys_and_construction_cites/",
        "text": "-From the black sky of my dream that can be no other but god.\n\nI believe its about my usage of tec i distract myself with.\n\nDont know when but i was at home",
        "created_utc": 1672127957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t I believe in god anymore? Am I being arrogant or lacking critical thinking skills? Or am I right in what I stand for?",
        "author": "Not-a-velociraptor1",
        "url": "https://www.reddit.com/r/religion/comments/zw8c3y/why_cant_i_believe_in_god_anymore_am_i_being/",
        "text": "[removed]",
        "created_utc": 1672120903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a deity who did not create evil in the world but helps its believers through evil and its causes?",
        "author": "scroggs2",
        "url": "https://www.reddit.com/r/religion/comments/zw6sl4/is_there_a_deity_who_did_not_create_evil_in_the/",
        "text": "I am not a believer jn the God of the Bible inlarge part due to evil in the world, being willing to send people to hell, etc. If there was a deity whom, perhaps did NOT have a hand in abiogenesis but cares for those afflicted by horrible things in life and encourages us to be good. Regardless and love others while giving their believers love. I think I would be more open to believing in a deity who loves and guides through harsh times without having a hand in creating such things. If there is such a thing I would be grateful and interested if anyone is willing to offer any insight into this.",
        "created_utc": 1672116023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Allah have a conscious and subconscious mind?",
        "author": "Mister-Khalifa",
        "url": "https://www.reddit.com/r/religion/comments/zw57ol/does_allah_have_a_conscious_and_subconscious_mind/",
        "text": "Are there some stuff that eternally exists in Allah's mind that is out of Allah's free will.",
        "created_utc": 1672111172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was it moral?",
        "author": "Mister-Khalifa",
        "url": "https://v.redd.it/zemgaxv9wc8a1",
        "text": "",
        "created_utc": 1672110141,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is this?",
        "author": "TheMoistyCat",
        "url": "https://i.redd.it/efnahza12e8a1.jpg",
        "text": "",
        "created_utc": 1672106138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the most beautiful place to be in the world is with you",
        "author": "gitagoudarzibahramip",
        "url": "https://www.reddit.com/r/religion/comments/zw15yi/why_the_most_beautiful_place_to_be_in_the_world/",
        "text": "[removed]",
        "created_utc": 1672099818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where’s the best place to find more information about God’s wife, Asherah?",
        "author": "mykono90",
        "url": "https://www.reddit.com/r/religion/comments/zw0tdp/wheres_the_best_place_to_find_more_information/",
        "text": "Google isn’t giving me the best results, and I would love to know of some specific links or books to learn more about the forgotten goddess.",
        "created_utc": 1672098925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do so many people call themselves Jewish when they don’t even attend synagogue or don associate with the religion at all?",
        "author": "bradleymuller87",
        "url": "https://www.reddit.com/r/religion/comments/zw0fbe/why_do_so_many_people_call_themselves_jewish_when/",
        "text": "[removed]",
        "created_utc": 1672097861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it really matter if Jesus was the messiah or not?",
        "author": "Annaneedsmoney",
        "url": "https://www.reddit.com/r/religion/comments/zvzxb8/does_it_really_matter_if_jesus_was_the_messiah_or/",
        "text": "Iv been debating a lot recently with Christians and Jewish people. Its been very difficult to the say least as many dont take kindly the questioning if their character existed. \n\nIf Jesus isnt the messiah his teaching would not be altered. Christians have based their lives off of Jesus teachings. There for If Jesus isnt the messiah does it really change anything for Christians?  \n\nTo even further add on to this point a lot of the jewish people dont think Moses existed but think that doesnt matter and that its about the meaning behind the story that does matter. Couldnt Christians see their scripture as that as well? If not then why not? Im interested in the possible answers people can give me.",
        "created_utc": 1672096544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can belief in a mythology or fate perpetuate a social order or social attitudes?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/zvz72u/can_belief_in_a_mythology_or_fate_perpetuate_a/",
        "text": "Hi. Is it possible that a belief in certain mythological characters or Gods that have ot do behave in a certain way can be or has been used to ossify a social order, especially an unjust one to the benefit of the ruling class? For example, if we say that there are Gods and they behave in a certain way, and they have a male chief god, and maybe even a hierarchy beneath him of gods or types of beings, can this belief be used to enforce a patriarchy or caste system, etc. on earth among the followers?\n\nFurther, if one believes that such an order is governed by 'fate', then is such a belief likely to discourage social 'radicalism'? For example, if everything is as the Gods made it, including the social order, and our lives and that of the Gods is ultimately governed by fate, what sense is there in social radicalism, such as we are known for in modern times?\n\nIt seems to me that a genuine  belief a kind of theism, perhaps polytheism particularly, combined with a strong belief in some notion of fate would make the lower classes of a society much more socially conservative, rather than open to change. I say lower classes because of course the Greek aristocracy loved philosophy, and it seems they were quite open-minded for their time in that there was such a variety of Greek philosophical schools. But this doesn't mean even them wanted to lose their play atop the hierarchy, and so would maybe play lip-service to  popular religion so far as it served them and allowed them to continue their philosophising.\n\nA Christian analogue to this might be the story of Adam and Eve, or the Jews who betrated Jesus. Eve was the first woman, therefore women are not to be trusted—at least you could spin that logic. Jews today are the descendants of the Jews who rejected Jesus, otherwise they would be Christians and not Jews religiously, and hence since Jesus's death Christianity has had a history of anti-Jewish sentiment. For example, the story of the 'Wandering Jew'.\n\nWhat do you think? I think this is a counterpoint to some of the supposed benefits of mythology to society.\n\nWhile mythology can motivate us to be more virtuous _like the Gods_, or kind and 'stoic' like Jesus, it can also be used to propagate harmful social structures and attitudes.",
        "created_utc": 1672094662,
        "upvote_ratio": 0.99
    },
    {
        "title": "Hijab/uniform",
        "author": "Cultural_Smell8064",
        "url": "https://www.reddit.com/r/religion/comments/zvyipe/hijabuniform/",
        "text": "[removed]",
        "created_utc": 1672092916,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for information on the 'Escuela de Consejo Moral' - a religious group in PR and the USA",
        "author": "1DapperDuck",
        "url": "https://www.reddit.com/r/religion/comments/zvy7x4/im_looking_for_information_on_the_escuela_de/",
        "text": " \n\nHey All,\n\nI'm currently seeking information on **Escuela de Consejo Moral**,  a quasi-religious group that formed in Puerto Rico in the early 20th century and has branches in the mainland US. I am not the most tech savvy person after spending  years without access to most modern technology. Can anyone point me to  directories or places with articles/public filings on them? I'm very curious to learn more. If you know anything, please reach out!\n\nThanks so much!\n\n**Selwyn**",
        "created_utc": 1672092156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christians: Bible Meditation Book",
        "author": "LargeCut6737",
        "url": "https://cutt.ly/909kW94",
        "text": "",
        "created_utc": 1672091769,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who became atheists did your life become easier?",
        "author": "Narwhal_Songs",
        "url": "https://www.reddit.com/r/religion/comments/zvxqhm/people_who_became_atheists_did_your_life_become/",
        "text": "Please dont think im judgemental here\nI had a period where I left my faith of about 1 year \nIt made me very depressed\n\nIm thinking for atheist, did you leave because of issues you found with religion? \n\nHow do you deal with your life? \nDid your life became easier when you left \nWhat are your healthy coping mechanisms",
        "created_utc": 1672090923,
        "upvote_ratio": 1.0
    },
    {
        "title": "i want to turn to god.how do i find my god?",
        "author": "ohwellhey",
        "url": "https://www.reddit.com/r/religion/comments/zvxb8n/i_want_to_turn_to_godhow_do_i_find_my_god/",
        "text": "hello everyone.i am 19,i am an atheist.I know this sounds a bit weird but even tho all my family is very religious,i have always found it very hard to believe in god(i still cant).But the more i realize that theres nothing,the more i can feel that i am losing myself.”life has no meaning,no point”mindset is killing me everyday.Life seems way too unfair this way.I really wish i could believe in god.I want to turn to god.I want to die believing that theres something after this and that theres justice.I dont want to be this helpless with my thoughts.Could this work?could going to church and talking to right people help?my parents are orthodoxs but for me,cstholicism seems more right and acceptable.how do i do this?how do i find my god?",
        "created_utc": 1672089828,
        "upvote_ratio": 1.0
    },
    {
        "title": "magical thinking help",
        "author": "Narwhal_Songs",
        "url": "https://www.reddit.com/r/religion/comments/zvwpqm/magical_thinking_help/",
        "text": "How do you remove over thinking the importance of prayers? Should I have prayer more. Would that change the outcome of a certain event? \n\n(and no, I dont want any: well just stop belief in God)",
        "created_utc": 1672088283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your religion focus on a particular goal? What is it? Why?",
        "author": "Kangaru14",
        "url": "https://www.reddit.com/r/religion/comments/zvw2gy/does_your_religion_focus_on_a_particular_goal/",
        "text": "Many religious traditions have a central aim which their practitioners try to attain. Some examples might be: salvation, liberation, enlightenment, nirvana, gnosis, moksha, and henosis.\n\nDoes your religious tradition focus on a specific spiritual objective? What is that objective? Why is it important in your religion and to you personally?\n\nWhat are the general steps involved in attaining your religion's objective? What are the benefits of attaining it? What personal sacrifices does it entail?\n\nHow crucial is it for a human to attain the goal of your religion? Is everything in your religion directed towards this goal? Can this goal be attained by those outside of your religion?",
        "created_utc": 1672086554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Texas Governor Greg Abbott dumps children on streets on cold Christmas Eve",
        "author": "GangsterismOut2",
        "url": "https://i.redd.it/0nfm4jk4ya8a1.png",
        "text": "",
        "created_utc": 1672086534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Say NO to the World Youth Day 2023",
        "author": "PedroSilvaSouto",
        "url": "https://i.redd.it/mor362rdp98a1.jpg",
        "text": "",
        "created_utc": 1672083786,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do Catholics pray to mary",
        "author": "Parallel47",
        "url": "https://youtube.com/watch?v=ygSo7IrgnPw&amp;si=EnSIkaIECMiOmarE",
        "text": "",
        "created_utc": 1672083166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is downvoting a sin?",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/zvu1al/is_downvoting_a_sin/",
        "text": "[removed]",
        "created_utc": 1672081115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me understand Nikkah?",
        "author": "GeorgiaJ1995",
        "url": "https://www.reddit.com/r/religion/comments/zvtk4c/please_help_me_understand_nikkah/",
        "text": "[removed]",
        "created_utc": 1672079854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Muslims and Christians…",
        "author": "Simple_Giraffe_5536",
        "url": "https://www.reddit.com/r/religion/comments/zvtgsf/muslims_and_christians/",
        "text": "I am confused. Christianity says Jesus Christ is the lord and savior and no others after him are true. Then Muhammad (peace be upon him) comes afterwards stating something different. I’m having trouble understanding which one is true and would like some clarity. I do not mean to offend anyone and their beliefs and I don’t mean to restart a debate this old. It’s merely for my peace of mind. God bless.",
        "created_utc": 1672079606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you send me some poetry?",
        "author": "Narwhal_Songs",
        "url": "https://www.reddit.com/r/religion/comments/zvsbdd/can_you_send_me_some_poetry/",
        "text": "About life, death, spirituality, religion, nature, humanity etc",
        "created_utc": 1672076560,
        "upvote_ratio": 1.0
    },
    {
        "title": "New community @ destinedspiritually",
        "author": "44414442444",
        "url": "https://www.reddit.com/r/religion/comments/zvro2o/new_community_destinedspiritually/",
        "text": "r/destinedspiritually",
        "created_utc": 1672074778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for advice: joining an organized religion?",
        "author": "Appletreemania",
        "url": "https://www.reddit.com/r/religion/comments/zvrad7/looking_for_advice_joining_an_organized_religion/",
        "text": "[removed]",
        "created_utc": 1672073724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you read the Tanakh in Hebrew?",
        "author": "Trying2Balance",
        "url": "https://www.reddit.com/r/religion/comments/zvnm14/have_you_read_the_tanakh_in_hebrew/",
        "text": "[removed]",
        "created_utc": 1672062907,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Christmas\" lights used in other religions for their own festivities",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/zvnj96/christmas_lights_used_in_other_religions_for/",
        "text": "I've seen that some Western Muslims seem to use green \"Chrsitmas\" lights for other religious festivity they have. Of course \"Christmas\" lights is not the best term but I find it interesting.\n\nChristians were lucky electricity developed mainly first in Christian European countries, so Christmas lights became almost standard in Christmas, but the custom is very modern.\n\nI wonder how other religions use such lighting for their festivities if at all?",
        "created_utc": 1672062653,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is my Sistine chapel pencil art, I worked for 7 months on this piece, just want to show to you all",
        "author": "fabiodesenhando2",
        "url": "https://i.redd.it/h7g8byrfda8a1.jpg",
        "text": "[removed]",
        "created_utc": 1672061545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join our discord to debate the existence of God!",
        "author": "puresimplee",
        "url": "https://www.reddit.com/r/religion/comments/zvmwca/join_our_discord_to_debate_the_existence_of_god/",
        "text": "[removed]",
        "created_utc": 1672060495,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the real Christian holidays if some are pagan?",
        "author": "Three_Eyed_Alex",
        "url": "https://www.reddit.com/r/religion/comments/zvmtkm/what_are_the_real_christian_holidays_if_some_are/",
        "text": "If Christmas Easter and Halloween are pagan what are the real Christian holidays throughout the calander and when are they",
        "created_utc": 1672060216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people around the world hate Catholicism more than any other religion?",
        "author": "Independent-Lead-390",
        "url": "https://www.reddit.com/r/religion/comments/zvm1xt/why_do_people_around_the_world_hate_catholicism/",
        "text": "[removed]",
        "created_utc": 1672057180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whatsapp group for comparative religion",
        "author": "Flaky-Comfortable667",
        "url": "https://www.reddit.com/r/religion/comments/zvl1mr/whatsapp_group_for_comparative_religion/",
        "text": "[removed]",
        "created_utc": 1672053011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What about the shift in Taliban Afghan ideology?",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/religion/comments/zviygb/what_about_the_shift_in_taliban_afghan_ideology/",
        "text": "I think one of the general principles of Muslims is to protect women from male third parties, isn't it?    \n\n Naturally    \n \"To protect\" is to prevent the occurrence of the fact of harm.    \n &gt;・Eliminate the possibility that the victim will appear.    \n・Eliminate the possibility that the perpetrator will appear.    \n\nThese two should be treated in the same way.    \n　　　    \n\nHowever    \nTaliban can only think that they are asking for a relatively large amount of the victim's burden on one side.    \n　　　    \n\n Then     \n Can you tell me why the Taliban Afghanistan does not raise the ethical standards of men?    \n\nIf we don't try to understand them, we will continue to unilaterally throw anger at them based on our common sense,isn't it?     \n But that would be to unilaterally impose common sense and trample on the other party's beliefs, a foolishness comparable to a crusader expedition, right?",
        "created_utc": 1672044264,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m raised Catholic with some Pentecostal customs but I’m old now and questioning my place",
        "author": "fawrd",
        "url": "https://www.reddit.com/r/religion/comments/zvho8b/im_raised_catholic_with_some_pentecostal_customs/",
        "text": "[removed]",
        "created_utc": 1672039128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian Minister Pat Robertson admits to the fully pagan origins of Christmas",
        "author": "dankirm",
        "url": "https://youtu.be/-FvT2wzKTmo",
        "text": "",
        "created_utc": 1672036610,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an form of Christianity you guys feel not much people feel about?",
        "author": "The2ndKaiser",
        "url": "https://www.reddit.com/r/religion/comments/zvgdph/what_is_an_form_of_christianity_you_guys_feel_not/",
        "text": "[removed]",
        "created_utc": 1672034051,
        "upvote_ratio": 1.0
    },
    {
        "title": "alguien sabe de la semiótica /simbología /significado de la postura de la clásica estatuilla del niño dios?",
        "author": "Patient-Buffalo3214",
        "url": "https://i.redd.it/twlv61ecj78a1.jpg",
        "text": "",
        "created_utc": 1672027211,
        "upvote_ratio": 1.0
    },
    {
        "title": "please pray for my mom's bf",
        "author": "6000YearSlowBurn",
        "url": "https://www.reddit.com/r/religion/comments/zvdixr/please_pray_for_my_moms_bf/",
        "text": "he got in a serious accident on his motorcycle. after surgery he was placed in the icu. they don't know if he's going to make it. i know people say prayers don't do anything but please pray for him anywhere. i've known him for 3 years. this isn't fair.",
        "created_utc": 1672023816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Merry Christmas from Israel",
        "author": "doxie10",
        "url": "https://v.redd.it/0cebg2zqtgz91",
        "text": "",
        "created_utc": 1672019963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ukrainians move up their traditional Christmas celebration in break with Russia",
        "author": "Algernon_Asimov",
        "url": "https://www.pbs.org/newshour/world/ukrainians-move-up-their-traditional-christmas-celebration-in-break-with-russia",
        "text": "",
        "created_utc": 1672018886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drew this at church this festive weekend! Everyday is a good day to praise the lord through interpretative art! ☺️🙏",
        "author": "BlueCrystalEnjoyer",
        "url": "https://i.redd.it/9y5aod1q958a1.png",
        "text": "",
        "created_utc": 1672017822,
        "upvote_ratio": 1.0
    },
    {
        "title": "A workbook for people leaving their religion.",
        "author": "Imchildfree",
        "url": "https://www.reddit.com/r/religion/comments/zvbj1h/a_workbook_for_people_leaving_their_religion/",
        "text": "[https://www.amazon.com/dp/1933993235/ref=sspa\\_dk\\_detail\\_2?ie=UTF8&amp;psc=1&amp;pd\\_rd\\_i=&amp;pd\\_rd\\_i=1933993235p13NParams&amp;s=books&amp;sp\\_csd=d2lkZ2V0TmFtZT1zcF9kZXRhaWw](https://www.amazon.com/dp/1933993235/ref=sspa_dk_detail_2?ie=UTF8&amp;psc=1&amp;pd_rd_i=&amp;pd_rd_i=1933993235p13NParams&amp;s=books&amp;sp_csd=d2lkZ2V0TmFtZT1zcF9kZXRhaWw) I found this workbook for people who are leaving fundamentalist religions. I hope it helps who it needs to.",
        "created_utc": 1672017228,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your religious (or personal) take on animal right?",
        "author": "Only_Feedback_6049",
        "url": "https://www.reddit.com/r/religion/comments/zvb7bv/whats_your_religious_or_personal_take_on_animal/",
        "text": " I've been thinking more about my Buddhism lately and was wondering how other religions relate to his domain and their take on animal right\n\nin Buddhism first percept make we should avoid violence and killing even for animal\n\nEdit: Also, please let us know what you think of religions that may share an opposite view from your religion.\n\nPlease be respectful!",
        "created_utc": 1672016194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly \"What is my religion?\" discussion",
        "author": "RRModPostBot",
        "url": "https://www.reddit.com/r/religion/comments/zva4p5/weekly_what_is_my_religion_discussion/",
        "text": "Are you looking for suggestions of what religion suits your beliefs?\nOr maybe you're curious about joining a religion with certain qualities but don't know if it exists?\nOnce a week, we provide an opportunity here for you to ask other users what religion fits you.",
        "created_utc": 1672012802,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most important revelation since the Torah, the Bible &amp; the Quran. A Gospel for the end times. The Gospel of the Awaited Saviour. For free here to download.",
        "author": "free1tree",
        "url": "https://theahmadireligion.org/goalofthewise/",
        "text": "",
        "created_utc": 1672010394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any thoughts on whether GOP strategy of wooing Black evangelical voters by attacking LGBT morality working?",
        "author": "starsoverocean",
        "url": "https://www.reddit.com/r/religion/comments/zv8her/any_thoughts_on_whether_gop_strategy_of_wooing/",
        "text": "[removed]",
        "created_utc": 1672007713,
        "upvote_ratio": 1.0
    },
    {
        "title": "My recap of Reddit",
        "author": "TheSelfStanding",
        "url": "https://www.reddit.com/r/religion/comments/zv8ank/my_recap_of_reddit/",
        "text": "[removed]",
        "created_utc": 1672007163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you hopeful about what you want from the future?",
        "author": "Own_Scholar1993",
        "url": "https://www.reddit.com/r/religion/comments/zv7pgz/are_you_hopeful_about_what_you_want_from_the/",
        "text": "[removed]",
        "created_utc": 1672005429,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you believe in God, but are very angry at Him your entire life, do you still go to Heaven?",
        "author": "GreenEyes_BlueSkies",
        "url": "https://www.reddit.com/r/religion/comments/zv4y75/if_you_believe_in_god_but_are_very_angry_at_him/",
        "text": "This is something I've struggled with my entire life.  I am NOT an atheist.  I know there is a God, but I've been dealt a set of cards where I am very blessed and very cursed at the same fucking time.\n\nMy IQ is in the highest percentile.  I have a photographic memory.  I remember way too many things - dates, times, colors of people's shirts, what they said, wore, what the weather was like.  This has made me overthink everything and have it very difficult to deal with people.\n\nMy entire family died by the age of when I was 25.  I'm 29 now.  I'm financially blessed though.\n\nPeople used me my entire life.\n\nI'm really not happy, but I feel that this anger with God has made me go to Hell.\n\nAny advice would be appreciated.",
        "created_utc": 1671997086,
        "upvote_ratio": 1.0
    },
    {
        "title": "She Disowned Him When She Found Out...",
        "author": "Raion_no_sokutsu29",
        "url": "https://youtube.com/shorts/H1HPF0JC0U0?feature=share",
        "text": "",
        "created_utc": 1671993173,
        "upvote_ratio": 1.0
    },
    {
        "title": "The (Noachide) December Blues",
        "author": "GasparC",
        "url": "https://www.reddit.com/r/religion/comments/zv3959/the_noachide_december_blues/",
        "text": "[removed]",
        "created_utc": 1671991936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I keep a St Michael statue and San Martin caballero statue together in an altar or keep them separate?",
        "author": "LiquidFalcon91",
        "url": "https://www.reddit.com/r/religion/comments/zv2t1m/should_i_keep_a_st_michael_statue_and_san_martin/",
        "text": "[removed]",
        "created_utc": 1671990577,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried commenting on a discussion people were having on a post in r/badfacebookmemes but I didn't even have enough karma to reply there so I'm posting it here",
        "author": "Sentient_Potato_King",
        "url": "https://www.reddit.com/r/religion/comments/zv2moi/i_tried_commenting_on_a_discussion_people_were/",
        "text": "[removed]",
        "created_utc": 1671990023,
        "upvote_ratio": 1.0
    }
]