[
    {
        "title": "not everyone's going to heaven?",
        "author": "yolouat",
        "url": "https://www.reddit.com/r/religion/comments/11101gm/not_everyones_going_to_heaven/",
        "text": "The other night my cousin and I were talking and he said that not everyone is going to heaven he even showed me a passage from the Bible where it said this. Like even if you're not an extremely terrible person and you apologize to God for any sin whatsoever, sincerely ask for his forgiveness, and mean it (that your sorry). It still won't help you go to heaven is this true? Because I'm terrified now that I won't get to go to heaven.",
        "created_utc": 1676264721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are you waiting for and what are they to do?",
        "author": "0ne_Man_4rmy",
        "url": "https://www.reddit.com/r/religion/comments/110z9ho/who_are_you_waiting_for_and_what_are_they_to_do/",
        "text": "I know that a lot of religions are awaiting the arrival of someone. \n\nWhat is your religion?\n\nIs your religion waiting on someone? \n\nAre they considered good or bad? \n\nWhat are they to do/accomplish? \n\nHow are you to identify them? \n\nIs the understanding based on religious text? If so, what text?",
        "created_utc": 1676262201,
        "upvote_ratio": 1.0
    },
    {
        "title": "References to the Destruction of the Temple in the Quran.",
        "author": "Fickle-Dance-752",
        "url": "https://www.reddit.com/r/religion/comments/110z5pp/references_to_the_destruction_of_the_temple_in/",
        "text": "\nThought this might be cool to share.\n\n17:1–7\n\n“We also gave Moses the Scripture, and made it a guide for the Children of Israel. ‘Entrust yourselves to no one but Me’\n\nyour descendants of those We carried on the ark with Noah: he was truly a thankful servant.’\n\nWe declared to the Children of Israel in the Scriptures, ‘Twice you will spread corruption in the land and become highly arrogant.’\n\nWhen the first of these warnings was fulfilled, We sent against you servants of Ours with great force, and they ravaged your homes. That warning was fulfilled.\n\n[ This references the destruction of the First Temple in Jerusalem by the Babylonians in 586 BCE ]\n——————————————————\nBut then We allowed you to prevail against your enemy. We increased your wealth and offspring and made you more numerous––\n\nwhether you do good or evil it is to your own souls––and when the second warning was fulfilled [We sent them] to shame your faces and enter the place of worship as they did the first time, and utterly destroy whatever fell into their power.”\n\n[In 70 CE the Romans reclaiming Jerusalem and destroying the Second Temple]\n——————————————————\nYour Lord may yet have mercy on you, but if you do the same again, so shall We: We have made Hell a prison for those who defy [Our warning].\n\nThought these were cool references.",
        "created_utc": 1676261889,
        "upvote_ratio": 1.0
    },
    {
        "title": "A fundamental crisis every religion and every group and individually.",
        "author": "0LATTETIGO_14",
        "url": "https://www.reddit.com/r/religion/comments/110yfxm/a_fundamental_crisis_every_religion_and_every/",
        "text": "[removed]",
        "created_utc": 1676259677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the Talmud record the killing of Jesus?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/110xgkc/does_the_talmud_record_the_killing_of_jesus/",
        "text": "Hello! I am asking this because of a post on one of my other posts that says that \"they (presuming they mean Jews) record it (Jesus's killing) in the Talmud.\" Is that true? And it still would have been carried out by orders of the Romans, right? There are also some questions I want to ask on what sources say what. From this: [https://www.cambridge.org/core/journals/new-testament-studies/article/abs/babylonian-talmud-on-the-execution-of-jesus/388B24580C8815C013F8C2E2D96196DE](https://www.cambridge.org/core/journals/new-testament-studies/article/abs/babylonian-talmud-on-the-execution-of-jesus/388B24580C8815C013F8C2E2D96196DE)\n\n&gt; In my The Death of the Messiah,  preparatory to examining the Gospel accounts of the trial/interrogation  of Jesus by the chief priest(s) and San-hedrin, I surveyed the  extra-Gospel evidence for authoritative Jewish involvement in the death  of Jesus, derived from Jewish, Christian, and pagan sources. From the  Jewish evidence I discussed two items: the witness of Josephus (Ant. 18.3.3; #63–t) and a baraita from TalBab Sanhedrin 43a which I quoted from the London Soncino translation (Nezikin volume 3.281):  \n&gt;  \n&gt;On  the eve of Passover Yeshu was hanged. For forty days before the  execution took place, a herald went forth and cried, ‘He is going forth  to be stoned because he has practised sorcery and enticed Israel to  apostacy. Anyone who can say anything in his favour, let him come  forward and plead on his behalf.’ But since nothing was brought forward  in his favour he was hanged on the eve of Passover.\n\nIt appears to be talking about this story... [https://halakhah.com/sanhedrin/sanhedrin\\_43.html](https://halakhah.com/sanhedrin/sanhedrin_43.html) but I don't know where to begin looking for the witness of Josephus reference. \n\nSo... does the Talmud record the killing of Jesus? I have taken a quick glance through the wikipedia page on Jesus in the Talmud, and it looks like there is debate about that whoever Yesus was, it wasn't Jesus. Are there any details I'm missing? And what is the scholarly source referencing? Thank you, in-advance, for commenting, and I hope this doesn't fall under \"demonizing\"! I do not mean it to incite any animosity towards Jews or between religions.",
        "created_utc": 1676256542,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Way To Determine The Authenticity Of Scriptures Of Various Religions",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/religion/comments/110wzs9/the_way_to_determine_the_authenticity_of/",
        "text": "[removed]",
        "created_utc": 1676255073,
        "upvote_ratio": 1.0
    },
    {
        "title": "What religion is Brazil President Lula?",
        "author": "Conscious-Scene1158",
        "url": "https://www.reddit.com/r/religion/comments/110wdu4/what_religion_is_brazil_president_lula/",
        "text": " What religion is Brazil President Lula?",
        "created_utc": 1676253181,
        "upvote_ratio": 1.0
    },
    {
        "title": "The concept of the Incarnation with all details | Shri Datta Swami | #universalspirituality",
        "author": "Basic_Willow5232",
        "url": "https://youtu.be/Y6ssxFFLzoM",
        "text": "[removed]",
        "created_utc": 1676250415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demonic severed head watched me sleep",
        "author": "phobia78",
        "url": "https://www.reddit.com/r/religion/comments/110uxvd/demonic_severed_head_watched_me_sleep/",
        "text": "this happened last night at 2am. \n\ni was lying in bed trying to fall asleep. i was actually pretty tired for once, which is unusual because most nights i have to force myself to sleep even though i’m not tired. \n\ni randomly start to feel a presence, not an evil or negative one, but not a good one either. it made me feel like i was being watched. i felt the presence coming from the end of my end, which has a desk and my pet bird’s cage on top of it. \n\nit was dark in my room, but i could see the silhouette of a decapitated head on top of the bird cage. the head kept fading in and out, but still remained there. i knew it was the same one i’ve been seeing for the past 3 nights.\n\nthe head belongs to an old man who has no eyes, his nose has been cut off and is bleeding from all over his face. he has a little bit of white hair on top of his head, that’s how i know he’s an old man. he couldn’t have been watching me for more than about 25-30 minutes but it felt so much longer. \n\nhe occasionally made whispering noises but i couldn’t tell what he was saying, and for some reason his voice sounded more feminine than masculine. i could also feel the weight of his headless body lay down next to me, as well as my mattress creaking so i knew i wasn’t imagining things.  this only happened once or twice though. \n\ni could tell that he was demonic because i wasn’t feeling any positive energy from him. i didn’t feel like he was evil or there to harm me, just to cause me discomfort and paranoia, and to prevent me from sleeping. \n\ni couldn’t sleep because of him, i stayed wide awake for ages but eventually i managed to pass out after i turned the light on and played some music. \n\nthis probably sounds fake but i swear i’m telling the truth. before anyone mentions it, i don’t have a mental health issue, i know my own body. medication isn’t real, it’s unnatural poison designed to make you weak. this is literal spiritual warfare\n\nis there any specific demon that takes the form of a decapitated head and watches people sleep? thanks for any answers",
        "created_utc": 1676248674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is God a semicolon?",
        "author": "JohnSwindle",
        "url": "https://www.reddit.com/r/religion/comments/110u98o/is_god_a_semicolon/",
        "text": "I've been thinking about this. What if God were a semicolon? Wouldn't that be unfair to the many who can't read and to the Greeks, who use our semicolon as a question mark?",
        "created_utc": 1676246652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly \"What is my religion?\" discussion",
        "author": "RRModPostBot",
        "url": "https://www.reddit.com/r/religion/comments/110u6br/weekly_what_is_my_religion_discussion/",
        "text": "Are you looking for suggestions of what religion suits your beliefs?\nOr maybe you're curious about joining a religion with certain qualities but don't know if it exists?\nOnce a week, we provide an opportunity here for you to ask other users what religion fits you.",
        "created_utc": 1676246418,
        "upvote_ratio": 1.0
    },
    {
        "title": "why i left christianity and found a bible doesnt help anyone",
        "author": "binmonkey27",
        "url": "https://www.reddit.com/r/religion/comments/110tvwt/why_i_left_christianity_and_found_a_bible_doesnt/",
        "text": "[removed]",
        "created_utc": 1676245576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Religion help you overcome neediness?",
        "author": "Mister-Khalifa",
        "url": "https://www.reddit.com/r/religion/comments/110ti5g/can_religion_help_you_overcome_neediness/",
        "text": "Why do we have needs? Is some needs justified. If some needs are not met then should the be suppressed and brushed away. Is it actually possible to be happy within yourself.",
        "created_utc": 1676244493,
        "upvote_ratio": 1.0
    },
    {
        "title": "💀The Unbaptized Child's Curse: Drekavac Demon 🔥 (Slavic Folklore)",
        "author": "RazerPrecise",
        "url": "https://www.youtube.com/shorts/IA5UyJMGLqQ",
        "text": "",
        "created_utc": 1676244361,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do Jews say about the Genesis 1:26 “Let US make mankind in OUR image”. Doesn’t that make the case for the Trinity?",
        "author": "Fanjolin",
        "url": "https://www.reddit.com/r/religion/comments/110t7ko/what_do_jews_say_about_the_genesis_126_let_us/",
        "text": "I’m having a discussion with my religious in-laws and need some clarity on that part.",
        "created_utc": 1676243672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aliens in religions",
        "author": "feelgoodone",
        "url": "https://www.reddit.com/r/religion/comments/110s0y5/aliens_in_religions/",
        "text": "[removed]",
        "created_utc": 1676240507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Answering the question \"Is there any difference between a religion and a cult?\"",
        "author": "Mad_Season_1994",
        "url": "https://v.redd.it/otc3q5blutha1",
        "text": "",
        "created_utc": 1676238010,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Devotionals, and a central message of love. Watch my journey of strengthening my relationship with God",
        "author": "CuteCircleboy",
        "url": "https://youtu.be/iTlZiNJQBZA",
        "text": "",
        "created_utc": 1676235521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our notions of 'spirituality' are only the misinterpretation of an evolved psychological function",
        "author": "Worried_Employee3073",
        "url": "https://www.reddit.com/r/religion/comments/110pk2g/our_notions_of_spirituality_are_only_the/",
        "text": "[removed]",
        "created_utc": 1676234121,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about Jesus for the religions who don’t believe he was real",
        "author": "No-Internal-7285",
        "url": "https://www.reddit.com/r/religion/comments/110odvl/a_question_about_jesus_for_the_religions_who_dont/",
        "text": "[removed]",
        "created_utc": 1676231137,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't figure out what the True Faith is",
        "author": "idkwhatshouldiwrite",
        "url": "https://www.reddit.com/r/religion/comments/110mw2s/i_cant_figure_out_what_the_true_faith_is/",
        "text": "First, I’m sorry if this is not the right sub to post this. \nI've almost always been an atheist/agnostic, a few months ago I converted to Christianity. The problem is, I can't figure out what the True Religion is. What if it’s not Christianity but instead Islam? But what if I convert to Islam and instead Christianity is the true Faith? What if true Faith is neither but something else? Both have points that can make them real, they both have Prophecies that seem that seem to be fulfilling, things that make sense. I can't figure out what's real and what's not... I don’t want to make the wrong choice. I’m on the verge of crying because I can’t take that anymore. It’s too hard and complex for me, I just want to follow the True Faith I don’t even care anymore about wtf is written on these Books, I just want to be saved",
        "created_utc": 1676227283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spirituality and Religion",
        "author": "DisasterSpiritual412",
        "url": "https://www.reddit.com/r/religion/comments/110m129/spirituality_and_religion/",
        "text": "[removed]",
        "created_utc": 1676225148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the male-dominant Muslim community (on the whole) an inherently violent species?",
        "author": "Think_Law3924",
        "url": "https://www.reddit.com/r/religion/comments/110ltiq/is_the_maledominant_muslim_community_on_the_whole/",
        "text": "The Qur’an contains several injunctions that call both for peace and violence. The problem (as I see it) is not that they are there; the issue (IMO) is that non-violent and militant Muslims 'appear' equally justified. For some Muslims, the peace of God is through his sword; for others Muslims, it is found in his unbounded mercy.\n\nWhy do you think this dichotomy exists in the male Muslim?",
        "created_utc": 1676224654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone who follows Christianity talk to me about my doubts",
        "author": "Separate_Belt2139",
        "url": "https://www.reddit.com/r/religion/comments/110lafe/can_anyone_who_follows_christianity_talk_to_me/",
        "text": "[removed]",
        "created_utc": 1676223317,
        "upvote_ratio": 1.0
    },
    {
        "title": "U",
        "author": "adamole123",
        "url": "https://www.reddit.com/r/religion/comments/110kv75/u/",
        "text": "[removed]",
        "created_utc": 1676222262,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I’m thinking if I should take water baptism or not, my parents are really pushing me for it but I don’t think I want to because it feels really cultish by my fathers view and I have different views on Christianity.",
        "author": "UnstoppableXD",
        "url": "https://www.reddit.com/r/religion/comments/110km4r/so_im_thinking_if_i_should_take_water_baptism_or/",
        "text": " I still want to be Christian just not in the same way my father wants to. I just don’t want to screw myself over because I’m at a very early stage in life.",
        "created_utc": 1676221640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different dimensions in religion",
        "author": "Faleinn",
        "url": "https://www.reddit.com/r/religion/comments/110kbby/different_dimensions_in_religion/",
        "text": "In the old Norse faith asatro, the universe is pictured as the world tree Yggdrasil, connecting various places to each other. The asa gods live in Asgard, which is different from Utgard where the giants live, and once again different from Midgard, home of us humans. \nThis to me sounds like a concept of different dimensions layered or connected with each other; the human dimension being different from the asa dimension and so on. \n\nI am looking for other religions with a similar belief system of more than one dimension. Technically I guess you could say Christianity fits the bill with the concept of heaven and all, but I am making a distinction between planes of existance and afterlives.\n\nI'm thankful for suggestions to look into!",
        "created_utc": 1676220912,
        "upvote_ratio": 1.0
    },
    {
        "title": "It doesn't make sense for God to get angry",
        "author": "MidnightChocolare42",
        "url": "https://www.reddit.com/r/religion/comments/110ir0o/it_doesnt_make_sense_for_god_to_get_angry/",
        "text": "People get angry when they're scared, and they get scared when they feel powerless, for God to get angry he has to be powerless",
        "created_utc": 1676216924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offering help to people who can not understand the concept of trinity in Christianity",
        "author": "empra2r",
        "url": "https://www.reddit.com/r/religion/comments/110hqyo/offering_help_to_people_who_can_not_understand/",
        "text": "Hey everyone, as an Ex-Muslim and also an Ex-Atheist, trinity has always been one of the most difficult and complex concepts of Christianity for me.  It took me quite a while until I have learnt how I should rely on my faith and my trust in God when I do not understand certain things, and that my limited wisdom as a human being is not comparable to the wisdom of God.\n\nAs someone who has been there myself, I can understand many people from various backgrounds - especially my Muslim friends - might be having difficult time in understanding this concept. I would like to welcome anyone who has the same issue to talk and discuss with me, so that you could hear my opinions and maybe that would be helpful for someone who is about to make a decision of accepting Jesus as his/her Lord and Saviour. \n\nThank you and looking forward to share thoughts and opinions with you all.",
        "created_utc": 1676214266,
        "upvote_ratio": 1.0
    },
    {
        "title": "WE ARE LIVING IN THE END TIMES?",
        "author": "sportifynews",
        "url": "https://youtu.be/poOhsqW7TUI",
        "text": "",
        "created_utc": 1676213933,
        "upvote_ratio": 1.0
    },
    {
        "title": "What then … shall we say of God? For if you have been able to comprehend what you wanted to say, it is not God; if you have been able to comprehend it, you have comprehended something else instead of God. - St. Augustine",
        "author": "beatsbyusrnm",
        "url": "https://www.reddit.com/r/religion/comments/110hh8p/what_then_shall_we_say_of_god_for_if_you_have/",
        "text": "From *Sermon 67 on the New Testament*",
        "created_utc": 1676213563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given our abundance of innate commonsense, is the Bible still required reading?",
        "author": "Think_Law3924",
        "url": "https://www.reddit.com/r/religion/comments/110fpnk/given_our_abundance_of_innate_commonsense_is_the/",
        "text": "\\[I fully acknowledge\\]: that since the earliest humans walked the earth, individuals have wondered where they came from, why they’re here, and what it all means. Religion, by and large, represents (IMO) society’s attempts to answer those questions. While the 'Good Book' isn't always able to achieve that goal, it often succeeds at providing followers with structure, a code of ethics, and a sense of purpose. The promise of an afterlife and so on.\n\nAny thoughts about this one?",
        "created_utc": 1676208453,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are you so sure?",
        "author": "Ollieclosetftm",
        "url": "https://www.reddit.com/r/religion/comments/110cwfn/how_are_you_so_sure/",
        "text": "Let me start of by saying I mean this in a curious way; I am not trying to question your faith only solidify it. I am someone who has no faith (by that I mean I don't not believe in ANY religion since we have no proof they are false) but from my research and solid proof of God (especially Christianity) some main points come up. That being:\n\nThe complex of the universe, but for some reason this one annoys me, you talk of the complexity of the universe but don't question the fact that maybe it is so complex it may not have needed a creator.\n\nDNA and Jesus, I see a lot that DNA is like code and a computer can't be coded without a human, however, God isn't a human and in no religion is he without it being greatly frond upon by others. Also Jesus, but this one is something that is only mentioned in the bible, they only proof we have of this is one wildly popular book so I draw this one out of my conclusion as to if God is real or not, right now I'm looking for real, present, modern proof.\n\nI hope no-one takes offence and can help me in my search for a 'God'. Any religion is welcome as I currently have no proof for any. Please don't preach to me :)",
        "created_utc": 1676198577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you played doom",
        "author": "Ocelriggssaber666",
        "url": "https://www.reddit.com/r/religion/comments/110br62/have_you_played_doom/",
        "text": "It's a very Christian and Islamic game You go around hell killing demons You can go on a crusade jihad or Viking And clear out an entire population of demonic and devilish entities Do give this game a go if you believe in Abrahamic faith's  Pope Francis is playing this game as we speak",
        "created_utc": 1676194226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn't Christianity value original text translations?",
        "author": "walkingwithsisyphus",
        "url": "https://www.reddit.com/r/religion/comments/1107aqk/why_doesnt_christianity_value_original_text/",
        "text": "Something I find strange amongst Christian traditions is that they do not promote reading the Biblical text in its original form like, say, Islam does with the Quran.\n\nWhy would they not?-- especially with traditions that are asserting they are the correct form of Christianity either by way of sola scriptura (which would make you think reading the Bible in its original form would be more important) or by way of historical authority.",
        "created_utc": 1676177088,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some help.",
        "author": "Greedy-Astronaut5549",
        "url": "https://www.reddit.com/r/religion/comments/1106fnf/i_need_some_help/",
        "text": "[removed]",
        "created_utc": 1676174175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does engaging in premarital sex (not adultery) make an Imam inherently a terrible person?",
        "author": "gina_chua",
        "url": "https://www.reddit.com/r/religion/comments/110589c/does_engaging_in_premarital_sex_not_adultery_make/",
        "text": "[removed]",
        "created_utc": 1676170213,
        "upvote_ratio": 1.0
    },
    {
        "title": "head covers/ veils",
        "author": "book---",
        "url": "https://www.reddit.com/r/religion/comments/1103d7l/head_covers_veils/",
        "text": "[removed]",
        "created_utc": 1676164478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Muslims and Latter-day Saint pamphlet",
        "author": "BayonetTrenchFighter",
        "url": "https://www.churchofjesuschrist.org/study/manual/muslims-and-latter-day-saints?lang=eng",
        "text": "",
        "created_utc": 1676160493,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your response to the problem of evil?",
        "author": "TryMe100timesss",
        "url": "https://www.reddit.com/r/religion/comments/11017ff/whats_your_response_to_the_problem_of_evil/",
        "text": "?",
        "created_utc": 1676158326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who had the honor of determining the Bible is complete? How can we trust that person?",
        "author": "Ok_Machine7343",
        "url": "https://www.reddit.com/r/religion/comments/1100okl/who_had_the_honor_of_determining_the_bible_is/",
        "text": "[removed]",
        "created_utc": 1676156865,
        "upvote_ratio": 1.0
    },
    {
        "title": "My name is Sam Shamoun Christian Apologist on Youtube. Call and ask me anything 224-565-7809",
        "author": "Upbeat_Potential8239",
        "url": "https://www.reddit.com/r/religion/comments/11009y4/my_name_is_sam_shamoun_christian_apologist_on/",
        "text": "[removed]",
        "created_utc": 1676155740,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people know that the chapters of religious texts are actually in chronological order? What if someone tripped while walking and all the manuscript pages went flying?",
        "author": "ikstrakt",
        "url": "https://www.reddit.com/r/religion/comments/11001b1/how_do_people_know_that_the_chapters_of_religious/",
        "text": "What if the order many books or even a single page is out of place from the original construction? What if pages that were supposed to be cut as drafting elements ended up included?",
        "created_utc": 1676155092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion",
        "author": "DemonWorshiper69",
        "url": "https://www.reddit.com/r/religion/comments/10zzr74/religion/",
        "text": "[removed]",
        "created_utc": 1676154339,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Someone evil praised me, am I doing the right thing?",
        "author": "Ok-Possession-4828",
        "url": "https://www.reddit.com/r/religion/comments/10zxa56/if_someone_evil_praised_me_am_i_doing_the_right/",
        "text": "[removed]",
        "created_utc": 1676147811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to call Muslim Arabs “Sand Nazi’s”?",
        "author": "Ok-Possession-4828",
        "url": "https://www.reddit.com/r/religion/comments/10zx7oq/is_it_wrong_to_call_muslim_arabs_sand_nazis/",
        "text": "[removed]",
        "created_utc": 1676147628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it unfair to call Mohammad (PBUH) A Pedophile?",
        "author": "Ok-Possession-4828",
        "url": "https://www.reddit.com/r/religion/comments/10zx2lw/is_it_unfair_to_call_mohammad_pbuh_a_pedophile/",
        "text": "[removed]",
        "created_utc": 1676147279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humans cannot foretell the future with any certainty. Time and again their efforts at prediction fail miserably. So a book of prophecies that did come true has to attract our attention. The Bible is such book.",
        "author": "Pretty-Newspaper7875",
        "url": "https://kasonde24.blogspot.com/2023/02/prophecies-that-came-true.html",
        "text": "",
        "created_utc": 1676143297,
        "upvote_ratio": 1.0
    },
    {
        "title": "A tough question for Islam",
        "author": "BayonetTrenchFighter",
        "url": "https://www.reddit.com/r/religion/comments/10zu9ob/a_tough_question_for_islam/",
        "text": "My objective to not to offend or course doubts.\n\nI’m curious to Muslims opinions of [this video](https://youtu.be/w3mBbUmp-nQ) ?\n\nI don’t really agree with his takes or opinions, but I’m curious to other interpretation.\n\nI’m also curious about the finding that [pew research](https://www.pewforum.org/wp-content/uploads/sites/7/2013/04/worlds-muslims-religion-politics-society-full-report.pdf) found.\n\nWhat do you make of the idea that Islam is not just intended to be a religious law, but also the law of the land.\n\nIncluding that 20-50% believe stoning adulterers should be the law of the land.\n\n30-60% believe honor kills can sometimes be justified. \n\nAgain I’m not attempting to offend or tear down in any way.\n\nI’m trying to understand. \n\nwhat do you make of this research? Do you think it’s accurate? Do you think it’s misconstrued?",
        "created_utc": 1676140028,
        "upvote_ratio": 1.0
    },
    {
        "title": "India's Oldest And World Famous Temple Which Is The Center Of Main Attraction Of Tourism",
        "author": "Which-Air9204",
        "url": "https://www.neworkplace.com/post/india-s-oldest-and-world-famous-temple-which-is-the-center-of-main-attraction-of-tourism",
        "text": "",
        "created_utc": 1676139451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latter-day Saints and Muslims at a glance",
        "author": "BayonetTrenchFighter",
        "url": "https://youtu.be/3L74r4GHQFI",
        "text": "",
        "created_utc": 1676139118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a person who is fanatic in matters of religion, and clings to certain ideas about the nature of God (and the universe) a person who has no faith at all?",
        "author": "Think_Law3924",
        "url": "https://www.reddit.com/r/religion/comments/10ztoik/is_a_person_who_is_fanatic_in_matters_of_religion/",
        "text": "I ask this because (to me) the meaning of life is just to be alive. It is so plain and so obvious and so simple. And yet, everybody rushes around in a great panic as if it were necessary to achieve something beyond themselves.",
        "created_utc": 1676138521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Know thyself as the pride of His creation, the link uniting divinity and matter; behold a part of God Himself within thee; remember thine own dignity nor dare descend to evil or meanness. ~Akhenaton",
        "author": "ptahhotep_",
        "url": "https://www.reddit.com/r/religion/comments/10zsw8j/know_thyself_as_the_pride_of_his_creation_the/",
        "text": "&gt;Akhenaten (Ancient Egyptian: ꜣḫ-n-jtn ʾŪḫə-nə-yātəy, pronounced [ˈʔuːχəʔ nə ˈjaːtəj], meaning \"Effective for the Aten\"), was an ancient Egyptian pharaoh reigning c. 1353–1336 or 1351–1334 BC, the tenth ruler of the Eighteenth Dynasty. Before the fifth year of his reign, he was known as Amenhotep IV (Ancient Egyptian: jmn-ḥtp, meaning \"Amun is satisfied\".\nhttps://en.wikipedia.org/wiki/Akhenaten?wprov=sfla1",
        "created_utc": 1676136498,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Conclusion to Barclay’s Apology for the True Christian Divinity (17th Century Quaker Apologetics)",
        "author": "JustaGoodGuyHere",
        "url": "https://www.reddit.com/r/religion/comments/10zs9oh/the_conclusion_to_barclays_apology_for_the_true/",
        "text": "THE CONCLUSION\n\nIf in God's fear, candid reader, thou appli'st thyself to consider this system of religion here delivered, with its consistency and harmony, as well in itself as with the Scriptures of Truth; I doubt not but thou wilt say with me and many more, that this is the spiritual day of Christ's appearance, wherein he is again revealing the ancient paths of Truth and righteousness. For thou mayest observe here the Christian religion, in all its parts, truly established and vindicated, as it is a living, inward, spiritual, pure, and substantial thing, and not a mere form, show, shadow, notion, and opinion, as too many have hitherto held it, whose fruits declare they wanted that which they bear the name of; and yet many of those are so in love with their empty forms and shadows, that they cease not to calumniate us for commending and calling them to the Substance, as if we therefore denied or neglected the true form and outward part of Christianity, which indeed is (as God the searcher of hearts knows) a very great slander. Thus, because we have desired people earnestly to feel after God near and in themselves, telling them that their notions of God, as he is beyond the clouds, will little avail them if they do not feel him near: hence they have sought maliciously to infer that we deny any God except that which is within us. Because we tell people that it is the Light and the Law within, and not the letter without, that can truly tell them their condition, and lead them out of all evil: hence they say we vilify the Scriptures and set up our own imaginations above them. Because we tell them that it is not their talking or believing of Christ's outward life, sufferings, death, and resurrection, no more than the Jews crying, \"the Temple of the Lord, the temple of the Lord,\" that will serve their turn, or justify them in the sight of God, but that they must know Christ in them, whom they have crucified, to be raised, and to justify them, and redeem them from their iniquities: hence they say, we deny the life, death, and sufferings of Christ, justification by his blood, and remission of sins through him. Because we tell them, while they are talking and determining about the resurrection, that they have more need to know the Just One, whom they have slain, raised in themselves, and to be sure they are partakers of the first resurrection, and that if this be, they will be the more capable to judge of the second: hence they say that we deny the resurrection of the body. Because, when we hear them talk foolishly of heaven and hell, and the last judgment, we exhort them to come out of that hellish condition they are in, and come down to the judgment of Christ in their own hearts, and believe in the Light and follow it, that so they may come to sit in the heavenly places that are in Christ Jesus, hence they maliciously say that we deny any heaven or hell but that which is within us, and that we deny any general judgment: which slanders the Lord knows are foully cast upon us whom God hath raised for this end, and gathered us, that by us he might confound the wisdom of the wise, and bring to nought the understanding of the prudent, and might, in and by his own Spirit and Power in a despised people (that no flesh might glory in his presence), pull down that dead, dark, corrupt image, and mere shadow and shell of Christianity, wherewith Antichrist hath deceived the nations, for which end he hath called us to be a first-fruits of those that serve him, and worship him no more in the oldness of the letter, but in the newness of the Spirit. And though we be few in number, in respect of others, and weak as to outward strength, which we also altogether reject; and foolish, if compared with the wise ones of this world, yet as God hath prospered us, notwithstanding much opposition, so will he yet do; that neither the art, wisdom, nor violence of men or devils shall be able to quench that little spark that hath appeared, but it shall grow to the consuming of whatsoever shall stand up to oppose it. The mouth of the Lord hath spoken it, yea he that hath risen in a small remnant shall arise and go on by the same arm of power in his spiritual manifestation, until he hath conquered all his enemies, until all the kingdoms of the earth become the Kingdom of Christ Jesus.\n\nUnto him that hath begun this work, not among the rich or great ones, but among the poor and small, and hath revealed it not to the wise and learned, but unto the poor, unto babes and sucklings, even to him the Only-Wise and Omnipotent GOD be honor, glory, thanksgiving, and renown, from henceforth and forever. Amen. Halelu-JAH.",
        "created_utc": 1676134864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insight",
        "author": "Gaming_dad2001",
        "url": "https://www.reddit.com/r/religion/comments/10zs6da/insight/",
        "text": "Based off a bunch of comments I got on need help post I’m doing research on Islam and Buddhism. What are some things that are seen as negative that is a normal thing like I grew up hunting and bond with my dad by hunting I have tattoos I’m bisexual and drink (but that could be stopped). I want y’all’s insight on what y’all have had to change or accept that it is frowned upon",
        "created_utc": 1676134648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yo, what is God really waiting for?",
        "author": "CaptNoypee",
        "url": "https://www.reddit.com/r/religion/comments/10zs2w5/yo_what_is_god_really_waiting_for/",
        "text": "The question of evil, why God refuses to stop it.... apologists say its because God gave us the gift of \"Free Will\" and gave us the right to exercise it.\n\nBut you know what, BILLIONS OF PEOPLE ALREADY LIVED AND DIED EXERCISING THEIR FREE WILL!\n\nCountless more are going to be born non-stop. Good and Evil will go on and on and on and on and on until some almighty beings steps on the breaks!\n\nSO WHAT IS GOD REALLY WAITING FOR???",
        "created_utc": 1676134395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marriage in islamicly inspired countries.",
        "author": "LabProfessional5610",
        "url": "https://www.reddit.com/r/religion/comments/10zqlo1/marriage_in_islamicly_inspired_countries/",
        "text": "While marriage is an essential part of Islamic tradition and culture, the regulations and cultural practices surrounding marriage in Muslim countries can be complex and varied, with some countries adopting more conservative and traditional practices, and others embracing more progressive and liberal attitudes towards marriage\n\nI am tired of the current state of marriage where I live. The frustration of waiting for a solution to the issues has become overwhelming. While I acknowledge that entering into marriage without prior experience can be problematic, it is not the case for all arranged marriages.\n\nUnfortunately, dating is not a part of our culture, and it was more straightforward to proceed directly into marriage. However, things have become complicated, and I feel emotionally and sexually repressed.\n\nIts probably because Im a [23] male who just at that age. I’m seriously depressed about this. \n\nBeing single isn’t something I choose , it’s just something that’s forced down my throat by the community and it feels like there’s nothing I can do about it.",
        "created_utc": 1676130728,
        "upvote_ratio": 1.0
    },
    {
        "title": ". on TikTok…LexTheChosen1",
        "author": "odmg8118",
        "url": "https://www.tiktok.com/t/ZTRtNeojU/",
        "text": "No lie….plain truth!",
        "created_utc": 1676128489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to prevent cults (Christian or otherwise) from springing up without invoking the slippery slope and not being able to distinguish between a religion or cult?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/10zo8hs/is_there_any_way_to_prevent_cults_christian_or/",
        "text": "I'm talking about the kinds of organizations that are isolated, practice polygamy, practice corporal punishment against children, sometimes have children/underage girls married to grown men, etc. \n\nAll these things are awful. But the police and legal systems are often slow/hesitant to intervene because of things like religious freedom and the idea that if they do intervene, the organization could escape justice by saying they're just practicing their faith. \n\nHow can these groups be done away with or prevented from coming about in the first place without violating people's rights?",
        "created_utc": 1676123881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion??? Where did it all come from. Is it of God???",
        "author": "Itsmyturn101",
        "url": "https://www.reddit.com/r/religion/comments/10zo7ol/religion_where_did_it_all_come_from_is_it_of_god/",
        "text": "[removed]",
        "created_utc": 1676123811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Human cognition and its role in the spiritual realm",
        "author": "jsswehvtstd",
        "url": "https://www.reddit.com/r/religion/comments/10znzph/human_cognition_and_its_role_in_the_spiritual/",
        "text": "[removed]",
        "created_utc": 1676123142,
        "upvote_ratio": 1.0
    },
    {
        "title": "The so called violent text of the Qur'an.",
        "author": "Martiallawtheology",
        "url": "https://www.reddit.com/r/religion/comments/10zm6tp/the_so_called_violent_text_of_the_quran/",
        "text": "Lo and behold, the Quran has a verse that says kill them Polytheists. Quran chapter 9:5.\n\nThe internet is full of lists. You can search and find what you like. So, one goes online and searches for something like “Violence in Islam” of course you will find a list that suits your search. Then you pick one of the Juicy ones and post it here and there feigning you have read the whole Quran and this particular verse sums them all up. \n\n***9:5*** *So when the restricted months have passed, then you may kill the polytheists wherever you find them, and take them, and surround them, and stand against them at every point. If they repent, and they hold the Communion, and they contribute towards purification, then you shall leave them alone. God is Forgiving, Merciful.*\n\n**But oh, what is this thing about the restricted months? Is there a context to this verse?** \n\nLet’s go back a few verses. Just a few verses for a start.\n\n***9:1*** *A revocation is made by God and His messenger to those with whom you have made a pledge from among the polytheists.*\n\nBaraathun/revocation/a freedom of obligation/disassociation.\n\nWhy is this disassociation? Is it **BECAUSE** they are so called Polytheists?\n\n***9:3*** *And a proclamation from God and His messenger to the people, on the day of the greater Pilgrimage: “That God and His messenger are innocent from the polytheists.” If you repent, then it is better for you, and if you turn away, then know that you will not escape God. And give news to those who have rejected of a painful retribution.*\n\n**Not really. This is a people who had a treaty with you and they broke it.** \n\nThen the Quran says “Except those who kept the pledges in the treaty”. Thus, none of this is about all the polytheists.\n\n**9:4** Except for those with whom you had made a pledge from among the polytheists if they did not reduce anything from it nor did they support anyone against you; you shall continue the pledge with them until its expiry. God loves the righteous.\n\n**So you give them 4 months as a period of reconciliation. They have broken the treaty, you have given them time, and there is no option but to battle.**\n\n**9:5** So when the restricted months have passed, then you may kill the polytheists wherever you find them, and take them, and surround them, and stand against them at every point. If they repent, and they hold the Communion, and they contribute towards purification, then you shall leave them alone. God is Forgiving, Merciful.\n\n**Then comes the mercy if they are seeking your protection.**\n\n**9:6** And if any of the polytheists seeks your protection, then you may protect him so that he may hear the words of God, then let him reach his sanctity. This is because they are a people who do not know.\n\n**9:8** How is it that when they come upon you they disregard all ties, either those of kinship or of pledge. They seek to please you with their words, but their hearts deny, and the majority of them are wicked.\n\n**They are not called polytheists because of their belief alone, it is because they are cheaters as a people. They broke a pledge and they did not keep their promises.** \n\n***As long as they are upright with you, you are upright with them. 9:7.***\n\n**9:12** And if they break their oaths after making their pledge, and they challenge the authority of your Dheen; then you may kill the leaders of rejection. Their oaths are nothing to them, perhaps they will then cease.\n\n**You are allowed only the leaders of the oath-breaking, aggressive nation who fought you and attacked you first. Which means those who fight you. The governance. Not every tom, dick and harry.** \n\nThey are the aggressors. They attacked you first. Not that you are to go seeking all over the world and find all the polytheists and kill them. Read.\n\n**9:13** Would you not fight a people who broke their oaths, and obsessed to expel the messenger, especially while they were the ones who attacked you first? Are you concerned about them? It is God who is more deserving that you be concerned with if you are believers.\n\nYou must fight if someone is weak, being persecuted and are oppressed.\n\n*4:75 And why do you not fight in the cause of God, when the weak among the men and women and children say: “Our Lord, bring us out of this town whose people are wicked, and grant us from yourself a Supporter, and grant us from yourself a Victor!”*\n\n**You must fight on behalf of the weak** \n\n*4:75 And why do you not fight in the cause of God, when the weak among the men and women and children say: “Our Lord, bring us out of this town whose people are wicked, and grant us from Yourself a Supporter, and grant us from Yourself a Victor!”* \n\n**Charities to be used for just cause** \n\n*9:60 The charities are to go to the poor, and the needy, and those who work to collect them, and those whose hearts have been united, and to free the slaves, and those in debt, and in the cause of God, and the wayfarer. A duty from God, and God is Knowledgeable, Wise.* \n\n**You cannot kill unjustly** \n\n*17:33 And do not kill, for God has made this forbidden, except in the course of justice. And whoever is killed innocently, then We have given his heir authority, so let him not transgress in the taking of a life, for He will be given victory. Just cause to kill is aggression, but you are not allowed to be the aggressor.* \n\n*2:190 And fight in the cause of God against those who fight you, but do not transgress, God does not like the aggressors.* \n\n*2:191 And kill them wherever you overcome them, and expel them from where they expelled you, and know that persecution is worse than being killed. And do not fight them at the Sacred Temple unless they fight you in it; if they fight you then kill them, thus is the recompense of the disbelievers.* \n\n*2:192 And if they cease, then God is Forgiving, Merciful.* \n\n*2:193 And fight them so there is no more persecution, and so that the system is God’s. If they cease, then there will be no aggression except against the wicked.*\n\n**Iqra. Read.**\n\n*2:263 Kind words and forgiveness are far better than a charity that is followed by harm. God is Rich, Compassionate.*\n\n*2:264 O you who believe, do not nullify your charities with insult and harm; like the one who spends his money in vanity to show off to the people, and he does not believe in God and the Last Day. His example is like a stone on which there is dust, then it is subjected to a heavy rain which leaves it bare. They cannot do anything with what they have earned; and God does not guide the rejecting people.*\n\n*2:265 And the example of those who spend their money seeking the grace of God, and to save their souls, is like the example of a garden that is on a high ground and is subjected to a heavy rain, and because of that it produces double its crop. And if no heavy rain comes, then it still gives enough. And God is Seer of what you do.* \n\nPeace",
        "created_utc": 1676117395,
        "upvote_ratio": 1.0
    },
    {
        "title": "True faith, being imperfect, is always accompanied with doubting. - William Perkins",
        "author": "beatsbyusrnm",
        "url": "https://www.reddit.com/r/religion/comments/10zm44u/true_faith_being_imperfect_is_always_accompanied/",
        "text": "From *An Exposition of the Lord’s Prayer* (1593)",
        "created_utc": 1676117131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Pope do do right thing? or not?",
        "author": "Recent-Skill7022",
        "url": "https://www.reddit.com/r/religion/comments/10zlkt2/did_pope_do_do_right_thing_or_not/",
        "text": "[https://www.youtube.com/watch?v=uzDcjPBhkw4](https://www.youtube.com/watch?v=uzDcjPBhkw4)\n\nAccording to the sriptures how should have pope francis reacted?",
        "created_utc": 1676115241,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts (if any) on the mushroom Jesus theory?",
        "author": "Think_Law3924",
        "url": "https://www.reddit.com/r/religion/comments/10zk9pq/what_are_your_thoughts_if_any_on_the_mushroom/",
        "text": "Quote: \"*Among the more outrageous suggestions is that the Bible’s claims about miracles—and even the resurrection of Jesus—were the result of hallucinations triggered by psychotropic drugs. That is, people did not see a resurrected Jesus. They did not see miracles. They were merely delirious from ingesting things like mushrooms, chemicals, or drugs*\". \n\nSource: [https://www.gotquestions.org/mushroom-Jesus.html](https://www.gotquestions.org/mushroom-Jesus.html)",
        "created_utc": 1676113678,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the the miracles of the quran (at least from my perspective) that isn’t talked about too often. Would love the perspective of others",
        "author": "Exotic-Put9396",
        "url": "https://www.reddit.com/r/religion/comments/10zjb8t/one_of_the_the_miracles_of_the_quran_at_least/",
        "text": "*God said, ‘Jesus, I will take you back and raise you up to Me: I will purify you of the disbelievers. To the Day of Resurrection **I will make those who follow you superior to those who disbelieved.** Then you will all return to Me and I will judge between you regarding your differences.* - Quran 3:55\n\nThis is what god says in the quran. And we did end up seeing christendom dominating the world. And even though their dominance has diminished over the years, they’re still by far the most dominant. So is this verse somewhat of a “miracle prediction” or could 7th century arabia have easily predicted such a thing?",
        "created_utc": 1676112563,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m going to commit suicide and I also think I’m going to leave organised religion.",
        "author": "Sufficient_Animal604",
        "url": "https://www.reddit.com/r/religion/comments/10zii1i/i_think_im_going_to_commit_suicide_and_i_also/",
        "text": "\nI’m sick and tired of the bs.\n\nGo ahead and tell me I’m going to burn in hell for eternity and go ahead and downvote me, I know that that’s going to happen anyways.",
        "created_utc": 1676111609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparative Study of Writings of Roman and Greek Historians | NE Work Place",
        "author": "Which-Air9204",
        "url": "https://www.neworkplace.com/post/comparative-study-of-writings-of-roman-and-greek-historians-ne-work-place",
        "text": "",
        "created_utc": 1676111008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are inter-religious marriages good or bad? When you enter into an interfaith marriage, you are likely aware that you may face challenges. Being aware of mistakes that interfaith couples make might help you avoid them, and keep disagreements over religious differences from derailing your partnership.",
        "author": "Pretty-Newspaper7875",
        "url": "https://kasonde24.blogspot.com/2023/02/are-inter-religious-marriages-good-or.html",
        "text": "",
        "created_utc": 1676109787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yehuda D. Nevo — A Comprehensive Skeptical Theory on the formation of Islam",
        "author": "pradeen_mania",
        "url": "https://medium.com/@pradeenmania123/yehuda-d-nevo-a-comprehensive-skeptical-theory-on-the-formation-of-islam-ad0cd95f9a5b",
        "text": "",
        "created_utc": 1676102705,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think false religious concepts and not science is the real cause of people leaning towards atheism.",
        "author": "Alien_9876",
        "url": "https://www.reddit.com/r/religion/comments/10zfo0z/i_think_false_religious_concepts_and_not_science/",
        "text": "[removed]",
        "created_utc": 1676102341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has Satan murdered, as referenced in John 8:44?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10zds5m/who_has_satan_murdered_as_referenced_in_john_844/",
        "text": "The title basically says it all. Here is a link...\n\n[https://www.biblegateway.com/passage/?search=John%208%3A44&amp;version=NIV](https://www.biblegateway.com/passage/?search=John%208%3A44&amp;version=NIV)\n\nOr, is Jesus speaking symbolically?",
        "created_utc": 1676095302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Lucifer choose to rebel against God? Did God know this was going to happen?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10zd25y/did_lucifer_choose_to_rebel_against_god_did_god/",
        "text": "...and how do religious people respond to these questions:\n\n&gt; But herein lies the contradiction: How can it be logically maintained  that Lucifer chose? For who would be so base as to create a being only  to watch him roast forever on hell’s rotisserie? If god gave Lucifer  free choice and god is all-knowing and all-powerful, would he not then  see into the future and know what “choice” Lucifer, like Adam after him,  would make? Why tempt Lucifer then? What manner of god would do this?  Only, it would seem, a sadistic god, one who enjoys watching his foolish  created beings fritter away their misspent lives? Another question  follows: Why force an eternity of suffering upon a creature, who through  no fault of his own, “chose” badly? To consign such a being to eternal  flames would seem morally indefensible. \n\nWhich is from this: [https://www.skeptic.com/reading\\_room/the-exorcist-the-reincarnation-of-a-particular-kind-of-irrationality/](https://www.skeptic.com/reading_room/the-exorcist-the-reincarnation-of-a-particular-kind-of-irrationality/)\n\nI am not posting this to be mean. I am posting this because I wanted to see how religious people would respond. Wait, that still sounds mean. I wanted to read their side to the story, if that sounds better.",
        "created_utc": 1676092780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Muslims believe that God loves them? (Muslims please provide insight)",
        "author": "Master_Educator90210",
        "url": "https://www.reddit.com/r/religion/comments/10z9zaz/do_muslims_believe_that_god_loves_them_muslims/",
        "text": "I always hear and read about the father/child or Shepard/sheep relationship vs the master/slave relationship between God and humanity when Christianity and Islam are compared. So how true is this? How exactly do Muslims view their relationship with God? I already know the Christian ideas fairly well.",
        "created_utc": 1676082759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian Evangelist negative effects",
        "author": "Tech_nerd89",
        "url": "https://www.reddit.com/r/religion/comments/10z9pgu/christian_evangelist_negative_effects/",
        "text": "[removed]",
        "created_utc": 1676081913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salmo 40",
        "author": "Possible_Witness7725",
        "url": "https://youtube.com/shorts/_e7It6yyr7w?feature=share",
        "text": "",
        "created_utc": 1676076887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Jesus a prophet or God",
        "author": "KingJugDrinker",
        "url": "https://www.reddit.com/r/religion/comments/10z7l54/is_jesus_a_prophet_or_god/",
        "text": "Ive been christian for a couple years and randomly thought about islam and now im scared. Im now no longer sure what to believe but it’s one of the two for sure.",
        "created_utc": 1676075549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women preachers",
        "author": "Itsmyturn101",
        "url": "https://youtube.com/shorts/D1suKiyL2Ws?feature=share",
        "text": "",
        "created_utc": 1676074345,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do Muslims find spouses?",
        "author": "Icy-Region4678",
        "url": "https://www.reddit.com/r/religion/comments/10z6ti0/how_do_muslims_find_spouses/",
        "text": "I understand that in Islam, you can't be friends with the opposite gender. So, how do they marry someone without really knowing them? How does that work? If it's a father figure choosing their spouse, what if they get into a marriage they don't want to be in?",
        "created_utc": 1676073445,
        "upvote_ratio": 1.0
    },
    {
        "title": "XSBTH - KQ XS BTH - Kết quả Xổ Số Bình Thuận - SXBTH",
        "author": "murraygoweae",
        "url": "https://xosoketqua.com/xsbth-xo-so-binh-thuan.html",
        "text": "",
        "created_utc": 1676072936,
        "upvote_ratio": 1.0
    },
    {
        "title": "What good does the “He gets us” campaign do?",
        "author": "royale_wthCheEsE",
        "url": "https://www.reddit.com/r/religion/comments/10z6ega/what_good_does_the_he_gets_us_campaign_do/",
        "text": "[removed]",
        "created_utc": 1676072274,
        "upvote_ratio": 1.0
    },
    {
        "title": "All religions are work based...even Christianity",
        "author": "BigShubz",
        "url": "https://www.reddit.com/r/religion/comments/10z5hmg/all_religions_are_work_basedeven_christianity/",
        "text": " Christians love to boast that every religion says 'do this do that', and Jesus says 'done'. The salvation through grace alone is touted as a unique component of Christianity. However, i believe that if you dig deeper, Christianity like all religion is also work based.\n\nOne simple question that unravels this: If someone like hitler, right before he shot himself accepted christ died for his sins, would he be saved by that faith alone? Or Osama bin Laden before he was killed? Most answers I've seen say something along the lines of, ' you have to live like you have accepted Christ for it to count' - in other words, do works...\n\nSome christians will answer yes to that question as seen here: [https://www.youtube.com/watch?v=22O-lspFoUc](https://www.youtube.com/watch?v=22O-lspFoUc)\n\nBut most are not willing as it is so reprehensible that someone like him could escape his consequences based on his acceptance of christ in the last second of his life.\n\nHere's an interesting comparison with Islam:\n\nChristians say that you are saved by accepting that christ dies for your sins. How do you accept Christ? Living how christ wants you to. Hence works.\n\nMuslims say you are saved by the mercy of Allah alone(yes i know that must be surprising to hear for Christians because of how much you are told that Islam is completely work based). How do you get the mercy of Allah? Living how he wants you to live. Hence doing works.\n\nNo matter how you wrap it up, it comes down to works. It also goes both ways as mere works without faith is also meaningless. hence why in both Christianity and Islam, 'good' atheists won't be saved.\n\n\"**As the body without the spirit is dead, so faith without deeds is dead.** \" (Christianity)\n\n**Ash-Shaafa‘i (may Allah have mercy on him) said: \"The consensus of the Sahaabah and Taabi‘een, and those who came after them, and our contemporaries, is that faith consists of words, deeds and intentions, and none of the three is valid except with the others.\"** (Islam)",
        "created_utc": 1676069811,
        "upvote_ratio": 1.0
    },
    {
        "title": "All religions are work based...even Christianity",
        "author": "BigShubz",
        "url": "/r/Christianity/comments/10z5f8o/all_religions_are_work_basedeven_christianity/",
        "text": "",
        "created_utc": 1676069652,
        "upvote_ratio": 1.0
    },
    {
        "title": "All religions are work based...even christianity",
        "author": "BigShubz",
        "url": "/r/Christianity/comments/10z5bof/all_religions_are_work_basedeven_christianity/",
        "text": "",
        "created_utc": 1676069472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Familiar Friday 😻 let me see yours",
        "author": "SparkyRaspberry",
        "url": "https://i.redd.it/uzy67c6pvgha1.jpg",
        "text": "",
        "created_utc": 1676062960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jesus Was GAy",
        "author": "JwasGay",
        "url": "https://www.reddit.com/r/religion/comments/10z2yh0/jesus_was_gay/",
        "text": "[removed]",
        "created_utc": 1676062890,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am contemplating joining islam",
        "author": "xxcile",
        "url": "https://www.reddit.com/r/religion/comments/10z1sr6/i_am_contemplating_joining_islam/",
        "text": "My current beliefs are somewhat spiritual i believe in a high power but i dont know what. I feel like when i die i will get to either ascend to the next level or descend but i was chatting with my muslim friend and he said to me that we were allowed to choose to either stay an angel or pick a human and based off of that we all picked human im just unsure on the true meaning to be muslim when will my faith grow?",
        "created_utc": 1676060129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religious texts always mention super natural beings coming down to earth and taking different roles. Why do you think these super natural beings want to live around us?",
        "author": "comments247",
        "url": "https://www.reddit.com/r/religion/comments/10z1cox/religious_texts_always_mention_super_natural/",
        "text": "My question includes all super natural beings. From the deeps of hell, to spirits thay roam the earth, to limbo and Paradise. \n\nThanks!",
        "created_utc": 1676059112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Edomites consider Abraham in high regard as ancient Hebrews?",
        "author": "Round-Relative-7859",
        "url": "https://www.reddit.com/r/religion/comments/10yzjit/did_edomites_consider_abraham_in_high_regard_as/",
        "text": "[removed]",
        "created_utc": 1676054811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small discussion on patiently waiting",
        "author": "Shot_Improvement6372",
        "url": "https://youtu.be/Cfrw7xmZjTM",
        "text": "[removed]",
        "created_utc": 1676052992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maha Shivratri Fasting Rules, Maha Shivaratri Fasting Rituals, Fasting R...",
        "author": "srisneha",
        "url": "https://youtube.com/watch?v=HIpJ04bsYw0&amp;feature=share",
        "text": "",
        "created_utc": 1676051187,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one have faith in a God that is willing to kill 22,000 innocent people in an earthquake ?",
        "author": "Sandy-the-Gypsy777",
        "url": "https://www.reddit.com/r/religion/comments/10yxenm/how_does_one_have_faith_in_a_god_that_is_willing/",
        "text": "Struggling with personal beliefs, so when things like this happen, I question my faith. \n How can there possibly be a loving, and protective God, when there is so much suffering and death of innocent people, many children.  How do I worship what feels like an immoral God ?",
        "created_utc": 1676049469,
        "upvote_ratio": 1.0
    },
    {
        "title": "number 7 Akkad and Sanskrit and religious connection",
        "author": "Limp-Confidence7079",
        "url": "https://i.redd.it/zz32qou4mfha1.jpg",
        "text": "",
        "created_utc": 1676047636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety, Depression and the Church",
        "author": "renewedheartsco",
        "url": "https://www.unraveledfaith.ca/post/anxiety-depression-and-the-church",
        "text": "",
        "created_utc": 1676045764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think there is any truth to (Baba Ram Dass') statement that we should treat everyone as God in drag?",
        "author": "Think_Law3924",
        "url": "https://www.reddit.com/r/religion/comments/10yqog1/do_you_think_there_is_any_truth_to_baba_ram_dass/",
        "text": "The subtext of his suggestion is off course, that we are God?",
        "created_utc": 1676031858,
        "upvote_ratio": 1.0
    },
    {
        "title": "How different would our world be if everybody believed in the same God?",
        "author": "Pretty-Newspaper7875",
        "url": "https://kasonde24.blogspot.com/2022/12/how-would-world-be-different-if.html",
        "text": "",
        "created_utc": 1676027525,
        "upvote_ratio": 1.0
    },
    {
        "title": "India's Oldest And World Famous Temple Which Is The Center Of Main Attraction Of Tourism",
        "author": "Which-Air9204",
        "url": "https://www.neworkplace.com/post/india-s-oldest-and-world-famous-temple-which-is-the-center-of-main-attraction-of-tourism",
        "text": "",
        "created_utc": 1676017805,
        "upvote_ratio": 1.0
    },
    {
        "title": "cartermiroquai but he got an autotuner for 10 minutes",
        "author": "idk_lol_______",
        "url": "https://www.youtube.com/watch?v=aH_e8nsnOIw&amp;ab_channel=johnegbertthesecondsecond",
        "text": "",
        "created_utc": 1676004432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holding people of your own faith to a higher standard?",
        "author": "BayonetTrenchFighter",
        "url": "https://www.reddit.com/r/religion/comments/10yfta7/holding_people_of_your_own_faith_to_a_higher/",
        "text": "I tend to hold people of my own faith to a higher standard. When they sin… or break the law, especially the more severe the breaking of the law is, I sorta feel like the punishment should be worse…\n\nLike if a Latter Day Saint killed someone, I think they should have a worse punishment then someone of a different faith. But maybe it’s one of those “I know them, so I can “judge” them?”\n\n\nDoes anyone else feel this way? Or different? Let me know. \n\nObviously I don’t believe in judging others, or condemning them. God is the ultimate judge. We also shouldn’t gossip of speak I’ll of people. But I’m just curious is anyone else has these feelings ever?",
        "created_utc": 1676002150,
        "upvote_ratio": 1.0
    }
]