[
    {
        "title": ",,,,,,,,,,, ............... .................. .......................",
        "author": "Historical_Channel67",
        "url": "https://www.reddit.com/r/religion/comments/10k4pqz/_/",
        "text": "[removed]",
        "created_utc": 1674564535,
        "upvote_ratio": 1.0
    },
    {
        "title": "For non Islamics. Would you convert to Islam hypothetical.",
        "author": "WARPANDA3",
        "url": "https://www.reddit.com/r/religion/comments/10k3c94/for_non_islamics_would_you_convert_to_islam/",
        "text": "So I am a Christian but I was reading a bit about Islam the other day. I found out that they know where Muhammad’s tomb is and they don’t open it. I also found out that some Islamics believe that Muhammad’s body is in there, perfectly preserved like the day he died. They would never do this, but hypothetically, they open the tomb and find out he is perfectly preserved and hasn’t decayed at all, looks like he just died. They test and find out there is no explanation. Would that cause you to convert to Islam or not? I think it might cause me to look in to it at least a bit more closely.",
        "created_utc": 1674559684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drawing of mine, that I just drew with markers on paper. What does different religions have to say about it?",
        "author": "repola81",
        "url": "https://i.redd.it/p4a21y2vm0ea1.jpg",
        "text": "",
        "created_utc": 1674558739,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can be gained from reading the Gospel of Thomas? Seems fairly basic to me",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10k2pgt/what_can_be_gained_from_reading_the_gospel_of/",
        "text": "Hi. I read the (yes, heretical) Gospel of Thomas and it is intriguing, but I don't see what the fuss is about? It says that everything comes from the Light; I guess this is like how all the colours can be refracted from white light, or simply it's the usual light vs dark sort of inagery. Jesus likens himself or the Father to the Light. It implies primacy and superiority of the spirit over matter. It says the body and the world come from spirit. It says if we want to not die, we have to focus on our spirit. It says to live forever, we have to look within. There are a few of Jesus's more ethical teaching, 'love thy brother'. There's even an apparently typical bit of Gnostic misogynistic-sounding imagery in logion 114, which seems to like 'male' to spirit, and 'female' to body. Beyond all this, I can't see what's so illuminating about this? Does anybody know? It seems like fairly basic metaphysics to me 🤷‍♂️\n\nBasically, I don't think I'm much wiser from having read this text. It feels like it should have been the introduction to a longer text. Who knows, maybe that's the idea: Apostle Thomas (as per the story of the text) is the one only with whom Jesus shared his Secrets...\n\nSo the text feels kind of useless if one wishes to spiritually progress.\n\nAnyone any ideas on it?",
        "created_utc": 1674557112,
        "upvote_ratio": 0.99
    },
    {
        "title": "What do Muslims believe about Creation/evolution?",
        "author": "MrsAppleForTeacher",
        "url": "https://www.reddit.com/r/religion/comments/10k10h0/what_do_muslims_believe_about_creationevolution/",
        "text": "I know they consider Adam to be a prophet, but do they have a fundamental belief in the Genesis version of creation? Or do they accept science and evolution?",
        "created_utc": 1674549546,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Demonolatry altar",
        "author": "misanthropicsuccubus",
        "url": "https://i.redd.it/a43jk3q0pzda1.jpg",
        "text": "",
        "created_utc": 1674547355,
        "upvote_ratio": 1.0
    },
    {
        "title": "not an altar, but i like reading about and visiting old dharmic temples, this is Mulbekh Gompa, dedicated to Maitreya Buddha, 800 years old Buddhist Monastery in India",
        "author": "shreyasiyer__",
        "url": "https://i.redd.it/awzo0hkxhzda1.jpg",
        "text": "",
        "created_utc": 1674544970,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is not my altar, but I like visiting old dharmic temples, this is Mulbekh Gompa, 800 years old Buddhist Monastery dedicated to Maitreya Buddha",
        "author": "shreyasiyer__",
        "url": "https://i.redd.it/sd6qookkgzda1.jpg",
        "text": "",
        "created_utc": 1674544512,
        "upvote_ratio": 1.0
    },
    {
        "title": "My shelf on our altar cabinet.",
        "author": "Dear-Investigator857",
        "url": "https://i.redd.it/1sys77vcyxda1.jpg",
        "text": "",
        "created_utc": 1674544359,
        "upvote_ratio": 1.0
    },
    {
        "title": "My shelf in the altar cabinet.",
        "author": "Dear-Investigator857",
        "url": "https://www.reddit.com/r/religion/comments/10jzrwc/my_shelf_in_the_altar_cabinet/",
        "text": "An altar for a non-supernatural practice. I'm no interior designer and am still exploring what goes on this little shelf. Right now it's primarily used to house my sake set and tea set for some hospitality practices. I break them out now and then when friends come over for a chat. I also have my Latin texts there and am exploring what comes up when I visit it from time to time. The skull doubloons are from a themed party I hosted because they bring up a lot of great, relevant memories and intentions.  \n\n\n \"Friendship dances around the world bidding us all to awaken to the recognition of happiness.\"",
        "created_utc": 1674544208,
        "upvote_ratio": 1.0
    },
    {
        "title": "U.S. Churches in Steep Decline: Studies Disclose Reported Loss of Christian Religion Among Nation’s Younger Generations",
        "author": "joeleisenberg64",
        "url": "https://original.newsbreak.com/@joel-eisenberg-561469/2900040703425-u-s-churches-in-steep-decline-studies-disclose-reported-loss-of-christian-religion-among-nation-s-younger-generations?s=influencer",
        "text": "",
        "created_utc": 1674541418,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hope its not to late share my alter! dont ask why its on my dresser",
        "author": "Annaneedsmoney",
        "url": "https://i.redd.it/ag485wy32zda1.jpg",
        "text": "",
        "created_utc": 1674539647,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't have an altar, this is my place of worship",
        "author": "0ne_Man_4rmy",
        "url": "https://i.redd.it/cvs3pvu1iyda1.jpg",
        "text": "[removed]",
        "created_utc": 1674532926,
        "upvote_ratio": 1.0
    },
    {
        "title": "My christian altar with some solomonic magic stuff",
        "author": "cb0mss",
        "url": "https://i.redd.it/synwnjlfeyda1.png",
        "text": "",
        "created_utc": 1674531722,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw people post their altars, so here is mine 😊",
        "author": "DeathForever3",
        "url": "https://i.redd.it/zj9fa2h7byda1.jpg",
        "text": "",
        "created_utc": 1674530604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Articles / Thoughts Re: \"How do Symbols Relate to Religion?\"",
        "author": "robotfightandfitness",
        "url": "https://www.reddit.com/r/religion/comments/10juom4/articles_thoughts_re_how_do_symbols_relate_to/",
        "text": "I'm looking for thoughts / links on the general question \"How do symbols relate to religion?\" \n\nThe question is purposefully broad, as the topic I'm studying is actually along the lines of \"How do belts in martial arts relate to the thinking of the students \\[in-group\\] and observers \\[outgroup\\]?\" \\[approximately\\]\n\n&amp;#x200B;\n\nSo, mostly interested in what you've come across that in some way addresses the Title Question. I'm familiar with Jung's \"Man and His Symbols\" / the writings re: the collective unconscious. \n\nThank you for taking the time! :\\]",
        "created_utc": 1674526945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Stand and The Chosen",
        "author": "Expensive_Ad4319",
        "url": "https://www.reddit.com/r/religion/comments/10jugz9/last_stand_and_the_chosen/",
        "text": "[removed]",
        "created_utc": 1674526309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please say this prayer",
        "author": "StevenWendellNelson",
        "url": "https://i.redd.it/1tal10f0yxda1.jpg",
        "text": "",
        "created_utc": 1674526163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Huge Concern about Islam- would love a serious response from a Muslim",
        "author": "Master_Educator90210",
        "url": "https://www.reddit.com/r/religion/comments/10jtpu9/huge_concern_about_islam_would_love_a_serious/",
        "text": "I have been researching and becoming very interested in Islam lately. I found it very compelling so far-  However, I just realized something that is hugely concerning to me. I did not realize until now that God never spoke directly to Mohamed- instead all communication came through the Angel Gabriel. So my concern is- if God did not speak directly to Mohamed, how do we know the angel Gabriel is really the angel Gabriel and not a demon in disguise? How could Mohamed know? or anyone else? This might seem preposterous at first but really consider this- God speaks directly to Moses in the old testament and God speaks from the sky in the Gospel. So if God has spoken to humans directly in the past- why would he not speak directly to Mohammed? Especially considering how important Mohamed's message was. \n\nThis is not a request for proselytization or a \"debunking\" of Islam. \n\nI presume that I am not the first person to think of this- So I'm sure there is an Islamic answer to this. What is it?",
        "created_utc": 1674524074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spirituality and Religion Questionnaire for a Class - Need 2 participants",
        "author": "drewman20",
        "url": "https://www.reddit.com/r/religion/comments/10jtonp/spirituality_and_religion_questionnaire_for_a/",
        "text": "[removed]",
        "created_utc": 1674523976,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you delete a PDF of the Quran, is that destroying a holy book the same as shredding or burning?",
        "author": "GreyJedi56",
        "url": "https://www.reddit.com/r/religion/comments/10jrb7g/if_you_delete_a_pdf_of_the_quran_is_that/",
        "text": "Does a digital copy of the book have the same significance as a physical one?",
        "created_utc": 1674517354,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Altar 🙏🔥",
        "author": "decentofyomomma",
        "url": "https://i.redd.it/c4p7f9uhmwda1.jpg",
        "text": "",
        "created_utc": 1674510194,
        "upvote_ratio": 1.0
    },
    {
        "title": "reminder that China has 1 million + Muslim uyghur prisoners being tortured, killed, experimented on and getting their organs harvested by the chinese government every day, a modern day holocaust",
        "author": "plzzdontreportme",
        "url": "https://i.redd.it/u1uzdwu6hwda1.jpg",
        "text": "",
        "created_utc": 1674508398,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Truth",
        "author": "ObviousWisard",
        "url": "https://m.youtube.com/watch?v=xDNuckVfTp0",
        "text": "",
        "created_utc": 1674504154,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Rise of Spirit Warriors on the Christian Right: How an extreme transformation in American religion poses an existential threat to our democracy",
        "author": "harsh2k5",
        "url": "https://newrepublic.com/article/170027/rise-spirit-warriors-christian-right-politics",
        "text": "",
        "created_utc": 1674502518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about quotes and verses...",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/religion/comments/10jkz02/questions_about_quotes_and_verses/",
        "text": "Hello, again! I have some additional quotes I would like someone to explain/elaborate on for me. I know I've asked of that from this server before, and some have asked if I am here in good faith or just trying to demonize certain religions. I am not here to demonize any religions. I just want these quotes explained/elaborated on. Please don't ban me. I'm trying to find out what is what about other religions and what is just fake crap that is trying to demonize other religions. The quotes are... \n\n&gt; Rabbi Shimon ben Yoḥai says that the graves of gentiles do not render   one impure, as it is stated: “And you, My sheep, the sheep of My   pasture, are man” ([Ezekiel 34:31](https://www.sefaria.org/Ezekiel.34.31)),   which teaches that you, i.e., the Jewish people, are called “man,” but   gentiles are not called “man.” Since the Torah states with regard to   ritual impurity imparted in a tent: “If a man dies in a tent” ([Numbers 19:14](https://www.sefaria.org/Numbers.19.14)), evidently impurity imparted by a tent does not apply to gentiles.   \n&gt;  \n&gt;  \n&gt;  \n&gt;**Come** and **hear** a proof from a mishna (*Makhshirin* 2:8): In a case when **one found a lost item in** a city where both Jews and gentiles reside, **if** the city has **a majority of Jews** he is **obligated to proclaim** his find. **If** there is **a majority of gentiles** he is **not obligated to proclaim** his find. **Who** is the one about **whom you heard that he follows the multitudes,** i.e., that he attaches significance to the loss of an item in a place where the multitudes are present? It is **Rabbi Shimon ben Elazar. Resolve from** this mishna **that when Rabbi Shimon ben Elazar says** that the item belongs to the finder, it is referring specifically to a place **where there is a majority of gentiles, but** in a place **where there is a majority of Jews, no,** it does not belong to the finder.   \n&gt;  \n&gt;  \n&gt;  \n&gt;**Rather, Rav Aḥa, son of Rav Ika, says** that there is a different explanation: **It is necessary only to** teach the *halakha* of one who **withholds the wages of a hired laborer;** for **a gentile** to do so **to** another **gentile and** for **a gentile** to do so **to a Jew is prohibited,** but for **a Jew** to do so **to a gentile is permitted.**  This case is less obvious than other types of robbery, as instead of  taking an item from the victim, the robber withholds money that is due  to the victim.   \n&gt;  \n&gt;  \n&gt;  \n&gt;The Gemara answers: **Because** the *tanna* **wanted to teach** in **the latter clause** that if **a Jew** does so **to a gentile, it is permitted, he taught** in **the former clause** that if a gentile does one of these, **it is prohibited.** If the *baraita*  were to state that if a gentile does so, he is liable, it would have to  state that if a Jew does so to a gentile, he is exempt, because this is  the opposite of liable. That would indicate that it is actually  prohibited for a Jew to do so to a gentile, and that he is merely exempt  from liability, which is not the case. Therefore, the word prohibited  is used with regard to a gentile. Therefore, this does not prove that a  gentile is exempt from capital punishment.   \n&gt;  \n&gt;  \n&gt;  \n&gt;The *amora* proceeded to ask Elijah a different question and **said to him: Is not the Master a priest? What is the reason** that **the Master** is **standing in a cemetery?** Elijah **said to him: Has the Master not studied** the mishnaic order of ***Teharot***\\*\\*? As it is taught\\*\\* in a *baraita*: **Rabbi Shimon ben Yoḥai says** that **the graves of gentiles do not render** one **impure, as it is stated: “And you, My sheep, the sheep of My pasture, are man”** (Ezekiel 34:31), which teaches that **you,** i.e., the Jewish people, **are called “man,” but gentiles are not called “man.”**  Since the Torah states with regard to ritual impurity imparted in a  tent: “If a man dies in a tent” (Numbers 19:14), evidently impurity  imparted by a tent does not apply to gentiles.   \n&gt;  \n&gt;  \n&gt;  \n&gt;The Gemara asks: **And according to** the opinion of **Rabbi Shimon ben Yoḥai, who says** that the subsequent verse: **“For he will turn away your son from following Me”** (Deuteronomy 7:4) serves **to include all who turn away** one’s son from God, i.e., all gentiles, **what is there to say? Rather, by Torah law** only **sexual relations by way of marriage** are prohibited, **and they came** and **decreed** that sexual relations are prohibited **even by way of licentiousness.** \n\nI did not save the websites these quotes were from. The **emboldening** of certain words is from being copied from those websites. To elaborate, the quotes I'm asking about are from another post I made on a separate part of Reddit where I explained the same thing; that I did not save the links that these quotes come from.\n\nThank you, in-advance, to anyone who replies!",
        "created_utc": 1674501844,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens to stillborn children?",
        "author": "3kid100chicken",
        "url": "https://www.reddit.com/r/religion/comments/10jk9ye/what_happens_to_stillborn_children/",
        "text": "I am curious what other people's beliefs are for babies that die before they are born. My daughter was born dead 1/2 through my pregnancy with her because of down syndrome. I believe that her spirit is in a good place, not necessarily heaven, but a place where she is loved and cared for.",
        "created_utc": 1674500194,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Universe explained in 1:18",
        "author": "ObviousWisard",
        "url": "https://m.youtube.com/watch?v=xDNuckVfTp0",
        "text": "",
        "created_utc": 1674500073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do most religions that believe in souls often assume that everyone has a soul?",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/10jis4o/why_do_most_religions_that_believe_in_souls_often/",
        "text": "It seems odd almost all religions that believe in soul, or a concept akin to it, often assume everyone has it.\n\nPersonally I think some people are soulless. The closest non-religious concept we have to soul seems to be consciousness, but we also cannot prove consciousness is in everyone. Some people may be as well flesh robots.\n\nOnly religion I believe that seems to believe that not everyone has a soul is Gnosticism, which classified humans as [hylics](https://en.wikipedia.org/wiki/Hylics) or [pneumatics](https://en.wikipedia.org/wiki/Pneumatic_(Gnosticism)).",
        "created_utc": 1674496642,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your beliefs about wealth?",
        "author": "Alarming-Profit-5148",
        "url": "https://www.reddit.com/r/religion/comments/10jiek4/what_are_your_beliefs_about_wealth/",
        "text": "[removed]",
        "created_utc": 1674495743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update to my first post",
        "author": "IncarnateBroly66",
        "url": "https://www.reddit.com/r/religion/comments/10ji4xr/update_to_my_first_post/",
        "text": "[removed]",
        "created_utc": 1674495116,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Tibetan Buddhist Altar",
        "author": "konchokzopachotso",
        "url": "https://i.redd.it/pzbtx75pcvda1.jpg",
        "text": "",
        "created_utc": 1674494785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spirituality and renunciation",
        "author": "KristianMira",
        "url": "https://www.reddit.com/r/religion/comments/10jhyre/spirituality_and_renunciation/",
        "text": "*Warning: long text ahead!*\n\n&amp;#x200B;\n\nThe spirituality and renunciation issue has been one of the most difficult in my life lately. The more I sink into spirituality, the more convoluted it gets. I would like to share my views on this subject and to hear yours – and maybe it will become more clear. \n\n&amp;#x200B;\n\nPrescriptum – I am a non-native speaker, so my apologies for any possible mistakes. \n\n&amp;#x200B;\n\nFirst of all, we need to try to define what renunciation is (for it is simpler). What I mean by renunciation here is a state of being not involved/ not interested in physical reality, “worldly matters”. And as far as we human beings are completely physical material structures, and the only Universe we live in is material, and the only goals that we are to fight here for are utterly material – the thought should be considered as insane or at least unwholesome. So why bother thinking this?\n\n&amp;#x200B;\n\nAnd here comes the second term of the equation – spirituality. To define spirituality is much harder for the opinions and definitions are entirely controversial. From my point of view, there are 2 main standpoints: The first one unites spirituality and the material world (very often seen in theistic religions), the second one disconnects them (sometimes seen in dharmic religions). Personally for me, the first thought is wholly theistic and often goes as follows: God created this world, we are to please Him by doing service to His children (Him). The second thought (for me again) is closely related to the conception of Pratyahara and Maya/ Kant’s philosophy – the world appears to us not as it really is, but as we perceive it \\[through the completely limited capacity of our sensory organs\\] (Maya), and we are to find its real nature by shifting attention from our sensory organs to “the deepest” fields of human psyche (pratyahara).\n\n&amp;#x200B;\n\nIf the real spirituality somehow falls into the first standpoint – it seems to be that renunciation is not the wisest thing to practice and aspire to. But if the real spirituality falls into the second – that renunciation is the last resort by all means. \n\n So for all people who value spirituality, the issue is very important to solve. \n\n&amp;#x200B;\n\nAs for myself – I’d been radically theistic for a couple of years, but then I quit it for it was very desperate. I don’t see any reasons to believe in the anthropomorphic and extremely ambiguous God, who has so many “fabulous” personal traits and feelings for His creation, and still, we live in such an infernal world. But spirituality is not just big, it is the biggest, the vaguest part of my life and what does occupy me the most. So I am an adherent to the second standpoint, which seems to me very rational and sane. \n\n&amp;#x200B;\n\nAnd by falling into that category, I am becoming completely nihilistic about the world. I don’t want to do anything here and to relate myself by any means to it. All that is human and all that is material I consider to be relative, and the only thing I care for is absolute, which is the goal of my spirituality. It makes my life way harder because to survive in this world you need to work and so many things related to that. It’s not what I want, but what I am doomed to as for now. Which makes it more complicated.\n\n&amp;#x200B;\n\nSo, those are my thoughts on that subject. What are your thoughts?",
        "created_utc": 1674494725,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you navigate the differences between religions?",
        "author": "Beltain_Agni",
        "url": "https://www.reddit.com/r/religion/comments/10jhinp/how_do_you_navigate_the_differences_between/",
        "text": "How do you make sense of the many differences between religions, whether it's the major world religions or smaller ones as well? There are, by some counts, over four thousand religions, which includes many that we have never heard of.\n\nAdditionally, if you are religious or just a secular Humanist, how does your ideology view other religions and their practices?",
        "created_utc": 1674493645,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all the Seekers",
        "author": "_The_Monk_",
        "url": "https://www.reddit.com/r/religion/comments/10jglfv/to_all_the_seekers/",
        "text": "To all the seekers\nYour relationship with the Divine, with God, is unique. No one has the same relationship with God as you do. We are all different. You won’t find two identical human beings. Humans have unique voices, looks, and behavioral patterns— we are all different. But these are only external distinctions related to this gross material realm. So what to speak about spiritual variance? Just imagine how many ways to express yourself are in the spiritual realm. How much more subtle and wonderful that world is. \nPeople who look for beauty in this world are naive. There is no beauty in this world. Everything in this world is temporary. There is a shadow that creeps behind every living thing in this world. That shadow follows us from our first breath and finally takes us on our last one. Death. There is only death in this world. Everything in this world is built on the pillars of death. We don’t like to talk or think about it, but that shadow is always behind us. There is nothing eternal in this world. Everything we love, including us, will perish. We have never heard of someone who lived in this world forever. There is no happily ever after. All that comes into the existence of this material world must experience death. \n \nDeath is not the end. It’s a transition. When you press your TV remote to switch to another channel, that fraction of a second is death. Death is your soul saying goodbye to this body and going to the next one. The soul is eternal. It was never created, nor can it be destroyed. According to Dalton’s theory, matter is never destroyed or created, rather it is constantly transforming. So how can we be so ignorant to say that the soul dies when it leaves the body? Spirit is higher than matter, so how can it be destroyed? \n  \nEvery religion has its uniqueness and its specialties. We all have different desires, thus we need certain material bodies to fulfill our desires. In the same way, we all are on our unique spiritual journeys. Therefore, we also need different spiritual paths. That’s why there is such a variety of religions to facilitate that. But we must ask ourselves, what is the ultimate goal? What is the ultimate destination for the soul? \n \nRelationship with God is the ultimate goal. Like rivers meet in the ocean we all will meet in His Kingdom. But each river is different, it has its beauty and specialty. Each path is different, but isn’t that beautiful that we all can experience a particular relationship with God? Yet, we have so many material attachments in this world, that we cannot even grasp that there can be something beyond our current experience. \nThe disease of atheism has plagued the world, and people have no more faith in God. Atheism is hell. It’s brainwashing yourself into believing that you are born alone and will die alone. Atheism brings only suffering, and we see the results of that in our western society where suicide is the leading cause of death for young men after unintentional injuries. That is a scary statistic. Our western society is at the peak of material advancement, but almost 15% of young men die from self-harm. Why do we still fool ourselves that we can be happy in this world by engaging in sense gratification and material advancement? A hedonistic lifestyle without purpose and meaning cannot fulfill us. Why? Because we are spiritual beings, we are not meant to be happy in this world, we must transcend it. \n I have shared my story before and I am very happy that I have found my spirotual path - the path of bhakti yoga (the path of developing natural love for God) was taught by Krsna in Bhagavad-Gita and throughout all the Vedas. Bhakti yoga is universal, in english it literally means loving relationship or connection of love. With who? With God. Different religions have different ways to practice bhakti yoga, there are different ways to contact God, He has many phone numbers. \nBhakti yoga is not some bullshit, woo-woo philosophy that was made up by some hippies on mushrooms. It is based on the most ancient scriptures and many souls have attained perfection through this path. This is the oldest and the only real path to God. This path allows us to connect with both the feminine and the masculine aspects of the Divine. This is a path through which you can attain an actual eternal relationship with God, not merge with or become God. I was attracted by the simplicity of this path and I can truly say that this path completely transformed my life. I dedicated my whole life to it when I was still a teen, and I cannot explain my gratitude to be in the position I am in right now. Life is beautiful. There is nothing to fear, we are meant to be with God, it is natural, it is so joyful and yet it is our own choice to make. God is calling us, he is waiting for us, we just have to pick up the phone. \n\nI cannot explain what can happen to you when you answer His call. Life cannot be more beautiful, the experiences you go through are unexplainable, mystical, sacred and beyond  comprehension of the mind. I cannot explain what I have gone through and how many beautiful things I have witnessed, things I have never believed in and never even thought of. \nWe cannot even fathom the beauty of the eternal realm. I started my path just a few years ago, and yet by His grace I have received so much. I am a spiritual baby and there is so much more for me to learn, but He has been so kind so far. So for those who say why should I believe in God, I say: Why not?\n\nTo all the spiritualists, I say rather than fighting amongst ourselves who is right and who is wrong, focus on your own path and be sincere then your journey will be very smooth and beautiful. Instead of fighting with our god brothers and sisters who may be on different paths, part of different religions or groups, we should help those who don't have or have lost hope. Those who have not found their path yet, who are suffering without the presence of God in their life. Compassion is the duty of the soul.\n\nI pray for everyone's blessings. Thank you if you managed to read everything. I am praying for all you spiritual seekers out there. If you have any questions please ask here or privately. God Bless You…",
        "created_utc": 1674491420,
        "upvote_ratio": 1.0
    },
    {
        "title": "The two new leaders of the Jehovah's Witness cult",
        "author": "TheMexicanAbroad",
        "url": "https://youtu.be/Y_13fh62q9Q",
        "text": "",
        "created_utc": 1674491332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will we get into heaven?",
        "author": "FirudinBaghirov",
        "url": "https://www.reddit.com/r/religion/comments/10jgjb3/will_we_get_into_heaven/",
        "text": "[removed]",
        "created_utc": 1674491270,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's not an altar, but here's one of my favorite places to spend time with God.",
        "author": "0ne_Man_4rmy",
        "url": "https://i.redd.it/hdlpqapjyuda1.jpg",
        "text": "[removed]",
        "created_utc": 1674490034,
        "upvote_ratio": 1.0
    },
    {
        "title": "How similar is Christianity and Islam in reality?",
        "author": "DistinctDamage494",
        "url": "https://www.reddit.com/r/religion/comments/10jfqf4/how_similar_is_christianity_and_islam_in_reality/",
        "text": "Personally I am a Sikh, however I like to learn about the other faiths so I can keep well informed. After reading some of both the Quran and the Bible(genesis and some other parts) they both seem to have a lot of the same beliefs? \n\nI even read a part where the bible talked about pork eating being bad whereas I thought that was an Islamic practice. Of course I only know a very base level about these religions as it’s not the one I’ve lived my entire life in. \n\nBut are Islam and Christianity really that similar? What are the main differences and what are the main similarities?",
        "created_utc": 1674489282,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question",
        "author": "Ancient-External4552",
        "url": "https://www.reddit.com/r/religion/comments/10jfk3c/i_have_a_question/",
        "text": "[removed]",
        "created_utc": 1674488840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's my Atheist Altar",
        "author": "CaptNoypee",
        "url": "https://www.reddit.com/r/religion/comments/10jfdq1/heres_my_atheist_altar/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/uvng39u5ctda1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=c76b41df902155fdc0b6633bdca412ec4416839a\n\n&amp;#x200B;\n\nHail Reddit!",
        "created_utc": 1674488404,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the appeal of Satanism?",
        "author": "axtonian",
        "url": "https://www.reddit.com/r/religion/comments/10jf67b/what_is_the_appeal_of_satanism/",
        "text": "The following questions do not mean to offend anyone of Satanic faith or background, they are just my curiosities.\n\n* I understand that the religion's expansion if quite modern, so I was wondering why people who convert to it, do so? Despite those who were born into the religion via their parents, do people convert in order to condemn God (i.e. Antinomians)? Or do they believe in Satan?\n* For those who do believe in worshipping Satan (not in the form of condemning God), what do you get out of it? Do you believe in an afterlife that can be accomplished through the worship of God?\n* Do you think of God as Christians think of Satan?\n* What was the appeal in Satanism that persuaded you to convert?\n* What are some common rituals that are practiced by Satanists, and what is the symbolism behind it?\n\nThank you in advance for any help I can get in understanding this religion better.",
        "created_utc": 1674487854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found (This is what the bible teaches about Jesus and people who are LOST) #ShortVid",
        "author": "boneyardminister",
        "url": "https://odysee.com/@SolaFide:8/found:2",
        "text": "",
        "created_utc": 1674487805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Catholic Center",
        "author": "Gold-Singer-2686",
        "url": "https://www.reddit.com/r/religion/comments/10jeeno/catholic_center/",
        "text": "[removed]",
        "created_utc": 1674485921,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this?",
        "author": "avoiceforyouandme",
        "url": "https://i.redd.it/x4jz5vonguda1.jpg",
        "text": "",
        "created_utc": 1674484007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this buried beneath the basement floor",
        "author": "avoiceforyouandme",
        "url": "https://www.reddit.com/r/religion/comments/10jdo38/found_this_buried_beneath_the_basement_floor/",
        "text": "Hi, we are remodeling our basement and tearing up the ground on the basement. We found this buried underneath the front left of the house, in the ground under the basement floor. Does anyone know what this is and what it says? Thank you in advance",
        "created_utc": 1674483923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homosexuality and the Baha'i Faith &amp; Divine Civilization",
        "author": "Bahamut_19",
        "url": "/r/BahaiOrder/comments/10jcrho/homosexuality_and_the_bahai_faith_divine/",
        "text": "",
        "created_utc": 1674481966,
        "upvote_ratio": 1.0
    },
    {
        "title": "While we're posting altars and places of worship",
        "author": "kardoen",
        "url": "https://www.reddit.com/r/religion/comments/10jcoev/while_were_posting_altars_and_places_of_worship/",
        "text": "&amp;#x200B;\n\n[Home Altar](https://preview.redd.it/jteekyvzpsda1.jpg?width=2792&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=ffb5be356635320a45d36e0aa0be60dccaebd33c)\n\n&amp;#x200B;\n\n[Oboo](https://preview.redd.it/y0r5vif1qsda1.jpg?width=4016&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=7ebd44fb20bd327492aa83de79bd7f04c28ef396)\n\n&amp;#x200B;\n\n[Ene Modun](https://preview.redd.it/tbq8s5i2qsda1.jpg?width=988&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=da1b5f09a781c421c5e14fa7fb186b6b95e607a3)\n\n&amp;#x200B;\n\n[ Bakhana](https://preview.redd.it/8dy5r6k3qsda1.jpg?width=5492&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=50cf5c720f02543d1122f5bdcee0ce20dc099ecb)",
        "created_utc": 1674481072,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most cat friendly religions?",
        "author": "Lluntito",
        "url": "https://www.reddit.com/r/religion/comments/10jc38x/what_are_the_most_cat_friendly_religions/",
        "text": "[removed]",
        "created_utc": 1674479289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you think of any religious ideas that are related to mindfulness, but not from the great mindfulness based religions?",
        "author": "Sophy_19",
        "url": "https://www.reddit.com/r/religion/comments/10jbe8d/can_you_think_of_any_religious_ideas_that_are/",
        "text": "[removed]",
        "created_utc": 1674477130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Afterlife Discord Channel",
        "author": "batisledgit",
        "url": "https://www.reddit.com/r/religion/comments/10ja9a0/afterlife_discord_channel/",
        "text": "Hey, we created a discord channel to discuss the afterlife. Everyone is welcome. \n\nhttps://discord.gg/fFXWCaTC",
        "created_utc": 1674473174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can different faiths worship together?",
        "author": "Ok-Rich-1163",
        "url": "https://www.reddit.com/r/religion/comments/10j9ahy/can_different_faiths_worship_together/",
        "text": "[removed]",
        "created_utc": 1674469297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does god provide objective morality?",
        "author": "bobogeeg",
        "url": "https://www.reddit.com/r/religion/comments/10j7j2p/does_god_provide_objective_morality/",
        "text": "I saw a video today that sparked my interest and I wanted to open up a discussion about objective morality.\n\nThe claim in said video was that atheists cannot have an \"objective morality\" if they do not believe in a god/religious laws (etc).\n\nThe comments had a lot of discussion about whether or not **objective** morality exists/if it can come from the inner self/etc but I didn't see any comments about how objective morality is *bad.*\n\nUnless you can prove that there is a law/rule that would be objectively moral in every possible situation, objectivity is bad. Let me explain: Pretend there are no government laws and the only rules that define society are religious texts. Hypothetical text says: \"You shall not kill.\" Many would consider this an objective moral posed to them by their god, right? But are there not some situations, no matter how rare, at least *one,* in which murder would be the moral thing to do? To murder one person to save the planet, even? This puts religious people with the above claim in a double bind because they must either concede that you must follow religious laws at all costs, even where it would cause harm, in order to be objective (which would be bad in the cases it causes harm) or they have to concede that in some cases you must break these rules in which they would not be objective.\n\nTherefore, in response to the argument that atheists have no objective morality because they do not believe in a god, I say that 1. objective morality doesn't exist and 2. if it did, it would be bad.",
        "created_utc": 1674461995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be weird to go to a church if I'm not religious and have never been to one before?",
        "author": "Duck_Fickle",
        "url": "https://www.reddit.com/r/religion/comments/10j6b0b/would_it_be_weird_to_go_to_a_church_if_im_not/",
        "text": "I've never been inside a church, and I was not raised religious. I think because of this, I am very fascinated by religion. I am slightly religious. I do believe in God, and I pray sometimes to help with my anxiety when I don't feel in control. But I don't believe in a specific religion, I don't think. I really love old church houses. I think they are beautiful. I kind of want to visit a church and see what it is like. But I don't know if that would be considered rude.",
        "created_utc": 1674457047,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not religious but I think my dog reincarnated",
        "author": "BLOODHOUND68419",
        "url": "https://www.reddit.com/r/religion/comments/10j5tmv/im_not_religious_but_i_think_my_dog_reincarnated/",
        "text": "So, about 4 years ago my family had a small black/white poodle terrier named Benny, sadly when Christmas came around and all my relatives sat down, Benny was barking and growling, as he didn't know most of the people there. My mom shut him outside for a while so the adults could talk without the dog barking. I...still don't forgive my mom for this even though it wasn't her fault. She could've just put him in a room upstairs and locked it so the other kids didn't let him out instead of locking him out in the winter weather with a freshly shaved coat. Anyway, Benny was never found, it was like he just vanished, the gate was locked, he obviously couldn't jump over a fence with his small stature. It was like he just poofed. Around I wanna say 2 years later a random golden lab showed up on our doorstep. It looked cold and hungry so I let it in. It walked around like it owned the place, even going to where Benny's old bowls were and seeming disappointed when it found that they weren't there. I gave it some random meat and called my parents, asking what I should do with it. They called animal control, I think, and we never saw it again. It didn't have a tag, and my parents (supposedly) told me they lost contact with it after it was wrangled. I still think about those 2 a lot, just wondering if the golden lab was a reincarnate of my dog.",
        "created_utc": 1674455171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuart Little Hate?",
        "author": "stewiezone",
        "url": "https://i.redd.it/31gw6tyxsrda1.jpg",
        "text": "[removed]",
        "created_utc": 1674451816,
        "upvote_ratio": 1.0
    },
    {
        "title": "My religion tierlist!",
        "author": "Dieter_the_Great",
        "url": "https://i.redd.it/u31hx4iforda1.jpg",
        "text": "",
        "created_utc": 1674450299,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your religion's \"dirty secret\"?",
        "author": "trident765",
        "url": "https://www.reddit.com/r/religion/comments/10j3h5g/what_is_your_religions_dirty_secret/",
        "text": "Sometimes religions present a certain image of themselves, but as you dig deeper you find out this is not actually the case. For example, my religion, the Baha'i Faith, presents itself as being an exceptionally tolerant religion. But if you dig deeper, you will find that the Baha'i Faith is actually plagued with a history of nasty sectarian intolerance, and petty excommunication over reasonable alternative interpretations of the successorship. It's true that today  there aren't really any significant alternative Baha'i sects, but only because the largest Baha'i sect bullied and excommunicated the smaller sects out of existence.\n\nWhat is something people admire about your religion, but in reality it isn't true?",
        "created_utc": 1674447235,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does 'God' mean to you?",
        "author": "jjoydeparted",
        "url": "https://www.reddit.com/r/religion/comments/10j308b/what_does_god_mean_to_you/",
        "text": "hello friends. If this question has been asked before, which I'm sure it has, I'd love to be linked the threads as well! but anyway, I'm wondering how everyone personally defines 'God'.\n\nIs your idea of God an entity with specific thoughts, feelings, emotions... is it a passive onlooker? Is your God just the sum of everything and anything in this world? Is it simply the force that created the world with no specific agenda? Is God a specific *value* or concept, like hope, or Humanity, or the process of creating and being? Is it even more niche and esoteric than that? Is it all of that, none of that, or something else entirely? I'd love to know all the nitty gritty details of what this word and idea Means to you. This question is mostly directed at monotheists, but polytheists or anyone else can chime in as well, I'd love to hear from you too.\n\nTo me, God is complicated. I think God is what brought all of this, all of Everything into existence from nothing, and I think God is also this... force that exists in every human. We are created in the image of God, but I also think God is just as much created in the image of Us, one does not exist without the other. Not just humans, but also the land and the animals, it exists in the Words we speak, the thoughts we think, the things we observe and *experience.* As such I also think religion is an inherently man-made creation and process, but that doesn't make it any less holy or Godly, in fact I think it makes it more so. It's all very vague I know, but it's what makes sense and is meaningful to me.",
        "created_utc": 1674445780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it too late to share a photo of one of my altars",
        "author": "Diliosdot",
        "url": "https://i.redd.it/sqjvhbmu0rda1.jpg",
        "text": "",
        "created_utc": 1674442376,
        "upvote_ratio": 1.0
    },
    {
        "title": "heard we were sharing altars so here is my very messy incognito altar",
        "author": "ascencionoftheLark",
        "url": "https://i.redd.it/os7ok0y5yqda1.jpg",
        "text": "",
        "created_utc": 1674441468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion is Not Enough",
        "author": "_The_Monk_",
        "url": "https://www.reddit.com/r/religion/comments/10j1bd4/religion_is_not_enough/",
        "text": " \n\nYour relationship with the Divine, with God, is unique. No one has the same relationship with God as you do. We are all different. You won’t find two identical human beings. Humans have unique voices, looks, and behavioral patterns— we are all different. But these are only external distinctions related to this gross material realm. So what to speak about spiritual variance? Just imagine how many ways to express yourself are in the spiritual realm. How much more subtle and wonderful that world is. People who look for beauty in this world are naive. There is no beauty in this world. Everything in this world is temporary. There is a shadow that creeps behind every living thing in this world. That shadow follows us from our first breath and finally takes us on our last one. Death. There is only death in this world. Everything in this world is built on the pillars of death. We don’t like to talk or think about it, but that shadow is always behind us. There is nothing eternal in this world. Everything we love, including us, will perish. We have never heard of someone who lived in this world forever. There is no happily ever after. All that comes into the existence of this material world must experience death.\n\nDeath is not the end. It’s a transition. When you press your TV remote to switch to another channel, that fraction of a second is death. Death is your soul saying goodbye to this body and going to the next one. The soul is eternal. It was never created, nor can it be destroyed. According to Dalton’s theory, matter is never destroyed or created, rather it is constantly transforming. So how can we be so ignorant to say that the soul dies when it leaves the body? Spirit is higher than matter, so how can it be destroyed?\n\nReligions that do not explain the laws of karma and reincarnation are also incomplete. If you contemplate reality and existence you must conclude that your current body is not the first and not the last one you will have. We have always existed and we always will. The only question is how we want to exist. That is the ultimate question. If you read the oldest scriptures in the world, you will find the same truth. Vedas are the objective truth, they have guided humanity for thousands of years. All religious paths were derived from the Vedas. They were spoken by God and written by an incarnation of God to guide us. All religions come from Vedas.\n\nEvery religion has its uniqueness and its specialties. We all have different desires, thus we need certain material bodies to fulfill our desires. In the same way, we all are on our unique spiritual journeys. Therefore, we also need different spiritual paths. That’s why there is such a variety of religions to facilitate that. But we must ask ourselves, what is the ultimate goal? What is the ultimate destination for the soul?\n\nRelationship with God is the ultimate goal. Like rivers meet in the ocean we all will meet in His Kingdom. But each river is different, it has its beauty and specialty. Each path is different, but isn’t that beautiful that we all can experience a particular relationship with God? Yet, we have so many material attachments in this world, that we cannot even grasp that there can be something beyond our current experience.\n\nThe disease of atheism has plagued the world, and people have no more faith in God. Atheism is hell. It’s brainwashing yourself into believing that you are born alone and will die alone. Atheism brings only suffering, and we see the results of that in our western society where suicide is the leading cause of death for young men after unintentional injuries. That is a scary statistic. Our western society is at the peak of material advancement, but almost 15% of young men die from self-harm. Why do we still fool ourselves that we can be happy in this world by engaging in sense gratification and material advancement? A hedonistic lifestyle without purpose and meaning cannot fulfill us. Why? Because we are spiritual beings, we are not meant to be happy in this world, we must transcend it.\n\nWe are meant to be with God. Unfortunately, most religions don’t emphasize that, most religions are only concerned about how to be happy in this world. That is not a bad thing, certain practices can do that, but being happier and feeling spiritual bliss while connecting with God are very different things. I have shared my story before and I am very happy that I have found a spiritual path, not a religious one. The path of bhakti yoga (the path of developing natural love for God) was taught by Krsna in Bhagavad-Gita and throughout all the Vedas. Different religions have different ways to practice bhakti yoga, but most of them if not all fail to do that to the fullest extent. I am very lucky that I have found this sacred ancient path that is not tied to any religion. Religions are not bad, they help us to come to advance to a certain level, but they usually fail to give us the actual fruit.\n\nGod is perfect, but most humans are not. Therefore, even if the teachings of God in different scriptures are perfect it doesn’t mean that once you apply God’s teachings in this world the world will become perfect. Most evil comes from religion, humans dilute the words of God and therefore it becomes like poison. A half-truth is more dangerous than a lie. Even if the teachings of God are not diluted, most people are incapable to follow them. And unfortunately, those who claim to represent God in this world and help us to connect with Him are usually not perfect themself. Therefore, we can easily be cheated and misguided, thus not only being hurt, traumatized, and confused but even losing faith in God completely. Therefore, we must be very careful with organized religion.\n\nBhakti-yoga is not some bullshit, woo-woo philosophy that was made up by some hippies on mushrooms. It is based on the most ancient scriptures and many souls have attained perfection through this path. This is the oldest and the only real path to God. This path allows us to connect with both the feminine and the masculine aspects of the Divine. This is a path through which you can attain an actual eternal relationship with God, not merge with or become God. This statement attracted me, and I can truly say that this path completely transformed my life. I dedicated my whole life to it when I was still a teen, and I cannot explain my gratitude to be in the position I am in right now. Life is beautiful. There is nothing to fear, we are meant to be with God, it is natural, it is so joyful and yet it is our own choice to make. God is calling us, he is waiting for us, we just have to pick up the phone.\n\nThank you if you managed to read everything. Hope this inspires you. I am praying for all you spiritual seekers out there. If you have any questions please ask here or privately. God Bless You…",
        "created_utc": 1674440533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion in Not Enough",
        "author": "_The_Monk_",
        "url": "/r/selfimprovement/comments/10j16yp/religion_in_not_enough/",
        "text": "",
        "created_utc": 1674440196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why i don't support LGBTQ🏳️‍🌈🚫",
        "author": "Daveman-620_2000",
        "url": "https://youtube.com/watch?v=szmnQs7ZUPk&amp;feature=share",
        "text": "",
        "created_utc": 1674439684,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought you might enjoy seeing my alter",
        "author": "pallasathena1969",
        "url": "https://i.redd.it/il0fkrinnqda1.jpg",
        "text": "",
        "created_utc": 1674437932,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a dummies guide to mystical experience for an agnostic be?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10izmg1/what_would_a_dummies_guide_to_mystical_experience/",
        "text": "Hi. So I think I've exhausted the theorectical side of things for now. I'm wondering, if you had to provide a dummies guide to an agnostic / religiously confused person with minimal prior belief required, how would they go about attaining a mystical experience, like those I've read about on Wikipedia and elsewhere--without the use of drugs, starving yourself, or partially strangling yourself to death (apparently the Norse pagans used to do this)?\n\nWhat techniques are available for mystical experience that aren't suffuse with specific religious references that would interfere with belief in the process?\n\nI don't know if any of you have had mystical experiences. Maybe my question is too demanding :)\n\nAn example of things in this area I find interesting are:\n* Sufi Whirling\n* Yoga\n* Tantra\n* and maybe some kind of chanting or singing.\n\nAn example of something I'm not looking for is the Orthodox Christian 'Jesus prayer'.\n\nI've done chanting and yoga before and before are soothing, but I've never gotten near any kind of 'mystical' experience.\n\nI appreciate this probably can't be done overnight else everybody would be doing it, but it doesn't sound totally uncommon--unless lots of people take drugs or are schizophrenic or something (no offence to schizophrenics, of course).\n\nI don't want theory, metaphysics, theology, I want '1) Do this. 2) Do that. etc.'. Theory etc. isn't really getting me very far. I want methods. A technical manual. A guide. Whatever.\n\nAny help you can provide that won't just soothe me, but will actually give me some kind of mystical experience, something magical, transformative, or worthy of the name 'mystical experience', would be highly appreicated. Thank you.",
        "created_utc": 1674435551,
        "upvote_ratio": 0.99
    },
    {
        "title": "Because we are sharing some worship spaces, I figured I would share some of mine. It’s the celestial room of some of our temples.",
        "author": "BayonetTrenchFighter",
        "url": "https://imgur.com/a/d9Vspzc/",
        "text": "",
        "created_utc": 1674433582,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no idea what sorts of things I will be able to answer, but to the curious minds I am Northern Interior Salish. I am currently bored and want to see what comes from this",
        "author": "zuqwaylh",
        "url": "https://www.reddit.com/r/religion/comments/10iymsy/i_have_no_idea_what_sorts_of_things_i_will_be/",
        "text": "So what are some questions that you have?",
        "created_utc": 1674432714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly \"What is my religion?\" discussion",
        "author": "RRModPostBot",
        "url": "https://www.reddit.com/r/religion/comments/10iyd6n/weekly_what_is_my_religion_discussion/",
        "text": "Are you looking for suggestions of what religion suits your beliefs?\nOr maybe you're curious about joining a religion with certain qualities but don't know if it exists?\nOnce a week, we provide an opportunity here for you to ask other users what religion fits you.",
        "created_utc": 1674432003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help I need help answering these questions!",
        "author": "Technical_Cry8226",
        "url": "https://www.reddit.com/r/religion/comments/10iyaoo/help_i_need_help_answering_these_questions/",
        "text": "[removed]",
        "created_utc": 1674431806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conversation on the island group that believes Prince Phillip is a deity",
        "author": "MikeMan233",
        "url": "/r/LessonsWithMike/comments/10hy83o/epsiode_11_the_prince_phillip_movement/",
        "text": "",
        "created_utc": 1674429984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion Tier List (explanation in comments)",
        "author": "Just_A_Redditor1984",
        "url": "https://i.redd.it/ql47530prpda1.jpg",
        "text": "",
        "created_utc": 1674427183,
        "upvote_ratio": 1.0
    },
    {
        "title": "My vanitas shrine. All the objects - skull, flowers, hourglass, candle, dice, books, etc. - have symbolic meanings in connection to the concepts of impermanence, mortality and making the best use of the time you have. The aesthetic is inspired by 17th century vanitas paintings.",
        "author": "TJ_Fox",
        "url": "https://i.redd.it/cmrnivs39oda1.png",
        "text": "",
        "created_utc": 1674427049,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is it for Christians to refuse to seek medical aid?",
        "author": "IXBlackHeartXI36",
        "url": "https://www.reddit.com/r/religion/comments/10iwbj2/how_common_is_it_for_christians_to_refuse_to_seek/",
        "text": "While doing research on the sect of my first church, I learned that they split with the pentacostals over a dispute about faith healing. The pentacostals believed that its members shouldn't seek medical aid (this was in the early 20th century mind you), and my sect split off because the opposed that.\n\nI have heard of 'Christians' insisting on faith healing and avoiding modern medicine, but I was always under the impression this was a belief only seen in small cults, rather than in more respected denominations. I've been to churches that believe in faith healing, though they didn't avoid the doctor. The last church I went to (an evangelical one), they mostly only offered faith healing to people who were diagnosed as terminal. I've also seen churches pray over people who are going into surgery or other such things. Those evangelicals never acted surprised when someone kicked the bucket despite their prayers (though they were quite enthusiastic when someone did live, and yes that happened a couple of times, though I sorta suspect that one guy who had cancer may have been misdiagnosed). The closest thing to faith healing that most people think of they did was when some woman had a heart attack in the middle of service. They took her into a back room and prayed over to stall for time while they waited for an ambulance to arrive. \n\nI was rather surprised to find pentacostals, at least 100 years ago, forbid its members to go to doctors. At least some still support this it seems, resulting in unnecessary deaths and even lawsuits over preachers *charging* for faith healing. I live in a highly fanatical Christian community, and I've never once heard of a church charging for faith healing, despite the 'prosperity gospel' thing being popular around here.\n\nA few days ago while I was looking up stuff about cults, I found a guy who claimed he was in one (though he didn't name the group). They were forbidden from seeking medical attention under any circumstance, resulting a lot of young women dying giving birth for no reason. He also broke his collar bone once while hiking, and all they did was set the bone back in place and tied him down to a table so he couldn't move for a few days. Seriously. \n\nI would've thought beliefs like that were rare, only seen with Christian Scientists and various extremist cults like that one whose 'Jesus' (the founder claims to be Jesus) got arrested a year or two ago after it was found that people had passed away at his colony from 100% treatable diseases. \n\nHow common is this in reality? Honestly, I find it rather disturbing that a major sect once discouraged its members from seeking medical attention. Am I wrong and this is actually common? Honestly, I'm starting to suspect that my fanatical trump-supporting community isn't actually as extreme as I thought they were.",
        "created_utc": 1674426717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion Tier List (my personal opinion only, no objective standards went into this)",
        "author": "Just_A_Redditor1984",
        "url": "https://i.redd.it/9aml9y44qpda1.jpg",
        "text": "",
        "created_utc": 1674426651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian friend says he \"feels the Holy Spirit in his body\" and that it goes away whenever he sins,",
        "author": "catboy519",
        "url": "https://www.reddit.com/r/religion/comments/10ivrzv/christian_friend_says_he_feels_the_holy_spirit_in/",
        "text": "I'm agnostic. I'm wondering if my friend is telling the truth.\n\nIf this is a lie, why would he lie about this?\n\nIf he really feels that, how do we know its really the Holy Spirit and not him imagining things?\n\nWhat do you guys think when someone makes a claim like this?",
        "created_utc": 1674425344,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Holy Bible | Genesis 11-15 | KJV Dramatized Audio with Text",
        "author": "AmazingGodMinistry",
        "url": "https://youtube.com/watch?v=ZNDwHfG9gXg&amp;feature=share",
        "text": "",
        "created_utc": 1674422908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hope I am not too late to share my altar?",
        "author": "OpenTechie",
        "url": "https://i.redd.it/0nrb5iza6pda1.jpg",
        "text": "[removed]",
        "created_utc": 1674420008,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEED COLLEGE STUDENTS OPINION ON RELIGIOUS STUDIES SURVEY! (Rewards $8 for your time!)",
        "author": "fake03883",
        "url": "https://app.collegepulse.com/external-survey/6387b01d3b021f0013226c1a?snowballsample=true&amp;ref=snowball-qvlfg75ne0s1h213&amp;sb_convenience=8&amp;schoolName=Saint",
        "text": "",
        "created_utc": 1674419348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you be both a Buddhist and Christian at the same time?",
        "author": "Broad_Cold8003",
        "url": "https://www.reddit.com/r/religion/comments/10it21f/can_you_be_both_a_buddhist_and_christian_at_the/",
        "text": "[removed]",
        "created_utc": 1674418641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear no evil",
        "author": "Brief_Effort_930",
        "url": "https://i.redd.it/wi18kko12pda1.jpg",
        "text": "[removed]",
        "created_utc": 1674418557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Image tagged in virgin vs chad",
        "author": "Naturalselecton",
        "url": "https://imgflip.com/i/78bkjo yo guys have a look at this virgin vs chad meme I made",
        "text": "",
        "created_utc": 1674418376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cyclic model of the Universe - Wikipedia",
        "author": "GaryGaulin",
        "url": "https://en.wikipedia.org/wiki/Cyclic_model",
        "text": "",
        "created_utc": 1674416426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the prophet Muhammad use help from Christians and Jews to write the Quran?",
        "author": "Vukovic_1501",
        "url": "https://www.reddit.com/r/religion/comments/10ir2na/did_the_prophet_muhammad_use_help_from_christians/",
        "text": "I know many stories in the Quran and Bible are very similiar but not the same, for example where Muhammad mentions ,,Pharao,, and ,,Kings,, correctly.\n\nBut how did he know about the stories?\n\nWere there Syrian Christians who spoke arabic and told him everything?",
        "created_utc": 1674413715,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just found out what sect of Christianity I was born into!",
        "author": "IXBlackHeartXI36",
        "url": "https://www.reddit.com/r/religion/comments/10iqz1v/i_just_found_out_what_sect_of_christianity_i_was/",
        "text": "I've told people on here the first church I ever went to was a 'holiness' church. Curiously, I could never find anything about them online, even though they're pretty well-known in my area (they're often given the derogatory label 'holy rollers').\n\nI randomly brought this up with my mother yesterday while we were running some errands, and she told me I should look up 'congregational holiness' instead. That finally got me a hit. As I suspected, the group is closely related to the pentacostals. Apparently they split over a disagreement over faith healing in the early 20th century. They also have a rather small footprint it would seem, though they do have activities in other countries. Apparently they're headquartered in Georgia.\n\nOf course, I'm not so sure they would count as a sect or not. They seem to be more of a committee than anything else it would appear. I'm not sure how different they are from pentacostals, other than that they claim in their 'articles of faith' that members are allowed to seek standard medicine. \n\nOf course, honestly, I don't think I ever really belonged to this sect. I often slept through church, since I saw it as just a history class pretty much. In fact, I can't remember a single thing that the preacher taught (most of what I knew about the bible I think came from some old hanna-barbera cartoons I watched). Also, neither of my parents were pentacostal. My father was ex-roman catholic (he mistakenly believed that he had been excommunicated after his first divorce), and I'm not sure what my mother is. Me and my sister were essentially raised interdenominational (though asking online I was apparently raised with a bunch of 'fundamentalist' beliefs, mostly southern baptist). In particular, every church we went to growing up was a different sect. I never saw myself as belonging to any denomination, to be honest. Amusingly, my mother now is contemplating joining a methodist church, just because she doesn't like the type of services pentacostals and their off-shoots have. She also bought an eastern orthodox bible a while back. Obvoiusly, she doesn't care too much about denomination. \n\nGuess now I know why I could never find any information on them online. I always figured they were closely related to the pentacostals, since their services look identical (though the ones you see online appear to be a bit dramatized). Apparently they're far more closely related than I suspected. Are they even really a separate sect? I'm not sure now to be honest.",
        "created_utc": 1674413466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absolute Power (Pastor John Hagee)",
        "author": "GilletteTheBest123",
        "url": "https://youtu.be/S0bJzqDhUsA",
        "text": "",
        "created_utc": 1674413275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple Thelemic incense-offering altar",
        "author": "EmptySky93",
        "url": "https://i.redd.it/8fsrcoyy5oda1.jpg",
        "text": "[removed]",
        "created_utc": 1674407771,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hear we’re sharing worship spaces?",
        "author": "ALMSIVI369",
        "url": "https://i.redd.it/sf8p4j4d3oda1.jpg",
        "text": "",
        "created_utc": 1674406898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion",
        "author": "Lazy_Egg_5533",
        "url": "https://www.reddit.com/r/religion/comments/10inlzh/religion/",
        "text": "[removed]",
        "created_utc": 1674405030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im not sure what I saw",
        "author": "PaulieWalnuts9999",
        "url": "https://www.reddit.com/r/religion/comments/10in35u/im_not_sure_what_i_saw/",
        "text": "[removed]",
        "created_utc": 1674403720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some Muslims who pray and go Jumma at mosque practice voodoo and black magic",
        "author": "Mister-Khalifa",
        "url": "https://www.reddit.com/r/religion/comments/10im51c/why_do_some_muslims_who_pray_and_go_jumma_at/",
        "text": "(Atheists/Agnostics please kindly ignore this post, this is Muslim talk where magic is accepted as true, or you can chime in your thoughts about human psychology )\n\nThis guy from Africa dates hot girls and earns a lot of money through weed but he also prays and seems practicing Muslim. He says he knows voodoo. There seems to be communities in Africa where it is voodoo practice is rampant which on paper are either Islamic or Christian countries. How can Allah allow this. Confused uga buga noises.",
        "created_utc": 1674401238,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who use a rosary or prayer beads, what is your favorite litany to recite?",
        "author": "xAsianZombie",
        "url": "https://www.reddit.com/r/religion/comments/10ikdfq/for_those_who_use_a_rosary_or_prayer_beads_what/",
        "text": "Please share your favorite litany that you recite with a rosary.\n\nMy favorite litany that I recite daily is a prayer from the Quran:\n\nHasbunAllahu wa ni’mal wakeel\n\nGod is sufficient for me, and He is the best disposer of affairs",
        "created_utc": 1674396240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shia Muslim — Another Religious ceremony.",
        "author": "Fickle-Dance-752",
        "url": "https://v.redd.it/t0ugz5723nda1",
        "text": "",
        "created_utc": 1674394697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do religious conservatives discriminate more against women?",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/10ii9j1/why_do_religious_conservatives_discriminate_more/",
        "text": "[removed]",
        "created_utc": 1674389314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Important Statement on the controversial amendment bill || Maulana Syed ...",
        "author": "HaqqiqateHaq",
        "url": "https://youtube.com/watch?v=psT0QpXKsKY&amp;feature=share",
        "text": "",
        "created_utc": 1674388976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jupiter",
        "author": "NoodlyApendage",
        "url": "https://www.reddit.com/r/religion/comments/10igfwc/jupiter/",
        "text": "If somebody is a follower of Jupiter, what are they called?",
        "created_utc": 1674382501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me about your religion",
        "author": "Lazy_Egg_5533",
        "url": "https://www.reddit.com/r/religion/comments/10ig9pm/tell_me_about_your_religion/",
        "text": "[removed]",
        "created_utc": 1674381846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before the Big Bang 7: An Eternal Cyclic Universe, CCC revisited &amp; Twistor Theory",
        "author": "GaryGaulin",
        "url": "https://www.youtube.com/watch?v=FVDJJVoTx7s",
        "text": "",
        "created_utc": 1674376833,
        "upvote_ratio": 1.0
    }
]