[
    {
        "title": "Weekly \"What is my religion?\" discussion",
        "author": "RRModPostBot",
        "url": "https://www.reddit.com/r/religion/comments/10cz8l5/weekly_what_is_my_religion_discussion/",
        "text": "Are you looking for suggestions of what religion suits your beliefs?\nOr maybe you're curious about joining a religion with certain qualities but don't know if it exists?\nOnce a week, we provide an opportunity here for you to ask other users what religion fits you.",
        "created_utc": 1673827202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hell and evil",
        "author": "Full_Expression7155",
        "url": "/r/DeepThoughts/comments/10cxx3o/hell_and_evil/",
        "text": "",
        "created_utc": 1673823925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you only help people if they join your religion?",
        "author": "Fabulous_Caramel6095",
        "url": "https://www.reddit.com/r/religion/comments/10cx4l1/why_do_you_only_help_people_if_they_join_your/",
        "text": "In my village in India, my grandmother told me that there is a lot of missionaries there now trying to \"recruit\" people into joining their religion. I won't say which religion these missionaries are a part of. What they will do is go to the poor, and give them food. They will do so for 2-3 days. And after, they will stop. They will however, continue giving them aid if they join their religion. Because of this, a lot of people in our village, mainly the poor, have changed their religion now, in order to get food.\n\nMy question to you is , why does it have to be like this?  Does it really represent your beliefs? That you will only help people if they become christian/jew/muslim/hindu whatever? I thought religion was supposed to be nice. This is not nice. I don't think this is what your god wants. Is this what you want?",
        "created_utc": 1673821994,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some arguments for a loving god?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10cwi2e/what_are_some_arguments_for_a_loving_god/",
        "text": "Hypothetically if god exists.\n\nThe problem of evil addresses that god is not loving.\n\nHowever, what are some arguments that God may be loving or good?",
        "created_utc": 1673820462,
        "upvote_ratio": 1.0
    },
    {
        "title": "The great harlot on the back of the wild beast",
        "author": "stimpf71",
        "url": "https://www.reddit.com/r/religion/comments/10cw92w/the_great_harlot_on_the_back_of_the_wild_beast/",
        "text": "Does anyone have an interpertation of this scripture?",
        "created_utc": 1673819882,
        "upvote_ratio": 1.0
    },
    {
        "title": "A grandeza de Deus",
        "author": "CurrencyOk3885",
        "url": "https://youtube.com/shorts/8_0RvIVZRkk?feature=share",
        "text": "",
        "created_utc": 1673819204,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some arguments for a loving god?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10cvxbg/what_are_some_arguments_for_a_loving_god/",
        "text": "Hypothetically if a god exists.\n\n‘The problem of evil’ addresses that god is not loving.\n\nHowever, what are some arguments that God may be loving or good?",
        "created_utc": 1673819086,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are arguments for a loving god?",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/religion/comments/10cvvxa/what_are_arguments_for_a_loving_god/",
        "text": "[removed]",
        "created_utc": 1673818986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gênesis 10 a origem das nacoes",
        "author": "CurrencyOk3885",
        "url": "https://youtu.be/DEZrlJ8t9Tk",
        "text": "",
        "created_utc": 1673818833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who here uses 3d scans/3d models of real artifacts for any of their practice",
        "author": "DeathForever3",
        "url": "https://www.reddit.com/r/religion/comments/10cvru4/who_here_uses_3d_scans3d_models_of_real_artifacts/",
        "text": "With the rise of 3d printing and 3d scanning, I was wondering who here has thought or does use scans of real artifacts to add to your practice. For example, for me, my altar to my religion is mostly 3d print items, but 95% of the items are real scans of real artifacts.  Here are some old pics of [my altar](https://imgur.com/a/FmGQllH) if you are wondering what it looks like",
        "created_utc": 1673818707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Os livros banidos da biblia",
        "author": "CurrencyOk3885",
        "url": "https://www.reddit.com/r/religion/comments/10cvfvo/os_livros_banidos_da_biblia/",
        "text": "[removed]",
        "created_utc": 1673817916,
        "upvote_ratio": 1.0
    },
    {
        "title": "O temor a Deus",
        "author": "CurrencyOk3885",
        "url": "https://www.reddit.com/r/religion/comments/10cvemu/o_temor_a_deus/",
        "text": "[removed]",
        "created_utc": 1673817833,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally drank communion wine in a Catholic church, but I’m Lutheran. Now I feel like a fool.",
        "author": "Adept_Amoeba_5482",
        "url": "https://www.reddit.com/r/religion/comments/10cvc41/i_accidentally_drank_communion_wine_in_a_catholic/",
        "text": "[removed]",
        "created_utc": 1673817662,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is it that some atheists dont understand about belief-faith",
        "author": "lol1234522117xz",
        "url": "https://www.reddit.com/r/religion/comments/10cuyyt/what_is_it_that_some_atheists_dont_understand/",
        "text": "[removed]",
        "created_utc": 1673816806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hindu Muslim divide",
        "author": "InflationDry3749",
        "url": "https://www.reddit.com/r/religion/comments/10cuiqi/hindu_muslim_divide/",
        "text": "[removed]",
        "created_utc": 1673815778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell me what year and especially country/culture/religion this ceremony with Pope John Paul 2 was? Tried google but can't find or identify it anywhere. Curious what the \"drink\" in the bowl is, etc.",
        "author": "jasonbondpicksreview",
        "url": "https://v.redd.it/1g1yjhwap9ca1",
        "text": "",
        "created_utc": 1673814828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a religion where Heaven is included but not Hell?",
        "author": "Potential-Law-174",
        "url": "https://www.reddit.com/r/religion/comments/10ctjss/is_there_a_religion_where_heaven_is_included_but/",
        "text": "I was wondering if any religion like this exists. Let me know!",
        "created_utc": 1673813466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Heaven real?",
        "author": "Potential-Law-174",
        "url": "https://www.reddit.com/r/religion/comments/10csxvt/is_heaven_real/",
        "text": "I know that it’s a very complicated question, but try to give it a complete answer please 🙏",
        "created_utc": 1673812034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studying a religion will help with depression?",
        "author": "NotMarilynMonroeXO",
        "url": "https://www.reddit.com/r/religion/comments/10csfp1/studying_a_religion_will_help_with_depression/",
        "text": "Will studying a religion help with my depression? I was possibly thinking of studying one… Have any of you done this and recommend it?",
        "created_utc": 1673810820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anything better than Pascals wager? I think PW is too simplified.",
        "author": "catboy519",
        "url": "https://www.reddit.com/r/religion/comments/10cr6ck/is_there_anything_better_than_pascals_wager_i/",
        "text": "Pascals wager seems to assume there is either one possibly true religion or none. It also seems to assume its like a 50% chance. But the problem I have with this is:\n\n1. There are multiply religions\n2. The chance for the existance of God, or any specific religion, is not 50% but its rather an unknown probability.\n3. If a religion requires you to do something in order to avoid punishment, another religion might punish you for exactly that.\n\nSo as agnostics, when we know a religion could be fully true, or maybe multiple religions could be fully true as long as they dont contradict eachother, what are we supposed to do?\n\nhttps://preview.redd.it/vrxob0jf39ca1.png?width=446&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=7fa87485ec21302c8ae5fe15fae78bfa3d8577d7",
        "created_utc": 1673807859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy world religion day!",
        "author": "BayonetTrenchFighter",
        "url": "https://www.reddit.com/r/religion/comments/10cq8jt/happy_world_religion_day/",
        "text": "FYI,World Religion Day is today (purpose: “to highlight the ideas that the spiritual principles underlying the world’s religions are harmonious, and that religions play a significant role in unifying humanity.”)\n\nWhat are some positive spiritual aspects of your faith or belief that you feel like other people or other faiths could agree with? \n\nWhat spiritual principles are in harmony with other people in humanity?",
        "created_utc": 1673805641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for information",
        "author": "BrokeEngine",
        "url": "https://www.reddit.com/r/religion/comments/10cp29w/looking_for_information/",
        "text": "[removed]",
        "created_utc": 1673802824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit religious warriors",
        "author": "Shizzachan",
        "url": "https://www.reddit.com/r/religion/comments/10coug8/reddit_religious_warriors/",
        "text": "I think the amount of spiteful anti religious people on Reddit are kinda… dumb honestly like I get if you disagree with parts of it but 99% of these people say the same copy and paste responses to peoples beliefs the amount of “The Bible is fucking stupid and irrelevant” I’ve seen is honestly ridiculous, I wish that everyone can accept one another, I know that Christian’s in the last have been horrible and can be bad people like all people can. So please show patients and respect our beliefs, I respect yours and I don’t wanna continue a cycle of hate, for me God is about love and I ask that you spread love, he loves us all and I love all, thank you for your time God bless",
        "created_utc": 1673802307,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does faith manifest?",
        "author": "djdubyah",
        "url": "https://www.reddit.com/r/religion/comments/10cmdlq/how_does_faith_manifest/",
        "text": "12 year old stepson has been attending church with grandma for about a year.  Went and got baptized, now without trying to be jaded, I know attending and even baptism was done solely because he knows that Grandma really, really wants that for him.\n\nI've by and large kept my mouth shut, organized religion and I parted ways in my 20's, I won't bore with my manifesto as to why. I see him struggling as I struggled at his age though.  He is trying to rationalize in this modern age what he is told at church to believe based on faith...  He has so many questions, because of course when he drills down in bible study or with his youth minister on specifics that don't add up, he is told  to have faith. With the tagline, \"what does it hurt to believe?\"  \n\nWow, if only it were that easy!  \n\nWe teach our kids all day long in school, STEM, question everything, research, investigate, learn... and then Sunday, shh, don't question, just believe, baby.\"  I think that the Christian stance that agnostic's and atheists are lazy is living life with blinders on.  I've heard such as those half-assed a personal relationship with God, fell short, formed an opinion and then never tried further.  My journey could not be any different. \n\n I wanted to believe as I was taught, I wanted what I saw in the people around me.  I wanted that ability to give a hurt or a fear up to a loving God.  To commune with him as my peers did.  That when I lay prostrate on the ground screaming in pain and terror and need up to this caring Father, I would hear that small quiet voice.  I would see his hand in my life, see a miracle, feel blessed, feel loved, safe, comforted.  I didn't want proof; I didn't need a Turin shroud or a petrified piece of the Ark to prove God's existence.   I wanted what I saw others receiving.   How I knew that God existed because I saw how other's faith, their belief in him gave them peace.  \n\nBut then, why has God forsaken me?  What did I do that turned him against me?  Friends would weep, tears streaming, in joy when they would pray, say they felt his presence, felt in-tune, loved.  When I prayed, and I mean on bended knee and white knuckled clasped hands, praying to feel what they felt, to know him, just for a moment, a taste as it were, to know beyond debate there was a holy father, and he was going to make everything ok it felt like I was shouting into a deep, black well... A void, that just ate my pleas, without even the consideration of echoing them back.  After years of trying to commune with my God, I stopped praying. \n\n I consider myself as best defined as a hybrid Christian agnostic and Christian Atheist.  I have kept abreast of secular readings and teachings, because I believe or at least am trying really hard to believe that God does exist and come to terms that I was one of his tests of faith, maybe a side-bet like Job.  That my just rewards for living a life shut out from him will be one of eternal closeness on the other side of the coffin lid.  And there is the rub.  I hope, I do not have faith.  How does one even teach faith?  Was it because my own parents had no belief system, so my first experience at church wasn't until I was 5 or 6?  Had my heathen lifestyle already burnt all bridges with God because I was not spoon-fed him and his miracles alongside Santa and the tooth fairy?  I'll never know, sadly.\n\nThat aside, how do I help guide my son towards faith, and not destroy it for him?  I want for him to experience that rapture and I don't want to lie to him.  I can't give him the same speech he hears at church that it's better to be safe then sorry.  Faith should consist of more than 'believe or consequence', or as a band-aid to gloss over glaring inconsistency. Faith shouldn't mean the opposite of science.  The age of these kids just accepting what they are told by an adult is done.  When the entire world sits there as a website or app on phone, hearing a parable about the benefits of following the golden rule or that before history was properly documented there might have been some real magic on this earth.  And not to despair, even though God turned off his mic 2,000 years ago, and more human souls are alive then have died ever from Adam on, he still cares for and loves you specifically.\n\nBut again, John 7:17 told me if I would do his will, I would know Him.  So maybe I just didn't have the true grit of a handfast Christian to doggedly pursue as only those worthy of his embrace are. If I know anything after 40 years on this earth, it's that I know nothing at all.  \n\nThanks for reading if you did so, and would love to hear others if they can help me understand really anything in this life.",
        "created_utc": 1673796159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the different religions of the world really helpful?",
        "author": "chowto",
        "url": "https://www.reddit.com/r/religion/comments/10cld39/are_the_different_religions_of_the_world_really/",
        "text": "My worldly experiences have brought me to a firm belief in God's existence.  Seeing his plan play out in my life has convinced me that he is very personal and that he loves me.\n\nExploring religion, on the other hand, has filled me with skepticism that I will ever understand him in this life.  In fact, trying to understand religions seem to take me further away from that understanding.\n\nHow can you begin to understand God if you are too busy trying to understand someone else's understanding of him?",
        "created_utc": 1673793413,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the Quran say about moderate/progressive Islam?",
        "author": "Stippings",
        "url": "https://www.reddit.com/r/religion/comments/10cl4ok/what_does_the_quran_say_about_moderateprogressive/",
        "text": "[removed]",
        "created_utc": 1673792754,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created Notion template to study Islam easily!",
        "author": "sonyabigdreamer",
        "url": "https://www.reddit.com/r/religion/comments/10ckq63/i_created_notion_template_to_study_islam_easily/",
        "text": "[removed]",
        "created_utc": 1673791618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Severe moral dilemma, need opinions.",
        "author": "heresmyusernam3",
        "url": "https://www.reddit.com/r/religion/comments/10cjyil/severe_moral_dilemma_need_opinions/",
        "text": "If you have hard proof that the major religions are based upon a lie and have a smoking fun ti prove the Roman empire lied behind its organization hiding behind their own foreign God worship, would it be wrong to show people? \n\nI've dealt with this for 3 years now. The two people I showed it to went through suicidal tendencies for the past year and can't get a firm hold of what reality is. \n\nReligion is in our code of survival, it will push us to survive moments we otherwise wouldn't. Gives will and determination where the consciousness would otherwise be silent. \n\nI don't want to prove Christianity false for example and lead to tons of suicides. Does this make sense?",
        "created_utc": 1673789486,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Adam and Eve fought,",
        "author": "RahulNobel",
        "url": "https://www.reddit.com/r/religion/comments/10cjrn6/if_adam_and_eve_fought/",
        "text": "would it be a world war?",
        "created_utc": 1673788946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impact of communist rule on religion in different countries",
        "author": "-qc-",
        "url": "https://www.reddit.com/r/religion/comments/10ci3z4/impact_of_communist_rule_on_religion_in_different/",
        "text": "[removed]",
        "created_utc": 1673783917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't God just come down here and reveal himself?",
        "author": "mskigzzpha",
        "url": "https://www.reddit.com/r/religion/comments/10ci2ps/why_cant_god_just_come_down_here_and_reveal/",
        "text": "[removed]",
        "created_utc": 1673783804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch the video, and tell me what you think",
        "author": "Other_Welder7772",
        "url": "https://www.reddit.com/r/religion/comments/10ci1ml/watch_the_video_and_tell_me_what_you_think/",
        "text": "[removed]",
        "created_utc": 1673783707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Winged Ma'at kneeling over lilies of Upper Egypt. Scene from tomb of Ramses III. (KV11)",
        "author": "ptahhotep_",
        "url": "https://i.redd.it/eaiu8egv48ca1.jpg",
        "text": "",
        "created_utc": 1673777842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Christian’s so adamant on bringing attention to their beliefs?",
        "author": "Cautious-Event-490",
        "url": "https://www.reddit.com/r/religion/comments/10cdtb1/why_are_christians_so_adamant_on_bringing/",
        "text": "Idk if it’s just a southern thing, but Christian’s appear to love being loud with their beliefs. I don’t mean any disrespect and I get that everyone has their own beliefs, of course. However, for example, my office manager constantly plays her gospel music fairly loudly in our small office. (Southern gospel that sounds like it was recorded in the bathroom of a single wide trailer).. she’s quick to bring her “lord and savior Jesus Christ” up in anything, she keeps on and on telling me to come to her church, she sends out group emails of scripture and “Christian quotes”, and she’s constantly making statements at work such as “that was the lord” or “Jesus told me to do that”…. \n\n\nI mean.. am I wrong for thinking it’s inconsiderate and boastful? \n\nIn my opinion, if someone was Islam, agnostic, atheist, Pentecostal, Buddhist, etc. and did what she does everyday, I feel like people would be outraged or have something to say OR feel uncomfortable.. \n\nAll my life, It has made me uncomfortable when people persistently push their religion on me or continuously ask me to go to church. Just leave people be. \n\nA lot of them say “I am spreading the lords message” or they think by doing so they’ll convince you to go to church. Cool, maybe some do. But for me, I just want consideration and to be left alone.",
        "created_utc": 1673768085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Christianity",
        "author": "Pixuli",
        "url": "https://www.reddit.com/r/religion/comments/10cd0x0/question_about_christianity/",
        "text": "Are there any forms of Christianity or lines of thought within Christian traditions or scholarship that: \n\n1. View Jesus as the son of God and/or God on Earth.\n\n2. View the writings of the Old Testament as something Jesus used to teach from, and not as true facts.\n\n3. View the writings of the New Testament as accounts written by people and are not necessarily accurate. \n\n4. View the rise of early Christianity as people dealing with the momentous situation of witnessing the son of God/God in Earth.",
        "created_utc": 1673765228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acadmic studies on the validity of the Quoran (Koran ) ?",
        "author": "Shangoinhood",
        "url": "https://www.reddit.com/r/religion/comments/10ccymp/acadmic_studies_on_the_validity_of_the_quoran/",
        "text": "When looking for academic studies into the validity of biblical claims - there seems to be no shortage of material to read. Why can find academic studies into the Quoran by both muslims and non muslims. Alot of the material I come across so far is by people of the faith - so the works are non impartial.",
        "created_utc": 1673765005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the Christian god and Jesus do nothing when their faith started abusing his supposed teachings? Why has he still not stepped in and stopped Christian hate?",
        "author": "Annaneedsmoney",
        "url": "https://www.reddit.com/r/religion/comments/10cav8b/why_did_the_christian_god_and_jesus_do_nothing/",
        "text": " ***I REALLY WANT SOME ANSWERS AND DEBATES ON THIS! IV BEEN ASKING BUT CANNOT EVEN GET DEBATES OR GOOD RELIABLE ANSWERS FROM PEOPLE ON THIS.***\n\nBefore I start this is not me trying to demonize Christianity.  Even Christians can admit that the early church's actions were bad and nor am I trying to say all Christians do these things. im not saying Christianity is a bad religion but the questions im asking deserve to be answered. These are mostly questions not me saying that the religion is bad. I want to clear this up before I start.\n\nnow then..\n\nIm a practicing Pagan and in my time working with the gods Iv noticed one thing. When you work with a god you allow them into your heart and thus they have influence over your life to a point. They can help you see things differently and help you understand things you may not understand before. Many Christians claim they have allowed Jesus into their hearts and they see the world so much differently now that hes with them... But then why would christians go on and proceed to do Violant things and use their faith as a leverage to continue spreading abuse? More importantly why do most (Not all so im not including you if you do not do so) Christians try to convert you to their faith even if you do not reside with it?\n\nIf the Bible is in fact the most perfect word of god with 0 contradictions (Like alot of apologists want to say) then why was it able to be abused? Why would god not make his word perfect enough to where it couldn't be abused? Why would he make it so open to interpretation that it was able to divide the early church and cause the catholic vs Baptist war? Why was the catholic reformation even needed in the first place if the word is so perfect? All of this would soon lead to the revolutionary war. Shouldn't none of these things have happened if the words were perfect? But yet all of these people claimed they were sons of god... this doesnt make sense. We cant say they werent Christian because saying such would almost debase modern Christianity itself sense most of Christian  beliefs stem from them. to say early Christians are wrong, would mean no one is actually practicing Christianity (especially sense the belief was very different in the beginning).  \n\nI do Know a rebuttal to this that alot of apologists want to use. \"The devils influence is stronger then gods\" (Which is kinda bad sense it imply satan is stronger then god) Or \"god gave us free will and this is why we did it.\" I personally say that is not an excuse. God is all powerful (according to christians) Shouldn't he have had the power to step in? Shouldn't he have the power to stand up for the rights of other religious people? I mean if you assume Noahs ark is a true story we see he wiped out millions just because they disobeyed him. Why didnt he do that to a extent with his own faith? Isnt that worse? Knowing your gods word yet still changing it? Why didnt he at least protect the innocents of other faiths? It was his faiths fault that other faiths were attacked and killed (Egyptians, pagan even jewish people). Even if you want to say that Christians can be separated, god should have stood up for the other people who practiced other teachings. He loves the world right? Then even if people choose not to worship him he would still protect them from his own people wouldnt he? If not then thats not love. A mother who actually loved her son would stand in front of a bullet if it ment she would save him, even if that son hated her. If god loved the world he would do the same. Yet he didnt and watched and witches and even people of his own faith were burned and stoned. Surly he could have sent a rain storm so hard it quelled the fire and protect those who did not follow him? Freak accidents happen all the time, why do nothing when other are under attack? \n\nWhat of modern Christianity? All these 2. billion people who claim to be christian and yet we have still the same problems of separation between christians and christians, and christians vs the rest of the world. But it makes no sense how a religion that was based our unity (supposed) can be turned into this. Or how a all powerful god would allow this to happen. I understand people want to put the blame on humanity and off of god but this is gods fault. Its one thing when its something we do like climate change but its another thing when its his people that caused the problem.\n\nI want other Christians/atheists interpretation of these things and to hear their explanations for these questions and why they think it happened.\n\nOnce Again I dont want to come off a disrespectful to individuals or Christians, I just want to be able to hear what others have to say on these things. Iv been trying to get answers and debate people on these things, but yet I cannot get anywhere with these questions. Its as if they are not questions to be asked.  thanks so much for any replys!",
        "created_utc": 1673758150,
        "upvote_ratio": 1.0
    },
    {
        "title": "best youtube channels about religion?",
        "author": "snowe410",
        "url": "https://www.reddit.com/r/religion/comments/10c9zid/best_youtube_channels_about_religion/",
        "text": "Any good yt channels that discuss religion in general?",
        "created_utc": 1673755367,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the significance of Al Aqsa mosque for Muslims?",
        "author": "ZoologyDarwin",
        "url": "https://www.reddit.com/r/religion/comments/10c9ssg/what_is_the_significance_of_al_aqsa_mosque_for/",
        "text": "The Al Aqsa mosque/Temple Mount is a point of huge contention between Jews &amp; Muslims, as it is the site of the destroyed 2nd temple (the holiest site in Judaism) &amp; the Dome of the Rock building (where Muhammad allegedly ascended to heaven). The site is a frequent site for clashes between Jews &amp; Muslims who both want to pray there.\n\nHowever there is a 3rd religious site located on the Temple Mount that I don't know much about, the Al Aqsa mosque. What is it's significance to Muslims? Supposedly it's the 3rd holiest site in Islam &amp; it's clearly important to many Muslims since there are a lot of protests by Palestinian Muslims there. I don't know much about the place other than the fact that it sits on top of our (Jewish) Temple Mount.",
        "created_utc": 1673754808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring the Cognitive Bases of God the Father and Taoism",
        "author": "Real-External392",
        "url": "https://www.reddit.com/r/religion/comments/10c7uca/exploring_the_cognitive_bases_of_god_the_father/",
        "text": "Exploring the cognitive bases of the concepts of God the Father, and Taoism. Compatible with atheism and theism. [https://youtu.be/bQp6vV9y\\_x8](https://youtu.be/bQp6vV9y_x8)",
        "created_utc": 1673749066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on god punishing disobedience?",
        "author": "BayonetTrenchFighter",
        "url": "https://www.iranintl.com/en/202301132434",
        "text": "",
        "created_utc": 1673747576,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the brown evil eye mean? – Ask Saint",
        "author": "asksaint",
        "url": "https://asksaint.com/what-does-the-brown-evil-eye-mean/",
        "text": "",
        "created_utc": 1673741367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird how often people expect religious people to conform to their idea of religiosity",
        "author": "Best-Ad1187",
        "url": "https://www.reddit.com/r/religion/comments/10c4ch5/weird_how_often_people_expect_religious_people_to/",
        "text": "[removed]",
        "created_utc": 1673739597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear of an evil god or evil entity existing. Please help!!!",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10c1wfq/fear_of_an_evil_god_or_evil_entity_existing/",
        "text": "Hi there. I’ve been suffering from religious OCD now. I’m seeing a therapist at the moment and it’s going great. I just feel like this post would be relevant here. \n\nI’m just fearing that there is an evil god or entity that created us, wants us to suffer and will send us to hell after we die. No matter what we do, we end up in hell. \n\nIf we take religion out of the question, what if god exists and he is pure evil and a sadist, in which he wants us to suffer, by creating a hell.\n\nThis may sound irrational, but I was wondering how I can rationalise these thoughts, and live my life in peace.\n\nI appreciate you reading this \n\nHave a great day.",
        "created_utc": 1673734259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear of an evil god or evil entity existing. Please help!!!",
        "author": "_Malinatusik",
        "url": "https://www.reddit.com/r/religion/comments/10c1um1/fear_of_an_evil_god_or_evil_entity_existing/",
        "text": "[removed]",
        "created_utc": 1673734186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matthew 5:13 You are the salt of the Earth",
        "author": "Provizion1982",
        "url": "https://youtu.be/p1s6rM3KoAo",
        "text": "",
        "created_utc": 1673729398,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rak Chazak our ancient Hebrew war cry. Chapters are in the description.",
        "author": "Provizion1982",
        "url": "https://youtu.be/yXC6oFtBrXU",
        "text": "",
        "created_utc": 1673728897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it against any religions to put the Torah, Quran, and Catholic bible next to each other",
        "author": "whynotcorb",
        "url": "https://www.reddit.com/r/religion/comments/10byggl/is_it_against_any_religions_to_put_the_torah/",
        "text": "[removed]",
        "created_utc": 1673728064,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Dying 8-year-old Question of Mine",
        "author": "xylolene",
        "url": "https://www.reddit.com/r/religion/comments/10bxmc5/a_dying_8yearold_question_of_mine/",
        "text": "[removed]",
        "created_utc": 1673726001,
        "upvote_ratio": 1.0
    },
    {
        "title": "In eastern religions.",
        "author": "stimpf71",
        "url": "https://www.reddit.com/r/religion/comments/10bxhr5/in_eastern_religions/",
        "text": "In the west, there are no jinn, or asura, vampires or fallen, only psychiatris who function as skeptics.",
        "created_utc": 1673725683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noob here: Is this a good case for free will?",
        "author": "Global-Ad2310",
        "url": "https://www.reddit.com/r/religion/comments/10bxebv/noob_here_is_this_a_good_case_for_free_will/",
        "text": "[removed]",
        "created_utc": 1673725448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody follow Christianity without following the Bible?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10bwayw/does_anybody_follow_christianity_without/",
        "text": "Does anybody here consider themselves a Christian without following the Bible? I mean by this that Christianity existed before the compilation of the Bible, which is itself technically an arbitrary collection of books; there are many Christian texts, and perhaps even Jewish, which do not feature in your standard Bible. On Wikipedia I can see many thirty or more different Gospels listed at least! Imagine how unwieldy the Bible would be if all known Christian and Jewish texts were included? Wow. A lot of division among Christians I think stems from interpretation of the Bible, and it's also what puts a lot of people off from being Christian--instruction manual not clear!!! Some part of me thinks whatever Jewish/Christian documents are the oldest are perhaps the safest to trust--that you should play it safe and go for the simplest Christianity. You could say Tolstoy with his 'Gospel in Brief' or C.S. Lewis with his 'Mere Christianity' both attempt this.\n\nI know 'sola scriptura' is a protestant thing, but 'orthodox Christianity' still seems heavily wed to the Bible; a lot of the songs, for example, I believe are directly from the Bible. Could Christianity exist without the Bible? Is a pre-Biblical Christianity possible today, or is it lost to the sands of time--or subject to even more controversy over which texts to trust, which is in effect the same situation?\n\nI know there have been various Christians throughout history who have either ignored the Old Testament, ignored writings by Apostle Paul, among other things; not to mention orthodox Christian sects seem to have disagreements on what exactly should be in the Bible. Luther didn't like certain bible books, etc. So it seems rather up to the individual, or intense scholarly debate, which books of the bible to pay attention to. It's curious to me how the 'Bible' is even spoke of as a unitary thing. It half seems to me like individuals should take it on a book by book matter, even perhaps considering the non-standard (perhaps even 'heretical') Christian and Jewish writings too. Instead, people just seem to go along with what their church hands them. You could conceivably own, for example, only five books of the Bible and be a 'Christian', and discard the rest as trivial, folklore, ethnic mythology, excessive, and so forth. I think there's even a term in theology for this view that certain Biblical books as 'excessive' or 'trivial' and shouldn't really be in the canon.\n\nNot sure where I'm going with this but well it's a Saturday evening and I follow wherever my curiosity leads me...\n\nThe floor is yours :)",
        "created_utc": 1673722796,
        "upvote_ratio": 0.99
    },
    {
        "title": "Trust in the Lord| Daily Bible Verse | 10.01.23| John 15:5... #youtubesh...",
        "author": "Bella_Nella2019",
        "url": "https://youtube.com/shorts/M7-V4FyefRI?feature=share",
        "text": "",
        "created_utc": 1673717544,
        "upvote_ratio": 1.0
    },
    {
        "title": "A.A. Milne on the Old Testament",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10bqomv/aa_milne_on_the_old_testament/",
        "text": "I just found this quotation from A.A. Milne, the English author of much beloved Winnie the Pooh (beloved by young me, anyhow), and I thought it might be an interesting topic of discussion:\n\n'The Old Testament is responsible for more atheism, agnosticism, disbelief – call it what you will – than any book ever written; it has emptied more churches than all the counter-attractions of cinema, motor bicycle and golf course.'\n\nI know what my own thoughts are on this matter, but I thought it would be interesting to hear other people's views on this?",
        "created_utc": 1673709021,
        "upvote_ratio": 0.99
    },
    {
        "title": "(Of course this is impossible) but if your religion were to be proven objectively wrong, which religion would you convert to?",
        "author": "BeginningExtent6455",
        "url": "https://www.reddit.com/r/religion/comments/10bqgio/of_course_this_is_impossible_but_if_your_religion/",
        "text": "Or if you're atheist, if it were to be proven that God exists,  who do you hope is right about God?",
        "created_utc": 1673708450,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the etiquettes at your place of worship like? what are the do's and don'ts?",
        "author": "shreyasiyer__",
        "url": "https://www.reddit.com/r/religion/comments/10bq8wl/what_are_the_etiquettes_at_your_place_of_worship/",
        "text": "Title, just curious.",
        "created_utc": 1673707920,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the Quran say about moderate/progressive Islam?",
        "author": "Pliece",
        "url": "https://www.reddit.com/r/religion/comments/10bq1f5/what_does_the_quran_say_about_moderateprogressive/",
        "text": "[removed]",
        "created_utc": 1673707368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evangelio de Hoy Sabado 14 de Enero de 2023 en el cenaculo.",
        "author": "PrayintheCenacle",
        "url": "https://www.reddit.com/r/religion/comments/10bobh0/evangelio_de_hoy_sabado_14_de_enero_de_2023_en_el/",
        "text": "[removed]",
        "created_utc": 1673702518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evangelio de Hoy Sabado 14 de Enero de 2023 en el cenaculo.",
        "author": "PrayintheCenacle",
        "url": "https://www.reddit.com/r/religion/comments/10bo8bq/evangelio_de_hoy_sabado_14_de_enero_de_2023_en_el/",
        "text": "[removed]",
        "created_utc": 1673702257,
        "upvote_ratio": 1.0
    },
    {
        "title": "The foundation of Christianity is based on lady having an affair, and lying to her husband about being a virgin.",
        "author": "pixel-destroyer",
        "url": "https://www.reddit.com/r/religion/comments/10blr9s/the_foundation_of_christianity_is_based_on_lady/",
        "text": "That is all.",
        "created_utc": 1673693585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for the name of a particular religious (Abrahamic) female head covering, and to no luck. It seems to be a very simple, draped veil. May someone please be kind enough to help? 🙏💕",
        "author": "rox_n_roses233",
        "url": "https://www.reddit.com/r/religion/comments/10blpny/looking_for_the_name_of_a_particular_religious/",
        "text": "[removed]",
        "created_utc": 1673693417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logan Paul Says He Was 'GODSMACKED' for criticizing #God: REACTION &amp; Discussion",
        "author": "funky_travel_vlogs",
        "url": "https://www.youtube.com/watch?v=JEFkuXRtV-o",
        "text": "",
        "created_utc": 1673692392,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Divine Paradox: How Religions Can Go Against the Will of God",
        "author": "ijkortez",
        "url": "https://medium.com/@rayluxe/the-divine-paradox-how-religions-can-go-against-the-will-of-god-61858c371509",
        "text": "",
        "created_utc": 1673687500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could it be possible that an evil god or entity exists and sends us to hell for the sake of it?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10biasr/could_it_be_possible_that_an_evil_god_or_entity/",
        "text": "Could it be possible that an evil god or entity exists and sends us to hell for the sake of it?\n\nHi there. I have been pondering over the existence of God for the past few weeks and this question has been on my mind.\n\nTake religion out of the context, could it be possible or likely that an evil god or evil entity exists out there? Who created us and wants us to suffer and sends us to a hell after death? \n\nWhat is the likelihood of this happening?\n\nWould really like to you hear your thoughts.\n\n\nHave a blessed day guys✌️",
        "created_utc": 1673680375,
        "upvote_ratio": 1.0
    },
    {
        "title": "deeply confused about polytheism",
        "author": "Additional-Voice-999",
        "url": "https://www.reddit.com/r/religion/comments/10bh8nq/deeply_confused_about_polytheism/",
        "text": "So when we think of the monotheistic God, we usually think of some object or area outside the universe. Is this the same for polytheistic gods? Or when there is a river goddess are we actually referring to the river and just giving it human form in our minds so we can relate to it?\n\nHelp me out guys!",
        "created_utc": 1673676588,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think of these sayings from the Christ and Saint Peter?",
        "author": "ziamal4",
        "url": "https://www.reddit.com/r/religion/comments/10bg7cs/what_do_you_think_of_these_sayings_from_the/",
        "text": "\"Enter through the narrrow gate for wide is the gate and broad is the road that leads to destruction, and many enter through it. But small is the gate and narrow the road that leads to life, and only a few find it.\"\n\n\"Many are called few are chosen\"\n\n\"And if the rightous is scarcely saved what will become of the ungodly and the sinner?\"",
        "created_utc": 1673673158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is islam or christianity correct",
        "author": "Kyojinattack",
        "url": "https://www.reddit.com/r/religion/comments/10bg28e/is_islam_or_christianity_correct/",
        "text": "I'm a Christian, and I'm worried that islam is correct and that I will go to hell. Or it could be that Christianity is right. Which is correct and based on that, will I go to hell or heaven?",
        "created_utc": 1673672702,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK inclusion of other religions?",
        "author": "GoatFluffy6275",
        "url": "https://www.reddit.com/r/religion/comments/10bfl0l/uk_inclusion_of_other_religions/",
        "text": "[removed]",
        "created_utc": 1673671210,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I am confirmed catholic do I have to be re confirmed and baptized as orthodox to get married at a Orthodox Church",
        "author": "kanyenorth76589",
        "url": "https://www.reddit.com/r/religion/comments/10bdth3/if_i_am_confirmed_catholic_do_i_have_to_be_re/",
        "text": "[removed]",
        "created_utc": 1673665794,
        "upvote_ratio": 1.0
    },
    {
        "title": "JIHAD - HOLY WAR",
        "author": "Martiallawtheology",
        "url": "https://www.reddit.com/r/religion/comments/10bckzn/jihad_holy_war/",
        "text": "[removed]",
        "created_utc": 1673662166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supremacy is to God, only a god appointed man should be allowed to rule.",
        "author": "The_Gnosis_Show",
        "url": "https://www.reddit.com/r/religion/comments/10bcgbr/supremacy_is_to_god_only_a_god_appointed_man/",
        "text": "[removed]",
        "created_utc": 1673661794,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Surprising Facts About Islam! SHOCKING Reaction",
        "author": "Comprehensive-Ad9988",
        "url": "https://youtu.be/FUGuhJFvrKY",
        "text": "",
        "created_utc": 1673660468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please help me and not ignore me. What happens first? The third temple gets built and sacrifices are brought back and the Antichrist reveals himself or the six trumpets of revelation are blown and the events happen and then the temple is built and the two witnesses come?",
        "author": "Love27373737",
        "url": "https://www.reddit.com/r/religion/comments/10bb3uv/can_someone_please_help_me_and_not_ignore_me_what/",
        "text": "[removed]",
        "created_utc": 1673658031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Celtic Spirituality 101",
        "author": "MikefromMI",
        "url": "/r/CelticSpirituality/comments/zzalfv/celtic_spirituality_101/",
        "text": "",
        "created_utc": 1673657162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could it be possible that an evil god or entity exists and sends us to hell for the sake of it?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10barm5/could_it_be_possible_that_an_evil_god_or_entity/",
        "text": "Hi there. I have been pondering over the existence of God for the past few weeks and this question has been on my mind.\n\nTake religion out of the context, could it be possible or likely that an evil god or evil entity exists out there? Who created us and wants us to suffer and sends us to a hell after death? \n\nWhat is the likelihood of this happening?\n\nWould really like to you hear your thoughts.\n\n\nHave a blessed day guys✌️",
        "created_utc": 1673657091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why ask Saints for Prayer?",
        "author": "asksaint",
        "url": "https://asksaint.com/why-ask-saints-for-prayer/",
        "text": "",
        "created_utc": 1673656338,
        "upvote_ratio": 1.0
    },
    {
        "title": "PITCH BLACK FAITH: Exploring Belief in Pitch Black &amp; The Chronicles of Riddick",
        "author": "ARandomTopHat",
        "url": "https://youtu.be/uZEaFTYMlvU",
        "text": "",
        "created_utc": 1673655920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it compatible to hold on to doctrine and remain non-religious?",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/religion/comments/10b7oia/is_it_compatible_to_hold_on_to_doctrine_and/",
        "text": "For example, how about assuming a god who receives the faith of the human race?",
        "created_utc": 1673649154,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Go to Hell in Every Religion (Detailed Instructions)",
        "author": "TwinTowerGone",
        "url": "https://youtu.be/4pkWGvTFfSY",
        "text": "",
        "created_utc": 1673648922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone transcribe what this religious note means? A worker put this in my sisters glove compartment after detailing her car and it was just really random and weird. Let me know if you have any ideas as to why someone would do that and what the meaning behind it is.",
        "author": "bmaebe",
        "url": "https://i.redd.it/b6dp68yxbxba1.jpg",
        "text": "",
        "created_utc": 1673647045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Give me evidence that your god exists.",
        "author": "CrabCute",
        "url": "https://www.reddit.com/r/religion/comments/10b699q/give_me_evidence_that_your_god_exists/",
        "text": "[removed]",
        "created_utc": 1673645683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we have imagination? Why do I yearn for the fantastical?",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/10b53sd/why_do_we_have_imagination_why_do_i_yearn_for_the/",
        "text": "Why do we have imagination? Ever since I became an adult I have yearned for magic. As a child it was so easy to just dip into imaginary worlds. And I can still do it, but I always know that it is not real real. I would love little more than for a little elf to visit me, or a domovoy to be staring at me from out of his beard from the corner of the room, or for a dragon to wink at me from some rocky outcrop above some mountainous wooded valley... I feel I will go the grave with this yearning. What is the point of such an insatiable desire? Why do we have folk tales which tell of strange beings living among us almost invisibly, and yet sometimes quiet apparently? What is the point? Why do we like lying to ourselves?\n\nI love the beauty within nature, etc.—and actually feel wrong wroting 'etc.'—, but I can't entirely budge this interest, this little urge for magical things. And I'm not the only one. I seem to be a part of a tradition of chronically immature men.\n\nMaybe the original 'dreamers' actually had schizophrenia, as I spoke with one woman with schizophrenia and she said one time she did see an elf. But I don't. And many don't. And yet we in our hearts still are drawn to these mythical worlds. Why? Why is it like we both are made for this world and yet are not? It feels stupid, to have an urge for something not seemingly there.\n\nDoes anybody have any thoughts on this? Similar struggle? Or can you tell me how to be away with the fairies, ha ha?\n\nI enjoy reading fantasy fiction, but I struggle to reconcile that affection with sensible reality, which almost makes me want to 'grow out' of my fantastical urge and take more interest in the sensible world.",
        "created_utc": 1673642923,
        "upvote_ratio": 0.99
    },
    {
        "title": "The Educational Identity Formation of Jehovah’s Witnesses, is an academic paper discusses those raised with the notion that higher ed. was unnecessary/detrimental, formed educational identities that rejected their talents, suppressed their motivation, and foreclosed opportunities for autonomy...",
        "author": "Long_Race5842",
        "url": "https://doi.org/10.1080/15507394.2022.2102875",
        "text": "",
        "created_utc": 1673642399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do dreams have meanings?",
        "author": "_Uhtceare_",
        "url": "https://www.reddit.com/r/religion/comments/10b4a69/do_dreams_have_meanings/",
        "text": "What are your thoughts on dreams?",
        "created_utc": 1673640908,
        "upvote_ratio": 1.0
    },
    {
        "title": "ocd promises to God/Gods",
        "author": "icesnowfrost",
        "url": "https://www.reddit.com/r/religion/comments/10b3u4m/ocd_promises_to_godgods/",
        "text": "Some years ago, under ocd anxiety and pressure, I was forced to make a promise to God/Gods about not obeying a certain ocd compulsion. A punishment was asked in case breaking the promise to ensure that I wont do the compulsion. \n\nI think I never did the compulsion but I worry that I may have accidentally not specified under which circumstances the promise is valid.\n\nI never wanted to make the promise but I was forced to say those words because ocd was not leaving me alone. I thought that by making a promise to God/Gods, ocd would leave me alone.\n\nI was using the fear of the punishment to scare my ocd. I think I canceled the promise in the last second but what if God/Gods accepted it? What if I was not specific enough with my words?\n\n\n\nEvery day my life is a nightmare because what if I accidentally break this canceled promise?",
        "created_utc": 1673639837,
        "upvote_ratio": 1.0
    },
    {
        "title": "how does your religion define \"evil\"?",
        "author": "needle-roulette",
        "url": "https://www.reddit.com/r/religion/comments/10b3ofp/how_does_your_religion_define_evil/",
        "text": "how does your religion define \"evil\"?",
        "created_utc": 1673639446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Christianity still apply to these people",
        "author": "FarShirt1946",
        "url": "https://www.reddit.com/r/religion/comments/10b2a26/does_christianity_still_apply_to_these_people/",
        "text": "[removed]",
        "created_utc": 1673636013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Definition of ‘god’, update 4: Revered entity whose metaphysical autonomy transcends ontological individuality.",
        "author": "ReindeerBrief561",
        "url": "https://www.reddit.com/r/religion/comments/10b0tp5/definition_of_god_update_4_revered_entity_whose/",
        "text": "I’ve been working to make a broad literary definition of a god, including God himself. \n\nAfter looking not only at different gods, but different philosophies of god, I think this is the closest I’ve been. I’d appreciate full thoughts, questions, and critiques",
        "created_utc": 1673632506,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Christians try to hurt people that don't to what they want.",
        "author": "LibertyCore",
        "url": "https://www.reddit.com/r/religion/comments/10b07uz/american_christians_try_to_hurt_people_that_dont/",
        "text": "[removed]",
        "created_utc": 1673631000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complexities of the Qur'an",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673629963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hebrews to Negroes audiobook (2-minute clip) #mustlisten",
        "author": "jimmycabo",
        "url": "https://www.reddit.com/r/religion/comments/10azfsb/hebrews_to_negroes_audiobook_2minute_clip/",
        "text": "This portion of worth sharing as it provokes thought. This post isn't intended to persuade you - please share feedback. \n\n[https://youtu.be/OaplAuj\\_9o4](https://youtu.be/OaplAuj_9o4)",
        "created_utc": 1673629125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sikh War Cry - From 1986- After Sikhs &amp; Pilgrims Were Attacked at the Golden Temple By The Indian Gov.",
        "author": "Poop-Blaster-9000",
        "url": "https://v.redd.it/je6to3xxsvba1",
        "text": "",
        "created_utc": 1673628550,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should the human race call the object to which the gods themselves devote their faith?",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/religion/comments/10aye21/what_should_the_human_race_call_the_object_to/",
        "text": "It's just as the title says.\n It is a hypothetical story when God is dedicating his faith to a certain object (α).\n As the title suggests, what do the humans collectively call Mr. α?\n Is Mr. α also a god?\n Or is it a kind's god?\n Or something else?",
        "created_utc": 1673626510,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Thoughts on Spirituality",
        "author": "confuseddreamer1998",
        "url": "https://www.joysoneartomelancholy.com/expression",
        "text": "",
        "created_utc": 1673626382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people have a religion?",
        "author": "Tris-SoundTraveller",
        "url": "https://www.reddit.com/r/religion/comments/10axv65/why_do_people_have_a_religion/",
        "text": "I am trying to understand some things about religion. For now I wanna focus on the why: Why do people have a religion?  What do people see in religion? What makes someone want to believe in it? What does religion do to them? And what does it do for them? \nIf you have anything you want to say, being it a personal opinion (or the one of someone else you know) a personal experience (or one you know about) or anything else about this topic, feel free to share. And before anything, know that I am an agnostic from a catholic-rooted country, so my ignorance might make me say something offensive. If that happens, please tell me, and Ill remove it and apologize (and do whatever else needed)",
        "created_utc": 1673625233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought this was a cool photo, so here you go.",
        "author": "Fractal-Farter",
        "url": "https://i.redd.it/c0veu2myivba1.jpg",
        "text": "",
        "created_utc": 1673625200,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this the right subreddit to ask questions about religion?",
        "author": "Tris-SoundTraveller",
        "url": "https://www.reddit.com/r/religion/comments/10axjgq/is_this_the_right_subreddit_to_ask_questions/",
        "text": "The title is pretty self explanatory, Im kinda new to reddit and want to ask something",
        "created_utc": 1673624418,
        "upvote_ratio": 1.0
    }
]