[
    {
        "title": "If you could ask anything, and have it answered… what would you ask?",
        "author": "1-0-1-0-1binaryants",
        "url": "https://www.reddit.com/r/religion/comments/ymiod0/if_you_could_ask_anything_and_have_it_answered/",
        "text": "What would you do if you could ask any question and have it answered, what would you ask?",
        "created_utc": 1667618144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boardmanism",
        "author": "Neither-Gear-2775",
        "url": "https://www.reddit.com/r/religion/comments/ymhys3/boardmanism/",
        "text": "[removed]",
        "created_utc": 1667615973,
        "upvote_ratio": 1.0
    },
    {
        "title": "The major events in your religion and where those decisions lead you religion",
        "author": "Kratos-the-omnist",
        "url": "https://www.reddit.com/r/religion/comments/ymhu16/the_major_events_in_your_religion_and_where_those/",
        "text": "[removed]",
        "created_utc": 1667615568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Omnism",
        "author": "Kratos-the-omnist",
        "url": "https://www.reddit.com/r/religion/comments/ymgf2z/omnism/",
        "text": "[removed]",
        "created_utc": 1667611493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ecumenical Patriarch Bartholomew on the relationship between man and nature in Abrahamic religions",
        "author": "InternetTraumatized",
        "url": "https://www.reddit.com/r/religion/comments/ymff8o/ecumenical_patriarch_bartholomew_on_the/",
        "text": "From his address to the Summit on Religion and Conservation, Atami, Japan, April 5, 1995.\n\n&amp;#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&amp;#x200B;\n\nWhat role do the Abrahamic faiths ascribe to human beings? The anser is clear, the consequences immense.\n\n&amp;#x200B;\n\nPsalm 8 addresses this question directly:\n\n&amp;#x200B;\n\n\\&gt;I look up at your heavens, made by your fingers, at the moon and the stars you set in place—ah, what is man that you should spare a thought for him, the son of man that you should care for him? Yet you have made him little less than an angel. You have crowned him with glory and splendor, made him lord over the work of your hands, set all things under his feet, sheep and oxen, all these, yes, wild animals too, birds in the air, fish in the sea traveling the paths of the ocean. (Ps. 8:3-8)\n\n&amp;#x200B;\n\nChristianity inherited this tradition, as Jesus shows when he compares the value of human beings to sparrows both loved and cared for by God, though human beings are a hundred times more important (Luke 12:6-7). It is also the case that the sense of human beings being part of a bigger picture, a part of Gods's greater purpose, is to be found in equal strength within both Jewish and Christian texts. For example, in the Torah, in Genesis 9, the covenant with Noah after the flood is not just with Noah and his descendants—the human race—it is with all life on earth. Similarly, the purpose of life, death, and the Resurrection of Christ as St. Paul speaks of it in Romans 8 and in Colossians 1 is not just for human beings but for the sake of all life on earth.\n\n&amp;#x200B;\n\nUltimately, for Judaism, Christianity, and Islam, humanity is the most important, the most significant species, and with this comes responsibilities. Islam expresses this in the notion of humans being khalifas. A khalfa is a vice-regent, someone 6appointed by the supreme ruler to have responsibility over a given area in an empire. The Qur'an (in sura 2, verse 30) uses this phrase as a description of the role of humanity. We have been given great authority by God, but it is to be used only on God's behalf, not for our own ends and ambitions. The Qur'an makes it clear that any abuse of this power, any wanton or wasteful use of the world's natural resources, is repugnant to God and therefore to Islam.\n\n&amp;#x200B;\n\nTwo fundamental consequences emerge from attitudes such as this: The first consequence is the understanding that the world is meant to be used by humans not for their own purpose but as the means whereby they come into relationship with God. If humans change this use into egocentric, greedy exploitation, into oppression and the destruction of nature, then man's own vital relationship with God is denied and refuted, a relationship predestined to continue into eternity.\n\n&amp;#x200B;\n\nThe second consequence is the understanding that the world as a creation of God ceases to be a neutral object for man's use. The world incarnates the word of the Creator, just as every work of art incarnates the word of the artist. The objects of natural reality bear the seal of the wisdom and love of their Creator. They are the word of God calling man to come into dialogue with him.",
        "created_utc": 1667608749,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people evaluate which religion is true?",
        "author": "randomname8097",
        "url": "https://www.reddit.com/r/religion/comments/ymeyid/how_do_people_evaluate_which_religion_is_true/",
        "text": "My aunt, who is a devout Christian, recently told my family that God speaks to her and has told her that covid isn't real, masks are a creation of Satan, that we are all being tricked by the \"Jewish world order\", and that we are all worthless, vile, disgusting creatures who deserve to be tortured for all of eternity unless we are convinced that Jesus Christ is our saviour. She went on to say other things about Jews that I don't want to repeat.\n\nA while ago a Muslim friend told me that God spoke to him (although I don't know many details about that exchange). That friend is convinced that everyone goes to hell unless they accept that there is no God but God and that Mohammed is the final messenger of God.\n\nClearly at least one of them has to be wrong as their religious beliefs contradict each other. \n\nHow can one evaluate which religion is correct? I have obsessive compulsive disorder (OCD) and I worry a lot about being tortured for eternity, but I have no idea how to avoid hell when it depends entirely on which religious viewpoint I'm convinced of, when all the while nobody can choose what they're convinced of. It seems so nonsensical to me and I wish I was smart enough to understand like everyone else can.\n\nThanks for reading. I was very upset about what my aunt said about covid as I knew several people who died from it. I was also taken aback to know that she follows anti-semitic conspiracies, however if the Christian God is real and was in fact speaking to her, am I making God mad by not being convinced of how evil Jews are?\n\nReligion is so confusing to me because I'm so much more stupid than everyone else. All I want to do is avoid being tortured for eternity. I didn't ask for this. I didn't ask to be born into a world where everyone deserves to be eternally tortured by default. My fear of hell has destroyed my mental health. I'm so sorry for rambling but I obsess over this so much.",
        "created_utc": 1667607488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a book where the main character is a Christian",
        "author": "Cucumber_Cat",
        "url": "https://www.reddit.com/r/religion/comments/ymea8u/writing_a_book_where_the_main_character_is_a/",
        "text": "OK so I'm not sure if this is the right place to post this but I'm in the planning stages of an LGBTQ book where the main character questions her sexuality right at the start, and i was thinking of incorporating her religion into the whole thing.\n\nBUT I don't want to offend anybody or get anything wrong since I've never been religious so I know absolutely nothing when it comes to religion.\n\nShould I just kill off religion in the story entirely?",
        "created_utc": 1667605688,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a life-long Athiest, but I have felt my perspective changing as of late.",
        "author": "VonSchmettau",
        "url": "https://www.reddit.com/r/religion/comments/ymdqr0/i_am_a_lifelong_athiest_but_i_have_felt_my/",
        "text": "[removed]",
        "created_utc": 1667604274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curiosity on Christianity/other such religions",
        "author": "NoxXNemesis",
        "url": "https://www.reddit.com/r/religion/comments/ymddrl/curiosity_on_christianityother_such_religions/",
        "text": "Hello everybody, and sorry for my title, I'm not incredibly educated. I love learning about religion with an open mind, and enjoy asking questions but am often shunned for asking questions at all. So I would like to say I do not wish to discredit or disrespect any religion at all here. \n\nMy question i would like to ask is, what actual physical proof do we have of things in the Bible. I do know Jesus existed as there have been so many sources separate from the Bible that mention him. But what proof is there of anything else that is actually physical stuff. People have told me the Ark was discovered but I can't find that anywhere. I have also heard that there was a sheet of some sort and the dead sea scrolls. I'm not sure about the sheet but the dead sea scrolls just seems like another part of the Bible so of course it confirms the Bible. \n\nI'm not sure if thats the best description, but let me know your thoughts!",
        "created_utc": 1667603350,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some arguments for duotheism?",
        "author": "matchateaman",
        "url": "https://www.reddit.com/r/religion/comments/ymc48h/what_are_some_arguments_for_duotheism/",
        "text": "I'm wiccan and most but not all wiccans believe in two deities the Lord and the Lady, not many faiths are duotheistic and for duotheists I ask what some of the arguments for it are.",
        "created_utc": 1667600127,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Says It Believes In Reincarnation (GPT-3)",
        "author": "talkingtoai",
        "url": "https://youtu.be/XNiA-2DDsCE",
        "text": "",
        "created_utc": 1667593773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last temple of the Manichean religion",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/ym8hsh/last_temple_of_the_manichean_religion/",
        "text": "[https://www.youtube.com/watch?v=aPi45uwmCbQ](https://www.youtube.com/watch?v=aPi45uwmCbQ)",
        "created_utc": 1667591362,
        "upvote_ratio": 1.0
    },
    {
        "title": "If reincarnation is real, and you are judged on your good vs bad deeds... what would you change today?",
        "author": "NathanelAucoin",
        "url": "https://www.reddit.com/r/religion/comments/ym53b9/if_reincarnation_is_real_and_you_are_judged_on/",
        "text": "[removed]",
        "created_utc": 1667583243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Verse of the day",
        "author": "Stefnbubsdad",
        "url": "https://i.redd.it/bb1ay3gwxyx91.jpg",
        "text": "",
        "created_utc": 1667582663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quote of the day",
        "author": "Stefnbubsdad",
        "url": "https://i.redd.it/nebizhxsxyx91.jpg",
        "text": "",
        "created_utc": 1667582631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading religious texts (currently the Quran) from a truly neutral point of view - a starting guide?",
        "author": "Corvus_Manufaktura",
        "url": "https://www.reddit.com/r/religion/comments/ym2enj/reading_religious_texts_currently_the_quran_from/",
        "text": "I don't even know if I'm posting in the right sub, I'm mainly looking for advice from people with a more-than-surface-level understanding of multiple religions.\n\nI'm an agnostic who's fascinated with exploring and understanding as much about the world as possible. Sadly, I do not have the means to travel and explore non-stop, so whenever I'm at home, I'm trying to learn about culture, geography, history, physics, everything related to the natural world. Religion is a huge part in how many people see and interact with the world, so understanding certain aspects of religion also gives insight into a lot of other things.\n\nI understand the Christian faith fairly well, since I grew up and live in Europe but lately I've had this idea that I want to learn about Islam as well, since it's such a prominent and often-spoken-about religion. So, I've downloaded a copy of the Quran and I'd like to know which are the parts that give the most insight into Islam. Basically, if someone wants to learn about Catholicism, for example, people would point them towards the Gospels first.\n\nMy question is: does the Quran have something similar? Do you just start reading it front-to-back like a novel? I'd also like to emphasize that my interest is unbiased and completely scientific. While I respect everyone's religious beliefs, personally, I'm not looking for religious enlightenment, just an understanding of the religion itself from a cultural and sociological point of view.\n\nP.S.: Documentary / podcast recommendations are also appreciated.",
        "created_utc": 1667576791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Animal Sacrifice in the Third Temple.",
        "author": "Volaer",
        "url": "https://www.reddit.com/r/religion/comments/ym1vk5/animal_sacrifice_in_the_third_temple/",
        "text": "Religious Jews on this sub, if hypothetically the third Temple would be rebuild, would you support the return of animal sacrifices? Or would you advocate for an alternative form of atonement (prayer, fasting, or something else entirely) to replace them, with the Temple becoming merely a place of worship not sacrifice?",
        "created_utc": 1667575479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you we will go to hell for this?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/ym1p6o/do_you_we_will_go_to_hell_for_this/",
        "text": "[removed]",
        "created_utc": 1667575055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creating a group to explore and document ancient and mystic rituals of baptism and water purification.",
        "author": "NathanelAucoin",
        "url": "https://www.reddit.com/r/religion/comments/ym1cm3/creating_a_group_to_explore_and_document_ancient/",
        "text": "[removed]",
        "created_utc": 1667574212,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Are Some People Always so Happy? What’s the Secret?",
        "author": "dailydevotions",
        "url": "https://dailydevotionsatthespeedoflife.blogspot.com/2022/11/how-are-some-people-always-so-happy.html",
        "text": "",
        "created_utc": 1667569501,
        "upvote_ratio": 1.0
    },
    {
        "title": "This book lays the groundwork for a new god, a new religion, and a new currency",
        "author": "thedowcast",
        "url": "https://www.reddit.com/r/religion/comments/ylz9ph/this_book_lays_the_groundwork_for_a_new_god_a_new/",
        "text": "[removed]",
        "created_utc": 1667568988,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people believe with their whole heart something that can be proven wrong so easily?",
        "author": "SheLikesToSayGroovy",
        "url": "https://www.reddit.com/r/religion/comments/ylz91x/how_do_people_believe_with_their_whole_heart/",
        "text": "I don't mean anything like the existence of God, you can debate that all you want since there's so many directions you could go with your interpretations.\n\nHowever, I recently came across a video of someone asking the people of Israel if they were actually Jewish. Not one of them were Black, more so like paler olive skinned to brown. So the comments were full of discourse around who are the true Israelites and that sort of stuff.. Went down a whole rabbit hole of people just arguing and being straight up racist to each other 💀\n\nAnd then I came across someone telling someone else to look up \"Yakub\" as a legitimate source of information for them. Idk if they did, but I did just out or curiosity... And it's one of the most nonsensical things I've ever read. \n\nIt's basically about a man with a h u g e head who lived for 150 years that invented White people by selective breeding to also make them.. Hate Black people? And that they were banished to Europe and were just animalistic people. If they wanted to reintegrate back into Black society, they became gorillas.. And when Moses tried to save some of them and couldn't, he blew some of them up with dynamite.\n\nDynamite was literally invented by Alfred Nobel for a start, who was only around just over 100 years ago. I won't even bother going in to dispute the rest of it because do you actually need to?💀\n\nIt's hilariously offensive and even more hilarious that some people actually believe this story enough to sit there and tell people to look it up as a factual resource? 🥲 \nHonestly I'd love to know any other stories other people might know of like this; ones that maybe are a bit more out there/not as broadly known. I'd be interested to know 👐🏽",
        "created_utc": 1667568940,
        "upvote_ratio": 1.0
    },
    {
        "title": "🌿🍷🍇 I am a Dionysian, a follower of the god Dionysus! AMA! 🌿🍷🍇",
        "author": "Fabianzzz",
        "url": "https://www.reddit.com/r/religion/comments/ylz61d/i_am_a_dionysian_a_follower_of_the_god_dionysus/",
        "text": "Hello all! I am a follower of the God Dionysus and help mod over at [r/Dionysus](https://www.reddit.com/r/Dionysus/)! I am here to answer any questions anyone has about the Dionysian path!\n\nYou may know Dionysus as the god of wine, theatre, wilderness, and Queer people, which is true - but there’s so much more to him than that!\n\nToday as well as in antiquity, the Dionysian path is heavily focused on ecstatic magic, mind altering practices, and spiritual liberation, with additional focuses on personal freedom, political equality, making the most of one’s life and making peace with one’s death!\n\nAMA!",
        "created_utc": 1667568732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rotation counterclockwise?",
        "author": "Difficult-Yellow-223",
        "url": "https://www.reddit.com/r/religion/comments/ylw3xx/rotation_counterclockwise/",
        "text": "How you ever wondered why are the Muslims rotating around the Kaaba in Mecca counterclockwise?\n\nWhy Blood starts the flow counterclockwise?\nWhy does the electrons and nuclei rotate counterclockwise?\nWhy does the earth rotate counterclockwise? \nWhy does the moon rotate counterclockwise? \nWhy all the planets rotate around the stars counterclockwise? \nWhy does the solar system rotate around the galaxy counterclockwise ?\nWhy are the galaxies rotating counterclockwise?",
        "created_utc": 1667560400,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Big Bang where did it come from in Atheism?",
        "author": "HeroshiWarLord",
        "url": "https://www.reddit.com/r/religion/comments/yluir4/the_big_bang_where_did_it_come_from_in_atheism/",
        "text": "The Big Bang in my opinion was the expansion of matter and caused time to begin from a singular point. \n\nIt did not come from nothing, because nothing has no value in it. If it came from nothing then that means the bogus God belief to myself, because would require manifestation of matter into existence which would make you believe that all the matter just poofed out of nowhere/thin air/absolute emptiness. God is no explanation for causing matter to be created either, because didn't say how God exists himself. \n\nHow does matter exist? (No God please), how did the space time continuum start? How did everything start, in common sense how was the big bang started?",
        "created_utc": 1667556011,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was baptized orthodox christian. I wish I hadn't been.",
        "author": "silver_layla",
        "url": "https://www.reddit.com/r/religion/comments/yludwm/i_was_baptized_orthodox_christian_i_wish_i_hadnt/",
        "text": "I was born and raised in this faith. I've gone through years of questioning and still haven't settled on anything although I'm experimenting. I wish I could \"get rid of\" my baptism, I wish it had not happened and that my parents had waited to give me a choice of wether I wanted to do it or not. I don't want to carry this with me throughout my religious/spiritual journey but now I have no choice. i hate this.",
        "created_utc": 1667555628,
        "upvote_ratio": 1.0
    },
    {
        "title": "I baptized orthodox christian. I wish I hadn't been.",
        "author": "silver_layla",
        "url": "https://www.reddit.com/r/religion/comments/ylud2c/i_baptized_orthodox_christian_i_wish_i_hadnt_been/",
        "text": "I was born and raised in this faith. I've gone through years of questioning and still haven't settled on anything although I'm experimenting. I wish I could \"get rid of\" my baptism, I wish it had not happened and that my parents had waited to give me a choice of wether I wanted to do it or not. I don't want to carry this with me throughout my religious/spiritual journey but now I have no choice. i hate this.",
        "created_utc": 1667555557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for this kind of religious belief?",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/yltumf/is_there_a_term_for_this_kind_of_religious_belief/",
        "text": "[removed]",
        "created_utc": 1667554053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atheists. If you were a theist (imagination) in a made up theistic real-life universe, what God(s) would you like to be real?",
        "author": "HeroshiWarLord",
        "url": "https://www.reddit.com/r/religion/comments/ylttb3/atheists_if_you_were_a_theist_imagination_in_a/",
        "text": "personally, I'd love the Triforce goddesses to be real or God(s) from Middle Earth, or like a polytheistic list of gods from religions I know all together: Abrahamic, Hindu, Bhuddism, Wicca, Jainism, Toaism, and Shintoism. Regardless I don't care I'm an Atheist and love real life in my opinion.",
        "created_utc": 1667553943,
        "upvote_ratio": 1.0
    },
    {
        "title": "NGO 4 #Humanrights🌈🕋🇲🇦🇮🇱🏳️‍🌈🇪🇺We are the Guardians of the #LGBT+ liberal rainbow Islam. The only modern Islamic teaching. al-mahdīالمهدي @Lightartist",
        "author": "PixelHELPER",
        "url": "https://v.redd.it/vsdd0matiwx91",
        "text": "",
        "created_utc": 1667553384,
        "upvote_ratio": 1.0
    },
    {
        "title": "different-religions-in-the-world-christianity",
        "author": "fghyfgty",
        "url": "https://www.reddit.com/r/religion/comments/ylsbdb/differentreligionsintheworldchristianity/",
        "text": "[removed]",
        "created_utc": 1667548913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you use any language for prayers/rituals in your faith?",
        "author": "mamypokong",
        "url": "https://www.reddit.com/r/religion/comments/ylrof6/could_you_use_any_language_for_prayersrituals_in/",
        "text": "As above",
        "created_utc": 1667546429,
        "upvote_ratio": 1.0
    },
    {
        "title": "different-religions-in-the-world",
        "author": "fghyfgty",
        "url": "https://www.reddit.com/r/religion/comments/ylrngz/differentreligionsintheworld/",
        "text": "[removed]",
        "created_utc": 1667546324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was 300 inspired by Christianity and Islam?",
        "author": "HeroshiWarLord",
        "url": "https://www.reddit.com/r/religion/comments/ylnkix/was_300_inspired_by_christianity_and_islam/",
        "text": "I know it's somewhat Historical (before Christianity even came out) however it's Fantasy.\n\nI thought that the Spartans were like Christians and the Persians were like Muslims when I watched.\n\nLove the movie.",
        "created_utc": 1667532366,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel extremely exhausted.",
        "author": "vohedriux",
        "url": "https://www.reddit.com/r/religion/comments/yll19q/i_feel_extremely_exhausted/",
        "text": "Here again, I'm posting because I have no clue what to do and I don't want to suffer anymore.\n\n \n\nI have way too much anxiety and my mind feels like its going to explode.\n\nI have ask for forgiveness a BUNCH of times for more than 3 days with constant anxiety, overwhelm and can't function properly. but if I ask for forgiveness and end up at 6 then my believes and or the good angels will punish me, if I end up at 666 it would be the same or worst.\n\nthen I tried to end up at another number and it's not the same way I said it when I was doing it the regular way and probably didnt end up exactly the same as before with 6 and or 666 so if I can end up the same then my believes and or good angels will punish me.\n\nI feel so sad, bad and failure. idk what to do. I have feelings of taking a break from praying and asking for forgiveness.\n\nTHIS IS JUST TOO MUCH\n\nsorry.\n\nMy therapist told me to feel the anxiety and to not respond to it, but if I don't respond then I will be punished by God and my believes.\n\nHow do I make my mind STOP. What am I do with feeling the anxiety?!?! what do I do when the thoughts comes?!?! I'm exhausted :(\n\nsorry.",
        "created_utc": 1667525078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not belonging again",
        "author": "throwayaok",
        "url": "https://www.reddit.com/r/religion/comments/ylkpjh/not_belonging_again/",
        "text": "[removed]",
        "created_utc": 1667524184,
        "upvote_ratio": 1.0
    },
    {
        "title": "The experience in my life that kept me believing in a higher power",
        "author": "PassportNerd",
        "url": "https://www.reddit.com/r/religion/comments/yliwvb/the_experience_in_my_life_that_kept_me_believing/",
        "text": "I'm 21, and 8 years ago when I was 14 I tried to jump in front of a truck in order for it to end my life, but when I jumped, something physically pushed me back that was not anything that could be rationally explained. \n\nWhen I was 15 I was crying in the shower when I was home alone and I felt a hand lay on my shoulder and I instantly felt better. I felt what ever horrible emotions I was feeling get sucked out of me. \n\nScience cannot explain either of those experiences, but religion can. What ever creator of the universe knew I deserved to live, my parents did not deserve to loose their son, and that driver did not deserve the guilt of killing me, so this creator did not allow that truck to run over my chest.",
        "created_utc": 1667519348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hebrews/Jews",
        "author": "Macaveli721",
        "url": "https://www.reddit.com/r/religion/comments/yliodf/hebrewsjews/",
        "text": "Can someone help breakdown all the stuff going on in the media regarding Kanye and Kyrie Irving? I am seeing a lot of “black people are the original hebrews” or something along those lines. I mean no disrespect with this topic, genuinely just want to learn where the divide is coming from. If this is the wrong subreddit for this please let me know",
        "created_utc": 1667518705,
        "upvote_ratio": 1.0
    },
    {
        "title": "The answer to science: Describe luck.",
        "author": "PierrePoilievreFan",
        "url": "https://www.reddit.com/r/religion/comments/ylibwq/the_answer_to_science_describe_luck/",
        "text": "[removed]",
        "created_utc": 1667517819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Islam is the only true religion.",
        "author": "ryan1850",
        "url": "https://www.reddit.com/r/religion/comments/ylh9sb/islam_is_the_only_true_religion/",
        "text": "For starters,quran is the only book that hasent been changed,all the verses letters and souray are the same since they came down upon Mohammed thousands of years ago\n2.everything in the quran is true,and most of the judgment day signs have happened. \n3.in quran it says God hasent been born and isn't a father to anyone,he is the only one,so no,Jesus isn't his son.feel free to tell me other wise in the comments but with proof only.may Allah be with you all.",
        "created_utc": 1667515629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else think that there is a coherence that interlinks all major world religions?",
        "author": "NathanelAucoin",
        "url": "https://www.reddit.com/r/religion/comments/ylgkqx/does_anyone_else_think_that_there_is_a_coherence/",
        "text": "[removed]",
        "created_utc": 1667514212,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you were to create a tradition that, instead of trying to attract followers, it actively repelled and dissuaded them from joining, what would that look like?",
        "author": "lettherebemorelight",
        "url": "https://www.reddit.com/r/religion/comments/yleo73/if_you_were_to_create_a_tradition_that_instead_of/",
        "text": "Pamphlets with slogans like “We Have No Answers”? Grotesque iconography instead of gilded beatific beings? I get that this is kind of a goofy question, but let’s say you had some dangerously powerful secret knowledge that you wanted to preserve, but also wanted to conceal from idle curiosity and those who were not morally or spiritually developed enough yet. \n\nI’ve read somewhere before that some Hindu temples have rather erotic icons on the outside of the temple, the idea being that if you haven’t yet transcended the carnal, you aren’t ready for the deeper mysteries inside. Christianity, at least in its origin, kind of fits this idea too; the idea that the King of Kings was born a pauper and died the humiliating death of a slave was not a terribly attractive idea to the ancient world.",
        "created_utc": 1667508971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meowism religion",
        "author": "Daniel_IDV",
        "url": "https://www.reddit.com/r/religion/comments/yldjsr/meowism_religion/",
        "text": "[removed]",
        "created_utc": 1667506617,
        "upvote_ratio": 1.0
    },
    {
        "title": "A daring modern artist painted icons of the Virgin. So strange and so beautiful. Isn't it?",
        "author": "_aspect_ratio_",
        "url": "https://youtu.be/doYKmE1ni5k",
        "text": "",
        "created_utc": 1667505454,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to properly mix violence and death with the peaceful teachings of Christ.",
        "author": "pbandnv1",
        "url": "https://i.redd.it/1gq5cf19gsx91.jpg",
        "text": "",
        "created_utc": 1667504091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Sikhs aloud to cut their hair for medical treatments?",
        "author": "Ninjaballer24",
        "url": "https://www.reddit.com/r/religion/comments/9kb1av/are_sikhs_aloud_to_cut_their_hair_for_medical/",
        "text": "Also does it matter if the doctor has to be the same gender as the patient?",
        "created_utc": 1538349512,
        "upvote_ratio": ""
    },
    {
        "title": "What do you call someone who believes in an afterlife but not a God?",
        "author": "NordicWerewolf",
        "url": "https://www.reddit.com/r/religion/comments/9kasjr/what_do_you_call_someone_who_believes_in_an/",
        "text": "I honestly can't get into theism or atheism at all because they to me are very difficult to get into. That's why I've decided to believe in some sort of afterlife but not a deity. Now I know some of you may find it impossible to believe but I honestly couldn't care less. I really have no other choice at this point honestly. But I just wanna know if there is a word used to describe a person who believes in an afterlife but not in a god, gods or goddesses.",
        "created_utc": 1538347580,
        "upvote_ratio": ""
    },
    {
        "title": "What circumstances cause fanaticism in new converts in comparison to the \"steady state\" followers that have been part of the religion for a much longer time?",
        "author": "ccricers",
        "url": "https://www.reddit.com/r/religion/comments/9ka6m3/what_circumstances_cause_fanaticism_in_new/",
        "text": "Some new converts experience a high level of obsession with the religion that rarely is experienced with people who have been born into it or otherwise been a long time follower. Usually the obsession is one where are so invested that they are completely un-critical and find themselves displaying very strict standards to approach and interpret  outside criticism. What circumstances create the difference? I find it comparable sometimes going to \"going through a phase\" with impulsive thinking similar to how people go through trends and obsess over a new interest in short spurts.",
        "created_utc": 1538342846,
        "upvote_ratio": ""
    },
    {
        "title": "El primer perro acreditado como peregrino del Camino de Santiago asiste a audiencia del Papa",
        "author": "JCEA58",
        "url": "https://www.romereports.com/2018/09/30/el-primer-perro-acreditado-como-peregrino-del-camino-de-santiago-asiste-a-audiencia-del-papa/",
        "text": "",
        "created_utc": 1538338849,
        "upvote_ratio": ""
    },
    {
        "title": "Which religions, if any, include a concept about it being immoral to not reach your potential?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k9jt5/which_religions_if_any_include_a_concept_about_it/",
        "text": "[deleted]",
        "created_utc": 1538338249,
        "upvote_ratio": ""
    },
    {
        "title": "The commonality of religions",
        "author": "sir_schuster1",
        "url": "https://www.reddit.com/r/religion/comments/9k9hxx/the_commonality_of_religions/",
        "text": "In every religion you see, whether overt or subconscious, there is a philosophy about how to live your life. A manifestation from our collective subconscious inspiring us to live and to live well, to participate in ongoing creation. If life is a game, religion is a meta game, but it's not invented by humans, it's a physiological occurrence. A subjective experience of an objective reality. Our dreams, like us, are an expression of the universe. Like words from the mouth of God. It seems to me that there is no reason to believe that this collective dream is not divine, whatever it means to be divine. Our dream of religion gives us meaning and purpose, it gives us hope and peace. It brings us into balance with reality and with each other.",
        "created_utc": 1538337897,
        "upvote_ratio": ""
    },
    {
        "title": "sure shot method to get your kids to heaven (for every religion)",
        "author": "r12348v",
        "url": "https://www.reddit.com/r/religion/comments/9k92nv/sure_shot_method_to_get_your_kids_to_heaven_for/",
        "text": "[removed]",
        "created_utc": 1538334851,
        "upvote_ratio": ""
    },
    {
        "title": "Other beings besides us",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k8v73/other_beings_besides_us/",
        "text": "[deleted]",
        "created_utc": 1538333417,
        "upvote_ratio": ""
    },
    {
        "title": "Guru Brahma Song,Guru Brahma Guru Vishnu Song,Guru Mantra,Guru Brahma Gu...",
        "author": "srisneha",
        "url": "https://www.youtube.com/attribution_link?a=EfADp4aADIw&amp;u=%2Fwatch%3Fv%3D7tvbLNxtBC4%26feature%3Dshare",
        "text": "",
        "created_utc": 1538330550,
        "upvote_ratio": ""
    },
    {
        "title": "New video by katholisch.de on YouTube",
        "author": "sakrum1",
        "url": "https://www.youtube.com/watch?v=dduQi3vBdBo&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1538325064,
        "upvote_ratio": ""
    },
    {
        "title": "Speaking in Tongues",
        "author": "KyTitansFan",
        "url": "https://www.reddit.com/r/religion/comments/9k6esk/speaking_in_tongues/",
        "text": "Looking for others opinions, information about speaking in tongues. Does something like this really happen today?\n\n&amp;#x200B;",
        "created_utc": 1538314694,
        "upvote_ratio": ""
    },
    {
        "title": "Navartri : नवरात्रि में ये दो दिन तांत्रिक शक्तियां रहती हैं सक्रिय",
        "author": "desidozz",
        "url": "http://desidozz.com/astrology/navaratri-tantric-powers-remain-active",
        "text": "",
        "created_utc": 1538313556,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] When has praying ever worked for anyone?",
        "author": "mensch75",
        "url": "https://www.reddit.com/r/religion/comments/9k5xn3/serious_when_has_praying_ever_worked_for_anyone/",
        "text": "",
        "created_utc": 1538309744,
        "upvote_ratio": ""
    },
    {
        "title": "Once An Outcast, Ukrainian Patriarch Ready to Lead Church Split from Russia - OMG News Today",
        "author": "bmg_2017",
        "url": "https://omgnews.today/outcast-ukrainian-patriarch-ready-lead-church-split-russia/#.W7C8-sTu6fQ.reddit",
        "text": "",
        "created_utc": 1538309417,
        "upvote_ratio": ""
    },
    {
        "title": "The Five Ministries of Acts 2",
        "author": "Ljbost",
        "url": "https://strasburgchurchofchrist.webs.com/Five%20ministries%20of%20Acts%202.html#.W7C0mudpnhA.reddit",
        "text": "",
        "created_utc": 1538307244,
        "upvote_ratio": ""
    },
    {
        "title": "Our True Selves | Part 3 | Beth Moore | Christian Videos",
        "author": "rinka492194",
        "url": "https://www.youtube.com/attribution_link?a=1ARo5OR4M5s&amp;u=%2Fwatch%3Fv%3DmYiw-bcbpW0%26feature%3Dshare",
        "text": "",
        "created_utc": 1538302744,
        "upvote_ratio": ""
    },
    {
        "title": "Mike Murdock is a P.O.S. uncommonseed.com should be criminal.",
        "author": "mymonikerwastaken",
        "url": "https://www.reddit.com/r/religion/comments/9k4wx3/mike_murdock_is_a_pos_uncommonseedcom_should_be/",
        "text": "[removed]",
        "created_utc": 1538298640,
        "upvote_ratio": ""
    },
    {
        "title": "Watch \"How To Recognize The Return Of Christ - Long Version\" on YouTube 😇 Yeshua answered, \"I am the way and the truth and the life. No one comes to the Father except through me. 😇",
        "author": "TomCavin3860",
        "url": "https://youtu.be/fOD8ytqPKYk",
        "text": "",
        "created_utc": 1538298361,
        "upvote_ratio": ""
    },
    {
        "title": "Making new religion: Butthole",
        "author": "okamui",
        "url": "https://www.reddit.com/r/religion/comments/9k4uvb/making_new_religion_butthole/",
        "text": "[removed]",
        "created_utc": 1538297847,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between messianic Jews and Christians?",
        "author": "charpiercy1",
        "url": "https://www.reddit.com/r/religion/comments/9k4sfa/what_is_the_difference_between_messianic_jews_and/",
        "text": "",
        "created_utc": 1538296835,
        "upvote_ratio": ""
    },
    {
        "title": "The Pattern of Detours | Dr. Tony Evans | The Alternative",
        "author": "rinka492194",
        "url": "https://www.youtube.com/attribution_link?a=5sJe7YkqiKE&amp;u=%2Fwatch%3Fv%3DOS_jUdHi2mE%26feature%3Dshare",
        "text": "",
        "created_utc": 1538277076,
        "upvote_ratio": ""
    },
    {
        "title": "God took the last good thing in my life away from me...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k2w1z/god_took_the_last_good_thing_in_my_life_away_from/",
        "text": "[deleted]",
        "created_utc": 1538276327,
        "upvote_ratio": ""
    },
    {
        "title": "why did God make men so lustful?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k20ye/why_did_god_make_men_so_lustful/",
        "text": "[deleted]",
        "created_utc": 1538268085,
        "upvote_ratio": ""
    },
    {
        "title": "Considering converting to Judaism",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k1xj4/considering_converting_to_judaism/",
        "text": "[deleted]",
        "created_utc": 1538267200,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking advice for my confused and haulted spiritual journey and my path to God.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k1v81/seeking_advice_for_my_confused_and_haulted/",
        "text": "[deleted]",
        "created_utc": 1538266607,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think someone can believe in two religions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9k1cvf/do_you_think_someone_can_believe_in_two_religions/",
        "text": "[deleted]",
        "created_utc": 1538261968,
        "upvote_ratio": ""
    },
    {
        "title": "San Girolamo, sacerdote e dottore della Chiesa",
        "author": "tanogabo",
        "url": "https://www.reddit.com/r/religion/comments/9k0ol1/san_girolamo_sacerdote_e_dottore_della_chiesa/",
        "text": "[removed]",
        "created_utc": 1538256255,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're not to blame, You're just a human, A victim of the insane\"",
        "author": "mind444",
        "url": "https://www.reddit.com/r/religion/comments/9k0lhn/youre_not_to_blame_youre_just_a_human_a_victim_of/",
        "text": "[removed]",
        "created_utc": 1538255577,
        "upvote_ratio": ""
    },
    {
        "title": "The issue I have with religion is how highly its regarded.",
        "author": "ivanbin",
        "url": "https://www.reddit.com/r/religion/comments/9jzcle/the_issue_i_have_with_religion_is_how_highly_its/",
        "text": "Was just reading an article of some folks in middle East murdering a woman for being too liberal in her clothing choices and the like (former Miss Iraq I believe).\n\nAs you would imagine there are people blaming religion. Now, there are many people of every religion that are better people for following it. And there are some who take it waaaay too far.\n\nI think that one of the reasons you end up with that second group, is because religion gets put on this pedestal. People feel justified in hating on gays, immodest clothing, weed, etc. because they can justify it with religion.\n\nNow, you can say they are interpreting it wrong. That is I think a very open question given how scripture can be twisted whatever way you want (heck up until recently the Catholic church was veeeery anti-gay. Were they dead wrong about the scripture for 1000+ years, or were they simply choosing one of the many equally valid interpretations?). However, the issue I have is that once people come to some interpretation, it is often so difficult to convince them otherwise. Because no matter how much you tell them they are being an asshole for treating gays (and other members of the LGBTQ community) as trash, they think that they are justified because of their religion.\n\nReligion is being put above laws, common sense, and basic desency. If someone is an ass just because they are an ass, you can show them how bad they are, and how harmful it is and if they can see that it is indeed a bad idea to be an ass, they will stop (well not all but...). However if you show that ti someone who hates gays (specifically due to religion), it is much much harder to convince them, because you are convincing them that their religion is wrong (or that they read it wrong, but that is also very difficult to convince a heavily religious person of). In their view, their God is commanding them to hate gays. So how can you possibly convince them that God himself is wrong (again, you can convince them they misunderstood God, but heavily religious people are often preeeeetty convinced they know their scripture better than anyone who disagrees with them). ",
        "created_utc": 1538245869,
        "upvote_ratio": ""
    },
    {
        "title": "Things To Offer Lord Hanuman , Offerings To Lord Hanuman, What Things To...",
        "author": "srisneha",
        "url": "https://www.youtube.com/attribution_link?a=tkV89oXlAbc&amp;u=%2Fwatch%3Fv%3DfyJ1prPD-hI%26feature%3Dshare",
        "text": "",
        "created_utc": 1538238903,
        "upvote_ratio": ""
    },
    {
        "title": "I was labeled satire there maybe this community will have more appreciation",
        "author": "DaMagickDragon93",
        "url": "https://www.reddit.com/r/atheism/comments/9jy714/what_is_your_thoughts_on_reoccurring_tales_about/",
        "text": "",
        "created_utc": 1538238670,
        "upvote_ratio": ""
    },
    {
        "title": "सुबह ख़ाली पेट घी का सेवन ऐसा फायदा देता है, जिसके आगे बड़ी से बड़ी दवाई फ़ैल है",
        "author": "desidozz",
        "url": "http://desidozz.com/health/benefits-of-consuming-empty-stomach-ghee",
        "text": "",
        "created_utc": 1538234532,
        "upvote_ratio": ""
    },
    {
        "title": "Battle Strategy | Kay Arthur | Precepts for Life",
        "author": "rinka492194",
        "url": "https://www.youtube.com/attribution_link?a=UsuKR9hH_Ig&amp;u=%2Fwatch%3Fv%3DU7-R3YlhA6Q%26feature%3Dshare",
        "text": "",
        "created_utc": 1538233493,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a church on the earth that makes you pay for each teaching they offer about spirit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9jwyll/is_there_a_church_on_the_earth_that_makes_you_pay/",
        "text": "[deleted]",
        "created_utc": 1538229564,
        "upvote_ratio": ""
    },
    {
        "title": "Threw my keys to a muslim friend, I’m catholic. Got this keychain on em with a piece of Jerusalems soil in it, split in half as he failed to catch em and it hit the ground. Felt kinda symbolic. The image is from after it was put back together with superglue.",
        "author": "[deleted]",
        "url": "https://i.redd.it/xb0lu1mcm6p11.jpg",
        "text": "[deleted]",
        "created_utc": 1538228764,
        "upvote_ratio": ""
    },
    {
        "title": "Pamela why - UNBELIEVABLE! A FIGHT breaks out in church - Accurate Proph...",
        "author": "saintket",
        "url": "https://www.youtube.com/attribution_link?a=FMD29q6WUYQ&amp;u=%2Fwatch%3Fv%3DIfhtzYYr-5E%26feature%3Dshare",
        "text": "",
        "created_utc": 1538226299,
        "upvote_ratio": ""
    },
    {
        "title": "Biblical righteousness vs American righteousness",
        "author": "kratosasura123",
        "url": "https://www.reddit.com/r/religion/comments/9jwar4/biblical_righteousness_vs_american_righteousness/",
        "text": "What’s the difference and what’s better",
        "created_utc": 1538224745,
        "upvote_ratio": ""
    },
    {
        "title": "Do animals go to the kingdom of heaven/resurrected like man? Cause their not judged.",
        "author": "kratosasura123",
        "url": "https://www.reddit.com/r/religion/comments/9jvxng/do_animals_go_to_the_kingdom_of_heavenresurrected/",
        "text": "",
        "created_utc": 1538221309,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling guilty",
        "author": "UgandanCommunist",
        "url": "https://www.reddit.com/r/religion/comments/9jv8en/feeling_guilty/",
        "text": "Im 13 and muslim. My father is orthodox while my mum is muslim. I cant help but i feel more interested in christianity and this made me feel as if im a heretic :( im not saying that christianity is heresy but im saying that i feel guilty for being interested in other religion. When i get surprised instead of saying God is great(Allahu akbar) i say jesus christ. I feel so guilty",
        "created_utc": 1538213291,
        "upvote_ratio": ""
    },
    {
        "title": "'Breathtakingly arrogant' Christian woman flouted planning rules because her only duty was to 'almighty God'",
        "author": "segovius",
        "url": "https://www.independent.co.uk/news/uk/home-news/christian-couple-planning-basset-farm-god-authority-devon-fine-laine-stephen-shepherd-a8559511.html",
        "text": "",
        "created_utc": 1538212031,
        "upvote_ratio": ""
    },
    {
        "title": "Seen in a Catholic church in Manila. How appropriate.",
        "author": "Badhorse4444",
        "url": "https://i.redd.it/laz19obmc4p11.jpg",
        "text": "",
        "created_utc": 1538201277,
        "upvote_ratio": ""
    },
    {
        "title": "Vision To See Beyond",
        "author": "diosestapresente",
        "url": "https://www.youtube.com/attribution_link?a=5gk5_xqSm6w&amp;u=%2Fwatch%3Fv%3D7aaB6RnoAJo%26feature%3Dshare",
        "text": "",
        "created_utc": 1538196456,
        "upvote_ratio": ""
    },
    {
        "title": "I do not know what to think",
        "author": "Arbiter_Wyatt",
        "url": "https://www.reddit.com/r/religion/comments/9jtfmt/i_do_not_know_what_to_think/",
        "text": "I'll start with some context. I have two Catholic parents, but we as a family are not religious and only go to church for events or social gatherings, with the exception of my (mother's side) Grandfather, he is a very religious Jew, everyone before my grandfather on my mother's side was Jewish as well, until my Grandmother (mother's side). But on my father's side everyone was caltholic but almost never very practicing. I just do not know what to think about everything right now. I know there has to be some sort of force, how could they world just revolve around nothing, right?, there is no possible way that there is no force, IMO. But how am I supposed to know that that force, is 1. In our reality 1. A being 2. A human (possesses the thought process and cognitive abilities of human)?  Because it seems like every religion has a human or at least a spirit that transitions between human bodies on Earth, and in our reality. how is it possible to believe that Jesus was a saviour and someone I should be worshipping? And if he is not, what makes someone a Messiah, how is it known that  \"They will be a descendant of King David\"? It just seem like the chances of any of this being even close to possible is just kind of close minded. Who am I to believe that we are not just aliens in some universe playing some VR game? Why do I have to choose from one of these instead of just keep my mindset open, and if juadism turns out to be true, guess I'll be that from then on. Or vice versa with any other religion . It seems like rolling a dice. If I am Jew, and it turns out that Christianity is true, well, guess I'll go to hell then. Why do I have to be \"ignorant\" for not believing any of this is probable. Why would a Lord do all of this shit to me, kill my relatives, pets, friends of cancer, heart disease... Put me in a depressive world, not ever tell me the truth, make me trust some book? I just feel so confused, and from the way everyone seems to make it sound it seems like it's \"wrong\" to be confused. Is this true? Hopefully this doesn't come off as ignorant towards any religious persons.",
        "created_utc": 1538191349,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most introverted and extroverted religions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9jtb0v/what_are_the_most_introverted_and_extroverted/",
        "text": "[deleted]",
        "created_utc": 1538190107,
        "upvote_ratio": ""
    },
    {
        "title": "A",
        "author": "[deleted]",
        "url": "https://i.redd.it/a90fu2txd3p11.png",
        "text": "[deleted]",
        "created_utc": 1538189618,
        "upvote_ratio": ""
    },
    {
        "title": "We're So Special in God's Eyes: God sees us as a very special creation. Do you want to learn more about who we actually are in God's eyes?\" Find out in His own words www.biblestudyforall.org",
        "author": "lozzaa_21",
        "url": "https://i.redd.it/lz4nb0yr51p11.jpg",
        "text": "",
        "created_utc": 1538183359,
        "upvote_ratio": ""
    },
    {
        "title": "Hi r/Religion. I am putting together a survey-based book comparing different spiritual paths, and I would greatly appreciate some sincere perspectives from different religious traditions.",
        "author": "pbrown00",
        "url": "https://www.reddit.com/r/religion/comments/9jskm2/hi_rreligion_i_am_putting_together_a_surveybased/",
        "text": "A thoughtful couple of paragraphs per question would be ideal. Respondents' identities will be anonymous, and some answers will be published. Thank you very much for any considerate and respectful responses!  \n\nHere is the link to the survey:https://www.surveymonkey.com/r/D2RH3YT\n",
        "created_utc": 1538183273,
        "upvote_ratio": ""
    },
    {
        "title": "What is Kemetism?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9jsf5t/what_is_kemetism/",
        "text": "What is Kemetism? I am currently an (Agnostic) Atheist,  (I'm not here to debate about this) however, I can super interested in other religions, and I have heard that Kemetism is the restoration of ancient Egyptian religion, but why? Who do people believe this? Is there anyone who believes this here, if so, why do you believe this?  What would drive people to do this? I need information, because I want to learn more about this. I know this is pretty vague, but please try and explain this to me...",
        "created_utc": 1538181894,
        "upvote_ratio": ""
    },
    {
        "title": "Help me make a choice.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/religion/comments/9js8pu/help_me_make_a_choice/",
        "text": "[deleted]",
        "created_utc": 1538180284,
        "upvote_ratio": ""
    },
    {
        "title": "Former Cardinal McCarrick to live in Kansas Friary.",
        "author": "21ireed",
        "url": "https://www.ncronline.org/news/accountability/former-cardinal-mccarrick-living-kansas-friary",
        "text": "",
        "created_utc": 1538172341,
        "upvote_ratio": ""
    },
    {
        "title": "A Question About My Beliefs",
        "author": "Edan_Everlast",
        "url": "https://www.reddit.com/r/religion/comments/9jq759/a_question_about_my_beliefs/",
        "text": "I grew up in a Baptist family, but since then my faith has sort of turned into something else, and I've yet to find a \"title\" that fits my belief.\n\nMy basic belief is that there is a higher power of some kind, and it is in control of all the things out of control/not able to be explained. Karma, Luck, Fate, ideas like that. I do not necessarily even believe that the higher power is anything human or even physical, just some sentient higher power behind all the \"randomness\" in life. When I pray, I pray to this higher power, and my reason to stay moral/ good is so that the luck/karma of life is on my side. \n\nDoes anyone have any idea what this may be called, or any suggestions? Trying to find a way to format this question into Google has been a challenge, so I appreciate anyone who can help me out!",
        "created_utc": 1538164140,
        "upvote_ratio": ""
    },
    {
        "title": "info about Greek orthodox traditional beliefs",
        "author": "warthand",
        "url": "https://www.reddit.com/r/religion/comments/9jpt0l/info_about_greek_orthodox_traditional_beliefs/",
        "text": "I am doing some research for a character in a book.\n\nI know Mr Google can answer this question, but I want to try to get information directly from some philosophical church member and not some scholar who is looking at it from the outside. Mostly how it relates to Stoicism, but anyone that wants to contribute anything is welcome.\n\nIdeally a interactive live chat/skype situation would be awesome, but I realize this is a bit off the wall request.\n\nAny tenets are fine just kinda focused around these quotes.\n\n \"Be content with what you are, and wish not change; nor dread your last day, nor long for it \"\n\n\"Pain exists to promote enlightenment and determine your potential happiness\"\n\n\\--basically \n\n1. you cant appreciate the state of mind your in unless you used to be in a worse one.\n2. its possible to ephasize with someone enough that you can appreciate what you have\n\nI am looking to see how an middle aged greek religous person might respond to her infertile friend who is a stoic (does not let anything bother her, even this)\n\n\" Whatever happens to you has been waiting to happen since the beginning of time\"\n\nthanks\n\n&amp;#x200B;",
        "created_utc": 1538161556,
        "upvote_ratio": ""
    },
    {
        "title": "Nuns Win Another Victory In Battle Against Gun Violence.",
        "author": "withfusion15",
        "url": "https://www.worldreligionnews.com/religion-news/nuns-win-another-victory-battle-gun-violence",
        "text": "",
        "created_utc": 1538160391,
        "upvote_ratio": ""
    },
    {
        "title": "Many proclaim Allah is not the God mentioned in the Bible, I beg to disagree",
        "author": "kratosasura123",
        "url": "https://www.reddit.com/r/religion/comments/9jp6mc/many_proclaim_allah_is_not_the_god_mentioned_in/",
        "text": "Allah \nEl (another name for Yahweh in Bible and other Semitic faiths back then)\n\n-Allah and el paganism- same position, same daughters\n-Both Semitic gods\n-Most high\n-peoples having a common ancestor 4000 years old: Abraham?\n-same old Semitic root word \nDo you agree with this?\n",
        "created_utc": 1538157141,
        "upvote_ratio": ""
    }
]