[
    {
        "title": "La Vérité",
        "author": "limanyasmaa",
        "url": "/r/ahl_al_haya/comments/109553x/la_vérité/",
        "text": "",
        "created_utc": 1673619015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think something needs to be done about all the 'problem of evil' questions on this sub-reddit.",
        "author": "IXBlackHeartXI36",
        "url": "https://www.reddit.com/r/religion/comments/10au9xq/i_think_something_needs_to_be_done_about_all_the/",
        "text": "This a more of a 'meta' discussion, but this sub-reddit apparently doesn't support flairs so I can't flag it as such. At the same time though, I can't find any mention of such posts not being allowed.\n\nNow, this question isn't a bad one, and has been debated for centuries by a variety of different religious groups. However, I think these posts are getting excessive. It seems every time I come here I see someone asking the same question again, with dozens upon dozens of responses that are clearly too numerous for that person to ever read (I did once ask a question somewhere where I got literally HUNDREDS of responses, obviously I didn't even try to read them so I ironically got absolutely nothing from that post other than a huge amount of karma). \n\nI know most sub-reddits tend to whine about people posting the same question repeatedly, but let's be real who bothers to use the search function much? I mean, the only time I ever use it is to find older posts that I made myself. I'm thinking here that something needs to be done to mitigate these highly repetitive posts. Put a sticky at the top pointing to the innumerable threads already made, or put it in the rules that this question has been asked countless times already, and that people wondering about it should just search for these rather than making a new one. Or perhaps they should just go ask their preacher or w/e spiritual leader someone of their faith would normally talk to. Come to think of it, maybe a list of research materials could be listed so that people wouldn't have to ask more common questions about different religions.",
        "created_utc": 1673615714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a truly benevolent God create this world like this?",
        "author": "matrixprisoner",
        "url": "https://www.reddit.com/r/religion/comments/10arh7k/would_a_truly_benevolent_god_create_this_world/",
        "text": "\nLife feeds on life. Every single second of every single day, an animal dies because it's killed by another animal or by humans. Same thing with insects. Same thing with plants.\n\nIf God is almighty and all-powerful it means that this place is designed they way it is because God wanted it to be like this, correct? Now, my question to you is: is this really the creation of the biblical God? Why would an all loving God want to create a world in which there's so much suffering?\n\nI would want to live on a planet where humans and animals don't kill each other, a place where there's no 'kill or be killed', a place where there's no violence, hate, racism, suffering, disease, famine etc etc. That to me would be the kind of a planet that would be designed by a benevolent God, because a benevolent God would not want his children to suffer. The biblical God however seems to be \"a little different\" and unless he's worshipped by his own children, he will send them to hell, and not just send them to hell for a day or two but for eternity. Again I ask, would an all loving, benevolent God send his children to hell for eternity?\n\nAt this point I'm pretty sure that this is the creation of the Demiurge who purposely designed this place to be like a giant loosh fest of a planet, so that him and his archons can feed themselves. The God that people pray to for salvation is the very demiurge that has enslaved us.",
        "created_utc": 1673606575,
        "upvote_ratio": 1.0
    },
    {
        "title": "What sins are unforgivable?",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/10ar84j/what_sins_are_unforgivable/",
        "text": "[removed]",
        "created_utc": 1673605634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have any religious doubts or any unanswered question about your religion?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/religion/comments/10ancp8/do_you_have_any_religious_doubts_or_any/",
        "text": "And how does that affect your religious life?",
        "created_utc": 1673591146,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Are",
        "author": "Calm-Field9753",
        "url": "https://joecamerota.medium.com/you-are-64386f65c029",
        "text": "",
        "created_utc": 1673590902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are rules rational?",
        "author": "ladaphi",
        "url": "https://www.reddit.com/r/religion/comments/10al19l/are_rules_rational/",
        "text": "[removed]",
        "created_utc": 1673583882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay, I have a bible question. (No hate)",
        "author": "Mae_321",
        "url": "https://www.reddit.com/r/religion/comments/10akk76/okay_i_have_a_bible_question_no_hate/",
        "text": "[removed]",
        "created_utc": 1673582490,
        "upvote_ratio": 1.0
    },
    {
        "title": "ORACION A LAS 7 POTENCIAS AFRICANAS",
        "author": "samualfredo",
        "url": "https://youtu.be/3TaYt5JCJgw",
        "text": "",
        "created_utc": 1673581857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Jesus the only prophet that didn’t control an army and “spread the word by the sword”?",
        "author": "TylerDurden626",
        "url": "https://www.reddit.com/r/religion/comments/10ajsld/is_jesus_the_only_prophet_that_didnt_control_an/",
        "text": "So I read today that Jesus is the only prophet of the major religions that didn’t control an army and force people into believing. I know the crusades happened but I don’t think Jesus was there. Is this true?",
        "created_utc": 1673580277,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm new to this subreddit. Is this a subreddit for sharing your religious views, or for debating?",
        "author": "4bdnfruit",
        "url": "https://www.reddit.com/r/religion/comments/10ajs9o/im_new_to_this_subreddit_is_this_a_subreddit_for/",
        "text": "Because I see lots of theist vs atheist debates in the comment sections. Is that supposed to happen?",
        "created_utc": 1673580252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes, atheism is a belief.",
        "author": "4bdnfruit",
        "url": "https://www.reddit.com/r/religion/comments/10aj9xa/yes_atheism_is_a_belief/",
        "text": "Many atheists on this subreddit have tried to argue that atheism isn't a belief, just the *lack* of belief. But I could easily ask an atheist, \"Do you believe that God doesn't exist?\" Then, they would obviously have to say yes. So you've got a belief right there.",
        "created_utc": 1673578853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go a Presbyterian Church service because why not?",
        "author": "Miles-is-witch",
        "url": "https://www.reddit.com/r/religion/comments/10aiv7e/should_i_go_a_presbyterian_church_service_because/",
        "text": "Okay, so I have nothing to do Sunday and got the random idea to go to church. I’m not Christian, the nearest church near me is Presbyterian. Should I go?",
        "created_utc": 1673577721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which theory of religion do you think ‘makes the most sense’ in a modern worldview?",
        "author": "AnywhereOk7507",
        "url": "https://www.reddit.com/r/religion/comments/10aisqa/which_theory_of_religion_do_you_think_makes_the/",
        "text": "I’d like your opinion on the various theories of religion. Structural, intellectual, development, symbolist, cognitive, evolutionist etc",
        "created_utc": 1673577526,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mother is on her death bed and a priest won't come to see her",
        "author": "Viagra_Was_My_Idea",
        "url": "https://www.reddit.com/r/religion/comments/10aidfq/my_mother_is_on_her_death_bed_and_a_priest_wont/",
        "text": "My mother has been a devout member of the Catholic church her entire life. She moved and started at a new church a few years back and had a decent relationship (we thought) with the priest there.\n\nMy mom has terminal cancer and is now passing away as I type this. Come to find out the Priest did make a quick visit a couple weeks ago for confession. My father called today asking if he'd please come and administer last rights and what not.\n\nHis response (actually the nun, because he couldn't be bothered) was \"No, I only like to do that when they can participate\". She said sorry and basically hung up.\n\nIs this normal for this to happen or is this guy just awful? Is there anything I can do too, this seriously hurts.",
        "created_utc": 1673576358,
        "upvote_ratio": 1.0
    },
    {
        "title": "JESUS LOVES ME SONG - RECEIVE BLESSING",
        "author": "Conscious_Gene_8127",
        "url": "https://www.youtube.com/watch?v=2Hl9G4pKWfU",
        "text": "",
        "created_utc": 1673570666,
        "upvote_ratio": 1.0
    },
    {
        "title": "How old is Muslim religion?",
        "author": "asksaint",
        "url": "https://asksaint.com/how-old-is-muslim-religion/",
        "text": "",
        "created_utc": 1673570509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yezidism/Mithraism predates Zoroastrianism in Kurdistan",
        "author": "GapAble6405",
        "url": "https://www.reddit.com/r/religion/comments/10aft2t/yezidismmithraism_predates_zoroastrianism_in/",
        "text": "[removed]",
        "created_utc": 1673569653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech gets religion on AI: Inside the Vatican summit with Islamic and Jewish leaders, Microsoft and IBM",
        "author": "DiscipleGoatFish",
        "url": "https://www.geekwire.com/2023/tech-gets-religion-on-ai-inside-the-vatican-summit-with-islamic-and-jewish-leaders-microsoft-and-ibm/",
        "text": "",
        "created_utc": 1673569031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is atheism a religion?",
        "author": "Shuggnyth",
        "url": "https://www.reddit.com/r/religion/comments/10af1e3/is_atheism_a_religion/",
        "text": "I really don’t get why people think it is. As someone who believes in Gods it’s not that hard of a concept to grasp.\n\nIf you do believe it’s a religion what would be your arguments for it?",
        "created_utc": 1673567726,
        "upvote_ratio": 1.0
    },
    {
        "title": "( “God Nods on His Story about Me” and “God Nods on True Love”)",
        "author": "Dreconsult_agency",
        "url": "http://www.godnods.net",
        "text": "",
        "created_utc": 1673560128,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to believe in Jesus but I just can't force it anymore",
        "author": "FarShirt1946",
        "url": "https://www.reddit.com/r/religion/comments/10aazsl/i_want_to_believe_in_jesus_but_i_just_cant_force/",
        "text": "[removed]",
        "created_utc": 1673558248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please take this survey!! This is really important for a good grade",
        "author": "Primary_Wafer_6039",
        "url": "https://www.reddit.com/r/religion/comments/10aavfw/please_take_this_survey_this_is_really_important/",
        "text": "[removed]",
        "created_utc": 1673557962,
        "upvote_ratio": 1.0
    },
    {
        "title": "my top 3 reasons why i believe in God. what about you",
        "author": "SignatureDesigner826",
        "url": "https://www.reddit.com/r/religion/comments/10aa25z/my_top_3_reasons_why_i_believe_in_god_what_about/",
        "text": "1 whole of universe and everything in it, makes me think how unimaginably big God Himself must be.\n\n2 i love praying to God\n\n3 religion, how it gave me more information about God and his attributes",
        "created_utc": 1673556037,
        "upvote_ratio": 1.0
    },
    {
        "title": "was my religion spiritualism? before i converted to an abrahamic religion.",
        "author": "SignatureDesigner826",
        "url": "https://www.reddit.com/r/religion/comments/10a9ffs/was_my_religion_spiritualism_before_i_converted/",
        "text": "like believing in chakras, meditating,amulets,watching spiritual videos, etc what religion is that? also forgot to mention i always believed in God i just didnt know him.",
        "created_utc": 1673554529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aethiest Ex Telling Son God Doesn't Exist",
        "author": "Feeling_Gap_8096",
        "url": "https://www.reddit.com/r/religion/comments/10a97w4/aethiest_ex_telling_son_god_doesnt_exist/",
        "text": "The title says it all.....\n\nI was raised a Jehovah's Witness (hated it) but luckily am no longer a member of that organisation. I would describe myself as a Christian but I don't go to Church. I also enjoy reading about Buddhism and am a teacher of Mindfulness. I believe in God and Jesus. I celebrate Christmas (despite being raised to believe this is wrong and 'Pagen'). \n\nAnyhow, my ex is an Aethiest and follows Richard Dawkins. In fact, he has multiple copies of The God Delusion (how he thinks this obsession is any different from a person reading and believing religious texts is beyond me?). He takes Dawkins writings as gospel (scary I know).\n\nAt Christmas, he told our son there is no God. That God doesn't exist and so on. I'm so angry. My son has been questioning this since. What next? He won't believe I'm Heaven. He won't believe in Jesus. Now, given I was indoctrinated against my will as a child, I am not pushing Christianity on to my son (his school does though!) but, still, I really wanted him to believe. I believe he's too young to be questioning God (he's five) and having his beliefs ripped away from him at such a young, impressionable age. \n\nSorry, just wanted to vent.",
        "created_utc": 1673554043,
        "upvote_ratio": 1.0
    },
    {
        "title": "The god of the Bible and jesus sucks! If I keep begging someone in the universe to help me; do I have a better chance to get what I want? The Bible is okay with slavery. It’s a horrible book! Do you think there is a good person in the universe that can help? The god of the Bible is evil and cruel!",
        "author": "Love27373737",
        "url": "https://www.reddit.com/r/religion/comments/10a91l1/the_god_of_the_bible_and_jesus_sucks_if_i_keep/",
        "text": "[removed]",
        "created_utc": 1673553638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neoplatonism in Islamic Thought",
        "author": "dahlenbror",
        "url": "https://www.youtube.com/watch?v=VDfJSbPtAEI",
        "text": "",
        "created_utc": 1673548937,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does your religion say about balance and harmony? What do you think of other religions' view on the subject?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/10a6k2j/what_does_your_religion_say_about_balance_and/",
        "text": "I was only curious because one of the gods I actively worship is Harmonia, daughter of Aphrodite. She embodies harmony, as that is her domain. \n\nModeration is almost a crucial part of Hellenism.\n\nSo what does your religion say specifically about harmony and balance? And what are your views on religions which may offer a different perspective on the subjects?",
        "created_utc": 1673547635,
        "upvote_ratio": 1.0
    },
    {
        "title": "I find the matters regarding Paul the apostle a little confusing",
        "author": "Responsible-Ad-1339",
        "url": "https://www.reddit.com/r/religion/comments/10a5s5e/i_find_the_matters_regarding_paul_the_apostle_a/",
        "text": "So, I beliehe that the argument that Paul could have potentially lied about meeting Jesus is being used over and over again. \n\nFrom what I’ve gathered, Christains firmly believe that Paul saw a vision of him or something along the lines of that. I accept the belief in miracles.\n\n\nHowever, what I find very confusing is the fact that after meeting Jesus that he brought about rules that the religion of Jesus was also meant for Gentiles and that circumcision is no longer necessary.\n\n\nWhat I fail to understand in this case is why Jesus would just not say these thing himself or at least to one of the 12 apostles?\n\nWhy would he make no mention of it and only tell this much later, to a relatively random guy? Wouldn’t his message have been much more powerful if he preached all of that himself? And if Paul later continued that tradition?",
        "created_utc": 1673545779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Lee Strobel convincing?",
        "author": "JumalaYksi",
        "url": "https://www.reddit.com/r/religion/comments/10a48ip/is_lee_strobel_convincing/",
        "text": "[removed]",
        "created_utc": 1673542028,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if God is really evil and sends us to hell for the sake of it after death?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/10a2ols/what_if_god_is_really_evil_and_sends_us_to_hell/",
        "text": "Hi there. This question has been on my mind as of late. \n\nLet’s take religion out of the equation. Let’s say hypothetically there is an evil God or entity out there that enjoys his creation to suffer, and after our deaths we end up in hell no matter what. It doesn’t matter if your good or bad, you end up in hell. \n\nCould a creator like that exist? Could god really be an evil monster who created a hell for us? \n\nHas anyone else had similar thoughts?\n\nDo you think this is likely?\n\nLet me know your thoughts.\n\nPeace to you👍",
        "created_utc": 1673538229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient Egyptian conception of the soul",
        "author": "ptahhotep_",
        "url": "https://en.wikipedia.org/wiki/Ancient_Egyptian_conception_of_the_soul?wprov=sfla1",
        "text": "",
        "created_utc": 1673529199,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's All Right With Me lyrics meaning - Tom Waits",
        "author": "Ready-Ad-4549",
        "url": "/r/LyricalDrugs/comments/108hx8p/its_all_right_with_me_lyrics_meaning_tom_waits/",
        "text": "",
        "created_utc": 1673528930,
        "upvote_ratio": 1.0
    },
    {
        "title": "At the end of the day, the idea of one true source god is another massive deception until we get all of our memories back.",
        "author": "matrixprisoner",
        "url": "https://www.reddit.com/r/religion/comments/109w0zm/at_the_end_of_the_day_the_idea_of_one_true_source/",
        "text": "\n\n\n\n\nIt's like the system saying to you, \"so you don't accept the gods from the religions we created and you don't buy into the science-religion? No worries, we got you covered; here is your take-home new age source god package.\" When it comes to what we've learned form the soul trap theory, the belief in the source god and us coming from it is basically as dangerous as believing in any other god in this world as far as I see it.\n\nThe way I look at it is that we do not belong to ANY creator. We are one of the sovereign eternal Prime Creators, always was and always will, and no one, no being, no consciousness is above us and can tell us what to do as we are under no law. I don't believe we are part of anything that is more powerful than us so I don't accept the \"we are split from the source god\" belief which is again a very dangerous belief in my opinion.",
        "created_utc": 1673517770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religions or spiritualities without any practices?",
        "author": "ginjuhavenjuh",
        "url": "https://www.reddit.com/r/religion/comments/109s67u/religions_or_spiritualities_without_any_practices/",
        "text": "For example, Charvaka in India, UG Krishnamurti and his “path”, some instances of zen, etc. any others? Additionally Heathenry could be included as well as long as one holds to its values.",
        "created_utc": 1673503810,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I know before going to a Black Baptist Church",
        "author": "loselyconscious",
        "url": "https://www.reddit.com/r/religion/comments/109s4vo/what_should_i_know_before_going_to_a_black/",
        "text": "Hi everyone, \n\nSo I teach religious school to 11th graders at a Synagogue. Our focus of the year is \"Judaism and World Religions.\"  The Synagogue has a relationship with a Black Baptist Church, and we will be taking the kids to attend services on Sunday (Honestly, I'm not super happy about this. I don't think attending services is the best way to learn and it feels kinda voyeuristic. I would rather have us meet with a pastor or, better yet, other teenagers, but this wasn't up to me)\n\nI want to give the kids some background before they attend. I know a lot about the history of Christianity and Black Churches in the U.S., but it's harder to get information on the practical side of things. What is the dress code? Are there modesty concerns? Are there parts of the service that would not be appropriate to participate in (I've already told them that they shouldn't take communion if it's offered)? I think the service is part of a pulpit exchange with the shul, so I assume they will be explaining stuff, but I'm not entirely sure (this synagogue is not great at communication)",
        "created_utc": 1673503685,
        "upvote_ratio": 1.0
    },
    {
        "title": "church ⛪️ disappointment",
        "author": "Little_Run_9913",
        "url": "https://open.spotify.com/episode/6GgF52j7Y0TCM3ZytjoAcf?si=R_nCUnEAQ6OWGhn29VRsdg",
        "text": "",
        "created_utc": 1673499820,
        "upvote_ratio": 1.0
    },
    {
        "title": "People of Reddit can you help me find who these individuals are?",
        "author": "Zealousideal_Tale441",
        "url": "https://i.redd.it/124gib485lba1.jpg",
        "text": "[removed]",
        "created_utc": 1673499503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christians are in a weird spot these days",
        "author": "Busy_Biscotti6003",
        "url": "https://withstandthenoise.wordpress.com/2023/01/11/the-strange-position-that-christians-are-in-today/",
        "text": "",
        "created_utc": 1673499216,
        "upvote_ratio": 1.0
    },
    {
        "title": "LAS 7 POTENCIAS AFRICANAS",
        "author": "samualfredo",
        "url": "https://youtu.be/CVfCJilrgFE",
        "text": "",
        "created_utc": 1673495478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one who heard screaming at night in Haiti?",
        "author": "CrypticXSystem",
        "url": "https://www.reddit.com/r/religion/comments/109owey/am_i_the_only_one_who_heard_screaming_at_night_in/",
        "text": "[removed]",
        "created_utc": 1673493823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mystical Traditions of all Faiths and Jung with David Tacey",
        "author": "GetTherapyBham",
        "url": "https://www.youtube.com/watch?v=FjGi5k5i53I&amp;lc=UgwqTgw_MxuCNHYJJPN4AaABAg.9kky6LNGrvQ9kl34gC9hxh",
        "text": "",
        "created_utc": 1673493053,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have seen black people mention a difference between (black) Jews and Jewish (there’s an emphasis on the ISH sometimes) people. Can someone explain this to me?",
        "author": "cody12796",
        "url": "https://www.reddit.com/r/religion/comments/109o1vd/i_have_seen_black_people_mention_a_difference/",
        "text": "I have just seen the occasional post on Facebook. That’s about it really…\n\nI am completely clueless on religion in general, but recently I have seemed to develop some interest in it for reasons i won’t get into. \n\nAny information is appreciated and I thank you so much for your time and energy :-)",
        "created_utc": 1673491487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a religion nobody has left after joining?",
        "author": "Professional_Ant_315",
        "url": "https://www.reddit.com/r/religion/comments/109mjff/is_there_a_religion_nobody_has_left_after_joining/",
        "text": "r/exchristian r/exmuslim r/exatheist (not a religion but still) r/exbahai r/expagan r/exjew r/exmormon r/exJW r/EXHINDU r/exbuddhist\n \nWell pretty much everyone’s religion is disqualified. But is there at least one, one out of all the religions in this sub, that you think nobody has apostatized from?",
        "created_utc": 1673487441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has God ever spoken to you (serious)?",
        "author": "PaintingPrize8207",
        "url": "https://www.reddit.com/r/religion/comments/109l2y5/has_god_ever_spoken_to_you_serious/",
        "text": "Either you hear it in your head, or maybe externally, or something else? Have you ever had such an experience?",
        "created_utc": 1673483614,
        "upvote_ratio": 1.0
    },
    {
        "title": "This astrology book could end up being banned in the US because it describes a social and religious system that could replace the constitution and the US dollar. It also explains in Volume I why Israel is not safe",
        "author": "thedowcast",
        "url": "https://www.reddit.com/r/religion/comments/109ja4s/this_astrology_book_could_end_up_being_banned_in/",
        "text": "[removed]",
        "created_utc": 1673479127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which religions do you think are the most charitable?",
        "author": "ZoologyDarwin",
        "url": "https://www.reddit.com/r/religion/comments/109j0h3/which_religions_do_you_think_are_the_most/",
        "text": "Many/most of the world's major religions see charity/philanthropy as a virtue &amp; encourage their members to engage in charitable acts of kindness to those in need. However some religions attach strings to those receiving charitable aid (eg Christian charities encouraging their beneficiaries to convert to Christianity) &amp; other religions aren't known for their charity work at all.\n\nI'm curious to see what you think.",
        "created_utc": 1673478455,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it blasphemous to believe in multiple religions?",
        "author": "KABRA_ANNE42",
        "url": "https://www.reddit.com/r/religion/comments/109i2oa/is_it_blasphemous_to_believe_in_multiple_religions/",
        "text": "[removed]",
        "created_utc": 1673476169,
        "upvote_ratio": 1.0
    },
    {
        "title": "What religion made people change their names to something Korean?",
        "author": "mildredhubb",
        "url": "https://www.reddit.com/r/religion/comments/109fb1p/what_religion_made_people_change_their_names_to/",
        "text": "[removed]",
        "created_utc": 1673469613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't Jesus Christ save the whole world as soon as he himself gained life in this world?",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/religion/comments/109d3kw/why_didnt_jesus_christ_save_the_whole_world_as/",
        "text": "Why didn't Jesus Christ save the whole world as soon as he himself gained life in this world?    \n\nOr    \n Why did he leave this world before he had finished saving everything in this world, even though he could have saved everything without even needing it for a moment?    \nWhy did he spend years on something that should have been finished in an instant, but why did he not complete it?    \n\nPlease provide a logical explanation that does not contradict anything.    \n　　　    \n\nThat's!    \n Please consider the ordeal related as NG answer.",
        "created_utc": 1673464394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hail Satan!!!... ♥",
        "author": "WhyzHeBackNow",
        "url": "https://i.redd.it/8xr25um5zfba1.jpg",
        "text": "",
        "created_utc": 1673463737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reality of Muawviya || Maulana Syed Shahryar Raza Abidi",
        "author": "HaqqiqateHaq",
        "url": "https://youtube.com/watch?v=hQUHwJpUdGg&amp;feature=share",
        "text": "",
        "created_utc": 1673461034,
        "upvote_ratio": 1.0
    },
    {
        "title": "How well do people outside of your religion understand your religion?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/109bcde/how_well_do_people_outside_of_your_religion/",
        "text": "Regardless of how popular or pervasive any religion might be in a certain society, it seems like some people will have, people will always have certain opinion and views on your religion (both true and untrue alike). \n\nBut, in general, how well do people understand the *basics* or your religion?  What's do they get wrong? What do *you* get wrong that you have corrected about",
        "created_utc": 1673460348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lecture 11 Imam Ali as and Quran Nehjul Balaghah || Hafiz Syed Muhammad ...",
        "author": "HaqqiqateHaq",
        "url": "https://youtube.com/watch?v=dr3Qdi-yHFU&amp;feature=share",
        "text": "",
        "created_utc": 1673460173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does the Jewish and Muslim religion seem so depressing while Christianity feels happy?",
        "author": "Fit-Resolution-5747",
        "url": "https://www.reddit.com/r/religion/comments/1099prx/why_does_the_jewish_and_muslim_religion_seem_so/",
        "text": "[removed]",
        "created_utc": 1673456556,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you see religion in the far future?",
        "author": "Professional_Bug_256",
        "url": "https://www.reddit.com/r/religion/comments/1099382/how_do_you_see_religion_in_the_far_future/",
        "text": "Some people say religion will disappear in the future, but I disagree.\n\nAllow me to make an analogy to monarchism.\n\nI think religion will disappear as a concept like Monarchy technically disappeared in Rome.  The Roman Republic was a response to the oppression of monarchism, and yet the Republic and the Empire itself was often a de-facto monarchy. They just did not call it as such. In Medieval Times, Western Christians realized this so they drop the facade and accepted the monarchy that was already there anyway, albeit the empire was already split.\n\nSo I suspect a cult-like structure will have the spiritual and social power for centuries but people will not call it religion. I think it will probably be more a physical religion, in the sense they probably will provide drugs or technology to generate a meaningful experience in people. I have no idea how they will do it, but virtual worlds and neural stimulation seem to be the path.\n\nPeople will claim that the problem with this is that this cannot be considered religion if it is not supernatural, but from the subjective perspective it hasn't to be. They may use drugs to create heaven on earth and it will be as valid experience as the one expected supernaturally. We also had religions that used drugs or herbs to generate religious experiences, maybe such religion will be an iteration of such.\n\nWhat do you think about religion 10 thousands or even 50 thousands years in the future?",
        "created_utc": 1673455040,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is not wise to make the assumption that all religion is \"unhealthy\".",
        "author": "ScreechOwlLilith",
        "url": "https://www.reddit.com/r/religion/comments/1098itu/it_is_not_wise_to_make_the_assumption_that_all/",
        "text": "In my experience, the atheists on Reddit make so many generalized statements about religious people, and it's extremely cringe and reductive. Religion itself is not problematic. It only becomes problematic if it manipulates a person's understanding of right and wrong.\n\nBefore you start accusing me of being a \"Christian with an agenda\", I'm not. I have unconventional views. I'm a theistic Satanist who respects all religions, including Christianity. There is nothing wrong with showing reverence to a deity, as long as it doesn't have a negative impact on your moral judgements or your decision-making. This is partly the reason why I'm a theistic Satanist. In the Garden of Eden, Satan encouraged humans to eat the forbidden fruit containing the knowledge of good and evil. When humans ate this fruit, they obtained a conscience of their own and the ability to think for themselves.\n\nNow before you start arguing with me about how the Book of Genesis is nothing but a \"fairy tale\", let me tell you this: I simply find the “theism versus atheism” debate to be extremely pointless, considering how both conclusions are equally probable, and people will come to different conclusions based on different experiences. Therefore, the better question to ask yourself is whether you find more *value* in theism or atheism. And for a majority of people, religion is a source of inspiration, motivation, and purpose. Therefore, I encourage you all to respect religions and not assume that all of it is \"unhealthy thinking\" when it actually promotes positive thinking for a lot of people.",
        "created_utc": 1673453654,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is not wise to make the assumption that all religion is \"unhealthy\".",
        "author": "EileenTheEnlightened",
        "url": "https://www.reddit.com/r/religion/comments/1098ew2/it_is_not_wise_to_make_the_assumption_that_all/",
        "text": "[removed]",
        "created_utc": 1673453382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Converts: How old were you when you accepted your religion?",
        "author": "Lailahaillarhllor",
        "url": "https://www.reddit.com/r/religion/comments/1097bok/converts_how_old_were_you_when_you_accepted_your/",
        "text": "All traditions are welcome. I'm mostly interested in age at the time of conversion rather than specific reasons (though of course they're related). \n\nI became Muslim in 2014 when I was 19, and since then I've connected with many other converts on social media. Before I moved to a Muslim-majority country to study I had very few Muslim friends in the southern U.S., so virtual connection was especially important to me. Some time ago I made a post on FB asking what age people were when they converted to Islam. 175 convert friends of mine responded, 145 men and 30 women.\n\nObviously this isn't a scientific study *at all* and this data isn't representative of anything but a small sample of my FB friends, but I still found it interesting. All respondents are Muslim converts from the U.S. and Europe. I omitted the many responses from born Muslims who became religious later in life, as this is a different (but still fascinating) question.\n\nThought it might be of interest to some and was interested to hear experiences from other traditions ✌🏻\n\nMen\nTotal responses: 145\nAverage age of conversion: 20\nMedian: 22\nMode: 19\nOldest (at conversion): 60\nYoungest (at conversion): 12\n\nWomen\nTotal responses: 30*\nAverage age of conversion: 26\nMedian: 21\nMode: 20\nOldest (at conversion): 67\nYoungest (at conversion): 15\n\n*Several academic studies have shown that young women are the largest group of Muslim converts in the west, significantly outnumbering men. The few responses from women on my post is just because I'm a young guy and I'm connected with fewer women on social media.",
        "created_utc": 1673450665,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the point to inter-faith dialogue?",
        "author": "IXBlackHeartXI36",
        "url": "https://www.reddit.com/r/religion/comments/1095ndm/whats_the_point_to_interfaith_dialogue/",
        "text": "I used to just blindly accept it when I was younger, but now that I'm older and more mature, I don't get the point in it. In Christanity, just for an example, the religion teaches that anyone who isn't Christian is going to hell. How then can a Christian be friends with a non-Christian knowing/believing that their friend is going to hell for not being Christian? This is essentially denialism. You're ignoring a tenant of your religion just so you can be friendly with people who you see as doing something dangerous. \n\nI've heard of it going well, but honestly I can't imagine how. How can people of conflicting religious beliefs get along while still following their religion? As said, Christians are having to ignore the tenants of their own religion to remain on good terms with non-Christians. \n\nI mean on offense, I just can't imagine how this could work without people essentially committing heresy against their own religion.",
        "created_utc": 1673446271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some people believe religion should be an entirely private affair. Yet many religions rely on proselytizing. So how are they supposed to survive into the future?",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/religion/comments/1095j5k/some_people_believe_religion_should_be_an/",
        "text": "Some atheists will say \"I don't want Jehovah's Witnesses coming to my doorstep\", or \"I don't want a Muslim to tell me I'm a bad person because I don't submit to Allah\". \n\nYet, those religions and others have to proselytize and spread their messages and beliefs in order for the next generation to pass on the teachings. And we know more and more people are becoming atheist and irreligious. So how are faiths of old supposed to have a future?",
        "created_utc": 1673445965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a specific ancient religion",
        "author": "OrenjiD",
        "url": "https://www.reddit.com/r/religion/comments/1094kn2/need_help_finding_a_specific_ancient_religion/",
        "text": "I remember there was one religion where I believe it was created before the ancient egypt times. All I remember was that it was middle eastern and had drawings in a specific way. The depictions of animals are not realistic, there are mostly of straight lines and looks compact. I remember, and this maybe wrong, but there was a depiction of a dragon, really compact almost cube-like, with its head tilted slightly upwards and breathing fire. An it was quite colorful. Maybe it was a movie depiction of their art but that's the only thing I remember about it. I think the name of it had a C X and Z near the start of it (not in order) and other drawings they may have had was birds I think.",
        "created_utc": 1673443338,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far are theists willing to go with \"God has the authority to do whatever he wants\"?",
        "author": "AjaxBrozovic",
        "url": "https://www.reddit.com/r/religion/comments/1093fbg/how_far_are_theists_willing_to_go_with_god_has/",
        "text": "So theists are often asked why God did something which a person feels is unfair, such as deciding to kill people through a tsunami. The response by the theists is usually \"He's God, he can do whatever he wants\". But I'm wondering if there is a limit to this response. \n\nSuppose the 'test' of life is over, and God is now deciding between who goes to heaven or hell. Let's say you have been good all your life. You took care of your family, fed the poor, never stole anything, and worshipped God whenever you had the time. But at the end of your life, God simply says \"you're ugly and I feel like throwing you to hell coz I can. What you gonna go about it?\"\n\nAre you still going to say this is fair because God can do whatever he wants? Will you still have a love for God?",
        "created_utc": 1673439784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jealousy (Hasad) is the Disease of Soul",
        "author": "karimdul",
        "url": "https://youtube.com/watch?v=1zsBfU8taxc&amp;feature=share",
        "text": "",
        "created_utc": 1673429935,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens to the Gods in a religion, that is no longer practiced by any humans?",
        "author": "False_Target_9619",
        "url": "https://www.reddit.com/r/religion/comments/1090b55/what_happens_to_the_gods_in_a_religion_that_is_no/",
        "text": "[removed]",
        "created_utc": 1673428049,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be a founder of a new religion. Could my religion be real? Maybe religions will come out again someday. What do you think? Do other people go through extreme pain like myself?",
        "author": "HeroshiWarLord",
        "url": "https://www.reddit.com/r/religion/comments/10903qr/i_want_to_be_a_founder_of_a_new_religion_could_my/",
        "text": "[removed]",
        "created_utc": 1673427241,
        "upvote_ratio": 1.0
    },
    {
        "title": "what would be the consequences I have to face if I don't follow your religion?",
        "author": "Ralative-Meadow-1881",
        "url": "https://www.reddit.com/r/religion/comments/108yab2/what_would_be_the_consequences_i_have_to_face_if/",
        "text": "[removed]",
        "created_utc": 1673420392,
        "upvote_ratio": 1.0
    },
    {
        "title": "according to your religion, who will go to hell and who will go to heaven?",
        "author": "Ralative-Meadow-1881",
        "url": "https://www.reddit.com/r/religion/comments/108y8lr/according_to_your_religion_who_will_go_to_hell/",
        "text": "[removed]",
        "created_utc": 1673420216,
        "upvote_ratio": 1.0
    },
    {
        "title": "fuck the Holy Spirit yeah",
        "author": "VoluntarilyAvailable",
        "url": "https://www.reddit.com/r/religion/comments/108wbbx/fuck_the_holy_spirit_yeah/",
        "text": "fuck the Holy Spirit\n\nyeah",
        "created_utc": 1673413992,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you be forgiven for blasphemy against the Holy Spirit?",
        "author": "VoluntarilyAvailable",
        "url": "https://www.reddit.com/r/religion/comments/108uvxl/can_you_be_forgiven_for_blasphemy_against_the/",
        "text": "why not ?",
        "created_utc": 1673409686,
        "upvote_ratio": 1.0
    },
    {
        "title": "What made the profet Muhammed admirable?",
        "author": "Frasenarinteupptagen",
        "url": "https://www.reddit.com/r/religion/comments/108so4y/what_made_the_profet_muhammed_admirable/",
        "text": "I'm an atheist/agnostic though I've always been interested in religion. I think I understand the core idea of why Jesus is admired by Christians (though correct me if I'm wrong): he took upon himself the sins of his surroundings and thus didn't perpetuate the cycle of evil. Essantially, the bad things he endured died with him.\n\nDoes Muhammed represent something similar or is there another reason to why he is revered?",
        "created_utc": 1673403447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rest in Hell george pell",
        "author": "hollydrops",
        "url": "https://www.reddit.com/r/religion/comments/108r7zu/rest_in_hell_george_pell/",
        "text": "[removed]",
        "created_utc": 1673399631,
        "upvote_ratio": 1.0
    },
    {
        "title": "God doesn’t answer my prayers. It’s killing me inside. What can I do? If Jesus doesn’t answer that means he never existed? Historians lied and are saying he existed even though they know he didn’t? I’m confused. I pray everyday. I’ve been praying for years and he hasn’t answered my prayers.",
        "author": "Love27373737",
        "url": "https://www.reddit.com/r/religion/comments/108qqto/god_doesnt_answer_my_prayers_its_killing_me/",
        "text": "[removed]",
        "created_utc": 1673398375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working Fans Presents...Naomi from Cult in Connecticut",
        "author": "WorkingFansPodcast",
        "url": "https://youtu.be/1wroswgty6c",
        "text": "",
        "created_utc": 1673398141,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't think I care about 'truth', 'logic', 'God', etc. anymore",
        "author": "ReturnOfTheKing123",
        "url": "https://www.reddit.com/r/religion/comments/108qd4v/i_dont_think_i_care_about_truth_logic_god_etc/",
        "text": "Hi. I'm putting this out there for anyone it speaks to. I've been going down a bit of a rabbithole (again) lately as regards religiosity. Anyway, of late I am miserable. (I am not seeking pity, it's just to set the context). And it has occurred to me that obsessing over metaphysics, theology, and all that in part gave me an artificial high. But due ot a certain thing on my mind I have become miserable. And I have noticed that when I become miserable, my interest in 'God' and so on pretty quickly evaporates. What previously seemed 'meaningful' to me is revealed as not helping me at all: I am still living at home with my Parents; I still have no social life; I still have no girlfriend; and so forth. So basically theology and so on has just been a convenient distraction before and after Christmas.\n\n&amp;#x200B;\n\nBut what has kept pulling me to the whole religion thing of late has been this sense of where does truth come from? Where does logic come from? I don't think mere biological machines, cells or atoms can perceive truth or do logic. So where do they come from? And so I have supposed that they are metaphysical. But you know none of this makes me any less miserable. I cannot lie in bed tonight with 'God', 'truth' nor 'logic'. I am not excitedly awaiting texts from 'God', 'truth' nor 'logic'. They just give me an intellectual satisfaction. But that's it.\n\n&amp;#x200B;\n\nSo I wonder: why do I care for these things? Why do I seemingly slave over these questions? I do not get community out of them; my conclusions very seldom lead me to any establoshed religion, so I am always an outcast; so there is not that typical benefit of religious thought. Instead I end up with fifty--at one extreme time maybe--computer tabs open to read; and I did read most of them. But my 'God' is so abstract as to be utterly useless to me, other than filling a whole in an intellectual framework. Who am I kidding? I am reminded of the words of Ecclesiastes, which roughly go like: the wise and the fool all end up in the same grave. I can stress myself out over these things and write ridiculously long essays as I formulate my ideas, but I will die the same way as someone who does not. Apparently the average life is about 80 years, which is apparently 4000 weeks. Men however can often live only 50 years, I have seen this. I am 25. So why proceed with these sort of enquiries?\n\n&amp;#x200B;\n\nI am not even totally certain of the validity of 'truth' and 'logic'. Biological machines or not aside, everything I know of the 'objective world' comes through my 'subjective self'. So beyond the obvious 'this box is red' (because I experience redness with the boxness), can I really say much of the world? Is all of 'truth' equally valid? Or is abstract 'truth' actually nonsense that we have deceived ourselves into believing? Kind of like if you make a theory based on a theory based on a theory, etc., at what point should we trust the end theory anymore? What if 'truth' is largely just a self-referential language that makes sense for us as individuals or as a collective but doesn't necessarily correlate to much external, at least once we start getting abstract--as in, this entire sentence may make sense to you, but does it actually hold 'objective truth'? Does it really matter? If it is not going to make me happier, will any of this matter on my deathbed? Why does it matter to me now? Why am I plagued with this over-analysing tendency that my Family and many of my Friends are not? Being 'intellectually gifted' is a curse in many ways if you have to live in a world like ours. There is a reason 'intellectually gifted' people are apparently more 'existentially depressed'; I have been feeling that a bit lately, which plays into my misery--but honestly the lack of social life and girlfriend play into it a hell of a lot more.\n\n&amp;#x200B;\n\nHonestly I think I have an abusive relationship with 'truth' and 'logic'. I have been treating them like deities. Even when I was a hard atheist I implicitly treated them so. You do hear atheists harp on about 'rationality'. Well now I became a 'rationalist' and argued against those same atheists that empiricism is not very rational because it does not provide an origin for Reason. But what is all this waffling nonsense (haha)? How on earth does any of this make my life better? Is a sheep cursed for not knowing all of this? Ought a child to know all of this?\n\n&amp;#x200B;\n\nMaybe there is a tendency among some, especially isolated, intellectual types to think they are somehow a little better than normal people--at least I have gotten like that at times. Honestly, in a world like ours, I am not so sure of that... I have all these 'sophisticated' abilities, but look at me man: they just make me think staying indoors with no life is meaningful, when it sure as hell is not. On my death bed, will I glad to think I have thought and done all of this? I can remember at least one time when I thought to myself, 'I am enjoying myself so much right now I could die happy'--and I promise you, it was not spent doing philosophy.\n\n&amp;#x200B;\n\nSo I think I don't care about 'truth' nor 'logic' anymore, beyond the ways I have to. The world is absurd. Existence is absurd. I suffer more than I feel I should, and I can't see any point to it; many people and animals suffer far, far worse. But to the extent that 'truth' and 'logic' don't people me alleviate either, then they are useless. I wrote a poem on my profile where I likened 'Truth' to a cruel wife that had deprived me of my childhood imagination. I think maybe I need a followup poem in which I divorce 'Truth' altogether. Or maybe not even that, because that won't make me any less miserable, ha ha.\n\n&amp;#x200B;\n\nAnd 'God'. 'God' is too abstract an idea for me to care. Like the 'universe'. If I cannot fit it between my eyeballs, maybe it is not worth my consideration. I long ago realised that even if I am a wee bit anxious about my own mortality, I don't care about any ideas of 'afterlife', partly because I see the 'self' as perishing with the brain--even if my 'consciousness' does not--, and you have to die to get to any 'afterlife' and, despite all my misery, I am not really wanting that just yet.\n\n&amp;#x200B;\n\nSo, ha ha, maybe you'll be seeing me less around here, at least for now.\n\n&amp;#x200B;\n\nI hope this was somehow useful to somebody. I think it is maybe liberating.",
        "created_utc": 1673397359,
        "upvote_ratio": 0.99
    },
    {
        "title": "Church of Scotland",
        "author": "Prudent_Aside4498",
        "url": "https://www.reddit.com/r/religion/comments/108q0n3/church_of_scotland/",
        "text": "[removed]",
        "created_utc": 1673396493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i still a Muslim",
        "author": "gtu6fj8fgj",
        "url": "https://www.reddit.com/r/religion/comments/108p1x2/am_i_still_a_muslim/",
        "text": "[removed]",
        "created_utc": 1673394171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring the Role of Religion in Modern Society: Is Pure Rationality the Answer?",
        "author": "isitool8",
        "url": "https://www.reddit.com/r/religion/comments/108ofg1/exploring_the_role_of_religion_in_modern_society/",
        "text": "[removed]",
        "created_utc": 1673392673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Perfection Possible? A Debate between a Reformed Baptist Pastor and a Methodist Bishop.",
        "author": "Reformed2ndLBCF",
        "url": "https://www.youtube.com/watch?v=9fz3kXT7Rq0&amp;t=379s",
        "text": "",
        "created_utc": 1673389122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conexion angelical",
        "author": "Ok_Goose_1789",
        "url": "https://go.hotmart.com/L78271584O",
        "text": "",
        "created_utc": 1673386270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noah's Ark has been Found",
        "author": "j0tar0__kujo",
        "url": "https://youtu.be/32WSXYQp1BY",
        "text": "",
        "created_utc": 1673384390,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would one go about this...?",
        "author": "CoconutBananas83",
        "url": "https://www.reddit.com/r/religion/comments/108k4r9/how_would_one_go_about_this/",
        "text": "How would one go about reading a Bible for someone who has never read one? Is verbiage easier in some than other versions? I'm just looking to comfort in religion for the first time, as I just lost my mom 2 days ago and don't know what to do or feel. I feel as though I should try and get right with the Lord so I can see her again. Please no hatred. I'm going through enough already.",
        "created_utc": 1673382771,
        "upvote_ratio": 1.0
    },
    {
        "title": "is Bible more relevant to today's world or Qur'an?",
        "author": "NicolaCrUwmanie",
        "url": "https://www.reddit.com/r/religion/comments/108jb51/is_bible_more_relevant_to_todays_world_or_quran/",
        "text": "I haven't finished reading Qur'an, yet it didn't sit as well as bible with me. \nIn Bible we see more “Forgiveness” being encouraged while in Qur'an there's a lot of talk about hell and being punished and that our major purpose is to worship. \nBut in today's social and political world, people are not afraid anymore, even in the most Islamic countries as Iranians have risen against their government and leader, even though in the Qur'an, there's mention of rising against a false leader, but the instrument of Qur'an seems to be pressure! \nAs a society, and as people, a person, which one would be a better answer to us (I'm not talking about a specific religion fits the mind of a person, no, I'm talking about man, person, in modern day society) and has stayed more relevant to this day, rather working best for the past generations?",
        "created_utc": 1673380869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any religions forbid head coverings or require rings?",
        "author": "Umpteenth_zebra",
        "url": "https://www.reddit.com/r/religion/comments/108j01m/do_any_religions_forbid_head_coverings_or_require/",
        "text": "I know many religions that require head coverings or forbid jewellery, but I am looking for the opposite. Google wasn't helpful, so can any of you tell me one?",
        "created_utc": 1673380158,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens to murderers according to the bible/christians?",
        "author": "karlsgrenstrom",
        "url": "https://www.reddit.com/r/religion/comments/108gys7/what_happens_to_murderers_according_to_the/",
        "text": "[removed]",
        "created_utc": 1673375221,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the data that led scholars to arrive at the Documentary Hypothesis? How does the Documentary Hypothesis explain these data?",
        "author": "Individual_Bank8694",
        "url": "https://www.reddit.com/r/religion/comments/108g7lw/what_is_the_data_that_led_scholars_to_arrive_at/",
        "text": "Title",
        "created_utc": 1673373439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something to say for religious people",
        "author": "Capable_Ad2373",
        "url": "https://www.reddit.com/r/religion/comments/108g007/something_to_say_for_religious_people/",
        "text": "[removed]",
        "created_utc": 1673372936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did God make the world in which animals have to eat each other to survive?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/108f677/why_did_god_make_the_world_in_which_animals_have/",
        "text": "\nThis is the biggest problem I have. Why would God allow his creation to eat each other to survive? Why does there have to be pain and suffering? \n\nWhy couldn’t he made a world where we fed without inducing pain to another being to feed us? \n\n\nDo you think it’s immoral to eat meat? \n\n\nWhat’s your solution to this problem? \n\nThanks",
        "created_utc": 1673370956,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOLDIERS",
        "author": "beyond_everything_",
        "url": "https://www.reddit.com/r/religion/comments/108e3b9/soldiers/",
        "text": "[removed]",
        "created_utc": 1673368367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is New Age religion so monotheistic?",
        "author": "Professional_Bug_256",
        "url": "https://www.reddit.com/r/religion/comments/108dlh5/why_is_new_age_religion_so_monotheistic/",
        "text": "New Age beliefs often borrow a lot of things from Buddhism, and recently more from Hinduism. Some examples are belief in reincarnation, chakras, karma, etc.\n\nI follow a lot of New Age speakers and thinkers and they almost all are universally theistic. It is weird considering that Hinduism is polytheistic and Buddhism and Jainism are non-theistic. Why did the New Age movement default to Monotheism?\n\nEven those who do claim to believe in some Hindu gods see them more like forces or shapes of the same divinity. They also often do not believe God is male or female. Regardless, they often borrow concepts from Abrahamic faiths too, yet they romanticize Eastern beliefs more.\n\nOf course, not all New Age believers believe the same. Some may be deistic, neo-pagan, polytheistic, etc. but it seems that the consensus is some kind of monotheism with Dharmic terms and concepts.",
        "created_utc": 1673367139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a person go to hell, if they killed someone by accident?",
        "author": "Gillyboyyyy2001",
        "url": "https://www.reddit.com/r/religion/comments/108cfvk/would_a_person_go_to_hell_if_they_killed_someone/",
        "text": "Would do they?",
        "created_utc": 1673364260,
        "upvote_ratio": 1.0
    },
    {
        "title": "What music instruments are most used in your religion?",
        "author": "kionake",
        "url": "https://www.reddit.com/r/religion/comments/108amhv/what_music_instruments_are_most_used_in_your/",
        "text": "I see one thing most religions have in common are music and traditional instruments are used. On mine, the most common is the \"Atabaque\", but there are others, all percussion.\n\n[Here is an example](https://youtube.com/shorts/gM7urdfdq9A?feature=share)",
        "created_utc": 1673359495,
        "upvote_ratio": 1.0
    },
    {
        "title": "pics of the holiest city in the big 3 religions (Christianity, Islam, and Hinduism)",
        "author": "inchresting_images",
        "url": "https://imgur.com/a/ykEsGWO",
        "text": "",
        "created_utc": 1673358308,
        "upvote_ratio": 1.0
    },
    {
        "title": "What religion, that is not christian, is traditional where you come from?",
        "author": "kionake",
        "url": "https://www.reddit.com/r/religion/comments/1089bkn/what_religion_that_is_not_christian_is/",
        "text": "Here, there are many afro-brazilian like candomblé, umbanda and kimbanda. There is, thogh, some umbanda lines that are more of a christian thing.",
        "created_utc": 1673355801,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think Sikhism has much authenticity",
        "author": "Total-Nerve-1033",
        "url": "https://www.reddit.com/r/religion/comments/1088w8h/i_think_sikhism_has_much_authenticity/",
        "text": "[removed]",
        "created_utc": 1673354510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religious song lyrics",
        "author": "truthandfreedom3",
        "url": "https://www.reddit.com/r/religion/comments/1086iuh/religious_song_lyrics/",
        "text": "[removed]",
        "created_utc": 1673346343,
        "upvote_ratio": 1.0
    },
    {
        "title": "The concept of the soul and human consciousness",
        "author": "Professional_Bug_256",
        "url": "https://www.reddit.com/r/religion/comments/1081lbg/the_concept_of_the_soul_and_human_consciousness/",
        "text": "It seems that early conceptions of the soul were akin to just \"breath\". In fact, in many languages, the word \"I\" seems to be etymologically related to breathing. If an animal or person lost breath, that means that the individual soul has left the body. Seems death seems to be a no-return point of transition, people assumed that something invisible left the body.\n\nHowever, it is clear that this concept of the soul became blurry as it seems that plants did not breathe and yet they were alive and died too. Tribes also probably noticed that the fetus moved even when technically it was not breathing. Therefore, it seems that the concept of soul existed but it was not any more as close to breathing.\n\nSome cultures, however, seem to reserve the concept of the soul or spirit to humans only (and maybe a few animals). Abrahamic religions seem to be emphatic on this. I wonder if the implication of this is that maybe the concept of the soul in more abstract non-animistic supernatural religions is just another word for consciousness.\n\nThe irony is that, although consciousness is almost universally accepted as existing, we do not know if others have it and we do not know exactly what it is.\n\nIf consciousness is an illusion, who or what is being deluded? If it is a neural activity, then does that mean every atom is conscious and it adds up? If it is an interaction between cells or atoms, how many cells are needed to interact for consciousness to arise? How can we observe such interaction besides it observing itself? What if consciousness is just a fundamental force or field such as space? If consciousness is only data, does that mean that if I print all that I am in a book then I'm still conscious as data is still there? This also creates many paradoxes for purely materialist or purely idealist thinkers. I may be t[he only one that has one](https://en.wikipedia.org/wiki/Solipsism) and [everyone else is just a robot](https://en.wikipedia.org/wiki/Solipsism). \n\nAfter all, we do not know what [qualia](https://en.wikipedia.org/wiki/Qualia) is, and yet it seems to be the fundamental substance of all final understanding. \n\nThe point is that our ancestors did not need any scientific method or tool to study consciousness, just as we do not have any scientific method or tool to study it yet. We do not know if it can even be studied scientifically. Maybe consciousness is like numbers or forms. Our ancestors probably had the same questions we have now on consciousness, and it makes sense for them to have used concepts such as soul to understand it better.",
        "created_utc": 1673328375,
        "upvote_ratio": 1.0
    }
]