[
    {
        "title": "If Jesus was in a vulnerable state on earth then who could stop god for destroying him?",
        "author": "Iknowreligionalot",
        "url": "https://www.reddit.com/r/religion/comments/zi662b/if_jesus_was_in_a_vulnerable_state_on_earth_then/",
        "text": "[removed]",
        "created_utc": 1670712534,
        "upvote_ratio": 1.0
    },
    {
        "title": "My last name means \"Son of Thor\" in Norwegian",
        "author": "PierrePoilievreFan",
        "url": "https://www.reddit.com/r/religion/comments/zi65nw/my_last_name_means_son_of_thor_in_norwegian/",
        "text": "[removed]",
        "created_utc": 1670712507,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Trial of Jesus - An Alternative Timeline",
        "author": "Alex_Tsit",
        "url": "/r/Bible/comments/zi2jn2/the_trial_of_jesus_an_alternative_timeline/",
        "text": "",
        "created_utc": 1670710997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please clarify to me",
        "author": "cb0mss",
        "url": "https://www.reddit.com/r/religion/comments/zi4uif/please_clarify_to_me/",
        "text": "Ok so Yehovah is God, but why did he waited thousands of years to send Jesus and teach mankind whats wrong and whats right?",
        "created_utc": 1670709404,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to religion questions",
        "author": "LostSoul2137",
        "url": "https://www.reddit.com/r/religion/comments/zi2mof/new_to_religion_questions/",
        "text": "21(f) I might say some incorrect things as I’ve never really been into religion and I’ve never read anything from the Bible. These questions are going to seem stupid so I apologize in advanced.\n I don’t have a specific religion but I am religious and spiritual. I kinda became spiritual first. I know this is going to sound ridiculous but I went through a very rough period in my life for 3 years and I started thinking more about God and Jesus and listening to the pastor at my mothers church. That really helped me get passed the darkest part of my life. However I’m not here to talk about my exact beliefs. I’m thinking about being baptized, growing up we weren’t religious but god meant something to us but I was raised to fear religion. Now I’m curious and want to know more. I’m thinking about being baptized because it just feels right, I believe Jesus along with some spiritual help, helped me a lot this past year so I feel like being baptized is a way to say I accept and appreciate their support and guidance. I could be wrong about everything, I’m extremely uneducated when it comes to all of this. \n\nQuestions \n\n- What exactly does a baptism do? \n- Do I have to join a certain religion to be baptized? \n- Can I be baptized but still believe in evolution? \n- What’s a good beginner audio Bible?",
        "created_utc": 1670704158,
        "upvote_ratio": 1.0
    },
    {
        "title": "MetaModernism a Post-Post-Modernism and The Fear of God",
        "author": "PerfluorooctaneS",
        "url": "https://youtu.be/uwS_D6r4R24",
        "text": "",
        "created_utc": 1670699989,
        "upvote_ratio": 1.0
    },
    {
        "title": "11,000-Year-Old Carving of Man Holding His Penis, Surrounded by Leopards, Is Oldest-Known Depiction of a Narrative Scene",
        "author": "needle-roulette",
        "url": "https://www.artnews.com/art-news/news/11000-year-old-carving-of-man-holding-his-penis-is-oldest-known-depiction-of-a-narrative-scene-turkey-1234649681/",
        "text": "",
        "created_utc": 1670699613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Jews and Muslims believe in guardian angels?",
        "author": "Volaer",
        "url": "https://www.reddit.com/r/religion/comments/zi0ihh/do_jews_and_muslims_believe_in_guardian_angels/",
        "text": "Title says it all. I was curious whether Jews and Muslims have a similar concept in their faith tradition.",
        "created_utc": 1670699044,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Islam religion?",
        "author": "asksaint",
        "url": "https://asksaint.com/what-is-the-islam-religion/",
        "text": "",
        "created_utc": 1670696630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deus e soberano",
        "author": "CurrencyOk3885",
        "url": "https://youtube.com/shorts/HMwun_WRd6I?feature=share",
        "text": "[removed]",
        "created_utc": 1670695255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are differences in worldview fought rather than respected and/or tolerated at least?",
        "author": "SnooSquirrels3639",
        "url": "https://www.reddit.com/r/religion/comments/zhyu4f/why_are_differences_in_worldview_fought_rather/",
        "text": "What is morality and how can it be universal?And what is evil and how can it be universal?I feel like there have been efforts recently to market Islam by certain parties and while  this might go into decreasing the rampant islamophobia in the western world I also see it being apologetic and evolving into a “progressive” version of Islam that fits in with “western values”. \n\nYou can already kind of see this in Muslims of the newer generations, mainly in the west but in Muslim countries as well. they will argue for Islam without knowing what they’re arguing and they will contradict Islam in the face an apparent non-negotiable moral limit set by western standards, while maintaining their stance for Islam , without creating a coherent argument with even just a basic level of citations for why they are “apologising”… \n\nThe term “apologetic” being thrown towards Muslim arguments that don’t fit the image of Islam as seen by the west, is quite telling as well. Why is there a need to apologise for anything in the first place? \n\n1.Who created and/or authorised this universal moral code? \n\n2. Why is this one better than that one or the other one? Who gets to decide? \n\n3.a/ In a hypothetical scenario where intelligent extra terrestrial life exists, and they visit our planet will they be subject to this moral code? \n\n3.b/ What if we visit them, will we be subjects to theirs(if they have it) or to the one we know? \n\n3.c/ If they do have one, and it clashes with the one we introduce, will we force it upon them through violence if necessary? even if it’s in their own planet? \n\nFunny &gt;!actually sad!&lt; how you can answer all parts of that exact hypothetical, minus the extraterrestrial part, while citing history books. And the answers are grim… \n\nI am obviously writing this from my point of you as a Muslim , but this applies to people from all different religions and traditions. Why can we not each live in our own world and cooperate and communicate with each other with respect without politicising every single thing and turning everything into an unhealthy debate that spirals into animosity?",
        "created_utc": 1670695000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sabians",
        "author": "Equivalent_Drama2424",
        "url": "https://www.reddit.com/r/religion/comments/zhxk76/sabians/",
        "text": "Can someone give a description of the beliefs of Sabians (preferably with sources)? Specifically, the beliefs of the Sabians mentioned in the Quran.",
        "created_utc": 1670691933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need inputs (preferably from Indians), on your opinion regarding state religion",
        "author": "Frog-2021",
        "url": "https://docs.google.com/forms/d/e/1FAIpQLSfsAQnTRd3kEjr65T-InM_3XLa73RRc8Huq_0U0fklWemiR4g/viewform?usp=sf_link",
        "text": "",
        "created_utc": 1670691848,
        "upvote_ratio": 1.0
    },
    {
        "title": "THEORY OF EVERYTHING incorporating almost all religion, philosophy and science",
        "author": "According_Boss8421",
        "url": "https://i.redd.it/pekeocz4m35a1.jpg",
        "text": "",
        "created_utc": 1670690237,
        "upvote_ratio": 1.0
    },
    {
        "title": "How easy is it to become a monastic/priest in your religion?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/zhwusy/how_easy_is_it_to_become_a_monasticpriest_in_your/",
        "text": "That is, if your religion has such an order/position to begin with. \n\nPriests in my religion was usually a part time gig. Although some positions inherited, many were volunteers and many were chosen via lots. There weren't any hard requirements (a characteristic of not having a centralized, organized religion) and again, it was usually a part time gig.\n\nWhat about y'all?",
        "created_utc": 1670690127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can atheists believe in stuff like reincarnation and ghosts?",
        "author": "Null_Defeator",
        "url": "https://www.reddit.com/r/religion/comments/zhwcux/can_atheists_believe_in_stuff_like_reincarnation/",
        "text": "[removed]",
        "created_utc": 1670688868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jews and Christians what are your thoughts on Isiah 45:7",
        "author": "HadriaCon",
        "url": "https://www.reddit.com/r/religion/comments/zhw5rw/jews_and_christians_what_are_your_thoughts_on/",
        "text": "Isaiah 45:7:\nI form the light, and create darkness: I make peace, and create evil: I the LORD do all these things\n\nWould you describe God as good? Even if he is the source of both good and evil?",
        "created_utc": 1670688384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will my questioning ruin my salvation?",
        "author": "ladybirdbugs",
        "url": "https://www.reddit.com/r/religion/comments/zht3rc/will_my_questioning_ruin_my_salvation/",
        "text": "I have always felt the presence of a God in my life. I have tried to interpret who this was, researching many different religions &amp; spiritual practices. The two religions that felt the most “right” to my spirit were Catholicism &amp; Hinduism. They are SO different in many ways, and yet I am uniquely split between the two. \n\nMy partner is Catholic- and so it is very convenient if I am one too. I love Jesus’ calmness, patience, &amp; love. However, whenever I get too close to the Christian God- my heart reaches out and says, “Slow down. Don’t make the decision to convert yet. Explore Hinduism more!” \n\nBut this scares me. I have spoken to many Hindus about this, and they encourage me to explore. However my partner, and many Catholics tell me that exploration is a negative thing- and that I am betraying Jesus by not having strong enough faith. \n\nI struggle with this, because I don’t know if I can believe in a God that doesn’t allow my love to grow for the Hindu Brahman. I feel very held by him, but it is very hard to explore hinduism in my area of my country. \n\nPlease advise me.",
        "created_utc": 1670680378,
        "upvote_ratio": 1.0
    },
    {
        "title": "“It’s a Baseball!” The Right Words Aren’t Always What Matters Most",
        "author": "At-the-Speed-of-Life",
        "url": "https://dailydevotionsatthespeedoflife.blogspot.com/2022/12/its-baseball-right-words-arent-always.html",
        "text": "",
        "created_utc": 1670679248,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Interfaith Forum at the G20 summit is exposed to many regional and global issues under the auspices of Sheikh Mohammed_Ben_Zayed, President of the State",
        "author": "ShamaAlR0maithi",
        "url": "https://i.redd.it/99hr15cqh15a1.jpg",
        "text": "",
        "created_utc": 1670664493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "pennyroyal_in_bloom",
        "url": "https://i.redd.it/70u4ycc5p25a1.jpg",
        "text": "[removed]",
        "created_utc": 1670661083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "pennyroyal_in_bloom",
        "url": "https://i.redd.it/nz1biwx7o25a1.jpg",
        "text": "[removed]",
        "created_utc": 1670660772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello all, ive found myself with a curious quandary &amp; i would appreciate the lens of all religions.",
        "author": "auyemra",
        "url": "https://www.reddit.com/r/religion/comments/zhk3qy/hello_all_ive_found_myself_with_a_curious/",
        "text": "Does your religion, practice or discipline have any history with spirts, ghosts or \"entities\", whatever noun you ascribe them too.\n\nis there history for which said practice uses some form of communication with or banishings for those who are in confrontation with. good or bad. \n\nChristians for example, few sects practice exoricism professionally or willingly, but that is their form of banishment ( roughly ) If you know otherwise, please let me know.\n\ntheir willingness to communicate with the dead, or anything less than angelic is naught. to my knowledge.\n\nbut im curious of the others, i figure the r/religion is a broad enough to hold others who might have different beliefs. Islam, Buddhism(&amp;its many forms) Shinto, something south american, or african?",
        "created_utc": 1670650526,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Best T Shirt in the UNIVERSE!",
        "author": "escapethecubicleasap",
        "url": "/r/love/comments/zhjtfg/the_best_t_shirt_in_the_universe/",
        "text": "",
        "created_utc": 1670649876,
        "upvote_ratio": 1.0
    },
    {
        "title": "the society and Christians",
        "author": "AdWeekly8646",
        "url": "https://www.reddit.com/r/religion/comments/zhjpmt/the_society_and_christians/",
        "text": "PROS\n\n1) They teach to \"love one another\"(no matter what is everyone's beliefs). \nA criminal minded person could change(like me.)\n\n2) \"Serve your master like you serving the God and the master must not abuse the servant because servant's Master(God) is also the God anf the master(human) is a servant of the Master(God).\" \n\nEmployee has human boss and God Boss\nHuman boss has has God Boss.\n\nSo.. the employer will work hard and loyal to the boss(no matter what beliefs of the boss) and the boss will not be abusive to his employer(no matter what religion of the employer.) the teaching of servant and master, it doesnt mean you still work hard even your master is abusing you. Its a \"relationship of give and take.\" Dont abuse me, I'll work hard for you. \n\n3) Teachings about don't revenge and dont be happy about enemies misery.\nChristians aren't vengeance people, they will leave it to the Lord in Judgement Day.\n\n4) top 3 to 10 commandments thats all beneficial to society. Because these sins are also equals to crimes in our laws. Like murder, adultery, stealing, etc.\nChristians would avoid to make sins as much as possible even if they wanted to and even though \"NO WILL KNOWS\". Because they don't want to die for eternity. Its a FEAR to commit sins. \n\n etc.\n\nCONS\n\n1) Few already JUDGE or discriminate and rejected; LGBT+ , tattoos, metal rock, dark or death arts, clothes thats shows too much skin of women, if you failed = you don't have faith enough, forcing children a religion, etc. \n\nThough all they need to do is not to become a Christian to avoid these discrimination but they can't avoid it if some Christians that in political power also used this discrimination like part of the law. This is wrong because Jesus taught separation of the Church and the Government; \"Church is for Church and Caesar is for Caesar.\" And not to judge people like the prostitute that almost going to die from stone to death of the Jews. Yes the prostitute is dirty, a sinner who committed multiple adultery which is against in top10 commandments but you have no power judge them. Thats very clear.\n\nAnyway, these discrimination are actually not teaching of Jesus, just their misunderstandings from small sects. \nGod is the one who will judge them in judgement day, not them. God just commanded to love one another.\n\n2) in politics \nThere are teaching in Bible that God is the one who put leaders in the government. Corrupt politicians used this verse in Christian dominated countries so they wont revolt. With this, corrupt politician continues to corrupt without stopping. It's literally silencing the Christians like a magic chant with just a single verse, they wont even protest or check what the politicians are doing with their taxes, because they are afraid thats its a sin.\n\nBut this is right and wrong, its doesn't mean you will just leave the corrupt leaders alone, you must kick them. The verse means God granted the people's choice like when Israelites want a human king, they don't want God as their King anymore. God granted their wish but God also kick the human king aftwr when it become evil king. \n\nhttps://www.neverthirsty.org/bible-qa/qa-archives/question/does-god-appoint-evil-leaders-to-lead-nations/\n\nFor me, seriously, if the leader is corrupt, it means war,. Its a heroic thing to do.\n\n3) Christians could get abused easily because of the teachings they misunderstood from everyone like the  CONS #2. Most of those who abused Christians are actually the wicked priest and pastors. There are sayings \"knowledge is power\", so of you have a Christian friend or family member, tell them \"you joined Christianity, then read the whole Bible.\"(will take 2 months), or else the wicked pastors will cherry pick verses and used it to brainwashed them. \n\n4) SINS and FORGIVENESS,\nNot all Christians will behave like a good person, after all, all sins could be forgiven. What they will just kill you, then just pray forgiveness. This trick won't even work to a child, how much more to God.\n\nGod is not someone you can fool. In judgement day example in Revelation, God rejected the preacher, even though the a preacher always pray for forgiveness not only for himself but everyone and spread the teaching of God. The purpose of judgement day is to separate good and bad people after all.\n\nSo one must be careful, if a Christian has misunderstanding beliefs about sins and forgivenes.\n\nEtc.\n\nYou may write down your pros or cons that yknow about Christians.",
        "created_utc": 1670649297,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Evolution of Jesus: 8. Imagination",
        "author": "horsde",
        "url": "https://youtube.com/watch?v=YyZrEPumFbw&amp;feature=share",
        "text": "",
        "created_utc": 1670649251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "Sarahp1123",
        "url": "https://www.reddit.com/r/religion/comments/zhipo8/question/",
        "text": "Majority, everyone knows or knows of The 10 Commandments, and the sixth being, “You Shall Not Murder.”\n\nThat being said, what about our when we go to war!? I’ve always thought of this! It isn’t considered wrong when fighting for our country. \n\nCan anyone explain, justify, or any thoughts/concerns on this!? Thank you",
        "created_utc": 1670646144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can any one find an online translation of the earliest Buddhist text recently discovered called the gandaharan budhidst text?",
        "author": "Iknowreligionalot",
        "url": "https://www.reddit.com/r/religion/comments/zhijkr/can_any_one_find_an_online_translation_of_the/",
        "text": "[removed]",
        "created_utc": 1670645625,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't fit in any religion pls help me guys",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/religion/comments/zhh0ni/i_cant_fit_in_any_religion_pls_help_me_guys/",
        "text": "I believe in God who is all powerful all knowing and all loving but i can't fit in Judaism, Christianity nor Islam. I am an ex-muslim guys pls help me. I believe in superiority lf love and i search for a metaphsycal expression of love but i can't fit in any religion pls help me i feel so helpless.",
        "created_utc": 1670641128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion, human nature and how the right religion would look",
        "author": "Iknowreligionalot",
        "url": "https://www.reddit.com/r/religion/comments/zhge5p/religion_human_nature_and_how_the_right_religion/",
        "text": "[removed]",
        "created_utc": 1670639316,
        "upvote_ratio": 1.0
    },
    {
        "title": "We need to say that Homosexuality is a sin.",
        "author": "OpenYourEyes52",
        "url": "/r/Christianity/comments/zh8kzq/we_need_to_say_that_homosexuality_is_a_sin/",
        "text": "",
        "created_utc": 1670628443,
        "upvote_ratio": 1.0
    },
    {
        "title": "God cannot be all good or all loving if he allows or causes natural disasters to happen",
        "author": "buddayh",
        "url": "https://www.reddit.com/r/religion/comments/zhbfdr/god_cannot_be_all_good_or_all_loving_if_he_allows/",
        "text": "\nIf God was good why would he allow these disasters to kill so many innocent people? God created nature and laws of nature so when these disasters happen it is because he has made it so that theyre possible to happen or he snaps his finger and commands it to happen. Eitherway this proofs in my opinion that he isnt good by allowing this to kill innocents. Any good person knowing something will kill people would do anything to prevent it so if God is the ultimate good why doesnt he prevent the natural disaster from happening? I sure would. God either causes it to happen on purpose or is nonchalant when it naturally happens.",
        "created_utc": 1670626409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Braun Family Religion",
        "author": "Ancient_Cup8608",
        "url": "https://www.reddit.com/r/religion/comments/zhafko/braun_family_religion/",
        "text": "[removed]",
        "created_utc": 1670624107,
        "upvote_ratio": 1.0
    },
    {
        "title": "you muslim converts, i want to ask you a question",
        "author": "BORGAR-IS-RAINING",
        "url": "https://www.reddit.com/r/religion/comments/zh8syp/you_muslim_converts_i_want_to_ask_you_a_question/",
        "text": "We see zakir naik and many more people saying \"if Allah created everyone as Muslims, the world wouldn't be a test\"\n\n\nI want to ask you a question, did you find it hard to convert to Islam? \n\nShare your anxiety/stressful experience before you converted",
        "created_utc": 1670620153,
        "upvote_ratio": 1.0
    },
    {
        "title": "I discovered my meaning in life",
        "author": "Sviatoslav_mill",
        "url": "https://www.reddit.com/r/religion/comments/zh8l6l/i_discovered_my_meaning_in_life/",
        "text": "I have always been surrounded by religion. My grandparents were very Christian and I was raised Lutheran\nI never bought into it at all, and I still don't. I dealt with constant anxiety and suicidal thoughts throughout my life and often smoke weed to deal with it. \nOne night I was really thinking about religion. I closed my eyes and repeated the words \"I accept all entities, spirits or gods into by being\" because its an all inclusive term. \nI sat there and was contacted by an entity. It was similar to descriptions of angels in the Bible, or buddist gods. Very complex, I couldn't understand what i saw\nAnd it contacted me through \"telepathy\" I just understood what it was telling me. And it shared information with me about life. My meaning in life \nI was heavily dealing with suicidal thoughts at the time and it let me experience death. I experienced things I cannot comprehend or relay in words that make sense. There was no time or space, we were minds interacting. I saw every possible route my life could go in and I realized I was doing things that were destroying my body and mind. And I continued doing it\nI continued destroying my body, I smoked more and more. I met several more entities and I figured more and more about my life, I embraced my creative interests and have bettered myself in ways that I couldn't possibly have imagined. At one point it became too much. I knew too much and life was becoming \"easy\" \nAt this point I was no longer suicidal, I learned how to enjoy life\nI want some feedback on this. There are so many intricacies and stories from this experience that I can't cram into a reddit post\nAsk any questions you have!",
        "created_utc": 1670619621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you be in favor of removing “One Nation under God” from the Pledge of Allegiance",
        "author": "needle-roulette",
        "url": "https://www.reddit.com/r/religion/comments/zh8beh/would_you_be_in_favor_of_removing_one_nation/",
        "text": "[removed]",
        "created_utc": 1670618963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which religion has the most positive view on alcohol?",
        "author": "DragonfruitInitial63",
        "url": "https://www.reddit.com/r/religion/comments/zh8041/which_religion_has_the_most_positive_view_on/",
        "text": "[removed]",
        "created_utc": 1670618200,
        "upvote_ratio": 1.0
    },
    {
        "title": "conversion",
        "author": "wowriploser",
        "url": "https://www.reddit.com/r/religion/comments/zh4xn6/conversion/",
        "text": "[removed]",
        "created_utc": 1670610919,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is The Best Argument For Worshipping Nature?",
        "author": "AbiLovesTheology",
        "url": "https://www.reddit.com/r/religion/comments/zh4g9h/what_is_the_best_argument_for_worshipping_nature/",
        "text": "Hello everyone. \n\nI would like to know the best arguments for worshipping and revering nature. I'm trying to explain it to my philosophy teacher, and I can't think of a philosophical argument. I love nature and worship it. It's a life giving force and I believe that should be venerated. I also believe in nature spirits. \n\nIf you worship nature as well, how do you explain your reason for doing so?",
        "created_utc": 1670609805,
        "upvote_ratio": 1.0
    },
    {
        "title": "How adaptable is your religion to our current scientific understanding of people and human behavior?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/zh2qnw/how_adaptable_is_your_religion_to_our_current/",
        "text": "I suppose this is a more specific question in the religion/science type of question we usually see here. \n\nI'm curious more about how religions respond to our current understanding of how humans behave and why. \n\nFor example, is your religion against *all* drugs? What about when drugs, like marijuana, can have powerful beneficial results and can work when other treatments don't for some patients? \n\nIs your religion against gay sex? Even though research states that having a healthy sex life is important, if not vital, to being healthy both physically and emotionally? \n\nAnd the research that shows the potential great danger obedience plays with people in authority positions, despite informing people to think for themselves and be skeptical. \n\nDoes your religion take into account how our understanding of people and behavior can change with new information and research? \n\nI ask because I don't think my religion has any issues with gaining new understandings of people considering my religion doesn't make moral pronouncements or commandments per se.",
        "created_utc": 1670605949,
        "upvote_ratio": 1.0
    },
    {
        "title": "When, if there was, the other water covered Earth? like 2 or even 3 globular floodings throughout all time of Earth?",
        "author": "HeroshiWarLord",
        "url": "https://www.reddit.com/r/religion/comments/zh1b1c/when_if_there_was_the_other_water_covered_earth/",
        "text": "[removed]",
        "created_utc": 1670602447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why men in rich countries need women more than women need men (the story of Adam and Eve)",
        "author": "don_fernando_7",
        "url": "https://www.reddit.com/r/religion/comments/zh1ab5/why_men_in_rich_countries_need_women_more_than/",
        "text": "[removed]",
        "created_utc": 1670602397,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Thrive and Not Just Survive",
        "author": "At-the-Speed-of-Life",
        "url": "https://dailydevotionsatthespeedoflife.blogspot.com/2022/12/how-to-thrive-and-not-just-survive.html",
        "text": "",
        "created_utc": 1670599474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Islam and Christianity really incompatible?",
        "author": "lordcycy",
        "url": "https://www.reddit.com/r/religion/comments/zgz0l6/is_islam_and_christianity_really_incompatible/",
        "text": "I'm interested more and more in this issue and I feel like nothing would be an essential barrier to the subsomption of both religions into another one yet even more final than Islam.\n\nConcerning the Seal of the Prophets and humans messing up texts:\nThe sealing of prophetry does not mean the end of interpretation. Even if the Qur'an was transmitted 100% like the Prophet Muhammad pronounced it and all the copies of the Qur'an as exactly the same, nothing says we interpret it wrong every single time we hear it and everything was meant in another way. Even if the language is clear, humans messed up the other book they will mess up again. How to explain so many denomination of Islam otherwise?\n\nConcerning the trinity as monotheism or polytheism :\nSince we mess up reading we can also mess up the Revelation of the Divinity. The Trinity could refer to the mode of reception of the Divine. Father as how he appears to himself, Son as how he appears to a community, and Holy Spirit as how he appears to individuals. H2O is H2O whether it's vapor, water or ice. Lord of the Rings is Lord of the Rings whether in ink you read, braille you feel or audiobook you hear. Our senses are imperfect He reveals himself through our senses, BAM there you go. Trinity is the revealing of the One Divine to humanity. BAM The doctrine happens when Jesus drops by to say Hi Missed you all. \n\nDying on the cross or not, resurrected or not :\nThe two stories are not incompatible you just need good story telling, with good theoretical backup to make the two work together. Jesus could've died on the cross for our sins and at the same time been redeemed just in time, replaced by someone else, and came back into the body and made it his all along with his words because he's God. Like we are dealing with Divinity here! It is in the realm of the possible to reconcile both stories.\n\nJesus, the comeback:\nYet again whether it is 1000 years or 40 years, we could be mistaken about what type of years they refer to. Maybe in a 500 hundred years we'd have stopped following the solar calendar and \"year\" means a different lenght of time so that 40years and 1000years are the same lenght of time just at two different periods. Or maybe even it was 40years of reign then he dies and resurrects again to do his next shift. \n\nMy point is :\nIf there's a will, there is a way. There's something sacrilegious in not seeing the divine in a religion with over a billion followers, on either side! As if the devil was a force that could rival God. If there is only one God, then he's on both sides. It's up to us to make it work.",
        "created_utc": 1670596801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since People Critics The Bible, What of This Atheistic Plothole?",
        "author": "ostovca",
        "url": "https://i.redd.it/1rtrseqxpw4a1.png",
        "text": "",
        "created_utc": 1670588708,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on deism?",
        "author": "ApprehensiveExit9672",
        "url": "https://www.reddit.com/r/religion/comments/zgvjtz/what_are_your_thoughts_on_deism/",
        "text": "[removed]",
        "created_utc": 1670587494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canonically and or culturally, how do adherents of your faith (group) respond to death? [repost]",
        "author": "DramaturgicalCrypt",
        "url": "/r/religion/comments/zf5yik/canonically_and_or_culturally_how_do_adherents_of/",
        "text": "",
        "created_utc": 1670586475,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get over the negative impact religion has had on me?",
        "author": "Karmen2424",
        "url": "https://www.reddit.com/r/religion/comments/zgsa2v/how_can_i_get_over_the_negative_impact_religion/",
        "text": "[removed]",
        "created_utc": 1670577609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trolls",
        "author": "This_Ad_2279",
        "url": "https://www.reddit.com/r/religion/comments/zgq8ay/trolls/",
        "text": "[removed]",
        "created_utc": 1670570957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for all pagans: how would you personally define your religion?",
        "author": "HappyYetConfused",
        "url": "https://www.reddit.com/r/religion/comments/zgpsrx/question_for_all_pagans_how_would_you_personally/",
        "text": "Just wondering how people from different pagan traditions define their tradition using their own words, ideas, and experiences?",
        "created_utc": 1670569513,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you incorporate music into your practice what kind do you listen to?",
        "author": "Dieter_the_Great",
        "url": "https://www.reddit.com/r/religion/comments/zgprh7/if_you_incorporate_music_into_your_practice_what/",
        "text": "I listen to black metal for my practice. Bands like Dissection, Dark Funeral, Behemoth, and Dimmu Borgir make me feel very connected to my gods.",
        "created_utc": 1670569394,
        "upvote_ratio": 1.0
    },
    {
        "title": "I refuse to believe Jesus was nailed",
        "author": "andyh120d",
        "url": "https://www.reddit.com/r/religion/comments/zgnx4g/i_refuse_to_believe_jesus_was_nailed/",
        "text": "I refuse to believe Jesus would put himself through such pain and humiliation. Plus I think nailings were rare for Roman nails were expensive and reserved to the worse rebels like Spartacus",
        "created_utc": 1670563450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do god have superiors too?",
        "author": "ApprehensiveTwist326",
        "url": "https://www.reddit.com/r/religion/comments/zgnuh2/do_god_have_superiors_too/",
        "text": "[removed]",
        "created_utc": 1670563221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Jehovah’s Witnesses such a controversial religion?",
        "author": "Agreeable-Safe8719",
        "url": "https://www.reddit.com/r/religion/comments/zgnqy4/why_are_jehovahs_witnesses_such_a_controversial/",
        "text": "[removed]",
        "created_utc": 1670562920,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about this",
        "author": "OpenYourEyes52",
        "url": "https://youtu.be/6UCYgKO6Axk",
        "text": "",
        "created_utc": 1670557107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motivation to write the Bible?",
        "author": "SpaceDrama",
        "url": "https://www.reddit.com/r/religion/comments/zglm5h/motivation_to_write_the_bible/",
        "text": "What are secularists’ theories on why individuals wrote the Bible? I assume individuals will say “to get gain to some degree or another”, but what are their arguments about Jesus’s parables and teachings. They were revolutionary, compared to the teachings of the Old Testament. There is so much forgiveness in his teachings that wasn’t often portrayed in any other story/lore before it. So much love and mercy. How would this steer a group of individuals to act a certain way to the benefit of a group who decided to write such things?\n\nAlso, another question. How long did it take to write the books, according to secularists? Did the writers conspire together? Did they act alone? Were these stories originally spoken stories, or did someone mastermind this in a locked up office?\n\nA lot of questions, I just wanted to have a general conversation about these topics.",
        "created_utc": 1670556731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buddhism",
        "author": "Martiallawtheology",
        "url": "https://www.reddit.com/r/religion/comments/zgk95n/buddhism/",
        "text": "[removed]",
        "created_utc": 1670552917,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am Eastern Orthodox Christian, AMA",
        "author": "NanoRancor",
        "url": "https://www.reddit.com/r/religion/comments/zgj64q/i_am_eastern_orthodox_christian_ama/",
        "text": "I have some unique beliefs, even among Eastern Orthodox, and I haven't seen an Eastern Orthodox among the AMAs on here, so I thought I might answer some questions.",
        "created_utc": 1670550081,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Saw Gods Name",
        "author": "Key-Contribution1038",
        "url": "https://www.reddit.com/r/religion/comments/zgi0z1/i_saw_gods_name/",
        "text": "[removed]",
        "created_utc": 1670547356,
        "upvote_ratio": 1.0
    },
    {
        "title": "12/8/2022 MGWC THURSDAY NIGHT BIBLE STUDY",
        "author": "thak1ng01",
        "url": "https://youtu.be/tQMOo68XeHE",
        "text": "",
        "created_utc": 1670547342,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Hebrew Bible/Old Testament's perspective on morality. A couple of guiding principles that could be helpful.",
        "author": "Anglicanpolitics123",
        "url": "https://www.reddit.com/r/religion/comments/zgg3jp/the_hebrew_bibleold_testaments_perspective_on/",
        "text": "Disclaimer. I use the term \"Hebrew Bible\" as well as Old Testament in the OP because I recognise Old Testament is specifically a Christian term. Its not a term others who aren't Christian, particularly those from a Jewish background might use. Other terms that would apply is also the Tanakh. Just putting that out there.  The topic of the Old Testament is something that I use to post a lot about but haven't done so in months. I thought I would again give some personal reflections on the Old Testament in terms of its perspective on morality, especially since its a debated and interesting topic. Broadly I will be going over the importance of things like context, perspective as well as themes of the Old Testament narratives. This like other posts I have done will be an extensive one so if you're not into it you can skip over it. Also as I stated these are my personal perspectives. So keep that in mind. So here we go.\n\n**(i)Placing the Old Testament in its Ancient Near Eastern context**\n\n* This should be super obvious but it needs to be stated. If you want to understand any text proper its cultural context is important and the Old Testament is no different. When we take a text out of its context we come up with anachronistic readings, understandings and misunderstandings of the text. When reading the Old Testament this is important for the following reasons:\n\n1. When trying to understand things like Old Testament Law we can ask \"how does the Old Testament's approach to law compared to other Ancient Near Eastern societies?\" What does the Mosaic Code look like for instance compared to Hammurabi's Code, or the Ancient Assyrian and Egyptian Law Codes?\n2. When looking at the Old Testament's approach to things like warfare, we can ask how does the Old Testament's views on warfare look like when placed in its Ancient Near Eastern context. And more broadly, what does the Old Testament's views on war look like when place in its Ancient and pre modern context generally where the rules of warfare generally speaking tended to be very harsh.\n\n**(ii)Distinguishing the prescriptive and the descriptive.**\n\n* This is another common one but its also important as well. The Bible in many parts does prescribe certain things. However in other parts it is describing certain events. Just because the Biblical authors describe certain events doesn't mean they are therefore prescribing that as a norm for us to live by, or even praising the things described.\n\n**(iii)Distinguishing morality and ethics**\n\n* This is a broad philosophical point but its also important. Morality in as crude and simplistic way as I am probably going to describe this, has to do with a set of principles that guide our beliefs about right and wrong. Ethics has to do with a set of rules and codes that we live by in our day to day lives. So one has to do with principles related to belief. The other has to do with codes of conduct in terms of how we act. They are interrelated due to the fact that morals informs our ethics. To use an example, take Justice. Justice is a moral principle. It can inform our ethical standards though ethical codes of conduct will vary. For example the code of conduct in medical ethics is not the same as military ethics and it isn't the same as business ethics. Because these are different fields. However the principle of what it means to be just and upright can still apply to these different fields.\n* I make this point rather imperfectly for this reason. As modern readers of the Old Testament we are not operating in the same cultural context that things like the Mosaic Code and its ethical content comes out of. And yet even though we aren't under that particular ethical system, the moral principles that inform that system are still important for us. And the code of ethics, while not prescriptive to us, can be very descriptive in elucidating why those moral principles are important in the first place. Take Leviticus as an example. It has all sorts of specific injunctions on various things that today to not apply to us. And yet that ethical principle still has an important lesson to teaching in terms of the importance of the moral principle of Holiness. Holiness is meant to be practised both in our public and private lives, which Leviticus emphasises. Holiness is meant to be upheld both in our personal conduct as well as in our laws.\n\n**(iv)Distinguishing the Imitative and the Pedagogical**\n\n* This flows from the point above in terms of certain ethical codes not meant to be imitated but meant to be teach certain things. Pedagogy is the nature of how one learns or is educated. Applying this to the Old Testament there are commands as well as narratives that are there not necessarily as moral injunctions to be imitated, but moral lessons to be learned. We see this especially when it comes to some of God's judgements.\n* In passages like Deuteronomy 7 and 20 God is gives certain commands to pass judgement on the Canaanite nations. These are obviously not commands meant to be imitated and the text itself tells us this. However they still serve a pedagogical purpose. Namely that a society is judged on the basis of whether they maintain righteousness or wickedness in the land. The Canaanites practised wickedness by engaging in human sacrifice in the name of their gods and were judged. Furthermore the other lesson here is one must fight to put the ban on the temptation to wickedness as well as indoctrination to wickedness. So this is an example pedagogy in the Old Testament. A lesson that we are not called to imitate, but which we learn the morals from anyways.\n\n**(v)Understanding the Old Testament uses certain events and commands as plot devices in the narrative**\n\n* Often times when we read the Old Testament there are certain commands or events in it that out of context seem arbitrary or random in nature. However read in the context of the narrative as a whole what we see is the Biblical authors using them as plot devices that act both as background as well as foreshadowing. We see this in the commands already mentioned in the Old Testament related to the Canaanites. One of the reasons for this command is that if they didn't fully execute God's Judgements on the Canaanites, they would be ideologically captured and indoctrinated in their idolatry. Later on in books like Kings and Chronicles we see the Israelites engaged in idolatry as well as human sacrifice. And each time this is mentioned these commands and Israel's failure to fully follow them is mentioned. So these commands serve as a literary background to explain Israel's spiritual and moral decline. This is just one example of what I'm talking about. There are other examples that could be listed as follows:\n\n1. ***Leviticus's sexual purity laws:*** In Leviticus 18 and 20 there are sexual purity laws. One law mentioned in Leviticus 18:19 forbids sexual intercourse with a woman during her menstrual period. Sounds rather strange and arbitrary. But the Biblical authors use this as a plot devise later on, famously in the story of David and Bathsheba. David doesn't just commit adultery with Bathsheba. Nor does he just commit murder and a cover up. He commits adultery while having sexual intercourse with Bathsheba during her menstrual period. This commandment then is used as a literary devise to demonstrate how David's sin and disobedience is compounded in every way, leading to his judgement. The role this commandment plays in showing the compounded nature of sin is further developed in the plot in Ezekiel 22 when speaking of God's judgement on Jerusalem. It speaks about the sexual crimes and impurity of the people in the city in Ezekiel 22:10-11 when the men in the city commit rape, sexual violence, incest and sexual intercourse. So the compound nature of the sexual sins and crimes committed by Jerusalem is highlighted as well as the reason for their judgement.\n2. ***Deuteronomy 13's harsh laws on religious conformity:*** Deuteronomy 13 impose a harsh set of laws when it comes to religious conformity and deviating from it in the Israelite nation. The first part dealing with false prophets says they are to be purged and that their presence is a test to see if one truly loves the Lord with their heart and soul. The second parts deal with the worship of other gods and states of others lead you into the worship of other Gods, you are to have no mercy and calls for \"the ban\"(herem) on individuals and groups who do so. This commandment would be used as an important plot devise later on. We first see it in 1 Kings with Ahab. The prophet Elijah has his famous show down with the false prophets of Baal who are propped up by Jezebel's corrupt authoritarian regime that persecutes the prophets. He defeats them in this religious show down and then puts them to death so that the famine that was brought up by their disobedience is lifted and the Law is upheld. Later on we see the famous story of Ahab and the false prophets in 1 Kings 22. Ahab is trying to make a decision on whether to go to war. A true prophet tells him to and he has him imprisoned. He listens to the 400 false prophets leading to disaster. As a King of Israel he failed the test. Instead of showing his devotion to the Lord(which he was anointed to do) he precisely does the opposite. Later on in 2 Kings this commandment would be important in the struggle for purification in Israel. The King Manasseh leads Israel down the road of Idolatry as well as human sacrifice. King Josiah in 2 Kings 23 and 2 Chronicles 24 leads a campaign of national reformation that seeks to eliminate the practises of idolatry, human sacrifice as well as the false prophets spearheading this. In this context passages like Deuteronomy 13 serve as an important literary background to this campaign of purification and reformation.\n\n**(vi)The Old Testament's intersectional understanding of justice, righteousness and sin in its commandments and narratives**\n\n* The themes of sin, righteousness and social justice are constants in the Old Testament. And what we see in both its commandments and narratives is it gives a intersectional understanding of these things that interweave multiple things into one point. When it comes to the commandments you see it in the following:\n\n1. \"*For the Lord your is the God of gods and Lord of lords. He is the great God, the mighty and awesome God, who shows no partiality and cannot be bribed. He ensures that orphans and widows receive justice. He shows love to the foreigners living among you and gives them food and clothing. So you to, must show love to the foreigners, for you yourselves were once foreigners in the land of Egypt*\"(Deuteronomy 10:17-19)\n2. \"*True justice must be given to foreigners living among you and to orphans, and you must never accept a widows garment as security for her debt. Always remember that you were slaves in Egypt and that the Lord your God redeemed you from your slavery. That is why I have given you this command*\"(Deuteronomy 24:17-18)\n3. \"*He(the King) will rescue the poor when they cry to him; he will help the oppressed, who have no one to defend them. He feels pity for the weak and the needy, and he will rescue them. He will redeem them from oppression and violence, for their lives are precious to him*\"(Psalm 72:12-14)\n4. \"*Listen to this message from the Lord, you king of Judah, sitting on David's throne. Let your attendants and your people listen too. This is what the Lord says: Be fair-minded and just. Do what is right! Help those who have been robbed; rescue them from their oppressors. Quit your evil deeds! Do not mistreat foreigners, orphans and widows. Stop murdering the innocent!*\"(Jeremiah 22:2-3)\n5. What we see in the verses above as a demand for justice, social justice in upholding righteousness. But the demand is intersectional. Its interesting that repeatedly the commandment to practise justice for widows and orphans in the nation is always followed and compliment with a command to practise justice for foreigners outside the nation. This because there is a recognition that the structures of sin that oppress the widow and orphan are the same structures that oppress the foreigner. They aren't separate. They are linked. Furthermore it repeats consistently the reminder that since you were once strangers you yourself have a demand to help the stranger.\n\n* The Old Testament's intersectional analysis of justice and righteousness and the nature of sin is something that continues over into its narratives that often times have intricate and complicated plots that often times involve the theme of sexual violence:\n\n1. ***The Levite and the Concubine(Judges 19-20):*** In the Book of Judges we have a rather brutal story at the end that involves a Levite and a concubine. The Levite journeys to the Concubine's father's house where he is shown hospitality. Then afterwards he journey's to the city of Gibeah where he meets an Old Man and the Old Man also shows him hospitality but then a group of obscene men arrive. They demand sexual favours from the Levite. The Old Man seeks to protect the Levite and obscenely offers his daughters instead. But the men refuse and instead due to the Levite they take the concubine and she is raped. In the aftermath this incident triggers a war between the Tribe of Benjamin and the other tribes of Israel. A couple of things to noteworthy. The first is how the narrative starts with the theme of hospitality and transitions to sexual violence. What's even more noteworthy is the fact that inhospitality and xenophobia to the outsider is expressed THROUGH sexual violence. We see this phenomenon even today where often times refugees and migrants are dehumanised specifically through sexual violence. The second thing we see is the intersection xenophobia, tribalism and war. It was precisely the xenophobia and tribalism of the Benjaminites that would plunge Israel into war.\n2. ***Sodom and Gomorrah(Genesis 19):*** The famous story of Sodom and Gomorrah is very similar to the story of the Levite and Concubine. It has both the themes of inhospitality in terms of the hospitality the Angels received from Abraham vs the Sodomites. And it also has the theme of sexual violence as well. But an added feature comes from the Book of Ezekiel where the prophet is speaking of the sins of Sodom and states that they were \"*pride, gluttony and laziness, while the poor and needy suffered outside her door*\"(Ezekiel 16:49). Its almost as if its expected that a society that dehumanises people sexuality, will also dehumanise people culturally and dehumanise them at the socio-economic level.\n3. ***David and Bathsheba(2 Samuel 11-12):*** This was already alluded to above but there are added features and layers to this famous story that's worth teasing out. David's sin of adultery is famous. As is his sin of murder. His attempt to cover up his sin through murder is also well know and what he did during Bathsheba's period of menstruating is also known as spoken about. But there is an additional layer as well. The narrative keeps repeating the phrase \"Uriah the Hittite\". As a Hittite, Uriah was a foreigner to Israel. Under Israel's Laws it says \"*Do not take advantage of foreigners who live among you in your land. Treat them like native-born Israelites, and love them as you love yourself. Remember that you were once foreigners living in the land of Egypt. I am the Lord your God*\"(Leviticus 19:33-34). Instead of treating the foreigner well, David dishonors him, and takes advantage of him, in violation of this commandment. So David's injustice and sin is intersection in nature. He commits the sin of murder, the sin of adultery, the sin of mistreating the foreigner, the sin of sexual impurity and the sin of trying to cover up his crime. And he is judged.\n\nThere is much more that could be said about the Old Testament's approach to morality but it wouldn't fit enough space for a single OP on reddit. But I think these points could be helpful when addressing this topic. Though as I said these are just my personal reflections and they obviously aren't infallible and they are open to scrutiny, critique and correction.",
        "created_utc": 1670542965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mantra",
        "author": "Zafkiel666",
        "url": "https://i.redd.it/aqgtbl7ocs4a1.jpg",
        "text": "",
        "created_utc": 1670535824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scholarship on Luke-Acts and Dhammapada",
        "author": "MarchProfessional435",
        "url": "https://www.reddit.com/r/religion/comments/zgcbtp/scholarship_on_lukeacts_and_dhammapada/",
        "text": "[removed]",
        "created_utc": 1670535025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jesus Statue Opens Eyes: There is a statue that locals in Huntsville call \"Black Jesus.\" Some folks believe there is something awfully strange about it. They say that sometimes the statue actually cries, according to legend, the statue s palms, which normally face downward, sometimes turn up.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1670533687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that certain forms of religion like Greek Mythology and all the stories related to Greek mythology are seen as just “mythology” yet this isn’t the case with modern religions like Christianity or Islam? Will there come a point in time where they will be considered “Mythology” too?",
        "author": "Kreelashyper",
        "url": "https://www.reddit.com/r/religion/comments/zgbo0m/why_is_it_that_certain_forms_of_religion_like/",
        "text": "I’d assume it has something to do with the rise of religion through warfare and holy wars in the dark ages of Europe but I’m not sure.",
        "created_utc": 1670533654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't know how to describe my beliefs",
        "author": "Kaliarti",
        "url": "https://www.reddit.com/r/religion/comments/zgb5w6/dont_know_how_to_describe_my_beliefs/",
        "text": "Hello!   \n\n\nAs the title says, I'm in a bit of a dilemma regarding my beliefs.   \n\n\nI for one, do acknowledge God's existence, Satan's existence, other deities and whatnot, the thing with me is, I choose not to believe in any of them. I choose not to follow any of the religious rules these imply. I just... you know, know they exist but that's about it.   \n\n\nAny thoughts? Thanks a lot!",
        "created_utc": 1670532619,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Jesus returns, do you think there will be updates to the bible?",
        "author": "problemneedsolution",
        "url": "https://www.reddit.com/r/religion/comments/zgaqco/if_jesus_returns_do_you_think_there_will_be/",
        "text": "[removed]",
        "created_utc": 1670531714,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am 23 and I guess an ‘atheist’ but I am extremely open minded to the idea of there being a god, I find myself praying fairly often with no influence from family or friends, it just fascinates me how every religious person I meet seems so full of joy and hope , atheists .. not so much",
        "author": "JAidan0003",
        "url": "https://www.reddit.com/r/religion/comments/zg9zm5/i_am_23_and_i_guess_an_atheist_but_i_am_extremely/",
        "text": "..",
        "created_utc": 1670530190,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some religious prophesies or predictions that have actually come to pass?",
        "author": "Ginger_sweetsnap",
        "url": "https://www.reddit.com/r/religion/comments/zg8gkg/what_are_some_religious_prophesies_or_predictions/",
        "text": "Not to include mathematical or reasonable statistical guesses that came to pass. I'm talking about people who claim to be confident in their specific prediction as a result of something only to be explained by a supernatural event or interference. And the predictor didn't have any rhyme or reason to make the prediction because of personal gain.\n\nI feel like it's really easy to make broad, reasonable, or statistical statements that come to pass. I want to hear about the specific, \"there's no way you could've known that\" predictions. Open to all feedback--as always. ✌️",
        "created_utc": 1670527061,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Art of Effortless Living (Taoist Documentary)(I remember watching this video a month ago, such a spiritual experience) (Also a good introduction to Taoism/Daoism)",
        "author": "GraceUnity730",
        "url": "https://youtu.be/IuDY8m72tgk",
        "text": "",
        "created_utc": 1670524784,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Need a Rematch!",
        "author": "dailydevotions",
        "url": "https://dailydevotionsatthespeedoflife.blogspot.com/2022/12/i-need-rematch.html",
        "text": "",
        "created_utc": 1670520131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seers, augurs, oracles, and shamans......Do they exist in your religion? What do you think of them?",
        "author": "Vagabond_Tea",
        "url": "https://www.reddit.com/r/religion/comments/zg56hh/seers_augurs_oracles_and_shamansdo_they_exist_in/",
        "text": "In my religion, I often think of the Pythia, probably one of the most famous, if not important, figures/positions in my religion (also, the Dodona). Hellenism has various oracles, augurs, and similar type of people. And was curious if similar  positions are found in various other religions.\n\nAlso, what do you think of such people and positions? Does it inspire awe? Or does it bother you in some way? Are you completely indifferent to them? Would you want such in your religion? Etc.",
        "created_utc": 1670519962,
        "upvote_ratio": 1.0
    },
    {
        "title": "lets say you are god",
        "author": "AdWeekly8646",
        "url": "https://www.reddit.com/r/religion/comments/zg4ad6/lets_say_you_are_god/",
        "text": "Most of the questions i heard;\n\nWhy why why God lets the people suffer?!! Why God didn't interfere to help?!! Why this? why that?\n\nOkay lets say you are god, you don't want everyone to suffer. So here's what you will surely do.\n\n1) you gonna stun and kill anyone who will think or attempt to do bad.\n2.) just remove the humans ability to think bad to solved problem 1.\n3) you gonna remove sad humans emotion, everyone is now always happy.\n4) humans keeps polluting, you clean their garbage everyday.\n5) free foods every 3x a day!! No need to work!\n6) no more sickness and wounds -  auto heal!\n7) all animals and insects are friendly to each other, you all just eat veges now.\n8) oh no more death! Everyone is immortal!\n9) no basic needs? Like house, clothes, etc. Here you go!\netc... etc...",
        "created_utc": 1670517928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sin is not inherited, but we Are all sinners",
        "author": "InTheNameof_Jesus",
        "url": "https://www.reddit.com/r/religion/comments/zg2j21/sin_is_not_inherited_but_we_are_all_sinners/",
        "text": "[removed]",
        "created_utc": 1670514208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were Jesus' Apostles wealthy?",
        "author": "feanoric",
        "url": "https://www.reddit.com/r/religion/comments/zg12ct/were_jesus_apostles_wealthy/",
        "text": "In ancient times most important jobs required physical power, so that means men had the most power and patriarchy was the standard. This is seen in the New Testament, how often widows and orphans suffered because they did not have a man in the house. On top of that, legal representation was emphasized on men, both in Jewish and Roman authorities. This reality is also seen in the Gospel when Jesus assigned a Disciple to take care of his mother as he was being crucified.\n\nIf men were so central for Judea's and most ancient societies, it makes sense to assume that few families would afford their men to just abandon their lives and follow Jesus. It would have been an economic disaster for the families unless the families themselves were somehow wealthy. We know for sure that probably Matthew was wealthy, as he was a tax collector, but Judas too (apparently, he had experience with money) and probably Peter too to afford leaving his wife for long periods.\n\nIt seems Jesus loved the poor and promoted values to defend and protect them, but also it is true that poverty itself was not seen as positive by Jesus. That inversion came way later, with Christian movements calling themselves \"poor\" as a value, which is one of the central issues Nietzche criticized on Christianity. That positive view of poverty is not in the Gospels, but rather the poor are seen as victims of unfair laws and the righteous have to care for them.\n\nIt is reasonable to assume the Apostles were at least somewhat from wealthy families, as they were able to travel with Jesus and they left their families. However, many Disciples such as Nicodemus and Joseph of Arimathea were explicitly described as wealthy although they never left their families or properties to follow Jesus.",
        "created_utc": 1670511007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origins of God",
        "author": "Hagus-McFee",
        "url": "/r/god_not_god/comments/zg09wj/origins_of_god/",
        "text": "",
        "created_utc": 1670509850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for texts about the Kabbalah and the Sephirot",
        "author": "DarkDrakeMythos",
        "url": "https://www.reddit.com/r/religion/comments/zfz24k/looking_for_texts_about_the_kabbalah_and_the/",
        "text": "Hi, I'm currently researching the Kabbalah and the Sephirot for a project and I was wondering if anyone could suggest me any texts? I can read Hebrew, so that isn't an issue. Is the Zohar sufficient?",
        "created_utc": 1670506403,
        "upvote_ratio": 1.0
    },
    {
        "title": "This astrology book could end up being banned in the US because it describes a social and religious system that could replace the constitution and the US dollar. It also explains in Volume I why Israel is not safe",
        "author": "thedowcast",
        "url": "https://www.reddit.com/r/religion/comments/zfz082/this_astrology_book_could_end_up_being_banned_in/",
        "text": "[removed]",
        "created_utc": 1670506281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Context behind the King James Bible?",
        "author": "beeznerys",
        "url": "https://www.reddit.com/r/religion/comments/zfyew9/context_behind_the_king_james_bible/",
        "text": "I'm very curious and thought it would be a fun topic to look into for my grimoire. I want to look into more of context behind James I, why he commissioned this translation and why preachers and fundies seem to exclusively chose that translation now.\n\nThe most I know currently is that James I was and inbred lunatic obsessed with witches and the demons and that's why the malleus malificarum was commissioned. I need a little more detail than that.\n\nAny resources I can look at? The more academic the better. This is going to go next to my page on the satanic panic.",
        "created_utc": 1670504853,
        "upvote_ratio": 1.0
    },
    {
        "title": "He's ten stop trying to teach him religion.",
        "author": "ChambeaHalaKbroN",
        "url": "https://www.reddit.com/r/religion/comments/zfy0uc/hes_ten_stop_trying_to_teach_him_religion/",
        "text": "I'm atheist. My family is christian. I've told my family I'm not handing beliefs down to my son to get him come up with his own when he is old enough to think for himself. Lately my family has been lecturing him about Jesus and Christianity. I don't teach my son about atheism I teach him to ask questions, do research and come up with his own coinlsions. Well they took him to church he started asking questions and told the pastor \"so God is like Santa but for grown ups but instead of sending a letter you just ask for stuff, my dad said I should always be king, I dont need a bible\" my mom(his grandma) was furious an told me he's only ten I don't need to be talking to him about that stuff. So my son is too young to be thought critical thinking 🤔 but not too young to be taught to believe something he doesn't understand?  Why is it okay for religions to persistently spread their beliefs in an attempt to convert everyone but we can't even teach our kids to ask questions?",
        "created_utc": 1670503898,
        "upvote_ratio": 1.0
    },
    {
        "title": "7demons",
        "author": "Toomuch2little11",
        "url": "https://www.reddit.com/r/religion/comments/zfscwz/7demons/",
        "text": "How does one get rid of the seven demons that move into your house after you’ve banished one from a body. If anyone knows what I talking about I need help",
        "created_utc": 1670484718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does being a Jew encompass believing in Judaism, or can you be a Jew without believing in religion?",
        "author": "BigSocialistCock",
        "url": "https://www.reddit.com/r/religion/comments/zfpx2c/does_being_a_jew_encompass_believing_in_judaism/",
        "text": "[removed]",
        "created_utc": 1670476635,
        "upvote_ratio": 1.0
    },
    {
        "title": "The concept of someone dying for another's sins",
        "author": "LoneWolfZml",
        "url": "https://v.redd.it/1nl5szvzvl4a1",
        "text": "",
        "created_utc": 1670475575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Christian God punish Atheists?",
        "author": "chadar05569",
        "url": "https://www.reddit.com/r/religion/comments/zfoihg/does_christian_god_punish_atheists/",
        "text": "So if you are an Atheist and are  genuinely a good person. Would god still punish you? And vise Versa if you were a devote Christian, but a horrible person, would god allow you to go to Heaven after Death?\n\nI haven’t read the Bible, so if I get a few details I apologize.",
        "created_utc": 1670472649,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the extent of being a idol to being a worshiped figure?",
        "author": "depresinthenameof",
        "url": "https://www.reddit.com/r/religion/comments/zfnng5/whats_the_extent_of_being_a_idol_to_being_a/",
        "text": "Like strict loving parents is all you know in your life, a car being a reason your having a living and to spend every waking moment online and all of your waking moments. Or to even relying on gov assistance to living by a alcohol brew and being childhood friend with the CEO so you can drink as much you want to gove yourself to it.\n\nLike what are the boundaries can you have before it intervened against god?",
        "created_utc": 1670470372,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Seven Last Plagues and the Wicked The Great Time of Trouble Pt 1 | L...",
        "author": "AmazingGodMinistry",
        "url": "https://youtube.com/watch?v=WIl1DyZ2Xpc&amp;feature=share",
        "text": "",
        "created_utc": 1670469413,
        "upvote_ratio": 1.0
    },
    {
        "title": "what oppose having tec, games and s/media being idols itself?",
        "author": "depresinthenameof",
        "url": "https://www.reddit.com/r/religion/comments/zfmfjq/what_oppose_having_tec_games_and_smedia_being/",
        "text": "Because this things pulls our attention and god can be off our minds and toward another by how immersed we can be unless its actively on ones divoted lives even being rebirthed with crist. I thought about this after i do hrs long gaming sprees and many many all nights spending my life on games but i found myself back in place. But believing revolution is near is just another feer i want to learn as much or distract myself doing things in games without resting in scriptures.\nHow far can one go before it becomes a worship subconsciously.",
        "created_utc": 1670467173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wait. Is this the first atheist candidate in the US? Would you vote for an atheist?",
        "author": "Billiewanted24",
        "url": "https://i.redd.it/mk1vov4klm4a1.jpg",
        "text": "",
        "created_utc": 1670466167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interreligious couple",
        "author": "Solid-Test3163",
        "url": "https://www.reddit.com/r/religion/comments/zfl6tm/interreligious_couple/",
        "text": "[removed]",
        "created_utc": 1670463983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Religion is not primarily about beliefs.",
        "author": "beatsbyusrnm",
        "url": "https://www.reddit.com/r/religion/comments/zfkafj/religion_is_not_primarily_about_beliefs/",
        "text": "Atheists like to frame religion as being a set of absurd beliefs that are rationally untenable and which they have refuted. For the majority of religious people, however, religion is not primarily about their particular beliefs, rather it is a way of life, a set of practices and communions which foster a connection to something larger than oneself.\n\nChristianity is not a morality creed, as it may be presented. It should not be reduced simply to questions of what is good or bad, right or wrong. The principle purpose of Christianity is not to provide a moral law, rather, it is to provide an ontological statement about the way things are; which, at heart, accords with statements made by other religious figures across many other traditions.\n\nAt its core, Christianity is a story about the transcendent, realised through mystical experience. If we strip away all the dogma and doctrines of religion and focus just on what is going on from an experimental point of view what we find is that all religions, regardless of their faith, begin similarly, with the mystical experience of a single individual.\n\nThe Buddha learned to meditate and achieved it this way; Jesus had his spiritual awakening when he was baptised; Mohammed goes to the Hera cave to meditate; etc. In all cases the commonality is that the founding people of any particular creed achieved a mystical state of a noetic quality.\n\nAt the heart of the Christian faith is an esoteric system of mysticism which the Saints have been practicing for millennia, and which is still found in the Eastern church today.\n\nThe sense of a direct connection to a consciousness that transcends our own underlies not just Christianity but all religions. For the vast majority of humanity, past and present, being human includes God(s) angels, spirits, ancestors, as living presences in their lives; it involves holy places, rituals, ceremonies, rights of passage, festivals, thanksgivings, etc. \n\nThe great majority of humanity is about cultivating a close relationship to that which is more than human, namely the natural world, the divine, the spiritual realm, and so on. \n\nThere are now an increasing number of people in the secular world who identify themselves as ‘spiritual but not religious’, and whose vision of humanity still includes spiritual realms and experiences; which are excluded from the secular atheistic world view. This trend signifies a rejection of belief in religious dogmatisms in favour of an embodied practical method of relating to the transcendental.",
        "created_utc": 1670461723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question About Catholicism",
        "author": "OCD-throw_away",
        "url": "https://i.redd.it/8t9j0vim7m4a1.jpg",
        "text": "",
        "created_utc": 1670461481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Person prevented (by a mental disorder) from settling down for a definite religion: religious responses",
        "author": "kaioaf",
        "url": "https://www.reddit.com/r/religion/comments/zfjvfs/person_prevented_by_a_mental_disorder_from/",
        "text": "Imagine that this person got a mental disorder diagnosis by a psychiatrist. This mental disorder works in a way that may make impossible to said person to settle down for several things (like what to study at college, etc.) and this includes religion.\n\nThis person has thoroughly studied several religions for years by reading scholarly books but, when said person thinks he eventually made up his mind regarding religion, he thinks again and decides not to follow that religion and starts considering another.\n\nHow would your religion deal with it?\nIs there anything your religion could do to help this person?",
        "created_utc": 1670460703,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does modern Judaism differ from Second-Temple Judaism?",
        "author": "lil_jordyc",
        "url": "https://www.reddit.com/r/religion/comments/zfgp6g/how_does_modern_judaism_differ_from_secondtemple/",
        "text": "The biggest difference I can think of is the temple, which obviously played a huge role before. What else is different?\n\nKind of a side question, has temple worship been replaced by something? If I understand correctly, the Deuteronomistic author very much supports the notion of Jerusalem and its temple being absolutely essential to how Jews worship, but I may be wrong. Which is why Im asking lol.",
        "created_utc": 1670453150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different Branches Of Christianity",
        "author": "Key-Contribution1038",
        "url": "https://www.reddit.com/r/religion/comments/zfggae/different_branches_of_christianity/",
        "text": "[removed]",
        "created_utc": 1670452601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why I am Gnostic",
        "author": "Wizzy2233",
        "url": "https://www.reddit.com/r/religion/comments/zfg6ih/why_i_am_gnostic/",
        "text": "Why is \"god\" in your mind justified to not act or stop evil to maintain freewill? Humans are free to do evil monsterous things, even to other humans. People can kill, rape, molest children, and victimize other innocent unwilling parties, but it's the right thing to do so we can have \"free will.\" What would you think of a human, who had the power to save a child from being raped or killed, if they could stop a murder but simply chose not to because they did not want to interfere with the murderer or rapist free will, what would you think about them? How have so many people been brainwashed into thinking it's okay for the demiurge?",
        "created_utc": 1670452001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Muslims, what is your response to this video?(This video may conflict with your religious views. Watch at your own risk.)",
        "author": "OutrageousDiscount01",
        "url": "https://youtu.be/Zbeztor7ow8",
        "text": "",
        "created_utc": 1670451126,
        "upvote_ratio": 1.0
    }
]