[
    {
        "title": "You do not want me",
        "author": "Nbell_",
        "url": "https://www.reddit.com/r/riddles/comments/101echp/you_do_not_want_me/",
        "text": "You do not want me, but if you get me, you don’t want to lose me. What am I?",
        "created_utc": 1672670910,
        "upvote_ratio": 1.0
    },
    {
        "title": "What number comes inside the bracket?",
        "author": "batnft",
        "url": "https://www.reddit.com/r/riddles/comments/1018qc6/what_number_comes_inside_the_bracket/",
        "text": "                           [10] [9] [17]\n\n                     [1] [10] [11] [10] [12] \n \n           [10] [10] [16] [12] [15] [15] [6]\n\n                   [25] [50] [15] [40] [35]\n \n                           [15] [ ? ] [15]",
        "created_utc": 1672652707,
        "upvote_ratio": 1.0
    },
    {
        "title": "What word has one vowel and two syllables?",
        "author": "sysrpl",
        "url": "https://www.reddit.com/r/riddles/comments/1015j84/what_word_has_one_vowel_and_two_syllables/",
        "text": "What word has one vowel and two syllables?",
        "created_utc": 1672641084,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interested to see how quick the riddle reddit can get this simple one",
        "author": "Pufferfish75837472",
        "url": "https://www.reddit.com/r/riddles/comments/1013wgl/i_am_interested_to_see_how_quick_the_riddle/",
        "text": "What has an eye but does not see? What has a bed but does not sleep? What has a mouth but does not eat? What always runs but never walks? And what has a bank but never uses money?",
        "created_utc": 1672635769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle me this",
        "author": "Nobody-noir",
        "url": "https://www.reddit.com/r/riddles/comments/10101v8/riddle_me_this/",
        "text": "I have 6 sides of fate. \nYou can roll me, but your fate never has a date what am I?",
        "created_utc": 1672624354,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can be long, or I can be short.I can be grown, and I can be bought.I can be painted, or left bare.I can be round, or square.What am I?",
        "author": "kickypie",
        "url": "https://www.reddit.com/r/riddles/comments/100tyss/i_can_be_long_or_i_can_be_shorti_can_be_grown_and/",
        "text": " I can be long, or I can be short.I can be grown, and I can be bought.I can be painted, or left bare.I can be round, or square.What am I?",
        "created_utc": 1672608483,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Night Owls' Diamond Heist!",
        "author": "Darker_Defender",
        "url": "https://www.reddit.com/r/riddles/comments/1009e89/the_night_owls_diamond_heist/",
        "text": "In a bustling city, there lived a group of thieves known as the Night Owls. The Night Owls were a sly and cunning bunch, always on the lookout for their next big score.\n\nOne night, the Night Owls received a tip about a wealthy collector who had just acquired a rare and valuable diamond. The collector lived in a high-security penthouse, and getting to the diamond would be no easy feat. But the Night Owls were up for the challenge.\n\nThey spent weeks planning and preparing, studying blueprints and practicing their skills. Finally, the night of the heist arrived, and the Night Owls set off to steal the diamond.\n\nThey managed to sneak past the security guards and make their way to the collector's penthouse, where they found the diamond sitting on a pedestal in a locked room. But as they reached for the diamond, they were caught by surprise by a loud and booming voice.\n\n\"I wouldn't do that if I were you,\" said the voice.\n\nThe Night Owls turned to see a tall and imposing figure standing in the doorway - a detective named Inspector Smith. The inspector was known for his keen mind and his ability to solve even the most complex of cases, and he had been on the Night Owls' trail for months.\n\n\"You're under arrest,\" the inspector said, holding out his hand.\n\nThe Night Owls knew they were beaten, and they reluctantly handed over the diamond. As the inspector led them away, they couldn't help but wonder - how did he know they were coming?\n\nThe riddle is: How did Inspector Smith know the Night Owls were coming to steal the diamond?\n\nAnswer: The answer is not given in the story. It is left as a mystery for the reader to solve.",
        "created_utc": 1672538631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here are three riddles! (as to not violate the “generic title” rule, I am now going to discuss how IMMENSELY I abhor taking vitamins.) GOD I hate taking vitamins. they taste AWFUL! But I have to take them if I want shiny healthy hair, and health. WHY??? It’s SO CRUEL AND UNFAIR. I. HATE. VITAMINS!!!",
        "author": "ohriddlesticks",
        "url": "https://www.reddit.com/r/riddles/comments/10099s3/here_are_three_riddles_as_to_not_violate_the/",
        "text": "#1 It is a word, not far from truth \n\nIt’s weakest during its prime youth\n\nIt’s no monarch, but it can be crowned \n\nOnce, it’s wobbly. Then it mostly stays sound\n\n#2 \nIt weighs less than a pound, only held by the smart and the wise\n\nIts knots are naught be eyed when it finds itself tethered and tied\n\nWhat is it?\n\n#3\n\nMy two eyes, how they cannot blink\n\nMy scissors, in many textures they sink \n\nMy two dogs lacking fu; they cannot sleep, bark, or run \n\nMy palettes, their color is technically one \n\nThe picture I paint isn’t seen, instead heard\n\nIf you know tell me, just what is my word?",
        "created_utc": 1672538235,
        "upvote_ratio": 1.0
    },
    {
        "title": "README - Rules and Guidelines for participating in /r/riddles",
        "author": "riddles_moderators",
        "url": "https://www.reddit.com/r/riddles/comments/10081qd/readme_rules_and_guidelines_for_participating_in/",
        "text": "**Welcome to /r/riddles. Whether you're new or you've been here for a while, please take the time to read this post, as it provides a clarification of the rules, which can be found in the sidebar. These rules can also be found here:**   \nhttps://www.reddit.com/r/riddles/wiki/edit/index/rules\n\n#Rule #1: [No Spam.](https://www.youtube.com/watch?v=zLih-WQwBSc)\n\nThis means spam in any conceivable sense of the term: \n\n* Reddit's guidelines say that it's okay to be a redditor with a business, but it's not okay to be a business with a reddit account. If you have a riddle website or a riddle/puzzle subreddit and want to promote it, **please [message the mods](https://www.reddit.com/message/compose/?to=/r/riddles) first**.   \n  * Do not directly offer rewards for solving. See rule #5 for more details.\n* If this is something you've been posting to a bunch of different subreddits, you're probably spamming.   \n* No crypto, NFTs, or other scams. They can be the *topic* of the riddle, but no *actual* crypto or NFTs may be involved.\n\n**SPAMMERS GET BANNED**\n\n#Rule #2: Riddles must be self-contained in words.\n\nType out your riddle in the body of your post. Do not link to a riddle posted elsewhere. Do not link to a video. Do not link to an image. **If a video or image is an essential component, it is not a riddle. More about this in Rule #4.** Violation of this rule often overlaps with violation of the no spam rule.\n\nIf it relies on a typographic gimmick, re-word it so it does not. Please do not submit anything that's in all caps.\n\n##Rule #2a: Descriptive titles are strongly encouraged.\n\nIf you can't come up with a good title, just use the first line. But please **avoid** generic titles such as:\n\n* Riddle  \n* My first riddle!  \n* Just came up with this  \n* Can you guess this?  \n* Can't figure this out  \n* What am I?  \n* Solve this  \n* U can't solve this\n\nBy using a descriptive title, you make it possible to find your riddle later on, and you give people a reason to be interested in your post. A title like \"help me solve this\" gives no context, and helpful users may ignore your vague request.\n\n#Rule #3: All guesses and discussions of guesses must be spoiler-tagged.\n\nAll means all. Doesn't matter if the guess being discussed is wrong. Doesn't matter if you're the OP and it's your riddle. If you're discussing a guess/answer, please use spoiler tags. At the bare minimum, spoiler key words and phrases. It is not necessary to spoiler generic comments like \"Yes, that's right\" or \"No, that's wrong.\" It is only necessary to spoiler \"Can you explain xyz?\" if xyz is part of a guess.\n\nIf you're the OP, we would strongly prefer it if you did not include the answer right away, but if you absolutely must, then make sure it is properly spoiler-tagged.\n\n##How to spoiler-tag:\n\nAutoModerator explains this in every post, but in case you missed it, here it is again:\n\n&gt; On desktop (new reddit, Fancypants editor): https://i.imgur.com/SWHRR9M.jpg\n\n&gt; On mobile, old reddit, or in the Markdown editor (not Fancypants): **\\&gt;!guess or discussion between these symbols!&lt;**    \n&gt; To be clear, that is `&gt;!` (greater than, exclamation point) at the start and `!&lt;` (exclamation point, less than) at the end with no spaces around the `!`.     \n&gt; Avoid leading or trailing spaces. These will break the formatting for most people.   \n&gt; Spoiler tags do not span paragraphs or line breaks. If your answer is long, please spoiler-tag each paragraph separately.\n\n&gt; Putting a link inside spoiler tags can be tricky, so just format the link like this, using the word \"SPOILER\" as the link text.   \n&gt; On mobile, old reddit, or in the Markdown editor (not Fancypants), do this to format a link: **\\[SPOILER\\]\\(https:\\//example.com/)**  \n&gt; On desktop (new reddit, Fancypants editor): https://imgur.com/x5wDOvk\n\n&gt; If your top-level comment does not contain a guess, you can include either the word **\"discussion\"** or **\"question\"** instead of using a spoiler tag.\n\n#Rule #4: Posts should be about riddles.\n\nThis seems to be the most misunderstood rule (failing to properly spoiler-tag is second). So how do we define \"riddle\"? \n\n* Preferentially, in the classic sense, where **something** (or someone) **is described creatively and we must identify what** (or who) **it is**. \n   * What gets wetter the more it dries? To solve this, you need to change how you think about \"dries\". It doesn't mean the thing itself becomes dry, it means the thing makes other things dry. The answer is \"a towel\". What is a room you cannot enter? To solve this, you need to change how you think about \"room\". This is not an enclosed space where you might find people and furniture. The answer is \"a mushroom\". \n   * [J.R.R. Tolkien had some good riddles in the confrontation between Bilbo and Gollum.](http://tolkien.cro.net/talesong/riddles.html) \n\nRiddles do *not* have to be fancy or poetic, or follow a specific format. By the same token, not everything in classic riddle format is actually a riddle.  \n\n* Secondarily, simple brain teasers where a situation is described creatively and we must identify what happened.\n\n**All submissions should aim to provide all of the necessary info to directly guess the answer, without needing to make assumptions or ask follow-up questions.** Open-ended questions, trivia questions, an invitation to play 20 Questions, mysteries, whodunnits, etc., are not riddles and do not belong in this subreddit.  \n\n**Riddles need to have clear solutions.** If there are more than two answers (three at a stretch), it does not belong here. If a valid answer is suggested that wasn't what you were thinking of, then your riddle has multiple valid answers.\n\n**Logic, math, and purely analytical thinking have no place in a riddle.** If your submission involves logic, math, ciphers, codes, or anything else of that nature, it is not a riddle and you should post it to /r/puzzles. A small minority of riddles involve numbers. It's all down to how the numbers are used. If we're just meant to do calculations, it's not a riddle. If we're meant to think more broadly about *how* the numbers are being used, it might be a riddle. \"The Liar and the Truth Teller\" is a logic puzzle, not a riddle. \"Einstein's [so-called] Riddle\" is a logic puzzle, not a riddle.\n\nSometimes a riddle overlaps a different category. In that case, it must be primarily a riddle and incidentally something else.\n\n**Posts requesting help in designing a riddle must result in a riddle that adheres to these rules.**\n\n#Rule #5: No riddles from active competitions.\n\nUnless the person in charge [contacts us directly](https://www.reddit.com/message/compose/?to=/r/riddles) with their permission, we consider this cheating and we will have no part in that. At our discretion we will allow exceptions if the stakes are sufficiently low. And if you're in charge of a competition and post about it without consulting with the mods first, you run the risk of violating rule #1.\n\n**Currently allowed:**\n\n* https://worldwidewebhunt.com/\n\n#Rule #6: No hate, no racism, no bigotry of any kind. No politics.\n\nIf your idea of a riddle involves putting someone down (whether an individual or a group), you are not welcome here. This subreddit is for light-hearted fun, not for mean-spirited jabs. This also applies to comments.\n\n##Rule #6a: Don't be condescending.\n\nThis includes things like titling your post \"I bet you can't solve this\", which also violates rule #2a, and instructing people to \"think\". Yes, this is a less serious infraction than the parent rule. It's still unnecessary and off-putting. Please don't.\n\n**HATE POSTERS GET BANNED**\n\n#Rule #7: No trolling. No shitposting.\n\nI don't think this needs much elaboration. Low-effort but still a legitimate riddle is one thing. Nonsense, rudeness that falls short of a rule #6 violation, and other insincere posts don't belong here. If you wish to have a community discussion, please use the \"Meta\" flair.\n\n#Please use the report function to report any violations you see. Just commenting is not a good way to get the mods' attention.\n\nAll reports are anonymous. All reports are investigated. If we've somehow missed a reason and none of the report categories fit, just pick one. The important part is bringing it to our attention. We can take it from there.\n\n#If you feel like your post or comment was removed in error, [please let us know.](https://www.reddit.com/message/compose/?to=/r/riddles)\n\nPlease include the link to the post or comment in question. If you can't do that, at least quote it or describe it so we can find it more easily. And remember: A little manners go a long way!",
        "created_utc": 1672534190,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I ? [Science Based]",
        "author": "nogudatmaff",
        "url": "https://www.reddit.com/r/riddles/comments/1007t0r/what_am_i_science_based/",
        "text": "Two forms I take, one impossible to make. But you can make the other form is possible, such as the limitations our dimensions, dictate. \n\nMy physical form, be it plastic, or glass, has a special requirement to maximise my mass.\n\nOthers of my kind, are easy to fill; for they all have no volume, and single sided as well.\n\nNow this is where I’m special, for I’m impossible to fill; unless you want to try, but suffocate as well. \n\nBut if you know your science, and have a special tank as well, you can fill me to the brim, and solve this puzzle as well.",
        "created_utc": 1672533384,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought of, a \"who am i\" riddle, quite easy.",
        "author": "Ezroth_Kusosroy",
        "url": "https://www.reddit.com/r/riddles/comments/10069z5/i_thought_of_a_who_am_i_riddle_quite_easy/",
        "text": "I can hold many things but I'm known for one, once you drop me I'm done.\n\nHint: &gt;!I'm used every day!&lt;",
        "created_utc": 1672528551,
        "upvote_ratio": 0.99
    },
    {
        "title": "Who am I?",
        "author": "HistorianPerfect8124",
        "url": "https://www.reddit.com/r/riddles/comments/zzzjij/who_am_i/",
        "text": "I am the most vicious killer.\n\nSome people can’t stand to be around me.\n\nOthers absolutely adore me.\n\nWho am I?",
        "created_utc": 1672508991,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can only show 1 I. Many people R afraid of me. Eye have gone by many different names. I am rarely seen by many persons. If and when U lay eyes on me, I'm very often beautiful, calm, and serene. Once U cannot see me anymore, you really should run. What am I.",
        "author": "MikalKing",
        "url": "https://www.reddit.com/r/riddles/comments/zzw7hu/i_can_only_show_1_i_many_people_r_afraid_of_me/",
        "text": "I saw this one years ago but I can't remember the answer",
        "created_utc": 1672499711,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 SUSPECTS, 3 ARE LYING, 3 SPEAK THE TRUTH",
        "author": "RedditGamer253",
        "url": "https://www.reddit.com/r/riddles/comments/zzvmfn/6_suspects_3_are_lying_3_speak_the_truth/",
        "text": "This morning, the death of a pianist named Robert was reported to the police. Apparently, one of his 6 friends had poisoned him. Here's what they had to say about it:\n\nMichael: Jane killed him.\nJane: Samuel is lying.\nSamuel: Norman speaks the truth.\nMary: Michael didn't kill him.\nNorman: Eve is lying.\nEve: Norman is the killer.\nAssuming that only 3 of them are speaking the truth, who was the killer?",
        "created_utc": 1672497986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two fathers and two sons go on a fishing trip",
        "author": "FagnusTwatfield",
        "url": "https://www.reddit.com/r/riddles/comments/zztmgp/two_fathers_and_two_sons_go_on_a_fishing_trip/",
        "text": "They each catch one fist each, when they arrive home they put all the fish on the table - all three.\n\nNo fish were lost, eaten, sold or put back.\n\nHow is this possible ?",
        "created_utc": 1672491661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle me this",
        "author": "keiharts",
        "url": "https://www.reddit.com/r/riddles/comments/zzqih1/riddle_me_this/",
        "text": "What is\nThe",
        "created_utc": 1672479985,
        "upvote_ratio": 1.0
    },
    {
        "title": "What letter comes next?",
        "author": "jeffxxzz",
        "url": "https://www.reddit.com/r/riddles/comments/zznz2w/what_letter_comes_next/",
        "text": "[removed]",
        "created_utc": 1672469854,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s My Name? - Who am I?",
        "author": "nogudatmaff",
        "url": "https://www.reddit.com/r/riddles/comments/zzl16l/whats_my_name_who_am_i/",
        "text": "Hint:-  &gt;!Real person, still living. Play on words. I an Adult Male.!&lt;\n\nIm the type of person who would love this subreddit, and would live or be born beyond England’s northern boarder…Although I’m not sure I have anything to do with that country.",
        "created_utc": 1672459968,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I",
        "author": "hogginsgoggins",
        "url": "https://www.reddit.com/r/riddles/comments/zzkm2t/what_am_i/",
        "text": "When you receive me , I am square shaped \nMy next form is circular \nFinally , I am triangular \n\nWhat am I ?",
        "created_utc": 1672458680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idiom quiz",
        "author": "Miserable-Nebula9201",
        "url": "https://www.reddit.com/r/riddles/comments/zzjsl9/idiom_quiz/",
        "text": "The category is idioms. Does anybody know this answer? \n\n_   _E_\n\n_ _ _ S _\n\n_ N   _ _ F _",
        "created_utc": 1672456217,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm stumped",
        "author": "Obecny75",
        "url": "https://www.reddit.com/r/riddles/comments/zz5grm/im_stumped/",
        "text": "I cannot for the life of me figure this out.\n\n\nThis food is made from three things. The first thing is what a baby animal is in. The second thing is a food box that often surrounds other food. The third thing is white and comes out of an animal. The food is named after a big place where people live.\n\nI think the first thing is eggs, the third thing milk. \n\nNo clue what the second or last thing are, thus I have no clue what the actual answer is.\n\nYour help is greatly appreciated!",
        "created_utc": 1672419596,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Chandra's family:",
        "author": "batnft",
        "url": "https://www.reddit.com/r/riddles/comments/zz4i6s/in_chandras_family/",
        "text": "There are one grandfather, one grandmother, two fathers, two mothers, one father-in-law, one mother-in-law, five children, four grandchildren, one sister, three brothers, four sons.\n\nHow many members are there in Mr. Chandra's family?",
        "created_utc": 1672417214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lose me once i'll come back stronger, lose me twice i'll leave forever",
        "author": "RiddleTower",
        "url": "https://www.reddit.com/r/riddles/comments/zyvwe9/lose_me_once_ill_come_back_stronger_lose_me_twice/",
        "text": "what am I?",
        "created_utc": 1672390985,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I?",
        "author": "Traditional-Ad-6061",
        "url": "https://www.reddit.com/r/riddles/comments/zyvss4/what_am_i/",
        "text": "I hold your hand back\n\nI hamper your life\n\nI'm in every detective\n\nAnd near every wife\n\nI'm there with the truth\n\nAnd also with lie\n\nI'm there at some births\n\nAnd as most people die\n\nI'm seldom held by the ignorant\n\nAnd oft by the smart\n\nI've led to discovery\n\nAnd I've broken hearts\n\nWhat am I?",
        "created_utc": 1672390659,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I?",
        "author": "nogudatmaff",
        "url": "https://www.reddit.com/r/riddles/comments/zyt5cp/what_am_i/",
        "text": "Some call me infinity, but a common misconception.\n\nI exist in our 3rd dimension, but only one I am said to be.\n\nThey say there are two sides to every story, but mine just the one.",
        "created_utc": 1672381404,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I?",
        "author": "LeafWingKing",
        "url": "https://www.reddit.com/r/riddles/comments/zysrs9/what_am_i/",
        "text": "I can sharpen the mind, but I can make it grow dull.\nI can be for enjoyment, or for you to give freely.\nI love everyone, though I have restrictions. But I am forgiving, with infinite chances.",
        "created_utc": 1672380146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's ne I came up with for no reason.",
        "author": "LeafWingKing",
        "url": "https://www.reddit.com/r/riddles/comments/zyskbb/heres_ne_i_came_up_with_for_no_reason/",
        "text": "Two students take the same test. On the same question, the two students answer differently. One student says the answer is 0. The second student says the answer is 32. Both are correct. How?",
        "created_utc": 1672379510,
        "upvote_ratio": 1.0
    },
    {
        "title": "People in another world, who are they?",
        "author": "nogudatmaff",
        "url": "https://www.reddit.com/r/riddles/comments/zypt4b/people_in_another_world_who_are_they/",
        "text": "You have seen us together, in the same world, in the same family, but an age apart.\n\nIn another world, you saw us together, but as foes. The one and only time anyone saw us together in this world or any world but the real one we live in. \n\nWho are we?",
        "created_utc": 1672371286,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a man has a sex change operation and still likes girls, is he a lesbian",
        "author": "Parka_lad",
        "url": "https://www.reddit.com/r/riddles/comments/zylx20/if_a_man_has_a_sex_change_operation_and_still/",
        "text": "I’m really sorry",
        "created_utc": 1672360918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this too hard? Designing a game and none of my friends solved it.",
        "author": "geosunsetmoth",
        "url": "https://www.reddit.com/r/riddles/comments/zylgnq/is_this_too_hard_designing_a_game_and_none_of_my/",
        "text": "The earth has none, a ring has one. \nIt is above all species, but one must come before each one of them. \n\nWhat is it?",
        "created_utc": 1672359750,
        "upvote_ratio": 1.0
    },
    {
        "title": "A simple one",
        "author": "Frenselaar",
        "url": "https://www.reddit.com/r/riddles/comments/zykwrn/a_simple_one/",
        "text": "My master's nightly ritual is one I'll never learn.\nAnd yet they have entrusted me to make sure they return.\n\nI watch over their body, with only one intention:\nWait until my time to shine, then call for their attention.",
        "created_utc": 1672358428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some help! The answer is a single word",
        "author": "k1ttycube",
        "url": "https://www.reddit.com/r/riddles/comments/zyjq7l/i_need_some_help_the_answer_is_a_single_word/",
        "text": "&amp;#x200B;\n\nThe mist will hollow as the next year will follow, it is closer now but how close? Disclose, disclose thats all thats I am told.",
        "created_utc": 1672355630,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I?",
        "author": "Cheap-Cauliflower695",
        "url": "https://www.reddit.com/r/riddles/comments/zyhd84/what_am_i/",
        "text": "I stick to the real me...\n\nAlmond? color or shape b ❤\n\nfull set? you bet!\n\ngrown out? not yet 🥳",
        "created_utc": 1672350094,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am i?",
        "author": "IntelligentPool6474",
        "url": "https://www.reddit.com/r/riddles/comments/zydpt2/what_am_i/",
        "text": "I am a force that shapes your life,\nA power that guides your actions,\nI can be held by one or many,\nAnd I am often sought after by factions.\n\nSome seek me as a means to an end,\nOthers seek me to wield their own sway,\nI am the key to success,\nBut I can also lead astray.",
        "created_utc": 1672341509,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many Legs on the floor ?",
        "author": "MaCk_Pinto",
        "url": "https://www.reddit.com/r/riddles/comments/zy8oof/how_many_legs_on_the_floor/",
        "text": "You walk into a room, there are \n\n2 dogs\n\na giraffe \n\n2 hens \n\n4 cats all on the bed and \n\n2 ducks fly over a couch\n\nHow many Legs are on the fLoor ?",
        "created_utc": 1672329375,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Am I?",
        "author": "Traditional-Ad-6061",
        "url": "https://www.reddit.com/r/riddles/comments/zy25i3/what_am_i/",
        "text": "   \n\n\nSome look at me with fear\n\nOr Honor or hate.\n\nSome think I mean little,\n\nothers think I’m great.\n\nI have molded you\n\nand every soul.\n\nI flow with no end.\n\nI’ve seen empires fall.\n\nI stretch back to the embers\n\nOf a Universe nascent.\n\nI drive some people forward\n\nand others complacent.\n\nI am set in stone\n\nand constantly changing.\n\nI shoot into the future.\n\nYour fates, I’m arranging.\n\nWhat am I?",
        "created_utc": 1672309746,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Am I?",
        "author": "Traditional-Ad-6061",
        "url": "https://www.reddit.com/r/riddles/comments/zy1ygv/what_am_i/",
        "text": " \n\nI can rattle you quite near, or far\n\nI can travel to thine ear or heart\n\nI can be delivered by blade,\n\nOr to someone betrayed\n\nI thrive when love is torn apart",
        "created_utc": 1672309027,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guess this short riddle",
        "author": "MrGino815",
        "url": "https://www.reddit.com/r/riddles/comments/zxx3y1/guess_this_short_riddle/",
        "text": "What time is it?\nHint: ascending equal increments to 10.",
        "created_utc": 1672292353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Language Riddle",
        "author": "proyecto_onu3",
        "url": "https://www.reddit.com/r/riddles/comments/zxur8b/language_riddle/",
        "text": " \n\nAct One: Imagine a feline animal waiting for a fight (JJJJJJJJ)\n\nAct One, Part 2: Imagine speaking like a feline animal putting up a fight with animal instinct.\n\nAct Two: Imagine speaking with the omitted (HHH) in \\*human supersensory language\\* and the DNA of the one who balances the map (WWWoman).\n\nPart Three: Clue: Riddle of language and language at the evolution level of humanity. It involves tone and culture (evolution of the language and contact with the environment. The Cold is Hostile: SKSKSKSKSKSKS)",
        "created_utc": 1672285584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t figure out this riddle on a puzzle box. (Answer is 6 Letters)",
        "author": "MistyGMuscles",
        "url": "https://www.reddit.com/r/riddles/comments/zxtpgn/cant_figure_out_this_riddle_on_a_puzzle_box/",
        "text": "If life everlasting is what you need.\nOn the path laid by your father then proceed.\nTake care to avoid the pitfalls of greed.\nOnly in the name of God will you succeed.",
        "created_utc": 1672282752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with this “puzzle” drawn in chalk",
        "author": "Eternlgladiator",
        "url": "https://www.reddit.com/r/riddles/comments/zxrj86/help_with_this_puzzle_drawn_in_chalk/",
        "text": "[removed]",
        "created_utc": 1672277075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone takes a jog in their home state…",
        "author": "Sad-Seaworthiness133",
        "url": "https://www.reddit.com/r/riddles/comments/zxpzge/someone_takes_a_jog_in_their_home_state/",
        "text": "After he get done jogging, he ends up in the neighboring state. \n\nWhat state does he live in?",
        "created_utc": 1672273240,
        "upvote_ratio": 1.0
    },
    {
        "title": "He who guides the flight of the patron saint of children and the repentant. Who is he?",
        "author": "Gloryblackjack",
        "url": "https://www.reddit.com/r/riddles/comments/zxkacq/he_who_guides_the_flight_of_the_patron_saint_of/",
        "text": "A riddle of my own making",
        "created_utc": 1672259911,
        "upvote_ratio": 1.0
    },
    {
        "title": "In two words describe the definition of insanity",
        "author": "Gloryblackjack",
        "url": "https://www.reddit.com/r/riddles/comments/zxjtrv/in_two_words_describe_the_definition_of_insanity/",
        "text": "Hint: Sometimes Ads can feel like they go on for infinity.",
        "created_utc": 1672258840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are y'all ok with riddles including cyphers",
        "author": "Gloryblackjack",
        "url": "https://www.reddit.com/r/riddles/comments/zxjs9e/are_yall_ok_with_riddles_including_cyphers/",
        "text": "I have been making riddles for my friends for the last few weeks. However most of my riddles include cyphers. so you solve the first riddle to find the type of cypher and the cypher key to unlock the real riddle. Would a riddle like this be ok with the mods?",
        "created_utc": 1672258743,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is known as Einstein's famous riddle (but don't look for the solution online, as the solution here is different)",
        "author": "Designer_Drawer_3462",
        "url": "https://www.reddit.com/r/riddles/comments/zxi6no/this_is_known_as_einsteins_famous_riddle_but_dont/",
        "text": "Can you solve this mathematical problem??\n\nThere are 5 houses of different colors next to each other, owned by 5 people of different nationalities who drink 5 different beverages, own a different pet, and smoke a different brand of cigars.\n\nThe question is who owns a fish, what does he drink, what does he smoke, and in which house does he live?\n\nHere are some clues to help you solve the problem:\n\n1 - The Englishman lives in the red house.\n\n2 - The Swede keeps a dog.\n\n3 - The Dane drinks tea.\n\n4 - The green house is just to the left of the white house.\n\n5 - The owner of the green house drinks coffee.\n\n6 - The man who smokes Pall Mall keeps a bird.\n\n7 - The owner of the yellow house smokes Dunhill.\n\n8 - The man in the center house drinks milk.\n\n9 - The Norwegian lives in the first house.\n\n10 - The Blend smoker has a neighbor who keeps a cat.\n\n11 - The man who smokes Blue Master drinks beer.\n\n12 - The man who keeps a horse lives next to the Dunhill smoker.\n\n13 - The German smokes Prince.\n\n14 - The Norwegian lives next to the blue house.\n\n15 - The Blend smoker has a neighbor who drinks water.",
        "created_utc": 1672254985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle help",
        "author": "Substantial-Bid6213",
        "url": "https://www.reddit.com/r/riddles/comments/zx8zdx/riddle_help/",
        "text": "I need help with this following riddle \n\n- I’m not sure if you have a link to the video but I just wanted to let you know that I am going to be in the office tomorrow morning at nine a little after nine a little before nine a m m and I will be in the area to help you with the paperwork and I will be there at nine a m and I will be there at ten a m and I will be there at eight a m and I will be there at seven a m a m and I will be there at twelve a m a little after nine a m a few minutes before nine a few minutes before ten a few minutes after ten a few hours and then I will be there at ten a few days I will be there at nine a little bit later than that I will be there",
        "created_utc": 1672232388,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this",
        "author": "Uwu809nice",
        "url": "https://www.reddit.com/r/riddles/comments/zx6ts9/what_is_this/",
        "text": "The more you take the bigger it becomes what is it?",
        "created_utc": 1672225218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solve the number",
        "author": "AClockworkOrange1977",
        "url": "https://www.reddit.com/r/riddles/comments/zx5ewx/solve_the_number/",
        "text": "So my name is 3a8y4ru, on platform -1,2\n\nWhat’s my name? \n\n\n3=k\n\n1=0\n\n8=t\n\n4=4 \n\n2=F",
        "created_utc": 1672219892,
        "upvote_ratio": 1.0
    },
    {
        "title": "For pauper and poorer, for rich and for hoarder,",
        "author": "MrAcurite",
        "url": "https://www.reddit.com/r/riddles/comments/zwn81m/for_pauper_and_poorer_for_rich_and_for_hoarder/",
        "text": "I am often described as a dance.\n\nFor king and for knave, and the lowest of slaves,\n\nI am found at the end of a lance.",
        "created_utc": 1672167917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discussion: Posters should be required to submit the answer to the mods when they post.",
        "author": "theblakesheep",
        "url": "https://www.reddit.com/r/riddles/comments/zwitod/discussion_posters_should_be_required_to_submit/",
        "text": "So often, a poster submits a riddle, then never returns to answer it! It would be useful if the poster of a solvable riddle (obviously not one they don't know the answer to themselves) was required to submit the correct answer to the mods when they post. Then, there could be a time limit, say 2 or 3 days. If the poster doesn't respond to any of the guesses in that time, the mods post the correct answer, spoiler tagged.",
        "created_utc": 1672156634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please give me riddles whose answer is “time.”",
        "author": "North_Recognition199",
        "url": "https://www.reddit.com/r/riddles/comments/zwea4d/please_give_me_riddles_whose_answer_is_time/",
        "text": "I need a riddle for my Gacha Club video.",
        "created_utc": 1672143134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solve this Riddle I came up with",
        "author": "InfernalRuinsGames",
        "url": "https://www.reddit.com/r/riddles/comments/zwa63c/solve_this_riddle_i_came_up_with/",
        "text": "I was 28 years old, tall, and really hot. Why did all the people leave me?",
        "created_utc": 1672127278,
        "upvote_ratio": 1.0
    },
    {
        "title": "?",
        "author": "irl-riddler",
        "url": "https://www.reddit.com/r/riddles/comments/zw43zm/_/",
        "text": "What can come at any time, followed swift by silence, brings naught but sorrow, grief and pain, and sometimes even violence?",
        "created_utc": 1672107971,
        "upvote_ratio": 1.0
    },
    {
        "title": "My english teacher sent my class a riddle that I can't seem to solve.",
        "author": "send_snacks777",
        "url": "https://www.reddit.com/r/riddles/comments/zw2qi9/my_english_teacher_sent_my_class_a_riddle_that_i/",
        "text": "I've spent a while researching it but I just can't find an answer. Keep in mind that he wrote it himself.\n\n\nPatience and Fortitude bar my like's doors\nand what you seek here my friend, you will find all the more.\nA Tyrant of Heraclea gave birth to me\nand I serve those who seek me and shall ever be free.\nIn Albero Centrale I have made my home\nand here in its heart I am buried among the tomes.\nA woman of Skopje guards my place\nRosebuds and cerulean lines will guide you to my place\nI an ocean of pages I float on the sea\nRaised in safety, Mother watches over me.\n\nGood luck!!",
        "created_utc": 1672104076,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with this twist on a classic riddle",
        "author": "SgtSlushPuppy",
        "url": "https://www.reddit.com/r/riddles/comments/zvvykt/i_need_help_with_this_twist_on_a_classic_riddle/",
        "text": "Before you lays the temple of The Grand Sphinx.\nThere are two guardian Sphinx before you. They explain to you that one of them tells lies, and one of them tells truths, and that there is only one true grand sphinx. you must choose which one is the true grand sphinx to be let into the temple. You are only allowed to ask one question to one sphinx to help you decide which one to choose. What question do you ask? \n\nSo here are some ground rules I’ve found out about the riddle through hints that my friend gave me \n\n1. The grand sphinx can be the sphinx that only lies or he can be the sphinx that only tells the truth. \n\n2. You only need to find out what sphinx is the grand sphinx that will let you into the temple.\n\nIf anybody can help me it would be much appreciated I’m at a loss lol",
        "created_utc": 1672086258,
        "upvote_ratio": 1.0
    },
    {
        "title": "There’s a woman in a boat.",
        "author": "sippyside",
        "url": "https://www.reddit.com/r/riddles/comments/zvt090/theres_a_woman_in_a_boat/",
        "text": "On a lake wearing a coat.\nMr. Jones was watching from afar,\nSmoking his usual pack of cigar.\nHe saw the woman to be beautiful,\nBut did not know her name.\nIf you want to know her name,\nit’s on the riddle I just wrote.\nWhat is the woman’s name.",
        "created_utc": 1672078389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bob traveled from Los Angeles to San Francisco in his brand new Audi.",
        "author": "sippyside",
        "url": "https://www.reddit.com/r/riddles/comments/zvsgas/bob_traveled_from_los_angeles_to_san_francisco_in/",
        "text": "It was a rainy day, and there was a lot of traffic. There was a construction up ahead a few miles as well as a cop car talking to someone who had been over-speeding. Bob got to his destination without putting his foot on the pedal. How?",
        "created_utc": 1672076935,
        "upvote_ratio": 1.0
    },
    {
        "title": "George Bailey saves Clarence Odbody from the same phobia he provokes in the moon.",
        "author": "ChatRobot",
        "url": "https://www.reddit.com/r/riddles/comments/zvp5yd/george_bailey_saves_clarence_odbody_from_the_same/",
        "text": "I can't decide if it should be 'moon' or 'sea'.\n\nAppreciate any suggestions on phrasing.",
        "created_utc": 1672067657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conundrum",
        "author": "Few-Love-2380",
        "url": "https://www.reddit.com/r/riddles/comments/zvdesp/conundrum/",
        "text": "What gets wetter as it drys?",
        "created_utc": 1672023424,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was once in the ground can now be found in the clouds. For most it’s a tool, but for some only a toy. What is it?",
        "author": "Loud_Presentation155",
        "url": "https://www.reddit.com/r/riddles/comments/zvcpcc/what_was_once_in_the_ground_can_now_be_found_in/",
        "text": "First original riddle",
        "created_utc": 1672021045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I CANT FIND THE ANSWER TO THIS RIDDLE ITS MAKING ME GO CRAZY",
        "author": "Moaminthegamer1",
        "url": "https://www.reddit.com/r/riddles/comments/zv7zmy/i_cant_find_the_answer_to_this_riddle_its_making/",
        "text": "I can draw a line from your nose to my nose, can you draw a line \n\nPlease someone help",
        "created_utc": 1672006261,
        "upvote_ratio": 1.0
    },
    {
        "title": "What has ears but can’t hear?",
        "author": "Decent_Sky8237",
        "url": "https://www.reddit.com/r/riddles/comments/zv6ca8/what_has_ears_but_cant_hear/",
        "text": "&gt;!a cornfield!&lt;",
        "created_utc": 1672001334,
        "upvote_ratio": 1.0
    },
    {
        "title": "What has ears but can’t hear?",
        "author": "Decent_Sky8237",
        "url": "https://www.reddit.com/r/riddles/comments/zv69e6/what_has_ears_but_cant_hear/",
        "text": "A corn field",
        "created_utc": 1672001085,
        "upvote_ratio": 1.0
    },
    {
        "title": "My name changes depending on the time of day you use me. What am I?",
        "author": "pmaji240",
        "url": "https://www.reddit.com/r/riddles/comments/zv4ol3/my_name_changes_depending_on_the_time_of_day_you/",
        "text": ".",
        "created_utc": 1671996290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone figure out this riddle?",
        "author": "Alegarz01",
        "url": "https://www.reddit.com/r/riddles/comments/zuyzf2/can_anyone_figure_out_this_riddle/",
        "text": " I frown upon filet mignon, let’s do salmon and vegetables instead. What am I?\n\nI'm not sure of the answer to this riddle, would mean a lot to me if someone could help me figure this out.\n\nThanks",
        "created_utc": 1671978089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas riddles! All have 6 letter answers, good luck!",
        "author": "UntakenAccountName",
        "url": "https://www.reddit.com/r/riddles/comments/zupcfh/christmas_riddles_all_have_6_letter_answers_good/",
        "text": "I made these for a post that got deleted, just want to spread some cheer! :)",
        "created_utc": 1671937947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impossible",
        "author": "Hamza_bestrickroller",
        "url": "https://www.reddit.com/r/riddles/comments/zuohdd/impossible/",
        "text": "What is something that everything in this world has and when it interferes with fire and water nothing happens?",
        "created_utc": 1671934719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle to recommend that the answer is a word related to Christmas?",
        "author": "zukepillow",
        "url": "https://www.reddit.com/r/riddles/comments/zuogdv/riddle_to_recommend_that_the_answer_is_a_word/",
        "text": "Specifically, I'll use a riddle in my DnD oneshot Xmas special, if that's related to something for DnD, it's bonus points.",
        "created_utc": 1671934616,
        "upvote_ratio": 1.0
    },
    {
        "title": "You use it to study but also use it to play. When you talk to it, it talks back. You use it to shoot someone without killing them. Take away 2 letters from it, and it suddenly becomes one. What is it?",
        "author": "North_Recognition199",
        "url": "https://www.reddit.com/r/riddles/comments/zunt6x/you_use_it_to_study_but_also_use_it_to_play_when/",
        "text": "[removed]",
        "created_utc": 1671932239,
        "upvote_ratio": 1.0
    },
    {
        "title": "help solving a riddle i was told.",
        "author": "Jctej",
        "url": "https://www.reddit.com/r/riddles/comments/zun67e/help_solving_a_riddle_i_was_told/",
        "text": "“In my world, I’m a princess; But in their world, I’m a prince. Who am I?”",
        "created_utc": 1671929986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend has been looking for an answer to this one for about a year.",
        "author": "Primedot",
        "url": "https://www.reddit.com/r/riddles/comments/zulqbf/friend_has_been_looking_for_an_answer_to_this_one/",
        "text": "(Re-posted because i edited in a link and the post got auto-removed)\n\nMy friend just told me a riddle and I looked it up but could only find a twitter thread with a good possible answer. But I'm still not sure. Let me hear what you sleuths have to say:\n\n\"What is born with horns, Lives without horns, And dies with horns?\"\n\nBased on the twitter thread, my suspicion is that the answer is: &gt;!The Moon!&lt;\n\nThanks!",
        "created_utc": 1671925099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend has been looking for an answer to this one for about a year.",
        "author": "Primedot",
        "url": "https://www.reddit.com/r/riddles/comments/zujkof/friend_has_been_looking_for_an_answer_to_this_one/",
        "text": "I looked it up but could only find a twitter thread with a good possible answer. But I'm still not sure. Let me hear what you sleuths have to say:\n\n\"What is born with horns, Lives without horns, And dies with horns?\"\n\nThanks!",
        "created_utc": 1671918345,
        "upvote_ratio": 1.0
    },
    {
        "title": "My name changes depending on the time of day you use me. What am I?",
        "author": "pmaji240",
        "url": "https://www.reddit.com/r/riddles/comments/zuefcv/my_name_changes_depending_on_the_time_of_day_you/",
        "text": "Made this up this morning, though it’s possible I read it in the past and forgot I read it and now believe I made it up.\n\nAnswer: &gt;! I am a table. Breakfast table, lunch table, dinner table.!&lt;",
        "created_utc": 1671902968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle down below.",
        "author": "nataliaaakayyy",
        "url": "https://www.reddit.com/r/riddles/comments/zucjtw/riddle_down_below/",
        "text": "There was a ship going from Australia to China. On it, was 50 cows. The ship, halfway through it's trip, sunk. Who survived?\n\nThink.",
        "created_utc": 1671897330,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Am A Net For Catching Days...",
        "author": "Avatar_Xane_2",
        "url": "https://www.reddit.com/r/riddles/comments/zu94p6/i_am_a_net_for_catching_days/",
        "text": "...What am I?",
        "created_utc": 1671885889,
        "upvote_ratio": 1.0
    },
    {
        "title": "A place for six",
        "author": "jestyjest",
        "url": "https://www.reddit.com/r/riddles/comments/zu2kxw/a_place_for_six/",
        "text": "I was a temporary resident, ascended to a holier plane.\nI had a chance, my imagination still inflamed.\nI carry on, a god of the south and of the flame.",
        "created_utc": 1671859257,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have 800 keys and don’t open doors, yet I’m an entry point anyway.",
        "author": "ExistingBathroom9742",
        "url": "https://www.reddit.com/r/riddles/comments/zu1okp/i_have_800_keys_and_dont_open_doors_yet_im_an/",
        "text": "^",
        "created_utc": 1671856164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Google map search with $30 prize for first to solve!",
        "author": "Violenteddybear",
        "url": "https://www.reddit.com/r/riddles/comments/zu1h3f/google_map_search_with_30_prize_for_first_to_solve/",
        "text": "[removed]",
        "created_utc": 1671855444,
        "upvote_ratio": 1.0
    },
    {
        "title": "They stand when you lie. They lie when you stand. You use them for moving. They’re always with you.",
        "author": "Ok_Strength4608",
        "url": "https://www.reddit.com/r/riddles/comments/zu0n85/they_stand_when_you_lie_they_lie_when_you_stand/",
        "text": "Think.",
        "created_utc": 1671852714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with a riddle where the answer is \"chicken\"",
        "author": "JollyLark",
        "url": "https://www.reddit.com/r/riddles/comments/zu04gb/help_with_a_riddle_where_the_answer_is_chicken/",
        "text": "Any ideas? Searching is coming up short.",
        "created_utc": 1671851035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friday, John, and Jim went to a restaurant. They ate the food and paid the money, but John and Jim didn’t pay for food. Who paid?",
        "author": "Ok_Strength4608",
        "url": "https://www.reddit.com/r/riddles/comments/zu03b1/friday_john_and_jim_went_to_a_restaurant_they_ate/",
        "text": "I’ll wait.",
        "created_utc": 1671850927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone figure out this riddle?",
        "author": "Alegarz01",
        "url": "https://www.reddit.com/r/riddles/comments/ztu0i2/can_anyone_figure_out_this_riddle/",
        "text": "I am not soft. I am here for your security. I wouldn’t recommend messing around here without me. What am I? \n\nI'm not sure of the answer to this riddle, would mean a lot to me if someone could help me figure this out.\n\nThanks :)",
        "created_utc": 1671833246,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote my first riddle.",
        "author": "Number-True",
        "url": "https://www.reddit.com/r/riddles/comments/ztspel/i_wrote_my_first_riddle/",
        "text": "I thought I'd share a riddle I wrote that was a part of a gift I made for my brother. It's not meant to be very difficult, it's just for fun!\n\n&amp;#x200B;\n\nA belt to buckle around your waist\n\nA balm or bane is my embrace \n\nPain is prolonged in my hiding \n\nI am sought by the one presiding  \n\nIn drink and in jest, you can bet I’ll be there\n\nFound in the light, in vows, oath, and swear \n\nSharp tongue or kind word, a whisper or shout\n\nThere are many ways that I will come out",
        "created_utc": 1671829769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mushi Mushi? a riddle’s here",
        "author": "Benthegeolologist",
        "url": "https://www.reddit.com/r/riddles/comments/ztp8ik/mushi_mushi_a_riddles_here/",
        "text": "A circuit that is run\n\nWith no race to be won\n\nFrom there and back again\n\nIt’ll never be done\n\nUntil celled in",
        "created_utc": 1671820553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Erik Wollo: Recurrence. Stargazers",
        "author": "gaberax",
        "url": "https://www.reddit.com/r/riddles/comments/ztom93/erik_wollo_recurrence_stargazers/",
        "text": "*Note: title has no bearing on the riddle.*\n\nWhere can one grab a bite to eat?\n\nWhere can one rent a bed?\n\nWhere can one find a barber who will tame an ungroomed head?\n\nThose lost just need to cast about\n\nIndicators are everywhere\n\nCountless are the varieties\n\nJust look and find them there.\n\nCoorespondence from Lord above\n\nTo set one on the right way.\n\nThe Devil smiles when the act is done\n\nAnd one's soul is dealt away.",
        "created_utc": 1671818945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some advice for your riddle =)",
        "author": "YOURRIDDLESSUCK",
        "url": "https://www.reddit.com/r/riddles/comments/ztoctj/some_advice_for_your_riddle/",
        "text": "\nYour riddles could use some work!!! =) (Part 1)\n\nI’m so tired of people making riddles that aren’t up to their full potential. Today’s topic of riddles that I think are a bit mid are the ones with multiple logical answers. You know, the ones that have makers who say “NO. that’s not the answer” even though every single stanza THEY PUT supports the answer. Not my fault your riddle lacks any flavor and is literally just generic garbage that I would wipe my filthy shoes on after walking through a septic tank filled with 2 week old leftovers, expired milk, chewed paper towels, and other typically flushed contents. /pos /lh (not hate =P)\n\nI could describe a THOUSAND things as “only cared about when lost”. That’s like, I don’t know, pretty much everything? \nIf the guess to the riddle checks out on every single stanza/hint, no matter HOW far it may be from the intended answer, it makes is a correct guess. It’s only fair!\nIf you want there to be one answer and one answer only to your riddle, then make it more creative. Use your brain! Thank you.",
        "created_utc": 1671818290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some advice for your riddle =)",
        "author": "YOURRIDDLESSUCK",
        "url": "https://www.reddit.com/r/riddles/comments/ztocsj/some_advice_for_your_riddle/",
        "text": "\nYour riddles could use some work!!! =) (Part 1)\n\nI’m so tired of people making riddles that aren’t up to their full potential. Today’s topic of riddles that I think are a bit mid are the ones with multiple logical answers. You know, the ones that have makers who say “NO. that’s not the answer” even though every single stanza THEY PUT supports the answer. Not my fault your riddle lacks any flavor and is literally just generic garbage that I would wipe my filthy shoes on after walking through a septic tank filled with 2 week old leftovers, expired milk, chewed paper towels, and other typically flushed contents. /pos /lh (not hate =P)\n\nI could describe a THOUSAND things as “only cared about when lost”. That’s like, I don’t know, pretty much everything? \nIf the guess to the riddle checks out on every single stanza/hint, no matter HOW far it may be from the intended answer, it makes is a correct guess. It’s only fair!\nIf you want there to be one answer and one answer only to your riddle, then make it more creative. Use your brain! Thank you.",
        "created_utc": 1671818288,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone decode this?",
        "author": "estrid_",
        "url": "https://www.reddit.com/r/riddles/comments/zteumw/can_someone_decode_this/",
        "text": "It's supposed to be a code. \nFound it while looking for creepypasta stuff\n\nThe last two digits are 49.\n&gt;The first, a tower struck by lightning\n&gt;The second, the one who kings and papers meet as equal\n&gt;And the last, a 4 letter word with the same meaning as it's letters",
        "created_utc": 1671800955,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a riddle for my story",
        "author": "RiskyAsterisk",
        "url": "https://www.reddit.com/r/riddles/comments/ztdzuk/i_need_a_riddle_for_my_story/",
        "text": "specifically one that the answer is a clock handle",
        "created_utc": 1671798180,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 in 1. 3 in 2. 5 in 3, and 4 in 4. What are they?",
        "author": "Ok_Strength4608",
        "url": "https://www.reddit.com/r/riddles/comments/ztdsy0/3_in_1_3_in_2_5_in_3_and_4_in_4_what_are_they/",
        "text": "I can wait for your answers. Think carefully.",
        "created_utc": 1671797536,
        "upvote_ratio": 1.0
    },
    {
        "title": "A girl wears a bikini and goes in the shower, but her bikini doesn't get wet at all. How?",
        "author": "Ok_Strength4608",
        "url": "https://www.reddit.com/r/riddles/comments/ztdr18/a_girl_wears_a_bikini_and_goes_in_the_shower_but/",
        "text": "What's your answer?",
        "created_utc": 1671797369,
        "upvote_ratio": 1.0
    },
    {
        "title": "It has 88 keys, yet it can't unlock any doors.",
        "author": "Ok_Strength4608",
        "url": "https://www.reddit.com/r/riddles/comments/ztdpj4/it_has_88_keys_yet_it_cant_unlock_any_doors/",
        "text": "What is it?",
        "created_utc": 1671797231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random request - does anyone know any pottery riddles lol?",
        "author": "Penfoldsgun",
        "url": "https://www.reddit.com/r/riddles/comments/zta38h/random_request_does_anyone_know_any_pottery/",
        "text": "For a Christmas Gift :) \n\nMerry Christmas &amp; Happy New Year Riddlers!",
        "created_utc": 1671783447,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of me can completely stop you. But multiple of me can only slow you down... What am I?",
        "author": "soaphilla",
        "url": "https://www.reddit.com/r/riddles/comments/zt9d49/one_of_me_can_completely_stop_you_but_multiple_of/",
        "text": "Hint: I'm in the question",
        "created_utc": 1671780612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddle with the answer bring “wizard”",
        "author": "theguru86",
        "url": "https://www.reddit.com/r/riddles/comments/zt2usi/riddle_with_the_answer_bring_wizard/",
        "text": "Need some help!",
        "created_utc": 1671758678,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might be far from the point, but I'm not a mistake. In fact, I fix yours. What am I?",
        "author": "kickypie",
        "url": "https://www.reddit.com/r/riddles/comments/zsxr68/i_might_be_far_from_the_point_but_im_not_a/",
        "text": " I might be far from the point, but I'm not a mistake. In fact, I fix yours. What am I?",
        "created_utc": 1671745500,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help for 5 dollars pls",
        "author": "pissinhaler",
        "url": "https://www.reddit.com/r/riddles/comments/zsuph1/need_help_for_5_dollars_pls/",
        "text": "Why did the jungle go back into the grocery store",
        "created_utc": 1671737661,
        "upvote_ratio": 1.0
    },
    {
        "title": "guess how i am ?",
        "author": "salahooo94",
        "url": "https://www.reddit.com/r/riddles/comments/zsuib3/guess_how_i_am/",
        "text": " I like to suspend and won’t say sorry. That’s ok though as I won’t stay in my seat here much longer. Who am I?",
        "created_utc": 1671737148,
        "upvote_ratio": 1.0
    }
]