[
    {
        "title": "A New Perspective",
        "author": "Erindring",
        "url": "https://www.reddit.com/r/riddles/comments/6tqady/a_new_perspective/",
        "text": "1\n11\n21\n1211\n111221\n\nThis sequence goes on indefinitely. What is the next line?",
        "created_utc": 1502752590,
        "upvote_ratio": ""
    },
    {
        "title": "The Grim Reaper's Prisoners Riddle",
        "author": "Etheo",
        "url": "https://www.reddit.com/r/riddles/comments/6tnn6u/the_grim_reapers_prisoners_riddle/",
        "text": "[Image version of the riddle here.](http://imgur.com/OxSULoP)\n\nYou and 8 of your friends died in a tragic accident, now in front of you stood the Grim Reaper himself.  \nDied unjustly, all of you challenged Death to play a game for a chance of life.  \nBusy with his next targets, Death decided to best you all together in a conundrum.  \nHe sets the 9 of you standing in a line, alternating the your direction so that the first person (A) is facing east, and the next person (B) is facing west, then the next (C) facing east... and so on [(see image for visualization)](http://imgur.com/OxSULoP).\n\nHe then took out 9 coloured masks and put 1 on each of you, and said the following:\n\n &gt; The mask you're wearing is either Red, Yellow or Green.  \n &gt; There are only 3 masks of each colour.  \n &gt; The colour of your mask is different than your friend's directly in front and behind you.  \n &gt; There's no speaking or any communication allowed.  \n &gt; When it's your turn, you may take one guess of your colour.  \n &gt; If you're correct, you may live again.  If you're wrong, you die.\n\nSome of your friends protested they are put in an unfair position, so Death relented: \n\n &gt; If no more than 3 of you get it correctly, you may have another guess.\n\nDeath then goes to Friend A, who guessed correctly in the first try and is revived.  His guess was not made public to the others, but Death made it known it is correct.\nDeath then asks Friend H, and then Friend C.  Both of which did not take a guess.  \n\nNow it's your turn, [and you're in position (F).  Facing you is Friend A (revived) who is wearing Green, Friend C wearing Red, and Friend E wearing Yellow.](http://imgur.com/OxSULoP)\n\n**Can you guess your colour correctly?**\n\n##Bonus Question: \n\nDeath taunted, \n&gt; If you can guess the colour of the masks on all of your friends correctly during this turn, you may all live.\n\n**Can you save all of your friends?**",
        "created_utc": 1502728945,
        "upvote_ratio": ""
    },
    {
        "title": "Can You Name this Video Game Character?",
        "author": "be_riddled",
        "url": "https://www.reddit.com/r/riddles/comments/6tne6w/can_you_name_this_video_game_character/",
        "text": "No need to catch me when I fall //\nFor I have my trusty parasol //\nHold me captive, best beware //\nThe final victory will be his\n\n\nHead over to the complete video for more riddles and answers 🐰🐰🐰🐰\n\nYouTube Channel: BeRiddled",
        "created_utc": 1502726752,
        "upvote_ratio": ""
    },
    {
        "title": "A Two Word Term",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6tio1i/a_two_word_term/",
        "text": "[deleted]",
        "created_utc": 1502667644,
        "upvote_ratio": ""
    },
    {
        "title": "Racist warning",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6tfh6e/racist_warning/",
        "text": "[removed]",
        "created_utc": 1502635808,
        "upvote_ratio": ""
    },
    {
        "title": "The Great Riddle of The Sphinx",
        "author": "Jus10Sch",
        "url": "https://www.reddit.com/r/riddles/comments/6t5eh2/the_great_riddle_of_the_sphinx/",
        "text": "First, if your interested, some history.  Legend has it, The Sphinx would tell this riddle to her victims, a riddle deemed impossible, (but today quite simple.) When her victim got it wrong, she would tear him apart. Until one day, the great hero Oedipus solved her riddle, and she was so shocked, she ran off a cliff and plummeted to her death. This is the riddle, (please don't look it up, and put a spoiler tag on your guess!) \n\n\"What has 4 legs in the morning, 2 in the afternoon, and 3 at night? ",
        "created_utc": 1502498441,
        "upvote_ratio": ""
    },
    {
        "title": "Life/Death (?) Post from r/nosleep",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6t53lp/lifedeath_post_from_rnosleep/",
        "text": "[deleted]",
        "created_utc": 1502495050,
        "upvote_ratio": ""
    },
    {
        "title": "Marrowless",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6t22mi/marrowless/",
        "text": "[deleted]",
        "created_utc": 1502467050,
        "upvote_ratio": ""
    },
    {
        "title": "Instead of posting each riddle i present you the most difficult riddle game.For anyone who loves spending time solving hard riddles and puzzles.",
        "author": "The_Creators_team",
        "url": "https://www.reddit.com/r/riddles/comments/6t0oul/instead_of_posting_each_riddle_i_present_you_the/",
        "text": "We are a brand new developing team and we have just created a very hard but addictive puzzle game.In this game the user has a keyboard and of course his mind(also a little search over the internet) in order to solve a series of hard riddles and puzzles. We would appreciate any feedback and opinion regarding this game. Certainly we would like to give us a feedback whether you liked the game or not?Also if the sequence of the levels is right regarding its level difficulty.We tried to scale the difficulty starting from easy ones to some more difficult. *Our problem is that although the most riddles are clever and thoughtful,most of the users stuck in the early game and complain. Our opinion is that the game is for anyone who wants to spend time with it * (Last but not least if you have any problem installing and playing this app,please write down your 1.Android Version 2.Screen Size 3.Screen resolution. ) Any positive criticism is welcome!!\nThe game is : [Abstract](https://play.google.com/store/apps/details?id=com.dgk.riddles)\n\nRegards !!!!",
        "created_utc": 1502453139,
        "upvote_ratio": ""
    },
    {
        "title": "Soft",
        "author": "xbno",
        "url": "https://www.reddit.com/r/riddles/comments/6sz3xm/soft/",
        "text": "What feels better than it looks?",
        "created_utc": 1502428970,
        "upvote_ratio": ""
    },
    {
        "title": "What's is black and white at night but not a light. People think they hear me but they only see me. I'm with you when it's dark. What or who am I?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6syjhr/whats_is_black_and_white_at_night_but_not_a_light/",
        "text": "[deleted]",
        "created_utc": 1502421742,
        "upvote_ratio": ""
    },
    {
        "title": "Clever?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6swwy0/clever/",
        "text": "[deleted]",
        "created_utc": 1502404197,
        "upvote_ratio": ""
    },
    {
        "title": "Roman Numerals",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6swmrg/roman_numerals/",
        "text": "[deleted]",
        "created_utc": 1502401576,
        "upvote_ratio": ""
    },
    {
        "title": "Annoying Number Puzzle I can't Figure Out (From MI5)",
        "author": "riddlemethis543",
        "url": "https://www.reddit.com/r/riddles/comments/6swiqv/annoying_number_puzzle_i_cant_figure_out_from_mi5/",
        "text": "This apparently is/was on the MI5 entrance exam... I know the answer, but I don't know WHY it's the answer. It's driving me nuts... Hopefully someone here can figure it out...\n\n\n\"On 10th January I visited the Science Museum with 6 friends: 3 came by car and 2 by train – the other 1 arrived with me on the number 2 bus. At the Museum we went to the cafe and ordered 3 cakes, 3 coffees and 1 apple juice. In the main hall were 22 visitors looking at the Pilot ACE exhibit including 11 kids; 15 of these visitors were part of the same group, I think. At ? to ? a fire alarm sounded, but it was a false alarm.\n \nWhat time did the fire alarm sound?",
        "created_utc": 1502400555,
        "upvote_ratio": ""
    },
    {
        "title": "The Dead Carry the Living",
        "author": "JBC202",
        "url": "https://www.reddit.com/r/riddles/comments/6svbmm/the_dead_carry_the_living/",
        "text": "The dead carry the living over a field of unrest.\n\nWhat is this line talking about?",
        "created_utc": 1502390017,
        "upvote_ratio": ""
    },
    {
        "title": "What's missing in the set?",
        "author": "Etheo",
        "url": "https://www.reddit.com/r/riddles/comments/6sutod/whats_missing_in_the_set/",
        "text": "12, 15, 24, 36, 48, **?**, 126, 128, 135, 168, 248, **?**, 1248, 1368\n\nThis is the entirety of the set - there's no more number that can follow the criteria used to generate the number set.",
        "created_utc": 1502385738,
        "upvote_ratio": ""
    },
    {
        "title": "Living dead",
        "author": "YeOldManWaterfall",
        "url": "https://www.reddit.com/r/riddles/comments/6sufyr/living_dead/",
        "text": "&gt;White and red\n\n&gt;On a bed\n\n&gt;Living dead\n\n&gt;Scratch your head\n\nWhat am I?",
        "created_utc": 1502382414,
        "upvote_ratio": ""
    },
    {
        "title": "Looking over your shoulder",
        "author": "melanmark",
        "url": "https://www.reddit.com/r/riddles/comments/6srnaq/looking_over_your_shoulder/",
        "text": "What has levels that cannot be walked, a window that's there for thought, a handle that pulls right down and dials that spin around and around?",
        "created_utc": 1502348384,
        "upvote_ratio": ""
    },
    {
        "title": "The Unsolvable Riddle",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6spamd/the_unsolvable_riddle/",
        "text": "[removed]",
        "created_utc": 1502320104,
        "upvote_ratio": ""
    },
    {
        "title": "Rosebush Magic",
        "author": "YeOldManWaterfall",
        "url": "https://www.reddit.com/r/riddles/comments/6snd4v/rosebush_magic/",
        "text": "I remember reading this in a riddle book as a child, not sure of the source. Sorry for the length, there's a TLDR version at the end.\n\nA young couple eloped to a beautiful seaside town and, on their wedding night, the man decided to pick his wife a rose from a nearby garden. Unknown to him, the garden belonged to a witch.\n\nWhen he picked the rose, the entire rosebush wilted. The witch appeared, furious, and told him he would pay for his crime as soon as the sun rose. He returned to his wife and they spent a wonderful night together, but at sunrise he awoke to find she was gone, the rose lying in her still-warm spot next to him.\n\nHe dashed through the chilly morning air to the garden. In the twilight he searched for the spot near the wilted rosebush where he had met the witch, but found only fifteen perfect rosebushes and no sign of his meeting last night.\n\nThe witch then appeared, telling the man that in return for the rose he stole from her, she now claimed his precious rose as her own, a bush to replace the one she'd lost.\n\nWith a grin the witch added a caveat. Pick out which bush was his wife, and she would be turned back. Guess wrong, and he would also be added to her collection.\n\nThe man agreed but, as he gazed about him at the bushes, realized they had been magicked to be indistinguishable from one another, down to the last thorn and petal. Tears streamed from his face as he made the decision to spend the rest of eternity in this garden, as a bush, with his wife. He moved towards a random bush to make his choice.\n\nThen suddenly, he stopped. As the witch watched, he then hurriedly inspected several bushes, and stopped at one.\n\n\"This is my beloved\" shouted the man \"we agreed, now turn her back at once!\"\n\nDefeated, she turned his wife back into a human.\n\n\"You are free to go, man, but tell me, how did you know?\"\n\n\"Truly\" said the man \"I was stumped until my despair guided me. You who have never know great joy nor great sorrow could not have hoped for the same!\"\n\nTears of happiness in their eyes, the young couple left the garden, tight in one another's embrace. The witch looked after them, puzzled.\n\nHow did the man know which bush was his wife?\n\n[TLDR/Hint](#s \"A man wakes up in the morning to find his wife missing, and was turned into a rosebush in a nearby rose garden. Despite the bushes being identical, he's able to pick out which one is her. How?\")",
        "created_utc": 1502302487,
        "upvote_ratio": ""
    },
    {
        "title": "Little known variation of the \"Prisoner hat riddle\"",
        "author": "luscid",
        "url": "https://www.reddit.com/r/riddles/comments/6smxta/little_known_variation_of_the_prisoner_hat_riddle/",
        "text": "Hello, guys!\n\nWe’ve created an [animated video]( https://www.youtube.com/watch?v=1MSZQekJWFE) on one of the variations of the **Prisoner Hat Riddle**. It’s not a hard riddle but it’s an interesting one.\n\n“Four men are arrested for a crime, but the jail is full and the warden has nowhere to put them. He eventually comes up with the solution of giving them a puzzle so if they solve it they can go free but if they fail they will be executed. \nThe warden arranges three of the criminals into a line. The fourth man is put behind a wall and can’t see any of the other fellows. Man 3 can only see the wall, man 2 can only see man 3 and man 1 can see both men 2 and men 3. The warden gives each of the criminals a hat and explains that there are two red hats and two blue hats [from left to right - man 1 is given a red hat, man 2 - also a red hat, man 3 and man 4 (man 4 is the one behind the wall) are both wearing blue hats]. The rules are simple: \nIf ANY of the criminals can figure out what’s the color of his hat with 100% certainty and shouts it out, all four men will be set free. But if any of them suggests an incorrect answer, all four men will be executed. They are not allowed to turn round or move, to talk to each other or to take their hats off.\nIf we presume that all 4 fellows think quite logically, **who will be the first person to shout out and why?**”\n\nYou can find the answer and an explanation in the [video]( https://www.youtube.com/watch?v=1MSZQekJWFE). Hope you enjoy it!\n\nP.S.: We’ve read the community’s guidelines but we are new here and we apologize if the post is breaking any rules.\n",
        "created_utc": 1502298868,
        "upvote_ratio": ""
    },
    {
        "title": "Gardening whores: A shitty riddle probably more suited to /r/shittyriddles",
        "author": "InsideOutVoices",
        "url": "https://www.reddit.com/r/riddles/comments/6sjqxq/gardening_whores_a_shitty_riddle_probably_more/",
        "text": "A prostitute helps plant your flowers  \nThe pieces that make up the hours  \nTake this thing to steal my powers  \n&amp;nbsp;  \nThe smartest are now building towers  \n\n\n&amp;nbsp;  \n\n______________________________________\nThought I'd try it here first",
        "created_utc": 1502261318,
        "upvote_ratio": ""
    },
    {
        "title": "Hardest riddle ive ever encountered",
        "author": "yonis163",
        "url": "https://www.reddit.com/r/riddles/comments/6sjmo2/hardest_riddle_ive_ever_encountered/",
        "text": "What is tall during day but skinny at night and is annoying at winter but happy at summer?",
        "created_utc": 1502259526,
        "upvote_ratio": ""
    },
    {
        "title": "A man dies leaves his camels to his three sons as inheritance",
        "author": "Omen3119",
        "url": "https://www.reddit.com/r/riddles/comments/6sjjo5/a_man_dies_leaves_his_camels_to_his_three_sons_as/",
        "text": "A man dies leaves his camels to his three sons as inheritance. Of the 17 camels he owned, he requested that the eldest receive 1/2 of the camels, the middle child receive 1/3 of the camels, and the youngest receive 1/9 of the camels. How do they correctly split the all of the camels?",
        "created_utc": 1502258316,
        "upvote_ratio": ""
    },
    {
        "title": "Answer me this riddle and ill give you 200 dogecoins.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6sjbvo/answer_me_this_riddle_and_ill_give_you_200/",
        "text": "[deleted]",
        "created_utc": 1502255302,
        "upvote_ratio": ""
    },
    {
        "title": "What am I?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6sj3wu/what_am_i/",
        "text": "[deleted]",
        "created_utc": 1502252526,
        "upvote_ratio": ""
    },
    {
        "title": "What melts off a spoon when it's hot?",
        "author": "impossiblefork",
        "url": "https://www.reddit.com/r/riddles/comments/6shelq/what_melts_off_a_spoon_when_its_hot/",
        "text": "What melts off a spoon when it's hot,\n\nbut doesn't when it is not?\n\nIt's also quite sweet,\n\nis not made from beet,\n\nand there are replacements that could make you weep.",
        "created_utc": 1502234127,
        "upvote_ratio": ""
    },
    {
        "title": "Does this riddle look familiar to anyone?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6sfxjb/does_this_riddle_look_familiar_to_anyone/",
        "text": "[deleted]",
        "created_utc": 1502220910,
        "upvote_ratio": ""
    },
    {
        "title": "What's my name?",
        "author": "Etheo",
        "url": "https://www.reddit.com/r/riddles/comments/6sfhiy/whats_my_name/",
        "text": "I'm a product of my prior,  \ndull and boring,  \nalways fair.\n\nI will never be seen around.  \nYet I gather,  \nMany in town.\n\nSeen alone I lay depressed,  \nMy surrounding's all the same.  \nFound me in a group of six?  \nYou wouldn't have called my name.\n\nThis is a slight reworked version of my previous unsolved riddle, no takers yet :)",
        "created_utc": 1502217183,
        "upvote_ratio": ""
    },
    {
        "title": "Peacefully Rest",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6sejz5/peacefully_rest/",
        "text": "[deleted]",
        "created_utc": 1502209049,
        "upvote_ratio": ""
    },
    {
        "title": "You May Not Want The Answer Today",
        "author": "PokemonDuel-Samuel",
        "url": "https://www.reddit.com/r/riddles/comments/6s9ljt/you_may_not_want_the_answer_today/",
        "text": "Though cold, in mine own company you may feel bliss\n\nThough fearful as I'm known, all work towards my kiss\n\nDefeated by none, so none living know my face\n\nAll who will live will feel my embrace\n\nWhether with pleasure or pain, I am met all the same\n\nLong-awaited or early, I never come late\n\nWho am I?",
        "created_utc": 1502149255,
        "upvote_ratio": ""
    },
    {
        "title": "Missing Your Ex",
        "author": "BronzeYasuoBot",
        "url": "https://www.reddit.com/r/riddles/comments/6s8j9q/missing_your_ex/",
        "text": "\"When you miss your ex, but not because you want them back. Rather, because it is this you may lack.\"\n\nIt took me a long time to actually answer this so I thought I would post it.\n\n\nhttps://www.riddlewot.com/riddles/SALBn8iwT7\n\nEdit: Forgot to add that it contains 3 letters",
        "created_utc": 1502139361,
        "upvote_ratio": ""
    },
    {
        "title": "[Massive X-Post] Solve These for Prizes",
        "author": "Thernos",
        "url": "https://www.reddit.com/r/riddles/comments/6s7v0h/massive_xpost_solve_these_for_prizes/",
        "text": "[removed]",
        "created_utc": 1502133475,
        "upvote_ratio": ""
    },
    {
        "title": "An online puzzle/riddle game.",
        "author": "Xelerox",
        "url": "https://www.reddit.com/r/riddles/comments/6s6k27/an_online_puzzleriddle_game/",
        "text": "Hi guys,\n\nI created a puzzle/riddle game online to teach myself how to create basic webpages. No one has solved the completed game as of yet. I encourage you to try it out! Victors are allowed to submit puzzles or riddles to be added to the Enigma (the name of the game). \n\n\n**IMPORTANT NOTE:** The game is designed to be confusing and not very straight forward. Some puzzles will not be 100% fair, you will sometimes need to think outside of the box. \n\n**MORE IMPORTANT:** I apologize for this not being clear, but in order to fully solve the Enigma you must NOT use any skips in solving it. The skips are implemented in order to help you make progress without getting stuck at a question. If you do use skips and get to the end, hit the restart button and try again!\n\nThere is supposed to be minimal help/explanation. It is meant for the player to figure out both the game and the puzzles.\n\n\nPlease enjoy!\n\n\nhttps://elliothume.github.io/enigma.html\n\n\nP.S. One mechanic can be confusing, so I will explain one thing. You are allowed to use Google if the puzzle has a green check mark on the page. This may be because either Google will not help or the puzzle is too hard that the puzzle itself is in the action of looking it up.\n\nP.P.S. This is my first Reddit post, I apologize if I break any rules.",
        "created_utc": 1502122345,
        "upvote_ratio": ""
    },
    {
        "title": "Quack",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6s6h4u/quack/",
        "text": "[deleted]",
        "created_utc": 1502121679,
        "upvote_ratio": ""
    },
    {
        "title": "Which letters are higher than 10?",
        "author": "FlyWereAble",
        "url": "https://www.reddit.com/r/riddles/comments/6s5qo9/which_letters_are_higher_than_10/",
        "text": "",
        "created_utc": 1502114948,
        "upvote_ratio": ""
    },
    {
        "title": "Born with the moon",
        "author": "Koreldev",
        "url": "https://www.reddit.com/r/riddles/comments/6s1avp/born_with_the_moon/",
        "text": "Hi hi\n\nJust want to share a riddle of mine, to know if I made it too hard :\n\nI start with the moon,\nand I die with God,\nI see as many noon\nas the color, its odd\n\nBy the way, this is where it came from: https://play.google.com/store/apps/details?id=com.second.korel.poeticriddles&amp;hl=en\nI would be glad to hear your thoughts about the other riddles too :)\n",
        "created_utc": 1502057039,
        "upvote_ratio": ""
    },
    {
        "title": "Any ideas has to what this could mean?",
        "author": "TonTHunT",
        "url": "https://www.reddit.com/r/riddles/comments/6s06ui/any_ideas_has_to_what_this_could_mean/",
        "text": "Clue one\nThis whole world is wild at heart and weird on top...\nClue two \nWant to find a Box? Then all I have to say is go out after sunset where the stars come out to play..\n\n",
        "created_utc": 1502045958,
        "upvote_ratio": ""
    },
    {
        "title": "A prickly riddle",
        "author": "YeOldManWaterfall",
        "url": "https://www.reddit.com/r/riddles/comments/6rwaat/a_prickly_riddle/",
        "text": "Came up with a few the other day, trying to space them out. Another 'what am I' riddle, this one should give you a definite \"aha!\" moment when you figure it out.\n\n&gt;Push me, pull me\n\n&gt;One end is quite prickly\n\n&gt;I sound quite aggressive\n\n&gt;If I'm said too quickly\n\nAnswer: [spoiler](#s \"http://farm1.static.flickr.com/38/106836361_bedbaf9ebe_m.jpg\")",
        "created_utc": 1501991223,
        "upvote_ratio": ""
    },
    {
        "title": "How is polish invariably related to reading and a job?",
        "author": "Fleecyfever",
        "url": "https://www.reddit.com/r/riddles/comments/6rocp8/how_is_polish_invariably_related_to_reading_and_a/",
        "text": "",
        "created_utc": 1501889493,
        "upvote_ratio": ""
    },
    {
        "title": "Food for thought",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6roc4u/food_for_thought/",
        "text": "[deleted]",
        "created_utc": 1501889313,
        "upvote_ratio": ""
    },
    {
        "title": "Numerical 'What Am I' riddle",
        "author": "YeOldManWaterfall",
        "url": "https://www.reddit.com/r/riddles/comments/6roa76/numerical_what_am_i_riddle/",
        "text": "This is a sub-riddle to [these](https://www.reddit.com/r/riddles/comments/6rnnpd/icy_with_a_theme_song/) [two](https://www.reddit.com/r/riddles/comments/6roc4u/food_for_thought/) riddles. Solving one riddle will help you solve the others.\n\nWhen you tell me 100   \n\nI'll give you just 60\n\nTell me 99\n\nAnd things might get too crispy\n\nWhat am I?\n",
        "created_utc": 1501888704,
        "upvote_ratio": ""
    },
    {
        "title": "My first original (crafted while I was at work today).",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6rnojb/my_first_original_crafted_while_i_was_at_work/",
        "text": "My use as a tool is one of a kind\nIf you open your mind, I can helpfully bind\nI may be given by necessity or treat\nPain, will you find, if I adhere to your seat\n\nWhat am I?\n\nSolved!",
        "created_utc": 1501882531,
        "upvote_ratio": ""
    },
    {
        "title": "Icy with a Theme Song",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6rnnpd/icy_with_a_theme_song/",
        "text": "[deleted]",
        "created_utc": 1501882309,
        "upvote_ratio": ""
    },
    {
        "title": "Help with this riddle?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6rmbs2/help_with_this_riddle/",
        "text": "[deleted]",
        "created_utc": 1501870165,
        "upvote_ratio": ""
    },
    {
        "title": "What flies when it's born, lies when it's alive, and runs when it dies?",
        "author": "freepopper",
        "url": "https://www.reddit.com/r/riddles/comments/6rm34k/what_flies_when_its_born_lies_when_its_alive_and/",
        "text": "",
        "created_utc": 1501868124,
        "upvote_ratio": ""
    },
    {
        "title": "Five times two equals A. But A does not equal Ten. How?",
        "author": "Nightstalian",
        "url": "https://www.reddit.com/r/riddles/comments/6rkw86/five_times_two_equals_a_but_a_does_not_equal_ten/",
        "text": "Math Riddle, maybe, have fun.\n\nIn formula for you number people.\n\n5x2=A\nA≠10\n\n*Hint\n[spoiler](#s \"1=1, 2=2, 3=3, 4=4, 5=5, 6=6, 7=7, 8=8, 9=9\")",
        "created_utc": 1501857678,
        "upvote_ratio": ""
    },
    {
        "title": "What word am I? Limerick riddle.",
        "author": "Dralnu22",
        "url": "https://www.reddit.com/r/riddles/comments/6rk3jm/what_word_am_i_limerick_riddle/",
        "text": "A riddle in the form of a limerick popped into my head. It's not that special but here we are:\n\n*I am cousin to a guy by the name of fever,*\n\n*A bit weird I know, but I'm no deceiver,*\n\n*Proclaiming me isn't smart,*\n\n*I cause things to not start,*\n\n*But do shout me if asked \"you a Belieber?\"*",
        "created_utc": 1501849249,
        "upvote_ratio": ""
    },
    {
        "title": "Number sequence riddle, hints provided. I have not seen this type of sequence riddle, apologies if it's a common one.",
        "author": "InsideOutVoices",
        "url": "https://www.reddit.com/r/riddles/comments/6risgk/number_sequence_riddle_hints_provided_i_have_not/",
        "text": "**9522  \n5732  \n3652  \n2463  \n????**      \n&amp;nbsp;  \nHopefully this isn't too easy right off the bat.  As hints, if you provide any number, I will provide the ~~third number~~ *next two numbers in the series*.  For example, if you provide the number xxxx, I will provide the following hint:  \nxxxx  \n~~????~~*zzzz*  \nyyyy  \n...where *zzzz is the second number and* yyyy is the third number in the series started by xxxx, following the same rules as the original series.   \n&amp;nbsp;  \n__________________________________  \n***EDIT**: All of the hints I have given can be found below.  The first of the three numbers represents the random number provided in a comment, the following two numbers result from using the same rules applied to the original riddle.*  \n\nHint 1:  \n&gt;  3254  \n2244  \n1234  \n\n&amp;nbsp;  \n\nHint 2:  \n&gt;8153  \n4534  \n2543  \n\n&amp;nbsp;  \n\nHint 3:  \n&gt;7129   \n4416  \n2433\n\n\n&amp;nbsp;  \n\n\nHint4:  \n&gt;9999  \n5999  \n3799  \n\n\n\n\n\n\n*I'll add hints as more people ask for them*\n",
        "created_utc": 1501829667,
        "upvote_ratio": ""
    },
    {
        "title": "Escape the Mansion! Logic grid puzzle with a twist!",
        "author": "Etheo",
        "url": "https://www.reddit.com/r/riddles/comments/6rgglo/escape_the_mansion_logic_grid_puzzle_with_a_twist/",
        "text": "#Escape the Mansion  \n  \nWelcome to my evil little puzzle!   \nFor your amusement, I have trapped 6 people in a mansion with their work tools scattered around randomly.  \nTo escape, they must reach the room with the secret exit alone, using the tool that matches their occupation to break the lock.  \nThere are exactly 5 rooms each in the Main Floor and Basement.  It's in your best interest to figure out the \"Floor Plan\" ASAP.  \nIn a period of 4 hours, each person searches a new room and didn't return to a room they've visited.  \nIf a room has been visited by 3 different persons, it becomes inaccessible to everyone.  \nOnly at most 2 persons were together in the same room in the same hour.  \nEach room has 1 tool at most; the 1st person who visited the room alone always takes the tool with them.  \nIf 2 persons met in a room, the person with a lethal tool (i.e. Lock Pick and Calculator are not lethal) will kill the other person without a lethal tool.  \n  \nBelow are the events that unfolded:  \n1.) For the first 3 hours, there were exactly 3 person on each Floor.  \n2.) The Police has never been to the Main Floor, where The Firefighter has visited the Dining Room and the Billiard Room.  \n3.) Nobody searched the Pool, Billiard Room, or the Gym until the 3rd hour.  \n4.) Nobody searched the Dining Room and the Living Room after the 2nd hour.  \n5.) The Storage was searched by Oswald, the Police, and Garrett in the 1st, 2nd and 3rd hour respectively, each person alone.  \n6.) The Chef stayed on the Main Floor but never visited the Billiard Room, and was never alone except in the Pool at the 3rd hour.  \n7.) Tina and the Plumber ran into each other at the Billiard Room at the 3rd hour.  Nobody else has visited the Room.  \n8.) The Chef and Mallory both started at the Living Room which doesn't have any tool.  \n9.) The Firefighter and Garrett has never been to the Living Room and the Kitchen.  \n10.) Walter and the Plumber both searched the Theatre and the Storage alone in the first 2 hours. Both of them found the wrong tool, one of which was a Pistol.  \n11.) The Plumber spent the last 2 hours in the Main Floor.  \n12.) The Teacher spent 3 hours in the Main Floor searching the Pool, Kitchen, and the Living Room, but has searched the Basement once in between.  \n13.) Oswald has ran into someone in the Billiard Room right before he ran into the Knife wielding Florence in the Kitchen.  \n14.) Garrett has never been to the Laundry but picked up the Calculator in the 1st hour, but the Teacher did not pick up a tool until the 2nd hour.  \n15.) Both Tina and the Petty Thief switches Floor each hour.  \n16.) They've been to the Dining Room but haven't met each other.  \n17.) They've never searched the Gym, Kitchen, or the Living Room.  The Wrench is in one of these 3 rooms.  \n18.) Only the Laundry and the Study were visited exactly once, alone.  \n19.) The Axe was either at the Storage, Laundry or the Kitchen.  \n20.) The person who found the Lockpick at the Theatre was murdered at the 3rd hour in the Gym, where nobody visited afterwards.  \n21.) Only 1 person escaped successfully, and it happened at the 4th hour.  \n  \nQuestions:  \n1.) Who got murdered?  \n2.) Who was the murderer?  \n3.) Who escaped and in what room?  \n4.) Given the circumstances, who will be killed in the 4th hour?  \n5.) Given 1 more hour, who is most likely to escape next?  \n  \n[Here is a coloured text version for readability (updated from feedback)](http://imgur.com/FCXMGq9)\n\nHope you guys enjoy this as much I did creating it! Any feedback are welcome!",
        "created_utc": 1501803029,
        "upvote_ratio": ""
    },
    {
        "title": "Help with riddle!",
        "author": "Catm4n",
        "url": "https://www.reddit.com/r/riddles/comments/6rel5w/help_with_riddle/",
        "text": "Edible godly appendage.\n\nIt is something that is real, that's all I got",
        "created_utc": 1501786883,
        "upvote_ratio": ""
    },
    {
        "title": "The Murder of u/Spez",
        "author": "itsmiir",
        "url": "https://www.reddit.com/r/riddles/comments/6rduzs/the_murder_of_uspez/",
        "text": "While on a visit to the illustrious Sample family, u/spez was mysteriously murdered. The admins have hired you to solve the case. You gather the entire Sample family together for questioning. \nMr. Sample claims to have been out in the garden pulling up roots. \nBrad Sample figures he was at lunch with his brother. \nThe gardener says he was playing Candy Crush in the mudroom. \nMrs. Sample says she was knitting in the drawing room. \nJohnny Sample claims to have been at lunch with his brother. \nThe butler recalls being out picking up Mrs. Sample's watch from the jeweler. \nMargaret Sample says she was eating lunch with her brother. \nThe chef remembers being in the kitchen cooking dinner. \nThe dog Sporky gives you a shrewd look and says nothing. \nWho committed the murder?\n",
        "created_utc": 1501780923,
        "upvote_ratio": ""
    },
    {
        "title": "Star Wars Riddle",
        "author": "TreasureQuest",
        "url": "https://www.reddit.com/r/riddles/comments/6rdk4h/star_wars_riddle/",
        "text": "========\nThere's a bicentenarian guy,\nWith an unmistakable cry.\n\nHe's dressed in his birthday suit.\nHe's tech savvy and hirsute.\n\nGraciously the medal is missed,\nBut Dejarik makes him pissed.\n\nNot so solo through space he sails.\nFrom what planet does he hail?\n========\n\nThis should be a pretty easy one for you guys. We are doing a Treasure Quest that is Star Wars themed. $5 to join, $250 to the winner. Figured you guys would like this.\nhttps://treasurequest.marrott.net/quests/q0004/",
        "created_utc": 1501778495,
        "upvote_ratio": ""
    },
    {
        "title": "what am i?",
        "author": "PuddleDeeper",
        "url": "https://www.reddit.com/r/riddles/comments/6rbhid/what_am_i/",
        "text": "I've feared the known unknown,\n\nKnowing I don't.\n\nI've founded myself on no foundation,\n\nCertainly uncertain.\n\nI've fought the path of least resistance,\n\nDead to life.",
        "created_utc": 1501757558,
        "upvote_ratio": ""
    },
    {
        "title": "Matching gloves.. anyone?",
        "author": "niionsports",
        "url": "https://www.reddit.com/r/riddles/comments/6rb6zy/matching_gloves_anyone/",
        "text": "There are 40 gloves in a drawer: 10 pair of white gloves, 5 pairs of black gloves, 3 pairs of brown, and 2 pairs of gray. You select the gloves in the dark and can check them only after a selection has been made. What is the smallest number of gloves you need to select to guarantee at least one matching pair?\n",
        "created_utc": 1501753046,
        "upvote_ratio": ""
    },
    {
        "title": "Matching gloves.. anyone?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6rb6sl/matching_gloves_anyone/",
        "text": "[deleted]",
        "created_utc": 1501752951,
        "upvote_ratio": ""
    },
    {
        "title": "Solve this riddle!",
        "author": "GegeV2",
        "url": "https://www.reddit.com/r/riddles/comments/6r9fjb/solve_this_riddle/",
        "text": "I may not be popular in Port Niranda and usually I'm an on road kind of guy but when I'm engineered just right, you'll find me high and dry.\n\nContext: Port Niranda is a fictional place of a popular late 90s-2001 Australian TV show \"Round the Twist\".",
        "created_utc": 1501728431,
        "upvote_ratio": ""
    },
    {
        "title": "10 Brainy IQ And Riddles",
        "author": "hitenjain",
        "url": "https://www.reddit.com/r/riddles/comments/6r7qvy/10_brainy_iq_and_riddles/",
        "text": "[removed]",
        "created_utc": 1501711623,
        "upvote_ratio": ""
    },
    {
        "title": "https://youtu.be/nxvzNk6296o",
        "author": "hitenjain",
        "url": "https://www.reddit.com/r/riddles/comments/6r7o36/httpsyoutubenxvznk6296o/",
        "text": "[removed]",
        "created_utc": 1501710888,
        "upvote_ratio": ""
    },
    {
        "title": "Help solving this riddle?!",
        "author": "hopeelizabethhh",
        "url": "https://www.reddit.com/r/riddles/comments/6r75hs/help_solving_this_riddle/",
        "text": "My mum's boyfriend likes to leave me and my SO riddles to solve. Usually we do well but we're super stuck on this one;\n\n\"Feeling down because the record is playing past your bedtime.\"",
        "created_utc": 1501706331,
        "upvote_ratio": ""
    },
    {
        "title": "There are are three things wrong wrong with this sentence. Can you find them?",
        "author": "meyerfood",
        "url": "https://www.reddit.com/r/riddles/comments/6r6lvz/there_are_are_three_things_wrong_wrong_with_this/",
        "text": "",
        "created_utc": 1501701724,
        "upvote_ratio": ""
    },
    {
        "title": "How many pages?",
        "author": "Basicallysteve",
        "url": "https://www.reddit.com/r/riddles/comments/6r6lmh/how_many_pages/",
        "text": "On the first day, James read 20% of a book. On the *second* day, he read *another* 66 pages and discovered that he had read _80% of the unread_ pages. What is the total number pages of the book?",
        "created_utc": 1501701654,
        "upvote_ratio": ""
    },
    {
        "title": "This one might be to hard. Kryptic number riddle.",
        "author": "EugeniusZauberfloete",
        "url": "https://www.reddit.com/r/riddles/comments/6r5zym/this_one_might_be_to_hard_kryptic_number_riddle/",
        "text": "[removed]",
        "created_utc": 1501696648,
        "upvote_ratio": ""
    },
    {
        "title": "I need Help Solving this Puzzle/Riddle",
        "author": "DrHertFIgger",
        "url": "https://www.reddit.com/r/riddles/comments/6r4fvu/i_need_help_solving_this_puzzleriddle/",
        "text": "\"As High As you can :D\"\n\n\nAny idea or clue?",
        "created_utc": 1501683268,
        "upvote_ratio": ""
    },
    {
        "title": "Gesture Without Motion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6r2p9b/gesture_without_motion/",
        "text": "[deleted]",
        "created_utc": 1501660572,
        "upvote_ratio": ""
    },
    {
        "title": "Another I just came up with, may be too easy, I don't know. Enjoy!",
        "author": "prince_harming",
        "url": "https://www.reddit.com/r/riddles/comments/6r2ik8/another_i_just_came_up_with_may_be_too_easy_i/",
        "text": "My branches bear a canopy, shielding your eyes from harm.\n\nMy root draws life to suit my needs and saves me from the storms.\n\nMy sun is perched above my trunk, prepared to shed its light.\n\nMy twig you snap, if e'er you need to turn to day the night.\n",
        "created_utc": 1501657532,
        "upvote_ratio": ""
    },
    {
        "title": "An easy one",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6r2fwl/an_easy_one/",
        "text": "[deleted]",
        "created_utc": 1501656427,
        "upvote_ratio": ""
    },
    {
        "title": "An easy one.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6r2efx/an_easy_one/",
        "text": "[deleted]",
        "created_utc": 1501655800,
        "upvote_ratio": ""
    },
    {
        "title": "Impervious to swords until they take me.",
        "author": "MrNaugs",
        "url": "https://www.reddit.com/r/riddles/comments/6r1vsw/impervious_to_swords_until_they_take_me/",
        "text": "I see when I am full, but am blind when empty. \n\nI stand tall by day, but glow by night. \n\nI am impervious to swords until they take me. \n\n\n\nWhat am I?",
        "created_utc": 1501648818,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the one place everyone goes but no one shares",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6r1pqc/where_is_the_one_place_everyone_goes_but_no_one/",
        "text": "[deleted]",
        "created_utc": 1501646765,
        "upvote_ratio": ""
    },
    {
        "title": "A man with two faces...",
        "author": "Hair_cut2017",
        "url": "https://www.reddit.com/r/riddles/comments/6r1pl7/a_man_with_two_faces/",
        "text": "A man with two faces might hide me\n\nI come with a pair but no more\n\nPrecious the metal inside me\n\nMore precious: the promise I'm for",
        "created_utc": 1501646721,
        "upvote_ratio": ""
    },
    {
        "title": "An easier one, I think",
        "author": "prince_harming",
        "url": "https://www.reddit.com/r/riddles/comments/6r1pbe/an_easier_one_i_think/",
        "text": "I'm painted with a lustre\n\nthat most folk find fascinating.\n\nMore precious than my mother,\n\nthough, deep down, quite irritating.",
        "created_utc": 1501646636,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with this riddle; it's always there, but you can't see it, it's rare, but you can't catch it, we use gold to make it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qz937/i_need_help_with_this_riddle_its_always_there_but/",
        "text": "[deleted]",
        "created_utc": 1501621256,
        "upvote_ratio": ""
    },
    {
        "title": "These riddles make his mind go CRAZY!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qxrlq/these_riddles_make_his_mind_go_crazy/",
        "text": "[removed]",
        "created_utc": 1501608297,
        "upvote_ratio": ""
    },
    {
        "title": "The lightbulb riddle.",
        "author": "Cock_Vomit",
        "url": "https://www.reddit.com/r/riddles/comments/6qtbds/the_lightbulb_riddle/",
        "text": "There is a room with 3 light bulbs inside. Outside of the room there are 3 light switches. You cannot see inside the room. You can play with the switches all you want, but you only get to enter the room once, and must be able to tell which lightbulb corresponds to which light switch. How can you narrow this down without a doubt?",
        "created_utc": 1501554316,
        "upvote_ratio": ""
    },
    {
        "title": "What word looks the same upside down and backwards?",
        "author": "twicedouble",
        "url": "https://www.reddit.com/r/riddles/comments/6qrl3m/what_word_looks_the_same_upside_down_and_backwards/",
        "text": "\"I\" is not the answer I'm looking for. There is one other word. \n\nEDIT: This riddle was a bust. I didn't think about this one too hard. \n\nIf you still want to guess, I'm looking for a word that looks the same upside down and backwards that is NOT a palindrome. My fault for not including that in the riddle. ",
        "created_utc": 1501536408,
        "upvote_ratio": ""
    },
    {
        "title": "The Case of Joseph Howard: Case File 02",
        "author": "Spriiiiing",
        "url": "https://www.reddit.com/r/riddles/comments/6qp2rh/the_case_of_joseph_howard_case_file_02/",
        "text": "An interview with Eliza Howard.\n\nInterviewer: How long have you been married to Joseph?\n\nEliza: 10 years, and a happy marriage it's been too.\n\nI: When was the last time you had contact with Joseph?\n\nE: The 27th. He was working a late night, and called me to let me know that he'd pick something up on the way home. Thought he sounded...strange.\n\nI: Strange?\n\nE: Yeah. It's hard to describe, but it sounded like he was...preoccupied with something. Like he was already busy when he called. \n\nI: Did he enjoy his job? Was he well liked?\n\nE: Yeah, he loved his job. Got him free seats to plays whenever he was off work. There was this one guy, Kane. He was always at odds with Joe, but I never thought something might happen. \n\nI: What is Kane's full name?\n\nE: I think it's...Kane Powers. Dunno his last name. But he was always a creepy looking guy. Had a scar on his left hand, like it had been shot. And it never healed.\n\nI: What do you mean?\n\nE: It never healed. Joe always told me that it always looked like the wound was made less than a week ago. It's odd, ain't it?\n\nI: (after a pause) Yes. Odd. What was Joseph like at home?\n\nE: Oh, he was a sweet guy. Always thinking about me. Though he'd get into these blue periods sometimes...never was quite the same after that accident in '09.\n\nI: The accident in '09? What was that? (Eliza looked visibly nervous.)\n\nE: Well...in any case, he was always a little depressed after that. He had some anti-depression medications. Duloxetine, I think. \n\nI: And how long ago was this?\n\nE: A year ago. He just got prescribed for a greater dose two weeks ago.\n\nI: One last question. Has Joseph ever been known to have suicidal tendencies?\n\nE: What?!\n\nI: We can't rule out any possibilities.\n\nE: No, of course he didn't!\n\nI: (after shuffling papers) Thank you for your time, Mrs. Howard. We'll do everything we can to find your husband.\n",
        "created_utc": 1501514355,
        "upvote_ratio": ""
    },
    {
        "title": "The Case of Joseph Howard: Case File 01",
        "author": "Spriiiiing",
        "url": "https://www.reddit.com/r/riddles/comments/6qp0af/the_case_of_joseph_howard_case_file_01/",
        "text": "Name: Joseph Miles Howard\nHeight: 5'9\nWeight: 186 pounds\nAge: 32\nEye Color: Brown\nHair Color (at time of disappearance): Light Brown\nOccupation: Theater Attendant, worked weekdays 12-8 and weekends 4-10. Had worked until 12 on day of disappearance.\nMedical records have noted that Howard has been suffering from depression and mild migraines. \nNotable Details: Married to Eliza Howard, 10 years.",
        "created_utc": 1501513722,
        "upvote_ratio": ""
    },
    {
        "title": "A tiny bit of me can drive the Tiger through the grass, yet I and all my kin can't separate the Wolf and Lass.",
        "author": "prince_harming",
        "url": "https://www.reddit.com/r/riddles/comments/6qmdqm/a_tiny_bit_of_me_can_drive_the_tiger_through_the/",
        "text": "Here's a better formatted and capitalized version, perhaps it'll make things clearer:\n\nA tiny bit of me can drive the Tiger through the grass,\n\nyet I and all my kin can't separate the wolf and lass.\n\n[Hint #1](#s \"Why is 'Tiger' capitalized?\")\n\n[Hint #2](#s \"Who are the wolf and the lass? What first comes to mind? Where would you see them?\")\n\nEdit: If anyone has suggestions for how this one could be improved, I'm open to them. I get the feeling that some of the words, especially the \"can't *separate* the wolf and lass\" part, perhaps weren't the best-chosen.",
        "created_utc": 1501478365,
        "upvote_ratio": ""
    },
    {
        "title": "One of my favorite riddles: Truth Town",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qm6r9/one_of_my_favorite_riddles_truth_town/",
        "text": "[deleted]",
        "created_utc": 1501475634,
        "upvote_ratio": ""
    },
    {
        "title": "The elevator mystery",
        "author": "slytherinwarlock",
        "url": "https://www.reddit.com/r/riddles/comments/6qkrpe/the_elevator_mystery/",
        "text": "A man lives on the top floor of a 10 story building. On sunny days he uses the elevator half way up and takes the stairs the rest of the way up. On rainy days he takes the elevator all the way up to his apartment.\nWhy does he do this?\n\nA note: I translated this riddle from Portuguese so I hope I'm not reposting it.",
        "created_utc": 1501458118,
        "upvote_ratio": ""
    },
    {
        "title": "Guess the movie name from the images",
        "author": "burundijones",
        "url": "https://www.reddit.com/r/riddles/comments/6qkpxv/guess_the_movie_name_from_the_images/",
        "text": "[removed]",
        "created_utc": 1501457521,
        "upvote_ratio": ""
    },
    {
        "title": "NPR Sunday Puzzle: There is a city somewhere in the United States with a population of about 24,000 people.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qkdf1/npr_sunday_puzzle_there_is_a_city_somewhere_in/",
        "text": "[deleted]",
        "created_utc": 1501453698,
        "upvote_ratio": ""
    },
    {
        "title": "Just another escape room riddle.",
        "author": "twicedouble",
        "url": "https://www.reddit.com/r/riddles/comments/6qjbuf/just_another_escape_room_riddle/",
        "text": "Imagine you're in a box with airtight metal walls, a floor, and a ceiling built to your exact size. There are no doors (let's say the box was built around you) or windows. There is no light or any other way to see anything in the room. You can feel around the box but all sides are perfectly smooth. You yell and scream but nobody responds. You're able to calculate (somehow) how much air you have left and discover that you will be dead in an hour if you don't do something.\n\n**What can you do to ensure your survival before the hour is up?**\n\nI will answer any yes or no questions you have.",
        "created_utc": 1501443117,
        "upvote_ratio": ""
    },
    {
        "title": "A man with one eye looked up to the sky and saw a tree with apples. He took no apples off but left no apples on. How did he do it?",
        "author": "pazatek",
        "url": "https://www.reddit.com/r/riddles/comments/6qj26z/a_man_with_one_eye_looked_up_to_the_sky_and_saw_a/",
        "text": "I'm trying to figure out this riddle. Anyone wanna help?",
        "created_utc": 1501440368,
        "upvote_ratio": ""
    },
    {
        "title": "Here's a 'What Am I?' question for you.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qi616/heres_a_what_am_i_question_for_you/",
        "text": "[deleted]",
        "created_utc": 1501431120,
        "upvote_ratio": ""
    },
    {
        "title": "Riddle [My phone pass] (easy)",
        "author": "tobortidder",
        "url": "https://www.reddit.com/r/riddles/comments/6qgolq/riddle_my_phone_pass_easy/",
        "text": "My phone password is the product of two prime numbers (X,Y), where X is a single-digit number and the first digit of Y is X.\n\nAlso the two last digits of Y are equal.\n\nLet ABCD be the digits of my password.\n\nThen      X * A = D \nAnd        C - X = B \n\nWhat is my phone's password? ",
        "created_utc": 1501409928,
        "upvote_ratio": ""
    },
    {
        "title": "In a one story house, everything is pink, the dog is pink, the cat is pink, the walls are pink, the TV is pink, everything is pink. What colour are the stairs?",
        "author": "FlyWereAble",
        "url": "https://www.reddit.com/r/riddles/comments/6qfycn/in_a_one_story_house_everything_is_pink_the_dog/",
        "text": "",
        "created_utc": 1501395544,
        "upvote_ratio": ""
    },
    {
        "title": "A dirty riddle.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/riddles/comments/6qft1s/a_dirty_riddle/",
        "text": "[deleted]",
        "created_utc": 1501393155,
        "upvote_ratio": ""
    },
    {
        "title": "My wings give me flight",
        "author": "Hair_cut2017",
        "url": "https://www.reddit.com/r/riddles/comments/6qfovr/my_wings_give_me_flight/",
        "text": "Original riddle\n\nMy wings give me flight\nI'm a mythical matter\nYou won't find me at night\nBut you might see my PATER\n\nif you spend time with me\nI might make you rich\nBut more likely than not\nI'll just make you sick\n\nSeven others are larger\nI'm as dizzy as can be\nI was the fate of the MESSENGER\nThe true messenger is me",
        "created_utc": 1501391358,
        "upvote_ratio": ""
    },
    {
        "title": "A woman was in her hotel room when suddenly there's a knock on the door.",
        "author": "twicedouble",
        "url": "https://www.reddit.com/r/riddles/comments/6qfmtr/a_woman_was_in_her_hotel_room_when_suddenly/",
        "text": "She opened the door to see a man whom she had never seen before. He said, \"I'm sorry, I have made a mistake, I thought this was my room.\" He then went down the corridor and in the elevator. The woman went back into her room and phoned security. \n\n**Why was the woman so suspicious?**",
        "created_utc": 1501390532,
        "upvote_ratio": ""
    },
    {
        "title": "Decode the ciphers.",
        "author": "QuantumOfSilence",
        "url": "https://www.reddit.com/r/riddles/comments/6qf0hf/decode_the_ciphers/",
        "text": "evol cotsrecg narcts one crewc\n\n9685 669 8437 85 37 2637 6364\n33222 311 22 3232 4 1 2143 133\n\nZ ufoo xlnnrgnvmg'h dszg R'n ollprmt uli\n\n25-15-21 23-15-21-12-4-14 20 7-5-20 20-8-9-19 6-18-15-13 1-14-25 15-20-8-5-18 7-21-25\n\nL mxvw zdqw wr whoo brx krz L'p ihholqj, jrwwd pdnh brx xqghuvwdqg\n\n-. . ...- . .-. / --. --- -. -. .- / --. .. ...- . / -.-- --- ..- / ..- .--. --..-- / -. . ...- . .-. / --. --- -. -. .- / .-.. . - / -.-- --- ..- / -.. --- .-- -.\n\n01001110 01100101 01110110 01100101 01110010 00100000 01100111 01101111 01101110 01101110 01100001 00100000 01110010 01110101 01101110 00100000 01100001 01110010 01101111 01110101 01101110 01100100 00100000 01100001 01101110 01100100 00100000 01100100 01100101 01110011 01100101 01110010 01110100 00100000 01111001 01101111 01110101\n\nGood luck.",
        "created_utc": 1501381137,
        "upvote_ratio": ""
    },
    {
        "title": "[GAME OF THRONES SPOILER] it's not a big one and it won't mess up the show for you but here it is...",
        "author": "Augusto95",
        "url": "https://www.reddit.com/r/riddles/comments/6qelqv/game_of_thrones_spoiler_its_not_a_big_one_and_it/",
        "text": "“In a room sit three great men, a king, a priest, and a rich man with his gold. Between them stands a sellsword, a little man of common birth and no great mind. Each of the great ones bids him slay the other two. ‘Do it,’ says the king, ‘for I am your lawful ruler.’ ‘Do it,’ says the priest, ‘for I command you in the names of the gods.’ ‘Do it,’ says the rich man, ‘and all this gold shall be yours.’ So tell me – who lives and who dies?”",
        "created_utc": 1501375841,
        "upvote_ratio": ""
    },
    {
        "title": "The Case of Joseph Howard: The Assignment",
        "author": "Spriiiiing",
        "url": "https://www.reddit.com/r/riddles/comments/6qejhd/the_case_of_joseph_howard_the_assignment/",
        "text": "Welcome to the great game, Reddit.\nI am assigning you a task. You are to take the role of a detective solving a case.\n\nJoseph Howard was a 24 year old man working as an attendant in the Athenaeum Theatre in Chicago. The last known contact with him was his wife, who had called him after an event gone long. He has been missing since Thursday, July 27.\n\nYour job will be to figure out what happened to Joseph Howard, and how to retrieve him. Files, if requested and available, will be provided. Other evidence will also be made known to you if it turns up.\n\nRedditors, you're working a case of a man gone missing. There's no telling how much time you have or if anyone else will go missing. Time is of the essence. Good luck.",
        "created_utc": 1501375093,
        "upvote_ratio": ""
    },
    {
        "title": "A riddle I made up",
        "author": "annonymice",
        "url": "https://www.reddit.com/r/riddles/comments/6qeeoo/a_riddle_i_made_up/",
        "text": "(i made a short poem for my teacher and got full marks lol)\n\nThere is a witch \nthat has a high pitch.\nShe steals my family's gold\n\n\nand she looks very old.\nHer children are the reason for my headache\nMAKE THEM QUIET FOR GOODNESS SAKE!\n\nWho is the witch?\n\n[spoiler](#s \"Step-mother\")",
        "created_utc": 1501373516,
        "upvote_ratio": ""
    },
    {
        "title": "Riddle Competition For Money",
        "author": "TreasureQuest",
        "url": "https://www.reddit.com/r/riddles/comments/6qdtq2/riddle_competition_for_money/",
        "text": "[removed]",
        "created_utc": 1501366646,
        "upvote_ratio": ""
    },
    {
        "title": "A woman is walking along a path in a forest when she comes to a bridge that crosses a small river.",
        "author": "twicedouble",
        "url": "https://www.reddit.com/r/riddles/comments/6q9ibo/a_woman_is_walking_along_a_path_in_a_forest_when/",
        "text": "During her approach she sees a man with a menacing sword in one hand and a pistol in the other. It looked weird. \n\nShe walked up to him and ask if she can pass. \n\nHe says, \"No. You cannot pass but I'll let you choose the way you die, gunshot to the head with my pistol or decapitation by my sword.\"\n\n\"Say anything you want. If I believe it's true, I will shoot you in the head. If what you say is false, I will cut your head off. Think carefully.\"\n\nThe woman thought for a few minutes and then spoke a single sentence to the man. He looked at her, slumped his shoulders and let her pass. \n\n**What did she say?**\n\n",
        "created_utc": 1501309552,
        "upvote_ratio": ""
    },
    {
        "title": "Would help me solve this riddle",
        "author": "Rey117",
        "url": "https://www.reddit.com/r/riddles/comments/6q97by/would_help_me_solve_this_riddle/",
        "text": "[removed]",
        "created_utc": 1501305003,
        "upvote_ratio": ""
    },
    {
        "title": "An \"outside of the box\" number riddle.",
        "author": "twicedouble",
        "url": "https://www.reddit.com/r/riddles/comments/6q7goh/an_outside_of_the_box_number_riddle/",
        "text": "Starting with any number at all, I can always reduce it to 4 by applying a consistent rule. 4 is the magic number.\n\nExample: 100. 100 is 10, 10 is 3, 3 is 5, 5 is 4, and 4 is the magic number. \n\nAnother example: 52. 52 is 8, 8 is 5, 5 is 4, 4 is the magic number. \n\nYou're job is to find out what the rule is. If you can't figure it out give me another number and I'll do it a progression for it. \n\nEDIT: Fixed a mistake.",
        "created_utc": 1501283124,
        "upvote_ratio": ""
    },
    {
        "title": "Help me solve this company Riddle",
        "author": "ToonVA",
        "url": "https://www.reddit.com/r/riddles/comments/6q4axh/help_me_solve_this_company_riddle/",
        "text": "[removed]",
        "created_utc": 1501253745,
        "upvote_ratio": ""
    }
]