[
    {
        "title": "Tencent’s Three-body Problem adaptation - thoughts?",
        "author": "Marduk112",
        "url": "https://www.reddit.com/r/scifi/comments/10j3qac/tencents_threebody_problem_adaptation_thoughts/",
        "text": "It’s growing on me.  I think it’ll be better than Netflix’s adaptation because, while slow to develop, it is thorough, cleaves to the source material, and has been a fun ride after the first few episodes.",
        "created_utc": 1674448035,
        "upvote_ratio": 1.0
    },
    {
        "title": "TANK (Industrial alternative psychedelic electro grunge proto punk noise trap doomsday prophecy dictated by 6th dimensional dmt entity in a forbidden language everybody secretly understands, if they say they don’t they are lying if you think you can’t you aren’t listening)",
        "author": "Sonofslang",
        "url": "https://open.spotify.com/track/1L921UIR0a4Uqy1jrKTq8M?si=JnYwxSySQbiODu4kci4pwA",
        "text": "",
        "created_utc": 1674445703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to remember a colony ship novel",
        "author": "letsgodofunstuff",
        "url": "https://www.reddit.com/r/scifi/comments/10j2qpw/trying_to_remember_a_colony_ship_novel/",
        "text": "I'm trying to remember a novel that takes place on a colony/generation ship. The plot involves a man whose wife goes missing, and he investigates her disappearance. Anyone know what this book is called?",
        "created_utc": 1674444926,
        "upvote_ratio": 1.0
    },
    {
        "title": "aplica a cualquier situacion 🙂",
        "author": "saracrancri55",
        "url": "https://i.redd.it/t9zh6jo21rda1.jpg",
        "text": "",
        "created_utc": 1674442444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else has tried getting chatgtp to emulate their favourite works?",
        "author": "itsgoingtobeebanned",
        "url": "https://i.redd.it/u97ymbb8uqda1.png",
        "text": "",
        "created_utc": 1674440147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exosuit OC design",
        "author": "virtuink",
        "url": "https://i.redd.it/3swslxiynqda1.jpg",
        "text": "",
        "created_utc": 1674438109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traveling to another system.",
        "author": "Hi_IM-NOT_HERE-",
        "url": "https://i.redd.it/7jq9ueeilqda1.png",
        "text": "",
        "created_utc": 1674437216,
        "upvote_ratio": 1.0
    },
    {
        "title": "art by Italian artist Emanuele Taglietti",
        "author": "blcknoir",
        "url": "https://i.redd.it/4rnt41nu0qda1.jpg",
        "text": "",
        "created_utc": 1674430262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best alien psychology/society description in sci-fi",
        "author": "RShArren",
        "url": "https://www.reddit.com/r/scifi/comments/10iwh7c/best_alien_psychologysociety_description_in_scifi/",
        "text": "Not many books describe alien psychology and society well. Most commonly, differences from humans are effectively limited to different appearances, architecture, and technology (this is true for almost every space opera setting). In other cases, authors portray aliens as intrinsically incomprehensible (hello, Lem, Vinge, and others). They mostly rely on the scarceness of information about these alien species and use convoluted language to give a sense of their otherness. But when I think about detailed descriptions of alien civilizations that wouldn't be agnostic, so to say, and wouldn't be a poor copy of a description of some Asian or Indian culture, very few books come to mind. It's even harder if one wants to find a book where everything would finish not with mutual annihilation, but with something resembling an optimistic ending. \n\n\"The Gods Themselves\" by Asimov is pretty brilliant and comes to mind first. Tchaikovsky's \"Children of Time\" is great too. Peter Watts' \"Blindsight\" is cool in terms of portraying alien minds, but he's the biggest pessimist of all. Yudkowsky's \"Three Worlds Collide\" is in many ways the most insightful, concentrated on different possible ethical systems, but also pretty pessimistic. What else can you remember?",
        "created_utc": 1674427109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Although probably more political intrigue, I'm rewatching the original Mission Impossible series for the first time since I was a teen. One episode from the first season stood out as a sci fi concept or thriller. **SPOILERS** ahead",
        "author": "tplgigo",
        "url": "https://www.reddit.com/r/scifi/comments/10ivuhi/although_probably_more_political_intrigue_im/",
        "text": "As I was more a casual viewer of the show only because my parents were more into that stuff, I remember a lot of earlier episodes more than the later ones ironically the ones with Leonard Nimoy.\n\nThe episode I refer to is the 10th one of the first season called \"The Carriers\". It's a ripped from the headlines kind of thing that I do remember reading about where the USSR (fictional in the show) had set up a few Eastern European camps and built fake American towns and cities to train agents how to infiltrate the US and gather real time intel from every facet of American life. Although I never watched it, I believe the more current show, \"The Americans\" focused partly on this concept post camp-training.\n\nWhat I consider where it \"leaks\" (a pun ) into scifi is that without the trainee's knowledge, they are  infected with a deadly embryonic pathogen/plague put in drinking water which spreads on physical contact. The theory is that once the trainees are sent to the US and the last trainee finally dies along with millions of Americans, so goes all evidence of the source, plan and evidence of the plague.\n\nI found the combination of the 2 tropes fascinating. I also have to say, that Barbara Bain is quite the multi faceted actress.\n\n\"Your mission, should you decide to accept it, is to destroy this plague and expose the \"villages\" for what they are. This message will self destruct in 5 seconds\"",
        "created_utc": 1674425517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy Sunday, everyone! Here are 4 more cropped photos from a fan favorite! Can you guess the movie?",
        "author": "Shoddy_Orchid3022",
        "url": "https://www.reddit.com/gallery/10iuo9z",
        "text": "",
        "created_utc": 1674422627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for the name and author of this old SF book",
        "author": "Leadster77",
        "url": "https://www.reddit.com/r/scifi/comments/10ithha/looking_for_the_name_and_author_of_this_old_sf/",
        "text": "Hey all,  \n\n\nit's driving me crazy, hopefully one of you can help me. I read a book 30 years ago, I thought by Roger Zelazny, but apparantly not. The plot goes as follows:  \n\n\nIt's about a group of young persons, that try to make sense of life. They pay in stores with their emotions, crying thank you at the register. When they die, they stay in limbo for a while and can choose whichever body they want afterwards.  \n\n\nThey are so bored with life, that they crash themselves so they can choose a new body. Sometimes as an golden angel, or a big blue blob with a lot of eyes.  \n\n\nThe protagonist starts female, but chooses the body of a sad male poet a few times. He/she goes off to the desert in the end, to live by himself. His friend, that chooses the weirdest, non human bodies usually, only does it to gain attention to his inner self, who loves the protagonist and wants to be seen as a personality, rather than an attractive body.  \n\n\nDoes this ring any bells with you guys? I hope you can help me!",
        "created_utc": 1674419706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on ‘TRON ARES’ is in the works at Disney with Jared Leto set to star",
        "author": "NotMeAgain999",
        "url": "https://i.redd.it/o55lraqos2da1.jpg",
        "text": "",
        "created_utc": 1674417284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci Fi Themes",
        "author": "Rare-Act-4362",
        "url": "https://www.reddit.com/r/scifi/comments/10is7h3/sci_fi_themes/",
        "text": "I recently listened to Galaxy Quest theme and to the Orville theme and both are very similar but I do not know how similar muscially speaking is one the \"faster\" version what differentiates the two ..etc.",
        "created_utc": 1674416540,
        "upvote_ratio": 1.0
    },
    {
        "title": "The villian Admiral Jean-Luc Picard should be facing in season 3 of Star Trek: Picard",
        "author": "zwtor",
        "url": "https://redshirtsalwaysdie.com/2023/01/21/the-villian-admiral-jean-luc-picard-should-be-facing-in-season-3-of-star-trek-picard/?a_aid=46089",
        "text": "",
        "created_utc": 1674415322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debate-what is the scariest movie of all time",
        "author": "Itch2009",
        "url": "https://www.reddit.com/r/scifi/comments/10iri62/debatewhat_is_the_scariest_movie_of_all_time/",
        "text": "[removed]",
        "created_utc": 1674414767,
        "upvote_ratio": 1.0
    },
    {
        "title": "NoLiesOnlyTruthBody on TikTok",
        "author": "ICrook49",
        "url": "https://www.tiktok.com/t/ZTRpg2dmj/",
        "text": "",
        "created_utc": 1674414450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best paying site. use this referral link https://everve.net/ref/1158391/",
        "author": "Chigozieo",
        "url": "https://i.redd.it/71c2vqvuooda1.png",
        "text": "",
        "created_utc": 1674414132,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Judgement Day &amp; Chill”, 2055",
        "author": "CiderHouseRulez",
        "url": "https://i.redd.it/f44mdismkoda1.jpg",
        "text": "",
        "created_utc": 1674412700,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Schwarzschild defence. A short story.",
        "author": "Hawkshaw7",
        "url": "https://www.nature.com/articles/d41586-022-04550-2",
        "text": "",
        "created_utc": 1674411610,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite ancient alien movie?",
        "author": "timetoscience",
        "url": "https://www.reddit.com/r/scifi/comments/10iq8ap/what_is_your_favorite_ancient_alien_movie/",
        "text": "I love all things aliens or an advanced civilization influencing ancient humans. My favorite is Stargate, and I'd love to hear what everyone else enjoys in this sub-genre!",
        "created_utc": 1674411605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dune but it's filmed in Mexico",
        "author": "Miller_Wilson",
        "url": "https://www.youtube.com/watch?v=mrMGIUh98hc",
        "text": "",
        "created_utc": 1674410364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yoda Awards 2023(Action/Adventure/Sci-fi/Fantasy)",
        "author": "strikerwars",
        "url": "https://www.reddit.com/r/scifi/comments/10ippno/yoda_awards_2023actionadventurescififantasy/",
        "text": " [https://yodaawards.blogspot.com/](https://yodaawards.blogspot.com/)\n\nAwards the best Action/Adventure/Sci-fi/Fantasy films of each year.\n\nMovies with more nominations:\n\nEverything Everywhere All at Once:16 and won 8\n\nThe Batman:15 and won 3\n\nAvatar the way of water: 12 and won 3\n\nTop Gun Maverick:12 and won 1\n\nRRR:6 and won 1\n\nBlack Panther:4 and won 0\n\nAfter Yang:4 and won 0\n\nTop Gun Maverick winns in the Poll for 37,3% and 2nd place Everything Everywhere All at Once with 31,6%",
        "created_utc": 1674410346,
        "upvote_ratio": 1.0
    },
    {
        "title": "My perfect home (Midjourney AI)",
        "author": "TalkaboutJoudy",
        "url": "https://i.redd.it/5tvdwabyomda1.png",
        "text": "",
        "created_utc": 1674407972,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your first science fiction book?",
        "author": "Royal_Acanthisitta51",
        "url": "https://www.reddit.com/r/scifi/comments/10iorki/what_was_your_first_science_fiction_book/",
        "text": "I’ve seen a couple posts of new reader’s bookshelves and it got me thinking back to the first Sci-fi book I read. It was called Stranger From the Depths and was a book I chose from a reading program in fourth grade. What was your first Sci-fi book?",
        "created_utc": 1674407945,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you think of this movie? Do you think it has a message for humanity? Or is it just another sci-fi movie? 🤔",
        "author": "Miasweet19",
        "url": "https://i.redd.it/g6hp3aj2mnda1.jpg",
        "text": "",
        "created_utc": 1674401078,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I agree with you that there is a natural aristocracy among men. The grounds of this are virtue and talents…\" Thomas Jefferson to John Adams, 28 Oct. 1813",
        "author": "Seth_Tauris",
        "url": "https://i.redd.it/8qi6ge4y0mda1.jpg",
        "text": "",
        "created_utc": 1674399879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 1- The Letter of a Time-Traveller",
        "author": "Debateaboutfiction",
        "url": "https://www.reddit.com/r/scifi/comments/10il9iy/day_1_the_letter_of_a_timetraveller/",
        "text": "[removed]",
        "created_utc": 1674398826,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think we should do a poll to determine the sub's top 100 sci fi books of all time",
        "author": "carcaju99",
        "url": "https://www.reddit.com/r/scifi/comments/10ikmyq/i_think_we_should_do_a_poll_to_determine_the_subs/",
        "text": "Don't know how it would work, but it would be a lot of fun and a great way to give everyone a good list to chose what to read next.\n\nLet me know if it has already been done, tried to found any previous post about so",
        "created_utc": 1674397015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think we shlod do a poll to determine the sub's top 100 sci fi books of all time",
        "author": "carcaju99",
        "url": "https://www.reddit.com/r/scifi/comments/10ikmd2/i_think_we_shlod_do_a_poll_to_determine_the_subs/",
        "text": "Don't know how it would work, but it would be a lot of fun and a great way to give everyone a good list to chose what to read next.\n\nLet me know if it has already been done, tried to found any previous post about something like this and didn't find anything",
        "created_utc": 1674396965,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Jason Voorhees TV Series Crystal Lake will have the Scream Creator &amp; Star from Friday the 13th Movies!",
        "author": "NiitoIsHere",
        "url": "https://www.leaksbydaylight.com/crystal-lake-scream-news-more/",
        "text": "",
        "created_utc": 1674396090,
        "upvote_ratio": 1.0
    },
    {
        "title": "A sleazy antique book dealer gets rescued by a supernatural ally in, The Ninth Gate (1999).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/ywnhhhxazmda1",
        "text": "",
        "created_utc": 1674393508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Swiss army knife for tech",
        "author": "MaddieCulp",
        "url": "https://v.redd.it/ze6huhst9lda1",
        "text": "",
        "created_utc": 1674390771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarded as the master of the body horror genre, I think the fly(1986) is David Cronenberg finest work.",
        "author": "UncleKano91",
        "url": "https://i.redd.it/3j4oz6dyjmda1.gif",
        "text": "",
        "created_utc": 1674388259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Miniature INSANELY AWESOME ELECTRIC UNICYCLE!",
        "author": "flaxradium",
        "url": "https://youtu.be/4P-XxbTi8uI",
        "text": "",
        "created_utc": 1674381087,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Man Was Bound In Adamantium Chains Because Of His Power To Rule The...",
        "author": "Exam-Designer",
        "url": "https://youtube.com/watch?v=2MJXjKaStWU&amp;feature=share",
        "text": "",
        "created_utc": 1674373418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Voltaic Vigilance (original pixelart, by me)",
        "author": "Eclipse489",
        "url": "https://i.redd.it/yl17atqgpjda1.png",
        "text": "",
        "created_utc": 1674371824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pitch Black (2000)",
        "author": "empire_de109",
        "url": "https://www.reddit.com/r/scifi/comments/10ichlh/pitch_black_2000/",
        "text": "I've always really enjoyed this movie, but one thing confused me when I saw the film again today. Did Riddick kill Carolyn? I can honestly see it both ways...\n\n1) Riddick didn't kill Carolyn, and she was killed by the beast. This one I didn't really pick up on until my latest rewatch, how she gives him a slight smile as she dies, how he goes from respecting the monsters in the beginning to hating them at the end because they killed Carolyn. \n\n2) I can also see that he did kill her. I always thought he did. How she's says she wouldn't die for him, and that him going back for Imam and Jack cost her life at his hands. I always thought he killed her because of this, that there was a trade off for him going back for the others, as she says she would die for them but not him.\n\nI lean more towards he didn't kill her because it makes the redemption of Riddick more well rounded, how he said he died on the planet, meaning his old killer self. But idk how I never noticed this, I've seen the movie many times. Am I the only one who though he kills her?",
        "created_utc": 1674367022,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Locations Would You Expect To See In A Sci-Fi Setting?",
        "author": "Ahruzimel",
        "url": "https://www.reddit.com/r/scifi/comments/10ibe7c/what_locations_would_you_expect_to_see_in_a_scifi/",
        "text": "Hey folks!\n\nI'm designing a solar system for an upcoming Stars Without Number campaign, and I'm re-thinking how I want to do it. The game system has a whole section for randomly generating worlds, but it's designed for a whole sector, a region of the galaxy of something like 10-30 star systems, and I'm doing things differently, having the whole setting just be on single star system.\n\nI've still used the randomizer somewhat, but I thought I'd also turn to you all. I know there are a lot of typical places you'd expect to see in a sci-fi setting. There's the planet with a city that spans the whole world. There's the seedy fringe world with the shady cantinas. There's the resort world for the insanely wealthy. There's the cyberpunk-style world controlled by megacorporations. There's the mining world populated by disgruntled workers.\n\nThere are also locales one might expect to see, that aren't necessarily worlds. The aforementioned cantina, for instance. Or the track of the illegal, but very famous, jetbike races. Or the multiplanetary corporate headquarters. Or the system-wide famous shipyard where the best ships are built. \n\nOr whatever! What I'm looking for here is ideas of what kinds of places, planets, locations, etc., you might expect to see in a sci-fi setting. They won't all go in, of course, so please suggest as many as you can think of! What are some places you would want to see?",
        "created_utc": 1674363168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone feel like the coverage of the green comet could/should have been taken from the prologue to \"Night of the Comet\"",
        "author": "wkwfan2045",
        "url": "https://www.businessinsider.com/green-comet-ztf-viewing-where-when-how-see-2023-1",
        "text": "",
        "created_utc": 1674360537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Avatar 2 mid?",
        "author": "thedefinitiveopinion",
        "url": "https://youtu.be/qIp-AuCyN0c",
        "text": "",
        "created_utc": 1674354652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghosts of Yabos -The Replicons of Targo Rora",
        "author": "Dark_Orbits",
        "url": "https://youtube.com/watch?v=rdBWo2KvHgs&amp;feature=share",
        "text": "",
        "created_utc": 1674351788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghosts of Yabos : The Rain On QuickStar 6",
        "author": "Dark_Orbits",
        "url": "https://youtube.com/watch?v=fYMHSyOtjUY&amp;feature=share",
        "text": "",
        "created_utc": 1674351678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would This Example Be A Cyborg, Android, Or Something Entirely Different?",
        "author": "EtherealAvian",
        "url": "https://www.reddit.com/r/scifi/comments/10i7fxe/would_this_example_be_a_cyborg_android_or/",
        "text": "If this is the wrong place to ask this, please let me know of a better one. If we could upload a human conscious into a robotic body, what would that be considered. Typically androids are depicted as starting out as AI, while cyborgs are depicted as containing human components along with the robotic. In this case though, the human element is nearly entirely removed, but the origin would still start as human. I personally vote for cyborg, but I would like to know what the SciFi community consensus is.",
        "created_utc": 1674350784,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Humans are Weird - Wheelbarrows - Short, Absurd, Science Fiction",
        "author": "Betty-Adams",
        "url": "https://www.reddit.com/r/scifi/comments/10i7ex0/sps_humans_are_weird_wheelbarrows_short_absurd/",
        "text": "# \n\nhttps://i.redd.it/mfjn2ozoyhda1.gif\n\n# Humans are Weird – Wheelbarrows\n\n&amp;#x200B;\n\nOriginal Post: [http://www.authorbettyadams.com/bettys-blog/humans-are-weird-wheelbarrows](http://www.authorbettyadams.com/bettys-blog/humans-are-weird-wheelbarrows)\n\n&amp;#x200B;\n\nThe light was beginning to shift down into the soft,mid range oranges of evening by the time the mound of dirt was anywhere near flat. Third Sister shook out her frill in an attempt to dislodge the dust and grime that had collected there. She resisted the urge to lick off a particularly clingy bit of dirt in public and tried to focus on how the rest of the crew was coming along. The flight of Winged was circling the dig site taking readings. They were clearly flagging however. Only half of the flight members were maintaining the suggested elevation and the rest were exposing their teeth in a way that suggested they were about to forfeit their natural herbivore natures to start biting chunks out of the humans. The humans too were beginning to lag. Despite sensibly traveling along the ground they had been moving large ammounts of dirt with nothing but the simple levers and wheels that seemed to make up the base tool set of every network of humans no matter what their stated profession was.\n\n“Third Sister?” Seventeen Trills fluttered over to her side and hovered there, not looking directly at her.\n\nThird Sister was well aware that their sensory horns gave them essentially full circle awareness that was more accurate than simple sight but she still couldn’t help feeling a prickle of annoyance at apparently being ignored even as he requested her attention. She clicked a response in Mother out of irritation. At least the pesky little Hellbats could hear a reasonable range of sound.\n\n“I think it might be time to rest our wings,” Seventeen Trills observed.\n\n“I too have noticed that the extended physical labor has effected flight efficiency,” she noted. “I agree with your judgment.”\n\nHe snapped his beady black eyes around at her.\n\n“Oh it’s not us I’m concerned about,” he said. “It’s the humans.”\n\n“Why do you think that?” Third Sister asked, suddenly genuinely curious.\n\nEver since their first interactions the Winged had integrated the humans into their mythos as paragons of physical strength. She could not count the number of problems that arose medically because some Winged commander believed his humans to be near indestructible, and the humans were oddly loath to dissuade this idea. For a commander as inexperienced as Seventeen Trills to recognize human frailty in any form was something worth noting. However he seemed reluctant to speak. Another oddity that. He finally just gestured for her to follow him with his wing hook and led her around the corner of the structure they were erecting.\n\nShe saw what he was observing immediately. One of the larger humans, a Third Brother, if she remembered correctly was stopped dead in his tracks with the single-wheel mass transporter full of dirt and detritus blocking the main path. His head was tilted to the side and he was staring down at the handles of the device with a fascinated expression on his face. More importantly his skin was flushed with the pulsing of vessels trying to expel the excess mammalian heat of his body. His skin was venting copious amounts of water in an effort to evaporate away the energy.\n\n“Third Brother?” She asked carefully as she approached him. “Are you well?”\n\nTo her growing concern he didn’t respond.\n\n“Ranger!” Seventeen Trills snapped out. “What are you looking at?”\n\nThe human responded to that by raising his eyes to them, however the twin points didn’t focus on either of them.\n\n“Isn’t it amazing?” he asked in a hushed tone.\n\n“Isn’t what amazing?” Third Sister asked.\n\n“The material sciences have advanced,” the Third Brother said with slow words, “but the basic design of the wheelbarrow has not changed in thousand of years!”\n\nHis gaze drifted over and past her frill before focusing on what the humans called the middle distance.\n\n“Thousands!” he whispered, using only his breath to enunciated the sounds in hushed awe.  “This is the same thing that our ancestors might have used thousands of years ago.”\n\nHer frill snapped rigid with concern and Third Sister carefully stepped forward to touch the hot skin of the humans arm. Seventeen Trills fluttered around her giving out little distressed chirps of confusion.\n\n“Do you need a nap Third Brother?” Third Sister asked in the softest tone her voice was capable of producing.\n\nHe slowly swiveled his head to face her and blinked.\n\n“I think…” he said carefully. “I think maybe yes?”\n\n“Seventeen Trills,” Third Sister said. “Call an end to the work day and please have the least tired of your wing escort the humans home.”\n\nThe human in front of them lifted the wheelbarrows handles and began pushing towards the transport before stopping and looking back at them with wonder in his eyes.\n\n“I didn’t,” he began. “I mean I never experimented much as a kid you know? Is this what it’s like to be high?”\n\nThird Sister stared at him in bewilderment until he smiled and started back up the path.\n\n&amp;#x200B;\n\n# [Humans are Weird](https://smile.amazon.com/dp/B09NN2PM8D?binding=paperback&amp;ref=dbs_dp_rwt_sb_pc_tpbk) [​Book Series](https://smile.amazon.com/dp/B09NN2PM8D?binding=paperback&amp;ref=dbs_dp_rwt_sb_pc_tpbk)\n\n# [Amazon (Kindle, Paperback, Audiobook)](https://www.amazon.com/dp/B09NN2PM8D?binding=paperback&amp;ref=dbs_dp_rwt_sb_pc_tpbk)\n\n# [Barnes &amp; Nobel (Nook, Paperback, Audiobook)](https://www.barnesandnoble.com/s/%22Humans+are+Weird%22?Ntk=P_Series_Title&amp;Ns=P_Series_Number&amp;Ntx=mode+matchall)\n\n# [Kobo by Rakuten (ebook and Audiobook)](https://www.kobo.com/us/en/search?query=Humans%20are%20Weird&amp;fcsearchfield=Series&amp;seriesId=a035ce04-e582-5fcc-b327-16c68ca4b418&amp;fcshowpointsprice=no&amp;fcmaxprice=5&amp;fcminprice=0&amp;id=1561e6f7-742f-4c1b-a804-187728814574)\n\n# [Google Play Books (ebook and Audiobook)](https://play.google.com/store/books/details/Humans_are_Weird_I_Have_the_Data?id=7_wdEAAAQBAJ&amp;gl=US)\n\n&amp;#x200B;\n\nhttps://i.redd.it/vnbeyqglyhda1.gif",
        "created_utc": 1674350699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Startrek nerd gets the gift he’s always wanted and freaks",
        "author": "JosephBrown2000",
        "url": "https://youtu.be/3Kr_Dm0Ioek",
        "text": "",
        "created_utc": 1674349015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why! But why ?",
        "author": "0x00er",
        "url": "https://i.redd.it/xigy68btmhda1.jpg",
        "text": "",
        "created_utc": 1674346690,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most emotionally charged, intense sci-fi book you’ve ever read that brought or nearly brought you to tears?",
        "author": "Imaginary_Talk2554",
        "url": "https://www.reddit.com/r/scifi/comments/10i5x63/what_is_the_most_emotionally_charged_intense/",
        "text": "Three dimensional characters with little plot armor and an overall story that grasps you and pulls you in until the bitter end? For me, it was The Three Body Problem, The Sparrow and it’s looking like The Gap Cycle series by Donaldson though I haven’t quite finished it yet",
        "created_utc": 1674346454,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Family Friend's Facebook Account Is A Gem",
        "author": "0x00er",
        "url": "https://i.redd.it/3hrkufkfkhda1.jpg",
        "text": "",
        "created_utc": 1674345887,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Black Beacon is a 5-issue comic series about an intergalactic space station larger than our solar system. Is it a utopia or something else?",
        "author": "KodyCQ",
        "url": "https://globalcomix.com/c/black-beacon/chapters/en/1/1?utm_medium=social&amp;utm_source=reddit&amp;utm_campaign=GC_black-beacon_012123&amp;utm_term=r-scifi",
        "text": "",
        "created_utc": 1674345646,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Black Beacon by Heavy Metal, a 5-issue comic series about an intergalactic space station larger than our solar system. Is it a utopia or something else?",
        "author": "KodyCQ",
        "url": "https://globalcomix.com/c/black-beacon/chapters/en/1/1?utm_medium=social&amp;utm_source=reddit&amp;utm_campaign=GC_black-beacon_012123&amp;utm_term=r-scifi",
        "text": "",
        "created_utc": 1674345587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relative sci-fi novice. Bought a stack of books. Which should I read next?",
        "author": "Garethspur",
        "url": "https://i.redd.it/szfrs7wumida1.jpg",
        "text": "",
        "created_utc": 1674340809,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] [Superheroes] Tales of Supervillainy (Supervillainy Saga #8) by CT Phipps is now out on Audible!",
        "author": "CT_Phipps",
        "url": "https://www.reddit.com/r/scifi/comments/10i3b06/sps_superheroes_tales_of_supervillainy/",
        "text": "&amp;#x200B;\n\n[The world's worst supervillainess is building a crew to rob the richest dragon of them all.](https://preview.redd.it/63bshe631hda1.jpg?width=500&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b3521a7b0cc0c3cf2d6581c66bcffdec4ab24207)\n\nLink: [https://www.audible.com/pd/Tales-of-Supervillainy-Cindys-Seven-Audiobook/B0BSNXRM75](https://www.audible.com/pd/Tales-of-Supervillainy-Cindys-Seven-Audiobook/B0BSNXRM75)\n\n*Cindy Wakowski a.k.a. Red Riding Hood is the  second-most feared villain in Falconcrest City. Unfortunately, she soon  discovers that is only because she's considered Merciless: The  Supervillainy without Mercy™'s favorite henchwoman. Determined to prove  herself every bit her boyfriend's equal, if not superior, Cindy  assembles a team of other villains to go after the largest treasure  trove in the world: the hoard of the Dragon King.*\n\n *Unfortunately, things start going sideways from the start. An  ex-boyfriend of hers turned eldritch horror wants revenge, other  villains don't want anything to do with her plan, and the Foundation for  World Harmony has put out a death warrant on her head. Merciless has  also decided to engage in a little friendly competition that Cindy wants  nothing to do with. Can she steal slay the dragon and claim its  treasure? Will she let her ego and impatience get in the way? Also, who  is Red Sindi and what relationship does she have with our antiheroine?*\n\n*Tales of Supervillainy: Cindy's Seven  is the eighth novel of the best-selling Supervillainy Saga series and  the first from the perspective of its most popular supporting character!*",
        "created_utc": 1674339412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci-fi to pair with Pink Floyd",
        "author": "StarmanCarcoba",
        "url": "https://www.reddit.com/r/scifi/comments/10i3304/scifi_to_pair_with_pink_floyd/",
        "text": "I’m listening to “Shine On You Crazy Diamond (Pts 1-5)” and i was wondering about science fiction, especially pulpy ones from the late ‘60s-Early ‘70s, that would pair well with the band’s psychedelic rock genre. Anyone know any?",
        "created_utc": 1674338835,
        "upvote_ratio": 1.0
    },
    {
        "title": "My communication with Midjourney)",
        "author": "Seth_Tauris",
        "url": "https://i.redd.it/z171hfi9vgda1.jpg",
        "text": "",
        "created_utc": 1674337451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me and Midjourney",
        "author": "Seth_Tauris",
        "url": "https://www.reddit.com/r/scifi/comments/10i2idu/me_and_midjourney/",
        "text": "Created by my communication with Midjourney",
        "created_utc": 1674337372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science fiction horror ?",
        "author": "puzha",
        "url": "https://www.reddit.com/r/scifi/comments/10i2a8m/science_fiction_horror/",
        "text": "Hi everyone, hope you are well !\n\n\nCame to the realization that I love all things sci-fi horror recently. I have been diving into the movie franchise Alien, Signs, Lovecraft's stories, the TV show Fringe, and even some video games like Dead Space 2...\n\n\nBut I was wondering if I was missing anything ? Do you all any things you would absolutely 100% recommend for a newbie ? My goal is to get a 360 degree view or full A to Z of this specific genre...\n\n\nCheers",
        "created_utc": 1674336785,
        "upvote_ratio": 1.0
    },
    {
        "title": "A black mirror episode",
        "author": "MaddieCulp",
        "url": "https://v.redd.it/3tmezw39rgda1",
        "text": "",
        "created_utc": 1674336084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tracking a book",
        "author": "Frauvalhallen",
        "url": "https://www.reddit.com/r/scifi/comments/10i1h65/tracking_a_book/",
        "text": "Hi everyone. Several years ago (like 10) i read a book kinda space opera where there was this race that was called the \"cows\" or the \"bovines\".\nThey were antagonist to the humans, lived on overpopulated planets and had a herd mentality.\n\nI remember i finished the series on paperback and was waiting for the next volume but i forgot the name of the series and i lost contact with the friend that lended it to me (Jess, if you are reading this i want my paperback Dune back!)\n\nAnyone knows? Thanks!",
        "created_utc": 1674334707,
        "upvote_ratio": 1.0
    },
    {
        "title": "🎉Guide To Claim 1,000 Free SEA Token Airdrop 🌊 (Current value $3840)",
        "author": "No_Duty_8334",
        "url": "https://www.reddit.com/r/scifi/comments/10i0ncd/guide_to_claim_1000_free_sea_token_airdrop/",
        "text": "[removed]",
        "created_utc": 1674332588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Art by Ralph McQuarrie for The Empire Strikes Back, 1980.",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/10i06d2",
        "text": "",
        "created_utc": 1674331417,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Rodot that I drew.",
        "author": "okvl_artist",
        "url": "https://i.redd.it/abc6kvtwzfda1.png",
        "text": "",
        "created_utc": 1674326959,
        "upvote_ratio": 1.0
    },
    {
        "title": "First look at Zack Snyder's Rebel Moon, coming this December",
        "author": "zwtor",
        "url": "https://winteriscoming.net/2023/01/20/zack-snyders-rebel-moon-gets-december-release-date/?a_aid=46089",
        "text": "",
        "created_utc": 1674326403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Invincible is coming out in \"late 2023 (more or less)\"",
        "author": "zwtor",
        "url": "https://winteriscoming.net/2023/01/20/invincible-coming-late-2023-more-or-less/?a_aid=46089",
        "text": "",
        "created_utc": 1674326385,
        "upvote_ratio": 1.0
    },
    {
        "title": "This scene Ill always rank amongst the greatest sci-fi moments on film. John Carpenters The Thing.",
        "author": "UncleKano91",
        "url": "https://i.redd.it/sdnz6vt1chda1.gif",
        "text": "",
        "created_utc": 1674325067,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SelfPromoSaturday] JetSet Solo Sci-fi RPG is on sale today only for $2.99. Details inside.",
        "author": "JacobDCRoss",
        "url": "https://www.drivethrurpg.com/browse.php?discount=95764441cb",
        "text": "",
        "created_utc": 1674325016,
        "upvote_ratio": 1.0
    },
    {
        "title": "A gift from my neighbor!",
        "author": "bevilthompson",
        "url": "https://i.redd.it/k9yokgacbhda1.png",
        "text": "",
        "created_utc": 1674324829,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] VIGIA by Band of Bards - A comic where an alien science officer, along with her companion artificial intelligence, crash land on a strange world only to discover a long dead civilization… that isn’t so dead after all. (free preview)",
        "author": "AppletiniOnFleek",
        "url": "https://globalcomix.com/c/vigia/chapters/en/1/1?utm_medium=social&amp;utm_source=reddit&amp;utm_campaign=GC_vigia_012123&amp;utm_term=r-scifi",
        "text": "",
        "created_utc": 1674324769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cyber-Angel-Cop cuz why not",
        "author": "satyrcrusader",
        "url": "https://www.reddit.com/gallery/10hxb9a",
        "text": "",
        "created_utc": 1674324213,
        "upvote_ratio": 1.0
    },
    {
        "title": "why does base reality we live in has no awesome stuff?",
        "author": "Matejsteinhauser14",
        "url": "https://www.reddit.com/r/scifi/comments/10hx2zh/why_does_base_reality_we_live_in_has_no_awesome/",
        "text": "[removed]",
        "created_utc": 1674323662,
        "upvote_ratio": 1.0
    },
    {
        "title": "A group of researchers in the Antarctic discover that they being hunted by a creature that can mimic them in order to avoid detection in, The Thing (1982).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/4gt8xkmu3hda1",
        "text": "",
        "created_utc": 1674322360,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Lux, Why are plus size Yeti's considered the ideal forms of beauty in the Milky Way Galaxy? Why not humans or another alien species? This is the origin story / character design video I did on Lux, the social media star / acolyte at the Milky Way Academy (Bio in comments as well)",
        "author": "WorldBuilderZak",
        "url": "https://youtu.be/tH77jecccxQ",
        "text": "",
        "created_utc": 1674321635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci-fi Books recommendations 😅",
        "author": "johnnyzli",
        "url": "https://v.redd.it/5qtiotp2kfda1",
        "text": "",
        "created_utc": 1674321552,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is time?",
        "author": "syedMunim07",
        "url": "https://www.reddit.com/r/scifi/comments/10hw8w2/what_is_time/",
        "text": "[removed]",
        "created_utc": 1674321529,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Wanna hear a superhero suffering burnout and PTSD? Wanna hear superheroes in couples' counseling? Step into Dr. Christopher's office - he's a Superhero Shrink",
        "author": "InkIcan",
        "url": "https://www.reddit.com/r/scifi/comments/10hvob9/sps_wanna_hear_a_superhero_suffering_burnout_and/",
        "text": "I write scifi stories and a writing prompt for 'superheroes in unusual situations' led me to writing about a therapist who specializes in superheroes. Dr. Christopher has a very difficult, unique job. He’s a psychiatrist who works with superheroes. Some legendary warriors come with baggage and his job is to help ‘keep ’em flying.’ But how are you supposed to help the heroes who are supposed to be helping us? \n\nI produce the shorts myself - working with a voice actor to do the reading, and I use MidJourney to create concept art, sounds to create an ASMR experience for being in a doctor's office and I produce everything into video using Adobe Premiere. Listen to it for free here on Youtube:\n\n#[Superhero Shrink](https://youtu.be/sHlrIiXeMsE )\n\nThe process is interesting, creative, and rewarding - scratches a lot of itches for me. Superhero Shrink is coming soon to an audio book store near you - you can stay tuned here - https://inkican.com/braintacos - for details.  Thank you so much for being part of this journey!",
        "created_utc": 1674320080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blade Runner 2049 but it isn’t orange (full video in the comments)",
        "author": "Miller_Wilson",
        "url": "https://v.redd.it/trn26v60zeda1",
        "text": "",
        "created_utc": 1674314510,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] The Book of Constellations is a down-to-Earth sci fi audio drama about the sole survivor of an alien race come to fight the same Darkness on Earth that claimed his people. \"Gods and angels can look after themselves. It's people who need our attention.\" More info in comments. Here's a taste:",
        "author": "LiminalMask",
        "url": "https://v.redd.it/jeadlb9xxeda1",
        "text": "",
        "created_utc": 1674314187,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] STINGER: His warship under attack by a devastating alien horror, a drug-addicted recruit stumbles upon a secret super soldier compound. In his hand is the one hope to save the ship. But to do it, he’ll have to face his crippling fear of the alien on the other side of the hatch. (Free DL)",
        "author": "tdellaringa",
        "url": "https://storyoriginapp.com/directdownloads/467b7c17-7c1f-4ef8-be3f-8cc9cff3c9ac",
        "text": "",
        "created_utc": 1674308769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Previously, Star Trek",
        "author": "devinclarkcomedy",
        "url": "https://v.redd.it/r103y3b7rfda1",
        "text": "",
        "created_utc": 1674305966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanks to all of your support: we did it! We’ll know the outcome of the review in October. In the meantime, do check out my YouTube channel to learn more about how I built my Stargate, and any other future announcements 😀 https://m.youtube.com/playlist?list=PLAcOtZRQovKh9eHJLCR9s-p0IPQUu8o1u",
        "author": "Captain_Mutant",
        "url": "https://i.redd.it/7qplzmf1lfda1.jpg",
        "text": "",
        "created_utc": 1674303879,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a model of one of my favorite concepts in science fiction but I was wondering, could we ever have the technology to destroy planets in real life?",
        "author": "bobthesbuilder",
        "url": "https://i.redd.it/yldazp5v1eda1.png",
        "text": "",
        "created_utc": 1674303434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Films like Elysium",
        "author": "vapist77",
        "url": "https://www.reddit.com/r/scifi/comments/10hoylx/films_like_elysium/",
        "text": "Hi all.\n\nI just watched Elysium (2013) and absolutely loved it. I just wondered if anyone could recommend any films similar to that which you enjoyed?",
        "created_utc": 1674299539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disney is bringing Tron back from the dead, with Jared Leto starring",
        "author": "badfantasyrx",
        "url": "https://www.pcgamer.com/disney-is-bringing-tron-back-from-the-dead-with-jared-leto-starring/",
        "text": "",
        "created_utc": 1674298041,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] My review of Reunion by Alan Dean Foster",
        "author": "NetMassimo",
        "url": "http://english.netmassimo.com/2023/01/16/reunion-by-alan-dean-foster/",
        "text": "",
        "created_utc": 1674294852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science Fiction futuristic gaming console ad made for BF2042!!!",
        "author": "DickWriter69",
        "url": "https://i.redd.it/bsjuo7k1keda1.jpg",
        "text": "",
        "created_utc": 1674291434,
        "upvote_ratio": 1.0
    },
    {
        "title": "the end of history",
        "author": "qiling",
        "url": "https://www.scribd.com/document/605875005/THE-END-OF-HISTORY",
        "text": "",
        "created_utc": 1674290299,
        "upvote_ratio": 1.0
    },
    {
        "title": "How practical Exoskeleton suits would change society",
        "author": "DickWriter69",
        "url": "https://www.reddit.com/r/scifi/comments/10hmfwf/how_practical_exoskeleton_suits_would_change/",
        "text": "Exoskeleton sports. Athletes will train with Exoskeletons and sports will be played using them. Exoskeleton boxing for example and MMA will see athletes wearing protective armor and fighting with superhuman prowess. There will even be a way for Exoskeletons to put both athletes at the same power level, which would make it so weight leagues are replaced with height leagues\n\n\n\nExoskeleton construction men. Buildings can be constructed even faster and with the superhuman lifting capacity of the Exoskeleton!\n\n\nExoskeletons will help the disabled walk again!\n\nExoskeleton Policemen and Exoskeleton military suits!\n\nIn the military, Exoskeleton suits will be reserved for Officer ranks and above! They will be suited with composite steel armor that can shave off almost any projectile that an opposing force will throw at it! They will be carrying heavy machine guns and other heavy weaponry that's usually reserved for heavy armored vehicles! This will surely change the landscape of warfare\n\n\nAnd that's every way I see exoskeletons changing society! Anyone else have ideas?",
        "created_utc": 1674289377,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Pitch Black (2000)\" A deep space transporter crash-lands on a desolate planet circled by three suns. The survivors, including convicted killer Richard B Riddick, must work together to survive the hostile alien creatures that come out to hunt during the total solar eclipse every 22 years.",
        "author": "JimicahP",
        "url": "https://imgur.com/WJBzbKs",
        "text": "",
        "created_utc": 1674288107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which show do you like more?",
        "author": "Limp-Criticism5902",
        "url": "https://www.reddit.com/r/scifi/comments/10hk89g/which_show_do_you_like_more/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10hk89g)",
        "created_utc": 1674280832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Once again, I've cropped 3 photos from a classic science fiction movie. Can you guess what it is?",
        "author": "Shoddy_Orchid3022",
        "url": "https://www.reddit.com/gallery/10hjlwy",
        "text": "",
        "created_utc": 1674278687,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Saturday Button",
        "author": "TheTypeSetter",
        "url": "https://medium.com/the-inkwell/the-saturday-button-82eabf81d6cc?sk=e81006b39bd88fbb809d9fb8ed4e99b1",
        "text": "",
        "created_utc": 1674275818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazing what we miss first time",
        "author": "MusicalMerlin1973",
        "url": "https://www.reddit.com/r/scifi/comments/10hinvn/amazing_what_we_miss_first_time/",
        "text": "Im guessing this has been discussed before but mobile, late, wine, just don’t want to search. \n\nI watched the mini series for bsg tonight. Just finished the end. Listening to Adana’s speech. “I know where it is”. “It’ll be a long arduous journey to find it”. If you know where it is it isn’t a matter of finding…\n\nLove the series. Just funny what we catch on the third, fourth, fourth rewatch, regardless of the material.",
        "created_utc": 1674275480,
        "upvote_ratio": 1.0
    },
    {
        "title": "SciFi for young kids",
        "author": "altaltequalsnormal",
        "url": "https://www.reddit.com/r/scifi/comments/10hi5bs/scifi_for_young_kids/",
        "text": "Hi folks, I’m looking for high quality scifi movies and such that are appropriate for a precocious 5 yr old boy. The catch is, no/minimal violence, not too scary, etc. \nAny suggestions?\nThanks!",
        "created_utc": 1674273756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project Hail Mary audiobook.",
        "author": "Ale3021",
        "url": "https://www.reddit.com/r/scifi/comments/10hg44d/project_hail_mary_audiobook/",
        "text": "What a beautiful experience. As an audiobook just second to World War Z. The only dropback is that is only available in Amazon's Audible.",
        "created_utc": 1674267291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cargo (me, Blender, 2023)",
        "author": "MakeItRain117",
        "url": "https://www.reddit.com/gallery/10hfy5c",
        "text": "",
        "created_utc": 1674266775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men in Black 3 is underrated.",
        "author": "Away-Copy-6403",
        "url": "https://www.reddit.com/r/scifi/comments/10hezkl/men_in_black_3_is_underrated/",
        "text": "",
        "created_utc": 1674263890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Space Captain. Character generated by AI and the rest with Photoshop and Illustrator.",
        "author": "NeoDroleDeGueule",
        "url": "https://i.redd.it/1549l297nada1.png",
        "text": "",
        "created_utc": 1674262226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bedbound for a few days post-op, desperately need some recommendations please.",
        "author": "phidelt649",
        "url": "https://www.reddit.com/r/scifi/comments/10he0hw/bedbound_for_a_few_days_postop_desperately_need/",
        "text": "Hi all, hope this is allowed.  I got another 6-7 days to kill here and I’m going nuts. I just rewatched the Expanse and the entirety of Battlestar Galactica. In between those, I’m on book #3 of the Murderbot Diaries. I have access to Netflix, Disney, Amazon, Hulu, and Paramount. \n\nSome of my favorite series: BSG, Firefly, The Expanse, Star Wars, Altered Carbon, The 4400, Lost in Space, and Gundam Wing. \n\nAs above, currently reading The Murderbot Diaries. \n\nI adore anything mech related, military scifi, or hard scifi. I don’t like fantasy and I generally avoid stuff like Star Trek. \n\nThanks in advance for helping me from going nuts. Really need to fill some hours here.",
        "created_utc": 1674261136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calypso's New Battlesuit",
        "author": "Dark_Orbits",
        "url": "https://v.redd.it/l8ylbmi0kada1",
        "text": "",
        "created_utc": 1674261054,
        "upvote_ratio": 1.0
    }
]