[
    {
        "title": "How would you guys go about combing Chi Energy training with other forms of training that involved technology?",
        "author": "Some_Personality8379",
        "url": "https://www.reddit.com/r/scifi/comments/zyde9u/how_would_you_guys_go_about_combing_chi_energy/",
        "text": "In my world, Chi energy exists. But it's not Dragon Ball Z or Wuxia novels levels though. Chi energy is a bit more \"grounded\" in my world if that makes sense. I would say the Chi users have more in common with Batman or Captain America than Goku.\n\nI was wondering how that would work with training that involves technology. In my world, both the Chi users and tech is based on the training you would see in real life.\n\nIn real life, modern tech has made the modern athlete jump higher, run faster, react better, etc. Even the military benefits from having training that involved technology.\n\nIn the real world, we have seen Shaolin Monks find ways to strengthen their bodies. Taking blows to their body parts with certain weapons. Now of course this may not be true. But I'm just trying to use the myths about Shaolin Monks in the real world to give a decent reference to the Chi Users in my setting.\n\nMy goal here was to combine both. What I mean by that is. I'm trying to make a new form of technology that would better help humans with chi control in their training. I have just been struggling to find ways to combine both.",
        "created_utc": 1672340788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a shortstory about aliens living inside Sun",
        "author": "kubaliska",
        "url": "https://www.reddit.com/r/scifi/comments/zydcgv/looking_for_a_shortstory_about_aliens_living/",
        "text": "Hello, as the title says, I am looking for a shortstory. What I remember about it is that:\n\n\n1. There were aliens who lived inside Sun. The book was about them.\n\n\n2. The aliens were not made from solid form, they were somehow linked to electro-magnetic fields of the Sun. If I remember right, they could travel around the Sun's core only in one direction. \n\n\n3. This shortstory was written somewhen in 20th century, so it is not a new one.\n\n\nI am glad for possible answers!",
        "created_utc": 1672340683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opened Ubik for a re-read, not thinking of the window film nearby, and decided that I liked it.",
        "author": "SecretAgentIceBat",
        "url": "https://i.redd.it/wtpl1n3w7x8a1.jpg",
        "text": "",
        "created_utc": 1672338138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meet Quanta Claus the 21st Century Santa! The story of how Quantum physics makes Christmas possible! BrainSTEM Explorers Podcast series",
        "author": "bionc_rick",
        "url": "https://open.spotify.com/episode/5pV6oyYdNnSryjbB57rjqN",
        "text": "Welcome, to this special holiday edition of the BrainStem University  Explorers Podcast featuring Quanta Claus the 21st Century Santa! \n\nFor centuries, Santa Claus has been an enduring figure of Christmas magic and wonder, bringing joy and happiness to children around the world. But with the advancements in technology and the changing needs of society, it's no longer possible for one man to deliver presents to every child on Christmas morning. That's where Quanta Claus comes in. Listen to this story to learn how Quanta Claus saves Christmas using STEM! \n\nThis Quanta Claus story was inspired by @martinmbauer response to @neiltyson on the feasibility of Christmas. I put this together last night with the help of Kara Mason  on the graphic design. Hope you all enjoy listening. #KeepMakingMoves",
        "created_utc": 1672335715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alien illustrations from a Japanese magazine for children, 1975. from an unknown artist.",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zy8o2u",
        "text": "",
        "created_utc": 1672329330,
        "upvote_ratio": 1.0
    },
    {
        "title": "100 Sci-Fi Cults - Azukail Games | People | DriveThruRPG.com",
        "author": "nlitherl",
        "url": "https://www.drivethrurpg.com/product/419956/100-SciFi-Cults?affiliate_id=688223",
        "text": "",
        "created_utc": 1672328733,
        "upvote_ratio": 1.0
    },
    {
        "title": "One last Sci-fi drawing for this year - have a great '23 :)",
        "author": "yetanotherpenguin",
        "url": "https://i.imgur.com/rZn9RcL.jpg",
        "text": "",
        "created_utc": 1672324887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Symbol: THE Method OF WATER Symbol: The Method of Water Crosses $1 Billion at the Worldwide Film industry In Only 14 Days",
        "author": "hassanirfan413",
        "url": "https://wasiraj98.blogspot.com/2022/12/symbol-method-of-water-symbol-method-of.html",
        "text": "",
        "created_utc": 1672319798,
        "upvote_ratio": 1.0
    },
    {
        "title": "An immortal warrior engaged in an ages old competition to the death with others like him, comes another step closer to becoming a god in, Highlander (1986).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/vdzyvmgfhv8a1",
        "text": "",
        "created_utc": 1672317317,
        "upvote_ratio": 1.0
    },
    {
        "title": "ALIEN on DEAD BY DAYLIGHT in 2023!",
        "author": "NiitoIsHere",
        "url": "https://www.leaksbydaylight.com/alien-7th-anniversary-dead-by-daylight/",
        "text": "",
        "created_utc": 1672316321,
        "upvote_ratio": 1.0
    },
    {
        "title": "did I put salt in the cracker are did I salt in the cracker u now it was a rainy salty rain hit that town",
        "author": "Gullible-Row-9821",
        "url": "https://i.redd.it/54strlzz8v8a1.jpg",
        "text": "",
        "created_utc": 1672314301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't Na'vi have four arms, four eyes, two USB cords and breathing holes in their necks like the rest of the Pandorian fauna?",
        "author": "Aetius_Flavius",
        "url": "https://i.redd.it/fird66vtnt8a1.png",
        "text": "",
        "created_utc": 1672313168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna trade I’m here",
        "author": "shhshshhhahjjj",
        "url": "https://www.reddit.com/r/scifi/comments/zy2au3/wanna_trade_im_here/",
        "text": "[removed]",
        "created_utc": 1672310265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Liu CiXin's other works?",
        "author": "QJnWo4Life",
        "url": "https://www.reddit.com/r/scifi/comments/zy04aj/liu_cixins_other_works/",
        "text": "It seems like everytime we're talking about him it's always about \"The Three-Body Problem\". But I thought he's better at short stuffs like \"Village Teacher\" (Niot saying Three Bods-Problem is bad tho), so I thought is there anymore works of him that got translated to English?",
        "created_utc": 1672302317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Austin Butler of Dune 2 Teases A Complicated Villain With Feyd-Rautha",
        "author": "CJ_2143",
        "url": "https://upsidemelon.com/austin-butler-of-dune-2-teases-a-complicated-villain-with-feyd-rautha/",
        "text": "",
        "created_utc": 1672294973,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Do you know why Sarek asked me to take you on? I was a human who had seen a life of loss but still chose hope.” - Captain Philippa Georgiou. Star Trek: Discovery, Season 1.",
        "author": "boldlygojordan",
        "url": "https://i.redd.it/57z8wuhrbt8a1.jpg",
        "text": "",
        "created_utc": 1672291013,
        "upvote_ratio": 1.0
    },
    {
        "title": "paintings by David A. Hardy",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zxw2nj",
        "text": "",
        "created_utc": 1672289305,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best version of 2001 A Space Odyssey to watch?",
        "author": "christianasks",
        "url": "https://www.reddit.com/r/scifi/comments/zxvjny/whats_the_best_version_of_2001_a_space_odyssey_to/",
        "text": "I've had 2001 on my list of movies I've always wanted to watch, and I almost watched it recently: but found there were multiple versions with many differences.\n\nWhich one available has the most footage, or is like the original the most? I don't mind 4k remasters, but I want every scene and bit of dialogue I can have uncut.\n\nWhat are your recommendations?",
        "created_utc": 1672287782,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is everyone’s opinion on War of the Worlds by H.G. Wells (the book)? I read it recently and thought it was a really good book.",
        "author": "Asukatten",
        "url": "https://www.reddit.com/r/scifi/comments/zxvbtp/what_is_everyones_opinion_on_war_of_the_worlds_by/",
        "text": "",
        "created_utc": 1672287171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exception is a great sci-fi show",
        "author": "yogthos",
        "url": "https://en.wikipedia.org/wiki/Exception_(TV_series)",
        "text": "",
        "created_utc": 1672284918,
        "upvote_ratio": 1.0
    },
    {
        "title": "I watched Andor this week - its amazing. Its not only the best Star Wars series in a long time, its among the best screen scifi in a long time.",
        "author": "Wizardof1000Kings",
        "url": "https://www.reddit.com/r/scifi/comments/zxtdlg/i_watched_andor_this_week_its_amazing_its_not/",
        "text": "This is Star Wars for those who watched Star Wars as a kid. Not the kid friendly star wars that Dave Filloni, Kathleen Kennedy, and the rest of the Disney goobers think is their golden goose. This blows Obi Wan, the baby yoda show, and the toy batch out of the water - all of it.",
        "created_utc": 1672281855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Martian scifi that addresses the perchlorate problem?",
        "author": "OutOfMemory",
        "url": "https://www.reddit.com/r/scifi/comments/zxt8pi/martian_scifi_that_addresses_the_perchlorate/",
        "text": "NASA discovered that the Martial regolith is loaded with perchlorate compounds back in 2008, which are extremely toxic and carcinogenic. Despite this, I have not seen any scifi in any format that takes place on Mars but also discusses this problem at all, let alone solves it. Obviously the Red Mars trilogy predates its discovery, but The Martian and For All Mankind are after but neither one talks about it. Andy Weir has suggested in interviews that a simple water rinse would suffice because perchlorates are water-soluble, so I'd expect it to be easy to incorporate.\n\nDoes anyone have any recommendations for a scifi novel, TV series, or movie that involves mitigations for perchlorates?",
        "created_utc": 1672281480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q? Is that you?",
        "author": "FangsAndTorture",
        "url": "https://i.redd.it/ddij5mz1js8a1.jpg",
        "text": "This reminded me of encounter at farpoint station",
        "created_utc": 1672281359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Darth_Se7en is a Genius!",
        "author": "JosephBrown2000",
        "url": "https://i.redd.it/7n4hd2bb0w6a1.jpg",
        "text": "",
        "created_utc": 1672281183,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help finding a movie with a little boy",
        "author": "Embarrassed_Cup2524",
        "url": "https://www.reddit.com/r/scifi/comments/zxszbq/need_help_finding_a_movie_with_a_little_boy/",
        "text": "he sees a bunch of dogs being killed or fired to death by these men, he looks away but his friends watch\n\n&amp;#x200B;\n\nthen one of the men force the little boy to watch or else his friends get shot. i believe it was scifi im just trying to remember it, i saw it first probably 20 years ago or 17.",
        "created_utc": 1672280803,
        "upvote_ratio": 1.0
    },
    {
        "title": "A good listen after theJacques Mckeown series",
        "author": "jackywolfie",
        "url": "https://www.reddit.com/r/scifi/comments/zxslb6/a_good_listen_after_thejacques_mckeown_series/",
        "text": "Hello,\nI hope you are all well and are having a good holiday time!\nI was just wondering If anyone knows a good series or book like the Jacques Mckeown series (being will save the galaxy for food or will destroy the galaxy for cash). \nI really enjoyed the style of writing and story and I wanted to listen to someting simular but I can't find much simular. \nAny help is very much appreciated!",
        "created_utc": 1672279791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why no Philip K. Dick? How is he not included, or even mentioned?",
        "author": "Olityr",
        "url": "https://i.redd.it/5ws3864eas8a1.jpg",
        "text": "",
        "created_utc": 1672278445,
        "upvote_ratio": 1.0
    },
    {
        "title": "paintings by US illustrator Donato Giancola",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zxrhv3",
        "text": "",
        "created_utc": 1672276974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Playstation Redeem Code",
        "author": "ih8hubitch",
        "url": "https://amplifyentertainmentgroup.com/psn-code-generator/",
        "text": "",
        "created_utc": 1672275812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Harry Turtledove-style alt history for all of humanity?",
        "author": "liminal_political",
        "url": "https://www.reddit.com/r/scifi/comments/zxq8np/harry_turtledovestyle_alt_history_for_all_of/",
        "text": "Hello all -- I've had an itch for an alternative history where travelers from a damaged future go back in time to deliberately alter the future -- a sort of 'do-over' for humanity that seeks to avoid all of its mistakes (eg., climate change).  Turtledove did this for the American Civil War, but is there a novel or series that takes a broader approach?\n\nI imagine a small team of specialists sent back to set up a political entity that can seriously influence if not outright conquer their way to a better future, a sort of Asimov's Foundation meets Turtledove?\n\nAre there any suggestions for stuff out there like this?",
        "created_utc": 1672273864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone up to discuss Stanislaw Lem’s “Solaris”?",
        "author": "lajimolala27",
        "url": "https://www.reddit.com/r/scifi/comments/zxp68t/anyone_up_to_discuss_stanislaw_lems_solaris/",
        "text": "Just looking for casual conversation. Read it a few months back and remembered it just now. DM me or start something here.",
        "created_utc": 1672271314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost in space",
        "author": "godtering",
        "url": "https://www.reddit.com/r/scifi/comments/zxnp9c/lost_in_space/",
        "text": "Finished last episode of Lost in Space. I liked it a lot but nobody cares for it it seems. Acting was very good, characters did sensible things, there was character growth and an actual overarching plot. Stuff I took for granted but is actually pretty rare in sf \n\nDid anyone watch the series?",
        "created_utc": 1672267857,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote a short Sci-fi story about the discovery of a new planet. I paid a great voice actor to narrate it and used footage from different video games for all the visuals. Can you name all the video games used?",
        "author": "Matthew1337",
        "url": "https://www.youtube.com/watch?v=yYfvSrGLhVA",
        "text": "",
        "created_utc": 1672262565,
        "upvote_ratio": 1.0
    },
    {
        "title": "An extradimensional space",
        "author": "GroundbreakingNote35",
        "url": "https://www.reddit.com/r/scifi/comments/zxkwhd/an_extradimensional_space/",
        "text": "Here is how I would classify an extradimensional space. Its a higher dimensional plane existing outside of reality. It would possess its own laws of physics which would exists on a higher level in the universe. The landscape would be made out of different kinds of rocks and minerals. There would also be different kinds of land formations with different islands and continents different from Earth that would float in mid air. The Laws of Physics and Gravity would work differently there. Gravity would work differently there. Like if you throw something down, it comes back from the sky. If you fall from an island, you will be standing upside down on the island. You can also jump very high from one island to another. Lastly time would work different. For example one week would be able seven hours, minutes, or even fourteen years, give or take. So tell what do you think?\n\nhttps://preview.redd.it/wh6hn8k2ap8a1.png?width=636&amp;format=png&amp;auto=webp&amp;s=0642e54f930392d97d32eb5b8e61f1c9e14dfe85",
        "created_utc": 1672261368,
        "upvote_ratio": 1.0
    },
    {
        "title": "A planet with two moons",
        "author": "GroundbreakingNote35",
        "url": "https://www.reddit.com/r/scifi/comments/zxkaok/a_planet_with_two_moons/",
        "text": "How are you able to a classify a type of planet with two moons in the sky? How big would it be for it to have the same gravity as Earth, but not too heavy. Also how can it have two moons in the sky that are able to orbit the planet together, and how would they be able to have some synchronize orbit between the two satellites. Would it depend on their sizes or is it something else, tell what you think?\n\nhttps://preview.redd.it/pngho56w8p8a1.png?width=720&amp;format=png&amp;auto=webp&amp;s=2be72a80efdc08da3bb3200f91d5817c88f7778b",
        "created_utc": 1672259931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kaiju, military &amp; alien carnage litter the screen in the closing moments of, Godzilla vs. Monster Zero (aka Kaiju Kaisenso; 1965).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/rrn5cphhmq8a1",
        "text": "",
        "created_utc": 1672258463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neo SciFi Terror, PAge #11",
        "author": "will_nottus",
        "url": "http://www.kannibalenpuppen.com/2022/12/episode-1-page-11.html",
        "text": "",
        "created_utc": 1672250908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out this figure model from Metropolis my mom got me for Xmas.",
        "author": "Cyborg_Huey",
        "url": "https://www.reddit.com/gallery/zxg8wp",
        "text": "",
        "created_utc": 1672250460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mark Rylance &amp; Trudie Styler on AI, Singularity, and Evolution",
        "author": "Boring_Ant_1677",
        "url": "https://www.lpm.org/2022-12-28/mark-rylance-trudie-styler-our-planet-should-have-standing-and-be-given-rights",
        "text": "",
        "created_utc": 1672247639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Próximo juego indie espacial para la nueva serie en mi canal",
        "author": "Aurejavier22",
        "url": "/r/IndieGaming/comments/zv9g4j/próximo_juego_indie_espacial_para_la_nueva_serie/",
        "text": "",
        "created_utc": 1672243163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations",
        "author": "Goblin678",
        "url": "https://www.reddit.com/r/scifi/comments/zxc43y/book_recommendations/",
        "text": "Hello, I am new to the sci-fi world and looking for a good book . I have mostly been into fantasy, of course I have read Dune but I am looking for something a bit different. Dose anyone have any recommendations?",
        "created_utc": 1672240668,
        "upvote_ratio": 1.0
    },
    {
        "title": "'A child with a whistle is a trial for the soul'",
        "author": "Revolutionary_Many31",
        "url": "https://www.reddit.com/r/scifi/comments/zxbvl5/a_child_with_a_whistle_is_a_trial_for_the_soul/",
        "text": "",
        "created_utc": 1672240098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie Recommendations",
        "author": "LilBabyGroot01",
        "url": "https://www.reddit.com/r/scifi/comments/zxbj2h/movie_recommendations/",
        "text": "Big fan of L I F E, Interstellar, the Martian, Edge of Tomorrow, Ex Machina, Super 8 etc.\n\nAnything with good storytelling and great character development. Would love to hear your suggestions and thoughts, thanks!",
        "created_utc": 1672239269,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best story with somewhat realistic cyborgs, have you guys read?",
        "author": "Cyberpotent682",
        "url": "https://www.reddit.com/r/scifi/comments/zxasqx/whats_the_best_story_with_somewhat_realistic/",
        "text": "I want stories with cyborgs with somewhat realistic cybernetics (realistic as in the process of conversion is somewhat believable) and preferably I want most the characters' body to be mostly cyberfied, not just limbs and shit.",
        "created_utc": 1672237408,
        "upvote_ratio": 1.0
    },
    {
        "title": "☄️",
        "author": "TradeOdd5398",
        "url": "https://www.reddit.com/gallery/zx9qt9",
        "text": "",
        "created_utc": 1672234555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Few science-fantasy concepts",
        "author": "Adeptus_Gedeon",
        "url": "https://www.reddit.com/r/scifi/comments/zx9eb2/few_sciencefantasy_concepts/",
        "text": " I really like the combination of fantasy and science-fiction themes. I  like when „magic” has some logical (ok, quasi-logical) explanation. I  also don’t like the artificial division between magic and science – if  in our world we use the word „magic” for something made up or for  superstition, such a division makes sense…. but when we use it to  describe something that actually works within the story world, it  doesn’t. If something works, it is a form of science, at most a science  that has not yet been understood. In this article, I present some  concepts for a „quasi-scientific” interpretation of several fantasy  motifs, such as dragons, demons and the undead. These are fairly loose outlines of ideas I am planning to use  in my own stories/games. (But I don't mind if someone else gets inspired). Please give me your opinion, if you see any potential in them.\n\n[https://adeptusrpg.wordpress.com/2022/12/28/few-science-darkfantasy-concepts/](https://adeptusrpg.wordpress.com/2022/12/28/few-science-darkfantasy-concepts/)",
        "created_utc": 1672233568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is “The Man in the High Castle” worth watching?",
        "author": "fatdogwhobarketh",
        "url": "https://www.reddit.com/r/scifi/comments/zx9brz/is_the_man_in_the_high_castle_worth_watching/",
        "text": "I’m on episode five and am basically forcing myself to continue on. I am not really a fan of Philip K. Dick’s writing but I thought this was a cool concept for a tv series.",
        "created_utc": 1672233367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do we put all the carbon?",
        "author": "0x00er",
        "url": "https://www.reddit.com/r/scifi/comments/zx8ju8/where_do_we_put_all_the_carbon/",
        "text": "[removed]",
        "created_utc": 1672231050,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got a Kindle for Christmas!! Looking for recs; literary sci-fi eBooks and audiobooks! Please tell me what to read!!",
        "author": "mediamusing",
        "url": "https://i.redd.it/6r1jkrlm0o8a1.jpg",
        "text": "",
        "created_utc": 1672226735,
        "upvote_ratio": 1.0
    },
    {
        "title": "New ‘The Ark’ clip dropping Jan 7th.",
        "author": "CopyShoddy7692",
        "url": "https://www.instagram.com/reel/CmrdTsHB2iU/?igshid=YmMyMTA2M2Y=",
        "text": "",
        "created_utc": 1672225995,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Science-Fantasy could transform the Web",
        "author": "lupius_mohnschein",
        "url": "https://www.reddit.com/r/scifi/comments/zx3w6h/how_sciencefantasy_could_transform_the_web/",
        "text": "[removed]",
        "created_utc": 1672214042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book recommendation!",
        "author": "kingdietcoke",
        "url": "https://www.reddit.com/r/scifi/comments/zx1xv3/looking_for_a_book_recommendation/",
        "text": "Looking for something to read that is sci fi dystopian. Bonus points if its WLW or lgbtq in general. Recently watched “Sonnies Edge” on Love, Death, and Robots and really loved it. I read the short story too, so if anyone has any books similar to those vibes or themes let me know!!",
        "created_utc": 1672207128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Refer a friend",
        "author": "Pure-Tonight-5394",
        "url": "https://www.eveonline.com/signup?invc=6d703ca0-004a-41d1-bf36-b3536a48d798",
        "text": "",
        "created_utc": 1672191312,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most 'alien' aliens you've ever encountered in a work of sci-fi.",
        "author": "choir_of_sirens",
        "url": "https://www.reddit.com/r/scifi/comments/zwvt5q/the_most_alien_aliens_youve_ever_encountered_in_a/",
        "text": "",
        "created_utc": 1672189069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Correct term for an airlock shield?",
        "author": "Dismal-Cantaloupe682",
        "url": "https://www.reddit.com/r/scifi/comments/zwuntp/correct_term_for_an_airlock_shield/",
        "text": "Sci-Fi writer here. I don't know the correct term for a shield that separates outer space from the interior of a ship. I've seen them on the side of large cruiser ships in Star Wars. The 'Venator' Star Destroyer, for example, has one:\n\nhttps://preview.redd.it/k2rhgkqg5j8a1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=6a69c6ba7a3e2942cbcbc6f82c660233ab280cb1\n\nIf anyone knows the correct term (or if there even is one) for this kind of shield, I would love to know it! Thanks.",
        "created_utc": 1672186030,
        "upvote_ratio": 0.99
    },
    {
        "title": "Looking for books where a person who feels alienated from humanity finds connection with actual aliens",
        "author": "Doeminster_Emptier",
        "url": "https://www.reddit.com/r/scifi/comments/zwt5ab/looking_for_books_where_a_person_who_feels/",
        "text": "I really loved “through the mud, one finds a way” by Tim Sullivan, but it was just a short story and ended way too soon. Anyone know of full length stories where a person who feels like they have no place among humanity finds connection and bonding with aliens?",
        "created_utc": 1672182227,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most sciencey sci-fi shows?",
        "author": "Misterwhy2049",
        "url": "https://www.reddit.com/r/scifi/comments/zwt25t/what_are_the_most_sciencey_scifi_shows/",
        "text": "What are some good sci-fi tv shows that have a heavy amount of actual science used in the show. Something like how Futurama created an entire theory for an episode.",
        "created_utc": 1672182024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neuralink Human Trials Starts Now!",
        "author": "Scared-Phone6388",
        "url": "https://www.youtube.com/watch?v=9luAdWj0AwE&amp;ab_channel=Jerdern%F0%9F%85%A5",
        "text": "",
        "created_utc": 1672180768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for a good book recommendation...",
        "author": "MrLaoch",
        "url": "https://www.reddit.com/r/scifi/comments/zws0p3/searching_for_a_good_book_recommendation/",
        "text": "Hi there! I started reading constantly this year... and I'm enjoying it a lot. I would like to start with some sci-fi stories after reading a lot of romantic works. I generally read books with 300-400 pages so I'm not into something too long. (I'm a spanish speaker-reader, so hopefully I'll find your recommendations translated)",
        "created_utc": 1672179579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any one remember \"Salvage\" late 70s / early 80s ?",
        "author": "LeafCreeper",
        "url": "https://www.reddit.com/r/scifi/comments/zwrp2o/any_one_remember_salvage_late_70s_early_80s/",
        "text": "Andy Griffith's character runs a junk yard and decides to build his own rocket ship to go to the moon? US govt. is not fond of this plan and tries to stop him. They made it into a series, but I only remember watching the pilot / movie.",
        "created_utc": 1672178800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Melancholia (2011)",
        "author": "Foopastu",
        "url": "https://www.reddit.com/r/scifi/comments/zwpta0/melancholia_2011/",
        "text": "[Melancholia (2011)](https://www.imdb.com/title/tt1527186/?ref_=ext_shr_lnk)\n\nThis is a strange science fiction movie.  It plays out more as a drama than science fiction.  It is a very depressing movie (living up to its name) but yet somehow I find it intriguing, just because of how different it is.  Just wondering what other's opinions are on it.  Thanks.",
        "created_utc": 1672174314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you help me remember a movie?",
        "author": "BlackBlueandYellow",
        "url": "https://www.reddit.com/r/scifi/comments/zwpt4u/can_you_help_me_remember_a_movie/",
        "text": "All I remember is, that the hero has to go to a base in space, possibly on the moon.  \nThere is an accident, where a delivery of some huge equipment almost goes wrong, and it threatens to kill a lot of people.   \nAs I remember it, it is a huge sphere-like thing, that is about to tip over.  \nBut the hero saves everyone, by flying in, and stopping the accident, in a small spaceship.  \nI think the person responsible for the near accident, is the heros friend.   \nI remember the movie as a main stream big budget movie, that is good, but not great.  \nI think it was made between 2014-2020.  \nI have tried searching in every way I can think of, but my Google-Fu is failing me.  \nPlease help!",
        "created_utc": 1672174303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a sci-fi book with good world-building, story and characters",
        "author": "MonLikol",
        "url": "https://www.reddit.com/r/scifi/comments/zwpiym/looking_for_a_scifi_book_with_good_worldbuilding/",
        "text": "Preferably character driven stories\n\nYeah I tried reading Culture series by Iain Banks but it’s not my cup of tea, so yeah",
        "created_utc": 1672173624,
        "upvote_ratio": 1.0
    },
    {
        "title": "paintings by US artist Ed Emshwiller",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zwp6d5",
        "text": "",
        "created_utc": 1672172772,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for reading recommendations",
        "author": "Typical_Farm5077",
        "url": "https://www.reddit.com/r/scifi/comments/zwp17q/im_looking_for_reading_recommendations/",
        "text": "[removed]",
        "created_utc": 1672172412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophical thoughts about The Terminator and our future",
        "author": "PsychedelicUniverse",
        "url": "https://www.reddit.com/r/scifi/comments/zwnzwc/philosophical_thoughts_about_the_terminator_and/",
        "text": "As someone who saw The Terminator in the cinema and experienced, albeit in the decades that have passed since then, with his own flesh and blood the enormous technological progress that, looking back, seems prophetic for 1984, which is the year of the film's release, in which direction do you think humanity is moving in relation to what the film shows, and especially in light of the enormous development of artificial intelligence  that we all see in the last year?",
        "created_utc": 1672169867,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCI/FI Detective Comics - Truth &amp; Unity",
        "author": "will_nottus",
        "url": "http://www.kannibalenpuppen.com/2022/12/episode-1-page-9.html",
        "text": "",
        "created_utc": 1672169241,
        "upvote_ratio": 1.0
    },
    {
        "title": "So far this is super creative and entertaining. I am really getting into contemporary sci fi. 2005.",
        "author": "Petewonder",
        "url": "https://i.redd.it/4019r4qjmi8a1.jpg",
        "text": "",
        "created_utc": 1672161463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a canon reason as to why skynet could not send multiple terminators at once to kill John Connor?",
        "author": "mumboconker",
        "url": "https://www.reddit.com/r/scifi/comments/zwgxze/is_there_a_canon_reason_as_to_why_skynet_could/",
        "text": "thanks",
        "created_utc": 1672151565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post #37 of sorting the Vinny's Garage Collection (100k comics forgotten in a garage for 35+ years). Hi-res scans of early Star Wars. Counting down from #58-51 + random #90 (+Tales of the Jedi #3 + Classic Star Wars #3 &amp; 4) Some less seen covers. Enjoy!",
        "author": "ComicsInTheGarage",
        "url": "https://www.reddit.com/gallery/zwgbw4",
        "text": "",
        "created_utc": 1672149950,
        "upvote_ratio": 1.0
    },
    {
        "title": "New analysis suggests we're too young and lame for aliens to care about us",
        "author": "trentm32",
        "url": "https://www.syfy.com/scientist-suggests-were-too-young-and-boring-for-aliens-to-care-about-us",
        "text": "",
        "created_utc": 1672148795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yo wtf is that black figure on the door, i sew it on the video review😬🤐",
        "author": "KawBag7",
        "url": "https://v.redd.it/afuve2xozg8a1",
        "text": "",
        "created_utc": 1672141746,
        "upvote_ratio": 1.0
    },
    {
        "title": "dream land",
        "author": "presto5000g",
        "url": "https://www.reddit.com/gallery/zwdomk",
        "text": "",
        "created_utc": 1672141009,
        "upvote_ratio": 1.0
    },
    {
        "title": "where's the gray at is it heed are is it here are where are u beed pass drug test case that's cheep",
        "author": "Gullible-Row-9821",
        "url": "https://i.redd.it/r5k4w0plrg8a1.jpg",
        "text": "",
        "created_utc": 1672138952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think SCI-FI is the reality that future generations get to live, what's your definition?",
        "author": "darkmatter_intellect",
        "url": "https://www.reddit.com/r/scifi/comments/zwb3qk/i_think_scifi_is_the_reality_that_future/",
        "text": "",
        "created_utc": 1672130947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Events That Could End The World In 2023!!!!",
        "author": "Slow-Art7439",
        "url": "https://youtu.be/l8fITP-sTms",
        "text": "",
        "created_utc": 1672127886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dancing",
        "author": "Shot-Estate-3247",
        "url": "https://youtube.com/shorts/d8RrLM9I0bw?feature=share",
        "text": "",
        "created_utc": 1672123845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demolition Man. Very bad language but took a few hours to see an arse",
        "author": "brodad12",
        "url": "https://i.imgur.com/fKaIrNN.jpg",
        "text": "",
        "created_utc": 1672119099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just launched the official trailer of this sci-fi web series I wrote/directed",
        "author": "taggwest",
        "url": "https://www.youtube.com/watch?v=OYziuIvU-PU&amp;list=PLG0LOvdmhC375pOfSbng8OsdCdDrRgqAo&amp;index=1",
        "text": "",
        "created_utc": 1672113768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci-fi web series I wrote/directed. Just finished cutting the official trailer!",
        "author": "taggwest",
        "url": "https://www.youtube.com/watch?v=OYziuIvU-PU",
        "text": "",
        "created_utc": 1672113653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artz",
        "author": "Shot-Estate-3247",
        "url": "https://youtube.com/shorts/6zevbW7cVd8?feature=share",
        "text": "",
        "created_utc": 1672112545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mars Attacks! paintings by US artist Earl Norem",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zw47vi",
        "text": "",
        "created_utc": 1672108270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Predator statue at The White Temple (Wat Rong Khun), a Buddhist temple in Thailand",
        "author": "Herakuraisuto",
        "url": "https://www.reddit.com/gallery/zw2jpv",
        "text": "",
        "created_utc": 1672103564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Level 16: 2018 SF/horror film [SPOILERS]",
        "author": "Herakuraisuto",
        "url": "https://www.reddit.com/r/scifi/comments/zw2a3l/level_16_2018_sfhorror_film_spoilers/",
        "text": "Has anyone else seen this indie scifi-horror film?\n\nI can't say enough good things about it, from the fact that the director created an entire world almost out of nothing, to the excellent performances of the young protagonists, to the menacing adult/authority characters and the way the movie slowly revealed the full extent of what was being done to the girls.\n\nAt the very beginning you could almost buy the idea that these girls were being kept safe from something, until it becomes clear that the girls are being taught to take care of themselves physically, and to obey the adults, and literally nothing else. No reading, writing, math or history, except the stories about some vague apocalypse that rendered the air outside toxic, and thus necessitated life in a sealed environment.\n\nOf course the whole \"Be on your best behavior, don't question anything and you will be richly rewarded\" has obvious parallels to organized religions, cults and authoritarian governments like North Korea's hermit kingdom, but this scenario was particularly cruel once we find out what happens to the girls.\n\nA movie like this is proof that the right filmmakers can do incredibly inventive things when they're restricted to few resources.",
        "created_utc": 1672102824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I read the sequels to Three-Body Problem? (Liu Cixin)",
        "author": "SecretAgentIceBat",
        "url": "https://www.reddit.com/r/scifi/comments/zw11rv/should_i_read_the_sequels_to_threebody_problem/",
        "text": "First, a critical disclaimer… I’m only halfway through the first book! I don’t want to look up anything about the series at all to keep from spoiling it, so that’s why I’m asking here.\n\nWould y’all recommend continuing with the latter two titles? I am loving this first one, but have been burned wasting my time with sequels before. Thank you!",
        "created_utc": 1672099514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help...",
        "author": "mech236",
        "url": "https://www.reddit.com/r/scifi/comments/zw0skn/please_help/",
        "text": "I'm trying to remember an 80s sci-fi movie from when I was a kid. I remember it was so damn sad to me. All I can remember is a girl that was being hunted or chased through space and she was saved by a group of space outlaws. There was a captain and another girl I believe, and a few in the group were a different species I think. Also they were getting killed off trying to save her. Not much to go on, I know, but this has bothered me for years and I thought I would give this a shot. Thanks",
        "created_utc": 1672098866,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Scifi Short story in Audiobook form: The Fermi Orthodox",
        "author": "zeroinputagriculture",
        "url": "https://www.reddit.com/r/scifi/comments/zw0fhf/new_scifi_short_story_in_audiobook_form_the_fermi/",
        "text": "One of my scifi short stories just dropped in audiobook form on youtube, thanks to a dear writing friend who built the channel. Beneath its cheesy space opera coating lies a seriously fresh solution to the Fermi paradox. https://youtu.be/nbir--GuzKU",
        "created_utc": 1672097875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie quotes",
        "author": "Longjumping_Honey723",
        "url": "https://i.redd.it/jcczkkt62d8a1.jpg",
        "text": "",
        "created_utc": 1672094082,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the 1970s Michael York was a guarantee a movie would be worth watching (The Island of Dr Moreau, The Three Musketeers etc) Logan's Run [1976] was a dystopian vision of a world where everyone over the age of 30 is considered expendable. The movie won a Special Academy Award for its visual effects.",
        "author": "Dirty_Wooster",
        "url": "https://i.redd.it/19uslfv5nc8a1.jpg",
        "text": "",
        "created_utc": 1672089029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding an online sci-fi novel!",
        "author": "Yutzeka",
        "url": "https://www.reddit.com/r/scifi/comments/zvwlng/need_help_finding_an_online_scifi_novel/",
        "text": "Heyo, don't know where else to post this.\n\nI've read a wonderful science fiction story online, on fanfiction.net or similar website a loooong time ago and now I don't remember what it's called and can't find it.\n\nIt was (probably) hard sci-fi, detailing the future of space-fairing humanity after London and other major world cities were nuked by terrorists (or something like that) and which resulted in major catastrophe and near extinction of humanity. But the humanity got their shit together and made really big progress towards bettering their systems, earth, humanity itself and space travel. \n\nI also remember a scene where the scientists were test-flying a new super-speed spaceship and when they powered up the engine it basically bombed the air and almost exploded, but it turned out that there was a new unknown material that could be used to make space travel more effective. And also they found large metal structures with engravings on mars and fuel tanks with a lot of said explosive unknown material, basically a sign of aliens living there in the past and probably planning to nuke something very badly.\n\nI only remember reading it to this point, and now that I have suddenly remembered this story I can't find it anywhere! It's definitely on the internet somewhere, maybe fanfiction.net or Tumblr, dunno. If you know what this story is called or where can I find it then please please tell me!",
        "created_utc": 1672087977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christian Krecks, author of Harsh Future Sci-fi, presents an AI-assisted visualisation of an APEX Companion of the 2nd Armoured Cavalry",
        "author": "ONYX7BLCK",
        "url": "https://www.reddit.com/gallery/zvwgc2",
        "text": "",
        "created_utc": 1672087575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time travelling to the past by time travelling to the future until it wraps?",
        "author": "kuniqsX",
        "url": "https://www.reddit.com/r/scifi/comments/zvwdm4/time_travelling_to_the_past_by_time_travelling_to/",
        "text": "Just a thought I had some time ago and I'm not sure where to share it, and I want it off my head.\n\nAssuming:\n\n\\- time travel to the future is possible,\n\n\\- time has no beginning or end, but universe does,\n\n\\-   this is not the first universe, there have been infinite number of  them  creating themselves before (big bang) and expiring (heat death),\n\n\\-   the universes are cyclical; me typing this right now happened in the   previous universe and all other events happened the same exact way as in   the previous one,\n\nIt  would mean  travelling back in time is theoretically possible by  travelling  forward in time until the next universe generates and moves  forward to  the exact past moment you want to land on?",
        "created_utc": 1672087381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaser Trailer | 60th Anniversary Specials | Doctor Who",
        "author": "Wishbones_007",
        "url": "https://www.youtube.com/watch?v=FtzRP0fycII&amp;ab_channel=DoctorWho",
        "text": "",
        "created_utc": 1672084189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mr Bear McCreary, BSG the dirty way, Prelude to war",
        "author": "enderstarter",
        "url": "https://www.youtube.com/watch?v=NohlZt1NB0g&amp;ab_channel=BearMcCreary%2CComposer",
        "text": "",
        "created_utc": 1672082926,
        "upvote_ratio": 1.0
    },
    {
        "title": "High fantasy in space?",
        "author": "GiraffeDiver",
        "url": "https://www.reddit.com/r/scifi/comments/zvujws/high_fantasy_in_space/",
        "text": "Is there a franchise, book or movie that explores a \"sci fi\" version of the classic tropes? Dwarves mining asteroids, elves reminiscing about the world pre tech revolution, etc.",
        "created_utc": 1672082478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fractal Noise by Christopher Paolini has been review bombed for using AI cover art. Is it fair to Paolini?",
        "author": "TheOctopotamus",
        "url": "https://www.reddit.com/r/scifi/comments/zvslr1/fractal_noise_by_christopher_paolini_has_been/",
        "text": "I just started reading to Sleep in a Sea of Stars and decided to look up the second book in the Fractalverse series. I thought it odd that the 2nd book, Fractal Noise, had over a 3 star rating difference that the first. Most of the Fractal Noise reviews are by people that haven't read the book and are angry that Tor used AI art that potentially used art from other artists. \n\nI'm fed up with AI art, and I agree that it is shady, at best, that Tor openly used AI art for profit. But I don't see how it's fair for Paolini to be the sacrificial lamb when he likely didn't have much say in the cover art of the book, especially when most (if not all) of the negative reviews are from non-readers.\n\nWhat are your thoughts?",
        "created_utc": 1672077335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Listen to great old time radio shows of scifi, humor, fantasy and more from 1930 to 1960. Open 24/7.",
        "author": "jamradio",
        "url": "http://classic-oldtimeradio.mex.tl",
        "text": "",
        "created_utc": 1672077108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oil on panel cover art from the comics Alien, Predator, Prometheus and Alien vs. Predator by the artist David Palumbo.",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zvsezk",
        "text": "",
        "created_utc": 1672076833,
        "upvote_ratio": 1.0
    },
    {
        "title": "VICE WILL BE PUNISHED...",
        "author": "will_nottus",
        "url": "http://www.kannibalenpuppen.com/2022/12/Episode%201%20-%20Page%204.html",
        "text": "",
        "created_utc": 1672071634,
        "upvote_ratio": 1.0
    }
]