[
    {
        "title": "Good Scifi series recommendations?",
        "author": "rbates08",
        "url": "https://www.reddit.com/r/scifi/comments/z0kk1q/good_scifi_series_recommendations/",
        "text": "I'm looking for a few good Scifi series or short films to get into. I was really into the Dust series on Youtube for a while. Wondering if there are any others you all might be able to recommend.",
        "created_utc": 1668991305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books where a grumpy adult character accidentally adopts a kid?",
        "author": "aspareaccounts",
        "url": "https://www.reddit.com/r/scifi/comments/z0gt7n/books_where_a_grumpy_adult_character_accidentally/",
        "text": "Any good sci-fi books where maybe a kid with no family latches onto an aloof adult and accompanies them on the journey? I would prefer for the adult to be female but I'll accept male, too. No preference for the kids gender.",
        "created_utc": 1668981953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Behind the scenes of special effects work for TERMINATOR 2: JUDGEMENT DAY (1991)",
        "author": "NotMeAgain999",
        "url": "https://v.redd.it/8as7amdtu71a1",
        "text": "",
        "created_utc": 1668980246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci fi short story anthologies (ideally in audiobook form)?",
        "author": "themainheadcase",
        "url": "https://www.reddit.com/r/scifi/comments/z0fwfr/sci_fi_short_story_anthologies_ideally_in/",
        "text": "I'm looking for a sci fi short story anthology that essentially collects the best of sci fi short stories. It would be ideal if it is available in audiobook form. Does anyone know of such a book?",
        "created_utc": 1668979807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some good scifi movies to add to my towatch list (animation and anime too)",
        "author": "Nervous_Driver334",
        "url": "https://www.reddit.com/r/scifi/comments/z0f3ei/looking_for_some_good_scifi_movies_to_add_to_my/",
        "text": "List of movies you dont have to mention:\n\n\nMARVEL, DC    \nMad max    \nInterstellar    \nMonster hunter    \nHardcore Henry    \nLOTR    \nHarry Potter    \nNight at the museum    \nDune\nRise, Dawn and War of apes    \nArrival    \nDistrict 9    \nReady player one    \nAlita battle angel    \nEdge of tomorrow    \nThe tomorrow war    \nJumper    \nSnowpiercer    \nPrometheus    \nStar trek    \nI am legend    \nI robot    \nMIB    \nLove and monsters    \nResident evil    \nPirates of the Caribbean    \nMatrix    \nTerminator    \nHellboy    \nGodzilla, Kong and other kaiju movies    \nWar of the worlds    \nLabyrinth    \nTransformers    \nWatchmen\n\n\nSea beast    \nPIXAR, Disney    \nRumble    \nSpider-man into spider verse    \nThe Mitchels vs the machines    \nBig hero 6\n\n\nIDK what more, thats what I remember. Anything will do.",
        "created_utc": 1668977939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a TV show of Wool?",
        "author": "jamawg",
        "url": "https://www.reddit.com/r/scifi/comments/z0f17q/is_there_a_tv_show_of_wool/",
        "text": "I occasionally check IMDB to see if anyone has made a movie of some of my favo(u)rite books. \n\nI found [this](https://www.imdb.com/title/tt14688458/). The description says  \n\n&gt; Men and women live in a giant silo underground with a lot of regulations which they think are supposed to protect them from the toxic and ruined world on the surface.\n\nSo, that certainly sounds like [Wool](https://www.amazon.com/Wool-Trilogy-Howey-25-Apr-2013-Paperback/dp/B011T7ACU0/ref=sr_1_3?crid=UL1H57A7DZ74).\n\nIMDB says that 10 episodes were made, but I can't find a trace of it. Does anyone know how I can stream this, or even who made it?",
        "created_utc": 1668977788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rusty Skies - Michael Black",
        "author": "Ravekat1",
        "url": "https://i.redd.it/9zyuqbolc41a1.jpg",
        "text": "",
        "created_utc": 1668977605,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on 'Project hail mary' by Andy weir?",
        "author": "reddit_rendered_name",
        "url": "https://www.reddit.com/r/scifi/comments/z0cit1/what_are_your_thoughts_on_project_hail_mary_by/",
        "text": "Ammonia breathing aliens is funny and I liked it",
        "created_utc": 1668971691,
        "upvote_ratio": 1.0
    },
    {
        "title": "In honor of Greg Bear’s passing I had to get out my first edition of “Blood Music”",
        "author": "DocJones43",
        "url": "https://www.reddit.com/gallery/z0bxbp",
        "text": "",
        "created_utc": 1668970233,
        "upvote_ratio": 1.0
    },
    {
        "title": "RIP Greg Bear",
        "author": "NeatlyCritical",
        "url": "https://www.gregbear.com/images/gregbear/RayAndGreg.jpg",
        "text": "",
        "created_utc": 1668969767,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Button",
        "author": "DonovanFilms",
        "url": "https://youtu.be/l_PcquJ0cZ8",
        "text": "",
        "created_utc": 1668968845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory: Andor Is Hiding A Jedi Right Infront Of Our Eyes",
        "author": "zwtor",
        "url": "https://wikiofnerds.com/theory-andor-is-hiding-a-jedi-right-infront-of-our-eyes/?publisher=aistee",
        "text": "",
        "created_utc": 1668968331,
        "upvote_ratio": 1.0
    },
    {
        "title": "'A Memory Called Empire' won Hugo?",
        "author": "atfarley",
        "url": "https://www.reddit.com/r/scifi/comments/z0ap7d/a_memory_called_empire_won_hugo/",
        "text": "I just finished the first book. I did like it. I am finding it hard to imagine how it won so many awards. Even if I dislike, or moderately like, other award winners I can still **tell** why something would have won that award. I am at a loss with *A Memory Called Empire.* Does it get better with the following books?",
        "created_utc": 1668967296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wakanda For Sale",
        "author": "Boop108",
        "url": "https://filmofileshideout.com/archives/wakanda-for-sale/",
        "text": "",
        "created_utc": 1668964003,
        "upvote_ratio": 1.0
    },
    {
        "title": "For All Mankind - I can't",
        "author": "skoon",
        "url": "https://www.reddit.com/r/scifi/comments/z092zi/for_all_mankind_i_cant/",
        "text": "I'm trying to watch \"For All Mankind\" but they just strapped a pregnant woman to the outside of a rocket ship to shoot her up from the surface of Mars so she can have her space baby in orbit.\n\nHer adopted father was piloting the rocket, then she had to space jump from the rocket to the orbiting spacecraft while she was wearing the spacesuit of her baby-daddy.\n\nMeanwhile back on Earth, the brother of the drug addict astronaut, who is also on Mars by the way, just helped bomb NASA while this whole.space baby rescue is going on and killed his drug addled astronaut brothers secret love who is the ex-wife of the father piloting the space baby rocket and adopted mother of the space baby woman.\n\nOh and they found North Korean astronaut on Mars and took him back to their space camp on Mars. Then they decided it was best if they exiled the drag addict astronaut to the North Koreans downed space craft, yeah he was stranded on Mars, because the drug addict astronaut was taking drugs on Mars and caused a big explosion which killed 3 people. \n\nAll while the female President of the United States had to come out as a lesbian after signing the executive order enacting \"don't ask, don't tell\" and then resign instead of being impeached because her \"beard\" was going to be outed as gay and having an affair with a man.\n\nOh and the female head of NASA had to defect to Russia after the bombing because the FBI found out she was giving technology to her Russian boyfriend for Russia to use.\n\nThis was all in the season finale.\n\nI will not be watching season 4 if there is one.",
        "created_utc": 1668963526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jonathan Frakes thinks there's a future for Star Trek: The Next Generation",
        "author": "zwtor",
        "url": "https://redshirtsalwaysdie.com/2022/11/18/jonathan-frakes-thinks-theres-a-future-for-star-trek-the-next-generation/?a_aid=46089",
        "text": "",
        "created_utc": 1668962259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artemis I Has A Stowaway - Day 5 - A semi-fictional daily mission log",
        "author": "AuthorNathanHGreen",
        "url": "https://www.reddit.com/r/scifi/comments/z08atn/artemis_i_has_a_stowaway_day_5_a_semifictional/",
        "text": "  \n\nWould anyone object if I just start with shit going wrong?\n\nSo, there I am, minding my own business, Artemis I was happily cruising towards lunar insertion, and I’d woken up a half hour earlier than NASA wanted me to.  Thirty minutes away from the NASA farmer-accountants tabulating every second of my time: heaven.  I’d just started on one of the science-fiction books I had very much expected to be half way through at this point, and an alarm went off.\n\nIn retrospect this might be why they train astronauts so much.  Desensitize them to an alarm so they can get right to the business of dealing with it.  In the movies the crews always look so instantly professional, all evaluation, no fear.  Like a bank manager scrutinizing a letter of credit.\n\nIn contrast, my reaction to the master alarm going off for the first time in my life was more… instinctual.    \n\n“No, no, no, no, no, god no, no, no, no, no, please, no, no, please, please, no…” would be the verbatim quote as I literally bumped into every bulkhead on Orion making my way from cot to console.  \n\nAll I’m saying is that if this were my second, or third, or fiftieth alarm, I’d have been a lot cooler.  I think for the proper astronauts who’ve done thousands of these in training that alarm is probably the sound of them being given an opportunity to show what manly men, and womanly women, they are by how calmly, and efficiently, they can deal with it.\n\nI was just scared for my life.\n\n“There’s an alarm!  What do I do?” In retrospect it was a surprisingly efficient radio message back to NASA. Help me farmer-accountants, you’re my only hope.\n\nThe command console’s LCD display was flashing red and, this is embarrassing, it took me a minute to read through the different flashing bits to find what the actual emergency was.  The whole console’s pretty scary when you get right down to it, especially when it’s flashing red.  “Warning: cabin pressure loss.”\n\n“Alex,” Mark’s voice came back over the radio a few seconds later, the guy was as cool as ice cream.  “We need you to get your flight suit on.  Expedite.”\n\nI stashed the flight suit I’d pilfered off Moonikin in a storage hatch designed just for them.  I’m sure there would be a proper, by the book, way to have folded up all the components and tucked them away.  I’d packed it like a teenager going to college.\n\nAs soon as I start pulling stuff out, bits of the suit start drifting away.  Zero gravity is horrific for making a mess.  Everything is moving.  I’m moving away from the compartment and cartwheeling slowly.  The pumpkin colored flight suit’s outer layer is wobbling around and spinning like it had a ghost inside it.  Bits of the rubber pressure underlayer are spinning and coasting away in random directions through Orion.  The alarm is still blaring, and the only bit of good news is I got the first piece of the flight suit I need to put on - a pair of what really do look like rubber underwear.  \n\nTrying to pull them on in zero-G is a whole world of fun.  I’m pretty sure my thighs have swelled a little in space, because while they fit - barely - on Earth, I’m having a hell of a time forcing my thighs through the leg holes.  This is mandatory.  The orange outer layer of the flight suit doesn’t hold pressure.  This inner layer, a multi-piece rubber pressure bladder is what’s going to save my life - if I can get it on.  \n\nMy thighs are stuck in the rubber legs of the underwear and it really, really, doesn’t want to slide up as much as I need it to.  This thing was made to fit Moonikin - who I stole it from - and while I luckily ended up having a similar upper body physique, I’ve got big legs.  Back on Earth I’d left the suit’s rubber thighs, calves, and booties behind.  There was no way for me to get my legs and feet into the things.  \n\nNow I’m going to die in space because I have swollen thighs.  The weirdest part though, maybe the worst part, my brain really likes to make connections, and this feels a lot like the horror of pulling on pants you need and discovering you’ve put on weight, and they won’t fasten.  It’s like, 60% that, and 40% I’m going to die.\n\nI’ve got this terrible image in my head: Orion’s internal cameras capturing me floating around, wildly trying to pull up my underwear as I asphyxiate. For the rest of human history that video would get shown in safety briefings as why you fit your gear correctly. Everyone will be laughing, at me dying, forever. I can’t even blame them, I know I look like an idiot.\n\nI do get them on, thank god. \n\nAnd I move on to the belly piece.  It’s managed to spin and bounce and wobble itself all the way to the other side of Orion and I have to go diving through the ship to get it.  Then I put it on, but upside down.  This is horrific. The safety training video just keeps being recorded.\n\nI get a flashback of some of Jess’s clothes where it wasn’t always obvious how she was supposed to wear them.  She just always seemed to know - and as soon as they were on, they looked spectacular.  \n\nI get the belly piece on with my second attempt and the chest piece is firmly stuck over my head, my arms pointing straight “up” as my body rotates around Orion, when the alarm stops.\n\n“Alright Alex.  That’s enough,” Mark’s voice comes back over the radio.  \n\nI manage to lever the rubber chest piece down. It’s bunched up in my armpits, but at least my head and arms are free, and get to the radio.  “Did you guys fix the problem on your end?” I ask.  The console’s back to a non-imminent death mode and I realize my heart is absolutely racing and I’m coated in sweat.\n\n“Just a drill.  We’re going to need to work on dawning the OCSS though.  Getting proficient at putting it on could well save your life up there.”\n\nThey’re actually pretty good sports about it.  They don’t bother me at all for the next fifteen minutes while I drift back and forth in Orion swearing to myself.  Initial feelings aside, I eventually have to admit that this is exactly what I signed up for, and what I’d wanted.  Surprise drills are actually full-on NASA astronaut stuff.  How many times you think Neil Armstrong died in simulations?  More than me so far.  \n\nI really could have just died.  If there had actually been a leak in Orion and I’d had to get that flight suit on in time to save my life, that would have been it for me.  I imagined myself blown up on launch or dying on re-entry.  Things I had no control over.  I never imagined dying because I was too incompetent to save my own life.  What if I die up here because I’m an idiot?  \n\n“What are you thinking Mark?  Step 1 is us going through how I should be stowing the flight suit?  Or you guys want to do a few more practice runs of just putting it on?”\n\nWe spent the next two hours - two hours - going through how the OCSS should have been stowed.  You know, so that all it’s pieces don’t go exploding out of its locker when you try and take something out.  Then four hours about how to put it on.  \n\n“Mark…” I say into the radio, “the video of me from the drill…”\n\n“Don’t worry about that buddy, I took care of it already.”\n\n\\*\\*\\*\n\nI’m Nathan H. Green, a science-fiction writer with a degree in aerospace engineering, and I’m going to be doing daily semi-fictional stories tracking the Artemis I mission.  You can follow along through my reddit (u/authornathanhgreen).\n\n*Artemis I Has A Stowaway* is a work of semi-fiction. All incidents, events, dialogue and sentiments (which are not part of the mission’s official history), are entirely fictional. Where real historical figures appear, the situations, incidents, sentiments, and dialogues concerning those persons are entirely fictional and are not intended to depict actual events, personality, disposition, or attitudes of the real person, nor to change the entirely fictional nature of the work. Save the above, any resemblance to actual persons, living or dead, events, or locales is entirely coincidental.\n\n© 2022 Nathan H. Green",
        "created_utc": 1668961573,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SciFi Meme] Art: Don Ivan Punchatz / cover art, ”The Silent Invaders” by Robert Silverberg / Ace Books, 1977",
        "author": "CliffTheAlien",
        "url": "https://i.redd.it/60uzk9e8q41a1.jpg",
        "text": "",
        "created_utc": 1668960285,
        "upvote_ratio": 1.0
    },
    {
        "title": "He’ll never be truly gone as long as we have these.",
        "author": "M4rkusD",
        "url": "https://i.redd.it/tfxi00t1661a1.jpg",
        "text": "",
        "created_utc": 1668959698,
        "upvote_ratio": 1.0
    },
    {
        "title": "A story painting for my videogame, hope you like it! What you think happened in this swamp?",
        "author": "thatohora",
        "url": "https://i.redd.it/ug1fmsmhl41a1.jpg",
        "text": "",
        "created_utc": 1668958875,
        "upvote_ratio": 1.0
    },
    {
        "title": "The robotic machines from \"Tales from the Loop\" fit into the 1980s aesthetic and vibe well, feeling as if they fit into the alternate Swedish countryside of Mälaröarna",
        "author": "That_Nature_Dude",
        "url": "https://www.reddit.com/gallery/z06cdj",
        "text": "",
        "created_utc": 1668956794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw this beautiful image on another sub and am amazed at the amount of detail (If anyone knows the original artist please share)",
        "author": "thepurplecut",
        "url": "https://i.redd.it/1ceufztmu51a1.jpg",
        "text": "A true piece of art",
        "created_utc": 1668955857,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Magnetrine vehicles from \"Tales from the Loop\" by Simon Stålenhag evoke a feeling of strange familiarity to trains and boats, making them all the more fitting for Stålenhag's works of fiction",
        "author": "That_Nature_Dude",
        "url": "https://www.reddit.com/gallery/z05wbk",
        "text": "",
        "created_utc": 1668955835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robots, Rockets and Rayguns",
        "author": "LawrenceBennett43",
        "url": "https://www.google.com/url?q=https://bestlifestyles-us.com/robots-rockets-and-rayguns-sci-fi-ss&amp;sa=D&amp;source=hangouts&amp;ust=1669040970079000&amp;usg=AOvVaw1Z7_zPrLdJIs_TWcd3gleL",
        "text": "",
        "created_utc": 1668954658,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your opinion, what was Greg bears greatest work?",
        "author": "FlimsyGuava",
        "url": "https://www.reddit.com/r/scifi/comments/z04tus/in_your_opinion_what_was_greg_bears_greatest_work/",
        "text": "",
        "created_utc": 1668952808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 19 of Sci Fi November",
        "author": "rowejl222",
        "url": "https://www.reddit.com/r/scifi/comments/z04qd7/day_19_of_sci_fi_november/",
        "text": "Today I watched Matrix Revolutions. Good god that was cringe “Neo, I believe”",
        "created_utc": 1668952550,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my Actifry touched the AllSpark. What should I do ?",
        "author": "ThePooley",
        "url": "https://v.redd.it/zu4jeztux31a1",
        "text": "",
        "created_utc": 1668950735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Stand, me, 3D Studio Max + Arnold + Photoshop, 2022",
        "author": "Guilhem-Bedos",
        "url": "https://i.redd.it/xf8h4paof31a1.jpg",
        "text": "",
        "created_utc": 1668944622,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Book release this spring",
        "author": "EPCOpress",
        "url": "https://www.reddit.com/r/scifi/comments/yzzs3y/new_book_release_this_spring/",
        "text": "[removed]",
        "created_utc": 1668936066,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Man Who Lived Forever",
        "author": "TheTypeSetter",
        "url": "https://medium.com/the-inkwell/the-man-who-lived-forever-857e3ea860ab?sk=e0bf46dd403e0e0d0bccd6cae240e56e",
        "text": "",
        "created_utc": 1668920782,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMAZON GREAT DEALS",
        "author": "Glum-Willow-384",
        "url": "https://www.reddit.com/r/scifi/comments/yzvbud/amazon_great_deals/",
        "text": "[removed]",
        "created_utc": 1668919440,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMAZON GREAT DEALS",
        "author": "Glum-Willow-384",
        "url": "https://www.reddit.com/r/scifi/comments/yzvbdx/amazon_great_deals/",
        "text": "[removed]",
        "created_utc": 1668919395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books that are like Mass Effect?",
        "author": "UrTheReasonBidenWon",
        "url": "https://www.reddit.com/r/scifi/comments/yzuy0o/books_that_are_like_mass_effect/",
        "text": "I will soon be finishing the Expanse series and I’m looking for a new series of books to start. Are there any series out there that are like the mass effect games? Extremely high level of technology, not quite utopian but not dystopian either,  or maybe some planets are utopian while others are dystopian. Lots of different intelligent alien species, etc.",
        "created_utc": 1668918112,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 post karma",
        "author": "YouTubeMalware",
        "url": "https://www.reddit.com/r/scifi/comments/yzuelk/10_post_karma/",
        "text": "[removed]",
        "created_utc": 1668916301,
        "upvote_ratio": 1.0
    },
    {
        "title": "What If Everything Was True? Crash The System",
        "author": "DryAnteaterEatingAss",
        "url": "https://tubitv.com/series/300009271",
        "text": "",
        "created_utc": 1668909786,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] I co-wrote and produced a sci-fi original podcast -- Subterra",
        "author": "stevekrueger",
        "url": "https://www.reddit.com/r/scifi/comments/yzrdnp/sps_i_cowrote_and_produced_a_scifi_original/",
        "text": "It was created out of the boredom of being in lockdown and now has two seasons! TV's Kyle Bornheimer (\"Agent Carter\", \"Avenue 5\") makes an appearance! \n\nIt follows Ace, an orphan living in a massive underground bunker. Blind from birth, he's a scavenger in the lower depths. And he's spent his entire life in Subterra: A self-contained environment built to house humanity after the air has turned to poison.\n\nBut Subterra is far from a utopia and is ruled by a cruel 'royal' family and is filled with violent police, mutant underground creatures, and a caste system designed to dampen the human spirit.  \n\nAce builds a robot dog to help him climb his way to the surface. He wants to finally be free of Subterra and see the sun that's he's only heard about from books. \n\nNo one has been on the earth's surface in 40 years... What is waiting for Ace (and Hazel, his robot dog) when finally steps out of Subterra...?\n\n&amp;#x200B;\n\nTwo seasons available:  [https://link.chtbl.com/UTQn7QX\\_](https://link.chtbl.com/UTQn7QX_)",
        "created_utc": 1668906672,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Humans are Weird - Distraction",
        "author": "Betty-Adams",
        "url": "https://www.reddit.com/r/scifi/comments/yzr1qk/sps_humans_are_weird_distraction/",
        "text": "#  \n\nhttps://i.redd.it/pnfogcqq701a1.gif\n\n# Humans are Weird – Distraction\n\nOriginal Post: [http://www.authorbettyadams.com/bettys-blog/humans-are-weird-distraction](http://www.authorbettyadams.com/bettys-blog/humans-are-weird-distraction)\n\nSecond Father drew in a long calming breath and fleetingly touched a mental antenna over the situation. Fourth Aunt was tending to the injuries with full competence, and if she was snipping out reprimands as fast as she was applying membrane spray there was no doubt the young one she was tending needed a bit of discipline. There were no serious injuries, thank the Mother for that, and the tangy scent of panic and fear was fast fading from the air around him even if it still permeated his membranes. The afternoon sun was slanting down through the canopy overhead and he calculated that the human children had had time to walk back to their own hive and First Grandfather would be on his way back. Second Father activated his comm unit and sent out a general ping on the adult frequency and then walked with a tired step towards the hive hearth.  \nBy the time he arrived in the arched center of their hive Second Grandmother and Second Grandfather were already sitting on the central couch quietly chatting as they groomed each other’s antenna. They were lucky to have both of them in the hive at any time and he was grateful that they were here. Second Father curled his antenna at them respectfully and sat down on a perch some distance from them. He was fairly certain that First Mother would not attend. She was too close to laying soon, but Second Mother should be here soon and he was eager to taste his mate’s pheromones on the air. One by one the most competent members of the older generations came in and took up their places. As the light from the day outside faded the glow-nodules that stood out everywhere a set of roots crossed began to brighten the room. Second Mother arrived and flicked an antenna at him, but took a place within a cluster of Aunts. Finally First Grandfather entered and made a show of shaking the sand off of his bootings before taking his place in the center of the cluster. Triangular heads tilted and antenna perked as the attention of the room focused on the last comer. However First Grandfather only turned his head pointedly at Second Father.  \n“Do you care to share what you know?” First Grandfather asked as the attention refocused on Second Father.  \n“It is my consideration that Human Friend Second Father Brice be removed from the certified care list at community activities,” Second Father said firmly.  \nHe could tell that First Grandfather did not like the abrupt introduction and there was a general susurration of shifting limbs and a few frills were tightly pressed to their necks in scandalized surprise. The movement increased as it generally sank in that there would be no explanation or defense until the consideration had been approved. Second Father knew that it was somewhat presumptuous of him to do this in First Father’s absence, but they were all keenly aware that the actual heads of the hive would be too busy stringing new egg lines in the garden for days to deal with the situation. There was a little discussion as the adults considered his words, most of it being questions about what had set him off and reminders that he was a very competent Second Father even if he wasn’t First Father, but finally the voices stilled and all antennas and frills showed respectful agreement, if they were a little tense with curiosity.  \n“First Grandfather,” Second Father began after acknowledging their acquiescence, “would you please share the beginning of the story with our hive?”  \n“I was napping out in the east arbor,” First Grandfather began, “when I heard the sound of something large approaching through the underbrush.”  \nThe was a flutter of surprise and unease in the audience at that and First Grandfather held up a restraining hand.  \n“It was simply First Sister returning from her play time with the human children,” he quickly explained, “though I admit, I was concerned about local predators at first.”  \n“But she went with a handful of cousins!” a voice excliamed.  \n“Why were they coming through the underbrush?” Demanded Second Mother.  \n“How, were they coming though the underbrush?” called out a second voice.  \n“Didn’t that tear up their membranes?” asked another.  \n“Human First Brother explained that he was trailblazing to make sure she wasn’t injured,” First Grandfather explained quickly. “And he succeeded to some degree. Where he failed Fourth Aunt is treating the injuries. The human himself was rather severely scratched up in the process, though it was difficult to tell how much was from the underbrush and how much was from his previous activities. As to why…”  \nFirst Grandfather heaved a large sigh and his antenna were twitching between annoyance and amusement.  \n“I will let Second Father take the story from here as he interrogated the children after I procured first aid for them both.”  \nSecond Father accepted the shift in attention and flexed his psudo-frill in preparation.  \n“Once the human hiveling was receiving medical care I began asking First Sister for an explanation,” his antenna flexed in rueful admiration, “she was reluctant to offer any information despite having fairly severe abrasions and laceration. However when the human First Brother saw me speaking to her he ran forward, grabbed her hand, and stated that it was his fault-”  \n“What was his fault?” someone asked.  \n“Human First Brother was not clear on that at first,” Second Father said. “On inquiry he explained that it was his idea to ‘sneak’ through the underbrush because it was a shortcut. At this point First Sister asked him about avoiding the attention of Human Second Father Brice and Human First Brother changed color a bit and admitted that that was a consideration too. I asked them why they were avoiding Human Second Father Brice and First Sister offered the information, very primly, that she had determined that she didn’t want to disturb a Father with minor injuries and just wanted to come home.”  \n“What injuries?” Second Mother demanded, “I thought they got the abrasions in the underbrush on the way home?”  \n“Just so,” Second Father went on with a grim set to his mandibles, “this was when Fourth Aunt pointed out to me that there were two distinctly different types of abrasion on both First Sister and Human First Brother. The rough lacerations from their trek through the underbrush, and a finer, denser abrasion below it. When I pressed on how the first injury happened First Sister admitted that she had been taking lessons from Human First Brother in something she called skateboarding.”  \nThere was a general murmur of confusion and Second Father braced himself to translate Human First Brother’s enthusiastic and disjointed account of what a skateboard was. From the resulting looks of confusion and horror in his family’s responses he had at least communicated all he knew.  \n“According to both First Sister’s and Human First Brother’s accounts, everything went well until they attempted joint maneuvers with two boards. First Sister could not gain enough momentum with her own feet so Human First Brother offered to gift her some of his momentum.”  \nThe was a collective wince as the twist in the story vine grew more visible.  \n“This too went well until the wheels, neither is quite sure whose, hit a bump,” Second Father went on. “First Sister began to topple, and might have righted herself, but Human First Brother was afraid she would hurt her joints so he pulled on her kilt to counterbalance her. Neither quite remembers what happened next but they both agree they went skidding down an adjacent slope together. Fourth Aunt assures me that First Sister’s injuries are minimal all elements considered. Apparently Human First Brother managed to keep her from contact with the ground for most of the fall.”  \n“She would have managed to right herself if he’d left her alone,” came a grumble.  \n“No doubt,” Second Father agreed, “but he didn’t know that and it was quite selfless of him to do what he did.”  \n“Why didn’t they just go straight to Human Second Father Brice after that?” a voice demanded.  \n“And that loops the vine around the point,” Second Father said drooping with a sigh. “Apparently Human Second Mother Brice had preemptively forbidden all skateboard play with our hivelings due to what she saw as obvious dangers and had instruction her mate to enforce these restrictions. Rather than return to his father and risk direct censure Human First Brother decided it was best to escort First Sister to her hive as quickly as possible.”  \nThere was a rustle of tossed heads as a current of half-irritated, half-amused understanding ran through the gathered adults.  \n“Speaking of Humans Second Father Brice,” Second Mother demanded. “What was he doing this entire time?”  \nSecond Father reached up to rub his head with a sigh.  \n“Offering history stories to the rest of the hivelings who went over with First Sister,” Second Father said.  \n“Yes,” First Grandfather said with some surprise in his voice, “he was still telling the story of the human victory on the itinerant ice world when I brought Human First Brother back to him. How did you know?”  \n“First Sister explained that they had needed to distract Human Second Father Brice before they could sneak off to play on the skateboards,” Second Father explained.  \n“So he was at least attempting to enforce it,” a voice observed.  \n“Yes,” Second Father agreed, “Human Second Father Brice is quite strict about rules enforcement for the most part. However Human First Brother assured her that that would not be an issue. He then asked her to prompt one of the hivelings who spoke the human language to request a story. They then waited for Human Second Father Brice to, and I quote the human child here, ‘get properly into to’, at which point the adult human was so distracted that he did not notice the two of them sneaking off.”  \nThe hive hall resounded with reproachful clicks as the gathered adults considered, and condemned this weakness.  \n“Well,” Second Mother said with a decisive click. “Such an irresponsible human should not be approved to watch the hivelings!”  \nThere was a general murmur of agreement as the gathered adults accepted the new social restriction. The task was over and almost immediately the various individuals began to drift away until only Second Mother and First Grandfather were left with him.  \n“So Pretty One,” First Grandfather began, reaching over to rest a hand on Second Father’s shoulder, “What do you think of Human First Brother’s story?”  \nSecond Father fought down a wince at the nick name that dated back to his first days in the hive and pointedly ignored the amused tilt to his mate’s antenna.  \n“What about his story?” Second Father asked.  \n“Could a grown human, and a father at that,” First Grandfather asked, “really get so distracted by a question of a story that he looses track of his own offspring?”  \n\n\nhttps://i.redd.it/dfnp1zax701a1.gif\n\n# Book avalaible at! [Amazon! ](https://www.amazon.com/dp/B09NN2PM8D?binding=paperback&amp;ref=dbs_dp_rwt_sb_pc_tpbk)[Barnes &amp; Noble](https://www.barnesandnoble.com/s/%22Betty%20Adams%22;jsessionid=CEE1DC5396DEB62D43FEFC724630F686.prodny_store02-atgap01?Ntk=P_key_Contributor_List&amp;Ns=P_Sales_Rank&amp;Ntx=mode+matchall)[Powell's Books](https://www.powells.com/book/humans-are-weird-9798588913683?partnerid=32322)[Google Play Books](https://play.google.com/store/books/author?id=Betty+Adams)[Kobo By Rakuten](https://www.kobo.com/us/en/search?query=Humans%20are%20Weird&amp;fcsearchfield=Series&amp;seriesId=a035ce04-e582-5fcc-b327-16c68ca4b418)",
        "created_utc": 1668905706,
        "upvote_ratio": 1.0
    },
    {
        "title": "My entry to Mission to Minerva - KitBash3D Challenge",
        "author": "Toshe083",
        "url": "https://www.reddit.com/gallery/yzq6dh",
        "text": "",
        "created_utc": 1668903134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Red Mars vs. Revelation space.",
        "author": "Potential_Minute_409",
        "url": "https://www.reddit.com/r/scifi/comments/yzpwhc/red_mars_vs_revelation_space/",
        "text": "I put holds on these two books at the library and got them both at the same time, I may only have time to read one, which should it be. I’m rather new to the genre but enjoyed the final architecture series and loved the remembrance of earths past books.",
        "created_utc": 1668902351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surprised by Chaos Walking (Film)",
        "author": "humphrey_horse",
        "url": "https://www.reddit.com/r/scifi/comments/yzp36v/surprised_by_chaos_walking_film/",
        "text": "Just stumbled across the movie on Netflix. Had heard nothing about it at all, which I thought strange given the actors involved. I really liked it. I thought the visualisation of the Noise was great. Nice to find something unexpected like that.",
        "created_utc": 1668900042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Astrology News Weekly Report Nov 21st to 27th 2022",
        "author": "Astrology_News",
        "url": "https://youtu.be/wIAN5XLx1as",
        "text": "",
        "created_utc": 1668899390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Futurisms",
        "author": "Ultra_Amp",
        "url": "https://www.reddit.com/r/scifi/comments/yzocnw/futurisms/",
        "text": "So one aspect of scifi I've been really getting into is futurisms of various cultures. For example, Wakanda is the example of Afrofuturism. I've been attempting to find more examples such as Indofuturism, but I've been struggling. So I was wondering, what other types of futurisms have you guys found in sci fi?",
        "created_utc": 1668898051,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] My unsuccessful quest for love in the sci-fi community",
        "author": "AlbertSemple",
        "url": "https://albertsemple.com/collections/humour/ScienceFiction",
        "text": "",
        "created_utc": 1668896321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creative ways dinosaurs were brought back?",
        "author": "curtis-sch",
        "url": "https://www.reddit.com/r/scifi/comments/yzmt68/creative_ways_dinosaurs_were_brought_back/",
        "text": "For the past week, I've been pondering on this question, to find something that hasn't been done to bring back dinosaurs. To start, I made a list of things I know have been done: Cloning, time travel or experiment gone wrong, lost land/center of the earth, super intelligence and escape earth before extinction, alternate reality, aliens that happen to look like dinosaurs, virus to make dinosaurs come from a chicken/people. I'm curious if anyone here has any different or creative ideas that I haven't thought of. If this isn't the right sub, please let me know!",
        "created_utc": 1668893817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love the Bobiverse books but man are they short. Book 3 doesn't even hit the 8 hour mark on audible.",
        "author": "occasionalskiier",
        "url": "https://www.reddit.com/r/scifi/comments/yzlvyg/love_the_bobiverse_books_but_man_are_they_short/",
        "text": "Just a bit of a rant lol. I really am enjoying them but honestly hesitated at using a credit to get the third book. At 7 hours 52 minutes I have NEVER used a credit for such a short book. Book 2 was only 9 hours, and I can't help but feel that 2 and 3 should/could have been one book but they milked it a little.\n\nMy last fantasy binge was Malazan and the final book is like 45 hours lol. Great value for a credit and a fantastic book. The thrifty person in me aches to spend money on something so short. Its actually why i held off for so long despite hearing great stuff. Bobiverse is really entertaining though so I guess there is that. Just normally never spend credits on novellas.\n\nAnyway, just venting while I ruminate on getting the third book right now. Any other books that are almost TOO Short but sweet? Flowers for Algnernon comes to mind but even that is 9 hours listen time lol.",
        "created_utc": 1668891375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Custom ranked award search website",
        "author": "SpaceTraderYolo",
        "url": "https://www.reddit.com/r/scifi/comments/yzlsny/custom_ranked_award_search_website/",
        "text": "I recall a long time back having used a website where you could specify multiple award weights and it would return you a ranked list of the winners.  For example 30% Hugo, 30% Nebula, 20% world Fantasy and  20 % BSFA.\n\nAnyone knows of it or a similar site?",
        "created_utc": 1668891124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solar Shinobi Part 1",
        "author": "HauntedGenin",
        "url": "https://v.redd.it/49rxudes07w91",
        "text": "",
        "created_utc": 1668888570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help identify a story",
        "author": "Think-Vacation8070",
        "url": "https://www.reddit.com/r/scifi/comments/yzk5hh/please_help_identify_a_story/",
        "text": "My memory-bog blurped out a fragment of something I'm interested in identifying, if anyone can help.\n\nIt's a SF story (or possibly novel?) with a scene where a star/god is on trial (could be Betelgeuse but I'm not sure). Long ago and far away, a science fiction instructor brought it up because it described the scene with some great, completely made-up terms that the reader had no trouble imagining. \n\nWe didn't read the whole thing, and what I remember is not enough for a search. I know it's a long shot, but this seems like the place to ask. Thanks!",
        "created_utc": 1668886694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to share my most fav one!!",
        "author": "BetterAdvertisind",
        "url": "https://i.redd.it/fjtvp19yjy0a1.png",
        "text": "",
        "created_utc": 1668885528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repent Harlequin, Cried the Ticktockman",
        "author": "Voyage_of_Roadkill",
        "url": "https://youtube.com/watch?v=h3BzT0JYx9Y&amp;feature=share",
        "text": "",
        "created_utc": 1668884252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Other names for the Earth that isn't Terra",
        "author": "FakeRedditName2",
        "url": "https://www.reddit.com/r/scifi/comments/yzijov/other_names_for_the_earth_that_isnt_terra/",
        "text": "In so many stories when the writers want to give earth a more 'distinct' name the end up calling it Terra, but what are some other names that other settings use? \n\nMidgard is one option that you don't really see all that much outside of anything slightly dealing with Norse mythology, Sol-3 is another in reference to the name of the Sun and the order of planets, but what else?",
        "created_utc": 1668882500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life Sign Detection in scifi media",
        "author": "AERegeneratel38",
        "url": "https://www.reddit.com/r/scifi/comments/yzhjjz/life_sign_detection_in_scifi_media/",
        "text": "Most SciFi media, at least among what I remember to have read/watched, have glossed over the \"life sign detection\" part. It's usually just using a ship to detect life signs on a planet and to which the ship's AI replies with the answer or a conversation in which the science guy just says \"no life signs detected\" or \"life signs detected\", smth along the lines of that. \n\n&amp;#x200B;\n\nIs there any work that dives deeper into the actual process of it? Not the extremely detailed science, but at least mentions the number of processes around it.  \n\nLike for example, let's say they got an unknown indestructible object which looks like an egg. How would they search for life in that thing? Heat signature? X-rays or MRIs? Want to read how a scientist/biologist or a group of them would approach this sort of scenario",
        "created_utc": 1668879907,
        "upvote_ratio": 1.0
    },
    {
        "title": "New(ish) Sci-Fi Webcomic We've Been Working On: The Space Between. It's About Bureaucracy, Longing, AND SO MUCH MORE. Just Uploaded Page 6 Yesterday!",
        "author": "ScaryWaves",
        "url": "https://thespacebetween-comic.com/",
        "text": "",
        "created_utc": 1668878670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saturday self-promo",
        "author": "cosmicfreethinker",
        "url": "https://youtube.com/shorts/5dLI_DgeBEY?feature=share",
        "text": "",
        "created_utc": 1668878455,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Metal is a comic where galactic emperor Elias finds his consciousness trapped in a metal body, forcing him to overcome impossible odds to reclaim his throne (first issue is free)",
        "author": "KodyCQ",
        "url": "https://globalcomix.com/c/metal/chapters/en/1/1?utm_medium=social&amp;utm_source=reddit&amp;utm_campaign=GC_metal_111922&amp;utm_term=r-scifi",
        "text": "",
        "created_utc": 1668877991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Galaxy Science Fiction 1955",
        "author": "Christopher4162Ie",
        "url": "https://i.redd.it/zwkiz259dz0a1.jpg",
        "text": "",
        "created_utc": 1668877417,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SciFi Meme] Art: Donato Giancola / cover image, Lightspeed Magazine / March, 2011",
        "author": "CliffTheAlien",
        "url": "https://i.redd.it/v31nn0kkvx0a1.jpg",
        "text": "",
        "created_utc": 1668877324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone watch the new Netflix series 1899 ? How is it ?",
        "author": "ajtheshutterbug",
        "url": "https://www.reddit.com/r/scifi/comments/yzgiiu/did_anyone_watch_the_new_netflix_series_1899_how/",
        "text": "",
        "created_utc": 1668877228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Queer dark sci-fi debut, The Stars In Their Eyes (Giveaway + Sale)",
        "author": "LelainaP",
        "url": "https://www.reddit.com/r/scifi/comments/yzfped/queer_dark_scifi_debut_the_stars_in_their_eyes/",
        "text": "[removed]",
        "created_utc": 1668875103,
        "upvote_ratio": 1.0
    },
    {
        "title": "LEGO Stargate needs your vote!",
        "author": "Captain_Mutant",
        "url": "https://www.reddit.com/r/scifi/comments/yzf0i6/lego_stargate_needs_your_vote/",
        "text": "Hello!\n\nI've designed a Stargate out of LEGO, at the right scale for minifigures.\n\nIf enough add their support via the link below, it might become an official set which you could then buy!\n\nCheck it out! (an update is planned for when it gets to 75%)\n\n[https://ideas.lego.com/projects/075d3c43-d693-4373-a55f-33a12492577d](https://ideas.lego.com/projects/075d3c43-d693-4373-a55f-33a12492577d)\n\n&amp;#x200B;\n\n[Jack and Sam, after another successful mission!](https://preview.redd.it/r88s2glajx0a1.jpg?width=3738&amp;format=pjpg&amp;auto=webp&amp;s=65e7d7f6c86581ba8e2552689811ff8b7183c5df)\n\n[Teal'c, Sam, and older Jack, and Jonas, with two Jaffa guarding the gate, and a MALP](https://preview.redd.it/qjjn8flajx0a1.jpg?width=3738&amp;format=pjpg&amp;auto=webp&amp;s=6c7aecc8922273d64d70d7c59383c5f73f34b28c)\n\n[The team as they were in Season 8, with Schrodinger :\\)](https://preview.redd.it/t6l7relajx0a1.jpg?width=3738&amp;format=pjpg&amp;auto=webp&amp;s=c9a4b9ceae4db556f29d43bf7346618c4bd46a17)\n\n[The team, from Season 7](https://preview.redd.it/crr1tflajx0a1.jpg?width=3738&amp;format=pjpg&amp;auto=webp&amp;s=6e9d6f4eee259190af92d0b4e3614a816c78d5f2)",
        "created_utc": 1668873292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me find the name of a show on the Scifi channel?",
        "author": "Clairety1992",
        "url": "https://www.reddit.com/r/scifi/comments/yzeyl4/can_someone_help_me_find_the_name_of_a_show_on/",
        "text": "[removed]",
        "created_utc": 1668873144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robots, Rockets and Rayguns",
        "author": "KamilahPhilbrick",
        "url": "https://www.reddit.com/gallery/yzep3g",
        "text": "",
        "created_utc": 1668872455,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] The Book of Constellations is a down-to-Earth SciFi audio drama about an alien on Earth fighting the same insidious Darkness that claimed his people. Listen for free on your favorite podcast apps. More info in the comments. Here's a taste:",
        "author": "LiminalMask",
        "url": "https://v.redd.it/dzfktwsmcx0a1",
        "text": "",
        "created_utc": 1668871086,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SciFi Meme] Art: Donato Giancarlo / cover image, Lightspeed Magazine / March, 2011",
        "author": "CliffTheAlien",
        "url": "https://i.redd.it/hxz23nmp9x0a1.jpg",
        "text": "",
        "created_utc": 1668869969,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Jar Jar Binks Made Me a Writer",
        "author": "InkIcan",
        "url": "https://www.reddit.com/r/scifi/comments/yzdgx1/sps_jar_jar_binks_made_me_a_writer/",
        "text": "Would you like to hear the story of how Jar Jar Binks turned me into a writer? It’s true! It’s fair to say that the Thrawn Series by Timothy Zahn and the awful Star Wars movies that followed are the reason I decided I must / should write. Call it fate, call it artistic envy, my journey toward being a professional author began back in the late 90s with the Thrawn Series by Timothy Zahn and Jar Jar Binks.\n\nBack in the early 90s, as a Xennial high school kid who loved all things Star Wars, I was captivated by Heir to the Empire as the first, genuine piece of Star Wars fiction that felt like a worthy addition to Episodes IV, V, and VI. Zahn had the right level of character development, pathos, pacing, action. He got what Star Wars was about, and he wrote a story for all of us who got what Star Wars was about.\n\nTHEN EPISODE ONE HAPPENED.\n\nIn the run-up to Episode One, like many other geeks I was prepared to wait my turn. Lucas wanted to do the prequels, okay. If they’re anything like these amazing Zahn novels, I told myself, then I’m sure they’ll no doubt set up the brilliant story arc that will conclude with the sequels that Zahn was obviously writing. That was my expectation.\n\nComing out of the theater – after three hours of ho-hum dialog, uneven pacing, obvious over-reliance on CGI to cover up the tissue-thin story and ye gods, Jar Jar Binks. We all know where we were the first time we saw Jar Jar Binks.\n\nI talked myself down. “Okay, okay – he’s doing this to please the younger kids. He’ll get it right eventually. We had twenty years to wait, it’s unrealistic to expect everything to meet my expectations.” Settle in, find your tribe, things are gonna be okay!\n\nThree years passed between Episode One and Episode Two. I bit my teeth while the Star Wars fandom split into two factions – George Lucas could do no wrong, and George Lucas could do nothing right. Nothing made sense. My world had been shaken – everything I had believed about the superiority of Star Wars over Star Trek (which, let’s face it, has been an ugly cash grab since the 70s with all those god-awful tie-in novels by James Blish … but that’s another argument) was gone.\n\nThe more I tried to make sense of it, the more confused I got. Episode Two will be better, I told myself. It’s grittier, more action-packed, reviews said it was better than Episode One. Be cool, it’s gonna be okay.\n\nTHEN EPISODE TWO HAPPENED.\n\nI felt like an idiot, walking out of the theater. No, no … my earlier concerns were justified. These movies were just … not good. They weren’t entertaining, they weren’t compelling, they weren’t fun. The ridiculously overwrought love story between Padme and Anakin looked as forced as the acting by otherwise-competent professionals. Poor Haydn Christensen looked like he was getting a Force proctology exam. Natalie Portman in a variety of sexy outfits could not evoke the same level of sexual tension as Carrie Fisher and Harrison Ford in a greasy motor pit (The Falcon in Empire … the kissing scene).\n\nThere are other problems, too (continuity errors, the story revolving around the same people) I’m not re-hashing everything wrong with Episodes One and Two – you know what they are, I know what they are. Other people have spent more time and energy (looking at you, People vs. George Lucas ) on breaking down what went wrong with those movies.\n\nThe point is, I came away from the Zahn series *knowing* what good writing looked like and I felt incredibly cheated that the rest of Star Wars threw that energy in the toilet. But I also came away from the Episodes One – Three experience going “We deserve better.” We deserved better, right? I spent countless hours debating and arguing why Star Wars had lost its way.\n\nBut there were no answers. No matter what, I could never bridge the divides between the different factions of SW fandom and I could never rationalize continuing to love something that obviously didn’t love me. What am I supposed to do now, I asked. Sure, I could scream about this online for the next twenty years, but what would that change? Star Wars would still suck.\n\nTHEN IT HIT ME \n\nAbout the same time, I read Stephen King’s “On Writing” and he says something profound that reflects the conclusion I drew from the blood, sweat, and tears. “Most writers can remember the first book he/she put down thinking: I can do better than this.” For me, that was Episodes One through Three.\n\nIt was time for me to get out of the universes that I no longer fit into. It was time to begin creating my own universes to explore and share. If people could enjoy writing as bad as Episodes One, Two, and Three, then they would *love* the stories I tell. Then I sat down and began to write.\n\nThe journey from 2003 until now, well that’s another story. But I wanted to tell you this part. Every writer gets their start through inspiration, for me inspiration came in the form of a ridiculous sock-puppet CGI monstrosity that should have been stepped on by the first Bantha it came across. This is the story of how Jar Jar Binks turned me into a writer.\n\nThought you’d like to know how much the Thrawn Trilogy influenced me as a person. Timothy Zahn showed me the path, but George Lucas made me want to travel it – if for nothing else than to prove to myself it could be done.\n\nI’ll tell the rest of the story later.\n\nOriginally posted on https://inkican.com/jar-jar-binks-turned-me-into-a-writer/",
        "created_utc": 1668869130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attended a sell-out book launch for a debut novel recently, but is it scifi or just... fi? I think it's scifi!",
        "author": "saladbeans",
        "url": "https://www.fairlightbooks.co.uk/the-fish/",
        "text": "It doesn't have to have spaceships or be in the far future, right?",
        "created_utc": 1668868871,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Stars Are Ours (retro synth music)",
        "author": "apeloverage",
        "url": "https://www.reddit.com/r/scifi/comments/yzddbb/the_stars_are_ours_retro_synth_music/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/z4e1q9ub6x0a1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=c6a7ae5f7f72b0b6dcf888a6fc0eb1c62c586243\n\n[https://youtu.be/LAFXq0wLvHk](https://youtu.be/LAFXq0wLvHk)",
        "created_utc": 1668868840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations: Illuminae Files",
        "author": "rblaha1",
        "url": "https://www.reddit.com/r/scifi/comments/yzd9rv/book_recommendations_illuminae_files/",
        "text": "I just finished all three books in the Illuminae Files by Amie Kaufman and Jay Kristoff and wanted to see what other people on this subreddit thought about them only to find that no one was talking about them. I think this is a problem that must be fixed immediately because these books are amazing. These books have everything you could ever want from a Sci-Fi series from artificial intelligence to ship schematics to brain eating parasites. Not to mention that the story is told in the most unique way I have ever experienced. If you have not checked out these books, I would highly recommend. If you have read these books, let me know what you thought.",
        "created_utc": 1668868565,
        "upvote_ratio": 1.0
    },
    {
        "title": "We create long form AI-generated stories with live music, performances and art! This week, we created a space-age mythology deep in the space between galaxies!",
        "author": "HylianLibrarian",
        "url": "https://youtu.be/VYTjJYEeqd4",
        "text": "",
        "created_utc": 1668868205,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] The Dechronization of Sam Magruder - A Review of a Dinosaur Fantasy",
        "author": "ArthursDent",
        "url": "https://www.reddit.com/r/scifi/comments/yzcqs0/sps_the_dechronization_of_sam_magruder_a_review/",
        "text": "[deepdarkspace.wordpress.com/2022/11/17/the-dechronization-of-sam-magruder-is-the-dinosaur-fantasy-you-need-to-read/](https://deepdarkspace.wordpress.com/2022/11/17/the-dechronization-of-sam-magruder-is-the-dinosaur-fantasy-you-need-to-read/)",
        "created_utc": 1668867062,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Alien necromancer I drew.",
        "author": "okvl_artist",
        "url": "https://i.redd.it/a79nkxgzyw0a1.png",
        "text": "",
        "created_utc": 1668866665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artemis I Has A Stowaway - Day 4 of a semi-fictional mission log",
        "author": "AuthorNathanHGreen",
        "url": "https://www.reddit.com/r/scifi/comments/yzcgn8/artemis_i_has_a_stowaway_day_4_of_a_semifictional/",
        "text": "November 19th, 2022\n\nI probably should have been telling you about the moon.  \n\nEver buy one of those “gardening for idiots” kits where you just take it home, add the exact amount of water shown on an included plastic measuring cup, then watch in amazement as a little green shoot get bigger every time you look away?  That’s kind of like what it was like watching the moon get bigger.  And bigger.  And bigger.  \n\nThere are four really big days on the mission calendar.  The first was launch.  The last is “landing”, or as I like to call it, ‘finding out just how smart those folks in heat shield design really are’.  But between those two you’ve also got entry into lunar orbit and exit from lunar orbit.  Entry is coming up.\n\nNow look, you don’t stow away on a spaceship and spend the rest of your life in jail (actually saying that phrase aloud kind of puts a cold lump in my stomach.  I am probably going to have to ask Mark to get me a lawyer and give me an estimate on the damages for all this).  Anyways…  You don’t do that without absolutely, annoyingly, “Alex, you’ve got to stop talking about space!”, loving this stuff.\n\nAnd lunar insertion is really, really, cool.  Imagine that NASA is some kind of famous sharpshooter.  To pick one famous example at random: the hunter Orion.  And Orion takes an arrow from his belt, points up at the moon, and fires.\n\nFor five days that arrow flies straight up towards the moon, or more accurately, where the moon is going to be, but Orion’s not trying to actually hit the moon.  No, that would be too easy.  Orion’s real target is just off to the moon’s side, so that the arrow passes into the exact right window for a powered flyby and entry burn.\n\nAn accountant would appreciate the game NASA’s playing.  Artemis I only has so much fuel onboard and it’s all about the best lunar orbit to require the smallest change in energy to enter, and exit, it.  Changing velocity to enter, or exit, an orbit kind of sucks from a fuel use perspective.  But what would really, really, “uh we don’t have enough fuel to do this and are going to die in space” suck, would be missing our marks and having to change position as well.  \n\nHow close did Orion have to be to hit its marks in space six days away from him?  If you imagine a regular arrow range, and you imagine that Orion had an arrow the width of a human hair, and he was aiming for a bullseye the size of a grain of sand, that would be about fifty times easier a shot to make than this one.\n\nIn fairness to Orion in this competition - NASA cheated and used a few correction burns along the way.  In fairness to NASA, they haven’t been very big correction burns.\n\nSo, what happens when that “powered flyby burn” hits the day after tomorrow? I’ll strap into my seat to get ready for the nine-g acceleration.  Just kidding.  You’ve seen Neil Armstrong bouncing around on the moon, right?  That’s the moon’s gravity on the surface, those are the kinds of forces we’re working with.  You try for a hair-on-fire flyby and the slingshot’s rope breaks and you fly off into space.    \n\nPeople always over-estimate how much force is required to do things in space.  A half an hour of nice slow, sub 1-g acceleration has a bigger impact than a minute of blackout inducing, 9-g madness.  \n\nNASA’s doing their best to keep me busy, but I can only check so many readouts before this little voice in the back of my mind starts yammering away.  I wonder if I could ask Mark to find out what Jess thinks about this whole thing.  I mean look, I can guess what she thinks.  Her ex has gone off and done exactly the kind of thing she thought was dumb, only this time he’s gotten himself into a world of trouble.  But it is a little impressive right?  She probably wouldn’t admit that to Mark though.  \n\nMaybe I could give her a call or write a letter.  I think I need a distraction.  Dinner time.\n\nI’m starting to regret not just packing butter.  I hate everything about chocolate bars.  They’re too sweet, they make my teeth ache, and they’re just calories that do nothing for you.  \n\nLook, I get it, no one wants a lecture on their diet.  I swear this isn’t some hippie mumbo jumbo about kombucha or whatever the hell.  I’m an aerospace engineer and I think like one.  So what’s the engineering approach to food?  \n\nFirst you identify your objectives, 1. All the calories and nutrients you need.  2. The alleviation of hunger.  3. Taste.  Now you impose your constraints on those requirements:  A. Money.  B. preparation time.  C. limiting calories to daily requirement.\n\nMy problem, on Earth anyways, with chips, and chocolate, and soda, was that they are way too calorie expensive.  I’ve got a 2K daily budget to work with and I could easily consume 500 calories a day of liquids that would do nothing to alleviate hunger.  Yeah, they taste nice, but there are three factors, and “junk” food gets 25% on the test.\n\nLeafy green vegetables get 66%, you can probably guess where they lose points.  But when you start playing with some veggie recipes - for example chop up cauliflower, add some olive oil, salt, and pepper, and bake at 350 for 19 minutes on parchment paper.  That’s reasonably tasty actually.  Overall score 85%\n\nSweet potatoes as well, same cooking instructions but this time cooked for 32 minutes, and damn…  93%.\n\nAnyways I attacked my diet as an optimization problem.  I figured out every food with an 80% or higher score, then priced them all out in terms of cash and calories, and bing bang boom, I had me a diet.  \n\nJess never got into the spirit of that system.  \n\nFor this mission I’d picked Skor bars (7%) because of their caloric density per gram.  But they are doing nothing to make me feel full. At least I’m not weak from hunger.\n\nI wonder what Jess is having for dinner.\n\n\\*\\*\\*\\*\\*\n\nI’m Nathan H. Green, a science-fiction writer with a degree in aerospace engineering, and I’m going to be doing daily semi-fictional stories tracking the Artemis I mission. You can follow along through my reddit (u/authornathanhgreen).\n\n*Artemis I Has A Stowaway* is a work of semi-fiction. All incidents, events, dialogue and sentiments (which are not part of the mission’s official history), are entirely fictional. Where real historical figures appear, the situations, incidents, sentiments, and dialogues concerning those persons are entirely fictional and are not intended to depict actual events, personality, disposition, or attitudes of the real person, nor to change the entirely fictional nature of the work. Save the above, any resemblance to actual persons, living or dead, events, or locales is entirely coincidental.\n\n© 2022 Nathan H. Green",
        "created_utc": 1668866277,
        "upvote_ratio": 1.0
    },
    {
        "title": "student love",
        "author": "pouma-tv2",
        "url": "https://youtu.be/4Ta089yN_lY",
        "text": "",
        "created_utc": 1668865643,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SPS] Wrote my first sci-fi book and it hit 158 Amazon reviews with 4.3 ave rating and a FakeSpot grade of A! Check it out if you’re looking for some new Sci-fi!",
        "author": "matthewgdick",
        "url": "https://www.reddit.com/r/scifi/comments/yzc13y/sps_wrote_my_first_scifi_book_and_it_hit_158/",
        "text": "I’ve been a lifelong sci-fi fan and I published the sci-fi story idea I had in my head for years. It has a similar spirit to books by Andy Weir and Dennis E. Taylor. For the audiobook, I even tried my best to find a voice actor that has a similar style to Ray Porter!  \n  \nHere is the back cover blurb:  \nWhat kind of person does it take to build a civilization from the ground up? In this fun, hard science fiction novel, astronaut Nick Burke will have to learn how to be a leader if he wants humanity to survive on a new planet…even if he is no longer a human himself.\nNick Burke dreams of successfully creating the first sustainable space colony in human history. After a third failed mission on Mars, Nick returns to Earth heartbroken. But during the trip home he has an epiphany caused by a near-death experience on how to truly accomplish his dream. Nick launches a billionaire funded startup company that solves the interstellar travel problem. Transporting people in a spaceship without any people aboard. After Nick lands on his new, distant planet, he has to combat his greatest trials yet including raising children and goats while becoming a colony building survivalist. Fans of Andy Weir’s The Martian and Dennis E. Taylor’s We Are Legion (We Are Bob) will find familiar themes of innovative science fiction ideas with plenty of humor and pop-culture.   \n  \nIt’s available as an e-book, paperback, and Audiobook. It’s also free with Kindle Unlimited. Check it out!  \n  \nIt’s called SEED by Matthew G. Dick  \n  \n[US/CAN Link](https://www.amazon.com/gp/aw/d/B097B8PWC2/ref=tmm_aud_swatch_0?ie=UTF8&amp;qid=&amp;sr=)  \n  \n[UK Link](https://www.amazon.co.uk/gp/aw/d/B097B8JZKX/ref=tmm_aud_swatch_0?ie=UTF8&amp;qid=&amp;sr=)  \n  \n[Australia Link](https://www.amazon.com.au/SEED-Science-Survival-Colonization-Leadership/dp/1735103519)  \n  \n[Germany Link](https://www.amazon.de/gp/aw/d/B097B8WZZN/ref=tmm_aud_swatch_0?ie=UTF8&amp;qid=&amp;sr=)  \n  \nThanks!",
        "created_utc": 1668864969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rescuers From Illur: A Dystopian Novel ✨ FREE Kindle Book ✨ November 16 – November 20, 2022",
        "author": "Cajahsr",
        "url": "https://www.reddit.com/r/scifi/comments/yzc071/rescuers_from_illur_a_dystopian_novel_free_kindle/",
        "text": "Rescuers From Illur: A Dystopian Novel \n\n[https://www.amazon.com/gp/product/B097CC9ZXK/](https://www.amazon.com/gp/product/B097CC9ZXK/)\n\n**When strangers come to an encampment with the promise of travel to a thriving society, a curious boy, who is an outsider among his people, has to be ready to leave behind the life he has made to go to a place he hopes exists.**\n\nVery few in the worn encampment even notice the boy they have known since birth. With feelings of not being liked or cared for, Edan spends his days exploring and only returns for meager shelter during the night. Believing he is fine on his own, the quiet boy has adapted to rely only on himself.\n\nStrangers arrive at a camp built around a structure that was long ago a wondrous house. They come on the heels of fear, but bring knowledge and the promise of travel to a thriving society. The possibility of prosperity within a world of hard work and nothingness would mean tremendous change for those living in the camp. Edan is wary, but interested in the strangers and soon connects with one who believes she is meant to save his people. As Edan's bond grows with the captivating girl, Vita, the strangers ready themselves to return to Illur with the people of the encampment.\n\nEven though he has every reason to go, it is a struggle for Edan to leave the only place he has known to travel somewhere he hopes exists. Trust is hard won for a boy who is used to being alone, but loyalty seems rooted in his soul. He wants to believe, for himself and all the others of his camp who wonder if they can find a better life in Illur.\n\nWhen the strangers come, will you go with them?",
        "created_utc": 1668864894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 18 of Sci Fi November",
        "author": "rowejl222",
        "url": "https://www.reddit.com/r/scifi/comments/yzazzi/day_18_of_sci_fi_november/",
        "text": "Today I watched two solid flicks: Pitch Black and Divergent",
        "created_utc": 1668861667,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long an interstellar journey will take (without phlebotinum) - may be interesting to hard SF writers",
        "author": "ValAslanyan",
        "url": "https://www.youtube.com/watch?v=7PT1jOK3Cmg",
        "text": "",
        "created_utc": 1668861120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drew Karpyshyn envisioned the Reapers as a Lovecraftian-tier threat",
        "author": "Aetius_Flavius",
        "url": "https://i.redd.it/uouh3jn0fw0a1.png",
        "text": "",
        "created_utc": 1668859654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Set in 2035, Foretold is a sci fi thriller short film about world's first self aware AI that is designed to \"end human suffering\"",
        "author": "kyrokomking",
        "url": "https://youtu.be/gQnINi_KhPI",
        "text": "",
        "created_utc": 1668850703,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Bestest Sci-fi Fantasy Adult-Animated series - Pantheon - Spoiler Free",
        "author": "VinDrawins",
        "url": "https://www.reddit.com/r/scifi/comments/yz7t45/the_bestest_scifi_fantasy_adultanimated_series/",
        "text": "**I think this is one of the best-animated series I ever watched 😲**. The story is so grounded and also relatable that you can easily compare it with the real world. Literally, there is a character inspired from the real world 😂 (you will understand once you watch it) which is definitely a surprise for the Indian audience 🤣. \n\nhttps://preview.redd.it/p4of23ckjv0a1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=2cc0635b4e311a295698d5aaab5286566ed146d4\n\nI mean the concept of the series is amazing but also the twist in the storyline is unpredictable and on top of that the animation style 👌. I liked the animation style they picked for this type of story, kind of reminds me of *Ben 10: Alien force* 😍. Which is best for adult-fantasy-fiction stories. And...Oh maaann, all the music used in this series adds another level of depth. My favorites are \"*Man or Monster*\" by Sam Tinnesz ft. Zayde Wolf, \"*Don't Dream It's Over*\" by The Rescue and GRMLN's \"*27 Kids*\".\n\nSome scenes are crazy to imagine, like how you will visualize the internet world. To make it believable, they used a fantasy theme, I loved that. Definitely, makers took advantage/freedom of using 2D animation. Also the reference to the cult classic anime movie \"*Ghost in the shell*\"... was cool 😅\n\nThe best part of this series is the story. It tells about death, mortality, UI (way more powerful than AI), and cloning, it's just crazy 😳. The story is based on short stories written by *Ken Liu*. After watching this series and the \"*Good Hunting*\" episode from Netflix's \"*Love Death Robot*\", I can say that he is a really great master of writing sci-fi with fantasy theme stories (my favorite genre 😉). Also, I'm reading his novel \"*The Grace of Kings*\", right now I'm on 1/4 of this story and enjoying this as my bedtime reading 😏.\n\nI wish to see the story of this series expand by keeping the inspiration from real-world geopolitics. Also, I think the Pantheon series has its perfect ending... nothing to expect more but still, I can say that the climax was unbelievably great 🤩 which makes it a bit emotional (touchy 👉👈🥺).\n\nIf you like watching stories based on AI, the internet, cyber (security/attack), and fantasy genre, then this is definitely a must-watch series for you... I believe you don't wanna miss this! 😏\n\n&amp;#x200B;\n\n*Where you can watch this? This is AMC+ original series but is also available on Prime Videos.*",
        "created_utc": 1668849285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conecept art to pitch a Metal Gear Solid film by Sony and director Jordan Vogt-Roberts.",
        "author": "LongJonSiIver",
        "url": "https://www.reddit.com/gallery/yz47ba",
        "text": "",
        "created_utc": 1668841896,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you power scale power armor?",
        "author": "BT7274ismywaifu",
        "url": "https://www.reddit.com/r/scifi/comments/yz5jk4/how_do_you_power_scale_power_armor/",
        "text": "Power armors in my world are a mix between Iron Man and Metal Hero. The thing i don't want is for my power armors to be \"Super Saiyan + Iron Man\", i want other specialties and functionalities to be relevant in the world like a suit for stealth, cold/heat proof armor, retractable weapons/ energy weapons, etc. I feel like functionalities like the ones i mentioned feel obsolete because most of the time the \"strategy\" is to just \"scream, shoot and punch\". Sorry for the lack of context of my world but i hope you can give me some advice anyway. Thanks!",
        "created_utc": 1668839745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad Medicine",
        "author": "TheTypeSetter",
        "url": "https://medium.com/the-inkwell/bad-medicine-9eb43692658f?sk=d6923aa612a5a06ebd6d05bf10b9615a",
        "text": "",
        "created_utc": 1668838660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Macross Plus Soundtracks Get Ultimate Edition Vinyl Set",
        "author": "cyberkell",
        "url": "https://www.cyberpunkanime.net/articles/macross-plus-soundtracks-get-ultimate-edition-vinyl-set",
        "text": "",
        "created_utc": 1668822553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accidental sentience recommendations?",
        "author": "teacherofspiders",
        "url": "https://www.reddit.com/r/scifi/comments/yz01ub/accidental_sentience_recommendations/",
        "text": "Anyone have any recommendations for books where an accidental sharing of information leads to something becoming sentient? Vernor Vinge's *A Fire Upon the Deep* is good for the theme of waking something that shouldn't be woken, but I'm thinking more along the lines of an accidental seeding, with bonus points for waking up something that turns out to be benign.",
        "created_utc": 1668820761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Octavia Butler is celebrated in The New York Times",
        "author": "WeAreGray",
        "url": "https://www.reddit.com/r/scifi/comments/yyxsoi/octavia_butler_is_celebrated_in_the_new_york_times/",
        "text": "Related to the upcoming adaptation of her novel, \"Kindred\". But much more about her than the adaptation.",
        "created_utc": 1668814097,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Episode 14 of The Promising Lands is available to read on Webtoon: Explore worlds that can and can’t exist.",
        "author": "HolyKnightDeVale",
        "url": "https://i.redd.it/tc2ibjr6qt0a1.jpg",
        "text": "",
        "created_utc": 1668809079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ripley the most important/best feminist hero in cinema history?",
        "author": "scp1717",
        "url": "https://www.reddit.com/r/scifi/comments/yyv55x/ripley_the_most_importantbest_feminist_hero_in/",
        "text": "I think Ripley is the best female hero in the history of cinema. A friend of mine was recently saying that he think many modern female leads miss the mark a bit/the studios are over-working the heroine angle somewhat. I think Ripley is a more significant feminist icon not because she is always arguing for equal treatment, but because she takes zero shit and kicks fucking ass (and this since 1979.)",
        "created_utc": 1668807001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else think the Polity books by Neal Asher would make for an amazing tv franchise?",
        "author": "simplymatt1995",
        "url": "https://www.reddit.com/r/scifi/comments/yyukw2/does_anyone_else_think_the_polity_books_by_neal/",
        "text": "I just got into these a few months ago after seeing the Polity universe get recommended so much for fans of epic space operas and i absolutely love all the books that I’ve read so far :) They’re so overwhelmingly fun and the world-building is among the most genuinely fascinating and distinctive that I’ve come across in recent years. I can’t stop thinking about how amazing a live-action universe would be!!!",
        "created_utc": 1668805468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you help me remember the name of a book?",
        "author": "0bZen",
        "url": "https://www.reddit.com/r/scifi/comments/yytbk7/can_you_help_me_remember_the_name_of_a_book/",
        "text": "Hello, I have been struggling to remember the name of a book I read several years ago. I mostly only remember the ending so sorry about any spoilers I make from this.\n\nWhat I recall is some sort of extinction event is going to occur and the ending solution was scanning and uploading human consciousness into a machine that I think had some utopia type reality inside for everyone. Outside the machine was then buried deep underground with warning signs of hazardous waste or radiation in the hopes it would scare away any alien or future being from disturbing their utopia computer life.",
        "created_utc": 1668802160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cinematography Of Ghost in the Shell 2: Innocence (イノセンス)",
        "author": "Necessary-Compote-59",
        "url": "https://youtube.com/watch?v=ETRbbU_g4SI&amp;feature=share",
        "text": "",
        "created_utc": 1668801011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good lovecraftian sci-fi books?",
        "author": "Miszczu37",
        "url": "https://www.reddit.com/r/scifi/comments/yysqs5/any_good_lovecraftian_scifi_books/",
        "text": "Does anybody know some good lovecraftian style sci-fi? I've been looking but can't seem to find anything interesting. Help would be greatly appreciated",
        "created_utc": 1668800687,
        "upvote_ratio": 1.0
    },
    {
        "title": "art by Alex Schomburg",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/yyrxw5",
        "text": "",
        "created_utc": 1668798592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplained anomalies you witnessed as a kid",
        "author": "Material-Response177",
        "url": "https://www.reddit.com/r/scifi/comments/yyr9eg/unexplained_anomalies_you_witnessed_as_a_kid/",
        "text": "",
        "created_utc": 1668796811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Children of Time AMV Behind Blue Eyes",
        "author": "MoBitzYT",
        "url": "https://www.reddit.com/r/scifi/comments/yyq7ok/children_of_time_amv_behind_blue_eyes/",
        "text": "[removed]",
        "created_utc": 1668794102,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Wrath of Khan: An Interview with William Shatner",
        "author": "SuperNoBueno",
        "url": "https://supernobueno.wordpress.com/2022/11/18/the-wrath-of-khan-an-interview-with-william-shatner/",
        "text": "",
        "created_utc": 1668781134,
        "upvote_ratio": 1.0
    }
]