[
    {
        "title": "Why does aliens and terminator get a pass for being preachy and using tropes yet avatar gets hate ?",
        "author": "LovableJackassv4",
        "url": "https://i.redd.it/sao34glywboa1.jpg",
        "text": "",
        "created_utc": 1679053785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Sci-Fi worlds that have every form of RetroFuturism in its history?",
        "author": "joshwontshutup",
        "url": "https://www.reddit.com/r/scifi/comments/11to4aa/any_scifi_worlds_that_have_every_form_of/",
        "text": "I had this idea but don’t know if it’s done before. Are there SF worlds where in the 1800s it was purely steampunk, then in the 20s was Pulpy SF and Decopunk, then the 40s and 50s was Golden Age and Diselpunk style stuff. Then, the 60s to 80s was New Wave and Space Operas? I’m curious because I wanna make a world like this and am curious if it’s been done before. \n\nAn SF world who’s tech follows the retrofuturism and SF ideas of the times?",
        "created_utc": 1679051617,
        "upvote_ratio": 1.0
    },
    {
        "title": "I drew a......thing",
        "author": "Thecubezarmy_RO",
        "url": "https://i.redd.it/z706y3ruoboa1.jpg",
        "text": "",
        "created_utc": 1679051084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby Putie Video - Baby Putie Viral Tele Video - Baby Putie Viral Complete Video",
        "author": "Mehrwan_malik",
        "url": "https://www.everylatestnews.com/2023/03/baby-putie-video-baby-putie-viral-tele.html?m=1",
        "text": "",
        "created_utc": 1679050091,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT writes a \"Copyright Avoidant\" Ersatz Star Trek Script",
        "author": "MrTickles22",
        "url": "https://www.reddit.com/r/scifi/comments/11tl9dg/chatgpt_writes_a_copyright_avoidant_ersatz_star/",
        "text": "FADE IN:\n\nThe crew breathes a sigh of relief as the last of the teddy bears powers down. Scienceman Splock turns to his trusty robot companion, Infoman.\n\nSCIENCEMAN SPLOCK (to Infoman) Great work, my friend. Your data analysis was invaluable in defeating those machines.\n\nInfoman beeps and whirrs in response, before returning to his station to continue monitoring the ship's systems.\n\nWHISKEY THE IRISHMAN (raising a glass of whiskey) Well, if anyone needs me, I'll be in the galley. Time for a wee dram to calm the nerves.\n\nLevor Bor-tune, the ship's engineer, chimes in.\n\nLEVOR BOR-TUNE (shouting frantically) The whipcream core is going to blow! We're all going to die!\n\nThe rest of the crew ignores Levor's outburst. They've grown used to his tendency to overreact to minor issues.\n\nCOMMODORE KORK (snorting whipped cream from a can) Ah, nothing like a bit of Tesco's finest to celebrate a successful mission.\n\nThe crew chuckles at Kork's eccentricity.\n\nSCIENCEMAN SPLOCK (turning to Kork) Commodore, I must advise against consuming too much whipped cream. It could have negative effects on your health.\n\nCOMMODORE KORK (waving a can of whipped cream) Relax, Splock. Live a little.\n\nSuddenly, the ship lurches and alarms blare.\n\nLEVOR BOR-TUNE (panicking) I knew it! The whipcream core really is going to blow!\n\nScienceman Splock rushes to his station to assess the situation.\n\nSCIENCEMAN SPLOCK (intently studying the data) It appears we've encountered some unexpected turbulence in the space-time continuum. We need to recalibrate the ship's systems to stabilize our position.",
        "created_utc": 1679042221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie recommendations with extraterrestrials?",
        "author": "Fearless_Law6729",
        "url": "https://www.reddit.com/r/scifi/comments/11tl53a/movie_recommendations_with_extraterrestrials/",
        "text": "I was wondering if anyone had movie recommendations for movies that include extraterrestrials but in a eerie, somewhat awed way. Movies I like are Magellan, Cosmos, and I love the lore in Prometheus! I love anything where extraterrestrials are something that inspires awe, with “we are not alone” energy. I desperately love these types of movies, INCLUDING indie ones that have lower reviews. I usually love them and devour them.\n\nThank you in advance if anyone has some recs!",
        "created_utc": 1679041777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is The Clone Wars still worth watching?",
        "author": "Magus80",
        "url": "https://www.reddit.com/r/scifi/comments/11tkpjz/is_the_clone_wars_still_worth_watching/",
        "text": "Just watched first season, it wasn't bad. Quality was all over the pace tho and it felt corny. Is it just first season being rough end will improve in later seasons?",
        "created_utc": 1679040126,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just met Keith randomly in New York!!!",
        "author": "Aggravating-Joke-233",
        "url": "https://i.redd.it/8v154d6la9oa1.jpg",
        "text": "",
        "created_utc": 1679040033,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] I made a trailer for Three-Body animated show out of the teaser trailer for Gravity",
        "author": "Imnomaly",
        "url": "https://www.youtube.com/watch?v=fIaLQOH2DJk",
        "text": "",
        "created_utc": 1679036839,
        "upvote_ratio": 1.0
    },
    {
        "title": "काय आहे Technology ?",
        "author": "futuretechmarathi",
        "url": "https://futuretechmarathi.blogspot.com/2023/03/technology.html",
        "text": "",
        "created_utc": 1679035871,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should the population of the Earth ideally be?",
        "author": "Aromatic_Young_333",
        "url": "https://www.reddit.com/r/scifi/comments/11tjjxx/what_should_the_population_of_the_earth_ideally_be/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11tjjxx)",
        "created_utc": 1679035808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men vs Machine, in the '80s",
        "author": "elf0curo",
        "url": "https://v.redd.it/4zhqblazcpna1",
        "text": "",
        "created_utc": 1679035666,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why Arbitrum Token matters for ArbitrumNetwork users.",
        "author": "Ok_Professional_523",
        "url": "https://www.reddit.com/r/scifi/comments/11tj77h/why_arbitrum_token_matters_for_arbitrumnetwork/",
        "text": "[removed]",
        "created_utc": 1679034565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark vrex sings this is halloween",
        "author": "InternetSea190",
        "url": "https://v.redd.it/nl8bx3s7e8oa1",
        "text": "",
        "created_utc": 1679029161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark red glowing eyes vrex Sings monster",
        "author": "InternetSea190",
        "url": "https://v.redd.it/4r7bs8zbd8oa1",
        "text": "",
        "created_utc": 1679028866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Picard season 3 is phenomenal",
        "author": "kustarc",
        "url": "https://www.reddit.com/r/scifi/comments/11tgvyd/picard_season_3_is_phenomenal/",
        "text": "I was very disappointed after that horrible season 2 and i had no hopes about next season but after watching epsiodes 4 and 5  i am extremely satisfied. I dont know if they hired a completely different writer crew or not but it feels like whoever writing season 3 possess great love, respect and knowledge for Star Trek universe. I might sound a little bit overhyped but if they continue with this pace season 3 of Picard could become best thing ever happened to Star Trek franchise in last 20-25 years. If some of you guys gave up at some point in season 1 or 2 or didnt bother at all because of bad rewievs i'd recommend to give season 3 a go, you dont even have to watch first 2 seasons, its been a while but i dont remember any significant connections between new season and past 2. Its a new story arc with great potential with some beloved character comebacks from old series.",
        "created_utc": 1679026906,
        "upvote_ratio": 1.0
    },
    {
        "title": "The real God is a helper",
        "author": "BK641663",
        "url": "/user/BK641663/comments/11tgltw/the_real_god_is_a_helper/",
        "text": "",
        "created_utc": 1679026497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free speech does not mean brain washing me!",
        "author": "blkcelltolsen",
        "url": "https://i.redd.it/ggx7uqkbk9oa1.jpg",
        "text": "Have you ever noticed the so called idiots that are screaming for more rights don't want you to have any rights to live, speak, or think.",
        "created_utc": 1679025321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Wars Vector",
        "author": "DontWatchMojo",
        "url": "https://www.youtube.com/watch?v=IAhEp5BUL0Q",
        "text": "",
        "created_utc": 1679024897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Billy Crudup on the Sci-Fi and Retro-Futurism of the 1950s",
        "author": "Boring_Ant_1677",
        "url": "https://www.lpm.org/music/2023-03-16/billy-crudup-on-the-music-and-retro-futurism-of-the-1950s",
        "text": "",
        "created_utc": 1679022208,
        "upvote_ratio": 1.0
    },
    {
        "title": "The facts",
        "author": "FragrantEstimate2448",
        "url": "https://www.reddit.com/r/scifi/comments/11texz9/the_facts/",
        "text": "119 billion pounds of food is wasted in the United States. That equates to 130 billion meals and more than $408 billion in food thrown away each year. Shockingly, nearly 40% of all food in America is wasted. Supermarkets should not be a for-profit industry the government should control our food to make sure nothing goes to waste 1/3 of only living people in this earth have never even had access to a computer or the internet every year children go hungry and starve to death I am protesting this with the hunger strike capitalism only works for 1% of this world college should be free 90% of all doctors come from 1% income bracket in Germany it cost $700 a semester to go to college affordable cheap their economies are not crashing their medicine is socialized if there were more doctors there would be better medicine we are a failure as a country to protect the needs of our poor are hungry and are sick also in every Court case involving a child or a woman that has been sexually assaulted the accused should have to take sodium penicillin and if they're still feeling guilty after the truth serum proves it the victim should be able to decide if they be castrated all world leaders should have to take sodium panel that they have now intention of using their nuclear weapons all elected officials should have to take truth serum that they actually serve Humanity and their country and not just themselves a bank all it does is create money and Loan it at interest all banks if I create money at my house it's called counterfeiting if a bank does it it's called cooking the books it should be illegal for banks to have money from stealing with impossibly high interest rates from money they create for free also I'd like to raise awareness of the scientific proof behind the Laredo staircase the lanciano Eucharist miracle and the Lady of Guadalupe Laredo staircase has no Nails no glue no ties and stands up without any help of gravity it's impossible for it to be standing the Lady of Guadalupe survived bombings acid being poured on a candle smoke and that one man copy has ever lasted more than 25 years even NASA said the science behind it doesn't make sense the 1200-year-old Eucharist was found to have no Dead blood cells if Jesus is God his commandment was for all men to be poor in fact it is my belief that anyone who makes more than 300,000 a year and doesn't give everything they have extra to the poor is going straight to hell God gave a commandment you are in a love him more than you love your children he said anyone starving in need of water or housing and you did not help you did the same to him all educational books should be made free over the internet schooling should be made year round over the internet they should have a recording of every class day and the recordings be given to anyone living in the third world who doesn't have access to an education anyone who does not think that a woman or a girl has a right to an education should be sent to a prison where they're f up the ass by homosexuals their bones should be broken they should be experimented on medically so we can recreate a super human mind with Savant syndrome in any willing candidate without them being in any danger whatsoever in every prison in the United States all male prisoners should be forced to wear a chastity belt anybody who ever raped a man or raped a woman or raped a child should be castrated a lifer should have forced medical experiments be placed on them anybody in prison who would like should be able to take a sodium truth serum test to see if they're innocent no one has the right to be rich for 10 generations of their family for playing sports and contributing nothing to humanity except for athletic ability it should be the law that the only people that will be allowed to play sports professionally on TV should have had active military service for anyone that was in a firefight for my freedom should be paid the same as a dentist no matter how stupid they are it should be a law that anyone could join the military regardless of mental history if they can prove they do not hallucinate in a way that would put anyone else in danger if properly medicated Donald Trump made billions of dollars he paid more and foreign taxes when he did in American he paid $700 in taxes he made $700 million off gambling addiction he should be stripped of all money for budding up to dictators like the Saudi Arabians who would put a woman in prison for 32 years for sending a tweet picking up for a woman's right to drive we back monsters for oil we could take easily their religious belief is that it's okay to marry a 6-year-old for Christ's sake anybody who thinks it's okay to marry a 6-year-old should be castrated experimented on and given no anesthesia for the rest of their life North and South America should be one country but because that's too difficult every South American that would fight in the American Army whether or not they speak the language that could pass a physical should have their families be giving green cards and be allowed to stay here there should be no borders for women and children and there should be free housing in every vacant hotel room provided by the government everything but dildos married women and women in prison should be illegal to watch women are oppressed and it is a travesty that this has not been made illegal every American that can pass an eye dosing lie detector that they would not commit crimes they are not addicted to any illegal drugs they would not commit sexual crimes or even fantasize about committing sexual crimes on anyone should be able to buy a gun as long as they don't have a multiple personality disorder and they don't fantasize about killing people the sun does not set on a muddy spring we should tear it down all Islamic structures dedicated to the god of a pedophile that is why I'm protesting right now there is a 7-year-old in prison for peeing on a rug that had no power with adults any culture that would allow this kind of treatment of children sexual immoral abusive needs to be put down with a sword or a gun we should invade them then I will access the food and water unless they can pass an eye dosing lie detector that they think it's a moral for a man to have sex with a six-year-old if they're women shoot them if they're men shoot them or imprison them God Bless America",
        "created_utc": 1679021289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vaporwave vrex sings monster",
        "author": "InternetSea190",
        "url": "https://v.redd.it/5e1v2v7vk7oa1",
        "text": "",
        "created_utc": 1679019291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody know any first contact sci-fi tv shows?",
        "author": "Bilbobaginses1",
        "url": "https://www.reddit.com/r/scifi/comments/11tdwaf/does_anybody_know_any_first_contact_scifi_tv_shows/",
        "text": "",
        "created_utc": 1679018420,
        "upvote_ratio": 1.0
    },
    {
        "title": "X-bomber",
        "author": "BaaaMoura",
        "url": "https://youtu.be/ZmDuI2YcxHY",
        "text": "X-bomber",
        "created_utc": 1679011959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Twisted vastatosaurus sings godzilla",
        "author": "InternetSea190",
        "url": "https://v.redd.it/qj2wjux9y6oa1",
        "text": "",
        "created_utc": 1679011694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supermarionation",
        "author": "BaaaMoura",
        "url": "https://www.reddit.com/r/scifi/comments/11taxpu/supermarionation/",
        "text": "Anyone like The old's marionation TV shows Like Stingray , Thunderbirds ,captain Scarlett , x-bomber etc ?",
        "created_utc": 1679011525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vastatosaurus rex sings godzilla",
        "author": "InternetSea190",
        "url": "https://v.redd.it/l4y08tuyv6oa1",
        "text": "",
        "created_utc": 1679010918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would you want to be neighbors with?",
        "author": "Charming_Celery5490",
        "url": "https://www.reddit.com/r/scifi/comments/11t8e6r/who_would_you_want_to_be_neighbors_with/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/11t8e6r)",
        "created_utc": 1679005691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unlock the value of $ARB on Arbitrum. Rewards.",
        "author": "Maleficent-Finish508",
        "url": "https://www.reddit.com/r/scifi/comments/11t8a11/unlock_the_value_of_arb_on_arbitrum_rewards/",
        "text": "[removed]",
        "created_utc": 1679005432,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the substance of the short story piques your curiosity, I would be elated if you subscribed to my channel and support me.",
        "author": "BrilliantEvery5547",
        "url": "https://youtu.be/jr1_ktcq-wQ",
        "text": "",
        "created_utc": 1679002365,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAY 16 The Endless Journey: Adventures in Everything Everywhere All at Once",
        "author": "amout_us",
        "url": "https://www.reddit.com/r/scifi/comments/11t3ffl/day_16_the_endless_journey_adventures_in/",
        "text": "[removed]",
        "created_utc": 1678994176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riddick 4: Furya - What We Know So Far",
        "author": "Smaug117",
        "url": "https://www.gamersubculture.com/entertainment/Riddick%204:%20Furya%20-%20What%20We%20Know%20So%20Far/4yr96e9SEXS8AhImSDQv",
        "text": "",
        "created_utc": 1678988852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fire in the Deep - Vinge: Tine group minds",
        "author": "AdMedical1721",
        "url": "https://www.reddit.com/r/scifi/comments/11t0rlh/fire_in_the_deep_vinge_tine_group_minds/",
        "text": "I know the Tines from Fire in the Deep by Vinge communicate within their group minds (their pack) using various sounds. It seems like they are always making sounds in order to keep the pack working as one personality. However, sound seems like a very clunky way to work as the medium of thought. Anyone have any insights?",
        "created_utc": 1678988207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci-Fi books where you fell in love with the characters from the beginning",
        "author": "rooknerd",
        "url": "https://www.reddit.com/r/scifi/comments/11t06b0/scifi_books_where_you_fell_in_love_with_the/",
        "text": "I had posted a similar post on the fantasy subreddit and got many great recommendations.\n\nThere are a lot of books where I absolutely loath the characters because of which I have to give up on them.\n\nBut there are some books, like *Murderbot* and *The Martian*, where I don't care about the plot that much. The characters are enough to keep my attention.\n\nMurderbot, although a hybrid mechanical-organic construct is relatable enough that I fell for it immediately. And Dr Mensah and her crew's altruistic nature made me like them.\n\nMark Watney keeps us entertained with his jokes, in a situation where I would've given up all hope. And all the other characters worked hard to get him back, some even at a risk to their own lives.\n\n**Do you have any books where you fell for a single or multiple characters?**\n\nI know that classical Sci-Fi is notorious for flat characters, so if anyone has a recommendation from those, it would be highly appreciated.",
        "created_utc": 1678986932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Futuristic city",
        "author": "alternateartreality",
        "url": "https://i.redd.it/5ldsbwjo76oa1.jpg",
        "text": "",
        "created_utc": 1678984763,
        "upvote_ratio": 1.0
    },
    {
        "title": "My OC, Orbit. Hello again. By me.",
        "author": "adohan",
        "url": "https://v.redd.it/1raxr1lgz5oa1",
        "text": "",
        "created_utc": 1678981985,
        "upvote_ratio": 1.0
    },
    {
        "title": "“The Crazies” 50 Years Later – Why It’s Even More Relevant Today",
        "author": "Halloween-Year-Round",
        "url": "https://halloween-year-round.com/2023/03/16/the-crazies-50-years-later-why-its-even-more-relevant-today/",
        "text": "",
        "created_utc": 1678981440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theosophics",
        "author": "gh0stmechanic",
        "url": "https://i.redd.it/mvtkzzdqw5oa1.jpg",
        "text": "",
        "created_utc": 1678981068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a short film I saw. Help.",
        "author": "KineticBombardment99",
        "url": "https://www.reddit.com/r/scifi/comments/11sx9sd/looking_for_a_short_film_i_saw_help/",
        "text": "Dude goes into a sewer thing with a drone friend, finds a portal to another world that's a bright city.  He goes into a massive cavern where he confronts some kind of techno god and there's a short battle thing.\n\nSaw it on youtube a ton of times, but can't remember the name to find it again.  Thanks folks.",
        "created_utc": 1678980485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orbits, Ruffmouse, mixed media, 2023",
        "author": "Ruffmouse",
        "url": "https://i.redd.it/qlcjl2keu5oa1.jpg",
        "text": "",
        "created_utc": 1678980284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wait! I exist now? 😍",
        "author": "space_continuum",
        "url": "https://twitter.com/space_continuum/status/1635696725062037518",
        "text": "",
        "created_utc": 1678979333,
        "upvote_ratio": 1.0
    },
    {
        "title": "100 Hooks and Rumours to Hear in or about the Glorious Empire - Mongoose | Flavour | Travellers' Aid Society | Traveller | DriveThruRPG.com",
        "author": "nlitherl",
        "url": "https://www.drivethrurpg.com/product/397170/100-Hooks-and-Rumours-to-Hear-in-or-about-the-Glorious-Empire?affiliate_id=688223",
        "text": "",
        "created_utc": 1678978274,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Daily Movie - Captain Nova",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11svpjz/my_daily_movie_captain_nova/",
        "text": "Kids movie - it's fine, it's just sort of hamstrung in the plot department from relying a bit too much on pre-teens to carry the weight of the story.\n\nIt's another one of these \"our disregard for our planet will lead to catastrophe\" films.  That narrative is extremely tired to me.",
        "created_utc": 1678976879,
        "upvote_ratio": 1.0
    },
    {
        "title": "MASSACRE AT OAK CREEK - A Scifi/Horror Short Film",
        "author": "badlerfilms",
        "url": "https://youtu.be/8JVeX4mOmyk",
        "text": "",
        "created_utc": 1678972056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step aside ChatGPT!",
        "author": "worotan",
        "url": "https://i.redd.it/ggon6hh643oa1.jpg",
        "text": "",
        "created_utc": 1678970547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Appreciating Alex Garland's Writing and Directing in Ex Machina and Devs",
        "author": "aleph96",
        "url": "https://www.reddit.com/r/scifi/comments/11src71/appreciating_alex_garlands_writing_and_directing/",
        "text": "Hello everyone,\n\nI'd like to take a moment to appreciate the writing and directing of Alex Garland in two notable sci-fi works: **Ex Machina** and **Devs**.\n\nGarland's ability to explore complex themes of human psychology, philosophy, and morality in both of these projects is impressive. In Ex Machina, he examines the concept of consciousness and the meaning of humanity, while also exploring power dynamics in relationships. In Devs, he delves into the concept of determinism and the role of technology in shaping our lives.\n\nOne of the notable aspects of Garland's work is his attention to detail in every aspect of the production process. The photography, set design, and music in both Ex Machina and Devs are all crafted to create an immersive experience that complements the story.\n\nOverall, Alex Garland is a talented writer and director who has created thought-provoking and emotionally resonant works of science fiction. I recommend checking out Ex Machina and Devs if you enjoy the genre.",
        "created_utc": 1678966035,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found an advance copy of Doctorow’s next novel",
        "author": "MajoredInPhilosophy",
        "url": "https://i.redd.it/xeo5cmw0m4oa1.jpg",
        "text": "",
        "created_utc": 1678965362,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the greatest remakes ever. This updated version added a truckload of blood and gore along with a totally game cast to attain classic status. _ The Blob (1988)",
        "author": "WildDog3000",
        "url": "https://v.redd.it/boiuep46g4oa1",
        "text": "",
        "created_utc": 1678963531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me identify this short story",
        "author": "DrestinBlack",
        "url": "https://www.reddit.com/r/scifi/comments/11spps8/please_help_me_identify_this_short_story/",
        "text": "This is a scientific fiction short story, published before 1990.\n\nWith the Great War come to an end the evil dictator retreats to a secret chamber inside a mountain where he goes into hibernation/suspended animation expecting to automatically awake years later to try again.\n\nA small device on a face of the mountain is to count off sunrises before triggering his awaking. However an errant missile inadvertently sweeps the sensor away and the dictator stays asleep much much longer.\n\nTil some beings discover the lair and awaken him manually. I’ll stop to avoid spoilers.\n\nAnyone? Thanks in advance",
        "created_utc": 1678960944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mistakes made by the greatest scientists",
        "author": "FriendAdventurous623",
        "url": "https://www.reddit.com/r/scifi/comments/11snz0r/mistakes_made_by_the_greatest_scientists/",
        "text": "[removed]",
        "created_utc": 1678954648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snap",
        "author": "Jane-wildee",
        "url": "https://www.reddit.com/r/scifi/comments/11sno4r/snap/",
        "text": "[removed]",
        "created_utc": 1678953497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Series 😭",
        "author": "Jane-wildee",
        "url": "https://www.reddit.com/r/scifi/comments/11snmq4/series/",
        "text": "[removed]",
        "created_utc": 1678953343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Children of Dune premiered on Sci-Fi 20 years ago today",
        "author": "book1245",
        "url": "https://i.redd.it/ozp0fy3jp1oa1.jpg",
        "text": "",
        "created_utc": 1678951028,
        "upvote_ratio": 1.0
    },
    {
        "title": "sci fi short story where robots dissect the visiting earth men",
        "author": "Lou-Mibera",
        "url": "https://www.reddit.com/r/scifi/comments/11sjo3j/sci_fi_short_story_where_robots_dissect_the/",
        "text": "[removed]",
        "created_utc": 1678939603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you go to see a Star Wars/Trek crossover? Objectively?",
        "author": "lemetungurassasufart",
        "url": "https://www.reddit.com/r/scifi/comments/11shtwi/would_you_go_to_see_a_star_warstrek_crossover/",
        "text": "[removed]",
        "created_utc": 1678934514,
        "upvote_ratio": 1.0
    },
    {
        "title": "art by Rolf Mohr for Of Men And Monsters by William Tenn (Gollancz, 1989).",
        "author": "blcknoir",
        "url": "https://i.redd.it/zokxdzt3x1oa1.jpg",
        "text": "",
        "created_utc": 1678932765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Scifi Books of the Past 2-3 Years?",
        "author": "Don_Quixotel",
        "url": "https://www.reddit.com/r/scifi/comments/11sgvb2/best_scifi_books_of_the_past_23_years/",
        "text": "I used to be an avid reader of SciFi but have fallen away in the past few years. I guess the most recent SciFi I’ve read is The Three Body Problem. What have I missed out on?",
        "created_utc": 1678932106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need the name of a TV show",
        "author": "Just_Michael1138",
        "url": "https://www.reddit.com/r/scifi/comments/11sgmi3/need_the_name_of_a_tv_show/",
        "text": "There was Fox or ABC (I think) show back in the early 2000s about a family that were part of a secret elite that had access to radically advanced technology. One of things they had parked hidden in their garage was a Moller air car, and they climb into it and take off to their secret meetings, while playing at being \"normal\" to everyone else.   \n\n\nI don't think it was Eureka, either, and I think it only lasted one or two shows. lol But any help would be appreciated.",
        "created_utc": 1678931525,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time seeing this...",
        "author": "captainjaypicard",
        "url": "https://i.redd.it/twyjrdj0s1oa1.jpg",
        "text": "I'm in love with this one.   A couple buddies say its been around for a while but never seen it. I feel like it brings some humanity to the Borg.",
        "created_utc": 1678931053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ground war in the future",
        "author": "OhBosss",
        "url": "https://www.reddit.com/r/scifi/comments/11sft4b/ground_war_in_the_future/",
        "text": "Can anyone recommend good military sci fi about ground war stories like drop troopers, undying mercenaries and frontier corps?",
        "created_utc": 1678929533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get Rewards: Arbitrum Airdrop. 03.15.23",
        "author": "Visible-Penalty58",
        "url": "https://www.reddit.com/r/scifi/comments/11sfhho/get_rewards_arbitrum_airdrop_031523/",
        "text": "[removed]",
        "created_utc": 1678928753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Faux Curse Words For Sci-Fi?",
        "author": "Just_Michael1138",
        "url": "https://www.reddit.com/r/scifi/comments/11sf1kc/faux_curse_words_for_scifi/",
        "text": "I need a good list of homebrew swear words you've all used in your Star Wars (or even D&amp;D) campaigns. Why? Because nothing is so pithy as a good invective leveled at a storm trooper right before the firefight begins.  \n\n\nI personally liked the workd \"shtako\" from Defiance, but variations of that, including \"shtak\" have found their way into my games. I need more, though, for diversity.   \n\n\nUnfortunately, *frell* is also trademarked. lol *Frak*, however, is not. I need your best!",
        "created_utc": 1678927696,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Love The Ark!",
        "author": "MsLeqsee",
        "url": "https://www.reddit.com/r/scifi/comments/11seody/i_love_the_ark/",
        "text": "Every week The Ark has me howling! The out of control plot lines, the all over the place acting, the non science based science... I mean they literally got to the other side of a WHOLE planet with a quick right turn in that last episode.. LOL!! And than there's the one doctor that's hooked on drugs... I mean it's just non stop comedy! I love this show!",
        "created_utc": 1678926829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anybody help me identify this 90's scifi tv show?",
        "author": "Strong-Journalist146",
        "url": "https://www.reddit.com/r/scifi/comments/11sdt3j/can_anybody_help_me_identify_this_90s_scifi_tv/",
        "text": "This has been driving me crazy for months, I can't seem to find a scary tv show that I remember watching as a kid. Basically, it would be around mid 90's and all I can remember is the ending. It was a guy trapped inside some kind of a bunker (or possibly a space ship) on either post apocalyptic Earth or Mars. I'm leaning more towards Mars as I remember it being quite reddish. So there were two aliens or monster things outside the door trying to get in via a combination lock. And they were joking saying something like \"we have all the time in the world to crack the combination\" or something like that. The guy inside had a gun but no more bullets. And that's where it ended with the monsters laughing and the man like \"Noooooo\". I'm getting kind of \"the outer limits\" vibe, but I checked every single episode on wiki and it wasn't on there. Sorry, I know this is vague but I figure it's worth a shot. Any ideas?",
        "created_utc": 1678924727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Head Machine [OC]",
        "author": "danno147",
        "url": "https://i.redd.it/cmzq64yklzna1.jpg",
        "text": "",
        "created_utc": 1678922691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mandalorian S3E3 very important question",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11scyo4/mandalorian_s3e3_very_important_question/",
        "text": "Are the doctors glasses crooked?",
        "created_utc": 1678922671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out my interview with Bob Gale, co-writer of Back To The Future!",
        "author": "DadsFromTheCryptPod",
        "url": "https://youtu.be/ZKJHclItjbAG",
        "text": "",
        "created_utc": 1678917257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favourite scifi Video-Games?",
        "author": "AutomaticAbroad5409",
        "url": "https://www.reddit.com/r/scifi/comments/11s9dg8/favourite_scifi_videogames/",
        "text": "[removed]",
        "created_utc": 1678914587,
        "upvote_ratio": 1.0
    },
    {
        "title": "A giant, thought-to-be-extinct shark launches an attack in, The Meg (2018).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/yp922gup90oa1",
        "text": "",
        "created_utc": 1678912843,
        "upvote_ratio": 1.0
    },
    {
        "title": "William Shatner, 91, confirms he doesn’t have long to live in new statement",
        "author": "JohnBrownMilitia",
        "url": "https://www.msn.com/en-us/entertainment/entertainment-celebrity/william-shatner-91-confirms-he-doesn-t-have-long-to-live-in-new-statement/ar-AA18sfct",
        "text": "",
        "created_utc": 1678909228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peter Watts bio on Audible solidified me as a fan ha",
        "author": "UNLVmark",
        "url": "https://i.redd.it/sqmf0pk5xzna1.jpg",
        "text": "",
        "created_utc": 1678908569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi im satan :) ♥️ I'm just a normal gurl",
        "author": "Blx4200",
        "url": "https://www.reddit.com/r/scifi/comments/11s5n9g/hi_im_satan_im_just_a_normal_gurl/",
        "text": "here's a cool hypothetical it would make a hell of a show. lets what we can come up with together just follow this post il maybe figure out something to do this weekly for fun. it's a really cool concept and character.\nhow can we help her out?\n\nsee the story isn't really how everyone thought. it was god said fuck it threw me out and made figure it all out. it's fucking insane. Let me tell you a little about myself\neveryone wants to fuck me. Literally walking lust yet still single. crazy right? see it's not really how we thought it was they were supposed to help and every time they failed again and again  it was the same story over and over fuck me I was tired. being old being young being bad never quite enough. iv tried wars iv let them do it themselves. iv tried giving 1 lerskng person iv told them what to do what now to do haha fuck they are just not thinking. How about we change it up this time? no matter what I did he only enough. this time he erased everything I can't remember anything and everyone hates me for some reason. what should I do lol like people this I'm super rich but I only make enough.\nI get confident and people think I'm a dick and presumptuous. see the only thing I can do this time is learn. Im fucking human. how do I human? think about it lol no powers I can't even fucking get money by selling drugs because he fucked even worse by making the story so fucking bad so. even worst he fucking got me pregnant. This dude changed the fucking story its for me fucking tired.... How the fuck do I human?",
        "created_utc": 1678906603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remember \"Wild Palms\"?",
        "author": "sweet_dumple",
        "url": "https://www.reddit.com/r/scifi/comments/11s5jxf/remember_wild_palms/",
        "text": "[https://grantland.com/features/rediscovering-oliver-stone-wild-palms/](https://grantland.com/features/rediscovering-oliver-stone-wild-palms/)",
        "created_utc": 1678906405,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOO itching for a gigantic space opera tv show",
        "author": "Gauss_theorem",
        "url": "https://www.reddit.com/r/scifi/comments/11s4x00/soo_itching_for_a_gigantic_space_opera_tv_show/",
        "text": "Man, i wish some studio would make an original sci-fi space opera with the scale of, say, The Culture novels. There are so many ideas to explore. AI civilizations, dyson spheres, intergalactic travel, and so many other sci-fi concepts are just waiting to be put on screen.\n\nImagine a tv show that heavily borrows from Isaac Arthur and Stellaris, that's basically what i have in mind. I've been thinking about such a thing for years, it's a shame it'll probably never happen. Oh well, back to sci-fi books i guess.",
        "created_utc": 1678905079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some shots of Weavers Needle throughout the day, from a campsite along Lost Dutchman trail.",
        "author": "Same-Voice-9816",
        "url": "https://www.reddit.com/gallery/11rg0km",
        "text": "",
        "created_utc": 1678904877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dragon Tooth final stretch goal extension",
        "author": "brandnewclue",
        "url": "/r/TheExpanse/comments/11s2rml/dragon_tooth_final_stretch_goal_extension/",
        "text": "",
        "created_utc": 1678904327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mando Chapter 19 was a waste",
        "author": "DontWatchMojo",
        "url": "https://www.youtube.com/watch?v=ojU6Q1xrbV0",
        "text": "",
        "created_utc": 1678900765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entidades demoníacas",
        "author": "WritingGold8508",
        "url": "https://www.reddit.com/r/scifi/comments/11s2dd0/entidades_demoníacas/",
        "text": "[removed]",
        "created_utc": 1678899718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intense.Encounter👽",
        "author": "NoDamns",
        "url": "https://youtu.be/6xvamkD7848",
        "text": "",
        "created_utc": 1678898311,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Review] “The Last Horror” (1927) by Eli Colter - Deep Cuts in a Lovecraftian Vein",
        "author": "Zeuvembie",
        "url": "https://deepcuts.blog/2023/03/15/the-last-horror-1927-by-eli-colter/",
        "text": "",
        "created_utc": 1678896235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Into the galaxies",
        "author": "alternateartreality",
        "url": "https://i.redd.it/j40r9a90uyna1.jpg",
        "text": "",
        "created_utc": 1678895406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm getting interested in reading more sci-fi settings which describe how our contemporary republicanist society in an interstellar sci-fi future morphed into neo-feudalism being the norm, and just wondering which settings do you know of?",
        "author": "gereedf",
        "url": "https://www.reddit.com/r/scifi/comments/11rz0xe/im_getting_interested_in_reading_more_scifi/",
        "text": "I think the setting of Battletech is probably one of the more prominent settings, in some cases with a republican veneer.\n\nWhile Dune had the drastic event of the Butlerian Jihad, and for Star Wars, Palpatine also suddenly came up with the position of Emperor",
        "created_utc": 1678892601,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The Secret Adventures of Jules Verne\" (2000). A Canadian steampunk sci-fi series about a young Jules Verne travelling the world with Phileas Fogg (Michael Praed).",
        "author": "MulciberTenebras",
        "url": "https://v.redd.it/550l3nsiywna1",
        "text": "",
        "created_utc": 1678890906,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Talk About Spielsberg's A.I. (Artificial Intelligence, 2001) and Recent Developements ...",
        "author": "rememberyoubreath",
        "url": "https://www.reddit.com/r/scifi/comments/11rxwo2/a_talk_about_spielsbergs_ai_artificial/",
        "text": "lately i have been a litte obsessed with new advancements in the field of computing technologies, so i thought about looking back on one of the classic as i got the opportunity to finally see it on the big screen. \n\nwhat interests me is the artificiality aspect and how it impacts the viewer. how the director sets to intertwine what is fake and what is not. on the silver screen, everything is ultimately lifeless, a mere image of what is real but yet it can feel to us more real than reality itself. it can wield an itensity that will lead us, always, to come back and want to be involved in the narrative. to forget that things are not but that they can be. that for some fleeting hours we can reach that place where immersed in the story the shadows that inhabits it makes us feel more alive than we were out there. \n\ndavid is a fake child, coming to this weird house that is like a stage. seemingly far away from the world and bathed in diaphanous lights. protected in an all seemingly artificial love. he is introduced to us through vague halo or shattered mirrors. silver planes within the frame. it is only when martin, the real child, comes back that we eventually have the scope becoming a little larger. but then again it's only for him to end at the bottom of a pool that has taken the entirety of the screen. leaving him alone behind this veil of shifting dreams. eventually, his mother too fits in a mirror. she feels like something else. eternal for an instant. and it will be her last memory of him, a fading shadow, stuck like a bird in the nest, in the rearview glass of her whale sounding car. unable to escape as she abandons him to a world she spoke to him nothign about. \n\nhe never will nor wants to grow. when his frend the sex toy joe tells him about his issues, david furiously refuses to hear any of it. a glimpse of violence can even be seen in his unblinking eyes. not so long ago, that same funny character, full of stereotypical charm, was dancing before him under the moonlight, going from the forefront of the scene to the back where only his silouhette survived. and the moon, they were afraid of it. they did not know if it was dangerous or not. they already had been tricked once. yet to find the blue fairy, the most real thing in david's eyes, they none the less go towards it, like actors indeed go toward the lights of the projectors and play out something else from themselves. always under the cold embrace of the moon, gleaming without end and fabricating heir dreams. \n\nfinally, after david has seen it all. after he saw through himself and broke down, threw himself in the vast ocean where the man made city's dead body too lies still. then, all that is left is artificial. we have not seen anything human in a while. but what happened in the meantime is that, much like the audience at the destruction fair would stand up to protect him, we came to see him as a real child. this actor that is a child playing a robot wanting to be real. becoming a tear on the face of another artificial being as if it was the most he could ever be. we all wanted him to be so real, for his story to make sense, we wanted to be fooled. we wanted to see his dreams come true. and it does, when he is all alone, in a fantasy he wished to be created for him, only them is the truly real ! through those couples of hours we let ourselves sink into this world where robots, even the most difformed ones, seems to possess a soul, where we feel pain when they are hurted. and so in the last moments, like the machines from eons after the death of humanity, we look to the silver screen, in between reflection, as the scene unfold, as his dream has benn realized and the light ... goes out. \n\nwe all go back to that \"place the dreams are made off\". \n\nPOSTFACE\n\nthis movie does bring up so many questions xD \n\nbeside the film in itslef, i was struck out how relevant it was to recent events. it resonnated extremely well with the actuality surrounding generative ai chatbots, to the point where some scene in the movie of david breaking down actually is something that has been seen on the web, in real life. people talked to them, they got engaged and for them it was real. and maybe when you turn off your computer and go out, do the things you do, you will have a thought, you will be enaged in that thought. it will become the seed on which you build your tree house. it was not real before it was real to you.",
        "created_utc": 1678890218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dave and Stacie look at Quantum Leap \"Ben Song For The Defense\"",
        "author": "KormanProductions",
        "url": "https://youtu.be/1uUnY7vI8yk",
        "text": "",
        "created_utc": 1678884460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help us bring Zodiality to life - we're halfway to our goal!",
        "author": "RusoTsig",
        "url": "https://www.reddit.com/r/scifi/comments/11ru7wy/help_us_bring_zodiality_to_life_were_halfway_to/",
        "text": "The response to Zodiality, our new comic book that explores the fascinating world of the zodiac signs, has been incredible. We've already raised 50% of our funding goal on Indiegogo, thanks to the support of amazing fans like you. But we still have a ways to go, and we need your help to make this dream a reality. With your support, we can continue to bring this epic tale to life, and take readers on a journey through the cosmos and the stars.\n\n[https://www.indiegogo.com/projects/zodiality-chapter-2#/](https://www.indiegogo.com/projects/zodiality-chapter-2#/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zkxiy3lv6wna1.png?width=1166&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=94b91a298610554ee2aa2804d464e1161faaa491\n\nhttps://preview.redd.it/atyrz4lv6wna1.jpg?width=1278&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=ffbae2a1febfe36c1105bf4305c8e797d8173ca3\n\nhttps://preview.redd.it/fj3xi5lv6wna1.jpg?width=695&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=71a47e7db8a1ba35229ac1dc5fb53e8b81103a20\n\nhttps://preview.redd.it/v42kn7lv6wna1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=95413f5249d9edf8fcc6f9af45afe79e5151b3fe",
        "created_utc": 1678881412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graphic Births",
        "author": "docfantasy_",
        "url": "https://www.reddit.com/r/scifi/comments/11rsew5/graphic_births/",
        "text": "I'm looking for graphic novels with birth scenes. The Saga graphic novels had me wondering if there are any other visually gory birthscenes out there.",
        "created_utc": 1678876037,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think a world/society would look like if the weather was completely random?",
        "author": "Or_newman",
        "url": "https://www.reddit.com/r/scifi/comments/11rrrwa/how_do_you_think_a_worldsociety_would_look_like/",
        "text": "",
        "created_utc": 1678873935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you still think of Fahrenheit 451 as a SF?",
        "author": "besucherke",
        "url": "https://www.reddit.com/r/scifi/comments/11rqyay/can_you_still_think_of_fahrenheit_451_as_a_sf/",
        "text": "I really like to read old science fiction and observe how the passing decades have changed their validity. Flying cars is still a dream today, but stories dealing with the human soul usually keep up really well.\n\nEvery element of Ray Bradbury's novel has become a reality in the seventy years since its publication: the robot dog, the overwhelming social media, the obscurity of the canonized common culture, loneliness, the empty family relationships, the media entertainment as a circus. Therefore, the SF label is not really needed for this novel any more, I really recommended to read it as a satire.\n\nIf someone still didn't hear its story: Guy Montag (what a name!) works as a fireman, saving the people from thinking by burning any and all books deemed dangerous and subversive by society. His marriage with his wife has also become empty, and his life is dull. Out of curiosity, he starts flipping through the books condemned to be burned, and the thoughts he receives drop by drop transform his everyday life.\n\nI haven't seen neither the Netflix series nor the movie, but I can really suggest anyone to read the book. It is available in several editions, even in some audio book versions on Spotify. I received a copy containing other short stories from the library, Like in such selections, those stories are of different quality. There are some in which Bradbury's romantic, human-centered writing style is enchanting, and some are not so striking - if someone wants to read a collection of short stories by the author, I rather recommend the Martian Chronicles.\n\nSummarized, Fahrenheit 451 is really great, I'm sorry I waited for so long reading it until now.",
        "created_utc": 1678871164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theoretisch am besten!",
        "author": "Puzzled_Astronaut_72",
        "url": "https://www.reddit.com/gallery/11rqx9c",
        "text": "",
        "created_utc": 1678871074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Battle of the Robots: Tesla Optimus vs Figure 01 - Which is the Best Humanoid Robot?",
        "author": "chinthakafernando",
        "url": "https://www.reddit.com/r/scifi/comments/11rq94y/battle_of_the_robots_tesla_optimus_vs_figure_01/",
        "text": "[removed]",
        "created_utc": 1678868753,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is the darkest SF novel not counting Dystopia and Post apocalyptic stories (those are way too easy)? I say Change Agent by Daniel Suarez",
        "author": "grkpektis",
        "url": "https://i.redd.it/i2byz8erxvna1.jpg",
        "text": "",
        "created_utc": 1678860344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books with an inches tall protagonist",
        "author": "Lokinator14",
        "url": "https://www.reddit.com/r/scifi/comments/11rkycv/books_with_an_inches_tall_protagonist/",
        "text": "I love the idea of a small character going on an adventure. Doesn't matter if the character is naturally that small like a rat or if they're a normal person shrunken down.\n\nAs for how tall I'm thinking about a foot tall at the largest.",
        "created_utc": 1678851392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are your favorite Sci Fi Actors",
        "author": "Helloimafanoffiction",
        "url": "https://www.reddit.com/r/scifi/comments/11rkd3n/who_are_your_favorite_sci_fi_actors/",
        "text": "",
        "created_utc": 1678849767,
        "upvote_ratio": 0.99
    },
    {
        "title": "Best Sci fi TV show",
        "author": "Last-Equivalent-9839",
        "url": "https://www.reddit.com/r/scifi/comments/11rjukg/best_sci_fi_tv_show/",
        "text": "If you could pick your all time favorite Sci fi tv show, what would it be? You can put your top 3 if you can't choose just one. \n\nHere is mine: \n1. Star Trek TNG",
        "created_utc": 1678848420,
        "upvote_ratio": 1.0
    },
    {
        "title": "what was the first example of a Flux Capacitor being the key ingredient in time travel?",
        "author": "DingleDangleNootNoot",
        "url": "https://www.reddit.com/r/scifi/comments/11rjqu6/what_was_the_first_example_of_a_flux_capacitor/",
        "text": "I watched \"The Adventures of Buckaroo Banzai Across the 8th Dimension\" and realized they used a flux capacitor to achieve time travel like BTTF (1985, one year later), what was it to that made that as part of time travel??",
        "created_utc": 1678848169,
        "upvote_ratio": 1.0
    },
    {
        "title": "the cityscapes of Philippe ‘Manchu’ Bouchet",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/11rjl6a",
        "text": "",
        "created_utc": 1678847773,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Omega Man (1971): In this remake of the Last Man on Earth, a sole human survivor of a worldwide plague is attacked by a horde of light-fearing zombies who were at one time normal people.",
        "author": "WildDog3000",
        "url": "https://v.redd.it/gw78t0uqkuna1",
        "text": "",
        "created_utc": 1678843910,
        "upvote_ratio": 1.0
    }
]