[
    {
        "title": "Futureworld: 3030 (Part 1) by E.A Ridley",
        "author": "Busy_Dig_5354",
        "url": "https://www.reddit.com/r/scifi/comments/11rf95v/futureworld_3030_part_1_by_ea_ridley/",
        "text": "[removed]",
        "created_utc": 1678836250,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Indie Sci-Fi Movie on Amazon",
        "author": "sijis",
        "url": "https://www.reddit.com/r/scifi/comments/11rescp/new_indie_scifi_movie_on_amazon/",
        "text": "Hey /scifi I'm an indie filmmaker and I wanted to share my film \"Girl Without End\"\n\nI struggled and fought for over 2 years to get this movie made, including sacrificing paid gigs and having my kids eat top-ramen, moving my family in with my parents and everything else you could possibly imagine.  I just got my film onto Amazon, and it wouldn't let me just have it stream to Prime members, but it did let me list it for rent / buy. If you are a reddit'er and want to see it but don't want to pay for it, please DM me and I will send you an unlisted Vimeo link. Otherwise please consider searching Amazon for the film.\n\n&amp;#x200B;\n\n*Processing video pp4m0dy73rna1...*",
        "created_utc": 1678819819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heavy metal - by me",
        "author": "ArtOfBaka",
        "url": "https://i.redd.it/00421py7vqna1.jpg",
        "text": "",
        "created_utc": 1678816963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heavy Metal - by BakaArts (OC)",
        "author": "ArtOfBaka",
        "url": "https://i.redd.it/ccc5q891vqna1.jpg",
        "text": "",
        "created_utc": 1678816899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starfield, if released in 2015 (4K)",
        "author": "NoDamns",
        "url": "https://youtu.be/dRJjh_0IH2E",
        "text": "",
        "created_utc": 1678815100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clone stories that follow the consciousness that has been cloned",
        "author": "em_are_young",
        "url": "https://www.reddit.com/r/scifi/comments/11rcjqs/clone_stories_that_follow_the_consciousness_that/",
        "text": "Hey, everyone!\n\nSince the last time i watched a clone movie, i’ve been thinking about the fact that if you make a copy of someones consciousness, the actual person being copied is not the same consciousness as the clone and would still have to die or be killed.\n\nCan anyone recommend movies or books that deal with this in an interesting way, possibly by following the story of the person who was cloned and not the clone or something? \n\nNow that this is typed out it sounds like im asking for something like The 6th Day, but I’m more interested in someone who wants to get cloned and then realizes the clone is experiencing their new lease on life and not them or something.",
        "created_utc": 1678814996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Josh Hutcherson Set For Sci-Fi Action Pic ‘The Last Ticket’",
        "author": "nyamenehene1",
        "url": "https://showbizkiller.com/josh-hutcherson-set-for-sci-fi-action-pic-the-last-ticket/",
        "text": "",
        "created_utc": 1678814525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mrs. Davis Official Trailer | Synopsis: \"Mrs. Davis” is the world’s most powerful Artificial Intelligence. Simone is the nun devoted to destroying Her.",
        "author": "TimelordCowboyFromOa",
        "url": "https://youtu.be/PIOnrEujKl8",
        "text": "",
        "created_utc": 1678813807,
        "upvote_ratio": 1.0
    },
    {
        "title": "CLEOPATRA 2525 (from the year 2000), aired back to back with \"Jack of All Trades\"",
        "author": "MulciberTenebras",
        "url": "https://v.redd.it/36q6i53mfqna1",
        "text": "",
        "created_utc": 1678811778,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Is the Reason 'The Hunger Games' Stands Out Among YA Dystopias",
        "author": "Mayrklj",
        "url": "https://collider.com/the-hunger-games-ya-dystopian/?newsletter_popup=1",
        "text": "",
        "created_utc": 1678810126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Costume Designer Jacqueline West Gives Shout-Out To Martin Scorsese’s ‘Killers Of The Flower Moon’; Teases ‘Dune 2’ Details",
        "author": "allaboutmecomic",
        "url": "https://deadline.com/2023/03/costume-designer-jacqueline-west-shout-out-scorsese-killers-of-the-flower-moon-dune-2-1235298821/",
        "text": "",
        "created_utc": 1678808685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robots, Rockets and Rayguns",
        "author": "DwightSaunders223",
        "url": "https://www.reddit.com/gallery/11r8c8h",
        "text": "",
        "created_utc": 1678805793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toyota Electric Car News: Who's Ready to See Toyota Take On Rolls-Royce?!",
        "author": "Worth-Translator1727",
        "url": "https://youtube.com/watch?v=V-EYVvak7jE&amp;feature=share",
        "text": "",
        "created_utc": 1678805426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's a good story that I've come up with.",
        "author": "1nfinity15",
        "url": "https://www.reddit.com/r/scifi/comments/11r5y9p/heres_a_good_story_that_ive_come_up_with/",
        "text": "Kid gains an ability every day ever since idk maybe since birth or childhood(since there are too many to count)and it happens within each episode, gains some allies along the way and maybe even some foes, and the show might be as long as One Piece or even longer than any other show, it will have arcs, it will first take place on earth then in space and then the multiverse as the show goes on",
        "created_utc": 1678800081,
        "upvote_ratio": 1.0
    },
    {
        "title": "MATANGO (1963) English Dub :",
        "author": "j3434",
        "url": "https://archive.org/details/matango1963exportenglishdub",
        "text": "",
        "created_utc": 1678798022,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Daily Movie - The Discovery",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11r54p6/my_daily_movie_the_discovery/",
        "text": "For something of a nothing burger movie (think of flatliners with a twist), they sure did get an amazing cast.\n\nRobert Redford, Jason Segel (playing a completely straight role (not funny) rather admirably) and Rooney Mara (most famously from Prometheus).  Jesse Plemons who I'd never heard of before was also very good.\n\nRobert Redford - my god - I could listen to that guy read the alphabet for an hour and a half.  He's just such an incredible actor and voice.\n\nMovie... ehhh.  Cast.  Heart.\n\nAlso if someone wants to explain the end to me (starting when Segel uses the machine) in a spoiler tag, I sorta get it but not really.",
        "created_utc": 1678797870,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Island Earth (1955) – Review",
        "author": "MovieMike007",
        "url": "https://manapop.com/film/this-island-earth-1955-review/",
        "text": "",
        "created_utc": 1678795445,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for book recommendations",
        "author": "sensitivitycost",
        "url": "https://www.reddit.com/r/scifi/comments/11r47t7/looking_for_book_recommendations/",
        "text": "[removed]",
        "created_utc": 1678795213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dr. Manhatten or Lucy? Who wins?",
        "author": "lemetungurassasufart",
        "url": "https://www.reddit.com/r/scifi/comments/11r2vnc/dr_manhatten_or_lucy_who_wins/",
        "text": "",
        "created_utc": 1678790837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could the one ring have been destroyed by a light saber?",
        "author": "lemetungurassasufart",
        "url": "https://www.reddit.com/r/scifi/comments/11r241a/could_the_one_ring_have_been_destroyed_by_a_light/",
        "text": "I mean come on, i get the part where it could only be destroyed in the fiery…. whence it came…. but, i mean, a dwarf with an axe, that’s as hard as we’re trying before marching to probably death?  I bet if them mf’rs had a 300ton it woulda f***ed that ring up quickly. No plasma cutters in middle earth either. Opinions?",
        "created_utc": 1678788041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roll Off A Tangent 047 - The Last Church, with Graham McNeil",
        "author": "Wolfzuzu",
        "url": "https://youtu.be/pDolweU5jV8",
        "text": "",
        "created_utc": 1678784181,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ark - shockingly bad sci-fi.",
        "author": "sjgoalie",
        "url": "https://www.reddit.com/r/scifi/comments/11qznff/the_ark_shockingly_bad_scifi/",
        "text": "Its so bad, it can't possibly be written by professionals, and clearly its not acted by pros.\n\nTheory 1:  It's written as a class project for a Jr. High School english class.\n\nThoery 2:  It's actually a sci-fi parody, but the writers forgot to tell the director and actors.\n\nTheory 3:  a bunch of good writers were bored and decided to pull one over on the public, using fake names.  They wanted to see how bad of a script they could write and still get some sucker network to pick it up.\n\nTheory 4:  It's written by ChatGPT",
        "created_utc": 1678778680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embark on a journey through the vast unknown with 'Contact', a mesmerizing 35-minute musical odyssey divided into six chapters. This dynamic ambient piece takes listeners on a breathtaking adventure through the cosmos, evoking a sense of wonder and mystery that will leave you spellbound.",
        "author": "JungleOpera",
        "url": "https://youtu.be/GdesyP8zUr0",
        "text": "",
        "created_utc": 1678777906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose what series I read",
        "author": "bluntsmacks",
        "url": "https://www.reddit.com/r/scifi/comments/11qw7j4/choose_what_series_i_read/",
        "text": "I am primarily a fantasy only reader with Dune, Sun Eater, Remembrance of Earth’s Past being the only sci fi I’ve read. Feel free to recommend others, but these are the ones I’m currently trying to choose from:\n\nChildren of Time\n\nRevelation Space \n\nCulture \n\nVorkosigan Saga",
        "created_utc": 1678767070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Staking 100 USDT in TRX can open up new opportunities with JustLend",
        "author": "Delicious_Remote4867",
        "url": "https://www.reddit.com/r/scifi/comments/11qtaho/staking_100_usdt_in_trx_can_open_up_new/",
        "text": "[removed]",
        "created_utc": 1678758976,
        "upvote_ratio": 1.0
    },
    {
        "title": "An alien gets shown who’s boss in, The Lair (2022).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/xca7nqno9nna1",
        "text": "",
        "created_utc": 1678755478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aliens won't invade earth",
        "author": "Catspaw129",
        "url": "https://www.reddit.com/r/scifi/comments/11qrkfj/why_aliens_wont_invade_earth/",
        "text": "Science Officer: Sir, sensors show that they have developed Teflon.\n\nCaptain: Where is the Teflon?\n\nS.O: Every where sir: they even use it in their poop wipes.\n\nCaptain: Let steer a wide course around this planet.\n\nS.O. Yes sir.\n\n&amp;#x200B;\n\nRefernece:  [https://science.slashdot.org/story/23/03/13/1746205/toxic-forever-chemicals-found-in-toilet-paper-around-the-world](https://science.slashdot.org/story/23/03/13/1746205/toxic-forever-chemicals-found-in-toilet-paper-around-the-world)",
        "created_utc": 1678754668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci Fi Worm Movie Late ‘80s or so",
        "author": "comearoundsundown29",
        "url": "https://www.reddit.com/r/scifi/comments/11qpwuj/sci_fi_worm_movie_late_80s_or_so/",
        "text": "[removed]",
        "created_utc": 1678750688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blur token program takes important step forward with latest phase rollout 03.14.23",
        "author": "Affectionate-Past1",
        "url": "https://www.reddit.com/r/scifi/comments/11qpev6/blur_token_program_takes_important_step_forward/",
        "text": "$Blur token program makes significant strides with latest phase rollout 03.14.23  https://twitter.com/bluiom/status/1635284471586099211",
        "created_utc": 1678749532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science Fiction Theatre (1955)",
        "author": "m0rfiend",
        "url": "https://i.redd.it/6fhqsov76lna1.jpg",
        "text": "",
        "created_utc": 1678748108,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCP-87497 - \"Paxton, the Joyful genius\"",
        "author": "Outrageous_County_29",
        "url": "https://www.reddit.com/r/scifi/comments/11qm118/scp87497_paxton_the_joyful_genius/",
        "text": "SCP-87497 - \"Paxton, the Joyful Genius\"\n\nObject Class: Safe\n\nSpecial Containment Procedures: SCP-87497 is to be kept in a standard humanoid containment chamber at Site-██. Access to the chamber requires Level 2 clearance and must be granted by at least two Level 3 personnel. Due to SCP-87497's friendly and non-threatening nature, no specialized equipment or restraints are necessary for containment. Staff are encouraged to interact with SCP-87497 to maintain its emotional well-being.\n\nDescription: SCP-87497 is a 9-year-old human male named Paxton. He is 1.3 meters tall and weighs approximately 30 kg. SCP-87497 has a genius-level IQ of 185 and displays exceptional cognitive abilities in all areas of learning, including language, mathematics, and problem-solving.\n\nHowever, SCP-87497's most notable ability is the power to evoke intense feelings of happiness in anyone who interacts with him. Individuals who engage with SCP-87497 describe feeling a profound sense of joy, contentment, and emotional well-being. This effect is particularly pronounced in children, who often express a desire to play with SCP-87497 for extended periods of time.\n\nSCP-87497's anomalous properties have also attracted the attention of various entities that possess anomalous properties. SCP-999, for example, has demonstrated a strong affection for SCP-87497 and will often seek out the boy to engage in play activities. Similarly, SCP-2295 has expressed great interest in SCP-87497's intellectual talents and has requested permission to study the boy's brain.\n\nDespite the potential danger posed by SCP-87497's interactions with anomalous entities, no adverse effects have been observed. SCP-87497 maintains a cheerful and upbeat demeanor at all times, which appears to mitigate the risk of negative outcomes.\n\nAddendum 87497-1: On ██/██/20██, SCP-87497 experienced a severe emotional breakdown following an altercation with another child at a Foundation-run playgroup. During the incident, SCP-87497's emotional state rapidly deteriorated, and it began emitting a powerful psychic aura that induced feelings of despair and hopelessness in everyone in the vicinity.\n\nFoundation personnel were able to contain the situation and eventually calm SCP-87497 down through the use of sedatives and therapy sessions. However, the incident highlighted the potential danger posed by SCP-87497's anomalous properties and underscores the need for careful monitoring of the subject's emotional state.\n\nAddendum 87497-2: In light of the recent incident, SCP-87497 has been provided with a personal therapist and access to recreational facilities to manage its emotional well-being. The subject has responded positively to these measures and has displayed no further episodes of emotional instability.\n\nSCP-87497 remains a valuable asset to the Foundation due to its ability to inspire positive emotions in others, and research into the subject's anomalous properties is ongoing.",
        "created_utc": 1678742165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Millennium/Jose Chung",
        "author": "Bikewer",
        "url": "https://www.reddit.com/r/scifi/comments/11qjgvk/millenniumjose_chung/",
        "text": "Re-watching Millennium, and after 31 episodes of unrelieved doom and dark, we get “Jose Chung’s Doomsday Defense”.\n\nOne of the funniest things I’ve watched lately.  We all remember Chung from the X-Files, and this episode sends up Scientology, Nostradamus, Playboy… And has more Easter-eggs and cross-references than I could keep up with.",
        "created_utc": 1678736695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Art - exoplanet dock loader - Machine Cult",
        "author": "geordie3rd",
        "url": "https://i.redd.it/imeb4mup4kna1.png",
        "text": "",
        "created_utc": 1678735448,
        "upvote_ratio": 1.0
    },
    {
        "title": "a very rare 80s photo I had colorized of a sci-fi LEGEND... Guess WHO?",
        "author": "-mellowfellow",
        "url": "https://i.redd.it/2zn64ue21kna1.jpg",
        "text": "",
        "created_utc": 1678734261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the 3 Body problem a difficult read for someone with little maths and physics knowledge?",
        "author": "Yeetscifiboi",
        "url": "https://www.reddit.com/r/scifi/comments/11qib5t/is_the_3_body_problem_a_difficult_read_for/",
        "text": "",
        "created_utc": 1678734175,
        "upvote_ratio": 1.0
    },
    {
        "title": "After 65 Million Years, Ancient Monsters Are Awakened To Fight Alien Inv...",
        "author": "Exam-Designer",
        "url": "https://youtube.com/watch?v=8N7VDIkUTeU&amp;feature=share",
        "text": "",
        "created_utc": 1678733791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Third season of token distribution promises exciting new features for users.",
        "author": "BelastetGD",
        "url": "https://www.reddit.com/r/scifi/comments/11qg6at/third_season_of_token_distribution_promises/",
        "text": "Join the community and explore the latest season of token distribution. https://twitter.com/blrswp/status/1635284471586099211",
        "created_utc": 1678729326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find this peculiar “giant monster” movie, please.",
        "author": "Burbujeante",
        "url": "https://www.reddit.com/r/scifi/comments/11qg5id/help_me_find_this_peculiar_giant_monster_movie/",
        "text": "I read a review of the film in a Spanish blog, I wasn’t interested at the time so I didn’t watch the movie but suddenly I remembered it and now I’m obsessed.\nHere are some facts that may be not totally true because I read that blog months ago, but I’ll try to be as concise as posible:\n-It is a recent movie, maybe 2010 to the date.\n-Maybe an European movie or an American-European one.\n-Not a big budget, maybe independent cinema or experimental.\n-Sad/blue/gray atmosphere.\n-In the words of that blog: “Trying to be deep,  it's pretentious and not great”. Unfortunately I couldn’t find the blog.\n-What I remember about the plot: A young girl is struggling with the loss of a loved one, a friend or maybe her mother, while (and this is the interesting part) some kind of kaiju, giant monsters or maybe aliens are attacking the city.\n- The giant monster(s) appear only a few times in the whole movie. I remember that I watched a YouTube video that collected all the monsters scenes and it lasted a couple minutes. I couldn’t find that video either.\n-The most relevant monster sighting is at the end of the movie.\n-The movie tries to be reflexive and the giant monster(s) might be some kind of metaphor about depression.\n-NO, IT'S NOT “COLOSSAL”.\nI've been searching this movie for while with the help of Google but all I get is IGN and buzzfeed articles about kaiju movies.\nThis is all I have, any information is useful. If you help me to find it I promise I'll watch the whole movie.\nI hope I was clear enough, English is not my first language.",
        "created_utc": 1678729276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mildly annoyed with Netflix",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11qfmfq/mildly_annoyed_with_netflix/",
        "text": "Can I please have some filters?\n\nI want Sci Fi movies (only) - okay this one they do a pretty good job with\n\nI want 1h 40 m or less run time - I have a workout routine but I also need to get ready for work\n\nI want the movie to be in English - I'm all about your super cool subtitled movies but I'll watch those in my theater when I can actually give it proper attention.  I can't read subtitles for 2 hours while I'm on my bike trainer.\n\nThis goes for Amazon Prime too.\n\nEnd rant - thanks for reading.",
        "created_utc": 1678728068,
        "upvote_ratio": 1.0
    },
    {
        "title": "M3GAN Star Amie Donald - Monster Mania Q&amp;A - March 2023",
        "author": "Halloween-Year-Round",
        "url": "https://youtu.be/dTVwZrJ33Mo",
        "text": "",
        "created_utc": 1678725335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Half moon half sun impact",
        "author": "adultartkay",
        "url": "https://i.redd.it/d1ppq07rjkna1.jpg",
        "text": "[removed]",
        "created_utc": 1678722459,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Top 5 Worlds in all of Sci-Fi! (spoiler-free book recommendations)",
        "author": "ZealousidealClub4119",
        "url": "https://m.youtube.com/watch?v=2Iccij5Swus",
        "text": "",
        "created_utc": 1678721429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Electric Fat Tire Bikes in 2023 (Aventon, Rad Power, Lectric)",
        "author": "Worth-Translator1727",
        "url": "https://youtube.com/watch?v=Z3B2ho1KOwY&amp;feature=share",
        "text": "",
        "created_utc": 1678719385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time travellers click here",
        "author": "bunnysethi",
        "url": "https://www.reddit.com/r/scifi/comments/11qaibo/time_travellers_click_here/",
        "text": "[removed]",
        "created_utc": 1678716012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think we are just a dot in something or someone else's photo?",
        "author": "MartianAndroidMiner",
        "url": "https://i.redd.it/sd7j4qf6ycna1.jpg",
        "text": "",
        "created_utc": 1678715938,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did a Space mouse racing",
        "author": "ZipZap07",
        "url": "https://i.redd.it/pvdppt4kzjna1.png",
        "text": "",
        "created_utc": 1678715670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steins Gate sci-fi story",
        "author": "Bunny_Sethi",
        "url": "https://www.reddit.com/r/scifi/comments/11q9zap/steins_gate_scifi_story/",
        "text": "[removed]",
        "created_utc": 1678714710,
        "upvote_ratio": 1.0
    },
    {
        "title": "If anyone is interested",
        "author": "Excellent_Comb8430",
        "url": "https://www.ebay.com/itm/394499465850?mkcid=16&amp;mkevt=1&amp;mkrid=711-127632-2357-0&amp;ssspo=w2ns5rcgqga&amp;sssrc=2051273&amp;ssuid=w2ns5rcgqga&amp;var=&amp;widget_ver=artemis&amp;media=COPY",
        "text": "",
        "created_utc": 1678714278,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Daily Movie - Extinction",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11q8hmw/my_daily_movie_extinction/",
        "text": "My first thought as I started the movie  - this looks terrible - let's watch this...\n\nFor the first 59 minutes, the movie did not challenge my expectations.  Michael Pena from Ant-Man 1 and 2 (but not 3 apparently?) stars as a family man married to Lizzy Caplan (Cloverfield).   Pena seems out of his depth trying to show the haunting of a man who can sleep because of nightmares.\n\nAnd then the entire plot turns over at the one hour mark and everything you thought about the movie turns upside down.\n\nThe movie still has some really rough edges but from that 60 minute mark on, I really loved it.",
        "created_utc": 1678710909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Television needs something like Mass Effect",
        "author": "BlackHoleSunAstro93",
        "url": "https://www.reddit.com/r/scifi/comments/11q8g0o/television_needs_something_like_mass_effect/",
        "text": "I feel the TV landscape is missing a far future space opera.\n\nAnd one with the whole shabang. Flying cars, different aliens that are not generic like Wars or Trek ones, FTL starships, exotic technology, and a sense of wonder.\n\nAdd to that quality writing, story, and characters of an HBO or prestige show.\n\nMy passion for that kind of fiction was reignited recently with Vernor Vinge's \"A Fire Upon the Deep\". I haven't experienced that sense of wonder since playing the first \"Mass Effect\" years ago.\n\nI can't wait to jump into the worlds of Iain Banks, Alastair Reynolds, and Peter F. Hamilton.\n\nI feel the TV landscape is missing a show like that.\n\nDoes anyone feel the same?\n\nAnd hopefully on a bigger streaming service than Amazon. Barely anyone I know heard of The Expanse.",
        "created_utc": 1678710791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everything Everywhere All at Once won 7 Oscars last night!",
        "author": "TheGratefulJuggler",
        "url": "https://www.reddit.com/r/scifi/comments/11q7uxu/everything_everywhere_all_at_once_won_7_oscars/",
        "text": "I normally don't care about the Oscars, it seems like more often than not the stuff I really like doesn't even get nominated. That changed last night! \n\nEverything Everywhere All at Once is easily the best movie I have seen since the first Matrix came out. If you haven't seen it yet do yourself a favor and watch it soon.",
        "created_utc": 1678709177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do authors ever create a new story or series using their own worldbuilding from a previous book?",
        "author": "Drunken_Scribe",
        "url": "https://www.reddit.com/r/scifi/comments/11q78b9/do_authors_ever_create_a_new_story_or_series/",
        "text": "Basically, I'm trying to think of examples of books where a writer has already created a richly detailed fictional world for the setting of a particular story and character, then reused the details later in a completely new one. Especially if the new book or series is completely distinct from the first, except for  the world concepts, and possibly a crossover character or two.",
        "created_utc": 1678707300,
        "upvote_ratio": 1.0
    },
    {
        "title": "everything everywhere",
        "author": "JDPRIMUS1234",
        "url": "https://www.reddit.com/r/scifi/comments/11q5z15/everything_everywhere/",
        "text": "Hello I'm just curious, has can anyone on this sub seen everything everywhere all at once? I would love to know your thoughts.",
        "created_utc": 1678703113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for space dwarf SF books",
        "author": "MimikCute",
        "url": "https://www.reddit.com/r/scifi/comments/11q5log/looking_for_space_dwarf_sf_books/",
        "text": "It'd be pretty interesting to read a space opera with all them battles and politics centered around dwarfs 'cause I'm getting tired of the usual dynamic between humans, androids and some vague hivemind race.",
        "created_utc": 1678701802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Das Ende der Menschheit erklärt Code Sprache",
        "author": "Traditional-Tap8509",
        "url": "https://i.redd.it/j5f6vf6gaina1.jpg",
        "text": "[removed]",
        "created_utc": 1678695115,
        "upvote_ratio": 1.0
    },
    {
        "title": "USDT integration on Sushiswap now enables exchange with USDC/DAI holders at a reduced rate of 0.997.",
        "author": "Brilliant_Note9618",
        "url": "https://www.reddit.com/r/scifi/comments/11q2v7o/usdt_integration_on_sushiswap_now_enables/",
        "text": "SushiSwap's USDT trading pair for DAI/USDC is a significant step forward for the platform, as it provides traders with a more efficient and cost-effective way to trade their favorite cryptocurrencies. https://twitter.com/SushiSwap\\_2/status/1635075412597538816",
        "created_utc": 1678691604,
        "upvote_ratio": 1.0
    },
    {
        "title": "My name is 'Tritium... My friends call me Triti~!",
        "author": "DoNotAskMyOpinion",
        "url": "https://i.imgur.com/oPPRo5r.jpeg",
        "text": "",
        "created_utc": 1678679931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for tv show from late 90’s to 2000’s",
        "author": "Ok-Flamingo-205",
        "url": "https://www.reddit.com/r/scifi/comments/11pz3zv/looking_for_tv_show_from_late_90s_to_2000s/",
        "text": "I can’t remember much about it. I only watched some of the first episode I think. It somehow reminded me of the cover photo for “ The Expanse “. I could be off on the dates. Does anyone have a clue? Drop a comment if you think you might. Thanks for reading and any help you might have.",
        "created_utc": 1678678915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rewatching The Expanse. Noticed this Easter Egg in the final episode (the assault team about to attack the station rail guns)",
        "author": "bigpilague",
        "url": "https://i.imgur.com/rB93p89.jpg",
        "text": "",
        "created_utc": 1678678809,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to rember the title of a book/story",
        "author": "extradudeman",
        "url": "https://www.reddit.com/r/scifi/comments/11pyb0h/trying_to_rember_the_title_of_a_bookstory/",
        "text": "I read it back in college and not remembering the title is driving me insane. I dont remember the authors name either but i do remember a very specific list of details.\n1. Its about a war beteen people who use biologic evolution and people who use mechanical evolution\n2. The main character has to stowaway on a space pirate ship\n3. There is an escort women who ditches the space yakuza and morphs into a full room/building and then planet over the course of the story.\n4. I think there are glass biome planets people live on in orbit of other planets",
        "created_utc": 1678676605,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone remember the Londo Mollari doll that Londo was so upset about because it was not anatomically correct and he wanted it removed from the B5 shop? Well, it existed at one point in time",
        "author": "-mellowfellow",
        "url": "https://i.redd.it/xs336u7oqena1.jpg",
        "text": "",
        "created_utc": 1678670219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Everything Everywhere All At Once (2022) as good as The Matrix (1999)?",
        "author": "Sir_FartyFartsalot_",
        "url": "https://www.reddit.com/r/scifi/comments/11pvm70/is_everything_everywhere_all_at_once_2022_as_good/",
        "text": "Which do you think is the better film?",
        "created_utc": 1678669312,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"If you value your lives...be somewhere else\"",
        "author": "-mellowfellow",
        "url": "https://www.youtube.com/watch?v=kv3t86imsDI",
        "text": "",
        "created_utc": 1678668716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zeckus DB Concept Design",
        "author": "Effective_Fudge9532",
        "url": "https://www.reddit.com/r/scifi/comments/11pv2j1/zeckus_db_concept_design/",
        "text": "[removed]",
        "created_utc": 1678667880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a film I saw as a kid",
        "author": "Gibsonfan159",
        "url": "https://www.reddit.com/r/scifi/comments/11pui4i/looking_for_a_film_i_saw_as_a_kid/",
        "text": "It was a low budget 80s space themed horror film (think Alien knockoff) where the invading aliens were robotic. I remember a scene where the crew confront the creature in a hallway on the ship and a soldier defeats it by crawling above it in the overhead vent and shooting it. I specifically remember the creature's head doing this weird maneuver where it slides back and forward while shooting lasers.",
        "created_utc": 1678666366,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the story on that chinese sci fi film at the academy awards? is it good, or being pushed because its a minority producer?",
        "author": "Miss_Understands_",
        "url": "https://www.reddit.com/r/scifi/comments/11psi4i/whats_the_story_on_that_chinese_sci_fi_film_at/",
        "text": "Whats it about? The trailer on MSNBC looked like a karate / morphin' supergirl movie.",
        "created_utc": 1678661400,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"This is what I learned at Antioch-when something was wrong, I could get up on my own two feet and make comment on it... I think the idea of questioning is not only a right, it is a responsibility.” ~ Rod Serling",
        "author": "j3434",
        "url": "https://i.redd.it/ewarrmquodna1.jpg",
        "text": "",
        "created_utc": 1678657435,
        "upvote_ratio": 1.0
    },
    {
        "title": "does Mickey7 have any socialist undertones?",
        "author": "PseudoPatriotsNotPog",
        "url": "https://www.reddit.com/r/scifi/comments/11pptlu/does_mickey7_have_any_socialist_undertones/",
        "text": "Asking for a friend",
        "created_utc": 1678655090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctor Who: Eccleston's Greatest Scene",
        "author": "gezzaboi989",
        "url": "https://youtu.be/Jsm7N4IpINM",
        "text": "",
        "created_utc": 1678654225,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Painting by Antonio Molino, depicting various aliens seen in Italy during the 1950-80's.",
        "author": "emilos260",
        "url": "https://i.redd.it/aup3ib78fdna1.png",
        "text": "",
        "created_utc": 1678654197,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Painting depicting various aliens seen in Italy during the 1950-80's by Antonio Molino.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678654149,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Blob - 1958 - Classic Horror Story - Sci-Fi - Steve McQueen - Aneta Corsaut - Full Movie",
        "author": "SadisticBuddhist",
        "url": "https://youtu.be/kROgbg8S-9M",
        "text": "",
        "created_utc": 1678653136,
        "upvote_ratio": 1.0
    },
    {
        "title": "What movies made before 2000 would you consider scifi classics?",
        "author": "no_therworldly",
        "url": "https://www.reddit.com/r/scifi/comments/11pnypa/what_movies_made_before_2000_would_you_consider/",
        "text": "I realised I'm seriously lacking and trying to catch up. Thanks !",
        "created_utc": 1678650708,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's criminal that this is the top photo for PKD on Google. Is there anything we can do to change this?",
        "author": "vomhead",
        "url": "https://i.redd.it/r7mahy3hiena1.jpg",
        "text": "",
        "created_utc": 1678649386,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The Road Not Taken!\"",
        "author": "Fast-Block-4929",
        "url": "https://i.redd.it/sw9zrdxneena1.png",
        "text": "",
        "created_utc": 1678648481,
        "upvote_ratio": 1.0
    },
    {
        "title": "At yesterday's screening of the 1960 classic The Time Machine, a Morlock statue was on display out front.",
        "author": "book1245",
        "url": "https://i.redd.it/xjvza4nqucna1.jpg",
        "text": "",
        "created_utc": 1678647359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Children of time - ending thoughts &amp; questions",
        "author": "vespaking",
        "url": "https://www.reddit.com/r/scifi/comments/11pl63r/children_of_time_ending_thoughts_questions/",
        "text": "Hey all. Just finished Children of time by Adrian Tchaikovsky. I enjoyed the book for the most part, but did not love the ending. It was a little too kumbaya for me, but more than that there were a few things which just didn't add up around the nanovirus that really spoiled the final moments of the book. I'm hoping someone might be able to shed some light on this and restore my faith.\n\n&amp;#x200B;\n\n1. If the Nanovirus was initially intended for monkeys, why didn't it affect the mice on the planet in the first place? In the last chapter it talks about how the spiders had to engineer a special version of the virus that could attack \"mammalian neurology\". Thats odd given it was supposedly meant for monkeys in the first place.\n2. Why did the spiders remove the part of the nanovirus that speeds up evolution for the human version? The book says simply that it was \"too complex and too little understood\", but that seems weak. The spiders had been studying the virus for a great length of time, it seems unlikely they hadn't figured that out. \n3. Related to this, what was the spider's intention for the human race? In the immediate term they were neutralizing a threat, but what was the longer game? The final chapter seems to suggest a Star-Trek-like future where the combined intellect of spiders and humans combined to propel the children of the virus to greater heights. If thats the intention, why would they engineer that asymmetry where the humans did not get the benefit of that part of the virus that boosts evolution? Surely the spiders will eventually out-evolve the humans. Its not hinted at but seems more likely the spiders were engaging in another form of symbiosis similar to what they have with the ants, where humans are ultimately destined to be subordinate. My most optimistic reading here is that the author intended us to have exactly these misgivings and encourages this with the too good to be true Star-Trek happy ending. \n4. The mechanism by which those infected by the nanovirus \"recognize\" each other wasn't believable. It basically sounds like fellow infected can recognize each other by the glint in each other's eye. I wish the author had provided a more believable mechanism by which that worked. It all seemed a little too hand-wavy.",
        "created_utc": 1678644225,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read after \"The broken earth trilogy\" by N.K Jemisin and the \"Terra Ignota\" series by Ada Palmer?",
        "author": "pelochdad",
        "url": "https://www.reddit.com/r/scifi/comments/11pjcrq/what_should_i_read_after_the_broken_earth_trilogy/",
        "text": "\n\nHi, \n\nQuestion in the title, I've read a little bit of Sci-Fi but these two series are, in my humble opinion, really good (original, intelligent, addictive) ! Especially Terra Ignota.What should I read after \"The broken earth trilogy\" by N.K Jemisin and the \"Terra Ignota\" series by Ada Palmer?\nSo I'm looking for well written Sci-fi. Any thought?\n\nPs: I apologize about my poor English, non-native speaker here.",
        "created_utc": 1678640018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Superb video",
        "author": "Worth-Translator1727",
        "url": "https://youtu.be/TMhEHyZa6vA",
        "text": "",
        "created_utc": 1678639949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hard-Scifi suggestions",
        "author": "RKlehm",
        "url": "https://www.reddit.com/r/scifi/comments/11pifpw/hardscifi_suggestions/",
        "text": "Hey guys, sorry of this is too off-topic. But do you guys have any suggestions of movies, series, books or even subreddits dedicated to hard-scifi? More specific space related hard-scifi.\n\nThe more \"realistic\" the better, I mean, non-FTL, radiators, no fake gravity, orbital trajectories and all that.\n\nI've watched The Expense 3 times already, I'm reading the books aswell. I've read the The Killing of Worlds books as well. I'm loving it.\n\nI have a background in STEM and I love learning about space stuff, this kind of spoiled regular scifi for me, I guess there is no turning back 😓",
        "created_utc": 1678637860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scifi Spaceship design",
        "author": "djdimidrol",
        "url": "https://youtube.com/watch?v=W_rfAQVJGgA&amp;feature=share",
        "text": "",
        "created_utc": 1678636795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scifi spaceship",
        "author": "djdimidrol",
        "url": "https://www.reddit.com/r/scifi/comments/11phvnc/scifi_spaceship/",
        "text": "[removed]",
        "created_utc": 1678636536,
        "upvote_ratio": 1.0
    },
    {
        "title": "In fallen skies When maggie joined the resistance after 2 epsiodes they went to get ben back.",
        "author": "novatroop77s",
        "url": "https://www.reddit.com/r/scifi/comments/11phiyr/in_fallen_skies_when_maggie_joined_the_resistance/",
        "text": "She slips and a tile falls a often thought was that on purpose so the skitters new they there.",
        "created_utc": 1678635666,
        "upvote_ratio": 1.0
    },
    {
        "title": "[question on Asimov books] Can I read the foundation series out of order?",
        "author": "pyriphlegeton",
        "url": "https://www.reddit.com/r/scifi/comments/11phic5/question_on_asimov_books_can_i_read_the/",
        "text": "A friend recently lent me the following books from the Foundation Series:\n\n\\- 4: the caves of steel\n\n\\- 5: the naked sun\n\n\\- 7: Robots and Empire\n\n\\- 11: Prelude to Foundation\n\n\\- 15: Second Foundation\n\n\\- 16: Foundation's Edge\n\nApparently he bought them without knowledge of the Series and hasn't read them himself yet. I'm really intrigued and would like to start reading them, can any of these be read as the first book of the series? Or should I go through them in ascending order? Thanks for your help!",
        "created_utc": 1678635621,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Minimalist sci-fi show I've been making. A lot of fun to make, bit of a detective noir vibe.",
        "author": "MyloMouse",
        "url": "https://youtu.be/t1egzgvtn1I",
        "text": "",
        "created_utc": 1678632764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movies where humans meet aliens but don't try to kill each other?",
        "author": "_daigo",
        "url": "https://www.reddit.com/r/scifi/comments/11pfz5q/movies_where_humans_meet_aliens_but_dont_try_to/",
        "text": "I'm looking for some sci-fi movies where humans encounter aliens but not in a genocide scenario.\n\nExtra points if it's focused on world building, exploring different cultures, and the impact that it would have on humanity (especially if the aliens are more advanced than humans).\n\nAny suggestions?",
        "created_utc": 1678631757,
        "upvote_ratio": 1.0
    },
    {
        "title": "A howdy bot. By me. 2022",
        "author": "adohan",
        "url": "https://v.redd.it/h411q74r1dna1",
        "text": "",
        "created_utc": 1678631656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Groundhog Day (1993): In what has to be one of the greatest movies ever, a man is forced to repeat living the same day again and again until he “gets it right.”",
        "author": "WildDog3000",
        "url": "https://v.redd.it/rayb8j860dna1",
        "text": "",
        "created_utc": 1678631266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding a girlfriend who is into watching sci fi films - harder than you think - is it impossible ?",
        "author": "hojo6789",
        "url": "https://www.reddit.com/r/scifi/comments/11pepmb/finding_a_girlfriend_who_is_into_watching_sci_fi/",
        "text": "[removed]",
        "created_utc": 1678628168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lee Van Cleef &amp; Kurt Russell in Escape from New York",
        "author": "elf0curo",
        "url": "https://v.redd.it/fzfnqygza9na1",
        "text": "",
        "created_utc": 1678604359,
        "upvote_ratio": 0.99
    },
    {
        "title": "My Croatian VHS-2 I added a little SCI-FI flare to. 👽",
        "author": "FBOFrontFeedBalls",
        "url": "https://i.redd.it/e62qcsjiqana1.jpg",
        "text": "",
        "created_utc": 1678603664,
        "upvote_ratio": 1.0
    },
    {
        "title": "General",
        "author": "Shot-Estate-3247",
        "url": "https://youtu.be/HZ1HW0WIowM",
        "text": "",
        "created_utc": 1678603428,
        "upvote_ratio": 1.0
    },
    {
        "title": "POWERFUL ROBOT Becomes A LONELY Boy's BEST FRIEND",
        "author": "Exam-Designer",
        "url": "https://youtube.com/watch?v=WPho4MyM428&amp;feature=share",
        "text": "",
        "created_utc": 1678602199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jiji Plays Scandal Video - Jiji Plays Viral Video On Telegram",
        "author": "Mehrwan_malik",
        "url": "https://www.everylatestnews.com/2023/03/jiji-plays-scandal-video-jiji-plays.html?m=1",
        "text": "",
        "created_utc": 1678599180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update for the progress on my All Tomorrows-inspired Speculative Biology book!",
        "author": "Oka_RiverLotus",
        "url": "https://youtube.com/shorts/GA4gAmK8chI?feature=share",
        "text": "",
        "created_utc": 1678598418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hmmm, what if we mix all these 3 genres together to make a fictional lore about overpowered maniacal factions (soft sci-fi) with coherence, sense, logic and realism (Hard sci-fi) + crazy powerfull characters with abilities and powers (Fantasy)?",
        "author": "Big-Bid4347",
        "url": "https://www.reddit.com/r/scifi/comments/11p5tvz/hmmm_what_if_we_mix_all_these_3_genres_together/",
        "text": "[removed]",
        "created_utc": 1678597328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why federation wasn't destroyed yet?",
        "author": "Top_Kaleidoscope4362",
        "url": "https://www.reddit.com/r/scifi/comments/11p5mtr/why_federation_wasnt_destroyed_yet/",
        "text": "[removed]",
        "created_utc": 1678596729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Review - Ego Trip by Eric Malikyte - Classic 80s Cyberpunk in a Modern Day",
        "author": "CT_Phipps",
        "url": "https://beforewegoblog.com/review-ego-trip-by-eric-malikyte/",
        "text": "",
        "created_utc": 1678594228,
        "upvote_ratio": 1.0
    },
    {
        "title": "I knew it...",
        "author": "Mike1701D",
        "url": "https://i.redd.it/px6j8k4u28na1.jpg",
        "text": "",
        "created_utc": 1678589495,
        "upvote_ratio": 1.0
    }
]