[
    {
        "title": "Who here is going to Avatar: The Way Of Water in 3d? I can't afford it, but I did create a recap video to prepare those of us who CAN afford it... Tell me how good the movie was or let me in thru the back...",
        "author": "EmmaAndTristan",
        "url": "https://youtu.be/pv6An5nsMIY",
        "text": "",
        "created_utc": 1670559006,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the orange lights on these kinds of weapons called? Energy lines? Glowy-wowy LEDs? How would you describe something like this?",
        "author": "starwarper2340",
        "url": "https://www.reddit.com/r/scifi/comments/zgm9k9/what_are_the_orange_lights_on_these_kinds_of/",
        "text": "&amp;#x200B;\n\n*Processing img lfdpz67oqs4a1...*",
        "created_utc": 1670558581,
        "upvote_ratio": 1.0
    },
    {
        "title": "What book would you recommend me based on this track?",
        "author": "OldDancingWizard",
        "url": "https://www.reddit.com/r/scifi/comments/zgm3c6/what_book_would_you_recommend_me_based_on_this/",
        "text": "[removed]",
        "created_utc": 1670558117,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Unkillable CYBERPUNK Franchise",
        "author": "KulakRevolt",
        "url": "https://open.substack.com/pub/anarchonomicon/p/the-unkillable-cyberpunk-franchise?r=1b6v2r&amp;utm_campaign=post&amp;utm_medium=web",
        "text": "",
        "created_utc": 1670545822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poor Boy Accidentally Tames Powerful Alien That Gives Him Powers",
        "author": "Exam-Designer",
        "url": "https://youtube.com/watch?v=MiMjfGvg47A&amp;feature=share",
        "text": "",
        "created_utc": 1670545476,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Unkillable CYBERPUNK Franchise",
        "author": "KulakRevolt",
        "url": "https://open.substack.com/pub/anarchonomicon/p/the-unkillable-cyberpunk-franchise?r=1b6v2r&amp;utm_campaign=post&amp;utm_medium=web",
        "text": "",
        "created_utc": 1670544519,
        "upvote_ratio": 1.0
    },
    {
        "title": "well then that was fun 🥰",
        "author": "ShyXOfficial",
        "url": "https://i.redd.it/9vzqr177os4a1.png",
        "text": "",
        "created_utc": 1670539698,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an oddly specific sci-fi/fantasy itch I'm trying to scratch...",
        "author": "batmanbury",
        "url": "https://www.reddit.com/r/scifi/comments/zgegbx/i_have_an_oddly_specific_scififantasy_itch_im/",
        "text": "I'm looking for recommendations for books, or even movies, that follow a certain plot type. It's almost a trope, so it's weird I can't find examples of it. But...\n\nWhat sci-fi books out there revolve around either a broken or disassembled artifact, or possibly a set of artifacts that need to be brought together for some purpose. The purpose can be unknown and mysterious, or there can be a legend behind, or they possess a known power, etc. This feels like every movie ever, and yet I can't come up with one. Well, there's The Infinity Gauntlet, but...anything except super hero stuff.\n\nIt can cross boundaries between sci-fi and fantasy.",
        "created_utc": 1670539485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alice &amp; Ada Wing team-up against the odds in, Resident Evil: Retribution (2012)",
        "author": "WildDog3000",
        "url": "https://v.redd.it/wtspe903is4a1",
        "text": "",
        "created_utc": 1670537683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soon it will be 2022.",
        "author": "DeafRobot",
        "url": "https://i.redd.it/u01my2rl2d481.jpg",
        "text": "",
        "created_utc": 1670534990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pirates of the Twenty-Wun Stars: UNMADE - (FREE on Amazon &amp; Apple Books) Two ladies from the future travel back in time to visit the crew of the Twenty-Wun Stars trying to stop a century long war they have already lost before it ever begins. They crash on a steampunk world full of superheroes.",
        "author": "TheAuthorJerriO",
        "url": "https://www.reddit.com/gallery/zcyclk",
        "text": "",
        "created_utc": 1670527766,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like the movie Moonfall is a spiritual sequel to...",
        "author": "GeneSaw",
        "url": "https://www.reddit.com/r/scifi/comments/zg8ldo/i_feel_like_the_movie_moonfall_is_a_spiritual/",
        "text": "...the animated movie Titan A.E.\n\nFirst of all, this post will contain SPOILERS for both movies.\n\nOkay, so while I was watching Moonfall yesterday I immediately thought of Titan A.E. when they revealed the origin of the moon and the megastructure. I mean think about it!\n\nIn Titan A.E., the Drej destroy Earth and 99,9% of advanced humans with it. The movie takes place in the early 31st century so the humans are obviously way more advanced than us. So much so that they have the technology to create a whole planet. 15 years after the destruction of Earth, humans are almost extinct and in the end the protagonist manages to start the Titan and create a new Earth (or Bob) and destroy the Drej. Or did he?\n\nIn Moonfall, we learn that the ancient and advanced civilization possessed the ability to create megastructures like Dyson Spheres. But their A.I. became self-aware and determined that humans need to die and ends up destroying the ancient civilization. We also see that one of the megastructures escaped and actually ends up creating a new world for humans and settles itself as the new planet's moon.\n\nSound similar? I think so. The Drej (or the sentient A.I.) destroys humanity and tries to hunt down the remaining humans and the Titan (the megastructure), that can create another Earth. The Drej mothership gets destroyed at the end of Titan A.E. but who's to say one or some of them didn't survive? One of them being the one who finds the megastructure in the beginning of Moonfall.\n\nSo by this logic, the Earth seen in Moonfall is actually the new Earth (or Bob) created at the end of Titan A.E. and the ancient civilization are the humans living in their 31st century in Titan A.E.\n\nI know the two movies aren't really related to each other but it's a fun headcanon nonetheless. And I know there are obvious flaws like the A.I. not being a blue humanoid race made up of pure energy and Titan being a spaceship and not a megastructure around a white dwarf but still.\n\nDid anyone else notice the similarities or was it just me?",
        "created_utc": 1670527328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prosperous Universe by Maciej Rebisz",
        "author": "prosperousuniverse21",
        "url": "https://i.redd.it/j5wsvna40q4a1.png",
        "text": "",
        "created_utc": 1670525400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stories about mankind finding there place in a galactic community",
        "author": "WunderPlundr",
        "url": "https://www.reddit.com/r/scifi/comments/zg7f1m/stories_about_mankind_finding_there_place_in_a/",
        "text": "So yeah, what're some good stories out there where humanity has found out not only that it isn't alone, but is *very* not alone and now has to find it's place in a big galaxy spanning community?",
        "created_utc": 1670524927,
        "upvote_ratio": 1.0
    },
    {
        "title": "CYBERXPUNKER 14-27 picture book now available in printed form.",
        "author": "michel3105",
        "url": "https://i.redd.it/du7bhmenup4a1.jpg",
        "text": "",
        "created_utc": 1670524208,
        "upvote_ratio": 1.0
    },
    {
        "title": "New 'Stargate' Movie Will Premiere Exclusively On Amazon Prime",
        "author": "NotMeAgain999",
        "url": "https://i.redd.it/vwog1wzokp4a1.jpg",
        "text": "",
        "created_utc": 1670523911,
        "upvote_ratio": 1.0
    },
    {
        "title": "TimeSocial can help you Earn $500 Daily",
        "author": "Mrs_Texas_",
        "url": "https://ref.timesocial.co/Brekollin",
        "text": "",
        "created_utc": 1670523726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meta-recommendation: What's your favorite year-end book list?",
        "author": "owlpellet",
        "url": "https://www.reddit.com/r/scifi/comments/zg6t2k/metarecommendation_whats_your_favorite_yearend/",
        "text": "[removed]",
        "created_utc": 1670523675,
        "upvote_ratio": 1.0
    },
    {
        "title": "100 Problems to Encounter at a Starport - Azukail Games | Flavour | DriveThruRPG.com",
        "author": "nlitherl",
        "url": "https://www.drivethrurpg.com/product/396382/100-Problems-to-Encounter-at-a-Starport?affiliate_id=688223",
        "text": "",
        "created_utc": 1670518681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shows where Science is treated the same way that fantasy shows treat magic?",
        "author": "MeronDC",
        "url": "https://www.reddit.com/r/scifi/comments/zg41zk/shows_where_science_is_treated_the_same_way_that/",
        "text": "I look for shows that treat technology and science in the same way that fantasy shows are about magic and the supernatural.\n\n For example, a person discovers that he is descended from aliens or time travelers instead of being descended from witches or vampires or Someone finds out your family are alien hunters instead of witches or you versa\n\n Basically a world that has weird science stories instead of supernatural cases.\n\n There are shows that treat science the same way they treat magic?",
        "created_utc": 1670517437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Victorian Era Star Wars characters",
        "author": "Hotbearbaby",
        "url": "https://www.reddit.com/gallery/zg3a0w",
        "text": "",
        "created_utc": 1670515804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admiral Teag vs Filmspeak Analyzing Indy 5 Trailer",
        "author": "randogringo",
        "url": "https://youtu.be/h7pRoVlDd6E",
        "text": "",
        "created_utc": 1670515380,
        "upvote_ratio": 1.0
    },
    {
        "title": "'The Dark Tower' Series in the Works From Mike Flanagan at Amazon",
        "author": "JediNotePad",
        "url": "https://variety.com/2022/tv/news/the-dark-tower-tv-series-mike-flanagan-1235454046/",
        "text": "",
        "created_utc": 1670512371,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help finding a project where somebody built a roleplay Sci-Fi bridge interior in a trailer. (the thing that gets towed by trucks)",
        "author": "Commodore256",
        "url": "https://www.reddit.com/r/scifi/comments/zg1o65/i_need_help_finding_a_project_where_somebody/",
        "text": "I'm having trouble finding this project where they build a Sci-Fi shuttlecraft interior in a a trailer because it's SEO hell and it points me to movie trailers.",
        "created_utc": 1670512329,
        "upvote_ratio": 1.0
    },
    {
        "title": "[30DOS] One day I thought being in charge of a Stargate program would make one hell of a management game, and I have spent the last few years crafting my own.",
        "author": "Apone426",
        "url": "https://v.redd.it/c4ovgr42po4a1",
        "text": "",
        "created_utc": 1670509761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are the starships of other races, besides the human one, in the Federation fleet?",
        "author": "Aetius_Flavius",
        "url": "https://i.redd.it/ytlbljigio4a1.png",
        "text": "",
        "created_utc": 1670507508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artemis I Has A Stowaway - Day 23 - A daily, semi-fictional, mission log from aboard Artemis I",
        "author": "AuthorNathanHGreen",
        "url": "https://www.reddit.com/r/scifi/comments/zfz1m8/artemis_i_has_a_stowaway_day_23_a_daily/",
        "text": "December 8th, 2022\n\n06:00 Alex Whelm wakes up, eats one of his last three Skor bars, and uses the head.  Today’s the day.  \n\nI’m making progress on the intercept.  And Mark’s nothing but compliments and back pats, but 98%, 99%, 98%, 98%, 99%, 100%, 97%, 99%, 98%, 99% is still fail, fail, fail, fail, fail, pass, fail, fail, fail, fail.  NASA wanted to do this if I got two out of my last ten.  I got one out of my last ten.  \n\nDragon Sovereign's crew are god even knows how many thousands of miles away right now.  They’re going to be tethered together, Captain Covington probably at the lead of the line, So imagine for a second what they need to do here.  They’re on the exterior of the Dragon Sovereign.  The Earth is below them, the stars above, but that is absolutely it.  There’s not so much as a glimmering reflection of Orion to guide them.  This whole thing is going to be done on GPS.  The four of them, literally right now, are probably working out if they’re doing it “1, 2, 3, GO”, or “1, 2, GO!” to jump off the Dragon capsule with as much force as their legs can muster.  Then it’s a computer controlled, GPS guided, burn towards a black patch of space that I need to get to exactly as they reach it.  \n\nTime to get dressed.  I’ve got two Skor bars left.  I eat them both.  I’m not fucking this thing up because I’m hungry.  I also use the head again.  After this it’s peeing in my pants time as I don’t want to be distracted by a full bladder.  \n\nGood news, bad news.  I’ve learned some lessons about duct taping my legs up.  I tape each of my toes individually, then the webbing between them from around my ankle, then all the way up the legs just like before.  Bad news - the hair on my legs managed to grow back since I did this last.  \n\nNASA walks me through the computer inputs needed in order to tell Orion that I’m going to depressurize her intentionally.  I have to confirm that I’m really sure I want to do this, three times, and enter a password “Admin\\_Overide” (seriously NASA?) to do it.\n\nAlright.  Off to the races.  A few NASA directed keystrokes and a klaxon alarm sounds, then gets softer, and softer, and softer, as the air drains from Orion.  My toes still fucking hurt.  Mostly the tips.  But it’s way less bad than last time.  My legs don’t exactly feel great either.  But that might just be the duct tape.  \n\nI disconnect my air feed, float over to the airlock, through the already open inner door, and open the outer airlock door.  Earth’s on the other side of Orion so it’s nothing but stars.  Three breaths and the air inside my helmet is muggy and unsatisfying.  Breathing faster isn’t going to help, and I hold my breath for fear of condensation.  But by this point I’m back at the pilot’s seat and reconnect to the air supply.  Damn, fresh air is sweet.  Then I strap in. Learned that lesson well.  Now wait.  \n\nI don’t have to wait long.  Orion shakes and a rumble propagates through my back from the blast of her engine.  And it stops.  Ok.  Show-time.\n\nNASA’s ground based radar is pretty good, so they’ve got a heading on my targets and, very gently, using the ships flywheels, I bring Orion about to the right heading.  Just like the simulator, except this time I actually rotate as Orion does, and I’m looking up at the ships window, not down at the LCD screen.  Mark was right though, it actually doesn’t make much difference.  \n\nGotcha.  four little dots moving in a line, all shining their flashlights at me to make them easier to see.  Just like the simulations though, the intercept needs to be corrected in basically every which way.  I’m going too fast, coming in too “high”, and I think I’m too far to the left, but that’s harder to tell right now.\n\nThe “fast” is the biggest issue, no way to fix that without spending fuel, and the sooner I do it the less fuel it needs.  -0.3 m/s.  Better.  -0.1 m/s.  Better.  -0.05 m/s Better… maybe a bit too much though.  Let’s wait and see.  \n\nI work the “left” and “high” problems, and again that’s fuel, but it has to be spent.  Ok, the basic intercept looks ok-ish.  I need to let this play out a while longer though.  I’ve used up 73% of available fuel.  The original vectors were not as well aligned as I would have liked.  \n\nThey’re about a hundred meters away now.  The window helps.  3D and depth perception - if I fully turn my head to the window so I can put both eyes onto them.  Orion’s rolling and tumbling a little, and I use flywheels to correct that.  I’m getting close to saturated on twisty and loopy, and that’s going to limit my options later.\n\nOk, this bucking bronco is settled for the moment, and I’m into last-chance for course correction territory.  I was right, I slowed down just a smidge too much before.  +0.06 m/s, and I think I’m bringing them in just a bit too far to the right, +0.1 m/s.\n\nMaster alarm, 96% of fuel is gone.  \n\nWelcome to the 90% stage.  50 meters to go.\n\nSo, at this point if I do nothing, what happens is that they end up somewhere near the window that I’m looking at them through.  I’m feeling like they’ll pass in front of the nose cone by a couple of feet.  That’s no good.  What I need to do is rotate Orion around so that they come right up to the airlock and the abundance of handholds around it.  I’ve got to use some fuel for that unfortunately.  Flywheels saturated.  98% of available fuel gone now.  And my options for getting this done are narrow, and narrowing by the second.\n\nAs I rotate Orion I lose sight of my targets.  Remember when I said this was the hardest part?  Yeah.  I’m watching the artificial horizon to make my numbers.  Ok.  Spinny is aligned.  \n\nI look out the airlock.  Fuck.  They’re coming in too low.  I trigger a -0.1 m/s burn.  Bingo fuel.  Fuck.  They’re going to miss.  By like 2 fucking meters.  It’s, nothing.   It’s twenty fucking seconds if I’d been faster to see the distance.  It’s four lives.\n\nI unstrap and disconnect my air feed.  The galley is close and its got those 1 kg ballast blocks.  I grab two (one in each hand) and kick off for the airlock.  Orion’s got four safety cables that unspool from the panel right outside the outer airlock.  I start unspooling one.  \n\nDragon’s crew is about 30-40 yards out.  Crawling along.  I tie off the end of the safety harness to the test weight and throw.  Wow.  That’s a spectacular miss.  My body’s calibrated throw stuff in Earth gravity where it is going to fall down from the second it leaves the hand.  I threw way, way, way too high, my body assuming it would just start to drop like everything else I’ve ever thrown since I was throwing my pacifier away.  \n\nOk, 25-30 yards.  I’ve got one more test block.  By the way, I’ve been breathing.  The air inside my helmet is thick and hot and starting to fog the inner surface of the glass dome.  I hold my breath, but it isn’t like I just took a deep lungful of clean air, I’m breathing trashy re-breathed, air and I’m already dying to hook myself back up to the proper flow.  \n\nI’m going to push this one, two handed.  Granny basket time.  I shoot!  \n\nSo, back in high school I made some life choices involving lots of science and math courses, and no gym courses.  Why?  Because in addition to being a jackass, Mr. Popolopolus was right, that he’d seen children who could whip my butt.  I missed again.  \n\nThe air situation is getting bad.  I couldn’t tell my lungs to hold my breath any longer and I’m just gasping.  I’ve never felt like this: never.  My body just knows it’s dying unless it gets air and every instinctive warning system I have is screaming that at me.  My heart’s thundering in my ears, my head wants to split open, and my lungs are on fire.  I pull out the third cable.  Let’s try something different this time - because I’m out of ballast.  I start swinging the tether, like a lasso, extending it out as I do.  Dragon’s crew is going to pass close, I just have to get the cable into range and if it completes a rotation in less time than it takes them to transition through its rotational plane, I’m guaranteed a hit.  The inside of my helmet’s visor is fogged.  I’m down to outlines of the world.  I’m not sure I’m going to be able to find my air hose like this.  My hand’s shaking, like, shaking wrong, like the muscles are too tired to do what I’m asking them, but…  I haven’t been doing much with them.  Fuck I’m tired…  I just need to get some air, to rest…\n\nThe outlines of dragon’s crew are starting to pass the line I’m spinning, it didn’t work.  I don’t know why.  It just didn’t.  They just keep drifting past.  \n\nThree options. A) I go to sleep right here and now, and we all die.  B) I go back to my chair and try to reconnect my air feed.  50/50 I get there.  But Sarah and her crew die.  \n\nI go with option C.  I fumble the last tether and clip it onto my flight suit, and push off at the four slightly brighter splotches in my visor.  Maybe they can grab onto me and climb in.  \n\nWow, did I just kill myself?  I think I just killed myself.  Actually, this is probably better than fighting a bear.  It’s hard to think, my thoughts are all fuzzy and weird.  I close my eyes.  At least I won’t be guilty.  This is better.  It’s ok, I can just die.  It’s ok.  \n\n\\*\\*\\*\\*\\*\\*\\*\n\nI’m Nathan H. Green, a science-fiction writer with a degree in aerospace engineering, and I’m going to be doing daily semi-fictional stories tracking the Artemis I mission.  You can follow along through my reddit (u/authornathanhgreen). \n\nArtemis I Has A Stowaway is a work of semi-fiction. All incidents, events, dialogue and sentiments (which are not part of the mission’s official history), are entirely fictional. Where real historical figures appear, the situations, incidents, sentiments, and dialogues concerning those persons are entirely fictional and are not intended to depict actual events, personality, disposition, or attitudes of the real person, nor to change the entirely fictional nature of the work. Save the above, any resemblance to actual persons, living or dead, events, or locales is entirely coincidental.\n\n© 2022 Nathan H. Green",
        "created_utc": 1670506371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really been digging Tangle Hold by F.L. Wallace, anybody got any similar stories / recs?",
        "author": "Blank_Shoplifter",
        "url": "https://www.reddit.com/r/scifi/comments/zfssp2/really_been_digging_tangle_hold_by_fl_wallace/",
        "text": "[removed]",
        "created_utc": 1670486336,
        "upvote_ratio": 1.0
    },
    {
        "title": "A small correspondence with Peter Watts, thought those that read Blindsight might like it.",
        "author": "BalorNG",
        "url": "https://i.redd.it/guv41s3gzn4a1.jpg",
        "text": "",
        "created_utc": 1670482957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys I'm new to r/scifi did I download the wrong version of star wars?",
        "author": "LocalPhonk",
        "url": "https://v.redd.it/eztbyvzufm4a1",
        "text": "",
        "created_utc": 1670482250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi. My name is Paul. I’m a long time reddit user, but I just started a new profile for my sci-fi work. I’ve written 9 books across two series, and I just wanted to share my content with the group as introductory post. I write about AI and simulation theory. Please, visit my site to learn more!",
        "author": "Mitch_Mythic",
        "url": "http://mitchmythic.com",
        "text": "",
        "created_utc": 1670474672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robobear on a receipt",
        "author": "SolsticeSon",
        "url": "https://i.redd.it/ewo0z3ic9n4a1.jpg",
        "text": "",
        "created_utc": 1670474166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joint Vulcan-Romulan starship concept that I just sketched in Paint from my work computer at lunchtime.",
        "author": "Aetius_Flavius",
        "url": "https://i.redd.it/1lsf74j2hl4a1.png",
        "text": "",
        "created_utc": 1670470628,
        "upvote_ratio": 1.0
    },
    {
        "title": "The last question.",
        "author": "ProgramCompetitive10",
        "url": "https://i.redd.it/iwnbrp9vfm4a1.png",
        "text": "",
        "created_utc": 1670464255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Recomendations",
        "author": "lilhappyeli",
        "url": "https://www.reddit.com/r/scifi/comments/zfl8ji/book_recomendations/",
        "text": "I am looking for book recommendations of timeless high quality sci fi books pertaining to space travel and settling new stars. Any suggestions?",
        "created_utc": 1670464105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time travel theory",
        "author": "304libco",
        "url": "https://www.reddit.com/r/scifi/comments/zfky23/time_travel_theory/",
        "text": "OK I know there’s a bunch of different theories about time travel and how it affects the future. I’m just trying to think of the name of the one where nothing that a time traveler can do can actually change the future because whatever they do was always going to happen anyway.  I tried looking it up but I started to get confused with all the different ones.",
        "created_utc": 1670463365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Report: Amazon Is Soliciting Pitches For New Stargate",
        "author": "elister",
        "url": "https://www.gateworld.net/news/2022/12/report-amazon-is-soliciting-pitches-for-new-stargate/",
        "text": "",
        "created_utc": 1670463243,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you want to see more of in a sci-fi tv series?",
        "author": "Psychological_Dig165",
        "url": "https://www.reddit.com/r/scifi/comments/zfjren/what_do_you_want_to_see_more_of_in_a_scifi_tv/",
        "text": "Represention of anything in particular? I'm working on a sci-fi tv series and I'm open to ideas for making it more inclusive and original.\n\nWhat's something sci-fi needs more of?\n\nAlso side note: I don't want to call the space crews iPads, iPads. But also not data pads. Got any other ideas??",
        "created_utc": 1670460420,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Sci-Fi inspired candle brand",
        "author": "scifinerd7",
        "url": "https://www.reddit.com/r/scifi/comments/zfj8z2/a_scifi_inspired_candle_brand/",
        "text": "[removed]",
        "created_utc": 1670459123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elric by Frank a runner from Heavy Metal Feb 1979.",
        "author": "blcknoir",
        "url": "https://www.reddit.com/gallery/zfifhq",
        "text": "",
        "created_utc": 1670457136,
        "upvote_ratio": 1.0
    },
    {
        "title": "best empire in sci-fi",
        "author": "RavenXCinder",
        "url": "https://www.reddit.com/r/scifi/comments/zffjwq/best_empire_in_scifi/",
        "text": "and no it does not have to be an evil empire just any large scale galactic empire",
        "created_utc": 1670450715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alien Civilisation Concept for my short film - wanted to do something different from the dark grimey Environments that are so often seen in SciFi - what do you say?",
        "author": "Alienphysique",
        "url": "https://i.redd.it/ajn96bjxsj4a1.png",
        "text": "",
        "created_utc": 1670450532,
        "upvote_ratio": 1.0
    },
    {
        "title": "I DONT WANNA DIE",
        "author": "jay5177",
        "url": "https://i.redd.it/oujfv3t61i4a1.jpg",
        "text": "",
        "created_utc": 1670449024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adapting Ian M. Banks The Culture Series into other media.",
        "author": "SoulGuardian55",
        "url": "https://www.reddit.com/r/scifi/comments/zfdbtx/adapting_ian_m_banks_the_culture_series_into/",
        "text": "I greet everyone on this subreddit. Wanted talk about, what most *preferable* and *possible today* the ways to adapt the universe of Ian M. Banks. \n\nThrough:\n\n* *TV series (there was an attempt by Amazon, but they cancelled it)*\n* *Movies*\n* *Animation*\n* *Comics*\n* *Video games (RTS, RPG, FPS, etc.)*\n\nGood-thought discussion is welcomed.\n\nP.S. If this post poorly done from your perspective, I shall redone it.",
        "created_utc": 1670446159,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Waking Dogs: A World Eaters Tale\" Narrated by A Vox in The Void (Warhammer 40K)",
        "author": "nlitherl",
        "url": "https://www.youtube.com/watch?v=JQk0yYB7T_U",
        "text": "",
        "created_utc": 1670442321,
        "upvote_ratio": 1.0
    },
    {
        "title": "#Avatarthewayofwater Out Of Theater Reaction",
        "author": "themovieblog",
        "url": "https://youtube.com/watch?v=0sR3i_g5tuk&amp;feature=share",
        "text": "",
        "created_utc": 1670441678,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Brad Wright, co-creator of Stargate SG-1, Atlantis, and Universe, as well as creator of the show Travelers on Netflix. I'm here to talk all things sci-fi. Ask Me Anything!",
        "author": "BradWrightAMA",
        "url": "https://www.reddit.com/r/scifi/comments/zfakp5/im_brad_wright_cocreator_of_stargate_sg1_atlantis/",
        "text": "Hi Reddit, Brad Wright here. Thanks for having me on for an AMA, I am looking forward to getting to as many questions as I can!\n\nRecently I have joined the sci-fi app and website, The Companion, where I host a podcast called Conversations in Sci-Fi. I chat to a lot of my friends both in front of and behind the camera in great sci-fi shows like Stargate, Star Trek, and The Expanse etc. We also collaborated with Google Lead A.I. Advocate Laurence Moroney to generate Stargate scripts written by state of the art artificial intelligence. We rounded up a bunch of the Stargate cast to get involved to perform the scenes in a table read over zoom and we laughed our asses off. ",
        "created_utc": 1670440485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Harrow the Ninth written completely in second person POV?",
        "author": "toadexplosion",
        "url": "https://www.reddit.com/r/scifi/comments/zf9ucs/is_harrow_the_ninth_written_completely_in_second/",
        "text": "I just finished Gideon the Ninth and I was going to go directly into Harrow, but I saw comments about second person POV. I really dislike second person. It took me right out of N. K. Jemesin's Broken Earth trilogy. If that's how harrow is written I'd rather not waste my time or money.",
        "created_utc": 1670438997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lunar colony in \"Ad Astra\" (2019 sci-fi thriller set in mid-21st century when humanity has started to settle the inner Solar System)",
        "author": "Icee777",
        "url": "https://www.humanmars.net/2022/12/lunar-colony-in-ad-astra-2019-movie.html",
        "text": "",
        "created_utc": 1670437621,
        "upvote_ratio": 1.0
    },
    {
        "title": "r/hmmmm",
        "author": "ForgotNLost",
        "url": "https://www.reddit.com/r/scifi/comments/zf6vka/rhmmmm/",
        "text": "[removed]",
        "created_utc": 1670433055,
        "upvote_ratio": 1.0
    },
    {
        "title": "An early version of the Rise of Skywalker script placed the Knights of Ren's hidden base inside the sunken Death Star.",
        "author": "VinDieselArk",
        "url": "https://www.reddit.com/gallery/zf3wvi",
        "text": "",
        "created_utc": 1670430653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daisy Ridley posted on Instagram that she recently visited Lucasfilm HQ",
        "author": "NotMeAgain999",
        "url": "https://i.redd.it/6613o7vwuh4a1.jpg",
        "text": "",
        "created_utc": 1670430488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never Surrender to Writer's Block!",
        "author": "CyborgWriter",
        "url": "https://i.redd.it/cxr36e6d5i4a1.jpg",
        "text": "",
        "created_utc": 1670430295,
        "upvote_ratio": 1.0
    },
    {
        "title": "THE TRUTH ABOUT LENSA AI APP?",
        "author": "Stunning-Midnight-22",
        "url": "https://youtu.be/YktnsnN5dvA",
        "text": "",
        "created_utc": 1670429342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hopeless cycles of suffering? I have no mouth and I must scream",
        "author": "Grantimoto1",
        "url": "https://www.reddit.com/r/scifi/comments/zf4st4/hopeless_cycles_of_suffering_i_have_no_mouth_and/",
        "text": "I have to admit, I love the grim ending of I have no mouth and I must scream. The concept of being tortured beyond what should be death is fascinating. Black mirror being trapped in simulations for hundreds of thousands of years share a similar theme. \n\nCan you guys recommend books, games, or anything with a similar theme? Hundreds of thousands of years of suffering?",
        "created_utc": 1670428844,
        "upvote_ratio": 1.0
    },
    {
        "title": "best t33n leak ,t33n nude video 5-17 years old",
        "author": "2958372848747284847",
        "url": "https://beakkzc.nl/invite/i=1653",
        "text": "",
        "created_utc": 1670428825,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's Happening?",
        "author": "Malayness",
        "url": "/r/PromptedPodcast/comments/zf4b5h/whats_happening/",
        "text": "",
        "created_utc": 1670428332,
        "upvote_ratio": 1.0
    },
    {
        "title": "There's something in this list to make everyone angry: \"10 Worst-Written Female Characters In Sci-Fi Movies\"",
        "author": "InkIcan",
        "url": "https://www.cbr.com/worst-written-female-sci-fi-movie-characters/",
        "text": "",
        "created_utc": 1670427918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artemis I Has A Stowaway - Day 22 - A daily, semi-fictional, mission log from aboard Artemis I",
        "author": "AuthorNathanHGreen",
        "url": "https://www.reddit.com/r/scifi/comments/zf3d5g/artemis_i_has_a_stowaway_day_22_a_daily/",
        "text": "December 7th, 2022\n\n  \n\nYou ever think about quantum physics?  I love thinking about quantum physics.  First of all, I don’t care what you say: it’s magic.  Its rules are so non-intuitive and untethered from comparison or analogy that you have to simply brute force learn it.  Secondly, I’m an aerospace engineer and I eat differential equations for breakfast, but quantum physics has some screwed up mathematical symbols.  Looks like runes more than math.  \n\nThird, and this is the part that’s relevant to me right now, it’s all about possibilities and probabilities.  And kind of like geometry contains hidden truths, there’s these truths to quantum physics as well.  Today I’m two things at once.  I’m the Alex Whelm who saved four members of Dragon Sovereign, and I’m the Alex Whelm who screwed up and let them die.  I’m both, I’m neither, I’m a probability function that collapses into one of two states tomorrow once we observe what happens.\n\nEven if my chances of doing this are one in a hundred, I could be the one-in-a-hundred guy that pulled it off.  I don’t have to be the loser who can’t handle the guilt of failing.  But right now, I’m both, and neither.  Once we observe what happens that other Alex, the Alex who could have been, is going to be a distant memory, a hypothetical like when you imagine how your life might have been different had you won the lottery.\n\nBy the way, for those interested, 97%, 99%, 97%, 98%, 94%, 96%, 98%, 99%, 96%, 99%, 96%, 96%, 96%, 96%, 99%.  Instead of pausing simulations we’re doing a long-winded thrust by thrust debrief after each one now.  \n\nWe’ve also started to get real serious about tomorrow’s schedule.  \n\nHere’s how it breaks down:\n\n06:00 - Alex Whelm wakes up eats breakfast and uses the head - lesson learned.\n\n06:10 - Alex Whelm gets back to frantically practicing.\n\n09:00 - The Dragon crew start putting on their space suits.\n\n10:32 - The Dragon crew switch to internal suit air and exit their craft starting their count-down to suffocation.\n\n10:47:14 - Dragon crew kick off, using up essentially every drop of their suits’ thruster fuel.\n\n13:34 - Alex Whelm gets his flight suit on and wraps up his legs - and toes individually this time - in duct tape.  When he’s ready, he slowly depressurize Orion, and pops the outer and inner airlocks open.\n\n14:12:52 - Artemis I does a computer-controlled entry burn into Earth’s orbit\n\n14:15 - Rescue operations begin.\n\n14:36 - Rescue operations end. \n\n15:00 - cocktail reception.\n\nThat step at 13:34 has NASA in knots.  When the computer froze and NASA told me to do an EVA, it was pretty simple for them: the only way to fix the issue was an EVA, and they only had so many characters in the message they could send me.  Since the details were for me to figure out, no one at NASA had to sign off on them.  Now someone down there has to put their personal stamp of approval on my duct tape leg wrapping work.  \n\nEven better, the air feed that plugs into the flight suit’s thigh is only long enough to reach the inner airlock door.  To open the outer door, I’ll have to disconnect it, depressurize, open the door, and reconnect my air feed.  \n\nWhy not just use the auxiliary air tank when doing that?  Because I’d still have to disconnect and reconnect in vacuum.  I can’t use that auxiliary tank for the whole intercept.  Plus, it would be nice to have that actually connected to the emergency systems so the ship can be repressurized quickly.\n\nAnyways, I’m going to have to make do with the residual air in my suit for about thirty seconds, and NASA loathes the idea.  The entire mission, and the lives of five people, turns on connecting a valve in vacuum and I’ve only got a few seconds to do it.\n\nAlso, NASA screwed up.  Makes sense I guess, they were busy with a bunch of things. So, when Captain Sarah Covington sent down her goodbye messages, someone groundside forwarded the one addressed to me, probably thinking it was just coordinating for tomorrow.  \n\n“Alex, if you’re seeing this it means the intercept didn’t work.”  She was floating in the Dragon Sovereign capsule.  Her hair was pulled back into a mid-length braid, just loose enough that it had the right kind of volume.  I’ve got short hair but even I’ve got space hair at this point - every strand wants to just point straight away from my head.  I’ll tell you something though, bald is going to be THE fashion choice in space.  \n\nShe wasn’t wearing any makeup, but that was a good look on her, made her look a little nerdier, a little more real than the perfection of a headshot.  \n\nI stopped the video and sent a message to NASA.  If they sent the other videos out by accident that could be a problem for Sarah.  Now look, I know I’m not supposed to watch this…  But am I seriously not going to watch this?  \n\nTwo Alex’s in quantum state, one who does the right thing and respects Sarah’s privacy, and the other… Sorry good Alex, you get to be erased from existence with the click of the play button.\n\n“I saw your interview,” she went on.  “You get it, and how you feel about space, it’s the same as how I feel about it.  How we all feel about it.  This is something that’s worth dying to do and we knew that when we first signed up, when we strapped in.  This is how we wanted to spend our lives, and the only difference you’ve made is that over the last week is that we’ve had hope.”\n\nHer eyes looked swollen, I’m probably the last one of these that she recorded.  \n\n“This intercept, I’ve been over it a hundred times with my pilot and ground crew, this would really push a trained pilot with thousands of hours of experience.  It would have been nice if we’d pulled it off, but this was always a long shot and everyone knew it was asking way too much of you.  No one blames you, Alex.  No one.  If there’s a heaven, then I want to see you there in another fifty or sixty years, and I’ll buy you a drink and give you that hug I owe you.”\n\n“Don’t blame yourself.  I hope you live a good life Alex.  Seriously.  That’s the only thing I want for you, ok?”\n\nThat’s the message.  \n\nGreat, she’s magnanimous too.  If I think of my virtues and vices and weigh them against one another then Captain Sarah Covington would need to…. I don’t know… murder puppies in her spare time, if she was going to have the same bad/good ratio as me.  Probably the entire crew of the Dragon Sovereign is the same.  Accomplished, wonderful, dedicated, just amazing people who devoted their lives to doing an amazing thing.  And who the hell am I?  The asshole who stowed away.\n\nMark was wrong.  If I don’t pull this off, I’m going to be having nightmares about it for the rest of my life no matter what I keep my eyes on.  \n\n\\*\\*\\*\\*\\*\\*\\*\n\nI’m Nathan H. Green, a science-fiction writer with a degree in aerospace engineering, and I’m going to be doing daily semi-fictional stories tracking the Artemis I mission.  You can follow along through my reddit (u/authornathanhgreen). \n\nArtemis I Has A Stowaway is a work of semi-fiction. All incidents, events, dialogue and sentiments (which are not part of the mission’s official history), are entirely fictional. Where real historical figures appear, the situations, incidents, sentiments, and dialogues concerning those persons are entirely fictional and are not intended to depict actual events, personality, disposition, or attitudes of the real person, nor to change the entirely fictional nature of the work. Save the above, any resemblance to actual persons, living or dead, events, or locales is entirely coincidental.\n\n© 2022 Nathan H. Green",
        "created_utc": 1670425588,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is this ow it's a sack of potatoes I Jess she fell like a sak of potatoes my bade he stupid as a sak of potatoes bout did that make a light come on",
        "author": "Gullible-Row-9821",
        "url": "https://i.redd.it/iny6b0kr4j4a1.jpg",
        "text": "",
        "created_utc": 1670424197,
        "upvote_ratio": 1.0
    },
    {
        "title": "eggs how many of them u lay my bad I ment how many u fill",
        "author": "Gullible-Row-9821",
        "url": "https://www.reddit.com/gallery/zf2o3g",
        "text": "",
        "created_utc": 1670423854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it taking along time for Avenue5 to get back to earth when a rocket can go there and back?",
        "author": "itsdan23",
        "url": "https://www.reddit.com/r/scifi/comments/zf2ig4/why_is_it_taking_along_time_for_avenue5_to_get/",
        "text": "In the Sci-Fi comedy Avenue 5 starring Hugh Laurie. Iv just watched up to season 2 episode1.\nMy question about the show from season 1 onwards is why is it taking the ship a long time to get back to earth when they can send a rocket there and back really quickly or the ship can go to the sun or they could communicate really quickly. I just don't understand some of the aspects in this show?",
        "created_utc": 1670423449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Military Sci-Fi Humor suggestions?",
        "author": "WhovianC4t",
        "url": "https://www.reddit.com/r/scifi/comments/zf0b4q/military_scifi_humor_suggestions/",
        "text": "I usually listen to 40K or Galaxy’s Edge books, but wanted something different. Does anyone know of any funny satire books like Starship Troopers or the game Helldivers or books with humor like the Ciaphas Cain books?",
        "created_utc": 1670417230,
        "upvote_ratio": 1.0
    },
    {
        "title": "#خاله #داف #دختر #دانشجو #سکس #حضوری #برنامه ساعتی #سکس حضوری #شماره کوس #شماره خاله",
        "author": "Secure-Ad-5577",
        "url": "https://www.reddit.com/gallery/zeyim7",
        "text": "",
        "created_utc": 1670411417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody know of any good sci-fi books or films that are based deep underwater?",
        "author": "archlorddhami",
        "url": "https://www.reddit.com/r/scifi/comments/zexn6b/does_anybody_know_of_any_good_scifi_books_or/",
        "text": "",
        "created_utc": 1670408390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, can you please recommend some interesting and informative podcasts to listen to while driving? Thanks",
        "author": "Ok-Cardiologist3674",
        "url": "https://www.reddit.com/r/scifi/comments/zevsv1/hello_can_you_please_recommend_some_interesting/",
        "text": "",
        "created_utc": 1670401167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Know any Books like Lord of the Light and Percy Jackson?",
        "author": "dhairya_dave",
        "url": "https://www.reddit.com/r/scifi/comments/zeukg4/know_any_books_like_lord_of_the_light_and_percy/",
        "text": "I know, two very different series' but I don't know a lot of books that mix mythology, fantasy and sci fi. Could y'all recommend some?",
        "created_utc": 1670396282,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Stone Sky (question, spoilers)",
        "author": "erithtotl",
        "url": "https://www.reddit.com/r/scifi/comments/zes28n/the_stone_sky_question_spoilers/",
        "text": "So question for this sub. I am almost done with this book, and I find myself really disappointed in one thing.\n\nFor me I've been reading an 'ancient earth' series and a really good one.  You know, the kind of setting like the Gene Wolfe books where 'technology, significantly advanced, is indistinguishable from magic'. Except, in this one, we see in flashback, no, the magic is really magic!  So what was sci Fi is now pure fantasy.  The whole time I'm thinking what they call magic is actually nano whatever and some other science adjacent ultra advanced tech, but nope, its the Force and the earth is a living thing, that basically talks.\n\nThis really hampered my ultimate enjoyment of the series but I haven't seen others echoing this viewpoint.  Am I just missing something or perhaps I was just misguided as to the genre of this book and should have expected things to have a fantasy resolution all along?",
        "created_utc": 1670387612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just read Arthur C. Clarke's \"No Morning After\". Any more recommendations?",
        "author": "fakiresky",
        "url": "https://www.reddit.com/r/scifi/comments/zercwg/just_read_arthur_c_clarkes_no_morning_after_any/",
        "text": "I read a lot of fantasy, weird, horror but not much SF. That story ( part of the anthology \"Grave Prediction\") was really fun and funny and I couldn't help but remember Douglas Adams. Any recommendations for short to medium length stories in that vein from Arthur C. Clarke? Thank you.",
        "created_utc": 1670385425,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for help with finding a sci fi movie.",
        "author": "Snoo_34409",
        "url": "https://www.reddit.com/r/scifi/comments/zerahw/looking_for_help_with_finding_a_sci_fi_movie/",
        "text": "somewhere in the corner of my mind i recall having watched a sci fi movie that has the mc flee from earth a wanted man by going to a city/colony on the moon. its a 80s/90s movie and has a pretty dystopian feel to it. if any of you can think of anything that even resembles my description and recall the title of that movie please comment below and ill go looking for it :)",
        "created_utc": 1670385209,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend Quentin (who was previously a Bears lineman) has been helping me create an indie science fiction film for the last year or so, since we were both annoyed by how Finn was sidelined in Star Wars. Here are some stills from the story so far.",
        "author": "_ericdevries",
        "url": "https://www.reddit.com/gallery/zepvod",
        "text": "",
        "created_utc": 1670383047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommend some Kaiju books plz?",
        "author": "Astr0Rain",
        "url": "https://www.reddit.com/r/scifi/comments/zeqghz/recommend_some_kaiju_books_plz/",
        "text": "Recommend some Kaiju books plz, with more focusing the character with mystery surrounded the monster?",
        "created_utc": 1670382656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blade Runner vs Blade Runner 2049 Debate Pt 1",
        "author": "randogringo",
        "url": "https://youtu.be/8eqdduWOPHw",
        "text": "",
        "created_utc": 1670381541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time Dilation in Space",
        "author": "Individual-Board3805",
        "url": "https://www.reddit.com/r/scifi/comments/zepsyb/time_dilation_in_space/",
        "text": "I’m watching the expanse right now and I’ve been wondering how time would pass differently if you lived on an asteroid in the belt vs on earth. Since gravity is so much weaker, would time move differently? Even if we tracked the passage of time based on earth days, how would the differing gravity change the experience of time? \n\nI apologize if my language is confusing. I have a limited science background and don’t fully understand the relationship between space and time, I just understand that there is one.",
        "created_utc": 1670380707,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Signal (2014) I wont show the whole scene, i hope anyone who hasn’t watched this is enticed after watching this.",
        "author": "nuyorican29",
        "url": "https://v.redd.it/uwbby8kvef4a1",
        "text": "",
        "created_utc": 1670379178,
        "upvote_ratio": 0.99
    },
    {
        "title": "Therae",
        "author": "Shot-Estate-3247",
        "url": "https://youtu.be/wV0nJtlswqg",
        "text": "",
        "created_utc": 1670378114,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I travel, which is better? esim or roaming?",
        "author": "apple_fans_007",
        "url": "https://www.reddit.com/r/scifi/comments/zeos11/when_i_travel_which_is_better_esim_or_roaming/",
        "text": "[removed]",
        "created_utc": 1670377705,
        "upvote_ratio": 1.0
    },
    {
        "title": "kindle unlimited suggestions?",
        "author": "JanFromEarth",
        "url": "https://www.reddit.com/r/scifi/comments/zent03/kindle_unlimited_suggestions/",
        "text": "Just signed up for Kindle unlimited and I keep running into books with LOTS of long, boring dialog. I have found some with the same sentences repeated in different chapters. . I am beginning to suspect that either get paid by the word or need a minimum number of words. So, having said that, I am looking for suggestions.",
        "created_utc": 1670374878,
        "upvote_ratio": 1.0
    },
    {
        "title": "cells operated computer",
        "author": "Anvis_Infinity",
        "url": "https://www.reddit.com/r/scifi/comments/zenlc0/cells_operated_computer/",
        "text": "[removed]",
        "created_utc": 1670374258,
        "upvote_ratio": 1.0
    },
    {
        "title": "From the late 80s to early 2010s there was a sci fi boom! Has society stopped being fascinated by what might be out there in space?",
        "author": "AstroV72",
        "url": "https://i.redd.it/shqtlx55gd4a1.jpg",
        "text": "",
        "created_utc": 1670373384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Power cable maintenance walker, 2032",
        "author": "UristMasterRace",
        "url": "https://i.imgur.com/kePKG6Q.jpg",
        "text": "",
        "created_utc": 1670373330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Act fast for a $500 Ford's Garage gift card!",
        "author": "Chemical-Annual4019",
        "url": "https://www.quikly.com/fords-garage/s/yEJPMpYn?utm_content=reddit",
        "text": "",
        "created_utc": 1670371251,
        "upvote_ratio": 1.0
    },
    {
        "title": "AMA ANNOUNCEMENT - Brad Wright, Co-Creator of Stargate SG-1, Atlantis, and Universe TV series, as well as Netflix original Travelers, will be doing an AMA on Dec 7th 12pm-2pm PST",
        "author": "Warlizard",
        "url": "https://www.reddit.com/r/scifi/comments/zemfr5/ama_announcement_brad_wright_cocreator_of/",
        "text": "GLHF",
        "created_utc": 1670371137,
        "upvote_ratio": 1.0
    },
    {
        "title": "[30DOS]Stargate Family-Who had the best parties?",
        "author": "PatientBonus841",
        "url": "https://www.reddit.com/r/scifi/comments/zelpzn/30dosstargate_familywho_had_the_best_parties/",
        "text": "[removed]",
        "created_utc": 1670369328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jon Landau [Producer] says they’ve been talking to Robert Rodriguez about doing an ‘ALITA: BATTLE ANGEL’ sequel",
        "author": "NotMeAgain999",
        "url": "https://i.redd.it/r3qrr8rphe4a1.jpg",
        "text": "",
        "created_utc": 1670368029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of practice.",
        "author": "pdefletcher",
        "url": "https://www.reddit.com/r/scifi/comments/zel57x/out_of_practice/",
        "text": "I used to read a lot. I always had a book in my hand. I feel like, because of the quick-snippet-and-move-on nature of social media (including Reddit), I seem to have fallen out of practice. I can’t seem to focus for long enough to get into a novel lately. Has anyone else experienced this? Does anyone have any easy but engaging book recommendations to get me back into reading novels?",
        "created_utc": 1670367983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alice in Borderland Season 2 Trailer",
        "author": "usagirotten",
        "url": "https://www.reddit.com/r/scifi/comments/zektvb/alice_in_borderland_season_2_trailer/",
        "text": "Netflix has released the official trailer for the long-awaited second season of the hit Japanese sci-fi thriller Alice in Borderland.\n\nhttps://therottenusagi.com/scifi/alice-in-borderland-season-2-trailer/",
        "created_utc": 1670367261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saints of Salvation",
        "author": "nosepod",
        "url": "https://www.reddit.com/r/scifi/comments/zek0rl/saints_of_salvation/",
        "text": "  I'm about 2 hours in to The Saints of Salvation by Peter F Hamilton on audio book. I can't seem to stop my mind wandering, can't say it's boring, but every chapter is another bunch of people and their circumstances, can't remember so many names etc. How is it to read anyone?",
        "created_utc": 1670365364,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Cam 130 Cyclops from \"Spacecraft 2000 to 2100\"",
        "author": "dchallenge",
        "url": "https://v.redd.it/6s4b79fnoc4a1",
        "text": "",
        "created_utc": 1670364207,
        "upvote_ratio": 1.0
    },
    {
        "title": "An old woman just complimented my mug.",
        "author": "Crafty_Letterhea",
        "url": "https://i.redd.it/zuozh9vvic4a1.png",
        "text": "",
        "created_utc": 1670362213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations: What to read by Le Guin?",
        "author": "ScalesGhost",
        "url": "https://www.reddit.com/r/scifi/comments/zei0zw/looking_for_recommendations_what_to_read_by_le/",
        "text": "I love the two Le Guin books I've read thus far (Left Hand of Darkness and Dispossessed). Has she written stuff that's just as good as these two books? What should I read?",
        "created_utc": 1670360634,
        "upvote_ratio": 1.0
    },
    {
        "title": "33",
        "author": "Living_Trust_514",
        "url": "https://i.redd.it/7xriam1q1c4a1.png",
        "text": "",
        "created_utc": 1670356430,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘No one is replacing Indy’: Director shoots down rumors that Phoebe Waller-Bridge will take over for Harrison Ford",
        "author": "Neo2199",
        "url": "https://www.yahoo.com/entertainment/no-one-is-replacing-indy-director-shoots-down-rumors-that-phoebe-waller-bridge-will-take-over-for-harrison-ford-214745422.html",
        "text": "",
        "created_utc": 1670353038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solarpunk Magazine is funding its second year on Kickstarter",
        "author": "Kiba-Da-Wolf",
        "url": "https://www.kickstarter.com/projects/solarpunkmagazine/solarpunk-magazine-2023",
        "text": "",
        "created_utc": 1670345916,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"ALIENS NIGHT\" - Alien abduction movie. Sci-fi Short Film. CGI VFX Short Film.",
        "author": "Pressroom2023",
        "url": "https://youtu.be/8pvigUklBpo",
        "text": "",
        "created_utc": 1670344987,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOOD MORNING 2033 - SciFi Short Film",
        "author": "hackalackolot",
        "url": "https://www.youtube.com/watch?v=62BtPJD7i0k",
        "text": "",
        "created_utc": 1670338196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendation : Altered Carbon Season 1. Great series , the loved the cyberpunk theme. Also dont watch season 2 lol.",
        "author": "DragonTooth1970",
        "url": "https://i.redd.it/nj57k8h9da4a1.png",
        "text": "",
        "created_utc": 1670336154,
        "upvote_ratio": 1.0
    },
    {
        "title": "32",
        "author": "Living_Trust_514",
        "url": "https://i.redd.it/lrhr31w9t94a1.png",
        "text": "",
        "created_utc": 1670329375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Milla Jovovich as Alice, doing what she does best: kicking zombie/mutant ass in, Resident Evil Afterlife (2010).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/y56ykqdx8b4a1",
        "text": "",
        "created_utc": 1670328971,
        "upvote_ratio": 1.0
    }
]