[
    {
        "title": "A killer uses elite weaponry to take down his target in, Runaway (1984).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/ghfo7fiyxcla1",
        "text": "",
        "created_utc": 1677758774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raymond Weaver Video - Raymond Weaver Facebook Live Video",
        "author": "Mehrwan_malik",
        "url": "https://www.everylatestnews.com/2023/03/raymond-weaver-video-raymond-weaver.html?m=1",
        "text": "",
        "created_utc": 1677751751,
        "upvote_ratio": 1.0
    },
    {
        "title": "shanghai weed order上海大麻机长，飞行燃料供应😁",
        "author": "buyweedinchina",
        "url": "https://www.reddit.com/gallery/11fwvgl",
        "text": "",
        "created_utc": 1677743665,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are some high quality audio SF out there, and there are those who fail at it - an Asimov's example",
        "author": "Pavlovurasag",
        "url": "https://www.reddit.com/r/scifi/comments/11fwb2m/there_are_some_high_quality_audio_sf_out_there/",
        "text": "It's interesting to see how the big, classic SF publishers fail to get the new medium. This  short story seems to have been recorded with an intercom, from a distance of four feet. There is no link in the post, nor is the text very inviting. Anyways, the attempt is not entirely bad, maybe if more people listen and give constructive feedback, the quality will improve.\n\nThe story itself brings you a pleasant relaxation and raises interesting questions about the possibilities of deep thoughts, slowing down and turning inward in the modern world. If you don't like the audio version, you can also read it [at Asimov's](http://www.asimovs.com/wp-content/uploads/2023/02/Forty-eightMinutesCafe_Bennardo.pdf).\n\n[https://open.spotify.com/episode/083xUTQuo4OD7KuIOdXHvh?si=804e46ca23c5426f](https://open.spotify.com/episode/083xUTQuo4OD7KuIOdXHvh?si=804e46ca23c5426f)",
        "created_utc": 1677741762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Python.pie - Cyberpunk Irish Character",
        "author": "binaryghost01",
        "url": "https://v.redd.it/du1e1ypnn9la1",
        "text": "",
        "created_utc": 1677736960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lachrimae - Cyberpunk Gothic Femme Fatalle",
        "author": "binaryghost01",
        "url": "https://v.redd.it/rmvclfegn9la1",
        "text": "",
        "created_utc": 1677736878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check it out",
        "author": "Sensitive_Age_2284",
        "url": "https://youtu.be/36J4e_lBi7w",
        "text": "",
        "created_utc": 1677726967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fino Herrera Video - Fino Herrera Batang Poz - Fino Herrera Video On Twitter",
        "author": "Mehrwan_malik",
        "url": "https://www.everylatestnews.com/2023/02/fino-herrera-video-fino-herrera-batang.html?m=1",
        "text": "",
        "created_utc": 1677723220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im thinking about selling wands on ebay. Im thinking $10 to $15 buyer pays for shipping. Who would be interested?",
        "author": "wood_good",
        "url": "https://i.redd.it/pe9wsqvap9la1.jpg",
        "text": "",
        "created_utc": 1677719461,
        "upvote_ratio": 1.0
    },
    {
        "title": "my YouTube channel",
        "author": "Then_Speaker_2943",
        "url": "https://youtube.com/@emmettsimard",
        "text": "",
        "created_utc": 1677715142,
        "upvote_ratio": 1.0
    },
    {
        "title": "We collect tokens from Optimism $OP.",
        "author": "Dull_Ad2220",
        "url": "https://www.reddit.com/r/scifi/comments/11flu5o/we_collect_tokens_from_optimism_op/",
        "text": "[removed]",
        "created_utc": 1677713312,
        "upvote_ratio": 1.0
    },
    {
        "title": "He's a very trustworthy guy, nothing wrong here",
        "author": "GasAway8656",
        "url": "https://i.redd.it/kdmzx28cm7la1.png",
        "text": "",
        "created_utc": 1677712276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alien Movies (Ridley Scott) Order",
        "author": "LeftyLuke420",
        "url": "https://www.reddit.com/r/scifi/comments/11fk71b/alien_movies_ridley_scott_order/",
        "text": "Pretty much the title.\nIn which order would you watch the Alien movies by directed by Ridley Scott, (Alien, Prometheus, Covenant) if you were to watch them in one sitting?",
        "created_utc": 1677709540,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help Search for a 80s or 90s Science Fiction or cartoons or Anime Tiny aliens spaceships or ufo flying in Kid room",
        "author": "bqvwvpd",
        "url": "https://www.reddit.com/r/scifi/comments/11fk3wp/please_help_search_for_a_80s_or_90s_science/",
        "text": "[removed]",
        "created_utc": 1677709343,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 2023 Hugo Awards nomination window is now open.",
        "author": "Halaku",
        "url": "https://en.chengduworldcon.com/news3_35_95_32_66_76_50/102.html",
        "text": "",
        "created_utc": 1677707926,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to get into the new Star Trek shows, where should I start?",
        "author": "North_Confident",
        "url": "https://www.reddit.com/r/scifi/comments/11fj745/i_want_to_get_into_the_new_star_trek_shows_where/",
        "text": "",
        "created_utc": 1677707320,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Empire vs Galactic Federation of Planets.. who wins?",
        "author": "North_Confident",
        "url": "https://www.reddit.com/r/scifi/comments/11fit6v/the_empire_vs_galactic_federation_of_planets_who/",
        "text": "",
        "created_utc": 1677706419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every Single Country Created as a Supervillain with AI",
        "author": "MsNunez",
        "url": "https://www.youtube.com/watch?v=T_2c-WEYHkU",
        "text": "",
        "created_utc": 1677706390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sedm76sest na TikTok",
        "author": "Sedm76sest",
        "url": "https://www.tiktok.com/@sedm76sest76?_t=8aI9KduTaY2",
        "text": "",
        "created_utc": 1677706173,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is a real eye catcher 😍",
        "author": "Embarrassed_Status56",
        "url": "https://i.redd.it/laam71vuq6la1.png",
        "text": "",
        "created_utc": 1677701673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hugh Jackman May Have Spoiled Story Point in Deadpool 3",
        "author": "mansoorhussain3053",
        "url": "https://digitalshroud.com/movies/hugh-jackman-may-have-spoiled-deadpool-3/",
        "text": "",
        "created_utc": 1677700879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendation:",
        "author": "Agreeable_Rich_1991",
        "url": "https://www.reddit.com/r/scifi/comments/11fdmi6/book_recommendation/",
        "text": "Any book, movie, tv series in sci-fi (or fantasy, I don't mind even anime, if it's done fairly well)\nWhere a character from the past or a similarly technologically developed is frozen or travels through time to our modern day world and is amazed and shocked by our technology and culture.\nDo you know of a series that explores this concept in depth ( The ones I've already watched that kinda explores this is the ani-manga series Dr Stone, and all Captain America movies and the comic series Man out of time",
        "created_utc": 1677698307,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Night Flyers\" Isn’t Really That Bad",
        "author": "Boop108",
        "url": "https://filmofileshideout.com/archives/night-flyers-isnt-really-that-bad/",
        "text": "",
        "created_utc": 1677693258,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the thoughts on the book Daemon by Daniel Suarez?",
        "author": "kriskris0033",
        "url": "https://www.reddit.com/r/scifi/comments/11fa735/what_are_the_thoughts_on_the_book_daemon_by/",
        "text": "It has great ratings over all but haven't found decent review on YouTube, mostly reviews on GR compare it to something similar to hacking and VR like ready player one but better, would love know thoughts on this book and in your opinion a newbie to sci-fi can handle this book.",
        "created_utc": 1677692862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's an Effective Way to Craft Memorable Characters. Hope This Helps!",
        "author": "CyborgWriter",
        "url": "https://youtu.be/5AvjbaAR94U",
        "text": "",
        "created_utc": 1677690780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nomads Legacy Audiobook/Hörbuch",
        "author": "Stay-Stark",
        "url": "https://audio-4-you.com/nomads-legacy/",
        "text": "",
        "created_utc": 1677690769,
        "upvote_ratio": 0.5
    },
    {
        "title": "Thoughts on the main villian from avatar (quaritch) does he have potential to become the darth vader of this generation ?",
        "author": "LovableJackassv4",
        "url": "https://i.redd.it/syswddvu97la1.jpg",
        "text": "",
        "created_utc": 1677690045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like this Great Podcast on Star Trek by Industry Professionals. It Deserves More Attention. They have gone through all of The Original Series and are now covering The Animated Series.",
        "author": "JCLGsa",
        "url": "https://youtube.com/watch?v=Jdr2PwyirVE&amp;feature=share",
        "text": "",
        "created_utc": 1677684651,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked ChatGPT to pretend to be a guest on a radio show there to promote its book, called \"The Best Sci-Fi Movie Ever Made\".",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677683979,
        "upvote_ratio": 0.2
    },
    {
        "title": "Great Podcast On Star Trek By Industry Professionals",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677683512,
        "upvote_ratio": 1.0
    },
    {
        "title": "My new scifi horror comic \"Mutagen\" I hope you dig it so far.",
        "author": "alexdrummond",
        "url": "https://www.reddit.com/gallery/11f4dn6",
        "text": "",
        "created_utc": 1677678929,
        "upvote_ratio": 0.86
    },
    {
        "title": "[OC] My new scifi horror comic \"Mutagen\" I hope you dig it so far.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677678836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie of the Day - Domain",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11f3py4/movie_of_the_day_domain/",
        "text": "I try very hard and am usually very successful when it comes to \"suspend disbelief\" in service of enjoying a questionable quality movie.\n\nI was not as successful with this movie.  There are many interesting subplots - there are nice mini vignettes of all the characters while mostly focusing on two.\n\nBut good god, the way they resolve the story is just so clumsy.  Again, I usually don't do this but the plot holes in this movie are just so big that it falls apart.",
        "created_utc": 1677677131,
        "upvote_ratio": 0.6
    },
    {
        "title": "Picard season 3 episode 2 – the wheels are wobbling off this wagon.",
        "author": "Evis03",
        "url": "https://www.reddit.com/r/scifi/comments/11f3gzo/picard_season_3_episode_2_the_wheels_are_wobbling/",
        "text": "\n\nWell that was fast. \n\nIn [my write up on the first episode](https://www.reddit.com/r/scifi/comments/119az26/checked_out_of_star_trek_season_3_episode_1_of/) I was borderline avuncular on a dramatic increase in quality over anything else I’d seen in Nu Trek. And I stand by that positive response. I also posited that the pattern with Nu Trek is that the start of any given season is as good as it gets- and everything just declines from there as the incompetencies of the writers start to pile up on each other creating contradictions, aborted plot lines, and nonsensical character choices, culminating in something unwatchable to anyone with an attention span longer than a YouTube advert- and expectations greater than “FEEEEEELS”!\n\nWell that process has already begun with episode 2 starting the major contradictions. I described the errors in episode 1 as ‘dent on the bodywork rather than a broken axle’, well now that axle is creaking ominously. In episode 1 I was initially confused by everyone taking orders from Picard when he’s supposed to be a *retired* admiral. But once Captain Shaw put his foot down and refused orders from him on the basis that he was retired I just accepted that he was being shown respect rather than having any legitimate authority. Like, if Picard wants to conduct an inspection on a ship he’s not harming anyone. Hell, it might be a morale boost for the crew to have a living legend on board. But the moment he tries to do something meaningful Shaw (rightly) shuts him down. \n\nSo the show has established something. Picard is a retired admiral and has no authority beyond what courtesy active officers give him. Cool. Noted. Episode 2 ends with him giving orders contrary to Captain Shaw who responds with words to the effect of “why are you doing this”, with no effort to belay Picard’s (unlawful) instructions. So we have our first major contradiction. It also throws my previous ‘Picard is being shown courtesy’ headcannon into disrepute- it now seems far more likely the writers just didn’t know if Picard had authority or not. I’d say it’s a conflicting element of multiple drafts but I think to Nu Trek writers redrafting means something to do with the Vietnam war.\n\n“I don’t care what rank I do or don’t have I need a tactical team now!”\n\nNo Seven. No. That’s not how the chain of command works. When you are relieved of duty it’s because your superior doesn’t think you’re up to the job. It means your orders are now unlawful and you have no authority to give anyone instructions- least of all squads of armed soldiers. I just can’t get over this and it’s quintessential Nu Trek writing. They don’t understand how military and military derived organizations work. Rank, authority and chain of command exist for a reason. Part of that reason is so that people whose fitness is suspect don’t have the authority to give potentially equally suspect orders to say… squads of armed troops who may need to kill someone. I know I keep hitting that point home, but it’s one thing if, say,  Seven demands a tech to fix her replicator while she’s relieved of duty- it’s another to be giving potentially life and death orders.\n\nSo we’re two episodes in and command authority is now meaningless. Retired officers can give lawful orders but they can’t, and officers relieved of duty can still give orders *if they reaaaaaly mean it*. At this point I’m waiting for an ensign to become first officer just because they’re popular. Wouldn’t that be stupid eh?\n\nThe biggest disappointment is Raffi. After getting me totally on board with the character in episode 1, episode 2 sent me right back to hating her. Every single bloody scene she’s in starts with her delivering a recap. Even if she’s recapping events to someone already aware of those events. The dialogue is back to those weird, Lucas-esque declamations. On one occasion I got the impression that she was trying to get stuff straight in her own head- which is fine given Raffi is not the most stable and lucid of people. But as I was watching I thought ‘they need some quick cuts and discontinuous edits here to emphasise mania’. Then at the very end of her recap they do just that. Once. You’ve seen the ‘jarring edits to convey madness’ trope before (Arcane is a recent example), but the fact they only did a single discontinuous edit leads me to suspect the editor isn’t even aware of the trope and just happened to make a mistake in a place where the mistake works in favour of the show.\n\nPatrick Stewart is too old to do this. It’s harsh. It’s moderately insulting. But it’s true. He can’t even deliver his lines well while sitting down. It’s now past the point of him playing an older version of the character and well into the realms of- not to put to fine a point on it- physical incapability. I feel like a complete shit for saying it. But when he’s making painful rasps on the occasional syllable even while sitting down it’s embarrassing to watch. It’s like watching someone with a foot injury run a race. It may be impressive that they’re trying but at the end of the day… that’s a slot that could have gone to someone who could actually be part of the competition. Maybe Stewart is just that good of an actor, but then the criticisms just transfer to the character. However you shape it- man or myth- this is not a character that should be out having adventures. \n\nOur villain is… well there’s potential there. Sort of. If the performance was a little less goofy Vadic might actually be threatening. Make her warbling voice a little more steady with greater variation only at emotional peaks and you’d have the impression of someone cracked but able to hold herself together anyway. Someone a little more in the vein of Ricardo Montablanc’s take on Khan. As it stands I just see Frau Farbissna. For around 10% of the time she’s threatening. For the remaining 90% she’s just try hard. Also the writers seem to have an incredibly twisted (read, ‘wrong’) view on what a Shrike is. For starters it’s not a carrion bird, it’s a predator. Famously so. Also there’s nothing threatening about comparing your ship to a carrion bird. Oh your ship is so pathetic it can only scavenge what something else killed? Reaaaaaaly browning my trousers over here. Bra-fucking-vo. Wait did they confuse the words carrion and carnivore? Nah they can’t be that incompetent surely. Right? RIGHT!?\n\nThe loggerhead Shrike is best known for two things. First it’s a passerine predatory carnivore. Passerine as in robins, tits, those sorts of small songbirds* you often see at the bird feeder. Predatory carnivore as in… well a meat eater and hunter. Second it ‘stores’ its kills by skewering them on thorns or in some cases- barbed wire. As the bird is quite weak, in many cases this is also how it actually kills its prey.  So appropriately contextualised it’s a pretty good name for a small, but dangerous warship.\n*I apologise to all the twitchers and ornithologists for this flagrant colloquialism. \n\nBut when Vadic attempts to make a threat out of the name it’s just… wrong. She implies that the ship will ‘peck’ them to death, destroying them system by system. She makes no mention of the ‘Butcher bird’s most well known and threatening trait- picking its prey up and skewering it on something sharp. I can see where they are going but it’s just not right. To anyone familiar with the Shrike the description is weird. To anyone else the threat works without the comparison. So why bother bringing the ship’s name into the threat? And if you’re going to- why make such a weird description of the Shrike, especially calling it a carrion bird?\n\nShaw has two reasons to not mess with Vadic- his ship is an explorer and not heavily gunned (hers is armed to the teeth) – and he has a crew of 500 people. So far, so good. Shaw doesn’t want to lead 500 people to their deaths in a fight they can’t win. Perfect motivation for a Starfleet officer. I didn’t need to be reminded of that every time he refuses to confront the villain. It’s a small thing but like Raffi’s recaps it leads to highly artificial speech and a patronizing experience for anyone who can remember what a character said about their motivations 20 minutes ago. Play it as a conversational trump card or leave it out. Don’t do this weird half in half out thing where it sounds like Shaw is explaining it for the first time- again.\n\nLike a lot of Nu Trek if you leave your brain at the door there’s certainly enjoyment to be had. But think about that. You have to switch off your brain to enjoy Star Trek. For the people who keep asking “Why do people hate Nu Trek?” (and then promptly vanish when given legitimate reasons unrelated to ‘It’s woke’) there’s the issue in a nut shell. What was an intelligently written, often challenging show now actively requires suppression of thought instead of promoting thought. With episode 2, Picard season 3 now appears to be hurtling down that same track, squandering almost all the good will episode 1 created. If Episode 3 isn’t a banger then I’m out. As I said in my previous review on episode 1 the pattern is always that episode quality declines over each season, and I’m not going to be suckered into wasting my time on crap. The only reason I’m giving episode 3 a chance is because I’m worried that I’m only letting myself see what I expect to see and that I’m losing objectivity. But my self doubt will only carry Picard so far.",
        "created_utc": 1677676434,
        "upvote_ratio": 0.35
    },
    {
        "title": "the tv show sliders",
        "author": "Anvis_Infinity",
        "url": "https://www.reddit.com/r/scifi/comments/11f2qib/the_tv_show_sliders/",
        "text": "I want something like slider, Sliders for me was f###### amazing character going from one world to another and the amazing thing Each episode features a different world, with its own unique characters, cultures, and challenges. and that is what makes it awesome I want something like sliders a tv show like it or book or comic or anything even if there is an upcoming tv show like slider tell me I will wait for it",
        "created_utc": 1677674325,
        "upvote_ratio": 0.79
    },
    {
        "title": "All hail the great and mighty Observers",
        "author": "hashvagabond",
        "url": "https://i.redd.it/lylq8hgof4la1.jpg",
        "text": "",
        "created_utc": 1677673709,
        "upvote_ratio": 0.93
    },
    {
        "title": "Commission piece I did for someone’s game",
        "author": "Zakoriart",
        "url": "https://i.redd.it/kiimcjviu5la1.jpg",
        "text": "",
        "created_utc": 1677673089,
        "upvote_ratio": 0.86
    },
    {
        "title": "The Old West’s toughest duke it out with the best from another world in, Cowboys &amp; Aliens (2011).",
        "author": "WildDog3000",
        "url": "https://v.redd.it/ejyccmv6t5la1",
        "text": "",
        "created_utc": 1677672420,
        "upvote_ratio": 0.73
    },
    {
        "title": "Cup Noodle Reveals Cyberpunk: Edgerunners Commercial and Artwork",
        "author": "cyberkell",
        "url": "https://www.cyberpunkanime.net/articles/cup-noodle-reveals-cyberpunk-edgerunners-commercial",
        "text": "",
        "created_utc": 1677668373,
        "upvote_ratio": 0.67
    },
    {
        "title": "The Mandalorian season 3 episode 1 recap (2023) – Mando’s apology tour",
        "author": "BetFar2378",
        "url": "https://www.thedigitalfix.com/star-wars/the-mandalorian-season-3-episode-1-recap",
        "text": "",
        "created_utc": 1677666718,
        "upvote_ratio": 1.0
    },
    {
        "title": "she is not real model..😯😯",
        "author": "TomorrowSpecific3129",
        "url": "https://youtube.com/shorts/R8DX0KCeJy0?feature=share",
        "text": "",
        "created_utc": 1677664147,
        "upvote_ratio": 1.0
    },
    {
        "title": "just a post-apocalyptic story I'm working on.",
        "author": "muslimredneck",
        "url": "https://www.reddit.com/r/scifi/comments/11ezms6/just_a_postapocalyptic_story_im_working_on/",
        "text": "CHAPTER 1: life among the Ataperry\n\n(Ataperry is from the twentieth-century English root \"Auto repairmen\").\n\nPlace: a forest in the mountains of the westernmost province of the Denver kingdom, officially Colorado's capital. Near the border with the Deseret federation.\n\nYear: 2104.\n\nJamisi turned the start-crank on his truck, and his old rusty vehicle roared to life and began barreling down the old decaying county road. he checked his mirror and noticed that the old plastic cables they had just bought must have been rotted, as the Jugs of corn whiskey used as fuel were tumbling about the bed. \"Hey, Bruth!\" he shouted. \"Retie the buck'a corn fuel in the bed!\" Jamisi's younger brother Torrence, who was riding shotgun, set his rifle below his seat and signaled for the women sitting in the back to move. Jamisi stuck his arm out the window and gave the hand signal for the rest of the clan caravan to slow down. Torrence pushed aside the curtain and nimbly climbed out the truck's back window. His older sister Mary handed him the coil of juniper rope that she and Jamisi's new wife Masina had just finished making. The boy then began tying down the dozen or so fallen-over ten-gallon jugs of fuel lying in the back. He grunted loudly as the torrent of rain hit his face. Then paused to tighten the straps on his elk skin clothing and bent down to finish his task. Finally, he leaped back through the window, grabbed his rifle, and sat back down on the passenger seat next to his brother. May, Torrence's twin sister, handed him a rag, and he wiped the rain and sleet out of his hair and off his clothes. Jamisi signaled for the caravan to speed up, and the group of trucks, vans, and trailers sped down the bumpy old road.  May, the only person in the vehicle who could read, started reading Genesis from her king James Bible out loud to the other passengers. Torrence nodded off, and when he awoke, the convoy had pulled to a stop. They had arrived at Dillen Lake. Torrence looked around; they were surrounded by the old ruins of what had once been the town of Fresco. The old town buildings had rusted away and were no longer livable, so the remaining people mostly lived in the small village of log cabins on a small island in the middle of the lake or nearby farmsteads. They often came here because the local community allowed the Ataperry clan to scavenge through the ruins in exchange for a discounted price of labor and trade. Now they would only spend a few days before moving on to Denver. Torrence felt a twinge of sadness, knowing that soon, he probably wouldn't be able to see any of the places he had grown up seeing. He had grown up traveling thousands of miles yearly, going from city to city repairing motors and vehicles in exchange for food and provisions and working in factories and farms. Moter repair had always been the family's preferred trade ever since they began traveling one hundred years ago. But nowadays, there was little business since the corporations had mostly vanished, and no one was selling gasoline anymore.\n\nFor decades the complex market-based economy of the settled world had been slowly fading. Thanks to most settled people choosing to grow old without children, America followed Europe and Asia into their slow withdrawal from the world. It was thought this crisis could be remedied with immigration; however, the same cultural forces were in play throughout Latin America, and the pool of willing immigrants eventually dried up. Nevertheless, the collapse had recently begun to slow as high birth-rate groups, such as the itinerant clans that wandered around searching for work, and religious minorities such as Mormons, Muslims, and especially the Amish, with their fivefold fertility advantage, were quickly becoming the majority of the population.\n\nThe old fading civilization had finally given up five years ago when Torrence was seven years old. A large solar flare, Akin to the Harrington event, had struck the earth. Destroying most electronics. This was not nearly as devastating in America as it would have been decades before. Much of the countryside was empty of people, and the internet, with its productivity-destroying powers, was already taboo for most of the population. The massive population of elderly died en mass. And millions of younger people franticly fled the already depopulated cities in search of farmland.\n\nThe Ataperry had attempted to continue their old lifestyle, scavenging through the cities and fixing tractors and cars in exchange for homemade ethanol which was now the only available fuel. But now, parts were difficult to find, and most people were farming the land by hand as their ancestors had once done. Horses were already prevalent among the rural villagers and nomadic people long before the solar flare, although the Ataperry prided themselves on their trucks. Torrence's community had decided that their best option was to either settle down and farm, survive through raiding, or give up their vehicles and move about on horseback, surviving off of the wilderness or herding cattle, sheep, or goats. After several years of trying to preserve their way of life and arguing about the best alternative, they finally decided on shepherding. They knew that in the Rockies there were many herds of wild horses, and large flocks of semi-wild sheep could be easily stolen from the King of Denver.\n\nTorrence opened the door and stepped out of the truck. He yawned and stretched, relieved to no longer be sitting in the stuffy truck. His sister May stepped out after him. \"Hey Tor, you think that's a good spot for a fire?\" she pointed at a large pothole in the old overgrown parking lot. \"Looks good to me,\" he said. \"Should I start a fire here?\" May shouted. \"Go ahead,\" their father called back as he backed his trailer into a nearby corner of the lot...\n\nI need to write more. Feel free to offer advice",
        "created_utc": 1677663814,
        "upvote_ratio": 0.6
    },
    {
        "title": "Babylon 5, the end of the Earth war as told by the media...with some behind the scenes.",
        "author": "tplgigo",
        "url": "https://www.youtube.com/watch?v=lzPP_2Bhl0E",
        "text": "",
        "created_utc": 1677652374,
        "upvote_ratio": 0.6
    },
    {
        "title": "Is Avatar: the Way of Water worth watching?",
        "author": "ZhuPeng1987",
        "url": "https://www.reddit.com/r/scifi/comments/11ewetj/is_avatar_the_way_of_water_worth_watching/",
        "text": "",
        "created_utc": 1677651989,
        "upvote_ratio": 0.5
    },
    {
        "title": "Laptop for CS Student?",
        "author": "Rising_Darknes",
        "url": "https://www.reddit.com/r/scifi/comments/11eulfk/laptop_for_cs_student/",
        "text": "[removed]",
        "created_utc": 1677646216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sub Hyping",
        "author": "ImDead_XD",
        "url": "https://www.reddit.com/r/scifi/comments/11eukwa/sub_hyping/",
        "text": "Just want to say how much I like this sub. I'm writing something that has a lot to do with sci-fi and I think I'll be coming here frequently for help and ideas. :)",
        "created_utc": 1677646172,
        "upvote_ratio": 0.57
    },
    {
        "title": "Every where",
        "author": "Past_Decision3632",
        "url": "https://www.reddit.com/r/scifi/comments/11eu5hu/every_where/",
        "text": "",
        "created_utc": 1677644849,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's The Worst Book Or Movie With The Best Premise?",
        "author": "Ahruzimel",
        "url": "https://www.reddit.com/r/scifi/comments/11esyyj/whats_the_worst_book_or_movie_with_the_best/",
        "text": "Basically the title! What's a book or movie that has a really interesting, inventive, engaging, promising premise... that just absolutely shit the bed in terms of its actual finished product? A terrible, awful, very bad book or movie that had the potential to be something incredibly good.\n\nI'm mostly interested in sci-fi examples, of course, but feel free to throw in others if you like!",
        "created_utc": 1677641393,
        "upvote_ratio": 0.88
    },
    {
        "title": "Turn Your Time Into Money | Be Social Get Paid",
        "author": "LieAdept5709",
        "url": "https://ref.timesocial.co/Adelbinm7md",
        "text": "",
        "created_utc": 1677636773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite sci-fi short stories?",
        "author": "Odd-Initiative-2011",
        "url": "https://www.reddit.com/r/scifi/comments/11er94w/favorite_scifi_short_stories/",
        "text": "I love short stories. What are your favorite sci-fi short story books?",
        "created_utc": 1677636631,
        "upvote_ratio": 0.5
    },
    {
        "title": "Favorite sci-fi short stories?",
        "author": "Odd-Initiative-2011",
        "url": "https://www.reddit.com/r/scifi/comments/11er90w/favorite_scifi_short_stories/",
        "text": "I love short stories. What are your favorite sci-fi short story books?",
        "created_utc": 1677636621,
        "upvote_ratio": 0.63
    },
    {
        "title": "What are some names for the room before you exit a spaceship",
        "author": "ImDead_XD",
        "url": "https://www.reddit.com/r/scifi/comments/11eqmmp/what_are_some_names_for_the_room_before_you_exit/",
        "text": "I'm looking for names for the room in a spaceship immediately before exiting the door to space.  Just for a story I'm writing. Anything that comes to mind would be helpful, Thank You.",
        "created_utc": 1677634921,
        "upvote_ratio": 0.22
    },
    {
        "title": "Visit Switzerland they said, it'll be fine they said...",
        "author": "Dirty_Wooster",
        "url": "https://i.redd.it/1achki1em2la1.jpg",
        "text": "",
        "created_utc": 1677633724,
        "upvote_ratio": 0.96
    },
    {
        "title": "'Visit Switzerland' they said, 'You will have a great time' they said",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677632768,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Dune: The Sisterhood’: Director Johan Renck &amp; Star Shirley Henderson Exit HBO Max Series Amid Creative Overhaul &amp; Production Hiatus For 7 months!",
        "author": "Neo2199",
        "url": "https://deadline.com/2023/02/dune-the-sisterhood-director-johan-renck-shirley-henderson-exit-hbo-max-series-1235273486/",
        "text": "",
        "created_utc": 1677632641,
        "upvote_ratio": 0.79
    },
    {
        "title": "Longtime lurker, first post. A break from serious discussion and truly a gem. Enjoy.",
        "author": "goat-head-man",
        "url": "https://www.youtube.com/watch?v=lul-Y8vSr0I",
        "text": "",
        "created_utc": 1677632438,
        "upvote_ratio": 0.82
    },
    {
        "title": "Photographed these this week, whatcha think!? [Wurmwood Photography - Model: Veronica Owens]",
        "author": "D00MB0XX",
        "url": "https://www.reddit.com/gallery/11epabh",
        "text": "",
        "created_utc": 1677631362,
        "upvote_ratio": 0.81
    },
    {
        "title": "Photographed these this week, whatcha think!? [Wurmwood Photography - Model: Veronica Owens]",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677631211,
        "upvote_ratio": 1.0
    },
    {
        "title": "The perks of working in a used bookstore. Today’s haul, all mint condition, for a fraction of the price. Bonus cat.",
        "author": "wuduwasa",
        "url": "https://i.redd.it/jovt71wlc2la1.jpg",
        "text": "",
        "created_utc": 1677630436,
        "upvote_ratio": 0.97
    },
    {
        "title": "Patrick Stewart once asked Doctor Who actress Lalla Ward why she would work in science fiction or on television",
        "author": "Helloimafanoffiction",
        "url": "https://www.reddit.com/r/scifi/comments/11eode6/patrick_stewart_once_asked_doctor_who_actress/",
        "text": "It’s interesting to think how Stewart’s experience on TNG changed him to become the man we know today",
        "created_utc": 1677628977,
        "upvote_ratio": 0.69
    },
    {
        "title": "please help Are there references on which the idea of a screenplay story is based tiny alien spaceships or Flying saucers UFOs?",
        "author": "bqvwvpd",
        "url": "https://www.reddit.com/r/scifi/comments/11emmyb/please_help_are_there_references_on_which_the/",
        "text": " please help  \nplease help Are there references on which the idea of a screenplay story is based tiny alien spaceships or Flying saucers UFOs?\n\n[https://www.youtube.com/watch?v=erhtZdwAhw8](https://www.youtube.com/watch?v=erhtZdwAhw8)\n\n[https://www.youtube.com/watch?v=095UWFQHruc](https://www.youtube.com/watch?v=095UWFQHruc)\n\n[https://www.youtube.com/watch?v=uTyeLJtOprE](https://www.youtube.com/watch?v=uTyeLJtOprE)\n\n[https://www.youtube.com/watch?v=eGl\\_e1oIP5E](https://www.youtube.com/watch?v=eGl_e1oIP5E)\n\n[https://www.youtube.com/watch?v=zubE4r3Vd\\_w](https://www.youtube.com/watch?v=zubE4r3Vd_w)",
        "created_utc": 1677624714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sci fi movies with the best cities and worlds?",
        "author": "TheIMaster64",
        "url": "https://www.reddit.com/r/scifi/comments/11emhjk/sci_fi_movies_with_the_best_cities_and_worlds/",
        "text": "So I'm looking for sci fi movies with amazing looking cities and different planets. I thought the blade runner movies, Alita battle angle, black panther movies, avatar movies, guardians of the galaxy movies, ant man and the wasp quantumania, valerian and the city of a thousand planets, and the fith element had the most creative ones.",
        "created_utc": 1677624349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some good 'culture shock' stories",
        "author": "cline_59",
        "url": "https://www.reddit.com/r/scifi/comments/11eliu3/looking_for_some_good_culture_shock_stories/",
        "text": "Anything that focuses on the various cultural/biological differences between humans and other species/nations. Something along the lines of what r/HFY tends to post but more nuanced and fleshed out.",
        "created_utc": 1677622054,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Herb Chronicles Kickstarter is now live!! Help support now!",
        "author": "Superb-Ad-705",
        "url": "https://kickstarter.com/projects/1413138771/the-herb-chronicles-adult-animated-series-animatic-pilot",
        "text": "",
        "created_utc": 1677619249,
        "upvote_ratio": 1.0
    },
    {
        "title": "made with staryai",
        "author": "TheApetureLord",
        "url": "https://i.redd.it/6dk8ner901la1.png",
        "text": "",
        "created_utc": 1677614188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Showrunner Trey Callaway on Mercy Point, an Undeservedly Forgotten Sci-Fi Gem",
        "author": "ThereAreSixLights",
        "url": "https://twincitiesgeek.com/2023/02/showrunner-trey-calloway-on-mercy-point-an-undeservedly-forgotten-sci-fi-gem/",
        "text": "",
        "created_utc": 1677609427,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your go-to comfort episode? Mine’s The Inner Light",
        "author": "Open-Steak-4568",
        "url": "https://i.redd.it/cws5hcb8wyka1.png",
        "text": "",
        "created_utc": 1677606611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Недрочабрь",
        "author": "Separate_Sell_6434",
        "url": "https://www.reddit.com/gallery/11eeju4",
        "text": "",
        "created_utc": 1677605556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sooo...a flower that is a drug that the authorities cant stop and a loser has to go covert...",
        "author": "5YNTH3T1K",
        "url": "https://www.reddit.com/r/scifi/comments/11eegb7/soooa_flower_that_is_a_drug_that_the_authorities/",
        "text": "Sounds like ~~A Scanner Darkly by PKD~~   ...  **The Hellflower by George O Smith...** \n\n[https://www.gutenberg.org/ebooks/69124](https://www.gutenberg.org/ebooks/69124)\n\nStill reading but yeah... like yeah... wow. Make your own mind up. \n\nand is it me or does **Do Androids Dream of Electric Sheep** lift a few core ideas from **I, robot** by Asmov ???\n\nDon't mind me... just making some astute observations... \n\nCheck the dates if you like.",
        "created_utc": 1677605324,
        "upvote_ratio": 1.0
    },
    {
        "title": "An attempted photograph of the first Full-Scale Noetic Alteration System (or Altar) constructed by a posthuman research program.",
        "author": "prokhorvlg",
        "url": "https://i.redd.it/jc96vghyjyka1.jpg",
        "text": "",
        "created_utc": 1677602479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blade Runner 2049",
        "author": "Alternative-Virus139",
        "url": "https://i.redd.it/8rps3qw8dyka1.png",
        "text": "",
        "created_utc": 1677600230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terran Trade Authority brought to life. I had all of the books and read them constantly. This video brought back some good memories.",
        "author": "Cirrus-Nova",
        "url": "https://youtu.be/FQunbwFw2VI",
        "text": "",
        "created_utc": 1677599961,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to sci fi and looking for a short story magazine to subscribe to!",
        "author": "crocodilewrangler",
        "url": "https://www.reddit.com/r/scifi/comments/11ebjbl/new_to_sci_fi_and_looking_for_a_short_story/",
        "text": "Hey all, pretty much the title. I've very recently really gotten into short story sci fi after reading several anthologies by Ray Bradbury, Robert Sheckley, Ted Chiang, etc. etc. I've been wanting to read more but  so I thought, Why not try a magazine?! Unfortunately there are infinite options all of which look amazing. Any recommendations for favorites? I'm especially looking for one that publishes authors from diverse backgrounds. Thanks!",
        "created_utc": 1677598680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two March book releases that I am highly anticipating are \"The Strange\" by Nathan Ballingrud and \"Antimatter Blues\" by Edward Ashton. How about you?",
        "author": "Degz_Toy_Den",
        "url": "https://www.reddit.com/gallery/11eaz8a",
        "text": "",
        "created_utc": 1677597846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chrono-Changers - a Sci-Fi series theme made with the help of ChatGPT",
        "author": "zathruswriter",
        "url": "https://www.reddit.com/r/scifi/comments/11e7xol/chronochangers_a_scifi_series_theme_made_with_the/",
        "text": "I was just playing around with the popular AI chat bot ChatGPT and wanted it to help me come up with an idea for a sci-fi series. The bot actually gave me 5 possible ideas around which to plot the series, which in turn gave me an idea for a Sci-Fi series. And here's what we came up with...\n\nN.B.: what do you think about this bot-human cooperation and the concept?\n\n \n\nTitle: \"Chrono-Changers\"\n\nPremise: In a far-off dimension, a council of powerful beings known as the Chrono-Keepers has decided to intervene in human history. Their plan: to send entities from their dimension into human bodies at different time periods in order to influence the course of history.\n\nEach episode would focus on a different influential figure from human history, such as Julius Caesar, Leonardo da Vinci, or George Washington. However, unbeknownst to the rest of the world, these figures are not who they appear to be. They are actually vessels for the Chrono-Keepers, who have imbued them with their own unique powers, abilities, and moral compasses.\n\nSome of the Chrono-Keepers may choose to emulate the historical figures they inhabit, using their new influence to bring about positive change or further their own agendas. Others may struggle to adapt to their new bodies, conflicting with the true nature of the historical figures and risking their own survival.\n\nAs the series progresses, a larger story arc would emerge, revealing the true motivations of the Chrono-Keepers and the consequences of their meddling with human history. Along the way, viewers would be treated to a unique blend of sci-fi and historical drama, as they watch these powerful entities navigate the complexities of human life and influence the course of history.\n\nCast: The show would require a talented ensemble cast to bring its historical figures to life, as well as actors to portray the Chrono-Keepers in their own dimension. Guest stars could also appear as other historical figures who cross paths with the Chrono-Changers.\n\nOverall, \"Chrono-Changers\" would be an exciting and thought-provoking sci-fi series that blends time travel, historical drama, and ethical dilemmas into a captivating and unforgettable viewing experience.",
        "created_utc": 1677594198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie of the Day - The Beyond",
        "author": "jcwillia1",
        "url": "https://www.reddit.com/r/scifi/comments/11e5f8x/movie_of_the_day_the_beyond/",
        "text": "This is from director \"Haz\" again - I think this is the same guy who had Katee Sackhoff talk to an AI for 100 minutes in 2036 Origin Unknown.\n\nSo fortunately this movie is better than that one.\n\nMostly unknown actors - the girl reporter from The Expanse is here - fortunately for everyone, she is nowhere near as sleazy as her character is in that show.\n\nThink of this as Contact crossed with Robocop told in the style of District 9 (sadly, no Copley today)\n\nI liked this movie's ending much more than 2036 and I might even call it thought provoking.",
        "created_utc": 1677589074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Star Trek's Future and New Fans?",
        "author": "Advanced_Log3576",
        "url": "https://www.reddit.com/r/scifi/comments/11e58j5/star_treks_future_and_new_fans/",
        "text": "Are enough new fans being made to sustain the franchise when the past and current generation of fans die out?\n\nDo you sense there being a disinterest from the general population and TV audience i.e. everyday discussion and social media engagement ?\n\nIs the current Paramount+ era of shows reaching the uninitiated?\n\nWas the 90s Berman Era the last boom for Star Trek?",
        "created_utc": 1677588511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Projecting galaxies..",
        "author": "Relative_Scr",
        "url": "https://v.redd.it/1psclls5cxka1",
        "text": "",
        "created_utc": 1677587799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pris (Miak) [Blade Runner] [oc]",
        "author": "miak9999",
        "url": "https://i.redd.it/zb0wpzcucvka1.png",
        "text": "",
        "created_utc": 1677564342,
        "upvote_ratio": 1.0
    },
    {
        "title": "George Lucas before CGI. 1984",
        "author": "j3434",
        "url": "https://i.redd.it/51godc2s7vka1.jpg",
        "text": "",
        "created_utc": 1677562072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inside Oprah Winfrey's Billionaire Lifestyle and Net Worth",
        "author": "Distinct-Art7022",
        "url": "https://youtube.com/watch?v=L-Kv-YXb4n0&amp;feature=share",
        "text": "",
        "created_utc": 1677555981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help identifying a movie from around summer 2019",
        "author": "MY_work_acct_69",
        "url": "https://i.redd.it/ao2srmt50wka1.jpg",
        "text": "",
        "created_utc": 1677553608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reviewer for The Mandalorian Season 3",
        "author": "Gimlus",
        "url": "https://www.reddit.com/r/scifi/comments/11dv1v2/reviewer_for_the_mandalorian_season_3/",
        "text": "[removed]",
        "created_utc": 1677553229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations of some grounded first contact books?",
        "author": "YosemitePen22",
        "url": "https://www.reddit.com/r/scifi/comments/11dstki/looking_for_recommendations_of_some_grounded/",
        "text": "Things similar to the movie Signs, or Story of your life by Ted Chiang?",
        "created_utc": 1677546982,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Klingon Who Invented Warp Drive",
        "author": "DaveKellett",
        "url": "https://www.reddit.com/gallery/11ds9f4",
        "text": "",
        "created_utc": 1677545711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hurry up to pick up the Airdrop New from Arbitrum $ARB. Rewards started 27.02.23",
        "author": "Reasonable-Line-8201",
        "url": "https://www.reddit.com/r/scifi/comments/11drndk/hurry_up_to_pick_up_the_airdrop_new_from_arbitrum/",
        "text": "[removed]",
        "created_utc": 1677543822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know who this is??",
        "author": "dingleitch",
        "url": "https://i.redd.it/zgdnp66w1vka1.jpg",
        "text": "",
        "created_utc": 1677542084,
        "upvote_ratio": 1.0
    },
    {
        "title": "it will give you superpowers",
        "author": "Then_Speaker_2943",
        "url": "https://youtu.be/8dbiqu3lu1I",
        "text": "",
        "created_utc": 1677541988,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why Ant-Man is Special (And Why It Isn't)",
        "author": "StuartBarron",
        "url": "https://youtu.be/nOZeBGfhJUU",
        "text": "",
        "created_utc": 1677536875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remake Ocean's Eleven, but everyone is an astronaut.",
        "author": "atomcrafter",
        "url": "https://www.reddit.com/r/scifi/comments/11dnx28/remake_oceans_eleven_but_everyone_is_an_astronaut/",
        "text": "George Clooney (Solaris/Gravity)\n\nBrad Pitt (Ad Astra)\n\nMatt Damon (The Martian/Interstellar)\n\nDon Cheadle (Mission to Mars/Avengers: Endgame)\n\nSandra Bullock (Gravity)\n\nAnne Hathaway (Interstellar)\n\n- I have not seen Valerian.  Does Rihanna have a spacesuit?",
        "created_utc": 1677534465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Šárka Pokorná na TikTok",
        "author": "Sedm76sest",
        "url": "https://www.tiktok.com/@sajna_pokor?_t=8aEiiQNPfKX",
        "text": "",
        "created_utc": 1677531843,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Killjoys] Notable Tracks ?",
        "author": "razloric",
        "url": "https://www.reddit.com/r/scifi/comments/11dknec/killjoys_notable_tracks/",
        "text": "Minor critique but 2 seasons in, I can't recall any music in the show being as good or at least similar style as that track in the pilot episode (\"I'm alive\") and that was a tad disappointing.",
        "created_utc": 1677526615,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the Future of Racism Looks Like - A Thought Provoking Scifi Short Film about AI.",
        "author": "xPrimer13",
        "url": "https://www.youtube.com/watch?v=x9qYgcufVSA",
        "text": "",
        "created_utc": 1677526158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share Episode I get on here lesting some times",
        "author": "Gullible-Row-9821",
        "url": "https://listen.stitcher.com/yvap/?af_dp=stitcher://episode/212344214&amp;af_web_dp=https://www.stitcher.com/episode/212344214&amp;deep_link_value=stitcher://episode/212344214",
        "text": "",
        "created_utc": 1677524904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transform // Me // 2023 // animated version in comments",
        "author": "has_some_chill",
        "url": "https://i.redd.it/j43c8o1hqrka1.png",
        "text": "",
        "created_utc": 1677519943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists Use Quantum Mechanics to Pull Energy out of Nothing; reminds me of the technology powering the Theseus in Blindsight.",
        "author": "pavel_lishin",
        "url": "https://www.quantamagazine.org/physicists-use-quantum-mechanics-to-pull-energy-out-of-nothing-20230222/",
        "text": "",
        "created_utc": 1677516178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone created any moodboards or visual content using sci-fi themes?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677515959,
        "upvote_ratio": 1.0
    },
    {
        "title": "All About Sun",
        "author": "Zealousideal-Aide795",
        "url": "https://youtu.be/UxLKvwIppLg",
        "text": "",
        "created_utc": 1677515822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roll Off A Tangent 045 - The Monster, by A E van Vogt",
        "author": "Wolfzuzu",
        "url": "https://youtu.be/UBp1LoiY1Cg",
        "text": "",
        "created_utc": 1677515548,
        "upvote_ratio": 1.0
    }
]