[
    {
        "title": "What happened to the chats that were on Reddit before?",
        "author": "3mpire915",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vgrkn/what_happened_to_the_chats_that_were_on_reddit/",
        "text": "There were mental health chats with multiple people and I am just curious.",
        "created_utc": 1675714341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relapse-",
        "author": "Competitive_Craft_13",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vgqj0/relapse/",
        "text": "I enlisted in the military after about 6 months of being out of Highschool. I saw my life not going anywhere and I failed to enroll myself in college because I struggle with crippling social anxiety. I never got vaccinated and used it as an excuse to not attend college. I put myself in constant uncomfortable  scenarios because I know I struggle to be social. I was a server and a front desk agent. Which definitely improved my social skills after they took a hit during Covid but I had no direction,no future goals or anything to really work towards, I was just working to work. I fell into heavy alcoholism during the pandemic, I stopped attending (virtual) highschool, wouldn’t show up to work, my ex left me and I was basically a bum just sleeping all day and going out to random parties. I managed to graduate highschool after taking online courses during the summer but I was disappointed in myself for letting my grades slip during the pandemic as I was in IB classes. I was just working with no direction and saw myself continuing to drink. It got to the point where I would storm out of hotel room kickbacks emotionally and drunk drive to San Francisco to go to the club. I decided to enlist to the military given how I saw myself in a downward spiral. Once I had gone to the recruiter and officially signed my enlistment contract, I began training myself for basic training. Religiously weight training and on a very strict diet. I began seeing results, my confidence went up and I finally felt I had some direction in life. My ex all of a sudden had resparked her interest in me along with, I’ll call her “B,” a girl I had been talking to for a couple months now began escalating our encounters. I ultimately began dating “B” and left to basic training 3 months later. During basic training I would write her everyday and religiously beat up my body and eat very strictly. I was very motivated the first month and a half but nearing the end of it. I felt so lost, I lost my confidence despite working very hard. Maybe it was the loss of both facial and head hair. Or the new environment. I felt very out of place. I came second in the company in overall ACFT score but still struggled with any self confidence or thinking of myself in a negative manner. “B” came out to see me, flew out 1700 miles out of her own pocket. I felt very demoralized and anxious. I wish I could’ve received her better but I couldn’t ignore the mental agony I was in. I didn’t want to be out in public and being out in open spaces made me very anxious I didn’t enjoy the time we spent in public spaces. But when we got into the hotel room alone I finally felt safe again. I had forgot who I was. I contemplated ending the relationship several times because I felt I wasn’t worthy enough and she deserved someone who could attend to her and give her attention physically and emotionally. I don’t know where I was going with this but I ended up marrying “B” after a lot of contemplation. I came home for the holidays and proposed to her infront of her family. I want to be better but I find myself relapsing into old habits. Compulsively eating, masturbation, not cleaning my room, and inconsistent workout routine. I want to be better but I have no drive, no motivation, I stuff my feelings away and spend hours on my phone to distract myself from the painful reality of my existence. I can’t be weak I have a wife who I must be strong and disciplined for but I struggle with consistency. I am 19 a month into my marriage but I feel like a failure. Any advice?",
        "created_utc": 1675714272,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so tired of being like this.",
        "author": "DogGuitar",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vgoic/im_so_tired_of_being_like_this/",
        "text": "[removed]",
        "created_utc": 1675714151,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you are born without advantages, nobody will care what happens to you",
        "author": "carbohydrate4",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vgjj6/when_you_are_born_without_advantages_nobody_will/",
        "text": "[removed]",
        "created_utc": 1675713843,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to change my internal body clock?",
        "author": "Turbulent-Broccoli97",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vfu8u/how_to_change_my_internal_body_clock/",
        "text": "Hi, \n\nRecently I realized that if I keep studying at the schedule I currently have, I will have the least productivity based on what I will be going through everyday. \n\nOur school will start additional classes in the afternoon, so I will be coming home late in the evening from now on. And if that's the case, it will be akin to digging my own grave if I think of sleeping at night.\n\nAs I won't have the scope of studying on my own at daytime, Night would be the only preferable time for me to do so. But the problem is that I'm not used to studying as a night owl.\n\n\nI searched on the internet and almost all of them suggested taking caffeine, preferably coffee to make the task of staying awake easier. But the price of coffee, even for a little amount has doubled here in the past few days. \n\nThough we have coffee, they are very limited to be consumed on a regular basis. \n\nWe do have tea, but I realized they aren't as effective as coffee for me. Ironically, they made me feel even sleepier instead. \n\nDo you guys have any idea how to stay awake effortlessly and effectively at night?\n\n\nI mean, how do I convince my body to sleep at daytime instead of night?\n\n\nIf you're wondering, I plan to cope with the required amount of sleep as \"naps\" of 1-3 hours throughout the day. \n\n\nThanks.",
        "created_utc": 1675712263,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Repost] The Effectiveness of a 4-Week Online Mindfulness Program (Moderator Approved)",
        "author": "PSYResearcherUCCS",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vft8a/repost_the_effectiveness_of_a_4week_online/",
        "text": "[removed]",
        "created_utc": 1675712197,
        "upvote_ratio": 1.0
    },
    {
        "title": "can I change my user name on here?",
        "author": "gettingthic",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vfqn2/can_i_change_my_user_name_on_here/",
        "text": "[removed]",
        "created_utc": 1675712032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Midlife Crisis Prevention",
        "author": "Dazzu1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vf64g/midlife_crisis_prevention/",
        "text": "I’m currently 37. I’m living alone finally away from home. I don’t feel important or fulfilled in today’s world of success oriented mindsets.\n\nHow do I overcome this either by no longer caring if I fail to be important or actually becoming important. Perhaps I need to love myself but I’m not sure what the self love formula or recipe is.\n\nI’m anxious and impatient but I feel I didn’t have much life living. I’m tired of waiting around for it. I need a direction. I’m tired of waiting for success to fall in my lap. Is there any hope for me to grow?",
        "created_utc": 1675710731,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop being a people pleaser",
        "author": "Frosty_Green8522",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vf59e/how_to_stop_being_a_people_pleaser/",
        "text": "Does anyone have any tactical ways to stop being a people pleaser? It is so ingrained in me now that it's almost impossible to kick.  I need to learn how to put myself first, especially now (I'm 48).  I talk about \"entering my villain era\" but I can't seem to back this energy up with any actions.  If you have recovered from people pleasing, please share your secrets!",
        "created_utc": 1675710674,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I set up a morning routine?",
        "author": "S500GT19",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10veibs/how_do_i_set_up_a_morning_routine/",
        "text": "It’s extremely difficult because of me job to have a morning routine. I go in at 5am and have to leave my house at 4:20 in order to make it in time. How can I have a good morning routine while still being able to get enough sleep?",
        "created_utc": 1675709198,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do when you've done everything right but are still unhappy?",
        "author": "altiores",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10veb9w/what_to_do_when_youve_done_everything_right_but/",
        "text": "I've really improved over the last few years. I've learnt to love myself, and I constantly work towards being the best version of myself.\n\nI've improved my diet, became more self disciplined, have a goal that I'm motivated to achieve, learnt how to listen to my body to figure out what I want. I'm still working on a few things - I'd like to exercise more, be more hydrated, and start meditating, but I struggle to keep these up for long periods of time.\n\nStill, I'm unhappy. Even though I'm happy with where I am and where I'm going, I'm unhappy.\n\nMaybe it's work (it's part customer service, which is just a temporary thing but makes me feel awful), or that I'm not social enough, but I acknowledge that it may be more a mental health issue.\n\nI worry about bringing it up to my GP as I don't want to be given a diagnosis that will harm my career - I'm heading in a really good direction, and it will cause me more harm than good to loose my future. \n\nI am managing it, I am coping with it, and like I said I have significantly improved - but now I feel mentally stagnant. Below the surface, I'm just permanently unhappy. Not depressed as I was. But unhappy.\n\nI can't figure out why.\n\nI was wondering if anyone had any tips or techniques? Things I should prioritise in my efforts to live a happier life? If you've been in this situation before? Advice on mediation, or self reflection, etc. Anything.\nThanks",
        "created_utc": 1675708744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Its okay to play video games if you moderate your time playing them.",
        "author": "MannShippingCo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ve2ao/its_okay_to_play_video_games_if_you_moderate_your/",
        "text": "I see alot of people downplaying video games and saying they are nothing but garbage but thats just not true. I play video games but I still get really good grades and I spend time with my family and do physical exercise way more then I play video games. As a matter of fact video games can help your brain if you play them in moderation. Video games are proven to improve memory, critical thinking, strategy making, focus, reaction time, creativity and they can even help you learn some languages. I know books have benefits to but I think that people should read books and play video games so they can get the brain benefits from the both of them. Video games are not nonsence they are an art form. They have amazing storys and really cool graphics and they allow us to fully immerse ourselves in worlds. Yes their are addictions to video games but people can be addicted to books too. And their are ways to manage addictions without quitting video games. I usually play for about 1 to 2 hours a day and after that I just shut off my PC and do something else. You can try many different ways to play less on video games. And i find that I enjoy video games more when I play them less often. People can still succeed in life and play video games.",
        "created_utc": 1675708180,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stop being my worst enemy?",
        "author": "RaceyDesiWithNoFacey",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vds1v/how_to_stop_being_my_worst_enemy/",
        "text": "I have a personality that I've been subconsciously pushing down and down because of anxiety of whether it's acceptable by others, or weird or makes me come off weird or stupid. My confidence and self love has deteriorated, that sometimes I'm doing a million things at once only because i like the noise in the background, it helps me feel at ease weirdly - or keeps me at the edge between comfort and effectiveness. I feel that the constant state of being unsure has affected me alot by making me overthink. It's an endless cycle- overthinking gives rise to multiple equally weighted decisions to a situation, and that makes me indecisive and then the indecisiveness makes me overthink about my self-worth and i bad mouth myself in my head that I am so weak. \n\nThe negative thoughts have taken over half my brain it seems. Because at one point it tells me I'm better than people, i work harder and places me at a pedestal but then when someone performs better than me- rather than to learn from them and admire their work, I just immediately drop myself to the lowest standard and judge myself so harshly my god. It's like i hate myself?! \n\nBut then when i put effort into myself like work out or when others say nice things to me, i feel good but it just STRIKES a chord in my emotions that makes my chin shiver and my eyes tear up. I feel like my brain doesn't let me love myself, when deep down it's not so complicated right? I am my brain.. \n\nTl;dr- intrusive thoughts are so strong, it's dramatically taking control of my life and everything I am. I know I want to love myself, but it's like a demon telling me I cannot.",
        "created_utc": 1675707536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does high school ever get better",
        "author": "Gullible-Cranberry60",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vdq6y/does_high_school_ever_get_better/",
        "text": "I have 3 friends who are absolute bitches. Friend 1 is so self obsorbed and thinks she's so much better than me and makes 'jokes' about me and other people. Saying things like \"you have no friends\" and \"your weird, awkward and boring\" and if i stand up for myself she says \"your so serious, cant even take a joke\". Friend 2 is mean but in a nice way? Like friend 3 got a boyfriend then friend 2 turned to me and went \"when are you going to get a boyfriend\" but in a rude way. I also said I was going to join the gym in the summer and she said \"yea I think you should do something\" she's popular for some reason? Friend 3 is okay. She doesn't make fun of me but she doesn't want to go out or have anything to do with me at all. I feel like they all just gang up on me sometimes and just laugh at me but that's what everyone does in high school.my mums friend told me I'm too mature to find friends in high school and that I'm like talking to a 30 year old woman. I didn't even think I sounded mature while talking to her, I just thought I was speaking like any other person would. I do have 2 other people I can talk to at school but they're beat friends and I dknt want to make thier due a trio and I feel like I'm too boring to be around them and I seriously don't fit in anywhere because I don't know how to change my personality.",
        "created_utc": 1675707419,
        "upvote_ratio": 1.0
    },
    {
        "title": "My struggles in the path of self realization (Need suggestions)",
        "author": "SelfAwareALilBit",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vdmr7/my_struggles_in_the_path_of_self_realization_need/",
        "text": "Hi all,\n\nI am a 36 years old Male, married with a kid. \n\nTill last year I have been living a life which had gotten stagnent. I was doing okay career wise, and felt that I was happy with my personal life however I often found myself shouting and getting angry for small things.\n\nWe all have issues in our personal lives that bother us to an extent, but I choose to get angry and annoyed about it instead of working on the solutions. I put on a lot of weight, drinking more than I should and not really working on any ambitious goals.\n\nOver the last year or so, I have had a spiritual awakening. I feel connected to some kind of divinity through which I started having realisations about myself.\n\nI asked myself, \"why do I feel unhappy? Why do I get angry? Why am I always in bad mood?\". My life after all didn't seem so bad from a distance. I had a nice family and decent material success. Yet, I felt angry.\n\nI started working on changing myself. Keeping a tab on my behaviour and trying to correct it if and when I felt I needed course correction. I changed my lifestyle gradually, lost quite a bit of weight, changed my way of working and interacting with people. My career has seen a nice jump and I feel much happier and more self aware. \n\nI feel connected to the 18-20 years old myself who was perhaps a lot more grounded than I am at this state. My sense of fashion has changed drastically. I feel younger and feel a lot more energetic. So things have been going well so far.\n\nHowever, this journey hasn't been all that comfortable either. I have had several moments of realisation where I got face to face with my own actions, my own patterns and behaviours which has harmed others. These moments have been extremely difficult to face. \n\nI feel that I am more aware, more focused and I pay attention to my surroundings a lot more which sometimes brings me anxiety. \n\nThere are times when I noticed myself falling back in patterns. However hard I may try to be strict to myself, I feel that sometimes I just fail to notice when I repeat my past mistakes.\n\nMy journey I feel is to get completely center aligned, which means getting rid of any kind of bias I have for anything or anybody and see the world as one. This includes myself as no matter how openly I learn to accept the world, I can't see it as one without my ego getting in the way.\n\nAnd this brings me to my latest self realisation episode where I realised that I am full of ego. If someone points out my mistake, I will find a reason to argue with them. I don't listen to people completely and just assume what they are trying to say. I feel I live a relatively unorganised life and often delay things till the last minute.\n\nThis has really put things in perspective for me as I feel this is a pattern which I just keep on repeating and is extremely hard to keep in check on a daily basis. \n\nI tried to see a therapist and discussed these issues however I haven't been able to find clear answers.\n\nI feel quite ambitious and positive about my future as these changes have done more good to me than harm but the journey is tiring and I don't see a clear path I need to take.\n\nI am sorry if this has gone too long. I don't know where the answers lie but I feel at this point I should start asking everywhere I can.\n\nSo please share any advice for me if you can.\n\nThanks.",
        "created_utc": 1675707210,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know what I want in life",
        "author": "Adoringpuspus",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vde1b/i_dont_know_what_i_want_in_life/",
        "text": "I am a graduating CS college student in a third world country. I’m currently a part-time/probation developer with low pay for a small tech company that I chose to intern in for my last term in university. I’ve been assigned a couple projects— but I really, really can’t find it in myself to do my task until the last few days before the deadline. Maybe it’s from the unhealthy habits I developed in college where I essentially became a crammer? Or maybe because I’m not sure if I actually want to pursue a career in my field. \n\nI’ve been applying to other companies and getting rejected in the end. Some of them do so because I haven’t even graduated yet (our univ has so many delays). Most of them don’t explain why, so im left in the dark as to what I lack and I what I need to improve. I honestly hate my job, and I’m not sure if its because of the coding, or because the work environment is essentially non-existent (its a remote/WFH work). I can’t see myself 5 years from now doing the same type of work and coding until past midnight everyday just to meet client deadlines. \n\nLately I’ve been trying my hand in video editing (mostly virtual/gaming related) and im having fun doing it, I started a YT channel last October last year and my first two videos popped off that I got into partners program within two months. Im not earning anything right now because the views plateau, and im having a bit of a burnout (from work and youtube). Even though editing is a lot of work, it’s just very satisfying to see the end product and watch people’s reactions (something I used to feel with coding before I got a corporate job). \n\nThe thing is, I know that a 9-5 will give security because it’s a constant income stream. But I don’t want to let go of content creation. I had the idea of trying both at the same time, but right now neither one is working out (my views stopped gaining even on new videos). The fact that no company is even accepting me for work is just fucking sad and hurts my self-confidence. I probably applied to about 300 by now. \n\nI tried clearing my head by going outside and working out a bit and decompress, but it doesn’t really help. I also have an unstable kneecap and a torn ACL so I can’t exactly run and do the activities that I enjoyed from back then.\n\nI currently live with my parents, but that’s because its not a big culture in my country to leave the family when you turn adult. My parents are retired, and are expecting me to help them financially in the future once I get a stable job. I have no problem with this, but the pressure they put on me can sometimes be too much. \n\nThere’s so many things going on in my life and I’m all over the place as you can see from reading this rant. I start to become overly emotional even at little things that wouldn’t bother me years ago. I start to notice how sad my life has become as I grew older. I start to notice how some of my friends celebrate and greet my other friends birthdays with more importance and enthusiasm compared to my birthday where basically no one even bothered, and the sad part is that these friends are the only friend group I have from college. \n\nMy frustrations and overthinking started to affect my relationship with my girlfriend who I’ve been dating for 5 years now. I shared everything with her, even the trainwrecks when I get very emotional. Recently, she got an opportunity to work in a five star hotel which means that she wont be available as much, which means that I truly have no one to talk to when my mind gets a little too cloudy and windy (which is all the time). \n\nEverything is a blur. I don’t know what the next steps I should take. I don’t know what I want in life. I am honestly so lost. Even writing my problems here didn’t help because I start to realize how small my problems are compared to other people, and I have the gall to complain about it. \n\nMy room is a mess. I sleep at 5AM and wake up at 1PM and in between those is work, porn addiction, little bits of workout, and then work. I’ve always wanted to be in the arts industry, I’ve always enjoyed making videos and animations since I was a kid. I want to pursue something in that ballpark but my parents wouldn’t support me because it doesn’t earn well, especially here in our country. \n\nEverything is a blur. I feel like my relationship with my girlfriend is slowly slipping away. I’m starting to hide my problems from her because I don’t want to add stress to her life. I don’t want to add stress to anyone’s life. I don’t have anyone to run to. I don’t know what to do, or what I want in life, or where do I see myself in 5 years. I honestly don’t.",
        "created_utc": 1675706664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reminder that you are not making any progress by scrolling on reddit right now.",
        "author": "actuallygoodchase",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vchb5/reminder_that_you_are_not_making_any_progress_by/",
        "text": "Stop wasting your life on this website. i assure you that you will not miss anything if you set your phone down or turn your device off for a few minutes. go do a few pushups, or do a load of dishes, or make your bed. anything is infinitely more productive and better than scrolling mindlessly on reddit.",
        "created_utc": 1675704613,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I haven't changed since starting my self improvement journey. Need help",
        "author": "ResponsibleTaro3354",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vc27l/i_feel_like_i_havent_changed_since_starting_my/",
        "text": "Hi! I am a 16 yo boy.\nI have a classmate who is literally the definition of perfection. He's Super good in academics, sports and music and has won many competitions. Inspired by him, i started my self improvement journey 3-4 months ago.\n\nThe problem is, I am not consistent and my mind diverts very easily. Some of the goals I had were - become the best in academics, pushups everyday, meditate, have a positive mindset, lower the consumption of junkfood.\nHowever, i keep forgetting about them. I am motivated to do it one day and the other day my mind just says 'maybe later' and i just follow it. I try to stay disciplined but keep failing for so long. I want to study, but after 1 hour of studying, i scroll through YouTube (honestly, I think YouTube is a big problem for me and I can't escape it cuz I also have to study from it. I don't play online games tho). But these 4 months haven't been a complete waste. For eg - i wasn't able to do even a single pushup but now I can do 15 in a row, my grades have increased but not as much as I expected it to. But the results from these 4 months are not at all satisfactory and I know I just lack discipline but i haven't figured out how to be disciplined and have a strong mindset. These are my problems. Talking about my social life, I have loving parents and great friends. I don't have a girlfriend but that bothers me the least. So my social life is not a problem. \n\nAny suggestions would be appreciated. Thank you",
        "created_utc": 1675703649,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my life is driven by an external current ?",
        "author": "Puzzleheaded_Army397",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vbu7q/i_feel_like_my_life_is_driven_by_an_external/",
        "text": "I have this feeling that my life is just driven by a current. I don’t really have anything clear and I’m a bit all over the place, just improvising day by day without really thinking. As if I’m too overwhelmed to face the reality and so I choose to let a force drive me while I avoid figuring things out. Is it relatable? How do I get out of this?",
        "created_utc": 1675703134,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Improve My Motivation and Self Worth?",
        "author": "itsdan303",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vbkp7/how_do_i_improve_my_motivation_and_self_worth/",
        "text": "Hey everyone, I am a 24 year old male from the United Kingdom, and I feel like my life hasn't changed in 5 years since leaving college. \n\nI suppose, although 2 separate things, motivation and self worth can be intrinsically linked.\nI've been in the same dead end cleaning job since I was 18. I wake up go to work at 6am and finish at 10am 5 days a week. Tbh it's quite an easy job and It is so mundane that I just listen to podcasts all shift. \nI would be inclined to say that the reason I haven't gone for a better job with more hours and more of a challenge is because for some reason my brain is happy having a shit life with nothing special going on. \n \nI am overweight and of course although I've had small periods of trying to lose weight I've not found the motivation for that either. I've never had a proper serious relationship and im still a virgin yay me. I'm not like the ugliest guy ever but obviously with my weight and low self confidence Im not very attractive 🤣\n\nI suppose my point being, I often think I'm not good enough to achieve anything with my life and I will just be happy with working an easy job and watching TV. If there is a girl I like I don't try anymore, immediately it's like well obviously they wouldn't like me you can forget that and move on. \n\nIdk any advice is helpful. I'm half thinking that I should save money more intensely and just bloody emigrate to Australia. If anything will get me out of comfortable routines and make me finally try and make something of my life it's that lol.\n\nI wouldn't say I'm depressed I'm pretty ok with having a shit life. But I suppose lack of motivation and self worth is a form of depression\n\nThanks for reading that book 😃",
        "created_utc": 1675702535,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being so anxious around women?",
        "author": "DinoLagoon",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vb7iy/how_do_i_stop_being_so_anxious_around_women/",
        "text": "Im so broken. My gym crush, whose job is to interact with people, said bye to me and made me happy. Like I'm replying it in my head and overthinking. I feel like this anxiety developed during my long-term relationship. My ex was jealous and didn't let me talk to most women. It got to the point where I had panic attacks when women complimented me. I've been getting out of my comfort zone, but I overthink too much. I get nervous at clubs because I think women will think I'm a perve if I try to dance with them, I'm so scared of being me tood. I also confuse signals a lot now, I'm oblivious to certain things and get excited when I get a simple hi/bye from someone I find attractive. I don't like most of what the manosphere movement says because I think it belittles women, but most other advice is just exposure therapy. I have no problem interacting with women I don't find attractive.",
        "created_utc": 1675701669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost in the world",
        "author": "thingburtonlive",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vb5r5/lost_in_the_world/",
        "text": "I(30f) have grown up with some trauma due to health conditions and bad choices/people in my life. I am back in school but I don’t know what I even want to do. I feel like a failure for not being anywhere close to situated as others my age. I know comparison is the thief of joy, but I have nothing to offer friends or a potential partner. I have trust issues and I don’t know where to start to heal and become someone who knows what to make of their life. This might sound disjointed but I appreciate any and all advice/help. Thank you in advance",
        "created_utc": 1675701556,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just started to take care of myself and looking to improve my ways",
        "author": "Nassimdhippone",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vayyu/i_just_started_to_take_care_of_myself_and_looking/",
        "text": "So, starting from this last summer I initiated taking care of myself, I used to have really poor hygiene, like really poor... ( you really don't want to know the details ), but that improved a lot these last months, I started taking showers more often, taking care of my hair and beard. It actually started after I met someone, I took the initiative to trim more often to look good for him but sadly this story didn't end like I would have wished, nonetheless I feel grateful that he implemented this habit on me even after quitting my life. the fact that I lost a lot of weight helped a lot, and feeling better about my new non-obese body encouraged me even further into this path; this doesn't mean that my relationship with my body has suddenly become perfect, far from it, however, we could say that there is a quite noticeable improvement in that area. in fact, even the process in itself has become a lot of fun to me. \n\n&amp;#x200B;\n\nI, on the other hand, am still not a really experienced person in that area, so I would like to ask you guys for opinions and tips on how to sharpen my ways of taking care of myself and my body ( for example what kind of products should I use on my greasy hair and skin, how can I trim my beard correctly ect ... ) honestly, any advice would be most welcome! thank you all in advance.",
        "created_utc": 1675701105,
        "upvote_ratio": 1.0
    },
    {
        "title": "I only experience anxiety around my personal relationships and display toxic behaviors. How to be better?",
        "author": "toiletboundhani00",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vavqy/i_only_experience_anxiety_around_my_personal/",
        "text": "I feel like this is a self improvement issue, because I never feel anxiety around my job, studies, or anything else like that. My head is usually clear unless it’s something involving my relationship with my partner, or my friends. This causes me to have a “tit for tat” mentality. For example, if I spent a good amount of money on a friend’s birthday gift, and they got me something that didn’t take a lot of effort or money, i automatically think “don’t put that much effort into getting them a gift again” and I’ll feel like they don’t like me as a friend as much as i like them. If one of my friend’s invite me and another close friend out for a hangout, I kind of go quiet and feel like the odd one out, and that they like that friend more or they have more in common.If I have a friend who I speak on the phone with everyday, if she doesn’t answer the phone for a few days, I feel like I didn’t something wrong and that I should pull back, even when i know it can be something simple as her being busy.\n\nThis all can be said the same for my romantic relationship. For example, my partner never initiates any dates accept for our first few dates, so now that i initiate all of them I feel like he doesn’t want to be with me or he’s pulling way, instead of just talking to him about why this is, when realistically it could be because he’s used to me doing it. If I text him and I see him active on social media before he responds, I think it’s because it’s tired of me. This will cause me to not respond to him for a few hours, as a way of pulling back. \n\nWith all these scenarios, for a second I think of what the logical explanation is to all of these cases could be(my friend not having money at the time to buy a thoughtful gift, my other friend being busy, my boyfriend simply not in the mood to respond right away), but it’s like the “what if it’s me?” thoughts cloud them out. I know this is a terrible mindset and leads to my unhealthy actions regarding my relationships, but i just don’t know how to change this. I really want to be better.\n\n\nTL;DR: I’ve become very tit for tat in my personal relationships due to some sort of relationship anxiety, and constantly think people in my life don’t truly like me. How can I change?",
        "created_utc": 1675700900,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve ran out of things to do as a 16y old",
        "author": "MagmaboyYT",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vapzh/ive_ran_out_of_things_to_do_as_a_16y_old/",
        "text": "I’m 16 and been on self improvement since I was 13. I’ve been consistently going to the gym since I was 13 and have a pretty decent physic that says it all. I’m currently on my old Reddit account I used years ago since I stopped with social media. I’ve tried almost anything. Besically I’m struggling to get money into wallet and I don’t wanna work a normal job as I still want to study. I’m really good at graphics design and currently learning python .I genuinely have no clue if it’s to early to think about this kind of stuff or what step I should take next, please help me",
        "created_utc": 1675700509,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (19F) find myself/independence in my relationship?",
        "author": "bumble-bee3",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10vadyn/how_do_i_19f_find_myselfindependence_in_my/",
        "text": "I’ve recently lost myself in my relationship. I used to be a very confident and independent person (almost to a fault). I did not need or rely on anyone. I only wanted people and saw them as an addition. I was deathly terrified of being dependent.\n\nWhile taking a break with my partner I’ve realized I’ve been depressed/unhappy with my life. I’ve enveloped myself in the relationship to not feel this sadness.I made small problems big. I became anxious and tried to control outcomes which ultimately pushed him away and not enjoy spending time with me as much. It brought a lot of negativity. \n\n I realized I don’t love school and don’t have too many friends. When I finally have energy to do something I do school work. When I think of something that might make me happier (clubs, internships, or programs that look cool) I immediately write it off because I assume I don’t have time or use school as an excuse for not doing it. I am trapping myself in the sadness. \n\nMost of all, I am sad about how disconnected I feel from myself. I used to love spending time alone and would be my own priority. Now, I don’t mind spending time alone but it’s not the same. I miss the inner confidence I had about who I am. I miss the lack of fear I had. I start therapy soon and hope that will help. \n\nHow do I get closer with myself again? How can I be independent?",
        "created_utc": 1675699723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your best cain reaction habits!",
        "author": "anon20192019",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v9q40/your_best_cain_reaction_habits/",
        "text": " \n\nWhat do i mean with chain reaction habits?\n\nIt´s desribed in the book atomic habits, when you do one habit and directly after that habit, the next one. The one habit triggers the next one. For example: Making the bed and drinking one liter water, or brushing theeth and getting your clothes ready for the next day.\n\nSome of my favourites are:\n\nWorking out-&gt; Drinking protein shake\n\nBrushing teeth -&gt; back exercises in the bathroom -&gt; meditating on the toilet fpr 5 minutes -&gt; getting clothes ready for the next day",
        "created_utc": 1675698156,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to improve myself if i can work on my body?",
        "author": "Steficha",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v9a9v/how_to_improve_myself_if_i_can_work_on_my_body/",
        "text": "Hello im 20 m and today i gave up on training because my body doesn't want to improve so my mental health is just getting worsts. Before you ask yes i trained before for around 2 years but my body doesn't want to improve. So im asking how to improve how to get better how to become more confident happy and how to get girls if i can't work on my body ?",
        "created_utc": 1675697079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep your station clean",
        "author": "thebeautifullynormal",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v97x1/keep_your_station_clean/",
        "text": "So for context there is a book called the Buddhist monk guide to cleaning.  It actually tells you when, how, and in what order to clean your house based on the monk temple chore list.  The author does say that not everyone will have to do all of these but it is a good case to do them on certain days or after certain events. The main thing I got out of it is that how you take care of your possessions is how you treat other people and yourself. \n\nIf your house is a mess or everything you have is broken it means that you don't take care of yourself and you dont have care for other people.  This is proven when you look at other people.  \n\nIt also comes from a saying my boss used to tell me when I was working in kitchens. \"The state of your station is correlated with the state of your mind\" essentially meaning, if your station is fucked up you are fucked up.  So make sure that your station is reflective of what your mind should be. \n\nSo old habits die hard.  Mondays are my days off of my part time job and used to be my day off when working in kitchens.  So I spent on my days just cleaning and sharpening my knives, Making sure my work shoes were not gross, obviously laundry, then cleaning my kitchen doing any meal prep that I needed to to. \n\nTake this into your practice.  Look at what you use everyday and clean it a bit. \n\nIf you have a keyboard that you use for school or gaming or work, if its mechanical take some canned air and spray under neath it to get all the dust out.  \n\nClear off your desk and wipe it down. \n\nKeep your room constantly clean\n\nIt will help I promise.",
        "created_utc": 1675696916,
        "upvote_ratio": 1.0
    },
    {
        "title": "always five minutes late",
        "author": "Gems_tuxedo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v908f/always_five_minutes_late/",
        "text": "Hi y'all just asking for advice because I'm always --almost-- on time for stuff, but tend to always be about five min late for my college classes and sorority meetings.  Please help &lt;3",
        "created_utc": 1675696382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody have a good experience using hallucinations to solve internal problems?",
        "author": "david69red",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v8zy7/anybody_have_a_good_experience_using/",
        "text": "I wanna give it a try but scared to have a “bad trip”",
        "created_utc": 1675696360,
        "upvote_ratio": 1.0
    },
    {
        "title": "💥 Our latest job, modern flyer designs. 💥 KEYS GRAPHICS can create yours within 1 hour. Remember, we always deliver with that final special touch! 💥𝗖𝗢𝗡𝗧𝗔𝗖𝗧 𝗨𝗦 𝗡𝗢𝗪!💥",
        "author": "keysgraphics2023",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v8mh0/our_latest_job_modern_flyer_designs_keys_graphics/",
        "text": "[removed]",
        "created_utc": 1675695450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like I'm spinning wheels with getting life together",
        "author": "tenstepshundred",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v8f68/feeling_like_im_spinning_wheels_with_getting_life/",
        "text": "Is there a good way to approach thinking through and planning getting life and yourself together? I feel like most of my time is going towards making lists and/or thinking about making lists rather than ticking things off the lists I make.",
        "created_utc": 1675694942,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get motivated",
        "author": "TheKingOfHeartsss",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v8ddx/how_to_get_motivated/",
        "text": "I've been wanting to get back into the gym, eat healthily, stop smoking and just generally work on my confidence but I have zero motivation and constantly feel drained and pressured. Is there any advice from anyone who's been through a tough spiral like this and found a way out?",
        "created_utc": 1675694817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to be better for her and myself (UK)",
        "author": "Great_Ad_6016",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v7fjw/want_to_be_better_for_her_and_myself_uk/",
        "text": "My entire life I've never really put a whole lot of effort into stuff. Got mixed up with the wrong people at school who I was too blind to see weren't really my friends, as a result I more or less flunked secondary school. I got another chance to get the grades i needed at college but the earn while you learn opportunity wasn't what I wanted so i ended up dropping out of that.\n\nI've spent the last few years quite depressed.\n\nI'm now about to turn 23, Have a decent paying job, i make enough to live fairly comfortably when i watch my arse but have been overlooked for any sort of opportunity for progression. I have some great friends whom i have known since my school days who I have reconnected with as i know they were the ones i should have been around with. Due to a lack of common sense on the matter and my ADHD, I managed to get myself into debt in the years prior which I'm over 3/4 of the way to paying off. I'm in a relationship with the girl I'm sure i want to marry and start a family with, and go to the gym 3-4 times a week.\n\nI know I'm a smart guy. I always read above average growing up and have an aptitude for learning where it interests me. I know had i fallen into the right crowd at school things would be different now.\n\nI want to learn to be a better man, not only for myself, but for the girl i see my entire life with. I want the nice car with a house where our kids can grow up safe and secure. I want a good career and the good life and to know i worked hard to get there. I just don't know where to start.",
        "created_utc": 1675692357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love yourself?",
        "author": "Obsidian_Stars",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v7ero/love_yourself/",
        "text": "How do you ‘love yourself?’ I buy myself things and do self care but it’s more than that. And I can’t quite put my finger on it, on what to do or how to get there. \n\nGetting out of a 5yr relationship where i was financially supporting my partner (who refused to work), my teenage daughter, working , and school. How do I find time to work on myself??\n\nAlso I tend to cut ppl off who hurt me, in order to protect myself. Not physically but like: they lose my trust or break my heart, and I just ghost them. Put up these huge walls and I’m alone a lot of the time. A friend mentioned I need to learn emotional maturity. What the heck is that?! Lol learn to do things a different way instead of saying: okay, whatever you say. And ghosting them. \n\nTLDR: I want to be and do better. How do you love yourself and practice emotional maturity.",
        "created_utc": 1675692299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never get your todo list done?",
        "author": "viomi_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v71th/never_get_your_todo_list_done/",
        "text": "Hey there, if you have the same issue, I have created a new Sub Reddit named (r/sharetodolist) , where you can share your checked todo list after the day and starting growing with friends :)",
        "created_utc": 1675691352,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is the cure for a young man who is jealous and envious of another man who he believes is better than him?",
        "author": "MastodonNo5370",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v70xh/what_do_you_think_is_the_cure_for_a_young_man_who/",
        "text": "Sadly, im that young man (18M). I have developed this ugly inferiority complex towards this guy. He has done nothing wrong to me or anyone. He's a nice guy but is just better than me in every aspect.\n\nCouple of reasons why he's better than me \n\nHe's good at talking with girls, I'm not.\n\nHe has a great physique. Even though I'm tall with broad shoulders, I don't have a great physique.\n\nHe's good at school. I'm not.\n\nHe is confident. I'm not.\n\nHe commands respect. I don't. \n\nHe is smart when it comes to topics unrelated to school. I'm not. \n\nHe literally has his life figured out and it's amazing. It's not like I think he got this without any hardwork or anything. The only reason he's better (or I think he's better) is because he's not lazy and I am. \n\nHow do I get rid of this ugly and disgusting feeling I have or will it just go away by improving myself and being confident? I really hate how much of a pathetic man I have become.",
        "created_utc": 1675691281,
        "upvote_ratio": 1.0
    },
    {
        "title": "High School Student- Need Help",
        "author": "WheelJust9057",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v6xgx/high_school_student_need_help/",
        "text": "I am a high school student with important exams coming up in the next few days/months. I have tried every method in the book to not get distracted by youtube/reddit and other things. Nothing seems to work. Please help. My Goal: Study 6-8 hours a day.\n\nThe Problem:\n\n* I either get distracted pretty early or I stick to being productive for almost half the day and then stop being productive later.\n* I maybe feel like I am too much of a perfectionist? Like there are few extremely productive days but there are bad days in between. Are they natural?\n\nSolutions I have tried:\n\n* I have tried dopamine detoxing three to four times so far. Each time I fail within 3 to 4 days. Each time I fail I have tried to start once again asap but it just doesn't seem to stick.\n* I thought maybe having no motivation was the problem so I tried telling my why(To get into a good college in the future) everytime I tried getting distracted. Worked for a few days then my instant gratification mind just said screw it I don't care and got me distracted.\n* I tried removing each and every distraction any place nearby but I always found a new way to get back into getting distracted. I even switched off my phone and laptop for a few hours but still at the end of the day I get distracted. \n* I have tried meditation and I have meditated for about 3000 minutes so far. It has helped me in making my study sessions more focused(Increasing quality) but these things still keep happening.\n\nAt the end is this maybe because this is my natural limit or is there some issue behind this? Please provide any suggestion for solving this issue. Thanks in advance!",
        "created_utc": 1675691001,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to help/encourage my unemployed friend?",
        "author": "HarleyKate",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v6jr2/how_to_helpencourage_my_unemployed_friend/",
        "text": "I have a friend that is turning 28 soon and is in bad shape. Her uses her as a personal caretaker and she uses them as a crutch. \nJust a very toxic dynamic overall.\n\nFor starters, my friend has always been smart and is a planner to a certain extent. She had a general guideline for what she wanted her life to look like and a time frame she wanted to meet. But when things started going left, she started to slowly withdraw socially.\n\nSince she always did well in school she felt the heavy expectation from adults in her life (parents, teachers, mentors,) to do great things and be successful. She feels like even though she did everything \"by the book\", she somehow still managed to fail and that frustrates her. \n\nHer depression has just gotten worse causing her to isolate from everyone in the past 8 years (except the family she lives with and me) and she is borderline suicidal.  The only thing keeping her from going thru with it for now is religious doubt.\n\nI think she could handle it all a little better if she had accomplished at least 2 or 3 of the goals she had in mind but to her, it's devastating that she has been unemployed since graduating from college.\n\nI know she does apply to jobs, but everything she finds either rejects her, puts someone in her family's health at risk (she lives at home), or it's too far away which is a problem b/c:\n\n1. She doesn't own a car b/c she can't afford one. And even if she could, she doesn't have a liscence b/c no one ever taught her.\n\n2. In the city she lives in, public transportation is a complete joke and not at all reliable. She can't use Uber or a Taxi b/c again, she is unemployed. Lastly, she says nothing within walking distance is hiring. (Her definition of walking distance is anything under 5 miles.)\n\n3. Her family has 1 shared car, so they can't help her get her to work . She's has no friends to help her b/c she was never good at networking or being socially outgoing and since graduating, has isolated herself because she's embareassd that she hasn't accomplished anything.\n\n4. She doesn't want to do remote work because she says she'll get easily distracted and restless. (I personally think maybe it's the depression or maybe she has undiagnosed ADD). And truthfully, I don't think she'd be able to work at home w/o any interruption anyway. \n\nI don't know what else to tell her or how to encourage her anymore. I've suggested maybe going back to school or getting into a trade program but that upsets her even more. She can't afford it and she doesn't want to add more debt to the debt she already can't pay off.\n\nI just don't want her to give up :(",
        "created_utc": 1675689917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sense of self being tied to Instagram",
        "author": "rickidontsleep",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v6b61/sense_of_self_being_tied_to_instagram/",
        "text": "I’ve been meaning to leave Instagram because of the massive need for validation which has cause me ego/esteem issues. My thought process for having social media is staying in touch so that I feel safe in the real world. I also consume content to make my mind go quiet as I deal with a lot of negative emotion. I did realize I was dealing with envy, loneliness, feeling like nobody cares and nobody reciprocating. I’d like to try being off it &amp; being irl more, as when I’m on it, There’s a need to conform and want to post since that’s what everyone is doing.",
        "created_utc": 1675689242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use ChatGPT to improve your life.",
        "author": "CoachTryumph",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v69gp/use_chatgpt_to_improve_your_life/",
        "text": "Chat GPT is a useful tool when it come to finding answers to what we should do to overcome a certain challenge in our life. \n\nI think this will be helpful for a lot of people who don't need a humans perspective on their problem but rather quick tips on actions that they can take.\n\nSo rather than wait for people to respond to you question, try asking Chat GPT and then apply its suggestions to improve your life. \n\nRemember, no one can take action for you. So regardless of where you get your tips from AI, friends, books, mentor, coach, videos etc  its all down to what are you going to do.",
        "created_utc": 1675689091,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know what to do as a 12 year old",
        "author": "Scared-Adagio-8287",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v5r0f/i_dont_know_what_to_do_as_a_12_year_old/",
        "text": "I’m currently 12 and I’ve been recently watching videos on self help and politics. Grew up with no dad, mums a smoker\n\nI just wanna go back to when I didn’t care about the sugar intake from a fucking lollipop and I wasn’t wondering which person was morally right. I wish someone could tell me what to do and I wasn’t worried about getting money so I could buy my own things. I feel like I shouldn’t know this it feels so surreal when I see what happens to kids with no dad.\n\nCan someone help please I’ll do anything to be happy again",
        "created_utc": 1675687578,
        "upvote_ratio": 1.0
    },
    {
        "title": "My life is going off the rails, help me",
        "author": "theworstpersonheree",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v4rxl/my_life_is_going_off_the_rails_help_me/",
        "text": "I’m a 19m, who is pursuing design, and I feel like I’ve fucked up. Everywhere, everything that I try to do ends up in failure.\n\nEver since coming to college, I’ve never really connected with much of my colleagues here, they seem to be way out of my league, or I’m afraid they would rather hang out with someone better than me. \n\nApart from my social life, I also don’t have a relationship too, which I still can’t bring myself to try because I feel like I’ll fuck up again, like everything else I have done.\n\nMy parents are getting a divorce, and my dad, despite agreeing to pay for my college, abruptly stopped paying because he wants to focus on his divorce more than my fucking life.\n\nThe final nail in the coffin was when I got my report card for the first semester, and I ended up fucking that up too. I’m truly lost.\nPeople around me say that my sketching and all is good, but I don’t know, if I can’t even do good in my grades, what’s the point now? I don’t even have anything to be proud of in my life.\n\nI frequently think of self harming myself, by either starving myself or cutting myself, but I can’t even bring myself to do it.\n\nI just want to be happy mahn, what am I doing wrong in my life? Why is it that every time I try to do something good with my life, I’m punished?\n\nHow do I get my life back in track, even idfk. Pretty sure nobody will, but if you’ve read this far, thanks.",
        "created_utc": 1675684532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting out of the comfort zone",
        "author": "LEGO-NEMO",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v4e1q/getting_out_of_the_comfort_zone/",
        "text": "This is my first post on reddit ever, im from the Netherlands so sorry for my bad english. \n\ni’am getting out of my comfort zone recently and im really hating the feeling stuff gives me when i get out of the comfort zone. Getting out of the comfort zone is offcourse not a good feeling otherwise it would be comfort. So my question is how do you approach getting out of the comfort zone and how has it worked for you in any way.",
        "created_utc": 1675683140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: What goals would you like to achieve using self improvement?",
        "author": "I__KD__I",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v3g2q/q_what_goals_would_you_like_to_achieve_using_self/",
        "text": "As the title says.... What are you trying to achieve? Where do you want to be 5 years from now? How realistic are these goals of yours?",
        "created_utc": 1675679629,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do if I am addicted to female attention?",
        "author": "AdDry7951",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v2ec1/what_should_i_do_if_i_am_addicted_to_female/",
        "text": "I am 28/M, I had a longterm relationship which last for 8 years, and ended 10 month ago. I am over the girl, the breakup was mutual, however, its after effects ruin my mental health. I dated a lot, but only liked a few girls. The problem is if I am attracted to someone, and I get attention from her, I feel vulnerable, and ruin the dating with this.\n\nAlso, I realized I don't look for relationship with someone else yet (I am not ready), but I don't look for sex either specifically, I don't know why, I just seek attention, like having someone who cares about how was my day and stuff.\n\nOBviously it cannot work, but I feel really depressed, because obviously 8 years of relationship made me used to that there is a girl who is interested in me and cares about me 24hours a day. And now I get nothing, or if I get, then I  become too attached, and ruin the dating in early stages.\n\nI was thinking maybe I should not date at all, but that is not a solution because alone I feel the same. Also I am seeing a therapist, I am just interested if someone ever felt similar. Maybe time will help I don't know. What I know that nothing can replace female attention for me. I get attention from family, and friends but it is not the same. I feel I depend on that a girl I like cares about me. And if she leaves me after this I feel heartbroken, even if we dated a few times only.\n\nThese girls feel that I am craving for attention, and not relationship, or just a hookup, and they are confused. But for me this feels natural, I don't know how to overcome this behaviour.",
        "created_utc": 1675675342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just felt the need to get this out there.",
        "author": "diddywayne8765",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v1q3e/just_felt_the_need_to_get_this_out_there/",
        "text": "(I’m pretty new to Reddit and this is my very first post so bare with me. 24yr old male)\n\nIn December of 22 I found out my gf cheated on me. Long story short I packed my shit and moved 8 hours away. Don’t know anyone here besides coworkers so I figured it’d be a great new start. \n\nI’m taking this opportunity to truly better myself and my life. I’m not a loser by no means, I have a good job, goals, workout, diet, all of that jazz. But I’ve never felt fulfilled. There’s always been a few things in my life that I couldn’t manage to shake off. \n\nSo this drastic life change has blessed me the opportunity to work on some of those thorns in my ass. Here recently my faith in Christianity and p*rn consumption. \n\nYesterday something very interesting happened. I’ve been cutting a lot out of my life and I felt the need to stop fap. For good this time or at least be able to control my own body and urges. For once in my life I was content in my mind and soul about all these changes in my life. Then I had the most lucid dreams I could recall last night. The one that stuck out the most was literally killing my old self. I watched as this black mass left my body and formed into a mirror of myself. No words were spoken. I grabbed a spear of all things, and began to kill this demon. I stuck the spear into my old heart over and over again screaming at this thing I hated. And as I was killing it my own body began to emit this light. Finally this thing was wounded enough that it transformed into its true self, a demon of some sort or whatever, and just limped away. \n\nI know this sounds corny af so if you’ve made it this far I appreciate it. I feel like a whole new man today and for once in a very long time I look forward to my future. I’ll continue to fight these challenges in my life and I take pride in that. If you’re going through something I’m rooting for you bud. You’re not alone and your life is worth fighting for. Serve Jesus Christ and you’ll find meaning in your life.",
        "created_utc": 1675672639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleeping early!",
        "author": "thenameismonkey",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v0w2k/sleeping_early/",
        "text": "Hey everyone, I’ve noticed I’m extremely productive when I wake up early after a good night of sleep (8 hours for me). But at the same time I become really energetic at night, like literally bouncing around and dancing to music its crazy. How do I consistently sleep earlier?\n\nThanks",
        "created_utc": 1675669310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing hope",
        "author": "9gingercringer7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10v07p1/losing_hope/",
        "text": "Hi all, I'm (f26) have never struggled this much in my life. Last September, I moved to a new country (within Europe) in order to continue my studies through a masters degree at with a full scholarship at a great university. I have to admit, I have always battled with myself, but I always managed to excell in school and work and I thought this would be no different. Before Christmas, I was having a challenging time, working long hours for my research and then spending the rest of the day studying and being productive. By the time it was time to go home for the holidays, I felt like i had nothing left in me, I was burnt out. But I thought being home with my family, friends and my (now long distance) boyfriend would re-energise me. Instead, as soon as i returned, I immediately spiralled into a depressive episode like I have never experienced before in my life. Since then, I have taken acedemic leave and my boyfriend came, to help get me back on my feet. I was feeling a little better, and slowly became more productive, but I overall, I can't shake it. I've seen my gp and I've been put on medications that just make me more sleepy. I'm on a waiting list to recieve therapy.\nI don't know what to do and how to pull myself out of this in time to complete exams and deadlines for my degree. I don't want to extend the time living here to complete it because I don't want to be away from my boyfriend, although he is changing jobs so that he can be here more. I want to feel like myself again, but I feel as though I woke up one morning in a dire state, when I was otherwise happy, and never got out of it. I'm also having suicidal thoughts, not in the way where I'm actually wanting to do it, but it just comes into my mind.\nI don't know if this is the right place for advice, but has anyone has a similar experience of a sudden depressive episode that just won't go away and how can I possibly fix this situation?",
        "created_utc": 1675666697,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean to accept yourself even though there's parts you don't like?",
        "author": "InternetSandman",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uzpt1/what_does_it_mean_to_accept_yourself_even_though/",
        "text": "been discussing this concept for the past couple days and still having trouble wrapping my mind about it. I have parts of myself that I don't like and that are causing problems in my relationships, but I'm being told to just accept them. To me, it sounds like I'm being told to accept that I'm crap and that I'll never change and that somehow that's ok, as if that's a good thing. It makes no sense. The more problems these aspects cause, the more I want to just replace my brain with one that is capable of empathy, that has no ego, and then burn the old one in a fire. How can I learn to understand this concept that seems so paradoxical and painful?",
        "created_utc": 1675664883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished my first kettlebell exercise!",
        "author": "IndicationForward336",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uyms7/just_finished_my_first_kettlebell_exercise/",
        "text": "(My phone died while originally typing, so I also attempted a 5 minute good night yoga while my phone was charging!)\n\nI wanted to do something, but I couldn't decide on anything but then my mom send me a link to an exercise thing. It was on Instagram so I didn't use it but it reminded me that I could just work out when bored! So I found a this video instead. (See below)\n\n\"15 minute beginner body kettlebell (vocal instructions) // no repeat // low impact\" by workout with Roxanne.\n\nI loved it! My arms are noodles i love it! Thankfully I'm not doing anything Big tomorrow, so it's worth it!! \n\nMy squats and push-ups need a lot of work. I didn't want to pause the video (lost the remote) so I only did one successful push-up. I had to make some adjustments too because I didn't trust my mom's old kettlebells and my sweaty hands to work well together. So, I did normal push-ups and planks. I think plank only lasted around 7-10 ish seconds. I wanna start keeping track of how long I can hold a plank and how many push-ups I can do. I used to take mma as a kid so I was okay ish at planks but I've always struggled with push-ups. I hope I can eventually get to a 30-second plank again and 10 push-ups then work my way up more. I went pretty slow with the pullovers because I didn't want my mom's kettle bell to smash my skull open. I'm happy I did this and I want to do it more now that I've just started my second semester of school (less work!) And I have an end of day spare! \n\nI don't have a gym membership yet, but I will probably by next weekend! So using the at home stuff is great! I've only used the 2 and 5 pound weights before, so I thought the 10 pound one would be okay. however, my mom's kettle bells are a bit worn down, so I accidentally used the 15-pound one! The soreness is kicking in now! I don't regret it though!\n\nThis felt like a massive kick! My head feels better too! I tend to overthink a lot! If I have external stuff freaking me out my brain just freaks itself out. Today I submitted a cute silly intro slide for a class that wasn't even marked! After I hit send I immediately felt embarrassed about the things u send in and started spiraling. Like \"omg I put that I want to make alcoholic drinks (beers, ciders, wines) but never brought up my interest in the process or botulism! WHAT IF THEY THINK IM A LAZY PARTY ANIMAL AND I ALWAYS ZONE OUT BECAUSE IM HIGH OR DRUNK!?\" Or \"WHY DIDN'T I TAKE ABOUT MY FUTURE JOB MORE!? WHY DID I JUST GO INTO WHAT I WANTED WHEN I WAS YOUNGER, THE COLLEGE I APPLIED TO AND WHY, AND THAT I GOT ACCEPTED? I SHOULD HAVE PUT MORE INSTEAD I PUT A SILLY BUCKETLIST OF THING I WANNA DO BEFORE IM 30! IM IN A UNIVERSITY CLASS, BUT IM GOING TO COLLEGE WHAT IF THINK I WONT TAKE PROJECTS SERIOUSLY MOST OF MY CLASS IS IN STEAM!! THEY WON'T WORK WITH ME!\" or even \"Okay, i know, im a bit off, but maybe I came on to be strong with the slide I did! WHAT IF THEY KNOW THAT I THINK IM AUTISTIC AND HAVE ADHD (whole other can of worms) AND THEN THEY TELL THE TEACHER AND I GET IN TROUBLE BECAUSE I DIDN'T PUT IT ON THE TEACHERS GETTING TO KNOW YOU QUIZ BECAUSE I HAVEN'T BEEN SCREENED YET!!!! AAAHH\" \n\nthe kettlebell thing really calmed me down! I was able to put a postive twist on things! My bucket list had stuff like getting a park card and trying caving so that probably shows I'll be down for labs. Plus It's a bio class so the whole canning and alcohol thing is probably cool to at least 1 other person! One other girl probably wants to be a biologist, so mentioning my childhood dreams of being one is a good way to connect! I know at least one girl has a fish tank so having a jellyfish or shrimp tank before I turn 30 is a good conversation topic! \n\nI've only ever really done cardio because I didn't understand the importance of weightlifting or know where my weights were before! This has made me realize that working out can still be fun for me! I haven't had this much fun with it since grade 9 mandatory gym! \n\nNow I'm looking forward to doing it more often! Any tips, stories, or tutorials for using kettlebells would be greatly appreciated! I'm even more excited for weight lifting at the gym now and now I understand that I have no excuses &gt;:) !!",
        "created_utc": 1675661227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I continue?",
        "author": "Numerous-0101",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uyjo7/should_i_continue/",
        "text": " \n\nBasically, I had a meeting with my SA where he was always talking about \"we want you to grow in our company\", \"you have potential\" etc.\n\nI'm in that company (Web Development / Design agency) for over 2+ years, there is nothing special, no team building, no paid vacations, and no talking about private lives except work. Ok that is ok for me, I like that separation of private / work life, but I'm afraid that I will never grow (in web dev career) up and will stay at the same level as they need, simply BCS when I came to the company guys with over 5+ years of experience in THAT company are today after 2yrs at the same level and doing similar kind of work as I (not to complex).\n\nSo, can someone tell me what should I ask myself before making a final decision, what to ask the boss / SA, or what should I pay attention to in order to understand if I will grow or not?\n\nThis really means a lot to me, I'm almost 31 and need to make the right decisions, no more space left for failed ones :D\n\nThanks in advance !!",
        "created_utc": 1675660935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get some inspiration from night shift workers",
        "author": "MrsPuffSmashedMyFoot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uyeht/can_i_get_some_inspiration_from_night_shift/",
        "text": "I know all the things that I should be doing, but a lot of them feel inhibited by my work schedule. I’d love to quit caffeine, and I did when I worked 7-3, but getting through 11-7 feels impossible without it. \n\nAs far as phone usage, not a whole lot goes on in the middle of the night, and for some reason nothing is said if I’m on my phone, but a book would be an issue.\n\nI would just like to hear some ideas of how night shift workers have managed.",
        "created_utc": 1675660459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some thoughts on myself",
        "author": "ADHockey24",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uy9v9/some_thoughts_on_myself/",
        "text": "I (m19) am a sophomore more in college and I am really in need of developing new habits and building a much better lifestyle for myself. I have terrible grades (barley allowed back this semester) I drink, smoke and do other things that I know I shouldn’t be. I use these things to keep relationships with friends and build new ones as I am not the most outgoing person so these are easy ways to relate with people (I don’t really enjoy doing any of these things). I am 6 foot 3 and weigh about 150 lbs so I am underweight especially for someone who grew up playing sports and being athletic. I want to change and get rid of these bad things that I do but am worried I will lose the few friends I have because of that. Most of the things we do revolves around drinking or smoking when we hang out.\n\nThank you in advance for any tips or comments!",
        "created_utc": 1675660031,
        "upvote_ratio": 1.0
    },
    {
        "title": "I suck at everything I try. How do I fix this?",
        "author": "peachirings",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uxdgc/i_suck_at_everything_i_try_how_do_i_fix_this/",
        "text": "I’ve noticed throughout my entire life I have been bad at everything I have ever tried. I’ve always been bad at every school subject thrown at me— math makes no sense to me, even more so science, history is too complicated, I suck at writing essays in english, and I’ve never gotten less than a 10 minute mile in P.E. That’s just school though, there’s more. I did gymnastics when I was a toddler for a few years, never went up a level. I quit dance after doing it for a few months when I was around the same age. I was also always put in the back in that sport too. Not a very known sport, but I did competitive all star cheer when I was around 8-10 years old. I was always called sloppy, not flexible enough— I was always put in the back. I picked up surfing when I was 11, made no progress at all despite doing it multiple times a week with my dad who is a pretty good teacher. I quit a couple years after. I picked up skating for a few months, made absolutely no progress. I could only push correctly and do stationary ollies and shuv its lol. 2 years ago I picked up guitar— I progressed at first, now I just suck. I can’t even write my own music I’m that bad. Mind you I’m doing lessons for it with extremely skilled teachers. I’ve seen self-taught guitarists who have been playing for less time than I have who are way better than me. So, you get the point. I’ve always been bad at everything, despite if I had guidance or not.  I know i’m just venting right now but I do want some actual advice on how I can actually start improving on stuff. Help, please, I’m genuinely so desperate lmfao.",
        "created_utc": 1675657167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I washed my sheets today.",
        "author": "Bigbuckrocks",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uww7m/i_washed_my_sheets_today/",
        "text": "Before tonight I would just kinda sleep in the same sheets without doing any maintenance on them. Idk how I did it. They would get cleaned once a month by my cleaner who comes to my apartment once a month, or at least she did until November. In December she was in a car accident and has been in physical therapy for quite a while since the last time we spoke. I decided to take matters into my own hands and finally put my sheets in the washer today. I am sitting in them now, and I’m looking forward to sleeping in clean sheets tonight. Who knows, maybe next I’ll do my inner shower curtain.",
        "created_utc": 1675655697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depression on SR",
        "author": "Maximum-Sound-8498",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uwses/depression_on_sr/",
        "text": "Has anyone else felt depressed 2 weeks in SR?",
        "created_utc": 1675655367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay Attention To Your Attention Span",
        "author": "ForteMethod",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uwphd/pay_attention_to_your_attention_span/",
        "text": "Posting a comment I made earlier for visibility, thought It would help people out with this topic!\n\nA few years ago, I realized my attention span was non existent. I was the SQUIRREL meme, metaphorically speaking. For me, the culprit was the smartphone. All of the alerts, notifications, pings, social media sites, tetxting... I allowed all of those things to destroy my brain.\n\nThe brain is truly like a muscle, and just like the rest of our muscles, you will lose strength without use. My day to day actions did not provide me with enough intellectual stimulation to even sustain the intellect I did have at the time. Thus, the slow decline began.\n\nIn order to reclaim my ability to concentrate, **I decided to learn to love things that are good for my body, and cut back on the things that aren't as stimulating.**\n\nThe obvious thing to do here is to cut back on your phone usage. We should not be on these things for hours out of the day. **Yes, even texting/messaging is an issue.**\n\nThe most game changing act without a shadow of a doubt was adding reading back into my life. It didn’t matter if the text was a book, a long post, or a newspaper article. I would read the content in its entirety and keep my mind on that specific subject and **nothing else**.\n\nIf that sounds easy to you, please give it a try. If you're anything like me, it was an impossible task for quite some time. My mind would get bored before finishing the first paragraph and I wanted to jump to something else or begin thinking of something else. It needed stimulation, it was almost as if this was an addiction and I was going through withdrawal.\n\nAnd that’s the problem. **We’re hooked on the little dopamine hits that our devices give us.**\n\nPick an activity to focus on. Examples:\n\n* A game like chess or something simpler like checkers\n* Reading a bookPlaying an instrument\n* Playing a sport\n* Intentionally listening to someone give a speech without letting your mind wander\n\nGive it your full attention and remain mindful.\n\nWhen I say “remain mindful” that means let the witnessing aspect of your mind become aware of your thoughts. It’s similar to a light meditation. Whenever your mind wanders off, let the witnessing mind gently bring the focus back to the task at hand. Keep track of how often this happens, that way you will know when you are truly progressing.\n\nI'd be willing to bet in the very near future, documentaries will be made on all of the collateral affects of our noisy, dopamine filled world. This will be a tough journey, but it gets easier and it’s worth the effort.\n\n**- Forte Method**",
        "created_utc": 1675655109,
        "upvote_ratio": 1.0
    },
    {
        "title": "routine help",
        "author": "DropDeadDreamer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uwjxs/routine_help/",
        "text": "is anyone able to share a daily routine that helped them get their lives together? going through a depression and really trying to get my shit together once and for all.",
        "created_utc": 1675654640,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I become more memorable?",
        "author": "tableaux1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uw2ng/how_do_i_become_more_memorable/",
        "text": "So I'm in HS, and I'm in this \"debate\" club of sorts. I joined because I thought it would look good for college, and two of my friends did, so I was like, \"Let's give it a try!\" It's been a couple of months since I joined, and the three of us have become known as a group within the club. Everyone there is super nice and friendly, but usually when they talk to us, it's \"friend 1's name, friend 2's name, and oh, I forgot your name (me).\" Both of my friends talk more than me, and I genuinely want to try to start talking more and becoming more memorable. I have been trying, and it's kind of been working (not a lot, and I know it'll take time, but I wanna do the most I can, and I'm not sure how else to go about it). I'm not exactly afraid of talking or of the people; I just don't really know what to say. I also want to be liked and popular enough amongst the members that eventually I may get voted to be one of the \"board members\" (they're like 6 members who run the club and do that kind of stuff). I'm not exactly sure if this is a good explanation of it, but I want to become someone everyone knows, someone who wins awards, and just someone who's overall fun.",
        "created_utc": 1675653231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing at 45 ...",
        "author": "ELPadrin277",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uw2al/changing_at_45/",
        "text": "I'm 45 and not happy. I do have a decent job, single , 6ft 272lbs. I've deleted Facebook as I was doing the most of communication, that was my sign that I was expendable.  My goals going forward : 1) Get back in shape. 2) Stay on the wagon, no alcohol. 3) Read more 4) Concentrate on work 5) Save money... So on and so on. I turn 46 on Wednesday, I need to know that I can change for the better , yeah I'm late but I want to die knowing I tried. I no longer want fake relationships, stay overweight and basically be at a standstill in life... NO MORE!!!",
        "created_utc": 1675653201,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I not spend all day studying?",
        "author": "coleman33112",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uw21f/how_do_i_not_spend_all_day_studying/",
        "text": " My life at uni has just been me only thinking about school for the entire day every day and spending entire days procrastinating and studying which makes me stay in front of my computer for long periods of time with no life.\n\nNow you'll say well just study fully focused studying for 3-4 hours and you're done for the day.\n\nMy issues with that are:\n\n1. I probably have adhd so its really common for me to have my head in the clouds and spend a long time trying to understand things and stay focused\n2. Even if I miraculously studied decently, at the end of the 3-4 hours (or whatever amount of time i should study per day), i would probably not be done with my work so I would be unsatisfied with myself for the rest of the day and just think of doing the work, but I would not be at my peak efficiency since i already studied for 4 hours. Should I just go on with my day clear minded knowing that Ill work on it more the next day or should I just keep working for the rest of the day?\n3. I dont know when's the right time for me study (im guessing its the morning) and how to study correctly.\n\nIf possible, an advice for each point would be really appreciated\n\nIf not, just general advice with your personal experience would be perfect",
        "created_utc": 1675653180,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be a more outgoing person and to naturally find my people?",
        "author": "cuddlyandawkward",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uvz6p/how_to_be_a_more_outgoing_person_and_to_naturally/",
        "text": "I [F23] personally feel like I haven't met anyone to connect with or that speaks to me on a deep level. I haven't found my people. I've tried online dates (been on three of them) so far and was left a bit disappointed that I didn't get in the same vibe as the people. I'm a super introvert and I want to get out more since I have no friends or partner.\n\nI want to start trying out some hobbies to socialize, but I'm not sure where to start to meet new people that aren't already established in a group or clique? It's very easy for me to talk one on one with someone vs in a big group.",
        "created_utc": 1675652955,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to know someone talked behind your back?",
        "author": "Magnanimity420",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uv763/how_to_know_someone_talked_behind_your_back/",
        "text": "I would be around some people and everything would be going good. But then whenever i would have plans with others my connections with the first group gets messed up. I would walk in the room and will feel some sort of cold shoulder from them and my roommate whom i don't have good connections with would be there. How to know he talked behind my back?",
        "created_utc": 1675650710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inspiration for changing up my life?",
        "author": "foodscrapsonly",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uv530/inspiration_for_changing_up_my_life/",
        "text": "Moving/Jump Starting New Life, need inspo!\n\nHi! Here’s my situation:\n\nLive in a medium sized town with one of the highest costs of living in California (prolly the whole US). We (myself, bf, dog, cat) were grandfathered into an affordable place, but the landlord is evicting us and wants to make the place an AirBnB. So, if we move to a new place in town our costs are going to skyrocket, and I just don’t imagine a long term future in this city. So we’ve decided to move back to my home town, a small mountain town, with my parents. My job isn’t remote so I will be quitting and starting fresh. I’m pretty sad to lose my job, it’s a GREAT job and I love it, but ultimately I’m more excited for new opportunities and feel like I need significant change in my life. Plus I think I have an unhealthy relationship with my work so this might be good for my mental health too. I’ll be applying for new jobs and already have two interviews lined up next week. \n\nI’m creative so I hope my new adventure lets me be more creative than I am in my current role. \n\nANYWAY (: \n\nI’m pretty excited to take this life changing step and want to make the most of it. I don’t want to take anymore than 3 months off work, but I want to do things to grow and gain skills. I need inspiration for new journeys! Here are some of my ideas:\n\n- I love doing nails and I kinda want to try my hand at beauty school and maybe start a new career as a nail tech. Thought about doing manicurist school part time. \n\n- I have always kinda wanted to get a masters degree in communication. Thinking about doing night school online, but it’s a pretty big commitment and $30k just for something I “kinda” want. \n\n- I think getting my yoga teacher training would be so dope!!\n\nMy question is, any other cool certifications, classes, skills, experience that might be fun to try my hand at in this transitional time? \n\nTraveling/van life/hiking the PCT would be AWESOME but my partner can’t take time off atm. Maybe next year!\n\nThank you in advance! This is cross posted.",
        "created_utc": 1675650555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting into fresh clean sheets after having an ice cold shower is the best feeling ever",
        "author": "punoq",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10utxfy/getting_into_fresh_clean_sheets_after_having_an/",
        "text": "Posting this so I remember how good natural dopamine feels!",
        "created_utc": 1675647185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiencing extreme physical and mental fatigue",
        "author": "Interesting-Talk-377",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10utoqt/experiencing_extreme_physical_and_mental_fatigue/",
        "text": "I feel like I barely have a life anymore. All my life I’ve been a very goal oriented, motivated, and inspired person. I was very strong and fit, did gymnastics and swimming and even competed from time to time. In high school and the year after I was always able to exercise consistently and went through numerous phases of exercises from running 4-7 miles a day, to dance classes, to weight lifting, to power yoga (I could walk on my hands for a minute and do tons of arm balances). I also surfed, wakeboarded, and snowboarded very often. When I was 19, I herniated a disc in my back while I was doing a dead lift and in a split second my entire life changed. I fell on the floor and could barely walk for 3 months. The pain was so bad like a lightning bolt through my whole body that would send me to the ground if I was walking without the help of my parents. I couldn’t work, couldn’t drive, and couldn’t get dressed/or shower by myself during this time. I recovered over the next few months thanks to physical therapy and I continue to do 30-45 minutes of physical therapy exercises every day (When I slack off for a day or two my pain comes back so I pretty much have to stay consistent with my exercises). I have gotten back to a normal life, but not the active and vibrant life I had. While I am limited by physical pain, I’m extremely limited by intense fatigue. In comparison to other people like my 50 year old parents (I’m 21), I have nowhere near as much mental or physical energy as them. I can only work 2-3 hours a day before my brain turns to mush and stops functioning unless I rest for a few hours. If I try to keep up with other people physically, like walking around a mall or cool town for the day I feel like I’ve been hit by a bus at the end of the day while they are fine. I’ve tried slowly increasing my exercise level but anything 10 minutes more than what I do makes me feel like I’ve been hit by a bus. I swear I’m not exaggerating. I’ve been to doctors and even convinced one of them I have ADHD but I don’t and ended up taking aderral for a few weeks which drastically improved my life. I finally had energy. But I know I don’t really have ADHD since none of these symptoms were present prior to my injury so I stopped the medication. I’ve had blood tests that all came back fine. I also went to the hospital 2x for heart palpitations, but my EKG’s came back normal. I have no idea what’s wrong. I barely do anything all day and I can’t accomplish my goals or go out with friends anymore. Any one else experience this/have any suggestions?",
        "created_utc": 1675646535,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally found someone I genuinely like after a long time, but the feelings are not reciprocal.",
        "author": "electricalfox01",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10utlhz/i_finally_found_someone_i_genuinely_like_after_a/",
        "text": " It hurts a lot.",
        "created_utc": 1675646298,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I work on first?",
        "author": "throwaway01361847",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uth1m/what_should_i_work_on_first/",
        "text": "I am failing in almost all aspects of life. Socially, financially,, academically and physically. Basically I am overweight have no friends money and am failing school at 15.\n\nPeople have said they rate me as a fun and good person to be around but the only people I hang out with just use me for stuff and I don't understand how to have actual friends that want to hang out with me. Only times I go out is when people want to use my escooter or use me for weed/tobacco or just to get me to do stuff for their entertainment \n\nI am overweight and have little to no muscle as I broke my collarbone and quit all sports and was in bed for ages as I recovered and after it healed I didn't go out much so it's left me a bit insecure and stuff.\n\nI also have no money and am only good at maths and computing in school.\n\n I have a bad mental state as I don't go out much and all this social media and mindless scrolling, consuming negative media and playing games isn't helping at all. And I always feel anxious for the future as I don't see myself anywhere good. I also feel bad getting left out of everything and I see and hear about everyone else having fun obviously without me.\n\nI don't and never had any girlfriend but I have  accepted I never will get one because I am just naturally unattractive\n\nI am also addicted to nicotine.\n\nI understand now that the only way I can improve is by helping myself, no one can help me but me and no one cares about me but me so what should I start on improving first?\nI can't do all at a time because I'm not mentally strong enough and will feel too overwhelmed. \nIt has also come to my understanding that this cannot be achieved by pure motivation alone as that will eventually die out and I need to discipline myself, so any tips on that too?",
        "created_utc": 1675645966,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would like to change my attitude toward organizing and consistency",
        "author": "Sensitive-Ad-7503",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10utfwu/i_would_like_to_change_my_attitude_toward/",
        "text": "Hi everyone,  I'm a 23 yo girl currently a student in university.  Since alway that I can rember I have found difficult to organize and stick to the plans I had made. Even If I know not doing a certain thing will have bad consequences, I'll not do it if I have even a little bit of stress about it. Like, I will not start cleaning my bedroom if I don't know that I'll have the time to make it perfectly tidy. Or I will not start studying if I know I'll not be able to feel that I did it perfectly. This way of thinking with everything. I'll not do the thing, even if I originally planned to do it, but at the same time I'll not do anything else, just plain nothing. Then maybe have a rush of guilt tripping, organize the best perfect (too much) plan for tomorrow, and then tomorrow re do the dame pattern....\nI seriously dont know how to escape this pattern...\nAnyone out there with a similar problem willing to share some tips?",
        "created_utc": 1675645881,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to start changing yourself",
        "author": "inneedofdiscussion",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10utdnh/how_to_start_changing_yourself/",
        "text": "Hi. I (26F) started therapy around 2 months ago but I feel like I struggle to start new/better behaviour patterns. My problem is that I am hard to please, I usually have a set idea of something in my head and if people or situations don’t satisfy my plans that I develop in my head, I get uncomfortable, upset, bitchy and aggressive. I’m often mean to people around me, and if at work people mostly just ignore it, at home it becomes a problem. I don’t like that trait and I am ready to get rid of it and be a better kinder and happier person, but I struggle to actually start changing my behaviour. In a moment it’s so hard to remember to be kinder, and even if I remember, it’s still hard for me to actually change patterns. Sometimes it feels like this personality is so deep in my core that there’s no way to break it. If you had similar situation, how did you start changing your behavioural patterns? How to stop being a mean bitch? Thank you",
        "created_utc": 1675645717,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of mindset is common to every successful person?",
        "author": "TrueMoneyMakerYT",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10usw1f/what_kind_of_mindset_is_common_to_every/",
        "text": "Successful people all have one thing in common: **a growth mindset**. This means they believe in developing their abilities and intelligence through hard work and dedication, and view challenges as **opportunities to grow**. They are positive, resilient, focused, determined, adaptable, self-disciplined, grateful, and always seeking to learn and improve.\n\nAs the famous saying goes, *\"Success is not final, failure is not fatal: it's the courage to continue that counts.\"* This perfectly embodies the growth mindset of **successful people**. They understand that **success is a journey, not a destination**, and that it takes perseverance, hard work, and an unrelenting drive to achieve their goals.\n\nIn short, successful people are **not afraid to fall**, because they know that **every fall is an opportunity** to stand up taller. The takeaway? Embrace a growth mindset, stay positive, and never stop striving for success - you'll be amazed at what you can achieve!💪 ",
        "created_utc": 1675644446,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find out what you like to do? Wasted my twenties sitting around moping.",
        "author": "Enough_Indication663",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uso8j/how_do_you_find_out_what_you_like_to_do_wasted_my/",
        "text": "TL/DR: I have no idea what I like/dislike, but am trying to pick up some hobbies.\n\nI (29M) don’t know how such a simple question can be so difficult to answer but I have absolutely no idea what I like to do. My days sink into an endless stream of repetitive tasks: wake up, go to my 9-5 job, do a couple odd jobs here and there, buy dinner, watch TV and/or porn, and go to bed. I also do some volunteering on the weekend.\n\nI wasted my twenties sitting around doing nothing. Now that I am about to turn 30, I feel like a lot of the opportunities to hang out/meet people/make friends have wrapped up. Friends from high school and college are settling into their careers and getting married. I feel like I am significantly behind in terms of social development. Yes, there are plenty of other people out there in the wide world who also fucked up and are still developmentally “recent college grads” without a lot of money or personal and professional success.\n\nIt's not a great situation to be in and I've tried to identify ways to improve my life - e.g. applying to grad school to improve job prospects. I also need to work on myself outside of work. I am currently drifting through life without any hobbies, meaningful connections, or ways to express myself. I want to pick up some hobbies or find enjoyable ways to fill my time but I have no idea what to do. A lot of hobbies seem to require spending significant time and money before being able to determine whether you like it. I have no idea what my interests are or how I would describe myself to new people. It’s like I have no clue who I am and I am now trying to find myself really late in life.\n\nOne thing I have identified is a desire to be productive, rather than passively consume products - e.g. no watching TV or reading books all day. I also want an activity that allows me to be social and meet people.\n\nSidenote: I am a development director at a nonprofit. Please do not suggest that if I just *volunteered* or *gave back to my community*, I would be able to feel something or have some purpose. Nonprofits guilt you into working yourself to the point of compassion fatigue. I want to do something that is meaningful *to me*, not about how I have to save the world.\n\nAnyways, has anyone else ever known or been unable to articulate their likes/dislikes? How did you go about finding out what you enjoyed or developed hobbies or a community? I think it is important for my personal development to have meaningful activities to spend time outside of work, rather than crashing at home and going to sleep all of the time.\n\nAny help would be appreciated!",
        "created_utc": 1675643874,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I (24m) learn to overcome my anxiety?",
        "author": "backendchodster",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10usm2b/how_can_i_24m_learn_to_overcome_my_anxiety/",
        "text": "So as we all know, 2020 was probably one of the worst years for everyone. But for me, it wasn’t too bad I think. \n\nIn the end of 2019 my ex broke up with me so I decided that I’ll just live my life, I was just getting high and stuff throughout the whole 2020. I continued getting high, beating my meat and chilling in 2021 also. \n\nStarting of 2022 I started thinking that I need to get a grip on my life because I basically wasted the past 2 years doing stupid shit. I also realized I think around this time is when my anxiety started getting worse… I started caring about every action I took in public. I never cared about my actions in front of my family, like I never held myself back because it’s my family. I don’t need to change myself or anything. But for some reason I started thinking before I taking an action. I don’t know how to explain it. \n\nIn 2022 April I started noticing that the corners of my hairline started thinning. Fast forward to now my whole crown area has gotten really thin. My doctor said it’s Male Pattern Baldness which has raised my anxiety for my looks even more since I’m skinny fat and can’t grow a beard. \n\nI just want to change myself to how I used to be. Like being calm, happy and collected. I don’t know how I can do this. \n\nI worked out for like 2 months and lost motivation/got busy since I’m in college. Trying to get back to it tho. I’m kind of meditating here and there, not sure if it’s working. \n\nAny advice? Thank you!",
        "created_utc": 1675643711,
        "upvote_ratio": 1.0
    },
    {
        "title": "The feeling of not being productive.",
        "author": "typeworks",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10usas7/the_feeling_of_not_being_productive/",
        "text": "Whenever I'm not going to the gym, playing sports, or with my friends I feel horrible. Whenever I'm at school learning or at home doing nothing I feel a sort of emptiness and anxiety inside me because I know I'm not being productive. How do I shake this feeling or change what I do so that I do not feel the emptiness and anxiety from this?",
        "created_utc": 1675642904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to move on and forgive myself",
        "author": "NeitherFig8909",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ury04/struggling_to_move_on_and_forgive_myself/",
        "text": "I won't bother you all with too much detail. My girlfriend and I broke up in December, and we remained as friends for a week and then she told me how toxic I was during the relationship. Fast forward and she (and our mutual friend group) decided to cut ties with me. Now I already fully accept that everything was 99% my fault. The only thing she did wrong was not tell me what an asshole I was becoming. But anyway it's been almost a month now and I'm really struggling. I just am filled with so much self-loathing and regret. I promised them all I'd seek therapy, which I currently am in the process of doing, but the idea that I will never get the chance to make it up to any of them - not even get them back as friends but to just make it up to them - it crushes my soul. I have no idea how to forgive myself and currently I'm aware of this girl who has a crush on me who I kind of like back. But I'm terrified that I'm just going to hurt more people.Mainly what I'm looking for is advice on 1, How to forgive myself and 2. How to reconcile with the fact that I will never be able to make amends.",
        "created_utc": 1675642014,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont see a lot of talk considering friends+loneliness and I think people underestimate the effects",
        "author": "Apprehensive_Toe6736",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uros4/i_dont_see_a_lot_of_talk_considering/",
        "text": "Just like many addictions, the internet is an escape from having social interaction, from \"dealing\" with people. And especially for people that had unmonitored access to technology from early age like me, the effects can be really bad.\n\nI dont know how to talk to people, I cant hold simple conversations with people I like (not talking about romantic relationships, any kind), it always gets awkward. I always try to justify it by telling myself \"im anti-social\" or \" im too special i cant get along with people\"  but in reality, I just dont have any experience, so its like a circle, no experience, so no confidence to even try cause you think youll fail, and you will fail, I mean I have failed, Ive tried hanging out with people that I dont see daily (so strangers in a way) and it has went horribly. \n\nBut as im growing up, its all catching up. I now HAVE to talk to people, not having simple body language, not knowing if you're being mean or nice when you say something and all of this gives off vibes to people that you didnt mean to give. \n\nSo what do you do? You create images. You create different versions of yourself depending on the people youre with. But in reality youre not having fun with anyone, its all pretend. Thankfully I have 1-2 people that Im truly myself with, but that doesnt mean were necessarily friends .\n\nSo all I can say is, try, gain experience. Its very hard, I cant even do it, I struggle, which is why im meeting a psychologist now and I hope it helps. \n\nNow im not saying there arent antisocial people, there are, and I 70% sure I also am antisocial, but I believe every human needs to see and talk to people. There are very few people that can survive completely isolated with 0 interaction.",
        "created_utc": 1675641409,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get out of the cycle?",
        "author": "Itemis",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10urltl/how_do_i_get_out_of_the_cycle/",
        "text": "I’m in such a terrible position and I need all the advice that I can get. Financially, life has not been great for me and all I’m doing every day is just Trying to catch up on bills and paying in back something that I owe. I have so many dreams and goals and even a little hobbies that I want to do so that I can maybe build something from that and generate more income with my skills. I don’t have the time to do so, because I am in such a terrible position financially, and if I do give up all my bills, then I probably would be car-less and homeless. so I do have to work which is not a problem in fact I love working, but even the jobs are just so hard to get. And the ones that are hiring want me to pretty much work so much for like $14. And I have an economics degree btw I’m at the point where I don’t even mind getting my hands dirty for a few months. And working a really shitty job. I just don’t want to look back when I’m in my 30s or 40s and regret not utilizing my youth more than I could. I’m already regretting it and I’m just 25. Would it be better to just let it all come crashing down in the build up again or just keep struggling like this? Are there any jobs that would hurt me pretty quick with a lot of hours and decent pay? I don’t care how shitty the job is. Or the hours.  I don’t know if anyone has dealt with this or relates, but I would appreciate any advice.",
        "created_utc": 1675641199,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be better",
        "author": "glorpdip",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uqjhi/i_want_to_be_better/",
        "text": "I’m 5’5 16M and I want to be better and start asap as every teenage boy is they watch porn and I want to quit, I want to be confident and charismatic I would say rn I’m about 55KG more or less and I have chubby cheeks that I hate. \n\nI’m still in school and Take higher or A level pe for you guys in England as  way to make myself loose weight aswel as playing football on a weekends\n\nSometimes in unfamiliar environments I struggle and I want to change that and be the most consistent person I can.\n\nPlease lay a route for me to start self improvement.",
        "created_utc": 1675638519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Advice During a Quarter Life Crisis",
        "author": "EthericAssassin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uq9u8/looking_for_advice_during_a_quarter_life_crisis/",
        "text": "So I'm almost in my mid twenties, and I feel kind of lost.\nOver the past several years, I've gotten better mental health and started therapy. I'm a happier and more confident person now, but the career/practical side of my life is not where I want it to be.\n\nI work a job that pays more than minimum wage, but it isn't enough to be independent and live on my own (USA). It has insurance benefits, but it's nothing spectacular. I want to move off and be an actor and also write books and make song covers, and generally, I just need a creative outlet, or else I get depressed and feel like nothing has purpose. That's the curse of being creative. It's not a stable outlet, but you NEED it to function.\n\nI also want to travel more while I'm young and have too many responsibilities, and I regret not traveling in my early 20s due to being too afraid to try new things. I will also say I have a decent sum of money saved up and no debt. My car is paid for. But I still live with my parents.\n\nWhat I want to know is, did I make the right choices in life, or should I have played it safe and did what everyone else does? I feel like if I had just stayed in college and listened to what everyone around me said and did, I'd be better off and more stable even if I wasn't as happy. I feel like I know nothing practical at my age, and I have all these big ideas and things I want to make happen. Should I just go for them? \n\nI really want to hear alternative perspectives.",
        "created_utc": 1675637844,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created a book! Self growth journal and workbook",
        "author": "kkimball620",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uq4vr/i_created_a_book_self_growth_journal_and_workbook/",
        "text": "[removed]",
        "created_utc": 1675637503,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I focus my energy on my goals?",
        "author": "malum68",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10upktg/how_do_i_focus_my_energy_on_my_goals/",
        "text": "I’m wanting to become a better learner, reader, and just an overall doer. But it’s like there’s this barrier which keeps my intentions on one section and my actions on the other, I want to keep my focus but it’s hard, what can I do?",
        "created_utc": 1675636154,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might have found the reason to my depression and problems",
        "author": "PotatoPepperoni482",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10upimx/i_might_have_found_the_reason_to_my_depression/",
        "text": "I (20m)have no self worth, I hate myself (with no reason at all) and don’t know what to do about it. I really want to change, not just for myself but for others I care in life.\nSince my childhood, I have always had a sense of void in my heart/mind and don’t know what it is no matter what I archive and accomplished.\nI am very good at somethings and have entertaining hobbies. However, I always tell myself I am not enough and not worthy for love or being loved. Maybe that is the reason why I still can’t say “I love you” to my family and friends. \nI am starting to notice a pattern of me over-explaining/apologising for things I didn’t do. My entire existence/emotions alter base on what my friends and family felt/said/acted, which means I could be so fulfilled in last second and turned into a sad fucking thing in the next. My friends start to get annoyed with me over apologising/explaining, which if I am in their shoes, I would totally feel the same.\n I feel bad for my friends and family. \nIt haunts me when I overthink and do stupid over explaining and apologising.",
        "created_utc": 1675636001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love Yourself and be Confident",
        "author": "vicki_davitashvili",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uphos/love_yourself_and_be_confident/",
        "text": "The underlying reason behind lack of self-confidence is usually due to issues of self-love and self-worthiness, and fears that you're not good enough or as good as someone else (self-judgment).\n\nOne of the best ways to overcome that is by doing something that feels low risk such as taking a course something that you're not good at. Taking a low level risk that feels safe but still gets you out of your comfort zone.\n\nFor example, I took singing lessons and tennis lessons -- the two things I was petrified to try in life. This was \"low risk\" but absolutely forced me out of my comfort zone.\n\nIdentify one or two things like that in your life and feel into your confidence. You don't need to rush this. Remember, this is a journey, not a destination.",
        "created_utc": 1675635936,
        "upvote_ratio": 1.0
    },
    {
        "title": "suggestion",
        "author": "spydermud",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10upcdq/suggestion/",
        "text": "I had never had any relationship with any girl. After seeing my mom and dad fighting and other couples fighting while growing up, long back i decided relationships are a waste of time. Now im 27, but now when start to feel like i want to love someone, do things for her care for her and protect her from every pain and bad things. But again when i see any girl i feel the pain of the relationship. behave like very strange near girls like if even i get touched by her unconsciously i will bust into flames. So i get rude like if my friend's girl friends come i just locked myself into the room to avoid them even they are very nice whenever they see me anywhere they say hi but i avoid and run. I don't know what to do. Before this i was doing forcefully now it happens unconsciously. Please advice me",
        "created_utc": 1675635579,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Benefits of Cold Showers.",
        "author": "fellrobin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10upc3z/the_benefits_of_cold_showers/",
        "text": "I’ll keep this brief. You wake up. You get your morning shower. Right at the end, after you’ve washed everything off, you turn that dial to the coldest it can go and you accept the icy water that rains down on your head and torso. You DO NOT think about it. You just DO. Why? Because you are becoming a man of action.\n\n**THINK LESS; DO MORE.**\n\nIf you’re here, then perhaps you too overthink and ruminate - procrastinate too I imagine.\n\nYou get in that shower and you turn that dial **before you even have time to think**. Until it becomes a habit. Part of your morning routine.\n\nThe first time I started, I could only manage 10 seconds… on a good day! Then, as I continued ‘conquering my inner bitch’ and putting myself through it, it began to become euphoric… I now actually ENJOY the refreshing boost it gives me (no joke – when you’ve done your stint in the icy water, the feeling as you walk out and your body naturally begins to warm up is nothing short of amazing. Similar to that first sip of hot coffee on a cold day. An internally warming, all consuming warmth that envelopes your very soul).\n\nI now do 30 seconds. Some days it’s hell. Some days it’s easy(ish). It doesn’t matter. **You accept it without judgement.** IT’S A MEDITATION. You give yourself to the act of throwing your body into something it’s screaming to get out of. You breathe - slow and deep. You wash the icy water over your body and you count in your head to 30 (or 10, 20… 100, whatever you can do eventually). Ancient samurai have always practiced this ancient technique, standing under icy waterfalls for long periods. It is the ultimate meditation. Your body is screaming at you to GET THE HELL OUT OF THERE! … but you don’t. YOU are in charge. Not your body. Not your desire. Not your urges. YOU are the master of your fate… the captain of your soul.\n\nStart sacrificing yourself to the cold. Watch how your motivation and discipline skyrockets.",
        "created_utc": 1675635561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Five Quick Habits to Boost Your Mental Health",
        "author": "unlimitedwillpower",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10up0i6/five_quick_habits_to_boost_your_mental_health/",
        "text": "An important but frequently ignored component of overall wellbeing is mental health. Here are five easy practices you may start implementing today to enhance your mental health:\n\nRegular physical exercise releases endorphins, which are naturally uplifting chemicals. Aim to work out for 30 minutes or more each day, five days a week.\n\nPractice mindfulness: By focusing on the present moment, mindfulness can help you feel less stressed and anxious. Increase your mindfulness practice time gradually, starting with just a few minutes every day.\n\nGet adequate sleep every night. Aim for 7-9 hours. The quality of your sleep can be enhanced by practicing good sleep hygiene, which includes avoiding electronics before bed and developing a soothing bedtime ritual.\n\nMaintain social connections – Social connections are essential for our mental health. Join a group or organization, get in touch with friends and family, or give your time to others as a volunteer.\n\nTake good care of yourself Your mental health can be enhanced by eating a balanced diet, staying hydrated, and practicing frequent self-care. Eat healthily, drink lots of water, and schedule time for enjoyable activities.",
        "created_utc": 1675634776,
        "upvote_ratio": 1.0
    },
    {
        "title": "i talk too much",
        "author": "spydermud",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uopn1/i_talk_too_much/",
        "text": "Everyone points out that I talk too much but i don't realise it ... Also people get irritated with me. Now i stopped Talking about anything just a few yes or no now people have asked me what is wrong with me ...then again cycle start please suggest me something how to get out of this",
        "created_utc": 1675634053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any opinions about getting a financial advisor?",
        "author": "writer_research",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uoplo/any_opinions_about_getting_a_financial_advisor/",
        "text": "I’ll be 31 in a few months, and I’m ashamed with how little in savings I have. \nDespite having a good paying job, I’m struggling to save anything every month because of high credit card debt, student loans, rent, car payment, etc. I’m also trying to recover from a bad shopping addiction (thanks depression and pandemic). \n\nMy husband makes way less than me but still is able to pay for things without worrying how much money he has in the bank because he barely buys anything for himself. Even when I’ve tried to stop buying frivolous things, I still end up with very little in my account! \n\nI’ve been thinking more and more about looking into a financial advisor for myself. I’ve asked my father about getting one and he said they’re a scam because one stole all his savings from him and left the country and was never able to retrieve it. My family and my husband keep saying that I don’t need one and that all I need to do is budget and stop buying “stupid things”, but that’s like telling a person with ADHD to just buy a planner (which is also me!) \n\n\nHas anyone had a financial advisor and know if they are worth it? Thanks so much for your opinions.",
        "created_utc": 1675634051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going for my first run in 7 years. Someone please hype me up.",
        "author": "almostaliltool8",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uodh7/going_for_my_first_run_in_7_years_someone_please/",
        "text": "TLDR: I could really use some encouragement :( \n\nI'm super unfit but I don't want to run for a better body, it's nice to look good but I really want to exercise for the mental health benefits. \n\nWent to a not for profit shop yesterday and got some really nice workout clothes cheap so that was a win.\n\nI have one pair of Nike sneakers and they are falling apart.\n\nUsed to love running with music but I don't have an armband to put my phone in. \n\nHell I can't even take my phone because I don't have anything to carry it in and I don't want to drop it. \n\nI'm looking forward to how I'll feel afterwards, but I'm dreading it in a way???\n\nI think I'm just going to start with a small run so I don't get lost. Maybe do 2 circuits? \n\nCan some kind Redditors please hype me up a bit and remind me how awesome running is? I used to run 4km a day when I was 16 and it was awesome. Then I did a school marathon event and for some reason pissed myself so I ended up coming last. It was so humiliating I didn't even try running for ages. Then I got agoraphobia after being bashed and the last time I remember trying to go for a run (5 years ago) I had a panic attack 50m down the street and walked back home crying. I've done therapy since then and I'm on some anxiety medication right now so I have no excuses. \n\nI miss how happy I felt running. \n\nI miss the runner's high. \n\nI miss how delicious water tasted after being exhausted. \n\nI miss running to the beat of the music, that was like a core memory for me :( It's not going to be as fun, it feels like it's a chore. \n\nSomeone please give me some encouragement. Why I should get my ass out the door today and just damn run.",
        "created_utc": 1675633236,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to have more regard for others",
        "author": "MrBogazici",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10unu3x/how_to_have_more_regard_for_others/",
        "text": "I'm 21M and recently realised that I was too self-absorbed and didn't really try to understand others. The kindness I show is because I feel I'm obligated to; it isn't genuine, and I think it shows. I think overuse of pc and familial problems might have caused this. I think this may be one of the reasons why I don't really connect with anyone and push those who try to know me.\n\nWhen I'm watching movies, I make effort to read the actors and see what their character feels. But when it comes to the daily conversations, I find myself back at the old habits, just thinking of what I want to say and not paying attention to what it causes on the other person nor what the other person wants. and just watching. How can I break this and be better? Therapy is a given for sure.",
        "created_utc": 1675631932,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell if something is bad for my mental health?",
        "author": "Emotional_Sloth1319",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10untp8/how_to_tell_if_something_is_bad_for_my_mental/",
        "text": "For a bit of context, I grew up with a narcissistic mother as the firstborn daughter. All the memories of my childhood are literally a big blur or getting yelled at or feeling scared that I didn’t do something right. I would get blamed for things I didn’t do because it was just easier for them, and I’d get yelled at for just being in the wrong place at the wrong time. I’ve grown up just being so numb towards my emotions. These last few years I’ve been really trying to bring myself out of that.\n\nI’m currently a university student with a full course load and a bunch of extracurriculars. I want to go into medicine and I don’t mind working hard at all. I just can’t figure out one thing: \n\nI have been working at a pharmacy part time. I have classes 5 days a week and on the weekends I work. Any time I get is usually spent being parentified for my younger siblings or being a punching bag for my mom. I know I’m not as good as the other pharmacy assistants there at all. I’m not as fast as them and I struggle with certain things that should be entry-level easy. I can’t figure out if this job is ruining my mental health. I constantly feel like I’m not good enough and that I should be fired but to be fair I’ve felt that my whole life.\n\nMy question is: how do you know if something is bad for your mental health? Am I actually hurting my mental health and Should I quit this job or is it just me overthinking things and I should stick it out because it would be stupid to quit after doing less than 200 hours? If I do quit then I feel even more useless.\n\n😅 I wonder what it’s like for the kids who got to put their mental health first..",
        "created_utc": 1675631906,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you even unlearn shit like feeling like a kid getting scolded by a really strict parent after fumbling around adults.",
        "author": "Shoddy_Zombie1615",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10unrw0/how_do_you_even_unlearn_shit_like_feeling_like_a/",
        "text": "I have this tendency where I'd get so sensitive &amp; too emotional whenever I make a mistake—big or small. Heavy on small. \n\nMistakes such as not knowing how to answer a question, forgetting the words to a saying/paragraph that's already second-nature to you (ex. prayers), and just saying the cringiest, we-dont-need-to-know-that info dump in social situations. \n\nI'm tired of feeling this way, especially now I'm in my mid-twenties, feeling like a kid getting scolded by a really strict parent everytime I fumble on something. \n\nI want to get better but I just don't know how. So sick how my emotions get the best of me, in every situation. (Sometimes, I'd also get too numb to the point where I wouldn't know how to react &amp; friends would ask if that reaction of mine was appropriate for the situation.)\n\nI don't know what to do anymore.",
        "created_utc": 1675631787,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you personally keep on persevering?",
        "author": "poeforhope",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10umya3/how_do_you_personally_keep_on_persevering/",
        "text": "Recently hit a very low point in my life and I feel very lost. Found out my fathers tumor is still there despite almost two years of chemo and T-cell therapy, quit my job, broke up with my partner of two and a half years, and have had no success finding a new car without a co signer (which I do not have access to). I live at home with my mother and she has graciously taken me to work for the past three years, however I’m having a lot of trouble finding a decently paying job for only part time since our schedules would conflict with each other. My record for work is also looking poor in terms of punctuality, since I’m relying on someone else to get to work. I’m not mad at her, I know she is very stressed and tired, but I’m not sure how to figure out a way to get to work on time that she can manage. I’ve got no credit and 3K saved up for a car, and apparently that’s not enough. I know the basic steps to get myself out of this pickle but some advice for how to keep persisting, stay above water, and maintain everything without losing my sanity would be nice. Work advice, car advice, getting a credit card, and help offered is appreciated. I just need to dig myself out of this hole and I’m struggling to",
        "created_utc": 1675629853,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you be happy doing nothing?",
        "author": "rednryt",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10umvza/can_you_be_happy_doing_nothing/",
        "text": "It's almost three years since I lost my first job and I haven't worked full time again ever since. I spend most of my days just doing nothing and I always hated myself for it. I hate what other people might think about me. \n\nSo every now and then, I force myself to find a job only to get super anxious and stressed in the process that I give up as soon as I start. And I will be hating myself more for being useless.\n\nI tried looking for my passion, to try out new things. But nothing sticks. I had no energy to keep going. Either I'm too lazy or maybe I have given up on life. \n\nI used to a workaholic. Spending every minute earning money, building my career, achieving my goals. Even in my youth, I spend most of my time studying, and school work. I was an over-achiever. I was an ambitious kid, with lots of dreams. But lately I seem to forgot most of it. And the rest that I still remember I totally don't care about anymore.\n\nWhat if I have no more goals? What if I have nothing else that I want. What if I'm perfectly content to just eat, breath, and sleep like any humans doing just enough to survive?\n\nWill that be so bad?\n\nI don't know, I do enjoy doing nothing. When I wake up, I look forward to spending my day doing nothing. But at the end of the day, I keep feeling guilty about it. Then I keep beating myself up for wasting another day doing nothing. Then I won't be able to sleep thinking of all the things I should be doing. But I end up in random parts of reddit venting about it.\n\nThen I just repeat the cycle all over.\n\nI even forgot exactly what I'm trying to say. I should stop writing now.",
        "created_utc": 1675629699,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I'm naturally a simp",
        "author": "Mulsanne_McQueen",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10umoxr/i_think_im_naturally_a_simp/",
        "text": "My level of generosity is high and its been like that from a young age. Naturally I love giving people things. It gets complicated when I meet girls, especially those who like asking for things including money. If you add feelings to the mixture I'm finished. If I really like someone, in a way I'll almost do anything for them.\n\nThe only thing that keeps me in line is that I'm a cheapskate. I'm not proud of it. Unnecessary things I refuse to pay for, just like any decent person. \n\nI met someone who likes to go out a lot, sometimes to these expensive places. Going out costs money, and she expects to be treated like a princess. She even said she ain't looking for a relationship at the moment. The fact that I'm cheap made it so easy to end things.",
        "created_utc": 1675629234,
        "upvote_ratio": 1.0
    }
]