[
    {
        "title": "A Personality Trait We All Should Strive To Have...",
        "author": "ForteMethod",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rghg2/a_personality_trait_we_all_should_strive_to_have/",
        "text": "**Openness and Critical Thinking.**\n\nThe simple truth is, most of the people around you are as good as dead. I don’t mean physically, but spiritually and emotionally.\n\nThe average person will adopt whatever  ideas and beliefs their parents/family had and then continue to live inside of those beliefs for their entire life without ever questioning their assumptions or challenging the premises of those ideas.\n\nThe average person will cling to their now subconscious thoughts and behaviors/traits and never question why their actions could be causing a less than desirable outcome. \n\nThey live their entire lives in a box. They identify with their beliefs so strongly that challenging them is a recipe for a pointless conversation.\n\nHowever, to live a good life, and not just a life of luxury and wealth, but a meaningful, passionate, and fully engaged life, you must open yourself up to new ideas and ways of being.\n\nThe world is a big place filled with billions of people, almost all of whom have different beliefs, ideas, and ways of being than you do.\n\nTo shut yourself off to these ideas is a form of spiritual suicide. You stop growing and hold yourself back from experiencing some of the best this life has to offer.\n\nTo be truly successful and happy, you must be open to new ideas. You must be willing to test every assumption, to ask yourself, “Is this true? And if so, how can I know that it’s true?” You must be willing to take your most engrained beliefs and chunk them against  rocks to see if they break.\n\nConstantly seek out the truth and don’t be afraid to follow where it leads.\n\nThe more willing you are to be open to new ideas, the faster you’ll learn, grow, and evolve into the person you want to be.\n\nHowever…\n\nBe sure that you don’t take this to the extreme. There’s a difference between openness and gullibility. Consider every new idea and belief with the same critical eye and scrutiny you do your existing beliefs and always, always, always, seek the truth.\n\nBecause in the end…it will set you free.\n\n&amp;#x200B;\n\n\\- Forte Method",
        "created_utc": 1675311543,
        "upvote_ratio": 1.0
    },
    {
        "title": "how did you get better at communication?",
        "author": "visheshsux",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rghf5/how_did_you_get_better_at_communication/",
        "text": "every time i speak, people interpret it wrong. i can never get my point across. my vocabulary is mediocre, i’m not retarded, it just feels like i say something and it comes out as the opposite. \nthanks",
        "created_utc": 1675311541,
        "upvote_ratio": 1.0
    },
    {
        "title": "i hope this video helps all of you.",
        "author": "viktorparis22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rgedw/i_hope_this_video_helps_all_of_you/",
        "text": "[removed]",
        "created_utc": 1675311293,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you ever get tired of living",
        "author": "FaustSoulx",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rgd96/do_you_ever_get_tired_of_living/",
        "text": "I'm sick of being depressed. I don't really to be here anymore. I don't know what its like to be happy anymore. I don't remember how to pick myself up. It's all so distant to me now. My to girlfriend says she needs me, but I have a feeling she's just trying to make me feel better. Any advice?",
        "created_utc": 1675311205,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop laughing so loud?",
        "author": "LeadingLost8536",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rgcrw/how_do_i_stop_laughing_so_loud/",
        "text": "Hi,\n\nI've had my first performance review in my new job and everything was very positive except for one comment which is a bit of an ongoing issue in my life in my hobbies and work.\n\nI have been told that i am very loud, specifically my laugh is very loud and it really grates on some people. I think it is just one person that has raised it as an issue but i totally accept what they say is a fair comment and i would like to change it so that i don't continue distracting or even making people jump. This is a habit of a lifetime and one that i think will be very hard to break. \n\nDo any of you have any advice on how i can learn to control the volume of my laugh at work and/or (if necessary) in general? I figure it might be easier to attempt to curb the habit altogether rather than in specific places.",
        "created_utc": 1675311164,
        "upvote_ratio": 1.0
    },
    {
        "title": "what can I do better?",
        "author": "canyoumakebanana",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfz1u/what_can_i_do_better/",
        "text": "18(m)\n\nI'm a loser but I'm scared that I will never change, I've been a fat tub of lard for a while and no matter what I do, I seem to be getting worse.\nI have no talents or skills that will get me anywhere. I need to stop my retarded attitude but it always comes back and it passes me off.\nI drew a lot back in elementary and middle school but stopped in high-school, picked it back up but everything I make is dogshit. I draw for hours on end every single day with no results and I need to try harder. \nI don't want to be a loser but I know that I can't pity myself because of it.\nI watch porn and it makes me sick because I'm sure I'm addicted.\nI'm poor in Oklahoma so I'm going nowhere. I'm scared for my family because I don't want them to suffer because of me. I've learned to stop crying so in terms of outbursts thats taken care of. If this sewer line of a rant gets read, I will take any suggestions to better myself. I don't want to be an alpha male or sigma, I just want this to go away.\nI'm terribly sorry for the mouth full of a messy rant and I thoughtfully appreciate you reading this you amazing human being.\nAm I not trying hard enough, am I not smart enough? Do I need to practice more? Do I need to meditate more? I will take any suggestions given to me, I will cherish them to be better and smarter.",
        "created_utc": 1675310073,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (29F) find it hard to be grateful and think I'm a bit sociopathic because of it. How did you *really* start to appreciate what you already have?",
        "author": "starsinpurgatory",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfu1v/i_29f_find_it_hard_to_be_grateful_and_think_im_a/",
        "text": "Admittedly 80% of my problems are me catastrophizing any sign of foreboding on the horizon and 20% are actual adverse experiences that have made a dent on my rational brain. At the same time, it doesn't take much for me to feel content - I don't need much social interaction, and don't really care for dating/having a partner (because I can't seem to feel romantic attraction that easily). Yet, I find it hard to feel grateful for what I already have (a full-time job that I don't hate, food on the table, supportive albeit judgmental parents, friends who make me laugh). \n\nDoes this sense of \"I don't have much to be grateful/happy about\" go away with age? People always tell each other to be grateful but it's like telling someone nervous not to be nervous, as if that alone would work. \n\nI guess I'm curious to hear what others in this subreddit suggest. Thank you in advance for any insight!",
        "created_utc": 1675309687,
        "upvote_ratio": 1.0
    },
    {
        "title": "These are the 5 things I did to feel into my self-love and self worth",
        "author": "Omega_Neelay",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfu0c/these_are_the_5_things_i_did_to_feel_into_my/",
        "text": "I hope these help you jumpstart your journey discovering your inner beauty, inner worth, and just how incredible you are. Remember, you are love!\n\n1. Place awareness on who you are by identifying what you love, what you love to do, and what boundaries you have in life. This helps discover the real you and that you have self respect.\n2. Ask your friends what they love about you. We tend to be a lot more judgmental of ourselves, but our friends give us a more accurate picture of what makes us lovable and valuable in their lives\n3. Do at least one nice thing every day for yourself, and give the love and attention you want from others to yourself. When you do this for you, others will naturally pick up on this energy and will give you even more.\n4. Don't force people to stay in your life and decreasing your Self-esteem trying to please other .Remember those who want to stay in your life will fund a way to talk to you.\n5. Try to learn something new everyday this will increase your self worth.",
        "created_utc": 1675309683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for the top 250 young leaders worldwide | International Opportunity",
        "author": "bvell13",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfqs5/searching_for_the_top_250_young_leaders_worldwide/",
        "text": "[removed]",
        "created_utc": 1675309418,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I stop taking things so personally?",
        "author": "purplesoul222",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfl8x/how_can_i_stop_taking_things_so_personally/",
        "text": "I’m confident in some regards, but I seem to never get over negative things people have said to/about me. I always take it to heart and convince myself I’m a bad person.\n\nFor example last year my older brother and I got into a big argument, we both said really hurtful shit. I’m in college and work part time, for a semester I decided to stop working and live off savings. I get some financial support but I have always made my own spending/gas/food money. In the argument he told me I’m selfish and a leech. Almost immediately after I found a new job and have stressed about having money/not asking for support ever since. \n\nIt’s happened in many other instances as well where someone will say something hurtful and I ruminate and try to “fix” whatever the person said is wrong with me. I’ll usually cut them out and act unbothered, but it will get me for so long after. I also always worry I’m annoying or upsetting the people close to me and they just aren’t telling me and plan to cut me off, only to realize there was never an issues.\n\nHow do I stop taking everything so personally and get thicker skin?",
        "created_utc": 1675308969,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get out of this rut and get going again?",
        "author": "girldoesstat",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rfenp/how_do_i_get_out_of_this_rut_and_get_going_again/",
        "text": "I've been quite burnt out lately, I gave myself some time to recover but it's been 3 weeks and college has started and this isn't funny anymore. I don't have the energy to get up in the morning anymore, I used to be consistent with my workouts but now since I don't wake up early I can't do my workout for the day because I leave home at 8am and return at around 7pm. I have so much academic stuff to to cover and I'm behind on lectures but I am just not feeling the 'push'. I'm usually the 'stay ahead of work' type of person but i just feel so lost right now. \n\n\nI can't extend this break any longer I have to get moving. Does anyone have any advice? Your input would be much appreciated!",
        "created_utc": 1675308455,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (M27) can’t get a more positive outlook on life because life won’t let me.",
        "author": "Eagle_Blimp",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rf4q5/i_m27_cant_get_a_more_positive_outlook_on_life/",
        "text": "Whenever I try and make a positive improvement in my life, something really bad happens. For example, last night my girlfriend was telling me how I need to have a more optimistic point of view. This morning, I got news my grandpa died. \n\nThe time before that I tried to be more positive, I almost lost my job. \n\nAnd the time before that, my previous gf broke up with me. \n\nSo, clearly God, the universe, or something doesn’t want me to improve or to be positive. This is making it hard to even get traction when it comes to making even the slightest change to my life. I really don’t know what to do, here. Should I learn to just be okay with being pessimistic all the time? Because frankly I don’t see any other options.",
        "created_utc": 1675307686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking",
        "author": "hlpplzmhlpm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10retom/talking/",
        "text": "[removed]",
        "created_utc": 1675306835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I meet friends?",
        "author": "Responsible-Lab-8855",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rekfz/where_can_i_meet_friends/",
        "text": "I'm a 20 year old male and I'm lonely. It's hard for me to make friends in college. I wish I socialized more in high school because you don't see people as often as you would in high school. I don't where I should go. I was very anxious and it prevented me from making any friends. I regret it, and I don't have anyone to talk to. Any suggestions?",
        "created_utc": 1675306144,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I deal with Fear Of Missing Out in my career?",
        "author": "SadFaceInTheSpace",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10real9/how_do_i_deal_with_fear_of_missing_out_in_my/",
        "text": "I am 23. I am a software engineer and I'd like to have my own business one day, parallel to my job.\n\nI am constantly in Fear Of Missing Out. So far, the best I have come up with is to try to isolate myself as much as possible from any opportunities that I can't partake in.\n\nI am currently unemployed, in the process of looking for a new job. Before I had the courage to quit, I was actively trying to ignore new job opportunities. I couldn't quit because I had some stuff to take care of in terms of my career. But I knew that if I saw a good job posting I would be very anxious that I am missing out.\n\nIn terms of my small business ideas, I am always afraid that while I am working on something else, someone may come up with the same idea and do it before me. I am anxious that I am missing out on market share or whatever.\n\nMy girlfriend and I want to buy an apartment, but we still have to save up some money first, can't do it right now. I try to isolate myself from seeing apartments for sale. There are some good deals and I am afraid that I am missing out on them.\n\nEven stupider example to demonstrate how anxious I am - I want to have a cool fast car, but of course I have higher priorities than that. I am afraid that by the time I can afford one, they will not be that cool. Cars are going electric and they are all fast as hell, so I won't be able to have a fast one if they are all fast. I am all for EVs, but I am afraid of missing out on having a cool gasoline car while I still can. \n\nAnd the same goes for everything in my life, but the first three are my main areas of concern.\n\nIsolating myself works as long as I can do it, but inevitably I see something and I get anxious. I really don't want to be like that, I want to not isolate myself and accept that there will be other opportunities. I understand there will be other opportunities. But my feelings don't care - I am still missing out :(",
        "created_utc": 1675305394,
        "upvote_ratio": 1.0
    },
    {
        "title": "100 days to reset",
        "author": "Muted_Management_809",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10re4vp/100_days_to_reset/",
        "text": "I'm 20, turning 21 next week.  I've spent the last few months falling into a covid era-type slump; I'm taking time off of school to care for my ill mother, and I'm practicing some highly unmotivated lifestyle habits.  In making sure that I'm there for my mom, I'm sacrificing nearly all hours of the day to stagnating.  I'm officially resetting because I have no other option: I'm extremely attentive to my family and their needs, but I'm losing control and discipline.\n\nI'm a student athlete at Harvard.  My whole life until now has been structured and diligent.  With all of this freedom in the day, I find myself staring at my phone for hours just because it's the best pastime that I can muster up the energy for while I sit next to my mom as she rests and recovers.  My days are wasting away, and I fear that I'm hiding behind caretaking as an excuse for why I'm suddenly losing momentum.\n\nThe goal for the next 100 days is to reintroduce order to my life, automate the tasks by creating routines that are keeping me moving forward, studying for the GMAT, and making sure that none of this interferes with spending quality time with my mother and helping her through the hardest moments of her life.\n\nI had it down for maybe the first month of being home, but my family was so sick of my being anal about scheduling and structuring that I had to stop in order to prevent stressing them out further.  I don't want to go to extremes, but I don't think that I can maintain this wishy-washy complete-as-needed type of lifestyle.  I have very ambitious goals, and I've got a lot to do.  Not to mention, caretaking/homemaking is a full time job, and I'm working part time as well.\n\nI seem unable to find accountability in anything in life, so here goes posting somewhere just to get the thoughts out and organized.\n\nMore concretely: \n\nWake up time: I need to get up earlier.  I already get up before 8 every day, but I'm losing precious time each morning to get in GMAT studying before my mom is awake and needs my assistance.  To train at school, I would either sleep at 10 and get up to train at 6 or sleep at 9 and get up at 5 to do homework before training.  I loved these lifestyles, and I've got to get back on it.  These days, I'm in bed by 11 every day, but I can't put away my damn phone.  It's madness: time for change.\n\nEarly morning study: I definitely need to take the GMAT soon, so this is a top priority.  During the day, my mom is drifting in and out of requiring my assistance, so I have no other uninterrupted time.  Plus, spending time with her is my favorite thing to do, so I want to make the most of her waking hours.\n\nLearning: My love of learning is what drove me so far in life in the first place. I really don't want to lose that.  I think I'll start with educational and news podcasts to begin.  I've got to get the ball rolling again.\n\nMovement: I've become so disappointingly sedentary.  I went from running half marathons to walking less than half a mile in my day to day life.  I don't want to be apart from my mom, but I really need to get moving.  It's freezing here, but I think I might do really early morning walks to try and get up.  Maybe to combine with the learning.\n\nOrganization and cleanliness: I'm slowly watching my room descend into a pig sty.  Time to get on it: I need a cleaning routine, a daily 30 minute cleaning sweep of the house, and a system for my room.\n\nMeals: I'm the world's worst cook, but with my mom's constantly-changing preferences from meds and my dad's love of beef and chicken, I've got to really hone some skills.  Meal prep is really difficult for me because I hate cooking, but it's time to get my act together.\n\nFinances: I work in charity and public service.  Not the profession of the rich, for sure, but I think it's about time I get a little more in control of my finances.  I don't waste money on anything basically at all, but I need to see if I can work out another stream of income sometime soon.\n\nI guess I'll keep adding to this.  Wish me luck!  Just trying to do some good and get life back under my feet.",
        "created_utc": 1675304983,
        "upvote_ratio": 1.0
    },
    {
        "title": "100% Responsibility (It's all on you!)",
        "author": "Idaniss",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10re039/100_responsibility_its_all_on_you/",
        "text": " This is neither a tip or trick but real advice.\n\n***100% Responsibility***\n\nRadical idea - you are responsible for 100% of the things that happen in your life. All of them. This is true for every person but especially as a man. This is about owning up to your shit. This obviously means it's your responsibility to workout, stay healthy, improve social skills and initiate with women.\n\nWhat if something is not your fault? It may not be your fault, but you are still responsible for how you react. For how you choose to look at things. It's the reason different people react differently to the same things. In this world, there is so much that is unknown, so much that is out of our reach or control. The one thing that we have absolute control over is our mind. \n\nThe great stoics of the past realized this thousands of years ago. When something happens in our lives, it usually looks like this:\n\nEvent → Reaction\n\nSomething happens, and you immediately react, usually in the same manner that you have in the past.\n\nHowever, the stoics say that there is another stage in the middle;\n\nEvent → Judgment → Reaction\n\nThe middle stage is our **judgment** or perception of the event. This is where you gain back control and choose your way of action. This is how you actually live, and not go about this world reacting to external forces outside your control. That's the difference between taking responsibility and playing the victim. \n\nI can personally attest to this idea, in most areas of my life, but ill bring one example, though it might be odd.\n\nEver since I was little I suffered from Trypanophobia (extreme fear of needles) to very late age, and by applying this concept, I managed to overcome it almost entirely (I still feel uncomfortable but it no longer controls me).\n\nTaking responsibility for 100% of the things that happen to you is **uncomfortable**. But it's that exact practice that's going to make you into a capable person. You will become competent.\n\nSafety Note: This is not to mean that you cannot seek help from other people. Asking for help is having humility and being responsible enough to look for guidance/assistance when you cannot overcome something on your own.\n\nI hope that this isnt gonna be just another piece of information that you consume and move on with your life, be honest with yourself. \n\nTry it! grab a piece of paper and pen and put down at least one area of your life where you didnt hold yourself responsible.\n\n&amp;#x200B;\n\nYou have everything to win by trying and everything to lose by not trying.\n\nMuch love &lt;3",
        "created_utc": 1675304615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I come home angry after work",
        "author": "juanchinnn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdlao/why_do_i_come_home_angry_after_work/",
        "text": "I’ve never worked 40 hours in my life before. This job is something that I don’t hate, I get to work on things and learn new stuff during my free time.\n\nWhen I come from work I come with an attitude, I just want to unwind and the little things others do bother me. \n\nOne thing that pisses me off is traffic, I try to make it nicer by just listening to a podcast or music.\n\nStill doesn’t work bc I get home moody, I want to relax while the whole house is just “annoying” me, music here, talk talk etc.\n\nWhen the weekend hits, my mood changes I feel like I need more breaks to normalize my mom, I’m out almost 11hrs from my house. Traffic takes a good maybe 1 1/2 hrs of my day. I go home and I have 4 hrs to myself, maybe I’m selfish that I want to unplug. \n\nIn these 4 hrs left of my day I watch something that little by little calms me down, always had or I watch documentaries. I don’t engage in anything productive bc at work for the moment *knock on wood* I have time to learn new stuff or study in general anything I like.\n\nIs being grumpy a sign that I need to quit, I just don’t wanna be grumpy with the people around me when I come home",
        "created_utc": 1675303547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need someone to help hold me accountable other than myself 🙃",
        "author": "Informal_Patient_633",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdi0h/need_someone_to_help_hold_me_accountable_other/",
        "text": "Dear virtual diary…. And to whom may be listening: \n\nI am a student and I am worried about financial stability. Friday is the due date for bursaries and a job application. It’s going on Thursday. Why must I do this? I have these deadlines to meet on top of course load (4 classes I’m taking) and I leave it all to the last minute knowing damn well what I have on my plate. \n\nI don’t do much but sit and think of reasons why. I’ve been thinking about the gym recently to get more into my body and out of my mind. \n\nI want money. I need money, I don’t want struggle. It’s already challenging enough balancing course load and managing my time properly! Do I try to take on this job? \n\nIt’s hard to get started , to get the ball rolling on being more active and “busy” \n\nI’m trying to stay more present and not distract myself with substance misuse or cereal flirting with whom ever but right now it’s what I want. To distract.",
        "created_utc": 1675303318,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Fitness/Looking Better Changed My Life (&amp; How It Didn't)",
        "author": "lifting_and_coding",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdhmi/how_fitnesslooking_better_changed_my_life_how_it/",
        "text": "Whatsup everyone, thank you for reading my post. I've put a TL;DR at the end.\n\nI initially posted this in the Fitness subreddit but it got automatically removed as I do not meet their posting requirements so it has to be manually approved\n\nWhile I am waiting for manual approval there I figured that this might be insightful to some of the audience here. The text below is something I wish someone had told me before I started my fitness journey\n\nMy fitness journey started because of anxieties and insecurities. I always felt I was smaller than other guys around me and I was always insecure about how I looked in general\n\nI've been lifting for a decent time now and have made a pretty good transformation\n\nHere's how fitness changed my life and how it didn't. This is of course just my own personal experience but hopefully people who are at the start of their fitness journey and felt the same way I did will find some valuable points in here\n\n**How Lifting Changed My Life:**\n\n\\-  I feel and look better: This is perhaps the most obvious one because it's physically evident. I feel better and I like how I look a lot more now, with or without clothes. Previously I felt I looked ok at best in clothes and I couldn't stand taking my shirt off\n\n\\-  Gave me confidence: Before fitness, I had never pursued a goal and stuck with it to the bitter end. Fitness was the first goal I ran with and I achieved what I had set out to achieve. This made me realize that I truly can accomplish goals I set my mind to. I used this mindset switch to help me build up my career and I am now in a job I genuinely like. I 100% believe that I would not have this mindset without fitness. This is a mindset that has carried over in many different areas of my life and helped me greatly.\n\nThis is a point that I cannot emphasize enough. I am getting out of my comfort zone more than ever before and I am more disciplined than ever. I owe a lot of these improvements to my fitness journey\n\n\\-  Improved my dating life: This was probably one of my biggest motivations and I guess this feeds into the first two points but yes, it did help improve my dating life.\n\nThis is a point where I always heard mixed results when browsing Reddit or other forums. Some people would report improvements in their dating life while others felt it made a minimal of a difference. For me, there was a huge difference.\n\n**How Lifting Didn't Change My Life:**\n\n\\-  My anxiety and insecurities have been reduced, not eradicated: When I started my journey I had this idea in my mind that fitness would solve all my issues. I just wanted to look like Brad Pitt from Fight Club and I thought that when I had that physique, all (or most) of my anxieties around myself, my dating life and my insecurities around my looks would vanish.\n\nThis hasn't been the case.  The more I go on this self improvement journey the more I realize that the emotional knots in myself are deeper than something that a nice physique can fix. Other things that have helped are improving my career, mindset (meditation, positive thinking, perhaps therapy down the line), etc\n\n**Conclusion/TL;DR:**\n\nFitness greatly improved my quality of life but it did not solve my problems as I had thought it would when I first started my journey. Regardless, I'm beyond happy that I pursued this journey and I see myself lifting and staying fit for life.",
        "created_utc": 1675303290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me Reddit.",
        "author": "SureAd5752",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdhj1/help_me_reddit/",
        "text": "I’m tired of living this life, I’m by no means suicidal but I need a change, I never would have seen myself going to Reddit for this but nothing seems to work, I’m 14 years old 5’10 and 195 LBS, what can I do to lose weight?\nNobody treats me with respect even though I always put others before myself. This time around I thinks it’s my turn to come first. So tell me Reddit, how can I lose weight, what strategies can I use?\n\nOverall, how can I improve myself",
        "created_utc": 1675303283,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Fitness/Looking Better Changed My Life (&amp; How It Didn't)",
        "author": "lifting_and_coding",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdfp0/how_fitnesslooking_better_changed_my_life_how_it/",
        "text": "[removed]",
        "created_utc": 1675303177,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Fitness/Looking Better Changed My Life (&amp; How It Didn't)",
        "author": "lifting_and_coding",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rddy3/how_fitnesslooking_better_changed_my_life_how_it/",
        "text": "[removed]",
        "created_utc": 1675303047,
        "upvote_ratio": 1.0
    },
    {
        "title": "A loser, in need of a direction.",
        "author": "Devaronio",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rdajt/a_loser_in_need_of_a_direction/",
        "text": "[removed]",
        "created_utc": 1675302799,
        "upvote_ratio": 0.99
    },
    {
        "title": "how do i be normal? i really need advice",
        "author": "AnywhereGreedy1518",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rd5xo/how_do_i_be_normal_i_really_need_advice/",
        "text": "Im an asshole ill admit it i havnt been the nicest person. And i want to change and i thought i did. But recent events made me realize that. It kind of became a habit\n\nIdk how to start. Are there any resources to change me. \n\nI want people to like and respect me. But there's nothing to really respect about me.",
        "created_utc": 1675302458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why cant i stick to good habits?",
        "author": "Accomplished-Mood661",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rd1e6/why_cant_i_stick_to_good_habits/",
        "text": "Every time i start doing good things consistently; meditating, gym, studying after class, staying off tiktok, not overloading on bad food, putting exczema cream on, going to sleep at good time. ect it always seems to just fall off as soon as i start getting into the habit. I feel like some of it like reinstalling tik tok is down to the fact that my gf and friends will send me stuff and i try to justify destroying my attention span due to that. I have no excuse for the gym as it is literally right next to me but lately class is draining me (making my physically and psychologically tired) even if its stuff im interested in doing stuff like working in the lab or particularly difficult classes just seems to kinda kill my motivation although I have been going to almost all my classes. I am however, in the habit of eating fruit &amp; cooking for myself. I also manage to get up on time which is good. Fyi M 19, 20 in a month, marine bio student, relationship with gf very happy, had diagnosed depression &amp; anxiety earlier in life and I dont really know if I still have it, I know at some point it did go away for a while and i was really happy but ever since i had to leave my friends i’ve not been as happy, i still see them and my family though. I live near a library and gym is right next to me",
        "created_utc": 1675302128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on reconnecting with potential friends/strangers",
        "author": "sk8t0rdie",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rcsgz/advice_on_reconnecting_with_potential/",
        "text": "/\n\n\nTW: MENTION OF SUICIDAL IDEATION, DEPRESSION, SEXUAL HARRASSMENT/STALKING, GRIEF/DEATH:  23/F : Hi, I quit my job 9 months ago but took fondly to one of my regulars and his wife to the point where I got his number. I enjoyed talking to them both and wanted to even ask them to hang out. I want to learn more about them. We have a lot of shared interests including anime n cars. Long story short I was going thru a lot at the time to the point where I stopped texting them. including losing my job, becoming homeless for 2 months, my grandpa dying and being sexually harassed/stalked. I suffer from depression and suicidal ideation, and the past 6 months those situations triggered it so bad. I feel really embarrassed because not only did I not communicate with them but it’s been 6 months since. I really want to reconnect with them and get to know them because I want to be their friend! They seem like really cool people, but I’m so scared. What do I even say? How do I even explain this year? How do I even explain myself? I’m so ashamed and embarrassed. In my previous friendships, I was always going thru things to the point where someone I cared about said “I’m too much” and they left me. I don’t want to scare these folks away. I want to be better. But I also want support and genuine connection. They’re good people I can feel it. Please help? Should I just leave them as strangers or reconnect after 6 months unwillingly ghosting? EDIT: damn I forgot I also got into a car accident in November 😭\nEDIT: I am currently in therapy and I am on my first week of antidepressants!",
        "created_utc": 1675301483,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I stop being so negative towards other?",
        "author": "unwillingone1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rcqu3/how_can_i_stop_being_so_negative_towards_other/",
        "text": "I am in this crazy place where I am so negative and judgmental of others it’s actually making me quite depressed. Every YouTube video I watch I think of some negative way to discredit them or want to post a negative comment. When I see people in real life I immediately think of something to make fun of them or judge them. I hate that I do this. \n\nAnd the thing that scares me the most is I feel I am so deep in this way of thinking. I don’t know how I’ll ever be able to get out. I have this deep underlying ego (I guess that’s what you would call it) where I am just stuck in my ways of thinking I feel if I change it would all be an act. \n\nThe weird thing is I am not mean to people in real life. And I never really met anyone I really dislike after getting to know them. But I have this immediate response of judging people and thinking badly about them right off the bat. \n\nWith that comes with anger, I had to get off social media bc I would be spreading hate and spending too much very unproductive time on it. I’m angry at so much in the world. I have a hard time accepting laziness in people, people who don’t care, people who don’t listen. I get very anger over it. I cannot stand any of this by myself. \n\nI want to be positive. I want to not judge people but this underlying voice in my head says “that’s corny” or an act. \n\nHow in the world can I fix this?? Is it possible?",
        "created_utc": 1675301376,
        "upvote_ratio": 1.0
    },
    {
        "title": "new discord i made for self improvement",
        "author": "SnooPeripherals3825",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rchs5/new_discord_i_made_for_self_improvement/",
        "text": "[removed]",
        "created_utc": 1675300720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does having low self esteem make you slow?",
        "author": "Disastrous-Minute535",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rc464/does_having_low_self_esteem_make_you_slow/",
        "text": "Growing up I suffered severe low self esteem and i couldn’t concentrate or even do basic things that require none other than common sense. Now that I feel more confident I feel I’m able to think better and make more effective decisions and feel cognitively different. Is there a science to this or does suffering from severe low self esteem affect people differently?",
        "created_utc": 1675299771,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are tools and ways to grow as a person overall I’m the next six months? How to develop discipline?",
        "author": "Humble-Effort216",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rbfaf/what_are_tools_and_ways_to_grow_as_a_person/",
        "text": "I am a lazy person, I’m home from college after choosing to come home (I did not like the college I went to) but I enjoyed getting an education.\nI am not sure what my major would be, but I plan going back full time next fall.\n\nWhat can I do these next six months that would be good?",
        "created_utc": 1675298025,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've started working in a new field job and I feel overwhelmed",
        "author": "Cuddly_wuddlysnuggly",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rarx2/ive_started_working_in_a_new_field_job_and_i_feel/",
        "text": "Hi everyone I'm new here and as the tittle may suggest lately I've started working in a new job . I've majored for finance but the field that I'm working in it's totally different from what I used to work and right now I'm doing a two week training to learn how things function and how they operate \n\nAlthough I've gotten the hang of it slowly sometimes I tend to forgot how something it's done or if I haven't noted something since I get to much info at the same time and barely get time to practice it . It's been a bit overwhelming and I don't know if someone would give me an advice on what to do to improve and learn faster I guess",
        "created_utc": 1675296451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Warrior Brain 🧠 very useful ebook",
        "author": "Majestic-Word-7470",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10rakvc/warrior_brain_very_useful_ebook/",
        "text": "[removed]",
        "created_utc": 1675295987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking For Advice From Anyone Over 30",
        "author": "alanthemartyr",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10racl1/asking_for_advice_from_anyone_over_30/",
        "text": "I’m a 22 year old man and I’ve been focused on personal development since I was 16. I thank god that I have been focused on it and I find that it’s been extremely illuminating for me in terms of catching my own rationalizations. As in, as I introspect over my short life thus far, I already see areas in my life where I was rationalizing taking the path of least resistance and how that has made my life harder now. My question for anyone 30 and up would be :\nWhat do you regret about your 20s? If you could tell your younger self something that you think would have made your life easier, what would it be? What do you think I ought to take advantage of or realizing sooner rather than later?",
        "created_utc": 1675295414,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get rid of these unwanted feelings?",
        "author": "Dull_Employment_5251",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ra89j/how_to_get_rid_of_these_unwanted_feelings/",
        "text": "How to be able to get rid of these unwanted feelings?\n\nHi all. I decided that I need a better life for myself. I've been living with a boyfriend that honestly wasn't the best for me, and I was with him for three years. I finally decided to move out on my own and get better. Although now there is this huge emptiness that I feel that feels very uncomfortable, kind of maybe like being lonely? I don't have a lot of people to support me in my life. I only have my aunts family and my cousin to talk to. I kinda struggle making friends and I feel like I've went without a deep connection, like a best friend, for a pretty long time. Now that I'm away from this guy, he was the main person I was close to and I feel super empty. Like hollow? I long to be able to talk to people in personal ways but I cannot. It even hits me in social places, like when I'm at work, or volunteering. The worst times are at night, and I really struggle to sleep because of how uncomfortable I feel. I know this isn't a healthy feeling, and I could really appreciate some advice. Thank you so much!",
        "created_utc": 1675295115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having Trouble Meeting New People",
        "author": "thisaalt69",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ra5sm/having_trouble_meeting_new_people/",
        "text": "I keep trying to find new people to meet. Recently I’ve been going to the gym but I’d rather focus on my goal there. I just don’t know what to do anymore. I’m almost 23, school was 10000x easier because new people are almost forced into your face every day. I don’t know where to go what to do how to meet new girls other than adding them on Facebook and trying to strike a conversation. Any advice would be helpful. Just starting to get really lonely :/",
        "created_utc": 1675294942,
        "upvote_ratio": 1.0
    },
    {
        "title": "After 5 classes back to back I’ll be going to the gym for cardio",
        "author": "gossipgirl999",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r9uj3/after_5_classes_back_to_back_ill_be_going_to_the/",
        "text": "Going through a breakup sucks. Been trying to focus on school and not the past. Wound is still fresh :/ praying things get better. I just finished class after a long day. Took some pre workout, now I’ll be going to do 30 mins of cardio.",
        "created_utc": 1675294162,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 17 and failed school what now?",
        "author": "ionevenknowlmao",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r9nly/im_17_and_failed_school_what_now/",
        "text": "As the tittle says I’m 17 and I’ve basically failed school, and now I’m incredibly stressed out that I won’t have a good future. I’m not really sure what my question is but any advice on what to do?",
        "created_utc": 1675293685,
        "upvote_ratio": 1.0
    },
    {
        "title": "im going cold turkey tomorrow",
        "author": "Separate-Bowl4668",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r9n3h/im_going_cold_turkey_tomorrow/",
        "text": "No more smartphones, no more junk food, no more cigarettes, no more fapping... its about time. These things, especially the smartphone and gaming seriously fucked up my life. Its time to make it end to it. I spent 14 hours a day on my phone/laptop/ps4 these last 5 years. I dont even like it anymore. Im done, i cant keep living like this. I see extreme physical changes in my self. My eyes hang low and look dead, my physique looks horrible and im skinny fat, i get serious withdrawal symptoms when im not on my phone for an hour. This is the only way. Im gonna struggle so hard but i hope one day i can be happy with myself. I really hope.",
        "created_utc": 1675293652,
        "upvote_ratio": 1.0
    },
    {
        "title": "My little brother is addicted to technology and I don’t know how to help",
        "author": "Tucker_Herring",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r921y/my_little_brother_is_addicted_to_technology_and_i/",
        "text": "My little brother spends about 9 hours a day on his iPad.  It’s gotten to the point where when my family eats dinner he has to watch a video or play a game. He’s also became very overweight since he got his iPad in October, he went from about 70 pounds to over 110. The worst part is any time I try to tell him to go outside or put his iPad down my parents yell at me for “bullying him”. They told me I can’t help him lose weight, and any time I offer to take him to gym with me or bike through the neighborhood my parents yell at me for being “fat phobic”. They also say “just because I’m in  shape doesn’t mean you get to control him” when that’s not at all what I’m trying to do. I have no idea how to help him especially with my parents the way they are, and was wondering if any of y’all could maybe help me",
        "created_utc": 1675292274,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Probiotic supplements actually work?",
        "author": "jtsully",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r8th3/what_probiotic_supplements_actually_work/",
        "text": "I’ve heard about the benefits of L-ruteri and want to make it a part of my daily diet, but very few foods contain it. The only food that contains it that I actually have access to is kefir, and even then I don’t know how much daily consumption really makes a difference. I know people like to call supplement companies evil, but I’m a firm believer of combining dieting and supplementation for this reason (I’ve had a similar problem with substances like Epicatechin, the only way to get a dosage that’s actually effective outside of supplementation is consuming a quarter pound of dark coco powder, which is just ridiculous and counter intuitive. Besides, most the brands I get my supplements from are trustworthy, I’ve seen a noticeable difference in both my health and physical performance). Probiotics however are a bit more tricky than regular supplements because you need living bacteria for it to actually be effective, which is something a lot of companies are ignorant to, so at best you’re just wasting your money while at worst you’re hindering your health and not improving it. Does anybody know any trustworthy brands/companies that sell probiotic products that actually work?",
        "created_utc": 1675291683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asked a girl for her number for the first time",
        "author": "Huskyy23",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r896q/asked_a_girl_for_her_number_for_the_first_time/",
        "text": "I’m 20M and this was my first time asking a girl for her number. Unfortunately she has a boyfriend, but this is a big step on my path to feeling self worth or something I guess\n\nI’ve been on a huge self improvement journey, quitting porn, going to the gym, studying more, etc so I’m happy that I actually managed to muster up the courage to ask\n\nIt did take me like 30 min of just sitting waiting nervously to ask, but at least I did it, but fuck that was stressful lol\n\nShe said she could give me her number as a friend but I said no and that I’d only be interested romantically, so that’s how the interaction ended …",
        "created_utc": 1675290356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Hamza's new video?",
        "author": "DatIrishBloke",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r81f1/thoughts_on_hamzas_new_video/",
        "text": "I listen to Hamza a lot. I presume a lot of you have seen his newest video. I think he has a massive influence on young teen males so I think he will be missed, thoughts?",
        "created_utc": 1675289868,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you go about getting a mentor",
        "author": "aWonderfulLi_e",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r819c/how_do_you_go_about_getting_a_mentor/",
        "text": "Legit question. How do you ask someone to mentor you? Is it just an undefined relationship, or do you have to ask them to be our mentor. For example, I really look up to someone, but don't know them well. How do I establish that mentor/mentee relationship?",
        "created_utc": 1675289859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going through a breakup. Was a selfish lover. I want to do better",
        "author": "Extra-Diet-2800",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r810p/going_through_a_breakup_was_a_selfish_lover_i/",
        "text": "So I recently just went through a breakup. Sucks but I’m taking it rather well it probably wasn’t gonna work in the long term issues on both hands but the main reason was for my selfishness and insecurity. And I really was trying to be a better partner and fix this issue for us but i guess Friday was the final nail in the coffin. We would argue a lot but I end up apologizing for my behavior and admit I’m in the wrong.  I want to do better as a person so for the next relationship I get into (not trying to get into another relationship) been hitting the gym more as a start",
        "created_utc": 1675289843,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I stop becoming needy over a girl I like",
        "author": "eap332",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r7z11/how_do_i_stop_becoming_needy_over_a_girl_i_like/",
        "text": "I keep think about this girl that I like whenever I go to the gym I think about her when I do my school work I always think about her. I genuinely don't know why I talked to her on some accessions flirted with her in class time and be a little physical with her to time to time but then when I end a conversation with her to do something  I just crave to speak to her more.\n\n  When i see her talk to her friend group and some guys joke around with her and be a little physical with her my heart jumps and i just want to do something. I know this isn't healthy and it doesn't help the fact that i dreamed about her last night being in a relationship.",
        "created_utc": 1675289717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fixed vs Growth Mindset 15 Key Differences You Need to Know",
        "author": "GeneralKnows",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r79mx/fixed_vs_growth_mindset_15_key_differences_you/",
        "text": "[removed]",
        "created_utc": 1675288099,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to deal with extremely toxic \"must win Asian parents\"?",
        "author": "One_Button4120",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r6pd9/how_to_deal_with_extremely_toxic_must_win_asian/",
        "text": "I grew up in Asian family, (Japanese Korean), where winning is everything. All my parents cared about is winning, winning is all they cared about for me. Even though all they cared about is winning is for me- they didn't care about winning themselves. All they wanted to make sure was I would win. Let it be in sports, music, academics and in life. Because of this, I have had to go to therapy to get help and mental health counselling. While putting all this pressure on me to succeed and win at all cost, at 18- my parents never financially supported me to do what they wanted me to do. (they wanted me to be doctors or make get an extremely high paying job);  \n\n\nim 26 now and have suffered years of psychological punishment from my parents because of the pressure they put on me; ensuring that winning is all that mattered. and to win at all costs. now that I look at it- it has caused me massive mental health issues- not only this; as much my parents preach about me winning, they dont care about winning- they have ivy league degrees and decide not to work; but work as janitors and nurses assistant; because they couldn't get assed getting a real job- and dump all the pressure on me- without financially supporting when I was 18. When I ask them for money to support me; they would get angry and call me \"narcissisitc\"  \n\n\nThe fustration that I have is, I have parents who mean well; who want me to succeed, but as much they preach things on day to day basis; such as being a \"good son\" - or \"winning at all costs\"- none of that applies to their lives as the hypocrites that they are, this has affected my mental health alot because of their oblivion and lack of understanding of my circumstances- and their only care is about \"winning, status and money\"- something they lack themselves because of the choices they make.  \n\n\nMany people argue that they focused on \"family\" but- they failed to work on themselves; and still hold minimal wage jobs going overseas- they decided to go overseas to hold a minimum wage job;- since 18; they have never called me once in my life- and if they I try talk about problems that I have; They start getting extremely angry if I talk about my problems. For example if I told my parents that I was depressed; my mom would criticize me and get angry about me being depressed like WTF. \n\nTo sum it up, I felt like Ive been dealt a shitty hand in life, my parents disowned me when I was 18, I had to live on my own in a foreign country called Australia\" and had to fend for myself, and SECOND the \"WINNING AT ALL COST mentality, has caused me extreme mental health issues because of the pressure that it puts on the person. I would not call myself MENTALLY fragile by any means; infact mentally strong; and this has caused alot of issues for me.",
        "created_utc": 1675286810,
        "upvote_ratio": 1.0
    },
    {
        "title": "fhrbgngn",
        "author": "Opposite-Street-623",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r6fwd/fhrbgngn/",
        "text": "Life is tiring me I lost the fun aspect of bettering myself so i’ll have a future thats any good.\n\nI have bettered myself, been going to the gym consistently for atleast 10 months and I decided to stop fapping. I am on a month long streak right now.\n\nProblem is I have trouble with getting school work done because it bores the hell out of me. Why wasn’t I born in greek and raised like a philosopher that atleast seems fun or maybe it isn’t fun but atleast the information has value compared to the current school system.\n\nshit bores me\n\nI am consistently improving in all areas, physically mentally and socially and I smile on almost every day but at the end of the day I feel stuck. Stuck in my room, with leftover work to do and many assignments wich will hount me until the deadline.\n\nSchool isn’t really a problem though because I get good enough grades to pass but it takes so much time. I cant get into a good daily-routine because theres 8 HOUR SCHOOL BLOCK IN THE MIDDLE. Waste of time it annoys me, not being able to plan around it\n\nIts weird how much you plateau on your journey. I dont know what to do.",
        "created_utc": 1675286213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for confusing friendships?",
        "author": "geumkoi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r68n2/advice_for_confusing_friendships/",
        "text": "Very long post ahead!\n\nI'm 24F college student having some trouble with my friendships lately... I have ADHD so, bear in mind that being neurodivergent affects my connections daily. \n\nOk, so, here's the issue. Three years ago I began my major in Philosophy. I have a history of social anxiety and depression, so I didn't have much friends before college. I had 2 friends, in fact. One of them moved out of the country and the other ended on bad terms with me (this happened when I was already in college) for various reasons. I tried to save the relationship but she didn't want to, so, I grieved and let go of her. \n\nNow, my class doesn't have a lot of students. Most of them are males. In the beggining we were just 6 girls, and I have never been one to speak to people first, so I just didn't hang out with them because they didn't ask me to. Four of them formed a group and hung together, another hung out with a group of boys, and I was mostly alone getting close to another group of boys. So, this was during first semester. I was excited to hang around people with my interests with whom I could have conversations and stuff, even though my social anxiety made me insecure and shy. During the second semester, the girl that hung with another group of boys (I'll her C) and I became really good friends. One of the girls from the girl group dropped out, and another ended up drifting from the friendship, so only 2 girls remained (I'll call them A and B, have them in mind because this is about them).  \n\nSo, C and I had many things in common. She was pretty chill and I was very excited about our friendship because we could potentially become best friends (I've always wanted one....). Sadly, the pandemic affected our friendship. We became distant, she struggled to reach out, dropped out of school. She's in another college now, and she seems very happy with the new group of friends she has, which makes me really glad. I tried to rescue our friendship but, I don't feel like she's ready to come back to it... \n\nAnyway. When C dropped out of school, and some things happened with the boys (a lot of miscommunication and prejudices tbh) I ended up friendless again. However, I took the courage to speak to A and B and sit beside them. We became... friends, I guess? \n\nAgain, I was hopeful because I had found myself two more friends with whom I could hang out. It's hard for me to open up with people, I admit this. At first we connected through certain interests. And they reached out to me when I could help them, which I took as a good sign. They told me their problems and I'd offer advice. And I felt like things were going right because we started hanging out of school (mostly just clubbing... which I don't love doing, but for our friendship, I did). \n\nSo, here's the thing about these two. They thrive in gossip. I have never liked gossip. I just don't have anything to say about people. Like... people are just people to me. Their lives are none of my business and I'm no one to judge them morally. And the truth is, it really bores me speaking about other people. I zoom off during conversation and just mask because I don't wanna be mean (it's kinda something I can't control). But, anyway, in the beginning I beared with it because my mom's very gossipy too, so I'm used to that. \n\nBut then I began finding patterns. B would behave a certain way when I was alone with her, than when we were with A, and when we were with the rest of the group. You know how boys can be very teasing at times. The group in my class enjoys roasting one another. Sometimes I'd be occasional victim and laugh it off. But B started kinda taking her roasts seriously. Her remarks would become more aggressive, more meaning. At one point we fought over it, she was being extra sarcastic and passive aggressive, so I cut her off. Like legit just cut her off. \n\nA talked shit about B with me. But she didn't defend me or anything. In fact, in class she still hung out with B over me. Even when she agreed that B had been mean to me. \n\nNow A has a lot of problems. And conversation is always about her and her problems. Like she never asks about me. I share things with her to create empathy, and she knows things about me because I share them, not because she asks. Whenever I share something, however, she drifts off, something interrupts me, she changes the conversation. Like, she's very self-centered. And as I said, her life is absolute chaos but I cannot feel bad for her. I just cannot. I know the lives of her friends even tho I haven't met them, I know stuff about her mom that I probably shouldn't know, I know about her boyfriend, she just tells me everything! And like I don't think she's lying. She might be exaggerating sometimes, but not lying. And she also has this kind of cocky attitude, you know? Like she can be very nice, but something about her confuses me a lot. Because I don't know if that niceness is genuine or she's faking it. Do I explain myself? \n\nShe told me about the messages B sent her when we fought during winter break. And I guess she told B about me too, because, if she trash talks people with me, she definitely talk trashes me with people. Anyway, we came back to school and I noticed a change in B's behavior. She's a lot friendlier to me now, even though we haven't talked about what happened. I learned that A will always choose B over me, and I'm fine with that (in the end, they were friends before they were friends with me) but I find it suspicious. I don't know if B really wants to be my friend anymore and if I should go ahead and clarify what happened before, try to rescue the friendship. I don't know if I should talk to A about how confusing her friendship is to me. \n\nAnother thing I should note is that the first time I hung out with A outside of college to a place that wasn't a nightclub was during this winter. It happened once and our date was ruined by her problems (she did apologize, though, but that time she was taking all her frustration on me, and I even cried that night). I used to suggest cute dates with her like picnics or going to art galleries, or watching a movie, etc. They never put the effort to hang out with me if it wasn't clubbing. \n\nToday I'm keeping my distance more. Still, their dynamic makes me very confused. \n\nShould I trust them? Should I have a conversation with them? Or should I just play along, graduate, and disappear?",
        "created_utc": 1675285750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Les Brown | \"YOUR DREAMS WILL BECOME TRUE\" | Motivational Video",
        "author": "motivatcog",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r5tl1/les_brown_your_dreams_will_become_true/",
        "text": "[removed]",
        "created_utc": 1675284777,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop wasting my life dwelling on the past when I feel like I can’t change the present because of it?",
        "author": "treesareteal",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r5nf9/how_do_i_stop_wasting_my_life_dwelling_on_the/",
        "text": "I 22F feel like a complete failure in my life. I want nothing more to improve my mental health and move on from my past, but I have no idea where to even start. \n\nTo start off, I have had social anxiety my entire life. Bad friends and trauma from my childhood crippled my self esteem and I was never able to make any lasting friendships. On top of that, I always struggled in school and felt shame for doing so poorly.\n\nFast forward to freshman year of high school. My mental health was horrible and so were my grades, so I just gave up and dropped out. After hopping between part time jobs until that age of 18, I realized I need to get a real job at some point and got my GED so I could go to community college.\n\nI went to community college for a year and then dropped out because I was a failure there, too. At this point I was 21, still living with my parents, high school and college dropout, horrible mental health and self esteem, wondering why I’ve always failed in life.\n\nJust a month ago, I was diagnosed with ADHD. It seems like everything makes sense now and I am so thankful for my diagnosis shedding light on many things in my past, but I still can’t bring myself to improve or move on with my life. I feel like I’ve failed so much up until this point because of ADHD, mental health and other things.\n\nI’m afraid that if I try I’ll keep failing or won’t improve. How do I get out of this mindset? Where do I start? I’m afraid I’ll never had a good career or friends. I’m afraid my life is going to be boring and worthless. I feel kind of pathetic saying these things, but in many ways I think I am “behind” in life.\n\nTL;DR:\n\n I’ve had social anxiety my whole life, have no friends, dropped out of high school and college. Diagnosed with ADHD a month ago. I feel like I can’t let go of the past and I’m afraid I’ll never progress in life. How do I let go of this mindset and start improving?",
        "created_utc": 1675284390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with self improvement&gt;self acceptance",
        "author": "Tae1072",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r5j9w/help_with_self_improvementself_acceptance/",
        "text": "Pretty much accepted and decently happy living with mom watching movies/playing games eating junk all day doin fuk all. Blaming it on not knowing the language where I live cuz I just moved from dad to mom(divorced) on other side o the world. Been near 6months Id like a job but can’t, like a hobby to pursue but kinda left it. I need the language but can’t seem to care to learn or even remember vocab. I obviously understand it’s gonna bite me in the ass later if I can’t figure something out soon (move back or try it out here).. anyways the question is how do I stop accepting who I am and actually improve something",
        "created_utc": 1675284125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting from rock bottom. Any advice?",
        "author": "Equivalent-Big-8241",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r5iaq/starting_from_rock_bottom_any_advice/",
        "text": "I’m 24. I got really depressed after a really hard breakup a couple of years ago. It was the most in love I’ve ever been so it was rough on me. After that basically every problem I had been previously ignoring came to the surface. I got really overwhelmed with it all and as a result I haven’t made much progress the last couple years. Basically was just trying to get through the day. I’ve been in therapy and I started meds back in October but now I feel like I’m basically starting from nothing. I want to build a different life than the one I had before. I want to strive to build healthy romantic relationships and friendships, I want to have more courage to take action towards things that I want in life. Problem is I have ptsd, depression, and anxiety. I don’t have much left over in the tank every day. But I need to change because I’m tired of being miserable. I want to change nearly every aspect of my life but I know it’s not feasible all at once and will take time. So how do I 1:find the energy/determination to take this on and 2:where do you start when you want everything to change?",
        "created_utc": 1675284063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life changes to live more mindfully and slowly",
        "author": "JohnMalta",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r592h/life_changes_to_live_more_mindfully_and_slowly/",
        "text": "Around nine months ago, I realized I couldn't live the life I used to; a hectic life with constantly being in a rush, trying to overdeliver (both in my personal life and career), and living on auto-pilot.\n\nFrankly, I had some minor health problems at that time caused by stress, which also strengthened my decision to change my life. Now, my goal is to live a mindful, slow life, enjoy every day and spend my time meaningfully.\n\nSince then, I have adopted many changes, and I will share them and briefly describe them, but I am happy to elaborate on anything if you are interested.\n\nI would like to hear what hack you have incorporated into your lifestyle, small or bold, to live more mindfully and at a slower pace.\n\nI have been greatly influenced by some people and authors, such as Leo Babauta of Zen Habits and Cal Newport (author and scientist).\n\nFinally, before I share my list, I know not everything applies to everybody, so please don't hate. Let's try to help each other live our best life!  \n\nSo, what I incorporated into my life:\n\n1. Since I freelance, I decreased the number of jobs by more than 50%, so I don't work more than 4 hours daily. Most people probably cannot do this step, but my job and qualifications let me do that (I am in the IT industry).\n2. I deactivated my Instagram and Facebook profiles and try to spend as little time on mobile and desktop as possible. I still use Reddit and my emails, of course, but I check these much less often.\n3. Started listening to slower, relaxing music. Classical music, jazz, blues, and instrumental music did wonders for me.\n4. No distractions while eating. I eat almost exclusively at home, the food I cook, warm food, and eat it at the dining table, with good music in the background (any music you enjoy is good). No phone, podcasts, TV, newspaper, etc. \n5. Chewing and eating slower. I try to chew at least 20 times, and eating each meal takes at least 20 minutes. \n6. No TV or reading the news (except business news, but no politics and daily staff). I read a book for 45-60 mins every day.\n7. I meditate twice a day.\n8. I started writing a journal with self-reflections and thoughts almost every day.\n\nI hope this is an inspiration for some of you; now I would like to hear from you guys and gals! Looking forward to a great discussion here.",
        "created_utc": 1675283474,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I get better at keeping up with personal hygiene",
        "author": "R-prince",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r565b/how_can_i_get_better_at_keeping_up_with_personal/",
        "text": "If i'm gonna be depressed I atleast want to be clean and depressed. Ive gotten better with cleaning my room but I still struggle with showering and brushing everyday. Any tips or advice?",
        "created_utc": 1675283291,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get through an idle period of my life?",
        "author": "Still_Combination632",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r4rvj/how_to_get_through_an_idle_period_of_my_life/",
        "text": "I graduated from my MA back in October and have spent some time to hang out with friends, go on vacation, etc. I have also sent applications for jobs that I’ve either not heard back from, or are still being processed (government jobs).. Due to my unemployment, I haven’t spent too much time with friends outside. I’m waiting for work, don’t have a crush or relationship, and I find myself wasting my days on my cellphone. I’ve also always been used to being occupied or accomplishing something, but being away from school and work has put me in such a rut!\n\nThank you 🙏",
        "created_utc": 1675282391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding anxiety",
        "author": "InterestingTailor10",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r4lla/question_regarding_anxiety/",
        "text": "I have an exam coming up and I have prepared quite well. I tend to overthink and mess up .Is there any practical way to overcome this fear ? The last time I had a big exam I  screwed it up .I started to sweat profusely ,I experienced a bit of shortness of breadth ,I started to think what would happen to my future if i screw this exam .\n\nAny tips are welcome.",
        "created_utc": 1675281997,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my first friend in the gym",
        "author": "onlyiknowthisascount",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r4e4u/i_made_my_first_friend_in_the_gym/",
        "text": "Today as I was trying to do an exercise, a big guy came up to me and corrected my technique. \n\nWe started talking for a few minutes and then we kept doing our programs. It wasn't a long or memorable interaction, but it felt really good talking to someone else on the gym. \n\nI know it may not sound like a lot, but I felt really good.",
        "created_utc": 1675281558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing excites me. What do I do?",
        "author": "Ameanole_Acid",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r4359/nothing_excites_me_what_do_i_do/",
        "text": "I don’t get excited to do anything anymore. It’s tough to get out of bed in the morning. I have no passions. What can I do to fix this?",
        "created_utc": 1675280852,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when you're low on energy?",
        "author": "The_Pick_of_Destiny_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r3u5d/what_do_you_do_when_youre_low_on_energy/",
        "text": "What activities do you do when you're low on energy that keep you on the road of self improvement? At the end of a long day, the urge to just curl up and watch TV is strong, I don't feel like focussing on learning new skills or concentrating hard, what are your hacks?",
        "created_utc": 1675280261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im insecure about my height",
        "author": "saintmaximin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r3r6d/im_insecure_about_my_height/",
        "text": "So i know height is something you can’t control but thats what annoys me its like i have been cursed for the rest of my life being 5ft6 and this wont just hurt me in dating but it would also hurt me in many other things and it already killed a dream for me i always wanted to be a professional soccer/football goalkeeper",
        "created_utc": 1675280073,
        "upvote_ratio": 1.0
    },
    {
        "title": "“This is part of the process. This is part of the journey versus just saying like I’m used to I’m just not good enough. We always say that shit, I’m just not good enough and we try something else. I’m gonna fucking make myself good enough. That became my mentality-",
        "author": "despressoexpresoo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r2g5s/this_is_part_of_the_process_this_is_part_of_the/",
        "text": "I had to invent a guy that didn’t exist.” - David Goggins",
        "created_utc": 1675277095,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one write and maintain a journal?",
        "author": "82Parzival",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r2fnh/how_does_one_write_and_maintain_a_journal/",
        "text": "I'm hoping to begin with this habit of journal writing but I don't know how to start. Any suggestions on what should i write about? Should it be my day, or my todo list or my mini goals? Or anything else?",
        "created_utc": 1675277061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why and how do I get better at understanding others?",
        "author": "milk_cloud",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r1c9b/why_and_how_do_i_get_better_at_understanding/",
        "text": "After finding my first close group of friends, I realized we all had different interests, including me.\n\nI mostly had friends who were only 'until the classroom'  because I never took the initiative to talk to them or invite them to the school canteen  during break time. \n\nWhen pandemic hit, I finally learned that I had to have someone to talk to or else I'd go insane, so I did find someone.  Only one though. We were sort of the same, hardships and familial issues. We vented and all that, but she wanted to stop talking for a while, because to her, I felt like a tiny piece of rubble who would vent to her about things when she already had enough to think about. \n\nShe timed this when I was at my point of change where I finally escaped a situation that plagued my entire life up until 6 months ago. \n\nPersonally, I've seen and compared who I was these past 6 months, from a year ago. I've grown to care more about studying, and where the money my mom works for goes to, for the sake of me, to go to school. I've taken up journaling as a hobby, and even sports. Now, I am happy to be so free to finally see that there is a world beyond a singular room. \n\n\nMy social skills were a drag though, I didn't know what to respond with, or control my words. I am straight to the point and I barely have filter when I talk to my friends. I take initiative for group calls and suggest places we can hang out in, I think about the pros and cons should we go anywhere but the classroom. I don't want to be seen as too commanding, so I wait if they would agree with me.\n\nI was observant, I like to judge people based on their habits and what I can eavesdrop on about, and make a tiny little assumption that these people are a no no. However, I'm completely clueless about trends that aren't about fashion.\n\nDon't get me wrong, I genuinely like today's fashion execpt those really revealing women's tops that are basically a bra paired with long sleeves and others that are similiar, but my thighs and bottom ruin every outfit I wear. \n\nThough main topic is basically asking advice to better understand people and their interests. Like K-POP or getting into the 'school crushes' trend.\n\nI attend an all-girls school and there's been a rise of fellow high-schoolers going for a boy cut and 3 of my friends just suddenly exclaim \"oh she's so pretty, shes my new crush!\" Randomly at a passing student, and think that yes, they're pretty and look good but that is IT. I also make myself known to everyone that I don't have any crushes, even celebrity crushes.  We're 5 in the group, and even though the 5th friend had a crush, she actually talks to that person frequently and even plays Valorant with her. I totally respect that.  \n\nNext, is K-POP. \n\nMy 2nd friend likes a group called SEVENTEEN and is very enthusiastic about collecting merchandise, specifically photocards. I make little contradictions that she should try to be satisifed with just consuming their online content and only buy what she REALLY wanted, but she insists that she can always sell these later. Which she does, and I see that she knows how to let go. I tried to also get into the 'Photocard Collecting' world, but I didn't last a week in it. Much less memorizing the all of the SEVENTEEN members. I bought photocards from her twice amounting to PHP 450, ( about 8 dollars in USD) but I don't even take it out of the envelope the cards came in. So I stopped. \n\n\nThen I stumbled upon albums. I love the entire SECTOR 17 album, which I repeat almost everyday. It felt good that I spent money on something I could use and blast in our disc player. It also felt good that the album costed me about PHP 100 (2 US Dollars) because it wasn't really in demand and the seller had removed some inclusions but all I really cared about was the CD.\n\nI tried to get into both K-POP and school crushes by showing interest in buy cheap merchandise and agreeing that this (person) is pretty when they start to discuss about crushes when I usually have nothing to say. \n\nIt did not work, but I felt like I had something to talk about with people so I just limit myself to at least open social media once everyday to see what everyone's up to.\n\n\nI want to stop seeming like I want them to change their interests and hobbies for me, and that they're good friends the way they are.\n\nPlease leave some comments or advice. :)",
        "created_utc": 1675274585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement book for kids!",
        "author": "TommyWantsToWin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r19sa/self_improvement_book_for_kids/",
        "text": "**Tommy Wants To Win** is a super fun book for Children's picture book that encourages kids to chase after their dreams in life! The book follows a Tiger named Tommy as he tries to win a big race at his school. available now on amazon just search \"Tommy Wants To Win\" AND ITS FREE with kindle unlimited.",
        "created_utc": 1675274431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement book for kids!",
        "author": "TommyWantsToWin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r189q/self_improvement_book_for_kids/",
        "text": "[removed]",
        "created_utc": 1675274357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing goes as expected or planned in my life. absolutely nothing",
        "author": "Soft-Willing",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r0x5n/nothing_goes_as_expected_or_planned_in_my_life/",
        "text": "\nNot a minimum of what I plan, I keep sabotaging myself, I don t know what I am doing wrong. And ok, I could accept that nothing goes as planned if it would  happen from the outside, but I am the problem for this. If I know that the problem of things not happening as I wish is because of me and because of my old habits and stress breakdowns, I am very critical with myself.\n\nWhat to do to overcome this? I have in my head some plans I am attached to, like a mental ocd... With deadlines and so on.. I am fixated with progress and development with my work and I don t know how to react when I ruin things.. And the fact that I am stressing very much with my work (I make music and with creation is difficult) brings me burnout and then I am upset that because of my attitude and character I am behind and not accomplishing things I want..",
        "created_utc": 1675273616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happiness &gt; wealth in college?",
        "author": "edugorl",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r0ksh/happiness_wealth_in_college/",
        "text": "Hey guys, I'm about a year from graduating and I wanted to ask a question. I'm in college, and live at home so I commute and have no debt at the moment. I have a credit card, but always pay it off, never use over $120. \n\nAnyways, I've been taking myself out, enjoying my free time because I rarely have it. (Nothing crazy, just like going on self dates, theme parks, musuems, going out to eat, etc). \n\nI feel like I should have tons saved up even though I only just turned 21. I bring &lt;900 a month (which is enough for me bc I don't have tons of bills and I have to focus on school more) by the end of the month I have like $100-$200.\n\nI guess I'm just asking should I be focusing on enjoying myself, not worrying about having tons saved up, staying out of debt, or should I just focus on saving and being frugal. It's like I wanna enjoy myself while I'm in college but I feel bad for not having tons of money all the time. I put aside money every month but it's not too much. So, I'm not a broke college kid, but I'm not rich nor do I have tons saved up, but no debt either.\n\nI'm just tired of going back and forth between prioritizing money vs my mental health/enjoyment of life.",
        "created_utc": 1675272803,
        "upvote_ratio": 0.99
    },
    {
        "title": "Discovering the Treasures of a Life Unplugged",
        "author": "Viral-conclusionz8",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r0eat/discovering_the_treasures_of_a_life_unplugged/",
        "text": " \n\n### What is the Treasures Beyond Isolation from People and Technology?\n\nTreasures Beyond Isolation from People and Technology is a concept that encourages people to look beyond their current circumstances and explore the world of possibilities. It encourages us to use technology as a tool to explore, create, and connect with others in ways that were not possible before. It also encourages us to look beyond our own isolation and reach out for help when needed. With this approach, we can discover new opportunities for growth, learning, and connection with others.\n\n### The Benefits of Disconnecting from Technology and Reconnecting with Nature\n\nIn today's world, it is increasingly easy to get lost in the digital world and forget about the beauty of nature. We are so used to being surrounded by technology that we have forgotten how important it is to disconnect from it and reconnect with nature.\n\nDisconnecting from technology can be beneficial in many ways, from reducing stress levels to improving physical and mental health. It can also help us appreciate the beauty of nature more and become more mindful of our environment. Taking a break from technology can allow us to focus on our inner selves, reflect on life, and gain clarity about our goals. Reconnecting with nature can lead to a greater appreciation of the outdoors and help us find peace within ourselves.\n\n### Cultivating Healthy Habits to Sustain Your Practice of Unplugging &amp; Recharging\n\nUnplugging and recharging are essential for our mental health and wellbeing. Taking time to disconnect from technology and reconnect with ourselves can help us cultivate healthy habits that will sustain our practice of unplugging and recharging.\n\nBy setting boundaries, being mindful of our energy levels, creating routines, and taking advantage of digital tools, we can create a balanced lifestyle that allows us to take the time we need to unplug and recharge.\n\nPay Attention How to be a good digital citizen and avoid common pitfalls in our electronic-driven societyTechnology is changing the way we live.\n\n### How to Unplug from Technology and Make It Work in Your Favor\n\nIn the digital age, it can be difficult to unplug from technology and make it work in your favor. With the constant bombardment of social media notifications, emails, and other distractions, it's easy to get lost in a never-ending cycle of digital noise. However, with some mindful practices, you can break away from this cycle and take back control of your life. By learning how to unplug from technology and make it work for you instead of against you, you can enjoy more productive days and better quality time with family and friends.\n\n### The importance of being vigilant and mindful about our digital citizenship.\n\nIn the digital age, it is essential to be aware of our digital citizenship and how our online activities can have an impact on other people. We must be vigilant and mindful of our online behaviour and the content we post. Being mindful of our digital citizenship helps us protect ourselves from cyber bullying, identity theft, misuse of personal information, and other potential threats.\n\nIt also allows us to use the internet in a responsible manner that respects others' privacy and security. By being vigilant about our digital citizenship, we can ensure that we are using the internet responsibly and in a way that is beneficial for all members of society.\n\n**Here are some tips to use digital citzenship in your favor**\n\n1) choosing apps that are more open and transparent about their methods.\n\n2) determining whether or not smartphone technology is an addictive distraction for you.\n\n3) setting boundaries for your time online.\n\n4) taking advantage of digital tools to help you be more productive.\n\n### The Impact of Adventure Activities on Mental Health\n\nAdventure activities can have a positive impact on mental health by providing an escape from everyday life and allowing people to explore their creativity. Adventure activities such as rock climbing, kayaking, and hiking can provide the perfect opportunity for people to challenge themselves, build self-confidence, and take risks in a safe environment.\n\nThey also offer physical benefits such as improved cardiovascular health and increased muscle strength. Furthermore, adventure activities can help reduce stress levels, improve focus and concentration skills, boost moods, and even lead to better relationships with others. By engaging in these activities regularly, individuals can enjoy the long-term benefits of improved mental health.\n\n### 5 Ways to Find Joy in Small Moments &amp; Let Go Of the Stressful Digital Lifestyle\n\nIn this digital age, it can be hard to find joy in small moments and let go of the stress that comes with a busy lifestyle. However, it is important to take time to appreciate the little things and make sure that we are taking care of our mental health.\n\n**Here are five simple ways to find joy in small moments and let go of the stressful digital lifestyle:**\n\n1. Take a walk and breathe in the fresh air.\n\n2. Take in the sounds of your favorite birds or animals and let them occupy your thoughts while you take in nature's beauty.\n\n3. Listen to music.\n\n4. Take a meditation break with 10 deep breaths to clear your head and calm your nerves.\n\n5. Smile.\n\n### How to Create a Technology-Free Environment in Your Home\n\nTechnology can be an integral part of our lives, but it can also be a source of distraction and stress. Creating a technology-free environment in your home is a great way to take a break from the constant bombardment of digital information and create an atmosphere that encourages relaxation and productivity.\n\n**Here are some tips In order to create such an environment:**\n\n\\-Set limits on technology use,\n\n\\-Limit access to certain devices,\n\n\\-Create rules for tech-free zones.\n\nWith these tips, you can create the perfect tech-free environment in your home and reclaim your peace of mind.\n\n**Conclusion: In the end, to progress and aim for great heights, it is vital to recognize your basic instincts, understand your natural surroundings and eradicate any limitations that stand in your way.**",
        "created_utc": 1675272372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do to break the fear of the first move?",
        "author": "DatSarage",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r074q/what_do_you_do_to_break_the_fear_of_the_first_move/",
        "text": "Hey everyone. \nI am 18 years old and I have never been in a real relationship. I go to college and everyone is on their phones all of the time and that scares me cause they don’t know who I am and they just don’t want to be bothered. That’s how I see it. I would say am I an attractive perso (face and clothes), but I don’t have confidence in myself cause of my body (going to the gym to fix that) and in talking about who I am as a personI just. The two gf I asked them out on text (less stress) and I knew them from High school, where I was forced to be with them all the time. They said yes but it didn’t come out to anything. It is just that I never had to do the first move totally on my own. What do you guys do to convince yourself to do it and does it go well? Thanks",
        "created_utc": 1675271901,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop worrying about a future that might not happen?",
        "author": "_Ariel23",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r03hj/how_do_i_stop_worrying_about_a_future_that_might/",
        "text": "I have autoimmune arthritis and essential tremors, neither of them severe enough to affect my everyday life. For now at least. I do digital art as a hobby but  whenever I'm painting something I can't help but think about how I might have to give it up in the future. I'm only 21, there's a lot a time for both conditions to progress. I also know that medicine is getting better all the time and my conditions won't affect me as much I think they would, yet I can't keep those intrusive thoughts away. \n\nI just want to enjoy something for one without the fear of losing it. Any tips?",
        "created_utc": 1675271669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any self-improvement books you recommend?",
        "author": "MemeArchive",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10r00gl/any_selfimprovement_books_you_recommend/",
        "text": "Finished reading atomic habits a while back, I’m looking for another book to read. Appreciate any suggestions",
        "created_utc": 1675271475,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I love myself?",
        "author": "aWonderfulLi_e",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzxdm/how_can_i_love_myself/",
        "text": "(Tl;Dr at the end)\n\nI am someone who is very cynical and can be VERY hard on myself, but I want to start practicing self love. After all, how can anyone truly love or want to be around me if I don’t love myself? \n\nI like certain qualities about myself, but I don’t love myself. I have a great work ethic, I try to be kind to people, and I’ve been told that I’m chill. The feeling of not being good enough or the feeling of incompetency often comes up. I have a fear that people fear me, or I’m somehow intimidating. My biggest pet peeve is when people don’t take me seriously or bush me off.\n\nI’m not sure that I will ever truly love myself as a whole because I’m always seeking improvement. I know that I can be better. How can I start to practice loving myself?\n\nI’ve tried affirmations, but at what point am I just lying to myself? \n\nExample: “I am worthy!” Are I?am I really though?? There’s something that I’m lacking that could be better. \n\nThe whole “treat yourself” thing just turns into avoiding any tasks at hand and gives me an excuse to spend money that I don’t have. \n\nMeditation helps, but after a while it just becomes hippy woo-woo bs. I can’t get into that.\n\nI’ve started practicing self care. Things like keeping my room clean (thanks Jordan Peterson), having an end of day reward, and writing a to do list have helped a little. Is self love hedonistic?\n\nIt is very hard for me to accept that someone (including myself) could like me. I’m not sure why, that’s just how it is, and I want to fix that.\n\nTL;DR: How can I, a cynical perfectionist, be less hard on myself and practice self love?",
        "created_utc": 1675271284,
        "upvote_ratio": 1.0
    },
    {
        "title": "What make a good conversationalist and how do you become one?",
        "author": "Acceptable_Regret_97",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzv7y/what_make_a_good_conversationalist_and_how_do_you/",
        "text": "I never know what to say to start a conversation with a stranger.\n\nAnd at time having a conversation I just go blank and don’t know what to say.",
        "created_utc": 1675271143,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the biggest challenge you are facing at the moment?",
        "author": "AnnikaLindholm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzq6k/what_is_the_biggest_challenge_you_are_facing_at/",
        "text": "I think that reading about the things others are struggling with, and how they have stared to solve it, can really help in understanding your own struggles and challenges.\n\nSo my question is: what is the biggest challenge you are facing right now and how are you planning to overcome it?",
        "created_utc": 1675270825,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you struggle with at the moment?",
        "author": "AnnikaLindholm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qznit/what_are_you_struggle_with_at_the_moment/",
        "text": "I think that reading about the things others are struggling with, and how they have stared to solve it, can really help in understanding your own struggles and challenges.\n\nSo my question is: what is the biggest challenge you are facing right now and how are you planning to overcome it?",
        "created_utc": 1675270679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ten Basic Rules for Better Living (1953) by Manly P. Hall",
        "author": "SingleVisit999",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzhcw/ten_basic_rules_for_better_living_1953_by_manly_p/",
        "text": "[removed]",
        "created_utc": 1675270252,
        "upvote_ratio": 1.0
    },
    {
        "title": "One year without self harm!",
        "author": "Skippiozergius",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzdya/one_year_without_self_harm/",
        "text": "I’ve gone one whole year without cutting or purposefully harming myself! I’ve learned enough self control to keep myself from cutting, and I feel I must celebrate. I still pick at my fingers, a bad habit, but I can tell I’m doing better!",
        "created_utc": 1675270031,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i stop stress/anxiety?",
        "author": "iulian212",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qzbtl/how_do_i_stop_stressanxiety/",
        "text": "I want to be good at everything i care about but i just end uo being mediocre probably because i just end up stressing about my own performance (am i going to do well or bad this time?)\n\nEven at work i cannot take decisions for myself, i literaly cannot decide if what i am doing is good or bad.\n\nI work as a junior developer(4 months first job as a dev) and my manager told me many times that the feedback from the more senior members is very good he even wanted to give me the same responsabilities as a mid developer (which i refused on the basis that i feel like i dont know enough).\n\nI even recently had a discussion with the most senior guy about some changes to make debugging easier and told him about my proposal and that i though it was trash and after the discussion he said \"Well done, now i have some thinking to do\" and despite all of that i cannot decide if i should take a ticket or not. I look at tickets and i get scared because have no fucking idea of what i am supposed to do or if i should even attempt the ticket.\n\nI try to compose music same shit. The first thing that comes to my ming even before i open my DAW is am i gonna make something not trash?\n\nI try to play need for speed for nostalgia and fun and i am trying to get better but all i am thinking is i have to go faster but actually smashing into everything.\n\nI sleep well my schedule is good enough.\nI tride doing this thing a while back where i just focused on my breathing and i had the best ~4 weeks of my life probably but now i just forget.\n\nI tell myself that i am gonna do it but i just forget",
        "created_utc": 1675269886,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I completly lost the motivation to do ANYTHING, has someone been there?",
        "author": "Ronnewski",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qz3xy/i_think_i_completly_lost_the_motivation_to_do/",
        "text": "I'm asking for some help/suggestion, becasue I don't know what's going on but it became very difficult for me to do anything... any action that is not sleeping, eating, watching trash on youtube/IG, masturbating... Still find some kind of ejoyable working out and having a beer with some buddies. But with all the rest is just a mess... At first I thought ok it's just a moment, but seems like it does not pass, it's a season right now...  It's like Im slowly giving up without realizing it and without taking any action. I want to take action, but it's super, super difficult. Even getting to write this post here has taken a lot of effort and decision time.\n\nA bit of context: Im stucked in a job that Im planning to change, the sooner I change, the better. But it's very difficult for me to search a new one and most importantly: I need to decide what the hell I want to do in the rest of my life. Im actually tired of searching jobs because this is what I did all the past year... Im just tired of all the applying procedures, the job interviews where I tell the same stuff that I dont believe in over and over. Im afraid of failing the choice. Previous job was a stage in a very demotivating context, which I think it's something that dried me up complelty to the point of having doubts about my university career and that kind of job in general. Now I can't find a job that I feel like could fit to me, Im just afraid of staring a new one and even searching for it. I kind of feel like a failed person just don't have the courage to state it openly. \n\nNow I \"work\" in an office, it's a badly paid job but very \"comfortable\": it's very close to my house, it's a very stress-free context because my boss is out basically the whole time, very low responsibility overall... Also I live with my parents so I do not have to pay any rent, so this makes up for the low salary somehow. Fact is the job is boring, also I can't take andvantage of the low-stress and light load of work for moving forward with my projects, investing on myself and so on... Because Im just demotivated. Imagine that where I work nobody cares if Im 5, 10 or even 15 minutes late... Even with this I wake up late, I would like to get up one hour earlier like I did in the past, for working on myself, working out, searching jobs, reading, learniing skills... But I can't; taking off from bed is a battle for me every single morning... Just ignore the alarms and feel completly powerless. I became intolerant to any  form of stress, just do not accept it anymore... Im subconciously convinced any effort and hard owrk is useless and not worth, because Im made for mistaking everthing in any case. \n\nI would be very happy to hear whatever suggestion you have on this.\n\n&amp;#x200B;\n\nTLTR: Im in a point where whatever action, even the most easy and daily one, requires a huge effort. Cannot wake up in teh morning. My willpower is completly gone. I wonder if there's any way to rebuild a virtuous cycle.",
        "created_utc": 1675269341,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some hobbies I can spend a lot of time on outside of the house, preferably where I meet other people?",
        "author": "IceRadiation",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qyul6/what_are_some_hobbies_i_can_spend_a_lot_of_time/",
        "text": "I'm so sick of being at home. I'd be happy if I could just leave the house 3 days a week and be gone for the whole day. Any ideas on what I could do?",
        "created_utc": 1675268699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting ghosted",
        "author": "Historical_Tooth_708",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qykc7/getting_ghosted/",
        "text": "You know what sucks? it seems my old friends i made in wow a few years ago are ghosting me now 💀  . I guess I'm not as relatable to them anymore since I'm focusing on studying and getting stronger at the gym. Maybe it's because I quit all multiplayer games (i still play older single player games occasionally), but I try to greet them and ask how they're doing. Fyi, the guys I'm talking about have been neets (not in education, employment, training, or school) for like 4 years now. Still, hurts getting ghosted.",
        "created_utc": 1675268015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have bad breathing patterns,",
        "author": "robotix22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qy3cc/i_have_bad_breathing_patterns/",
        "text": "I often hold my breath, or just pressure my breath out. \n\nI do Meditation , sometimes I breath heavy 10 times. \n\nAny other advice?",
        "created_utc": 1675266901,
        "upvote_ratio": 1.0
    },
    {
        "title": "22 year old male, no friends, no college, living with parents",
        "author": "Successful-Guest8253",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qxva8/22_year_old_male_no_friends_no_college_living/",
        "text": "I’m pretty lost in life and don’t know what else to do. I’m 22 years old and have zero friends. I’ve dropped out of community college twice because I just don’t know what program I should take. I have NVLD (Non Verbal Learning Disorder). I struggle with math, spatial relations (which makes it hard to drive but I’ve gotten better), fine motor skills and social cues. Therefore, I had pretty much had no friends in high school. It overlaps a little bit with autism but it’s not the same thing. I do have a shit part time job making $11 an hour but I’m tired of working it and only work on weekends. Most of my days consist of me staring at a computer screen browsing YouTube, Reddit, Porn and playing video games. I get on and off depression from not talking to people besides my parents. I was on SSRIs but went off of them for a few reasons but I should probably go back on them since my social situation is not going to improve. I don’t want to still be in this same situation when I’m 30. It’s just so hard to change because I have a severe lack of motivation to do anything and I’m certain this is a symptom of NVLD. Any advice would be appreciated.",
        "created_utc": 1675266332,
        "upvote_ratio": 1.0
    },
    {
        "title": "no more beer and only weed gummies",
        "author": "chillingohdylan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qxntq/no_more_beer_and_only_weed_gummies/",
        "text": "It'll help with my lungs and help me lose weight. Those are the main reasons why. \n\nDo you think I can do it guys? I spent $350 on this vape (The Mighty) and now I am not going to use it and replace it with weed gummies. Because my lungs matter.",
        "created_utc": 1675265804,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to build trust in yourself?",
        "author": "Spiritual_Ad_507",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qxhqa/how_to_build_trust_in_yourself/",
        "text": "Had believed for the longest that I was an attention seeker. Always needing someone to look at me and speak with a smile, share their depression, and just use me as their diary, but the moment they shift and give someone else the slightest bit of attention. I grew anxiety “Did I do something wrong?”.\n\nThen I’ll try to /fix/ my mistake. “Maybe I’ll talk less/ talk more, ask less questions/push more questions!” ect… eventually my mind is a circus trying to fix something that was never broken. Forgetting that they are people, not my person to contain. \n\nEventually they do end up getting pushed away, but because of how chaotic I become. At first I thought this was me being some attention seeker, but now. After years of loneliness. \n\nYes, I talked with people, but would never allow myself to connect with a person out of fear of my emotions. I still fear them because in the end. It’s not attention that I want, but trust is what I need.\n\nI don’t trust the person to want me when we leave for a second, I don’t trust that what I’ve done today was enough to earn a connection, I don’t trust the process unless I’m personally in control of it. If I can somehow weave the webs and keep a person caged with me. The moment I leave that door open, that person can fly, which they have a right too, but I can not trust them to fly back in alone.\n\nI want to trust again, but it’s scary to think I never knew what trust is. How do you surrender yourself into believing things will work out just fine without you? I don’t mean this in “If I die today will the world notice?” I mean in “If I let the person walk alone, will they look back?” And be fine if they don’t.",
        "created_utc": 1675265396,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is it okay to give up?",
        "author": "SinkingCarpet",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qxfls/when_is_it_okay_to_give_up/",
        "text": "I know a lot of people and advice that was given to me was to not give up. I want to give up I feel like I'm not really good at what I'm currently doing I've tried and practiced over and over and over again but I'm not getting better. It's stressing me out I'm so miserable and depressed. I'm not really sure I want to keep trying but at the same time I'm so tired of it. I just need another point of view",
        "created_utc": 1675265242,
        "upvote_ratio": 1.0
    },
    {
        "title": "People always call me cold and I don’t know why",
        "author": "cgjkbvc",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qx7l2/people_always_call_me_cold_and_i_dont_know_why/",
        "text": "I’m 21F and I am pretty friendly, I like meeting people and chatting and checking up on my friends+family and supporting them when they go through challenges.  I have a bit of a reserved nature in certain settings, I used to really suffer from chronic fatigue but it’s manageable now so it’s easier to socialize with energy.  While I find it easy to connect with people now, I still get this comment from family, acquaintances, romantic interests, and even teachers/mentors. \n\nI have had too many people call me “cold” or “aloof” for it to feel like a coincidence, sometimes it is said less like a critique and more like an observation of a neutral character trait.   The more complementary version is “intimidating.”  I think it is a comment on my overall demeanor and not specific actions.\n\nThis obviously makes me upset.  I want people to feel comfortable and welcome around me.  I also just can’t figure out what I can change because I already make a conscious effort to be friendly and kind.  I also don’t want to change my entire personality.\n\n I do daydream a lot—maybe it seems like I’m distant?  I do make some sarcastic comments and jokes and am unforgiving when people do horrible things.  I do occasionally talk in a pessimistic way but I also try to talk about positive things.  I am fairly confident in certain situations (but I also have serious anxiety).  When I have to say something critical or confrontational my anxiety makes me shut down so I often say them without much emotion because I feel removed as a coping mechanism.  Sometimes I avoid being fully vulnerable around people who I am worried might reject me (but doesn’t everyone)?  This sounds silly but maybe it’s the way I dress? I wear a lot of black/dark colors and sharp lines and I am pale.  \n\nI know it’s hard to say without knowing me and going off of such little (and biased) information, but if you have received similar comments or have a gut feeling of what’s going on or anything I can change about my demeanor to make people feel more comfortable, please let me know.",
        "created_utc": 1675264684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Go away!",
        "author": "Unfair-Stuff-6623",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qx53h/go_away/",
        "text": "Please stop! I can't take this. This is ridiculous. You're not my sister. You're not my dead mother. You're not my children. I am not a man. This is not a joke. I honestly and truly wish to end my life permanently, but you cheer me on to follow through with suicidal? What the fuck is wrong with you? I took 20 God damn pills last night, so why am I still awake? Aren't I supposed to be dead right now? At least lethargic. I mean fucking God damn bullshit. How else can I fucking die? I don't have a God damn twin. I don't believe in twin flame stupid ass dumbass. I don't believe in soulmates either fucktard. Leave me alone.",
        "created_utc": 1675264511,
        "upvote_ratio": 1.0
    },
    {
        "title": "How You Can Build An Aesthetic Body, No BS!",
        "author": "HarryGarlock",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qx336/how_you_can_build_an_aesthetic_body_no_bs/",
        "text": "New video to my channel",
        "created_utc": 1675264377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out that my “best friend” has been talking shit about me to his girlfriend",
        "author": "sergeimedvedev",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qwxni/just_found_out_that_my_best_friend_has_been/",
        "text": "My “best” friend was still a virgin till his 18s and eventually found a girl who likes him. He was acting like a F boy at first and was telling all of his friends including me that he doesn’t really like her and was just with her for the s*x. Last night I was alone with his girlfriend because we were waiting for him and I was talking with her about random stuff and she started asking me questions about my personal life and about things that actually never happened. The question were kinda embarrassing and I felt kinda ashamed. I acted like I was surprised that she knows and asked her if her boyfriend told her about these “real events” and she told me that he told her to tell nobody about that and she was just asking me out of curiosity. I asked him about it and he was actually super chill and acted like I had to be OK with this because we were buddies. I told him “yeah yeah ok”. She is doing it bc he wants her to like him more but that’s not the way. I am not planning to go out with him again.\n\nEDIT: The least embarrassing thing that he has told her is that I am having s*x with all of the girls in my campus.",
        "created_utc": 1675264003,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I loose stomach fat",
        "author": "_Me_Dum_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qwu5g/how_do_i_loose_stomach_fat/",
        "text": "I am a 13 year old guy and I'm trying to get more slim but no matter what I do I can't loose stomach fat or man books, (I'm 5'11 and 191 pounds if that is important)",
        "created_utc": 1675263759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people never corrected me?",
        "author": "SayWhat6772",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvx7n/why_do_people_never_corrected_me/",
        "text": "[removed]",
        "created_utc": 1675261401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that the one you want doesn’t want you and the one that wants you, you don’t want?!?",
        "author": "Woahhhhmia",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvt8f/why_is_it_that_the_one_you_want_doesnt_want_you/",
        "text": "So annoying",
        "created_utc": 1675261112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me, Its damaging my self esteem and my mental health",
        "author": "ImprovementAdept1608",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvsk6/help_me_its_damaging_my_self_esteem_and_my_mental/",
        "text": "This is may sound petty, but my appearance is damaging my mental health. I hate looking at pictures of myself. Everyone thinks I'm pretty but I dont see it. I don't see what part of me they think is pretty. I think I have low self esteem. I often compare myself to my cousin who looks like like me but has better and more refined features. I compare myself with everyone. I want to work on myself to the point that I can forget how I look like or that my appearance even matters. I shared this to one of my friend and they think that I have never acknowledged myself or my worth that is, I always look down at myself cause I believe it's better than being disappointed. I dont know what I'm struggling with. I have a hard time accepting compliments and I belong to a large family where looks matter so much. I honestly hate every inch of it and this feeling. How do I accept myself, acknowledge the good that I've been blessed with and ignore the one that I'm not satisfied with? how do I stop crippling this low self esteem in a family where members really care about looks? How do I improve to be a better person?",
        "created_utc": 1675261064,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is on your agenda today ?",
        "author": "Woahhhhmia",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvrvs/what_is_on_your_agenda_today/",
        "text": "If we type it out it holds us more accountable to getting it done!",
        "created_utc": 1675261014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Started writing to help my anxiety, what do you guys think?",
        "author": "wReCkLeSs85",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvr32/started_writing_to_help_my_anxiety_what_do_you/",
        "text": "I go for walks when my anxiety hits hard. And I started to write things down for myself to help move passed them. What do you guys thing?",
        "created_utc": 1675260956,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to improve small talk skills?",
        "author": "hollowman2011",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvpfd/how_to_improve_small_talk_skills/",
        "text": "I’m a pretty social person in the sense that I love being out and about around other people. But I’m naturally drawn to more outgoing people, because they have this gift of being able to easily start a conversation with anyone, and I can easily play off of that energy and keep it going with them. But I really want to learn how to do that myself. When I meet anyone new and they’re more on the quiet side, my anxiety spikes and I have absolutely no idea what to say or talk about and I feel like when I try I sound so obviously like I’m trying desperately to grasp at straws with conversation topics and sound weird lol. Does anyone have any tips or tricks on how to improve that?",
        "created_utc": 1675260833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some people never improve?",
        "author": "ExpensiveHealthFurry",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10qvp5j/why_do_some_people_never_improve/",
        "text": "Why do some people never improve?\n\nOne of the fears I have of practicing a skill is that I'll put in lots of time and effort into something I'll never improve at. A reason I have this fear is because it's not impossible. I've seen people spend their whole lives trying to learn and practice something and never get any better.\nSo, how come some people don't improve, no matter how much effort or time they put in?",
        "created_utc": 1675260810,
        "upvote_ratio": 1.0
    }
]