[
    {
        "title": "Does anyone else get really bummed out when they spend a whole day at home?",
        "author": "sameedil",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175t24/does_anyone_else_get_really_bummed_out_when_they/",
        "text": "I need to go out everyday, even for a walk.\n\nI find myself feeling *really* negative, bored, irritated and suffocated if I just spend a whole day at home, and I’ve been this way since I was a kid. Sometimes I even pick up extra shifts at work to avoid the negativity of being stuck at home, doing nothing.\n\nIt can be an issue because sometimes I’m just not feeling well so don’t really want to go out. Also I get bored of going for walks around my local area as I’ve seen it all before. I try to make plans in advance, eg ‘on that day, I’ll go swimming/whatever’.\n\nAnyone else?",
        "created_utc": 1676897273,
        "upvote_ratio": 1.0
    },
    {
        "title": "0 success with girls, how to improve?",
        "author": "RealOkamy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175sq1/0_success_with_girls_how_to_improve/",
        "text": "Hi, i'm a 21yo guy and i really struggle with girls.\nI think i'm average looking, i struggle to give myself a rating because i have some features that are very hot and some that are absolute killers.\nFor example, i have a big nose but am phisically fit, or i have big ears but have beautifull eyes etc.\n\nWhen it comes to girls (and people in general) i really struggle a lot because i have a crippling social anxiety and social awkwardness.\nI've been bullied for years and years in high school because i was the typical shy kid (at the time i didn't know how to take care of myself so i was even ugly).\nThe worst part? I was the only guy in a class full of girls.\n\"It was heaven ah?\" is the classic response that i get when i tell this. Well...it was hell. Imagine groups of girls that tell you that you're stupid, ugly and other stuff every day. Trust me, it's not easy when you're the only guy.\nI think that high school traumatized me in some ways and amplified my social anxiety that i already had.\n\nAnother thing that kills my confidence is comparing to my friends. I know, i shouldn't but it's normal to see what others do. My friends get girls very easily and they're not socially anxious like me.\nSeeing how easy getting girls is easy for them it's really depressing. I have to struggle a lot just to have a number (and 90% of the times i just get ghosted).\n\nI really don't know what to do. I go to the gym, take care of myself and i'm seeing a therapist but my confidence won't go up and my social anxiety it's not getting better even if i expose myself to social situations",
        "created_utc": 1676897247,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been sober for 3 days",
        "author": "tahazu_designs",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175rgu/i_have_been_sober_for_3_days/",
        "text": "I've had a lot of issues with weed usage and alcohol consumptionfor the past 5 years. It's been a long time coming, but when I ran out of weed 3 days ago I decided not to pick up again, and I'm trying to stay away from the booze to enforce the habit.\n\nEverything in my body right now is telling me I need substance. Everytime I have downtime, all I want to do is grab a drink or text my Dealer to pick up more weed. The withdrawls im having from the weed right now are horrible, I've been a daily smoker for 4 years.\n\nI don't know why I'm posting this, maybe to hold myself to some level of responsibility. I guess if you have been through something similar and have advice feel free to leave me a comment. Im trying not to look backwards but it's hard...\n\nEdit: you guys are the best. Thanks for the kind words of encouragement and for sharing your stories. I woke up to tons of comments and messages and it's really given me confidence to stay with it.",
        "created_utc": 1676897137,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you had 60 days to make yourself into your best self, what would you do?",
        "author": "ilker_sezer1994",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175psk/if_you_had_60_days_to_make_yourself_into_your/",
        "text": "First post in this sub, so please let me know if this doesn’t follow the rules.\n\nI’m asking this question because I’m graduating from college in two months, and I’m wondering what I can do to make myself as happy and confident as I can be.\n\nThroughout my years in college, I’ve worked really hard (40 hours of work on top of a full class load), and as a result, my mental and physical health have suffered. I look about as burned out as I feel. I want to change this as I graduate and enter the “adult” world. My class and work load is lighter at the moment, and I want to use this time to make some changes in my life.\n\nIf you were in my position, what would would you do in these next few months to recoup to look/feel your best self?",
        "created_utc": 1676896994,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost my girlfriend because of my insecurities.",
        "author": "hikarustr11",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175m9d/i_lost_my_girlfriend_because_of_my_insecurities/",
        "text": "I am a 25 year old male. My girlfriend of almost three years just broke up with me because of my insecurities. We had a wonderful and loving relationship. We both told each other that we are the love of each others life and we wanted to get married and start a family. We compare ourselves to Marshall and Lilly from the tv show How I Met Your Mother. Our story is exactly the same as theirs. I know... cheesy.\n\nDuring the relationship I have had outburst of insecurity. Those outbursts led to arguments and she kept giving me chances. This final time I said something was about her going out with two of her friends and they were drunk, not my ex. My ex doesn't consume alcohol. I got off work late and wanted to talk to her, she was going out and didn't have time to really talk. We did speak and I was selfish for wanting more. Later that night around midnight I called her, she answered and I heard load music. For some stupid reason I said you're at a club? When did you become \"club girl\"?\n\nThe one that killed it was \"I'm still not over you dancing with two other men on separate occasions\". She had danced with two male friends last year and I recently found out because she told me about it. She trusted me enough to handle it and I threw it in her face.\n\nWe didn't speak over that weekend and on that Monday she broke up with me. She said it is hard to be in a relationship when the other half doesn't trust the other. She said I broke her heart and she needs time to heal. I mentioned I will be in therapy and actually went to a session that day she left. She said she was \"very happy and proud of me.\" \"David you're strong and I know you'll do it. But right now you need to do this journey on your own without me\". We talked for an hour and we agreed to have a no contact rule. We will not contact each other for two months. After two months if I'm doing well then I'll give her a call and ask her out for coffee. At the end of the conversation she said you're my best friend and we can still have the marriage, family, and a happy life together. I just need to fix myself. She told me that she will be waiting for me and she loves me so much. I told her I will work hard for myself and my loved ones. The last things we said were \"I'll miss you and I can't wait for our date in two months. I love you so much.\" She chuckled and said \"This is the start of us no talking for two months. I love you so much too.\" We gave each other a kiss and hung up the phone.\n\nI am currently writing a lot and realizing what I did to her all these years. I feel my self awareness is good. I am hopeful she truly means what she said. Of course we may not go back out, but I am hopeful. I am hopeful in our love and what we have built over the years.\n\nTo be clear she had one line dance and one ballroom dance. Her friends danced with each other and she was stuck with them man. She wasn’t happy. She set boundaries with the guys because she had a boyfriend. She got so uncomfortable that she stopped and sat out the rest of the night. She was very apologetic and I forgave her and we moved on. I was the one who brought it up again. There was no grinding or anything else.\n\nI’ve read the comments and anxious attachment seems like the nail on the head.\n\nAlso I am doing this for myself and my family members. It’s been a rough few years and all of this has come at once. It’s for her. It’s for me. I probably made it sound like it was only for her. My bad everyone.\n\nThank you for reading.\n\n&amp;#x200B;\n\n​",
        "created_utc": 1676896683,
        "upvote_ratio": 1.0
    },
    {
        "title": "A psychologist walked around a room while teaching stress management to an audience...",
        "author": "justlexplz",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175kpx/a_psychologist_walked_around_a_room_while/",
        "text": "As she raised a glass of water, everyone expected they'd be asked the \"half empty or half full\" question. Instead, with a smile on her face, she inquired: \"How heavy is this glass of water?\"\n\nAnswers called out ranged from 8 oz. to 20 oz.\n\nShe replied, \"The absolute weight doesn't matter. It depends on how long I hold it. If I hold it for a minute, it's not a problem. If I hold it for an hour, I'll have an ache in my arm. If I hold it for a day, my arm will feel numb and paralyzed. In each case, the weight of the glass doesn't change, but the longer I hold it, the heavier it becomes.\"\n\nShe continued, \"The stresses and worries in life are like that glass of water. Think about them for a while and nothing happens. Think about them a bit longer and they begin to hurt. And if you think about them all day long, you will feel paralyzed – incapable of doing anything.\"\n\n*Remember to put the glass down.*",
        "created_utc": 1676896550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I’ve noticed about people I really like (but don’t know super well)",
        "author": "gaabbsri",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175je8/something_ive_noticed_about_people_i_really_like/",
        "text": "They remember your name. I met a man who I was doing work for, about 6 months ago, so we did our job and left after that. About 6 months go by (it’s around Christmas), and he greets me and shakes my hand, calling my by my name. Now, I don’t know how he remembers people’s names so well, but he remembered mine. So something that I encourage people to do, is to remember peoples names the first time you hear them. I feel like that’s really undervalued in today’s society and I don’t remember the last time someone remembered my name after a stretch of time without seeing them.\n\nJust left a good taste in my mouth after talking to him again. Made me think “wow, what a great guy”. Not everyone would notice, but some people will notice and I feel like those who do notice, are worth making a good impression on.",
        "created_utc": 1676896444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hate being out of a relationship. How have you worked to improve yourself/life so you don't feel this 'negative' feeling?",
        "author": "An_alternative_smile",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175ebd/hate_being_out_of_a_relationship_how_have_you/",
        "text": "I used not be a \"relationship type\" person. That's until I had my first experience of being in a relationship with someone.\n\nSince then it's all I want. I'm no longer with my ex but I find myself pining after them. Mainly because I don't want to be alone anymore.\n\nHow have you worked to get over thisnl feeling?",
        "created_utc": 1676896034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips I've learned over almost a year (anniversary is in April) of self improvement",
        "author": "hulksmashmulti",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175ddq/tips_ive_learned_over_almost_a_year_anniversary/",
        "text": "DMed these tips to a guy asking for help after he read my post about a 1st date going really well, but I think I should leave this here since I feel like everyone could benefit from this. In almost a year I (15M) went from being the stereotypical school shooter kid to someone I would look up to when I first started improving myself. And that's all that really matters. I have motivational quotes printed on paper and pinned all over my bedroom and the one that gets me going the most is:\n\n\"You don't have to be better than anyone else, you just have to be better than who you used to be\"\n\nBut here's a list of everything I could think of. These mostly apply to men since I'm a dude so I don't know how helpful this is to the ladies out there, but take a gander:\n\n\\- mewing, which is having good tongue posture. Keep as much of your tongue as you can on the roof of your mouth and breathe through your nose. It will improve your jawline.\n\n\\- be more decisive and less “I dunno whadda you wanna do”\n\n\\- shave\n\n\\- get rid of bad nervous habits like bouncing your leg or fidgeting with your clothes or whatever (working on this one right now)\n\n\\- make jokes. Seriously. Humor is a huge part of earning someone’s trust and respect\n\n\\- go outside and live life, even if you don’t want to. Because chances are, if you don’t want to, you secretly do and you’re just jealous of people that do go outside.",
        "created_utc": 1676895948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't look at your phone first thing in the morning",
        "author": "edward_stromberg",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175a3z/dont_look_at_your_phone_first_thing_in_the_morning/",
        "text": "When i wake up i start a timer on my watch (yes, buying a watch was the shit!), and I don't look at my phone for one hour. To be able to do this i wake up one hour earlier, so if there's some things i'm anxious about, or feel like i should check it i just say, i used to sleep at this time, so it doesn't make a difference.\n\nWhat you can do with this time:\n\nMake breakfast, eat it without being in a rush. (and without multitasking)\n\nRead the books that are recommended in this sub.\n\nYour hobby.\n\nIt's basically free me-time, so anything thats in that category for y'all.\n\nBackstory:\n\nI had an experience where i was still half asleep and checked a notification about a problem that i couldn't solve then and there so it just gave me a massive anxiety shot. It's not good to start the day with that tbh. I realised that even though looking at the screen makes it easier to wake up it is really toxic. So don't do it kids.",
        "created_utc": 1676895665,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"It's very difficult to be your best if you're constantly looking over your shoulder and wondering if being you is enough.\"",
        "author": "dixon_321",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175784/its_very_difficult_to_be_your_best_if_youre/",
        "text": "Just listened to a great youtube interview and had to share this quote because it really resonated with me. (If you're curious it's an interview with a neuroscientist named Crystal Dilworth on a show called Impact Theory)\n\nI feel it's a reminder about how the first step in self improvement is realizing that we are inherently enough. This doesnt mean you think you're perfect. Or that you don't need to improve. Or that you dont fuck up and have to backtrack sometimes. Just that we are innately enough and that we have enough to offer the world if we try.\n\nThere's a difference between recognizing your flaws and working to improve them vs thinking you are not enough as a human being.\n\nWould you ever tell a baby it wasnt enough because it hadnt learned to walk yet?\n\nA constant preoccupation with double checking and questioning our worth seriously gets in the way of progress. It's a distraction from accomplishing our goals at best and a seriously draining, negative habit at worst.",
        "created_utc": 1676895434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Media detox.",
        "author": "dj088kosik",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117506c/social_media_detox/",
        "text": "I deleted all of my social media accounts including instagram, twitter, snapchat and facebook on the 1st of january 2019 because i felt like they were just making me feel like crap.\n\nNow it's been 1 month+ without social media and i feel so much better. Last time i used to be on my phone 24/7 mindlessly scrolling for hours. I used to also compare my life with everyone elses. It became a competitive thing and it was so toxic for me. I never thought i'd be able to survive without social media but here i am!\n\nI managed to develop a few hobbies, such as reading books, sewing and gardening. I created a reddit account just so i could be updated on memes. I feel like i'm never gonna use a social media platform ever again and my fomo is gone too!",
        "created_utc": 1676894815,
        "upvote_ratio": 1.0
    },
    {
        "title": "why can't i stop viewing everyone around me as a competition?",
        "author": "joouls",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174y6s/why_cant_i_stop_viewing_everyone_around_me_as_a/",
        "text": "i feel like i can't stop viewing everyone around me as a competition, i always need to feel like I'm the best at certain thing, from my favorite subject to movies, shows, artists, songs etc. i can't stand the thought that they could like that thing more than me or be better at it than me, or have more merch for example. \ni think that could be because i have built my confidence on feeling better than everyone else, and i have to keep up that feeling to not go into emotional breakdown. i don't know if i should try to do something with that (idk why but i lowkey don't want to do that) or just find someone that wouldn't copy everything i do. i probably should try the first option, since i get annoyed even if my sister's friend likes the same show, and it makes it really hard for me to make any friends.\ndo you guys have any other advice, or explanation of where this could be coming from?",
        "created_utc": 1676894631,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOW TO FIND YOUR PURPOSE IN LIFE",
        "author": "Admirable-Sir2652",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174ub3/how_to_find_your_purpose_in_life/",
        "text": "If you don't feel fulfilled by or happy with your life, you may decide to evaluate your life’s purpose. While this can be a challenging self-examination that may lead you to believe that you’ve been living life the “wrong way,” take heart; it’s never too late to begin living the life that you want to live—a life that is meaningful and happy. Find your life’s purpose, then take action to implement the kind of life you really want to live.\n\nPART 1 OF 3: EVALUATING YOUR INTERESTS\n\nStep 1: \\~ Keep A Purpose Journal \\~\n\nJournaling is a useful tool for making any changes to your life or your perspective. Create a dedicated journal that will help you write down and explore your thoughts about your life’s purpose, your passions, and your joys.\n\nDo not worry about how your writing sounds; this journal is just for you, and no one else will read it. It’s important that you are completely open and honest, not that the writing is particularly good.\n\nStep 2: \\~ Question Yourself \\~\n\nTo begin assessing your life’s purpose, it’s important to assess what you love to do, what you currently do, and what needs to change to live a more purposeful life. Some questions to consider are:\n\nWhen have you been happiest in your life? What has made you truly proud of yourself? What qualities do you most admire in other people? What makes you feel really alive and energized? How happy do you feel on an everyday basis? If you had one week to live, how would you spend that week? What “shoulds” are overriding your “want tos”? If you could change one thing about the world, what would it be? What one change could make your life happier?\n\nStep 3: \\~ List Your Interests And Passions \\~\n\nWrite down the things that you enjoy spending time doing. These can be related to your work, your personal life, or your home life. They should be things that make you happy, that you really enjoy doing. These are things that you enjoy doing without getting paid to do them, and they are likely things that cause you to lose track of time.\n\nStep 4: \\~ Write Down What You Love \\~\n\nThe things and people that you love are very important to the quality of your life and how you spend your time. Acknowledging the things and people that you love can help you focus your passions and your purpose. Focusing on things that you love with your heart, rather than value with reason, can bring you closer to your true passions.\n\nIf your primary loves are your family, you are unlikely to feel fulfilled if your life is dominated by a career that causes you to spend almost all of your time away from them.\n\nStep 5: \\~ Find Your Joy \\~\n\nThis is similar to your interests and passions, but finding your joy is a little more focused. To find your joy, think about what makes you feel blissfully happy. Think about the last time you laughed so hard your sides hurt, or smiled so much that your cheeks were sore.\n\nIt can be useful to think about the type of play you most enjoyed as a child. Does similar play (or work that mimics that sort of play) bring you a childlike joy?\n\nStep 6: \\~ Use Backwards Planning \\~\n\nImagine yourself at 90 years old. Imagine that you are looking back on your life, and you are completely content that you lived a meaningful, wonderful life. Imagine what the specifics of that life are, then work backwards through time to determine what you need to do by each decade between now and 90 in order to live that complete life.\n\nFor example, say that you picture yourself 90 years old, surrounded by great-grandchildren, happily retired after a successful career helping your community, living in your own home with a lot of land.\n\nThis tells you that you want to have a family, that you’d like to have a career helping others, and that you would like to live independently in a rural setting.\n\nYour backwards planning could lead you to determine that you should start having children when you are 28, you’d like to find a position as a social worker by 25, and you should maintain your health constantly so that you can continue to live independently in old age.\n\nStep 7: \\~ Don't Listen To Social Norms \\~\n\nIt's common to think about what others expect from you. Parents, friends and society have certain expectations from us all with good intentions. Social norms might tell you to not start that business, not quit your job or take a pay cut for a less prestigious job. But ultimately you are the only one that can decide what's right for you.\n\nThink from first principles - what change do you personally want to see in the world if you didn't care what others thought of you?\n\nBe conscious of what thoughts are your own vs. those passed onto you. Have you ever thought starting a business is hard? Or that you can't make money following your passion? These are beliefs generally passed down to us that may not be true. Think to yourself what thoughts are yours vs. what others have told you.\n\nPART 2 OF 3: STEPPING OUTSIDE YOURSELF\n\nStep 1: \\~ Determine The Purpose Of Humanity \\~ This is a weighty question, and it may take some time and reflection to decide, but if you can determine what you think the purpose of humanity is, you can scale that idea down and apply it to your own life.\\[10\\]\n\nFor example, you may decide that the purpose of humanity is to help each other thrive in the world. Your own personal purpose can then be to help people in your community thrive, and you can determine what steps you need to take to work towards that.\n\nStep 2: \\~ Find People To Inspire You \\~\n\nThink about people whom you find truly inspiring. These can be world leaders, historical figures, or people from your own life. Think about why these people are inspirational, and determine specific actions or characteristics they have that you’d like to emulate. .\n\nYou may want to keep this list in your purpose journal. Remember that you do not have to admire or emulate every aspect of an individual—rather, you are using the individual to home in on specific characteristics that you would like to have too.\n\nStep 3: \\~ Leave Your Bubble \\~\n\nLeaving your personal bubble, or your comfort zone, means having a broader view of the world and the people in it. We tend to be somewhat self-centered in our day-to-day lives, but leaving your bubble gives you the opportunity to view the wider world around you. With this renewed realization of the rest of the world, you can more objectively see your place in the world and evaluate your passions and purpose.\n\nOnce you have a greater awareness of other people around you, decide how you want to interact with those people. Determine how you would like other people to view you in relation to themselves, and then work to be that person for them.\n\nStep 4: \\~ Ask Friends What Your Strengths Are \\~\n\nIf you are having difficulty assessing yourself, or if you’d like a second opinion, ask some close friends what they think your strengths are. They may offer some insight that you have trouble seeing yourself.\n\nFor example, you may not realize that your own actions inspire your friends to want to emulate you. A friend might say, “I think you are great at putting a plan into action once it’s made, rather than waiting for someone else to get started.” You can tie this strength into your purpose.\n\nStep 5: \\~ Stop Thinking In Absolutes \\~\n\nMany people think that their purpose (or their career, or their interests) have to revolve around one thing. But sometimes our passions are about balancing multiple interests that fulfill different aspects of our needs and wants. Realizing that your one purpose (if you choose to limit it to one) can be made up of multiple facets can offer you more flexibility in setting that purpose.\n\nFor example, if your life’s purpose is “to bring happiness to myself and others,” you may have the sub-purposes “to feel fulfilled in my work, to be patient with my family, to make my kids laugh, and to listen well to my friends.” All of these work towards your greater purpose.\n\nThe advantage to having multiple facets to your life’s purpose is that if one area is lagging or not going well, you won’t feel like you’re entirely off track. For example, if your work life is not fulfilling, but your home and social lives are, you can still feel like you’re working towards happiness.\n\nStep 6: \\~ Set Your Purpose \\~\n\nAfter you have evaluated yourself and expanded your view outside of yourself, decide what you’d like your life’s purpose to be. Remember that it’s okay if it changes in the future. It’s important to have a goal and direction now, even if you alter it later as you change and grow.\n\nOnce you have decided your purpose, write it down. Post it somewhere that you can read it every day, reminding yourself of what you want in life. You can ask yourself each day if you’ve done things to work towards that purpose.\n\nPART 3 OF 3: \\~ ACTING ON YOUR PURPOSE \\~\n\nStep 1: \\~ Writing Your Personal Mission Statement \\~\n\nAnother way to think of your life’s purpose is to frame it as a personal mission statement. You may want to convert your set purpose into a personal mission statement, which tends to take a more active, actionable format.\n\nStep 2: \\~ Meditate To Set Your Intentions \\~\n\nMeditation or mindful yoga can be useful for setting your intention for your day, your week, your year, and your life. Clearing your mind and allowing yourself to picture your life the way you’d like for it to be can help you make steps towards living that life of your dreams.\n\nStep 3: \\~ Stop Trying To Please Other People \\~\n\nEven if your purpose has a social element to it, trying to please people around you on a daily basis is likely to hinder, not help, your overall purpose. Be sure that the actions you’re taking in your life are your choice, not the choices of other people around you.\n\nOften, people do not know what is likely to make them truly happy, so even if your goal is to bring happiness to yourself and others, meeting the immediate demands of others won’t help you live your purpose.\n\nStep 4: \\~ List The Actions That Lead Towards Your Purpose \\~\n\nIn your purpose journal, write a list of actions that you can take that will lead you directly towards your life’s purpose. You may not be able to take each action immediately, but realizing the steps that you should take to reach your purposeful life can help you move in the right direction.\n\nFor example, if your current career is not fulfilling and doesn’t mesh with your life’s purpose, you may write “find a new career” on the list. However, you may not want to immediately quit your current job before finding a new one due to the practicalities of paying bills and keeping your family housed and fed.\n\nDivide your list into short-term, medium-term, and long-term changes.\n\nStep 5: \\~ Do The Things That Lead You To Fulfill Your Purpose \\~\n\nOnce you have determined the actions you will need to take to fulfill your life’s purpose, take those steps. Begin with the short-term changes and work towards long-term changes. Sometimes taking action instead of thinking too hard can bring you greater clarity and happiness.\n\nStep 6: \\~ Revisit Your Journal \\~\n\nBe sure to go back and read your purpose journal and related lists periodically to make changes, add to it, or remind yourself of your purpose. After some time has passed, you may find yourself drifting back into the comfortable familiarity of your daily life. While there is nothing wrong with this, you will likely feel more fulfilled generally if you are working toward your now-established life’s purpose.\n\nStep 7: \\~ Avoid Activities That Counter Or Distract From Your Purpose \\~\n\nIt would certainly be difficult to avoid doing any activity that doesn’t directly work towards your life’s purpose. If you want to bring happiness to yourself and others, but you don’t like doing laundry, you will likely still need to do laundry occasionally. However, you can avoid doing activities that work against your life’s purpose.\n\nFor example, if your purpose is to bring happiness to yourself and others, you should avoid saying things that are hurtful to others. You should avoid things that make you truly unhappy, like spending time with individuals that cause you to feel bad about yourself.",
        "created_utc": 1676894303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do this 3-minute breathing space whenever you're anxious/worried/depressed",
        "author": "sangtea_fenate",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174s41/do_this_3minute_breathing_space_whenever_youre/",
        "text": "This is an excerpt from the book 'Mindful way through depression'. This is said to be one of the most useful practices out there:\n\n*STEP 1. Becoming aware*\n\nBegin by deliberately adopting an erect and dignified posture, whether you are sitting or standing. If possible, close your eyes. Then, bringing your awareness to your inner experience, ask: What is my experience right now?\n\n• What thoughts are going through the mind? As best you can, acknowledging thoughts as mental events, perhaps putting them into words.\n\n• What feelings are here? Turning toward any sense of emotional discomfort or unpleasant feelings, acknowledging their presence.\n\n• What body sensations are here right now? Perhaps quickly scanning the body to pick up any sensations of tightness or bracing.\n\n*STEP 2. Gathering*\n\nThen redirect your attention to focus on the physical sensations of the breath breathing itself. Move in close to the sense of the breath in the belly . . . feeling the sensations of the belly wall expanding as the breath comes in . . . and falling back as the breath goes out. Follow the breath all the way in and all the way out, using the breathing to anchor, yourself in the present.\n\n*STEP 3. Expanding*\n\nNow expand the field of your awareness around your breathing so that, in addition to the sensations of the breath, it includes a sense of the body as a whole, your posture, and facial expression. If you become aware of any sensations of discomfort, tension, or resistance, zero in on them by breathing into them on each in-breath and breathing out from them on each out-breath as you soften and open. If you want to, you might say to yourself on the out-breath, \"It's okay . . . whatever it is, it's already here: let me feel it. \" As best you can, bring this expanded awareness into the next moments of your day.",
        "created_utc": 1676894087,
        "upvote_ratio": 1.0
    },
    {
        "title": "About how we face life, seeing things as obstacles or challenges.",
        "author": "Flounder-Loud",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174rxe/about_how_we_face_life_seeing_things_as_obstacles/",
        "text": " I will try to be brief. At a certain point in my life I saw things as obstacles. For me, obstacles are like barriers, something too difficult that it's not even worth trying. Speaking here of day to day tasks and my duties. \n\nThere I always read about the mindset of turning those obstacles into challenges. Really look at them as if they were something else. Because challenges are something that can be done, and that can give you rewards and opportunities. But for me personally, the word challenge also denotes something difficult and optional.\n\n So, I brought another word into this context: task. Because for me a task is something easy that you will do, something so simple. \n\nAnyway, has anyone done something like this? Or do you have any material or reading that you can recommend me on the subject? I ended up really interested in researching it.",
        "created_utc": 1676894069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turning 30...",
        "author": "lookatthefuturetoday",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174qry/turning_30/",
        "text": "Using a throwaway account. Today is my 30th birthday. It has really opened my eyes up to the fact that I need to do some serious self improvement. This was supposed to be a big occasion, I was supposed to visit home, take a trip to Italy &amp; say goodbye to my 20s and positively look forward to my 30s.\n\nInstead I am sitting at home alone, totally broke, no big celebration, no celebratory drinks, just me and four walls. This is all down to just a handful of bad decisions I made in the past 12 months or thereabouts.\n\nA few questions for you guys:\n\nFor those of you 30+ how did you celebrate your 30th and what did it mean to you? What changes did you make in your 30s due to lessons learned in your 20s.\n\nToday is a big day for me in regards to reflecting on what I've done wrong and trying to lift my spirits and appreciate the things I've done right. I'm not a bad person but I have made some silly mistakes.\n\nThe things I want to improve on are becoming a more reliable friend, improve finances, have a healthier routine &amp; improve the social circles in which I am part of. I want to become a better person for myself and for those around me. I am going to utilise this subreddit to help me get there.\n\nThanks for reading and thank you all for doing your part for this sub. You are all amazing. X",
        "created_utc": 1676893959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intermittent Fasting - Additional Hidden Benefits!",
        "author": "Potential-House-8987",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174pog/intermittent_fasting_additional_hidden_benefits/",
        "text": "In 2020 I made one of the biggest changes to my dietary habits I have ever made.\n\nMidway through the year I decided to try intermittent fasting.\n\nFor those of you unaware, intermittent fasting involves limiting the number of hours in a day that you choose to intake food, or more specifically, calories. The premise for structuring your eating habits in this way is based upon the eating schedule of our ancestors thousands of years before us. Eating three meals a day has only very recently become an expectation.\n\nResearch has proven structuring caloric intake in this way can lead to weight and fat loss, improved mental clarity, increased energy and an increase in growth hormones.\n\nAdditionally, intermittent fasting stimulates autophagy. This is essentially the process of cellular cleansing, whereby nutrient deprivation leads the cells within the body to destroy their internal waste matter and subsequently repair themselves. The body does not enter this process as effectively if it is constantly refueled through regular meals as the cells do not fully recognize the need to flush out waste material.\n\nIf the list of benefits alone aren't enough to convince you, it was actually a detailed deconstruction of the autophagy process that won the Nobel Prize in Physiology or Medicine in 2016. I'm no expert, but if there are people much smarter than me working on areas of health and nutrition, I'm going to leverage off any information they can give me.\n\nFor me personally, I have chosen to eat within an eight hour window between 12:30pm and 8:30pm. It has worked amazingly for me and I have experienced all of the benefits above. My biggest testament to this process is actually a hidden benefit that I never had read about in research prior to practicing the fasting.\n\nThis benefit resides in the fact that I have not fallen ill once since starting intermittent fasting!\n\nNormally there are periods in my life where the pace picks up and runs me into the ground and I get sick. I am yet to experience such illness while fasting, which leads me to believe there are significant benefits to be experienced for the immune system.\n\nOf course, I would always recommend doing your own research prior to committing to a new dietary plan. Listen to your own body and work out what processes are best for you.",
        "created_utc": 1676893856,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop picking fun and entertainment over your future and career and other more useful things",
        "author": "__leonie______",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174l55/how_to_stop_picking_fun_and_entertainment_over/",
        "text": "I keep wasting my free time on music and gaming instead of learning. I really want to learn and read books, listen to podcasts etc.\n\nSometimes I get these huge boosts of ambition which makes me want to give up all my gaming but those boosts only last a few hours...\n\nI wouldnt say gaming is an addiction. I still work and study through the week but when I get home i would like to continue improving my future oppurtunities but then i just keep getting disctracted.\n\nI'm 19 yrs old if that matters.",
        "created_utc": 1676893406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can do a lot in one month",
        "author": "Over_Skill7758",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174jva/i_can_do_a_lot_in_one_month/",
        "text": "I wrote a post earlier this month about my progress last year and I wanted to try reflecting each month. Now that January has come to an end I find myself looking back at the things I’ve done to make an improved version of myself. I saved money, I’ve made strong connections with other people, I’ve grinded away at my app, I’ve eaten heathy. I have done so much in a month that I would never have realized I could do until I sat back and think on it. Last year I only did that one time. Imagine all those things I’ve done that I don’t even realize. To anyone who’s reading this, and needs an extra hand or push, think back on all the things you’ve done this month, not just the goals you set out to do, and realize you have accomplished so much. Thanks for listening. I hope we all have a great February as well.",
        "created_utc": 1676893277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confident with unpopular kids. Shy and awkward around popular kids",
        "author": "hd_brm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174iu4/confident_with_unpopular_kids_shy_and_awkward/",
        "text": "Maybe I try too hard to impress people? I get this feeling of judgement when talking to someone confident, why is this?",
        "created_utc": 1676893176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to be happy and whole on my own, without a relationship",
        "author": "fireman445",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174hip/want_to_be_happy_and_whole_on_my_own_without_a/",
        "text": "I want to become happy and whole on my own, and not constantly crave a relationship.\n\nI have tons of friends, a job I love, and hobbies I am going to get back into. But I still feel like I'm a loser somehow for being single.\n\nHow do I get past this?",
        "created_utc": 1676893043,
        "upvote_ratio": 1.0
    },
    {
        "title": "The subconscious desire to prove that your parents did a bad job raising you",
        "author": "charognard_du_ghetto",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174g4f/the_subconscious_desire_to_prove_that_your/",
        "text": "So I've been reading this book \"Unfuck yourself\" and quite liking it. The 3rd chapter is called \"I am wired to win\" and it discusses how in reality we are achieving what we want, but what we want is to prove that we are lazy, incompetent, not worth of love etc.\n\nThe author mentions that many of his clients have \"the subconscious desire to prove that their parents did a bad job raising them\" and it really spoke to me. I can see this in myself so, so much. I'm quite a resentful person and have never quite moved on from the fact that my parents did not prepare me for the world properly, and in some way I'm trying to show (to the world? to myself? to them?) just how bad my parents were.\n\nI feel a desire, conscious or subconscious, to prove myself lazy and dumb. I treat my girlfriend poorly to prove that I am not worthy of love (and maybe that she is also unworthy of love). I treat myself poorly to prove that I don't deserve to be happy, and that I don't know how to be happy.\n\nI'm struggling to figure out how knowing this helps me. How do I stop trying to prove my parents are bad, and start proving that I am good?\n\nThanks for reading &lt;3",
        "created_utc": 1676892903,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my neutral face seems very angry/annoyed, how can I change that?",
        "author": "le_fan_de_viking",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174ddg/i_think_my_neutral_face_seems_very_angryannoyed/",
        "text": "I am noted to be a very open/approachable/friendly person by people who know me. But whenever I am not around not around my friends and just existing (working at the office, walking around town, etc) my face seems serious/stern... I can't describe it. All I can say is that sometimes I get weird or uncomfortable looks.\n\nAre there ways to change your neutral face or make the expression seem more soft?",
        "created_utc": 1676892623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Visual tools for self improvement, important trip ahead",
        "author": "Practical-Match-2984",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174c96/visual_tools_for_self_improvement_important_trip/",
        "text": "I am a very visual person, and would like to draw, write and see the goals that I want to achieve for my 6-week trip, which will come in about a month.\n\nLast year I went on such a trip for 3 weeks, and I got very few things done since I hadnt put then down on paper, to\nlook at them and see them.\n\nApart from a calendar and notebook, do you have any recommendations/suggestions to any tools, frameworks be it physical or digital that I can use? Thank you.",
        "created_utc": 1676892515,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m kinda stuck in life",
        "author": "godzilla_fan1233",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1174ajn/im_kinda_stuck_in_life/",
        "text": "Ok I love this subreddit since almost every post I see with even the fewest upvotes gets tons of really helpful thorough responses. I’m 16M and going to a school I really don’t enjoy, bc of the people there. I have two years left and my gut is telling me that the best thing for me would be to change schools but I’m scared of the unknown. What should I do?",
        "created_utc": 1676892326,
        "upvote_ratio": 1.0
    },
    {
        "title": "(M15) (Advice) Blind hope never works. Nothing will come to save you.",
        "author": "kkqkso",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117492i/m15_advice_blind_hope_never_works_nothing_will/",
        "text": "You can spend day after day, year after year hoping and waiting for some good fortune to come your way, something so great that will drag you out of this hole you have dug for yourself. But no such thing will ever come. You can't just wait and wish. Because no stroke of luck, no achievement will be great enough for you if you can't sort yourself out, because you can be outwardly more successful than you have ever dreamed of and yet still feel empty, dead, and hopeless inside.\n\nI have had to learn this the hard way. Throughout my life, (perhaps originating from an emotionally troubling childhood), I constantly looked to the future, in a sort of blind hope that someday something great will miraculously befall me so that everything would be alright, and that everything I had been enduring would be somehow worth it. How wrong I was. Throughout my life, I have been one of the most successful kids at my age level (I'm 15 now) in many different disciplines. But in spite of all that, even though I should be extremely proud of myself (even though the people close to me aren't but who cares), I still feel hopeless, aimless, and as though I'm randomly floating through life without any control. I still feel like a failure, an underachieving disappointment who failed to live up to his potential, even though everything would suggest the opposite.\n\nI'm still trying to accept this, quit hoping and wishing, and actually start putting myself together and do something purposefully, with a statement of intent, so to speak. I have realised that almost everything I've achieved so far has been achieved without a clear purpose or intention, in the sense that I just relied on my intuition and my giftedness. But at least now I understand that I have to try and take command of my life, and that I need to make decisions for myself, rather than have the world make decisions for me. Because only by doing this can I actually claw myself out of this hole. It's very hard though, since everything inside you just wants to sink back down into the hole and seek solace in its comforting darkness. There's been so many times where I've made a few steps upwards but then just fell right back to where I started. But I know I have to move on, even if I fail to make any progress for some considerable period of time, I have to get myself out of this. I can't rely on the world giving me anything, because things like this don't just spontaneously appear.\n\nIf you too have been struggling with stuff like this, remember that there will be a way out, even if it seems futile at the moment. Just keep on trying, and eventually something will happen. I feel like I'm writing this for myself just as much as I'm writing this for you, but the message is the same. Keep on going. Don't just wait and wish. Do something. Because the hope you were searching for is already there. All you need is to do is to try and embrace it.",
        "created_utc": 1676892166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start telling yourself that you're capable",
        "author": "kazantip03rus",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11747by/start_telling_yourself_that_youre_capable/",
        "text": "Lately I've realized a big thing, and that actually turned into actionable self-improvement, unlike the 99% of other things I \"realize\". I have anxiety often times holding me back from confronting my problems. I missed a job interview lately because I was dumb enough to take a nap, and the nap went on for too long. The guy messaged back, but I was too afraid to read the text/respond to him. Telling myself I \"need\" to do it didn't help at all. And guess what? I didn't need to. Telling yourself you \"need\" to do something is bogus, almost everytime. Because you can literally live without whatever you \"need\" to do. What I started doing instead is taking a deep breath, and saying over and over, OUT LOUD, that I am capable of doing this. It CAN be done, and I am strong enough to pull through. After an hour of telling myself this, I responded. Hey, an hour isn't bad. Of course, it would've been ideal if I did it earlier. But regardless, this is very good advice that has helped me immensely, and I am finally sorting my life out. Just keep telling yourself that you are capable. Very simple, very obvious, but highly underrated advice imo.",
        "created_utc": 1676891997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else here a late bloomer?",
        "author": "Agreeable-Jury8683",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1173p9j/anyone_else_here_a_late_bloomer/",
        "text": "I'm 20 and feel like a late bloomer in life compared to most of my peers. I'm still learning how to drive after failing the test a couple times (Driving tests are quite hard in my country), never been in a relationship, don't have my own car,  I have a few friends but still often feel lonely as some of them are one sided friendships , I'm doing alright in my degree but will probably take another 2 years extra to finish due to changing majors quite a few times. I see my peers around me and most of these things seem to be something they've experienced (relationships, large friend groups from childhood, car, Lisence), the most frustrating thing about all this is that I'm giving my 100% everyday to achieve these things but they seem to come way harder for me than for others (e.g people I know passed their Driving Test or got a car as soon as they turned 16, some have been in relationships since high school, have super large friend groups and large following on social media). I also got removed from my fast food job at Subway as I couldn't make the sandwiches properly (kept messing up the wrapping and cutting) while co workers a couple years younger than me could do it on their first attempt and I couldn't even do it once after multiple attempts. Feels like I'm falling behind in life and have something wrong with me!",
        "created_utc": 1676890154,
        "upvote_ratio": 1.0
    },
    {
        "title": "for those losing motivation.",
        "author": "Chance-Reward582",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1173p64/for_those_losing_motivation/",
        "text": "[removed]",
        "created_utc": 1676890144,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to reinvent myself. Where to start?",
        "author": "blazedfuego",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1172wrn/i_want_to_reinvent_myself_where_to_start/",
        "text": "Has anyone ever reinvented themselves?\n\nI'm looking for ideas for what that might look like. I'm graduating in less than 6 months, then I'm moving to a new city, I'm quitting social media and cutting ties with several people - draining friendships, toxic people and exes. \n\nI want to work on myself for the next 6 months so I become unrecognizable.",
        "created_utc": 1676887122,
        "upvote_ratio": 1.0
    },
    {
        "title": "lack of platonic relationships and jealous of my bf's relationships",
        "author": "annual_visitor",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1172q2q/lack_of_platonic_relationships_and_jealous_of_my/",
        "text": "[removed]",
        "created_utc": 1676886348,
        "upvote_ratio": 1.0
    },
    {
        "title": "The two ways social media changes our brain, and how to take back control",
        "author": "art-alive_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1172k2r/the_two_ways_social_media_changes_our_brain_and/",
        "text": "**1. Social media gives you dopamine hits**\n\n Dopamine is a neurotransmitter, a molecule that acts as a bridge between two neurons. While usually it’s thought to be the molecule responsible for pleasure, it is more involved with motivation, and how much we want something. It is also used to measure the addictive potential of any behaviors or drugs.\n\nLet’s say you open Instagram, see a post stimulating your brain, and get a dopamine hit. After that, you get a low and experience cravings. You scroll down. New post, dopamine hit. Then new craving. And so on.\n\nSocial media has an addictive quality that sucks you in and makes you lose your sense of time. It creates a powerful psychological addiction.\n\n**2. Your brain adapts and develops a tendency to have low dopamine**\n\nThere is another way social media changes your brain that is even more pervasive. It has to do with something called neuro-adaptation, the way the brain alters itself in response to a substance or, in this case, a behavior. The brain always tries to be in homeostasis, in balance.\n\nWhen you are on social media, you get all these stimuli, which are potent, novel, and numerous. The perfect way to increase your dopamine levels. Imagine, if you are on TikTok for even just 15 minutes, which is a very low duration compared to the average, you are getting bombarded by so many interesting, colorful videos that the real world cannot compete. After getting all these dopamine hits, your brain tries to restore balance. To do so, it does something called “opposite process reaction,” which decreases your dopamine levels for a while, even after you put down your phone.\n\nThat means that everything else becomes duller, a bit more boring… And ultimately, when you have to do real work or even a creative hobby, it is incredibly challenging to motivate yourself and focus.\n\nIn essence, social media dulls your senses and diverts you from what truly matters.\n\n&amp;#x200B;\n\n**The solution:**\n\nHow to solve this? It is simple but not easy. Minimize social media usage only to the things that bring value to your life, and delete the rest. Create your own philosophy of use for these apps. Change your behavior patterns around them. Stop using them as coping mechanism when you feel bored, stressed, or uncomfortable. Don't let these apps control your life, take back control",
        "created_utc": 1676885649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone in California of a way to afford an apartment?",
        "author": "ayobro8",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1171tz4/anyone_in_california_of_a_way_to_afford_an/",
        "text": "Any resources for rental assistance or section 8?",
        "created_utc": 1676882732,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have two passions...",
        "author": "AffectionateGoth",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1170ok1/i_have_two_passions/",
        "text": "How do I decide which one is a career and which one is a \"hobby\"\n\nThe money can vary and both jobs aren't guaranteed, so I can't decide on which one based on how much money I can earn.\n\nI'm worried that I'll get FOMO pursuing one career instead of the other",
        "created_utc": 1676878232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wasting my time after graduating, don’t know how to remotivate myself.",
        "author": "Steven0710",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117024a/wasting_my_time_after_graduating_dont_know_how_to/",
        "text": "\n\n\nSo I graduated in CS this fall, and up until recently I've just been doing nothing, playing videogames, sleeping, and eating. Mostly at the nagging of my parents, I decided to go back to work part time at the place i interned at( still as an intern) while I look for a full time position.\n\nA part of me honestly hopes I get fired so I can go back to my lifestyle of doing nothing. I feel like I haven't rested enough and don't want to go back to working, but I also think it'll just get harder to get back into the swing of things the more I stay around home and do nothing. What should I do?",
        "created_utc": 1676875848,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an 18 college student and I feel hopeless and alone",
        "author": "k1ingJellyfish",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116zr4u/i_am_an_18_college_student_and_i_feel_hopeless/",
        "text": "Hey guys so I really need some help and advice I feel like I am wasting my life. I have 8-10 hour screen time and I am constantly feeding my brain things to not be bored and feel alone. I have an addiction to nicotine, porn, and weed. I wake up 3 in the afternoon unless I have classes then I wake up earlier but I am always so tired and lethargic when I wake up. I feel like I am a slave to my phone and that I will amount to nothing. I am a computer science student but I don't retain anything from the lectures an I feel too unmotivated to even take notes. I feel like an NPC watching my human body do basic tasks. I dont feel in control of my own thoughts or actions. Everyday is an endless cycle of feeling nothing I don't feel happy or sad and the only thing that gives me pleasure are my instant gratifaction activities. Somebody please tell me what to do.",
        "created_utc": 1676874719,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you extroverts do when you want to spend more alone time?",
        "author": "StunSilver007",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116zocx/what_do_you_extroverts_do_when_you_want_to_spend/",
        "text": "I have a lot on my mind due to [outside factors I cannot change at the moment] and want to fully live everyday to its potential. But I always stop trying when I realize I’ve lost all my energy from being alone today. \n\nI want to engage in hobbies and keep busy but the cycle feels like its lapsing and I can’t think of things to do by myself. Can you help me?\n\nI like to work out but thats once a day at max and my hobbies are limited to time constrained and cost efficient options, leaving me with nothing left to keep me up. Am i seeing this wrong? Is there another factor potentially at play? Or do I simply need ideas to enhance my alone time.\n\nThanks in advance and please no nsfw answers",
        "created_utc": 1676874434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I remember my fuckups",
        "author": "TimeTraveller2022",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116zdqk/how_do_i_remember_my_fuckups/",
        "text": "I have a bad time remembering uncomfortable incidents, like if you and I had a fight at 1 pm and I will forget about it at 5 pm and will talk to you like nothing happened.\n\nThis is the biggest hindrance to my growth because I don't remember hence I do not learn. Yesterday, I was telling my brother about my high school story and he insulted me, belittled me, and told me he is not interested in my shitty stories. I was furious at that moment but today I did the same thing and got the same result- an insult to my face.\n\nObjectively looking my younger brother is a big-time piece of shit, but I am blinded by my love for him that I continue to talk to him and I get insulted or sometimes hit in the face. I don't want to live like that anymore, I forget about how people mistreated me and then repeat the same mistake over and over again, this is hell for me.",
        "created_utc": 1676873358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self esteem is all over the place!!!!!! 17f",
        "author": "MundaneFrog",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116yutg/self_esteem_is_all_over_the_place_17f/",
        "text": "Im obsessed with myself. I think I am deeply insecure about everything about me, from my looks to my personality, but I also think I am better than everyone sometimes?? But also feel inferior to everyone? I think I love myself and want the best for me, but I'm greedy and selfish and stubborn about it. My mood swings are so bad! I go from confident and happy to crying because of how much I hate myself within minutes. Im so tired of it",
        "created_utc": 1676871499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fake Improvement/ motivate Videos",
        "author": "asianforlife-79",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ytci/fake_improvement_motivate_videos/",
        "text": "Hi, So a big thing about me, and from what I have seen, There are those youtube Videos that motivate the viewer instead of actually doing said subject/ work. They will continue to watch these videos and be satisfied like they did the actual progress towards that goal but in reality, haven't progressed by 1%. This is me and my time wasted on Youtube.  I have been watching a particular set of topics for Improvement in finance, health, and school. But really never acted upon those specific intentions of the videos nor developed any significant progress. \n\n&amp;#x200B;\n\nBecause of those years, I was younger and more afraid than ever to step out of my comfort zone even when I knew so much for my age(15-18). Maybe it was because I was so scared to step out or maybe it was the hormones and drastic shift in mood that affected my choices, but what is in history cant change. \n\nNow in 2023, I actually feel like I am ready in a sense to progress and change myself, my Health, my mind, and especially financial.  \n\nWhat would someone say to help this specific type of problem?",
        "created_utc": 1676871349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to try whitening strips to make my smile look better because I used to get made fun of for my stained teeth. And Gaht Dayum this shits workin.",
        "author": "KwazieGFX",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116y25b/decided_to_try_whitening_strips_to_make_my_smile/",
        "text": "Pretty happy with this right now lol. I won’t say brands in the post bc I ain’t tryna look like an ad. My shitty dental hygiene plus all the coffee I drank as a kid stained my teeth below the surface \n\nBut aye, been hitting the gym for weeks and now I get pissed if I don’t go. Got my back acne under control, now my teeth getting white. Im startin to level up now after multiple half ass attempts in the past \n\nTryna be a catch come summer time 🤣\n\nIf any of y’all had the same issue as me try whitening strips or try a bleach treatment from the dentist if you’d rather, ain’t really considered those were options in the past and got called butter teeth all my childhood lol. No more",
        "created_utc": 1676868768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being with someone while also being flawed?",
        "author": "lSD3PIO",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116xsre/being_with_someone_while_also_being_flawed/",
        "text": "28, never been in a relationship before, have always been not great with women, but last summer I met someone. We were never official, but talked all day every day. I was very happy with her and could see her being someone I could possibly be with for real. \n\nBut I kind of sabotaged everything because, well I think deep down I just knew I wouldn’t be good for her. She was happy, funny, driven, successful, knew exactly what she wanted, just amazing in so many ways. And I’m just not. I live with my parents right now. I have a decent job but it can be so stressful sometimes. I get moody and antisocial sometimes. I have no idea what Im doing with my life whatsoever.  I just felt like I would ultimately make her miserable. (And Ive gotten worse since then probably... she was a huge motivator for me) \n\nSo to me the solution is to build some kind of life I can be proud of right? Be this kind of person that I think is worthy of a woman like that? It’s such a daunting task for me. Can I be with someone while Im working towards it? Will this kind of thinking just make me a loner for ALL of my life? I just feel trapped like I hate being the person I am but IDK when or how I got into this funk that I can’t find the will to change anything.\n\nAnyways, sorry for my ramblings. I honestly meant for this to be a more positive, like “let’s do this, how do I do this?” kind of post but it didn’t really come out that way. If anyone has any advice tho I would take it gladly",
        "created_utc": 1676867922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check out our new Channel",
        "author": "ron302en",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116wmmo/check_out_our_new_channel/",
        "text": "[removed]",
        "created_utc": 1676864029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck in life",
        "author": "Armybearv",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116v403/stuck_in_life/",
        "text": "[removed]",
        "created_utc": 1676859350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improve Your Life Immensely",
        "author": "TheTyPreneur",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116uicc/improve_your_life_immensely/",
        "text": "[removed]",
        "created_utc": 1676857563,
        "upvote_ratio": 1.0
    },
    {
        "title": "will sparkling water help me quit soft drinks?",
        "author": "TurkyySandwitch",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ud7n/will_sparkling_water_help_me_quit_soft_drinks/",
        "text": "hi I never knew about sparkling water\n\n&amp;#x200B;\n\nI tried one a cheap brand today and I really loved it, this actually could help me quit Pepsi which I been wanting to do since years... but im not used to digesting food without the soft drinks but sparkling water has very similar effect. I wanna quit Pepsi because I wanna cut sugar from my diet for good.\n\n&amp;#x200B;\n\nis it healthier? is sparkling water unhealthy in any way? also anyone tried sparkling water to quit soft drinks? thanks!",
        "created_utc": 1676857145,
        "upvote_ratio": 1.0
    },
    {
        "title": "My life isn't mine",
        "author": "Armybearv",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116u2tz/my_life_isnt_mine/",
        "text": "[removed]",
        "created_utc": 1676856311,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (21M) find purpose given my fortunate quality of life?",
        "author": "AnyPaint6129",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116txrl/how_do_i_21m_find_purpose_given_my_fortunate/",
        "text": "I am a 21M working in a well-paid position in a large corporation specialising in process improvement. I have a good quality of life and volunteer for my local emergency service in my spare time, allowing me to develop my practical skills. I keep myself busy, often working on projects for others and enjoy self-sufficiency. I have no dependents and therefore little responsibility beyond my personal, work and volunteering commitments.\n\nRecently, I have had an increasing lack of purposelessness, a decreasing value of self. Even though I believe I am valued as a person, I feel like there is little reason for my actions. What is the purpose of putting in all this effort if my quality of life or my level of contentment stays the same? How am I meant to sustain a sense of fulfillment for the next few decades doing this? The motivation I currently have comes from need others have for me. Without me, how would others cope as easily?\n\nI work with good people and the culture of the company is great, but I am not excited by my work which is quite monotonous and boring. Yet, the work is stable, and I am paid too well to consider leaving. I did not intend to work in the type of job I do, however a willingness to accept any work that I am offered has led me to doing so.\n\nI am a contractor and have been since I started working full-time after leaving school, therefore the opportunity to take leave is not feasible. I’m financially penalised for taking time off.\n\nI would consider myself as a no-frills type and am quite self-aware, conservative and realistic. I do not suffer from anxiety or depression, however, do overthink. I believe I am completely responsible for my actions and decisions, both good and bad.\n\nI have a good, civil relationship with my parents, and both are good people, but I do not aspire to be like either of them. I live with my mother and respect her tough-love approach to parenting over the years. She has her own mental health challenges and provides limited advice beyond continuing to work hard, taking regular breaks, setting yourself up financially, committing to your work and maintaining confidence. I’d say, somewhat military-like. My father lives interstate and had challenges relating to him when I grew up. In recent years, we have developed a good relationship and am currently helping him on an electronics project. He is very surface level, never been particularly hands-on and keeps a lot to himself. I believe that he would have never wanted children had it not been for my mother. I would consider him more of a friend than I would a father or role-model.\n\nI have been involved in the technology and startup sector for many years but am continually disappointed by the lack of reason and logic of those in the industry. Most people seem to follow trends, government agendas and consider technical capabilities without factoring in real-world problems and needs. I have made good money serving some of these people and have met their requirements, but the work delivers very little to no value once delivered. In some ways, I feel like I have made a living unintentionally taking advantage of the incompetence and illogical decisions of others.\n\nSelf-assessing my situation, a lot of my work does not have a physical outcome or any outcome at all. Many are soft changes (either digital or process changes which may or may not be implemented), therefore it is hard to visualise the value I deliver. In many cases, I do not necessarily believe in the work I do. I typically live within a short frame, a couple of weeks at most. I don’t have long term ambitions or life goals, beyond financial savings, as I do not find them reliable. I struggle to do things without purpose, therefore not one to socialise unprofessionally or party. \n\nI would consider my quality of life enviable and am incredibly fortunate for the opportunities I have been given. I do struggle to talk with others my age given my circumstances and challenges as they are very different to theirs. In some ways, I feel as though these issues are trivial and I should be grateful for what I already have.\n\nWhat do I do with myself?  How do I find a real, meaningful sense of purpose within the constraints of my lifestyle which I have with reason put upon myself?\n\nHappy to go into more detail if requested.",
        "created_utc": 1676855909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mastering Your Thoughts Is Easy",
        "author": "Actual_Ad9573",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116tezr/mastering_your_thoughts_is_easy/",
        "text": "[removed]",
        "created_utc": 1676854499,
        "upvote_ratio": 1.0
    },
    {
        "title": "I matter! I take up space!",
        "author": "nachochiiiz",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116t25a/i_matter_i_take_up_space/",
        "text": "Hi! I have always been lonely because I've always thought that I don't make an impact to people..I've always thought I was the daughter who didn't need attention because I was always polite and obedient, the friend that is \"low maintenance\" because I am \"drama-free\" and I would be okay if no one really checks up on me... basically I didn't think that I mattered because no one picked me first. I never thought I mattered to people as much as they mattered to me.\n\nBut last year I finally actively faced my issues by excercising, building a routine, reading self help books, meditation, and today I can say that I'VE BECOME HAPPIER...i know that my loved ones love me! and earlier I went to the store which I haven't went to as frequently as before and the nice old cashier told me that it has been awhile since he last saw me and he was happy to see me. \n\nthat made me realize that I DO make an impact on people! i do take up space! and it makes me happy!\n\ni dont know, i just decided to post this because I am genuinely happy and to those out there who feels like they're nothing... YOU DO MAKE AN IMPACT! YOU DO MATTER!\n\nI STILL HAVE A LONG WAY TO GO, STILL ALOT TO IMPROVE AND I JUST WANT TO SHARE THIS WIN ONLINE!",
        "created_utc": 1676853555,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my anxiety and past is going to ruin my relationship",
        "author": "verysillycat",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116sn9u/i_feel_like_my_anxiety_and_past_is_going_to_ruin/",
        "text": "I won’t go into much detail but I come from a very stressful household. I find comfort in the chaos and I’ve recently moved out with my partner and can’t seem to adjust to our quiet life style. I know this trait is toxic and I try so hard to be self aware but when I’m angry or upset I just totally lose the ability to control my emotions. I don’t want to be like this and I don’t want my 5 year relationship to fail because of this. I also have anxiety and on days I’m on edge this trait comes out more. \n\nSorry if this post doesn’t really make sense lol. I’m open to criticism and willing to improve thank you for reading C:",
        "created_utc": 1676852469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting a community college class tomorrow morning",
        "author": "ayobro8",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116s06m/starting_a_community_college_class_tomorrow/",
        "text": "For context I’m going to take a class based on career and life planning. This type of class attracted me because I honestly don’t know what I’m doing at this point in my life. I’m working a dead end fast in food job. But I wanna move up and do something more sophisticated and fulfilling but I’m not sure on where or how to go about it. I’m hoping this gives me a sense of what I’d like to do. Because I’m nearing my mid 20’s and I’m feeling immense pressure on myself for moving ahead in life. Any advice or suggestions on resources I could use to help me? Thanks!",
        "created_utc": 1676850800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey.",
        "author": "RepeatComfortable437",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116rm7o/hey/",
        "text": "For some background I’m a 21 Y/O male that’s just been revaluing my self and my life.\n\nOne thing I’m trying to do is just discover new things such as new music, new hobbies, more active social life, personal style etc. I can go on. Especially with music, as I’ve been listening to the same songs on my Spotify for years and I know if I wanna change as a whole, I think I should change what I listen to and find new music I like cause I’m tired of my current music. \n\nSomething I’m really interested in is the metaverse and AI 3D rendering etc. It seems like that is going to be what’s popular in the world within the next few years and I want to get in on it somehow, except I have little information on it, maybe I should do some research. But this is just a random thought.\n\nI’m really here to say I think all I want is just to live life life to my fullest and what that means to me is to do something great in this world. Leave some sort of mark. I’d love to. \n\nI feel like I miss out on my social life a lot. I want to have a nice friend group. Where we all care for each other, hangout and fuck around and just have fun with life. A best friend would be nice to. But I want to feel that. I want to do as much fun as the world has to offer. I just feel like I’m missing out as I’m spending my days here home alone not knowing which direction to take.",
        "created_utc": 1676849800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Compilation of MESSI creating the chaos on the pitch!!!!!",
        "author": "untasteable",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116rl24/compilation_of_messi_creating_the_chaos_on_the/",
        "text": "[removed]",
        "created_utc": 1676849717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a book and the fear of not being good enough",
        "author": "thepolskanator",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116rgco/writing_a_book_and_the_fear_of_not_being_good/",
        "text": "Hello friends,\n\nI am a big fan of fantasy novels and started to write my own manuscript. I have sent it to a small publisher and they wanted to cooperate with me. I am still revising it but I am never happy with the result. Its \"ok\" at best but not as good as most known fantasy books. Last summer I read Red Rising (great Science Fiction series) and was very impressed. Pierce Brown was mid 20 when he wrote it. I am a few years older but not as good as him.\nI try to improve and I read a lot of books about writing but somehow I got lost. Its hard to explain but I often think that I will never achieve more than a release by a small publisher. Its like you want to benchpress 160kg but your max is 100 at best.\n\nHow can I accept it and be happy with my \"average at best\" manuscripts?\n\nThanks in advance :)",
        "created_utc": 1676849403,
        "upvote_ratio": 1.0
    },
    {
        "title": "requesting advice on transition from lower class income to middle class",
        "author": "PapiJr22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116qpof/requesting_advice_on_transition_from_lower_class/",
        "text": "hey y’all im a 22M in my senior year of college and already looking at job offers that are over 65K. I also am in the army and they pretty much paid for all the college cost. I grew up with a single mother and on welfare. I’m looking for advice on how to transition from growing up with no money to now having a good paying job. I appreciate the advice!",
        "created_utc": 1676847601,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Mental Habits that can Make Anyone a Genius",
        "author": "Feeling-Suspect-7236",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116qggi/5_mental_habits_that_can_make_anyone_a_genius/",
        "text": "I recently read the book ' The 5 Elements of Effective Thinking ' which I am aware has been previously discussed on this sub. It's a fantastic book &amp; is great for returning to the basics in order to develop transferable skills which will improve your capacity to learn &amp; master almost any other skill. Here is my notes in a narrative form (as suggested by the book).\n\n## Effective thinking can make anyone a genius\n\nNo one becomes a genius by chance. Effective thinking is what leads to high performance. There are just a few habits that one needs to learn in order to become an exceptionally high performer.\n\n## Break down big problems, understand the fundamentals, then fail in order to succeed. Use questions to point you in the right direction &amp; innovate by extending idea pathways\n\nDon't face a complex problem head on. Instead, break it down into its fundamentals to build a strong foundation for success. When learning something new, accept that you will make mistakes. Mistakes show you what you're not doing right, allowing you to internalize your knowledge better. Ask the right questions to clarify and direct your understanding. Small ideas can lead to big payoffs.\n\n## Build a narrative instead of remembering facts\n\nWhen building a deep understanding of something, build a narrative to connect the facts together, making them easier to remember.\n\n## Master the easy part to succeed at the hard part\n\nPractice and master a simple concept in a simple context to unlock the ability to perform in difficult contexts with ease.\n\n## Break down skills and practice them in isolation\n\nFirst, understand a skill deeply, then break it down into components and practice each one in isolation. Spend 30 minutes developing each component of the skill, and don't move on until you've mastered it to 100%.\n\n## Work on problems you can solve\n\nWrite an outline of what you're learning and compare it to external sources to determine how much you truly know. Find the gaps in your knowledge and close them. If you face a problem you can't solve, find easier problems that you can solve. Focus on the subproblem and consider all possible angles to solve it.\n\n## Work on the core issue first\n\nWhen breaking down a problem, identify its essence by listing the distracting features and core elements. Analyze only the central issues and break the problem down to one key issue. Use this key issue to guide your thinking. Don't dress things up or ignore them, but rather see it, say it, and solve it. Write down an account of your weaknesses and strengths relating to a concept.\n\n## Try out alternative beliefs as often as possible\n\nDon't internalize beliefs based on authority and repetition. Instead, seek out ways to doubt the beliefs you hold and temporarily try out alternative beliefs. Attend events organized by those with viewpoints other than your own.\n\n## Fail 10 times &amp; persist without judgement\n\nOnce you understand something deeply, you need to fail continuously in order to to succeed. View failure as an opportunity to learn and grow, and reflect after each failure to discover new opportunities to improve. Go for 10 failed attempts without judging yourself or switching course.\n\n## If at first you succeed, try again and go bigger until you fail\n\nRemember that the best way to generate good ideas is to generate lots of ideas and throw out the bad ones. Take action and be prepared to fail. The process of failing will provide you with feedback and new insights. Whenever you come up with new ideas, whether through writing them down or through customer development, decide which ones are worth pursuing and which ones are not. Keep the good ones and discard the bad ones. In fact, if you succeed at something, try it again and make it progressively more challenging until you fail. Persist until you achieve consistent success, and then up the ante. You will have bad days, but they are your best teachers on what you should be doing to learn and grow. Learn from those lessons and do better. As you grow, you can make things harder and harder, build confidence, and tackle challenges that are so tough that failure is expected. Regardless, you will learn along the way. Remember that failure is a trial by fire; it can be scary and terrifying, but you must persist.\n\n## Formulate questions that lead to actionable steps\n\nNever pretend to know more than you do. Start by asking simple questions to examine the world and guide your learning in the right direction. Look at the question from multiple perspectives and frame it in different ways because this will help you understand the big picture more effectively. When you're listening, force yourself to ask questions, as this will make the world more engaging and easier to learn from. However, the wrong questions can be dangerous as they can waste your time and divert your focus away from your goal. Always ask, \"What is the real question here?\" at every opportunity. Real questions are specific and turn your mind to insights and solutions. They create a bias towards action and lay the foundation for what you can do on a day-to-day basis to generate results where it matters most. Questions must be answerable in ways that lead to action that you can actually take. It's worth noting that if the question leads to action that you cannot take, then it's useless. Find a better question that points you in the direction of what you can do to perform and achieve. Asking the right questions lifts you out of ignorance where you don't know the answer. But there exists another type of ignorance where you don't know the answer or even the question. You must try, fail, and learn from repeated failure to iterate towards better questions. If you don't know the question you need to ask, focus on questions that will lead you towards it, generating action that you can take to move closer to the right questions. Questions should also expose hidden assumptions and biases and clarify issues along the way. The ultimate goal is action that you can take. \n\n## The Importance of Following the Flow of Ideas\n\nIdeas are not isolated, they are lines that extend through time. To generate new ideas, we must follow the flow of ideas in the past, present, and future. By understanding how ideas have evolved from similar concepts, we can construct extensions and variations to create new solutions. We should take an existing concept, guess what comes next, and then iterate on it until we succeed. Failure and questioning are essential tools in the process of learning and generating new ideas.\n\n## Applying Effective Thinking\n\nThinking differently is the key to achieving success. Rather than waiting for ideas to come to us, we must apply the principles of effective thinking to generate them. When faced with challenges, we should break through the walls and find new ways to do things. We should also observe experts, describe the tasks they are doing, and identify the knowledge, skills, and strategies required to perform them at the same level.\n\n## Conclusion\n\nEffective thinking is a powerful tool that enables us to innovate and generate new solutions. By understanding, questioning, observing, networking, and following the flow of ideas, we can break through barriers and achieve success. Thinking differently and challenging our assumptions is the key to unlocking our potential and achieving our goals.",
        "created_utc": 1676846957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today get in nature, even if it's just bare feet in the grass 🐱",
        "author": "thesacredtease",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116q8q4/today_get_in_nature_even_if_its_just_bare_feet_in/",
        "text": "Today is a great day for grounding",
        "created_utc": 1676846424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why sticking with bad habits is easy?",
        "author": "The_g_mo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116q674/why_sticking_with_bad_habits_is_easy/",
        "text": "Hello , i want to know why sticking with bad habits is easy for example it takes really few time to develop a habit to scroll on tiktok ,but it’s been a week i’m trying to make a studying habit and i still can’t stick to it",
        "created_utc": 1676846247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living on the Edge",
        "author": "Business_Bumblebee80",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pzjy/living_on_the_edge/",
        "text": "There is a really good motivational video on Youtube called \"Living on the edge\" that I recommend you watch if you are into self-improvement.",
        "created_utc": 1676845806,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have social anxiety",
        "author": "SuperThrowAway50005",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pxjf/i_have_social_anxiety/",
        "text": "I have always been an anxious person. It was especially bad when I was a teenager and I'd have anxiety attacks very frequently. I thought it was getting better, I hadn't been panicky in a long time but today I realized that's not the case. \n\nI'm 17+2 pregnant. Today I asked my husband to pick me up some more baby asprin from the pharmacy on his way to work or on break. Normally this would have been fine but the pharmacy was closing early. \n\nMy husband is the most social, out going, person in the world. He adores meeting new people, makes friends everywhere he goes with no effort and loves being the centre of attention. \n\nI am the complete opposite. I lived at my last place for 11 years and made exactly one friend that I saw maybe once every few months towards the end before we moved. I don't enjoy meeting new people, I hate being center of attention and I am entirely happy to be home in my apartment alone and entertaining myself 99% of the time. \n\nSo my husband immediately befriended the neighbors when we moved in. He talks to them daily because the three of them all smoke so he seems them outside all the time. \n\nI've talked to them maybe 3 times total in the 3 months we've been here. \n\nThey had said before that with my husband working such long, late hours that if I needed anything to let them know and they'd happy to give me a ride or whatever. \n\nSo today my husband insisted that I ask them for a ride to go to the pharmacy myself. \n\nI had such a horrendous anxiety attack I was sobbing on the phone, trying desperately not to hyperventilate just at the thought. \n\nI tried to explain that I don't them, I'm not comfortable asking for anything and I'm really not comfortable going anywhere alone with them. \n\nHusband does NOT get it. He continues to insist it'll be fine and I'll have fun and maybe I'll make a friend! \n\nHe eventually wore me down and agreed to ask. I spent the next 15-20 minutes sobbing and trying to calm myself down and convince myself it would be okay. \n\nHusband called back to check on me and in the end said he did in fact have some time and he'd go get it.\n\nAfterwards he called me to let me know that he had picked everything up even though he was irritated that he had to leave to work to pick it up because I'm \"too terrified to talk to the neighbors\". \n\nSo I feel guilty and terrible and he has no understanding of it AT ALL because he's literally never had an issue with socializing. \n\nHe insists that it's entirely made up and in my mind and the only way I'm going to get over it is to just do force myself to socialize. \n\nThe thought of asking for a ride today literally sent me into the worst fit of anxiety I've had in years and I still feel terrible and teary over it. \n\nI know he's disappointed with me because I couldn't just go and ask like he would. \n\nI'm worried I'm going to pass this on to my baby and I just feel awful that I'm like this. \n\nHow do I fix it?",
        "created_utc": 1676845670,
        "upvote_ratio": 1.0
    },
    {
        "title": "thanks to all who helped me in hard times.",
        "author": "domfom1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pmbw/thanks_to_all_who_helped_me_in_hard_times/",
        "text": "Long story short I read comments and they really helped me to improve. Now I set my goals higher. I want to clear one of the toughest exams  in my country. And now wanted to aim higher. Again thanks a lot guys",
        "created_utc": 1676844918,
        "upvote_ratio": 1.0
    },
    {
        "title": "With some thought, I feel like I know my life purpose.. just a few problems.",
        "author": "letsgo2044",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pllo/with_some_thought_i_feel_like_i_know_my_life/",
        "text": "I feel like **COMEDY** is my purpose. I have a natural tendency to try to make people laugh, I’m also pretty successful at that. I love making others laugh. \n\nMy problem is that I laugh life experience and I have stage fright and fear of public speaking and I’m not much of a story teller. I’m currently 27 years old. How can i chase this? What should be my first moves to get around these obstacles.",
        "created_utc": 1676844870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone looking for advice?",
        "author": "Kingy_xx",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pl19/anyone_looking_for_advice/",
        "text": "Anyone looking for general advice/ guidance/ someone to vent talk to about problems feel free to message me! I'm looking to develop and improve my listening skills and would appreciate being able to work alongside people who feel they need someone to talk to and/or seek advice from. If you feel this is you, feel free to send me a message.\n\n&amp;#x200B;\n\nCheers, Kingsley :)",
        "created_utc": 1676844831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Routine critique",
        "author": "str8cokane",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116pe3a/routine_critique/",
        "text": "I’m not sure if this is something that has been done, but I’d like some ideas of small routine things to do, and I’ll share mine as well that I feel are good habits. I’m a very scientifically minded person so I only try to add things that have been proven to work. \n\n-vitamin d supplement (I live in north and in the winter this is a life saver)\n-Sunscreen/moisturizer (really helps keep my skin nice and prevents early aging /skin cancer) \n-various exercises, running weights bjj yoga\n-study mandarin with a tutor once a week, practice vocabulary on my phone daily \n-decaf green tea before bed (caffeine even if it doesn’t keep you up lowers sleep quality)\n-No red meat, lots of seafood &amp; veg\n-argan oil for beard and hair\n-low amounts of alcohol (haven’t drank in months, I find I wake up so tired)\n\nSomethings I have done in the past include meditation and journaling but I’ve fallen out of that pattern. Anyways what other habits do you guys do that you think are proactive for a healthy /happy life? Hopefully mine might give you some ideas too",
        "created_utc": 1676844371,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a very unintelligent person. I aspire to be a doctor someday. What are things I can do to become smarter?",
        "author": "IFoxTrott29",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ot9x/i_am_a_very_unintelligent_person_i_aspire_to_be_a/",
        "text": "What would I need to know to become a doctor? \n\nI'm no good at anything... smart, really. Math, science, all of that.\n\nAnd to be a doctor... I assume you have to be good at that stuff. \n\nSorry if this is too vague. I dunno.",
        "created_utc": 1676842919,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you keep yourself accountable for making positive change?",
        "author": "PatMustard420",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ok8j/how_do_you_keep_yourself_accountable_for_making/",
        "text": "I've been on the self improvement buzz for about six years now. Always the same, have weeks or months of generally looking after myself and feeling good and then it all goes away and I find myself in a bad place. Currently in a slump now and I feel like even if I start doing well again and making the right decisions the fact I've set off so many times and ended up in the same place is in my head and I'm starting to lose faith in myself.\n\nIf I start to make changes now what can I do to keep it up and keep myself accountable?\n\nThanks.",
        "created_utc": 1676842284,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to get out of negative thoughts?",
        "author": "highfriend90",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116nsqi/how_to_get_out_of_negative_thoughts/",
        "text": "I realized the other day I rent to fet stuck in negative thoughts..  it's anything from how people treated me poorly in the past or if thinking about the future it's negative thought about what could happen.. I'm looking on ways to change that..\n\nI do a lot to stay positive like working out, sleeping well, eating healthy, vitamin pills, I try meditation but that's usually when the thoughts come in..",
        "created_utc": 1676840369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tired of attracting the same kind of partner(s) and friends, but unsure what the signs of a good one would be?",
        "author": "perceivewithcaution",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116nlci/tired_of_attracting_the_same_kind_of_partners_and/",
        "text": "Sorry for the new account, I needed one my future ex boyfriend didn’t know about. \n\nLike the title says? So I have been cheated on in all of my major relationships, minus one. Not just like, a one night stand and he’s so sorry. No, like five other women that I know of, or a week long “work trip” to Vegas and he blocks me everywhere the day he gets there, that kind of thing. It just seems to be a mean spirited thing that all these people have had about them, but that’s been what been drawing me I think? Which is really not okay and I would like to learn how to do, be, and choose better. \n\nI was raised in a severely abusive household (yes I’ve been in therapy for the past 9 years), and like with my current situation especially, I’ve noticed that him and all the other men I’ve gone for and who go for me, well they treat and talk to me very much like my abusive mother used to.\n\nWell I want something different now. I also want to be the kind of woman who would attract someone *good* and *kind* and someone who is going to be gentle with and healing for my heart and spirit. Not talking about someone to “fix me” at all, but just someone who knows I am a work in progress, loves me anyways, and who also makes a conscious effort to at least not add to what needs to be worked on. \n\nSo now that I’ve got all this experience recognizing red flags, I totally know exactly what I don’t want. So I was steeping in that idea while making a list of negative qualities to keep in mind, and the question came up, “then what DO I want? What IS healthy, what does it look like?”\n\nThis made me realize that I’ve never experienced a healthy, dare I say happy kind of love with a partner before, so I honestly don’t really know what to look for initially or at all for that matter. \n\nSo I’m here asking y’all on Reddit, what are some green flags? I’m not looking to date again at all anytime soon. Not before I do some serious self examination and self improvement, just so I know in my heart and on my side of the street that I am actively striving to be a good person that another good person would be attracted to, either to share being in love or simply enjoying a friendship. \n\nThanks.",
        "created_utc": 1676839850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I get attached to people so quickly and strongly?",
        "author": "Unable-Restaurant-37",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116n1v4/why_do_i_get_attached_to_people_so_quickly_and/",
        "text": "I've noticed I attach very quickly to people and feel so strongly about people. I am a very loyal person and I so desperately want to love someone. I'm very open and wear my heart on my sleeve a lot. But I want people to also reciprocate this and when they don't I start to think I'm doing something really wrong with me.\n\nI was going on a few really nice dates with a guy and I think I've scared him off because I wanted an emotional attachment and kind of cornered him into telling me why he was being so emotionally distant with me. (ex = reason)\n\nWhere does my issue of attachment come stem from? Is this something that upbringing could influence greatly? My parents are together but have argued continuously (very badly sometimes for weeks and physically ) about my dads family probably every week since I've been alive lol. My mum is ill from ptsd from this, and my dad has been exposed to a lot of trauma at a young age and was very emotionally unavailable growing up. He cannot articulate feelings and is only learning now after finally going to therapy. They are only learning to communicate now (im 21). I am the mediator a lot and I protect my siblings from their arguments.\n\nI've also noticed somehow I'm always wanted a relationship (even when I haven't been in one in 2yrs) - I don't feel like adequate without someone else comforting me? When I was in a relationship 17-19, I felt really like I could live my life. Its like I need a constant there.\n\nAll I think about a fantisise about is having and building a life with someone. Even when I'm about to go to sleep. I'm really obsessed and I have been like this since I've been very young.\n\nI don't want to continue like this, I want to live on my own and feel adequate without another person. Because it hurts so much when people leave, or I find especially don't want a relationship with me",
        "created_utc": 1676838478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended books? Lost without goals after achievements",
        "author": "Bitter_Fill3592",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116n10i/recommended_books_lost_without_goals_after/",
        "text": "Is there a book that can help me understand this situation?\n\nI’m 31, I’ve come pretty far to achieve and make my dreams come true - move to the US from a poor country, get the CPA after years of study, get a good paying job with normal hours, green card, and going to a Top MBA.\n\nMoving to the US and going to a school there was my childhood dream, and after 20 years, though late, I’ve achieved them.\n\nBut what now? I’m sad, don’t know what to do now that I’ve achieved my childhood dream. Is there a name to this? Burnout?",
        "created_utc": 1676838417,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you keep track of mindsets you try to own?",
        "author": "oskiozki",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116mro8/how_do_you_keep_track_of_mindsets_you_try_to_own/",
        "text": "When I notice setback in my mind I try to solve it by searching solutions on the internet. When it makes sense I write it down inside my knowledge base. But I noticed it become a regular thing: after a while I forgot what was that mindset I was trying to own and it is just getting lost if don't notice again.\n\n&amp;#x200B;\n\nI don't know if I make any sense. But as things like todos, calendars, habit trackers getting a portion of my life I started to lose some adaptations I had in past. Do you have any suggestions?",
        "created_utc": 1676837782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 7 of becoming my own favorite person",
        "author": "Grouchy_Survey9739",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116mqio/day_7_of_becoming_my_own_favorite_person/",
        "text": "Luckily I feel much better than yesterday! I only had 4 hours of sleep but I just couldn’t sleep anymore. I went for a long walk and then I watched a movie, Pinocchio😊\n\nFeel good movies are a true remedy😅\n\nI decided to go on another long walk and I had a cup of tea with an old family friend. We had a good conversation about insecurities and stuff. After this I finished my walk. On both walks I only listened to motivational podcasts. They made me feel a lot better! \n\nMy ex reached out again and the girl that he made a mistake with while he was with me reached out to me that he started to contact her again. So I cut him short and didn’t invest in any more conversations with him. I’m so done with him. Thank you, next🙋🏼‍♀️\n\nI am watching another movie while I’m writing this and I am about to go to bed.\n\nSleep well everyone😘",
        "created_utc": 1676837706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 7 of becoming my own favorite person",
        "author": "FemkeDijkstra",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116mp7u/day_7_of_becoming_my_own_favorite_person/",
        "text": "Luckily I feel much better than yesterday! I only had 4 hours of sleep but I just couldn’t sleep anymore. I went for a long walk and then I watched a movie, Pinocchio😊\n\nFeel good movies are a true remedy😅\n\nI decided to go on another long walk and I had a cup of tea with an old family friend. We had a good conversation about insecurities and stuff. After this I finished my walk. On both walks I only listened to motivational podcasts. They made me feel a lot better! \n\nMy ex reached out again and the girl that he made a mistake with while he was with me reached out to me that he started to contact her again. So I cut him short and didn’t invest in any more conversations with him. I’m so done with him. Thank you, next🙋🏼‍♀️\n\nI am watching another movie while I’m writing this and I am about to go to bed.\n\nSleep well everyone😘",
        "created_utc": 1676837612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to go out alone and have a good time?",
        "author": "drironax3",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116mn8u/where_to_go_out_alone_and_have_a_good_time/",
        "text": "I have like 3-4 friends and all they want to do is sit in a house and get drunk. I want to go out alone and have fun but I don't know where to go. Only recommended places I've seen online are Bars or the movies which I'm not too fond of going to. Any recommendations?",
        "created_utc": 1676837473,
        "upvote_ratio": 1.0
    },
    {
        "title": "The worst moments of your life actually bring out the best in yourself.",
        "author": "L3Sc",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116mbz0/the_worst_moments_of_your_life_actually_bring_out/",
        "text": "As a person who has been deeply affected from the mistakes I made, I was at the deepest of all in last June. Then I started changing. I'm preparing for university application exam which is quite a big deal in my country. I started studying in July. Also started to workout. My body improved as well as my intelligence. I screamed against my weaknesses and focused on improving ever since. It didn't keep this good though I still had several breakdowns until now and I probably will have but this is how life is. There will be bad moments all the time. Just remember the darkest time of the night, is the one right before sunrise. Watch your actions, your behavior, your thoughts inside yourself. Look around you, look at successful people, look and realize what to do to be even better than them. Put on the mask of pure the best. Soon you will be the mask itself.",
        "created_utc": 1676836700,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ~10 months journey into hard self improvement",
        "author": "throwawaycartier2",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116m6dt/my_10_months_journey_into_hard_self_improvement/",
        "text": "Today is the day I [19M] hit 10 months of self improvement. Around 1 year ago I reflected on what type of man I had become and what types of sickness had conquered my mind and soul, I decided to improve myself for the better, but as you can see between a year and 10 months there are 2 months in between where the criterium I had put to myself were ending in failure, but every time I took notes and tried to avoid it the next time. For 10 months I have been succeeding with the criterium I put to myself. \n\nThe things I wanted to do were:\n\n- Lose weight: I went from 93-84 kilos, this might not seem much but I’ve also been weightlifting and cutting and I’ve taken a slow approach to cutting (only 100-200 calorie deficit) + I’m 188 cm (6ft2). I’ve been keeping it at 84 kilos because I think it looks the best on me. I also went no unnatural sugar and caffeine for (isolated) weeks and also stopped eating junk food regularly (once per month at best).\n\n- Go to the gym: the gym was near me so it was pretty easy for me to go six times per week and I (the first 4 months) did the “bro” split and after that this PPL x Arnold\n\n- NoFap: this is the only thing where it has been hit or miss. I’ve completed two NoFap durations of 90 days and 60 days in hopes of getting rid of a fetish that was growing on me and making me feel depressed and like a degenerate . After NoFap the urges did get weaker and my mind did get back into “factory” settings so to speak but the urges are still there and it seems like it won’t go away. This has made me very depressed these past few weeks. Also I haven’t watched porn for over a year. \n\n-My mental health: Here I decided to do two things, direct and indirect. I believe indirectly I already done a lot (Excercise, Nofap, etc…) but I also done a lof of things like spending more time with loved ones and buying gifts to people I love (my siblings, my parents, etc…) this made me feel very good and like a noble person. I also went out into nature more, spend less time with my phone, didn’t eat junk food, etc… . Directly I did two things: Read on how not to care about stuff (in other words: stoicism) and integrate them into my life and meditate, everday I put my phone away and just sat in a quiet room for 10 minutes and just breath very slowly and close my eyes.  \n\nThese were the major things but I also did some (time stamped) small challenges like:\n\n- No internet usage in the weekends (unless there were important things to do) \n\n- No phone usage for days (unless for calls or messages) \n\n- Intermittent Fasting a few days\n\n- reading 4 books per month (this was coupled with not using internet)\n\n- And other stuff…\n\n\nI’m sorry if this was too long but for the past few days I have been feeling really down and depressed for the reasons of those fetishes I had and I had to write this to remind myself the journey I have been through and that I cannot stop now even if the future might seem void.\n\nMy laziness and complacency is disrespect for the people who believe in me ❤️ \n\n\nThank you for reading and if you have any feedback please let me know and if there were any vocabulary/grammar mistakes it’s because English is not my first language.",
        "created_utc": 1676836313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Realistic ways to cope with being ugly",
        "author": "drpilh",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116m27j/realistic_ways_to_cope_with_being_ugly/",
        "text": "I need some help on finding realistic ways to help cope with being ugly because Google is not it. \nNow before I sound like a self pitying bitch I'd like to point out that I've made peace with the fact that I am ugly ever since I was 13 (17 now) just so I could avoid developing a victim mindset. \n\nBut I would also like to point that just because I've accepted the fact that I'm ugly doesn't mean it doesn't hurt when people call me ugly and do so because they feel the need to remind me.\n\nPhysical details about me include brown skin(i dont hate it like i used to so that was some progress),skinny and flat asf.\n\nI'd also appreciate people not commenting stuff like \"beauty doesnt matter\" and shit.Also i can't work out physically or build a protein filled diet because I live in a very controlled household and being skinny I'm not allowed to the gym(if it helps i try working out at home and attempting to be consistent with it). Some advice on how to not breaking down when repeatedly called ugly?",
        "created_utc": 1676836017,
        "upvote_ratio": 1.0
    },
    {
        "title": "build your dream physique with me",
        "author": "V_Dante",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ltsf/build_your_dream_physique_with_me/",
        "text": "[removed]",
        "created_utc": 1676835430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never stop journaling again",
        "author": "CG_Main",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116kyvj/never_stop_journaling_again/",
        "text": "That’s at least how I feel. This template made journaling almost effortless for me. It’s so simple but it works. Just print it out or fill it out on a tablet (that’s how I do it). \n\nIn the beginning it’s hard to start writing when you stare at an empty page. But with this it’s almost fun. It’s done in 5 minutes and my day is magically better. \n\nThis community provided me so much inside so far. I thought maybe I can thank you all. \nHope you find it helpful!",
        "created_utc": 1676833359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attitudes towards assumptions of what it really means to study, in lower educational levels.",
        "author": "x_red_xo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116kugr/attitudes_towards_assumptions_of_what_it_really/",
        "text": " Growing(18M) up in eastern Nigeria, and schooling in a small private school, I always performed awfully academically (33rd out of 35th kind of awful). I always struggled with reading; I hated it, but primarily because all my efforts of reading were always in vain, as I would 'read' an entire chapter and not be able to recall anything. Moreover, all these persisted through out my life until my senior secondary.\n\nAs life kept going on, I always ponded on the thought of why I was so different from my peers in terms of academic performance and what i would need to do to change. However, I then did a research and found out that my idea of reading; just looking at words in a book, greatly differed from what it was in reality; connecting words together to create a vivid image about a concept . It then dawned on me, that all my life I had always assumed that I knew what it was to actually 'study', without ever asking. All these cost me dearly, however, in the recent years i have greatly improved in my academic performance and also developed then habit of actually enjoying reading (which my younger self would not haven been able to imagine).\n\nThe reason I am bringing up this topic is because I feel that there might be people who are or might have experienced such circumstance and if you do belong to any of these categories, I would really love to know your thoughts and experiences pertaining to circumstances such as this or, experiences relating to academic growth in general.",
        "created_utc": 1676833075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparing yourself to others and feeling like nothing is ever going to be good enough to be happy",
        "author": "One-Introduction-566",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116kpdm/comparing_yourself_to_others_and_feeling_like/",
        "text": "Idk how to get out of this mindset. I’m mostly comparing myself to my siblings. I’m so happy for them and love them but I feel like they are doing so much better at life than me. Relationships, friendships, career, looks etc. I’m the oldest and I feel behind. I feel like I’ll never be happy cause I’ll never be doing as good as them… I’ll never even get a partner who is as good as my brothers  so now I’m jealous of their gfs. \n\nLife is never good enough because everything isn’t perfect and I can’t be happy unless everything is perfect and I have everything I want in life and it’s never going to be perfect. Plus I have regrets from my past and I can never undo those things.\n\nI can’t get over it! I don’t know what’s wrong with me.",
        "created_utc": 1676832728,
        "upvote_ratio": 1.0
    },
    {
        "title": "People need to stop taking the victim card in reddit",
        "author": "GivingUpOnVilkas",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116klvm/people_need_to_stop_taking_the_victim_card_in/",
        "text": "it just makes you become more narcissistic and never take countability for their actions I see this a lot in reddit than there are arguments about stuff in the comments because everyone has that mindset that they are always right why is it so hard to admit that you wrong?",
        "created_utc": 1676832492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I still feel terrible?’",
        "author": "osmanceril",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116kk3t/why_do_i_still_feel_terrible/",
        "text": "This past year I’ve met almost all of my goals. I’ve been very consistent with the gym and boxing, I’ve got a new job which is great for my overall career and that I’m enjoying, I sleep well, I eat well, I’ve got a skincare routine and everyone says I look a lot better and that I look like I’m doing well.\n\nSo why do I still feel so shit and insecure? I’ve followed literally every piece of advice to improve my life and I’ve been disciplined with it. I live life in absolute moderation, no alcohol or drugs, I read alot and I’ve been learning a new language whilst occasionally watching shows and playing games.\n\nI feel the exact same as before, just now I’ve got more energy. I’m absolutely miserable and feel so small. It’s like I’m going through the day now on autopilot and then when I get to my room I just want to cry and feel the worst almost every night.\n\nIm starting therapy soon as I’ve ran out of ideas, but has anybody else ‘got their life together’ yet still felt awful, and if so, what helped for you?",
        "created_utc": 1676832368,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I kill this dopamine addiction?",
        "author": "lamisturki",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116k8f6/how_do_i_kill_this_dopamine_addiction/",
        "text": "I’ve recently deleted all “mindless scrolling apps” (for e.g, TikTok, twitter) and I’m really struggling. I think this is when I really began to feel the weight of how heavily I relied on those apps for some sort of brain stimulus. I find myself actually craving to scroll through miles of brain numbing content. I’m glad I caught this dependency and deleted the apps, but I need tips on how to fill my time, or get rid of the need to waste my hours consuming thoughtless media. I sound so ‘first world problems’ right now, but I’m really working on become a healthier version of myself and receiving healthy doses of dopamine. Any help is greatly appreciated.",
        "created_utc": 1676831584,
        "upvote_ratio": 1.0
    },
    {
        "title": "End this slump and stagnant phase",
        "author": "peachnvanilla",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116k6y5/end_this_slump_and_stagnant_phase/",
        "text": "I've been in my comfort zone too much and I am aware that I have phone addiction now. I just want to create a new habit that would allow me to pursue my goals but I just can't seem to. \n\nI am aware that I'm the one who's holding myself back and I can't even do simple chores and tasks lately because I'm glued to my phone.\n\nI'm not blaming my environment but maybe I just don't have people around me who aligns with my goals and all. I'm influenced by them a lot and now it has caused me a great deal of doing stuff later than sooner.\n\nI want to start again but I don't know how.",
        "created_utc": 1676831485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self help Needed",
        "author": "Emotional-Watch7232",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116k613/self_help_needed/",
        "text": "Giving this a shot. Here I go. I’m looking for tips and advice to travel alone. Also looking for suggestions on where to travel anywhere here in the states (road-trip?) or anywhere on the planet. Long story short I moved to another state and took a really shitty job for my now ex girlfriend of 4+ years and at a crossroads of wtf to do. I have nothing to my name but my truck I plan on moving to another state after a trip of soul searching I guess and starting over. Thank you.",
        "created_utc": 1676831426,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I stop comparing me with others?",
        "author": "TutiFrutiTuti",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116jmkd/how_can_i_stop_comparing_me_with_others/",
        "text": "\n\nI noticed that I look too much at other guys, in bars, at public, in clubs etc, like I deeply study them, trying to copy their presence, to understand them, all them completely idk, and like I observe and compare them how, and in what, they are better than me? What and how they do better and then I envy-_-\n\nWhen this happens, others think I am gay or whatsoever, but I am not.\nI can't help myself?, I don't know why I do this to myself, maybe because of my father and his conditioning in the past, comparing me with other men, boys? Btw. He made me into perfectionist.\n\nWhen I see that other guys look better than me, have beautiful face, have better car than me, have better confidence and assertiveness, and get good along with girls I go crazy in my head and fret over them so badly.\n\nHow to stop this? \nI know I should focus on myself but I cannot resist but to observe them like they are something special I never will be?\nWhat insights could help me please",
        "created_utc": 1676830122,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I enjoy life?",
        "author": "Wonderful-Radish3774",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116j6nw/how_do_i_enjoy_life/",
        "text": "My life is okay right now, but I am not really enjoying it. It just feels like something is missing, but I don't know what.\n\nI have tried to find my passion, but all that does is make me hobby hop because nothing really sticks.\n\nI've been in therapy and on medication for a while, so I don't think my mental health is that bad at this point.\n\nI just don't feel fulfilled in life and I am kind of frustrated because I have tried everything.",
        "created_utc": 1676829056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck in trap of Inaction- Please Help",
        "author": "Immediate_Stretch_17",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116j1i5/stuck_in_trap_of_inaction_please_help/",
        "text": "22M here. I am pursuing a very competitive finance degree which requires consistent and disciplined study plan. Also a mandatory training in the relevant field goes along the way which is hell more than just a 9-5 routine job.\n\nI am just not feeling like concentrating anymore.. I know it sounds BS but after returning from work, I dont \"feel like\" studying though there's are around 5-6 hours left before its time for sleep.. I mindlessly scroll through reddit in that time and it has just my attention span and will to do things in the very least \n\nThe idea of sitting down and study makes me mentally tired and exhausted.. And I feel like I'd be doing wrong with myself forcing me to do sth i don't wanna do and in fact that forcefulness might even make the process unpleasant...AND next morning there's just that awful realization that another day just got wasted with nothing..\n\nPlease formulate a course of action that can do trick..I know that wouldnt be a magic wound or sth but what can end this endless disastrous rabbithole I am after with my actions?",
        "created_utc": 1676828706,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I depend on myself, in my work and in my own personal happiness.",
        "author": "Xof_Unit",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ip3x/how_do_i_depend_on_myself_in_my_work_and_in_my/",
        "text": "[removed]",
        "created_utc": 1676827877,
        "upvote_ratio": 1.0
    },
    {
        "title": "For anyone feeling behind.",
        "author": "JayceeF6",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116ici8/for_anyone_feeling_behind/",
        "text": "It’s okay. It’s you vs you. Not you vs your peers. As long as you are doing better then you from yesterday then you are improving :). My friend finished nursing school and got their driving license at 55 years old. So that kinda got me a little motivated and I wanted to share this with everyone. Because I’ve been suffering a little from this feeling. If my friend can do something like that then maybe we can as well. :) hope you have a great day today :)) you are doing the best you can.",
        "created_utc": 1676827036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 1",
        "author": "gossipgirl999",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116i50i/day_1/",
        "text": "I can’t stop crying - I’m upset at myself for being vulnerable with my ex. For trusting that he had feelings for me when it was so easy for him to let me go. I hate myself for even opening that door to allow him back in my life when I was doing well without him. I wish I could go back those 2 years and have never replied to him when he contacted me. I wish I had ended it sooner or I wouldn’t have fallen in love all over and have dated him and gone through all this.\n\nThis is finally over but it hurts so much. I prayed for us to be together, I loved him truly and I felt like he did too but he didn’t love me enough. It hurts that I’ve always been an option from choosing me and another girl and from me being an option of being together or not. I was happy before he came along - healing from what he broke me and now I’m broken again. Finding the energy to pull myself together again - it makes me mad that I’m crying my eyes out knowing he’s not. He could care less I’m gone. \n\nIt makes it worse that I’m on my period right now where my feelings are just all over. I’m trying to get myself back up but this is day 1 and I’m trying :(",
        "created_utc": 1676826537,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Dig Out Of a 3 year Rut?",
        "author": "doorhandler12345",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116i2gn/how_to_dig_out_of_a_3_year_rut/",
        "text": "[removed]",
        "created_utc": 1676826369,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s been almost a year since I deleted Instagram.",
        "author": "immuzy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116i24r/its_been_almost_a_year_since_i_deleted_instagram/",
        "text": "And my mental health and quality of life has never been better. I recommend doing this to anyone and everyone.",
        "created_utc": 1676826349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for Young Men - What I wish I knew",
        "author": "TraditionalThroat556",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116hutt/advice_for_young_men_what_i_wish_i_knew/",
        "text": "[removed]",
        "created_utc": 1676825895,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've have three back to back exams, with no break. How to manage?",
        "author": "Kindnessishot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/116hn7a/ive_have_three_back_to_back_exams_with_no_break/",
        "text": "So I've exam starting from 24th,25th and 26th.\n\nNo breaks.\n\nNow I've a plan and I'll stick to it i know but how do I get enough sleep and keep my mind fresh and up?",
        "created_utc": 1676825403,
        "upvote_ratio": 1.0
    }
]