[
    {
        "title": "Life Coach or Therapist?",
        "author": "__ToeKnee__",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kpgus/life_coach_or_therapist/",
        "text": "[removed]",
        "created_utc": 1678164426,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some ways to overcome long periods of having “the blues”?",
        "author": "IndependentAd6246",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kpfft/what_are_some_ways_to_overcome_long_periods_of/",
        "text": "I’ve been tackling some big mental health issues the past few months. Many nights I’ve been feeling lonely and kind of empty. Outwardly, I have a part time job, a healthy relationship, good family life, I work out and have a decent diet. But inwardly, every night I feel seems to be something missing, which is a very sad or somewhat isolating feeling. \n\nWhat are some healthy ways you recommend in getting over these feelings of detachment? Mostly occur during the evening/nighttime. I function fine everyday. Not sure what else I can improve with diet/exercise.",
        "created_utc": 1678164319,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to better concentrate?",
        "author": "Trash_Can_98",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kos0h/how_to_better_concentrate/",
        "text": "How do you guys concentrate? and just commit to something. ever since hitting my 20's ive jst had a hard time to just stick to something. and now that i'm almost at 30, i have done nothing with my life.\n\ni can't even study, my brain just starts to hurt and i just feel mad, why can i play games for hours and hours but cant even sit down to study for 30-60mins, even watching a tutorial i cant stick to it and watch the whole thing.\n\ni have been trying to improve my self , going to bed every night saying tomorrow is a different day, but no its actually the same day that's been on repeat  for several years now. \n\ni have been trying to get a job since losing work in 2019, and still cant seem to find work straight for 3 years, \n\ntook an art degree but dropped out of college cause i couldn't really connect with anyone, and i do want to go back, but financially i can't i dont wanna take another loan on top of my previous one.\n\ni have been trying to learn programming, mainly full stack for 9 months now, and i cant even finish the basics of HTML and CSS.\n\nI'm just stressed every day even for no reason. i have lost any motivation or passion, now im just a shell of nothing.\n\nHow do i improve my self when i'm just stuck in this whole trying to claw my way back out but mentally i'm just tired?\n\nand sure i can go seek a therapist or something but that costs money, sure there is free ones but the waiting list is so long, i have tried going to one before even twice, but both of them did not really care. 1st one just told me to go work at Starbucks that was his fix to all my problems.\n\ni feel like i just wanna honestly explode and be done with it.\n\nhonestly any suggestions on how i can just commit and contrate better on something is appriciated",
        "created_utc": 1678162504,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become more likeable?",
        "author": "Eagle_Blimp",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11koeg4/how_do_i_become_more_likeable/",
        "text": "I think I have this problem where everyone hates me by default. I’m not sure why. At work, with every call I get, when I pick up the phone, the person on the other end sounds like they’re already exhausted with me, even though we only just started having a conversation. Even when I used to use dating apps, most people thought I was creepy or weird. Even though I always do my best to be friendly and make people feel safe. \n\nAt the supermarket, the person scanning my food will make fun of the stuff I’m buying, like I’m not even real. Or maybe they feel I’ve done something bad, so it’s just kind of a revenge thing. I don’t know. \n\nAnyway, I very much do believe in the golden rule. I treat everyone with respect and kindness, and I like to make people smile. I try my best to helpful, or to stay out of peoples’ way when they’re too busy. I never say anything that might be construed as offensive, or at least, I try not too. I want to be a kind person because I genuinely believe it’s important. But clearly, I’m doing something wrong because everyone seems to hate me by default. \n\nI’m confused. Am I not actually kind? Is my voice unlikeable? Is my physical appearance disturbing? I don’t think I’m that bad-looking. Was I just born wrong? Is there something broken inside of me that people can detect? I’m confused and honestly a little sad. Please help me.",
        "created_utc": 1678161483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smile Your Way to Success: The Importance of Oral Health in Your Overall Well-being",
        "author": "OnlyRisk7993",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ko7r4/smile_your_way_to_success_the_importance_of_oral/",
        "text": "Do you know what's often ignored when it comes to personal health? Oral hygiene! Yeah, you heard it right. Taking care of your teeth and gums is not just about flashing a million-dollar smile, it's also about your overall well-being.\n\n&amp;#x200B;\n\nI've been through some serious dental complications due to a lack of access to dental treatment, and let me tell you, it's not pretty. But since becoming an engineer, I've been able to get a lot of dental work done that I couldn't afford before. And that made me realize how much my dental problems could have been prevented if only I'd been more mindful about my oral health.\n\n&amp;#x200B;\n\nHere's the thing, dental issues can lead to various health problems, such as gum disease, tooth loss, bad breath, infections, and even more severe conditions such as heart disease and stroke. Yes, you read that right. Gum disease can increase your risk of heart attack and stroke! So, taking care of your teeth and gums isn't just about maintaining a dazzling smile, it's about keeping yourself healthy and happy.\n\n&amp;#x200B;\n\nApart from the health consequences, poor oral health can also affect your confidence and self-esteem. It can lead to social anxiety and make it difficult to succeed in both your professional and personal life. Who would've thought that a missing tooth could ruin a job interview or a date, right?\n\n&amp;#x200B;\n\nSo, let's make it our mission to prioritize oral hygiene and take good care of our teeth and gums. Regular dental check-ups, proper brushing and flossing, and a healthy diet can go a long way in preventing dental complications and ensuring overall well-being.\n\n&amp;#x200B;\n\nI believe that everyone deserves access to quality dental care, regardless of their financial situation. That's why I've decided to use my engineering and AI background to make preventative dental care more accessible and free.\n\n&amp;#x200B;\n\nLet's work together towards a healthier and happier future, starting with our oral health. So, folks, don't forget to brush, floss, and smile!",
        "created_utc": 1678160960,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop living in the past",
        "author": "Itchy_Sundae8700",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kns2x/how_do_i_stop_living_in_the_past/",
        "text": "I 19f, am turning 20 quite soon. I constantly feel nostalgic and wish I could just wake up in elementary or middle school again. I see a kid or even anyone younger than me and I feel jealous. I realize that I'm still young, but I feel like I have to constantly keep reminding myself of this. I constantly wish I could redo my teen years as well, I always feel like I wasted them. I didn't have any hobbies and I just started doing so many things I wish I started earlier, like the guitar, programming, art, making youtube videos. I constantly tell myself if I started all of that earlier I would've been really good by now, and I'll be a lot older by the time I get good at any of that which I realize is really dumb but I don't know how to break out of this thinking. I'm also just terrified of being in my 20s.\n\nTLDR:\n\nConstantly dreaming about restarting my life so I can be a kid again/start my hobbies sooner/make more of my teen years",
        "created_utc": 1678159754,
        "upvote_ratio": 1.0
    },
    {
        "title": "To anybody struggling to find love or affirmation",
        "author": "Nblearchangel",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11knor7/to_anybody_struggling_to_find_love_or_affirmation/",
        "text": "Take it from somebody that has identified as a “loser” for most of their life. As someone with bipolar, life growing up was and still is incredibly difficult. I have a hard time making and keeping friends due to emotional instability and my job history has suffered too. Can’t hold a job. Even now. Don’t get me wrong, I’m making progress in the friends department but I’m 37 now and only just now turning the corner on that. \n\nMy family (esp my parents) has always loved me, I’m eternally grateful for that, but the one constant in my life is me. I’ve learned to love myself over the years because sometimes it feels like nobody else does. Ive developed hobbies. Interests. Things I like to do in my spare time. And even though I have actual factual zero friends I hang out with on a regular basis I’m never bored.  \n\nI’m into baking. Biking. I go on walks. Recently I walk dogs at a local shelter. I play video games online (mainly magic the gathering). I’ve been working on certifications to upskill my career. I have a growing (albeit slowly) business and I have a social media account that needs attention. And none of this involves having “friends”. \n\nDon’t get me wrong. I play board games and do things “in public” but only with acquaintances at local shops.  I don’t have anybody I can get in deep with and have conversations with. I have a support network and people I can lean on but my therapist gets the brunt of my frustrations. With work. career issues.  Etc. it can be isolating. \n\nThe only way I make it through some days though is because I’ve developed myself as a person to such an extent I’m comfortable with myself as who I am. I’m doing the best I can with what I have. That’s the most I can ask of myself and I don’t need anybody else’s approval or affirmation in the head space I’m in. \n\nTLDR: Keep at it.  I’ve been doing a lot of the same things as I see posted about here.  I was in and out of psych wards between 2005-2010 and even suicidal as recently as 2010. I’ll be honest. The last 5-10 years have been slow going but I’ve made a ton of progress in so many ways. Two steps forward, one step back can be kinda tedious but it works. Its been slow going but I’m “making it” and you can too",
        "created_utc": 1678159504,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you be practically smart and competent?",
        "author": "Internal_Argument673",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kng9s/how_can_you_be_practically_smart_and_competent/",
        "text": "(Note: Sorry this is a really long post!) I'm 21 years old and I currently have terrible self-esteem which is largely due to the fact that I am very mentally slow. I cannot seem to do the simplest tasks, and I often have to have people explain and remind me of things over and over again. It's strange because since I was a kid I was often known for my memory, as reading, spelling, or memorizing words or information doesn't come very difficult for me. Because of this I often have gotten good grades, but I am absolutely terrible with memorizing and understanding practical things &amp; following instructions that people give me. I've always been slow in this way and I take a longer time than the average person to study and do tasks. I am not efficient at all but would really like to be. \n\nAt my current job, I am lucky to have bosses who are so patient, but I know it's so frustrating for them to have to keep repeating things to me because my mind just doesn't understand it the first time and I hate having to slow down their work. It makes me really want to just quit. I am wanting to get evaluated by a doctor soon because it's making me less motivated to pursue what I want in life. wish I didn't make peoples work hard for them and I have been often called/thought of as dumb and slow in my life. Especially when I do stupid and unnecessary things I don't mean to and then get awkward looks and instantly feel so stupid and slow. \n\nNo matter how hard I try to work or try to focus on doing my best I seem to always mess up and feel terrible. To be completely honest I don't really think I have ADHD but am pretty sure I have a low IQ. And another thing I forgot to add is that I'm pretty hard of hearing at my age so I cant even imagine how annoying it is for others to constantly be asked to repeat themselves ... I just wish I was like others and I know I'm not the only one with problems but the things I do is just incredibly dumb. Because of this my anxiety, stress, and sadness have gone up SO much so I'm wanting to save up money for a therapist and a psych evaluation to I can know what has been wrong with me all these years but was wondering if there was anything I could do to become practically smart and more competent?",
        "created_utc": 1678158871,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being so obsessive/jealous?",
        "author": "Infinite_Ladder_4315",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11knbvd/how_do_i_stop_being_so_obsessivejealous/",
        "text": "I 19F, had an old online friend I cut off 6 months ago, our friendship got toxic due to both parties. I think I was attached to her and I still probably am. I find myself checking her and her friend's tiktoks/instagrams/spotify quite a bit. I did this more when I cut her off for the first time, and I don't do it very much anymore, but I still find myself doing it when I shouldn't. I usually check it when I'm feeling sad about her. I don't think I've gone a day where I haven't thought about her, I'm usually day dreaming about her as well. I even found out her home address and parent's phone numbers back in November. She has this other online friend I was sort of friends with and I feel hatred and jealousy towards her for still being friends with my ex friend, as well as her other online friends that are still her friends. The point is, I've realized I'm very toxic with how I'm being so obsessive over this person, so how can I stop being so obsessive and constantly checking up on her?",
        "created_utc": 1678158537,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm always saying stupid things and feeling regret. What can I do about it?",
        "author": "levri",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kmeyg/im_always_saying_stupid_things_and_feeling_regret/",
        "text": "Socially, I would say I maybe have a small amount of anxiety, but not enough where it really makes a difference in my life. My main issue is that I always do stupid things, whether it be making bad jokes, saying the wrong thing at the wrong time, being impulsive with my actions, etc. Because of this is I always feel regret, and most the time I deserve to regret whatever I did because they were just downright stupid. \n\nIt's hard to find a good example that isn't too revealing, but one out of many examples is I ubered home with a girl who lived in a bad neighborhood, which I knew, and was just put in a bad situation overall. If I had thought this through properly (and maybe a little more soberly), I would have never done this. Another is I made a really kinda awful joke in a group chat without even thinking twice about the possible negative effects that it might cause (the joke was so bad it got around so much that people who weren't in the chat came up to me and commented on it). And whatever I do/say that I regret is never representative of who I really am. \n\nMy overall reputation has severely diminished because of these downright stupid things I have done. Sometimes when I'm out on a weekend night I say/do the wrong things and get so mad at myself that I just get up leave and go home. But perhaps the worst effect of it is after I do whatever I did that I regret, my mind replays it and keeps thinking and contemplating on whatever I did and can never get away or forget it. What can I do? Feel free to comment any input about this, even if it's not a solution.",
        "created_utc": 1678156184,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know how to \"be myself\" around other people",
        "author": "k1lledbydeth",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11km4ke/i_dont_know_how_to_be_myself_around_other_people/",
        "text": "I've been talking to this girl and I really like her. We have a date in a few days but I just can't express my feelings to her at all. Every time I ask someone how I can cultivate a good reason between us they say \"just be yourself bro\" but I just don't know how to. The only people who I've really been myself around are my closest friends but even then I sorta reserve the real shit. I've been told all my life to hide my feelings and now people are telling me to express them. What can I do to learn how to \"be myself around people who I'm not super close with\"",
        "created_utc": 1678155467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wish I knew at age 21.",
        "author": "PurpleLatter6601",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11klqcr/wish_i_knew_at_age_21/",
        "text": "Really wish I knew at age 21 that probiotics are a gold mine in terms of brain health. Probiotics help brain and body health so much it really is a gold mine. They really help your social health. Your body is controlled by microbes and you don't even know it yet. The microbiome is some very big stuff and affects your brain and body in amazing ways. Really wish i had known at age 21, I just discovered it last year at age 33.",
        "created_utc": 1678154493,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [19M] attach myself onto people and become a bit obsessive. I really want this to stop.",
        "author": "TheIzuruProject",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kle0s/i_19m_attach_myself_onto_people_and_become_a_bit/",
        "text": " \n\nSo for a long time now, I've noticed a pattern in my behavior. I'll meet a new friend, enjoy talking/spending time with them a lot, and subsequently sorta build up what feels like an obsession with them. All I want to do is talk or be with them as much as possible. I really hate this cycle, because I can totally recognize when it happens, but I feel totally out of control. If I go even a little bit without their attention/validation, I feel super anxious and miserable. Then, I'll see them typing at me and I feel like I get this hit of dopamine.\n\nThis most often happens with my most distant friends emotionally. It's like I'm addicted to feeling special to them, since they usually tend to be more reserved, I feel like me being able to get them to really like me proves that I'm special or something?\n\nI know this behavior is definitely stemming from my anxiety, and total lack of confidence/self love. but I feel like I have no clue what to do about that.\n\nTL:DR: I get really attached to my friends to an unhealthy degree, and need help stopping.",
        "created_utc": 1678153630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement can be dangerous.",
        "author": "Lanky-Park-695",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kl7qu/self_improvement_can_be_dangerous/",
        "text": "I'm all for self improvement but as a man when you dive deep into this shit it fucks up your mind. All this Red pill, black pill, purple pill all these words like coomer,zoomer, mog are used to describe people as subhuman. Videos about height and how you're fucked at a certain height as well as being muscular is a cope for not having that pretty boy look that all women want and so you're just a short Manlet, which I understand where they are coming from but if you're short and unattractive, you have to hit the gym, what other choice do they have.\n\n\nLike wtf is this shit. Don't get me wrong, looks definitely matter as well as height. I'm very direct and honest but I never expected it to be this much of a cluster fuck. Like I'm 5'10/5'11 and I'm trying to improve my looks but the content that's out there suggesting people to move to certain countries to date for higher chances is mind blowing. Shit like \"SMV\" makes you feel like a slave, and that's not me saying you shouldn't improve your value but everything about this pill based content is so dehumanising.\n\nIt's all just a circle of negativity. Guys racing and putting their whole mental health on the line in order to reach that \"Chad\" status so they can escape the incel life they're trapped inside. I honestly have no idea what this self improvement has turned into.\n\nIf you're not 6'5 and have the face of a young Leonardo DiCaprio. You're just \"coping\" with self improvement. Whatever direction you take, they'll find a million ways to dehumanise you and analyse your jawline, face, nose, hair, and give you a scientific reason why you're subhuman and should just kill yourself and if you're not a 6'5 chad then you'll always be a little pussy and subhuman and if you decide to compensate by going to the gym or boxing or being a better man, then it's all \"cope\" and their negativity is contagious, when you get deep into their stuff, every time you meet a guy who's taller it conditions your mind to analyze that person as \"better\" and you're just an \"incel\" compared to him. It's all fucked up. I'm not saying by me arguing against them goes against their main point which is \"looks/height matters\". It does. But honestly you're better off not knowing it does matter and just living life because it'll fuck you up. I honestly wish I never discovered this side of self improvement. I understand the game is the game and you gotta play by the rules. But this shit is just beyond fucked. This can't be normal\n\n\nMy honest advice.\nGet off social media. Try to not be on your phone.\nThat's not me saying to not self improve. As I said the game is the game. You gotta improve your facial and physical attractiveness and other areas. But don't dive into those sub categories that look into more and more and more different ways with different techniques of doing stuff etc etc. That's when you end up with the pill stuff. Just hit the gym. + (Mewing) to improve facial appearance as well as skincare and that's pretty much it. Obviously fashion comes into play but don't start getting specific and analysing everything. Just do the basics and stay off your phone. Even if you don't have social media installed. Just stay off your phone.",
        "created_utc": 1678153195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overcoming fears and anxieties !",
        "author": "Objective_Divide5154",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkze8/overcoming_fears_and_anxieties/",
        "text": " A few weeks ago I was gonna sign up for karate and just as I got up to the door I saw how many shoes were there and I panicked. I was cutting it too close by showing up right when the class started and my anxiety overtook me, I walked right out that door and never looked back. I felt ashamed of myself but also I didn't want to be disrespectful by showing up at that time for my first time. It all worked out in the end though cause fast forward to today and I just finished my first BJJ class, I am in love. I showed up 15 minutes ahead of time got a tour of the place. I got a tour and talked to the guy at the front desk about the programs, the pricing, different gyms I could go to for boxing and then sat there patiently waiting for the class to start. I got to work with someone experienced who could teach me and show me the ropes and It was amazing to make so many mistakes and know its just a part of the process. I got to go through drills and I got to roll with 4 different people and it was amazing, I loved every bit of it. All of the pushups I have been doing must have paid off because the head instructor kept saying damn this guy is strong and he asked me If I am a wrestler. All of my anxiety was gone and all of my fear was gone the moment I walked into the place and introduced myself. I got to be social with people, men, women and I got to put all of my focus onto just being not worried about anything just being a part of existence and holy fuck man its everything I could ask for. I told my dad about it and he told me he's gonna pay for it and that's just the icing on the cake. STAY POSTIVE MAN AND PUT YOURSELF WHERE YOU WANNA BE EVEN IF YOURE SCARED! You might not know what's gonna happen but damn if you know what's been happening and its not what you want its time to dive into the unknown! Cheers guys fucking give er!",
        "created_utc": 1678152640,
        "upvote_ratio": 0.99
    },
    {
        "title": "Confidence about school",
        "author": "coleman33112",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkpl6/confidence_about_school/",
        "text": "I was wondering how can I reach confidence about the school work I do as well as the studying and all the other things for school. I'm usually always stressed, scared about it, panicking about how much work I'll have to do, scared of not being able to understand the material in time and flop exams, thinking of school work 24/7 for no reason and so on. I just want to do school work fully confident that I will finish in time, I will understand and that I'm good enough. \n\nOne of my hypothesis is to not care about having good grades so that I dont stress about school and then, end up getting good grades because of that confidence, but I'm not sure if its valid since some people want good grades and are still confident about school.\n\nI'm feeling confident right now, which usually ends the next day when I wake up, and I'm just wondering how I can feel this way all the time with things related to school.",
        "created_utc": 1678151958,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some love/heartbreak advice",
        "author": "gettingrickrolled12",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkoq3/i_need_some_loveheartbreak_advice/",
        "text": "Let me give you context.\n\nI fell in love with my best friend. We started having something similar to friends with benefits. I was planning to move out of the country for some months, so I was thinking on making it official until I come back home. \n\nOne day, his friend kissed me while we attended a birthday party. Since then, my best friend told me he wanted end things. First, he was really mad. Then, we talked, and decided to give us time. \n\nOf course I want to be with him the way we used to be. But, we need some time apart to heal. \n\nNext weekend I’ll probably see him in a birthday party. I was planning on not attending, so I can avoid uncomfortable situations. But, maybe seeing him will help us to relieve tensions. \n\nHow do u guys think I should react when seeing him? Oc it’ll be hard. Cause I’m still thinking about him. I’m going to study for several months in another country, so that’s the last time I’ll be seeing him. \n\nAlso, I want to have a little glow up before I see him. Since January, I have already done things to change. E.g., going to gym, etc…",
        "created_utc": 1678151899,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get help as a teen?",
        "author": "Peebo__",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kklon/how_to_get_help_as_a_teen/",
        "text": "Tldr \nHow to get help without going through parents? \n\nI want to say that my parents are good and care but are blind or ignoring me. I’ve tried looking at online programs but they all want parents consent, I’ve tried having to ask to go to the doctor ( they don’t take me to the doctor for check ups so I had to ask ) and booked me a zoom appointment and then they mentioned something about medication and my mom canceled the next appointment. And I’ve had my guidance counselor call her and tell her for me, but it didn’t work.\n\nI’m lost and doubtful I can get help till I’m 18 and have to pay for it myself, this anxiety is out of control and the depression I can manage enough but this new phobia is messing me all up and needs outside help I can’t do myself.\n\nIs there help? Or am I gonna have to continue fighting through this myself?",
        "created_utc": 1678151690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am scaring all the men away",
        "author": "trib_alism_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkl1w/i_am_scaring_all_the_men_away/",
        "text": " There's a pattern I see in my dating life. I meet a man I like, we begin dating and attraction grows. Then suddenly, far too quickly, he becomes my obsession. Every time I get a text, I hope it's him and am disappointed when it's not. I wonder what he's doing all the time and I'm frustrated if he's not choosing to spend his free time with me. I want a lot of time dedicated, early on, and it often causes tension.\n\nRecently the pattern repeated itself. I met a guy. We met at the beginning of February and quickly began sleeping together. At first I didn't think it would ever be anything serious, and I wasn't so hot about him. Soon later, I became hooked. He was texting me consistently, so even though I wasn't seeing him as much as I would have liked, I was ok since the communication via text was frequent, and mostly initiated by him.\n\nAt the end of February, I was eager to start seeing him more, specifically outside of his bedroom. Even though we both agreed to wanting more than casual sex, we had not been on more than a first date. We both agreed to make this happen.\n\nThen he stopped texting me as frequently. There were texts going unanswered, and good morning texts not being sent, as they had. He explained that he was very busy with work that week. (But..who is too busy for a few back-and-forth texts?) Well, I freaked out and cut it off with him over text message. I figured if he didn't have sufficient time for me now, he likely never would. Now I regret it. I liked him and would have liked to see him more.\n\nWhat can I do to stop myself from obsessing over the people I date? Was it a good idea for me to cut him off? Was I expecting too much consistency from him too early? I can't decide if I made the right decision. Is there a way to train myself to appreciate casual romantic relationships for what they are, without trying to advance things further?",
        "created_utc": 1678151645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there people that never achieve happiness?",
        "author": "Outlier_mentality",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkile/are_there_people_that_never_achieve_happiness/",
        "text": "My response to a question from a client today. They asked \"\"I feel like I am destined never to be happy. Do you think there are people like that? Do you believe there are people who can never achieve happiness?\"\n\nI can’t tell you that everything will work out and turn out fine in your life. I cannot promise you a happy ending, whatever that might mean.\n\nWhat I can promise you and what I believe with my whole being is that, at the moment when you are struggling, you cannot possibly imagine how big of an internal transformation you can experience. Your attitude towards life can change overnight even when your external circumstances haven’t changed at all. So no, I absolutely don’t believe that there are people who can never achieve happiness, fulfillment, or any positive feeling or state that we all strive for.\n\nI appreciate other thoughts and opinions 🙂",
        "created_utc": 1678151471,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is all too much.",
        "author": "Lanky-Park-695",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kkftm/this_is_all_too_much/",
        "text": "I'm all for self improvement but as a man when you dive deep into this shit it fucks up your mind. All this Red pill, black pill, purple pill all these words like coomer,zoomer, mog are used to describe people as subhuman. Videos about height and how you're fucked at a certain height as well as being muscular is a cope for not having that pretty boy look that all women want and so you're just a short Manlet, which I understand where they are coming from but if you're short and unattractive, you have to hit the gym, what other choice do they have.\n\n\nLike wtf is this shit. Don't get me wrong, looks definitely matter as well as height. I'm very direct and honest but I never expected it to be this much of a cluster fuck. Like I'm 5'10/5'11 and I'm trying to improve my looks but the content that's out there suggesting people to move to certain countries to date for higher chances is mind blowing. Shit like \"SMV\" makes you feel like a slave, and that's not me saying you shouldn't improve your value but everything about this pill based content is so dehumanising.\n\nIt's all just a circle of negativity. Guys racing and putting their whole mental health on the line in order to reach that \"Chad\" status so they can escape the incel like they're trapped inside. I honestly have no idea what this self improvement has turned into.\n\nIf you're not 6'5 and have the face of a young Leonardo DiCaprio. You're just \"coping\" with self improvement. Whatever direction you take, they'll find a million ways to dehumanise you and analyse your jawline, face, nose, hair, and give you a scientific reason why you're subhuman and should just kill yourself.\n\nIf any young people are here. \n\nYour self improvement should be.\n\nMental health \nFacial Attractiveness.\nPhysique.\nSuccess.\n\nThese pill based videos will have you going in circles and feeling depressed and lonely.",
        "created_utc": 1678151279,
        "upvote_ratio": 1.0
    },
    {
        "title": "I physically can’t workout my abs and it’s hard not to give up",
        "author": "throw_away2874",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kk25j/i_physically_cant_workout_my_abs_and_its_hard_not/",
        "text": "I (F18) try to work out my abs all the time. I try to but I only feel it in my back, no matter what I do or what advice I get from friends I can’t seem to actually feel anything in my abs just a pain in my back. I workout the rest of my body fine but anything to do with my abs just causes back pain. I have very mild scoliosis, but I don’t think it should have an impact on me like this.\n\nIf anyone has experienced the same thing or anything similar what did you do? Any advice would be appreciated:)\n\nAlso sorry for the poor grammar I just needed to get this off my chest lol",
        "created_utc": 1678150349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might get expelled from college",
        "author": "NiggsBosonParticle",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kjpmt/might_get_expelled_from_college/",
        "text": "So I made a really big mistake in my life. I’ve always been on the whole self improvement grind, reading books, getting disciplined, and had big dreams for the future. However, I had been led astray by doing illegal things for the longest time to try and get money. I’d been stealing and selling things ever since I was in high school, thinking that I would be able to make seed money for starting my own business. \n\n\nRecently, I’ve been caught for a felony level theft on my campus which could not only land me in legal trouble but also get me expelled from university. I’m only 19 years old, and it feels like my life has fallen apart in the last month, and I have no one to blame for this but myself. I completely intend on getting clean going forward, and leaving my criminal past behind, but it really feels like everyone is trying to punish me to the maximum extent. It seems like they’re trying to make sure I get put in a hole that would be extremely difficult to climb out of over a few thousand dollars. I do not intend on blaming others, an wish to embody the stoic ideals of taking responsibility for everything that happens to me. It doesn’t seem like anyone intends on giving me a second chance. I know I deserve no sympathy as a piece of shit thief but I don’t want my life and my future to end like this, what should I do?",
        "created_utc": 1678149512,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m tired of living this life, I give up",
        "author": "Kailanirgf",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kjaa0/im_tired_of_living_this_life_i_give_up/",
        "text": "I’m only 19 and I regret all of the decisions I’ve made in my life that lead me down the path to being a fucking worthless loser. All of my childhood was filled with fear, anxiety and depression. I barely had any fun in life because I was always in trouble for my grades because I hated school and how we are forced to learn garbage that doesn’t matter, and how the teachers and students have treated me. \n\nDuring my senior year in 2022, people were telling me they were gonna cheer my name when they saw me walk across the stage. I thought I was gonna make it, but I fucked up because of one assignment i didn’t do for English class, and I missed out on my graduation. \n\nAll the people cheering my name, having my peers congratulate me, feeling like I finally made my family proud, all down the fucking drain. It slipped right through my fingers just like everything good in my life. \n\nThey told me to go to summer graduation, and that it was gonna be just like the “real” one. I was adamant that it won’t be but they swore it would be. It wasn’t. My father and many family members didn’t bother to go because it was the “failures graduation”.  \n\nI regret it to this day and will regret it for the rest of my life that I never got to experience this. I have no high school photo or anything. I have fucking nothing to show for not killing myself for going through school.\n\nIt was at this moment that I realized that I was never gonna get restitution for all of the suffering I had to go through, all of the disappointments, mental breakdowns and crying meant nothing. \n\nIt was the moment that I realized my life was always gonna be disappointing and shallow, with nothing to show for it.\n\nI started going to community college because I ruined my chances to get into anything, but I dropped out because the anxiety is too much, and I know that I’ll only end up working some remedial ass job and work my life away doing something I hate anyways. I’m pretending to go so my parents don’t kick me out of the house and disown me. Once they find out I’m going to kill myself and that’ll be it.\n\nIm tired of living a life where I fucking lose at everything and have no joy or happiness or friends.\n\nThere are a lot more things that happened to me, so if you wanna know, ask.",
        "created_utc": 1678148480,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you not let bad things happening all around the world to impact your health?",
        "author": "yellowpeanut22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kj2zf/how_do_you_not_let_bad_things_happening_all/",
        "text": "So I believe I'm overly empathetic because whenever I read or hear something horrible happening to someone else, even if it's a complete stranger, it makes me feel all kinds of emotions - pity, grief, anger, it's different with each case but it's generally just a strong negative emotion that immediately wrecks my mood for a few days.\n\nI keep being told to just stop watching the news and limiting the content I get to see on the internet, to avoid coming across triggering things like this, but frankly it's just not possible. You will always come across someone who'll bring your attention to the latest news.\n\nAnother thing people suggest is that I simply hyperfocus on something else, like the job or a hobby or picking up some new activity, so that I'll be too busy to worry about things that have nothing to do with me. I tried this too but realised that it also doesn't work, mainly because I'll just be doing the thing while the triggering topic is in the back of my mind, and I end up thinking about it at night or bottle it up for so long that it eventually leads to a panic attack.\n\nI'd appreciate other suggestions.",
        "created_utc": 1678148006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing it",
        "author": "Hopeful_Impression_4",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ki4me/losing_it/",
        "text": "I honestly need help, I’ve been on a job hunt while I survive on trading crypto.. I never considered myself a pro just a young man taking risks so he and his family could be able to eat and have shelter.. I lost it all in different situations! I have no one who can help me! I’m throwing this out here! Someone please help",
        "created_utc": 1678145814,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop convincing myself unlikely and magical things will happen?",
        "author": "Icy-Ad-6827",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kh8dl/how_do_i_stop_convincing_myself_unlikely_and/",
        "text": "I have a wild imagination, and due to some medication I am on I have very vivid dreams. Sometimes these dreams are hard to differ from reality, and I forget they weren’t real.\n\nFor instance, I had a dream I won the lottery. Now when I look at houses (looking to buy soon) I see a massive million pound house and think oh I’ll just wait until I win the lottery. Then I remember that wasn’t real and I have this crashing guy feeling that my real life has only the budget I have.\n\nI had another dream lately that I had loads of plastic surgery and ozempic and looked loads better. I need to book my wedding date soon, and I find myself thinking that I don’t want it too soon or the scars won’t have healed and I won’t have time for my weight loss… then again the crashing instant realisation that I look ugly and when I get married I will still have all my flaws.\n\nIn my head, logically, I know that all these things are unlikely to happen to me, but how do I get it out of my subconscious?",
        "created_utc": 1678143807,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I heal from my bad past?",
        "author": "RavioliGangsta",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kh819/how_do_i_heal_from_my_bad_past/",
        "text": "How do I forget my horrible past that caused me all the issues I'm struggling with?\n\nHi everyone. I hope y'all doing good. I'm new to reddit when it comes to posting so please excuse any mistake that i could do in my very first topic!\nHere's my situation: I (20F) simply cannot stand my life anymore. And while It's impossible for me; for personnal reasons, to go to therapy right now, I think that it could be better if i at least shared what i'm feeling inside with someone. And since I have no one to talk to, I decided that Reddit will be a great idea!\nI'm a girl who lives with her parents and I'm a university student. I lived in a toxic household and have been raised by a baby-sitter. I was a smart kid and did very good during school and it's still pretty similar right now(I mean it's not as good as it was because m going through a lot) My mom has traumatized me in every possible way (It just feels bitter to talk about it now so if it's necessary to mention what the things that caused me trauma are, please let me know in the comments and I won't hesitate to explain more about my childhood/teenage years). The thing is, due to trauma, and what I've been exposed to at an early age, I caught so many wrong practices and habits because they were at the time my only way to cope with the living hell my life was. These issues are self-harm(I only did it when i was 15 but it completely ruined the appearence of my left arm) a fucked up sleep schedule (I either struggle with insomnia or I'm unable to wake up no matter how much hours I slept, it depends) and horrible eating disorders (I went through episodes of anorexia, bulimia and BED , and still struggle with binge eating to that day, which caused me a 30kg weight gain that f**** up my body image). Now my only goal is to reconciliate with myself and heal from all the trauma that I got through. My mom would never understand nor assume the pain she caused me, so discussing the topic with her and waiting for an apology isn't an option. That being said, I'm only trying to become better with my own self, regardless of who hurt me in the past. I truly dont care about anyone anymore.\nSo to resume, here are my little goals (I'd be truly happy if I receive advices from you, or encouragement to accomplish what now seems impossible for me ):\n-losing all the weight I gained through the years of wrong eating habits (emotional eating and filling my stomach with food instead of expressing my feelings). This just feels hard because I'm stuck on an undereating/overeating/bingeing/regretting cycle.\n-reduce/eliminate the appearence of my horrible SH scars that I am deeply ashamed about. I tried commiting suicide once.\n-seeing myself in a mirror without feeling ugly. I'm always being told that I'm gorgeous but my mind just doesnt accept it. And this is hard to deal with.\n-I'm moving to a different country the next year, so I hope that I'tll bring change to my desperate life. Wish me luck!",
        "created_utc": 1678143783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quit many of my addictions cold turkey but I feel miserable, am I doing too much too fast?",
        "author": "holymode",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kh6p9/quit_many_of_my_addictions_cold_turkey_but_i_feel/",
        "text": "Last week I quit vaping, porn, and other smaller stuff but I have gradually become depressed without feeling sad. I read that this can be a symptom of withdrawals but this depression has been gradually developing for some weeks now and this might have been the last straw. I have absolutely no drive, my anxiety has come back along with many traditional symptoms of depression which are negatively affecting my social life and school. Maybe I’m doing too much too fast, so would it be better to keep going in this current state or tackle my addictions one by one gradually. If anyone has any sort of tips or advice please feel free to share.",
        "created_utc": 1678143698,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help",
        "author": "Guilty_Hunt_7797",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kgxjt/i_need_help/",
        "text": "\nHello to whoever can help me. I am a 20 year old male dealing with some type of issue I don’t even know what to call it. I will explain my issue but first you have to hear the background and how it leads to now. I graduated high school never having worked a job and was super scared to get one once I graduated. After I graduated I got a full time job. I was doing ok while working I was happy I would come home after work and play video games and hang out with family and friends during the weekends. After about a month of working this girl gets hired to work alongside me. After about 5 months of working together everyday we got told that we weren’t allowed to work together anymore and would have our positions switched. I didn’t get to spend as much time with her because we couldn’t be together but I was still very happy with everything in my life. Probably around 2 months later we started dating and my life became even more amazing and I was so happy with everything. Around another 3 months after this I was told that I was going to lose everything I like about this job (mon-fri mornings) and that I wouldn’t be compensated for it. Because I was high off of life and thought everything was perfect I decided that they aren’t gonna treat me fair so I’ll quit and go somewhere else because I’m worth more than what they are giving me. So I quit and she decides to quit as-well. We go on a vacation have some fun just nice happy stuff for like a week or 2. She finds another job quickly I didn’t because I was slacking because I had 10k dollars saved up so I felt like I didn’t need one super bad. About another month goes by and she moves in with me and my family because she has a bad home life and for probably the next 3 months I see her every day before she goes to work I would sometimes take her and pick her up from work. I would eat dinner with her every day and even go to bed together every night with her. It’s now been probably 3-4 months without me having a job. Eventually I find a job that I thought I would have enjoyed. It was good money and a good schedule that was close to home but after working 2 days I quit. I couldn’t take it. I felt like I was missing out on life and I missed her so much and just felt sad and I guess depressed because all of my day felt like it was working. During this period my brothers girlfriend broke up with him and my girlfriends family life was really affecting her mental health so I don’t know if it was affecting me or not. Anyways I quit and everything went back to the way it was and I was happy again. After another month or 2 she gets a new job that is much better and she moves out on her own. I was sad that she left but nothing abnormal after probably another month without a job and her being moved out I get another job. Before I started I was super happy with life me and my girlfriend were doing well. I got to play video games and hang out with friend and family for the past 6ish months (minus the 2 days I worked) and I felt ready to get a job and that I could handle it and it was what I had to do. Today (3-6-23) was my first day I was super nervous the night before so I didn’t sleep very well but was still prepared for today. I was nervous all the way until I got there and was still nervous while working. After like an hour or 2 I feel great nothing is wrong. Then I get hit with a wave of missing my girlfriend and that life is awful and I’m wasting my day working and that this is how life shouldn’t have to be. After a little pep talk with myself things get better and I work some more and then around an hour before I am done the same thing happens again. This time I couldn’t shake it and I am here in my bed crying trying to figure out what to do. I understand that I need money and I understand that everyone in the world has a job and that so many people have it way worse than I do but it’s not helping me feel any better. I get that I may sound like a spoiled guy and that I’m being a baby but I want help. I don’t know what to do and I feel like I can’t deal with/ handle what’s going on. My mom said if I quit this job that she’s gonna take me to the doctors and I don’t feel like that’s nessicary. If anyone can help any way possible I would appreciate it so much.",
        "created_utc": 1678143141,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be happy with what you have?",
        "author": "caldeesi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kgrkc/how_to_be_happy_with_what_you_have/",
        "text": "I'm always wanting new makeup etc etc etc. I have everything I need and more. How can I be happy with what I have and consume less?",
        "created_utc": 1678142768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't get over Ex despite \"doing well?\"",
        "author": "TheAromaticGuy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kgp96/cant_get_over_ex_despite_doing_well/",
        "text": "Hello,\n\nJust want some advice:\n\n\\- I'm in my late-twenties, \"good-looking\" according to people, in medical school, in shape (been lifting since high school), and also not socially inept -- I have gone out with numerous girls and have no problem getting a date. Sounds great right? Not really.\n\n\\-I broke up with my ex 2 years ago, we dated for 6 years. I broke it off because I was getting complacent in the relationship even though this girl was amazing and nothing but good to me, and we were also super compatible. I thought I can easily find with someone else. No, not really. Finding good people you vibe/connect with is actually incredibly rare. I feel so incredibly stupid for breaking up with this girl and ruining a perfectly good relationship. \n\n\\--&gt; After my breakup, I went on and had sex with lots of girls. I won't say a number but it was a borderline egregious number. Even went to strip clubs, prostitutes, the whole nine yards. \n\nThink I literally destroyed my soul during this process and I have become like a robot. \n\n\\-I can't seem to build an emotional connection with anyone. I can't develop feelings for any of these girls even ones I've talked to for months. \n\n\\-Past 6 months or so, I've deleted all my dating apps and focused on myself thinking this would make me better, but I feel even more lonely than ever? \n\n\\-I'm terrified of becoming a 50 year old bachelor since I'm incapable of building a connection?\n\n\\-Any advice?",
        "created_utc": 1678142627,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's step 1 to getting your shit together?",
        "author": "ipiers24",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kfyo6/whats_step_1_to_getting_your_shit_together/",
        "text": "I'm in my early thirties. I'm doing fine but just kinda stagnated. Don't care about retirement. Pretty lackadaisical about most things including bills. I pay them, but don't do a good job of keeping records. \n\nI feel like I never hit that last level of adulting. I function. I work, have friends, but really have some aspects I need to get together.",
        "created_utc": 1678140962,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're ever feelings unmotivated or you hate doing the tedious work. Here's a HACK that helped me a lot.",
        "author": "ConsistentOwl5067",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kfojl/if_youre_ever_feelings_unmotivated_or_you_hate/",
        "text": "[removed]",
        "created_utc": 1678140335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold showers make my head hurt",
        "author": "NefariousnessOk2537",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kflax/cold_showers_make_my_head_hurt/",
        "text": "So I've been taking cold showers since last summer and lately its been really hard because the weather is so cold (some days it reaches 6°C). Some of the last times I have actually taken cold showers often my head hurt kind of like a brain freeze for a few seconds and it is starting to concern me. Should I do something about it?",
        "created_utc": 1678140130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no sense of identity please help 18F",
        "author": "diejfjsjfj",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kfk1k/i_have_no_sense_of_identity_please_help_18f/",
        "text": "[removed]",
        "created_utc": 1678140064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Media Free ~ Almost",
        "author": "Livviva",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kfary/social_media_free_almost/",
        "text": "Evening Redditors~ Soooo okay, in my self improvement journey I have this vision of being completely social media free. We all know Instagram, Snapchat, Facebook, twitter, ETC; are bad for our mental healths. And we also know that they can be good for keeping up with people you have met throughout life. So with that being said I am a 23F And I have been interested in the idea of completely deleting my Instagram for awhile now. (Only social media I have left) my delimma or “attachment” to it is I suppose the amount of people I have on it- that I know once I delete it, will never see again. I also have a pretty cool instagram, I spent my late teens, early twenties taking dope pics to give it an ~aesthetic~ so those are my two attachments I have to it. I guess I’m writing this so you can give me some tips on releasing those attachments and deleting it. Perhaps tips is the wrong word, maybe you can help me wager out the pros and cons of deleting Instagram to help sway me into a decision. Thank you for your time",
        "created_utc": 1678139515,
        "upvote_ratio": 0.99
    },
    {
        "title": "I’m lazy, and I’ve spent the last 5 years of my life failing to change",
        "author": "ashensunday",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kf5ju/im_lazy_and_ive_spent_the_last_5_years_of_my_life/",
        "text": "TL;DR: I cant do things that I should be able to do. I have no excuses, I simply dont do them. No matter what I try, I cant bring myself to do them. These are also things I’m actually interested in (I do freelance writing and am involved in a production house as a scriptwriter, I also write songs and see myself as a songwriter), so the issue is definitely not the work itself.\n\nI can’t keep up with my responsibilities. I’ve tried a lot of things; schedules, theories, focusing on getting through the day, forcing myself to do it, not being too hard on myself, accepting what is or isnt in my control. Nothing lasts. I always fall back to the same self-destructive routine of wasting my time.\n\nI was an optimistic person. I had my self-help phase back in Uni, and I learned a lot of theories and ideas that I was very excited to apply to my own life so that I could actually improve. However, every time I try, I would always fail in some ways. I would stop following my schedule after a few weeks, I would go back to porn after attempting to stop (I didnt do cold turkey, but it still didnt work), I would just not do things I told myself I would do. At first, I actually didn’t mind it at all. I expected to fail, so it didnt bother me. After all, it would be weird if I’d succeed immediately when doing something for the first time (that’s not to say I failed on purpose, I tried to the extent of what I thought was the best I could do). However, after a while, I started feeling like I wasn’t making progress. I kept failing to do what I told myself I would without any good reason whatsoever. I simply didnt do it.\n\nEvery time I fail, I would lose just a little bit of faith in myself. I feel like that amount has built up. Now, I have a hard time believing in myself at all. I’m sick of not being able to get out of this rut I had put myself in. Now, I’m very pessimistic about myself and my future. I have lofty goals and ambition, and I’m self aware of the fact that I will never reach them if I dont set myself straight. I’m also self aware that I’m the problem, and beating myself over it (which I now do all the time) isnt going to solve my problems. I often feel like I have too much self awareness that it becomes detrimental. I can never get out of my own head. I constantly fail to do things that are completely within my capabilities to finish.\n\nI’m not really looking for advice. With respect, I feel like I’ve heard it all before. I just dont know how to apply all these knowledge and theories I supposedly understand. I know only I can do it, I just dont know how. I feel like I’ve tried everything there is to try (broadly speaking). I’m in a state of learned helplessness (which just means that my mental state prevents perfectly good advices and solutions from working due to my attitude and personal biases). I feel like no one can help me through this, and the only person that can (myself) does not have the right mindset and is too caught up in his own thinking to have his mind changed. I really want to be proven wrong, because this has caused me a great deal of distress.\n\nThanks for taking your time to read all that. I feel hopeless and I dont know what to do. Excuse me if it feels rambly, I needed to vent.",
        "created_utc": 1678139209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self doubt is ruining my life",
        "author": "NoTooth8297",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11keb1m/self_doubt_is_ruining_my_life/",
        "text": "So I 24M have been on self improvement for a couple years since I quit drug addiction. But self doubt is ruining my life.\n\nI’m from the UK, I’ve failed multiple driving tests. Tried multiple instructors, I drive perfect, comes to the day of the test, and my heart beats out my chest and mind goes a million miles per hour. I train MMA in a high level gym, I’ve excelled in the gym and usually impress people much higher level, it comes to my fight, and exact same thing, mind goes insanely fast, heart beats out, and I lose every fight. ANYTHING that I WANT, I fail. \n\nIt’s really depressing me. I dont wanna be that guy that never drives, I don’t wanna be that guy that always loses but man it’s so hard to pick yourself up and keep going when subconsciously you know you’ve already failed. I try and tell myself “you can do it” an I just don’t believe it. Even when I think I believe it, I fail again. \n\nI don’t know what to do anymore.",
        "created_utc": 1678137414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Side effects or just something i cant control",
        "author": "Sisioje",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ke5eu/side_effects_or_just_something_i_cant_control/",
        "text": "Hello, Thanks for taking your time to read this post, for past i whoud say 2 years i stugle with life with the strugle i meant i don't have that much friend i rearely talk even with many friends when we go to school (before this lost control i got i was literally super talkative) another strugle i get is literally mind set (before I enjoyed life now im depressed and i have anxiety) I regularly have a workout, meditation not that much, stooped playing video games. Any solution to turn my life around for the better. Thankd for taking the time to read this post",
        "created_utc": 1678137080,
        "upvote_ratio": 1.0
    },
    {
        "title": "what should a person use ?",
        "author": "WannabeAlcibiades1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kdypr/what_should_a_person_use/",
        "text": "The Internet is a vast thing where good and bad things exist simultaneously..... But how can I acquire most of the good stuff and from where....I , 18 M , am confused... Which apps should be used and which shouldn't be....I currently have a huge screen time and I have insta reddit YouTube Netflix Twitter on my phone . I'm not very good at expressing myself online if u get my question very good if u don't feel free to ask and also correct me anywhere if I've written anything wrong 🙏",
        "created_utc": 1678136689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self esteem groups on Reddit",
        "author": "MariahsMakeup",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kdf2b/self_esteem_groups_on_reddit/",
        "text": "Hey everyone. Just recently discovered This subreddit and have lots of reading to do.\n\nA big issue that I have that causes a lot of struggles and stress in my life stems from low self esteem that has been developed since childhood. I am pushing away my spouse and my friends because of it. I did this in my last relationship too. I want to make a change now. I’m tired of living this way. \n\nI also have adhd and high functioning autism.\n\nI’m looking for resources on building self esteem, groups or subreddits on here, or useful websites, or books.\n\n\nThank you!!",
        "created_utc": 1678135563,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am becoming more dumb",
        "author": "Cute-Badger-9493",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kd69z/i_am_becoming_more_dumb/",
        "text": "I feel as if im becoming more and more dumb. Its hard for me to form sentences and i even did stupid, but really big mistakes at work, that i might get fired. I cant get decent job cause i do everything with a lot of mistakes. And a few tears back i was completely difirent person. I used to be able to hold a conversation and be not as socialby awkward, i used to be not so emotional and now i cry literally every time i get even a little bit of crytics. Idk what to do. I read books, watch esucational videos, but i feel like just general knowledge left my brain and its imposible to get new things in my head.",
        "created_utc": 1678135043,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do I Lie about myself",
        "author": "charliewestrick",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kd4yf/how_do_i_lie_about_myself/",
        "text": "I'm about to start a full-time job and it'll be the first time around people regularly since I graduated school. I don't know how to mention things like how\n\n* i have no friends\n* i dont have career goals/ a dream career\n* Despite living in the same house with them, I'm not on speaking terms with my father or brother\n* I'm currently suffering from Insomnia, have been for three months, and as a result I struggle with 5-10 lb weights\n* The closest thing i have to social encounters are purely sexual in nature\n\nSo instead of being honest, I'd rather lie because I'd rather not plant red flags in the ground, and talking about the last one will get me sent to HR asap like I did when I worked a campaign.\n\nHow do I lie about myself, or at least go about  this?",
        "created_utc": 1678134963,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I be more likeable",
        "author": "Someonerandom717",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kd3rp/how_can_i_be_more_likeable/",
        "text": "\nHey everyone I’m a 30m.  My back story is my teens and early 20s I used to be more outgoing and social and had no problems talking to anyone or making friends.  It wasn’t until I was around 22, 23 when I got extremely depressed because of things that went on with my ex now.  I found it hard to make friends and I was extremely miserable and unapproachable, and also believed that nobody cared about me or liked me.  I went the last 7, 8 years going to shit which caused me to change my mindset and be more resentful.  One thing I forgot to mention was before I hit rock bottom I was always super nice to every, to the point I was a huge pushover, and I had a better sense of humor as well as look approachable.  Now I’m 30 years old, I want to get rid of the mindset where I think people don’t like me, and I want to stop being unapproachable. I hate knowing that there are people who think I don’t like them and I’m tired of always being misunderstood because I have an angry resting bitch face. I want to go back to being the sweet person that I once was, and I want people to know I don’t hate them.  I want to be more likeable to others and I want to show people that I have a sense of humor. I’m tired of being a boring person and I want to be more fun to be around. I know I’m not the funniest person but I want to joke around without people thinking I’m attacking them or I want to joke around and make people laugh.  People always says that I’m judgmental and always worry, I don’t know why maybe it’s the way I talk or say things but I don’t want to be viewed as this.",
        "created_utc": 1678134899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have nothing to do",
        "author": "Beneficial-Crab754",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kcymu/have_nothing_to_do/",
        "text": "Hi, I am currently a student in college. I am doing well in school but besides that I don’t have much going on. I go to class come back and do homework for a bit if I have any. The rest of the day I’m just scrolling endlessly on tiktok or YouTube. I just don’t have have anything to do or work on. I have no hobbies and have 0 social skills. I want to change for the better but have don’t have a routine and get lazy all the time. I want to consistently work on something new, constantly be doing something, I have wayy too much downtime which is a problem I know some people would love to have but I’m tired of it. I want to be more busy and live a fulfilling life.",
        "created_utc": 1678134613,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hung out with a girl at a wedding. (I was a groomsmen, she was a bridesmaid). All went well, and we seemed to get along. I asked for her number and she gave it to me. I texted her yesterday, but still haven’t gotten a response. What do I do?",
        "author": "NaturalTop02",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kbr7r/i_hung_out_with_a_girl_at_a_wedding_i_was_a/",
        "text": "I had gotten her number before (two years ago) but had to get a new phone. When I did text her two years ago, she said hey, but then never replied going forward. \n\nSo this time, I joked and asked her if I got her number this time, if she would respond, and she laughed and said yes. \n\nLooking back, in person I might’ve been trying too hard and too much.\n\nI said “Hey, it’s ____”",
        "created_utc": 1678132048,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're fine. Just relax.",
        "author": "mydominomi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kbg1t/youre_fine_just_relax/",
        "text": "I've been lurking this sub for a month now and some post are motivational and uplifting... but it's also unsettling how many posts/comments on this sub come from young men borderline objectifying women. As in talking about women like they're an object to receive after they do A,B,C,D. \n\nI started taking my self improvement journey seriously this year and went on reddit to find subs with like minded people. Like I said there are gems of human beings here and people who just need help. \n\nIt's just a little disturbing reading how seemingly obsessed some young guys are here about wanting a relationship/sex. And a lot of the posts from the same guys will also talk about everything else going on for them like careers, thier fitness, etc. Which is all good things! If you're doing well on those great! I celebrate you... and focus on that. You have time to get everything else in life you want as long as your work on them and keep a positive attitude. Relationships will not be the end all be all if you aren't happy with yourself. \n\nAnd if I could just give some advice as a 25F... 1 treat everyone like a friend: men, women, attractive or unattractive people and just be genuine, that's how you'll attract someone like minded in your life.",
        "created_utc": 1678131386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing it",
        "author": "Hopeful_Impression_4",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kbci5/losing_it/",
        "text": "I honestly need help, I’ve been on a job hunt while I survive on trading crypto.. I never considered myself a pro just a young man taking risks so he and his family could be able to eat and have shelter.. I lost it all in different situations! I know no one who can help me! I’m throwing this out here! Someone please help!",
        "created_utc": 1678131176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally feeling something",
        "author": "Hnanavan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kb2b0/finally_feeling_something/",
        "text": "\nFor a while I struggled with having no emotions. I didn’t feel anything. I got executed from uni I’m trying to built a business which isn’t going well. My parents didn’t know about all this. Until this morning. A letter from my uni came to my parents house saying that I’m no longer a student. My parents and sister tried to called me but I still haven’t replied or picked up their calls. I feel like a failure. I feel like I’m a liability to everyone that I care and love. \n\nI wanted to feel something when I found out my parents got the letter and found out I’m a no longer  a student. But again I didn’t feel anything. Not a stress, not a fear, not a sadness. So I went to a drugstore bought a razor. Went to my apartment and I immediately start to cutting myself. For the first time after four years I self harmed again. And I finally broke down and cried as much as I could. Now I’m laying in bed. I feel exhausted. Still not replying to my parents and my sister. I feel like a shit",
        "created_utc": 1678130567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help. Desperately! Be kind.",
        "author": "ecs2578",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kb1x0/need_help_desperately_be_kind/",
        "text": "She won’t leave. 13 years together. Two kid that were planned and the other I was lied to or manipulated into. I had sex one time in six years. One time only and I was told she was on the shot and pills it’s all covered lol and also told here mom “wouldn’t be funny if he got me pregnant?” Not funny when your with a vindictive, manipulative person. \nI’m exhausted. I hate feeling the way i feel everyday. It’s no fun. \nMy first son was born and I missed the first few months of his life. I was in the hospital and when I got out I was still trying to fight for my life relearn everything etc…\nWe were married for six years or so. I always did my best to treat her well. I did everything I could to make her content. Even paid for every single bill! No worries for her. My second daughter was born. Then something happened. Idk.The rage or hate came out. I have a journal of unthinkable things a person can do to another human. She filed for divorce twice! First time cancelled it. Second time Xmas eve got served and she said “Merry Christmas.” \nWhen peeps file or get a divorce they usually leave? She never did ever! The cops is she on lease? Lol. Lawyers nothing lol. Idk. Lol. Anyway I was like I’ll buy a house for the kids as I and that should do it. I did buy a house. My DUMBASS was like maybe new house and surroundings will change her ways to the kids and I. The kids need their mom. She stuck with me on my death bed.\nIt didn’t change except adding one kid to a toxic family which I know I did the deed but I know in my heart I was lied to I know she did something with. That cum. She has zero clue what’s going on in the school in their lives and the baby majors health issues.Later that summer she said she was getting her own place! I was behind ecstatic. So happy for kids and I. \nThen the next week. I’m pregnant. Lol. My life had come crashing down.anyway she never left and she didn’t leave I tried every avenue and I’m still stuck in this past fall of October 22 I was working a pretty damn good job that paid for all my bills and my kids bills that’s the only thing that matter to me but the only way out since I tried every avenue it’s like the X amount of money good for you just to leave us alone she said yes so I went through and got her the X amount of money I quit my job or left my job for my kids well-being and I took out my retirement and I gave her X amount of money-so she can get her own place and take the kids on the weekends and I can have closure and move on with my life and the kids lives and focus on being a good dad instead of trying to focus on getting air and freedom every single second of the day she blew that fuckong money in 2 to 3 days. I’m here physically that is it.. I’m so lost and lonely. For years. If you read my toxic‘s mess I appreciate it if you did thank you I just need some help or feedback because I don’t know what to do anymore.",
        "created_utc": 1678130543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Useless, empty actions.",
        "author": "mrartivanov100",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kassl/useless_empty_actions/",
        "text": "[removed]",
        "created_utc": 1678129996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to get rid of fetishes",
        "author": "RecipeObjective",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kargd/want_to_get_rid_of_fetishes/",
        "text": "Hi all,\n\nAlthough most of the time I have regular sexual activities with girls, I masturbate regularly. I tried to skip it completely, mainly because I noticed that without it, my self confidence increases.\n\nWhen I avoided it for more than a month, the quality of sleep deteriorated. Also, there has been no evidence that avoiding masturbation is beneficial.\n\nWhen I was a kid, I have developed some fetishes and during the teenage years, the attraction was significantly related to the fetishes. Later on, I have improved my social skills and throughout years, I have developed a strong sense of empathy. When I am with a woman I usually almost feel her words and the attraction depends on her physical appearance and behavior. When making a physical contact, I don’t have any problem with attraction and those fetishes are not relevant whatsoever. When I am alone, though, fantasizing about fetishes causes erection whereas the imagination of woman’s body and behavior doesn’t cause erection.\n\nThus, there is a big disconnect between the actual world and fantasies; what works in the real world, doesn’t work in imagination and vice versa. Sometimes it somehow feels dumb when I get aroused by fetishes in the imagination that don’t work anymore in the real life. It would feel better if it would be possible to get rid of fetishes in the imaginary world.\n\nI am wondering if such disconnect is common and in case anyone faced the same experience, in case it bothered you, how did you get rid of it.",
        "created_utc": 1678129918,
        "upvote_ratio": 1.0
    },
    {
        "title": "About making some changes in my life…",
        "author": "El__Capi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kar38/about_making_some_changes_in_my_life/",
        "text": "Hi there everyone, just wanted to share and ask for feedback about the changes in my life I want to make…\nBut first i want to share the causes, the issues that are making my goddamn mind go crazy… sadly I think is mainly women. See, I have an older brother (3.5 years older) and since kids I saw myself overshadowed at his side due to his social skills, specially with women, he can get what he want with every women he desires (I want to make clear that I don’t want to play with women’s feelings or anything like that), I would talk about I have ADHD but at this point I think is not as essential as I thought ‘cause he also has it, so my main problem is that I’m locked in my mind and I just can’t be that kid I used to be, that doesn’t care about anything and could make anyone laugh and enjoying my presence, both men and women, and now I just can’t, I think i’m in good shape, I hit the gym and stuff but now I know it doesn’t matter your physical appearence ‘cause every day I see not attractive men having good connections with hot women, I wish to be that man and it annoys me and its making every day of my life very sad, I’m in my 20s and I having lots of regrets of what I could have done better in my highschool, so the small changes i’m about to do are these:\n\n1. Try to have a healthy diet (this is the most difficult to me)\n2. Delete social media (already deleted instagram)\n3. Start reading self-improvement and seduction books (please recommend some)\n4. Hit the gym every day without exception\n5. Start running as I used to do\n6. Not caring about women for a while\n\nPlease share your honest thoughts and recommendations!",
        "created_utc": 1678129899,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Gain 63 lbs of MUSCLE In 28 DAYS!",
        "author": "anthony-2003",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11kany1/how_to_gain_63_lbs_of_muscle_in_28_days/",
        "text": "Is it really possible to gain 63 pounds of muscle in 28 days? \n\nYes! It's been done before and here's how you might be able to achieve this phenomenal feat...\n\nBack in May of 1973 at Colorado State University, they conducted was it called the \"Colorado Experiment\" where the test subject was using negative only sets with a heavy weight and using a lever to bring the weight back up to the top of the ROM...\n\nThe subject ate 6-8 meals a day and went through relatively quick but BRUTAL workouts...\n\nBy the end of the experiment (28 days) these are the results: \n\n\\- Increase in bodyweight: 45.28 lbs\n\n\\- Loss of bodyfat: 17.93lbs\n\n\\- Muscular Gain: 63.21lbs\n\nif you'd like more information just look up the Colorado experiment!",
        "created_utc": 1678129733,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it wrong I dont want to date my age 35m",
        "author": "PaltaGangg",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k9z7e/is_it_wrong_i_dont_want_to_date_my_age_35m/",
        "text": "and prefer to date 20-25 old females because they are less risky? they're expectations in a partner who is my age and they push for instant gratitude and long term commitment and marriage and expenses that go with it. its always the the first thing they bring up in a relationship but don't value what I am or who I am as a person. I am just a commodity. is it wrong that I want to go the easier route and date younger women while I still can?",
        "created_utc": 1678128568,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do to be taken seriously? (23m)",
        "author": "polyhedron__",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k99kg/what_can_i_do_to_be_taken_seriously_23m/",
        "text": "My entire life, people have looked at me like I had nothing to offer. People try to cross my boundaries, they look down on me, they talk down to me, they diminish my accomplishments, and overlook me, my value and my successes. \n\nKnowing you have value, knowing you are successful, knowing you have potential, and knowing you are no worse than anyone else, but having everyone treat you like you’re useless, don’t belong, or are some stupid child for 23 years will drive you insane.\n\nDon’t tell me that I should enjoy being underestimated; if you think this, you haven’t been underestimated that much.\n\nHappy to listen to any advice.",
        "created_utc": 1678127582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to grow a self improvement YouTube",
        "author": "Caelan07",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k8vhc/trying_to_grow_a_self_improvement_youtube/",
        "text": "[removed]",
        "created_utc": 1678127120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for those who went on a social media detox",
        "author": "ras0787",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k88k5/question_for_those_who_went_on_a_social_media/",
        "text": "What did you do during the first week or two? More to the point how do you fill your short downtimes? I feel like that's going to be my biggest hurdle. When I have a minute or two free I usually jump on one social media platform or another. \n\nWhat did you replace social media with? I know a lot of people were able to take up new hobbies or spend time learning new things to which my ultimate goal is actually to learn another language.",
        "created_utc": 1678126389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Truth that nobody wants to hear but needs to",
        "author": "TheRealityshifter19",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k83a8/truth_that_nobody_wants_to_hear_but_needs_to/",
        "text": "Reminder to any1 I’ve been with or any girl that thinks they want me, jus know I don’t need you, I won’t find the thought of needing you, because I don’t, I’ve always been able to exist on my own accord. If you get with me and think that’ll I’ll need you, then you’ve gotten with me for the wrong reasons. Everything I had to go through in my life, I dealt with on my own with very little assistance, I graduated with out help, I got through prison and the entire juvenile system by myself, and even tho it wasn’t the best route, I’m still able to do things others can’t. I don’t need a women to come into my life and tell me feel about things, and jus how I should and shouldn’t act. I don’t tell nobody else how they should act, because as we all know people don’t listen. Women want a perfect man and men want a perfect women, and fail to see they don’t exist and sadly people get in relationships with people with expectations so far fetched cus they don’t truly know the person they’re with, because the perfect man or women don’t exist, jus things we idealize and get upset about when it doesn’t go our way. People wonder why I don’t stay upset very long after a break up, because I’m already prepared for it, because it’s hard to find a person who doesn’t expect me to hold the entire fuckin planet in place, I won’t waste my time feeling like shit, I’ll keep doing me because that never changed, regardless of my status, and I refuse to let a singular person destroy what I’ve built up to this point. Either you can help my build up more or you can leave, there is no in between. Point blank.",
        "created_utc": 1678126222,
        "upvote_ratio": 1.0
    },
    {
        "title": "does this subreddit have a discord channel or something where people can share their daily progress and victories?",
        "author": "rustycatty",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k835t/does_this_subreddit_have_a_discord_channel_or/",
        "text": "I’d like to have a place where i can see progress of other people and share it too",
        "created_utc": 1678126218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should i go back to social media just for a couple minutes after a long detox?",
        "author": "LeSpongeBob",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k7sye/should_i_go_back_to_social_media_just_for_a/",
        "text": "I have been off social media from 4 months but i recently have been  getting the urge to log back into my Instagram account, so I am thinking  that i will just log in and use insta for just 30 minutes and just  disable my account again...should i do it? Will it distract my mind even  after i disable my account after using it for couple minutes?? someone please guide me on it!",
        "created_utc": 1678125906,
        "upvote_ratio": 1.0
    },
    {
        "title": "don’t tip toe thru life hoping you make it safely to death.",
        "author": "dactiv",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k6rvw/dont_tip_toe_thru_life_hoping_you_make_it_safely/",
        "text": "you can’t wait for things to be perfect to start taking action, to start living your life.",
        "created_utc": 1678124747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips On Staying Sane and Motivated at a Dead-End Job?",
        "author": "Dizzy_Smile3807",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k6juu/tips_on_staying_sane_and_motivated_at_a_deadend/",
        "text": "Just a background: I've been at my current position for years. Last year one of my bosses verbally told me I was getting a raise (literally told me to go celebrate). Cue in several months later and I notice the raise has not gone into effect. I confront my boss about it and he tells me this by email:\n\n\" You are getting brought up gradually as we discussed with a trajectory to be raised asap, but there are a few more skills that you need to be able to take on before you get there.\" \n\nAt this point, I'm livid. I don't ask for clarification because I believe at this point, I'm getting the runaround. I've been at this job for 6 years and gotten a $1 raise every few years or so. \n\nThis is what really frustrates me: I hate dishonesty. And I especially hate hypocritical pricks like my work who expect honesty from you but will throw mountains of lies and b.s. in your face.  \n\nDue to the resentment that I've internalized, my productivity and motivation has dropped over the past few years. About 2 weeks ago my boss gets irritated at all the mistakes I'm making and gives me a condescending spiel about how \"If I want to make more money, I need to step up my game\". I'll admit, I've been making careless errors but I feel like it's getting harder and harder to stay motivated here. \n\nI've been putting out applications and gotten a few interviews but my self-doubt is a major block. Feels like I am trapped. \n\nSide note: I'm not looking for career advice. I already know this is a dead-end job and there is no advancement, management is dishonest and I need to get out ASAP. I need tips on keeping motivated so that my skills don't lag. I know these skills are essential and will carry me into my next position. At this point, I have to remind myself to stay motivated to benefit myself #1 and fuck work. \n\nI'm not sure if anyone else has been in a dead-end job and found their motivation slipping to the point where their quality of work starts to slip? How did you stay sane?",
        "created_utc": 1678124481,
        "upvote_ratio": 1.0
    },
    {
        "title": "“to get something you never had you have to do something you never did”",
        "author": "dactiv",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k6jms/to_get_something_you_never_had_you_have_to_do/",
        "text": "[removed]",
        "created_utc": 1678124474,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to wake up at 6:30am?",
        "author": "RudenessUpgrade",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k6daj/how_to_wake_up_at_630am/",
        "text": "I have gained a poor habit of staying awake till late at nights since college (last minute projects and stuff) and ever since I haven't been able to reset my sleep cycle. Even if I try to get to bed early I can't sleep and just keep tossing and turling until 3/4am (my sleep time) and end up waking late again. \n\nI tried not sleeping entire nights too so that I fall asleep sooner the next night but I get so tired that end up sleeping in the afternoon or evening instead and waking up right before bedtime like a dumbass. :/ \n\nAny sleep veteran here with their experience please do share. \n\n\nP.S. No drugs.",
        "created_utc": 1678124267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any thing for 16-18 year olds?",
        "author": "Isstr__",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k68i7/any_thing_for_1618_year_olds/",
        "text": "[removed]",
        "created_utc": 1678124113,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to maintain perspective?",
        "author": "electric-bacon-again",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k4jw7/how_to_maintain_perspective/",
        "text": "I constantly try to work too intensely. I think it’s because I have so much going on in my life that I feel I need to get it all done and want to do well at work.\n\nThis isn’t a productive intensity it’s probably driven more by anxiety and trying to hurry or push.\n\nI get too much of myself too wrapped up in it. Frequently, it leads to mistakes in frustration.\n\nWhen I have a “perspective” helps a lot. It enables me to focus in a relaxed way.\n\nFor example, I tell myself “this is just my job”. \n\nI know, I just said what helps me, but the problem is remembering to do this or being too wrapped up in general. It’s difficult to explain.\n\nAny thoughts or suggestions would be appreciated.",
        "created_utc": 1678122093,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get more confident about myself to do more",
        "author": "Academic-Holiday5439",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k4hcm/how_to_get_more_confident_about_myself_to_do_more/",
        "text": "I alway never really a confident person turning into young adult \n\nLike going to places and finding a job or finding someone \n\nIs there good tip to help let me know",
        "created_utc": 1678122024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best beginner workout for abs?",
        "author": "Guyonstockmarket",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k3ns3/best_beginner_workout_for_abs/",
        "text": "Title. Also how do I know if I’m doing the workouts right? Or am I just overthinking it?",
        "created_utc": 1678120520,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to change and be a better person",
        "author": "BlackReaper124",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k3bdh/i_want_to_change_and_be_a_better_person/",
        "text": "Im 17 years of age and live a terrible life. I have terrible fashion sense and my hair looks awful. I’m awful at academics and have no future ahead of me. I constantly\nget overwhelmed with everything but I am a pretty social able person. Im currently overweight and want to change the way I look. I can’t even say one positive thing about me and it’s ruining my self esteem. I try my best to keep a happy face but recently it’s been quite challenging.",
        "created_utc": 1678119760,
        "upvote_ratio": 1.0
    },
    {
        "title": "How My Future Self Started Thanking Me (Delayed Gratification Made Easy)",
        "author": "Disciplineking",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k2jat/how_my_future_self_started_thanking_me_delayed/",
        "text": "I read a book called the wealth choice a few years ago, it’s central premise was:\n\n*People who are able to focus on goals further away in time are more successful overall.* \n\nFor example if you’re addicted to alcohol, you probably only focus on when, where and how you can get your next drink, basically only thinking about today and tomorrow. \n\n**It’s the goal equivalent of living paycheck to paycheck.** \n\nIf you want to become a doctor you’re probably focusing on the next 8-12 years down the road .\n\nThe alcoholic is less successful because his goal perspective is short term. \n\nThe Doctor is more successful because he’s goal perspective is long term. \n\n**So how can you apply this to your own life?**\n\nEvery morning when I wake up, I allow myself to spend an extra 5 minutes in bed, if I spend that time doing what’s called VICE &amp; VIRTUE alerts. \n\nA VICE alert is me creating a mental note for things I want to avoid\n\nA VIRTUE alert is me creating a mental note for things I want to do: \n\nWhen you encounter BLANK situation today….\n\nDO BLANK…\n\nThen I vividly visualize the results of this action in 3 months, 1yr, and 5yrs. \n\nVICE alerts stop you from digging holes. \n\nVIRTUE alerts help you start building up. \n\nThese are my some of my actual VICE alerts:\n\nWhen you go to the Grocery Store: **If I resist this impulse purchase,** in 3 months I will have $2,000K saved, in 1yr $8K saved, in 5 yrs $40k saved from this one decision. **Do you still want this stuff you don’t need?** \n\nWhen you’re leaving work hungry: **If I resist this impulse to get fast food**, In 3 months I will have more muscle showing, in 1yr I will look like an olympian, in 5yrs I will be adonis, **do you still want that burger?** \n\nVIRTUE ALERT:\n\nWhen you wake up: **If you spend 1 hour writing**, in 3months you will make $200/mo passively, in 1yr you will make $1,000/mo passively, in 5yrs $100,000mo passively, **do you want to perform this action?** \n\nSo In a nutshell to start developing a long-term goal perspective. \n\n* Wake up and visualize what you want to resist, and want to remember to do. \n* When you encounter that situation, remind yourself of the results in 3mo, 1yr, 5yrs. \n* Execute the action, yield the results.",
        "created_utc": 1678118031,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to stop missing University class",
        "author": "aytooka",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k26up/i_want_to_stop_missing_university_class/",
        "text": "Dear community,\n\nI am currently visiting a college in Germany (translator &amp; interpreter), and I'm at the start of my 4th semester right now. I really love what I'm studying but it can sometimes be very tiring. Especially when everything becomes similar to a routine. When I get the feeling that classes do not teach me things that I want to be taught, then I always start not visiting them and rather stay at home. (I know that this is even worse). I mean, we have great professors and bad professors. But overall, I somehow lose my motivation to visit classes at all.\n\nI constantly miss my class due to bad habits. After finishing every exam for this semester and just barely been to classes overall, I finished with OK grades. But, I know that I'm on the wrong path if I just attend my classes every now and then. When it comes to homework\n\nHow can I break this circle?",
        "created_utc": 1678117232,
        "upvote_ratio": 1.0
    },
    {
        "title": "The multitask jungle",
        "author": "shnikoshwatz",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k24oj/the_multitask_jungle/",
        "text": "My focus has been so bad lately. And I feel it's because of me combining the things I enjoy. For example doing my workout and listening to (distracting) music or reading and listening to music which will lead to my focus swinging from the words in the book to the lyrics I listen to. There is this one popular quote which goes like \"When you try to concentrate on two things at once, you will concentrate on neither\", and it's surprisingly true.\n\nQuiet (or with non-distracting white noises for example) study/reading sessions or workouts are in my experience the most efficient and fulfilling ones. Getting out of these endless combinations of all the things I want to do is my current goal. It's so peaceful.",
        "created_utc": 1678117096,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to be mid",
        "author": "Popped5",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k1rnt/how_to_be_mid/",
        "text": "[removed]",
        "created_utc": 1678116290,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come when I’m confident in myself I’m able to learn things better?",
        "author": "Disastrous-Minute535",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k1mf7/how_come_when_im_confident_in_myself_im_able_to/",
        "text": "I’m 19, I had low self esteem for as long as I can remember and now that I’ve been feeling more self confident. I feel I’m more attentive, I see things clearly and I’m able to learn things better and just do things efficiently. Back then I lacked common sense and couldn’t do basic things without struggling as a child",
        "created_utc": 1678115962,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 17M and I have no friends.",
        "author": "Ancient-Ad-3346",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k1dyj/im_17m_and_i_have_no_friends/",
        "text": "This has been really bothering me for the past few weeks and I thought this place would be perfect to vent a little.\n\nI am a slightly introverted student living in a small village of 150 inhabitants. The vast majority of them are people outside my age group, so I don't have any friends in the immediate area.\nYou could say that I should just make friends with my classmates, but unfortunately I am in a class where I don't fit in at all. I tried to fit in but failed. Everyone has their friends there from the cities they come from, or they are classmates from the previous school, so they talk to them.\nI will be finishing my studies next year and I am afraid that I will end up all alone. I tried meeting new people either in person or online but it never went well or it never lasted..\n\nThere must be something I am doing wrong, could anyone help me figure out what could it be?",
        "created_utc": 1678115434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being a people pleaser?",
        "author": "Practical_Image196",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k1b5b/how_do_i_stop_being_a_people_pleaser/",
        "text": "It's fucking exhausting but more importantly I let everyone take advantage of me because I don't have the guts to say no to someone. Even when I do I feel like a scum and when I don't I feel the same.",
        "created_utc": 1678115252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been focusing on playing guitar and finally recorded last night",
        "author": "SeanWhelan1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k18ah/been_focusing_on_playing_guitar_and_finally/",
        "text": "[removed]",
        "created_utc": 1678115071,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop hating this?",
        "author": "No-Cardiologist-3966",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k1417/how_do_i_stop_hating_this/",
        "text": "16M my father he is not supporting me and my mother with money but supporting someone else's business even taking big amount of loans. But I know I should not care about what he does and I don't but whenever I start to learn about things related to business those guys come to my head. I want to focus on things when I'm learning.",
        "created_utc": 1678114809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking of deleting my facebook account",
        "author": "Equivalent-Fudge9587",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k0wrq/thinking_of_deleting_my_facebook_account/",
        "text": "I don't really use facebook to begin with I only check it every couple of months, every time I do though I end up looking through the profiles of people who are not a part of my life anymore. I feel lonely and depressed. I also use it for facebook marketplace and I have family from overseas on it but I talk to them on whatsapp anyways. Should I delete my facebook?",
        "created_utc": 1678114301,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'll be trying something new this week.",
        "author": "thebeautifullynormal",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k0rmc/ill_be_trying_something_new_this_week/",
        "text": "This week is my spring break for college and even though I don't have classes or work (work for the school).  I do still have two major projects and an application class to do.  \n\nI'm going to Books A Million today and picking up a few books.  The goal for this week is to see how much work I get done by doing what I'm gonna call double pomo. \n\nEssentially an hour of class.  30 mins of reading.   A blank break to get food or water/bathroom.  Then repeat.  \n\nMeasurables:  How much of the Project and how much of the book I finished. \n\nWith the book if it's fiction I won't be taking notes on it but I will make a page to tag themes and such.\n\nIf it's non fiction I will be taking notes through the book page.  \n\nWish me luck I'll keep yall posted on what book I get in the next hour or so.",
        "created_utc": 1678113942,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be more assertive?",
        "author": "gandalfgreyass55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k0i70/how_to_be_more_assertive/",
        "text": "I need help in trying to find practical things I can do to become more assertive. I am basically a complete doormat and very passive to the point of embarrassment. \n\nI want to be someone who not only stands up for themselves but for what they believe in and what is right and it often feels so far off the mark it’s depressing and pathetic.\n\nLogically I understand that practice is required, but I believe I need to do it in baby steps and don’t know how to start when even the smallest things seem overwhelming. \nAny advice or suggestions are certainly appreciated - thank you!",
        "created_utc": 1678113265,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become more self-reliant and less dependent on romantic relationships?",
        "author": "drewtonark",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k0efd/how_to_become_more_selfreliant_and_less_dependent/",
        "text": "I realise that most my adult life I've put my happiness, security, and self-worth, on the romantic relationship I'm in. The moment one relationship (or marriage) ended, I would chase the next one; almost desperately. It's like there is a gap in my soul that needs filling.\n\nAs my current long-term relationship starts to wobble, I'm back to that feeling of emptiness and loss.\n\nI have to stop this. If I don't stop making who I am, reliant on a romantic partner, then I'm probably going to always leave myself exposed, unhappy, and not living an authentic and fulfilling life.\n\nHas anyone here, reading this, gone through this and found a way out of this pattern?",
        "created_utc": 1678113005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to limit my screentime.",
        "author": "BuccellatiCookies",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11k02ro/going_to_limit_my_screentime/",
        "text": "I've been too distracted by everything and i couldn't find the time to limit my screen time so here i am. How do i do it? How much time is good enough?",
        "created_utc": 1678112165,
        "upvote_ratio": 1.0
    },
    {
        "title": "A simple way to improve in getting clarity",
        "author": "SunRise34",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzwap/a_simple_way_to_improve_in_getting_clarity/",
        "text": "Getting clarity in life.\n\nWhen we hike, the view changes along the way.\n\nIf we have the courage to get started, new paths will reveal themselves. James Clear talked about that. \n\nUnsure how you want that new business idea to work?\n\nGet started. Clarity will come from the action.\n\nIt was true for me when I started my side-business 🙂 🙏🏻",
        "created_utc": 1678111681,
        "upvote_ratio": 1.0
    },
    {
        "title": "💥 44 days straight I've stayed consistent with my habit thanks to this Notion Habit Tracker. My creativity, ideation, and self improvement is higher than ever.",
        "author": "mun122",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzvf6/44_days_straight_ive_stayed_consistent_with_my/",
        "text": "[removed]",
        "created_utc": 1678111613,
        "upvote_ratio": 1.0
    },
    {
        "title": "books on discipline/improvement?",
        "author": "eKmyhb",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzul1/books_on_disciplineimprovement/",
        "text": "Hey guys, I've been on a journey to be a better person for a pretty long time. I've been feeling pretty stuck and down for the past few months...and only just remembered that THE most effective way I learn and think is through reading books.\n\nSo, do you guys have any book recs? I'm looking for something on how to be more disciplined in particular, but literally any suggestions (and preferably why) are welcome! My other goals are being more honest with myself and others, overcoming negative emotions like anger or jealousy, learning how to be more aware of how I impact other people, and how to be more socially savvy. \n\nOf course, not thinking a book is going to solve all my issues, but it just might be a new starting point for me—god knows I need it.",
        "created_utc": 1678111550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting My Mind and Spirit Back on Track",
        "author": "LemuelBakerPHDCenter",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzmev/getting_my_mind_and_spirit_back_on_track/",
        "text": "[removed]",
        "created_utc": 1678111001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear and loneliness are my only motivators. Help",
        "author": "kassrot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzjp9/fear_and_loneliness_are_my_only_motivators_help/",
        "text": "\n(26m) Raised religious, alone, and homeschooled, I've spent my entire youth maladaptive daydreaming of a good life where I didn't worry (fear) about loneliness (wife) and money. \n\nI've spent years working at this company and investing in real estate to eventually create a compelling life style. My house sucks, my job sucks, my car sucks but their all paid off and a have a purpose financially. \n\nI realized I can't have my motivation come from the external world as I'll never be able to shake fear or achieve lasting relationships. I wish I was stronger. I wish my purpose was anchored in something that wouldn't leave me. I wish that I was enough, so I could live just for me. \nI'm tired of waiting, hoping for the future that won't come. At this rate, I'll spend my whole life waiting to be happy. I know I to change. I'm stuck.",
        "created_utc": 1678110814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Anxiety",
        "author": "ostrage",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jzg7z/social_anxiety/",
        "text": "I’m a 23F who recently moved across the country with my 29M boyfriend for work. I’ve struggled with social anxiety since I was really little. I don’t have any friends and now I have no social interaction with anyone outside of work and my boyfriend. I call my family often but can’t help but want girl friends in my age range. I think about how I was super awkward and not social in both high school or college. I feel sad because me and my partner are planning for an engagement and wedding and I won’t have a single girl to ask to be my bridesmaid. I want friends to share life with. I am saving up to go to therapy but in the meantime is there anything I can do to break out of this cycle?",
        "created_utc": 1678110567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing Systems/Processes and execution instead of goals",
        "author": "Certain_Prompt_1582",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jze83/choosing_systemsprocesses_and_execution_instead/",
        "text": "Well I was watching James Clear's interview and he said that one should not focus too much on goals but he should focus on system and execution . He said that its great that you want to win a game but you can't spend the whole match on staring the scoreboard  \n\n**Okay I agree , But how can one make a plan ? Lets take an example of exercise , How should make a plan for it ?**\n\nYour suggestions will be helpful",
        "created_utc": 1678110419,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a disappointment",
        "author": "Sufficient-Noise222",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jz768/i_am_a_disappointment/",
        "text": "[removed]",
        "created_utc": 1678109911,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to gain back momentum",
        "author": "TheSnipeshow91",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jyx61/how_to_gain_back_momentum/",
        "text": "From the start of the new year up until reading break I felt like I finally had my life back on track. I was on top of my school work, going to the gym consistently, on top of my finances, was cooking and had a clean diet. After going on a trip (that I had to take for family reasons) during reading break I lost all my momentum.I got sick, lost a lot of strength, fell behind in school,spending more than I have, terrible sleep schedule and diet. It’s a struggle to try to keep up let alone get back to where I was before. How do I get my momentum back.",
        "created_utc": 1678109205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting porn",
        "author": "thinkerr97",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jyn7k/quitting_porn/",
        "text": "How to quit porn? Every time I think about it I feel disappointed because can't go further to quitting porn.My urge for watching porn and masterbuation is beyond my control. Anyone who have mastered it,  can you give some tips to me?\n(sorry for my awful grammar)",
        "created_utc": 1678108510,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Conquer being Perectionist",
        "author": "EasyLifeLazyLife",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jyhgg/how_to_conquer_being_perectionist/",
        "text": "So I’ve been pretty much a perfectionist since I was a child. I care about too much little things and it causes me to take a longer time to do certain tasks. That can be good and help me create higher quality stuff. However, sometimes it’s too much.\nEven though I almost complete an important task, before it’s done I keep worrying about what could be wrong with it and I can’t complete it like I wanted to.\nMy perfectionism is highly related to things involving other people, like emailing people and publishing YouTube videos. I guess deep down I care about what other people think about me and I am scared to be judged.\nI am highly indecisive for the same reason, which I think is perfectionism, and I am tired of it. I have a big project that I have to finish, but my perfectionism is getting in the way. When I try to focus on the project, I tend to overthink, which causes me to lose time and worry about other things that are not so important.\nI am not sure if it’s procrastination or not.\nI don’t know how to fix this and the deadline is approaching. \nAny advice or tips would be most welcome.",
        "created_utc": 1678108104,
        "upvote_ratio": 1.0
    },
    {
        "title": "8 Ideas to (Hopefully) Help You Be Better",
        "author": "I-am---BatMan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jybwb/8_ideas_to_hopefully_help_you_be_better/",
        "text": "[removed]",
        "created_utc": 1678107725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building social skills by approaching girls",
        "author": "Muted_Ability5902",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11jy3t2/building_social_skills_by_approaching_girls/",
        "text": "Hey, I'm 22 y'old and never had a gf.\nI've been pretty focused on building a career and get in shape in the past 3ish years and just now I've came to the realization that I'm so far behind in life experience and social skills from my peers. Since my job doesn't require to have social interactions and I mainly read and listen English content (which isn't my first language) I end up being pretty awkward the few times a months I hang out with my friends.\n\nI've done a bunch of researches and thought that exposure therapy would be a good idea to push myself out of the comfort zone. So my plan was to start approaching random girls at the mall/streets. \n\nI would plan everything as progressive overload, approaching 1 more girl than the previous day and gaining feedback on the fly. I know it sounds insane but I haven't anything better as I live in a pretty small city and there aren't much social circles to join...\n\nTell me what you think!",
        "created_utc": 1678107166,
        "upvote_ratio": 1.0
    }
]