[
    {
        "title": "I got rejected from my dream school...but I'm okay",
        "author": "yuia_19",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117yggl/i_got_rejected_from_my_dream_schoolbut_im_okay/",
        "text": "I (18M) have always wanted to go to Georgia Tech. After years of studying, becoming an Eagle Scout, and participating in every club, I filled out my application and got rejected. GT had always been my dream school, but...I feel fine. I put in my hardest work, and that's all that matters. Luckily, I have some great other options to choose between. I simply sat down and told myself that even though it's disappointing, there's nothing I can do about it. So now I'm just going to make the best of what I was given.",
        "created_utc": 1676968053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spring - Rebirth",
        "author": "mercanartt",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117ycal/spring_rebirth/",
        "text": "Summer blazes. Autumn wilts. Winter Freezes. And Spring comes again.\n\nSpring is the season of rebirth. After the heat of the Summer, calm of the Fall, cold of Winter, Spring comes again. This can be said of any season, so why is Spring special? Is it because spring follows Winter, and comes before Summer? And what of Fall? It does the opposite. Is it a harbinger of the cold future, a remembrance of the hot past? Or is it the comfort between the desert and arctic?\n\nThe answers to these questions, I do not know. But I am uncomfortable with the way I am and act. And Spring has captivated humanity for generations. So I’ll use it as an excuse to improve myself\n\nIt is the perfect season (at least start) to improve one’s self.\n\nGood Luck to All",
        "created_utc": 1676967594,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did it! I landed the job!",
        "author": "daviddallas7299",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117y670/i_did_it_i_landed_the_job/",
        "text": "After hours of youtube videos on interviewing tactics and hours spent on learning photoshop and other skills, I finally got the job I had been working for! Thank you, selfimprovement, you've offered plenty of good advice and motivation :)\n\nEdit: man, you guys are so nice!",
        "created_utc": 1676966963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I have an email with a daily challenge?",
        "author": "anonman246",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117y5pc/can_i_have_an_email_with_a_daily_challenge/",
        "text": "I want to have a little challenge everyday that I have to do in order to get outta my comfort zone.  It can be anything from dance in public to talk to a random stranger.\n\nTo ease it up &amp; not have to manually look it up, I want it to be in the form of an email newsletter delivered to me everyday so that I can just read it &amp; do it without much friction.\n\n**Does anyone know of any mailing list that sends such emails?** I do remember having found something similar sometime back but can't find it anymore.",
        "created_utc": 1676966914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have difficulties to implement the readings you have done?If yes, which ones and why?",
        "author": "Linley78",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117xyb4/do_you_have_difficulties_to_implement_the/",
        "text": "Personally I struggle to make my readings (but also, videos or podcasts) on personal development actionable on my daily life so having your POV would help! Thanks!",
        "created_utc": 1676966144,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 22 and never had a relationship and it’s affecting my self esteem",
        "author": "tthr0wawayy22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117x5yf/im_22_and_never_had_a_relationship_and_its/",
        "text": "[removed]",
        "created_utc": 1676963136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear Myself.",
        "author": "StoneForever04",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117x105/dear_myself/",
        "text": "Let's try something new starting today, let's try to believe in ourselves for once. Let's not focus on the fact that high school is over and that we could have done more. Let's be proud and happy to be Brandon Ethan Merrick. We need to try, we can't just keep running away like we always have. I'm sorry to Brandon for never believing in him, I have seen that he is a good person at heart, I just never believed it. I have seen Brandon grow from a boy who was afraid to even make a joke, to someone who jokes about everything to keep himself sane. Brandon and I have really not gotten along, but I don't want to be like that anymore. I want to make changes, and love him and he needs to love himself. \n\nSincerely, Brandon's conscience",
        "created_utc": 1676962625,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 22 and never had a relationship and it’s affecting my self esteem",
        "author": "iluvsnowballs",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117wyt3/im_22_and_never_had_a_relationship_and_its/",
        "text": "[removed]",
        "created_utc": 1676962396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling for years",
        "author": "CanadianRose81",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117wtjx/struggling_for_years/",
        "text": "I am 42 years old. I have spent most of my adult life trying to figure myself out. I want to know who I am. \nI enjoy crafts (crocheting, painting, drawing etc), video games, movies, music etc, but I just feel lost, alone, empty. I struggle with anxiety, I worry about everything, I get easily stressed, and all these things affect my body (if you deal with these things, then you know how I feel). I've been with my fiance for 21 years (please don't ask why we're not married yet. That's a long story, and not what this post is about.). I am really hard on myself every now and then, and will call myself an idiot, and not smart, and that I can't do anything right. I have even slapped myself once or twice when I have gotten like this. \nI just want to feel happy with myself, and know who I am and what my purpose is (yes I know that it's silly to say that, but please don't judge). \nI also wish that I could feel  a sense of peace (zen) with myself. I'm just tired of feeling like this. I also keep a lot to myself, and my fiance doesn't quite know the extent of my feelings in my head. We lost my mom 9 years ago (she was only 60), and it has been very hard for me to deal with after these years. Then my fiance's mom passed in 2018, and then I just recently lost my grandma 9 days before Christmas (she was my last living grandparent). \nI apologize for a little ranting, but I would kindly appreciate any advice that would help me. It would really mean a lot to me.\nNothing but kind and helpful advice please.\nThank you kindly. 🙂❤",
        "created_utc": 1676961839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brain Fog?",
        "author": "Whole_Ad_8172",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117vs2v/brain_fog/",
        "text": "\nHello everyone! I’ve been an addict of self pleasure and adult videos all my teenage life and I think I am now suffering the consequences. I can’t really focus on certain things or remember what i study for school. I can’t focus anymore, I just feel like my brain just goes blank. I have a lack of focus and can’t have any mental clarity.  I think it might be brain dog but I can’t really think of anything else. I workout 5x a week have a Healthy diet and drink a lot of water. Does any have any advice for I can improve myself?",
        "created_utc": 1676958233,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m on my phone every waking moment besides my job and school and its making me be a zombie/machine",
        "author": "okaynevermind1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117v8y7/im_on_my_phone_every_waking_moment_besides_my_job/",
        "text": "I need help/tips, what do I do when i’m bored and wanna scroll to be productive or just not be on my phone I had 59 hours of screen time last week, I used to brush it off but this is bad and i’m really addicted, anybody has tips? Thx",
        "created_utc": 1676956456,
        "upvote_ratio": 1.0
    },
    {
        "title": "My anxiety is the root of all my problems and I don’t know how to deal with it",
        "author": "Accomplished-Fee4824",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117uej2/my_anxiety_is_the_root_of_all_my_problems_and_i/",
        "text": "Over the past year I have had 3 different jobs. I work the job for a couple months and then my anxiety takes over and I call out so much I’m about to be fired so I quit before that happens. \n\nThat has been my cycle over the past year and I don’t know how to break it. I don’t know how to deal with the anxiety of working in customer service. \n\nI have tried to find a job that doesn’t require me to talk to customers but nobody will hire me for anything else because I don’t have experience in anything other than customer service. \n\nI feel the most depressed I’ve felt in a long time. Everyone around me is moving forward in life (buying houses, having babies, etc) and I can’t even hold down a job for more than a few months. \n\nI’m broke, I’m depressed, and I can’t see an end to it any time soon. Thanks for reading my vent.",
        "created_utc": 1676953807,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you begin?",
        "author": "Numbr_7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117tui9/how_did_you_begin/",
        "text": "There’s so many goals and factors of your life you want to improve - you even make a decision to do so - but how do you begin? \n\nDo you reflect daily in a journal?\n\nDo you simply make a decision to be better, and just work towards becoming a little bit better everyday?",
        "created_utc": 1676952090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stopped being an orthorexic vegan and now I'm getting fat",
        "author": "Alli_Cat_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117tfb1/stopped_being_an_orthorexic_vegan_and_now_im/",
        "text": "So I was vegan like 8 years, I spent fortunes on fake superfoods etc. I was always thin which was great. I annoyed my friends and family with my weird requests and restrictions. I reintroduced dairy for the first time after 10 years and in the 2 years since then I've blown up like a baloon.\n\nI'm over 25 now so I guess my metabolism just really slowed down in addition to the additional calories from cheese and sour cream. I gained 20 lbs in two years. \n\nI'm not even trying to go back to a restrictive diet because I know dairy has amazing vitamins and meat is very important (I don't even eat big portions). I also love baked goods and sweets. I have an active job but I got promoted and now I'm sitting at a desk more. \n\nI'd like to lose ten lbs just so I don't feel so fat, but I love to eat and hate exercise. I don't drink.  I recently started smoking less weed and walking more in my free time. Any other advice? I don't want to stress my body by starving or working out too hard or being too thin. I just want to be healthy.\n\n (I have to limit caffeine because I'm sensitive to it, but I was drinking coffee and intermittent fasting at my thinnest, which honestly probably isn't healthy for a woman my age)",
        "created_utc": 1676950823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some Reading Material for Me",
        "author": "Vengeance058",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117t07d/some_reading_material_for_me/",
        "text": "At 31, I feel as if I have accomplished very little. Where I thought I was going, just a few years ago, hasn't panned out. I have failed in the things that I have wanted to accomplish for years, despite my hard work, while I watch others do so. Frankly, I'm also convinced that I want to do one thing...but at the same time I'm not.\n\nI am completing a small reading nook, and when it's finished I plan to send my evenings not on social media/phone, but reading. I'd like some reading options, books that may help me figure out how to get my life back together. And maybe some writing projects.",
        "created_utc": 1676949549,
        "upvote_ratio": 1.0
    },
    {
        "title": "(NEED ADVICE SERIOUS) I forgot everything I learned in school",
        "author": "stargirIxd",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117svsp/need_advice_serious_i_forgot_everything_i_learned/",
        "text": "I forgot almost everything I learned in school. This isn’t a joke or anything. I’m serious. I would really appreciate some advice on this. I really want to improve myself. But I’m really struggling with this school thing and it is an important part if I want to improve myself. So I have to go back to school in September. How can I relearn everything I need to know in the main subjects (ela, math, science, social studies) from grades kindergarten to 9th in 3 months? To prepare myself to go back to school. (Not joking I forgot practically all of the basics. I genuinely need help. It’s a long story but I went through a lot of unnecessary bs that I couldn’t control let’s put it like that.) I would start studying now but I don’t have any time until June because I’m currently in a messy moving process. I won’t have any time to sit down and immerse myself into the studying process until June. I know I don’t have a lot of time but Im willing to put my all into it. I’m willing to do whatever it takes. How can I learn everything I need to know to prepare myself to be ready to go back to school? I just don’t want to fail in life. I can’t drop out. I don’t want the easy way out. I want a chance in life. I know my chances are even lower of making something of myself if I don’t graduate highschool, statistically speaking. I’m really scared honestly. I’m really falling behind. I don’t want to fail like the rest of my family. My family keeps telling me I’m never going to graduate high school (when THEY ARE THE ONES WHO HAVE PREVENTED ME FROM DOING WELL IN SCHOOL DUE TO THEIR BS!!). According to them the best thing I can ever do is a GED and nothing more. I really want to prove them wrong. They are so toxic. I don’t only want to prove them wrong but ultimately it’s for me. I really want to get away from them. I need my diploma. Please help.",
        "created_utc": 1676949185,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 steps forward. One step back. Hitting a bottom once again.",
        "author": "AdministrativeSir675",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117sqsf/2_steps_forward_one_step_back_hitting_a_bottom/",
        "text": "as I write this please know I’m not looking for sympathy. I just need to clear my head.\n\n20 something year old male. \n\nAt the start of 2023 I was hopeful towards a bright year. I got a new job, I started learning more about fitness, and I was slowly beating my escort and pornography addiction.\n\nBut here we are again. My vices and my past have been exposed(once again), this time at a larger scale. To make things worse, my idiot self decided to sign up for a dating app during all of this. It’s only propelled my internet fame lol\n\nI’m sure some of you will recognize this writing, as I’ve posted my numerous expose stories before regarding my landlords(which may have sounded delirious)\n\nI’m currently in a position where everything’s not ruined, but my public local image is tarnished. \n\nI’m stuck at the intersection of giving up and believing the opinions of others \n\nVs \n\ncontinually pushing towards my goals, changing my name, and maybe starting somewhere new. \n\nObviously I choose the later. But this pain is heavy and this hatred for myself is at an all time high. \n\nI wish I wasn’t so stupid, I wish I could’ve done things differently, I wish I wasn’t so weak in the past. \n\nThese feelings are back, and sting more.\n\nIf anyone has stories to share of how they changed their ways, I’d love to hear it.",
        "created_utc": 1676948787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice for a night owl?",
        "author": "Signal_Significance6",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117sk22/any_advice_for_a_night_owl/",
        "text": "I spend most of my day with little to no energy. I don't feel like cleaning, cooking, putting away laundry, etc. Even if I have the energy, I get overwhelmed with all the things I need to do and I convince myself it's okay to just relax for a bit until I've spent all day relaxing and get too tired to do anything. I have found a couple of ways to combat this, one of the best being to break things into small steps. Just run the dish water. Just boil some water. Just bring the laundry upstairs. If I have homework to do? Just open the laptop. These bite-sized tasks help me to accomplish the full task. \n\nBut I still need help being more productive. And one thing is that I feel the most motivated at night, when even after completing one thing, I am tired. And even if I'm not so sleepy that I can't do anything else, I still feel like I need to get to bed because I have work in the morning and I don't want to be exhausted throughout the day, and be too tired for anything when I get home from work. It's a vicious cycle.\n\nI've always been a night person. I like all-nighters, I like how still the world feels while everyone else is sleeping (yes, I know the world doesn't work like that, it's just the vibe), and I don't feel like I actually have to do anything. It just feels like me time. \n\nI have been trying for a long time to change my routine to waking up an hour and a half earlier in the morning to give myself more time to start my day, and get the working out and studying out of the way earlier so it's not hanging over my head all day. But despite all the tricks I've been trying to get myself up earlier, I just haven't been able to get myself out of bed any earlier than I have to. I'm constantly amazed that I make it to work every morning at all because I hate getting out of bed in the morning!\n\nSo my question is, is it possible for a night person to change into a morning person? Or am I better off trying to find ways to accommodate my nighttime energy by just scheduling tasks for the evening and going to sleep late? What has worked for you?",
        "created_utc": 1676948249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for digesting information: What most efficient?",
        "author": "Fair-Face4042",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117sdgh/advice_for_digesting_information_what_most/",
        "text": "Hi,   \nI typically watch self improvement videos on youtube (financial, hamza, etc.) but I'm finding I have too many videos to watch and it feels like its getting overwhelming.   \n\n\nI want to learn as much as I can but I wonder if watching youtube videos which average 13mins+ is the best way to go about doing this?",
        "created_utc": 1676947703,
        "upvote_ratio": 1.0
    },
    {
        "title": "20 year old functional alcoholic.",
        "author": "46572mk",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117roij/20_year_old_functional_alcoholic/",
        "text": "I’m the classic F(26) college party girl. I have anxiety and depression which leads to me needing to drink more than everyone else to numb it. \n\nI have a great job, great friends, family. It makes it worse because why do I hate myself. For any finance people I passed the Series 7 so hungover I was still drunk. My functional alcoholism is out of control. \n\nI stopped drinking on my 26th birthday, Valentine’s Day. It’s been a short amount of time but I’ve never felt so motivated in the last 7 years of my life. I was stuck in a circle of wake-up late for work, grab a wrinkly outfit on the floor, show up 5 mins late, work, get home, get drunk, pass out, order food, stay up till 1am drinking, go to bed. Everyday this week I’ve cooked myself a meal and have gone to bed at 10pm. Did laundry and actually put my clothes away. Washed my face, brushed my teeth. \n\nI’m not happy realizing it wasn’t about the drinking it was about me. This is a step in the right direction. If anyone is thinking about quitting I’m proud of you.",
        "created_utc": 1676945679,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (26f) mom (57f) is overbearing and I am dependent on her. Am I a \"failure to launch\" stereotype? How can I stop blaming her and take responsibility for my life?",
        "author": "ThrowRA8393253",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117rbtg/my_26f_mom_57f_is_overbearing_and_i_am_dependent/",
        "text": "[removed]",
        "created_utc": 1676944653,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Patrick Bateman routine",
        "author": "yinnyangg69",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117r0g4/the_patrick_bateman_routine/",
        "text": "Has anybody actually followed the Patrick Bateman routine? All things considered it's pretty much a solid routine with skin care, exercise and fitness. Actually wonder if someone applies it in real life as well.",
        "created_utc": 1676943737,
        "upvote_ratio": 1.0
    },
    {
        "title": "why being genuine will allow you to improve",
        "author": "viktorparis22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117qy2p/why_being_genuine_will_allow_you_to_improve/",
        "text": "[removed]",
        "created_utc": 1676943549,
        "upvote_ratio": 1.0
    },
    {
        "title": "can I improve my facial structure?",
        "author": "PlasticBeginning8059",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117qiim/can_i_improve_my_facial_structure/",
        "text": "I'm 17 and I'm a fairly good looking but I want more I have done everything I can fir the way I look, haircut, skincare, facial hair, all that. Pretty much what I'm asking is I'd there's anyway I can improve the all around structure and muscles in my face. I'm already like 13% body fat and pretty solid so that's out of the question. I've looked into mewing and jaw exercising product, but #1 I don't want to waste my time and 2 I don't want to cause any damage to my face or jaw. So does mewing and jaw products really work or is there something else I can do",
        "created_utc": 1676942321,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Non-obvious or Counter-intuitive learning changed your life?",
        "author": "brucetony00",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117qejd/what_nonobvious_or_counterintuitive_learning/",
        "text": " \n\nI feel many people don't ask this question enough but there is a lot of value.\n\nThank you in advance for sharing your learnings",
        "created_utc": 1676942010,
        "upvote_ratio": 1.0
    },
    {
        "title": "fapping might actually be ruining everything for me",
        "author": "Intrepid-Blueberry49",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117qcgn/fapping_might_actually_be_ruining_everything_for/",
        "text": "I (18M) have a super amazing situation. I'm in a long distance relationship of almost 2 years. I have a job playing video games. I'm currently living away from home. I cook for myself, clean for myself, take care of myself. I've been going to the gym. I'm going to move in with my girlfriend in about four months. On paper I'm on the right path but it all feels so messed up in my head.  \nI love playing video games professionally. Video games are fun. I'm completely fine with the stress, anxiety, and the competition. What messes me up is my mental health. My confidence get's hit extremely hard when I lose. Losing fucking sucks. I want to get better at the game so I can keep climbing in the ranks and get a higher paying salary. I want to become insanely good at the game. There's so much more for me to get better at and I want it very badly. For the money, for the ego, for the enjoyment. I just lose my mind when I lose. I am seeing amazing mindset changes in the past few months of me moving out.  \nThings are going my way, but here's where lifestyle comes into place. I jerk off maybe once every day. I have an addiction to videos of hot girls on Tiktok, onlyfans girls, and Hentai. It's really messing with my head. It's extremely fucked up because I work on my computer and there's easy access to all of my addictions. It's three clicks and two lines of text and boom, I'm sucked into my addiction. Even while I'm working, it will throw me off if some trigger happens. Even if there's the slightest hint of hormones making me horny, I start fighting myself and use the internet to feed my addiction. When I'm ready to go to bed at around 1 am, I stay up an extra one or two hours just browsing through the internet until I unwillingly let one out. The worst part about all of this is I often tell myself \"I won't fap off today\" and I still end up doing it, making me lose self respect for myself. I feel terrible after I fap, and my dopamine levels are also off the charts. When I wake up, I don't want to do anything. I'll stay in bed and nothing will motivate me unless someone gets me up. The only method I've come across that gets me up recently is by fapping in the morning. I hate this sick cycle. I hate it so much. I love being motivated. I love my passion. I love grinding and becoming the best version of myself, but I just feel so stuck.  \nI love my girlfriend so much. She's so supportive and is literally always there for me. When she comes to visit, we have sex every day. The thing is, she is very open to my sexual kinks and supports everything I enjoy. She tells me it's okay to fap and watch whatever I like, especially because we're long distance, so it really messes with me. I've acknowledged that fapping and watching this content is not helpful for me, and is actually ruining things. Every time I talk to her about it, she's so positive about it and tells me it's no big deal. She is a big part of my life and has helped me change my mindset into a much more positive one, but I am struggling to draw the line between rational thoughts and just going with how I'm feeling.\n\nI feel like I have no control over myself sometimes.",
        "created_utc": 1676941840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beauty Standards are to High",
        "author": "Objective-Door-513",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117pamb/beauty_standards_are_to_high/",
        "text": "I am looking to settle down with someone. I almost always end up in relationships with the most attractive people that will date me... and often they end up having emotional stability issues. The obvious solution is for me to weight appearance less heavily and stability more heavily in my choice of relationships (in other words I need to be less vain than I am), but I find that I don't fall in love with the less attractive people I date, and I DO fall in love with the less stable more attractive ones.  \n\n\nAny idea on what I might do about this? Has anyone successfully changed what they were attracted to?",
        "created_utc": 1676938911,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do?!",
        "author": "Powerful-Cat-2934",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117p8b1/what_to_do/",
        "text": "Hey all! \n\nI (24 M) am feeling at a standstill. My life is perfectly fine— I work very hard, enjoy what I do for the most part, and enjoy the benefits of my work (re: affording to live my life). All of my income is from passive, unsustainable jobs and gigs— these are jobs that are specific to my city and that I cannot do for the rest of my life. I paid my way through college (no debt, wooh!) and have sustained affording my own apartment in NYC for several years - I cannot reiterate enough that my life is FINE \n\nHowever, as I am beginning to feel at odds with my city and exploring what adulthood may look like in other places, I’m realizing I am so much more lost than I thought. I’m a capable and adaptable person, yet I struggle to visualize what my life might look like in the future and what I might do that’s both sustainable and fulfilling \n\nHow does one discover this in themselves? I’m adaptable and find that I can be good at anything I try, as long as I work hard. I prize myself on this, but think it may be hurting me in that it feels impossible to find my path! Are there exercises or meditations to explore this further? Anyone to talk to to help me realize what might work for me in terms of a career and visualizing my future?\n\nI feel as if I want to take the steps to move forward in my life, but suddenly have no idea what forward even looks like!",
        "created_utc": 1676938742,
        "upvote_ratio": 1.0
    },
    {
        "title": "30 is just the beginning - you still have a ton of time to make your dreams come true",
        "author": "Primary_Candidate_36",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117p3n9/30_is_just_the_beginning_you_still_have_a_ton_of/",
        "text": "It's strange that some people in their 20s and 30s give up on their aspirations simply because they haven't achieved them by a certain age. In reality, you're still quite young with many experiences ahead.\n\nWith an average life expectancy of around 80 years, there's plenty of time for someone in their 20s or 30s to accomplish their goals. Instead of dwelling on what you could have done in the past, focus on what you can do now. So go out and enjoy your youth, live life to the fullest, and pursue your dreams with passion!",
        "created_utc": 1676938396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't be fooled: Buying yourself fancy things isn't true self-love.",
        "author": "Firmcackle285",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117olrs/dont_be_fooled_buying_yourself_fancy_things_isnt/",
        "text": "It can be tempting to equate self-love with treating yourself to fancy things, but that's just a trap that leads to a never-ending cycle of spending and temporary happiness. True self-love isn't about what you can buy, it's about what you can do.\n\nIt's about taking care of your physical and mental health, practicing self-compassion, and investing in activities that bring long-term benefits. Whether it's exercise, mindfulness, learning new skills, or pursuing personal goals that light a fire within, true self-love comes from within and is a commitment to growth and well-being.\n\nSo don't fall for the trap of material possessions and instant gratification. Instead, focus on the things that will truly make you feel good about yourself and bring a sense of purpose and fulfillment to your life. That's the kind of self-love that lasts a lifetime.",
        "created_utc": 1676937080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for journaling?",
        "author": "captainjack27",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117ojsl/any_tips_for_journaling/",
        "text": "Hi Everyone,\n\nSo I have currently been trying to build my self-esteem and confidence. Ive always wanted to try journaling but I never know where to start or what to even write about. I also have been trying to read some self improvement books but I feel like I always forget the advice in them. Anyone have any suggestions on how to start/or what to write about?",
        "created_utc": 1676936930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depression advice",
        "author": "THRAWAYSADANDLOST",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117o61z/depression_advice/",
        "text": "Great posts I stole from another user u/Calm-Teach-4960\n\n“I’m a loner, so here’s my advice when you are depressed and have no one to talk to. I saved up, and took a trip across the states. Am trak in America is 500 bucks if you get the bundle and you get 30 days of travel pretty much. If that’s out of your budget, go to your nearest attractions and enjoy the finer things in life alone, but don’t stay in your house dude. The killer is being in your own head to long and home is the perfect place for that. Stay strong bro and make it through this!!”",
        "created_utc": 1676935929,
        "upvote_ratio": 1.0
    },
    {
        "title": "On a dopamine detox, should I do 1, 2, or 3?",
        "author": "SelfImproveManiac",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117nxnc/on_a_dopamine_detox_should_i_do_1_2_or_3/",
        "text": "[removed]",
        "created_utc": 1676935345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting over potential gf",
        "author": "AffectionateShip7740",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117n5ke/getting_over_potential_gf/",
        "text": "I have been on a date with this girl then we were chatting for a few days and then she ghosted me.. we known eachother for about month and a half but I really got attached to her and now I can't accept the fact she is gone. We laughed together and we could talk for hours without stopping.  What can I do to get over this girl? I really thought she is the one thats why it hurts the most ..",
        "created_utc": 1676933424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life’s rough",
        "author": "Great_Inflation_6892",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117n2kq/lifes_rough/",
        "text": "I want so many things (I’m 25) I have a well paying job but don’t feel happy. I had so many things happen all at once, Helping people has been the only thing rewarding I’ve felt.",
        "created_utc": 1676933229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 3 habits/mindsets that turned your life 180 degrees?",
        "author": "NeedHappyPills",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117mmwe/top_3_habitsmindsets_that_turned_your_life_180/",
        "text": "Name top 3 habits/mindsets that turned your life 180 degrees",
        "created_utc": 1676932195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 8 of becoming my own favorite person",
        "author": "Grouchy_Survey9739",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117mftc/day_8_of_becoming_my_own_favorite_person/",
        "text": "Today didn’t start off the best. I was thinking about my ex and that I wished we would still be together but also that he hurt me way too many times.\n\nIt made me emotional and I was very triggered at school. \n\nAfter school i babysat on my cousins for an hour and after that I went for a walk to clear my head.\n\nRight after I had a bootcamp lesson and that really made me feel better. I took a nice long and really hot shower and even let some of my emotions out.\n\nNow I’m in bed and I feel really satisfied, I handled a not so good day really good and made it a not so bad day. I’m proud of me❤️\n\nSweet dreams",
        "created_utc": 1676931714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Completely lost",
        "author": "DenseVariation5496",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117m3an/completely_lost/",
        "text": "I have been doing gym from past 1.5 years like I started in 12th class now I’m in college. I don’t know if it is related to gym or not but I think I am completely lost in life I’m giving my 100% to every thing but still feel like something is missing and I think it’s my religion which I should follow but don’t know how and where to start. I am a Hindu, like before when I was in 12th I was going to a Hindu local temple every day but now I am not  going to any temple and not even doing doing any religious thing. I am very distracted I can’t sleep at night, I’m can’t focus on gym rn, I can’t study. What should I do?????",
        "created_utc": 1676930878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Charisma books?",
        "author": "Itchy-Menu-6270",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117lqg8/charisma_books/",
        "text": "Looking for recs on books on charisma. Being really good at engaging people in conversation and just getting better at it. Any recs? Something I can apply to making friends, dates, work, etc",
        "created_utc": 1676930030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Avoid politics, social media, mass media, etc",
        "author": "grantsrants29",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117la8i/avoid_politics_social_media_mass_media_etc/",
        "text": "Call it controversial, but for real, just get rid of it. I’ve noticed that there’s very little out there on these platforms that want to lift you up. There’s very little that wants to brighten your day. It’s either catastrophic (most news) or bragging (social media) or trying to get your attention, usually via preying on what gets you most riled up (most media platforms). \nGetting rid of these things is something I think we all agree would be good for us, but few of us actually do. Try it. Maybe it won’t solve all our problems, but it could allow for more mental space to focus on fixing the actual problems at hand.",
        "created_utc": 1676928960,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find the motivation and drive to be the best version of yourself?",
        "author": "Arabian_Nights_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117kd3r/how_do_you_find_the_motivation_and_drive_to_be/",
        "text": "I know what I have to do to make myself better but I have zero drive and energy to actually make the change. I want to eat healthier, spend less, stop watching porn and jacking off every damn day. I want to feel good about myself so i can be in a healthy relationship and actually contribute to my partner. But the sacrifices I have to make for it are too good to cut off. How could I cut off sugar and sweet? How could I cut off spending money at Amazon? How could I cut off cumming and watching hot women every night. Sometime I want to burn myself and let the old me burn away so a new me can rise from its ashes. But fucking how.",
        "created_utc": 1676926805,
        "upvote_ratio": 1.0
    },
    {
        "title": "struggling with being able to rest",
        "author": "sitmebackdown",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117kask/struggling_with_being_able_to_rest/",
        "text": "im a cna and work night shifts, 6p-6a.  i usually only get two days off, and will pull about 60-72 hours a week. \ntoday is my first day off in over a week, and i’m struggling with feeling comfortable with resting. \ni feel like i constantly have to be doing something to feel acceptable.   \ni was raised in a house where rest was never really necessary, and you had to earn it.   laying down? you could be doing dishes. watching a tv show? you could be doing laundry right now. playing a game on your phone? you should be deep cleaning your entire apartment. \n\ndoes anyone else struggle with this? i feel a constant guilt when i’m not working and want to rest. i feel like i have to earn it. \nbut damn, i have earned it. i’ve been working my life away. \ni don’t need to deep clean anything. i don’t need to wash dishes right now. i just need to lay down and relax.",
        "created_utc": 1676926642,
        "upvote_ratio": 1.0
    },
    {
        "title": "rock bottom",
        "author": "IlluminateIgnorance",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117jqrg/rock_bottom/",
        "text": "fully realized and accepted how much of a loser / drunk / drug addict i really am. you would think i would feel like shit but i feel great for once. i can finally see myself as i truly am which means that i can begin to change.",
        "created_utc": 1676925288,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (16M) am really lost and need some guidance",
        "author": "StyledFalling",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117iwkw/i_16m_am_really_lost_and_need_some_guidance/",
        "text": "I (16M) think I need a lot of help right now. I barely have any close friends, my best friend is going to a different school, I have no genuine hobbies, I'm struggling with school, I'm lazy, I have trouble investing time into anything, I live in an Arabic household and the girl I've been in a long distance relationship with for the last 6 months left me and moved on immediately because I was too much of a burden on them and had bad issues to sum it up. I also feel like a piece of shit because the way my ex described me made me come off as an unlovable prick and it doesn't help that I feel like they knew me better than anyone else and was the person I loved and invested most of my time and energy into. On top of this it's really hard to make friends or talk about anything since I can't link up and I spent a good portion of my time playing video games and I don't even know where to start when it comes to that. I can't say I'm even that good at anything anyways since I haven't invested my time into much (aside from one thing that people will probably think is stupid if I shared) and especially not into studying which has caused my grades to suffer. Lastly, it's getting harder and harder to control my anxiety which gives me trouble breathing especially after I wake up every morning or go to sleep every night.\n\nAlthough I've found some direction with making a planner and trying to be more productive throughout my day by doing more things for and by myself, I feel like I need more direction in what action I need to do. Since, I don't know the next step to take and what push I need to do things that I wouldn't otherwise. Is there anything else I could do to become happy? I've wanted to start working out but I'm not sure if I could dedicate myself to paying for a gym membership and going without wasting it.",
        "created_utc": 1676923296,
        "upvote_ratio": 1.0
    },
    {
        "title": "listening skills and focus",
        "author": "LizzSaldana94",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117iu87/listening_skills_and_focus/",
        "text": "Sometimes I will start reading a book that I am interested in. After a good 30 minutes, my mind wanders off. To be fair, I do smoke weed so that might be it. I will also watch an informative YouTube video or I will listen to someone talk and at certain times my mind will wonder. Sometimes, I can just sit on my couch and think about things. What can I do to improve this?",
        "created_utc": 1676923159,
        "upvote_ratio": 1.0
    },
    {
        "title": "YouTube Channel",
        "author": "RidePrimary9370",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hx5j/youtube_channel/",
        "text": "Hey guys I just started my youtube channel as part of my self improvement journey. I think a lot of people could learn from the content I put out. Check it out and let me know what you think.\n\nYouTube - Javi Godoy",
        "created_utc": 1676920998,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I open up about my feelings to my girlfriend?",
        "author": "lev0015",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hkzl/how_do_i_open_up_about_my_feelings_to_my/",
        "text": "So I (17m) have previously had relationships but my current gf(17f) makes me not only feel better about myself, letting me be myself around her etc, but how do I open up to her about my feelings? I usually hide them but I trust her enough to hold anything I say close to her, and I feel like I should open up to her more, as communication is important in a relationship, any advice will be vv appreciated, thank you.",
        "created_utc": 1676920218,
        "upvote_ratio": 1.0
    },
    {
        "title": "The power of Six: Habits for Achieving peak performance and success",
        "author": "yadavsonu629",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hkue/the_power_of_six_habits_for_achieving_peak/",
        "text": "I'm excited to share with you my latest ebook, now available on Amazon Kindle.\n\n\n\n\"The Power of Six\" is a comprehensive guide to achieving success and peak performance in all areas of life. Based on extensive research and personal experience, this book outlines six essential habits that highly successful people practice regularly.\n\nThrough in-depth exploration of these six habits, readers will learn how to develop the mindset, skills, and daily routines that are crucial for achieving success. The book covers a range of topics, including time management, goal-setting, self-reflection, and more.\n\nWhether you are a business professional, athlete, student, or anyone seeking to improve your life, \"The Power of Six\" will provide you with the tools you need to reach your full potential. This book is a must-read for anyone looking to make positive changes in their life and achieve long-term success.",
        "created_utc": 1676920210,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am going to break myself to reshape myself",
        "author": "TemporaryCranberry72",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hjuq/i_am_going_to_break_myself_to_reshape_myself/",
        "text": "I have come to the terms that I am currently pathetic. Currently struggling in college, addicted to vaping, social media, porn, and video games. I feel dirty and tired all the time.\n\nI have deleted instagram. I plan to delete reddit tonight, and youtube will be the hardest one to do but plan on doing that too. I currently run and workout and read, but apparently that isn’t enough. The title of the post is a tribute to Juice Wrld - (Juice WRLD Speaks 2) - “Sometimes I wish I could take myself, and break myself, just so I can reshape myself.” \n\nI am not happy in my major and so self conscious of my body it stops me from attending class. I need to be better, and the only way to do it is to work as hard as I possibly can. Of all the negative things people have accused me of, working too hard has never been one of them. I want to be someone beautiful again. Please leave any thoughts and advice below, I will delete this app in about ten hours so I hope to talk to some of you kind people in the comments. Good luck to everyone, and maybe one day I can come back and leave a positive update.",
        "created_utc": 1676920148,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Power of Six: Habits for Achieving peak performance and success",
        "author": "kinkexplorer01",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hgaf/the_power_of_six_habits_for_achieving_peak/",
        "text": "I have written on building habits for achieving success. It's available on Amazon Kindle. Must read \n\n\n\n\"The Power of Six\" is a comprehensive guide to achieving success and peak performance in all areas of life. Based on extensive research and personal experience, this book outlines six essential habits that highly successful people practice regularly.\n\nThrough in-depth exploration of these six habits, readers will learn how to develop the mindset, skills, and daily routines that are crucial for achieving success. The book covers a range of topics, including time management, goal-setting, self-reflection, and more.\n\nWhether you are a business professional, athlete, student, or anyone seeking to improve your life, \"The Power of Six\" will provide you with the tools you need to reach your full potential. This book is a must-read for anyone looking to make positive changes in their life and achieve long-term success.",
        "created_utc": 1676919919,
        "upvote_ratio": 1.0
    },
    {
        "title": "YouTube Channel",
        "author": "RidePrimary9370",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hdg5/youtube_channel/",
        "text": "[removed]",
        "created_utc": 1676919739,
        "upvote_ratio": 1.0
    },
    {
        "title": "YouTube Channel",
        "author": "RidePrimary9370",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117hcm1/youtube_channel/",
        "text": "[removed]",
        "created_utc": 1676919689,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I’m lost in life and I need some direction",
        "author": "jnny_lkahohfa",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117gu5t/i_feel_like_im_lost_in_life_and_i_need_some/",
        "text": "I think a lot of people will probably relate to my problem which is basicaly being in my 20s having nothing figured out. I am desperate to find any purpose to my life and I don’t know where to start so I need to know what to do.\n\nMore about me:\n\nI grew up in a wealthy environment. We were never too rich but money was never an issue in my family and I am very grateful for that. I am 22 years old and I am about to complete my university degree which is electronic engineering. It is a very useful degree and I know a lot of people would want to have the opportunities that I had and be where I am, but it's not what I would rather be doing.\n\nThe problem is that I don't have an interest in what I'm studying and even though I don't hate it, I don't \"like\" it either and I hate going to class to learn about things I don't care about. The reason why I continue this path is because I don't know what other thing I could be doing instead because I don't find anything else interesting. \n\nI have other things I like besides my degree but I don't think i can make a living out of them. The thing I like to do the most is playing guitar (actually I am in a band and it would be my dream job, but making a living with music is impossible). I also like to play videogames, biking and traveling (how original xd).\n\nI also think it's worth to mention I always lived on a mountain in the outskirts of a town and I always loved living in a big house with my own garden and pool, surrounded by mountains... But now I live in one of the best cities of my country (because I am in university) and I absolutely hate it. I am a huge introvert and I hate being around so many people. I would much rather live in my parent's house so I could blast loud music during the day without bothering anybody and going out for a walk in the mountains with very few people (or nobody) around me.\n\nI would be willing to leave everything behind and start a new life on another corner of the planet if I knew what to do, but the problem is I don't. I'm pretty sure if i keep going with my degree I will end up having a job I hate, but if I drop it i would have nothing else to do and my situation could probably be worse. I don't have any reason to get up in the morning or anything to be excited for, so if somebody can help me with this situation or tell me how to get the help I need, that would be very appreciated.",
        "created_utc": 1676918503,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Day Doesn't Matter",
        "author": "Life-XP",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117gpjf/one_day_doesnt_matter/",
        "text": " Two days ago I went to a carnival party with my friends. It was the first time this year that I drank alcohol but that’s fine because at the beginning it was my goal to not drink until carnival and then only once with my friends. That’s exactly what I did. However, I always get pretty bad hangovers, even when I only have a few drinks.\n\nSo, as expected, the next day I had a hangover. It was by not one of the worse ones but I slept quite badly and was up until 3 am. Naturally, I wasn’t excited to start the day with some meditation. As the day continued I felt sorry for myself because the party wasn’t really worth it and now I have wasted a Sunday by drinking the day before.\n\nOn top of that I bruised a rip last week, so even hitting the gym to get my circulation going wasn’t a realistic option on a day that I thought was useless the day before.\n\nSo I indulged in my bad habits and didn’t do any of the good ones I implemented over the last few months.\n\nBut here’s where I’m different now than I was before when I had previously fallen off the wagon. Back then I felt sorry for myself because all my streaks are gone and I have to start over again — yes, that’s how I thought back then. And I rationalized that if my streak was zero anyways I might enjoy myself for a few days. And suddenly I was back in my old instant gratification routine.\n\nThis time, however, I managed to break that cycle. I got up this morning and meditated like I used to. I went to work and did my thing there, and afterwards is where I feel proud of now. I already told my gym buddy that I wouldn’t make it today, but then I went anyways. I worked out my legs lightly — because I had to fight the pain in my ribs — talked to some of my gym friends, took a shower and ate a healthy meal. Now I am writing and after this I’ll briefly journal. Then I’ll have followed the worst possible day in terms of new habits with a perfect one. This feels great. I feel like I improved my willpower today by a lot.\n\nAnd to be honest, the one day I missed yesterday isn’t too bad. It doesn’t really make a difference in anything. It would have made one, if I didn’t manage to get back on track so quickly. That’s my new mindset. One day doesn’t matter! No matter if that’s regarding good or bad habits. If you are consistently doing the good habits to a sufficient degree, one day can’t harm you.",
        "created_utc": 1676918202,
        "upvote_ratio": 1.0
    },
    {
        "title": "some Tipps to make myself look more attractive",
        "author": "ObviousRoad1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117fmoa/some_tipps_to_make_myself_look_more_attractive/",
        "text": "Basically title but not just physically but also how I should behave to be more attractive and liked",
        "created_utc": 1676915728,
        "upvote_ratio": 1.0
    },
    {
        "title": "You need to get rid of distractions",
        "author": "numberrrrr",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117fk99/you_need_to_get_rid_of_distractions/",
        "text": "Whatever you're trying to accomplish, or whatever goal you have, or whatever you want in life, you could get a lot easier if you were more focused. We only have so much time and energy and the more of that we put into a particular thing the more progress we'll make.\n\nFor most people it's probably social media. I think we all know how much of a timewaster it is. It might be videogames, which people will defend vehemently to keep in their lives. It's just a matter of how much you really want to be successful. Will you continue doing something that you enjoy, but is holding you back? \n\nYou probably have already heard stuff like this all of the time, so before you forget about this post immediately, I want you to ask yourself a few questions, really sit and think about them. \n\nWhat has been distracting me the most? What's that one thing that if I remove it from my life things will finally change? Just how detrimental has this thing been in reaching my goals?\n\n I advise you to forget about shit that doesn't matter and think about what you really want in life, and never let yourself think about anything else.",
        "created_utc": 1676915582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I regain my self worth and self esteem?",
        "author": "tjarod11",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117euj3/how_do_i_regain_my_self_worth_and_self_esteem/",
        "text": "I don't think highly of myself, and it's hard to me to accept compliments, especially from people I'm close to. I know it annoys those around me and I'm afraid it will drive more people away.\n\nI was raised in a cult to believe I was nothing under god. A god who themselves requires constant thought, daily thanks, and at least some weekly praise. We went to church because we were sinners, and becoming worthy of heaven was a catch-22. Thinking highly of one's self was seen as vain, but thinking lowly of one's self was seen as humble, no matter the context. The only way the cult taught self worth was to see yourself as more obedient than others, and in constant agonizing competition.\n\nNow I'm an adult, separated from the cult, but I still feel like a bad person and many events in my life confirm how bad of a person I must be. At this point I only exist because I'm a tool to those whom I care about. I'm a piggy bank to my mother, an ear to vent to to my sisters,  a second parent to my youngest brothers, and a can opener for the family pets. I'm nothing to myself and live a teeny tiny life that is somehow still bigger than me.",
        "created_utc": 1676914147,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've come so far, but at what price?",
        "author": "straight2thadome",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117emiq/ive_come_so_far_but_at_what_price/",
        "text": "Tl;dr: turned my life around to be successful and motivated but it made me negative about intrapersonal relationships. Plus I discovered I have an anxious attachment style with women. I'd like book suggestions or advice. \n\n\nSo I started my self improvement journey about 10 years ago. I was ruthless and determined and calculated. It has paid off. I went from scrounging for groceries and being extremely depressed all the time to: now I own my own home, just paid off my nice (middle class type vehicle), I have a killer savings, I own 2 businesses, I have upped my social skills, I've went from 310lbs to 220 and I'm still losing and about to start lifting. Everything's pretty great except one thing: \n\nI'm a nihilist.  I used anger and sadness as my motivator. I think everyone has an agenda and I'm I realized I have an anxious attachment style in relationships which ruins any chances I have at them.  \n\nI'm pretty sure I can stay motivated off \"momentum\" now, but the negative world view of others is hard to get rid of, and I've isolated myself A LOT - although its been getting better.The anxious attachment issue though, im at a complete loss as to how to combat that. \n\nFor all this stuff + my depression I tried therapy and it's a joke.  The therapists I've seen are the absolute worst. For example the last one I had told me the rapture was coming and we were halfway through the book of revelations. I'm an atheist.  Lol.  \n\nAny advice, books, anything like that would be greatly appreciated. Thank you.",
        "created_utc": 1676913738,
        "upvote_ratio": 1.0
    },
    {
        "title": "mental health when it comes to friendships and dating",
        "author": "Upper-Assistance8712",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117ekkm/mental_health_when_it_comes_to_friendships_and/",
        "text": "I’ve spent most of my life feeling insecure with where I stand in other peoples life. I’ve never had a ton of friends but have always had one or two close friendships, my best friend and I have known each other for 12 years. On the other hand, dating has never been smooth sailing for me and I’ve always been the single friend. When I was younger it didn’t bother me that much but the dynamics of my friendships have obviously changed now that people are in long term relationships and married. \n\nF as long as I can remember I’ve gone through stints of feeling blue because I feel lonely and like I’m lacking social connectedness with people. I’ve put myself out there in regard to meeting new people for friendship and dating and nothing has stuck. What frustrates me the most is I can’t snap my fingers together and magically change my circumstances. It’s been literal years since I’ve made a new friend or been in a long term relationship and I feel so disempowered and down because of it. \n\nAny advice on how to cope when you’re feeling socially defective and lonely? I’m in the worst rut right now and could use some input!",
        "created_utc": 1676913649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help in dealing with my thoughts",
        "author": "Divya5009",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117dihz/need_help_in_dealing_with_my_thoughts/",
        "text": "I am not sure if this is even the right place to post this. But anyways gonna post it here\n\nSo, basically I have had my two tests and performed bad in both of them. That means I will get embarrassed in front of my classmates not once but twice. Now, yes obviously y'all gonna say you are overthinking. Obviously I am. And yes I know this isn't even a big deal.\n\n But, sadly last few weeks my impression on my classmates and teachers has been pretty bad. For, some reason, I am unable to perform well in my studies, orals and exams. That wasn't really the case before\n\nAll I wanna do is stop caring about what others think and focus on my goal. Invest my time in productive activities. I have watched serveral videos on self discipline and stuffs. But it's just too hard to apply it in real life",
        "created_utc": 1676912031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self esteem",
        "author": "Just_a_racoon_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117d214/self_esteem/",
        "text": "I am very insecure and it’s affecting me so much in so many different aspects of my life. Any recommendations on practices, books or anything that might help? Exercise and nutrition have helped a bunch but I still struggle. Any suggestions are welcome, thank you!",
        "created_utc": 1676911388,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 year gap in college",
        "author": "blanketskyyy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117d09k/2_year_gap_in_college/",
        "text": "Hello is there anyone here who did not go to college for years? What is your experience and advice? Is it okay? \n\nI took year gap and planning to stop again but idk \n\nI am an artist so I can study in youtube and college here is not that good soooo im indecisive",
        "created_utc": 1676911317,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to improve my life but fear of loneliness, is stopping me from improving , what can I do to solve this problem?",
        "author": "theflameranger88",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117czfx/i_want_to_improve_my_life_but_fear_of_loneliness/",
        "text": "I have some goals I want to accomplish, but I am afraid of success. I am someone who is afraid of being lonely left out and someone leaving me, so when I try to improve my life then I become afraid that others will leave me because I am trying to become better, while they are remaining the same, I am afraid that they will say bad things about me and it will hurt me, I don't know if I am seeking validation from others or what is I really care what others think if me, it may be a way of protection of me. Is path to success really such a lonely road that you have to leave everyone that slows you down?I want to become better, I want to focus on only myself and self improvement but fear of loneliness and being people leaving me is stopping me, I am stopping myself from success . How do i solve this problem? Please help me get out of this fear",
        "created_utc": 1676911281,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Yorkers: Looking for help with spiraling thoughts?",
        "author": "READ_Lab",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117cesa/new_yorkers_looking_for_help_with_spiraling/",
        "text": "[removed]",
        "created_utc": 1676910489,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to start working and focusing on self improvement again.",
        "author": "Jorpn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117cc2i/i_need_to_start_working_and_focusing_on_self/",
        "text": "Ever since around the end of december - beginning of january, my progress and everything has been going down. I've had some good days but most of them were bad. I'm going to continue improving myself in every way, but for that, any advice what I should do to regain focus? (I started self improvement at around the beginning of september and it was going well till december)\n\nI'm greatful for any tips and advice.",
        "created_utc": 1676910389,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it worth it?",
        "author": "jozlard",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117bbgh/is_it_worth_it/",
        "text": "Hey, been a time I want to improve myself but I have a question I can't find the answer, maybe you'll help me.\nTo me, the goal of life I s to be happy, to enjoy life like if it's possible 100percent all the time. And it's true I liked the life when I was a child ( except some serious sh*y happening) but I was really flabbergasted when I discovered drugs, when I'm on drugs I really love it, there are no sensation as to be high.\nBut there is a downside, you can't have a normal life with drugs (having a job a wife kiss family etc)\n\nWell my question is What's the point? You supposed to enjoy your life but the biggest joy I've ever felt was on drugs but the drugs are not good.\n\nThe second pony I had in mind is that the self improvement doctrine is a bit like you have to suffer to enjoy to me er stay in your comfort zone, but but, the goal of life is to be in the comfort zone. Am I supposed to suffer all my life, to always go beyond my limits to attain some kind of happiness??\n\nI don't if I'm clear: how to be happy in a world where the only things making me happy also destroy me. This game is rigged.",
        "created_utc": 1676909011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can i do, or who can help me find purpose/direction in life?",
        "author": "Monked800",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117bah4/what_can_i_do_or_who_can_help_me_find/",
        "text": "I have no interests, hobbies, relationships, or tangible goals. I have no idea what to do in life. I just go to work and go home. I only have some interaction with therapy. No good experiences. Im on antidepressants, and none thus far have helped. \n\nI'm 30 years old and male.",
        "created_utc": 1676908972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really feeling frustrated",
        "author": "starscream06",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117b4nw/really_feeling_frustrated/",
        "text": "I have an anxiety attachment style.  I realized this after looking back at my past list.  I used to have frequent blind jealousy with my crush, and finally our relationship was destroyed, and this has happened 3 times, and I don't want this to happen again for the fourth time.  And I always have trouble texting, it's as if someone is holding me back from the inside, I feel like I'm never fun while texting is going on, it's just perfunctory.  What do I have to do?  i don't know where to start?  i really feel frustrated",
        "created_utc": 1676908759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to deal with negative comments from other people",
        "author": "FrankMiller_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117b1fw/struggling_to_deal_with_negative_comments_from/",
        "text": "In the recent months, I've noticed more and more that I am seemingly unable to deal with negative comments, mockings and just otherwise rude behaviour from other people towards myself. This is especially true if it comes from a good friend or relative.   \nToday my dad made several comments about how I am just generally unable and incapable to do anything in my life (he's a very negative person in general). I felt hurt and insulted after that and couldn't stop thinking about it since.   \nIt's like a torture, whenever I notice my thoughts revolving about the same situation over and over I tell myself \"Stop thinking about it, it leads to nothing\", but soon I find myself in the same obsessive thought loop. In my mind I imagine the perfect thing I should've said or done to defend myself. In endless replays I act out the same situation over and over again.  \nSince that doesn't seem to work, what else would you suggest to be freed from these kind of thoughts?",
        "created_utc": 1676908642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find recipe websites, any ideas?",
        "author": "Sozo013",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117anio/trying_to_find_recipe_websites_any_ideas/",
        "text": "I’m trying to find more diversity within my foods and have been searching for websites that have healthy, weight loss recipes. Does anyone know of any good places to look for?",
        "created_utc": 1676908095,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do You Stay Informed On Current Events Without Watching The News?",
        "author": "Dizzy_Smile3807",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117ae7b/how_do_you_stay_informed_on_current_events/",
        "text": "I made the conscious choice this year to start cutting out the news for my mental health. The news is super sensationalized now and is designed to instill fear and paranoia in you, and I've deduced that for the (minimal) legit information you receive, it's not worth it for me. \n\nSo, far, I unfollowed all the news accounts on social media. I still skim the headlines on Google News at least once a week so I have a baseline idea of what is going on in the world. I keep up with local news as it is more relevant to my everyday life. \n\nIf I want to learn more about a topic, I've opted for reading a book or doing individualized research instead. \n\nI'm not sure if anyone else has done a news detox and what they did to stay informed and educated about what is going on in the world.",
        "created_utc": 1676907746,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call the condition of always wanting to save the best for a different occasion and how do you think it should be handled?",
        "author": "AlexanderPatrovsky",
        "url": "https://www.reddit.com/r/selfimprovement/comments/117a91m/what_do_you_call_the_condition_of_always_wanting/",
        "text": "I don't know if people from other social class and cultures can relate to this but I have this tendency to save things for other occasions. I heard an italian comedian talk about something similar by sharing their situation at home. His mother would put their best plates on cabinets and only take them out when they have guests.\n\nIn my case, I tend to buy good quality things (relative to my means) then buy a cheaper one to use regularly. I'm trying to understand this because I feel like this behavior reflects poorly on how I view my self worth. Am I actually fairly justified in this behavior and just overthinking things? Am I actually right in assuming it's an unintentional expression of my sense of self worth? Or, is there something else entirely that I'm missing?",
        "created_utc": 1676907541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you put in a 12 Months 'Life Roadmap' ?",
        "author": "Boruroku",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1178lej/what_would_you_put_in_a_12_months_life_roadmap/",
        "text": "This year will be very important for me, and could - if I do it right - mark an absolute turning point.\n\nI am currently creating a 'roadmap' for my life for the next 12 months. So far, I have set goals with specific time intervals for the following categories:\n\n&amp;#x200B;\n\n* Career\n* Living Situation\n* Finances\n* Health + Fitness\n\n&amp;#x200B;\n\nWhat are other big areas that you think I could add to populate with actually achievable goals that can be defined for specific time intervals, e.g. \"July until October\"?\n\nI tried to come up with something for 'Personal Development', 'Relationships' etc., but don't see to be able to choose anything in particular that can be set as a 'SMART' (specific, measurable, achievable, realistic, time-bound, or about that) goal.",
        "created_utc": 1676904949,
        "upvote_ratio": 1.0
    },
    {
        "title": "The self improvement journey can be a lonely one.",
        "author": "throwaway8379292",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1178ilk/the_self_improvement_journey_can_be_a_lonely_one/",
        "text": "Since turning 30, Ive really put my self improvement journey in overdrive. I wouldnt say I wasted my 20s but I have a lot of catching up to do. I have a handful of friends, all at different levels in life but all of them somewhat stagnant. \n\nAs you all know, self improvement is a full time job and lifestyle. The people around me dont seem to grasp the concept. Their only goals are getting women (which they are not successful at). Every time I bring up the concept of bettering themselves, theyll rely with “women dont care about that”. As if everything they do is for women’s approval. I workout daily, not for women. I want to be financially successful, not for women. I want to be outgoing and articulate, not for women. \n\nIts extremely lonely and difficult when the important people in your life refuse to work on themselves and look down on you for being better than them. Either keep up or get out of my way.",
        "created_utc": 1676904740,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you remove shyness and insecurities in your 20s ?",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1178gtc/how_do_you_remove_shyness_and_insecurities_in/",
        "text": "Does anyone ever dealt with insecurities or shyness or the lack of communicating well with others. I feel like I'm so hesitant to reaching out to people in need to ask for help or advice because I'm just so overthinking and judging like what would they think of me or how they view me. It sounds so dumb to just even write all this stuff but honestly I just want to improve myself and get ahead in life. I mean just going in the right direction and having a purpose instead of wondering around everywhere. \nI'm currently in community college and I feel like colleges have so many resources for students to go in the right direction whether it's talking with a counselor or advisor or a professor or just classmates and getting a direction like what do you want to be or how do I get there or what are my resources to get a job whatever it may be. I'm just feeling so lost and confused and stuck with my career choice and my daughter told me to reach out to career guidance center yet I don't have that courage to go and seek for help. Deep down I want to but at the same time I just don't want to and the part of don't know it's like is it anxiety or or thinking what could it be.",
        "created_utc": 1676904608,
        "upvote_ratio": 1.0
    },
    {
        "title": "You know your daily habits have became unconcious when...",
        "author": "emrauta",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1177kne/you_know_your_daily_habits_have_became_unconcious/",
        "text": "I have been making my bed every single day for about 4 months straight now.\n\nThe other day while I was at work I was questioning myself all day if I had made my bed before I left. I could not remember for the life of me if had made my bed that morning because I was in a bit of a rush.\n\nWhen I finally got home later that night I open my room door to see my bed perfectly made. It made me so happy!\n\nThat alone proves that I have made an unconcious positive habit in my life. Cheers.",
        "created_utc": 1676902142,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wasted my life playing video games and now I don't know how to find my purpose",
        "author": "1fulcrumcomein",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1177cdo/i_wasted_my_life_playing_video_games_and_now_i/",
        "text": "I quit video games about 2 months ago with no plans on coming back ever after being in self improvement for about 5 months, I spent around 12 years playing video games all day (I'm 19 currently) having a serious addiction to them. Now I'm faced with having no purpose at all in life because I never even questioned myself about this due to my addiction, I guess I just planned to play video games till I die or something. I believe that one should find a purpose in life worth dying for, something that occupies my mind all the time and I strive every day to accomplish but since I didn't do anything for my entire life I don't even know what I like or don't at this point, I have some clues here and there but not enough to pin point something that I want to dedicate my life to. This year I have no obligations like school or university since I finished school last year and I'm taking this one off to really figure out what to do with my life. Should I dedicate this year to self improvement fully or should I try to find this purpose? I want to do so many things right now such as figuring out how to start a business, improving myself, finding my purpose, getting better socially etc. That I don't know how to balance my time or what to really focus on this year, what are you guy's thoughts? what should I do?",
        "created_utc": 1676901542,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 2 months my entire outlook on life has changed",
        "author": "emrauta",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11778ck/in_2_months_my_entire_outlook_on_life_has_changed/",
        "text": " On the 15th of July 2022 i was unemployed with no prospects\n\nToday September 15th 2022 I'm in college 2 days doing a diploma which should hopefully get me in to university and working 5 days a week(want to try and go down to 4)\n\nMy goal for the next two months is to crush my porn addiction send off my university application or at least get it almost finshed start working out again and to eat healthier\n\nFor the porn addiction I'm going to use Nofap\n\nNy college is going to help me with my university application but i need to decide on what and where i want to go/do\n\nFor working out my friend is has enough workout equipment that i can work out at his due to the fact that I'm focusing on weights because my work provides me with enough cardio\n\nFor eating healthier I'm going to first start calorie counting then try and filter out the bad stuff i eat\n\nThats my 2 month plan is there anything else i should add or do differently?",
        "created_utc": 1676901244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ways to boost your energy levels, according to Harvard",
        "author": "Zealousideal-Good598",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11774bt/ways_to_boost_your_energy_levels_according_to/",
        "text": "[removed]",
        "created_utc": 1676900955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got to know that I haven't really graduated 30 minutes before my graduation ceremony.",
        "author": "ThickAd18",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1177232/got_to_know_that_i_havent_really_graduated_30/",
        "text": "I wasn't exactly sure where this post could go. It's majorly a rant.\n\nSo today I had my graduation ceremony. My parents flew in to attend it and that's a pretty big deal because we're not financially all that great and the tickets cost a lot. I wasn't even sure if anybody from home could make it, so it was a lovely moment when I got to know that both my parents are coming. It was just a really happy moment for the entire family. Dad, Mom and my brother who couldn't make it because of work. They were all just really proud and happy for me.\n\nBefore the ceremony, it was important for everyone to collect their marksheets of the final semester. I head there and find out that I haven't cleared one of my re-exams that I had given the previous semester since I didn't pass in that subject's exam. This information was not conveyed to me in any way for 6 fucking months. I was even allowed to sit for my finals, which I cleared with decent marks. Now because of this, I'm not eligible to get my degree till I pass another test for the same subject.\n\nI booked my tickets for home a month back to get them as cheap as possible. They've been booked for the 4th of October because I wanted to surprise my mom on her birthday. I haven't been around for her birthday in 3 years now. And now I've been told that the re-exam will mostly happen some time in October, either on the 16th or 17th. I've got my return ticket booked for the 28th.\n\nMy parents and my brother have no clue about this because I'm too fucking scared to tell them. It's breaking my heart that I'll be disappointing them so much with this news. Today was supposed to be a good day. My parents couldn't stop smiling and talking about their college days. My brother has been nothing but proud of me. He even gave me his camera as my graduation gift. In a month's time I was supposed to be home with my family, giving a big birthday surprise to my mom. Now, I just feel like a fucking fraud. I hated being in that graduation gown, wearing my graduation cap, being called on stage to receive my fake degree because I was too stupid to not even be able to pass all my papers. My entire batched deserved this ceremony, but I didn't.\n\nThe last couple of months have already been harsh. I just got out of a very toxic relationship that was fucked up on so many levels that it still messes with my head to the point where I can't help but just breakdown. Work's been getting more difficult to handle. And now this. I just feel like I'm hitting the kind of low I've not experienced in a long time. I'm just being a disappointment to myself and the people around me. My family is going to be so disappointed in me for this.\n\nI know there's no point in this but thanks for hearing me out anyway you guys. I just needed to vent out.\n\nEDIT: Even though I've had this account for more than a year, I've only recently been using it actively. I had no clue what a platinum was. I just checked it out and I can't believe someone was so nice enough to reward me one. Everyone has been nothing but nice to me here and I'm so so grateful to everyone. I'm currently waiting to drop my parents off at the airport. Once I'm done, I'll reply to everyone. Thank you so much for all your kind words!",
        "created_utc": 1676900796,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle admitting you were wrong?",
        "author": "underrepairintx",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11770o7/how_do_you_handle_admitting_you_were_wrong/",
        "text": "I used to have a ignorant FTP attitude when I was younger but Saturday Austin had a rash of \"street racing\" idiots. They got chased off and showed up where I was working a store alone. 50-something people. I'm so thankful for their presence I messaged APD to thank them and put it on my Facebook which nobody is going to see because everyone blocked me for being a jerk years ago.\n\nI really want people to see who I am now, particularly the ones I actually care about. Do I message them too? It seems too much like \"LOOK WHAT I DID!\" and it isn't always about me (but this time, I guess it is?).",
        "created_utc": 1676900696,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 2 months my entire outlook on life has changed",
        "author": "nando_dekrllo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176z99/in_2_months_my_entire_outlook_on_life_has_changed/",
        "text": "On the 15th of July 2020 i was unemployed with no prospects\n\nToday September 15th 2020 I'm in college 2 days doing a diploma which should hopefully get me in to university and working 5 days a week(want to try and go down to 4)\n\nMy goal for the next two months is to crush my porn addiction send off my university application or at least get it almost finshed start working out again and to eat healthier\n\nFor the porn addiction I'm going to use Nofap\n\nNy college is going to help me with my university application but i need to decide on what and where i want to go/do\n\nFor working out my friend is has enough workout equipment that i can work out at his due to the fact that I'm focusing on weights because my work provides me with enough cardio\n\nFor eating healthier I'm going to first start calorie counting then try and filter out the bad stuff i eat\n\nThats my 2 month plan is there anything else i should add or do differently?",
        "created_utc": 1676900595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low productivity",
        "author": "whatalavender",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176z8i/low_productivity/",
        "text": "Hello, any tips on how to boost productivity when you're feeling like nothing you do is ever working? I have such trouble with productivity and don't know what to do. What are your suggestions?",
        "created_utc": 1676900593,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Stop Overthinking And Overworrying?",
        "author": "0zMosiss",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176xpx/how_to_stop_overthinking_and_overworrying/",
        "text": "I don't know when or how this started but now I can't stop it. My mind always, without fail goes to the worst possible scenario. Some slight muscle pain = a serious injury to me, a random photo on my phone = a virus on my phone to me, a small paper cut = gonna get infected to me. Most of the time those things don't happen at all but even though I know it won't happen, my mind still won't stop. You can tell by y post history that I worry too much for my own good and I wanna stop. The worst part is that I use Google to get my answers, and Google always give you the worst case scenario. Its like I know that my  worries are meaningless but there is just this side of my mind that keeps tellng me that my worries are facts. Idk how to stop this problem at all. Usually the only way I relief myself from my worries is asking a doctor for anything dealing with health, factory resetting with anything dealing with malware and for the other stuff I go on websites like reddit or quora to ask annonymous ppl. Praying helps too but sometimes I just pray for useless shit. Honestly, I have no clue how to stop this problem so I am here to ask for help. This came out longer than I expected so a tldr will be left.  \n\n\nTLDR: Overworrying problems, dont know how to resolve",
        "created_utc": 1676900478,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Reason Why We Procrastinate",
        "author": "Extension-Log-2552",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176uux/the_reason_why_we_procrastinate/",
        "text": "Your brain is born to survive, not to thrive. Over the past 10,000 years, the brain has developed itself into a very advanced surviving machine, that no matter what the problem is it can actually survive, or find a way to solve it.\n\nNow consider this situation, you want to work on your personal project that’ll give you benefits after 2-3 years, want to learn a language that requires 1-2 years of dedicated hard-work. But all this to the brain seems useless, because it cannot process the long-term goals, for it getting instant happiness is the key to survival. Consider the situation long ago when you were in a cave, getting the food and eating it was the key to survival, then at times storing some food dinner or a day seem to be long term planning, that too was rare and usually during the winters. The major cause of this was that the chance of getting killed was very high. You could have been attacked by a sabre tooth, mammoth, crunched by a crocodile. So, long term planning was useless, as you wouldn’t live long enough. So, eat now, enjoy now, drink now, play now. Fast forward 17th,19th &amp; 20th Century, the world wars, and wars of independence, again the same problem. You can get killed by a bomb, bullet etc. Or if not, there are disease like plague, etc. to wipe you out. Average human life span 40-50 years. Now, consider the lifestyle from the past 30 years, things have changed rapidly, doctors and medicines are there to save you, govt. is there to protect you, you have rights, you have houses, there are no wars, going outside your house. So, things are not the way it used to be, but the brain cannot unlearn the 10,000 years of education that was passed onto you by your ancestors, your brain is still the same, survive now, eat now. News adds stuff to the survival instinct, saying about how many people die in car accidents and all, affects your brain.\n\nThe brain cannot understand why work for 8 hours a day, for 5 years in a row? Why work for something that may or may not happen in the future? The lifestyle has changed but our brain remains the same. So, whenever you feel the urge for eating that doughnut in the fridge, postponing the workout, leaving the studies for tomorrow, remind yourself and your brain, that this is the new survival instinct, this is how people now have to survive, cause you’re going to live long enough and you may not be able to work then to feed yourself, so it’s better to save some money, do some extra work else later in life there will be suffering, pain and anxiety which are the new diseases now. So, better plan and do the work. Survival instincts that are 10,000-year-old doesn’t help you much in new age. So better start the thing you want to.\n\nSo, the new survival instincts will be, work hard towards a new plan, work with the future in mind, because if you don’t work now. In the future you will be broke, depressed and probably be dead. Remind yourself of this every day.\n\nTL/DR:- Our brain is wired for instant gratification as it can't comprehend our long life and certain safe future.",
        "created_utc": 1676900269,
        "upvote_ratio": 1.0
    },
    {
        "title": "“... at your best”",
        "author": "sikes_gg",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176qck/at_your_best/",
        "text": "I got pretty upset during therapy today, and had a very legit overdue cry. At the end of the session, my therapist said “you said something earlier about not being well (I said I wasn’t in a good spot and wasn’t doing well), but I thought today you seemed at your best. Which is what you are when you’re really feeling your feelings.”\n\nI thought this was a good reminder, or slight perspective shift, that it’s good to acknowledge how you’re really feeling and not just keep chugging along without processing or dealing with tough situations.\n\nGo on and feel your feelings, even if they hurt.",
        "created_utc": 1676899917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t wait for motivation to do the things that are good for you.",
        "author": "Independent-Intern55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176oji/dont_wait_for_motivation_to_do_the_things_that/",
        "text": "I’m pretty guilty of this, I will wait until I’m inspired to take healthy actions but the truth of the matter is that sometimes it doesn’t work. I’ve waited around for inspiration for months only to find it didn’t come in the way I expected, no burst of magical energy that helped me do the tasks that I’ve been trying to do for a while but couldn’t get myself to do.\n\nThis morning, I got out of bed earlier than I wanted to. When I’m really on a roll getting out of bed is easy but I’m in the beginning phases once again of cleaning up my daily actions and creating a life full of health and energy. The inspiration didn’t come naturally. It was forced honestly. I got out of bed groggy and tired but I turned on the meditation anyway. My eyes were basically shut from being tired and I wrote after anyway. Sometimes inspiration isn’t something that comes in a divine way. Sometimes it’s something you have to create. Overtime it does get easier, I’ve experienced it before. Overtime the natural abilities start to align together once again and things start to fall together. But if you’re waiting for inspiration to eat healthy, get out of bed, meditate, do yoga, workout, write, or whatever habit you know is going to help you, you might wait forever. Sometimes you have to push yourself. For me, motivation hasn’t been a starting point, it’s a continuous line that only kicks off once I’ve forced the starting point.\n\nToday I invite you to do something different today that you haven’t done before, maybe because you’ve been waiting for inspiration that never came or the perfect moment and energy to start. Now is the perfect moment, it just might not look at all like it on the surface. Now when I hear my mind try to talk me out of doing something good for me I ask myself, will I be grateful in a year if I work on this practice consistently? If the answer is yes, even if I’m tired, even if i don’t want to, I’m doing the thing because I know it can be the best decision of my life.\n\nSending y’all love and hope you have a great day.",
        "created_utc": 1676899784,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm choosing to leave a toxic work environment",
        "author": "Leather_Raspberry_86",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176kwv/im_choosing_to_leave_a_toxic_work_environment/",
        "text": "After working here for going on 3 years, I've realized my boss has this habitual behavior of declining new ideas that didn't come from her. Micromanaging, bossing people around, firing people who stand up to her, and consistently degrading people behind their backs after they're gone. Always has someone to target, and always feels like someone on the team needs to be cut for some reason or another. I've seen her try to make improvements, but it seems to be a cycle of some sort.\n\nI'm proactively working to get a new job. Learning new things in my field that would help me get places.\n\nAs much as I love my other co-workers, and as much as I would like to pretend that work-life doesn't affect my personal life so deeply, I'm choosing to move on.\n\nI also basically got this job to follow a path that a parental figure set our for me. Not a path that I want to follow anymore.\n\nI'm choosing to be my own person and make my own choices.",
        "created_utc": 1676899497,
        "upvote_ratio": 1.0
    },
    {
        "title": "we are much stronger than we think we are.",
        "author": "caiwenjiazina",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176hus/we_are_much_stronger_than_we_think_we_are/",
        "text": "the water you fear is not there to drown you but to show you that you can float when you stop fighting the current.\n\nwe can handle much more than we give ourselves credit for. and we can even thrive from the moments that we didn’t think we’d survive.\n\nsending everyone, especially those who need it a lot right now, so much love.\n\n\\*\\* EDIT: I really appreciate the support. My Dad passed away this morning and I wrote this while I took a break from his bedside to get food and shower last night . Luckily, I was able to be with him and my mom while he took his last breath but reading your support really has helped me know that these words were truly channeled before my hardest moment on this Earth so far. Much love to you all.",
        "created_utc": 1676899254,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to learn care less about attention and what other people think",
        "author": "gabol428",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176dvg/i_want_to_learn_care_less_about_attention_and/",
        "text": "Hi everyone,  \nIv'e been through a huge eye-opening break up for the past 6 months. I've been noticing a lot of qualities about myself that I didn't particularly like, but instead of ever doing something about it, I kind of just pretended that these traits about myself didn't exist.  \nYesterday I caught up with my ex, and while it was a great conversation overall, there was a moment/comment she told me about that really jerked my insides.  \nA few weeks ago, I ran into one of my ex's friends at a concert, and in my drunken state did something that made me seem like \"i just wanted attention.\" Her friend told my ex to never talk to me again.\n\nI think the reason why this comment set me off so much is because I know it's true. I care so much about what people think about me, and I really do enjoy getting positive external attention from people. I think it also hurts because I like to give off the impression that I don't care what people think about me, but the moment someone thinks negatively of me, I freak the fuck out.  \nI used to be so internally fixed on receiving social media likes and garnering attention from my actions. For example, I knew things like being a Resident Assistant at college garners a lot of respect, but I never really enjoyed the job. I'm conscious and aware that a lot of peers look up to me (not trying to state this in a cocky way), but I'm also conscious that all of this just boosts my ego.\n\nI want to just learn how to be content and satisfied with just myself and not be so driven/addicted by external validation from people I probably wont even see once I graduate college. I feel like a little narcissistic, self-absorbed, and shallow person from caring about these kinds of things. I want to do things for ME and feel proud rather than do things because I know people will look up to it if I present it the right way.",
        "created_utc": 1676898945,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the best way to learn about EVERYTHING?",
        "author": "dannyhaiqal_02",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1176amh/whats_the_best_way_to_learn_about_everything/",
        "text": "is it bad that I want to have knowledge about almost everything? art, music, drugs, laws, literature, different countries, economics, history, politics, etc. I want to know a lot about all kinds of things in our world, just not sure what the best method for learning this is...\n\nI want to read more but I'm completely lost on where to start and what are the best books to read for each subject I'm interested in. Any help?",
        "created_utc": 1676898689,
        "upvote_ratio": 1.0
    },
    {
        "title": "The only way to get rid of vices or unhealthy habits is to replace them with something else.",
        "author": "vulsok_ysera",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11768m1/the_only_way_to_get_rid_of_vices_or_unhealthy/",
        "text": "My point is you cant last very long being anti-alcohol/smoking/sugar/fastfood/porn, etc. You have to fill whatever void that thing left inside. If you cant and you struggle it will do you more bad than good. Just like ex smokers use mints candys, so find the best thing that suits you before abandoning that unhealthy habit.",
        "created_utc": 1676898531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using my time outside work wisely: exercise instead of youtube and social media.",
        "author": "pepperwanky",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11764mw/using_my_time_outside_work_wisely_exercise/",
        "text": "[removed]",
        "created_utc": 1676898218,
        "upvote_ratio": 1.0
    },
    {
        "title": "I actually feel like a person again",
        "author": "Agile-Ad-2879",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11762t2/i_actually_feel_like_a_person_again/",
        "text": "I know I’m not at 100% right now but I also don’t think I’ve ever been at 100% saying I’ve lived with mental illnesses most of my life but only recently began treatment. But regardless, I feel human right now. I keep up on medications, I brush my damn hair, I eat foods other than raw cookie dough, I want to do well in school, I want to use my brain and these are all things I never realized I was missing out on.\n\nI’m in a weird phase where I have a lot of restless energy that I’m trying to direct but I think a lot of it is based in the fact that this is the longest amount of time I’ve gone in my life without wanting to die. I actually really don’t want to die. I don’t feel the need to go out and experience \\~everything\\~ but I’m excited about the idea of walking in the grass tomorrow and finishing my art final and making a really good smoothie for breakfast. It’s really small things but it’s small things I’ve never cared about.\n\nI care and that’s the biggest change. I care about myself. I just wanted to share. I’ve lurked on here for a while and I wanted to say thanks to everyone who participates here. You do help people.\n\nIf any of y’all need anything hmu. Things can suck and you feel small, but you gotta meet yourself where you are. So start small. Go team, have a great week :)",
        "created_utc": 1676898091,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I bag 200K+ earning jobs?",
        "author": "badkittycartman",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11761lw/how_do_i_bag_200k_earning_jobs/",
        "text": "I have a mechanical engineering degree, have completed an MBA, and have done a post-grad diploma in Project Management. \n\nCurrently, I'm working as the Marketing Director for a home security company in Edmonton for a year now. The job is entirely remote, I set my own hours, I love my boss and my colleagues, and the work-life balance is insane. However, I only make 55K/year. \n\nWhat skills/courses/coding languages can I learn in a year to put me in a position to bag jobs where I can make 200K+?",
        "created_utc": 1676898006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spiritual healing",
        "author": "Business_Power_757",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175z8a/spiritual_healing/",
        "text": "When nothing is working according to your wishes, when nothing is going in your favour, when your life is not going the way you want to? Then just surrender and believe in a higher plan.\nWhether it's Krishna, Shiva, Allah, Mahaveer, Buddha, universe, higher or supreme energy or your intuition, whatever and whichever form you believe in, just surrender to their plan. They know what's best for you.\nThey know what you need, who you need, how much you need and when you need it.\nSurrender all your worries, anxiety, pain, problems to them and let it go. Believe and have the hope that all this is happening for a reason and that there are better things coming in your way.\nYou might not get your answers now but you'll get to know one day and it'll be worth it.\nSurrender and trust that higher energy. That's how you'll heal.\nThat's how you'll find peace, love and happiness",
        "created_utc": 1676897798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Morning routine",
        "author": "Youngstoney3",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175yaq/morning_routine/",
        "text": "First time posting. I’ve been trying to work on better health overall. Always been in pretty good shape but I got a new job and my job sends me to school as well. But don’t have the energy to lift/run after work so I try to go in the morning. I added meditating and stretching to my everyday routine. When I go to the gym in the morning I feel amazing throughout the day. But getting up to go every morning has been my struggle. I physically snooze my alarm in my sleep and don’t know how to stop. I get up some mornings with no problem and turn it off and go. Other mornings I snooze it and all of a sudden it’s time to leave for work. Just looking for some advice to stop this or what I could do to change this r/help",
        "created_utc": 1676897718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop playing Video Game",
        "author": "steamissue",
        "url": "https://www.reddit.com/r/selfimprovement/comments/1175xp4/stop_playing_video_game/",
        "text": "I Play Video Game Steam And I Lost My Expensive Account And Im So depressed That My Expensive Account Got Lost And No Longer To Recover And I'm Thinking To Stop Playing Video Game This Is the only Way That I Can Change my Life Living A Happy You Live Longer Happier Stop Wasting Your Boring Life With A Stupid Stuff gaming...Tell me About Your Video Game addiction",
        "created_utc": 1676897667,
        "upvote_ratio": 1.0
    }
]