[
    {
        "title": "Is there hope of me having a relationship with a girl?",
        "author": "SmilingIvan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pj6lw/is_there_hope_of_me_having_a_relationship_with_a/",
        "text": "I’ve been single 10 years. That’s awful as far as practice goes.\nFew people on here have told me to give up and it’s useless. What do you think?",
        "created_utc": 1678639625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Result of Day 2",
        "author": "Subash-11831",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pj2at/result_of_day_2/",
        "text": "Today was not bad as I thought it would be, I completed my assignment but didn't studied, instead I spent my day watching a K-Drama called \"Glory\". It's about a girl getting revenge on her bullies, I binge watched it. It's really good it gave me motivation to work more hard on my dreams. That's it for today guys, I will hope you all succeed in your goals. I will be back again tomorrow with my goals for Day-3, Bye Guys !!",
        "created_utc": 1678639350,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make more female friends (close ones)",
        "author": "VivelEmpereur01",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pioiy/how_do_i_make_more_female_friends_close_ones/",
        "text": "I am 22 years old (male) and pursuing a degree in mechanical engineering. I'll soon be graduating from college, and when I look back at life for the last few years, I have realized that there were many things I wish I had done but didn't. One of them is that I barely have any female friends. I currently have only one girl I could consider a legitimate 'friend', and I'm not even that close to her. All other girls I know are mere acquaintances and are just friendly towards me. I have seen several of my (male) friends have multiple female friends, and I want to know what they are doing differently that I am missing. I have tried several times to talk to girls, and most of the time, the conversation does not flow as well as with guys. There were a few girls with whom I could sustain a reasonable discussion, but we were never truly friends even then. \n\nThis has got me thinking that it may be something I am doing wrong. Maybe subconsciously, my body language is closed; maybe it's my looks - I don't know. I never face this when interacting with guys. Somehow females seem more taciturn. I really want to improve myself and confidently interact and make friends with all genders. Any advice will be much appreciated.",
        "created_utc": 1678638440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I addicted to using the toilet?",
        "author": "ballslover43",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pil8h/am_i_addicted_to_using_the_toilet/",
        "text": "Hello,\n\nI've just come down from an incredibly intense psychedelic experience (30mg 5-meo-DMT + 800ug  25I-NBOMe for those who are curious) and I'm beginning to see my life in another perspective. I've made the observation that I cannot go more than 24 hours without using the toilet (even less for a number 1.) \n\nAddiction: the fact or condition of being addicted to a particular substance or activity. (via google)\n\nHow should I stop? Is there an easier way of doing it, like weaning off and lowering the amount of times i use the bathroom daily, or should I just go cold turkey? I've heard sometimes monks in Tibet go decades without relapsing and am looking into a possible strategy to take up meditation to resist these urges.\n\nI'm afraid the addiction has stemmed too deep and it's too late to quit. This is a great time of uncertainty in my life and i have nobody to turn to for advice (i am an orphan.) \n\nThank you for any advice.",
        "created_utc": 1678638220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorry to this subreddit for my freakout. I was actually saved yesterday. So my way of saying thank you to this sub. Something prevented me from ending it. Now I have to do my best for myself and all of you who tried to help me and truly be better.",
        "author": "RefrigeratorKey1518",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11piksc/sorry_to_this_subreddit_for_my_freakout_i_was/",
        "text": "I know you are tired of hearing from me. Yesterday, I broke down because I failed at a crucial stage of life by being a virgin at 25 and that another sub told me that no girl wants to take a chance on a virgin no matter how much they wanna work on themselves. I was heartbroken, I already loathe myself for getting this far in life and not being able to get a date or have sex despite trying.\n\nI have a ton of handicaps(brown, short, fat, virgin) but I do care for people. I have tried to combat my handicaps via lifting, diet, therapy, meds,fashion, focusing on grad school but was hurt to hear that being a virgin at my age cancels any hardwork I do out. And I can't stop thinking about sex, I am horny but don't want hooker.\n\nI had enough, I got in my car and was speeding to a bridge where I was gonna end it. My car slipped on some ice and I hit the sidewalk and had to be towed after messing up my tires. After going home and crying all night, I realized that saved me. \n\nNow I can't change my honesty. I ruined my life, I didnt spit game more often and lose my virginity, but I want to and I am not a freak I am just broken man who's trying not to be. And praying some woman can look pas the virgin issue.\n\nJust thank you again, I got a second chance at life. I am cooking for my parents now and scary to think if I didnt slip on the ice I wouldnt be.",
        "created_utc": 1678638190,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want myself back",
        "author": "its_seraph",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phzs2/i_want_myself_back/",
        "text": "I don't know why but this year has been so bad for me so far cuz i have been developing some unexpected interests by time .. i am 17 now and i am acting like a manic who just wants to have sex with anyone (i am bi ) and even though i regret af after doing that but still i feel like doing it more even knowing that i am just gonna feel guilty after that ... I eagerly want to use this time more productively but there are these things that seems to be a hard-core barrier for me and it feels so disgusting being behind these Barrier... I want that version of mine who just don't feel like doin sex with anyone and is creative and innovative all the time ...",
        "created_utc": 1678636819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low self esteem",
        "author": "WorldlyAd637",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phxap/low_self_esteem/",
        "text": "Lately, i have been really insecure about my appearance and i'm kinda obsessed with looking good most of the time. My self confidence has drastically dropped, it has been low since a couple of years. I overthink way too much and i can't get myself to post my own pictures on social media without overthinking and i worry about how i may look to others. It dropped more when i used the inverted filter on my selfies and found that i have asymmetrical eyes. Although my parents and sibling says they don't look asymmetrical to them as such and that i look good but i still don't believe them. I hate how this affects me. Would be grateful if you can help me out.",
        "created_utc": 1678636650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip: Get a sheet of paper and write 2 columns: \"Problems that are my fault\" and \"Problems that are not my fault.\" It's incredibly liberating.",
        "author": "SteadfastEnd",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phnks/tip_get_a_sheet_of_paper_and_write_2_columns/",
        "text": "Too many people fall into the trap of either blaming *everything* on themselves, or *everything* on others.\n\nOne of the most liberating things you can do is to get pen and paper and truthfully, honestly, write down 2 columns: first a list of every problem that is your own fault, and then a list of every problem that isn't your fault.\n\nYou may be very surprised at what you write down. It can be liberating both ways - liberating in the sense of a sobering look at self and what one needs to change, and/or liberating in realizing that some bad things aren't really your fault at all.",
        "created_utc": 1678635985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like I spend half the day staring at a wall",
        "author": "Seibaru_Seibara",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phkkg/feel_like_i_spend_half_the_day_staring_at_a_wall/",
        "text": "25 years old. Picked up my first full time job recently, and while I have fun it takes up most of my day. At work, I do well but I'm always paranoid that I'm on the edge of being fired for whatever reason.\n\nI'm not getting out of the house much during my free time, as I usually have work to do. My room's a mess and I usually work from bed, which does a number on my posture. I'm not going to the gym much anymore, because I'm either working or tired. I always feel like when I'm ready to do something to better myself or something legitimately enjoyable, I'm busy working. I'm going to grad school soon, so if I'm going to develop good habits, I have to do it now.\n\nI feel like I'm staring at a wall half the day. Am I just a brat who needs to grow?",
        "created_utc": 1678635775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling upset/angry/jealous at other people’s happiness",
        "author": "savysenior86",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phirb/feeling_upsetangryjealous_at_other_peoples/",
        "text": "[removed]",
        "created_utc": 1678635651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poor Genetics Need Help 16M",
        "author": "Certain-Aerie-7076",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phikj/poor_genetics_need_help_16m/",
        "text": "how can i become a better version of myself\n\nCONS\n\n1. I am 2 inches shorter than the avg\n2. Skinny with thin wrist\n3. Poor Jawline\n\nPros\n\n1. Academically Good\n2. 16 year old so maybe it isnt too late\n3. Will be absolutely free for coming month or two",
        "created_utc": 1678635637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this ethical? I made a dating app bot to get dates and it actually works",
        "author": "curatorezm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11phh1h/is_this_ethical_i_made_a_dating_app_bot_to_get/",
        "text": "Dating apps have always favored women, so I decided to tip the scales. Got tired of filtering through all the flakes, attention seekers, and endless swiping on dating apps. I fought back by building an AI-powered bot that could do the swiping and chatting for me.\n\nThis bot is designed to learn my preferences based on my previous matches, allowing it to understand my type of girl and engage in meaningful conversations that are tailored to my interests.\n\nThe results have been astounding. In the first month, the bot scheduled 13 dates for me, all of which were with girls who matched my preferences and had similar interests to mine. I no longer have to waste time swiping aimlessly or struggling to come up with conversation starters.\n\nHowever all of this feels a bit dishonest. On one hand, the bot has allowed me to meet more women who are compatible with me, and has saved me a lot of time and effort. But on the other hand, I feel like I'm not being genuine in my interactions. The women I'm matching with are not aware that they are talking to a bot, and that doesn't sit well with me.\n\nI'm conflicted about whether or not to continue using the bot. I don't want to deceive anyone, but at the same time, I don't want to give up the benefits that the bot provides.\n\nIn 2023 I wanted to become a better person, and I’m not sure I am on that path.\n\nTL;DR: made a dating app bot that gets me dates, thrilled it works but part of me feels like it’s dishonest and unethical.",
        "created_utc": 1678635532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remind yourself about how you overcame challenges",
        "author": "Lordemaraldthe3rd",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pgyii/remind_yourself_about_how_you_overcame_challenges/",
        "text": "Yesterday, I had promised myself that I'd get in 30 mins of HIIT cardio. I do it every Saturday.\n\nThen I motivated myself to do HIIT, It was tough at first but then I was like you know what I am gonna do this 30 minutes. I was about halfway in 15 minutes.\n\nMy parents came home, they wont really let me do HIIT workout at home, because it makes too much noise I do understand that very well, fair enough to them, but after that I thought it was over, I got really upset that I broke a promise I made to myself. \n\nThen i was like \"You know what?, I am gonna finish this damn workout\". I took a bunch of old clothes layed them on the floor so it wont make any noise. Turned on the video and decided to finish where I stopped this was at like 9pm. \n\nIt was tough my goodness, I just had my dinner as well. But I decided to push through, I felt like giving up every second, but every time I did feel it. I closed my eyes and imagined the whole world packed into this 1 very big stadium and there was me in the middle of pitch, and the whole world was chanting my name, encouraging me to finsih the workout, workout felt like a breeze finished all of the 15 minutes, i was sooo proud of myself, that i didnt make any excuses. I could have stayed lazy, and do nothing, but I refused to stay that way.\n\nI do apologize if this is cringey, but I am soo proud of myself, And I hope you are too. Its a good imagination as well, do use it and find out if its effective. Goodluck bye, Love all of You.",
        "created_utc": 1678634239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Charimsa on command book the same as the course?",
        "author": "Throwaway208080",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pgtzi/charimsa_on_command_book_the_same_as_the_course/",
        "text": "Anyone that has the course can you confirm its the same as the book?",
        "created_utc": 1678633934,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to start changing your life?",
        "author": "catherinereddit",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pgpot/how_to_start_changing_your_life/",
        "text": "[removed]",
        "created_utc": 1678633659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Valuable seminars or courses files",
        "author": "UnderstandingQuiet88",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pgiet/valuable_seminars_or_courses_files/",
        "text": "^(Anyone has torrents or mega files for seminars or courses in any topics?)",
        "created_utc": 1678633177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving ahead",
        "author": "Patient_Wafer4994",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfsy9/moving_ahead/",
        "text": "So I had posted on this subreddit about my social anxiety and shyness and how I overcome it.\n\nNow that I have overcome it I'm thinking about moving on the next stage like now I want to work on my physical and mental health.\n\nI'm want to lose fat and little bit of weight in probably 6-8 months. I'm 17 and my height is 163(5'3)(yeah I'm short) and my weight is 63 kg which isn't considered as overweight considering my height and my BMI scale is also on a healthy side. I do have lot of fat tho so that's why I want to gain some muscles while maintaining this weight.\n\nI'm also thinking about having an actual skin care routine and doing meditation.\n\nSo I'm thinking about sharing this journey on a like daily or maybe weekly basis.\n\nWhat do you guys thing should I post about my journey here?and if yes then should I do that weekly or on a daily basis?",
        "created_utc": 1678631284,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was a drunk asshole and hurt people I care about. How can I start making amends?",
        "author": "Every1NeedsAFren",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfpwy/i_was_a_drunk_asshole_and_hurt_people_i_care/",
        "text": "This is kind of a long story, so I'll try to give just the important bits: My partner is asexual and I'm not, so last summer she suggested an open arrangement. We've been trying this arrangement for about 9 months with mixed results. I started seeing someone from my friend group, let's call her \"X,\" and I tried to make it clear at the beginning what the terms and boundaries of the open arrangement were, among them being that we're not allowed to catch feelings for each other. Well, we caught feelings for each other. It was wrong, but we kept seeing each other because we had a lot of fun together. At one point I thought me and my partner were going to break up, but then managed to settle things. X knew about my relationship troubles, and was certain I was going to break up with my partner and start dating her, but that didn't happen and she got (I'd argue rightfully) upset: she felt that I had led her on, and while I didn't mean to, in hindsite I can see how my discussing of my troubles would lead her to that conclusion. Over time, we were able to smooth things out, and decided to keep seeing each other, this time attempting a more platonic relationship. She set a boundary asking for me to not \"get with\" anyone else whie we try and sort this out. Then we went to a mutual friend's birthday party; we'll call the mutual friend \"Y.\" I got WAY too drunk (to the point where I don't remember most of the night), and apprently I kissed Y. X is (rightfully) FURIOUS with me, and Y is deeply embarassed and selfconcious.\n\nI recognize that this entire situation going bad is my own doing: a clear boundary was set, and I crossed it while drunk, and I know drunkenness is not an excuse for unacceptable behavior, even if it was to the point where I can't remember what happened. X and Y both have every right to be angry with me as what I did hurt them both. I'm not looking for forgiveness and I'm not looking for a way to get things back to \"the way they were.\" I feel like complete and utter shit, especially since X feels gaslit and used and dragged along with my own shit. I genuinely didn't mean to hurt anyone, but I'm not a smart man and I handled this entire situation extremely poorly. I care a lot about X, Y, and my partner, and I want to know what steps I can take to start making amends. Again, I'm not trying to seek forgiveness or try and get back into anyone's good graces: at this point, I feel that many bridges are well and truly burned. But it kills me that I hurt people I care about. I've been beating myself up about it all day, and I know that's neither helpful nor productive. I just need some guidance as I clearly need to do and be better.",
        "created_utc": 1678631055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this the formula for success",
        "author": "Spare_Department5413",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfgdw/is_this_the_formula_for_success/",
        "text": "Would you guys believe this is the formula for success in anything you want to do: Time, consistency, discipline and a belief in a future vision?",
        "created_utc": 1678630320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giving up the life you've planned for the life that's waiting for you...",
        "author": "JacksonKerchis",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfflx/giving_up_the_life_youve_planned_for_the_life/",
        "text": "*We must be willing to get rid of the life we've planned so as to have the life that is waiting for us.* \\-- Joseph Campbell \n\nWhen I was a sophomore in college I had my life planned out. \n\nI was in the prestigious Management Consulting Academy at my university and had an inside track to one of the top three firms (McKinsey/Bain/BCG). This is basically the route that most future Fortune 500 CEOs business big-shots go. It was all aligned. \n\nThe problem was - the more I learned about the lifestyle, the more it sounded like it sucked (sorry, no offense consultant friends!). \n\nI didn't think the flying to a new city to work a 60 hour week every week was worth the career boost. I started to learn that I didn't care about being successful, really, I just wanted to be happy. So I started to think about life in terms of optimizing for happiness. And after a few weeks of reflection I had my \"eureka\" or \"lightbulb\" -- I should major in happiness. \n\nIf I want to study business and bust my ass to learn a lot and have an amazing career and make great money in order to be happy. Why don't I just skip all those extra steps and study happiness? This made such deep, intuitive sense to me. I couldn't imagine studying anything else. \n\nAnd with that question I was faced with a decision...\n\nAm I willing to give up the life I planned to have the life that is waiting for me? \n\nYes. (A hard yes). \n\nAnd as I look back now on my family history, my childhood and teenage years, the adventures, the heartbreaks, the long nights and goofy memories, and even the seemingly trivial coincidences -- it does seem like this life was waiting for me all along. \n\nThis decision is something that I see folks (especially in younger years) struggle with more than anything else. \n\n*I hate every second of med school but I'm already 2 years in...*\n\n*I can't stand my finance job but I worked so hard to get this incredible offer...* \n\n*I don't feel pulled to my STEM courses but my parents would kill me if I changed my major...* \n\nJoseph Campbell said that within you there is a dragon. On every scale is written \"Thou shalt\". You must kill the dragon \"Thou Shalt\". \n\nThis might not be true for everyone. But I have a hunch that many of us feel something like this. Whether it's work, love, or whatever else life is telling you... \n\nAre you ready to give up you life plan for the life that's waiting for you?",
        "created_utc": 1678630260,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to change nutrition without feeling bad?",
        "author": "A_nice_Redditor_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfekc/how_to_change_nutrition_without_feeling_bad/",
        "text": "I'm not sure if this is the right place for that, but ...\n\nI'd like to lose weight. Over the half year I started with gym and lost about 6kg just with that. I didn't change anything and my weight is falling. But of course very slow.\n\nNow I'm once again thinking about changing my eating habits. Unfortunately I haven't had a lot of success in the past with that. Most of the time because it was just a phase (like this one) where I thought about loosing weight. But at some point I don't think much about it and then I start to eat shitty stuff again. \n\nAlso I'm like a snack during the day would be nice and choose some chocolate. I know I could choose fruits and vegetables, but I don't really like them. \n\nAnother point to start with is just eat not that much. But actually this is really hard for me. Whenever my mum is cooking for me (what's kinda often), she make huge portions and then I tend to ask her for more. I guess this is the worst part of all and the part with the most potential.\n\nI'm not  starting a diet, because I'm not going to complete something like that. Instead of doing something like this, I'd like to change my nutrition.\n\nDo you have any tips or tricks i can do? Or are there any books they might help?",
        "created_utc": 1678630184,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a paranoid person",
        "author": "xj9notabot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pfc8h/i_am_a_paranoid_person/",
        "text": "I get paranoid over little things and I don’t know how to stop it. \nFor example i found out that my iPad screen protector has some scratches, you can see it when you write stuff. I got really upset and went to change it.\n\nIts been a week now since i changed it, and once again there’s more scratches but it doesn’t clear like the last time.\n\nI wanna replace the screen protector again, but i don’t think its gonna fix it considering there’s gonna be more scratches anyway.\n\nThere’s other stuff I’m worrying about too.\n And I’m just sat here and trying to tell myself to let it go.\nI don’t know, i feel like I’m crazy. And can’t fix it.",
        "created_utc": 1678629994,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost all hope in my life, it feels like death is the only solution now : (",
        "author": "Gold-Reception-1607",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11peji6/i_lost_all_hope_in_my_life_it_feels_like_death_is/",
        "text": "I've never felt close to anyone or more accurately no one has ever felt close to me. I grew up in a very toxic environment, where almost every day my parents used to say things like \"It's better to have no one like me\" \"she should have killed me in her womb\" \" I'm the worst son ever\" \" I should go and hang myself\" etc etc and you know why they used to say these? Just because I used to do those naughty childhood things, I got bullied in school as well, but I think I made the way for them. I didn't have the courage to face them. \n\nNow I'm 22 and I have no friends in real life, I don't have anyone to talk to, it feels like no one has ever loved me, sometimes I feel suicidal, but I know I'm not going to do that because I don't have the courage to attempt suicide. But I do feel like I'm wasting oxygen... :( I lost all hope now, I don't know what I'm going to do with my life, My friends are getting independent and I have no future at all or it seems so at this point. \n\nIn these last few years, I did so many things for people, Yes! I had a motive behind it, I just wanted a friend, I just wanted to be loved, I just wanted someone to tell me I'm here for you. But Today no one is with me, all those people I helped it seems just took me for granted. I'm a people pleaser. sometimes I please people to talk to me. I have so many other mental issues as well. I always wanted to feel loved by someone, but I failed again and again : ( I have never done anything for myself, I Always seek validation from people, even sometimes I feel like I'm taking breaths for validation. I know there is no me left in me, that guy who used to make jokes, always trying to make people laugh-now he himself forgot how to laugh.\n\nI dropped out of college in 2019, because of XYZ reasons. sometimes I think do I really have a future left? I'm just so tired of everything. It feels like If I die today no one really gives a shit. It's been years since I'm living in isolation, It's been months since I go out I think, even if I go outside what I will do? \n\nI haven't achieved anything in my life, Nothing zero. Even these days I avoid making eye contact with myself in the mirror. Those tired eyes scare me. \n\nI don't know why I'm writing this, but maybe there is somewhere in me still some hope left, and that guy is looking for some help. Maybe he thinks he can change everything, maybe he is not entirely worthless.",
        "created_utc": 1678627663,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if we used each phase of life for our self-improvement?",
        "author": "SunRise34",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pefyg/what_if_we_used_each_phase_of_life_for_our/",
        "text": " \n\nWhat if we used each phase of our life for a fulfilling life?\n\nRemember your PAST.   \nBe present in the PRESENT.   \nOrient yourself to the FUTURE. \n\nYour PAST is littered with silos that you’ve filled. They’re filled with potential that you made reality through your   \n•deeds done  \n•love given  \n•difficulty endured\n\nBe PRESENT, for you may need the present when it becomes the past.\n\nAnd strive toward the FUTURE to who you want to be so that you might become what you can be.\n\n💪💜",
        "created_utc": 1678627355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement channel",
        "author": "NotNick7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pdxej/self_improvement_channel/",
        "text": "[removed]",
        "created_utc": 1678625811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling lost",
        "author": "TemporaryAnywhere307",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pd39y/feeling_lost/",
        "text": "[removed]",
        "created_utc": 1678623092,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m excessively prone to anger &amp; frustration when things don’t go my way. I want to change that.",
        "author": "No-Nail-7227",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pd2yz/im_excessively_prone_to_anger_frustration_when/",
        "text": "For instance, if I try a new recipe and it turns badly I’ll get angry and frustrated and it will eventually throws me into a temporary depressive state. \n\nWith drawing : if one of my drawings turns out to be a bad one, same thing.\nIt’s all the same with anything, really. \n\nI’ve found that this exact pattern is recurrent whenever I fail anything : frustration -&gt; anger -&gt; temporary depressive state.\n\nI’ve also found that the frustration and anger I feel are aimed at me. I’m angry at myself for failing (?) and it makes me feel miserable.\n\n\nWhy do I feel this ? What can I do to change this behavior and accept errors as seeds for improvement ? \n\n\n\nTL;DR\nI get frustrated and angry at myself every time I fail something. It can be because of a bad drawing, a failed recipe or anything really. I don’t know how to change that. Help.",
        "created_utc": 1678623069,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become better?",
        "author": "TemporaryAnywhere307",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pd0xh/how_do_i_become_better/",
        "text": "[removed]",
        "created_utc": 1678622876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different person for first hour of morning?",
        "author": "joedev2",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pczts/different_person_for_first_hour_of_morning/",
        "text": "When I wake up I feel extremely tired and the simplest of tasks seem insurmountable and it feels like no matter how much I tell my body to do something, there is a level of internal resistance that blocks all my neurones from transmitting those messages to my muscles.\n\nI literally sit there for 10 minutes thinking about trying to get up just to make coffee before I can finally get up and make coffee before retreating back into the comfort of my bed for an hour to watch crappy YouTube videos mindlessly until the coffee kicks in and I actually regain my ambition.\n\nAfter this hour, I am generally productive, ambitious, motivated and disciplined, but for the first hour when I wake up its like I am a different person: I have no thoughts like 'I want to do well in X so I need to wake up', but the rest of the day I want to do as well as possible, and at night-time my motivation and focus is unparalleled.\n\nIt's not like I am not sleeping properly either. I am getting at least 8 hours of sleep per night, I just don't care about anything when I wake up.",
        "created_utc": 1678622774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I now stress about superficial things when I never cared before?",
        "author": "zippieza",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pcjhr/why_do_i_now_stress_about_superficial_things_when/",
        "text": "It feels like the older I get, the more I mentally regress. I'm 22 now and find myself concerned about being pretty, not having a lot of Instagram followers, not having pretty photos on my feed like other people, about having a nice body, about not having a lot of friends like other people, etc.\n\nTeenage me did not give a shit about any of this, I spent my time unbothered and focused on myself and things that brought me self fulfillment. Although I have grown in many ways, it seems like my concern for materialistic, shallow or vain elements (that we all care about one way or another) has grown exponentially. I literally bought makeup impulsively when I haven't worn makeup in 22 years just because I saw a photo of a friend that looked amazing in it and I wanted a photo of me like that too. \n\nI hate that I now feel embarrassed about having a small amount of followers, for not posting travel photos while everyone else has, etc. This is so insanely ridiculous that I am baffled about why I care at all. There is nobody in particular that I want to impress-- yet somehow I am now overly conscious of the way I am perceived by others.\n\n&amp;#x200B;\n\nI'm looking for some insight, or advice I guess. I know that one of the first things I should do is delete my Instagram, but I do love sending my friends memes through this app so I'd like to make that my last course of action.",
        "created_utc": 1678621226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overwhelmed in things that I want to do",
        "author": "Captain_Guren",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pc06j/overwhelmed_in_things_that_i_want_to_do/",
        "text": "I am currently a 2nd year student taking Bachelor of Science in Computer Engineering. I do love my course but I also have tons of other stuffs that I want to learn. May I ask for tips on how can I manage everything if I wanted to learn trading cryptocurrencies, mutual funds, editing(illustrator, photoshop, and premiere pro), and also I want to be fit. I always get overwhelmed by it and ended up doing nonsense things such as watching YouTube shorrs or Facebook videos. Please don't judge me :'&lt;\n\nThank you and have a great day!!",
        "created_utc": 1678619297,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stop wanting what i can’t control? [15]m",
        "author": "lukereddit01",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pbyfp/how_to_stop_wanting_what_i_cant_control_15m/",
        "text": "Im 15 turning 16 this year july and my mind has kinda been like unhealthily obsessed with the idea of glowing up and one of the main things i keep worrying but also hoping for is to grow taller. \ni know its mostly genetics but i cant stop but think about how much i wish i could control my desired height, obv i still have a chance to grow wether its an inch or a foot but yea.\ni rlly wanna start thinking about working on myself and accomplishing things that i CAN control, like learning new skills, knowledge, habits etc. bc w the things i cant really control, all i can do is hope and in terms of bodily genetics, just be generally healthy.",
        "created_utc": 1678619125,
        "upvote_ratio": 1.0
    },
    {
        "title": "31 and still immature",
        "author": "SuperLoved",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pbvg6/31_and_still_immature/",
        "text": "I am 31 years old, but my life has been so easy. It's been a blessing, but my immaturity is ruining my relationships. I blame them and make excuses for my shortcomings.\n\nThis year also really has been kicking my ass in all areas. Has anyone had stories of where they sucked it up and matured or is it all a experience through hardships?\n\nIs 31 too old to become mature? 🥺",
        "created_utc": 1678618844,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to \"un-introvert\" myself",
        "author": "Longjumping_Moose402",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pbfxu/how_to_unintrovert_myself/",
        "text": "Growing up, I've been an introvert for most of my life because my parents rarely let me go see my friends or even mingle with people unless it was school days or church. I was also a victim of bullying in my younger high school years which is why most of my life, I was playing videogames a lot and I dreaded going outside unless I myself really wanted to do so or I had something of great importance to me that I must do outside, other than that, I have this strong sense of not wanting to show up. I want to change that.   \n\n\nHere are the current problems I want to solve:\n\n1. I find it hard to appreciate \"the important things in life\" such as sightseeing, special moments with friends and etc. as all I did was play video games and I became materialistic because of that as I used to spend my money all on video games. How do I undo that?\n2. How do I start to \"find interest or value\" with going outside and spending time with people?\n3. How do I also get rid of the \"icky or awkward\" feeling I get when I go out with other people?\n\n&amp;#x200B;\n\nPlease be kind I really want to grow as a person! Your outputs are greatly appreciated!",
        "created_utc": 1678617281,
        "upvote_ratio": 1.0
    },
    {
        "title": "quitting processed/junk food",
        "author": "RamenWILLtakeOver",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pbeqf/quitting_processedjunk_food/",
        "text": "I've been wanting to quit processed foods/junk food (for a set period of time) to see what it does (or doesn't) change for me in terms of my skin, energy levels and overall health. \nHOWEVER I'm quite prone to falling back when I completely deprive myself of something (which kinda makes sense). I'm still really curious and I think it'll allow me to have a new outlook on these foods, since I have a complicated relationship with them. I had both periods where I demonised them and was cutting calories to an unhealthy degree, and times I have constantly eaten them, or even binged on them. \nAny advice, tips, tricks? \nAlso: how long of a period should I set in order to see genuine results(or the lack of results)?",
        "created_utc": 1678617165,
        "upvote_ratio": 1.0
    },
    {
        "title": "My view on social interactions and people have completely changed.",
        "author": "Gordon_Freeman_17",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pacul/my_view_on_social_interactions_and_people_have/",
        "text": "I'm a 17 year old girl that has just discovered there are also good people on this planet. \n\nYeah, it may sound simple, but to me, it was life-changing. \n\nTo this point, I was always sent to shitty private schools. My peers there were always rude, cruel, competing with each other in every way and generally insufferable people. Even when I was in elementary school, it was like this. \n\nI was a non-competing kid, unlike the rest. I would appreciate others' accomplishments and truly care about their feelings. So they thought I was weak and always targeted me. \n\nI would get bullied emotionally, though it's slightly different. \n\nThey never bullied me openly, so I could never point their actions out to anyone. \n\nLike, they left me out of their groups and when I tried to speak to them casually, they would just ignore me. When I tried to walk besides them, they would slowly push me out of the sidewalk without any physical contact, you know what I mean. \n\nThere's so much more, there are even open examples of the things they've done but I don't want to talk about them. \n\nThe thing is, the teachers were actually aware of this, they just chose to ignore it because they were close to my bullies' parents. \n\nWhen I'd try to open up to the teachers, they'd get mad at me and tell me to just \"ignore\" my peers. \n\nBut it was impossible though as we, as humans, are social beings. We all need to communicate with our peers to some extend. \n\nSo as I only encountered these bad people in life, I though this was the \"normal\" thing. \n\nI expected everyone to be this way, so I built thick walls around me to protect myself from these \"normal\" people. \n\n**But yesterday, everything changed.** \n\nFor the first time in my life, I've met the actual, real \"normal\" \n\nWhat I mean by that is: I met a peer that is not like the other ones I've met in the past. \n\nShe was very sincere with me, treated me like anyone else and was open with me. \n\nThis was something completely new for me. \n\n**I was in absolute shock.** \n\nI broke down crying from an intense mix of all emotions I have. I didn't know what else to do. I had a huge emotional burst. My heart was pounding like hell. \n\nAll because I was treated like a human being by a peer for the first time. \n\nIn the end, I became aware that there are good people too. This was a turning point in my life.\n\nI wanted to share it with you people.\n\nThank you for reading :)",
        "created_utc": 1678613390,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Successful” but still empty",
        "author": "Unlikely_Response125",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pabob/successful_but_still_empty/",
        "text": "I am 25 years old and on paper I am successful. I am a software developer so I make good money. I also work from home so I have plenty of free time. \n\nI am physically fit, exercise each day. I have a good diet, skin care routine, and I dress well.\n\nI have close friends I can talk to and meet up with at the end of week. People like me personally, they think I am kind and caring. All in all, when people speak to me they think I am well put together. \n\nCompared to most people, I have it really good and I am grateful for that.\n\nBut I’m empty inside, everything feels meaningless and pointless. I’ve never been in a relationship or had a true connection with anyone. I lack purpose and passion. I envy others who seem passionate about anything. Be it social issues or even something as rudimentary as their favourite sports team. \n\nUltimately everything feels so fake, unrealistic. I am just doing what’s expected of me until I die. \n\nI wouldn’t kill myself, but I don’t particularly feel alive right now either. I’d like a partner, but I don’t think that’d solve the issue. It’s something deeper I’m missing, I don’t feel like I belong anywhere.\n\nThis quote describes how exactly how I feel, and how I’ve felt for a long time:\n\n“The same feeling of not belonging, of futility, wherever I go: I pretend interest in what matters nothing to me, I bestir myself mechanically or out of charity, without ever being caught up, without ever being somewhere. What attracts me is elsewhere, and I don’t know where that elsewhere is”\n\nI wish to know is if there’s any resources, books or anything that deal with this feeling. What this feeling actually is and how I can overcome it. \n\nIf anyone has dealt with this themselves I’d love to hear from them.\n\nThank you.",
        "created_utc": 1678613255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so proud of myself",
        "author": "maisy_thesheep65",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pa81z/im_so_proud_of_myself/",
        "text": "I came across a picture of someone who just made cookies and my very first thought was \"wow they look delicious\" I'm generally a pretty judgy person and I'm so proud I can do things like that now without being a judgemental bitch, I understand it may be a tiny thing but I love being a nicer person in general",
        "created_utc": 1678612878,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Articulate new ideas in real time conversations.",
        "author": "not_calzone",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11pa1mf/how_to_articulate_new_ideas_in_real_time/",
        "text": "Kudos to everyone here, I am starting a self-improvement / self-realization journey. One issue I struggle with a lot is articulating myself infront of other people. I feel I lack structure to what I talk about. So my conversation usually ends with confused look on everyone's face or it comes across as a below average point which other people leverage on. \n\nHow can I become good at articulating and expressing new ideas during real time conversation. Is there a way to make it all easy. \n\nThanks for your help fellas !",
        "created_utc": 1678612209,
        "upvote_ratio": 1.0
    },
    {
        "title": "being at peace with being alone",
        "author": "strwbrrysrbt",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p9xo5/being_at_peace_with_being_alone/",
        "text": "when i left highschool (last year) i found myself hanging onto a lot of friendships i didn’t want to let go of. it took so many months for me to realise that these friendships were either one-sided or didn’t fit me anymore. \n\nnow, it’s my second year out and i only have 2 close friends. but honestly, i feel like i’m even outgrowing THEM. \n\nhowever, i honestly feel very comfortable with being alone. i’m fine with sticking to university and my job and going out to have a cup of coffee with mum every once in awhile. i don’t want to make friends with any coworkers, and it’s the same with uni, too. \n\ni know i can’t really rely on my friends with anything emotional, but i’m a second year psychology student so i think i can handle everything on my own.    anyone else feel confidence in independence?",
        "created_utc": 1678611795,
        "upvote_ratio": 1.0
    },
    {
        "title": "My forearms need help",
        "author": "Damnator666",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p9utu/my_forearms_need_help/",
        "text": "How do I train my forearms to be able to hold more weight for exercises like deadlifts, squats, curls and others? Should I just take some mega dumbbells and hold for as long as I can or are there other tricks? Sometimes when doing deadlifts, my forearms just say nope 😡",
        "created_utc": 1678611522,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to overcome setbacks, failure and adversity",
        "author": "Ok_Duck_4702",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p9quc/how_to_overcome_setbacks_failure_and_adversity/",
        "text": "[removed]",
        "created_utc": 1678611087,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling uninspired and not ambitious at all",
        "author": "annesherleycuthbert",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p9h2f/feeling_uninspired_and_not_ambitious_at_all/",
        "text": "Life changed drastically for me after I dropped out of law school after a suicide attempt and moved across the country. I'm doing an honours degree now and I dont even know what I wanna do with it. I'm constantly comparing this degree with law and all the opportunities that I've lost. I've lost everything i accomplished and now it's just blank and zero. I feel like a big zero ughhhhh.",
        "created_utc": 1678609989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Emotional Inquiry Sessions",
        "author": "Y0uAreConscious",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p97mo/free_emotional_inquiry_sessions/",
        "text": "Hi everyone,\n\nI want to share some insights and offer some guidance to anyone who is curious to learn about an emotional processing methodology i've been learning recently.\n\nSo the basic logic to it is as follows: many of us are carrying around repressed emotional trauma from childhood that we have learned to bury and keep unconscious through various coping strategies we learned as children. Say for example you weren't allowed to be angry as a child, or insert x emotion, then as a child you had to learn to bury the anger/emotion to maintain a loving connection with your family. We get so good at burying the emotions that as adults we have no idea we are doing it or how we are doing it.\n\nThe technique is very simple. It's basically a conversation where I ask you to become conscious of whatever feelings/emotions/thoughts are present in your direct experience, and then we begin to understand the feelings and break the habitual pattern of distraction and dissociation. I believe over time as we continue to do this, repressed emotions will begin to surface, and if we create space for them they can flow through our body and be processed.\n\nWhen we don't process emotions and they remain repressed, I believe our system uses a tremendous amount of energy to keep this things buried, and so by not dealing with these emotional traumas we doom ourselves to chronic fatigue, emotional numbness, and in many cases deep misery and unhappiness.\n\nFeel free to ask any questions about myself or the process.\n\nThank you",
        "created_utc": 1678608962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting Caffeine and Porn",
        "author": "JoshuaLamont22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p948z/quitting_caffeine_and_porn/",
        "text": "From this day on I’m quitting caffeine and pornography, anyone else willing to try and quit these bad habits? \n\nFor the people who have quit caffeine and/or porn, how does it feel not taking caffeine or watching porn?",
        "created_utc": 1678608594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self learning skills",
        "author": "Mr_Jaber",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p8iy6/self_learning_skills/",
        "text": "How do i balance between college study and self learning skills ?",
        "created_utc": 1678606314,
        "upvote_ratio": 1.0
    },
    {
        "title": "📚 Best Book For Self-Improvement",
        "author": "achieving_flow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p8g0r/best_book_for_selfimprovement/",
        "text": "Who doesn’t want to become the best version of themselves?\n\nBelow is a list of book that will assist you on your journey. \n\n# Productivity :\n\n* Deep Work by Cal Newport \n* Make Time by Jake Knapp &amp; John Zeratsky\n* Atomic Habits by James Clear \n\n# Human Realtions :\n\n* The Laws Of Human Nature by Robert Greene \n* Thinking, Fast And Slow by Daniel Kahneman \n* How To Win Friends &amp; Influence People by Dale Carnegie \n\n# Mindset :\n\n* The Subtle Art Of Not Giving A F\\*ck by Mark Manson \n* Meditations by Marcus Aurelius \n* Letters From A Stoic by Lucius Annaeus Seneca",
        "created_utc": 1678606028,
        "upvote_ratio": 1.0
    },
    {
        "title": "IF by Rudyard Kipling BREAKDOWN pt 1",
        "author": "regeneracyy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p6nbv/if_by_rudyard_kipling_breakdown_pt_1/",
        "text": "LETS GO\n\nOkay here’s the misconception about spirituality. The goal is ACTION not PEACE and I’ll show you with this poem \n\nAt the end the goal is to fill the unforgiving minute with sixty seconds worth of distance run. Keeping your head when all about you are losing theirs IS ONLY A TOOL TO RUN THAT 60 SECONDS \n\nHe knew how short life is and saw the goal as the maximization of one’s potential. Sixty seconds in a minute. You’re running as hard as you can until the curtain closes\n\nIt’s hard to run when you’re weighed down with so much pain. Releasing this pain is the key to this poem - when you’re weighed down you don’t move as fast and you become reactive to the world around you. \n\nThis is why you keep your head YET keeping your head isn’t the goal. If keeping your head was the goal then the run wouldn’t be a thing. Why run and challenge yourself when you can just keep your head… this is my point. A belief system is only as valuable as the amount of voltage it can carry. Peace is a means but on its own it can so easily become a cope\n \n\nIf you can keep your head when all about you   \n    Are losing theirs and blaming it on you,   \nIf you can trust yourself when all men doubt you,\n    But make allowance for their doubting too;   \nIf you can wait and not be tired by waiting,\n    Or being lied about, don’t deal in lies,\nOr being hated, don’t give way to hating,\n    And yet don’t look too good, nor talk too wise:\n\nIf you can dream—and not make dreams your master;   \n    If you can think—and not make thoughts your aim;   \nIf you can meet with Triumph and Disaster\n    And treat those two impostors just the same;   \nIf you can bear to hear the truth you’ve spoken\n    Twisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\n    And stoop and build ’em up with worn-out tools:\n\nIf you can make one heap of all your winnings\n    And risk it on one turn of pitch-and-toss,\nAnd lose, and start again at your beginnings\n    And never breathe a word about your loss;\nIf you can force your heart and nerve and sinew\n    To serve your turn long after they are gone,   \nAnd so hold on when there is nothing in you\n    Except the Will which says to them: ‘Hold on!’\n\nIf you can talk with crowds and keep your virtue,   \n    Or walk with Kings—nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\n    If all men count with you, but none too much;\nIf you can fill the unforgiving minute\n    With sixty seconds’ worth of distance run,   \nYours is the Earth and everything that’s in it,   \n    And—which is more—you’ll be a Man, my son!",
        "created_utc": 1678599901,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I go for a job that fits my vibe or fits my wallet?",
        "author": "shockywavee",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p6ajq/should_i_go_for_a_job_that_fits_my_vibe_or_fits/",
        "text": "As part of my self improvement journey, I'm trying to focus on doing things that beenfit me in the long run. But I cannot decide between these two choices I have.\n\nRecently I got a job at this bougie grocery store. It's wonderful. It pays well, everyone's so damn friendly and understanding, but the hours are crazy and I feel like I don't really vibe well with the overall group there. I don't have any peers I see myself befriending anytime soon, and Ive become increasingly overwhelmed with the work load AND handling school. I've been working there for four days, each of them eight hour shifts that took away from my studies that I usually have time for (I'm in college). Of course, I talked to my Team Leaders about this and they were, again, very understanding and didn't feel as hurt or angry as I thought they would feel. They said that they wouldn't mind cutting my hours down if that helped me out, but I don't know if I see myself staying there even after the hours whittling down. I'm gonna take an internship later this year too, and doing the grocery store stuff and an internship and feeling \"off\" there.. I don't know.\n\nOverall, I don't know that this job is \"for me\" right now. It's pretty intense, even if the people are nice and helpful. It seems like a job I could have after college, not during. And after I graduate, I wouldn't even mind the idea. But right now, I don't know. I feel like saying \"oh I can only do two shifts during the week\" is a waste of both of our times, especially if I feel that way. \n\nBut the pay is great. It's gonna put money in my pocket and keep me financially secure, but it doesn't really make me happy that much. I'm kinda stressed.\n\nThe other job that I'm considering is a department store job in a mall nearby. It has shorter work hours, and it pays a dollar less.  It's still good money but a dollar less. The vibe of the store seems to match what I am and what I like: edgy yet casual shoes and apparel. This was the job that called me first before the grocery store job but because of conflicting scheduling, I ended up passing on an interview opportunity and went with the grocery store. Now, I'm kinda regretting it. The vibe of the store and the employees is much closer to what I'm about. The pay is less, yeah, but the hours are shorter and I can fit more into my schedule so I can go to work without being too restrictive. The only issue I'm worried about working there is stability.\n\nI don't want to leave another job again. I want to stay here this time. I want to stay at a job that will keep my grades happy, me happy, and my wallet happy. And if I leave the grocery store to come to the mall, I'm worried I'm making a \"downgrade\". I work long shifts at the store, but I'm guaranteed above 20 hours. Mall hours don't always promise that unless it's the fucking holidays or something. Usually you'll be lucky if you get 15 a week. Trust me, I've worked at a mall before.\n\nI already decided I wouldn't be quitting until I got that other job lined up. If I interviewed, I'd tell them please give me two weeks so I can say my goodbyes and wrap up with the store before transitioning. So there's no worries about me running and ghosting now.\n\nBut I haven't decided whether or not this will be a good idea. I want to work where I vibe well and that it feels \"right\" to me. I know plenty of people who've worked jobs that didn't feel right to them for whatever reason, but stayed and became miserable. I don't want that to happen to me. I want to be happy and make good money. I love my coworkers at my current job, but this job doesn't feel like it's right for me, both college wise and just personality wise. I'm upbeat and outgoing, but I'm not sure.\n\nI was also told that the door would be open for me to come back there in the future if I wanted to.\n\nSo, what do you guys think I should do? Since this decision is a big part of my journey into full fledged adulthood and independence, I figured it would be best to ask you all.",
        "created_utc": 1678598764,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep disobeying my own rules",
        "author": "dumbnunt_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p64i9/i_keep_disobeying_my_own_rules/",
        "text": "I told myself no reddit while I am studying something. Mostly because it frequently upsets me and isn't a good study break. I also stopped following the pomodoro exactly. How do I get back on the horse and stop disobeying the rules I set for myself?",
        "created_utc": 1678598235,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOW TO RELEASE EMOTIONS",
        "author": "regeneracyy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p62y9/how_to_release_emotions/",
        "text": "Here’s the framework \n\nApply this to any area of your life (money, relationships, success, health) and you’ll see massive results I promise you \n\n1. You feel stress or tension. Focus on this feeling. It helps to lower your shoulders and breathe into it. Take the time to just sit down and figure out which emotion this is \n\n2. Now that you’ve identified it, let yourself sink into the feeling. Welcome that feeling like you would a guest into your house and truly get to know it. \n\nLearn what these emotions feel like. Become familiar with them. The more you let yourself feel the emotion the faster it will pass and you can move on \n\nRumi wrote “pain is where the light enters you” this is true in my experience. There’s only so much pain there and underneath it is love, not bullshit Hollywood love, but something far more profound. \n\n3. Repeat the pattern again. Next time you feel stressed take note of it and sit with it when you have time \n\nHERES A QUICK LIST OF EMOTIONS\n\nyou know what anger feels like so let’s focus on some emotions that you might now be familiar with. All these emotions carry so much weight to them. The weight makes life so heavy, you want to shed the weight and then you have more energy \n\nGuilt (feels like duty, obligation, “I should’s” blame and accepting blame, defensiveness and accusations\n\nShame (embarrassment, humility, unworthiness, self hatred, self sacrifice, living for others, what will others think of me?)\n\nGrief (heavy heavy emotion, sadness, weakness, excessive need to be strong and just get by, “life’s so hard” mentality \n\nFear (scarcity esp. around money, not having enough, “I’m not safe” freezing up)\n\nYou’re gonna say “aren’t their good emotions” \n\nThis is where we stray from the path\n\nAll emotions are distortions. By simply having emotional blockages we’you’re giving up so much of your energy\n\nPicture this, your boss tells you manager to pay you $1,000 and the manager pays you $100. Because you didn’t know what was available you thank the manager so much for his generous contribution. Emotions are the same. \n\nWe believe that feelings of duty or anger can give us that energy but they actually take it and regulate it and give a fraction back to us. If you knew what was available you wouldn’t settle for a moment. That energy is rightfully yours you just have to figure out how to access it. \n\nFollow this emotional release framework and you’ll free up SO MUCH of your energy, you’ll drastically expand your comfort zone, you’ll clear up your cognition and be able to think so much clearer now that the latent fight or flight response is gone \n\nI truly hope this helps you as much as it’s helped me. I’m happy to answer any questions here about the framework",
        "created_utc": 1678598107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my brain so much more \"activated\" late at night? How do I become more of a morning person?",
        "author": "_CaptainNoob69",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p62ey/why_is_my_brain_so_much_more_activated_late_at/",
        "text": "I've noticed this morning that coffee and exercise doesn't help my brain feel \"activated\" the same way as it would be late at night (as in 1230am-330am). Like at night, I can read faster, think more creatively, write better, and solve problems quicker. But during the day, there's always a brain fog that lingers well into the evening from the time that I get up. Has anyone gotten themselves out of this situation before? I can usually work through a brain fog working 9-5 but I can do so much better if my brain can be more active earlier. \n\nAny tips? I suspect it has something to do with my circadian rhythm but I don't know how to change that.",
        "created_utc": 1678598059,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’ve been lying to myself about my weight and I want to change it",
        "author": "AngryElevator",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p62e6/i_think_ive_been_lying_to_myself_about_my_weight/",
        "text": "I was always really chubby as a kid.\n\nWent through my disordered eating problems in middle and early high school.\n\nI decided I didn’t wanna do the harmful things I was doing to my body anymore.\n\nSo I started eating more and stopped caring.\n\nAt first it was fine because I needed to eat to makeup for hurting myself for so long.\n\nBut now I’m 5’5, 180lbs and my doctor just told me I was overweight.\n\nI don’t know why it feels like such a surprise to me because I was 180 before my doctors appointment and I didn’t feel so bad.\n\nBut now I’m looking in the mirror and I see it.\nI don’t understand why I never noticed it.",
        "created_utc": 1678598057,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to say no when someone pushes you to do something?",
        "author": "OkWash7979",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p5wqw/how_to_say_no_when_someone_pushes_you_to_do/",
        "text": "[removed]",
        "created_utc": 1678597567,
        "upvote_ratio": 1.0
    },
    {
        "title": "📄 How You Can Produce The Same Results With Less Work",
        "author": "achieving_flow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p5k7e/how_you_can_produce_the_same_results_with_less/",
        "text": "**How would you feel if I told you that 80% of the work you do, doesn't matter?**\n\nYou would feel horrible but there is some slight truth to that.\n\n**Have you ever heard of the 80/20 principle? Or, as others call it, Pareto's principle?**\n\nPareto's principle states that **80% of our results come from 20% of our input.** \n\n**While operating his own business, Tim Ferris** (author of “The 4 Hours Work Week”) **implemented this principle into his own business.** \n\n**What did he find?** He found that the customers taking up most of his time was contributing the least to his revenue. \n\nFerris will still take orders from them but wouldn't spend countless hours resolving complaints. \n\nInstead, he spent his extra finding and attracting more clients that were similar to the 20%.",
        "created_utc": 1678596499,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friends are no good for me.",
        "author": "flappycat89",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p55g3/my_friends_are_no_good_for_me/",
        "text": "Okay it isn’t that simple. I love my friends and the few I have now are my second family. We travel together, play games together, and right now go to school together. We have similar career goals, somewhere in the health field but not the same specialty, but I noticed that they are not ambitious as I want to be which is leading to me also slacking on my work. I think that explains my low gpa for med students. They want to have fun now but I want to reach my goals. It’s just hard to stay focused all the time because of how much they want to have fun. I know the classic advice is to leave them and find people that fit my goals but it feels so mean and if I do leave them I’ll be even more alone. What would be the move here. I want to be more career oriented but I also don’t want to lose my friends/ be alone.",
        "created_utc": 1678595177,
        "upvote_ratio": 1.0
    },
    {
        "title": "RELENTLESS ANGER",
        "author": "MinejokeStar",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p3rho/relentless_anger/",
        "text": " \n\n3 years ago, I was angry EVERYDAY.  \n​\n\nI had a flame of anger that could not be extinguished.\n\n​\n\n The lockdown and the behavior of some people during this time really bothered me. On top of that, I was rejected by my crush and she insulted me by calling me weak and a loser, which made me really furious\n\n  \nI was extremely aggressive.\n\n​  \nBut you would not notice a thing about me.\n\n​  \nMy anger was controlled.\n\n​  \nI put all that emotion towards working on myself.\n\n​  \nMentally, Physically and Spiritually I grew stronger at a rapid rate.\n\n​  \nAnger is a gift, but only if you can control it.\n\n Wake up to reality…",
        "created_utc": 1678591064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting dumber",
        "author": "Non_Humanewell",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2xes/getting_dumber/",
        "text": "Sometimes I feel like I'm getting dumber, as the days pass.    \nThe way I behave and talk sometimes makes me feel like I'm way younger than I am, more clueless and oblivious.   \nI sleep too much now, around 12 hours non stop, or even more if I could. (on free days)  \nI'm starting to forget things that I say or do, or even plans and appointments I have. And overthinking.  \n\n\nI'm not sure what's going on, if this is something of age or anything but...It just bothers me a bit.",
        "created_utc": 1678588704,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i stop saying dumb shit",
        "author": "EnvyIsntGodly",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2uay/how_do_i_stop_saying_dumb_shit/",
        "text": "i wanna be social but i’m losing new friends somebody help 😭🤦🏽‍♂️",
        "created_utc": 1678588473,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to try to enjoy life without the fear of getting hurt again?",
        "author": "always__dreaming",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2pxt/how_to_try_to_enjoy_life_without_the_fear_of/",
        "text": "I've always been a depressed person, never really enjoyed life until I decided to start working on myself in quarantine. I felt so much better, I finally felt like I could enjoy life and live it instead of dissociate the whole time just living in my head, I had never felt better and I genuinely believe that was my best mental moment of my life.\n\nBut a few months later someone hurt me so bad and I had to face such a hard reality that I'm just now being able to start picking up the pieces left of me. But there's this fear I have of trying to enjoy life again and getting hurt so bad one more time. I'm no kidding when I say that the pain that came after that person hurt me was so bad that I don't think I'd make it out alive out of that time of my life. I've done some small changes in my mentality and I'm feeling much better, but I'm afraid of being happy and someone hurting me just as bad as that time or even worse, ans me not being able to handle it.\n\nI know pain is a part of life itself and that people will hurt me lots of times, that I can't be such a coward to not even try to enjoy life because of that fear, but I can't help it and I don't know what to do about it. Any tips you could give me? Pls don't let it be therapy cause I can't afford it. Also, going out and meeting new people isn't really an option until maybe next year (It's a long story, but nothing bad), so If you guys gave me tips I could practice on my own or just with my relatives that would be so much better :) thanks in advance, hope you're having a great week",
        "created_utc": 1678588150,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate human beings. Am I wrong for thinking like this?",
        "author": "Keni94",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2mea/i_hate_human_beings_am_i_wrong_for_thinking_like/",
        "text": "I hate all humans other than family, friends, and people at work. No one ever does the right thing and if you tell them or their wrongdoing they snap at you even if they’re the ones doing the wrong thing. Shootings and violent crimes happen everyday near the city I live in. People destroy this planet because no one cares. As a horticulturist I absolutely despise people who terrorize the ecosystem, directly or indirectly. People abuse animals. Corrupt leaders. Forget about what happens on the road, it’s a war zone everyday. No one gives a single fuck about each other on the road. People judge you for what you are. It’s always the smarter, taller, social, better looking people that succeed and don’t give any chances for people who aren’t as socially capable, introverted, and has an unattractive appearance. People kill for race, religion, politics. Kids born after 2000 are extremely rude and lack morality. Why doesn’t everyone hate their own race by now? Shouldn’t we be embarrassed? People suck and you know that. Lately I’ve been very hostile to anyone that shows even a tint of wrongness. Yea, I’ll probably be shot one day but I just can’t stand human beings anymore, do I try to change these feelings or just disappear myself?",
        "created_utc": 1678587866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What psychological or mental things are people UNABLE to change about themselves?",
        "author": "SteadfastEnd",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2llg/what_psychological_or_mental_things_are_people/",
        "text": "A lot can be changed about oneself. But I think there are certain underlying things that are too deep rooted or fundamental. \n\nIQ - people can make moderate improvements,  but a 70 IQ person cannot shift to 130 IQ, it's just too much.\n\nCertain beliefs or unbelief- an atheist can't MAKE himself believe in God, it's often too far fetched for him.\n\nCertain likes or dislikes - if you are not attracted to someone, you can't make yourself like them.\n\nCertain mental disorders like schizophrenia are not things you can will yourself into no longer having.",
        "created_utc": 1678587799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with losing friends/loneliness",
        "author": "Plupert",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2h0p/dealing_with_losing_friendsloneliness/",
        "text": "TLDR I’ve lost two social circles in the past year. One to distance. And the 2nd because they’re part of a literal cult.\n\nI’ve lost a lot of friends recently. I disconnected from my HS friends a while ago. I had a healthy friend group in college but all of those people live in different cities so I can’t hang with them and as a result I lost connection with them too last year when I graduated.\n\nI went out and did things I enjoyed and tried to make new friends in the process. Which went well! But I have to take a break from soccer until summer bc I’m doing work exams the next 3 months. I have chronic stomach issues so stress + physical activity = a bad time. I’ll be back eventually but I don’t really feel like part of the group bc of that.\n\nI joined a bowling team and had fun with them. One of those people introduced me to her friends who she knew from a church group(I’m agnostic but they were cool”. I got close to these people and really liked them. Then earlier this week I found out their “church group” is pretty much a cult. And now I don’t know which of those friendships were somewhat real and which were just me being indoctrinated. So I have to distance myself from them too.\n\nSo I’m left pretty much where I started. A few new acquaintances  and I still have a few good friends who are local, and a few who are far. But man life is just not going my way recently. \n\nSo I’m struggling with loneliness. And scared to put myself out there more again since the cult thing happened. Any advice would be great.",
        "created_utc": 1678587442,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I can Control?",
        "author": "Brave-Cheesecake-984",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p2axl/what_i_can_control/",
        "text": "So I've been pretty lonely for awhile now. I don't think I was ever properly socialized as a child and never really learned to make friends. It's causing me a great deal of unhappiness in my adult life.\n\nAs a result I've been trying very hard to make friends, I've been reading books, watching videos, and trying to impliment what I'm learning.\n\nHowever, I constantly think about how lonely I am. I have way worse social anxiety than I've ever had before. I'm so anxious to make friends I kinda feel that I'm sabotaging myself, and overall this obsession with making friends is ruining my confidence.\n\nThis week I also realized that I can't actually control whether someone will be my friend or not. I could check all the boxes, do everything all the books and videos say and its still not guarenteed that someone will be my friend.\n\nI don't really know where to go from here. Maybe I'm overthinking this whole thing. I do think that I need to develop connections. I think I started down this path because some part of me knew that I need to connect with other people to be happy, that was the original source of the loneliness and anxiety. But the way Ive been trying to fix it is just making my anxiety and loneliness worse. I need connections but I can't actually control getting them.\n\nSo how do I go about fixing the things I can control, and still be honest with myself about the fact that I have a need that needs to be filled for me to feel content? How do I find ways to meet this need, and focus on the things I can control without obsessing over it?",
        "created_utc": 1678586977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I stay in contact with old friends?",
        "author": "rhoeox",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p26sq/should_i_stay_in_contact_with_old_friends/",
        "text": "So I used to have a large social group with a smaller closer friend group in that. I have since moved to a different state and it's been over three years since I've left. I've been invited to a few weddings that I flew back to attend, but in general it doesn't really seem like anyone (except for one friend) is making an effort to stay in contact with me besides the occasional wedding invite. I used to reach out more when I first left but I felt like I over time, I've stopped doing that because it was a one way street. I'm in my 30s so I understand that people are busy and there is no bad blood between us but I get kinda depressed about it since I haven't really fell into a new friend group in my new state yet. I feel like it's a lot more challenging making friends as a single dude in my 30s. Overall I just wonder if it's worth the effort to try stay in contact with these people. I know if I got some new friends I wouldn't think twice about it, but life is busy and as I said, it's challenging. I'm invited to another wedding and I'm debating if it's worth my time and $$ to attend since I barely talk to these people any more and they barely respond to texts. Should I just move on?",
        "created_utc": 1678586654,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a horrible person, and I feel like I would never change. How do I fix myself?",
        "author": "Scepticasm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p25jy/im_a_horrible_person_and_i_feel_like_i_would/",
        "text": "I’m that kind of person who gets close to people just to get something out of it. I’m that kind of person who makes excuses and shit. I’m tired of being like this, I know I’m a shitty person. I want to change, but I feel like my behaviour is like instinctive (idk if that’s the right word) like I act like this unconsciously. How do I fix myself?",
        "created_utc": 1678586552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why some days im kicking ass and others im blah",
        "author": "mothwizzard",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p1uc9/why_some_days_im_kicking_ass_and_others_im_blah/",
        "text": "maybe 80% of my days im functioning at a high level but others I cant wrap my head around the simplest things, Ill Meditate or workout but its no use all while work/creative stuff is unbearable. It honestly happens mostly on the weekends and Part of me considers taking a break and recharge but I have deadlines and stuff to make.",
        "created_utc": 1678585676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goals for Day-2",
        "author": "Subash-11831",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p1hcl/goals_for_day2/",
        "text": "It's day 2 guys, today I have only one assignment to write cuz, I completed most of them yesterday. After that I must study physics, maths and some books. As I completed most of my work yesterday, I am free today and that's my biggest challenge today. I must not give in to the urge to watch porn or procrastinate my day. I will focus on my grind to become a better person and get my revenge on those who wronged me. My challenge ends on October 8, it's 7 months from today. I will tell you guys, how my day went tonight, Bye Guys!!",
        "created_utc": 1678584656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meditate, Journal, and practice affirmation?",
        "author": "refdep",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p17pi/meditate_journal_and_practice_affirmation/",
        "text": "Would you guys want to use an app where you could meditate, journal, and practice affirmations? Also what things would you want to see in this app? Would you want a website as well?",
        "created_utc": 1678583897,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to improve myself but keep going backwards",
        "author": "gayarmy1031",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11p06zu/i_need_to_improve_myself_but_keep_going_backwards/",
        "text": "Hi all, I'm new here.\n\nFor the past few months now, I've been wanting... needing to improve myself. The problem is, I keep going backwards.\nI have been known to be narcissistic, manipulative, Egotistical, pessimistic, and even delusional.\nAt times, it's like I live in my own fantasy world, a world that is at everyone else's expense. I seem to hurt people and frustrate them constantly. I don't want to be doing this. I don't think to myself, \"You know what, I feel like causing problems today.\" I just want to be able to go on in life with my friends who I love dearly and not be such the chaotic and toxic mess I have been.\nIt's been 4 months now with minimal contact with them, which is a move I decided to make off my own back.\nI work with one of my friends, and I try to be friendly and warm whenever we are on shift together, but at times, I think I'm being the exact opposite.\n\nThey don't want to be around me. In fact, I don't want them to be around me. Not while I'm like this.\nThe thing is, I haven't always been like this, or at least I don't think so. Honestly, I'm not sure.\n\nI also have asbergers syndrome on the autistic spectrum, I don't know if this has anything to do with it or not, but either way I honestly don't know where to start",
        "created_utc": 1678581178,
        "upvote_ratio": 1.0
    },
    {
        "title": "[NeedAdvice] StrongLifts vs a PPL split for a skinny 20 y/o trying to gain muscle?",
        "author": "Special-Muffin-1603",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oytfw/needadvice_stronglifts_vs_a_ppl_split_for_a/",
        "text": "Hey guys, \nI am trying to bulk up and put on some muscle, and am trying to find a good program/routine to try and stick to…\n\nAny advice?",
        "created_utc": 1678577733,
        "upvote_ratio": 1.0
    },
    {
        "title": "while i’m waiting for things to get better…?",
        "author": "cherry-ramune",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oyo07/while_im_waiting_for_things_to_get_better/",
        "text": "hello everyone, I’m 27f and seeking some advice. \n\ni left a really toxic, long term relationship almost 2 years ago, and it was very hard to accept that even though i loved them, i did the right thing. i’ve resolved my feelings over that, and if anything considered it a learning experience about what i can/can’t handle from a partner. but since then, i’ve just been kind of coasting. barely living and rather surviving. working with no real direction - i have a degree in business but haven’t bothered getting a job that uses it. \n\ni’ve spent my time kind of living vicariously through other outlets. for example, i love watching shows like the sopranos, breaking bad, soa, and got. if you’ve seen any of them, you know that the common thread between them is family, friends, and relationships. after some thought, i feel like i insert myself into those shows so i can get the sense that i’m living a fulfilled life with people around me, but in reality after i get home from work i spend the entire evening on my couch usually using food as a comfort. \n\nso, no more of that. I’ve started the process of improving my life in every way i can manage. portion control, exercise, self care, mindfulness. more time outside and less on the couch or in bed. i’m finally medicating my depression after years of thinking it would be useless. I’m putting in a lot of effort, and aware that i’m not going to get the life i want until i become the person i can imagine living that life. I put it off for so long, always telling myself that my best years have passed, wasted on a relationship i always knew i would end up regretting. but I realized the time is going to pass anyway and soon I will turn 30 no matter what, and I could either have a much better life or the same lonely one,\nif not worse. \n\nbut i’m just not that person i need to become yet and it will take a lot of perseverance/dedication to my goals to become her. i’m strapped in and committed to doing this for myself… but what do i do in the meanwhile while the time passes? these changes do not happen overnight, and i’m trying to manage my expectations and not be impatient. \n\nthe truth is i just don’t feel deserving of really “living” yet. i don’t have the confidence i used to have to go out and meet people. i spent so long in such a bad relationship with one person, that I honestly don’t even know who this adult version of myself is. the last time I was on my own, I was 17. my 17yearold self was *sure* that I would be married with at least one kid by now. I know that not getting that turned out to be a blessing, but I really don’t want to die alone (lol). \n\n i know i will be my best self soon, but until then do i just keep my head down and grind? motivation is kind of fleeting and i want to make sure i don’t fall off, so that’s why i’m asking. if you took the time to read this, you’re the best and thanks.",
        "created_utc": 1678577372,
        "upvote_ratio": 1.0
    },
    {
        "title": "being at work changed my entire mindset for the better",
        "author": "icyivyy99",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oy9po/being_at_work_changed_my_entire_mindset_for_the/",
        "text": "Something I've noticed is at work I'm naturally much more aware of my actions, making good decisions, and believing in myself. \"Being professional\" motivates me to be my best self, I work as a server at a restaurant, and everyone sees the best in me (hard worker, sweet). Life is so different for me at work than at home.  *It's the \"work mindset\" that brings out the absolute best in me. It feels like I actually have the chance to be whoever I want to be, and build my character from the ground up.* \n\nUnlike at home, it's like my mom's negativity has affected my life so much that I am the most insecure girl ever. I just realized how much my mom projected her insecurities onto me. It's crazy how much your environment affects you. How much positive affirmations affect you, and most importantly, how much you thrive being in non-narcissistic toxic energy. I thought I undeserving of positivity and kindness my entire life.\n\nAnyone else feel this way? This is exactly why I enjoy being a workaholic! I can't wait to move out on my own.",
        "created_utc": 1678576389,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to reflect to someone their indecisiveness and make them overcome it?",
        "author": "ThatIsraeliVolunteer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oxlel/how_to_reflect_to_someone_their_indecisiveness/",
        "text": "I am a service member in the IDF\nRecently I have received upon my command a soldier (enlisted for less than a year) who's quite an anomaly to me. \nAt first, I thought he was just a bit scared of me as I tend to be mission oriented and to the point but I have come to the conclusion it may be deeper than that. \n\nOur profession requires independence and decision making. You can do anything on your \"work time\"  as long as you complete your assigned tasks, but this soldier is quite different. \n\n1. He asks my permission for everything, and I mean EVERYTHING. When he wants to go to the bathroom, when he has to restart his computer, when he wants to put cups in a cupholder or even when he wants to drink water! To add context, you don't need to ask permission for any of these things. Even after I tell him that (for the past few months) he still asks my permission for the most usual things. \n\n2. He can't make decisions without someone telling him to do it even though he knows how to do the specific task he was assigned. Sometimes, he asks soldiers who do not know how to do his tasks and when they tell him they don't know how to help him, he gets panicy\n\n3. When left alone, he is FANTASTIC. He does his job very well and does overtime just because he likes what he's doing. He has trouble making decisions so I keep the harder tasks to myself and other soldiers but he is really great at the more repetitive tasks.\n\n4. He is also quite akward socially and soldiers notice it alot although they take away from their ego and they accept and include him in their everyday studd\n\nI really see a lot of potential in this kid and I want him to be at his best. He doesn't have long in the army and I want him to get out a better version of himself. How can I reflect his indicisiveness  to him and how can I better him in a closed environment?",
        "created_utc": 1678574795,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost all self-confidence",
        "author": "truzzt",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oxh8w/i_lost_all_selfconfidence/",
        "text": " As of recently I've been getting some thoughts that I've been doing everything wrong and that I'll have no future. I've lost all confidence to drive, to talk to a girl and I feel like I can't really socialize, even tho I go out pretty much everyday when I need to go to work. \n\nEvery talk I have with someone outside my really closest friends or family feels kinda forced and I instantly feel like the other person is getting annoyed from talking to me. I've been thinking of possibly changing job (to get out of my comfort zone) and experiencing new things, but I don't even have the confidence to fire myself and risk a different company. \n\nI've never really had a relationship, even tho the past few years I've been wanting one of some sort, but I have no confidence to talk to a girl even through Tinder or any dating app. \n\nNothing much interests me anymore, I used to love to play videogames but not even that is keeping me away from this depressive phase.\n\nI'm writing here in hopes of finding someone who has been through the same situation, or for any advice on anything about life that could help me, really.",
        "created_utc": 1678574515,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Things to Focus On",
        "author": "OffmyThrowawy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ox6o4/5_things_to_focus_on/",
        "text": "I see this advice in a lot of self improvement subs. \"Pick only 5 things to focus on and leave the rest.\" I think I'm misunderstanding because when I think about it,\n\n1.Personal Hygiene (skincare, hair care, style)  \n2. Career/School  \n3. Relationships (friends and family)  \n4. Housework  \n5. A Hobby  \n6. Exercise  \n7. Personal development (reading, meditation etc)   \n8. Religion/Spirituality (Studying philosophy and practices of your religion/spirituality + actually doing some of the practices)   \n\n\nThose all seem equally important to me, and I'm wondering if I'm misunderstanding something?  I'm trying to improve myself and build discipline so I've been perusing various subreddits and gathering up some book recommendations. I've seen the focus on 5 things advice multiple times.   \n\n\nPlease help me understand if I've got it wrong because I really want to build good routines for myself.",
        "created_utc": 1678573818,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you stay positive in a negative world?",
        "author": "redlemonadecup",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11owwmp/how_can_you_stay_positive_in_a_negative_world/",
        "text": "Couple that I know of:\n\n1. Gratitude journaling\n2. Intentionally looking for good/beautiful/happy things\n3. Meditate, practice mindfulness to get better at being present and set down past negative experiences\n4. Do nice things for other people\n5. Avoid excessive news intake\n\nAny additional advice, strategies, or sayings related to this are appreciated",
        "created_utc": 1678573131,
        "upvote_ratio": 1.0
    },
    {
        "title": "(GMT +5) Looking for a self-improvement buddy.",
        "author": "Goingtosucceed_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oww5r/gmt_5_looking_for_a_selfimprovement_buddy/",
        "text": "Hi. I am looking for sort of an accountability partner to push each other to be better, and plan and brainstorm ideas on how we can improve. \n\nI have so much to do on my plate, and so many more things I want to do, but I can't find the will, energy and motivation to do them. This has led to feelings of depression, anxiety, low self-esteem and self-hatred. \n\nI want to change, and improve mentally, physically, financially, and in all other good ways. Beat addictions and adopt good habits. However, change is extremely hard, especially if you're going at it alone. Having someone on the journey with you makes things much easier. \n\nSo, if anyone is interested let me know. Let's get better and work on ourselves.",
        "created_utc": 1678573098,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was forced to scam someone i need help",
        "author": "EnvyIsntGodly",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11owvz7/i_was_forced_to_scam_someone_i_need_help/",
        "text": "i was selling shoes for 300$. the guy was so nice he threw in an extra 30$ for shipping. the money was on hold till i purchased 2 gift cards worth 100$ because of stupid cash app rules. i don’t have that money that’s why i’m selling the shoes and now i feel bad because i can’t buy the gift cards and he lost the money that i don’t have acces too. \n\ni feel terrible i know what’s it like to be scammed and i think i’ll burn in hell for this. Someone was\n\nSomeone help me how do i repent i don’t even care about money or jordan’s i just want my soul to stop hurting",
        "created_utc": 1678573085,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you had to give one positive thought or a quote to somebody wanting to turn their life around and improve themselves for the greatest good, what would you say?",
        "author": "Intriguedsouls",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11owqk0/if_you_had_to_give_one_positive_thought_or_a/",
        "text": "No basic comments like ‘go to the gym’. I want to see some deep comments 💭",
        "created_utc": 1678572725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does 'discipline' have to mean hating yourself?",
        "author": "blissedandgone",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11owpv5/does_discipline_have_to_mean_hating_yourself/",
        "text": "27m - I've always been a very undisciplined person, I am prone to deep levels of laziness that keep me in self-afflicting cycles. I give myself a very hard time, whether I'm doing well or worse.\n\nI've had some excellent periods of discipline, even at a casual level like keeping consistent with my running, or going hard in the gym 5 days a week.\n\nLately, I've gone a bit off the handle. I'm very burnt out from work, I'm smoking a lot of weed a lot of the time, I haven't been exercising, I've hardly stayed home, cooking, getting taxis everywhere... I'm wasting a lot of money and ruining my health by taking the easy route. I've noticeably gained weight over the last month.\n\nI'm in regular therapy, which has been really good, but I'm letting myself down by not handling myself well at a surface level. It isn't very attractive, it doesnt feel good, and I'm mad tired.\n\nAs the title says, I've had a hard time with discipline in the past because I can become a bit obsessive, out of control, overconfident and outright toxic to myself and others. \n\nWhat does discipline actually mean? How do you manage something like it without being an utter cunt to yourself? Is there a positive spin I can put on discipline to improve myself?",
        "created_utc": 1678572679,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEW JOURNEY",
        "author": "Mundane-Attention951",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ovkba/new_journey/",
        "text": "Hi! I have not been happy with my life recently. It seemed like everything was going bad for me. People laughed at me for being too thin and weak, which made me lose my self-confidence.\n\nBecause of this, I found it hard to talk to others and felt nervous in social situations. I also started some bad habits like watching porn and spending a lot of time on social media. But today I decided to make some good changes in my life like:\n\nStopping porn\n\nExercising more\n\nUsing less social media\n\nGetting better at English. I wonder if anyone else would like to join me on this journey of self-improvement. We could check our progress and help each other along the way.",
        "created_utc": 1678569876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Account Detox vs. Account Removal",
        "author": "Music-Fan20221",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ouwqd/account_detox_vs_account_removal/",
        "text": "For the last couple of months or so, I have been debating on what to do with my social media accounts (primarily Instagram and Snapchat). I have begun getting very overwhelmed with the amount of users that I have on both platforms, and for me being pretty much a homebody, it gets me jealous or overwhelmed seeing so many posts of people I know accomplishing things or going out with friends. I am a very selfless person, so I also share a lot of motivational quotes to help others, and I feel I've been putting in too much effort with those as well since nobody seems to really read them.\n\nA while back, I created a second account on Instagram primarily geared towards closer friends and those I actually know, and I have found that I prefer that so much compared to my main account. Focusing on a smaller audience of people that I actually know and talk to seems to be a lot better for me than trying to help others who could clearly care less about anything I have to say.\n\nThe thing is, however, I am worried about DELETING the main account compared to just deactivating it. If I delete it, then I do lose all of those that I followed and who follow me, as well as my posts. If I deactivate it for a certain amount of time, I end up finding myself scrolling through what I missed from others the minute I reactivate the account again. Simply put, I have FOMO (fear of missing out) since I am somehow that invested in the lives of those I follow even if they aren't invested in mine.\n\nSo, with that all said, what should be the preferred route: deleting the account, or simply deactivating it and only checking it every once in a while? I feel like I should do the same thing for snapchat (creating an entirely new account for a smaller audience), but I feel worried about losing my snap streaks (which I know is dumb to say, but still).\n\nI know that the ultimate decision is entirely up to me, but I was interested in hearing other people's opinions, especially if they were in a similar boat that I am in, since it would better help me decide what the best route is to take.\n\nIf it helps anyone out: my main Insta has over 700+ followers and my snapchat has over 100+ contacts, but of the two totals, I would say only about 20-40 I actually talk to or know well.\n\nIf anyone has any other further questions in order to understand better, please let me know. Please also let me know if this is the wrong forum to post on and where to post it instead.\n\nThank you.",
        "created_utc": 1678568286,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you build confidence when you're constantly afraid of someone better/prettier than youaking you feel inferior?",
        "author": "always__dreaming",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oupf1/how_do_you_build_confidence_when_youre_constantly/",
        "text": "Like, I know that people who are better than me existing it's just inevitable, but I'm still so afraid of actually gaining confidence and then meeting/confrontinh someone who's better than me and that person making me feel inferior directly or indirectly, causing me to maybe lose all that confidence I had gained. How do you manage that? How do you control that fear? Any tips would help me :)\n\nExcept therapy cause I can't afford it, lol",
        "created_utc": 1678567780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low self-esteem",
        "author": "nwlfch",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oujd4/low_selfesteem/",
        "text": "I constantly seek validation from others. I hate it. How do I stop?",
        "created_utc": 1678567357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I go from here?",
        "author": "El-Pasha-copywriter",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11otxlr/where_do_i_go_from_here/",
        "text": "After a lot of therapy, self-work, and realization I feel a strong surge of energy inside of me all of a sudden, and the path to my goals seems clear as if another person; another person I always wanted to be is inside of me ready to go. I've never felt that and recently it is growing stronger, but the problem is I get confused and don't know how to unleash my true self. It is what I have always been hoping for, it is me who is no longer afraid; me who is ready to do everything to accomplish his goals. Did this ever happen to you and how did you \"unlock\"it.",
        "created_utc": 1678565863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short-term memory",
        "author": "Shady025",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oto3c/shortterm_memory/",
        "text": "Quick question:\n\nI have very good daily habits, one of them is reading, but I've come to the conclusion that my past of scrolling social media from morning to night is affecting me to this day by giving me a horrible short-term memory which makes me not able to recall most things in the pages I read just moments ago.\n\nHow can this be improved/learned?",
        "created_utc": 1678565214,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m lonely with no personality",
        "author": "VisibleDog3140",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ot776/im_lonely_with_no_personality/",
        "text": "My personality has disintegrated over the past few years to the point I don’t even feel like a human anymore.\n\n19M in college who was fairly sociable and well liked in HS and had a few good friend groups. Got pretty heavy into smoking weed and I think this is where it started to go downhill as I declined to go out to bigger events like parties and gatherings in favor of smoking with a few close friends. Well fast forward to now in college and all of these close friends have drifted away whether that be moving or just losing touch over time. Thankfully I had one good close friend that stuck with me since I started college and he was the only reason I still had a social life.\n\nHe would introduce me to new people our age but I could never form any new connections as I feel I would have nothing to say or if I did I would end up pissing multiple people off. In fact I pissed off so many of his friends that a lot of them were talking shit about me behind my back and some of them even wanted to fight me. I think this rubbed off on my close buddy and it made our time together kind of tense and uncomfortable so we just mutually stopped talking to each other. (Haven’t smoked since we stopped hanging out)\n\nThat was about 3 months ago and since then I’ve been so lonely and isolated it hurts. I have classes a few days a week but I decline to go to those as I can’t even muster the strength to talk to people, or if I do it is only school related and I can never connect with anyone else on a personal level. Thankfully I can get my work done at home but sometimes I have to go in for whatever reason and when I’m in class I can’t think about anything besides the fact that I’m the weird loner who doesn’t have any friends. I also quit my job a few months ago because I got into a fight with a co-worker where I punched first and I got scared he would rat me out so I just never showed up again. \n\nI also have a super depressive demeanor which I can’t shake because Im terrible at faking my mood and this has rubbed off super bad with my parents. Both my mom and step dad probably despise me right now because Im so lifeless and moody. They used to want to spend time with me or even talk to me but know they barely acknowledge that I exist. I literally feel like there’s no one I can even talk to right now and it’s made me super depressed and lonely to the point I don’t see a reason to get out of bed.\n\nAll in all I think I’m just super toxic and can’t make new friends as I have some social inhibition that prevents me from being normal, and now that most of my social outlets are gone I’m literally just a corpse that can move. If anyone has advice or anything at all to say it’ll be much appreciated.",
        "created_utc": 1678564059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skill tree for books by topic?",
        "author": "Ashcorp56",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11osygj/skill_tree_for_books_by_topic/",
        "text": "I’ve done some researching and can’t seem to find what I’m looking for.  Basically I’m looking for a resource like Goodreads but by topic with a video game-like “skill tree” with basic to moderate to advanced books by topic.\n\nExample:  Personal Finance -starts with The Psychology of Money as a level 1 type book and eventually the book skill tree gets to The Intelligent Investor or something more complex.\n\nAny thoughts?  Or does this not exist yet?",
        "created_utc": 1678563449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 1",
        "author": "DryScience3853",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11osxty/day_1/",
        "text": "Day 1 complete of my journey, felt so tired but still went to the gym and pushed myself did 100 Pull Ups, 100 Push Ups and 15 minutes in the sauna. Afterwards I went for a 4 mile run in just a tshirt. Currently feel like I could pass out but got some work to do for tomorrow, as well as some gratitude before bed.",
        "created_utc": 1678563405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ways to naturally increase testosterone?",
        "author": "SamuelGaming08",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ostq2/any_ways_to_naturally_increase_testosterone/",
        "text": "I’m a 14 year old UK male, I want to naturally increase my testosterone, any advice?",
        "created_utc": 1678563133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been on self improvement for over a year now, ask me anything",
        "author": "MrDaantje21",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11osonx/been_on_self_improvement_for_over_a_year_now_ask/",
        "text": "I did NoFap, am going to the gym, eating good, journalling, meditating and so on.\n\nAsk me anything I will try to answer your questions and give advice.",
        "created_utc": 1678562801,
        "upvote_ratio": 1.0
    },
    {
        "title": "My upbringing messed up my ability to 'let go'. How do I stop my perfectionism?",
        "author": "MysteriousWay222",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11osd4a/my_upbringing_messed_up_my_ability_to_let_go_how/",
        "text": "My parents had high expectations of me and my siblings growing up. This proved helpful as people viewed me as hard working. However, I feel paralyzed now that everything I do must be of utmost effort, or else, what's the point in doing it.  \n\nI struggle to get my daily tasks done. Lots of wasted time. Lots of people pleasing. Lots of ending-up-doing-nothing because I am overwhelmed. (&amp; nooo this is not OCD, I feel no compulsions, just **guilt** or **self hate**).\n\nWhat actions can I take today to stop perfectionism (as all the TED talks &amp; mentality changes &amp; nice-sounding-quotes have obviously not been long-term solutions for me anymore)?",
        "created_utc": 1678562018,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wonder if i can change",
        "author": "FKNredditors",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11osa8c/i_wonder_if_i_can_change/",
        "text": "i started self improvement few months after school was closed due to covid in 2020 (i started my 10th grade in high school). I had big problem with video game and i was very lazy so i tried to do productive things. I had simple targets, daily workout and reading books. It went really well. Started bodyweight and reading novel. Only lasts for few months, then i relapsed, playing games all day.  But im not giving up, i tried to adapt with online class, started taking notes and study, did bodyweight more seriously, and started playing instrument. Lasts for few months and i relapsed again. Each time i try, new problem arrives.\n\nI keep trying but things keep repeating till now. Last week i was being very productive, now im on reddit at 2 AM. But situation kinda changed. Only few months till i have to go to college. Im worried but at the same time i realized, i did all this self improvement because i was really motivated to change myself, but when the motivation is gone, i lost my focus and wasted my time. I didnt have any big target, i only watched tips but never did anything. Now i have the pressure, i have to study for college, and i cant keep being like this. I relied to much on motivation, but now im aware, i really need some self discipline. But im worried if i cant change.\n\n&amp;#x200B;\n\ni'm not here to beg for tips, i just wanted to let my thoughts out, and im curious if you guys had similiar experience",
        "created_utc": 1678561823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad habits",
        "author": "Rubberbangirl66",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11os13a/bad_habits/",
        "text": "What bad habit would you like to eliminate? For me, it is my sleep, if I could get up and feel rested, I think my life would dramatically change.",
        "created_utc": 1678561236,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want massive change in your life, abandon algorithmic content alltogehter. This means nearly every kind of social media currently available.",
        "author": "pronlegacy001",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ort1g/if_you_want_massive_change_in_your_life_abandon/",
        "text": " **Algorithmic models of content generation is at its core, a slot machine for social media.** Enough finger movement up scrolling or swipes, the little duckies, or flowers, or pirates are going to lineup and you're going to get a dopamine jackpot.\n\nNow, dopamine spikes are not real. It's actually worse. That \"Spike\" in dopamine you feel when getting on TikTok is **actually** your brain raising the overall threshold it needs to feel happy and satisfied. This threshold is at the highest it has ever been in human history with the advent of social media. However, algorithmic scrolling and especially TikTok takes it to a whole new level.\n\nThe **reason** it is so addicting is not due to its actual content. In fact, you're going to end up with **less** content than other platforms if you had chosen the actual content yourself. A 30 minute youtube video pertaining to your interests actually gets you **more** of what you want. Yet for some reason, TikTok and other short form social media is platform of choice.\n\nThe reason boils down to the actual mechanics of the apps and already proven and useable psychological science. TikTok and other companies combine slot machine mechanics with social and human connection.\n\nWhy are slot machines (and gambling at large) so popular? **Because the outcome is uncertain**. While the actual outcome is certain as a probability found in math, to the subconsious human brain it is an entire mystery. The next jackpot could be **just one more roll away**. Your wife will actually **thank you** for selling her grandmother's wedding ring when she has a million dollars!\n\nThis is why horror movies struggle with the ending. As long as the threat is uncertain, the director can focus on letting your imagination and perception of an uncertain future drive your fear. The same mechanic works for pleasure, pain, sex, love, etc.\n\nHumans **love controlled uncertainty**. And scrolling and shorts is social media predicated entirely on controlled uncertainty. You may have some sort of algorithm. And it may be tuned towards you. But you truly never know what's around the next corner.\n\n**This is exactly why \"Scrolling\" on social media is so addicting**. By letting that algorithm take over you can scroll much longer than you can stand to look for something on a streaming service.\n\nTikTok takes it to a new level. There is a reason their \"Search\" options are such dogshit. Why you can't easily find videos that a creator has made a year ago. There's a reason why they designed the app to have you mainly depend on your FYP. It's a slot machine for human experience. Swipe up and you may laugh, cry, be angry, etc. The one thing you won't be is bored.\n\nThis fact alone makes it a **diabolical** app for people's lives. What makes it **worse** is that what it offers is catered to the specific needs of the person.\n\nSomeone desperate for money and someone who feels trapped is going to be easily hooked into a slot machine. But someone who has no financial issues and doesn't exactly have a weakness to reckless spending isn't going to be as drawn or as much of a target market for slot machines. Slot machines have a very limited market.\n\nBut TikTok and other algorithmic social media doesn't have those kind of market limitations. They can target **anyone with any deficiency in their life with a FYP to give them their fix**. Feeling lonely? there's plenty of content for you. Angry? yep. Horny? you bet. Need a laugh? TikTok can provide. **All with slot machine mechanics**.\n\nIt's a slot machine for life. And it's dangerous. Dumbasses think that these companies are trying to steal your information. Nope. A VPN won't do shit. They don't give a fuck about your info. **They want your time.** Time = revenue. That's it. The only information they want, is info that can keep you on their app for longer and buying their advertisers products. That's it.\n\nSo my advice? Get off of any social media that focuses on algorithmic scrolling. Especially ones that offer stuff like shorts or reels. And above all get off of TikTok.\n\nTake back your time. Take back your life.",
        "created_utc": 1678560703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everybody including my family and friends look down on me for being a dud, but I still don't want to work. I would rather continue waking up late, play video games and sweat everyday (because I need to be healthy to enjoy games for longer).",
        "author": "johnnvk",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11orqvr/everybody_including_my_family_and_friends_look/",
        "text": "I have no motivation to improve my life. I don't even want to improve. I have a uni degree but I am not interested in doing anything.  I used to be a bright kid in childhood up until graduation.   \n\n\nI passed with a Civil engineering degree and looked for work in market. The payscale was so abysmal that I completely hate it now. Now I have spent the vast majority of last 4 years (after graduating)  playing games and running/working out. \n\nI am totally asocial. Leave my house just for taking some sun and going to the park or gym. Deleted my socials + quit contacts with all my friends also.",
        "created_utc": 1678560563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning how to shut up",
        "author": "knockrocks",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11orkfs/learning_how_to_shut_up/",
        "text": "I hate my job. I hate my neighborhood. I hate myself. I hate my situation in life. Did I mention I hate my job? I really, really, really hate my job (for various reasons I'm stuck here). \n\nI complain constantly and always have something negative to say because the hatred is just boiling up in me and that's all I can ever focus on. \n\nMy goal for self-improvement is to simply shut up. That's it. Keep the tired rhetoric to myself. I am a superfluous overtalker and it's always about me and always about what I hate and that's so tiring for others. I know iI'd be annoyed if I had to listen to that all day. \n\nSo today is the first day of me literally just shutting the fuck up if I have something negative to say. I've already slipped up a couple times, but I'm letting some close friends know about my goal of Shutting The Fuck Up so if I'm unusually quiet, they know why. \n\nHave any of you ever tried Shutting The Fuck Up? How has it changed your life, if at all?",
        "created_utc": 1678560139,
        "upvote_ratio": 1.0
    },
    {
        "title": "which is better, stick it out or find a new job?",
        "author": "throwthrthrowaway",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ordo9/which_is_better_stick_it_out_or_find_a_new_job/",
        "text": "[removed]",
        "created_utc": 1678559681,
        "upvote_ratio": 1.0
    }
]