[
    {
        "title": "Find different college friend group because interests don't align?",
        "author": "DBag444",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10umo1t/find_different_college_friend_group_because/",
        "text": "Wondering what people's advice on this topic. I'm a computer science major, who wants to really upkeep his 3.7 gpa because there's a certain graduate school I would like to attend, as well I'm also really being prepared to be the best software engineer I want to be for work and as well for when I eventually want to do a startup.  \n\n\nI'm very friendly and outgoing, so I usually manage to make friends or find common ground with most people and currently have a recurring friend group/\"study group\" that I meet with to hang out, sometimes during the week. However, none of them are really putting the effort to do what I want to do, many of them have made \"try hard\" jokes and the like toward me, I usually just take the joke or even laugh at it because I don't mind, I'm here to graduate period.   \n\n\nBut some of them I have heard talking smack around me when they think I'm not around but I was, and act little prejudicial towards me. And while most of them are nice, I really don't feel like our interests align. They just want to do the minimum or cheat off each other which is fine for their own goals of just wanting a simple job, there's no hate towards that, but I don't.  \n\n\nMost of them are still in the \"party\" phase of their lives, and I don't really do that right now, both because I got it out of my system when I was in my early 20s, (only some of them are still in their early 20s), and as well I'm trying to make sure I get my finances in order when I get out.  \n\n\nIs it a wise choice to let these guys go and try to pursue people who are like minded?",
        "created_utc": 1675629173,
        "upvote_ratio": 1.0
    },
    {
        "title": "workouts",
        "author": "ShibaDoggi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10umn8n/workouts/",
        "text": "ive been getting into exercise again and its been lifting my mood. i used to be fairly active but i stopped working out as much due to personal reasons. i still did taekwondo two times a week though. i started lifting again literally like two days ago but i cant explain how good it makes me feel once i finish a workout. just wanted to put that out there, thanks",
        "created_utc": 1675629121,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I change myself? [20M]",
        "author": "imsohappycuztoday",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ulxuf/how_do_i_change_myself_20m/",
        "text": "* I am addicted to Masturbation, Pornography, And Nicotine.\n\n* I am mentally and physically weak, my legs are weak. \n\n* I feel like I'm left behind, and people of my age are like too advanced than me.\n\n* I hate I'm not that smart, and I'm slow. Really demotivates me.\n\n* My friends won't study for whole year and they will start studying 5 days before exams and still pass the test. I wish I had this skill, i had it but it's gone due to my messed up lifestyle, I've lost my mental clarity.. now no matter how hard I try, i need to make really strong efforts to actually be able to pass the test.\n\n* I'm chubby.. like I'm not obese but I'm fat and it makes me insecure. As I'm also short.\n\n* I love a girl but I'm scared to commit to her.. she loves me too.. but I'm not sure if i wanna be in relationship with her right now but i don't know how to be sure.\n\n* I don't know myself, like i don't know what exactly i want to do in my life. I wanna have passion but i don't seem to find it.\n\n* I lack social skills, maybe i do have them but it's not like others. Like others are so smart, they can make friends easily. Idk why i can't do the same.\n\n* It's like people see me as someone who's naive and dumb and inexperienced. I wonder how do i make myself look more wiser so more people listen to what i have to say and not tease or shut me up or make fun of me for being so stupid.\n\nWhat the hell should I do?",
        "created_utc": 1675627453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting back on track…",
        "author": "ethan5877",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ulxaz/getting_back_on_track/",
        "text": "Alright so I was doing really well for a couple of months. Waking up early everyday, working out hard, good diet, and starting a side hustle. \n\nRecently I’ve slipped a bit. I’m still a lot bette then before I started. But it seems like everyday I tell myself that tomorrow I finally get back on track. And I always end up cheating myself somehow. \n\nI was wondering if any of you guys have experienced this and how to overcome it? I really want to do well and I know when I’m doing wrong… I just am lost on what’s going on.",
        "created_utc": 1675627419,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stop overthinking and not be embarrassed to learn driving with a stranger?",
        "author": "Jpoolman25",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ululn/how_do_you_stop_overthinking_and_not_be/",
        "text": "\n\nI’m 26 and I don’t know how to drive. Yes I do feel ashamed of myself like people way younger then me drive and go college or work. I don’t want to depend on my family to take me places. I just have this fear and anxiety to drive on the road. But one of my sis friend is willing to teach me driving next week. I’m already feeling anxious and intense amount of shyness and embarrassment like what do I say or how to say I’m scared of driving. Already thinking like this makes me want to avoid facing this situations. But at the same time I have this pity feeling of guilty and shame. Idk I just hate overthinking and what others might think of me. Maybe they will view as a weak link or scared slow person. Idk\n\nI feel like driving will help me build confidence and give me that freedom to do many things like helping my family and going to work if it’s far distance. Driving is a must skill to have. Anyone from young kid to elderly drives then why am I making it a huge deal in my head. It’s like I’m trying to conquer a mountain or something.",
        "created_utc": 1675627239,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can i fully stop watching porn",
        "author": "DemongamerYT",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ulfa2/how_can_i_fully_stop_watching_porn/",
        "text": "Stop for about a week but i have started to watch again and i hate it, i only watch it once a day now which is much better than before but i want to fully stop watching. Any tips?",
        "created_utc": 1675626217,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make friends as an adult ?",
        "author": "OkAcanthaceae6558",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ul7kb/how_do_you_make_friends_as_an_adult/",
        "text": "This is a serious question,\n\nI am in a foreign country starting a new life, I never had to re-do the process entirely, but now i've been here for months and still dont know anyone.\n\nFor context people at work are 20+ years older, even though I tried, we simply dont share the same interests.",
        "created_utc": 1675625697,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop being stuck",
        "author": "MagicianFlashy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ul634/how_to_stop_being_stuck/",
        "text": "I’m going through things and I need to know it will get better\n\nAs per the title, I’m going through things. I am 21 years old and have not followed a steady path like others my age have. Maybe it’s because I’ve had this bug inside of me to never make a concrete decision and never conform to certain structures, but I feel so lost. I recently transferred to a new creative and very artsy college in hopes to chase my dreams. It was a positive step in a good direction but I can’t help but feel so lonely and lost. I live in a small town and have little to no friends left, either because we grew up and on from high school or they turned out to be really negative and miserable people. Ironically enough I lost most of them after I went through my spiritual journey. I got into philosophies, gurus, manifesting, tarot and so much more. As of recently though I just seemed to lose all my spirit and feel so down. I sobbed to my mom yesterday because I feel I lost my confident and happy spirit. It seems everything is not coming to me easy anymore. Friends are hard to get, plans, good body, dream job/internship…. It’s almost like no matter how positive and hopeful I feel towards my situation bettering it just gets worse. I feel stagnant and lost, idk when my life will turn around. I go to school, my part time job and home. That’s it. There’s no adventure or excitement in my life, I just feel really alone. I want to stop being stuck but idk how to get unstuck. I see everyone else around me go out and party and travel like I should be doing now. It hurts because I love spirituality but it’s so hard to keep the faith. Has anyone else been through a “stuck” period? How did you get out.",
        "created_utc": 1675625590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bored of everything.",
        "author": "Equivalent-Theory-94",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ukzb3/bored_of_everything/",
        "text": "I’m a 23(M) year old just bored and always find myself looking for something to do but never actually finding anything. I don’t know if bored is the right word or if I worded the title right but here’s my situation. \n\nI have a good job for my age, nice family, a small group of friends and not much to complain about. My life is just a set schedule if that makes sense. There’s nothing new. Go to work in the morning come home, chill with my family for a bit, work out and then just game all night with friends. We go out once in a while. It’s not that I’m completely miserable but there’s like no satisfaction or anything to look forward to. Gaming is getting old and boring but every-time I mention to my friends to do something else they always say there’s nothing else to do, just “get on and game and laugh”. I feel like there’s nothing to watch on YouTube or Netflix. Everything is just boring, I can’t seem to find anything to do or amuse me. My friends and I are all about saving money so we don’t like party or go out often and “waste/spend” money. \n\nI really don’t know what my question is to you guys. I just want to feel excited and satisfied or look forward to things. Going on vacation or going places requires money which I need to save for the future cuz everything is expensive now. Do I have to change my mindset? Spend more money but then worry more? Stop listening to my friends lol?",
        "created_utc": 1675625142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honestly I cannot do online dating anymore.",
        "author": "garageyeeeeeee",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uktre/honestly_i_cannot_do_online_dating_anymore/",
        "text": "I’ve used it on and off through out my twenties and I’ve had some fun and met cool people. Although I’m about to be 29 and I just got on it a few days ago, I got some matches, some pretty cute girls but my desire has shifted. I think when I was younger I was more interested in trying to get laid and whatever but now I’m just like man that’s not really what I want and i don’t feel like I’m yearning to meet someone so badly that I have to do it via an app to increase my options. I feel pretty comfortable moving through the world as it is and when the right person comes around maybe it will be right and roll with that. I know plenty of people that have met their person in those places and I’m not judging by any means. More power to them whateve makes them happy. But me truthfully I just want a different kind of experience. Idk just something that’s on my mind.",
        "created_utc": 1675624775,
        "upvote_ratio": 1.0
    },
    {
        "title": "it always feels like someone’s watching me",
        "author": "IndependentDay9150",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ukrts/it_always_feels_like_someones_watching_me/",
        "text": "I feel so uncomfortable with my own self that I can’t do everyday things without feeling there’s a camera or that someone’s watching. I’m aware that literally no one cares but my mind is always paranoid. I’m showering &amp; wanna dance or sing, no i sound too bad &amp; I start to cringe imagining if someone was watching me. I wanna talk to myself in the mirror, tell myself I love me, no too embarrassing, looking around or away from myself. how can I improve my self love?",
        "created_utc": 1675624648,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could have achieved so much more!",
        "author": "dexterest",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ukhhm/i_could_have_achieved_so_much_more/",
        "text": "I consider myself to be quite productive during the day. I workout 3 days a week, journal &amp; meditate every morning, have a decent productive work day. I spend quality time with my SO during the weekends. I have been wanting to invest some time upskilling myself and to work on side research projects to put out some publications. I would say I achieve most of my goals that I set for myself. \n\nHowever, porn has been my arch-nemesis since a very long time and it's only gotten worse and worse. After my marriage, I would wake up after my SO has slept and spend hours watching porn every 2 days or so, leaving me depleted during the day. I was living a second life that she didn't know anything about. Things drastically changed during the pandemic as both of us would stay at home all day, and she ended up finding out my secret life. However, this did not help my situation at all. We tried to fix this situation for several months but it wouldn't. She ended up liking the porn I was watching, and now she is addicted to it to. Now that it's out in the open, we both end up watching porn almost every evening, either together or in separate rooms. I wish she never found out about my secret life. At least, I had an incentive to be productive in the evenings, either spending time with her or working on myself. Now that we're both into this, we end up watching porn and sexting for 5-6 hours at a stretch. I end up feeling ashamed of myself. I just don't know what to do with it anymore, as there are now 2 people, me n her, nudging me to watch porn in the evening.",
        "created_utc": 1675623962,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do Reddit?",
        "author": "BigPoppa_420",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ukgnn/what_should_i_do_reddit/",
        "text": "Hey Reddit, 24M in the UK and not happy with my life or future prospects but ready to make a change. \n\nI'm currently thinking  my best option is to apply for live-in jobs in rural locations working as a housekeeper in a hotel, I'm just really nervous because its so drastic of a change and I'm scared that if i dont enjoy it ill end up homeless (no family to fall back on). I enjoy my current job which is processing fire wood but the hours are inconsistent and I'm really struggling with bills and rent. I was homeless for 6 months last year and slept in a shipping container, currently live with a 55 year old drug addict and I really hate it  but its better than  the shipping container let me tell you, but the house is always cold and I'm so unmotivated when I wake up. I just feel like I need change so any advice would be greatly appreciated.",
        "created_utc": 1675623908,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what age did you start self improvement?",
        "author": "Ok_Key_7906",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uk6fv/at_what_age_did_you_start_self_improvement/",
        "text": "İ know this might sound dumb. İm 17 and even tough i logically know it, i still cant shake the feeling that im too late to self improvement. So i wanted to ask, at what age did you guys start self improvement and at what age did you guys start turning your life around? What kind of advice can you give me as a 17 year old?",
        "created_utc": 1675623269,
        "upvote_ratio": 1.0
    },
    {
        "title": "I like who I’ve become the last few years, but I always want to improve more",
        "author": "ChaotixEDM",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ujuwx/i_like_who_ive_become_the_last_few_years_but_i/",
        "text": "I’ve gotten to a pretty good point in life where I feel quite content day to day, where as before life was kind of a struggle at times. I have a clear vision I’m aiming for and I’m doing all the required steps to keep moving forward with my goals but I often get this feeling that everything I’m doing isn’t enough and I should be going 3x harder. \n\nThis results in hardcore burnout with me to the point I stop working out, stop working on projects and just revert to coming home from work and getting nothing done. I’ve always been an all or nothing person and it isn’t good. How do you just tell your mind it’s okay to slow down and not overwork yourself when your minds telling you that you’re not doing enough. I’ve had a really hard time finding that balance.",
        "created_utc": 1675622506,
        "upvote_ratio": 1.0
    },
    {
        "title": "self improvement phase and old friends?",
        "author": "Medium-Tennis8227",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ujk3e/self_improvement_phase_and_old_friends/",
        "text": "So now I got into self improvement phase. I had few old friends around me. However, me changing from who I was to who I want to be takes massive work. I am on the transition of it. But they still have little kid tendency like making fun of me if I am around girl while I am fully grown ass man or so. Now I am moving away from my hometown tomorrow, which is great because now I will rarely have time with them in the future. I realized that I should limit my time with them like once a year from now on for my transition because I get influenced from them. It's sad but I guess this one is inevitable for myself. Anyone who went through self improvement phase, did you have to stay away from old friends because you go back to old version of you when you are  with them?",
        "created_utc": 1675621793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggest an app for mood tracking every 15 min",
        "author": "mydreamingends",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ujj64/suggest_an_app_for_mood_tracking_every_15_min/",
        "text": "I have something strange. In a middle of a day i just strat crying and literaly want to kill myself, and I see death as the only purpose of existence. Then 2-3h later Im okay. Then 2-3h later I have kind of hypomania.\n\nThis  might circling a few times a day, some states might not presence.\n\nSometimes it's only absolute dispair for the whole day, sometimes - couple of days of normal mood.  \nI general, these states are not stable in duration, I cant see any patterns.\n\nI need to find kind of triggers, I to know what is going on. So Id love to have an app that ask me about my mood every 15 min (maybe 30 idk), and some optional commentary on what is going on. \n\nOF course, there must be option to pause alarms. Any ideas?\n\n(this thing with me for years)",
        "created_utc": 1675621733,
        "upvote_ratio": 1.0
    },
    {
        "title": "My history of addictions, how self improvement helped",
        "author": "Morocco_Bahma",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uj4z7/my_history_of_addictions_how_self_improvement/",
        "text": "Escort addiction - 2018 - 2020, I've wasted £12k on escorts. I lost my virginity to an escort (I don't regret that) as I was using that particular escort as a reward for completing my IT certifications. When that escort left for Romania, I was trying other escorts but it wasn't the same. As all I wanted was someone to connect with, it wasn't fully about the sex. In 2020, I analysed my mental health and realised I was an addict so I refocused that energy on my job and I convinced myself that there will never be anyone like the first escort. I also kept a journal of the pros and cons of visiting escorts and then COVID happened so by the time that passed i was cured from the addiction. Now in 2023 I have the occasional desire to visit an escort but it doesn't consume me as I visualise the affects it will have once I finish the deed is done and £200 less off in the pocket  and then the emptiness and regret kicks in. \n\n\nGambling addiction 2005-2021. I've been a gambling addict since I was 13. I started at the arcade, then it was FIFA packs, then it was online slots. I have lost est. £35k from gambling. I started to see patterns when playing that you win for a certain time then the wins get less, less and less. Then I started YouTubing slots and realised it was kinda fixed. I watched loads of documentaries and kept journals about the pros and cons of gambling. I persuaded myself that it wasn't worth it then then desire stopped. It took 2 years for the fire to extinguish.\n\nCrypto 2019-2020 I lost est £15k from crypto. As a gambler I shouldn't have went into crypto to begin with. I entered crypto at it's peak and invested in shitcoins. I was pumping all my savings. Luckily I found a contracting job paying £600 a day in 2021. Got all that money back. This job taught me a valuable lesson and I am no longer tempted by this.\n\nJunk food addiction 2007-2022. Est £25k lost. My personal trainer helped me to combat this addiction. This along with education about McDonald's meat and digestion time. I'm currently leaning then clean bulking. So I'm obsessed with my weight atm and I realised that one McDonald's meal will take 5 days to lose the weight gained from it. Fasting also helped to cure this issue, resisting temptation of food has made me very strong. \n\n\nIf I can do this so can you. No need for any AA meeting or equivalent. It is all in your mind. I'm 31 years old. Addiction free!",
        "created_utc": 1675620793,
        "upvote_ratio": 1.0
    },
    {
        "title": "A long healing process after attempted suicide",
        "author": "Steeglitzer207",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uj2ol/a_long_healing_process_after_attempted_suicide/",
        "text": "Throwaway because this is something that I'm not ready to reveal to friends and family.\n\nAbout fifteen years ago, at 17, I attempted suicide twice within 6 months. Those evenings were moderately deeper points in a terribly deep time that stretched over my late teens and early 20s. I was fucking hopeless nearly the whole time - treading water and just waiting until I dipped low enough to really see the bottom. Life was an absolute fight and family was a toxic shadow. From age 18 no part of me believed that I would make it another year.\n\nToday, just over age 30, I had a seminar in medical school about the pathophysiology of my preferred suicide method. It was really tough to sit through. So, so much has happened between now and then - lots of struggles and lots of euphoria. Lots of slogging through one more winter, putting my money on one more idea, therapy, medication, fights, healing, and white-knuckling existence. Now, today, my life has stabilized and I've got a list of dreams that are gradually coming together. I never, ever thought that I could manage to get into medical school, let alone succeed in it - yet here I am. I don't cry nearly as much. The hopelessness is gone. It took my entire 20s to get this all together, but my future is looking good. I am happy, and I'm happy to be alive and experience my life.\n\nAll I want to say is that your dark times will probably always be inside you, *but that's okay*. I remember thinking as a teenager that will I never be happy and completely unbothered, and I won't lie; it's turned out to be partially true. The scar of suicide is still very real on my heart. But, step-by-step, I've learned how to live. And with this comes a strong urge to tell (especially) young people that your pain is absolutely real, but you can survive this. You can survive this pain, even if you've never really been happy before and don't even know what it's like. You can build something out of nothing. You can learn. Much love to everyone from the other side of 30. &lt;3",
        "created_utc": 1675620641,
        "upvote_ratio": 1.0
    },
    {
        "title": "modern men are annoying",
        "author": "Lower-Breakfast-2801",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uioui/modern_men_are_annoying/",
        "text": "The modern man is a catty teenage girl. \nThey literally refuse to stop talking. \nEverything has to be a one up (passive aggressive of course, get confrontational and they cower).\nThey cannot take a breath in between sharing their opinions or pointing out basic observations, and the gossiping is horrendous!\nNowadays your lesser \"bros\" will tell your business to others and say nasty things about you behind your back.\nNot to mention the utter obsession with media. \"Dude what!? You haven't seen this movie??! You haven't heard this ear grating song dude bro??!\" \nCombine that with the fact that most men are completely out of shape, don't groom or eat well and are proud of it, I can see why this generation is so sexless on the male side. \nThey don't even have actual interests. If it's not a video game, or a celebrity, or some popular low quality music, they're simply clueless.",
        "created_utc": 1675619738,
        "upvote_ratio": 1.0
    },
    {
        "title": "An emotionless alien",
        "author": "Dayummmmmmmmmmmmmm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uicem/an_emotionless_alien/",
        "text": "All my life people have perceived me as a really nice guy. But no I'm not nice at all. I'm horrible as a matter of fact. The reason I'm perceived this way is because I don't act on my emotions. I've never expressed or let out an act due to an emotion I felt. People think I'm really chill. But it's horrible. I want to let out what I feel. But I'm afraid I'm past the time to change it. Never told a girl \"hey i feel this way about you\" never stood up for myself or my loved ones when I needed to, and it's probably why I'll never succeed in life. I want to let everyone know everything but i just don't have it in me when I need to. I really envy those who act on impulse. I wish I could too.",
        "created_utc": 1675618877,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do i do this",
        "author": "D4ST4GIR",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ui4ul/why_do_i_do_this/",
        "text": "i am 20m . so there is the thing which i want to stop because it makes me anxious and less of self. everytime any friend of mine shows me something cool they did and my intial thoughts are always i can do better than this instead of appreciating them . i dont really say that out loud but i fake it by saying yeah its cool. how do i stop this competitive feeling i have lost some friends due to this and after that i spend my time in guilt. and if any of my friends knows more something than me i have this weird feeling idk really i tried to stop this and to actually appreciate them but it feels fake.",
        "created_utc": 1675618382,
        "upvote_ratio": 1.0
    },
    {
        "title": "This video is my morning fuel",
        "author": "Smooth-Assistant-414",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uhwgl/this_video_is_my_morning_fuel/",
        "text": "[removed]",
        "created_utc": 1675617838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I block my friend?",
        "author": "Throwaway857655",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uhp3z/should_i_block_my_friend/",
        "text": "[removed]",
        "created_utc": 1675617344,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t stop being envious and jealous of everyone, and it’s destroying my life.",
        "author": "by_comparison",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uhmql/i_cant_stop_being_envious_and_jealous_of_everyone/",
        "text": "[removed]",
        "created_utc": 1675617189,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have a habit of forgetting my belongings at random places how do I fix this",
        "author": "Prof_Hiro",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uh5tq/i_have_a_habit_of_forgetting_my_belongings_at/",
        "text": "basically i get too lost in my thoughts and leave things in places like college,  train or bus\n\nthis is happening again and again where i notice i have left something somewhere only to notice it after reaching home, with no idea of where i left it\n\nMy parents are very angry about my careless behaviour so much thay now it is something expected that i would do\n\nhow do i fix this i dont  want to cause any more inconvenience to anyone anymore",
        "created_utc": 1675616068,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stop negative thoughts",
        "author": "amrapaIi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uh15g/how_to_stop_negative_thoughts/",
        "text": "hi! i moved to a new city for my internship about a month ago and things aren't going as I'd hoped. I want this to be the time where I learn new things, grow more independent/self sufficient and get better at work but I'm falling apart. i can barely make it through the day without wanting to burst into tears or quit my job, this industry everything. feels like college taught me nothing and im just a liability to my co-worker.\nHow do I stop thinking this way",
        "created_utc": 1675615745,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I overcome extreme procrastination?",
        "author": "Psychological-Let-18",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ugygd/how_do_i_overcome_extreme_procrastination/",
        "text": "I procrastinate in about everything. When doing homework, even though I know what the consequences will be if I procrastinate, I still do it. Mentally I know how bad procrastination is but physically my body just can’t overcome procrastination. Any tips will be helpful.",
        "created_utc": 1675615553,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ultimate Step To Unlocking Your True Potential &amp; Getting Out Of Your Own Way That The Gurus Don't Mention... Cheers!",
        "author": "Emotional-Albatross7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ugvxu/the_ultimate_step_to_unlocking_your_true/",
        "text": "[removed]",
        "created_utc": 1675615373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Binge eating",
        "author": "CashComplete8980",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ugp87/binge_eating/",
        "text": "Not sure this is right sub for this but I’ll ask. \n\nI have excellent discipline when it comes to things such as working out daily, nofap, and cold showers. When it comes to an eating binge I can’t control myself. If I feel a binge coming on what should I do?  Push-ups, sit-ups, chew a piece of gum??? It drives me crazy because if I can control this aspect of my life I’d be at my ideal physical peak which I really want…Any advice??",
        "created_utc": 1675614910,
        "upvote_ratio": 1.0
    },
    {
        "title": "DRVN30",
        "author": "Asianneo00516",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ugo77/drvn30/",
        "text": "[removed]",
        "created_utc": 1675614835,
        "upvote_ratio": 1.0
    },
    {
        "title": "My depression makes me feel guilty bc I have no real problems",
        "author": "trying2passmyclasses",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ugdwh/my_depression_makes_me_feel_guilty_bc_i_have_no/",
        "text": "My depression: \n- rubs off on other because I can’t “mask it” well\n- has pushed all my friends away. I thought they didn’t like me but it was my thoughts that ended it\n- causes me to isolate which in turn made me have social anxiety \n- makes me mean to my mom and she doesn’t deserve it at all\n- has my room messy af I’m so unorganized \n- makes me have negative thoughts 24/7\n\nI really want to get out of this rut. Im 21 and I shouldn’t be this stressed. I have no real problems.  I grew up nicely, have a good job. There are people with actual issues and I feel so guilty for feeling this way. Especially because I have full control and all my issues were because of me and my mind.\n\nHow do I get out of this??? I am losing hope.",
        "created_utc": 1675614127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clothing for the Self-improvement Community?",
        "author": "Popular_Sir5289",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ug7zi/clothing_for_the_selfimprovement_community/",
        "text": "Do we in the community need a bit more representation in terms of our clothing or is it fine as it is?",
        "created_utc": 1675613714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improve every aspect of your life by getting better sleep",
        "author": "wallaby_way_daily",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ug6t4/improve_every_aspect_of_your_life_by_getting/",
        "text": "The productivity of our day is dictated by the quality of our sleep. Good sleep is essential for overall health and well-being.\n\n12 months ago I decided to make a change. I intentionally created a better sleep routine that has allowed me to excel during the day.\n\nWe tend to over-extend ourselves when trying to become better. I always recommend starting out slow. There's no better place than starting with sleep. Just a few good habits can dramatically improve a third of your life.\n\nHere are some tips on how to get better sleep.\n\n4 hours before bedtime:\n\n* Exercise: Regular physical activity can help you fall asleep faster and sleep more soundly. But avoid exercising too close to bedtime as it can stimulate the body and make it difficult to wind down. Try to exercise at the very latest 4 hours before going to sleep.\n* Avoid caffeine and alcohol: Caffeine is a stimulant that can interfere with sleep, so it’s best to avoid it, especially in the evening. Alcohol may help you fall asleep faster, but it can disrupt the quality of your sleep and you’re more likely to wake up continuously.\n* Avoid napping: This can make it difficult to fall asleep at night, so try to limit naps to less than 30 minutes and avoid napping after 3 p.m.\n\n2 hours before bedtime:\n\n* Avoid heavy meals: Eating a large meal close to bedtime can cause indigestion and make it difficult to sleep. Try to finish your last meal of the day at least two hours before bedtime.\n* Relax: Find a relaxing activity that you enjoy, like reading, taking a bath, or meditating. These activities can help you wind down and prepare your body and mind for sleep.\n* Create a sleep-conducive environment: Keep your bedroom cool, dark, and quiet. Invest in a comfortable mattress and pillow. Comfort is key when it comes to good quality sleep.\n\nJust before bedtime:\n\n* Stick to a sleep schedule: Try to go to bed and wake up at the same time every day, even on weekends. This can help regulate your body’s internal clock and make it easier to fall asleep and wake up feeling refreshed.\n* Wind down: Turn off the lights, unplug from electronic devices, and do some light stretching or deep breathing exercises to help calm your mind and body. It’s important to stay away from screens. The blue light emitted from electronic devices can interfere with your body’s production of melatonin, a hormone that regulates sleep.\n\n I’ve seen a big change in the quality of my sleep and in the productivity of my day by sticking to this routine. Give them a go and let me know how you find it.",
        "created_utc": 1675613636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moody crisis",
        "author": "IfallInLove2easily",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ug2wk/moody_crisis/",
        "text": "Few days ago I passed my first semester I was really focused on, so I went with my friends to the club and I met this girl and the mix of all this gave me more confidence and less anxiety when around people but there is a prize. Now, I only feel good while working out,  partying or socializing. In the meantime between I feel like there was something heavy on my chest, I feel a little void. On the other hand, before, I have felt really good on my own, but I was stressed as hell when around people. I 100% enjoy present state more as I actually can do things like I want to do without the fear of being judged, but the time spent alone is horrible. Is there a way to connect these two?",
        "created_utc": 1675613357,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I regain my attention span?",
        "author": "Chance-Conclusion-43",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ufm5l/how_can_i_regain_my_attention_span/",
        "text": "As a kid, I'm talking age 4-8, I could sit for HOURS focusing on a single task. I could read and write or play with my toys for hours without becoming distracted. I used to be able to enter a flow state when I read, so deep, that people would have to tap me on the shoulder in order to get my attention and I would lose all sense of time. \n\nI can't remember the last time that happened. Now I'm 18 and I have only a fraction of my previous attention span. Right now, I'm typing this post while watching a YouTube video at the same time. \n\nI want to go back to how I was before. I want to write fiction, and I need to be able to focus like I used to in order to write what I know I can. \n\nI have no idea how to train myself back into this state, though, especially in a society in which I am required to have a smartphone and be responsive to constant information flow at all times.\n\nWhat habits should I form to start repairing my attention span?",
        "created_utc": 1675612200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help. I keep having asthma symptoms after drinking alcohol? How do I prevent this?",
        "author": "TheClassicGeneral",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ufjj0/please_help_i_keep_having_asthma_symptoms_after/",
        "text": " Some background info : I'm 22, and I noticed over the past year I started getting symptoms of asthma after drinking alcohol. This didn't happen until the past year.\n\nI usually drink Captain Morgan and Coke with a lemon at the bar. I usually notice after a couple of these I'm starting to wheeze. I don't know why this is happening.\n\nMy current plan is to cut 15 pounds, stop drinking for a year, and take supplements like D3, Zinc, and Vitamin E daily.\n\nWhen I resume drinking, take Zyrtec and use Nasal Sprays in case this is an allergic reaction.\n\nWhat do you think is the solution to this? Are there any tips or supplements you have to prevent wheezing when drinking?",
        "created_utc": 1675612008,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to loose some belly fat and asked chat GPT for a gym routine",
        "author": "H_the-Human",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ufght/i_want_to_loose_some_belly_fat_and_asked_chat_gpt/",
        "text": "[removed]",
        "created_utc": 1675611788,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the single most important part of your morning routine?",
        "author": "jackispresent",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uf86g/whats_the_single_most_important_part_of_your/",
        "text": "I journal every single morning. It’s meditative, but also helps me clearly set my priorities for the day, making me more productive and focused. It’s been a complete game changer.\n\nWhat’s the single most important part of your morning routine?",
        "created_utc": 1675611188,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to balance everything",
        "author": "Sufficient_Duck9526",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ueqi5/how_to_balance_everything/",
        "text": "Had this question on my mind for a long time and wanted to find a way to solve this situation. Before I start I just want to state the fact that English is not my first language, so there will most likely be errors and strange sentences, and for that I'm really sorry. I hope that this fact won't compromise the objective of this post. Thank you so much in advance.\n\n&amp;#x200B;\n\nSo, I'm a 21 years old university student from Europe and I've been struggling with improving myself for a long time now. Since I remember I've always been good at school. I've never liked myself (both from a physical and mental kind of point, I think I'm extremely ugly and stupid, so that doesn't really help my condition) and so I put all my time in the only thing that worked for me, school. Right now , during the lessons period, I study all day long(I come home from university, I study until 23:30, and I go to sleep and wake up at 6:30 every day). I don't do anything else, many times I skip lunch or dinner because I think I don't deserve to eat a decent meal because I think I'm extremely dumb and I'm not studying hard enough. And this thing just prevents me from improving myself in any way, because I'm always stuck in this limbo.\n\n&amp;#x200B;\n\n2 years a go I started playing guitar, I saw small improvements in the first 6 months, I kept playing for a small period, then university started again and I stopped completely just do dedicate every single moment to study, so starting again would be almost starting from scratch. Same thing with physical training, I've always liked the concept of calisteniches, I've tried for a small period, saw no results, quit. I'm extremely skinny and quite tall, and I don't necessarily hate my body as much as I hate my intelligence, but having a not so bad body wouldn't be bad, of course.The strange thing is that for everything regarding school I'm completely obsessed and disciplined, I always drag myself to study even tho some times I would prefer to do anything else, but I know I must do it and it's the only way that prevents me from disliking everything about myself, which is kinda sad if you ask me.\n\nFrom the social point of view, the situation is exactly how you would expect it. Never had a girlfriend or anything even remotely similar to that(not a even a female friend). I have a good amount of friends which I know I can absolutely trust and, from that kind of view, I'm really lucky. I've talked to them about this problem and they always tried to help me, but I've never been able to keep me from returning in this loop.\n\n&amp;#x200B;\n\nSo, what would you do in my situation? What do you think I could do to improve this kind of toxic mindset? Thank you so much for taking your time to read this post!",
        "created_utc": 1675609923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looks",
        "author": "Chrinias",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ueofu/looks/",
        "text": "28M, I am average looking, so sometimes I look like nothing and sometimes fine, and because of this my brain can not decide what I look like...and I cant stop thinking about it! I am also constantly busy if people find me attractive and what they would rate me! Does anyone have tips how to deal with this?",
        "created_utc": 1675609777,
        "upvote_ratio": 1.0
    },
    {
        "title": "A quote I found really uplifting",
        "author": "Anoooooose",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uejbo/a_quote_i_found_really_uplifting/",
        "text": "\"*Maybe you are not able to do what someone else is able to do – so what. You do what you can do in the best possible way, and that is all that matters in life.\"* *- Sadhguru*  \n\n\nOften times I see my peers being more reliable than me and it makes me feel sad that at times I'm not  skilled enough to contribute to the team like the others. Kinda sucks but this makes me forget about the things I can do and take them for granted. Somewhere deep within myself I think even I have the potential to do what they can do but it kept bothering me always. When I read this quote, although sounds simple and straightforward, it felt like such a powerful reinforcement to my mental health situation. That even if I can't contribute much for now, I should focus on at the least doing what I can do best and eventually improve myself to do more. Thought I'd share this because it quite helped me.",
        "created_utc": 1675609404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disappointed in myself.",
        "author": "Equal-Professor1569",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uea8k/disappointed_in_myself/",
        "text": "I am 17M\n\nSince high school whenever I was about to speak in front of the class or give a viva I almost always used to get too nervous and insecure than anyone else. And just recently realized that things haven't changed much since then.\n\nA few days ago I had my final oral exam. And when it was my turn I got too nervous and wasn't able to give a proper answer when everyone was calm af\n\nNow I am in Junior college and still struggling with the same. \n\nI really want to fix this, before I fuck up my upcoming viva exams, any suggestions?\n\n(Sorry for bad english):",
        "created_utc": 1675608770,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help asap",
        "author": "DarkOpCODM",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ue46t/need_help_asap/",
        "text": "I been on self improvement from quite a while now in the beginning everything was going well and now during my important exams I'm starting to get on my bad habits again I'm not able to focus like I used to especially today for my important exam tmrw I genuinely am scared what's gon happen tomorrow I'm starting to get back to my addictions I had stopped watching porn when I got on self improvement but now I'm getting addicted again but I haven't masturbated it's just everything is pissing me off can someone help me out I genuinely need help on how to concentrate and not procastinate and stick to my word and finish I am supposed to do",
        "created_utc": 1675608327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I misinterpret those \"paradoxes of life\", as I call them?",
        "author": "Evening-Pilot-737",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ue3dn/do_i_misinterpret_those_paradoxes_of_life_as_i/",
        "text": "Paradoxes:\n\n1. If you want to be in a relationship, you should not be desperate but instead learn to not need a relationship. If you don't need a relationship anymore, you might get a chance. Ok but then I don't need it anymore, so why then bother asking out women? Especially as a men, who actively needs to search and ask out women. If I feel totally comfortable as single, a women only disturbs everything.\n2. If you feel lonely, you better learn how to not need friends. How to do all of the stuff yourself. Then you don't need friends anymore and can be alone for the rest of your life.\n3. If you are unemployed, you better learn how to enjoy all of the free time. Then, when you like all the free time, you probably don't want to search anymore and won't find a job either.\n\nDo I miss something here? This can't be how it works?\n\nI mean, searching in desperation never works well, no matter if job, friends or partner. But changing the very own needs that you don't need it anymore or even enjoy it, can't be the solution to desperation either.",
        "created_utc": 1675608270,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Habits for a Fulfilling Life",
        "author": "Specialist-Round-127",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ue28d/5_habits_for_a_fulfilling_life/",
        "text": " \n\n1. Prioritize self-care: Make time for activities that bring you joy, relaxation, and rejuvenation. This can be as simple as reading a book, taking a walk, or practicing mindfulness.\n2. Cultivate gratitude: Practice thankful thinking and keep a gratitude journal. Taking the time to acknowledge what you are thankful for each day can improve your overall outlook on life.\n3. Set and work towards goals: Having a clear direction and purpose in life can bring a sense of fulfillment and accomplishment. Set realistic, achievable goals and work towards them consistently.\n4. Build meaningful relationships: Invest time in developing strong, positive relationships with friends, family, and community. Humans are social creatures and having a strong support system is key to a fulfilling life.\n5. Give back: Find ways to give back to your community and make a positive impact on the world. Whether it's volunteering, donating, or simply being kind to others, helping others can bring a sense of purpose and satisfaction to your life.",
        "created_utc": 1675608190,
        "upvote_ratio": 1.0
    },
    {
        "title": "People trying to be overly optimistic",
        "author": "No-Confidence-4271",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10udr8i/people_trying_to_be_overly_optimistic/",
        "text": "Some people when I rant try to be overly optimistic, or say that it's not that bad, etc. Should I be angry at them for it? They said it's a mechanism to not be too depressed. But for me it's like denying reality. I think being angry for being too optimistic is maybe not right, or like people saying 'everything will be OK' maybe they just care about me and want me to be happy?",
        "created_utc": 1675607362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tracking app",
        "author": "Rich_Site_3158",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10udoii/tracking_app/",
        "text": "Hi, Do you have some good app for tracking goals, habits, financial goals, etc..? Thank you",
        "created_utc": 1675607152,
        "upvote_ratio": 1.0
    },
    {
        "title": "No identity or personality.",
        "author": "eerie_fondness",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10udmdj/no_identity_or_personality/",
        "text": "I legit think I have no personality. I’m not sure if I overthink this but I think there’s nothing there. I do enjoy some stuff like video games, writing, watching movies/series, reading, I’D like to tracer at some point but I think every trait of my personality is a copy of other people. Yes people tell me I’m funny but what if this is a stolen trait? Sometimes I catch myself acting like people I know or even fictional characters and it freaks me out not as daydream tho like acting up. And yes I do therapy. Any advice?",
        "created_utc": 1675606991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice : Think of your life as a second chance",
        "author": "Boummamouseliru",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10udg6k/advice_think_of_your_life_as_a_second_chance/",
        "text": "I came up with this little thinking exercise, which is also pretty fun! Think of your life as a second chance, thinking of the first life as a total failure, as a waste.\n\nYou can think that you got reincarnated and lost your memories or something.\n\nIt's a bit weird, but somehow it works for me, it motivates to make the best of my life thinking that I do not want to fail again.It makes you see things from a different perspective. Play with this thought idea, and see if it can help you.\n\nMaybe this can help someone else so I thought I might share.",
        "created_utc": 1675606535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions",
        "author": "Deathstroke_2-0",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10udehm/suggestions/",
        "text": "I feel stuck, every weekend I feel like I don’t really do anything…just stay indoors and don’t attempt anything",
        "created_utc": 1675606402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you part of the DRVN30 Challange from Leon hendirx",
        "author": "Asianneo00516",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ucwuj/are_you_part_of_the_drvn30_challange_from_leon/",
        "text": "[removed]",
        "created_utc": 1675605035,
        "upvote_ratio": 1.0
    },
    {
        "title": "So on my way to the gym I left my house in a t-shirt in -4 degree weather and drove with all the windows down with the AC on full blast and now I have a cold. Good idea or bad idea?",
        "author": "Ok_Sir4235",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uc4pd/so_on_my_way_to_the_gym_i_left_my_house_in_a/",
        "text": "I was watching David Goggins and he says we learn by suffering and doing things we don’t wanna do so that is why, I drove to the gym with no jacked on just a t-shirt and I rolled my sleeves up with all the windows down and the AC on full blast. I was doing this for about 15 minutes. But it felt great but now I have a cold.\n\nWas this a good idea or bad idea?",
        "created_utc": 1675602705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Media in a nut shell",
        "author": "intermediatezen",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ubziw/social_media_in_a_nut_shell/",
        "text": "\n“If you only wished to be happy, this could be easily accomplished; but we wish to be happier than other people, and this is always difficult, for we believe others to be happier than they are.” \n\nMontesquieu said this 300 years ago. We’re still working on this one.\n\n(Credit Tim Urban)",
        "created_utc": 1675602263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best workouts for resistance bands?",
        "author": "Confident_Mouse_8965",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ubkt5/best_workouts_for_resistance_bands/",
        "text": "Got the 150 pound set and not sure where to start. Thanks.",
        "created_utc": 1675600988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t I finish anything? Why can’t I get organized?",
        "author": "metaontologist",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ubgzy/why_cant_i_finish_anything_why_cant_i_get/",
        "text": "[removed]",
        "created_utc": 1675600617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hobby for improving concentration/mindfulness.",
        "author": "abudabiFabi",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ubbqv/hobby_for_improving_concentrationmindfulness/",
        "text": "Hi guys,\n\nAll my life I’ve been making mistakes out of my lack in focus. I sometimes just lose my focus and I feel like I can’t do anything about it. Though I am one of those persistent people that don’t give up and try to take matters to their own hands. Lately I couldn’t pass the driving test (I mean: several times). For that reason I know that I need to be extra careful but then I tend to focus on wrong things. It’s like: „ok I need to be careful with that” so I am but then I forget other stuff. It’s not only happening on driving tests but also in school/university and work. Belive me that it’s not me being stressed in this kind of situations nor I am distracted by social media (fg. TikTok) or video games more than others, it’s just me not being able to focus properly. I’m frustrated because I have this pretty much constantly and it’s been causing many dumb mistakes, failures and eventually stress.\n\nWhat can I do to improve my focus so I don’t forget things nor make dumb mistakes. I guess it’s not going to change right away so I’m thinking of some interesting hobby. Please help me, I’m really frustrated with this.",
        "created_utc": 1675600116,
        "upvote_ratio": 1.0
    },
    {
        "title": "How you can appear bossy and how to avoid/stop it",
        "author": "OriginalRecklessPark",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ub4ls/how_you_can_appear_bossy_and_how_to_avoidstop_it/",
        "text": "As a manager at 21, experience is not on my side. This has caused some naivety in my management style which I have been routing out. Have any of you been told you come across as bossy? What did you do if you have?",
        "created_utc": 1675599380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Developing Your Higher Self | Connect To The Universe Music | Manifest Anything Law of Attraction",
        "author": "floraclinton1200",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ub4cf/developing_your_higher_self_connect_to_the/",
        "text": "[removed]",
        "created_utc": 1675599356,
        "upvote_ratio": 1.0
    },
    {
        "title": "How you can be bossy without realising it and how to stop it",
        "author": "OriginalRecklessPark",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ub2kn/how_you_can_be_bossy_without_realising_it_and_how/",
        "text": "[removed]",
        "created_utc": 1675599167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I turn 30F soon and I’m ready for a change - any feedback on my self improvement plan?",
        "author": "ambitiouspandamoon",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uat1g/i_turn_30f_soon_and_im_ready_for_a_change_any/",
        "text": "[removed]",
        "created_utc": 1675598162,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm desperate",
        "author": "Competitive_Twist575",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uaq08/im_desperate/",
        "text": "[removed]",
        "created_utc": 1675597813,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m learning 2 new languages - any advice?",
        "author": "ambitiouspandamoon",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uak5v/im_learning_2_new_languages_any_advice/",
        "text": "I’m learning French and Spanish via Dulingo and I love it. I already am fluent in two languages but that’s due to growing up in a multicultural household. \n\nI really want to build confidence as remembering the words and phrases is good so far but I feel shy with the pronunciation. I don’t have anyone to practise with and I find the app easier than a tutor atm due to flexibility. \n\nShould I just keep going with the app or maybe incorporate something else? I really want to give this my all for 6-12 months (and beyond). \n\nThank you!",
        "created_utc": 1675597120,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I train myself to get up early on the weekends?",
        "author": "rh031222",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10uajs6/how_do_i_train_myself_to_get_up_early_on_the/",
        "text": "I’m currently working full time and studying for my masters which I finish in September. I’ve completed 5 out of 7 modules and I’m on track to get a merit grade which is the middle grade. I have also recently started up a YouTube channel and I try and go to the gym 3 times a week. Also, I’m on a low income, so I want to become a social media manager to have that as another income stream, so I’m trying to start doing social media content for my mum’s tutoring business. I’m using her as my first client so I can demonstrate that I have social media management experience.\n\nI realise that I have a lot of competing tasks to get done, and I realise that I need to wake up early on Saturdays and Sundays to get them all done.\n\nHowever I find it sooo hard to get out of bed early on the weekends! How do I train myself to get out of bed earlier? Today and yesterday I got out of bed at 10am which I realise is too late. I understand that going to bed early will help me wake up early, but on Fri night after work I went to the gym and bought my groceries and by the time I got home and relaxed a bit I didn’t end up going to sleep until around 1am. Yesterday evening after going to the library to study, I met a friend at 7:30pm to go to the theatre, so I didn’t get home until about 11 so I didn’t go to sleep until around 1am last night too.\n\nHow do I break this pattern and get out of bed earlier on the weekend so I can be more productive?",
        "created_utc": 1675597076,
        "upvote_ratio": 1.0
    },
    {
        "title": "great book free for a limited time",
        "author": "ContrarianEdge",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u9y15/great_book_free_for_a_limited_time/",
        "text": "[removed]",
        "created_utc": 1675594643,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get better at chores",
        "author": "Any_Print5307",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u9t72/how_to_get_better_at_chores/",
        "text": "I would like to get better at keeping my house clean. Right now, I let clothes and dishes like up and only clean my place when my gf comes over. But I've realized I feel better when my place is always clean. Any tips on this type of thing? I'm basically just overwhelmed by cleaning and very exhausted from work, so it's difficult to get things done.",
        "created_utc": 1675594097,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are a lot of discrepancies regarding the content of this sub, would you be interested in participating in a new one but more focused in positive development?",
        "author": "fspg",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u9ep1/there_are_a_lot_of_discrepancies_regarding_the/",
        "text": "[removed]",
        "created_utc": 1675592439,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel normal again. And you can too.",
        "author": "BabyYodaSippinSoda",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u8dcy/i_feel_normal_again_and_you_can_too/",
        "text": "22M. I’ve posted in this sub multiple times about my issues regarding escorts, pornography addiction, and low self esteem. It’s been a tough and embarrassing road to recovery, but I finally feel at peace mentally.\n\nLast year I had my horrible vices and weird thoughts exposed to my landlord and her family. \n\nAnd recently I’ve had the same thing happen as I was captured by cameras in my student residence when browsing shady sites and having vile porn open (it was from the night before)\n\n I’m now going viral on campus (and possibly around my city of Toronto) for being a freak/weirdo. \n\nPeople also had access to my personal accounts (since I’ve logged in on camera) and could see the messages I was sending to my accountability buddy.\n\n We’re just two dudes trying to stop being losers, but he’s from Reddit (stated in our convos) and we all know how society views Reddit users. \n\nThese experiences sucked absolute dick. Especially because I’m fully aware of my issues and keep them to myself. No one would ever suspect I suffer from these things, because it’s a battle I’ve tried to face alone\n\nIt sucks when you know you’re weird and fucked up, but it’s worse when other people tell you aswell. Additionally you know you’re a normal dude, but you’re just confused by years of negativity.\n\nThrough extreme embarrassment, I decided to move back to my hometown (where all my friends and family are) I haven’t seen my friends for 3+ years\n\nSince then I’ve been 3+ weeks sober from all sexual urges. I’ve managed to actually hang out with my friends without feeling scared. For once I feel comfortable. I see the world/my mindset for what it really is. I feel like myself again. I’ve opened up to family and friends aswell (who laughed their asses off and called me a weirdo lovingly lmao) \n\nI realized that although I was trying so hard to self improve, I was still overthinking things too much. I needed my friends to remind me of who I am, and how cool I am lol. I was isolated and alone for so long that I forgot  how many people love me haha I forgot how to enjoy life.\n\nIt sucks that majority of my campus/city think I’m a weird, sick, freak. Justifiable by my actions, but I just wish people understood that it’s more complex than that. I wish they understood that I was just trying my hardest. I wish they knew my interests, my goals, my personality…etc\n\nBut alas I feel like myself again and I love it. I will be moving back to my hometown and complete university online. During this, I’ll be self improving and reconnecting with my lost years of social activity.\n\n When I’m ready, the end goal is to try again in another city. This time I’ll keep contact with friends, but I will also try and make new ones.\n\nI just hope I don’t lose my really good job over going viral lol\n\nplease if you’re struggling, open up to somebody in real life. I could’ve saved myself so many life mistakes (losing my v-card to an escort for example) if I just got out of my head and got help sooner.\n\nFor all the young dudes out there who feel ugly, weak, worthless, unmotivated. Be with your friends/family. Tell them how you feel. Go to the fucking gym. Take care of yourself and Find your fucking purpose.",
        "created_utc": 1675588187,
        "upvote_ratio": 1.0
    },
    {
        "title": "It feels like I’m normal again. I feel human again.",
        "author": "BabyYodaSippinSoda",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u8abc/it_feels_like_im_normal_again_i_feel_human_again/",
        "text": "[removed]",
        "created_utc": 1675587855,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to live in the present?",
        "author": "IanVM36",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u87sb/how_to_live_in_the_present/",
        "text": "im 20. my first year of college was great, really great. i had more friends and hobbies than i’d had in my entire life combined, i fell into a relationship that felt too good to be true, i excelled in my classes as long as i put in effort.\n\ni hit 19 and my brain cracked like an egg. major surgery + breakup + alphabet soup of disorders basically destroyed my life before i even knew what happened.\n\nthings are getting better. agonizingly slowly. but every day i still think about that one good year and feel this hollow achey feeling in my chest and the urge to cry.\n\nhow do i let it go?",
        "created_utc": 1675587609,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel unfulfilled no matter what.",
        "author": "astronautego",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u7lh0/i_feel_unfulfilled_no_matter_what/",
        "text": "I have a good job and supportive family and friends. I work out several times a week, get plenty of sleep, stay generally healthy. But no matter what I feel lost. I don’t know who I am. I don’t feel like a good person. I don’t know what being a good person even means—just that I want to be it, but I don’t know how. I don’t know how to be happy with myself.",
        "created_utc": 1675585107,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you actually enjoy yourself? how do you be in the moment?",
        "author": "garbagemonkey81",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u7g64/how_do_you_actually_enjoy_yourself_how_do_you_be/",
        "text": "i never actually knew i was allowed to enjoy myself or that it was okay to have boundaries or even live my life for myself. i was taught it was selfish. i spent so long being afraid and trying to please others and i went down a super bad path and now i feel like i’m stuck. i don’t know what step to take or how to even enjoy myself. i’m 18 and i feel like i’m wasting the ripe years of risk taking and beginning my life. i was held back by my parents and now i hold myself back. i don’t know who i am or what i wanna do. i just know i don’t want to work a boring dead end job, i want to like actually create something. i don’t take care of myself properly i don’t enjoy anything anymore. i started getting back into art but it’s on and off. i just got out of a really toxic relationship and i feel hollow!!!!!! how do i let go of this limited mindset? how i begin to live life? how do i find joy in the little things again? i feel like this blank slate/chameleon state is just who i am now and i don’t like it. i want to be free. i want to laugh and cry, sing and dance, be able to enjoy my own company. i’ve been in florida my entire life i want to see new things. i want to experience. i want to be happy with what i did in life on my death bed. i don’t know what makes me happy. it’s so overwhelming.",
        "created_utc": 1675584514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toxic productivity",
        "author": "Beneficial_Visual694",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u6r7v/toxic_productivity/",
        "text": "Idk whats wrong with me. I need to sit and relax. I did so many chores today and still feel like a lazy bum. And I got a Friday job 1 hr  30 min away from me that I dont need. And then i wonder why i am stressed and anxious and clenching my jaw so hard at night from anxiety that my teeth feels numb in the morning.",
        "created_utc": 1675581841,
        "upvote_ratio": 1.0
    },
    {
        "title": "accepting and improving being a POS",
        "author": "YouKnowBroski",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u6odd/accepting_and_improving_being_a_pos/",
        "text": "I just got out of my first serious relationship of 10 months and it's killing me. I'm sorry if this is hard to understand its a sloppy situation. I've wanted to breakup with her for the past 6 months but also still loved her and didn't want to lose her. She did shit that caused distrust that she didn't know about and I never expressed said distrust. This caused me to act like 'a switch had flipped' where I loved her but wasn't in love with her. I spent less time and was less compassionate. Usually I would stay up into the am's to help her talk out her issues and calm down and feel safe. I started becoming this vile asshole who would ignore her issues and put them off for later dates or cut the convos short so I could get more sleep for work. I made her feel horribly unloved and depressed. For 6 months she suffered with me. I feel so horrible and so stupid because all I want is her. But it was so hard, I tried my best despite the world telling me not to be with her. I'm just so destroyed and I feel like the biggest piece of shit ever. She broke up with me and made me feel so worthless and like nothing mattered. She was so cold and the whole breakup was easy for her. I dont know what to do. I just want to improve so I can be better as a partner for her or whoever comes next.",
        "created_utc": 1675581537,
        "upvote_ratio": 1.0
    },
    {
        "title": "focus problem",
        "author": "InterestingBridge751",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u6dqz/focus_problem/",
        "text": "how can i overcome my distractions like social media and i starts feeling sleepy in doing studies pls help",
        "created_utc": 1675580430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! Looking to start a little self improvement/accountability group",
        "author": "20MinutesOvertime",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5vn1/hi_looking_to_start_a_little_self/",
        "text": "Hi! I’m looking for accountability partners/group. \n\nI have a few different goals, centered around general self improvement. I want to work on my health, physical and mental and my skills. \n\nI’ve set up a subreddit that can be marked as restricted/private if people want to communicate there. I thought it would be nice as I do shift work and we don’t have to instant message/wait for the other parties to be available and can post/vent whenever. \n\nIt’s r/oncemorefromthetop \n\nDoes anyone wanna start a little «accountability/support» group?",
        "created_utc": 1675578596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meds that made you feel like yourself again",
        "author": "CanadiannBoy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5pe8/meds_that_made_you_feel_like_yourself_again/",
        "text": "I’ve been struggling for the past 3 years of just absolutely hating myself and everyone around me. Every single thing that comes out of my mouth is blatant and rude and I don’t think before I speak anymore and my mood changes 45 times a day and some days I say fuck everyone else im the shit and then other days I’m like crying out for help. I have so many fucking things going on inside of me that I honestly have no clue what “illness” I have. Could be anxiety/depression/bipolar/BPD/ADHD/NPD/ etc etc etc so at this point I’m just wondering if anyone reading this has been in similar boat of “not feeling like themselves or feeling normal” and if/what medication has helped them. THANK YOU",
        "created_utc": 1675577964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self Love Affirmations",
        "author": "Art_vandelaay",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5mr3/self_love_affirmations/",
        "text": "[removed]",
        "created_utc": 1675577710,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to make new friends if I suffer low self steem",
        "author": "123Esloco",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5lbm/how_to_make_new_friends_if_i_suffer_low_self_steem/",
        "text": "[removed]",
        "created_utc": 1675577569,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I curb my want to use social media? and take advantage of the possibilities I'm now receiving.",
        "author": "lockweedmartin",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5gtu/how_can_i_curb_my_want_to_use_social_media_and/",
        "text": "I won't lie—social networking sites like Twitter and LinkedIn helped me find excellent chances.\n\nI also don't want to use social media, and I want to leave this.",
        "created_utc": 1675577129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling stuck, looking for advice for people who have experienced similar",
        "author": "GintendoBameNoy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u5ci8/feeling_stuck_looking_for_advice_for_people_who/",
        "text": "As the title says, I'm looking for some advice for getting out of a rut. \n\nTL;DR, Not sure what's causing the interference in my life and don't know what to do about it. I'm feeling lost and frustrated with how \"stuck\" I've become. \n\nFor some background, I'm in my early 20s and currently a university student on a leave of absence. Before feeling how I do today, I was really enjoying school and tearing through my courses. I was super passionate about what I was studying and where I was studying. I even had a student job that related to what I wanted to do as a full-time tech career. \n\nUnfortunately, things started to take a turn for the worse and I begun to lose momentum. I began to notice that I wasn't sleeping or eating right and I really wasn't enjoying lectures like i used to. Gradually, I struggled to focus in class and just felt dazed, confused, and exhausted a lot of the time. \n\nSo naturally, I started taking steps to try and get back on track. Watching what I eat, exercising every day of the work week, deleting social media, and going to sleep at a reasonable hour. However, none of this made me feel refreshed at all. If anything I feel like I was expending more energy than I was before. I would come home and just rest in bed until I was ready to do homework. Granted, I didn't do much homework or studying before falling asleep again. This heavily reflected on grades and I begun failing assignments and exams. This affected me to the point that I consulted a learning specialist and started seeing an academic coach weekly to see how I can find study habits and a routine that suits me best. Despite all this effort, I still saw failure, after failure, after failure.\n\nDuring this time, I unfortunately experienced a family emergency and took on the role of being a caretaker for a loved one. This was by far the most stressful thing I had to do in my life. I was still in school at the time and I was constantly worrying about the worst thing happening to them. I didn't stop once to think about how it was affecting me physically and it would prove to be nearly fatal for me. I began seeing a doctor to see what my options are for restoring my physical health but I have barely made any progress in doing so. I even began seeing a counselor for my mental health just in case it was more of a mental hurdle but I haven't really seen any beneficial changes.\n\nSo that brings me to today. I decided to take a break from school and try to recover physically and mentally. The thing is, I feel like doing absolutely nothing at all. I find very little interest in the things that I would devote a lot of time and attention to, things that would give me fulfillment. I'm overwhelmed with all this free-time that I struggle to do something mildly productive and/or relaxing. I still can't focus on one thing for more than a dozen minutes. I still feel like shit physically despite doing everything I can without overdoing it. It also doesn't help that I'm now unemployed when I have rent due next month.\n\nThere are still things that I want to do, things that I want to accomplish. Whether this is a physical health issue or a mental disorder, or both, it's just all very frustrating to me that I feel paralyzed. I'm not depressed but I sure as hell will be if I can't get a grip. I'm determined to get back on track but I really don't know where to begin aside my your typical self improvement advice.\n\nHere's what I know: I am prone to diabetes and hepatitis from both sides of my family. After some bloodwork, my doctor deemed that I do not have diabetes or hepatitis, however, my blood pressure is still relatively high (varies from prehypertension to stage 2 hypertension) for it be dismissed. In addition, I have blood relatives, including my siblings, that are officially diagnosed with ADHD, depression, and other neurodivergent disorders/illnesses. I've never been evaluated myself and my parents have always said that I turned out just fine. I'm beginning to question whether or not I have ADHD. I'll often hear of autistic and ADHD experiences and think \"huh, I also do that.\" I'm picking up on habits that I share with my siblings and friends but I'm still skeptical about it, I really don't want to self-diagnose myself. \n\nAt this point, I'm not sure what's wrong and I really don't know what to do. I'm really frustrated with feeling stuck and directionless. If there's anyone who's gone through similar, I'd really like to know how you got back on track.\n\nThanks for reading.",
        "created_utc": 1675576751,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I confront my superiority complex regarding my hobbies?",
        "author": "JuiceKe",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u40vl/how_do_i_confront_my_superiority_complex/",
        "text": "I have just been confronted about my tendency to diss someone else's likes and hobbies. I feel really bad because this is something that I do not consciously do. I sometimes make an effort to listen to them talk about these things but statements like \"\\_\\_\\_\\_\\_\\_\\_ is cringe\" sometimes slip out. I really love this person and I do not want them to stop talking to me about the things that they like and genuinely enjoy because I love seeing their excitement when they do talk about these things with me. \n\nI want to apologize to them. But I feel like I have to choose my words very carefully, else she'll end up only talking to me about our common likes and hobbies. I want to learn to stop viewing my likes and hobbies as superior compared to others' to not drive people away from me. This is not the first time I have been confronted about this, and luckily I have not lost any friends from this behavior so far. I just feel like I could have been much closer to them had I not dissed their likes and hobbies. Any advice is welcome, I really want to try and change this part of me.",
        "created_utc": 1675574853,
        "upvote_ratio": 1.0
    },
    {
        "title": "whenever a awkward situation comes up it feels like its eating me alive",
        "author": "IndependentDay9150",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u37yv/whenever_a_awkward_situation_comes_up_it_feels/",
        "text": "its been 24 h since this awkward moment took place &amp; its been eating me alive all day. so i was meeting w/ this girl for the first time &amp; we decided to smoke &amp; after tht get something to eat in the city. my tolerance is low so I smoked more than I should’ve &amp; my anxiety sparked. we’re sitting in the booth and i can’t seem to focus on anything bc my mind is panicking but i seemed to keep it together, i think? i wasn’t aware at all of what i was saying or doing &amp; our conversations were flowing but I would forget what we’re talking ab mid conversation bc im so in my head trying to calm myself down. i believe i was obviously shaking at one point but its literally like 15 degrees outside &amp; my body wasn’t operating like it would usually when im sober so i was cold the entire time inside. now she isn’t really talking to me. i hate being so self conscious &amp; it makes me feel like shit bc i’m caring ab what she thinks of me even tho she had no idea what was happening. what can I do to literally not care &amp; move past awkward moments.",
        "created_utc": 1675573883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Underrated self help book that I started with years ago",
        "author": "Grouchy_Worker681",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u24yu/underrated_self_help_book_that_i_started_with/",
        "text": "I have not heard anyone online or on reddit discuss the book “The Science of Getting Rich” by Wallace D. Wattles. This really helped me and I thought I should bring some awareness to it. It discusses very basic things as well as some more deep things that I think serves as a perfect reset and renew button for me. Anyways, if you’ve read it or plan on reading it, comment thoughts below!",
        "created_utc": 1675572608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im just so sick of myself",
        "author": "Necessary-Bench6687",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u1qsa/im_just_so_sick_of_myself/",
        "text": "Im 21 with no future planning, not good in studies, can't play any sports and i even suck in social skills, all i do is play games and hangout with my college friends who are just into studies but my vibes with them doesn't match, but i don't have any more friends either like i said i suck at social skills, my gf even left me , saying im too immature and skinny , well thats true but honestly i had tried many times to change myself but i failed every f*king time , \nBut this time i will no matter what ,will change myself i had enough, i started doing workout everyday and i have to be social or else its ruining my life , im just a depressed f*ck , my mother is a single parent, she's trying her best to provide for me and i can't let her down,",
        "created_utc": 1675572164,
        "upvote_ratio": 1.0
    },
    {
        "title": "I haven't invested in myself at all at 20, Can I still reach my potential?",
        "author": "SteamedOrange57",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u1ixx/i_havent_invested_in_myself_at_all_at_20_can_i/",
        "text": "It sucks to think bout if I did things differently as a kid that I'd be in a better place. I know I can get close but I wonder if I've permanently missed out on some aspects of myself because of messing around during those crucial year of my life.",
        "created_utc": 1675571735,
        "upvote_ratio": 1.0
    },
    {
        "title": "my anxiety has turned me into a procrastinator. I'm worried",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u1bpy/my_anxiety_has_turned_me_into_a_procrastinator_im/",
        "text": "\n\nYou know how sometimes the things we have to do or complete a task or something like meeting a person, but we just think and say oh I'll do it tomorrow because this feeling of anxious and anxiety or overthinking just gets to our brain. It's like I just want to be in a safe comfort zone. Which I do understand will eventually destroy our life and turn us into being lazy and weak minded. But I'm realizing this negative pattern of me doing this. How can I break this barrier and move on. How can I find that courage and not worry so much when it comes times to face a situation or complete a task.\nSome people say it's self improvement or creating a disciplined mindset. But with anxiety and not having that confidence it just feels like I'm trying to lift a mountain which is impossible.",
        "created_utc": 1675571394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-Help/Philosophy: The Wisdom to Attain Happiness and Success by Constructing an Invincible Mind",
        "author": "Skubydoo188",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u15ex/selfhelpphilosophy_the_wisdom_to_attain_happiness/",
        "text": "[removed]",
        "created_utc": 1675571077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Addictive personality.",
        "author": "eerie_fondness",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u0xo1/addictive_personality/",
        "text": "I’m very prone to addiction. I remember my teen years were literally only playing video games for HOURS every single day. I’m 21 now and I’m not playing as much. Books? As soon as I start something I can’t put it down, not saying I read a lot tbh but I know that once I pick up a book (especially if it’s smut) I won’t be able to stop reading and it will cause me anxiety, the only thing I will be interested in. Recently I found out I like writing so I started my first novel, all started well but as the story continued I found myself writing part after part like 3 hours in a row. Even when I drink alcohol I feel my insides wanting MORE. I have no idea how to hold myself and resist without feeling intense anxiety. It’s like my brain as soon as it finds a source of dopamine it says “YEP HERE WE ARE”. Help?",
        "created_utc": 1675570699,
        "upvote_ratio": 1.0
    },
    {
        "title": "16 yr female in search of hopefully good advice :)))",
        "author": "444_olivia_love",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u0s95/16_yr_female_in_search_of_hopefully_good_advice/",
        "text": "my name's olivia and i'm struggling a little bit. my younger childhood wasn't very healthy but i'll spare the details. the thing is i've been trying to get better for the past 2-ish years but i feel like every step forward is matched with 3 steps back. i was doing so much better november of last year through about 2 weeks ago. the main reason i come here seeking help is because tonight i got into it with my younger sister and my mom talked to me about it. my mom is doing so much better as a person and as a parent (in my past she was not very good parent-y) and after our conversation (i shut down in these situations because im used to her disagreeing with everything i say and using any honest stuff i say against me in future agruements) and i walked away confused i no longer no if i victimize and pity myself and i deny it or if my feelings are justified and im placing boundaries. i had an episode 2 nights ago where i was filled with so much anger and hurt that i couldnt breathe. i hide in my room on electronics when i get really bad mentally so that way i don't start issues in the family but some how it still happens. i usually talk to my grandma and youngest sister (not the one i fought with) whenever im upset or angry but i found out tonight that they tell some of the stuff i tell them in private to my mom. in middle school i was not okay and i realize that now. i was extremely upset all the time and thought about taking my own life often and my mom encourage my negitive behaviors and treated me like shit i can't sugar coat it. it was to the point i contacted cps (nothing came from the case) but seeing her be a fun healthy better mom to my other siblings just i just cant handle it and i feel bad because she's doing so much better i should be happy and i feel like i just ruin everything i feel lonely and unloved even when she states otherwise but she still never says sorry- see? i think im doing it right now. painting myself as a victim. its so confusing though because when i own up and try to say \"im fucked up, im untrustworthy and rude and angry and i cry too much\" my mom says im pitying myself but i think im just owning up to my mistakes. i am not healthy i try and try i just feel confused im not sure what to do next i meditate, do yoga, journal, read self help books, actively do self care and stuff that makes me happy im just so very lost. sorry if my rambles dont make much sense but any adivce/help will be very much apprecaited! (therapy is not a possibility- maybe? i might mentioin it to my mom anther day im not sure)",
        "created_utc": 1675570441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disappointed in myself",
        "author": "Equal-Professor1569",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u0kfa/disappointed_in_myself/",
        "text": "Feeling down\n\nToday was my 12 class final practical exam. After performing the practicals we had a viva, but when it was my turn i panicked way too much and forget what to answer, then the external examiner gave a few hints and then i remembered. But even so I was way too nerves. Everyone in the room was calm af during the viva. \n\nEvery time I was about give a oral exam in front of the teacher i was almost always too nerves.\n\nI want to fix this, i have been trying since high school now i am in junior college, and still struggling with the same thing. i feel like shit.\n\nCan anyone give me some tips regarding how to fix it?\n\n(Sorry for bad english)",
        "created_utc": 1675570069,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my ideas are worth a lot and this keeps me from making friends",
        "author": "CorrectPreference215",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10u04un/i_feel_like_my_ideas_are_worth_a_lot_and_this/",
        "text": "Title, and what I mean is I feel like I have really good ideas about investing, what the best plan to do for entering the computer science industry is, and really good approaches for many different things. It is hard to explain but: my philosophy and reasoning behind things are really good that I don't even have to convince anyone what I'm doing is the best and they will still be convinced that I'm doing the right thing. The problem is if I tell people how I think, they could become my competition, or only gain from me and then not even want to be my friend. so i think there's a few problems here to unpack but I'm not sure where to start.   \n\n\ni do want more friends but i don't want to be hanging out with bums, i know its a bit harsh but by bums, i mean people i feel like i have to constantly teach and explain different things to.",
        "created_utc": 1675568868,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am getting very tired of feeling anxious and hopeless",
        "author": "Alive-Doughnut2345",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10tzr9f/i_am_getting_very_tired_of_feeling_anxious_and/",
        "text": "I am seeing a doctor Monday morning because the health anxiety is very high right now and I’ve been withdrawing all week and it’s making me depressed as a result \n\nJust sucks I was doing so well. I was doing so much better and then BAM this hit me and now all I want to do is crawl into bed and never come out\n\nI cannot have this happen to me anymore. I cannot shake this mindset that if I go to the doctor and everything is not a-okay. Then I am a reject and a failure by default and nothing I do will matter and everything will become futile.",
        "created_utc": 1675567685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like a failure after watching a musical?",
        "author": "saitamasshinyhead",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10tzav9/feeling_like_a_failure_after_watching_a_musical/",
        "text": "Hey everyone,\nI (f22) just got home from watching a musical. Some of the stage actors were my age and even though I really enjoyed watching them I felt like a failure after comparing their achievements to mine. I used to do ballet and dance many years ago but I gave it up despite my family wanting me to continue. Sometimes I think about where I would've been if I just kept pushing myself etc. and everytime I see dancers/actors my age I envy them because I wish I would've put more effort into it like they did/do. I thought about starting to dance again but instead of doing that I started Uni and put my everything into my studies. I got my Bachelors degree last year and while that is an achievement on its own it doesn't fulfill me at the moment. I just feel like I could've done more in the creative/active field of life.. \nDo you guys have any tips for dealing with this mindset or to even improve it? I really don't know what to do (at the moment and with my life in general) as I feel like I'm running out of time..",
        "created_utc": 1675566298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m addicted to debating people online! How to stop???",
        "author": "Individual-Ask-1119",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10tz7um/im_addicted_to_debating_people_online_how_to_stop/",
        "text": "For the past few years now I have had an addiction to debating people online, primarily through Youtube comments. I do this because I tend to have pretty unpopular opinions, and people liking them and agreeing with them validates them and makes me feel better. But this has caused me to obsess over it, which distracts me from more important things. Every few minutes or so I think about that one guy I was debating and check if he replied to my response that I spent 40 minutes typing and to see who has the highest number of likes.\n\nThis is how bad it’s gotten. I want to learn how to not bait myself into wasting time debating people randos online and how to not get triggered over no one agreeing with my opinions. Does anyone have any tips on how I can step away from this?",
        "created_utc": 1675566038,
        "upvote_ratio": 1.0
    },
    {
        "title": "why are we like this?",
        "author": "Connect-Guess291",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10tybaq/why_are_we_like_this/",
        "text": "Why did we end up like this man? Nobody cares about another person,all people wanna do is upload stories and content from their trips and night outs,showing off with expensive bottles and that kind of shit.Instagram and all the social media platforms are conquering our lives,I think that we don't value our moments anymore like everything seems simple and boring we are not grateful for the things we have and we always want more.I want to get out of this and I will begin a challenge for myself and if you want you can join too for the first week of the challenge I'm gonna use social media platforms 1 hour each day for a week and I mean not each one 1 hour for everything end if I manage to do that I will lower my time for social media more.I want to change and this is the first step.Much love everybody.",
        "created_utc": 1675563388,
        "upvote_ratio": 1.0
    },
    {
        "title": "My journey in doing 100 push ups every day for 30 days",
        "author": "Majek340",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10ty7tf/my_journey_in_doing_100_push_ups_every_day_for_30/",
        "text": "I am currently 13 right now and I way around 79 kg which is 174 pounds. I used to do push ups daily but then stopped and I became more lazy and did less physical stuff and I started eating and gaining more weight. I tried some work outs here and there but I lost motivation and stopped, But im gonna start forcing my self to push my self even more and not sit there playing video games all day, eating junk food, and fapping. See you in 30 days, Wish me luck.",
        "created_utc": 1675563112,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Hamza Is Manipulating Millions of Young Men",
        "author": "moralconsideration",
        "url": "https://www.reddit.com/r/selfimprovement/comments/10txzgt/how_hamza_is_manipulating_millions_of_young_men/",
        "text": "[removed]",
        "created_utc": 1675562442,
        "upvote_ratio": 1.0
    }
]