[
    {
        "title": "Is it pain of discipline or pain regret?",
        "author": "Flan-Much",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j2ld6/is_it_pain_of_discipline_or_pain_regret/",
        "text": "**The pain of discipline is most certainly a better one than the pain of regret**",
        "created_utc": 1678036083,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've had enough",
        "author": "HooverClapped",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j29vu/ive_had_enough/",
        "text": "I want to be the best version of myself. I'm at a shit place right now. I want to get better and fast, really fast. I've had enough of this shit. How do I go about it?",
        "created_utc": 1678035744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shopping advice?",
        "author": "Not_Pilones",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j1hod/shopping_advice/",
        "text": "I have officially lost around 35 lbs (175-140) but now all I have are oversiz d clothes that barely fit me. I have been rocking with the oversized sweaters but now I'm looking to change my style. Online stores have better clothing options that I like but the problem is I don't know how to properly measure my clothing sizes. I don't want to get too big or too small but idk how to measure properly. Also could I get any online store recommendations? I don't want to keep wearing my oversized bed clothes lol.",
        "created_utc": 1678034293,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get rid of driving anxiety; Been driving by myself for more than a couple months now",
        "author": "bestmeburn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j1bvg/how_to_get_rid_of_driving_anxiety_been_driving_by/",
        "text": "\nI just recently started driving more often last fall for my commute to classes and I wouldn’t say i’m a bad driver at all, I’m just decent i’d say, but i just sometimes get anxious sometimes still about things such as parking, or switching lanes in moving traffic, or if i’m gonna take too long in a stop sign and get beeped at for missing open looks, or if the roads just confuse me sometimes and i do something wrong\n\nI still get anxious pulling up to college sometimes  and making an driving error in front of people since i go to a commuter school and i know these people. It’s to the point where i don’t even park next to anyone in the parking lot , and i just don’t wanna do some bad parking or take too long to park when theres other cars behind me too, so i just park back and walk further.\n\nWhy do i experience this anxiety about driving sometimes?",
        "created_utc": 1678033919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing About My Journey To Self Love, And How It Changed My Life and My Career",
        "author": "vicki_davitashvili",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j197i/sharing_about_my_journey_to_self_love_and_how_it/",
        "text": "Self love is not easy but it is simple. Its at the crux of the relationship that we have in our lives but most importantly it's at the heart of the relationship that you have with yourself. It's also what is behind the feelings of self-confidence and self-worthiness and the energy with which you show up in this world.\n\nAfter so many people had reached out to me about how I changed my life, my job, even my friend circle, I finally created a video to share about what I've learned thus far on my journey.\n\nUntil a few years ago, I was struggling with getting promoted at work, I felt deep loneliness inside even though I was constantly surrounded by people, and I had this inexplicable sadness inside, the feeling that something was missing, but I had no idea what. On the outside, it seemed like I had a great life, but on the inside something was definitely lacking.\n\nWhen I could no longer hide all that was coming up for me, I knew I needed to do something, but I was so lost. I didn't know where to start.\n\nSo I started by:\n\n1. Go on a journey of self-inquiry. Get really curious about the feelings that are coming up for you. Are you sad, angry, frustrated, feeling empty inside, lacking self confidence, feeling not good enough? If so, these are all \"self worthiness\" patterns. You may uncover that other feelings are also coming up for you. What's critical at this step is that you're brutally honest with yourself. \n2. Radically accept where you are. This is very important. Simply accept that you are where are you are. By accepting what is just as it is, you will stop rejecting and suppressing what's truly hiding underneath your feelings and thought patterns. When you see what's there, accept what's there, you will feel great relief. And don't judge the emotions and thought patters. They're not good, and they're not bad. They just are. Don't judge, and don't deny. You can only heal what you see. You cannot heal what you're not even aware of.\n3. Get curious. Why are these emotions and thought patterns are there? Do they go back to your childhood? Is there a story that you're holding on to about yourself? For example, is your story that you're not smart, or you're not ambitious, you haven't achieved enough, you're not successful, and so forth. Whose definitions are those? Are they truly yours? Or is this something you picked up from society or the outside world? Did you create a story about yourself based on the outside world, instead of creating your own story and owning your own story. DO NOT GIVE AWAY YOUR POWER! No one can control how you feel about yourself or how you choose to live your life. You choose how you live and how you feel about yourself. It's truly a choice. I know it doesn't feel like it is, but it is. \n4. Change your story. Think about it....is rain good or bad? It's your perception of it what's creating that story. In actuality it's just water. So what's your new story? What do you want it to be? Write it out. Feel what it would feel like to live that story.\n5. Make desired changes in your life. Take small steps every day to get closer to the life you want to live. But do it in an energy of self worthiness, not self doubt. Believe that you can, and you will.  \n\nKEEP GOING! You can and will do it!",
        "created_utc": 1678033761,
        "upvote_ratio": 1.0
    },
    {
        "title": "ESCAPE THE MATRIX, OR STAY A SLAVE | Motivational Video",
        "author": "RedPillled",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j183i/escape_the_matrix_or_stay_a_slave_motivational/",
        "text": "[removed]",
        "created_utc": 1678033693,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAILY AFFIRMATION:",
        "author": "ManifestMindset101",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j14rt/daily_affirmation/",
        "text": "I am capable and strong enough to handle any challenges that come my way. I trust in my abilities to overcome obstacles and create the life I desire. Today, I choose to focus on the positive and be grateful for all the blessings in my life. I am worthy of love, success, and happiness, and I will work towards achieving my goals with confidence and determination.",
        "created_utc": 1678033487,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t keep living this life anymore. I’m sick and tired of being sick and tired",
        "author": "thelostburner",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j13bg/i_cant_keep_living_this_life_anymore_im_sick_and/",
        "text": "I’m a 23 year old guy who has subjected myself to easy dopamine hits my entire life. I kept thinking “it’s okay because i have so much potential I will reach one day” well guess what… Potential is just that, POTENTIAL. I’m not guaranteed to have a better life at some point, I have to go and make a better life for myself. Potential is worthless if we go our whole lives never touching it.\n\nI don’t have a plan yet, I don’t have a strategy yet, I just know I CANNOT LIVE THIS LIFE ANYMORE. i feel gross every day. I isolate myself from peers. I don’t eat enough. I workout SO inconsistently. and i sit in front of a screen for 90% of my waking hours. There has to be more to life than this, this has to change…",
        "created_utc": 1678033394,
        "upvote_ratio": 1.0
    },
    {
        "title": "I struggled with self control for years until I discovered these tools. (Discipline Cheat Codes)",
        "author": "Disciplineking",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j0zj2/i_struggled_with_self_control_for_years_until_i/",
        "text": "This is my complete list of mental tools I apply daily to:\n\n**Perform tasks I genuinely do not want to do.**\n\n**Resist things I desperately want to do.**\n\nTable of contents:\n\nPart 1-\n\n* Meditation       (Discipline mini-workout)\n* Motivational Awareness  (Discipline Fuel)\n* Adaptive Denial       (Discipline Placebo)\n\nPart 2-\n\n* Urge Surfing         (Discipline Lane Assist)\n* Chunking              (Discipline Rep Assist)\n* Shame-free Analysis       (Discipline Muscle repair)\n\nI should note prior to attempting these, I highly recommend applying these for a MINIMUM of 30 days, like going to the gym, **if you quit when you don’t have a 6-pack in a week you have unrealistic expectations**.\n\nDo it for 30 days, I guarantee you’ll see results and thank me.\n\n*Mediation*\n\nI used to hate meditation, then I saw so many people I admired doing it, and I kept hearing about it in peer reviewed studies so I tried it out.\n\nThis is what happened:\n\n* I became aware of my cravings, but became aware I didn’t need to follow them.\n* I’d feel powerful emotions, and not react to them.\n* I was more present in my daily life and my interactions with others improved.\n* I started sleeping better and worrying less.\n\nHow to do it: Literally for just 10 minutes every morning after you wake up, or as long as you can tolerate up to that, sit and try to focus on your breathing. When you notice yourself following a thought trial, gently, without criticizing yourself, come back to the breath. **Overtime you get thought control and once you can control your thoughts, you can begin controlling your life.**\n\n*Motivational awareness*\n\nI used to skip the gym consistently, that was until I identified the proper motivation. For me that was the awareness I lost someone I loved very much because I was a couch potato, glutton, and destroyed my self esteem.\n\nSo going to the gym = self esteem, health, and romantic success\n\n*Determine what you would miss dearly if you lost it?*\n\n*Something you’d be other the moon if you acquired?*\n\n*Look at who you envy, what do they have?*\n\n*Is there a way you can connect your goals to that desire?*\n\n**If you can do this you tend to stop making excuses and find a way through most of the obstacles you face in your life.**\n\nAdaptive denial\n\nThe brain is an extremely stupid organ\\*\\*. It will in fact believe whatever it hears if repeated enough\\*\\*, this is why advertisers bombard us with the same message 1000x even though we’ve already seen their commercial and didn’t care.\n\nYou can apply this to your own growth though, literally just practice saying what you want to be true to yourself daily.\n\nFor 26 years I was skinny and unathletic, I was the kid that failed PE.\n\nI knew I could NEVERRRRRR get ripped.\n\nThen one day I read psychocybernetics and decided to try out what the plastic surgeon delineated.\n\nI said: “DK you’re yoked.”\n\nWeek 1: This is bullshit, I’ll never be yoked.\n\nWeek 2: We’re still skinny\n\nWeek 6: Still not yoked\n\nWeek 10: Wtf is that thing in the mirror?\n\nWeek 24: Bruhhhhh you starting to get yoked.\n\nWeek 60: I no longer have to manually tell myself I’m yoked, people tell me.\n\nWhen you lie to yourself long enough, the internal lie eventually becomes spoken by those around you.\n\nI’ll post part 2 tmro, I hope you guys enjoyed this.\n\nDo you have a discipline stack, what does yours include?\n\nLet me know if you have any questions or if I can help you with a goal that you’ve been struggling with.\n\nDK-",
        "created_utc": 1678033159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy, Buddhism and casual reading made me happier",
        "author": "BigBrasian",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j0y8i/philosophy_buddhism_and_casual_reading_made_me/",
        "text": "Ever since I got into those three things the past few months I’ve been a lot happier. The first two changed my outlook on life, and I’m still learning more from them.\nCasual reading has helped my attention span so much, plus it got me back into the hobby of writing again!\n\nI didn’t think these three would impact my life the way they have. Would highly recommend!",
        "created_utc": 1678033080,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who struggle with Self-Control. (Discipline Cheat Codes)",
        "author": "Disciplineking",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j0qbe/for_those_who_struggle_with_selfcontrol/",
        "text": "[removed]",
        "created_utc": 1678032590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just making a self update post :)♡",
        "author": "Dreyden55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11j0398/just_making_a_self_update_post/",
        "text": "[removed]",
        "created_utc": 1678031039,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you maintain self esteem while being legitimately criticized?",
        "author": "booksguitars",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11izp7j/how_do_you_maintain_self_esteem_while_being/",
        "text": "I struggle with self esteem, and I’ve learned that other people’s feelings about me can’t dictate how I feel about myself. I’m particularly vulnerable to this when the criticism comes from a loved one. At the same time, there is such a thing as healthy guilt, and some criticisms are warranted and useful for growth.\n\nHow do you tell the difference without spending hours analyzing the situation?",
        "created_utc": 1678030027,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I learn debate?",
        "author": "BogStonkyPeto",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11izlsx/how_do_i_learn_debate/",
        "text": "I've heard that it's really good for my confidence, self expression oracy skills etc., but I cant find anything online? maybe im not searching the right thing...? \n\nI've always felt like i had a hard time expressing myself or reacting the way i want to in conversation, and i want to get better at it! I talk to lots of people but I still feel kinda lost or behind a lot of the time, and I feel like I react too quickly to what folks are saying\n\n\nplz let me know if im in the right/ wrong sub ':)",
        "created_utc": 1678029782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just making a self update post :) ♡",
        "author": "Dreyden55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11izeip/just_making_a_self_update_post/",
        "text": "[removed]",
        "created_utc": 1678029243,
        "upvote_ratio": 1.0
    },
    {
        "title": "my gf broke up with me today. what to do not to fall tu depresion?",
        "author": "zajide",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iyzi1/my_gf_broke_up_with_me_today_what_to_do_not_to/",
        "text": "Hello, 27m here. Today, i got dumped. We are still sharing the flat we bought last year. The breakup was without isues. I just asked why that happened. This is because we have different social lives. im mostly loner, which prefers to go out into nature, she want to be social with friends. And that destroyed her love for me. What to do? What not to do? How i can improve myself from this pain?",
        "created_utc": 1678028112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Training carrer",
        "author": "Altruistic-Craft1121",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iywks/training_carrer/",
        "text": "Hey,\n\nI work as a call center agent, and now I am applying for a trainer position in my company. As a promotion. \n\nI worked as an Italian instructor, so I kinda know how to deliver info for people, however I wanna be well prepared for this post. \n\nAny recommended videos or websites that help me?\n\nIf anyone has been a trainer themselves, what advice do you have??\n\nThanks",
        "created_utc": 1678027879,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point do you accept self improvement has failed?",
        "author": "gcig007",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iydjx/at_what_point_do_you_accept_self_improvement_has/",
        "text": "Or that you have (somehow) failed self improvement (which sounds ridiculous). And consequently give up?\n\nAfter all the hard work, the continual effort of \"self improvement\" with no or minimal results or even regression, when does one give up?\n\nWhat is the point of continuing when results are bad, isn't that insanity? Doing the same thing over and over again, expecting another result.",
        "created_utc": 1678026371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is lots of eye contact actually normal?",
        "author": "FaZeRigby",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iy7kg/is_lots_of_eye_contact_actually_normal/",
        "text": "I've been working a lot to improve myself and get better at studying and learning and fitness and mindset and all these things and I think I've made good progress, but something I've never really thought about is my social intelligence. I've always thought myself to be a fairly personable guy and socially capable right, like I'm not a complete introvert I like to think I'm capable of starting conversations with random people sitting next to me and hold conversations about our interests, but something I've never paid much attention to is eye contact. I realized lately that I never really hold eye contact with people for more than like five seconds at a time, I'll like glance next to them or something and it won't be constant eye contact essentially. Is that not normal? To me, constant eye contact feels weird and almost creepy, but some youtube videos are saying that not being able to hold eye contact is like a sign of insecurity, I'm not sure if I'm going about my social interactions wrong then?",
        "created_utc": 1678025894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good Nonfiction Books",
        "author": "thebeautifullynormal",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ixvkb/good_nonfiction_books/",
        "text": "That are not self help books. \n\nI don't need anything that is about productivity or changing your life.  I just want books that will add to my knowledge base.",
        "created_utc": 1678024939,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not lose hope?",
        "author": "Whatzup_7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ixs5n/how_to_not_lose_hope/",
        "text": "I feel like giving up. I have tried everything and anything to improve myself but everytime I take one step forward, I take two steps back. Ive put so much effort and thought into improving myself but nothing changed. i feel fucking useless because of that. everyone around me has moved on in life without me whilst i'm still struggling to convince myself that my situation will ever get better. In school, i'm just some joke that everyone laughs at. no matter what ive done, no one has ever respected me enough. I feel out of options and i should just kill myself to get out of this. what should I do and how do i not lose hope?",
        "created_utc": 1678024701,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not lose hope",
        "author": "_BlackoutYT_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ixqh8/how_to_not_lose_hope/",
        "text": "I feel like giving up. I have tried everything and anything to improve myself but everytime I take one step forward, I take two steps back. Ive put so much effort and thought into improving myself but nothing changed. i feel fucking useless because of that. everyone around me has moved on in life without me whilst im still struggling to convince myself that my situation will ever get better. In school, im just some joke that everyone laughs at. no matter what ive done, no one has ever respected me enough. I feel out of options and i should just kill myself to get out of this. what should I do and how do i not lose hope?",
        "created_utc": 1678024570,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think it's time for therapy..?",
        "author": "LongboardingLifeAway",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ix680/i_think_its_time_for_therapy/",
        "text": "Let's take that goddamn step. I'll go to the psychotherapeutic advisory centre of my university. Just gotta make an appointment and all that.\n\n\nI'm so scared. Literally. So. Fucking. Scared.\nBut the anxiety is killing me. I'm still so anxious in so many social settings. I avoid A TON of situations because they scare me. It affects my relationships with people. I overthink, I can't sleep at night cause I ruminate, I don't get important things done cause I panic and I've picked up some very harmful habits from the past. And I don't want to accidently trauma dump on my friends (already kinda did that, not cool)\n\n\nAfter uni it's going to be so much harder to find help and I'm 24 so the \"personality is almost entirely formed\" (I know it isn't the end but yo that's scary).\nBesides, not knowing what's gonna happen stresses me out. I've known this stuff since I was 15, it's familiar, it's what I've known and it's what I've lived with since then. Will things change fast? Will it take a while?\n\nPart of me wants change instantly, another part is scared cause I have no idea who I am without this. It's been part of me for 10 years now.\n\nI'm also scared that I'll have to wait an eternity to get an appointment. My feelings and mental state change so fast, what if I'm \"Okay\" again at the time of the appointment??\n\n\"I wanna be fixed in one session but I also don't\".\n\n\nI managed to get out of some really bad mental health situations (eg. recovered from an eating disorder) by myself, without help, which made me believe I don't need therapy cause \"I've managed to solve those problems on my own in the past, why get help for a \"less severe\" problem now?\"\n\nBut I guess I'm ready. At least I hope so. I hope it isn't just words this time.",
        "created_utc": 1678022973,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started my self improvement journey months ago but I can't help feeling like the time before that was wasted. Does anybody else feel like this?",
        "author": "Volamdander",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ix4xc/i_started_my_self_improvement_journey_months_ago/",
        "text": "It's already been several months since I seriously put my mind into improving myself, and even though the progress has not being linear and perfect, I still am quite content with what I have done.\n\nI am reading a lot, taking better care of my hygiene, getting exercise 4/5 days a week and working on the novel I always dreamed of writing. I am also spending more time with people, I did an internship and going to therapy after spending my teenage years in depression and social anxiety (I'm in my early 20's now). I am happy about the progress I've been making but sometimes I can't help feeling that I should've started way sooner.\n\nMost of the time I feel proud of myself but some days I just can't stop kicking myself for wasting precious years of my life staying in my room all the time and talking to (shady) people online, thinking this would fullfill my need for friendship. I felt like it did at the time, but looking back on it now it's clear I was very lonely and never actually tried to socialize and get better.\n\nDoes anybody else feel like this? I know I just have to accept what my past has been and move on, and most days I can carry on just fine, some other days though I am eaten by guilt and feelings of remorse. I feel so ashamed of myself it almost hurts physically.\n\nI guess I just wanted to get this out but I also want to listen to other people's experience, so if you want to share or have any advice for me I'd be very happy :) Thank you for reading all of this mess lol",
        "created_utc": 1678022865,
        "upvote_ratio": 1.0
    },
    {
        "title": "You do not interact with what is you.",
        "author": "Ner0reN",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ix3rw/you_do_not_interact_with_what_is_you/",
        "text": "You do not interact with yourself.  \nIf you see yourself as a separate being, then you will never realise that everything is one.  \nTo interact is to connect with yourself, and why do that when you can simply be one.\n\nYou do not interact with people.   \nIf you see people as a separate beings, then you will never realise that you are a part of them.  \nTo interact is to interact with yourself, and why do that when you could simply be.\n\nYou do not try to live with your trauma.  \nIf you see the trauma as separate from your identity, then you will never realise that it is part of you.  \nTo overcome the trauma is to overcome yourself, and why do that when you could simply be who you are.",
        "created_utc": 1678022771,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to do a lot of things but do none",
        "author": "Motsickers",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iww5f/i_want_to_do_a_lot_of_things_but_do_none/",
        "text": "Hey there self improvement subreddit, i am a 22 years dude that has a question that i hope to solve: I have a lot of plans/things i want to do/hobbies i want to do/books i have to read; but, do none, why is that? I have a ton of things to do/want to do but at the same time do none and i just procrastinate a lot, it has been going on for months now, if not years.\nHow can i make the change? How can i flip the switch and say “ok i’m done, let’s do the things” ? Help",
        "created_utc": 1678022131,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop gaming addiction",
        "author": "ExeWarrior199",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iv6gw/how_to_stop_gaming_addiction/",
        "text": "If you guys remember from my game skins issue, I finally got passed that. Now I need your help with my game addiction. I try to do something else like reading a book and exercising, but I keep returning and play until late at night. And I can't get rid of my setup, I need it formy actual school work. Got any tips?",
        "created_utc": 1678016629,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might be ugly",
        "author": "Alive-Doughnut2345",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iv0vf/i_think_i_might_be_ugly/",
        "text": "I’ve never been called ugly\n\nI’ve been called the opposite. Multiple times\n\nBut that doesn’t necessarily make it a universal truth. I know I certainly don’t meet the highest male beauty standards. \n\nI’m convinced that im ugly. I often thought I wasn’t, but now im not so sure. How should I navigate these feelings",
        "created_utc": 1678016063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement",
        "author": "Beneficial_Stand5927",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iuz6q/self_improvement/",
        "text": "I’m looking for books/courses/articles/videos to help with improving clarity of thought and how to structure things.",
        "created_utc": 1678015896,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I learn to describe my emotions?",
        "author": "Alarming-Shame-11",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iuqnx/how_can_i_learn_to_describe_my_emotions/",
        "text": "Hi everyone, I'm not sure this is the right sub but I think this can help someone else too.\n\nI am in therapy with a great therapist and, after fixing other issues, we are now starting to explore emotional stuff.\n\nEvery time she asks me \"what emotion are you feeling now?\" I become stupid and I don't know what emotion I am feeling, I don't know how to describe what I am feeling and even simple things like \"compassion\", she asked me what does it mean compassion and I went blank, zero word came out my mouth.\n\nI always thought of myself as an emotional person but this is making me question everything.\n\nHow can I improve my emotional vocabulary and my understanding of emotions in general?",
        "created_utc": 1678015075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficulties of an authentic life pt 2",
        "author": "Outlier_mentality",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iujl5/difficulties_of_an_authentic_life_pt_2/",
        "text": "This was supposed to be a precursor to my previous post....\nAccording to Ernest Becker, we receive self-esteem by following the standards that are inherent to our social role within the \"world of meaning\" that we believe in. The role of self-esteem, Becker argued, is that of a defense mechanism against the anxiety that awareness of death otherwise produces in us. This leads to most people living lives of following an ideology that gives them a role in a \"world of meaning,\" which amounts to an inauthentic life.\n\nHowever, at some point in our lives, we all face an identity crisis. We are faced with a choice. We can continue living the same way we've been living up to that point, which means living our lives according to society’s expectations of us.\n\nThe second choice is that of creating ourselves and our lives. It is deciding what kind of individual we want to become based on our values, beliefs, and standards, creating our own authentic version of what a \"person of value in a world of meaning\" is.\n\nEven though choosing to live an authentic life seems like a superior and ultimately more rewarding path, it is a path chosen by few. But why?",
        "created_utc": 1678014395,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I increase my productivity",
        "author": "hxkxnbones",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iuby3/how_do_i_increase_my_productivity/",
        "text": "I often find myself on days not being productive enough with my time, what are some ways to increase my productivity?",
        "created_utc": 1678013663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello",
        "author": "Civil-Set537",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iu8rz/hello/",
        "text": "I want to do something - write music, exercise, etc, but I am too tired, thus I can do neither. Although when I simply go take a break I feel ashamed and unsatisfied. How do I get out of this spiral?",
        "created_utc": 1678013362,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOMEDAY...",
        "author": "FlourishGrow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iti7d/someday/",
        "text": " Someday, someday, someday-BLAH-BLAH-BLAH---**SOMEDAY** I will become an entrepreneur, **SOMEDAY** I will become a youtuber, **SOMEDAY** I will be an athlete.YET this \"someday\" never comes.We just tell ourselves that someday we will do this and that, and then one moment later we already forgot.**What if we do it though?**\n\n##### WHAT WOULD HAVE CHANGED?\n\nWould you be an entrepreneur if you committed to it?\n\nYou know the answer to that one.\n\nThen what are we missing.\n\n**WHAT** is holding us back from becoming one? What is holding back our dreams. Like we have everything right? \n\nWe will *SOMEDAY* live our dreams.   \n\n\nYES your dreams are real, but there is one big wall before them.  \nTell me in the comments if you want to know how to overcome that wall.",
        "created_utc": 1678010777,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I feel okay being alone?",
        "author": "Quick-Witness-743",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iteid/how_do_i_feel_okay_being_alone/",
        "text": "I want to make connections with other people, but doing so feels impossible. How can I feel content with just myself in the long term? Does anyone here have any experience in achieving that?",
        "created_utc": 1678010437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one is self love? When you want to follow your dream but you have to experience a lot of shit, you give up and live in peace or endure the shit and keep following the dream?",
        "author": "bisgor",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11it7tc/which_one_is_self_love_when_you_want_to_follow/",
        "text": "Which one is self love? When you want to follow your dream but you have to experience a lot of shit, you give up and live in peace or endure the shit and keep following the dream?",
        "created_utc": 1678009788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Yoga For Self Awareness course",
        "author": "JournalistFearless28",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11isgiu/online_yoga_for_self_awareness_course/",
        "text": "[removed]",
        "created_utc": 1678007082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am i so awkward (29F)",
        "author": "bamboozled568",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11irw7x/why_am_i_so_awkward_29f/",
        "text": "It’s hard to keep conversations going at work. I suck at small talk and am so awkward. I often stay quiet to avoid socializing because i just don’t know how. I seriously feel like i need help with how to create lasting friends",
        "created_utc": 1678005032,
        "upvote_ratio": 1.0
    },
    {
        "title": "What activities should I do to feel like a human again?",
        "author": "Teripendiicecreamyum",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11irjie/what_activities_should_i_do_to_feel_like_a_human/",
        "text": "-I work 14 hours a day for 5-6 days a week to pay back debt. \n\n- I do workout 3-4 times a week. \n\n- 0 social life and ignore everyone due to how much of a burden there is for paying back debt. I have negative emotions and focus on my work only. Ignoring coworkers too. Management is happy with my work pace. \n\n\nI want to do or try new activities on my day off to feel happy/ or actually feel like a human. What should I look into to be doing on my day off for a reason to live.",
        "created_utc": 1678003821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m losing myself?",
        "author": "Bunniesbakeri",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11irfgw/im_losing_myself/",
        "text": "18F in college for context. \nI always feel like detached from my mind. \nLike- I’m aware of my actions but not really there?\nIt makes me sad because I feel like I’m on auto pilot \nAll of the time and I don’t remember a lot either. \nMy memory is shit, time goes by super fast and I can’t ever actually \nFeel an experience it’s like I’m not even here and \nI really wanna find out how to just see life normally \nIt feels all fuzzy if that makes sense.",
        "created_utc": 1678003430,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i become more myself around others?",
        "author": "47puffs",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iqtxv/how_do_i_become_more_myself_around_others/",
        "text": "Everytime i’m around someone i’m not completely comfortable with, I become a watered down version of myself. I basically embody what I think people expect me to be, and i hate it. when i’m around my old friends i’m so much more confident, funny, outspoken, unique and charismatic but I feel so diluted when around anyone else. It’s such a lonely feeling not being able to be myself around new friends but I don’t know what to do. If anyone has advice i’d love to hear it.",
        "created_utc": 1678001351,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not be ticklish so easily?",
        "author": "PSR_J1841-0500_Star",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iqsa7/how_to_not_be_ticklish_so_easily/",
        "text": "For more context in this post, I am so easily tickled by somebody else and I wanted to know how to stop being so ticklish.",
        "created_utc": 1678001184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Successes and Failures (I’m challenging myself to be hella disciplined for a limited amount of time)",
        "author": "Rfdarrow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ipako/successes_and_failures_im_challenging_myself_to/",
        "text": "This time last year I didn’t believe I was able to work and even had a pending SSI case. Over the course of 2022 what helped the most - even more than 10 years of therapy, was being in regular contact with friends who believe in me more than I believe in myself. Now I have a full time job with the most successful non-profit in my county and I’m doing really well despite my lack of education/credentials. \n\nI am really proud of myself. \n\nIve saved a lot of money for plastic surgery as I’ve felt for a long time that certain aspects of my appearance are a huge factor in dampening my self-esteem and my desire to pursue more life (namely, I’m naturally shaped like the love child of Kermit the Frog and a whiskey barrel). This surgery is scheduled for the beginning of May.\n\nI have about nine weeks until then and in that time I’m trying to lose as much weight as possible to ensure that my hard earned money goes as far as possible in pursuing this surgery.\n\nThe goal is to consume no more than 800-1000 calories everyday for the next 9 weeks. I know that sounds extreme but knowing that it’s only for a limited amount of time and I have a set end date makes it easier to focus instead of lamenting.\n\nI know I can do this, i just have to remain focused on my goals in the face of carne asada fries and cheez it’s.",
        "created_utc": 1677996147,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got invited to a party Saturday and usually I’m known to be the awkward bad posture guy and i keep looking at my phone alot and sitting alone hiding because i have social anxiety but I’m really going through depression and i decided that i need to live my life by liking change",
        "author": "Esepapichulo253",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ip5n0/i_got_invited_to_a_party_saturday_and_usually_im/",
        "text": "I’m going through an identity crisis, and I’m trying to find out who i am and after realizing it’s been awhile since I’ve been to one  the good thing is that my friends that i shut out and mostly flake on since when depression hit, invited me. Should i honestly go or decline? And if so what could i do to have a good time??  I’ve recently felt to accept and go with the flow with life, live in the moment   My bad if it don’t go here lmk in comments and I’ll change it.",
        "created_utc": 1677995717,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I regain my old self esteem after divorcing the man who rejected me for 6 years and left me for someone prettier?",
        "author": "Sunflowersnraisins",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ip4tv/how_do_i_regain_my_old_self_esteem_after/",
        "text": "How do I regain my old self esteem after divorcing the man who rejected me for so long and left me for someone  prettier?",
        "created_utc": 1677995644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Recommendations On Getting Out of A Work Slump",
        "author": "Tallfuck",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iozdg/any_recommendations_on_getting_out_of_a_work_slump/",
        "text": "Precovid I was a pretty big go getter, read books on improving my performance at my job, took on leadership roles, was one of the most proficient at my job. \n\n2 weeks precovid I switched gigs to a new role, 66% pay increase, it was something that I’d studied and I was confident enough for the company to give me a shot despite my lack of experience. \n\n2 weeks after joining my job was on hold for about 2 months and I was brought back, but the person who hired me and the 7 other members of the team I just joined all didn’t get brought back for 18 months and all left the company within a month of that. I am the only one remaining. \n\nI have found myself skimming along, doing the bare minimum while in a position that could really progress my career to direct, VP territory if I actually gave a fuck…but I have struggled to get started, the half of the job is a walk in the park, but boring, and I don’t overly have an interest in it. But I don’t want to start at the bottom of the food chain in a different industry. I don’t have any idea where to start and after asking a few times with no real answer, I struggle to stay motivated or come up with ideas. \n\nThis is the most I’ve ever been paid, it requires minimal effort, but I can’t help but feel like I’m wasting my opportunity for a better life. \n\nDoes anyone have any advice or book recommendations to get out of the slump?",
        "created_utc": 1677995145,
        "upvote_ratio": 1.0
    },
    {
        "title": "just here",
        "author": "d0_ub",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ios5f/just_here/",
        "text": "how did you help yourself overcome that depressive spiral towards progress and discipline, despite the environmental (family, finances, work) and emotional (depression, anxiety, ACEs) and mental (avoidance) factors that tries to find reason to remain?\n\n-\n\nhere i am, just sitting and realising what i've done. again. for the third time. how did i allow myself to ruin school for myself again? always stuck in this stupid spiral of depressive avoidance sleep.\n\nso much work due.\n\nrealising they aren't even that difficult and i had more than enough time, now that my brain's clear from that stupid dumb fog.\n\ni don't know how to manage this. i don't know how to manage me.\n\nif you'd like to say matters of time management, discipline, laziness, procrastination, avoidance - don't worry, i've got that all covered to throw onto myself. but hey, if you think it's necessary, just keep them coming.\n\ni truly and genuinely want to do well for school. how do i help myself? \n\n-\n\nim currently working and studying at the same time. the past few years were pretty shit with some family situation that really fucked up my mental, emotional and financial state. had to leave a prior job because of it. back to work and studying again, but i guess i'm just a shit human being who can't deal with anything right. i don't want to blame my circumstances for it. i've only got myself to blame for not trying or doing better.",
        "created_utc": 1677994514,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not a bad person, but if my past mistakes don't define me then what does?",
        "author": "Commercial-Plenty961",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iop6a/im_not_a_bad_person_but_if_my_past_mistakes_dont/",
        "text": "I'm 22 and going through a shame spiral and I keep replaying it in my mind like it happened yesterday and I don't know how to make it stop.",
        "created_utc": 1677994261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ah... It isn't normal to check someone's social media, even if their accounts are public?",
        "author": "mink2018",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11io9z1/ah_it_isnt_normal_to_check_someones_social_media/",
        "text": "I don't get this. But if im interested in a girl, id do a bit of reading and generally am curious about their stuff.\n\nI got once called out a stalker for this but bruh, your stuff is public.\nI didnt mind it at the time, but now this new interest of mine locked her facebook out.\nBecause i mentioned something about her being on diet(assuming she's a part time model)\n\nWell i guess that's it. Am i being creepy for hinting that im interested in them?\nI just like being upfront. Hey i like you, ive done a bit of stalking. Ooof\n\nI feel so dumb sometimes that i dont know this basic rule.\nOr is this a women thing?",
        "created_utc": 1677992951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever turned down an invite but later regretted the decision?",
        "author": "OccamsDragon",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11io0s8/has_anyone_ever_turned_down_an_invite_but_later/",
        "text": "I'll keep it short and sweet.\n\nMy mom invited me to go hiking to a waterfall with her and my stepdad and her brother. I was tired and don't like hiking so I declined.\n\nThat evening we all went to celebrate grandfather's birthday as we planned to do in advance. While we were at dinner my mom and uncle were talking about the waterfall and how it was fun and showed pictures.\n\nI got so angry and jealous. I didn't really do any outbursts. I reacted my keeping quiet and not saying much during the dinner which people noticed.\n\nI wanted to just yell and scream or play the victim like \"Man I wish I would have gotten an invite\" or \"Oh I'll just have to go to the waterfall by myself sometime\". Which is STUPID since she 1) invited me 2) I hate hiking\n\nWhy am I reacting like this? Please I want to understand and not feel this way anymore.",
        "created_utc": 1677992188,
        "upvote_ratio": 1.0
    },
    {
        "title": "happy relationship, fiancé never seems to be satisfied, gratitude?",
        "author": "fortitudinousreader",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11inwgj/happy_relationship_fiancé_never_seems_to_be/",
        "text": "My (24F) fiance (24M) is a great guy, we've been together since we were 16 and got engaged a few weeks ago. Our relationship is pretty great in that we almost never argue, bicker like anyone else, but we have had 4 actual fights to date. We get on really well and are definitely on the same page for our future etc. The only problem is that he never seems truly happy with what we have/he has. \nFor example, we live a really great life, we both only just got our first jobs a year ago, live in a Housetruck happily saving heaps of money, travel a lot, we are super active, super in love despite being 8 years in. But he always wants to do MORE, even when we're both exhausted and have little energy for anything. He is also very active, mostly mountain biking, and every now and again he'll go on a run, not often - he wants to run fast and far, and his last 3 runs he has injured himself by pushing too hard. Another example I have dealt with pretty serious anxiety and terrible self-worth for a long time, I've turned myself around in a big way, which he says he sees, but then he said he's scared I'll be like this forever, because it really upsets him to see me upset about things he can \"obviously\" see are not a real problem (my weight, how I look etc.). He only focuses on the fact that my issues are still around, rather than acknowledging how much progress I've made. Same with my exercise, I started regular exercise a few months ago, which was a huge mental achievement for me. He doesn't know how to support me with this other than pushing me to do more, rather than acknowledging that I'm trying pretty hard. I'm struggling to write this because he's a great guy, and I hope that comes across. He wants to be supportive but doesn't know when to support vs push. \n\nI'm hoping for some suggestions for him on how he can be more grateful for what he has in life, rather than always looking at what he doesn't have. He acknowledges that this a problem too, but doesn't know how to change his mindset. Thanks in advance!",
        "created_utc": 1677991814,
        "upvote_ratio": 1.0
    },
    {
        "title": "thank you so much",
        "author": "wetbeans1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11in8nr/thank_you_so_much/",
        "text": "so a couple of months ago I made a post basically saying that I didn't know how to talk to people which I deleted because I was embarrassed. I never thought people would see it or read it. at first everything was still the same but it all improved over time. context:(I'm a 14-year-old freshman who had no real friends only smoking buddies).  so lately it has been great. I have many new friends and have reconnected with many old ones, I have stopped taking drugs too and it's all because of my girlfriend. she is the best person I know and when I'm with her I get the feeling of being high. I realized I don't need drugs or stuff like that to be happy anymore, so thank you so so much for the advice and thank you for helping me come out of my shell. btw at that time in my life I was cutting and having bad thoughts because I felt so alone. I even pushed people willing to help away by deleting my post. i just wish I had remembered the usernames lol so I could thank them more personally. but if you see this and remember me thank you so fucking much.",
        "created_utc": 1677989843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need guidance I have been looking for logical answers",
        "author": "Icy_Rich_3749",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11imh34/need_guidance_i_have_been_looking_for_logical/",
        "text": "\nI have been working on myself for the last 3 years. I put dating on a backseat finished MBA, got a 6 figure salary. Getting my mom a condo,I was raised by a single mom. I am going to be 28 soon. I'm going to focus on myself for 2-3 years more on setting up businesses with friends and family along with buying real estate. So was just curious will younger girls in their 20s will they be interested in me when I would be like 30-32( I am asking this question because I don't want to date someone with tons of experience who is of my age). This question is for younger women do you find guys in their 30s attractive. Right now it's hard for me to date because I literally invest 85% of my income. I live on bare minimum, I don't think any girl would like it if I don't spend time with her.",
        "created_utc": 1677987618,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I learn to love myself?",
        "author": "Superstarella61",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11imble/how_can_i_learn_to_love_myself/",
        "text": "I am 24f and I struggle with anxiety and sometimes depression. Low self esteem and lack of trust/confidence in myself seem to be a big part of a lot of my issues. For example, I have never been in a serious longterm relationship so I tell myself that it will never happen, that there’s something wrong with me and it’s my fault. I can be shy and socially anxious so I tell myself that people don’t want to be around me and that they find me boring or awkward or too serious and hard to talk to. And I pick apart how I look telling myself that I’m ugly and fat and that I will never do anything with my life because I’m too lazy and unfocused. Everything feels like my fault. If a guy doesn’t like me it’s my fault. If a social interaction goes awkwardly it’s my fault. \nIf I see a guy who I think is cute I think that he won’t be interested in me and might think I’m ugly or awkward so I don’t try. I don’t know why my self esteem is so bad— I had a good childhood overall, a loving family, wasn’t bullied.\n\nI don’t know how to change how I feel about myself. I am already on antidepressants and I’m already in therapy. I’ve seen different types of therapists over the years but right now I’m doing CBT. Im not very good about doing the homework and then of course I beat myself up about that too. In therapy we identify the cognitive distortions in my thoughts and challenge and reframe them but this has never seemed to move the feeling deep within me that I am not good enough. I can tell myself positive affirmations but they don’t feel true. I see people saying you need to learn to love yourself before you find love but I don’t know how to do that.",
        "created_utc": 1677987178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations for men's self confidence how to be an alpha male leader???",
        "author": "joebreh",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ilxiu/book_recommendations_for_mens_self_confidence_how/",
        "text": "Does anyone have any book recommendations for men's self confidence??",
        "created_utc": 1677986074,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I develop personality and become a woman of substance?",
        "author": "Live_Income_6469",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ilhri/how_can_i_develop_personality_and_become_a_woman/",
        "text": "I have been trying to develop hobbies and making efforts to educate myself on different topics. I feel like I am just a pretty face with nothing to offer at all. I cannot carry conversations as much as I would like to and I have been dealing with depression which caused me to lose motivation to do anything for years. I am learning how to draw and recently got into rock climbing. I would like to know what other hobbies I can develop to become more interesting and well rounded.",
        "created_utc": 1677984850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having trouble eating",
        "author": "ahhhreallywhat",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ileka/having_trouble_eating/",
        "text": "I’m not sure if this is the eighth place or not so please direct to the correct sub if need be.\nI have been having real trouble eating recently, not the physical action but rather the making food. I have so little desire to cook anything or buy anything that I’ve ended up just not eating or eating a very small amount.\n\nI think it may be anxiety related as I’ve noticed that I tend to be anxious about going into the kitchen to cook when other people are there and so I just don’t eat. Also I’m too anxious to go shopping so I’ll just have nothing to eat.\n\nI also don’t  really feel the sensation of hunger until it’s accompanied by the feelings for extreme hunger. For example, in the past 6 days I’ve probably eaten once or twice but I don’t get hungry at all until about 4 days of not eating. And when I do feel hungry I also feel extremely tired and weak and can’t concentrate.\nI was wondering if anyone has been through anythingg similar and what can I do to improve on it?",
        "created_utc": 1677984594,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find a compatible roommate?",
        "author": "redheadedwonder3422",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11il974/how_do_you_find_a_compatible_roommate/",
        "text": "I am 22f, and moving soon to NYC and would like to find a roommate that i like and get along with. My last two roomies haven’t been a good fit, as I only met them once before moving in.\n\nWhat questions do you ask? Things you note? Tips on avoiding bad roommates? \n\nTIA",
        "created_utc": 1677984158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I recently noticed just how annoying and \"pick-me\" I am. But I don't know how to fix it.",
        "author": "alongfortheride2341",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11il7iw/i_recently_noticed_just_how_annoying_and_pickme_i/",
        "text": "(For those who don't know, a \"Pick me\" is somebody who is...basically attention-seeking and wants people to notice them. They are overall pretty selfish and don't exactly care.)\n\nFor a bit of background, I do believe that I have BPD. Which might be a reason for acting the way I do. But I would like to change that. I only have one real friend and I am not sure that she really enjoys talking to me, as we haven't hung out outside of school time. I feel like a bit of a filler friend. Or just somebody who nobody wants to see outside of school.\n\nI don't want to be that annoying, selfish, attention-seeking kid anymore. I want to improve on how I act around others and I'm not sure how to do that. Please help me out?",
        "created_utc": 1677984030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficulties of an authentic life",
        "author": "Outlier_mentality",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ikrqd/difficulties_of_an_authentic_life/",
        "text": " Choosing to live an authentic life is a harder path, paved with obstacles and solitude.\n\nNonconformist, unique individuals were always feared by the masses. With their authentic way of life, they trigger doubt in the minds of the crowd regarding the actual significance and validity of their social roles.\n\nRemember how we talked about how most people get their self-esteem from being \"a person of value\" in our ideological \"world of meaning\"? Well, imagine when that type of person sees someone trying to be a person of value by their own standards and in their own world of meaning. To a person who’s been living an inauthentic life, the authentic person challenges the significance of their whole life.\n\nIt is no wonder then that the masses actively discourage and suppress the cultivation of character and try to stifle any attempt at uniqueness, considering that they are trying to preserve the value and significance of their very existence.\n\nThis is why those who decide to embark on the path of an authentic life are destined to be met with discouragement, ignorance, ridicule, rejection and at times even isolation from the society.\n\nBeing unique is difficult. In fact, according to Nietzsche, being unique is so difficult that it is not fear, but laziness that prevents so many of us from living authentically. He argues that our greatest fear is actually the fear of how much effort is required to persist in being a unique individual.",
        "created_utc": 1677982828,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is something you never fully understood the importance of until you saw the amazing result?",
        "author": "MishaPablo",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iki9s/what_is_something_you_never_fully_understood_the/",
        "text": "Today I was cleaning my bedroom in my parents house, and absently dragged a fan out of my closet which ended up making two huge gauges in the hardwood floor. \n\nAt first my heart sank, because my parents are getting ready to sell, but then I quickly realized, this is a great opportunity to bond with my dad while he teaches me how to replace the scratched floorboards. (*My father understands the importance of knowing how to renovate/repair your own home, and he knows to keep extra floor boards in case of scratches*) \n\nThis is when a wave of euphoria washed over me, as it finally dawned on me how life depends on your ability to see the good and the opportunity in any situation. It’s perfectly okay that it’s too hard sometimes, and we give in. But once you learn the joy it brings, you’ll only want to do it more. \n\nWhat’s your story?",
        "created_utc": 1677982122,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get over the fact I don't feel like talking sometimes?",
        "author": "Lolidragon808",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ik5gg/how_do_i_get_over_the_fact_i_dont_feel_like/",
        "text": "I don't really know how to describe it, but my mom finds it annoying. I am really trying to fix myself. There are times where I just don't feel like talking to others and seclude myself, which turns into a cycle of feeling lonely, depressed, getting out of it, talking to others again, then it repeats. The reason I don't want to talk to anyone during these times is because I will get irritated or annoyed that I am \"forcing\" myself to talk. I don't want to talk to anyone, if I am in a bad mood. Most likely, I will give them a bad mood. My mom called me about it and said to start learning how to talk to her more. She said I can fake a good mood to talk to her and ask about her. What else can I do? I just am not good at building close relationships or opening up myself to others.",
        "created_utc": 1677981166,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I love me if nobody else will?",
        "author": "ElkComprehensive8995",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ijyl8/how_can_i_love_me_if_nobody_else_will/",
        "text": "[removed]",
        "created_utc": 1677980641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Separating Myself",
        "author": "Main_Pepper1608",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ijbru/separating_myself/",
        "text": "Is it wrong to stop talking to someone because I don’t like how I act when I talk to them? It is an online friend that I know in person, but we are truly close to one another, I simply don’t like my behavior when chatting with them, it is not their fault, but our friendship is grounded on someone who is not even me. Should I just stop talking to them after a goodbye, or should I try to repair our friendship?\n\n&amp;#x200B;\n\nit is okay to downvote me, I know I’m the villain.",
        "created_utc": 1677978949,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm only able to succeed during hard times. How to fix this?",
        "author": "Affectionate_Arm3040",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iizkc/im_only_able_to_succeed_during_hard_times_how_to/",
        "text": "20y/o f. Every time there has been a big family issue or crisis, I focus really well and have gotten a 4.0. I am only able to succeed during very traumatic and depressing situations, it feels like. I don't know how to be successful when life is normal and kind of boring. What do I do?",
        "created_utc": 1677978051,
        "upvote_ratio": 1.0
    },
    {
        "title": "6’1 198 pounds or 90 KG confused on what to do in gym",
        "author": "banterinbedonig",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iivwq/61_198_pounds_or_90_kg_confused_on_what_to_do_in/",
        "text": "I’m 6 foot one and weigh ninety kg I’ve never been to the gym before but I want to start I don’t know how many times a week I should do like 3 or 5. Also I’m wondering should I bulk and I don’t wanna cut yet cause I’ll just look skinny. Also my torso looks normal but my legs have a lot of fat on them for some reason. So should I bulk or cut? Also I heard about this thing called body recompostion should I look into that aswell. Also should I have milk or water with protein shakes. And what kg should I aim for right now, I want to build muscle but i don’t know how and don’t know if i should bulk or not so any advice is welcomed thank you guys alot.",
        "created_utc": 1677977782,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Pets Can Build Self Esteem",
        "author": "ChartOtherwise3903",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iiupx/how_pets_can_build_self_esteem/",
        "text": "[removed]",
        "created_utc": 1677977696,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it take to be great?",
        "author": "BentPixelsLoL",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iijiq/what_does_it_take_to_be_great/",
        "text": "(Not sure if this is the right sub for this, if it’s not feel free to take it down)\n\nGreatness is something I’ve been pursuing for many years now as an athlete. I want to compete at the highest stage against the best competition, and I want to win it. To me, there’s nothing more fun than being in over my head while competing in a sport I love. For many years, I was a runner. I was pretty fast, and while I have had glimpses of greatness during my days as a track and cross country athlete, the sport unfortunately fell through due to injury. \n\nShortly after leaving running, I found volleyball on a whim, and I haven’t looked back. Unlike running, I thoroughly enjoyed volleyball with all my heart and knew that I wanted to take my game to the next level. I looked forward to going to practices every day rather than dreading them. Since then, almost two years ago now, Ive loved playing against good players, and I love improving as a player and playing with/against good players kinda forces me to improve so I can keep up. I play usually 3 times a week and lift weights twice a week. The other two days are “off days” that I use for core and hip flexor strengthening, with some variability. \n\nBut lately I’ve been thinking that I’m not doing enough. The goals that I have are huge, even for the most driven and motivated people. I honestly believe that I can do it, as long as I take care of my body and improve at a consistent but intense rate, and I’ve being doing just that. But I can’t get over the idea that I’m not doing enough.\n\nI enjoy video games, watching shows, and getting high occasionally. Relaxing and recovery is important to me because I like having that balance. None of those effect my ability to go to the gym or get better at volleyball as far as I can tell, but I often feel like I should be filling that time doing other things that I need to do if I wanna be see my goals through. And I can’t tell if this is something I really need to commit to in every aspect of my life, or if it’s just the voice in my head spouting bullshit. I’ve tried full-scale committing to it, wherein I don’t do really anything fun aside from volleyball and it’s turned my life pretty grey. \n\nBasically, how much do I need to sacrifice in order to be great? Does my life really need to be miserable in order to achieve my goals? Is balance even necessary with a goal like this? I don’t know anybody who Id consider “great” so I can’t ask them specifically, so here I am asking the Internet. How far do I need to go if I want to be the best in the whole world?",
        "created_utc": 1677976867,
        "upvote_ratio": 1.0
    },
    {
        "title": "I NEED TO RE-GAIN MY SELF CONFIDENCE",
        "author": "nuevosangre",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ii9a3/i_need_to_regain_my_self_confidence/",
        "text": "Look im a 23 about to turn 24. The last couple of years have been tough on me. I had a break up, barely graduated community college and now im stuck home trying to become a music producer. \n\n-Ive done alot in the past 3-4 years. \n-Ive learned my native language Spanish in 6 months. \n-Done alot of self improvement work on myself. \n-Learned about inner work to change my thought patterns/ identity. \n-Ive read about 10+ books in the past 2ish years. \n-im left handed and used to write like shit, I significantly improved my hand writing too.\n\n*ive done all of this stuff  barely sleeping 4 hour consistently every single night till like 4-5 months ago, I had insomnia because of the break up. Which I also fixed myself.\n\nIve over come alot of obstacles, but im so exhausted. \n\nMy friends say im smart and I can do, the music thing, but I cant believe them.  Even though Ive clearly proven to myself that Im capable of learning things on my own.\n\nIve racked some pretty tough loses, that im extremely disappointed in. Those loses have made me believe that I will fail again. I dont want to fail again, not in a career wise. But it so hard for me to pursue what I want because of a lack of confidence, my confidence is attached to my outcomes, can anybody tell me how to generate confidence within and not let the past withhold you from a greater future?",
        "created_utc": 1677976142,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I care about myself?",
        "author": "BiggerWiggerDeluxe",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ii8jt/how_do_i_care_about_myself/",
        "text": "For a while now I've been on a negative autopilot where I don't take care of myself or my surroundings.\n\nI used to feel a responsability to take care of myself, my gf and our flat, and had a decent routine because of it. \n\nMy gf broke up a few months ago, and after some weeks of feeling sorry for myself I got into a very healthy routine, where I exercised daily, ate healthy, excelled at work, finished my bachelor degree part time, moved into a new flat and took good care of it.\n\nI felt like a hero for this time, fighting back against depression and chaos from losing what was my life for years. I felt very confident and a bittersweet victory in taking care of myself even if I was not loved anymore.\n\nThis lasted for maybe three months but this last month I feel like shit. I feel tired and insecure all the time, I have very low energy throughout the day, avoid tasks at work, I am scared to go outside and leave my flat almost exclusively to smoke cigarettes, I can't find the energy to exercise, read, or work. I don't care what my flat looks like or that my plants are dying. I feel like I am not present anymore, I am just observing all this from inside my shell. \n\nMyself from two months ago would be disgusted with this person. I don't understand why I feel so shitty, I am over my breakup, I finished my degree, I should have the time and energy to focus on myself now but I just want to sleep.",
        "created_utc": 1677976090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Realizing I’m stupid (23m)",
        "author": "polyhedron__",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ihrc5/realizing_im_stupid_23m/",
        "text": "Most of my anxiety and struggles with socializing are from realizing that I’m not as smart as everyone else, and hiding it. I just don’t know where to start.\n\nI don’t know where to begin, what to learn about, or what area of knowledge I should strengthen first. I know a good amount about my studies, but that’s it. People that talk with me about my research are going to think I’m smart when in reality, any normal person could do what I do. \n\nThis isn’t about schoolwork or anything; I do fine in school and you don’t have to be smart or master the material to get good grades. This is about not having meaningful ideas to contribute, and it’s frustrating not having anything to offer.\n\nAny advice would be helpful.",
        "created_utc": 1677974872,
        "upvote_ratio": 1.0
    },
    {
        "title": "I broke up with my girlfriend. I feel glad and relieved",
        "author": "Able_Ad_5918",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ih9vm/i_broke_up_with_my_girlfriend_i_feel_glad_and/",
        "text": "On the 30th of January, I finally entered my first relationship. As it tends to be, everything was perfect in the beginning. We met, we hugged, we kissed, we laughed, we tickled each other, did all kinds of stuff. In other words, we had a great time.\n\nSoon, problems arose such as her ex-boyfriend, who couldn’t get over the fact of losing her. He pestered her, called her, frustrated her in various ways. If she blocked him, he would just text her from another account or call her using a different number. I advised her to just ignore him, which led us to our first quarrel.\n\nYou see, she is incapable of ignoring people. Yes, you’ve read that right. She couldn’t sit still at the sight of the text message from her toxic ex-boyfriend (first red flag). Naturally, I felt unpleasant, as if I was her second option, to merely make him feel jealous. When I told her about that, she was deeply offended. Eventually, we resolved the conflict.\n\nThen, came another one. And another one. And another one. We have spent a little longer than a month together and we’ve already had 10+ arguments with each other. The second red flag.\n\nWe are completely different human beings. I spend a lot of time doing resistance training, studying, meditating, improving my health, reading and she spends her days watching movies, talking to her friends, playing GTA and watching TikTok. We don’t have anything in common. The third red flag.\n\nThe last week was especially difficult for me because she stopped texting me first, replied coldly to my text messages, had a horrible ache in her belly from her period (I think that was a lie), and added her ex-boyfriend to her friend’s list on a local social media app. When confronted with all of that, she came up with, what I think was, a bunch of lies. I no longer trusted her and knew that I had to break up with her. I even began talking publicly about it (not in her presence, of course).\n\nYesterday she came up with another excuse to not meet me (her mother told her to go to her village for the weekend). I was offended, so I stopped replying to her texts, which offended her and that farce was all over again. I grew so tired of this distrust, of this stress, of this time-wasting that I straightly asked her: “Do you want to put an end to all of this?”\n\nShe became even more offended, which I think was manipulation from her side, nothing more or less.\n\nAgain, I took the blame to keep the sinking ship afloat. Yet, this inner desire to break up with her wouldn’t leave me until the evening, until she texted me this:\n\n* I’ve done something that you will never forgive me.\n* Speak.\n* Well, you can probably guess.\n* You made out with a guy from the village, right?\n* Yes, I’m so sorry, I was drunk.\n* Bye.\n* That’s all? I was simply drunk.\n* Did you want more?\n* Okay… So this is it?\n* Yes, this is it.\n\nOn that note, all of our photos together, all of our conversations, all the signs that we had been in a relationship, were erased. Several hours later, she would block me everywhere.\n\nDo I feel sad? Slightly. Do I feel emotional pain? Only from giving her my T-shirt and dealing with the fact that she’ll be making out with another guy. Apart from that, I feel perfectly fine and relieved that we put an end to this relationship.\n\nI don’t believe that she traveled to her village, that she was drunk. She merely wanted an excuse to break up with me, that’s all. Furthermore, I had warned her what would happen if she cheated on me or drank alcohol.\n\nAt last, I have a lot more free time, more energy and more drive to put into my goals and ambitions. We weren’t made for each other, and I knew that from the start. I also didn’t trust her. That allowed me not to get too attached to her.\n\nOh, how relieved I am!",
        "created_utc": 1677973658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self improvement and academia",
        "author": "Common_Function3385",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ih6y1/self_improvement_and_academia/",
        "text": "Summary\n\n\nI am a promising academic who is struggling to square self improvement with my intellectual interests and I would appreciate advice on how to do so and where to start. \n\n\nMy situation. \n\n\nI (19, m) am a student of philosophy and English. I won a scholarship to the most prestigious university in my (Western European) country and I am both doing well in, but more importantly enjoying my degree. I am doing relatively well psychologically and for the first time have an active and meaningful social life. Although I am putting myself through college (With certain non-financial help from my family) I am not working this semester.\n\nI fall into many of the trappings of students and there are a number of things in my life that I would like to change:\n\n(in no meaningful order) \n\n- I have an irregular sleep schedule (while I don't feel the need to reduce the ammount I drink, it probably has an impact) \n\n- I regularly smoke and vape\n\n- I am not physically active (I was very physically active throughout my teenage years and I am still rather fit) \n\n- I have little order to my working hours\n\n- I have little control over time (most of it is spent on menial activities, socialising, sleeping excessively and working) \n\n- I regularly find it very difficult to get out of the bed in the morning \n\n- I eat a fairly unhealthy diet\n\n- I am unsatisfied in the efficiency with which I am moving towards my academic ideals\n\nBeyond this I don't have any particular self-loathing or shame in who I am. I am generally accepting of myself.\n\n\nPhilosophy and Self improvement.\n\n\nMuch of the online content relating to self improvement involves accepting particular psycho-philosophical ideas. Ideas of ambition, free-will, a lack of self acceptance and/or stoic-like principles spring to mind. Out of sound academic practice and healthy scepticism I cannot accept any of these. This is particularly true regarding the fact that most sources online are unqualified and sudointelectual. However, I empirically know that when I act in certain ways I am the better for it. On top of this, valid psychological and medical research point me toward making changes in my life. The inability to accept dogmatic beliefs or to live in 'bad-faith' to use a Sartrian term, lessens with my ability to install these good practices into my life (on top of the regular excuses). As such I have come to the conclusion that I need to live in a way in line with these changes but need to do so without taking the intellectual baggage of 'self-help'. \n\n\nMoving forward.\n\n\nI have two questions that I would like advice on.\n\n1 - How do I achieve this if it is indeed possible.\n\n2 - Where do I start (Specifically is shown to help here and I have a list).\n\nI would massively appreciate any advice that would lead to the relief of my predicament. Thank you.",
        "created_utc": 1677973465,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do?",
        "author": "Contryx",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11igr30/what_can_i_do/",
        "text": "Getting to the point where I am trying to stop trying to get people to like men but wondering where I wrong. I show a genuine interest, remember previous conversations and show vulnerability where it’s appropriate but still get nothing back..\n\nSomeone at the pub said it’s because I’m 6ft 3, skinhead and tattoos people are intimidated. I don’t scowl or looked pissed yet people don’t want to know. What can I do to fit in?",
        "created_utc": 1677972376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why we should say no to positivity -- and yes to our negative emotions",
        "author": "GAikens",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ighzt/why_we_should_say_no_to_positivity_and_yes_to_our/",
        "text": "Emotions don't have to be labeled \"good\" or \"bad\". Emotions are data that help us if we listen to them and allow them to help us heal.",
        "created_utc": 1677971767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smartest Route to make extra 3k-4k monthly aside",
        "author": "CulAndrew",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ighfu/smartest_route_to_make_extra_3k4k_monthly_aside/",
        "text": "[removed]",
        "created_utc": 1677971729,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is confidence?",
        "author": "Jdock_81",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ige37/what_is_confidence/",
        "text": "I feel like I don't really know what it is, is it being relaxed around other people? Is it feeling comfortable with your own body and yourself as a whole? Or is it not being shy. I feel like I really don't know what is confidence and how can I develop it.",
        "created_utc": 1677971504,
        "upvote_ratio": 1.0
    },
    {
        "title": "take a well paying job, or join the military",
        "author": "One-Nectarine-4026",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ig95d/take_a_well_paying_job_or_join_the_military/",
        "text": " \n\nI'm a 21 year old guy from Canada. About 8 months ago I took an opportunity to leave my small hometown in Ontario &amp; move to Alberta and live with my uncle. It's been a big change but I'd say I've enjoyed it so far. While out here I’ve worked a few construction jobs. Recently I’ve landed the opportunity to start working in a mine about 3 hours away from where I am currently living. It pays really well (45+ per hour) and seems like a great opportunity. I’d be making just shy of 100k per year just for driving a big truck. I would have to move to the mining town within 6 months of starting the job (I start in a few weeks) which isn't a problem since I really don't have anything tying me down to my current location. If I stuck it out It could lead to apprenticeships and could lead to a very well off lifestyle. \n\nHere's the thing though, I have always had in the back of my head that my dream is to join the military. It's been something I thought I should do since about grade 7-8. I know it's a hard lifestyle, but that's a part of the reason I want to pursue it. I'm a pretty active guy, I workout 6 days if not every day of the week, run a lot, skateboard and snowboard. I like to push myself physically. \n\nPart of the reason I'm writing this post is because my cousin just graduated basic recently. Talking to her while she was at basic and then watching her graduation live stream got me really thinking about it. Thinking that's what I should be doing with my life, I should be one of those people in that graduation ceremony. Seeing someone I know make it through basic, wearing the uniform really inspired me. I've been obsessing over it since, watching videos about life in the military, taking practice CFAT tests. The idea of applying has overtaken my mind. That's all I think about. I think about how proud of myself I would be if I were to become a soldier. The main reason I never applied right when I turned 18 is just out of fear, a fear of confronting the unknown. But seeing my cousin graduate has really made me realise I should embrace that fear and not run from it.\n\nSo I'm really torn. I don't know if I should pursue this mine job and pursue the money or if I should do what I really want to do and apply for the military. If I were to apply I would still take the mine job and just stack some cash while I wait to see if I’m accepted. What would you do if you were in my situation?",
        "created_utc": 1677971175,
        "upvote_ratio": 1.0
    },
    {
        "title": "i made a lot of mistakes",
        "author": "Narrow_Watercress_55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ig65a/i_made_a_lot_of_mistakes/",
        "text": "I made a lot of mistakes and it made me hate myself, i want to change but i dont know how. I never do anything with bad intentions but i still do dumb things. I keep on doing shitty things to myself and other people do you guys have any advise for me?",
        "created_utc": 1677970972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving my lack of fulfillment at work",
        "author": "SunRise34",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ifxn9/improving_my_lack_of_fulfillment_at_work/",
        "text": "Early in my career I obsessively dwelled on my lack of fulfillment at work.\n\nObsessive dwelling made me feel worse.\n\nWhat helped?\n\nI took my focus off myself &amp; put it on something beyond myself.\n\nI focused on\n•USING my strengths in service to others\n\nThat simple pivot made all the difference 🙏🏻",
        "created_utc": 1677970393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I hate when people order the same food as me, or buy the same thing as me because they saw me with it?",
        "author": "TTVSubject_21",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11if7tp/why_do_i_hate_when_people_order_the_same_food_as/",
        "text": "A recent example, my mother and I were at a Chinese place, and I ordered Sweet and Sour Chicken. She orders the same until she sees the look on my face.",
        "created_utc": 1677968648,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to turn 40. Need advice",
        "author": "CapnZack53",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ietui/about_to_turn_40_need_advice/",
        "text": "I am about to turn 40 next week. I am not certain what steps, if any, I need to take going forward. Do I need to get a colonoscopy or a basic overall physical? What other health-related things do I need to do or start doing? Everything I have come across Googling what to do when I turn 40 was more mental health related. This is probably not the sub to ask this, so I am open to suggestion of any other subs to crosspost this to.",
        "created_utc": 1677967719,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I mature myself/ grow up?",
        "author": "Aggressive_Cry_5984",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ie2lk/how_do_i_mature_myself_grow_up/",
        "text": "[removed]",
        "created_utc": 1677965926,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I beat an \"all or nothing\" mindset and consistently care about life?",
        "author": "MargeSimpson8",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ie0n8/how_do_i_beat_an_all_or_nothing_mindset_and/",
        "text": "I feel like my mental health, upkeep, and general outlook on life are so all or nothing. I want to make the most of my time while young, but am also very much a perfectionist: if my daily life is not pristine I feel the need to uphaul all of my routines and mindsets in order to \"start anew\". On the other hand, I allow for the littlest things to uproot me for long periods of time. My mind has a high regard for time management and doing certain things for certain intervals of time (60 minutes of X, 15 minute break then 30 minutes of Y etc.) and while it can help promote a consistent sleeping schedule and such, it inevitably fails and I feel the need to restart everything again. \n\nCurrently, I'm in a \"nothing\" stage: I have little to no respect for my values and have found it really difficult to care about my projects or life in general. I am hardly doing any work on my hobbies or projects and cannot get myself to. It's been going on longer than it usually does - and dates that I set to have things fixed by are not working. \n\nI want to consistently care about life. I'm at a pretty important pivot at this time (about to graduate high school and have my last real \"childhood summer\") and I am overwhelmed with getting my life in fix so I can make it something to remember and to also be highly productive before college starts and I'll have to adjust again. How do I break from these unhealthy, time obsessive and ultimately impossible to achieve mindsets? I set high standards for myself, and I'd like to live in a healthier state of moderation that is still satisfying.",
        "created_utc": 1677965791,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I push myself to go out more?",
        "author": "dbvker",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11idr82/how_can_i_push_myself_to_go_out_more/",
        "text": "Hello I would like any tips on going out and meeting people more. I have this dilemma where I’m trying to lose weight and I believe that if I go out, I’ll end up drinking or eating too much and never reach my goal of losing weight. It’s getting in the way of my personal life and I never make time for friends or family. When I’m at home I work throughout the week and go on walks / make food for my diet. My gf always wants to go out but I usually turn her down bc of it. I also don’t feel comfortable in my clothes so it makes me embarrassed even thinking about it.",
        "created_utc": 1677965166,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought my life was falling apart but I remained positive and its all coming together",
        "author": "Objective_Divide5154",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11idg1o/i_thought_my_life_was_falling_apart_but_i/",
        "text": "Today was a really good day! I tested my inner strength and i was rewarded with self respect and self love! My relationship with my brother has gotten so much better and I helped him out during this shit show of a snow storm we got. I pushed myself to test my limitations and even when I was drained I didint quit or give up I just kept on going and i found myself getting second wind.  What felt hard at first became easier to handle  and always found I could pull something out of me. I signed up for a BJJ trial and the owner of the gym contacted me asking when I would like to set the date for! I didint make alot of money for the effort and work I did but honestly I was having alot of fun and it reminded me of the days when I was 19-23 working long hours in both summer and winter. I felt like I had no anxiety the whole day and fear wasnt even present. Man I was saying affirmations in my head before we went out, doing my wim hof breathing and talking to god, the universe consiousness whatever you want to call it and I feel like I was heard! Today was a good day but sheeeit im bout to soak in a nice bath and deal with this hectic strain I just put my body through. Time for some nice RNR",
        "created_utc": 1677964439,
        "upvote_ratio": 0.99
    },
    {
        "title": "If you could introduce good healthy habits to your teenage self what would you want to implement from a young age?",
        "author": "Sufficientsquishy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iczvn/if_you_could_introduce_good_healthy_habits_to/",
        "text": "Just a discussion I wanted to have to see what others would’ve wanted to have started earlier in their lives or to help teens now. Healthy habits affect your mental health a lot and I feel like the habits I created for myself (especially high school) is what let my mental health suffer",
        "created_utc": 1677963406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to TRANSFORM my life",
        "author": "Relative_Arm",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11icw8t/i_need_to_transform_my_life/",
        "text": "I've been taking small steps and trying to do small changes for probably a year or so now in order to improve my life. I've also done a lot of thinking and I now realize that I really do need a transformation.\n\nMaybe it sounds a bit dramatic to say I need to transform my life but I feel like I basically have lost my self. It started around the same time as the pandemic a while after my high school graduation. I went from being someone who was motivated and got good grades, had a close friend group I had tons of fun with and saw often, and was excited for the future, to being a person with basically no life. I slowly started seeing my friends less and less until my social life was basically non existent and the only thing I had to look forward to was Netflix and eating crap. I lost my job and ended up being long-term unemployed and became pretty anxious as a result. And oh, I also wasted my savings. I don't even remember what I did during all that time cause I just spent 99% of all days and week wasting time, feeling depressed, eating like shit to make myself feel something and not making any new memories.\n\nI'm 23 now and tired of wasting my 20s. I've realized that though I've improved a bit, I'm still pretty unhappy with my current lifestyle. I feel lost and lonely and I want to change this. I basically want to become a more mature and improved version of the old me. I wanna make friends and actually have fun again. I want to find a career to pursue so I can stop working minimum wage jobs again. I don't want to be a lazy person who only leaves the house if work forces me to.\n\nI feel this strong need to change. What would y'alls advice be? How do I take the first step(s)?\n\nI guess this post is a mix between venting and asking for advice.",
        "created_utc": 1677963169,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to transform my life",
        "author": "Due_Passenger677",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11icu1l/i_need_to_transform_my_life/",
        "text": "[removed]",
        "created_utc": 1677963024,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one stop compulsively seeking validation/being self-centred in conversations?",
        "author": "gaudyleathergloves",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ickud/how_does_one_stop_compulsively_seeking/",
        "text": "I have an awful habit of fishing for validation when I talk with people. \nIt goes with my general self-interested tendencies. It's a mixture of my social ineptitude, my rudeness, and my lack of confidence or assurance in my identity. It isn't a conscious act, but I veer the conversation towards myself without any regard for the original topic. And its always something pathetic and self-assuring, or its plain old oblivious. I never catch myself in the moment. After, though, I realize whatever I have done and feel guilty.\n\nSo my general awareness isn't the issue. I am aware its bad. And also, I am aware my self-esteem is a deeper issue that must be dealt with differently.\n\nMy question is about how to cue myself to not to act so rudely, during the social interaction. Thank you.",
        "created_utc": 1677962426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confidence comes and goes and it’s infuriating",
        "author": "astheysayinhockey",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ic87s/confidence_comes_and_goes_and_its_infuriating/",
        "text": "I’ve had self-esteem issues (along with depression, anxiety and other things) for a long time, but I know my capacity for confidence has always been there. Recently my confidence has been shot. It’s often felt like it’s been at an all time low. But I still did my normal thing of going out and doing my best to interact with others. Last week felt different. The self-doubt was still there, but I suddenly felt more confident in myself when it came to engaging with others. It almost felt easy (if you are confident, it is easy). It wasn’t an unfamiliar feeling, but it’s one that I seem to have trouble channeling on a consistent basis.\n\nThis week, I feel like I’ve reverted back to before. I’m timid and unsure of myself, and it’s infuriating since I know I’m capable of feeling confident in my self. But… it just isn’t there right now. I really don’t know how the fuck this works. I’m currently on five different medications (I know, not ideal and not the plan, I’m weening off of one right now and hopefully more in the future) and I’m also doing neurofeedback, so if my shifts in self-esteem and confidence have anything to do with any of these things, I wouldn’t know which thing since there are too many variables. I wanna say perhaps it’s sleep, but I usually feel sleep-deprived. It just pisses me off since confidence is also something I need to do well at my new job. It can’t just come and go, it needs to stay. I understand emotions fluctuate and no one can feel good 100% of the time, but with something like this it would just be nice if I could retain the confidence that comes to me for whatever reason so I can go about my life with some hope. \n\nThat is all.",
        "created_utc": 1677961613,
        "upvote_ratio": 1.0
    },
    {
        "title": "i am sick",
        "author": "ObviousRoad1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ic0lr/i_am_sick/",
        "text": "I am literally sick my nose is stuffed and my throat sore. I wanted to ask if I can still do my workout and if it's ok that I breathe through my mouth more then usually",
        "created_utc": 1677961114,
        "upvote_ratio": 1.0
    },
    {
        "title": "best foods to gain muscle mass and weight",
        "author": "infintecosmos",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11iboqp/best_foods_to_gain_muscle_mass_and_weight/",
        "text": "Best homemade meal preps",
        "created_utc": 1677960327,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to lighten dark lips",
        "author": "infintecosmos",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ibmc0/how_to_lighten_dark_lips/",
        "text": "How to lighten dark lips",
        "created_utc": 1677960178,
        "upvote_ratio": 1.0
    },
    {
        "title": "get rid of pimples and marks",
        "author": "infintecosmos",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ibi4m/get_rid_of_pimples_and_marks/",
        "text": "How to get rid of the marks left on face by acne and pimples",
        "created_utc": 1677959933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open discussion about feeling lost in your 20s",
        "author": "onlyiknowthisascount",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ibhjq/open_discussion_about_feeling_lost_in_your_20s/",
        "text": "I just turned 20 a few months ago and I've never felt more lost in my life. I have clear goals and aspirations In my life, but I just feel like everyone Is out for each other and like you can trust only a select few people. \n\nI thought that when I would leave high school and join a university everything I ever wanted in my life would magically come to fruition. I was sorely mistaken. \n\nObstacles are constantly being thrown my way and maybe the saddest part is seeing people I have a relationship with GIVE UP on their dreams because of how many times life has beat them down. The worst part about this Is when I speak about this to anyone, EVEYRONE feels this way. \n\nSo I wanted to ask people online if they too are feeling lost in this part of their life. I'd love to read your thoughts and stories, even read from older people that are not in their 20s anymore and if they too felt like this when they were younger. \n\nThank you.",
        "created_utc": 1677959892,
        "upvote_ratio": 1.0
    },
    {
        "title": "help",
        "author": "acadianational",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ibcpb/help/",
        "text": "I've spent the majority of my life unable to pick a direction and stick with it, I'm terrified and I don't know who I am, I feel like a little kid. I have no maturity and no idea how to be an adult. I can't even drive. The idea of responsibility makes me want to die, because I literally can't picture myself being responsible for myself let alone anybody else. I don't know how to cope anymore. I have no life skills that really apply to life and I've just wasted away in bed for so long I don't know who I am and all sense of personality is lost. I've been spiraling for weeks and life feels so strange and weird now and I can't comprehend the idea that I'm alive. Like it feels so bizarre. I don't feel like I have any agency over myself. Like I can conceptualize riding a bike, but I can't fathom MYSELF riding it let alone actually doing it. It's the most bizarre feelings and thoughts I've had in my life. I wonder if I'm finally going psychotic. I genuinely don't know how to be an adult or even get a job, it feels impossible and so distant. I don't recognize myself in the mirror. I'm losing myself more and more every day. Everything I used to love has lost all meaning and brings me no joy and I barely remember any of it. The idea of jobs and anything else \"adult\" feels so alien and completely bizarre to me and I want nothing to do with it. I feel like a 6yo, not 21. How can I be 21 when I barely brush my teeth or do dishes or shower? I can't imagine how adults live their lives at all. They must be so full and engaging!!! I can't imagine myself having any routines or something to look forward to regularly, it's all a haze and I can't learn anything anymore it's all in one ear and out the other. I have severe memory loss and I feel like I am not \"me\". Like the person I was at 17 was this full person with hope to become a functional adult but after rotting in bed for so long there's no hope to become an adult! The thought of going to work every day is giving me a panic attack because I don't feel capable or competent at all, like, AT ALL! It's almost a physical feeling inside me holding me down. Please help I don't want to live this way forever, I'm going to a therapist but these thoughts are so scary and I don't know how I can go back to thinking I'll someday be an adult now that I feel so low. Like before I thought maybe I can get a job but now it just feels impossible. The idea of tomorrow is nebulous and strange, the idea I existed yesterday is equally vexing to me. \n\nNEETs who have been NEETs for their whole lives: do you feel these things too? Like there is something mentally/biologically preventing you from being like other people, that you aren't mature and don't know ANYTHING about life and you won't ever find that? These thoughts are hitting me so suddenly I can't breathe but it's also all I've been thinking about for 2 weeks. Like literally I have not had a conversation that isn't about these things, I'm like obsessed or something and it's terrifying me. I don't feel like a person anymore I feel like a little kid and I have NO MEMORY!!! Everything is a perpetual haze of one activity to the next and it's all miserable, I can't retain any information and my body and mind are so slow and I can't think straight, it's all blank except these negative horrible thoughts. \n\nI don't feel like I can ever get better or become a real adult or build a routine or anything, maybe this is extreme anhedonia or abulia/avolition but whatever it is I'm terrified because it's the most helpless I've ever felt. I literally feel like I have no agency over myself and it's making me feel insane and scared. I KNOW I have to take action in my life but I can't DO IT or even CONCEPTUALIZE IT anymore. Do these feelings go away with meds or therapy? I just started buspar and I've starting DBT therapy but with no working memory how will I improve? I'm so scared for my future. I've never been responsible for anything and I don't know how I can ever manage it, it seems so bizarre and alien?? Everything feels so weird and unreal and scary and I can't think about anything but my brain turning to mush every day that goes by but I can't bring myself to DO ANYTHING ABOUT IT. \n\nI've been stuck in this house for so long and I'm tired of being helpless but I can't even drive. I can't even complete chores or take care of myself. How tf can I become a functional adult? I feel completely psycho I don't even know if I made sense",
        "created_utc": 1677959573,
        "upvote_ratio": 1.0
    }
]