[
    {
        "title": "Learning to exude more positivity/warmth and receptiveness rather than being habitually negative?",
        "author": "gaudyleathergloves",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11orad3/learning_to_exude_more_positivitywarmth_and/",
        "text": "\nI am negative towards myself, to the point that it makes me genuinely nauseous and uncomfortable if I were to state that there was anything definitively nice about myself.\nI recognize myself to be undeserving of gentleness or care, and to be an inherently grotesque individual. And I am also severely afraid of disappointing others so that I have to preface my statements with something deprecating so that they never assume that I have an ounce of undeserved confidence and have to challenge me on that. I want them to know that I am aware of all my shortcomings so they don't have to tell me.\n\nThese sentiments and concerns and mindsets turn me into a bitterly presenting individual. I behave explicitly selfishly, I seek attention and assurance, and I forget to push that aside and truly listen to the other person. It is of great detriment of my already poor conversational skills and in order to advance myself, I must learn how to not do that.  \n\nI would like to, instead, come off as more selfless and receptive and caring. I would like to appear less mentally messy and create a friendlier and purer impression of my character. I would like to forget about any desire for self assurance and restrain my desire for attention. In more blunt terms, I need to shut the fuck up for and do something good for once in my life.\n\nWhat is a good starting point for this acquisition of virtue? Or, what are some personal insights you may provide... if possible... thank you.",
        "created_utc": 1678559455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn’t my mind learn?",
        "author": "peachy_queenx",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11or02w/why_doesnt_my_mind_learn/",
        "text": "I have suffered will mental illness for over half my life now and I still can’t fathom how despite mountains of therapy, medication and just general experience that my mind can’t compute that worrying and stressing gets me nowhere!? \n\nI’m currently in a three day spiral and I’m finding it hard to keep a positive mindset. \n\nAny mantras or personal experience would be greatly appreciated.",
        "created_utc": 1678558760,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to improve if you desperately lack discipline?",
        "author": "tummy-app",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oqxg8/how_to_improve_if_you_desperately_lack_discipline/",
        "text": "I know what I want and I know what to do and I just CAN NOT bring myself to do the right habits for more than 1-2 days in a row. I eat like shit, I don't exercise, my sleep habits are sloppy, I skip meditation every day, and I spend my time scrolling Reddit instead of doing things that I truly enjoy.\n\nHow can I turn this around?",
        "created_utc": 1678558574,
        "upvote_ratio": 1.0
    },
    {
        "title": "experience = growth",
        "author": "LizzSaldana94",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oqk9j/experience_growth/",
        "text": " The world is full of experiences, wonder, beauty, and \"new things\".  But you and I are stuck.  We are stuck in our comfort zones.  We like staring at our Apple phones.  We like staying in our rooms watching tv, doing nothing.  But the greatest,  most crucial experiences are in discomfort.  The most important experiences are what we endure through.  The most memorable experiences are those chances we take, those risks.  Do not define your self by what you already do, always try to change your perspective, the music you listen to whatever it is. if you are convinced you are a homebody try to change that by going outside.  You'll see that the other side isn't so bad after all.",
        "created_utc": 1678557690,
        "upvote_ratio": 1.0
    },
    {
        "title": "This subreddit is full of liars. The dating subreddit opened my eyes. You tried to lie and tell me brown and short and inexperienced isn't bad. Yet they tell me it is. I am done being lied to",
        "author": "RefrigeratorKey1518",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oq8dr/this_subreddit_is_full_of_liars_the_dating/",
        "text": "I feel my trust broken by this subreddit I considered you all family. I am heartbroken.\n\nYou told me to keep pushing throuhg and be positive and keep working on myself and the rest will follow through.\n\nYou never bothered to tell me women are repulsed my inexperienced men in their 20s, and that being brown and 5'6 is seen as a handicap no matter how fit. Why would this sub lie to me?\n\nYou know how much it sucks that I can be the best guy I can be, and yet because I am a virgin I am a repulsive person. Even if I am willing to learn in bed and communicate. Fuck this reddit and fuck this life I am done, I am ending it",
        "created_utc": 1678556878,
        "upvote_ratio": 1.0
    },
    {
        "title": "So my thing isn’t like alcohol or drugs, I’m just a controlling person and I want some advice on how to stop",
        "author": "Either_Remote1341",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opyso/so_my_thing_isnt_like_alcohol_or_drugs_im_just_a/",
        "text": "I think I might have some sort of fear of abandonment so I try to control how my partner acts to not make me feel that way, and I didn’t even realize it until recently. \n\nI asked her to stop saying ok because she was being really dry and uncommunicative and I thought that asking her not to say okay would make her think more and put more effort into the conversation\n\nShe often jokes around and insults me but that’s her way of flirting. And I liked it but it wasn’t being accompanied by some form of affection I was unferstanding or feeling, so I was starting to just feel like a punching bag.\n\nI told her that too hoping she would start showing affection in some other way but she just stopped joking, and now we just barely talk.\n\nToday I asked her what was wrong and why we weren’t talking, she said nothing but I told her she’s been dry, she mentioned I asked her to stop joking and stop saying ok, eventually it leaded to me asking her to not listen to what I tell her, which then made me realize I was controlling\n\nI asked her if she felt that way, she said it doesn’t matter. I told her “don’t let me control you, don’t listen to what I say” and she said it goes both ways and that I need to stop being controlling.\n\nI’m not really sure how so I’m here to get some tips, hopefully the story helps",
        "created_utc": 1678556205,
        "upvote_ratio": 1.0
    },
    {
        "title": "To the users who are trying to get a gf/bf",
        "author": "ripmyringfinger",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opw5q/to_the_users_who_are_trying_to_get_a_gfbf/",
        "text": "That’s not a priority.\nI’m so tired of people saying that they do this and that but cannot get a girlfriend. Or that their appearance makes them get rejected.\n\nLife isn’t about getting a gf/bf. You are treating someone like an object or a key to escape misery. \n\nI too want someone to hold me and to love me unconditionally. The only person that can help you is YOURSELF. \nI too am an average looking girl. And that’s alright. Don’t hate what you cannot change. \nI too was slightly desperate for a boyfriend. That was until I realize my friend shouldn’t be with someone like me. You can change your mentality and mindset. \n\nEven if you do have a gf/bf. What next? You think your depression will magically be cured? No it cannot. You fight your own demons. You fight your battles. \n\nYou guys got this, focus on yourself. \nContinue to being the best version of yourself. Be kind to everyone and yourself too.",
        "created_utc": 1678556026,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stay asleep for 6+ hours at night?",
        "author": "Intelligent_Help_489",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opqcl/how_to_stay_asleep_for_6_hours_at_night/",
        "text": "What has helped you the most to fall asleep and stay asleep for at least 6 hours at night?",
        "created_utc": 1678555624,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help on how to make money.",
        "author": "Levi_inthevoid",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opm3y/i_need_help_on_how_to_make_money/",
        "text": "I am  20 year old boy and been doing graduation. I just need help and tips on how can i make some money while doing my graduation parallely.",
        "created_utc": 1678555322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank you to this sub for its kindness. I am very broken but I am getting better. I can't fix my past but I can change my future.",
        "author": "RefrigeratorKey1518",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opem5/thank_you_to_this_sub_for_its_kindness_i_am_very/",
        "text": "Thank you to this sub. I have spent days on here and most of the sub knows how broken and weak I am. I can never change my skin color or my height but I can change my weight (which I am doing via lifting and dieting). \n\nI can change my financial status by graduating grad school and making a ton of money and dressing better. I can change my mental status by going to counseling and therapy. I can change my outlook on life by being grateful at every little thing. I can't change my last 25 years but I can change my next 5.\n\nI can't change my past( I went through college and never had wild hookups, pregnancy scares, even couldn't get a single date) but I can change my future. I can be the best me mentally and physically and hope and pray that some girl out there doesn't mind a guy who didn't sleep around a-lot and doesn't have much dating and sex experience but is willing to learn. I can pray that she accepts that I will listen and learn and hope that is enough.\n\nI can start reading books on becoming a better man, how to pleasure women, and how to get my finances in order.\n\nAnd worst comes to worst, I can end myself on my 30th.",
        "created_utc": 1678554801,
        "upvote_ratio": 1.0
    },
    {
        "title": "This one is for the Women",
        "author": "EducationalFly5614",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opc89/this_one_is_for_the_women/",
        "text": "Knowing what you know now, what advice would you give you’re 21 year old self? \n(I’m just looking for some guidance)",
        "created_utc": 1678554634,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop dropping things once I reach my goal?",
        "author": "Robo_Bread",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11opb9g/how_do_i_stop_dropping_things_once_i_reach_my_goal/",
        "text": "Like in skincare, once I get the skin im looking for I drop it, I drop the habits that made me reach that goal. or in exercise, when I reached my body goal, I also dropped it. How do I stop doing this? I do not want to go back to square one over and over again.",
        "created_utc": 1678554571,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Method] 12 Signs You’re Being Gaslighted Without Knowing It",
        "author": "rishisarva",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oouzo/method_12_signs_youre_being_gaslighted_without/",
        "text": "Gaslighting is a form of psychological manipulation typically used by narcissists, sociopaths, and psychopaths. \n\nYou’ve probably heard the term before, but might not be completely aware of how it works – or if anyone you know has been using it on you! Gaslighters basically manipulate how you see reality. \n\nThey cause you to question your own abilities, memories, and even your sanity. \n\nWhen you’ve been gaslighted, you often feel like something is wrong with you, but you are not certain what or why. \n\nHere are some of the tactics gaslighters use to confuse and manipulate you!\n\n**1. They Lie To You** \n\nGaslighters are habitual and pathological liars. They will tell bald-faced lies and then insist that they are telling the truth – despite all evidence to the contrary. \n\nYou can’t convince them to admit to a lie. In fact, they will insist that any evidence you might offer, is itself a lie. \n\nThey demonstrate such conviction in their lies, that they can cause you to second-guess objective truth. \n\nThey will insist on “their truth” and can do so very persuasively. They can keep you feeling confused and off-balance. \n\nEven when they don’t fool you, you can be left with the impression that they are being perfectly sincere, albeit their position or perception is obviously wrong. \n\n**2. They Undermine Your Reputation** \n\nGaslighters can identify people who will take their side, no matter what the issue may be.\n\nThey then recruit these people to attack you by making up rumors that call your character – or even your sanity – into question. They may even state that they are concerned about you and suggest to others that your behavior is disturbing.\n\nThis approach can be very effective. By initiating and then dominating the narrative, the gaslighter will gain allies while keeping them in the dark as to what is really going on. \n\nThey may even tell you that other people think there is something wrong with you – while others might not be saying any such things at all. \n\nBut unfortunately, a gaslighter can be very convincing and this can devastate your relationships with people. \n\n**3. They Steer You Away From The Actual Topic**\n\nWhen you ask a gaslighter about something or try to nail them down for something they have said or done, don’t be surprised if they change the subject without addressing it. \n\nThey will often either ask you a question to deflect you or accuse you of something. \n\nA gaslighter will typically react by claiming that they never said what you say they did. They will accuse you of remembering incorrectly or imagining things, or suggest that you got the idea from your “crazy” friends. \n\n**4. They Ridicule How You Think And Feel**\n\nA gaslighter may try to gain control over you by discounting your feelings and thoughts. \n\nThey will accuse you of being overly sensitive or tell you that your thought processes are faulty. \n\nTypical statements include, “don’t you think you’re getting too emotional?” or “how in the world could you think something foolish like that?” By trivializing YOU, they disarm any point of view you have or any argument you make. \n\nThis can make you question yourself and the validity of your own views and feelings. You could then come to lose self-confidence and even self-respect, leaving you vulnerable to their thought control. \n\n**5. They Transfer Blame** \n\nGaslighters love to transfer blame to others. If you sense that someone is constantly twisting a discussion to place blame on you, that person is very likely a natural gaslighter. \n\nThese people don’t stop at facts! If you try to simply talk about how they are making you feel, a gaslighter will construe what you are saying to blame you for how you feel. \n\nThey are so adept at this, that you can end up thinking that THEIR bad behavior is YOUR fault. They even tell you that they would treat you better if only you acted differently. \n\n**6. They Deny Doing Anything Wrong**\n\nGaslighters NEVER do anything wrong, and they are never responsible for anything that goes wrong. \n\nIf they make a bad decision or fail at something, they avoid taking responsibility for it. If their actions have caused you pain, they will not admit to it. \n\nGaslighters do not apologize! This behavior further injures and frustrates victims, who are left wondering what they have done to earn such treatment. \n\nAs a result, these victims are often unable to overcome their hurt feelings.\n\n**7. They Turn Compassion Into A Weapon**\n\nWhen cornered, gaslighters will appeal to your compassion and understanding. But they use compassionate words merely as a form of attack. \n\nThey may say something like: “How could you think I would ever do anything to hurt you on purpose? You know how much I care for you!” It “sounds” like an apology, but it is really an accusation. \n\nIt is not authentic, and you will feel somehow unsatisfied with it, although you might not realize why. \n\n**8. They Twist And Reframe Conversations**\n\nGaslighters especially like to use this one during a discussion about a past event.\n\nFor example, they may reframe a conversation where they claim that you gave them permission to spend your money. They know it didn’t happen, and you know it didn’t happen. \n\nBut if you try to confront them about it, they will just further fabricate the story. \n\nThey will explain how they asked when you were busy doing the dishes and you said that it was fine. As with their other tactics, gaslighters try to confuse you and make you question your own memories and perceptions. \n\nRead original: 12 Signs You’re Being Gaslighted Without Knowing It",
        "created_utc": 1678553461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a way for me and my girlfriend to organize ourselves.",
        "author": "Jicko1560",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oogk3/looking_for_a_way_for_me_and_my_girlfriend_to/",
        "text": "Hi everyone,\n\nAs the title implies, I'm looking for a way my girlfriend and I can organize ourselves. We keep not doing things we really need to do, wether it's paying bills, calling for doctor appointments, or even simple things like vacuuming.\n\nI thought about using an app, but most app I've seen seemed complicated, difficult to share and more work organization related than personal care. I'm really not sure which way to go now.\n\nWould anyone have an idea? How do you guys organize yourself so you can things done and not just forget them?",
        "created_utc": 1678552425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today I finally got off the merry-go-round",
        "author": "hanon318",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oogcr/today_i_finally_got_off_the_merrygoround/",
        "text": "I finally have enough self-awareness and pattern recognition in myself that I was able to break a toxic cycle my parents and sister go through and used to drag me into:\n\nIt would go like this: my (28F) sister (20F) who is still figuring out who she is and wants to be, would get pissed at my very conservative, very strict parents, and come to me about it. I’d head her out, give her good advice, try to help, tell her I understood (because I went through this with my parents too to some degree; difference a I just broke free entirely and my sister never had). A week or two later, I’d hear from my mom-totally different side of the story, it would change my perspective, and long story short, I’d get dragged into the drama. When they made up, which they always did, I was typically the one who got burned for taking sides or telling one or the other of them where they went wrong, like telling my mom she can’t tell her 18-year-old daughter that she can’t wear shorts, or my sister that she needs handle the disagreements without just disappearing and refusing to talk to my parents anytime they upset her. They’d talk about me behind my back about what I’d said, and even though I thought it was pretty reasonable, solid advice, I’d always got turned against me and I was the odd one out.\n\nToday, my sister messaged me telling me she’s taking a step away from our parents, said they’re disapproving of her life choices, and vaguely hinted that they’ve said some mean things about me behind my back. I know she as waiting for me to ask about all of I it. \n\nI didn’t. I told her that she and she alone is responsible for her choices and she will be the one to bear the consequences, bad or good, so it’s best to think them through carefully and if she’s done that, she’s going to be ok. I told her whatever is going on with mom and dad (didn’t ask, on purpose)while they are not perfect, they do love her and I’m confident they’ll work it out. I told her I love her too, and our parents, and look forward to seeing them at Easter. Then I said to enjoy her weekend and that I had to leave for the gym now.\n\nI feel proud of myself for refusing to play this game. I love all of my family but I’m not somebody to be used in their arguments and i know I’m capable of refusing to do it. I’ve ridden that merry-go-round too long, but not anymore. And best of all I did it while remaining calm and collected and fixing good (though generic) advice. I also refused to take the bait about whatever may or may not have been said about me behind my back.\n\nI feel good about this and wanted to share.",
        "created_utc": 1678552409,
        "upvote_ratio": 1.0
    },
    {
        "title": "i despise myself for eating but my mouth feels lonely when im not",
        "author": "wingscutoff",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oodsq/i_despise_myself_for_eating_but_my_mouth_feels/",
        "text": "Sorry for the bizarre title, but this somewhat defines my whole life. I hate eating, but I appreciate food. Sometimes, I wish I could eat without the food getting into my stomach. Somedays, I work out too much. The rest of the days, I'm sobbing over not feeling like working out. \nI was eating healthy and drinking enough water, and then a few days back, my friend came over, and we celebrated an event with alcoh*l. It's been 4 days now, and my mouth constantly feels the need to chew on or taste something. I don't have a strong gag reflex and can't puke the food out and it makes me feel so terrible and I can't even get myself to workout now and get better anymore thinking,\"What's the f*cking point!?\".\nSorry for the ramble, but maybe a temporary solution would be more than enough for now.\nThank you!",
        "created_utc": 1678552235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stoicism for anxiety",
        "author": "MoonKnightQueen",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oo3e4/stoicism_for_anxiety/",
        "text": "I wonder if anyone here is practicing Stoicism? I'm following DailyStoic and found their daily newsletter very helpful. I've been dealing with acute anxiety, and Stoic principles really help me put things in perspective. I think the very first thing to deal with anxiety is to examine your perspectives, in particularly your WANTS and your FEARS. Most of the time you are anxious because you want something out of your control (like money, status, etc.) and you are afraid bad things will happen if you can't have those things under control. So, I found these two-step practice helps to calm my nerves (no matter how temporary) when dealing with anxiety:\n\n1. Recognize my thoughts: knowing what I am anxious about really helps. When I am anxious, I'll take some time off what I am doing, take a deep breath and take a walk outside to process the currents of thoughts that overwhelm me. I then realize that what I am worried about is something I have no control over, no matter how I want it to happen. I tell myself: there's nothing I can do about it. The only thing I can do is to focus on the present, and do the best thing to take care of myself and my loved ones. Life is short. There's no need to worry about things that may or may not happen.\n2. Assess my fears: Normally, I am anxious because I am fearful that something bad will happen. In those moments, I remember what is written in the book How to stop worrying and start living by Dale Carnegie, think of the worst case scenario, and see if you can deal with it. Turns out in most cases, I can. It might hurt my pride to not succeed, but I'll survive and maybe I can even make something better.\n\nFinally, I keep thinking about my mortality daily. Life is short, I may die tomorrow. The rose garden in the horizon may never come. Of course, we are faced with so many inconveniences in our daily life, big or small. And there are days when we will break down and cry. But knowing that these moments will pass, as long as we are alive there's always something to live for.",
        "created_utc": 1678551497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stoicism to deal with anxiety",
        "author": "MoonKnightQueen",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oo0lb/stoicism_to_deal_with_anxiety/",
        "text": "[removed]",
        "created_utc": 1678551297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memories Of regret",
        "author": "Non_Class_Wiseguy85",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11onrnx/memories_of_regret/",
        "text": "There are times that ether I'm doing something or just laying in bed and I get memories of something I did or happened to me in the past, I know that I shouldn't let it get to me but when it dose happen, It hurts me mentally and at my core (spirit and heart) and I make a reason as to why but they still come and it hurts.  Don't know why and I don't know as to how to really deal with them. I think it's because I overthink these things and find reasons to think back and wonder if I should have done it differently.   Any ideas??",
        "created_utc": 1678550665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-improvement as a leader",
        "author": "SunRise34",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11onqss/selfimprovement_as_a_leader/",
        "text": "Something I’ve experienced. \n\nNice leaders…\n\n•can be vague and unclear when giving positive or negative feedback.\n\n•may fail to follow up with employees when putting a plan together for their improvement.\n\n•may be reactionary to conflict rather than responsive and strategic.\n\nSo leaders - Be nice. Be prepared. Be growing. \n🙏🏻 💜",
        "created_utc": 1678550605,
        "upvote_ratio": 1.0
    },
    {
        "title": "me(uncut)",
        "author": "Impressive_Fix4935",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11onohn/meuncut/",
        "text": "Over the past few months i have been recovering over a breakup , i was a very confident guy , pretty social i would say having a pretty decent amount of friends and very close set of relationships until one day i met my gf.my gf and i were best friends until we started seeing each other as lovers , , we loved each other like all couples do and i was on cloud nine. we hardly had fights and our friends like that chemistry we had with each other , we were in the same school for 3 months when she had to live in another country , howver even in LDR we still somehow managed to keep our relationship healthy for the first 3 months , problems of communication happened when i was feeling a bit lost due to some issues with myself , that i had trouble communicating with my gf , we then hardly talked during calls or we hardly text and by novemeber she broke it off , i was honestly in my denial abt gthis and was kinda clincally depressed , that after the break up i lost a lot of confidence on myself , and was spending most of my days in solitude , while my parents try to make me feel better. My friends didnt know any of this for the first 2 months of the breakup only because i was bit ashamed to tell this , and not telling them drove me insane and socially awkward for a while.I went to therapy for sometime but hardly any improvement. After a few months after the breakup i started spending on the idea of self improvement hoping that i can be that confident self i started watching podcast , watching course on social skills watching videos on looksmaxxing , reading a bit , i have adopted a new morning routine where i journal and meditate for and have a 20 min workout at 5 am for every day . i started going in the idea of becoming more spiritual started to pray again. i would say that i hardly seen result but i have been more optimistic that the months before and would like to become a better person by the end of this year",
        "created_utc": 1678550455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Result of Day-1",
        "author": "Subash-11831",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11on82s/result_of_day1/",
        "text": "I woke up at 5am, worked out, then started studying. I haven't touched my phone or texted anyone. I started my nofap journey today, learnt some pages from a book called \"Cashflow Quadrant\". I ate some healthy food, then kept on studying and writing assignments. At evening a girl from my class texted me, I ignored her after an hour she called me. I asked her, what she want ?. She asked for pictures of my assignment, I told her I will send her those pics. Then she tried to start a conversation with me, I told her I am busy and I will speak with her on Monday and hanged up. I had 3 assignments but I only completed 2, which is bad but, It is still better than nothing. I didn't practice martial arts today or learn psychology book, but still this is one of my productive days. That's it for today Guys, I will post my next day schedule tomorrow morning. Bye Guys!!",
        "created_utc": 1678549315,
        "upvote_ratio": 1.0
    },
    {
        "title": "are skills like sales/copywriting/marketing and other business skills even worth studying in depth?",
        "author": "ImArealAlchemist",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11omwns/are_skills_like_salescopywritingmarketing_and/",
        "text": "So far i've only read two books on business/copywriting. \n\nMaking ads pay by john caples. \n\nand cashvertising by drew whitman. \n\nThe thing about what I want to know is that i feel very confused on if I actually learned anything worthwhile. The books took me a few days to get through, i wrote down notes and guess what. It felt like a guide on mastering a soft skill. Like those interpersonal skills similar to knowing how to talk to people. Just something very insignificant.\n\nMaybe I haven't gone deep enough yet, but are those actually skills or are they just softskills ?",
        "created_utc": 1678548500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you guys even on self improvement ?",
        "author": "TrueSamuraiMind",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11om7k2/are_you_guys_even_on_self_improvement/",
        "text": "I'm new to the community and to reddit. \n\nI'm exploring around this subreddit and I'm wondering if we have the same definition of self-improvement? \n\n**All I see here is people regretting the past.** \n\n\"I've ruined my life\" from people in their twenties, with no disabilities or particular problems, it's pretty pathetic.\n\nIf you want to be happy, it might be time to stop whining about the past for no reason: every minute you spend whining is a minute you don't spend enjoying the present (which you'll have to whine about later) or building your future (the same).\n\nYou are not doing yourself any favors by posting a \"vent\" in which you feel sorry for yourself. I understand that it's a big deal to you that you didn't enjoy the so-called \"best times of your life\" enough, but seriously, do yourself a favor and stop writing long paragraphs to put yourself in the position of a miserable person. You're better than that and you still have tons of great moments to live. Worse, by doing this, you are reinforcing that negativity in yourself by degrading your self-perception.\n\n**Here's a list of things to keep your mind busy and improve your mood.**\n\n*- Do you regret not having enjoyed yourself enough in the past? Practice 10 minutes of gratitude to appreciate the present*\n\n*- Feeling sad all the time and are slaves to your emotions? Read some books on stoicism and* \n\n*- Clear your mind by practicing meditation.* \n\n***These are the BASICS of self-improvement***, you know, the supposed topic of this community? \n\nYou have a lot of work to do, and you better do it, because your happiness is only an issue for you and you are the only one who can shape it! \n\nLet's get to work!",
        "created_utc": 1678546694,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for a hardcore accountability partner.",
        "author": "Professional-Trick14",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11om2d4/im_looking_for_a_hardcore_accountability_partner/",
        "text": "I'm at a crossroads in my life. If I don't grind 40-60 hours per week for the next few months, I could be forced into a life that I don't wanna live —  at worst, homeless.\n\nMotivating myself is really hard. I know that I could do better if I had someone who helped keep me accountable. I'm looking for someone who feels the same amount of pressure that I do even if it's self-imposed, someone who wants a trustworthy friend that they can depend on for giving them constant encouragement. We will be accountable to each other equally: always checking in on each other, giving advice, helping each other reach our goals.\n\nIf anyone feels like they need this in their life, please reach out to me or comment on this post. I would love to connect with you on a personal level.\n\nBTW, this is not an offer for paid services or an opportunity for you to offer your paid services. I'm looking for a strictly platonic, mutually beneficial relationship where NO money will be exchanged.",
        "created_utc": 1678546313,
        "upvote_ratio": 1.0
    },
    {
        "title": "the real reason hamza quit youtube",
        "author": "Willing-Highway-7083",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11olpyk/the_real_reason_hamza_quit_youtube/",
        "text": "just found this new video from channel @ fr888nk link in comments",
        "created_utc": 1678545409,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will be great",
        "author": "Alternative_Panda643",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11olpeq/i_will_be_great/",
        "text": "I want to be great in the Last 3 years i wanted to Change my Life and get rid of my addictions but I Always failed \nI Hate my addictions to the Internet (mostly YouTube)\nAnd my porn addiction I have ADHD so ITS hard to Concertrate so I often Just watch yt or porn because Its instand dopamine and I dont have self dicipline.\nI have No Friends and my Hair is falling Out I Always get cheated on.I hate my Life and wanted to end it but then I changed my mind because I dont want to die as a fucking loser so I since 5 weeks I Go to the Gym and eat more food because I'm very skinny Now I have to conquer my addictions and I am going to make a dopamine Detox for a month so that I cant get rid of my addictions In that Time i'm going to build Up new healty Habits so that I can avoid Instand gratification in the Future.Thats my final Statement because thats Just the start of my Journey I have to feel unconftable everyday to grow as a Person No more Quiting I have Up soo many Times everytime I have up It Made me feel worse and I keept Hating myself even more No more \"Just this once, only one quick Video,Just this Last Nut\" I wont listen to my quitter mind anymore.\n\n(Sorry my grammar is very Bad and the Bad Text structure😭)",
        "created_utc": 1678545367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help cracking my gaming at work habit",
        "author": "DragonflyChoice5074",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ol8nw/need_help_cracking_my_gaming_at_work_habit/",
        "text": "TLDR at bottom.\n\n&amp;#x200B;\n\nI have what seems to be a chronic gaming addiction. Throughout my university years I worked a few student jobs in offices and developed a pretty bad habit of gaming during work hours. As student jobs usually aren't very demanding, I took advantage of the downtimes to open up a new tab and play shitty online browser games. It started to worsen in my last semester where I actively gamed at my last student job even when there was work to do, but I just built up a habit of casually opening a new browser and playing \"a quick round\", which pretty much always turned into many rounds and taking up hours. Obviously my work quality and speed suffered. Try as I might, I could never crack the habit and it sounds so stupid because putting down a game and just doing my work sounds so simple, but I'm just having such a hard time doing it.\n\n&amp;#x200B;\n\nNow that I've graduated and have moved on to full-time remote work, where I've gotten very comfortable and find myself gaming for most of the work day just playing crappy IO games online. I do the minimal amount of work at a very leisurely pace, honestly probably just enough to keep me from getting fired though I'm fairly certain my coworkers/boss have quietly noticed that things are moving slowly on my end. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI've frequently heard the solution of \"occupy your freetime with other hobbies\" but honestly I have MANY projects and hobbies that I would love to do more of, but my lizard brain just keeps prioritizing gaming. Any tips on conditioning my brain to do work consistently instead of taking frequent and long gaming breaks?\n\n&amp;#x200B;\n\nI would be interested in testing for some focus-related mental disorder such as ADD, but there are 2 things keeping me from doing so:\n\n1. I live at home with my family (in true degenerate fashion), and they have no idea any of this is happening and I don't want them to know that I've been gaming during work hours. They also wouldn't take too kindly to finding out that it's a full-blown addiction and that I need outside help.\n\n&amp;#x200B;\n\n2. I'm not so sure about the evaluation process. From what I understand, a therapist's evaluation is based on a set of questions they ask you. For some reason I expected a more concrete or scientific evaluation process, as it sounds easy to lie/exaggerate/omit info to either force a diagnosis or to avoid one depending on whether you want to be branded with something like ADD for life. Let me know if I'm wrong, as I understand there's a lot more to therapy and diagnosing than simple questions and I don't mean to offend the therapists out there, I'm just worried about being mis-diagnosed\n\n&amp;#x200B;\n\nTLDR: I work full-time remotely and am addicted to gaming throughout the day. It's affected my work, hobbies, and passion projects but I can't seem to be able to put the controller down. Possibly have something like ADD but I'd rather test as a last result option as the process of being evaluated/diagnosed scares me.",
        "created_utc": 1678544114,
        "upvote_ratio": 1.0
    },
    {
        "title": "self-improvement frustration",
        "author": "Heavy_Package_6738",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11okz1u/selfimprovement_frustration/",
        "text": "When I look back ,I see that I improved in many aspects of my personality, but I still got a lot of weakness that makes me sick . \nWhen I look for what's left, I feel a lot of tension because no matter how much I try I still have a long way to go... \nhow to deal with being overwhelmed?",
        "created_utc": 1678543386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Developing Your Inner Strength.",
        "author": "EERMA",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ok4rv/developing_your_inner_strength/",
        "text": "Even though life can be a fantastic ride, sometimes it can also knock the wind out of your sails. ***When tough times trigger your insecurities, you can discover an inner strength that will get you through practically anything.***\n\n**Try these ideas to get started:**\n\n**Reflect on the tough times you've had before.** Ask yourself:\n\n· How did I get through that situation? \n\n· What did I do? \n\n· Which of my strengths did I use? \n\n· What did you tell yourself? With the benefits of hind-sight was that right?\n\n· Should I to be in the same situation again, what would I do differently?\n\n· If I were advising somebody else on how to manage this situation, what would I say?\n\n· How will I apply what I have learned to my present situation?  \n \n\n**Learn to talk to yourself in a resourceful way.** This will help you build up your inner strength. \n\n· How would you speak to your best friend about this situation?\n\n· Learn how to craft effective affirmations – I have posted about this on my own little corner of Reddit: it’s easy to find.\n\n· Acknowledge confusion as part of the learning process where you’re working something out.\n\n· When were times not rough? – what made them not rough?  \n   \n \n\n**Deliberate on your thinking.** This will help gain perspective. \n\n· Consider the evidence for and against the thoughts you’re having.\n\n· What alternative explanations are there for the outcomes?\n\n· What are the implications of the outcome? – am I giving myself a balanced appraisal or only considering the worst-case scenario?\n\n· How useful, or otherwise, are my conclusions?\n\n· What limiting beliefs are at play here?   \n    \n \n\n**Consider who you regard as role models and mentors.** You selected those people because you respect and admire them.\n\n· What would they do?\n\n· How would they manage this situation?\n\n· What capabilities and resources do they have that I also have?\n\n· How can I develop the resources they have which I don’t yet?  \n   \n \n\n**Reflect on what you've done or been through that you're most proud of.** \n\n· What are your most significant achievements?\n\n· Did you have moments / periods of doubt while achieving those? – how did you over-come them?\n\n· What personal skills, resources and capabilities did you most commonly use to achieve these things? – how can you apply those to the current situation?  \n   \n \n\nComplete the details of this affirmation: **Now that I have realised / learned \\[what have you learned from reflecting on the above\\], I choose to \\[what have you chosen to do differently / do more of / start doing\\] because \\[the benefits you will gain by making these positive improvements in your life\\].**",
        "created_utc": 1678541090,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 3 days My exams are coming I can't even study addicted to phone . I have a suicidal thoughts Anyone help me",
        "author": "dopaminedetoxxer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ojv8h/in_3_days_my_exams_are_coming_i_cant_even_study/",
        "text": "Please",
        "created_utc": 1678540331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phone usage.",
        "author": "bourbon1980",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ojoc6/phone_usage/",
        "text": "Apparently yesterday I used my phone for 7hrs and 19 mins.  No wonder I'm not getting anything done. Im going to put my phone away and crack on!",
        "created_utc": 1678539761,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i improve my sense of humor?? Like now I have 0 in humor",
        "author": "rextron97",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ojara/how_can_i_improve_my_sense_of_humor_like_now_i/",
        "text": "What should i focus on?? Or should i have to learn some tricks??if anything you know about it please share",
        "created_utc": 1678538635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Addicted to my phone",
        "author": "Addisababaa",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oizl0/addicted_to_my_phone/",
        "text": "Guys I really need help. My phone usage has gone out of control. I average around 16 hours a day on my phone which is no where near close to normal. \n\nEvery time I have a plan to stop my mind immediately forgets about it and I continue using my phone. \n\nI feel like this is really holding me back on my sleep, confidence and overall well being. \n\nAny tips would be greatly appreciated 🙏",
        "created_utc": 1678537704,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am ruining my relationship",
        "author": "sweetestmeee",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oiw5a/i_am_ruining_my_relationship/",
        "text": "Hi, 28M here in 2 years relationship. My Gf keeps getting sad at me because sometimes I Look at other women. I know its bad and it hurts her. Please sharp your advice how I can change.",
        "created_utc": 1678537403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lonely Road Towards Success",
        "author": "Agreeable-Lobster-76",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oipd4/lonely_road_towards_success/",
        "text": "In the past year 2 things have happened. I’ve gain more perspective of myself and the situations I place myself in. The other I’ve let go of all my friends along the way. Unfortunately it’s come down to relationships of familiarity rather than friendship. Familiarity breeds contempt and my life isn’t different without them which goes to show Ive been the one holding on. I’m doing this I’ve started to change my paradigm of what I deserve and who deserves to be in my life. Anyone else have a similar story?",
        "created_utc": 1678536822,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Grow Beard?",
        "author": "TeaRevolutionary8512",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oinsa/how_to_grow_beard/",
        "text": "Hello, I am 22M and I am struggling really hard to grow a full beard. I do have some goatee but that's it. rest is just smooth cheeks. I do face some body shame problems which hurts my self esteem, so that's the reason I want to grow a beard. Currently, I am preparing for an entrance exam so I can't go out much, so to get maximum time for myself.\n\nSuggest me any tips please, it will be helpful",
        "created_utc": 1678536686,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could CHALLENGE your friends on self-improvement, what would that look like?",
        "author": "Nek_12",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ogzb8/if_you_could_challenge_your_friends_on/",
        "text": "I'm currently working on a feature of an app that would allow you to challenge your friends on self-improvement - productivity, forming a habit, or just a task you agreed to complete together. I'm looking for ideas on how would you guys see this in practice.\n\n&amp;#x200B;\n\n* Would you invite many people? \n* Would you just invite someone to a \"duel\" and have multiple \"duels\" running simultaneously? \n* How would you define criteria for losing and winning? \n* Would you like to chat in the app or use your favorite messenger app? \n* Would you ever use a challenge where there are no other participants?\n* Any other ideas of what you would like to have? \n\nI will consider all of your suggestions! I'm really looking forward to this because accountability is one of the most important ways to boost your self-improvement progress and form habits successfully. I personally would love to challenge my friends on NoFap, Exercise or Deep Work sessions.",
        "created_utc": 1678531056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tagged as Restless by my mentor at workplace",
        "author": "Browsing_unrelated",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ogw0g/tagged_as_restless_by_my_mentor_at_workplace/",
        "text": "I agree that i jump from one thing to another. Sometimes i miss details right in front of my eyes leading the task to take longer time to get completed. My mentor (let's say boss) called me restless and said that he's curious if i read things in hurry and write/say anything in exam,to people etc. He says i need to be curious but when i am he says don't go deep into research. When i ask doubts he says it's simple don't get confused in a \"mocking\" tone. Idk if i feel I'm being mocked but i feel that something's not right. I made silly mistakes in past 2 days and I'm being micro managed now.\n\nHow can i improve myself while taking things slow and without making it actually slow. Because I'm pursuing internship. My mentor say it's a learning place but then he asks me to speed things up. What else did you conclude from this post on which i can improve? I think i really need to improve my social interaction. How do i proceed on that?",
        "created_utc": 1678530713,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have absolutely no idea how to meet girls.",
        "author": "SmilingIvan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ogfnh/i_have_absolutely_no_idea_how_to_meet_girls/",
        "text": "Tinder is ok, but not matching with the girls I like much.\n\nI see really beautiful girls in the gym, pool, coffee shops etc. But the idea of a approach seems very much not acceptable these days.\n\nI’m tall, good looking guy (I’ve been told) dress nice, pretty self aware.\nI’m working hard to improve my life. \nI’m broke, with a shit job though.\n\nEveryone seems to be in relationships but me, I have issues with confidence, but I’m really wanting to date now etc.\n\nWhat’s the advice? I’ve been single now for like 10 years, something eventually come along you reckon?",
        "created_utc": 1678529071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling the blues? Here are some simple reminders to boost your mood and not feel low. Emotions can be overwhelming at times. To avoid feeling down, one must follow a healthy diet, connect with others, and prioritize self-care.",
        "author": "HumanWisdomapp",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ogb63/feeling_the_blues_here_are_some_simple_reminders/",
        "text": "Do a breathing exercise\n\nListen to your favorite tunes\n\nTalk to a friend\n\nEat healthy meals\n\nSpend time in nature\n\nSpend time with family",
        "created_utc": 1678528661,
        "upvote_ratio": 1.0
    },
    {
        "title": "A song of encouragement!",
        "author": "Accomplished-Boat470",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ogawv/a_song_of_encouragement/",
        "text": "[removed]",
        "created_utc": 1678528635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Focusing on myself(M18)",
        "author": "Rumple4skin55",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11og850/focusing_on_myselfm18/",
        "text": "I moved a town in rural illinois from Chicago about 2 months ago. Ever since then I’ve been going to the gym and trying to stop bad habits I have and better myself as a person overall. I’ve made friends which is nice, but the one issue that I have is that I get lonely and horny. I try not to pursue anything with women because Im trying to prioritize my life goals and I know I wouldn’t be able to completely focus on them if I was entangled with some lady. I hang out with my friends and family but that doesn’t fill the physical and emotional void that this solitude creates. I don’t do hookup culture or masturbate either so I have no real output for these feelings, what should I do?",
        "created_utc": 1678528362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to find a therapist please help",
        "author": "tiredtie",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11og7ck/struggling_to_find_a_therapist_please_help/",
        "text": "For several reasons I can’t afford to make a face to face appointment with a therapist so I’ve been searching for online therapy sources and I can’t find any trusted ones, could someone that knows please help ? My life has been downhill for the past few years and would appreciate any help 🥹",
        "created_utc": 1678528284,
        "upvote_ratio": 1.0
    },
    {
        "title": "human connection",
        "author": "-lisamarix-",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11og5r2/human_connection/",
        "text": "hello there, i (23/f) don’t like myself. i don’t think I ever did? but I never hated myself as much as i do now. \n\nTwo years ago, I had a really bad break up. And ever since then I feel numb. Not numb in a way that I don’t feel emotions. I just can’t bond with other people. And it makes me depressed. \n\nHanging out with my friends doesn’t fullfill me. I mean yea we are sharing laughs and having fun but I don’t feel connected to them anymore.  \n\nIt’s exhausting.\n\nI started to watch those manifesting videos, in hope to be able to connect again. But it only made it worse. Everything feels so forced, now. \n\nI just don’t know what to do. And at this point I just wanna move away from society and live in a wood cabin and grow my own food, and just live in peace with nature.",
        "created_utc": 1678528133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need people's opinions on drinking alcohol.",
        "author": "CarelessTransition10",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11og4yq/need_peoples_opinions_on_drinking_alcohol/",
        "text": "I am a teen who endeavours to strive for my best self, A grade student, play sports for my county etc. However about a year ago I was introduced to drinking, my dilemma is that I wonder can you still be on self-improvement but enjoy a drink with your friends? I don't want to discredit my hard work however I enjoy having a fun time with my friends. The fact I'm making this post shows that I acknowledge there may be some ambiguity surrounding the ethics of it. Please let me have a second opinion.",
        "created_utc": 1678528050,
        "upvote_ratio": 1.0
    },
    {
        "title": "I play many hours a day but my life is still good",
        "author": "Ordinary-Knee4651",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11og122/i_play_many_hours_a_day_but_my_life_is_still_good/",
        "text": "Hey, i play many hours a day because i really enjoy videogames but i still go to the gym and spend time with family, go outside and all that so i dont consider myself addicted and i am really proud of myself because like 4 months ago i used to play line 14 hours EVERYDAY i would not go to the gym, i even missed showers and i didnt spend that much time with my family so i have changed alot since then and im really proud of myself!",
        "created_utc": 1678527660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 0",
        "author": "DryScience3853",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oftm8/day_0/",
        "text": "[removed]",
        "created_utc": 1678526896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share Your Valuable Life Lessons: Here's Mine",
        "author": "Puzzleheaded-Paint65",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ofqgv/share_your_valuable_life_lessons_heres_mine/",
        "text": "  \n\n* If you love someone truly and completely with all your heart, tell them loudly and clearly. Never deprive them of hearing how much you truly love them. Your feelings won't hurt anyone.\n* It's better to live with failure than regret. Take action, but don't rush.\n* You become your true self when you experience pain. Pain is there to tell you that you need to grow and move forward.\n* 99% of what you experience is in your mind, and only 1% is reality.\n* Clarity is better than cleverness.\n* Work hard, shatter the competition, become the person you desire, and then be yourself.\n* Discipline, consistency, persistence, hard work, and patience will lead to success.\n* Don't feed your desires, pleasures, and fantasies.\n* Life is not linear; it's full of twists and turns. What you truly want will take time, but if you persist and live your life with integrity, you will achieve it.\n* When faced with adversity, acknowledge your pain and feelings, think straight, and don't assume.\n* Jealousy is detrimental to your peace and success.",
        "created_utc": 1678526565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 1 &amp; 2 - Self Improvement",
        "author": "vanillacacao",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ofqbt/day_1_2_self_improvement/",
        "text": "Worked on my physique at the gym. I already feel so much more happier than I was before. The effort was worth it, although it was quite tiring. Sometimes I lose motivation quite easily though, does anyone have any advice?",
        "created_utc": 1678526549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 0",
        "author": "DryScience3853",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11ofkzn/day_0/",
        "text": "[removed]",
        "created_utc": 1678526019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 0",
        "author": "DryScience3853",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11offoe/day_0/",
        "text": "[removed]",
        "created_utc": 1678525479,
        "upvote_ratio": 1.0
    },
    {
        "title": "tips on how to deal with social anxiety",
        "author": "WaveyDavey80",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oezgv/tips_on_how_to_deal_with_social_anxiety/",
        "text": "i have trouble of getting the courage to say hi to someone and introduce myself to them without it feeling awkward please note that i’m still in high school and yes i do know i’m at an age where it’s normal to feel like this but i am one year away from becoming an adult and it’s important to work on stuff like this to be prepared of what’s to come in life",
        "created_utc": 1678523859,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 Productivity Myths You Believe",
        "author": "achieving_flow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oesni/3_productivity_myths_you_believe/",
        "text": "#  The Myth Of “I Don’t Have Time”\n\n“Time is what we want most, but use the worst”\n\n**Our time is entirely in our control, we choose what to do.** You actively choose not to do that specific task, it is not a priority. You waste a lot of time, find out what are the time wasters by tracking what you do and when you do it and eliminate or reduce them. **Time isn't something we don't have it is something we could utilise better.**\n\n# The Myth Of Motivation\n\n“Success leads to motivation, which leads to success which leads to more motivation”\n\nWe think we must feel motivated to do a task but that’s far from the truth. **Motivation is merely a feeling and can be neglected to complete a task.** Our feelings are too volatile and are easily affected. **What we need is discipline.** \n\n# The Myth Of Multitasking\n\n“If you are getting distraction, you are allowing it”\n\n**You can’t get more done to the same quality by multitasking.** Why? Because **you can’t be 100% focused on a single task when you constantly switch between two or more tasks.**",
        "created_utc": 1678523189,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to work less hours, and work harder and smarter.",
        "author": "One_Button4120",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oe3g8/how_to_work_less_hours_and_work_harder_and_smarter/",
        "text": "well if you want to work harder and smarter, you have to change your internal state.   \nInternal state is important to subjegate yourself to understand.  \n\n\nSatiating your thoughts at hand; who your trying to beat?   \nWhat is your objective?  \nWhat are you trying to accomplish? \n\n  \nUnfortunately to be successful in any of these- you cant tie them to externalities,   \nIt has to come from an internal source of conviction.   \n\n\nYoure not trying to beat other people, youre trying to battle your own demons- so you can handle the necessary difficulties and obstacles to go to the next level. Your objective isn't trying to reach a goal, your objective is to try figure out what you need to work on and your accomplishment is a byproduct of who you are from the PAST, and only a measurement of your PAST track record.",
        "created_utc": 1678520724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your thoughts, feelings and actions literally dictate your entire reality.",
        "author": "ValiantMale",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11od9vq/your_thoughts_feelings_and_actions_literally/",
        "text": "[removed]",
        "created_utc": 1678517771,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting rejected and it’s affecting my self esteem",
        "author": "moonlightsunsh1ne",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oc41r/i_keep_getting_rejected_and_its_affecting_my_self/",
        "text": "I (22f) keep getting rejected. Recently I was ghosted and I'm taking it hard. I've\nbeen ghosted before, but this time it hurts more. He left me on delivered and his\nsnapscore is increasing by hundreds. I feel ridiculous for checking but every time\ndo, I start to wonder what's wrong with me. This is probably the 10th time in the\npast year that a man I like has ghosted me or rejected me in some other way. I\ndon't mean to brag, but I believe I have a good personality, so I am aware that m\nappearance is the problem. The fact that this is a reoccurring thing makes me\nunhappy. I believe there is no way I will ever meet a guy who is attracted to me\nand I hate that I reached this mindset. I want to stop romanticizing romantic love\nand concentrate on loving myself. Any advice is welcome",
        "created_utc": 1678513673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting rejected and it’s affecting my self esteem",
        "author": "throwRAway00980",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11obxyh/i_keep_getting_rejected_and_its_affecting_my_self/",
        "text": "[removed]",
        "created_utc": 1678513100,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting rejected and it’s affecting my self esteem",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678512872,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you learn to be okay after getting rejected a thousand times?",
        "author": "throwayo13",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11obs8q/how_do_you_learn_to_be_okay_after_getting/",
        "text": "[removed]",
        "created_utc": 1678512577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like I have no identity",
        "author": "Alive_Initiative_314",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11obg8d/feel_like_i_have_no_identity/",
        "text": "25M recently out of five year relationship. Feel like I let the relationship consume my identity. I’ve lost all confidence and self esteem. I’m at a six figure job, have a supportive friend group and I’m fairly attractive and in decent shape however I feel like I have no social skills. I have been going to the gym and trying to discover new hobbies (learning a new language currently) but I feel like I’ve watched all my friends socially develop around me and I’m just left behind. Can’t figure out how to better myself mentally. I have a fear of being alone and have sever abandonment and codependency issues which I’m currently in therapy for. When I’m in relationships I let it consume me and it becomes my life. I just want to learn how to develop into a social butterfly. I’m currently attempting to put woman and relationships on the back burner right now and develop myself as a independent functioning social adult. Any life tips or experiences would be appreciated!",
        "created_utc": 1678511450,
        "upvote_ratio": 1.0
    },
    {
        "title": "🙅‍♂️ Don't Do This If You Want To Be Productive",
        "author": "achieving_flow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oazv7/dont_do_this_if_you_want_to_be_productive/",
        "text": "**Do you ever get that feeling of disappointment when you don't complete what you have set for yourself that day?**\n\nAfter a long day at work, I come home tired and worn out. **Knowing I have set myself tasks to complete, I force myself up and onto my desk to complete them.** \n\n**Sluggishly, I attempt to complete them but to no avail.**\n\nI lay in bed that night, **dissatisfied with my output and I proceed to condemn myself.** \n\n**But what does that do?** \n\n**It accomplished nothing but make me feel horrible.** \n\nAfter a few more similar nights, I finally decided to not follow this route again. \n\n**I try my hardest but never allow myself to beat myself up over it.** \n\nI now allow myself to take days off when I feel sluggish after work. \n\nTo make up for those days, I put in extra work when I have the energy and determination to do it. I am doing that right now. \n\n**So, don't beat yourself up next time you are disappointed with your productivity.** \n\n**Move on and focus on the next day.** ",
        "created_utc": 1678509978,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should i do to lower my time on internet?",
        "author": "Murky-Arugula63",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oar22/what_should_i_do_to_lower_my_time_on_internet/",
        "text": "I am aware of the problem that i have a screen addiction,and many time i decided to quit it.\nBut whenever i get the offline for a while i feel like that i will \"missout\" on something and i get back online.",
        "created_utc": 1678509189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Year of intentional singleness (29M turning 30 soon)",
        "author": "Wolfman8193",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11oa3dh/year_of_intentional_singleness_29m_turning_30_soon/",
        "text": "I'm doing a year of intentional singleness this year. \n\nPart of the reason why is because I separated from some toxic people in my life and I want to start my thirties fresh. I never knew life could be so drama-free. I've been in a relationship or pursuing romantic interests every year for the past sixteen years. After getting dumped by a fearful avoidant before Christmas, I decided it was time to focus on myself. She was awesome. I really dug her, but I know it's time to focus on me because I'm still attracting unhealthy people.\n\nI was inspired to do this after seeing a divorced friend loving Valentine's Day for the first time because he ordered pizza and watched a movie by himself. I've never seen him happier. It was a wake-up call to me to enjoy this brief period. I do have a hunch I'll meet my person soon, whatever that means. I'm in no hurry any more. \n\nSo far with my free time, it's a lot of reading and suddenly having time to watch movies. I'm loving it, but it feels weird not being on apps. I never realized how much time they took up of my life. I'm looking for new friends now too, and that's been a different experience. \n\nFor those that did something like this, what did you do with your free time - and what would you recommend exploring?",
        "created_utc": 1678507089,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m very judgmental of my own and others bodies and I don’t want to do that. I need advice",
        "author": "Plupert",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o9bxk/im_very_judgmental_of_my_own_and_others_bodies/",
        "text": "I spent a lot of my youth being bullied for being short, skinny ugly etc.\n\nI think that made me very judgmental of myself and others. I pass on what those people did to me. Note I don’t say these things out loud but I definitely think them. And in turn this makes me even more critical of myself and kills my self esteem.\n\nI’m particularly judgmental against fat people, or just larger/sticky people in general. \n\nWhenever I see a bigger/stocky guy, I just think of the guys that gave me shit as a kid for being small. When I see a fat person I find them repulsive. I just see them as gluttons.\n\nThe worst part is I know I shouldn’t be making assumptions and judging bodies bc one, that’s a bad thing to do in general, and 2 half the reason I was so small as a kid was I had stomach issues and it was hard for me to gain weight, and it still is to this day.\n\nI don’t want to be like this, being more positive will help all around in terms of me being open to talk to a wider variety of people and I’d be a better person for it.\n\nBut idk how to get rid of my anger towards stocky people from past trauma and my disgust towards obese people.",
        "created_utc": 1678504697,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to FINALLY Feel Worthy",
        "author": "regeneracyy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o92hy/how_to_finally_feel_worthy/",
        "text": "YO HEAR ME OUT \n\nWorthiness isn’t something you do, it’s not something you achieve\n\nWhen you play the “I NEED TO PROVE MYSELF” game you’re just reinforcing the unworthiness pattern. Trust me when I say IT WILL NEVER BE ENOUGH\n\nSo how do you feel worthy?\n\nIt’s actually pretty simple but it’s nothing you’d expect \n\n‘Feelings’ of unworthiness come from the emotions GUILT and SHAME. They’re just feelings like happiness and sadness. \n\nGuilt looks and feels like a sense of duty and responsibility AND IT CARRIES A LOT OF WEIGHT \n\nShame looks like self-sacrifice (immolation, or living for others) and self hatred. Living for others can be confused with love but it eventually turns into resentment. Love is free of weight whereas shame also Carrie’s a lot of weight\n\nThis weight COSTS YOU ENERGY to carry around. Like trying to run a race with a rucksack really. You might think you look cool carrying that load but it’s really just making you spend energy that could be serving you instead. \n\nThe goal is to let go of the weight by releasing the emotion. \n\nHOW TO LET GO OF AN EMOTION?? It’s simple not easy. \n\nThe emotions a packed down and built up because honestly we don’t want to feel them because they’re painful. Nobody likes to feel at fault (guilt) or embarrassed (shame) so they don’t let themselves feel these emotions. As a result these emotions BUILD UP and distort your perception of reality and they make you think all these silly thoughts.  \n\nThoughts come from emotions. Happy emotions lead to happy thoughts and sad emotions lead to sad thoughts. Once the emotion is released the thoughts just go away. Unworthy thoughts just come from “unworthy” feelings so all you have to do is let yourself feel the emotions you’ve been avoiding for so long\n\nYes it’s painful, yeah it’s uncomfortable BUT IT WILL SET YOU FREE \nHeads up I’m not saying express the emotions, I’m saying feel them internally. The stronger you feel the emotion the faster it will pass \n\nThe result ? \n\nYOU FEEL LIGHTER \n\nAnd guess what\n\nAll that energy you were wasting carrying around all that weight is freed up and given back to you \n\nBANG \n\nNOW YOURE WORTHY",
        "created_utc": 1678503903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip for those who find it hard to read books",
        "author": "249592-82",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o92hc/tip_for_those_who_find_it_hard_to_read_books/",
        "text": "For anyone who finds it hard to read self improvement books, have a listen to a podcast titled \"WHAT YOU WILL LEARN\". Its 2 guys (Australians) who each week read a self improvement/ motivational book and then spend approximately 20 mins discussing the book and summarising it.",
        "created_utc": 1678503902,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it that you don't understand about the universe?",
        "author": "roxoul",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o8v3y/what_is_it_that_you_dont_understand_about_the/",
        "text": "About life, relationship, career, people, yourself. Anything.",
        "created_utc": 1678503301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help getting a job",
        "author": "night_rider1749",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o8uk3/help_getting_a_job/",
        "text": "\n\nHey guys, \n\nJust checking to see if anyone knew an individual or was personally needing a resume written. I write resumes as a side job and have proven success of helping people land the job they desire. I don’t advertise much on Reddit due to the anonymity of this space as well as the lack of visibility for people advertising services. Just please reach out to me if you know of anyone interested and I’d be happy to discuss it with you. \n\nGod bless.",
        "created_utc": 1678503253,
        "upvote_ratio": 1.0
    },
    {
        "title": "So taking actions and being consistent is the only way to self improvement?",
        "author": "Jpoolman25",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o815b/so_taking_actions_and_being_consistent_is_the/",
        "text": "Whether it’s reading quotes on social media or watching motivational inspirational videos on YouTube, it feels good to watch because I’m thinking I’m taking that step to self improvement and bettering myself but this feeling just became so boring and not addictive anymore like I just read bunch of quotes or watch videos but I’m not implementing noting in my life. Like I’m just not taking action towards better myself and improving my life circumstance. So, it’s like what am I suppose to do now? \nI always thought that watching videos would give a positive inspiring perspective in hopes to find a path or guideline but I’m just keep on watching with no reasoning. It’s like what am i even doing with my life.",
        "created_utc": 1678500798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I abusing my dog because of my abandonmentship issues?",
        "author": "Alternative_Pin735",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o7yag/am_i_abusing_my_dog_because_of_my_abandonmentship/",
        "text": "I have a dog, and my parents got him for me because I was/am extremely lonely. The second I got him, I felt extremely possessive of him, and I wanted to be his world. So ever since then, I haven't really let him leave me side. If I go upstairs, he goes upstairs with me. If I go downstairs, he goes downstairs with me. I personally feed him because I don't trust anyone else in my family to feed him, and he eats in my room away from the other dogs. The only time he gets away from me is if I'm gone or school,  in town, or the shower, and when he goes outside. \n\n\nThe thing is, I don't go downstairs much, and I don't go outside that much either. My dog does prefer to be upstairs, but I fear that he's that way because I'm that way. And I don't want to stunt his growth by lack of excersing while the concept of exercise to me kinda sucks. :/ Also, he becomes extremely depressed when I'm done. The first time, I left him at home while I was gone he just started crying and wouldn't stop. He's slightly better now. Now, he just gets depressed. He'll look for me or hide in our room till I'm back home. \n\n\nAnother thing is, I also feel needed when he gets extremely sad and depressed when I'm gone because that proves he loves me. I also get really sad when I have to leave him for long periods, but I'm capable of ignoring it until I get home. I just can't imagine treating him like a normal dog. My dog is the closest thing I've ever had to a friend, a support system, and in general long-term companionship. And even then, I feel like I have to cherish every moment with him because he'll die before I do, and his death is an extreme worry I have even though he's oen. \n\n\nAnyways, does this qualify as abuse? I may like how we do things, bur I don't want to hurt him in the long term.",
        "created_utc": 1678500573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad habits and trying to improve in all areas",
        "author": "InToDeepToDiscuss",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o7q75/bad_habits_and_trying_to_improve_in_all_areas/",
        "text": "[removed]",
        "created_utc": 1678499947,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a domestic abuser",
        "author": "TallDM93",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o7m0r/i_am_a_domestic_abuser/",
        "text": "Hello everyone I am the perpetrator of a domestic abusive relationship. I have been emotionally and mentally abusive to my wife. I'm guilty of infidelity and throughout the relationship before and after discovery I've lied, gaslighted, minimized, blame shifted, and made every excuse in the book. I have recently started reading books on DA after reading about infidelity and I have found so many similarities that I have to admit I am abusive and a narcissist. I am also seeking help from a therapist who specializes in DA. I'm here today to take ownership, humble myself and ask for advice. Anything that can help me stop lying, minimizing, and to put others before myself. Feel free to ask questions for clarity.",
        "created_utc": 1678499606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insecurity about past preventing my confidence",
        "author": "Comfortable_Map5708",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o7lvq/insecurity_about_past_preventing_my_confidence/",
        "text": "\nHey Reddit, I believe my insecurity about my past hinders me from being truly confident around women. In my past, I was a very shy kid which led to me being taken advantage of, getting bullied, and being a general doormat. This led to me having strong social anxiety almost all throughout school, yet again being a people pleaser, and getting bullied, and being a loner in general. A big portion of my life, I basically spent playing video games on my own, doing schoolwork, and distracting myself with content. I did have mostly one friend which I was close with, and a few acquaintances, but there were also phases where I was completely alone. I don’t think I was weird per se, more just really anxious and bending my opinions to be liked by everyone because I was that desperate to fit in and not feel like a loser. I cared too much about what others thought about me.\n\nNow I'm older and within the last year, my social anxiety has improved a lot although I'm still struggling. I think it's because I worked retail with people my age. I regularly go to the gym, started going to concerts even alone, can have a conversation with new people, even the really pretty girls, etc. I also look much better than in my weird puberty phase. Now people seem to show more interest in me as I'm talking more. However, whenever they want to talk to me and ask about my social life or past, I feel insecure and make up little lies to make me seem like a normal cool dude who has or at least had a good social circle. In reality, my social life atm is one good friend I'm doing activities with, and I'm insecure about my lack of life experience.\n\nThe thing is, I really feel like I'm a cool guy to hang around but that I just had bad circumstances or awareness at that time. But the more little lies I tell, the more, especially girls that are interested in me, sense that I'm not genuine or I'm acting insecure. The lies also lead me to be more cautious about what I say, like being in my head and not being free. The alternative is that I tell them that I was not really all that in the past and still catching up to create a genuine and healthy social circle. However, I know that if I do that, there is a high chance they see me as a loser and not that easygoing cool dude. They wonder if there is something wrong with me, especially with attractive girls I'm interested in. They think it's unattractive and lose interest in me because they still think I'm like that.\n\nI really don't know how I can get out of this situation. Is there a way out of this situation, a way to feel confident despite my flawed circumstances? Do you have an idea how I can sell my honestly kind of sad past without people feeling pity, looking down on me, or losing attraction? Any advice or input is welcomed. Basically, now when I'm meeting someone new, I'm easy going and confident at first, but after the connection goes deeper, both platonically and romantically, I feel insecure about my past and have trouble relating and lack stories and anecdotes which keep the other person interested. It feels impossible to create relationships and friendships with the people I want.",
        "created_utc": 1678499595,
        "upvote_ratio": 1.0
    },
    {
        "title": "No energy/tiredness every single day?",
        "author": "Infinite_Kale6261",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o78oc/no_energytiredness_every_single_day/",
        "text": "I’m not sure what happened. I remember last year I had energy every single day, workout 2 hours and get things done. \n\nNow I have almost no energy and I’m way too tired throughout the day. It doesn’t even matter if I drink coffee, I’m still tired. \n\nThe only thing I can think of that I’ve added to my diet since last year was coffee. I drink about 2 cups a day, not sure if that would be the issue but if anyone can give me some advice that’d be great.",
        "created_utc": 1678498527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can being in a relationship help me move on from my childish lifestyle?",
        "author": "mink2018",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o6h19/can_being_in_a_relationship_help_me_move_on_from/",
        "text": "I feel irresponsible or rather the lack of responsibility in my life is not helping me.\n\nIm 31 but never had a girlfriend. Ive been working on myself lately and ive changed in many ways, but i still regret drinking until late night.\n\nIf i keep this up, i dont feel like i will ever be ready to have a family.\nI want to do things right, not perfect.\n\nIm just curious if this helped you guys in your cases.\nIm tired of being immature.",
        "created_utc": 1678496405,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been lurking here for a while and read a lot of posts and comments about women",
        "author": "Funny_tear2",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o6fku/ive_been_lurking_here_for_a_while_and_read_a_lot/",
        "text": "Many were so negative that I could literally feel hate coming from the speech.\nThe astonishing amount of misinformation about us that is written as facts is just, difficult to explain. \n\nIt made me feel like the men around me and in my environment see me the same way like the ones in reddit. \n\nI don’t even know what reality is, do men in general really hold such negative image of women?",
        "created_utc": 1678496290,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stick to it long enough to make a habit",
        "author": "Happy-Tea5607",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o63hn/how_to_stick_to_it_long_enough_to_make_a_habit/",
        "text": "I have slowly began the process of rebuilding my self confidence and loving myself. But now my struggle is maintaining my habits long enough to where they become second nature. But now I’ve noticed that I can only manage to do these tasks when I think about them but I would like to be at a point to where I don’t even have to think anymore it’s just part of my daily routine. Does anybody out there have any tips and tricks to make these are more consistent thing?",
        "created_utc": 1678495360,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop believing everyone knows more / better than me?",
        "author": "HumanAllegory",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o5yii/how_to_stop_believing_everyone_knows_more_better/",
        "text": "\n\nAnytime it comes to conflict I usually allow the other person to win the argument because, I find that it’s more important for me to let them know that what they say matters, then for me to win.\n\nRecently, I just don’t believe that to be true anymore, but I still have this severe hesitation to criticize others, or bring up their faults when they freely do it to me. \n\nHow do I gain confidence in stating my case or my perspective with conviction without arrogance? \nHow do I see my perspective on voicing other peoples faults as not malicious?  \n\nThanks in advance.",
        "created_utc": 1678494978,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Childhood never gave me the ability to learn and improve my hobbies.",
        "author": "AdWooden2539",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o5h23/my_childhood_never_gave_me_the_ability_to_learn/",
        "text": "\nBeing that I’ve been supposedly \"gifted” by academic standards, it makes me feel a little guilty in seeing that I’ve never been particularly good at anything, compared to my peers. For the most part, I tried attaching to myself the facades of my dreams eventually culminating into that of being an \"engineer” although it never truly felt like me. After multiple years and finally finding something I have a passion and fondness for, I soon realized I have difficulties in applying knowledge to practice, even after so many hours into it. I would describe the way I learn as being heavily structured, and with what I want to purse being very creativity based, whether its drawing, singing or just playing the guitar. I have this tendency to want to give up when I \"fail” at something or that I will never amount to the standards set by those I see above me, even if I’m the same age as my said peers. For the most part, I’ve had a history with Depression, Anxiety, and lack of Self-worth that has plagued and greatly damaged who or what I really am, greatly inhibiting me from finding joy at all in life. \n\nMay I ask for some advice from your end, and see if I may be able to gain something worth all of that time I’ve wasted?",
        "created_utc": 1678493706,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I improve my communication skills if I always end up bringing the conversation to topics I actually have no idea about?",
        "author": "AlexanderPatrovsky",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o5gob/how_do_i_improve_my_communication_skills_if_i/",
        "text": "Communication skills are very important in improving my self but something I noticed is that I don't know how to bring up things I'm interested about and tend to always end up bringing up topics according to what others seem to be interested in but I know close to nothing about.",
        "created_utc": 1678493678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obsessiveness Over Self Improvement",
        "author": "Py-Thot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o59hl/obsessiveness_over_self_improvement/",
        "text": "Heya!\n\nI’ve gotten into self improvement a few months ago and I’ve made quite a bit of progress.\n\n1. My screentime went from 11 hours on the phone to 2 hours and thirty.\n\n2. I ate 4 sweets a day (cake, chocolate, desserts) to one every couple days.\n\n3. I do a quick workout twice a week.\n\n4. Learnt breathing techniques, better scheduling and better emotional control.\n\nHowever, the issue is that I obsess. I make myself think extremely hard over little things (I’ve always done this). I think about whether or not if I should eat a piece of chocolate for 30 minutes till I make myself crazy. If I consume something accidentally with many carbs and sugar I overthink and slightly pace in circles. I cry a little every time I see my screentime shoot up. I’m scared to go back to my old ways and I think of myself as a lazy brat. For a period of time my screentime was just two hours on the phone and then in went to two hours and thirty when I stopped obsessing as much.\n\nI know “relapse” is just a temporary stumble, but it hurts so badly, just reading the word makes me jittery.\n\nHow do I prevent these obsessive thoughts from lasting excessively long or overriding rational thought?",
        "created_utc": 1678493158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on making friends at the gym",
        "author": "ie-Nerzhul",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o4z1s/need_advice_on_making_friends_at_the_gym/",
        "text": " \n\nAlthough I really enjoy exercising at the gym and feeling accomplished afterwards, I often feel uneasy while waiting for machines or working out next to someone without saying anything. I prefer to strike up a short conversation with others so that they remember my face and possibly greet me next time we see each other. It may not seem like a big deal, but feeling at ease around other men and giving each other a thumbs up, fist bump, or simply saying hi or asking for a spot can significantly enhance my gym experience.\n\nHowever, it seems like everyone is always in their own world with their music and workouts, making it difficult to strike up a conversation. I'm also worried about coming across as creepy or making someone uncomfortable.\n\nDoes anyone have any tips or advice for making friends at the gym? How can I approach someone with a small chat without wasting their time or making them uncomfortable? Any help would be greatly appreciated.\n\nThanks in advance!",
        "created_utc": 1678492448,
        "upvote_ratio": 1.0
    },
    {
        "title": "increasing Performance: Tips for Improving Your Efficiency",
        "author": "devencripe",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o4vnu/increasing_performance_tips_for_improving_your/",
        "text": "increasing Performance: Tips for Improving Your Efficiency\n\nPerformance is an essential aspect of success, whether it be in your personal or professional life. However, with so many distractions and demands on our time, it can be challenging to stay focused and productive. Fortunately, there are several tips and strategies you can use to improve your performance and achieve your goals. In this article, we will explore some of the most effective ways to increase your efficiency and productivity.\n\n1. Set Clear Goals and Priorities\n\nOne of the most critical factors in increasing performance is setting clear goals and priorities. When you have a clear idea of what you want to achieve, it is easier to stay focused and motivated. Start by identifying your long-term goals and then break them down into smaller, more manageable tasks. Determine what tasks are most important and prioritize them accordingly. This will help you stay on track and ensure that you are making progress towards your objectives.\n\n1. Create a Schedule and Stick to It\n\nCreating a schedule is an excellent way to manage your time effectively and increase your productivity. Set aside specific blocks of time for tasks that need to be done and prioritize them according to their importance. Try to stick to your schedule as much as possible and avoid distractions that can throw you off track. Use a timer or other tools to help you stay on task and make the most of your time.\n\n1. Eliminate Distractions\n\nDistractions are one of the most significant barriers to productivity. They can disrupt your focus and make it challenging to stay on task. To increase your performance, it is essential to eliminate as many distractions as possible. This can include turning off your phone or email notifications, closing unnecessary tabs on your computer, or working in a quiet, distraction-free environment.\n\n1. Take Regular Breaks\n\nTaking regular breaks is an essential part of increasing your performance. While it may seem counterintuitive, taking breaks can actually help you stay focused and productive over the long term. Breaks give your brain a chance to recharge and can help you avoid burnout. Try taking short, frequent breaks throughout the day, or schedule longer breaks for activities that help you relax and recharge.\n\n1. Prioritize Self-Care\n\nSelf-care is critical for maintaining high levels of performance over the long term. Taking care of your physical and emotional well-being can help you stay focused and motivated, even during challenging times. Prioritize activities that promote self-care, such as exercise, healthy eating, and getting enough sleep. Make time for hobbies or activities that bring you joy and help you relax.\n\n1. Continuously Learn and Improve\n\nFinally, one of the most effective ways to increase your performance is to continuously learn and improve. Stay up-to-date with the latest developments in your field, take courses or attend workshops to improve your skills, and seek out feedback from colleagues or mentors. Continuously learning and improving can help you stay motivated, increase your confidence, and improve your overall performance.\n\nIn conclusion, increasing your performance requires a combination of strategies and habits. By setting clear goals, creating a schedule, eliminating distractions, taking breaks, prioritizing self-care, and continuously learning and improving, you can improve your efficiency, productivity, and ultimately achieve your goals. Remember that increasing your performance takes time and effort, but with persistence and dedication, you can achieve the results you desire.",
        "created_utc": 1678492202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice?",
        "author": "Fit-Equivalent-7160",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o4o06/any_advice/",
        "text": "A year ago I left the company I co-founded because of my mental health issues, but it was the worst decision I’ve ever made. The company is doing extremely well to this day and my mental health issues have just gotten worse\n\nOver the last year I’ve made all kinds of mistakes and I feel like I’ve taken countless steps backwards. \n\nI have been puzzling on what I want to do with my life but I still haven’t found any direction. \n\nHaving so much free time on my hands has made my mental health worsen, I’ve picked up all kinds of insecurities since exiting the company I co founded and I ended up turning to drinking exclusively to try numb the pain. I’ve gone down an extremely destructive path and have ruined many of my close relationships with friends and loved ones in the process. \n\nI’ve been trying to do all the right things. As of January this year I decided to go sober, I’ve been seeing a therapist, I’ve been exercising every day and I’ve improved on my diet. I feel as if non of this is helping, my mental health is getting worse and worse and I’ve started feeling very lost. I have huge insecurities surrounding my career as I’ve been eating into my savings whilst I’ve been trying to figure out what I want to do, I’m more lost now than I’ve ever been. Feels like I’m getting to a breaking point. I just don’t know what to do anymore. \n\nIf anyone has any advice on what to do going forward, it will be greatly appreciated",
        "created_utc": 1678491649,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become less negative/hate-filled?",
        "author": "TONNNNNNNNNN",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o4a0w/how_do_i_become_less_negativehatefilled/",
        "text": "18M\n\nI've been doing a lot of thinking recently, and I've realised how negative of a person I am:\n\n- I always get angry when I don't get something right\n\n- I blame everyone but myself when things go wrong\n\n- I constantly complain about everything\n\n- I hate everyone\n\n- I don't trust anyone\n\nDespite me knowing these things, I really don't know how to change it about me.\n\nI am very determined to change because I've been this way for too long, and I don't feel like I can move forward in life because of it.\n\nAny advice?",
        "created_utc": 1678490658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody move to a new city for a better quality of life and it actually helped?",
        "author": "kevmoe123",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o3xi0/anybody_move_to_a_new_city_for_a_better_quality/",
        "text": "I’m living in Baltimore, I hate it. I’m strongly thinking about moving to Miami or Houston. I don’t really mind cost of living, you get what you pay for. \nMy lease is up and October so I have to make a decision in about 3 months",
        "created_utc": 1678489783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommate plummeting my productivity",
        "author": "MikeTooCut",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o3sxp/roommate_plummeting_my_productivity/",
        "text": "Hey y’all. So my roommate and also my brother is probably the most lazy and messy person I know. He is 23 years old and I am 18. Simple things like making your bed, putting dirty laundry into your hamper, or even doing the dishes just doesn’t register in his head. \nThe problem is that his habits often make me feel unmotivated and unproductive. When he is home my room becomes a mess because of his way of life. When he is not home my room is very clean. One of the things I value is a neat space because it translates into my head to get things done. \nIm not sure what to do in this situation bc I have told him over and over to get on his shit but he doesn’t care. It bothers me so much because he is an adult with his own responsibilities that he doesn’t care about and I am a highschool student that is on top of my shit.",
        "created_utc": 1678489468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could use your help on this",
        "author": "Own_Commission5022",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o33nn/could_use_your_help_on_this/",
        "text": "I am a guy, 21, was barely socializing with anybody in school, had a small group of friends and was wasting thousands of hours on video games. Decided eventually to get my life in order around 19, played less video games, got a job and saved up enough money to work on a little something of my own and pursue something that would be regarded as unconventional to some.\n\n I am currently 21, and I am alone in my room almost everyday continuing to pursue my ambition and my routine is very dull - wake up ,gym, work, gym, sleep. I don't necessarily mind that since I have gotten used to it, but it does make it difficult when I have no social life - and I see women constantly looking at me at the gym, some holding eye contact and smiling clearly wanting me to do something about it - which feels completely foreign to me since I have no idea how to initiate small talk nor hold it without it feeling forced - and I am acting like I ignore or don't care about them when in reality I do and just feel very awkward about it.\n\nMy routine is boring, I have no social life - no excitement, no real friends who I hang out with. I do not want to give myself the excuse of \"I need to only focus on myself\" or \"I can't have any distractions\" just to not talk with women or avoid them. I think that's bullshit and at the end we all crave that significant other who can be by our side when we work on ourselves. \n\nSince I am not living an average 21yo's life, don't really have a social life outside of my room, pretty reserved and quiet I think that women who look at me at the gym will be disappointed to find out about it after potentially finding me attractive - which makes me overthink approaching them in the first place. Do you guys have any tips on how to overcome that concern? Is it even a valid thing to stress over?",
        "created_utc": 1678487735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Knowledge without action is sterile, action without knowledge is futile",
        "author": "infiniteloop00",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o2yja/knowledge_without_action_is_sterile_action/",
        "text": "The internet and books are full of information to solve any kind of problem in life and achieve any kind of improvement or goal, the issue is going from knowledge to action. I feel I know how to solve all my problems, but I'm uncapable of doing that first step or be consistent about it. I always revert to the old ways. \n\nWhat's the missing ingredient? Did you make it? How can I achieve this mindset shift?",
        "created_utc": 1678487411,
        "upvote_ratio": 1.0
    },
    {
        "title": "F21 rate my looks &amp; advice",
        "author": "GrouchyFruit2332",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o2kl4/f21_rate_my_looks_advice/",
        "text": "Hi I’d like for you to rate my looks and give me advice on how I can improve via personal message. Let me know if you’re interested :)",
        "created_utc": 1678486478,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t accept the fact that i am just a mediocre",
        "author": "East_Finance1296",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o2hin/i_cant_accept_the_fact_that_i_am_just_a_mediocre/",
        "text": "A little heads-up: english is not my first language so i apologize for any mistakes.\n\nI just can’t accept myself as it is. I’ve always imagined there must be some potential in me, that i have to be genuinely good at something at least. Since i was little, I saw my worth in being smart/getting good grades as it was the only thing i got recognised for i guess? I don’t know i just didn’t see myself any special except for when i heard comments about me getting relatively high grades or managing to study  for an exam fairly well in a short period or sometimes understanding some challenging concepts with easiness….. now i see how all that doesn’t make me “so smart” as my friends call me. I am an undergrad university student studying in the pharmacutical field and i can clearly see i am struggling with my studies. Anyways, moral of the story is: i see now i am not that special and i can’t see other people who are really great in many ways without finding myself spiraling in self-pity, jealousy, sadness, self-loathing, etc. I genuinely want to like me. \n\nAnd I am aware i have low self-esteem and low- anything related to my view of myself. It’s affecting how i see the people close to me and relationship with them and i feel bad.",
        "created_utc": 1678486274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestion on what to use a wellness reimbursement on",
        "author": "chasingpavements27",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o2595/suggestion_on_what_to_use_a_wellness/",
        "text": "I recently started a new job and they have a $50 reimbursement for a wellness benefit monthly. I am looking for ideas of what to use it on. Of course there is always a gym membership, but I have an apartment gym for free (that I don’t use as much as I should). Last month I was reimbursed for a yoga ball. They said we can be creative with this, so I’m open to anything! For an example: a coworker uses hers towards getting manicures. Thanks in advance everyone!",
        "created_utc": 1678485484,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I find discipline to lose 10 kgs in three months?",
        "author": "Ok_Macaroon_4378",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o1scf/how_do_i_find_discipline_to_lose_10_kgs_in_three/",
        "text": "I am on the verge of overweight and every time I start a diet or working out i give up after two days",
        "created_utc": 1678484611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fell off",
        "author": "the_r3ck",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o15zc/fell_off/",
        "text": "Hey guys,\nI just joined this subreddit, but some context:\nWhen me and my fiancé first started dating I was in the best shape of my life. Mentally, emotionally, physically. I set out to do something and I did it. I had schedules, to-do lists, my life was in a sort of order. I even had time to do everything I needed to, and still clean some of her house while I was waiting for her.\nWhile dating her parents were incredibly against me. They convinced her I wouldn’t be able to take care of her with my job. We resolved that problem eventually, but I think it killed something in me. I lost all willpower to stick to my schedules, or even make them. The house started to become a mess, and I found myself killing time with old patterns. I didn’t really pay attention to it for awhile, until my fiancé finally told me. I realized she was right, and it rocked me a bit.\nI’m really ashamed, disappointed and angry. I was in a really good place, I was doing well, and now I feel like I’ll never get back to there. \n\nWhere do I even start?",
        "created_utc": 1678483126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bored with life at 28",
        "author": "kevmoe123",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o13uu/bored_with_life_at_28/",
        "text": "Dropped out of college in my early 20s. Got an okay job paying around 100k per year and my own luxury apartment. Life just seems so boring now. My gf moved to a new city without me(we’ll probably break up soon). I started to get chubby, used to be fit. All my friends are having kids/getting married. Then there’s just me and my dog. I work almost everyday just because there’s nothing to do. Life was nice and fun up until about a year ago. Idk what to do take make me start enjoy living again",
        "created_utc": 1678482979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self Improvement Books?",
        "author": "Funky_16ths",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o12vp/self_improvement_books/",
        "text": "Hi all, I've been on this journey of self improvement now for a number of years now and I've just settled into the habit of reading regularly. \n\nI've read Atomic Habits and am currently halfway thru Rich Dad Poor Dad, and I'm just wondering what books I should be looking at next? Can anyone recommend any good reads?\n\nPrimarily I'm interested in finance and self-help, but would love to read some books on body-language and influence to better my interpersonal skills (sorry if thats worded poorly, but you get the idea). \n\nThanks in advance!",
        "created_utc": 1678482914,
        "upvote_ratio": 1.0
    },
    {
        "title": "So this is my story",
        "author": "robotix22",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11o0sdr/so_this_is_my_story/",
        "text": "Im 28 , did make my masters 1 year ago in economics and fell into deep depression. It slowly came by and I didn’t recognize it till Christmas. \n\nI just was not able to be alone anymore. I did spend nearly every evening with friends or girls I diddnt even care about. I was dead inside, afraid of anything. \n\nNow to share what really helped me out:\n\n1) drink, I did not even had the urge to drink when I was depressed. As soon as I started to drink more it was like my body started to work again and now I feel thirst again. \n\n2)calm your mind, meditation. It can be anything , what really helped me out was simracing. \n\n3) no porn, no fap, no social media, no tv. Empty your mind. Change your perspective from others life’s to yours again. I was able to have fun just playing with my cat, walking in nature etc. I think serotonin detox is the key here. \n\n4)feel your feels, don’t train to be empty inside and numb all day. Because it’s what you finally get after some time. \n\n5)evaluate your ego, what are you living for? What’s giving you hope ? I did. Watch many videos, about reality , the universe and nature \n\n6)(vitamins): im not gonna recommend something here. Speak with a person who is educated in this .\n\n7) trust: in something you belief, what gives you hope , if you can’t do it for yourself , do it for something, anything \n\n8)10 sec cold shower , after normal showering \n\n9) read , I don’t care what just read. Something you like , it pulls you in the moment and stops your brain jumping from the past to the future , or having bad thoughts \n\n10) check your outside world , but have a peaceful inside world (if possible) \n\n11) don’t be like me after my I said to myself no more books no learning -&gt; this did. cost me 1 year and I’m sure was a big part of my depression \n\n\n\nLove and thanks,\n\n\nRobotix",
        "created_utc": 1678482213,
        "upvote_ratio": 1.0
    }
]