[
    {
        "title": "Any advice on how to support your grieving significant other?",
        "author": "iloveoxtail305",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qyjp2/any_advice_on_how_to_support_your_grieving/",
        "text": "Little backstory. I’ve never been in a relationship where I or my significant other has lost a family member so this is new for me. I’ve never seen my bf cry until now and he’s taking this loss very hard. I’m trying to support him, but I’m being shut out. Honestly, I understand him not wanting to talk. I will probably shut the world out if I were in his shoes, but I feel alone during this. Confused. Feel hopeless and would like advice on how to be supportive without being over-bearing and how to get out of my feelings because it’s not all about me.",
        "created_utc": 1678774742,
        "upvote_ratio": 1.0
    },
    {
        "title": "My life is in tatters and I don’t know what to do",
        "author": "randomshitalldaylong",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qyi77/my_life_is_in_tatters_and_i_dont_know_what_to_do/",
        "text": "I was getting my life together when something traumatic happened. I’m back at having flashbacks, being zoomed out, aggressive and defensive etc. not only that, but I stopped studying, I sleep during the day, I barely move and my eating habits cannot get worse. I cannot cope with this anymore. My self esteem has totally been destroyed. I don’t want to give up, but it feels like I need to work for months for some normalcy that can disappear so fast. I cannot do this alone and I need some tips as well",
        "created_utc": 1678774594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to be more controlled and less emotional with responses.",
        "author": "ManixWolf",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qxyhs/looking_to_be_more_controlled_and_less_emotional/",
        "text": "M46. Good career. Happy and liked by my colleagues. But when I get rubbed the wrong way or feel slighted, I make decisions based on my emotion. \n\nI know it’s a place of insecurity. Fine to admit that. And my reaction is never inappropriate - nothing HR worthy. I don’t lash out or yell or do anything mad. It’s more passive-aggressive in nature.  But I start to make decisions based on being “right” rather than doing what’s “best”. Everyone’s got their Achilles heel. This is mine. \n\nSeeking any books, podcasts, YT channels etc. that can talk through methods for shifting that energy into not taking things personally, and being more effective in moments that I perhaps get heated and let that have more control over me than it should. TIA.",
        "created_utc": 1678772741,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to fight fast food withdrawals?",
        "author": "Icy-Meat5639",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qxp9i/how_to_fight_fast_food_withdrawals/",
        "text": "hey yall, 10:30pm where I live and I am getting the most vicious fast food withdrawals, all I wanna do is rundown to mcdonalds and buy 20 chicken nuggets and a large coke, it makes it even harder that I have discounts through the app and could pick up a free burger if i wanted.\n\nBeen making a conscious effort to fight cravings but mcdonalds and 7-eleven which is open 24 hours a day and just down the street are both giving me crazy fast food withdrawals. Limiting myself to once a week and the withdrawals feel similar to when I had adderall/speed withdrawals from binging and crashing. what to do to bring down the supersuper anxious feeling?",
        "created_utc": 1678771875,
        "upvote_ratio": 1.0
    },
    {
        "title": "why am i such an underachiever ?",
        "author": "Key_Mode_6524",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qx7r7/why_am_i_such_an_underachiever/",
        "text": "People who are usually smart but don't get good grades due to anxiety I am one of them. How can i deal with this for now and for the future. My friends don't believe when i tell them my result. They say i  must be a scholar by looking at my personality. I try really hard but do not get results. I sometimes be very knowledgeable but in the exams i struggle a lot. I dont know how to help myself.",
        "created_utc": 1678770231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Healthy Minds Think Alike",
        "author": "achunkey",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qwxfc/healthy_minds_think_alike/",
        "text": "It’s insolvable to emphasize the value of keeping one’s mind in good shape. Being mentally healthy is pivotal for general well-being since it affects our passions, ideas, and conduct. When our minds are in good shape, we’re better suitable to manage stress, make choices, and uphold wholesome connections. Conversely, a disordered mind can affect various mischievous goods, similar to sadness, anxiety, and substance abuse. We can elevate our lives and negotiate our objects by making trouble to nurture a sound mind.\n\nOne of the keys to maintaining a healthy mind is engaging in conditioning that promotes internal good. This may include rehearsing awareness, getting regular exercise, and seeking out social support. Also, it’s important to prioritize tone care, including getting enough sleep, eating a healthy diet, and taking time for relaxation and recreation. By incorporating these practices into our daily routines, we can cultivate healthy habits that support our internal and emotional good. Eventually, healthy minds are likewise, as they’re characterized by a positive outlook, adaptability, and the capability to acclimatize to life’s challenges.\n\nLife is short, make the best of it and live the best life you can\n\n&amp;#x200B;\n\nThis is an article written by me on my medium page",
        "created_utc": 1678769355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Healthy Minds Think Alike",
        "author": "achunkey",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qwthy/healthy_minds_think_alike/",
        "text": "[removed]",
        "created_utc": 1678769009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling directionless even after some success",
        "author": "ALeftShoeFromHawaii",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qwk1y/feeling_directionless_even_after_some_success/",
        "text": "Firstly I want to acknowledge I am very privileged to have these complaints, and I get that others have problems that make my issues look like nothing.\n\nConventionally I (28M) feel mostly successful - I have a decent job that let's me mostly telecommute, have my graduate degree, I'm a military vet, and I've been fortunate enough to see a lot of this beautiful world. I spent 2019 bouncing around SE Asia, and even when I returned to the US just before the pandemic my aim was to live abroad again while working remotely (in Asia again or Eastern Europe).\n\nWell...a few things happened. The pandemic hit, war broke out, and the places I wanted most to live are currently not safe. Inflation/the economy has hit me badly and the city I live in has gone through a decline, so here at home feels rough too. The world feels a lot less inviting and open than it used to. I'm not really proud of any of my accomplishments anymore, and the hobbies that I enjoyed feel more like chores. I've written a novel and even though I was happy when I finished it didn't provide the fulfillment I thought it would...part of me is tempted to delete it just out of frustration.\n\nI could very well be guilty of doomscrolling, and maybe that has a bigger impact than I think. But regardless my self esteem is still low, and I feel like I'm drifting now without any real ambition. I'm talking to someone in therapy, but I haven't been able to resolve it...so I figured I'd post here and ask for advice. Has anyone else felt similar? How did you overcome these feelings?",
        "created_utc": 1678768202,
        "upvote_ratio": 1.0
    },
    {
        "title": "lazy person wants to be better",
        "author": "bpvidinesh",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qw5v4/lazy_person_wants_to_be_better/",
        "text": "[removed]",
        "created_utc": 1678766932,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 Lessons From How To Win Friends &amp; Influence People",
        "author": "achieving_flow",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qw2ep/3_lessons_from_how_to_win_friends_influence_people/",
        "text": "I have recently started “How to win friends and influence people\" I am only a few chapters into the book and have already learned a lot.\n\n**Here are the three lessons I've learned so far :**\n\n# Lesson 1 : Don’t criticise, condemn or complain\n\n“Don’t criticise them; they are just what we would be under similar circumstances” - Lincoln\n\nCriticism is dangerous because it hurts the individual’s pride and arouses resentment. Causing the individual to go on the defensive and usually makes him want to get back at you.\n\nSo, when dealing with people, remember that we are not dealing with creatures of logic. We are emotional. Instead of criticism, let’s try to understand them.\n\n# Lesson 2 : Give honest &amp; sincere appreciation\n\nWho doesn’t like a compliment? Every one loves it.\n\nBut what about flattery? It is counterfeit and will do you more harm than good in the long run. Appreciation is sincere while flatter is not. One is universally loved and the other is condemned.\n\n# Lesson 3 : Become genuinely interested in other people\n\n“We are interested in others when they are interested in us” - Publilius Syrus\n\nPeople are not interested in you. They are not interested in me. They are only interested in themselves.\n\nA show of interest in others, like every other principle, must be sincere. \n\nApply these lessons in your daily life and see what good it does you. ",
        "created_utc": 1678766651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burnt-out after three years of masking",
        "author": "Pitiful_String9149",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qvi1x/burntout_after_three_years_of_masking/",
        "text": "Hello everyone. I will do my best to keep this as concise as possible. Apologies if I'm all over the place!\n\nKey details:  \nI am a 24 year old male.  \nI developed a physical tic over three years ago shortly before the pandemic started. It completely broke me as a person. I was never open with anyone about it, until around 1.5 years ago when I told my GF. To this day only she knows, and now a bunch of internet strangers.  \nI masked my tic as much as I possibly could, and the stress and anxiety that came along with it. For the most part of the last three years, I have not been in a proper state of mind.  \nMy increased stress led me to abuse weed. I went from a once every couple months user, to a daily user. For at least 2.5 years now I have been smoking/vaping multiple times a day.  \nIts obvious to me in retrospect that my weed abuse pushed me further into my own isolated world of panic, stress, and depression. I genuinely felt like my life was a complete lost cause.  \nCut to a few months back, I was hitting rock bottom with my mental health. I believe it was largely related to me being 'on' at all times, acting, pretending that none of this was happening so no one would catch on and ask.  \nI've lived with my parents this whole time, and hiding it from them was one of my anxiety brain's main focus.  \nI had tried to go to a walk in as I have no doctor, but would have panic attacks in the office. These panic attacks we're pretty hidden, I've gotten really good at that. The only issue is that I would lose the courage in the moment to talk to them about my actual concerns.  \nI decided that if I couldn't manage in person, that I would speak to a doctor over the phone. I eventually booked some appointments. I told them most of what I've said here, but I left out the main issue, the tic, because I was scared and embarrassed.  \nThey prescribed me zoloft. It has helped me more than I could have ever imagined. It has been a few months now of being medicated. A lot of my struggles have decreased, but nothing is gone, or fixed.  \nIn the past month or so I have been weaning off of my weed use. I plan on stopping completely. It has been a bit over a week since I've last used. I've tried to quit before, but the withdrawals are normally too much for me to handle given the state I was in.  \nIn the past two weeks I have started looking for a doctor that I could potentially see regularly, and also a therapist. Unfortunately this all is taking a lot of effort on my part, emails back and forth, calls, rejections, recommendations to other clinics, etc...  \nAnd now, the straw that is currently breaking my back... I have been working full time as a remote employee for the past 2 years. My company is very small, and can be quite toxic. I very often am coerced into working overtime for free, and pushing myself well beyond my limit. My old boss would often get me to work weekends with no notice. When I tried to talk with them about these issues, I would get passive aggressive threats on my employment. You get the idea.  \nDue to this, for the past year or so I have been 'job searching'.  \nMy main issue boiled down right now is: Everyday, I feel more and more stress (anxiety is doing better woo woo). The energy I have to use everyday is being sucked away by my job. I end my work day like a zombie. I still try to be productive, job search, network occasionally, do research on the industry I'm hoping to transition to, etc., but I'm not very effective when running on such low energy.  \nThis also means self care has gone out the window for me. I have cavities that are getting worse, but struggle to brush me teeth (Or make a dental appointment). I have lost nearly 30 pounds, lots of which was muscle, but haven't been able to so much as go for a walk in months. I don't spend any time on my hobbies. I don't sleep well. I don't eat well. I don't socialize. I don't talk to my parents. I don't meditate anymore. Again... I think you get the idea.\n\nAdvice time:  \nI've spent a long time thinking about this and have come to the conclusion that, although I could willpower my way forward as I have been, it will be slow, ineffective, painful, and unhealthy for my body and mind.  \nI decided my work was the area I could make the biggest change, and so that is my plan, but I'm struggling to decide how I should move forward with some options I've narrowed down.\n\nDo I:  \n1: Quit ASAP with no job lined up (My GF's only advice on this subject), and risk the possibility of unemployment adding just as much stress to my life? The thought of my savings melting away already brings me dread.\n\n2: Use all of my sick days and vacation days to give myself some breathing room to get myself back on track? The risk here being that it might not be enough time, and then I have no time off for the rest of the year.\n\n3: Go to a random doctor at a walk-in, tell them what I've said here, and HOPE they write me a note for stress leave. The risks here are: I would have to tell my family, and friends, and coworkers (Obviously they don't need all the detail but they'll need something). I would take a 20% pay cut as my benefits would only cover 80% (as far as I can tell). Also, I don't want my boss and coworkers to look down on me for this, which potentially effects my ability to use them as a reference.\n\nThoughts?  \nI know I've unloaded a lot of info here. Feel free to ask more questions if you have any and I'll do my best to answer. Some I won't be able to as I'm trying to stay anonymous.\n\nAny advice or kind words would be really appreciated. Thank you all in advance.",
        "created_utc": 1678764985,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to motivate myself everyday?",
        "author": "_ask_question_",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qvced/how_to_motivate_myself_everyday/",
        "text": "Any simple tips or habits??",
        "created_utc": 1678764554,
        "upvote_ratio": 0.99
    },
    {
        "title": "i don’t like who i am anymore",
        "author": "lightnung",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qv23x/i_dont_like_who_i_am_anymore/",
        "text": "after moving city’s and schools, i feel like literally nobody already knowing who i am here has made me depressed, anxious, unmotivated, and incredibly insecure. when going on vacation around family that don’t RLLY know me i had this feeling as well. i have been spending most of my time stuck at home, feeling sorry for myself and literally lying in bed, daydreaming about how my life will get better, ill have a major glowup etc. but obv im not doing much to make that happen.\nim failing in school after swearing to myself i’d get at least 80% in all my classes, get into new hobbies, join programs, make friends and perform a daily routine, and just do better in life. i suck at making new friends and my self esteem is so low that i don’t feel like i can even rlly sell myself as the person i want to be known or seen as anymore. i’m barely waking up let alone living anymore.\ni’d honestly just rlly like someone to talk to abt some of this because i went from moderately depressed, to completely and utterly useless and pathetic with little to no self worth.",
        "created_utc": 1678763736,
        "upvote_ratio": 1.0
    },
    {
        "title": "A super easy game you can play at any time to improve your attention span",
        "author": "PirateApples",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qu9iw/a_super_easy_game_you_can_play_at_any_time_to/",
        "text": "Any time you walk into a room/start a minor task, think of a random word in your head. Once you have it, think: \"Once I leave this room/finish this task, I'm gonna say that word out loud.\" \n\nIt'll surprise you how many times you'll forget to say the word or forget what word you had thought of in the first place. But after a while, you'll get pretty good at it and you can substitute \"saying a word out loud\" for \"moving something that's in the wrong place\" or something similar.",
        "created_utc": 1678761516,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I be a good person?",
        "author": "ProfessionalQuinn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qu5ww/how_do_i_be_a_good_person/",
        "text": "So…. I lost my job today. A job i have been at for two weeks. I was planning to quit and its a temp job but I couldn’t last more than two weeks. I am a terrible person because my previous jobs probably dont think highly of me. I quit one job because my boss was bitter and always yelling and he scared me, but i didn’t keep my mouth shut. I told people the real reason I left and i cant get a refrence from him. He was trying to blackball me even before i left. It was a toxic work environment. But i should have been professional and kept my mouth shut. And i lost the job after that and this one. It’s because i dont put in the hard work. I get told to do something and it takes me longer to learn stuff and by the time i get it, they fire me. Margins in letters and how new software works. I just need to actually focus on details and learn what i need to but i cant do it fast enough. I blame other people for my mistakes because im so afraid of punishment. Grew up in an emotionally abusive house but thats no excuse. Its my job to figure it out and be an adult. And i dont. I dont stand up for myself. I dont have the energy to follow through on plans i make and i get to attached to people and then self destruct when they leave. I stay in bed and i dont complete tasks i have to. I just want to be able to keep a job like everyone else seems to be able to but because i suck as a person and i dont try, i dont. How do i change and be a good person and get my stuff together?",
        "created_utc": 1678761242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hair growth and dandruff shampoo",
        "author": "No_Tomato_7522",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qtubj/hair_growth_and_dandruff_shampoo/",
        "text": "[removed]",
        "created_utc": 1678760396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hair growth and dandruff shampoo. Learn how to make it",
        "author": "No_Tomato_7522",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qto34/hair_growth_and_dandruff_shampoo_learn_how_to/",
        "text": "[removed]",
        "created_utc": 1678759935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goal for Day - 4",
        "author": "Subash-11831",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qt4d4/goal_for_day_4/",
        "text": "Yesterday I made some mistakes, but today I know where I went wrong. I will correct those mistakes and achieve my goal today. I won't become happy or laugh today, I will work till I achieve my goal and enjoy at the end of the day. Today I will achieve take one step closer to my goals. I will let you guys know my results tonight. Bye guys!!",
        "created_utc": 1678758541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Results of Day - 3",
        "author": "Subash-11831",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qszjv/results_of_day_3/",
        "text": "I didn't get the results I hoped for, I spent my time chatting with my classmates, it was fun but I hate it now. The happiness and joy I got when I spoke with them, made me forgot my anger for revenge. But I learnt something new today, \"Everytime you fail, You start again with Experience\", Now I know where I was wrong I will correct my mistakes and make my next day productive.",
        "created_utc": 1678758209,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm racist against my own race",
        "author": "Affectionate_Hat494",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qshsj/im_racist_against_my_own_race/",
        "text": "My crush is Hispanic. I'm Hispanic and Asian. I have a Chinese last name, and I look Chinese. Growing up, people would always call me by my last name or refer to me as \"la chinita\". For all of last year, he had a huge crush on me, and I was too dense to pick up on his moves. I feel stupid, and I wish I could go back and change it. Due to a miscommunication, he thought I was dating another guy, so he asked his sister to set him up with this girl (who happens to be Asian). He did it to either make me jealous or rebound from me, but he genuinely caught feelings for her. They did all sorts of disgusting stuff together (not disgusting, I'm just jealous). They ate ramen, drank boba, went rockclimbing, hung out at the pumpkin patch, went to the movies. Lucky for me, things didn't work out between them, and even though he had been with her, it was clear he still had feelings for me.\n\nI'm worried he has an Asian fetish. He had one Korean girlfriend in the past, and this new girl is Korean, and I'm part Asian. So it's made me feel a certain type of way about Asian people. I work at a restaurant, and I don't want to help Asian customers. I've noticed that more than any other race, they tend to be the rudest and most needy. I'm already very ambivalent about taking him back, because it sucked seeing him do all those things with her. But, if he and I ever get together, I'm going to make him unfollow her on social media. I may be part Asian, but I'm going to milk the Hispanic girl persona like nothing else. I don't want my kids to be friends with Asians, and certainly can't marry into an Asian family. I know it's wrong. I don't want to feel this way. But my contempt towards the both of them is so high that I can't help but feel this way.",
        "created_utc": 1678756958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else go through/going through this?",
        "author": "Shortswinterwearer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qrsur/anyone_else_go_throughgoing_through_this/",
        "text": "Between suddenly having all this freedom, and the fact that people might not yet be working full-time, college seems like the most fun/easiest/most convenient time to get a GF. I'm graduating in June and I haven't even come close to having a GF. When people graduate, they will have less time to invest in dating and put more a priority on their and their partners careers. I wasted my best opportunity but it wasn't due to lack of attention or effort, I used dating apps and even stepped outside of my comfort zone numerous times to introduce myself to women. Please give me some helpful advice other than the traditional:\n\n&amp;#x200B;\n\n1. hurrr if you're single and depressed about being single you're a loser with no hobbies hur hur hur\n\n60% of men aged between 18-29 are single, does that mean all of those guys are losers? NO! Humans are social creatures, we NEED to feel some sense of connection with others. Also, it doesn't help that people will name-call/ make assumptions about people who are virgins YET turn around and think men who want sex are \"desperate\" or \"pathetic\". \n\n&amp;#x200B;\n\n2. \"You are complete on your own\"\n\nOn the surface this sounds good. Yes, some people can be single their whole lives and still generally be happy. It's silly to think that does or should apply to everybody. Again, humans are social creatures. Also, if someone is \"complete\" on their own and has lots of positive self-love, then isn't adding another person into your life counter-intuitive? If someone is COMPLETE on their own, why would they devote a bunch of time and energy to add another person into their life?",
        "created_utc": 1678755256,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you remember random information without \"Studying\" them?",
        "author": "PageTwo2",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qqvwi/how_do_you_remember_random_information_without/",
        "text": "Advice  on how to remember things on here and similar subs boil down to a combination of taking notes, using  flashcards,teaching it to others, recalling after some time etc. Now, I  know these are effective  techniques because I use them while studying and they mostly work. But that's also the problem.\n\nI don't want to  \"study\" when I'm reading a random article or watching a  youtube  video because these are things I do for fun. But I also want  to retain the interesting bits of information I read/watch.\n\nIs there really no way remember things without \"studying\" them?",
        "created_utc": 1678752984,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started a daily gratitude journal and here's how it changed my life",
        "author": "cryptotaxreports",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qqnbo/i_started_a_daily_gratitude_journal_and_heres_how/",
        "text": " Hey everyone,\n\nI just wanted to share something that has completely transformed my life - a daily gratitude journal. For the past few months, I've been taking a few minutes every day to write down three things that I'm grateful for.\n\nAt first, I didn't think it would make much of a difference. But over time, I started noticing that I was becoming more positive, more appreciative of the good things in my life, and less stressed and anxious.\n\nIt's amazing how taking just a few minutes to focus on the positive things in your life can have such a big impact. And it's not just me - there are plenty of studies that show that practicing gratitude can improve your mental and physical health, relationships, and overall well-being.\n\nSo if you're feeling stressed, anxious, or just a bit down, I highly recommend giving a gratitude journal a try. It's a simple but powerful way to shift your focus to the good things in your life, and I guarantee you'll see a difference.\n\nLet me know if you've tried a gratitude journal before, and if it's made a difference in your life!",
        "created_utc": 1678752416,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am tired of being an NPC",
        "author": "HarshRusher123",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qqfl3/i_am_tired_of_being_an_npc/",
        "text": "I am Harsh 19yr(allmost 20) old when I discovered phub I was 13yr old and started fap journey at age 14 Now I so fking down bad that evertime I wake up to turn off the alarm I end up relapse....I am so addicted to 18+ manhwa and phub. I wanna change everything my life is a mess and I don't wanna ruin my young age and regret the rest of my life....so I will be doing what ever it takes, not to beat my shit and stay away from hub....I will be updating on reddit how I am feeling everyday doing no fap... Feel free to hit me (only if you are serious about nofap) we will continue this journey...",
        "created_utc": 1678751919,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I don't know to do anything",
        "author": "ecrm7",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qpwu0/i_feel_like_i_dont_know_to_do_anything/",
        "text": "So me, 24 F, have been trying to land a contract on a public hospital, in the communication department. I have a bachelor degree in communication, culture and business/organizations. I do mainly photography and administrative work and i feed the hospital private digital library. Lately my financial status has gone downhill since the unemployment is only 550 € and my rent is... 550€, luckily my bf lives with me and we are trying to make it through with his paycheck. I pay rent, and he pays all the rest. ( I had a +-730€ paycheck and the last was about 800€, so i had about a 300€ cut. Wich is quite a big amount due to our economy currently in my country.\nBut the thing is.. I feel like i dont know to do anything. I know how to photograph and edit, i dont have a personal camera although I'd love too, but we can't save right now due to our situation.  I also feel like my BA didn't do much for me and i feel like I've been waisting my life. I feel struggling to do something with my skillset or not being enough. I feel like i would need validation or guidance through my journey of making an extra €€€.\nAny advice?",
        "created_utc": 1678750687,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop focusing on a girl so I can focus on work?",
        "author": "XeroSasuke",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qpw7y/how_to_stop_focusing_on_a_girl_so_i_can_focus_on/",
        "text": "I have a very specific (difficult!) work goal I want to achieve.\n\nThings were going well for the past few months. I was achieving every sub-goal on the way to the main goal (which will take me all of 2023 to achieve).\n\nAnd then a few weeks ago... I met a girl.\n\nAt first things were going fine. For 2 weeks, we would spend many hours together and we were clearly very attracted to each other.\n\nThe problem is, that time spent with her was hurting my work goal. Plus, all of the money I make **has** to be reinvested into work so I can keep growing (and achieve my goal). So I can't go on dates or anything like that.\n\n(Trust me if I could have it both ways I would. But I can't.)\n\nSo I had to make a (very difficult) choice. And I chose work 😓\n\nI told her about this. And instead of being understanding or nice about it, she went straight to hanging out with other guys. I know this because we live and work in the same area, so I see her almost every day (although now she hasn't talked to me in 2 weeks).\n\nI'm not mad at her or anything. She can do what she wants, and I made my choice (sacrificing the short term for the long term, I'm in my 20s so a relationship shouldn't take priority yet).\n\nBut now I spend houuuuurs being bothered by this. Thinking about \"what could have been\" or \"who is she with?\" or \"what are they doing?\" (urghhh)\n\nI know it's not the healthiest thing (and we we're even dating!) But the time we did have \"together\" was amazing. So now it almost feels like a \"semi-breakup\". And it sucks. My thoughts are out of control right now and, ironically, this hurts my work.\n\nHow can I control my thoughts? What would you do every time you think about her? Are there any quotes you'd put on your phone background?\n\nI need all the advice. I almost wish I had not met her. I was like a super-robot (systematically achieving every goal) before I met her. Now I'm a mess.",
        "created_utc": 1678750648,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to reddit and could use your opinion and support!",
        "author": "Natures0wn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qpqmn/new_to_reddit_and_could_use_your_opinion_and/",
        "text": "[removed]",
        "created_utc": 1678750284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help coping up with procrastination due to perfectionism",
        "author": "Complex_University30",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qpkzf/need_help_coping_up_with_procrastination_due_to/",
        "text": "I am suffering from perfectionism and it has affected my ability to produce work all my university years (i am 21, F, currently in final year of BA textile design) \n\nI have the fear that my final outcome won’t be perfect/different/best which has impaired me to go past the ideation stage and actually make practical work. \n\nI need tips and tricks to get to action and get work done. \nHow do i make myself sit to work on my final project for atleast 4 hours a day?",
        "created_utc": 1678749924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Cant I think of things I like about other people but not myself?",
        "author": "Overthinkingalaskan",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qpcu3/why_cant_i_think_of_things_i_like_about_other/",
        "text": "[removed]",
        "created_utc": 1678749404,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I change my life around?",
        "author": "youngpoet31",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qp3lp/how_do_i_change_my_life_around/",
        "text": "Im a 28 year old male and I have social anxiety and ADHD. I’m currently on treatment which consists of medication but it’s not really helping me. I find things like going to the grocery store, gym, walking outside, etc., completely hard for me. I get very nervous and jumpy and it’s humiliating. My family-I still live with my mom and dad and sister, look down on me for not having a partner and would make jokes that really annoy me at times but I would just let it slide because I don’t want any problems.\n\nI have a job in the social work field and I don’t like it at all. I’m planning on changing my field but scared of my parents. \n\n\nI’m trying my best to change my life around. Eating healthier, going to the gym, taking my vitamins. But sometimes(like today) I just feel like I can’t hang on any longer. I’m severely tired of living like this. Anyone have any tips on how I can improve my \nlife?",
        "created_utc": 1678748810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do these qualities attract more people to you?",
        "author": "itgirliana",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qozz6/do_these_qualities_attract_more_people_to_you/",
        "text": "Every time I’m looking for advice on how to find new friends/relationships/dating in my life I always see them advising you work on having these qualities. \n\n1. Confidence\n2. Self love/self esteem\n3. Your own life/hobbies/goals\n4. Happiness\n5. Avoid being clingy\n\nWhy are these qualities considered attractive and why people are more drawn to someone who possesses those qualities? \n\nAnd why would someone who doesn’t have those qualities be LESS attractive? \n\nI just want to know. I want to improve my social life. I’m trying find people to be in my life. I do enjoy being social. I just struggle to find that solid group of people. My “tribe” if you will. I see some people put it that way lol. \n\nI feel like I struggle to connect with others in a long lasting way. I don’t want surface level interactions with friends and dating. I want something meaningful. I just feel like maybe without those qualities I may be seen as not interesting? I can sometimes be really clingy. \n\nI want to work on this. I do need to work on those qualities I can admit that. I just want to know why those qualities are considered attractive. And why do people gravitate more towards people like that as opposed to people who are the opposite. When it comes to friends AND dating. \n\nI’d appreciate some answers/advice on this 😁",
        "created_utc": 1678748587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideal jobs with just an undergrad degree in psychology?",
        "author": "Shortswinterwearer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qoraj/ideal_jobs_with_just_an_undergrad_degree_in/",
        "text": "I will be getting my bachelor's degree in psychology this Summer but am not sure what exactly I want to do with it. Any general suggestions on some ideal jobs someone could get in psychology without a masters degree?",
        "created_utc": 1678748060,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find the motivation to move on after constant rejection and everyone telling you you aren't gonna make it?",
        "author": "RefrigeratorKey1518",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qomn4/how_do_you_find_the_motivation_to_move_on_after/",
        "text": "I spent this entire morning and afternoon drinking, my head hurts but it was the only way to numb the pain. I am finish up grad school and applied to some post doc programs that could really help my career and get me on a leadership track and I do have a good resume too. Well guess what, I got rejected from over 15 jobs in 48 hours. \n\nI called my dad for support and he laughed saying \"people like us aren't meant to aim high but live a boring life paycheck to paycheck, who do you think you are\"\n\nI cried so hard after. I am so tired of people looking at me and thinking I can't do anything. I wish it was true that as long as you work hard you will always get better but that shit isn't true in 2023. I really wanna give up but also wanna keep working hard. But its already written in stone that I am gonna achieve nothing in my career.\n\nI am not even good enough to date or have a family, I atleast wanted to be good at my career but when its all signs point to it being futile what should I do?",
        "created_utc": 1678747767,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm addicted to social media",
        "author": "Lime_Rose3",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qoac9/im_addicted_to_social_media/",
        "text": "I didn't realize I was until about 4 weeks after deactivating Instagram. At first I thought \"this will be good for me\" but then slowly I started getting worse and worse into depression because I had nothing else to do outside of work, house cleaning, and I really have nobody to talk to. I guess it really does do something to your brain, the reward dopamine or whatever. I thought quitting would be better for me and it was until it wasn't. Anyone else experience this after leaving a platform? Does the depression last very long? I just came back to Reddit a few days ago and I'll probably need to leave here too sooner than later. I already know this is pathetic so please be kind when responding.",
        "created_utc": 1678747004,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i start living in the present rather in the future?",
        "author": "LegAnxious5102",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qnzux/how_do_i_start_living_in_the_present_rather_in/",
        "text": "Whenever i have a goal i think about it, Journal it, and then  never take the steps into doing/learning the things i really want.\n\nAny help?",
        "created_utc": 1678746373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not able to fulfill promises made to myself",
        "author": "SearchPast7402",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qnfjd/not_able_to_fulfill_promises_made_to_myself/",
        "text": "Last time I see myself happy with my performance was back in 2020 pre covid times ,since then I have been so laid-back and unconcerned. I formed the habit of binge watching youtube vids during lockdowns and It wouldn't be wrong to say I spend HOURS  wasting my precious time, and i dont see myself coming out of that habit either.\n\nSecondly I don't keep up promises made to myself like, 'I am going to wake up early tomorrow' or 'I will start exercising tomorrow' Now, you guys may sense that I am a massive procrastinator. I don't think so. Because procrastinators manage to finish their tasks in the nick of time, unlike me who doesn't do it at all. Sometimes I wish I could have my old form back....\n\n\\***C**urrently I am in a do or die situation, I have my university entrance tests in 2 months and need to prepare quite a bit (I really do not want to take a drop) and If I continue my actions, well I'll be fcked up",
        "created_utc": 1678745153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas and Tips for Steps in Self-Improvement Journeys?",
        "author": "Coconutcorn",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qn8ux/ideas_and_tips_for_steps_in_selfimprovement/",
        "text": "TL;DR: Throw random ideas and at me for next steps in my self-improvement journey.\n\nHi,\n\nClose to a year ago, my girlfriend broke up with me after a codependent relationship (in which she was the controlling party) of 4 years.\nImmediately, I decided to come out of it better than her. It was an unhealthy thing to focus on, but I knew that it’d motivate me to work forward. It did, and I did. After half a year, I found myself being truly in a better place than I’d ever been. I kept working on myself, always setting a next goal and being forgiving if it didn’t go as fast as expected.\nI’ve now created a habit of becoming better than myself, and I seriously but humbly want to applaud myself for what I’ve done up to this point. I’ve just decided to make this into an experiment for myself. How far can I take this in the coming year(s)? How far can I develop towards the best of myself? I have a next goal, independence, but after that one I don’t have any plans yet.\n\nAs part of this experiment, I’m looking for any ideas at all, just for inspiration. What do strangers think (from experience or otherwise) are good things to work on to become the best of one’s self?\n\nI’d also like for this to maybe be a source of inspiration for others as well. It’d be nice if I get more than one reply. Stories about own experiences are absolutely welcomed too. I’m mostly curious what people have to say, so no wrong answers, wether they apply to me or not.\n\nI wish any reader good luck on their own journey.",
        "created_utc": 1678744765,
        "upvote_ratio": 1.0
    },
    {
        "title": "hobbies",
        "author": "IJsbeerSama",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qn6x0/hobbies/",
        "text": "i recently started doing NoFap because i taught it would help me be more motivated.  \nAfter starting i realised i don't really have any hobbies wich makes it really hard for me to not fap.  \ni usually just spend my time watchin anime  and playing games.  \n\n\nI have tried to start some new hobbies but due to my lack of motivation it's hard to get started with anyting.  \n\n\ndoes anyone know any free or cheap hobbies i can pick up, or have any general tips to help find a new hobby?",
        "created_utc": 1678744645,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be better.",
        "author": "inORIGINAL-NAME",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qmzr5/i_want_to_be_better/",
        "text": "I'm a teenager who's kind of overweight, I'm not fit and I get tired easily, I don't have that many friends and I'm not that close to most of them except a few select ones and I'm very socially awkward, I've also had difficulty with school stuff but I've began remedying that recently with some success, but now I want to start looking better, I'm a picky eater but I've began eating healthier for the sake of feeling and looking healthier, I also want to act better, to be a better person.\n\nExcept for eating healthier, I am not sure how I should proceed, I don't know what's the best exercise routine that I could do, so any advice and tips would be appreciated.\n\nFor the matter of acting better, I don't know where to start, I feel like I'm always the extra friend in most situations, and most of the friends I have tend to be friends of a friend, I don't know how to make friends on my own, and I act awkward with new people to the point where I don't even know whether to give them a handshake or not sometimes.",
        "created_utc": 1678744221,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get motivated when I’m happy?",
        "author": "Steakandcocaine",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qmrnr/how_to_get_motivated_when_im_happy/",
        "text": "First time in my life where negativity is is minimal. I (25M) was always a go getter type, but after a series of up and down events I burnt out. \n\n\nI planned to take a small break from my crazy ambitions. But it went a lot longer than planned…. I’ve gotten real comfortable. I work a chill building-job that I don’t hate, with a cool work team that pays decently. I spend my weekend at home with close friends having beers and eating out at cafes. For someone who was a huge party animal, I’m loving my nice quiet life. \n\n\nI’m happy. But I know one day I’ll end up with a gf, and kids and all this other responsibility stuff. \n\n\nI really should be working on a start up or getting a higher paying job in the field I actually studied for (software engineering).  Building doesn’t really have a high ceiling (mind the pun) in my country. \n\n\nIt’s really hard to get up and going, when I don’t feel like I have any problems. I’m at my peak performance when I’m in the midst of a life crisis or fighting to get out of a depression lol",
        "created_utc": 1678743745,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with being made into an romantic fanfic?",
        "author": "GT_Surge",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qmp5t/how_to_deal_with_being_made_into_an_romantic/",
        "text": "Yes I know this sounds weird, but a few days ago some classmates made a romantic fanfic of inspiration that I talked to a new kid in my class. It’s basically between that guy, my friend and me, it’s been only like a week and it’s spreading like wildfire.\n\nAnother classmate has already written a fanfic about my friend and me a few years ago. It didn’t “blow up” but now that this new fanfic is being made, it is returning and it’s being used as a past for the current one.\n\nAs I said, it’s spreading out of control, and I don’t know what to do or how to react. I could have said no in the beginning, but I knew they wouldn’t listen and just kept going, maybe even more motivated with my pleas. \nShould I go with it or try to stop it somehow? \n\n\nThe point is, I don’t want this to happen again, so I wanted to change my attitude or something. I feel like I’m very easygoing and that was the reason it surged in the first place. Could or should I be more stern or how should I present myself so I could be more respected? Because as of now, the people that “support” me are pitiful of me that I can’t stand up to myself.",
        "created_utc": 1678743603,
        "upvote_ratio": 0.99
    },
    {
        "title": "Real self",
        "author": "Unbreadingkit",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qmbu2/real_self/",
        "text": "Has anyone legitimately come to an understanding that self improvement does not work and that there is nothing one can do to legitimately better themselves or enhance their chances at achieving any meaningful change or success? \n\nIt seems that all attempts at self improvement follow the path of excitement and later, a disappointment of nothing truly having changed \n\nSo is that not the real purpose of self improvement, an understanding to the point where you no longer care about the improvement just ‘the self’.",
        "created_utc": 1678742806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, i need help a perspective change a wise woman or man to tell me what exactly im feeling",
        "author": "alittlesedated",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qkrld/hi_i_need_help_a_perspective_change_a_wise_woman/",
        "text": "i used to be 330 pounds dropped to 220, with fasting, veganism, mediation, i thought the goverment was trying to kill me by putting poison in some of my available options and i was meant as a person who is trying to improve choose only what i know to be sacred and righteous so i would never die at the hands of the oppressor. long story short, i am no heavy again, the government thing is they won, i dont know bro, i cant work, i cant move, i dont care about anything important, family friends, i have fell in this empty space of pleasure, i am coming off of 3 year sof meth abuse, adderal abuse and coke, and without it everything is colorless and pointless, i dont want to kill myself i just want to rot in pleasure and wait for heart to cake. i dont know what i need to do, i go for walks or gym, or eat well or fast whatever it may be for weeks and i just fall out of it, i have no discipline , i have nothing really im 28, i feel like this is it for me.",
        "created_utc": 1678739457,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22M) want to be better and have a better life",
        "author": "FonFon_6606",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qjqkf/i_22m_want_to_be_better_and_have_a_better_life/",
        "text": "[removed]",
        "created_utc": 1678737289,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22M) want to be better and have a better life.",
        "author": "hidden-god",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qjoar/i_22m_want_to_be_better_and_have_a_better_life/",
        "text": "[removed]",
        "created_utc": 1678737143,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I avoid boredom and detach myself from my phone?",
        "author": "PutReasonable3882",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qj6aa/how_can_i_avoid_boredom_and_detach_myself_from_my/",
        "text": "Hi to all. I'll start by saying I'm extremely and BEYOND tired of social media and actually my phone in general.. I just can't continue being stuck in this routine. Work, phone, phone, phone, work, phone.. I'm EXHAUSTED. Even when I go for drives, or go see friends or walk around the mall.. when I come home and get on my phone even after being busy all day.. I instantly feel strong emotions of frustration, dissatisfaction, loneliness and helplessness. I don't understand. I'm also going through heartbreak and I feel I'm putting unnecessary baggage on this person because I've been so unhappy in my personal life or more so the lack of. What can I do? The craziest thing is that I know the root of the problem, boredom.. not being satisfied with anything.. I could go for walk, see a friend and I come home and I get depressed and a feeling of desperation that I'm \"trapped\" (so to speak) when I use my phone.. it's been mentally and emotionally damaging and is affecting my relationship with myself and the people around me. What are some hobbies or things you guys recommend that I can do alone? What are some places you guys visit? Anything helps. :)",
        "created_utc": 1678736048,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do I motivate myself to forget about someone",
        "author": "kitty514",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qj0l0/how_do_i_motivate_myself_to_forget_about_someone/",
        "text": "He’s all I think about it’s a complicated situation but I saw something that made me feel jealousy and rage and he’s ignoring me right now it’s always been hot and cold with him and it messes me up. I’m very lonely so it makes things worse. I like to think it’s only like this because we live very far apart and it’s unfair for me to expect much because he has more of a social life than I do but it hurts me a lot and I hate how attached I feel and I just don’t like the person I am and want to improve. I just feel pathetic and it’s so addictive to fantasize though I feel delusional after. I have no friends in real life and I only got him and another online friend and I’m just so scared to lose anyone else. I want to make friends but I don’t want to make them being this version of myself. I have goals and know what I want but I fall into lazy habits and procrastinate. Im just scared it’ll all be for nothing and I’ll still feel like shit. How do I just turn my mind off and stop thinking about him and stop letting it consume me.",
        "created_utc": 1678735716,
        "upvote_ratio": 1.0
    },
    {
        "title": "I couldn't defend my gf, body, weight and even myself",
        "author": "Otherwise-Angle4375",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qiyyg/i_couldnt_defend_my_gf_body_weight_and_even_myself/",
        "text": "I'm 22 M. I in dire need to improve my personality.\nYesterday, I came from a badminton session. Some friends of mine were standing near my room. A guy started to make fun on me for trying to play badminton. Then it went to how thin I am. Then went to my body weight. He then also commented on my gf being pathetic. I just stood there trying not to break the smile.\n\nI feel ashamed for not able to defend myself. I can't take this anymore. I want to be able to respond back without being that guy who cries.",
        "created_utc": 1678735613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know of a good way to not feel lonely",
        "author": "Jmastab",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qih4j/does_anyone_know_of_a_good_way_to_not_feel_lonely/",
        "text": "This might be a weird place to ask this but I think I I do better for myself when I try not to focus on dating and relationships but I happen to feel lonely a lot. Has anyone else feel like being lonely kinda hurts your self improvement? Like I feel like I could be doing so much more than swiping on dating apps that barely work and such. Does anyone have any suggestions on how to like not focus on loneliness like a way to distract me from it?",
        "created_utc": 1678734541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Reddit bad for you?",
        "author": "wortman69",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qieur/is_reddit_bad_for_you/",
        "text": "[removed]",
        "created_utc": 1678734402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make real friends, not just say a few words",
        "author": "Better_Tip2637",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qiayh/make_real_friends_not_just_say_a_few_words/",
        "text": "I am 30 years old and would like to meet some successful people in this software who are my age or older than me, maybe you can teach me what you are doing in business. I have encountered some difficulties.",
        "created_utc": 1678734161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Video Journaling?",
        "author": "Dizzy_sizzy",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qi5qe/video_journaling/",
        "text": "I was wondering if there would be an app that would allow you to do video journaling and get an emotional analysis right after of the different emotions you might have felt (based on your facial expressions, expressed words and vocal features), and over time you can compare how you have been feeling using this data, would this be valuable for you? Why, or why not?",
        "created_utc": 1678733849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Video Journaling?",
        "author": "Hopeful_Nature_4542",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qi328/video_journaling/",
        "text": "I was wondering if there would be an app that would allow you to do video journaling and get an emotional analysis right after of the different emotions you might have felt (based on your facial expressions, expressed words and vocal features), and over time you can compare how you have been feeling using this data, would this be valuable for you? Why, or why not?",
        "created_utc": 1678733677,
        "upvote_ratio": 1.0
    },
    {
        "title": "It feels like my friends are just fading away",
        "author": "Pleasant-Ad-2710",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qht8f/it_feels_like_my_friends_are_just_fading_away/",
        "text": "I (20m) dont feel like this is my fault entirely, some of my friends which i dont really talk to much anymore took little in consideration and makes the friendship weaker. It just feels like my friends, both close and friends i meet from time to time are waiting until they find something better to do. I totally blame the confidence issues that came with severe acne, im just not myself anymore. I am aware of friends fading away on the way into adulthood, but im still 20?",
        "created_utc": 1678733071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for starting confidence later in life.",
        "author": "zelep2",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qh38a/any_tips_for_starting_confidence_later_in_life/",
        "text": "\nI’m 22 and I’m broke, eye contact sucks, people say I’m not intimating, social skills are not there,awkward. Before shitting on myself any longer would you recommend the gym as the foundation of self improvement or other areas? I’ve been going. Trying to become that guy who’s “confident” but porn and financial issue make that shame, where I feel like I have nothing to be proud of feeling optimistic though.",
        "created_utc": 1678731451,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s your go to coping skill?",
        "author": "StrengthFew4256",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qguj4/whats_your_go_to_coping_skill/",
        "text": "me personally, is either journaling or just sleeping things off.. how ‘bout you guys?",
        "created_utc": 1678730886,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to control my emotions &amp; feelings?",
        "author": "sudo-kingslayer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qgu1w/how_to_control_my_emotions_feelings/",
        "text": "there's still one thing which is holding me backwards, and it's the emotions &amp; feelings. \n\nhowever, i don't show it to anyone my emotions, but problem is; \n\ni suffer in my own mind. there are millions of thoughts going over my mind, which is causing me to overthink alot. and making my mental health worst!",
        "created_utc": 1678730853,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a lot of time on my hands at work.",
        "author": "Dragon-Dragon-Dragon",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qgr0z/i_have_a_lot_of_time_on_my_hands_at_work/",
        "text": "In one of my current jobs I have quite a bit of free time. I listen to audio books and watch YouTube or draw or read. However I  want to be more productive with my time and gain skills that can actually get me a higher paying gig. \nWhat are resources I can use to gain actual marketable skills. \nI’ve started some very beginner coding apps and language apps but want to get more serious. I’m looking into Coursera right now for courses and certificates in certain areas. \nWhat are some resources I could utilize?",
        "created_utc": 1678730659,
        "upvote_ratio": 1.0
    },
    {
        "title": "My family and old friends always bring me back to a helpless depressed mindset I had when young, is it time to cut all ties?",
        "author": "GreenApple227",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qg5ku/my_family_and_old_friends_always_bring_me_back_to/",
        "text": "my family isn't close and seem to enjoy each others pain. my friends, in retrospect, just used me. my 'good' friend I thought all these years only once connected in college, to get urine for his good friends drug test, then they even ditched me at the event the actual invite was about. \n\nall these past events, so many, I think I can attribute everyone's fake friendships due to the fact I was so negative and depressed back then..still am actually, but its because I'm living the worst possible version of my life now.",
        "created_utc": 1678729280,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate my friends",
        "author": "Alpha_Robot2401",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qfyrn/i_hate_my_friends/",
        "text": "I’ve realized that after I started self-improvement that I can not stand being around my current friends anymore. They make me so mad about what they do or what they talk about. For example my one friend will get on his phone during a study period and he will be watching a video with the mini player thing with it in the top right corner and then play a game. I find it so annoying that he can’t be without stimulation for so long that he has to be doing 2 things at once. And then they talk about Marvel and Star Wars and I can’t stand it anymore because I stopped caring about that stuff a long while ago. I can’t stand being around them anymore.",
        "created_utc": 1678728848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every Monday Morning I struggle to get up",
        "author": "Chubbysloot",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qfsev/every_monday_morning_i_struggle_to_get_up/",
        "text": "Every Monday I’ll sleep in later, get out of bed later, and get ready later to the point I’m rushing out the door to be at work on time. During this I often go through the whole despair routine of no one likes me, I’m failing at being a better person, I can’t keep pushing etc etc. Yet, after Monday I don’t feel that way often. I’ll get out of bed on time, feel confident at work, have the energy to socialize how I want to, and I’m typically active. I don’t know if I’ve unconsciously set Monday as a mental dump for me or even if it’s healthy.",
        "created_utc": 1678728458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I sound attractive?",
        "author": "Vivid_Dirt_5010",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qfrzo/do_i_sound_attractive/",
        "text": "I don’t want to post a picture since I’m a bit uncomfortable with that. So I thought I’d give a description. So comment your thoughts :)\n\nI am a man, I’m 6’3” and pretty bulky athletic at around 200 pounds. I have curly dark brown hair that extends to my earlobe and I’m usually clean shaven. 8 inch hand length, 12 size shoe in mens, average voice I suppose, and I’ve had one year long relationship with a woman whom I’m still on good terms with. I have stretch marks everywhere though, and I have some acne scarring (nothing too severe). \n\nI’m 20 years old, I’m pretty quiet, and only talk when I’ve put a lot of thought into something xD although that can sometimes mean I overthink too much. I’m currently working towards getting a bachelors in fine arts at a technology institute, and am working as a pizza delivery driver part time. \n\nI’ve always been pretty self conscious and I’ve never had the guts to ask anyone in person besides maybe my now ex-girlfriend who thinks I look pretty handsome, but I wasn’t ever sure she was being literal.  \n\nThis is kind of dopey, but any kind of feedback regarding how I could improve would be appreciated :) Thanks!",
        "created_utc": 1678728431,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to increase fluid intelligence safely?",
        "author": "Rumthiefno1",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qfq5q/how_to_increase_fluid_intelligence_safely/",
        "text": "Hi everyone,\n\nI put that question above because I'm looking for some advice, please. At the moment, I'm doing everything I can, including but not limited to:\n\nExercising regularly\nEating healthily\nGetting adequate sleep\nChallenging myself (this includes learning guitar, practising a second language, knitting, etc) on a regular basis)\nMaintaining social interactions.\n\nThe concern I have, which I've had for a long time, is that my 'cap' on my ability to learn, understand, develop and improve has never quite been where I've needed it to be, let alone wanted it to. \nI'm frequently around people who find all manner of concepts easier than me to grasp (my younger sister outperforms me in every way. The only thing I'm told is that I'm 'nicer'), and right now I'm in a challenging job that I really enjoy, but need to be better in if I'm going to hold onto it. \n\nI make lists of things I have to improve on, try out checklists, and get practice at things in it, but I keep falling into the same mistakes. I'm reading Neuro-Linguistic programming for Dummies to help me with this. \nMy capacity in planning for tasks and recall usually is fine, but I struggle with adapting to ongoing developments, and as people have told me, I'm behind in this.\n\nI want to, and need to be better for the kind of life I want to live, and the person I want to be.\n\nDoes anyone know any other low risk methods I can use to enhance my fluid intelligence?\n\nFailing that, are there other risky but potentially rewarding avenues I can go down to try and improve it? \n\nThank you for your time in reading this.",
        "created_utc": 1678728313,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people make themselves sleep early?",
        "author": "What_A_Save_RL",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qfakx/how_do_people_make_themselves_sleep_early/",
        "text": "Hello everyone. Im having trouble sleeping and i cant seem to sleep early. I tried taking melatonin and just laying in bed but I don’t seem to go to sleep. Im just staring at the ceiling or on my phone and don’t end up sleeping until really late. Any tips?",
        "created_utc": 1678727231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I add more value to lives of my close ones?",
        "author": "DanDruffSlayer",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qf90j/how_do_i_add_more_value_to_lives_of_my_close_ones/",
        "text": "It's quite vague, but let me explain - I am mostly there for my friends when they need me, and am always willing to hear them out. I try to be non judgemental most of the times.Of course, as close friends, we bond over things.\n\nBut I realize I'm not really someone who helps close ones push their boundaries, discover newer territories, or push them to do better. I do encourage people, but more in a way that makes them feel okay mentally or makes them feel better about themselves at the moment. Partly, because of me being people pleasing? I realize, sometimes, I need to push them to do something uncomfortable, even if it may make me sound like a taskmaster. I think I want to say, I mollycoddle them rather than being the person they need at that point. How do I add true value to the life of my friends and family? \n\nMaybe, part of the reason I am this way is because I'm not confident in myself and clear in what I want, or push myself out of my own comfort zone. Working on that will partly help, but are there any other tips?",
        "created_utc": 1678727128,
        "upvote_ratio": 0.99
    },
    {
        "title": "I have a question?",
        "author": "A_little_lost_13",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qf4l2/i_have_a_question/",
        "text": "I was just thinking, and suddenly this question came into my head, so the question is what makes you special about yourself?",
        "created_utc": 1678726862,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does everyone get motivation to keep something consistent?",
        "author": "What_A_Save_RL",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qf182/how_does_everyone_get_motivation_to_keep/",
        "text": "Im a Freshy in community college and im having a real hard time trying to be consistent especially with working out, studying, reading, and sleeping early. I have tried changing habits to be more consistent but its difficult. I always seem to end up not being consistent after 1-2 weeks. Anyone have any tips on being consistent, or being dedicated to something in order to be consistent?",
        "created_utc": 1678726647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self security issues",
        "author": "Jamesd646",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qezny/self_security_issues/",
        "text": "[removed]",
        "created_utc": 1678726550,
        "upvote_ratio": 1.0
    },
    {
        "title": "You’d Be Surprised How People Perceive You",
        "author": "WorryTimely231",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qeyyr/youd_be_surprised_how_people_perceive_you/",
        "text": "[removed]",
        "created_utc": 1678726508,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I woke up at 5 a.m. every day for 5 months",
        "author": "WinterIsHereNetZero",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qeu0k/how_i_woke_up_at_5_am_every_day_for_5_months/",
        "text": "Hey guys,\n\nSo I have been waking up at around 05:00am for the past 5 months - transitioning from night shifts and completely turning my lifestyle and schedule around. This has had such a positive impact on my overall mood, mental health, physical health and cognitive functions.\n\nThe techniques I used are as follows:\n\n1. **Initial Struggle** \\- there will be an initial period of struggle when you attempt to wake up early. This is akin to a bird flying - in order to enter flight mode it must flap it's wings aggressively and only then will it float through the sky - similarly you have to utilise excessive willpower and energy in the primary phase of this change in order to be able to maintain this habit moving forward.\n2. **Exposure to Sunlight** \\- early morning sunlight is critical to aligning the body clock and molecular machinery for a consistent sleeping routine. The sun rays at sunrise will trigger your body to set it's sleep schedule for 16-18 hours later and thus you will feel energised and tired at appropriate times during the day.\n3. **Exercise in the Morning** \\- in order to wake your body up optimally, your core body temperature should be higher during periods of wakefulness and lower during periods of sleep. So, to piggyback on this biological mechanism, we can work to raise our core body temperature through exercise. Personally, I walk in the mornings in order to achieve the elevated heart rate and body temperature and this allows me to prepare mentally for the day ahead as well as improve my mood, mental and physical health.\n4. **Caffeine** \\- I limit my caffeine intake to prior to 12pm; no caffeine after. Also delaying caffeine for 60-90 minutes upon waking helps to clear out the caffeine from the previous day and start afresh with your adenosine receptors; maximising the effects of the caffeine and eliminating the afternoon crash most people experience at lunchtime.\n5. **Stop working by 5/6pm** \\- I turn off all cognitively demanding tasks by 5/6pm and enter relaxation mode; switching from a dopamine driven system to a serotonin based system - achieved by relaxing, eating and doing other leisurely tasks in order to wind down physically and mentally before bed.\n6. **Eat a Carbohydrate-rich meal 2-3 hours before bed** \\- Eating a high carb meal 2-3 hours prior to sleeping has several benefits; firstly, the high carbohydrate meal will cause an increase in serotonin in your bloodstream, which is associated with relaxation and contentment and satiety. This will help you wind down physiologically and get you relaxed before you sleep. Secondly, by stopping eating 2-3 hours before bed, you ensure your digestive process does not interfere with your sleep cycle or schedule. If you eat too close to bed you will wake up feeling groggy, and will require more sleep and will struggle to wake up the next morning.\n7. **A warm shower within an hour of sleep** \\- a warm shower will lower your core body temperature, relax your muscles and signal to your body that it is time to relax. It helps you to get ready for bed both physically and mentally.\n8. **No lights an hour before bed** \\- I switch off my phone and put it away an hour before bed; to do so, I reply to all conversations, turn my alarm on and enter Do Not Disturb mode an hour before I sleep.\n9. **Mindfulness before sleep** \\- I spend 30-60 minutes in a dark room praying (I'm a Muslim so I pray the night prayer), alternatively, you could engage in any spiritual or mindful practise. During this time I also prepare myself mentally for the next day by planning ahead and this has a positive effect in that it excites and energises you when you wake up in the morning because you have already visualised and planned the day the night before.\n10. **Failure** \\- I have had days and periods of time where life has gotten in the way and I have had to sleep later and this may cause me to wake up later - but I have had to use strong willpower and discipline in order to not allow one or two days to interrupt my schedule and prevent me from having my routine being set.",
        "created_utc": 1678726179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m depressed. Should I go back to school to move out ?",
        "author": "SnooDoughnuts3368",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qes6k/im_depressed_should_i_go_back_to_school_to_move/",
        "text": "I’m 21 and I dropped out of school my freshman year because I believed college is way too expensive nowadays &amp; what I wanted to do didn’t require school (real estate). I’m at home still living paycheck to paycheck still diving into a deep depression. My gf is in Cali so I can’t even see her. I don’t go out, the cars where I’m at are too expensive so I don’t have that. Should I go to a community college, what should I do ?",
        "created_utc": 1678726054,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am seeking advice from elderly.",
        "author": "Quick_Ad_3748",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qepww/i_am_seeking_advice_from_elderly/",
        "text": "Hello, I am a young fellow and I am seeking advice from relatively older people about any topic to shape my future as best as I can.\n\nAdvices can be like: \"keep drinking your milk so you will have no insecurities about your height in the future\", \"start learning Chinese so you can put yourself ahead of your competitors in business life.\", \"turn squeezing your pelvic muscles after peeing into a habit so you can control yourself better during the intercourse\" etc...",
        "created_utc": 1678725903,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really have to get my life together, Everyday is too painful.",
        "author": "MoBarbz",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qe3ci/i_really_have_to_get_my_life_together_everyday_is/",
        "text": "I'm 20 years old, soon graduating from college. My grades went down. My head filled with suicidal thoughts. I spend my day doing destructive activities to forget the pain of existence. Gaming, Porn, Cigarettes and lately even started drinking. It was only when I started drinking I realized how bad the path I am on is. I fear I am going to be a jobless bum in the future. \n\nWhen the Lockdown started, I had only recently started college, I had fucked up High school but somehow got into a mediocre college in a program I was interested in, It was the lowest point in my whole 20 years of existence, I was the most suicidal, I spent 3 months in a vegetative state barely eating and watching anime and playing games for hours in a day. But once I enrolled in a college My wasted years of high school acted as fuel for me to change myself and I did. I studied hard, exercised and lost 34 kilograms of weight (I weighed 132 and was fat all my life, got bullied for it as long as I can remember) but things again started going bad after mid 2022. Suicidal once again, got diagnosed with depression and currently on anti depressants which do not seem to help me. I realized it is my bad lifestyle and especially my bad thought patterns.\n\nI did not the see the point in living, felt so insignificant like how the death of a single ant in an ant colony wouldn't make any difference and that's how I felt about me in relation with society. Used to slit my wrists and choke myself in anger but thankfully stopped doing that but this pain still doesn't go away\n\nI know my potential and the things I can achieve yet I lack discipline and the will to actually get my life together. I gained back 5 kgs too and stopped exercising seriously and the Cigarettes are the worst. They make me feel the most bad about myself, I hate them yet I smoke them. I feel bad as I am in the act of smoking them but I can't stop myself.\n\nI don't know what I hope to achieve here but I wanted to vent. I lost all the good habits I had built, Journaling, Reading, Exercising, Studying and went back to the shit hole. I have to get back because this is not it.",
        "created_utc": 1678724433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move out or stay with parents for 6 more months?",
        "author": "Pencil_Writing",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qe2jq/move_out_or_stay_with_parents_for_6_more_months/",
        "text": "I am a 24M from UK who is in a fortunate position as I have a good remote job as a Software Engineer, am in good health and I have been living with parents for a year, allowing me to save some money.\n\nWe live in a very nice small town by the sea with plenty of cycling and walks, and my old school friends are still here. However, the environment at home is quite toxic and I have been forcing myself to endure it over the last year for those savings £££.\n\nI told myself in 2023 I would move out and get my own place here, however, it is quite an expensive area, there are no houseshares available, I can't move in with any friends, and my only option would be to rent a small 1 bed flat. I have found one available with a 6 month contract. This is appealing to me, as I think I might go travelling in the winter, however in the meantime I am in a dilemma.\n\nRenting would be expensive, and even on my decent salary, it would take up about 40% of my income with bills. It feels like a pointless waste of money as I will be staying in the same town, however the toxic environment at home is starting to effect my job and mental health.\n\nOur house is very small and my family is large, and one of my parents has significant mental issues.\n\nFor instance, I frequently get woken up early in the morning by one of my parents playing musical instruments. Usually, I don't mind this sort of thing, however, when my job requires focus and good quality sleep, this is an issue. I have started making mistakes at work due to poor sleep and focus.\n\nWhen confronted, they promise to stop, but then keep doing it again, saying that its for their mental health and the only time they can practice playing is before work. This shows to me that they don't actually care about my work environment and I can't take their promises seriously.\n\nThere is often a lot of daytime noise also, again my pleas for quiet go ignored. Sometimes I will go out to work at a cafe/library, however I'm getting fed up of the lack of consistency and feel like I need a proper home office where I can work undisturbed.\n\nThey also don't seem to understand that despite working remotely, I need consistency to be productive. I tell them that I plan to take my lunch break at a fixed time, however, when I go downstairs to make lunch I am met with huffing and moaning as someone else will always want to use our small kitchen at the same time as me or they'll have \"just cleaned up\" etc. I am also expected to help out with jobs around the house during my working hours sometimes.\n\nI'm sure these are common issues for people living with parents, however, it is making my life feel very chaotic and my productivity is in shambles. I feel like my complaints aren't taken seriously and they don't understand why I can't \"just get on with it\".\n\nI don't feel like I should need to fork out over 1000 a month just to have a quiet work environment in the same town as I already live, yet the thought of enduring this for another 6 months is not very fun. \n\nHowever, I also think about what that money could be better spent on instead of rent (ie. driving lessons, holidays, more savings etc). I don't want to move to a cheaper area just yet, so it's between staying at home or moving to this 1 bed flat down the road, for now.\n\nAny advice is appreciated!",
        "created_utc": 1678724385,
        "upvote_ratio": 1.0
    },
    {
        "title": "what can i do if i am feeling always tired and unmotivated",
        "author": "rustycatty",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qdnor/what_can_i_do_if_i_am_feeling_always_tired_and/",
        "text": "seems like i don’t have a power to change my life at all, my sleep schedule is terrible and i am trying to fix it but seems like dont have willpower to do it, i am always tired and feeling guilty for it a lot, i do nothing everyday \nhow to fix it, did someone go through the same situation? \ni am 19yo",
        "created_utc": 1678723432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unf*ck Yourself, book recomm3ndation!",
        "author": "whatisthematterwith",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qdn8o/unfck_yourself_book_recomm3ndation/",
        "text": "I hope that that 3 fished you in and that you came on here. 🙏\n\nI just read Unf*ck Yourself by Gary John Bishop on Blinkist (that’s reading for people who have kids), and just came on here to recommend it to you. It was powerful and might be life changing to you. \n\nIf you’ve read it, please do comment your thoughts and perspective on the content and how it might have helped you.\n\nBest of luck 🙏",
        "created_utc": 1678723403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meditative Prayer",
        "author": "Lost_Ad_5833",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qczah/meditative_prayer/",
        "text": "[removed]",
        "created_utc": 1678721857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today a shopkeeper again fatshamed me and called me fat and short",
        "author": "Queasy-Ad4667",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qch8e/today_a_shopkeeper_again_fatshamed_me_and_called/",
        "text": "I accept that i am fat . I want to change , ihavd started to do somethings - not eating fastfoods  regularly, walking 10k steps 6 times a day , taking stairs. It keep me motivated to loose weight. \n\nEvent like these completely shatter my confidence and i again get in the loop of hating myself. The worst thing possible was that eveny umcle was also with me while we were shopping. I was crying in my heart blaming myself just saying - I am sorry, I destroyed my body. \n\nHow do i again get into motivation ?  I m pretty sure i am going to remeber this for my whole life",
        "created_utc": 1678720674,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am unconfident in communication",
        "author": "CoCo-R10",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qcef4/i_am_unconfident_in_communication/",
        "text": "[removed]",
        "created_utc": 1678720493,
        "upvote_ratio": 1.0
    },
    {
        "title": "need an answer I guess",
        "author": "Southern_District367",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qcb4c/need_an_answer_i_guess/",
        "text": "Hello guys. Names tyler and I'm 24.  Lately the girl I've been seeing told me all her friends dislike me, some absolutely hate me for no reason and it's all people I've thought to be jealous of what ever because of things they've said or done to me before. I don't know them much but then being my girls friends, I want to know them and hangout and stuff.\n\nThey all have said.  He thinks he's better than everyone . \nI have not once carried myself as a person to think I'm better than anyone. I believe I've been in some better situations that could happen to anyone else, but I don't go and share those thoughts with everyone. I don't think I come across as I think I'm better, lots of these people have something I would want for myself like a family or a longtime relationship or that nicer car but I don't think they're better than anyone. No ones better than anyone but I don't know why they think that? Or what they could be thinking to even think that? I do put myself out there because I am a social outgoing person especially when we all meet ag the Bars. I like to think I'm a nice person 🤷‍♂️",
        "created_utc": 1678720272,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the moment that made you realize you had to change?",
        "author": "Medusa_h",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qc4p4/what_was_the_moment_that_made_you_realize_you_had/",
        "text": "You know how people talk about 'the moment' that made them realize they had to change or that turned on a switch in them that made them change?\n\nDid you had one? If yes, would you share your story in the comments?\n\nThank you, have a nice day",
        "created_utc": 1678719852,
        "upvote_ratio": 0.99
    },
    {
        "title": "There’s only one easy way",
        "author": "Navigator111",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qbzak/theres_only_one_easy_way/",
        "text": "For years I have been searching for the way to make hard things easy. (YouTubers said if I stayed off my phone everything would be easy.) I just found out that accepting the fact that it’s never gonna be easy makes it way easier to get off your ass and do the work. 10/10 highly recommend",
        "created_utc": 1678719503,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be productive, but then the memories of my ex and my lack of friends and human connection take over and paralyse me. I'm sick of being undervalued.",
        "author": "ChromeHomeworld",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qbtg9/i_want_to_be_productive_but_then_the_memories_of/",
        "text": "Hi all, I really want to be as productive as possible, to hone my skills and gain new ones, and to make as bright as possible a future for myself. And on some days, I can do that. I can go to work, come home and practice my art, and do dissertation work for my master's degree. But on most days, I can't do it. I have diagnosed clinical depression (currently unmedicated because the last time I was on antidepressants they made me worse and stopped me eating for weeks at a time, so I've been hesitant to use them), but I am seeing my doctor this coming Wednesday to discuss alternative antidepressants. This of course is naturally going to affect my motivation to do pretty much anything, but recently it's just been so much harder due to my long-term partner breaking up with me because I was \"hard to be around\", even though they never told me this until it happened. This emotionally and mentally crippled me, and still does to a large extent. And no matter what, when I try to engage in my hobbies, or do something productive outside of my job, the memories of them come back and stop me in my tracks. I look at what I'm doing and think \"what's the point?\" I know you're not supposed to make another person your whole world and the only thing that makes you happy for this very reason, but that was something that I learned was a mistake through hindsight. How worthless was I to them that I could be abandoned like that? I was so in love with them, and they made me so happy. Even if I do get into another relationship in the future, I don't think I could love again like that. Nothing brings me as much happiness as that relationship did - even the temporary moments of joy I get from my hobbies are nothing in comparison. And I just get reminded of this and it makes me freeze, and saps any motivation to go on doing things. \n\nThis feeling of loneliness extends to my friendships as well. I had to move away from the city that I went to university in, and away from all my friends, due to not having enough money to pay rent there for the time being. So I'm back living with my parents at age 23, completely alone with no friends in a remote town, which is something I desperately wanted to avoid. My partner and I were saving for a place together. But they left and now I'll have to save for a whole lot longer. \nOver messages and calls, my friends aren't the most talkative bunch in any case, and it's usually me initiating contact. Even my more talkative friends have recently wanted to \"take a break\" from talking to me (granted, for good personal reasons), but even then they're still very active on social media which makes me think it's just *me* they don't want to keep in regular contact with. I don't expect constant communication with people - we all have lives - but when they need to take breaks from me specifically, no matter the reason (and they do have good reasons tbf), it doesn't feel good. Which makes me feel unvalued and chips at my sense of worth. Which again makes me more stagnant and less likely to do productive things. Because what's the point if others can't see my worth? Humans are social creatures, so it seems only natural to get a sense of worth from others. There's only so much I can big myself up without it just seeming delusional. How do I stop feeling like this? I just want to be able to enjoy my life without worrying about how people see me, and without these memories of the relationship I lost ruining all my attempts at improvement.",
        "created_utc": 1678719107,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I woke up at 5am for 5 months",
        "author": "WinterIsHereNetZero",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qbh7u/how_i_woke_up_at_5am_for_5_months/",
        "text": "[removed]",
        "created_utc": 1678718287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating someone, and I want to be more adventurous",
        "author": "fiskepinnen",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qbf2b/dating_someone_and_i_want_to_be_more_adventurous/",
        "text": "I recently started dating someone, and I really like him. Im 23, he is 30. I am a student at university, with 2 years left because I am taking a masters degree. He has a good job, and likes to travel and go to concerts and stuff. I’ve never done any of those things, and I find them so scary.\n\nI’ve always been a bit of a hermit, but I do know I enjoy trying new things. I just have some anxiety, I always think it will be too difficult for me and I always think about the worst possible outcome. How can I be more adventurous? I have a tendency to say ‘no’ to everything, and I would love to have a more positive mindset. I would love to be more spontane, and just do things without overthinking them. Any tips?",
        "created_utc": 1678718139,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I'm so close of being burn out again, how do I stop this from happening?",
        "author": "No_Golf_537",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qbdh4/i_feel_like_im_so_close_of_being_burn_out_again/",
        "text": "I can feel it but it was such a struggle and don't want it to happen again pls",
        "created_utc": 1678718036,
        "upvote_ratio": 1.0
    },
    {
        "title": "In depth guide with actionable steps for anyone interested in self improvement (WIP)",
        "author": "Pro_Sloth",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qaox2/in_depth_guide_with_actionable_steps_for_anyone/",
        "text": "[removed]",
        "created_utc": 1678716435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning programming for 2 years and still making 0$/m. What do I do?",
        "author": "Effective-Week-7213",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qa8oj/learning_programming_for_2_years_and_still_making/",
        "text": "I need your advice. I am 16yo full-stack dev from Kazakhstan.  \n\n\nBut im more of a full-STUCK developer because I earn 0$/m even though I qualify to junior+/middle level at least in my region (that was my position when I worked in summer). But still I can't do full-time job because I just don't have time for it because of necessary school and after that I will have college which is also necessary in my case. So employers don't wanna give their money to someone who most of the time can't work 40h/w. But on the other hand in my country part-time jobs are non-existent. And I just couldn't grasp freelancing at all.   \n\n\nWhat do I focus on in my case if I want to start making money in the matter of weeks and move out from parents house in 2 years. I just want to point out that 400$/m is threshold to live in my country comfortably so maybe something that doesn't apply for developed countries would still help me.  \n\n\nThanks in advance!",
        "created_utc": 1678715351,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no personality, what do I do?",
        "author": "No-Ambition-No-Life",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qa84s/i_have_no_personality_what_do_i_do/",
        "text": "Right now I’m sat in front of one of my course mates, he’s quite interested and has his own thing going while I’m am boring and have nothing to say. \n\nThis is a persistent issue I have when making new friends and I tend to make friends with introverted people (unlike the guy with) as they talk slower or not at all.\n\nI have a pretty slow brain and I think maybe due to covid or prolonged isolation, I’ve lost all social skills. I can talk ok with people online, people even say I’m really nice but irl especially with men I’m useless. \n\nI’m promises you I’m not overthinking it i genuinely horrible to be around, how do I improve this and come across as more interesting.",
        "created_utc": 1678715313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improve confidence",
        "author": "DanthemanXox",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11qa07n/improve_confidence/",
        "text": "Hey everyone!! Keeping things simple and straight to the point.I realized that I have issues with my  confidence. How do I improve confidence within myself?",
        "created_utc": 1678714773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice self-compassion to increase your self-esteem",
        "author": "Livebeam",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q9trf/practice_selfcompassion_to_increase_your/",
        "text": "This means treating yourself with the same kindness and understanding you would offer a close friend. When faced with difficult situations or negative self-talk, try to respond with self-compassion instead of self-criticism. For example, instead of beating yourself up for making a mistake, acknowledge that everyone makes mistakes and offer yourself words of encouragement and support. This can help you build resilience and improve your overall well-being. Over time, you may find that you are more patient and forgiving with yourself and that you feel more confident and capable of handling life's challenges.",
        "created_utc": 1678714334,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fix gag reflex from association?",
        "author": "PikaBooSquirrel",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q9la9/how_to_fix_gag_reflex_from_association/",
        "text": "I accidentally choked once when swallowing pills and now even the idea of taking pills induces a very strong gag reflex in me. I become nauseous and my throat closes up. This is before I even take the pill, just looking at it causes this. How do I untrain this Pavlovian response? I have medication I'm supposed to be taking but I can't :(",
        "created_utc": 1678713754,
        "upvote_ratio": 1.0
    },
    {
        "title": "a \"perfect\" day",
        "author": "robintimo130",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q95uj/a_perfect_day/",
        "text": "Of course there is no right way for everyone. But lets try to generalize a \"perfect\" healthy routine. \n\nStarting after a good night sleep (right temperatur, lightning conditions etc.) \n\n- right after getting up, a big Glas of (tap) water, some Yoga session and some Meditation or breathing exercise. Optional in the sunlight to get some vitamin d3. \n\n- skipping breakfast for intermittent fasting, have some herbal tee optional with some honey, fresh Ginger and Lemon. Some light activity like gardening or going for a Walk etc until Lunch. \n\nlets complete the day",
        "created_utc": 1678712703,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found this helpful in my struggle with obsessive self-doubt",
        "author": "SunRise34",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q8zxe/i_found_this_helpful_in_my_struggle_with/",
        "text": "For those of you who struggle with obsessive self-doubt and self-critique…I’ve been there too. Big time.\n\nThe circle of obsessive self-critique and self-doubt can be broken by self-commitment.\n\nCommitment to your mission, to your unique meaning to fulfill in each moment.\n\nA commitment to   \n•Understand your strengths  \n•Develop your strengths  \n•Use your strengths in service to others\n\nIt's made a world of difference 😊",
        "created_utc": 1678712298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel confident only when i am groomed properly",
        "author": "Queasy-Ad4667",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q8ucr/i_feel_confident_only_when_i_am_groomed_properly/",
        "text": "I gain confidence when i am properly groomed. When i have taken a bath, applied my moisturizer, had my deo on+ a little bit of perfume for a blend. \n Main question is that is my confidence superficial??",
        "created_utc": 1678711869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alone and lost",
        "author": "Legal-Boysenberry352",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q8u4n/alone_and_lost/",
        "text": "[removed]",
        "created_utc": 1678711853,
        "upvote_ratio": 1.0
    },
    {
        "title": "We have all been in this situation before",
        "author": "QuojoBlaze",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q8mdl/we_have_all_been_in_this_situation_before/",
        "text": "[removed]",
        "created_utc": 1678711271,
        "upvote_ratio": 1.0
    },
    {
        "title": "We have all been in this situation before",
        "author": "QuojoBlaze",
        "url": "https://www.reddit.com/r/selfimprovement/comments/11q8liu/we_have_all_been_in_this_situation_before/",
        "text": "[removed]",
        "created_utc": 1678711205,
        "upvote_ratio": 1.0
    }
]