[
    {
        "title": "\"Foolproof Pan Pizza\" dough not rising as expected",
        "author": "Socky_McPuppet",
        "url": "https://www.reddit.com/r/seriouseats/comments/7qbj6a/foolproof_pan_pizza_dough_not_rising_as_expected/",
        "text": "Nothing, it has been said, is truly foolproof to a sufficiently talented fool and if you make something idiot-proof, someone will just make a better idiot.\n\nI started the dough for Kenji's foolproof pan pizza last night and let it rise overnight. I came to it this morning and it has maybe double in size, but not the \"4 to 6 times\" implied in the recipe and it definitely doesn't look like \"[Basically a big, puffy, lumpy-looking bowl of soup](http://slice.seriouseats.com/2013/01/the-pizza-lab-the-worlds-easiest-pizza-no-knead-no-stretch-pan-pizza-slideshow.html)\". It looks like the same ball of dough I started with, but a bit larger all around.\n\nThe yeast was fresh, and I followed the recipe as exactly as I could. It's been rising for about 9 hours now, do I just need to be more patient?\n\nEDIT: So, I made the pizza this evening, and even with the dough that didn’t rise as much as I thought it was supposed to, it was pretty damned good.    \nOk, I’ll admit it - it was one of the best pizzas I’ve ever had. The base was truly excellent.",
        "created_utc": 1515931796,
        "upvote_ratio": ""
    },
    {
        "title": "CHILI SOUP",
        "author": "[deleted]",
        "url": "https://youtu.be/4Usu_xZqhEA",
        "text": "[deleted]",
        "created_utc": 1515924157,
        "upvote_ratio": ""
    },
    {
        "title": "Fettuccini Alfredo Scaling",
        "author": "Ozzyandlola",
        "url": "https://www.reddit.com/r/seriouseats/comments/7q9uj4/fettuccini_alfredo_scaling/",
        "text": "",
        "created_utc": 1515904935,
        "upvote_ratio": ""
    },
    {
        "title": "Made Kenji's Slow Roasted Pork Shoulder and Ultragooey Stove Top Mac and Cheese - Dinner was a huge success!",
        "author": "[deleted]",
        "url": "https://i.redd.it/zqpmbyswmx901.jpg",
        "text": "[deleted]",
        "created_utc": 1515891741,
        "upvote_ratio": ""
    },
    {
        "title": "Roasted Brussel Sprouts with Chorizo - Phenomenal!",
        "author": "sirscratchewan",
        "url": "https://i.redd.it/xa2cduolkw901.jpg",
        "text": "",
        "created_utc": 1515878861,
        "upvote_ratio": ""
    },
    {
        "title": "Question about the French onion soup",
        "author": "Jakeisdumbpp",
        "url": "https://www.reddit.com/r/seriouseats/comments/7q7avt/question_about_the_french_onion_soup/",
        "text": "Sadly it’s not kenji’s recipe but it is and in depth one from serious eats. Anyway i was wondering if I could substitute the fish sauce for a half teaspoon of anchovie paste since it’s just for complexity. Also if you have a recipe that is unbelievably good please share it! Thank you",
        "created_utc": 1515878154,
        "upvote_ratio": ""
    },
    {
        "title": "My second go at Kenji’s foolproof pan pizza was infinitely better, and loaded this time. Herbed caramelized onions, sausage, ham, chicken, broccoli, mushrooms, asiago, aged cheddar, and mozzarella. Amazing!!",
        "author": "josmilpinto",
        "url": "https://i.redd.it/sfppksg3hw901.jpg",
        "text": "",
        "created_utc": 1515877695,
        "upvote_ratio": ""
    },
    {
        "title": "KENJI",
        "author": "Buddybaker23",
        "url": "https://www.reddit.com/r/seriouseats/comments/7pyjcp/kenji/",
        "text": "KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI KENJI ",
        "created_utc": 1515781490,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite all day recipes?",
        "author": "finRADfelagund",
        "url": "https://www.reddit.com/r/seriouseats/comments/7py6v3/what_are_your_favorite_all_day_recipes/",
        "text": "Going to get hit with a ton of snow this afternoon. I just want to spend all day tomorrow in the kitchen. What are your favorite all  day, labor intensive, SE (or anything else) recipes? Bonus points if it's warm :)",
        "created_utc": 1515778632,
        "upvote_ratio": ""
    },
    {
        "title": "[homemade] Kenji's roast rib of beef with roast potatoes, carrots &amp; parsnips",
        "author": "Mr_Dott",
        "url": "https://i.redd.it/dx9jnm2gun901.jpg",
        "text": "",
        "created_utc": 1515773942,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone tried eating mapo tofu with noodles instead of rice?",
        "author": "6_oz",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ptyjb/has_anyone_tried_eating_mapo_tofu_with_noodles/",
        "text": "Title. I thought it might be a good idea since the sauce is not that thick and has a good amount of oil . thinking of making it for some friends",
        "created_utc": 1515729118,
        "upvote_ratio": ""
    },
    {
        "title": "Steak Smothered Sweet Potato Fries!",
        "author": "cgeezy93",
        "url": "https://www.youtube.com/watch?v=dXnKBKo-hgk",
        "text": "",
        "created_utc": 1515721696,
        "upvote_ratio": ""
    },
    {
        "title": "Cottage Roll/Boiled Dinner/Pork Shoulder",
        "author": "lingenfelter22",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ps46d/cottage_rollboiled_dinnerpork_shoulder/",
        "text": "Hi All,\n\nI'm looking to turn a pork shoulder (cut into three 5-lb peices) into what's known as cottage roll, or boiled dinner, depending where you're from.\n\nIt's a sweet brined pork shoulder, sort of the pork equivalent to corned beef.\n\nThat said,  I'm wondering if anyone has a proven recipe for the actual amount of curing salts in the brine.  Curing salt has been pretty difficult to get a hold of on short notice locally, so I didn't get a chance to get Prague Powder #1.",
        "created_utc": 1515711608,
        "upvote_ratio": ""
    },
    {
        "title": "I was sad to see the \"Scooped\" ice cream column end, so I started my own blog for the serious ice cream maker! I write about improving your ice cream with science, mastering technique, and selecting equipment.",
        "author": "realbigsky",
        "url": "https://essentialscoop.com?1",
        "text": "",
        "created_utc": 1515693835,
        "upvote_ratio": ""
    },
    {
        "title": "I am researching on the features on a Restaurant app. Would love to hear from you!",
        "author": "elephantjoemaster",
        "url": "https://www.reddit.com/r/seriouseats/comments/7pp2th/i_am_researching_on_the_features_on_a_restaurant/",
        "text": "[removed]",
        "created_utc": 1515686643,
        "upvote_ratio": ""
    },
    {
        "title": "Take my money! New unskippable ads suck. Can't we please have a reasonable subscription option for SE?",
        "author": "ChinaShopBully",
        "url": "https://www.reddit.com/r/seriouseats/comments/7plfcv/take_my_money_new_unskippable_ads_suck_cant_we/",
        "text": "I HATE the new unskippable ads for Serious Eats. I would gladly support an annual sub fee. I am constantly shifting between multiple SE recipes while building my menus. Being forced to listen to an ad (THE SAME AD) for Microsoft (currently) or whatever down the road is a nightmare, far worse than just paying for direct access. Please let us support you for Pete's sake! This business model blows chunks! Take my money and turn off the ads!\n\n",
        "created_utc": 1515642931,
        "upvote_ratio": ""
    },
    {
        "title": "Troubleshooting Carbon Steel, Cast Iron?",
        "author": "jzoppy",
        "url": "https://www.reddit.com/r/seriouseats/comments/7plbrn/troubleshooting_carbon_steel_cast_iron/",
        "text": "I know, I know, another one of *those* posts about *this* topic. I did search, and I didn't find much in or outside of /r/carbonsteel, so I appreciate you bearing with me. I figured that some of the brilliant kitchen-inclined minds probably live in this subreddit.\n\nAfter I read about Kenji and Daniel's admiration for carbon steel, I figured I'd get a pan or two and give it a go — so I picked up a smaller Matfer and a larger de Buyer pan. In general I like them — no real concerns about sticking, thankfully — but any time I try to cook something like eggs the pan winds up turning them this kinda off-putting greyish color.\n\nIn between uses, I'll wipe out the pan, rub a little oil over it, stick it over medium-high heat until smoking, and then put it away. (An aside: even after wiping out any visible oil and removing it from said heat, sometimes the sides still feel sticky).\n\nAny thoughts on why this happens? Why does my pan still feel sticky even after I've seemingly followed the appropriate care directions, and what's with this grey colored food thing — and most importantly, is what I'm experiencing a bug, or a feature? Where, o where, have I erred — if at all?",
        "created_utc": 1515641914,
        "upvote_ratio": ""
    },
    {
        "title": "I’m opening a restaurant with some friends. Here’s the menu! Hope to see you at Wursthall some time!",
        "author": "J_Kenji_Lopez-Alt",
        "url": "https://sf.eater.com/platform/amp/2018/1/10/16874790/wursthall-san-mateo-menu-kenji-lopez-alt-restaurant?__twitter_impression=true",
        "text": "",
        "created_utc": 1515638727,
        "upvote_ratio": ""
    },
    {
        "title": "Made the pressure cooker corn soup...delicious!",
        "author": "read_it_online25",
        "url": "https://i.redd.it/pxqpy8lyyb901.jpg",
        "text": "",
        "created_utc": 1515629635,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji’s Pozole Verde was perfect for the SoCal rain",
        "author": "mrs_LA",
        "url": "https://i.redd.it/8ngml4enc6901.jpg",
        "text": "",
        "created_utc": 1515561404,
        "upvote_ratio": ""
    },
    {
        "title": "First time making the pork salsa verde. Wow.",
        "author": "Grimnaw",
        "url": "https://i.redd.it/yg7hkewe76901.jpg",
        "text": "",
        "created_utc": 1515559641,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's black bean burger is the closest I've seen to a real burger",
        "author": "walrusnoob",
        "url": "https://i.redd.it/e988redtd5901.jpg",
        "text": "",
        "created_utc": 1515549693,
        "upvote_ratio": ""
    },
    {
        "title": "I need some (good) stovetop recipes.",
        "author": "VediusPollio",
        "url": "https://www.reddit.com/r/seriouseats/comments/7pbx24/i_need_some_good_stovetop_recipes/",
        "text": "I'm currently living in a temporary spot for work. I only have two burners and a microwave to cook with. I use the stove often, but I'm running short on ideas. \n\nI'd prefer recipes that aren't overly complex for now. I'm not picky. I like most food. Exotic is nice, but I need ingredients that are readily available at grocery stores. \n\nThanks in advance!",
        "created_utc": 1515546215,
        "upvote_ratio": ""
    },
    {
        "title": "I hear Halal Cart Chicken is popular around here",
        "author": "mattsulli",
        "url": "https://i.imgur.com/t7WElUa.jpg",
        "text": "",
        "created_utc": 1515545199,
        "upvote_ratio": ""
    },
    {
        "title": "Rainy day in Socal, so I a made Kenji's All American Beef Stew",
        "author": "dekonstruktr",
        "url": "https://imgur.com/6hLuHvf",
        "text": "",
        "created_utc": 1515541679,
        "upvote_ratio": ""
    },
    {
        "title": "Serious eats API or HTML parser?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7p98i0/serious_eats_api_or_html_parser/",
        "text": "[deleted]",
        "created_utc": 1515523733,
        "upvote_ratio": ""
    },
    {
        "title": "How do I preheat cast iron on an induction cooktop?",
        "author": "Portalboat",
        "url": "https://www.reddit.com/r/seriouseats/comments/7p7pns/how_do_i_preheat_cast_iron_on_an_induction_cooktop/",
        "text": "The title, basically.\n\nI know that cast iron doesn't heat up super fast, so I need to preheat it before I do anything with it. Usually I set it on the cooktop at 350 degrees, but it starts to smoke soon after, and I get nervous and turn it off.\n\nThen, of course, I get pretty distinct hot/cold spots on it. Even when I'm cooking pancakes.\n\nSo my question is, how exactly do I preheat cast iron when it's on an induction cooktop? What temperature do I do it at? Is it okay if the pan/oil starts smoking?\n\n",
        "created_utc": 1515511067,
        "upvote_ratio": ""
    },
    {
        "title": "Southern Fried Chicken",
        "author": "gdwright07",
        "url": "https://www.reddit.com/r/seriouseats/comments/7p74f3/southern_fried_chicken/",
        "text": "Hello there, made the Food Lab’s Southern Fried Chicken this past weekend. Came out great flavor wise, but texturally the breading ended up more, well more like breading...not the imperfect, crispy, crunchy crust that I would expect from a fried chicken. What can I try next time to improve texture, without double frying?\n\nOil temp was held consistently in high 300/low 400 range. Also folded in some buttermilk mixture before breading. Thanks.",
        "created_utc": 1515505025,
        "upvote_ratio": ""
    },
    {
        "title": "Question about American Cheese for Classic Baked Mac &amp; Cheese from Food Lab",
        "author": "4Eyed4Cast",
        "url": "https://www.reddit.com/r/seriouseats/comments/7p464v/question_about_american_cheese_for_classic_baked/",
        "text": "So I live in Canada and am having a tough time finding an equivalent for American cheese. I've seen people say Kraft Singles is fine (and I'm fine with Kraft singles too if that is actually the closest to American) but I've also seen people say it is a poor imitation of American cheese. And in all my googling I can't find anything that says definitively what I should be buying as a Canadian alternative. Would Velveeta work? \n\nHelp please!",
        "created_utc": 1515467201,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji always does a great job, but the Chicken Chili Verde is an amazing recipe!",
        "author": "Stickeris",
        "url": "https://i.redd.it/i1mlbkgxls801.jpg",
        "text": "",
        "created_utc": 1515395031,
        "upvote_ratio": ""
    },
    {
        "title": "Meatloaf from Kenji’s book. Delicious!",
        "author": "sraaschjr",
        "url": "https://i.redd.it/ns7rx22ywq801.jpg",
        "text": "",
        "created_utc": 1515374518,
        "upvote_ratio": ""
    },
    {
        "title": "Bravetart Chopped Chocolate Chip Cookies = Chewy and Awesome!",
        "author": "radiant_avocado",
        "url": "https://www.reddit.com/r/seriouseats/comments/7oqwz2/bravetart_chopped_chocolate_chip_cookies_chewy/",
        "text": "I made the main chocolate chip cookie recipe yesterday using a mix of white, semisweet, and dark chocolate--they turned out wonderfully! The texture was the perfect level of chewy, and the hint of salt is really nice.  I'm particularly pleased since I'd nearly given up on chocolate chip cookies after a number of underwhelming attempts at matching my sister-in-law's cookies! I did halve the nutmeg since my husband is weird and doesn't like nutmeg, but he didn't seem to notice the the trace amount left.\n\nAlso, the Red (Wine) Velvet Cake recipe from the book is a real winner too, and it's available online at The Splendid Table (https://www.splendidtable.org/recipes/red-wine-velvet-cake), though I would recommend adding a little more lemon juice to the cream cheese frosting to give it a little more zing.",
        "created_utc": 1515336384,
        "upvote_ratio": ""
    },
    {
        "title": "I made Stella Parks' Overnight Brown-Butter Yeast-Raised waffles and they were fantastic",
        "author": "torisaurus_regina",
        "url": "https://www.reddit.com/r/seriouseats/comments/7oqtrx/i_made_stella_parks_overnight_brownbutter/",
        "text": "So light and fluffy inside, crisp outside. It was also glorious to be able to just wake up and plug in the waffle maker to get going. I may never go back to my old waffle recipe.\n\n[link to recipe](http://www.seriouseats.com/recipes/2016/04/brown-butter-yeast-raised-waffles-recipe.html)",
        "created_utc": 1515335338,
        "upvote_ratio": ""
    },
    {
        "title": "Recreate Papaya King juice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7opiqe/recreate_papaya_king_juice/",
        "text": "[deleted]",
        "created_utc": 1515313393,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just my tastebuds or do a lot of the recipes in the SE cookbook have way too much salt in them?",
        "author": "tinyOnion",
        "url": "https://www.reddit.com/r/seriouseats/comments/7om445/is_it_just_my_tastebuds_or_do_a_lot_of_the/",
        "text": "[removed]",
        "created_utc": 1515274291,
        "upvote_ratio": ""
    },
    {
        "title": "Potato Hash with Peppers and Onions",
        "author": "bwbell",
        "url": "https://i.redd.it/jbqhthnwrh801.jpg",
        "text": "",
        "created_utc": 1515263864,
        "upvote_ratio": ""
    },
    {
        "title": "sous vide bag opened -- still edible?",
        "author": "synester302",
        "url": "https://www.reddit.com/r/seriouseats/comments/7okgzq/sous_vide_bag_opened_still_edible/",
        "text": "Hey folks, so I'm doing Kenji's 36 hours pork belly porchetta and my sous vide bag opened up mid cook. #1 whats the deal....this keeps happening. # 2 is there a way to save the pork porchettaor is she ruined? is it even safe?\n\n",
        "created_utc": 1515259034,
        "upvote_ratio": ""
    },
    {
        "title": "Authentic Chicken Tinga Recipe",
        "author": "magic9669",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ofcut/authentic_chicken_tinga_recipe/",
        "text": "Ok, so I have been searching for a REALLY good chicken tinga recipe.  I have tried many variations and they just don't seem to come out like I have had at some restaurants.  There is one restaurant in particular in the Philadelphia area (El Limon) that has some of the best tinga i've ever had.  \n\nI'll do some more research but figured i'd ask on here in the meantime as well. \n\nThanks all.",
        "created_utc": 1515195503,
        "upvote_ratio": ""
    },
    {
        "title": "Some questions about buying/roasting full chickens.",
        "author": "Portalboat",
        "url": "https://www.reddit.com/r/seriouseats/comments/7of3ev/some_questions_about_buyingroasting_full_chickens/",
        "text": "So I love the idea of just buying a full chicken, laying down some herbs and spices, putting in in the oven, and then having my next four meals already done and ready to go. And to top it all off, they're so friggin' cheap - a buck a pound at my grocery store. \n\nBut, there's a few problems that mean that I don't just buy them all the time.\n\nOne, the smoke. My cooking area unfortunately has very low ventilation - I sent off the smoke alarm twice last night when I was roasting it. I had parchment paper underneath it, but apparently that didn't help all that much. Is there anything more I could be doing to help reduce the smoke, or am I just flat out of luck there?\n\nTwo, the breasts. I don't think I'm overcooking them - my thermopop had the temperature at 150 as suggested, but I could be putting it in the wrong spot. Regardless, they always seem to come out as just dry and stringy and not appetizing at all. They're also friggin' huge, even when I cut them in half. What can I do with them?",
        "created_utc": 1515193172,
        "upvote_ratio": ""
    },
    {
        "title": "Resting and salting sous vide steak over night?",
        "author": "byungparkk",
        "url": "https://www.reddit.com/r/seriouseats/comments/7odd26/resting_and_salting_sous_vide_steak_over_night/",
        "text": "The Food Lab's guide to steak says that you should salt your steak far in advance of cooking it and let it rest at least over night uncovered in the fridge if you are cooking it more traditional ways, but the SV guide to steak is less clear about this. In fact, the guide seems to suggest no resting over night or salting before bagging is required. \n\nDoes anyone have a clear answer for me? Should I buy my steak tonight to salt and rest uncovered?",
        "created_utc": 1515178585,
        "upvote_ratio": ""
    },
    {
        "title": "Made the mushroom risotto pressure cooker version",
        "author": "TAFKAMoistowelettes",
        "url": "https://i.redd.it/fn30jeobk6801.jpg",
        "text": "",
        "created_utc": 1515128136,
        "upvote_ratio": ""
    },
    {
        "title": "White powder coating my Guanciale?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7o7lbf/white_powder_coating_my_guanciale/",
        "text": "[deleted]",
        "created_utc": 1515115121,
        "upvote_ratio": ""
    },
    {
        "title": "One pan cacio e pepe?",
        "author": "GorramBatman",
        "url": "https://www.reddit.com/r/seriouseats/comments/7o7gln/one_pan_cacio_e_pepe/",
        "text": "I know in [Kenji's article](http://www.seriouseats.com/2016/02/spaghetti-cacio-e-pepe-roman-snack-pasta.html), he finds switching from one pan to two ups his Cacio e pepe game. But what is the best technique when you only want to use one pan?",
        "created_utc": 1515113821,
        "upvote_ratio": ""
    },
    {
        "title": "Super-flaky buttermilk biscuits with horseradish cheddar and scallions. Check out those layers. Stratigraphy!",
        "author": "Paprika420",
        "url": "https://i.redd.it/vfn54yo5o4801.jpg",
        "text": "",
        "created_utc": 1515105227,
        "upvote_ratio": ""
    },
    {
        "title": "Korean octopus tentacles",
        "author": "Saih-ttam",
        "url": "https://youtu.be/1dJqLdCoyKc",
        "text": "",
        "created_utc": 1515102470,
        "upvote_ratio": ""
    },
    {
        "title": "Blackstone Griddle Grease Trap Fix",
        "author": "Smoke_Trails",
        "url": "https://www.youtube.com/watch?v=m1pn531C1wk",
        "text": "",
        "created_utc": 1515098714,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone use Kenji’s Blue Label Burger blend for smash burgers?",
        "author": "riitzen",
        "url": "https://www.reddit.com/r/seriouseats/comments/7o5sya/anyone_use_kenjis_blue_label_burger_blend_for/",
        "text": "I’m going to start grinding my own beef and I’m curious if anyone has any experience with Kenji’s burger mix. \n\nhttp://www.seriouseats.com/recipes/2009/10/the-blue-label-burger-blend-recipe.html",
        "created_utc": 1515098194,
        "upvote_ratio": ""
    },
    {
        "title": "Non-dairy buttermilk substitute in Chicken and Dumplings?",
        "author": "dollarwhiskey",
        "url": "https://www.reddit.com/r/seriouseats/comments/7o53ab/nondairy_buttermilk_substitute_in_chicken_and/",
        "text": "Has anyone had any luck with substituting the buttermilk with a non-dairy alternative in the Chicken and Dumplings recipe?  \n\nI was considering trying a mixture of 1 tbsp white vinegar + 1 cup almond milk, but I am wondering if I would have better luck with a different ratio of those ingredients - or if I should be using a different acid/non-dairy milk combination. I also considered using something like a vegan yogurt, but I wasn't too sure if that would work either.  \n\nI would love any suggestions or advice anyone can give me, thanks!\n\nEdit: Just wanted to update and say that this substitution worked out fine, but the texture and taste were slightly different than they would have been if I had used buttermilk. I ended up whisking together 1 tbsp apple cider vinegar + 7.5 fl oz unsweetened almond milk and then measured out 3/4 cup to use in the dumpling recipe.",
        "created_utc": 1515091674,
        "upvote_ratio": ""
    },
    {
        "title": "Best Burgers Ever In The World? Mukbang!",
        "author": "AmateurChef33",
        "url": "https://youtu.be/QIHYLJd-hCE",
        "text": "",
        "created_utc": 1515086115,
        "upvote_ratio": ""
    },
    {
        "title": "Made Halal cart chicken and rice with white sauce for the first time, was pretty tasty",
        "author": "pkksmt",
        "url": "https://imgur.com/yjmrm65",
        "text": "",
        "created_utc": 1515081584,
        "upvote_ratio": ""
    },
    {
        "title": "Sticky buns from Kenji's book",
        "author": "liartellinglies",
        "url": "https://imgur.com/gallery/kBJvz/comment/1221522471",
        "text": "",
        "created_utc": 1515081164,
        "upvote_ratio": ""
    },
    {
        "title": "So I started adding cheese to all of my Chinese meals",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/China/comments/7nzi4e/so_i_started_adding_cheese_to_all_of_my_chinese/",
        "text": "[deleted]",
        "created_utc": 1515044106,
        "upvote_ratio": ""
    },
    {
        "title": "Stella's Pot Pie topped with buttermilk biscuits",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7o0jwu/stellas_pot_pie_topped_with_buttermilk_biscuits/",
        "text": "[deleted]",
        "created_utc": 1515040256,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to the debone a bird slideshow that accompanied the turducken recipe?",
        "author": "f5f5f5f5f5f5f5f5f5f5",
        "url": "https://www.reddit.com/r/seriouseats/comments/7nz5wj/what_happened_to_the_debone_a_bird_slideshow_that/",
        "text": "The turducken [recipe](http://www.seriouseats.com/recipes/2012/11/the-ultimate-turducken-recipe.html) had a slideshow for deboning birds as recently as Thanksgiving. There were three links to the same page, one in the first paragraph, and two after the chicken and duck. All of these links now go to a slideshow for assembling the turducken.",
        "created_utc": 1515026335,
        "upvote_ratio": ""
    },
    {
        "title": "Brandied Cherries Pan Sauce",
        "author": "bwbell",
        "url": "https://www.reddit.com/r/seriouseats/comments/7nwm40/brandied_cherries_pan_sauce/",
        "text": "I really want to make the Pork Chops with Brandied Cherries recipe in \"The Food Lab\"; however, I am nervous about the brandy igniting. (My microwave is installed right over my burners). Has anyone who has made this recipe experienced this problem before?",
        "created_utc": 1515004543,
        "upvote_ratio": ""
    },
    {
        "title": "When u conquer the world with your first poached egg",
        "author": "prettytheft",
        "url": "https://i.redd.it/h84txrl1jv701.jpg",
        "text": "",
        "created_utc": 1514994530,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have recipes for ube, the purple root veggie that's sweeping Instagram?",
        "author": "BraveNewEats",
        "url": "https://i.redd.it/2ld5a4378p701.jpg",
        "text": "",
        "created_utc": 1514918753,
        "upvote_ratio": ""
    },
    {
        "title": "Where to buy pork belly with rind?",
        "author": "synester302",
        "url": "https://www.reddit.com/r/seriouseats/comments/7nn47p/where_to_buy_pork_belly_with_rind/",
        "text": "Trying to make the sous vide/deep-fried pork belly porchetta, but I'm having a hard time finding a pork belly that comes with the rind on it.  Anyone have any ideas? Any out of the box ideas on where to go?  ",
        "created_utc": 1514907442,
        "upvote_ratio": ""
    },
    {
        "title": "Pork Crackling - science behind it.",
        "author": "ChicagoMercantile",
        "url": "https://www.reddit.com/r/seriouseats/comments/7nl90x/pork_crackling_science_behind_it/",
        "text": "I have been attempting to make the best pork belly crackling, and while the results have been good, its not up to standard as of yet. \n\nAnyone is able to share as to any tricks/tips/science behind allowing me to create a really crispy and gorgeous crackling? \n\nMuch Appreciated!",
        "created_utc": 1514882414,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's sticky buns",
        "author": "davegravy",
        "url": "https://i.redd.it/oj9z43g08l701.jpg",
        "text": "",
        "created_utc": 1514869761,
        "upvote_ratio": ""
    },
    {
        "title": "Cassoulet, with duck confit.",
        "author": "Beatnicht",
        "url": "https://imgur.com/gallery/nQrGs",
        "text": "",
        "created_utc": 1514853935,
        "upvote_ratio": ""
    },
    {
        "title": "Cantonese Sweet and Sour Stir Fry with Tofu and Vegetables",
        "author": "[deleted]",
        "url": "http://mycookingjourney.com/cantonese-sweet-and-sour-stir-fry-wi/",
        "text": "[deleted]",
        "created_utc": 1514837077,
        "upvote_ratio": ""
    },
    {
        "title": "A question about gelatin breakdown in poultry stock simmered past 4 hours.",
        "author": "vyme",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ng23f/a_question_about_gelatin_breakdown_in_poultry/",
        "text": "In *The Food Lab*, Kenji writes:\n\n&gt; At a 190F to 200F simmer, it takes about 3 hours for 90 percent of the connective tissue to convert to gelatin, and then about an hour more for all of it to convert. Continue cooking past that point, however, and the gelatin itself starts breaking down, losing its thickening power. So the ideal chicken stock should be simmered for around 4 hours. \n\nI've made some long-simmered, super gelatinous poultry stocks. I'm talking 8+ hours. I'd like to figure out what's going on, and how to replicate it. Can dropping it to a lower temperature after the initial 4 hours prevent the gelatin from breaking down? Essentially just continuing to steep the bones without cooking it further? If I hold it at a lower temperature, is there still a point at which the gelatin will break down?",
        "created_utc": 1514825375,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's Pressure Cooker Pho Ga was delicious",
        "author": "TeddlyA",
        "url": "https://i.imgur.com/VPCXAwu.jpg",
        "text": "",
        "created_utc": 1514763733,
        "upvote_ratio": ""
    },
    {
        "title": "Deep Fried Sous Vide Porchetta",
        "author": "davegravy",
        "url": "https://i.redd.it/n3nglffeya701.jpg",
        "text": "",
        "created_utc": 1514745451,
        "upvote_ratio": ""
    },
    {
        "title": "First steak with my new sous vide cooker",
        "author": "nancam9",
        "url": "https://imgur.com/raUBlRM",
        "text": "",
        "created_utc": 1514740377,
        "upvote_ratio": ""
    },
    {
        "title": "Keep the shakahuka marathon going! This time with a little Italian flair",
        "author": "Hussaf",
        "url": "https://i.redd.it/4atsanux4a701.jpg",
        "text": "",
        "created_utc": 1514735540,
        "upvote_ratio": ""
    },
    {
        "title": "Pork Chop w/ cherry pan sauce from The Food Lab book",
        "author": "jackherer",
        "url": "https://i.redd.it/n7pekrcd99701.jpg",
        "text": "",
        "created_utc": 1514724927,
        "upvote_ratio": ""
    },
    {
        "title": "Cooking time on a coulotte/top sirloin cap roast using reverse sear?",
        "author": "drolgin",
        "url": "https://www.reddit.com/r/seriouseats/comments/7n5afi/cooking_time_on_a_coulottetop_sirloin_cap_roast/",
        "text": "Anyone have a suggested temp + cook time for 1.7 kg coulotte roast? All the instructions I have seen for reverse sear just state a target temp, and I need to be able to time things somewhat to make it work with the rest of the meal. Unfortunately I'm unable to do a test run.",
        "created_utc": 1514680337,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji’s Foolproof Pan Pizza! Unbelievably easy and tasty",
        "author": "josmilpinto",
        "url": "https://i.redd.it/2ibmakysn4701.jpg",
        "text": "",
        "created_utc": 1514669266,
        "upvote_ratio": ""
    },
    {
        "title": "The imitation Chik-fil-a sandwich! Goes great with the ooey gooey mac n cheese. Kenji! 🙏",
        "author": "Paprika420",
        "url": "https://i.redd.it/mp5mkjy5w1701.jpg",
        "text": "",
        "created_utc": 1514635737,
        "upvote_ratio": ""
    },
    {
        "title": "Made the homemade Egg McMuffin. Life changing. I didn't have a Mason jar lid so used a salsa jar lid.",
        "author": "Clobbersaurus7",
        "url": "https://i.redd.it/kgauxl8moz601.jpg",
        "text": "",
        "created_utc": 1514608984,
        "upvote_ratio": ""
    },
    {
        "title": "Problem with Speculoos ice cream",
        "author": "SangDePoulpe",
        "url": "https://www.reddit.com/r/seriouseats/comments/7myolf/problem_with_speculoos_ice_cream/",
        "text": "I was recently gifted and ice cream accessory for my kitchen robot. I am lucky to live in Belgium where speculoos biscuits are readily available so I seized the opportunity to make speculoos ice cream following [this recipe](http://www.seriouseats.com/recipes/2017/06/biscoff-ice-cream-recipe.html) as a dessert for New Year's eve. It can be made in advance so it is less hassle on D day. \n\nAnd there is a bit of an issue I am facing. The thing is so delicious, I find it really difficult to resist eating it all.\n\n\nIt turned out amazingly well and I would recommend everyone to try it if they can. Just make sure you have the strength of will to wait for the right time to devour it.\n\nAlso I was thinking of adding chocolate, or a crumble or something on top when serving but I think just a speculoos biscuit is enough. The ice cream is very rich with flavours and doesn't need anything added. Unless you have a different experience which I am willing to read and try.\n\nSo did any of you tried to make it? Any suggestions on toppings?\n\nAny suggestions on other recipes for ice cream machines? ",
        "created_utc": 1514598051,
        "upvote_ratio": ""
    },
    {
        "title": "Duck breast, spinach, couscous, sweet potato puree.",
        "author": "Beatnicht",
        "url": "https://imgur.com/gallery/P4aGS",
        "text": "",
        "created_utc": 1514597523,
        "upvote_ratio": ""
    },
    {
        "title": "15 Minute Tomato Soup - Fire Roasted Tomato?",
        "author": "bdastunty",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mvtcq/15_minute_tomato_soup_fire_roasted_tomato/",
        "text": "How do you think fire roasted tomatoes would work out in the 15 minute tomato soup [recipe](http://www.seriouseats.com/2012/02/15-minute-creamy-tomato-soup-vegan.html)?\n",
        "created_utc": 1514569961,
        "upvote_ratio": ""
    },
    {
        "title": "Sausage Egg Muffin",
        "author": "cgeezy93",
        "url": "https://www.youtube.com/watch?v=u4UIL_xexJE",
        "text": "",
        "created_utc": 1514511970,
        "upvote_ratio": ""
    },
    {
        "title": "Bolognese Sauce",
        "author": "Bjorn121_",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mp350/bolognese_sauce/",
        "text": "A few months ago I saw an adaptation of Kenji's video on /r/GifRecipes and decided to save it, because it looked quite intriguing.  Nearly everyone cried outrage, because you had to add milk and cream to a ragu sauce, but that diminished quite quickly when people actually prepared and ate it.\n\nYesterday I finally had the time to prepare it and I must admit that it this is probably the best ragu sauce I ever tasted.  The downside is that I'm not sure I want to go back to my old recipe, as it doesn't taste as good.  It takes considerably less time to prepare, so I'll have to find a balance between time and taste :).\n\nOne thing I find strange is adding gelatine to the stock and then adding it to the sauce.  I always thought that gelatine loses it's \"power\" when it's boiled again.  If that's necessary, I always thought you had to use [Agar](https://en.wikipedia.org/wiki/Agar).\n\nAnyway, I'm going to check the other recipes to see what the next one is going to be.  Keep up the good work!",
        "created_utc": 1514492055,
        "upvote_ratio": ""
    },
    {
        "title": "Halal cart rice color more yellow than orange",
        "author": "Makan_Lagi",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mkp8f/halal_cart_rice_color_more_yellow_than_orange/",
        "text": "The Halal Cart rice I usually get is more orange but Kenji’s recipe is more yellow from the turmeric. Is there any other seasoning that would make the rice into that deep orange? Is it a different type of turmeric? Maybe some annatto?  ",
        "created_utc": 1514439392,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Penne alla Vodka w/ chicken from The Food Lab book",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mkmz8/help_with_penne_alla_vodka_w_chicken_from_the/",
        "text": "[deleted]",
        "created_utc": 1514438621,
        "upvote_ratio": ""
    },
    {
        "title": "Made Kenji's super easy Spanish Chickpea and Spinach Stew",
        "author": "ctf9",
        "url": "https://i.redd.it/6rprxi9huk601.jpg",
        "text": "",
        "created_utc": 1514429386,
        "upvote_ratio": ""
    },
    {
        "title": "The Food Lab recipe list",
        "author": "iLorax",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mjtge/the_food_lab_recipe_list/",
        "text": "I’m looking to get a list of the recipes (just the titles) in The Food Lab. I’m going to start cooking my way through it but would like to start a spreadsheet without having to type up them all. Anyone have one already made? ",
        "created_utc": 1514429251,
        "upvote_ratio": ""
    },
    {
        "title": "Feliz Navidad! Spanish Iberico Pork Chop for my Christmas Feast this year.",
        "author": "buttoxide",
        "url": "https://i.redd.it/5heotu0pui601.jpg",
        "text": "",
        "created_utc": 1514405216,
        "upvote_ratio": ""
    },
    {
        "title": "How much money has discovering Serious Eats, and this subreddit, cost you?",
        "author": "SAVertigo",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mf7m7/how_much_money_has_discovering_serious_eats_and/",
        "text": "I actually discovered this subreddit from a cross post at /r/cooking and /r/pizza awhile back. Went to the website tried a few recipes and was hooked. \n\nThat being said, discovering this stuff has been a blessing on my palate, and a curse on our wallets. \n\nOn the large end of things , Kenji’s pizza oven review got me to invest in a Roccbox. Worth every penny thus far. \n\nThen on Black Friday , Anova and all its companions(Rubbermaid container, Sous vide lid, vacuum sealer) came home. \n\nUnder the tree this year were tons of Serious Eats recommended gifts (cookbooks, knives, new salad spinner). \n\nAnd don’t even get me started on how many condiments and weird ingredients are now all over my kitchen!\n\n\nIn all seriousness this, I love Serious Eats and this community, but it’s been taking its toll! \n\n",
        "created_utc": 1514383843,
        "upvote_ratio": ""
    },
    {
        "title": "BEEF SAUSAGE WITH CHEESE",
        "author": "[deleted]",
        "url": "https://youtu.be/yumP-tniylA",
        "text": "[deleted]",
        "created_utc": 1514378005,
        "upvote_ratio": ""
    },
    {
        "title": "Uses of a cast iron pot?",
        "author": "tanenbaum",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mdxv6/uses_of_a_cast_iron_pot/",
        "text": "I wished for a cast iron frying pan for christmas, but got a cast iron pot instead. I know that the frying pan has all kinds of great uses, but for what kind of dishes does a cast iron pot shine compared to a regular ol' pot? ",
        "created_utc": 1514364901,
        "upvote_ratio": ""
    },
    {
        "title": "The aftermath of Kenji’s Sicilian Pizza. Good lord, it’s good.",
        "author": "munklunk",
        "url": "https://i.redd.it/da7di5pjge601.jpg",
        "text": "",
        "created_utc": 1514352029,
        "upvote_ratio": ""
    },
    {
        "title": "Impossible pecan pie",
        "author": "[deleted]",
        "url": "https://www.imgur.com/a/OQBx3",
        "text": "[deleted]",
        "created_utc": 1514348263,
        "upvote_ratio": ""
    },
    {
        "title": "Made Kenji's gooey apple pie!",
        "author": "_PrincessLuna_",
        "url": "https://imgur.com/a/HDdr3",
        "text": "",
        "created_utc": 1514346849,
        "upvote_ratio": ""
    },
    {
        "title": "The Nerd King of Home Cooking Sets His Eye on the Restaurant World",
        "author": "GraphicNovelty",
        "url": "http://www.grubstreet.com/2017/12/j-kenji-lopez-alt-wursthall-opening.html",
        "text": "",
        "created_utc": 1514342088,
        "upvote_ratio": ""
    },
    {
        "title": "Prime Rib Question(s)",
        "author": "Longsaddle",
        "url": "https://www.reddit.com/r/seriouseats/comments/7mblfz/prime_rib_questions/",
        "text": "Hey there guys just a quick question about the prime rib recipe here:\n\nhttp://www.seriouseats.com/recipes/2009/12/perfect-prime-rib-beef-recipe.html\n\nI have a 6.1lbs rib roast that I want to make on the 29th but i'm not sure how long it should take to actually cook I have dinner guests so I don't want to to not be ready or be cooking for 2 hours extra.\n\nThanks for clarifying for me",
        "created_utc": 1514335148,
        "upvote_ratio": ""
    },
    {
        "title": "My turn! Halal Cart Chicken. We’ve never had the real thing, but the fam was practically licking their plates.",
        "author": "merlegerle",
        "url": "https://i.redd.it/x4k8202mdc601.jpg",
        "text": "",
        "created_utc": 1514326852,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji Dreams of Sausage",
        "author": "Ohthisisjustdandy",
        "url": "https://www.grubstreet.com",
        "text": "",
        "created_utc": 1514322658,
        "upvote_ratio": ""
    },
    {
        "title": "I made Kenji's Beef Wellington. While wearing a tuxedo.",
        "author": "potkin",
        "url": "https://imgur.com/a/tNZPe",
        "text": "",
        "created_utc": 1514314186,
        "upvote_ratio": ""
    },
    {
        "title": "I made Turkey Porchetta for Christmas dinner",
        "author": "nancam9",
        "url": "https://imgur.com/a/dpPT8",
        "text": "",
        "created_utc": 1514300055,
        "upvote_ratio": ""
    },
    {
        "title": "We had Bravetart's cinnamon rolls on Christmas morning.",
        "author": "a-la-brasa",
        "url": "https://imgur.com/ADAJ0ws",
        "text": "",
        "created_utc": 1514291590,
        "upvote_ratio": ""
    },
    {
        "title": "Pork leg joint: rare to medium rare?",
        "author": "Antihawk34",
        "url": "https://www.reddit.com/r/seriouseats/comments/7m7cw0/pork_leg_joint_rare_to_medium_rare/",
        "text": "Hi, fellow serious eaters.\n\nI have a pork leg joint from the hind leg. It's the raw cut of pork that's usually made into hams.\n\nSince it's very lean, I'm thinking of reverse-searing it to 130F or medium-rare. There's a lot of recipes that call for it to be slow-cooked, however. My concern with this -- the same with brisket -- is that it's relatively lean, and over the long-cooking time, might become dry.\n\nHas anyone tried this rare to medium rare? Or is it a better option to braise/slow-roast it?",
        "created_utc": 1514288679,
        "upvote_ratio": ""
    },
    {
        "title": "All hail the reverse sear: Christmas dinner tenderloin. Kenji’s recipe is so on point.",
        "author": "mookiemookie",
        "url": "https://i.redd.it/k3wzpy4tu6601.jpg",
        "text": "",
        "created_utc": 1514260073,
        "upvote_ratio": ""
    },
    {
        "title": "Sous vide Christmas rib roast",
        "author": "Nordbergh",
        "url": "https://imgur.com/a/GF9SB",
        "text": "",
        "created_utc": 1514258285,
        "upvote_ratio": ""
    },
    {
        "title": "Best Christmas Present Ever",
        "author": "fakerfakefakerson",
        "url": "http://imgur.com/y55qq8d",
        "text": "",
        "created_utc": 1514254730,
        "upvote_ratio": ""
    },
    {
        "title": "Tried out the Hasselback Potato Gratin for Christmas dinner.",
        "author": "pangelboy",
        "url": "https://imgur.com/gallery/fHF3t",
        "text": "",
        "created_utc": 1514253493,
        "upvote_ratio": ""
    }
]