[
    {
        "title": "Bury a Fruitcake??",
        "author": "gelekjeu",
        "url": "https://www.reddit.com/r/seriouseats/comments/7m3is1/bury_a_fruitcake/",
        "text": "My great grandmother (Swedish, no longer alive), apparently buried fruitcakes in the ground and aged them for a period of time. I’ve been searching online, trying to find any mention of this “bury” method and can’t find anything... does anyone do this? My mom is hell bent on burying a fruitcake and we’re trying to determine the best way to do it. Any insight would be greatly appreciated!! Merry Christmas!!!! 🔔🎄🎅🏻❄️",
        "created_utc": 1514235303,
        "upvote_ratio": ""
    },
    {
        "title": "Sticky Buns for Christmas morning breakfast!",
        "author": "dukiduke",
        "url": "https://m.imgur.com/gallery/7CKAX",
        "text": "",
        "created_utc": 1514233763,
        "upvote_ratio": ""
    },
    {
        "title": "Handheld Blenders Braun MQ735 ($89) or Breville Control Grip ($75)",
        "author": "hoboman27",
        "url": "https://www.reddit.com/r/seriouseats/comments/7m2tuj/handheld_blenders_braun_mq735_89_or_breville/",
        "text": "Hi I'm trying to settle on one of these immersion blenders. While I can find the Breville on certain top blender lists on the internet, I can't get much information on the Braun, though they seem to be recommended anyways. Hope you guys with experience with either one can help. The two are only $15 apart, and I'm trying to keep my budget under $100. \n  \nThanks\n  \n[Breville](https://www.amazon.ca/Breville-BSB510XL-BREBSB510XL-Immersion-Blender/dp/B004RF7QJW?pd_rd_wg=deM1M&amp;pd_rd_r=4eb78043-7e9e-4be8-931e-80c332e9c256&amp;pd_rd_w=7DNNB&amp;ref_=pd_gw_simh&amp;pf_rd_r=1P8SCVP6F9AKQDXBFS9W&amp;pf_rd_p=f52db510-19a3-5a54-add4-62c82ff200de)\n  \n[Braun](https://www.amazon.ca/Braun-MQ735-MultiQuick-Blender-Black/dp/B01FUGGBVA?pd_rd_wg=deM1M&amp;pd_rd_r=4eb78043-7e9e-4be8-931e-80c332e9c256&amp;pd_rd_w=7DNNB&amp;ref_=pd_gw_simh&amp;pf_rd_r=1P8SCVP6F9AKQDXBFS9W&amp;pf_rd_p=f52db510-19a3-5a54-add4-62c82ff200de)",
        "created_utc": 1514227214,
        "upvote_ratio": ""
    },
    {
        "title": "No more beer-cooler sous vide for me! I hope your Holidaze are full of good food!",
        "author": "merlegerle",
        "url": "https://i.redd.it/3h5o5bsot2601.jpg",
        "text": "",
        "created_utc": 1514211210,
        "upvote_ratio": ""
    },
    {
        "title": "10lb bone in prime rib - what to pull?",
        "author": "Vangohhh",
        "url": "https://www.reddit.com/r/seriouseats/comments/7m0u3b/10lb_bone_in_prime_rib_what_to_pull/",
        "text": "When to pull ***\n\nI'm looking to roast at 200F expecting it to take 5-6 hours. I'm wondering what temp I need to pull it at to get to med rare? Should I stick to 120 as mentioned in the article or pull lower at like 115 since it's a larger roast? Should my target temp be 130?\n\nAny advice would be appreciated! Especially if you've done a 10lb roast before, interested to hear how long it took to come to temp.\n\nI've seen some conflicting advice and I really don't want to mess this up!\n\nThanks! Merry Christmas and happy holidays :)",
        "created_utc": 1514198705,
        "upvote_ratio": ""
    },
    {
        "title": "I made Kenji's sous vide brisket recipe for Christmas Eve dinner and my family raved that it was the best meat they had ever eaten.",
        "author": "GrumpyHour",
        "url": "https://i.imgur.com/xlKo5R4.jpg",
        "text": "",
        "created_utc": 1514166560,
        "upvote_ratio": ""
    },
    {
        "title": "Substitution for cornstarch?",
        "author": "RudimentsOfGruel",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lwour/substitution_for_cornstarch/",
        "text": "Having salivated over (and attempted) many recipes in The Food Lab, I’m trying to come up with a substitution for cornstarch that is called for a lot, especially in some delicious fried food.  We tend to avoid it in my house, especially in processed foods, so don’t want to be adding it to a “healthier” homecooked meals.  Hell, we didn’t really keep sugar or even AP flour in the house until recently, but as we’ve expanded our cooking &amp; baking attempts, we’ve come to find good uses for those in moderation.  Cornstarch, on the other hand, is a pretty empty calorie that adds virtually zero nutrition, so we’re looking for something else that would have the same chemical properties for use in, say, the breaded chicken parm or crispy oven-baked fries.  \n\nHas anyone tried something like guar gum in those recipes?  Any suggestions from  /u/J_Kenji_Lopez-Alt? Just trying to avoid the wife’s wrath of having cornstarch in the house is worth this extra effort...  ",
        "created_utc": 1514140625,
        "upvote_ratio": ""
    },
    {
        "title": "Help! My pork shoulder has no skin!",
        "author": "No_Im_Chomsky",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lw3up/help_my_pork_shoulder_has_no_skin/",
        "text": "TL;DR Looking for advice on adjusting Kenji's pork shoulder recipe!\n\nI was planning on cooking the Ultra-Crispy Slow Roasted Pork Shoulder recipe tomorrow, which entails a long ~8hr roast at 250 followed by a quick burst of heat at 500 to crisp the skin. But when I bought my shoulder I failed to notice it has no skin! My shoulder is a 7lb Boston butt.\n\nAny advice on adjusting Kenji's recipe? I am planning on doing the same low and slow roast, but then wasn't sure if I should do anything after like the final skin-crisping step. I'd love to have some sort of crispy exterior, but not sure how (or if) I can achieve that.\n\nThanks and happy holidays!",
        "created_utc": 1514134455,
        "upvote_ratio": ""
    },
    {
        "title": "Help combining recipes for a pork crown roast.",
        "author": "Reddit_Informed",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lsp7j/help_combining_recipes_for_a_pork_crown_roast/",
        "text": "Can anyone ELI5 how I can get the flavor profile of this recipe \n\nhttps://www.bonappetit.com/recipe/crown-roast-of-pork-with-lady-apples-and-shallots\n\nWith the cooking method of this recipe \n\nhttp://www.seriouseats.com/recipes/2011/12/crown-roast-of-pork-recipe.html\n",
        "created_utc": 1514082439,
        "upvote_ratio": ""
    },
    {
        "title": "Advice for finding a lid for a canning jar...",
        "author": "jweaving",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lrf53/advice_for_finding_a_lid_for_a_canning_jar/",
        "text": "I have an old wide mouth canning jar of my grandma's, but there is no lid.\n\nI have looked on Amazon and I can't seem to find a perfect fit, so I'm wondering if anyone can point me in the right direction...\n\nIf I'm measuring it correctly, the opening of the lid seems to be 4 5/8\" (not sure what size the lid would have to be).\n\nIf I can't find a lid, does anyone have any ideas of what I can do without the lid?\n\nI'm looking to mainly pickle (especially dill pickles), try making sauerkraut, and possibly make kimchi.\n\nAny advice is greatly appreciated!!\n\nHappy Holidays!",
        "created_utc": 1514067312,
        "upvote_ratio": ""
    },
    {
        "title": "Mac&amp;Cheese first time",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ljw1n/maccheese_first_time/",
        "text": "[deleted]",
        "created_utc": 1513973104,
        "upvote_ratio": ""
    },
    {
        "title": "Question - Hasselback Gratin potatoes",
        "author": "thug_kitten",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ljdep/question_hasselback_gratin_potatoes/",
        "text": "Has anyone made the Hasselback potatoes a day in advance? Someone  on seriouseats.com said they made them like this:\n\n\n1. Prepare dish all the way through the 30/30 baking step.\n\n2. Remove from oven and let sit until room temperature.\n\n3. Cover dish in foil and refrigerate.\n\n4. On the day off serving, sprinkle remaining cheese on top and reheat in a 400 degree oven.\n\nOnly have one oven and looking to make the green bean casserole and a turkey as well.\n\nAny tips or insight would be greatly appreciated.  ",
        "created_utc": 1513968256,
        "upvote_ratio": ""
    },
    {
        "title": "Can you make browning sauce from honey?",
        "author": "Peridotcat",
        "url": "https://www.reddit.com/r/seriouseats/comments/7liqjt/can_you_make_browning_sauce_from_honey/",
        "text": "Hi everyone, I am planning to do a homemade natural cola syrup. I am wondering instead of the Kitchen Bouquet, or brown sugar as some recipes said, can I use honey (or any other type of sugar) to make it? What makes a good brown sauce? Is it just for the colour? How much impact would it make on the flavour? Thanks.",
        "created_utc": 1513962569,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding British sugars for Stella's Biscoff biscuit recipe.",
        "author": "ShrutiandSpice",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lhtra/question_regarding_british_sugars_for_stellas/",
        "text": "Have any Brits tried Stella's Biscoff biscuit recipe? There is emphasis on Belgian brown sugar but I think British sugar is also different to American brown sugar...? I am considering making them but not sure if I need to go and get candi sugar or if soft brown sugar would suffice. If so would it be light or dark? \n\n\nEdit: So I was mistaken to think that British brown sugar is different to American. It seems as though the brown sugar is unrefined cane sugar. I'm going to see if I can track down the candi sugar or even sucre vergeoise which seems to be the sugar used in Belgian patisserie.\n\nThanks guys.",
        "created_utc": 1513953833,
        "upvote_ratio": ""
    },
    {
        "title": "Can you cook Kenji's roasted cauliflower recipe at a lower temperature?",
        "author": "RecursiveParadox",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lgoj6/can_you_cook_kenjis_roasted_cauliflower_recipe_at/",
        "text": "He says 260c, but my oven only goes to 220c. It is, however, a convection oven so that might help. I'm somewhat concerned that if I add time to the recipe I'll wind up just burning the cauliflower instead of carmelizing it. Recipe in question is [here](http://www.seriouseats.com/recipes/2013/12/roasted-cauliflower-pine-nut-raisin-caper-food-lab-recipe.html).",
        "created_utc": 1513938953,
        "upvote_ratio": ""
    },
    {
        "title": "Hybrid beef wellington/filet rossini?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ldi8p/hybrid_beef_wellingtonfilet_rossini/",
        "text": "[deleted]",
        "created_utc": 1513900105,
        "upvote_ratio": ""
    },
    {
        "title": "Quick Prime Rib question",
        "author": "xtrmbikin",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ld3k2/quick_prime_rib_question/",
        "text": "Has anyone ever tried roasting a prime rib in a Nesco electric roaster? I do the reverse sear method for cooking my prime rib but wanted to see if I could utilize my electric roaster to keep my oven freed up. I don't want to ruin my rib but think it should work as temp can be kept low. \n\nThe plus to me is I won't have to keep opening the oven as I juggle cooking other food. I don't have the ability to cook the rib via a grill or smoker.\n\nIf anyone has tried it please let me know how it turned out. Looking around online I don't see much info or actual results \n",
        "created_utc": 1513896218,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Slow Cooked Red Sauce/Sunday Gravy Advice",
        "author": "cjf4",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lck8n/seeking_slow_cooked_red_saucesunday_gravy_advice/",
        "text": "I'm visiting in laws for Christmas this weekend, and decided to make a big pot of [the good stuff](http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html) for Sunday, albeit with some modifications, and am looking for some advice (mostly on timing).\n\nNow considering it takes 6 hours, and we have to drive all day Saturday, I'm wondering if I can make it ahead of time. Always heard that these sauces taste better as leftovers. The recipe says that the sauce keeps for up to a week, but here's the big twist.\n\nI'm adding a bunch of meat. I have a rack of baby back ribs, a couple of short ribs, and a package of hot Italian sausage I plan on braising in it (I'm also going to pick up some meatballs from a good butcher but plan on adding those at the end). Also, I'm planning on removing all the meat and serving it separately so that people that don't want to eat a bunch of meat have that option.\n\nSo my questions are:  \n-Say I were to make the sauce with the meat tonight or tomorrow, and pull the meat out, to reheat Sunday. Will the meat get gross by than? It'd basically have to sit in the fridge in a ziploc bag, and than I think I'd throw back in on Sunday  to reheat it.\n\n-The meats all take a little bit different times to braise. Should I take them out after they are \"done\" to avoid overcooking, or does it not really matter?\n\n-Any temperature risk transporting the sauce in a pot in the car all day Saturday? We're looking at about a 6 hour drive in the Northeast.\n\n-Am I overthinking all of this and should just make it all Sunday Morning?\n\nAppreciate any input.",
        "created_utc": 1513891342,
        "upvote_ratio": ""
    },
    {
        "title": "Adapting prime rib roast recipe to top sirloin roast",
        "author": "burz",
        "url": "https://www.reddit.com/r/seriouseats/comments/7lchdo/adapting_prime_rib_roast_recipe_to_top_sirloin/",
        "text": "Trying to figure how to roast the top sirloin I bought (5,5 lb) for the holidays.\n\n1. Will the reverse sear technique works \nfor this cut?\nhttp://www.seriouseats.com/recipes/2009/12/perfect-prime-rib-beef-recipe.html\n2. How much time do I need to cook 5,5 lb at 250 F?\n\nThanks!\n",
        "created_utc": 1513890669,
        "upvote_ratio": ""
    },
    {
        "title": "InstantPot version of Kenji’s Beef Stew - best recipe yet!",
        "author": "jackherer",
        "url": "https://i.redd.it/qys15o1x5b501.jpg",
        "text": "",
        "created_utc": 1513876283,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone made the all-belly porchetta? Any tips? Also, what does “rind-on” mean?",
        "author": "BigGulpsHuh25",
        "url": "https://www.reddit.com/r/seriouseats/comments/7laao8/has_anyone_made_the_allbelly_porchetta_any_tips/",
        "text": "Looking to make the all-belly porchetta next week, but I’ve never once cooked with pork belly. Any advice? Also, Kenji calls for a “whole, boneless, rind-on belly with the rib meat still attached.” Are rind and skin synonymous?",
        "created_utc": 1513871674,
        "upvote_ratio": ""
    },
    {
        "title": "BraveTart's Cinnamon Rolls (Christmas morning test run!)",
        "author": "ctf9",
        "url": "https://www.reddit.com/r/seriouseats/comments/7l9u2k/bravetarts_cinnamon_rolls_christmas_morning_test/",
        "text": "Made these yesterday -- my first time making any kind of cinnamon roll: https://imgur.com/a/6oDEd\n\nRecipe here: www.seriouseats.com/2017/12/how-to-make-homemade-cinnamon-rolls.html\n\nThey turned out really well, I thought -- great flavor, not cloyingly sweet, and an impressive texture given the quick method. Assembled them last night, and it was less than an hour from when I woke up today to when we were eating. The second batch will be a big hit on Christmas morning, and I urge anyone looking for a holiday option to consider this recipe. \n\n(They did bake a bit faster for me than the recipe, so maybe check under the foil after 35 min?)",
        "created_utc": 1513867168,
        "upvote_ratio": ""
    },
    {
        "title": "Could this be done with sous vide for incredibly simple control? (more in comments)",
        "author": "AngelFMS",
        "url": "http://www.seriouseats.com/2015/02/how-to-make-dulce-de-leche-canned-condensed-milk.html#comments-25521",
        "text": "",
        "created_utc": 1513862923,
        "upvote_ratio": ""
    },
    {
        "title": "Budget Beef Christmas roast dilemma (UK)",
        "author": "phild420",
        "url": "https://www.reddit.com/r/seriouseats/comments/7l4ddo/budget_beef_christmas_roast_dilemma_uk/",
        "text": "Ive been tasked with doing a beef roast for christmas to complement the main event which is roast chicken. It would largely be just for me my girlfriend and her grandparents. The only trouble is her grandparents wont have anything cooked to less than medium well and traditional english roasting cuts (topside, silverside) tend to dry out very fast when cooked fully through. I was considering doing brisket as I might work quite well for low and slow. Are there any beef cuts or brisket cooking recommendations you guys have? ",
        "created_utc": 1513803597,
        "upvote_ratio": ""
    },
    {
        "title": "I Made Kenji’s Foolproof Pan Pizza",
        "author": "anatomyking",
        "url": "https://i.redd.it/ree5aromb1501.jpg",
        "text": "",
        "created_utc": 1513757139,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone here made Kenji's DIY Instant Noodle cups?",
        "author": "Domodude17",
        "url": "https://www.reddit.com/r/seriouseats/comments/7kwnan/has_anyone_here_made_kenjis_diy_instant_noodle/",
        "text": "Here is the link to the recipe http://www.seriouseats.com/2014/09/diy-instant-noodle-cups-food-lab.html\n\nJust wondering if anyone here has made these, and what variations you've come up with!",
        "created_utc": 1513720935,
        "upvote_ratio": ""
    },
    {
        "title": "Are the plastic handles on the Joyce Chen wok a problem?",
        "author": "sampark3",
        "url": "https://www.reddit.com/r/seriouseats/comments/7kuf16/are_the_plastic_handles_on_the_joyce_chen_wok_a/",
        "text": "I'm thinking about springing for a wok and so I looked at the [Joyce Chen wok](https://www.amazon.com/Joyce-Chen-22-0060-Uncoated-14-inch/dp/B0001VQIP4/ref=sr_1_1?ie=UTF8&amp;qid=1513701125&amp;sr=8-1&amp;keywords=joyce+chen+wok) that Serious Eats recommends. The one thing that's giving me pause is the plastic helper handle. After looking at Kenji's wok videos, there are noticeable burns on the helper handle. Flare ups tend to be somewhat inevitable on gas stoves as seen in his recent [late night dan dan noodle video](https://youtu.be/XcTNQwj6lHo?t=2m2s), and I even experience the same thing on my cast iron skillet when I'm sauteing. Wouldn't this be a problem for the plastic helper handle on the Joyce Chen wok that Serious Eats recommends, as it might start melting? I was looking at getting either the flat bottom wok from [the wok shop](https://www.amazon.com/Inches-Carbon-Wok-Helper-Thickness/dp/B006U8B9H4/ref=sr_1_1?ie=UTF8&amp;qid=1513696431&amp;sr=8-1&amp;keywords=wok+shop+wok) or the Joyce Chen [flat bottom wok with wooden helper handles](https://www.amazon.com/Joyce-Chen-21-9978-Classic-14-inch/dp/B002AQSWMU/ref=sr_1_1?s=home-garden&amp;ie=UTF8&amp;qid=1513701553&amp;sr=1-1&amp;keywords=joyce+chen+14+inch+wok). But the problem is is that the wok shop wok doesn't list how thick the carbon steel is, and the Joyce Chen flat bottom wok with wooden helper handles has 1.5mm gauge, quite a bit less than the 2mm gauge of the one with plastic handles. Has anyone had any experience with the woks I've listed? ",
        "created_utc": 1513701680,
        "upvote_ratio": ""
    },
    {
        "title": "Super Spicy Korean Fire Octopus Ramen!?!? 불낙볶음면먹다!",
        "author": "Saih-ttam",
        "url": "https://youtu.be/GYBYTIlwnhI",
        "text": "",
        "created_utc": 1513695369,
        "upvote_ratio": ""
    },
    {
        "title": "POV: Late night dan dan noodles",
        "author": "TheGABB",
        "url": "https://youtu.be/XcTNQwj6lHo",
        "text": "",
        "created_utc": 1513682075,
        "upvote_ratio": ""
    },
    {
        "title": "My mom has Celiac's disease, so I can't use the regular dry mix for Kenji's pancakes...would subbing in her usual bisquick gluten-free mix work?",
        "author": "Portalboat",
        "url": "https://www.reddit.com/r/seriouseats/comments/7kqtl8/my_mom_has_celiacs_disease_so_i_cant_use_the/",
        "text": "I'm heading home for the holidays in a little bit, and I want to make Kenji's pancakes for my mom. But unfortunately, she has a gluten allergy (Celiac's), so using the dry mix recipe is right out. And if I'm remembering right, she usually uses a gluten-free Bisquick mix from the store. \n\nCould I sub out the dry mix from the recipe for that gluten-free mix and continue on with the rest of the wet ingredients, or is it more complicated than that? ",
        "created_utc": 1513656831,
        "upvote_ratio": ""
    },
    {
        "title": "Candied gingerbread men dough in refrigerator?",
        "author": "SiberianGnome",
        "url": "https://www.reddit.com/r/seriouseats/comments/7kqb3q/candied_gingerbread_men_dough_in_refrigerator/",
        "text": "Anyone know how long [this dough](http://www.seriouseats.com/recipes/2011/12/gingerbread-men-candied-ginger-recipe.html) can stay in the fridge?  We made the dough Saturday but didn't get the cookies made.  \n\nCan we throw it in the freezer now and keep it there until Sunday or Monday!",
        "created_utc": 1513651436,
        "upvote_ratio": ""
    },
    {
        "title": "Made the potato chip/Spanish tortilla for dinner tonight. No regrets.",
        "author": "CrispyBrisket",
        "url": "http://www.seriouseats.com/recipes/2013/06/salt-and-vinegar-spanish-tortilla-recipe.html",
        "text": "",
        "created_utc": 1513646832,
        "upvote_ratio": ""
    },
    {
        "title": "The 'leaping frog' - a spatchcock alternative.",
        "author": "buttoxide",
        "url": "https://i.redd.it/qzwsn4hqpo401.jpg",
        "text": "",
        "created_utc": 1513604806,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me out here? How to best cook this Akaushi Wagyu steak I've just taken out of the fridge for a couple of hours? Details in the comments.",
        "author": "niktemadur",
        "url": "https://i.imgur.com/Q9mrpvP.jpg",
        "text": "",
        "created_utc": 1513592615,
        "upvote_ratio": ""
    },
    {
        "title": "Shakshuka",
        "author": "e4amateur",
        "url": "https://i.redd.it/u0zgu05x8n401.jpg",
        "text": "",
        "created_utc": 1513586727,
        "upvote_ratio": ""
    },
    {
        "title": "Chicharrones: Deep Fried Pork Belly",
        "author": "Kitchen-Tinkering",
        "url": "https://imgur.com/a/mQhsp",
        "text": "",
        "created_utc": 1513532164,
        "upvote_ratio": ""
    },
    {
        "title": "First person pov Late night chorizo grilled cheese",
        "author": "McIgglyTuffMuffin",
        "url": "https://www.youtube.com/watch?v=9OVNG7JpnJA&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1513513584,
        "upvote_ratio": ""
    },
    {
        "title": "Speed Drinking fanta",
        "author": "235815",
        "url": "https://www.youtube.com/watch?v=Ey8j3WnMrF4",
        "text": "",
        "created_utc": 1513457775,
        "upvote_ratio": ""
    },
    {
        "title": "Various Rib Roast Clarifications/Questions",
        "author": "BeaconSlash",
        "url": "https://www.reddit.com/r/seriouseats/comments/7k7050/various_rib_roast_clarificationsquestions/",
        "text": "Pretty straightforward question... Is is recommended/required to bring the rib roast recipe to room temp before putting in low/slow oven?\n\nI'm planning on the 150* roast temp. Also... Have a 4 bone 9ish lb roast. Anybody with experience on how long that will take to get to temp?\n\nAnyone using convection? Or does that throw the times off?\n\nThanks!",
        "created_utc": 1513431001,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji on stage talking about sausage at Tested Live",
        "author": "spopeblue",
        "url": "https://youtu.be/FNPn7B6n-Iw",
        "text": "",
        "created_utc": 1513427879,
        "upvote_ratio": ""
    },
    {
        "title": "Real deal kung pao chicken",
        "author": "robissimo",
        "url": "https://i.redd.it/dwe1pinb44401.jpg",
        "text": "",
        "created_utc": 1513355208,
        "upvote_ratio": ""
    },
    {
        "title": "Sous Vide Pork Shoulder question",
        "author": "gromtown",
        "url": "https://www.reddit.com/r/seriouseats/comments/7k053i/sous_vide_pork_shoulder_question/",
        "text": "I guess this goes for any high temp, long cook, but in this instance I'm cooking a 7lb pork shoulder at 165F.  I started at about midnight last night and when I woke up at 6, the bag had filled with some air to the point where not all parts of the meat were being 'touched' by the water.  Because I had to leave for work, I opened the bag, reserved the juices to cook down for a bbq sauce, and resealed in a new bag.\n\nI don't think it's an issue of bad meat--I bought two shoulders at the same time and smoked one (turned out just fine) and froze the other (this one).  I have a relatively inexpensive sealer (~$50) so I think that might be part of it.\n\nWhat do you guys do in an instance like this? ",
        "created_utc": 1513349504,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's tortilla pizza",
        "author": "[deleted]",
        "url": "https://i.redd.it/u52xskg7d3401.jpg",
        "text": "[deleted]",
        "created_utc": 1513346047,
        "upvote_ratio": ""
    },
    {
        "title": "Bagel Flavours?",
        "author": "laughingfire",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jzanp/bagel_flavours/",
        "text": "Hey everyone, just trying out the bagel recipe on SE this morning and I've been wondering...\n\nCan you add different things to the dough and have it still come out okay? Like, chocolate chips, or jalapenos? I want to mimic the vast variety of specialty bagels I find in high end bakeries.\n\nThanks! ",
        "created_utc": 1513339603,
        "upvote_ratio": ""
    },
    {
        "title": "Gift for a ten year old interested in cooking",
        "author": "cycloptiko",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jwo5m/gift_for_a_ten_year_old_interested_in_cooking/",
        "text": "Slightly off topic, but my ten year old niece is getting vert interested in cooking. I didn't start until college, so I have no idea what's appropriate! I want to get her something that's age appropriate but at the same time will teach her real skills and isn't \"childish.\" She's covered for baking gear, and is more interested in cooking anyway.\n\nMy parents are getting her a cookbook called \"The Young Chef,\" which seems like it has some good starting points.",
        "created_utc": 1513303989,
        "upvote_ratio": ""
    },
    {
        "title": "substitution for mushroom in a beef wellington",
        "author": "memesmcdunk",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jvjbp/substitution_for_mushroom_in_a_beef_wellington/",
        "text": "I wanted to make a beef wellington for the family during the holidays but i have family that's allergic to mushroom. Are there any viable subsititutions? ",
        "created_utc": 1513292783,
        "upvote_ratio": ""
    },
    {
        "title": "Does The Food Lab cookbook include any sous vide recipes?",
        "author": "TCesqGO",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ju7pp/does_the_food_lab_cookbook_include_any_sous_vide/",
        "text": "",
        "created_utc": 1513281598,
        "upvote_ratio": ""
    },
    {
        "title": "Prosciutto di Parma is delicious, but it takes time and a lot of patience to get it ready for consumption.",
        "author": "LizCampe",
        "url": "http://www.seriouseats.com/2015/12/labor-of-love-the-long-road-to-prosciutto-di-parma.html",
        "text": "",
        "created_utc": 1513271238,
        "upvote_ratio": ""
    },
    {
        "title": "How to eat like a local while traveling through inner Mongolia in an RV",
        "author": "LizCampe",
        "url": "http://www.seriouseats.com/2016/01/china-travel-inner-mongolia-road-trip.html",
        "text": "",
        "created_utc": 1513270318,
        "upvote_ratio": ""
    },
    {
        "title": "Can I use this sugar when making the Jalapeno Jam recipe?",
        "author": "Produkt",
        "url": "https://www.reddit.com/r/seriouseats/comments/7js23q/can_i_use_this_sugar_when_making_the_jalapeno_jam/",
        "text": "I've never made jam before. Here is the recipe: www.seriouseats.com/recipes/2013/06/jalapeno-jam-sauced-recipe.html\n\nIt says to use granulated sugar. I have these two sugars on hand. Will these work? Can I use both mixed together since I don't have 6 cups of the lighter stuff? Or should I just buy somthing else?\n\nhttps://imgur.com/a/fBDxp\n\n",
        "created_utc": 1513263334,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about SE’s Perfect Prime Rib recipe",
        "author": "pnutbutterjellyfine",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jrli8/questions_about_ses_perfect_prime_rib_recipe/",
        "text": "Hey guys!\n\nI want to try Kenji’s recipe for prime rib, since my last attempt didn’t go very well (Chef John’s recipe for 500 degrees per lb then cut the oven off - perfectly cooked but too tough!) \n\nI am really looking for a prime rib that has a perfect texture. It’s my husband’s favorite cut, and I want to blow his socks off and make the best he’s ever had. I have a couple questions though. \n\n- His recipe says to cut the oven off when it reaches an internal temp of 120/125F. I thought fat doesn’t render until 130F? I am a medium rare girl and my husband is more of a medium guy, but will go MR for prime rib. What temp reaches that wonderful melted fat rendered sweet spot without being overcooked?\n\n- I think my oven only goes to 500F, how long would you say the sear portion lasts? Is it just to visual doneness? \n\n- Do you let the meat come to room temp before starting or does it matter?\n\n- He just suggests salt and pepper for the exterior. Anyone add anything else? We love garlic, but not sure how it would do in this case. \n\n- I am thinking about cold smoking the prime rib with Hickory pellets the day before making it, wrapping it up and letting it rest overnight. Has anyone cold smoked it before? How did it turn out?\n\nThanks for the input! \n",
        "created_utc": 1513258547,
        "upvote_ratio": ""
    },
    {
        "title": "Four different types of steak and how to cook them. Useful info for novice chefs.",
        "author": "[deleted]",
        "url": "https://www.goodfoodstories.com/hanger-skirt-flank-flatiron-steaks/",
        "text": "[deleted]",
        "created_utc": 1513216574,
        "upvote_ratio": ""
    },
    {
        "title": "Interview with an in-demand food stylist and culinary creative director about food, art, and marketing. (amazing pics and reel)",
        "author": "[deleted]",
        "url": "https://www.artpublikamag.com/single-post/2017/10/02/Know-Your-Food-Interview-with-Food-Stylist-and-Culinary-Creative-Director-Charlotte-Omnes",
        "text": "[deleted]",
        "created_utc": 1513208978,
        "upvote_ratio": ""
    },
    {
        "title": "Suckling pig on spit in oven",
        "author": "Aernot",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jm0yp/suckling_pig_on_spit_in_oven/",
        "text": "Hi there!\n\nNext week I'll cook a suckling pig for friends. I have one of these spits that goes into oven, does anybody have any experience with cooking the animal like this? I saw a lot on the internet about cooking on a spit, I saw some about cooking it in the oven (both on serious eats as well) but nothing about spit in the oven. Is there something special to take into account?\nMy plan right now is as follows:\n\n- I bought a suckling pig of about 8 kg (17.7 pounds)\n- massage some oil and salt on the skin and inside of animal\n- animal on spit\n- put some apple and herbs inside and close the animal with some metal wire\n- cook for about 5/6 hours on 150 Celsius (300f) or until shoulder and ham say they are 160f \n- rest for about an hour in aluminum foil\n- put apple in mouth and eat the animal\n\nWhat do you guys think? \n\nArno",
        "created_utc": 1513196399,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone made Stella’s gingerbread cake?",
        "author": "Seawhales13",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jlsdc/has_anyone_made_stellas_gingerbread_cake/",
        "text": "I want to make Stella’s gingerbread cake and cream cheese frosting for a work holiday party next week but wasn’t sure if anyone had experience/suggestions! Sometimes I worry if I haven’t made something before and am bringing it to an event. There’s also a lot of technical notes with some baking recipes so I don’t want to pick something too hard or complicated, though this one seems doable and delicious. Otherwise, any suggestions for a holiday dessert are appreciated! ",
        "created_utc": 1513194426,
        "upvote_ratio": ""
    },
    {
        "title": "Double brine study",
        "author": "spinmyworld",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jlo09/double_brine_study/",
        "text": "Sorry about the title, I couldn't resist. Just looking for some insight.\n\nChristmas is coming up and I'm planning on cooking a Turkey with my mother. Long story short, she wants to do a wet brine with aromatics, sugar and junk in the brine and I want to do a dry brine with salt and baking powder, ala Kenji. As opposed to making her read all these lovely studies on SE that I'm sure she has no desire to look at, I wanted to do her wet brine overnight and the dry brine for the final 12 hours prior to cooking. \n\nIs this overkill? Should I just hunker down and do just the wet brine?",
        "created_utc": 1513193405,
        "upvote_ratio": ""
    },
    {
        "title": "Edna Lewis' cookbook, The Taste of Country Cooking, has rocketed to the number 5 slot on the Amazon bestsellers chart and number 3 in the cookbooks category, after getting mentioned on Top Chef.",
        "author": "LizCampe",
        "url": "https://www.eater.com/2017/1/7/14200170/edna-lewis-cookbook-bestseller-top-chef",
        "text": "",
        "created_utc": 1513186736,
        "upvote_ratio": ""
    },
    {
        "title": "Blitz Puff Pastry Christmas Tree",
        "author": "riggabamboo",
        "url": "https://i.redd.it/cvsr13cirp301.jpg",
        "text": "",
        "created_utc": 1513181373,
        "upvote_ratio": ""
    },
    {
        "title": "I've heard truffle oil is crap; if i do splurge on real truffles, is there any advice on the best way to enjoy them?",
        "author": "Brotilla",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jihq7/ive_heard_truffle_oil_is_crap_if_i_do_splurge_on/",
        "text": "Hi SE,\n\nJust a quick question that I've wondered and came to mind again after seeing a post about a burger with a side of truffle fries:\n\nIs truffle oil even a close approximation to what real truffles taste like? (I sort of hate truffle fries) I've seen a fair share of fancy food posts and TV spots that highlight black truffles.  \n\nI'm SUPER curious as to what they taste like; Is the real thing worth experiencing? As somebody fresh out of grad school it's not like I'm swimming in $ and I'd be pretty annoyed if I didn't like it.  \n\nI could either splurge on them at a restaurant or try and find and buy some myself.  If I were to buy some (they show up at local boutique markets in Portland, OR), is there any advice on how to prepare them? I've mostly just seen them shaved onto the top of pasta.  \n\nThoughts?",
        "created_utc": 1513162817,
        "upvote_ratio": ""
    },
    {
        "title": "What cut of beef for tender, thinly sliced medium rare roast beef for sandwiches?",
        "author": "Anti-Baby",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jih85/what_cut_of_beef_for_tender_thinly_sliced_medium/",
        "text": "Last week I reverse seared a Choice bottom round roast.  I easily carved a third of it against the grain, which made for some excellent sandwiches, but then the direction of the grain became hard to read, the slices were too tough for wiches, and we had to eat the rest with forks and steak knives.  The flavor was great, but I was hoping to slice the whole thing for sandwiches.\n\nDo you guys have a preferred cut for such an application?  \n\nIf it makes any difference, I tend to dry brine my meat for several days and slowly roast them like I described above. Would eye of round be okay? I've really only had it on top of pho.  A local supermarket has bone-in Select Ribeye roasts on sale for $4/lb - would that be a steal as far as my purposes are concerned?",
        "created_utc": 1513162603,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone else tried the SE Tikka Masala Recipe?",
        "author": "gfeplusgreek",
        "url": "https://www.reddit.com/r/seriouseats/comments/7jd5t2/has_anyone_else_tried_the_se_tikka_masala_recipe/",
        "text": "Let me start out by saying that Serious Eats is my #1 resource for everything related to cooking. I love the site and I try to cook pretty much anything that Kenji, Gritzer &amp; Shao have contributed to it. The SE book has become my go-to gift for grab-bags &amp; secret santas this time of year. \n\nAnyway, I ended up making the [tikka masala](http://www.seriouseats.com/2012/06/the-food-lab-how-to-make-chicken-tikka-masala-at-home.html) last week and I have to say, it was the first recipe that was kind of a miss for me to the point where I'm wondering now if maybe I've just never had proper tikka masala. The amount of salt in the marinade (1/4 cup) was too much for me, and I absolutely love salt. The amount of lemon juice (3/4 cup) also seemed to be a bit off and it actually became the primary note coming through on the dish. This is not as big of a deal for me, but there seemed to be a couple of typos in the recipe itself, which I'm not used to seeing with Kenji recipes that have over 50 reviews (the ingredient list mentions 3 tablespoons of ginger but the recipe calls for 2 tablespoons + 2 tablespoons; the ingredient list mentions 12 cloves of garlic but the recipe has you use 8 cloves for 1 step and then the \"remaining 4 tablespoons\" in another). Has anybody else tried this recipe and if so, did you have a similar outcome? ",
        "created_utc": 1513106246,
        "upvote_ratio": ""
    },
    {
        "title": "Used the Sicilian Style Pizza Dough for a pan pizza....",
        "author": "g3wd",
        "url": "https://i.redd.it/im1ssqx5re301.jpg",
        "text": "",
        "created_utc": 1513048095,
        "upvote_ratio": ""
    },
    {
        "title": "Substitutions for bacon in frijoles charros?",
        "author": "SharktheRedeemed",
        "url": "https://www.reddit.com/r/seriouseats/comments/7j7pbp/substitutions_for_bacon_in_frijoles_charros/",
        "text": "Using the recipe here: http://www.seriouseats.com/recipes/2016/06/frijoles-charros-mexican-pinto-beans-bacon-recipe.html\n\nWhat could I use in place of bacon?  The bacon is providing both flavor and fat, so while it's easy enough to replace the fat (I tried a mix of butter and oil), the flavor seems trickier.\n\nMy goal is to make the recipe a bit healthier while still tasting good - removing the bacon and trying alternative fat sources resulted in beans that didn't taste very good.\n\nAny suggestions?",
        "created_utc": 1513047949,
        "upvote_ratio": ""
    },
    {
        "title": "5-ingredient fried chicken sando",
        "author": "RYouNotEntertained",
        "url": "https://i.redd.it/ikza833yee301.jpg",
        "text": "",
        "created_utc": 1513043944,
        "upvote_ratio": ""
    },
    {
        "title": "Jewish Style Brisket Help?",
        "author": "bruiserbrody45",
        "url": "https://www.reddit.com/r/seriouseats/comments/7j5kop/jewish_style_brisket_help/",
        "text": "I was hoping to ask Kenji this in his AMA today but totally slept on it. I've read the Serious Eats recipe and I have been trying to tweak it slightly to get perfectly tender, cut with a fork brisket that still holds together. I've done a few samples:\n\nAt 275 I went about 1 hour per pound and it came out a little tough. You couldn't cut through with a fork, needed a knife.\n\nAt 225 I went about 1.5 hour per pound, and it came out tasty, however it was too tender - The pieces were kind of falling apart.\n\nThe rest of my process is: I season, sear, brown celery, carrots, onions, garlic -deglaze that with red wine, throw in a can of diced tomatoes, a bunch of seasoning, some soy sauce and worcester, some beef stock. Then let the brisket cook in the liquid. When its done, I remove all vegetables except for the carrots and blend them with the liquid, then cook that down into a sauce.\n\nI'm trying to knock this out of the park as I'm taking over the holiday brisket from my grandma and serving to the whole family.\n\nI'm thinking maybe I'll meet in the middle on the temperature? I'm wondering, from a science standpoint, how low is too low, and how long is too long to cook? If I kept it at 275 and just cooked for longer, what would my result be?\n\nMy last issue was seasoning: In my tests, I didnt get a good season on the brisket. Once it went into the liquid, I felt it lost all the seasoning. I also trim the fat off the top after cooking, so any seasoning on the fat doesnt make it in. This time, I am seasoning the day before so it can hopefully absorb the seasoning more. Would it make sense to maybe cut some of the fat like a flap, and then season it, and then place the fat back on top?\n\nAny tips and help would be appreciated",
        "created_utc": 1513028052,
        "upvote_ratio": ""
    },
    {
        "title": "Overconfidence has been ruining all but my first bread attempts. Making Kenji's onion rings solved the problem. Story inside.",
        "author": "star_boy2005",
        "url": "https://www.reddit.com/r/seriouseats/comments/7j4j5c/overconfidence_has_been_ruining_all_but_my_first/",
        "text": "Then I saw what I was doing wrong in [an article about onion rings](http://www.seriouseats.com/2015/09/the-food-lab-foolproof-onion-rings-excerpt.html), of all things: over mixing/kneading.\n\nMy first few attempts at making bread dough (for pizza) were perfect. I was really nervous and followed the instructions very closely, never leaving the mixer. \n\nThen I started getting cocky when my initial attempts were so successful. I started walking away from the mixer during the kneading steps, and doing other things around the kitchen. I thought letting the mixer go for a little while on its own could not hurt anything. I was wrong. My breads have been much tougher and denser.\n\nThen in this article I discovered a truth that was not adequately driven home during my early pizza research. Don't over-knead the dough.",
        "created_utc": 1513020243,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for an Oyster Stew recipe?",
        "author": "lmcclell",
        "url": "https://www.reddit.com/r/seriouseats/comments/7j4eq1/recommendations_for_an_oyster_stew_recipe/",
        "text": "My Nordic grandmother will be visiting for Christmas. She always used to make Oyster Stew on Christmas Eve. She's not much of a cook, though, and I doubt she remembers her recipe. I'd love to make this for Christmas Eve at our house. There are all kinds of results on the internetz, but I thought maybe I'd have some luck and find a trusted recipe from one of ya'll. ",
        "created_utc": 1513019232,
        "upvote_ratio": ""
    },
    {
        "title": "Made Kenji's foolproof hollandaise! (It took two attempts to get it right.)",
        "author": "Scyld1ng",
        "url": "https://imgur.com/9m3RzWN",
        "text": "",
        "created_utc": 1513007554,
        "upvote_ratio": ""
    },
    {
        "title": "Hasselback Au Gratin",
        "author": "HinkHall",
        "url": "https://imgur.com/qWjTEt9",
        "text": "",
        "created_utc": 1512974256,
        "upvote_ratio": ""
    },
    {
        "title": "I made the Perfect Pan Pizza! But this time with New Belgium Beer Brats &amp; sauerkraut.",
        "author": "teaearlgreyhot",
        "url": "https://imgur.com/gallery/9mCw6",
        "text": "",
        "created_utc": 1512960407,
        "upvote_ratio": ""
    },
    {
        "title": "Potato hash. Sometimes the simple things are the best.",
        "author": "tiberiumx",
        "url": "https://i.imgur.com/YVMKZSN.jpg",
        "text": "",
        "created_utc": 1512929437,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn't Serious Eats have a mobile app?",
        "author": "ripcitybitch",
        "url": "https://www.reddit.com/r/seriouseats/comments/7iunft/why_doesnt_serious_eats_have_a_mobile_app/",
        "text": "",
        "created_utc": 1512921326,
        "upvote_ratio": ""
    },
    {
        "title": "Bravetart brownies",
        "author": "_angman",
        "url": "https://www.imgur.com/a/Qk0Cx",
        "text": "",
        "created_utc": 1512850627,
        "upvote_ratio": ""
    },
    {
        "title": "I can't believe this hasn't been posted here yet, but Kenji is doing an AMA on Monday",
        "author": "randoIVI",
        "url": "https://twitter.com/kenjilopezalt/status/939547604907520000",
        "text": "",
        "created_utc": 1512841545,
        "upvote_ratio": ""
    },
    {
        "title": "Tuna Melt Mayonnaise Substitution!",
        "author": "fitfatman",
        "url": "https://www.youtube.com/watch?v=Sr7rJ1USzdo",
        "text": "",
        "created_utc": 1512787015,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion on recipe instructions",
        "author": "RustyDogma",
        "url": "https://www.reddit.com/r/seriouseats/comments/7ihd59/confusion_on_recipe_instructions/",
        "text": "I'm making the [1-Hour Pressure Cooker Texas-Style Chile Con Carne Recipe](http://www.seriouseats.com/2015/01/the-food-lab-how-to-make-pressure-cooker-texas-chile-con-carne-beef-chili.html)\n\n \n\n&amp;nbsp;\n\n\n\n\nI'm confused on the first step:\n\n \n\n\n\n\n\n\n \n\n&gt; Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chilies on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add chicken broth and chipotle chilies, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside.\n\n\n&amp;nbsp;\n\n\n\nI do not have a microwave, so I'm doing the stove-top method, but the instructions on that are not as clear to me as the microwave part.\n\n* Am I supposed to rehydrate the chilies before cooking them? \n* Since I'm not using a microwave, at what point do I add the broth and chilies, and how long should they cook? \n* Should I just be able to cook the chilis in the bottom of an Instant Pot on sauté then add the broth and chipotle?\n\n &amp;nbsp;\n\nThanks in advance for the help!",
        "created_utc": 1512761741,
        "upvote_ratio": ""
    },
    {
        "title": "Muri Ghonto | Bengali Fish head Curry with Rice recipe| Traditional Indian Recipe [W] English Sub",
        "author": "[deleted]",
        "url": "https://youtu.be/_12F-A5eIWI",
        "text": "[deleted]",
        "created_utc": 1512759867,
        "upvote_ratio": ""
    },
    {
        "title": "LPT: Chicken Tinga leftovers make a better Tortilla Soup base than the official SE Tortilla Soup recipe",
        "author": "SonVoltMMA",
        "url": "http://www.seriouseats.com/recipes/2016/01/chicken-tinga-spicy-mexican-shredded-chicken-recipe.html",
        "text": "",
        "created_utc": 1512743162,
        "upvote_ratio": ""
    },
    {
        "title": "Can I refrigerate the Foolproof Pan Pizza dough until ready to use?",
        "author": "cgibsong002",
        "url": "https://www.reddit.com/r/seriouseats/comments/7i955j/can_i_refrigerate_the_foolproof_pan_pizza_dough/",
        "text": "I'm looking to make both the pan pizza and New York style pizzas this weekend. I'd like to make both doughs tonight and leave them in the fridge so I can just have them ready to go when it's time to make them. Is that possible? Also, can I mix the pan pizza dough in the food processor since I'll already be using it? I'd imagine that might be detrimental since it's a no-knead dough, but I've never tried. \n\nedit:\nhttp://www.seriouseats.com/recipes/2013/01/foolproof-pan-pizza-recipe.html\nhttp://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\n",
        "created_utc": 1512676427,
        "upvote_ratio": ""
    },
    {
        "title": "Making ramen broth, but can't find pork fat back",
        "author": "callumacrae",
        "url": "https://www.reddit.com/r/seriouseats/comments/7i5g8s/making_ramen_broth_but_cant_find_pork_fat_back/",
        "text": "http://www.seriouseats.com/2012/02/how-to-make-tonkotsu-ramen-broth-at-home-recipe.html\n\nI've managed to find all the ingredients to this except for the fat back - can I substitute for lard / anything else, or should I just leave it out?",
        "created_utc": 1512641396,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji on the House of Carbs podcast",
        "author": "kmack",
        "url": "https://www.theringer.com/2017/12/6/16743674/kenji-lopez-interview",
        "text": "",
        "created_utc": 1512604800,
        "upvote_ratio": ""
    },
    {
        "title": "Stella’s Classic Banana Bread",
        "author": "anatomyking",
        "url": "https://i.redd.it/owzqjzj6y8201.jpg",
        "text": "",
        "created_utc": 1512541930,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's quinoa salad with cukes, tomatoes, and herbs.",
        "author": "anyholsagol",
        "url": "https://imgur.com/I9m1CVB",
        "text": "",
        "created_utc": 1512509375,
        "upvote_ratio": ""
    },
    {
        "title": "1st attempt at Homemade Bagels, à la Jo Goldenberg.",
        "author": "curtzilla",
        "url": "https://imgur.com/a/t6iTn",
        "text": "",
        "created_utc": 1512500671,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's Sous Vide Rack of Lamb",
        "author": "Kitchen-Tinkering",
        "url": "https://imgur.com/a/vTfjF",
        "text": "",
        "created_utc": 1512499758,
        "upvote_ratio": ""
    },
    {
        "title": "Vegetable Lasagna for Meatless Monday",
        "author": "Anti-Baby",
        "url": "https://imgur.com/a/1HMnj",
        "text": "",
        "created_utc": 1512457353,
        "upvote_ratio": ""
    },
    {
        "title": "Help with my flat bottomed wok.",
        "author": "Ithinkiampablo",
        "url": "https://www.reddit.com/r/seriouseats/comments/7hnd4r/help_with_my_flat_bottomed_wok/",
        "text": "I bought a 14 inch joyce chen flat bottomed wok (my first wok).  Following the instructions, I boiled water in it for 10 minutes, followed by a soap and water wash (i only had a sponge rather than a stainless steel brush)... I pour vegetable oil into it and heated it up, and it looks like this... am I on the right track or did I not do something right? (i.e. did I not wash the factory coating off enough)?",
        "created_utc": 1512448966,
        "upvote_ratio": ""
    },
    {
        "title": "Need some advice from fellow food science buffs",
        "author": "SyncopatedBeats",
        "url": "https://www.reddit.com/r/seriouseats/comments/7hku03/need_some_advice_from_fellow_food_science_buffs/",
        "text": "My wife has been placed on a low fodmap diet, which truly sucks. So lactose is one of the things that is outlawed. I want to make her some chocolate candies, since milk chocolate is out the window for several weeks. I do have lactose free milk and cream, but when I try searching for chocolate candy recipes everything either wants you to use milk chocolate chips or bars, or else it has you using milk powder and cocoa butter. Is there no happy medium where you can make some form of hard chocolate using cream or milk? I'm trying to either make a filled chocolate or even just a plain bar of say, orange and milk chocolate. Any help would be appreciated. I've googled for hours but pretty much just keep stumbling on to vegan chocolate as my only option. Can't find anything on seriouseats or in The Food Lab, but figured you fellow serious eats followers might have an idea.\n\nedit: she hates dark chocolate, or this would be easy. :(\n\nedit again: I will keep a log and update you all if I end up having to do experiments\n\nOkay, I played with what I had on hand to try to make a truffle. \n50g bourneville dark chocolate\n8g butter\nmelted those over water, then slowly whisked in a 36% fat lactose free cream. It was okay at 45ml, but had that bitter dark chocolate taste and I didn't want to push it too far.\nI added 1 teaspoon of icing sugar which helped a lot.\nI remembered I had some valencia orange extract so put in 1ml of that, and now it tastes like a terry's chocolate orange, kind of, which she loves. \n\nI have it in the fridge to cool to see what consistency it reaches when it does. I did find some chocolate sprinkles that are fodmap compliant, so if worst comes to worst and I can make a decent truffle, I'm sure she'll be happy. However, now I feel like I'm on a mission lol.\n\n ",
        "created_utc": 1512425130,
        "upvote_ratio": ""
    },
    {
        "title": "21 types of fries to try",
        "author": "velva1986",
        "url": "https://youtu.be/OktiVGPiM_g",
        "text": "",
        "created_utc": 1512366445,
        "upvote_ratio": ""
    },
    {
        "title": "I made hassleback potato gratin",
        "author": "[deleted]",
        "url": "https://i.redd.it/yz2podvzyt101.jpg",
        "text": "[deleted]",
        "created_utc": 1512360593,
        "upvote_ratio": ""
    },
    {
        "title": "Last day to get a #trianglestastebetter shirt!",
        "author": "EsteamedBroccoli",
        "url": "http://www.seriouseats.com/2017/11/food-nerd-triangles-taste-better-t-shirt-charity-sale.html",
        "text": "",
        "created_utc": 1512339938,
        "upvote_ratio": ""
    },
    {
        "title": "Where do y’all source your rib roasts?",
        "author": "mmkae0",
        "url": "https://www.reddit.com/r/seriouseats/comments/7hci37/where_do_yall_source_your_rib_roasts/",
        "text": "Been doing Kenji’s rib roast for the holidays these last few years. Starting my search for a roast earlier this year since I haven’t been very impressed with the quality of the roasts I’ve seen. I’m asking for recommendations on online vendors that would be good to consider this holiday. ",
        "created_utc": 1512336307,
        "upvote_ratio": ""
    },
    {
        "title": "Simple and tasty: Roger Ebert's chicken",
        "author": "robissimo",
        "url": "https://i.redd.it/s6bekcnqdr101.jpg",
        "text": "",
        "created_utc": 1512330232,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji’s Fresh Pasta and Pressure Cooker Bolognese",
        "author": "chilaquilesforbrunch",
        "url": "https://i.redd.it/sjq2unsyoq101.jpg",
        "text": "",
        "created_utc": 1512320899,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's All-Canadian Moose Stew",
        "author": "tikka_me_elmo",
        "url": "https://i.redd.it/cub8ezorhq101.jpg",
        "text": "",
        "created_utc": 1512318483,
        "upvote_ratio": ""
    },
    {
        "title": "We had FLAMIN HOT MAC N CHEETOS",
        "author": "NeighborhoodPaperboy",
        "url": "https://youtu.be/xB3FOHLnKgo",
        "text": "",
        "created_utc": 1512271824,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's Easy Chicken Tinga was a huge hit at dinner tonight",
        "author": "MogranMcGreggor",
        "url": "https://i.redd.it/8u6za5rl0m101.jpg",
        "text": "",
        "created_utc": 1512264279,
        "upvote_ratio": ""
    },
    {
        "title": "Fast and tasty: crusty chicken with mushrooms",
        "author": "robissimo",
        "url": "https://i.redd.it/uweytckflk101.jpg",
        "text": "",
        "created_utc": 1512247252,
        "upvote_ratio": ""
    },
    {
        "title": "Kamayan Feast at Jeepney NYC! Message me f you want to join us for the next one on December 10th",
        "author": "GiantsNFL",
        "url": "https://i.redd.it/9cvjz6joaj101.png",
        "text": "",
        "created_utc": 1512231372,
        "upvote_ratio": ""
    }
]