[
    {
        "title": "Hasselback Potato Gratin",
        "author": "bwbell",
        "url": "https://i.redd.it/mo3ocojy7cp01.jpg",
        "text": "",
        "created_utc": 1522606074,
        "upvote_ratio": ""
    },
    {
        "title": "Bravetart's Double Caramel Sticky Buns",
        "author": "dpu2",
        "url": "https://i.redd.it/wlpj2h8sobp01.jpg",
        "text": "",
        "created_utc": 1522599694,
        "upvote_ratio": ""
    },
    {
        "title": "April Fool's Post: How To Get The Most Out of Your Insta-Pot",
        "author": "Heresyed",
        "url": "https://www.seriouseats.com/2018/04/how-to-get-the-most-out-of-your-instant-pot.html",
        "text": "",
        "created_utc": 1522598750,
        "upvote_ratio": ""
    },
    {
        "title": "What can i sub for whole milk mozzarella in my lasagna?",
        "author": "Duffuser",
        "url": "https://www.reddit.com/r/seriouseats/comments/88p6kt/what_can_i_sub_for_whole_milk_mozzarella_in_my/",
        "text": "I'm gonna make Kenji's no holds barred lasagna for dinner tomorrow with the pressure cooker Bolognese sauce, but part of the recipe calls for making a besciamella using \"dry whole milk mozzarella cheese, grated\" the only mozzarella I seem to be able to find is either fresh mozzarella, which is way too soft to grate, or low moisture part skim mozzarella which probably won't melt into the sauce right. Which one would be the better choice, or can I substitute something else like Oaxaca cheese?",
        "created_utc": 1522567127,
        "upvote_ratio": ""
    },
    {
        "title": "Fried Bao Bun with Miso and Malt Evaporated Milk Ice Cream and Pistachio Matcha Crumb",
        "author": "[deleted]",
        "url": "https://i.redd.it/1snt22b6o6p01.jpg",
        "text": "[deleted]",
        "created_utc": 1522538946,
        "upvote_ratio": ""
    },
    {
        "title": "Rainbow carrots for Easter",
        "author": "marcyandleela",
        "url": "https://www.reddit.com/r/seriouseats/comments/88lsb8/rainbow_carrots_for_easter/",
        "text": "What recipe would you suggest for serving rainbow carrots? We are also eating beef tenderloin with horseradish cream sauce, roasted asparagus, goat cheese mashed potatoes and bread. Also, how far ahead can you parboil carrots if doing so?\n\nEdit: I would normally sous vide them but I am out of town and left my Joule at home.",
        "created_utc": 1522531375,
        "upvote_ratio": ""
    },
    {
        "title": "I made Kenji's carne asada tacos. I made the tortillas too.",
        "author": "princessprity",
        "url": "https://i.redd.it/ff8xvq3eqwo01.jpg",
        "text": "",
        "created_utc": 1522466733,
        "upvote_ratio": ""
    },
    {
        "title": "pepperoni that turns into little golden chalices",
        "author": "monkeyman80",
        "url": "http://battistonibrand.com/cup-char-buffalo-style-pepperoni-sliced-5oz-pack/",
        "text": "",
        "created_utc": 1522464979,
        "upvote_ratio": ""
    },
    {
        "title": "I made Kenji’s no knead Foccacia bread and it’s definitely a buy!",
        "author": "nameisjoey",
        "url": "https://i.redd.it/xtujgpih6zo01.jpg",
        "text": "",
        "created_utc": 1522448231,
        "upvote_ratio": ""
    },
    {
        "title": "Another Pizza, so beautiful",
        "author": "KoiFever",
        "url": "https://i.redd.it/ve1yi2r73to01.jpg",
        "text": "",
        "created_utc": 1522374421,
        "upvote_ratio": ""
    },
    {
        "title": "Evolving With Serious Eats - Some Thoughts",
        "author": "stop_stealing_sheep",
        "url": "https://www.reddit.com/r/seriouseats/comments/883342/evolving_with_serious_eats_some_thoughts/",
        "text": "There was an intriguing post the other day about the \"state of the state\" of serious eats as seen by some users. In it, [a comment from Kenji](https://www.reddit.com/r/seriouseats/comments/6jc38c/anyone_else_a_little_sad_that_theres_less_content/djddd8u/) was linked-to where he talks about his how his professional career is developing and how that has affected his role at SE, as well as how SE itself has / wants-to change. \n\nI completely agree with Kenji that there is SO MUCH great content already on SE, yet much of it often gets buried or forgotten. If you're like me, you'll find yourself browsing the site looking for one recipe, then 20 minutes later you have 10 tabs open with various recipes you've discovered (or rediscovered) that you want to save and try to make.\n\nA couple thoughts moving forward (and the point of this post). The first is that Kenji was seemingly more and more interested in the use of the pressure cooker. As am I. There seems to be a lot of great candidate-recipes already on the site that could adapt well to being rewritten for use with a pressure cooker. This is seemingly an easy way to recycle great forgotten content in a way that's fresh and useful for many users.\n\nSecond, I'd love to have a way to see a much more condensed index / table-of-contents for recipes that I can then sort by various criteria (meat, method, author, etc). Sure, I can click on keywords and have the endlessly refreshing thumbnails pop-up, but that method is so time-consuming. In comparison, it's so quick + easy to open up an actual cookbook and skim the ToC looking for an idea. Give me that ability to quickly skim information.",
        "created_utc": 1522343838,
        "upvote_ratio": ""
    },
    {
        "title": "easy and delicious weeknight meals?",
        "author": "MyBingoPajama",
        "url": "https://www.reddit.com/r/seriouseats/comments/8819pk/easy_and_delicious_weeknight_meals/",
        "text": "(forgive me if this topic has been thoroughly discussed)\n\n\nwe live by The Food Lab and we frequent SeriousEats.com. i was raised on crock-pot meals and casseroles (no judgement), but find my self unsatisfied with that type of dinner as an adult. i can't dedicate all evening to prep and clean-up but want to avoid having pb&amp;j's every night (my toddler would be thrilled) or reverting to the meals i grew up on.\n\n\na recent post introduced me to kenji's coconut and aji amarilla braised chicken, which got me wondering about other kenji/serious eats recipes that are tasty and would fit in my weeknight evening timeline.  \n\n\ndon't get me wrong, i love chile con carne, but i'll save that for the weekend, when we have more time. \n\n\nwhat are your weeknight meals? what are your go-to's?\n\n\n-----------\nh/t to u/mandisays for the coconut &amp; aji recipe. it was DELICIOUS.\n",
        "created_utc": 1522330259,
        "upvote_ratio": ""
    },
    {
        "title": "I make this ahead of time to take with us whenever we go camping. Kenji's All American Beef Stew.",
        "author": "red_freckles",
        "url": "https://imgur.com/2fVsZMi",
        "text": "",
        "created_utc": 1522286657,
        "upvote_ratio": ""
    },
    {
        "title": "Ultra gooey cheese sauce for broccoli?",
        "author": "bellamira",
        "url": "https://www.reddit.com/r/seriouseats/comments/87wu5n/ultra_gooey_cheese_sauce_for_broccoli/",
        "text": "Do you guys think if I steamed fresh broccoli and used the [ultra gooey mac and cheese ](https://www.google.com/amp/s/www.seriouseats.com/amp/recipes/2015/10/the-food-labs-ultra-gooey-stovetop-mac-cheese.html) sauce - just the sauce -  to toss it in for a “cheesy broccoli” side dish, it would come out ok?\n\nIm just a little nervous about the broccoli not sticking to the sauce and ending up with broccoli cheese soup, lol. Any ideas? ",
        "created_utc": 1522281768,
        "upvote_ratio": ""
    },
    {
        "title": "[Homemade] Burger cake for a client with a craving :)",
        "author": "[deleted]",
        "url": "https://i.redd.it/fjp68sadoko01.jpg",
        "text": "[deleted]",
        "created_utc": 1522272672,
        "upvote_ratio": ""
    },
    {
        "title": "Up and coming Youtube channel",
        "author": "Mixed_Ingredients",
        "url": "https://www.reddit.com/r/seriouseats/comments/87vagy/up_and_coming_youtube_channel/",
        "text": "[removed]",
        "created_utc": 1522269049,
        "upvote_ratio": ""
    },
    {
        "title": "I ate creamy gnocchi with red wine salami, mushrooms, chicken, and broccoli (gf)",
        "author": "[deleted]",
        "url": "https://i.redd.it/rwjcrugvago01.jpg",
        "text": "[deleted]",
        "created_utc": 1522219595,
        "upvote_ratio": ""
    },
    {
        "title": "Made it to Wursthall on Sunday!",
        "author": "def-not",
        "url": "https://www.reddit.com/r/seriouseats/comments/87phks/made_it_to_wursthall_on_sunday/",
        "text": "[It was magical.](https://imgur.com/a/shftM) My friend and I showed up around 5:20pm and waited in line about a half hour before being sat. I’ll admit I spent most of that 30 minutes trying to hide the fact that not only had I brought this big and moderately dirty cookbook (first edition motherfuckers) with me for Kenji to sign, but I was also wearing [my Triangles Taste Better t-shirt](https://www.seriouseats.com/2016/11/triangles-taste-better-charity-t-shirt-sale-la-cocina.html). I kept on waiting for someone to point out how hard I was trying! \n\n\nHowever, those feelings faded pretty quickly after making it into the restaurant. The space is amazing! We ordered a few beers, deviled eggs, roasted broccolini salad, currywurst bratkartoffeln, an al pastor wurst, a chicken schnitzel sandwich, and the vanilla ice cream with pumpkin seed brittle. Kenji killed it. All of it! Everything we had was delicious. I hope everyone get a chance to visit at some point! \n\n\n(also, after all the anxiety I suffered waiting in line, several people came up to tell me that they wished they had brought their book for him to sign. One of the servers even complimented how well-used my copy was! I melted.) ",
        "created_utc": 1522215649,
        "upvote_ratio": ""
    },
    {
        "title": "I made fresh pasta and pesto, using Serious Eats recipes for both.",
        "author": "nilou_f",
        "url": "https://i.redd.it/7uwp09j9deo01.jpg",
        "text": "",
        "created_utc": 1522196187,
        "upvote_ratio": ""
    },
    {
        "title": "I made fresh pasta and pesto - both Serious Eats recipes.",
        "author": "[deleted]",
        "url": "https://i.redd.it/66h5vnttceo01.jpg",
        "text": "[deleted]",
        "created_utc": 1522196040,
        "upvote_ratio": ""
    },
    {
        "title": "One Anodized Aluminum Pan to Rule Them All",
        "author": "MindLikePotato",
        "url": "https://www.reddit.com/r/seriouseats/comments/87mndk/one_anodized_aluminum_pan_to_rule_them_all/",
        "text": "[removed]",
        "created_utc": 1522188546,
        "upvote_ratio": ""
    },
    {
        "title": "I was skeptical about a giant empanada stuffed with tuna, but this was delicious and fun!",
        "author": "MrFusionCooks",
        "url": "https://i.redd.it/6vxb0x5b16o01.jpg",
        "text": "",
        "created_utc": 1522095311,
        "upvote_ratio": ""
    },
    {
        "title": "I made Stella's Angel Biscuits and they were, indeed, angelic!",
        "author": "cjbmonster",
        "url": "https://imgur.com/HX6oI2h",
        "text": "",
        "created_utc": 1522086761,
        "upvote_ratio": ""
    },
    {
        "title": "God Level Burrito!",
        "author": "DeliciousChapter",
        "url": "https://www.youtube.com/watch?v=P_CMgQxcf-s",
        "text": "",
        "created_utc": 1522079858,
        "upvote_ratio": ""
    },
    {
        "title": "Homemade Tonkotsu Ramen",
        "author": "Oozinaahs",
        "url": "https://www.reddit.com/r/ramen/comments/879yiw/homemade_tonkotsu_ramen/",
        "text": "",
        "created_utc": 1522079805,
        "upvote_ratio": ""
    },
    {
        "title": "Chocolate Chunk Cookies",
        "author": "raaaaaandyb",
        "url": "https://i.redd.it/d7oame1dt3o01.jpg",
        "text": "",
        "created_utc": 1522068423,
        "upvote_ratio": ""
    },
    {
        "title": "[homemade] first time making linguini. Garlic fresh cherry tomato sauce.",
        "author": "k8802",
        "url": "https://i.redd.it/bxjww3x021o01.jpg",
        "text": "",
        "created_utc": 1522035033,
        "upvote_ratio": ""
    },
    {
        "title": "It’s a three sous vide kind of night. Thanks Kenji!",
        "author": "mbergh50",
        "url": "https://i.redd.it/z60kn3wwzzn01.jpg",
        "text": "",
        "created_utc": 1522022225,
        "upvote_ratio": ""
    },
    {
        "title": "Nothing like a homemade pizza pie :D",
        "author": "KoiFever",
        "url": "https://i.redd.it/4n7qt9pqnzn01.jpg",
        "text": "",
        "created_utc": 1522018142,
        "upvote_ratio": ""
    },
    {
        "title": "Good Book For Techniques",
        "author": "pr1c3yy91",
        "url": "https://www.reddit.com/r/seriouseats/comments/8739nl/good_book_for_techniques/",
        "text": "Hey guys I’m new to this page. From the UK\nJust recently started getting interested in cooking meals using fresh food and love experimenting in the kitchen.\n\nI was just wondering if anyone knows of a book with cooking techniques and pictures to go with them. Ranging from dicing and basic knife skills, to deboning meat and fish, making stocks, pasta etc\n\nAny help will be greatly appreciated thank you ",
        "created_utc": 1522008062,
        "upvote_ratio": ""
    },
    {
        "title": "Don't make the Halal Cart Chicken and Rice!",
        "author": "Chxo",
        "url": "https://www.reddit.com/r/seriouseats/comments/86zdx9/dont_make_the_halal_cart_chicken_and_rice/",
        "text": "Ok, yea, that's an alarmist title, but seriously hear me out. \n\nI made it for the first time tonight (not living in ny i've never had this before) and I honestly wasn't at all impressed with the initial recipe as I was going thru it, bagging up the chicken in the marinade I felt like, that's it? In many indian recipes you'll double marinade chicken in a lemon juice based marinade and then in yogurt with more flavor and I guess  it just felt like this should be the first step in a two step marinade process. I was kind of in a rush though so I just went right thru the recipe trusting all the hype. \n\nThe sauce, the fucking sauce... was completely fucking unpalatable when I made it. Just tasted like mayonnaise. Seriously, half a cup of fucking mayonnaise, I cringed as I measured it out and I should have fucking stopped myself there, but I didn't. I mean the sauce is half fucking mayonnaise. When was the last time you ate anything that tasted good that was half mayo? Never. Yea. Me too. I've come to trust SE recipes so I was surprised at how fucking disgusting it was. The mayo taste was overwhelming and the sauce lacked all character. I doubled the yogurt, added more parsley, lemon juice, pepper, vinegar, still it just tasted like mayo and the sugar in there really came out in a BAD way. I don't know what the hell was going on in the test kitchen, but the only time half a cup of mayonnaise should ever be used, is if you're using homemade mayonnaise, or out of vaseline. \n\nThen I went to read the comments trying to figure out what the fuck is happening... and wait. Kenji comes in and says the recipe is more for imitating the street cart vendors recipe, and that he actually uses an all yogurt white sauce when he makes the recipe at home! Now maybe this is some acquired taste people get, but I was seriously thinking of pitching the fucking sauce.\n\nLuckily a few commenters ( notably one Ken G) provided some inspiration and I was finally able to turn it into something that didnt taste like a fucking mayonnaise sandwich with even more yogurt, ricotta, cucumber, microplaned garlic, dill, mint, tahini, and olive oil. Because that actually fixed the sauce I actually hit up his spice mix too and added that to my marinade and when I was cooking.\n\nIf you are at all mayo averse, I seriously recommend you looking into some other recipe for a yogurt based sauce, oh and just spicing it up some more too.\n\nThe end product was really, really fucking good, but this is literally the first time I've ever had to stop midway thru a SE recipe and make a bunch of changes. \n\nBecause I honestly think this recipe in the comments is a better product than the SE recipe I'm gonna copy and paste it here: (my notes: for the marinade I didnt use yogurt, as I used all my yogurt trying to make the sauce not taste like asshole, also i used ricotta instead of cottage cheese in the white sauce) Courtesy of Ken G\n\n&gt; My White Sauce\n\n&gt; 1 Cup Cottage Cheese\n\n&gt; 1 Cup Sour Cream\n\n&gt; 1 Cup Mayonnaise\n\n&gt; 1 Cup Yogurt, Drained\n\n&gt; 2 Tbsp White Vinegar\n\n&gt; 1 Tbsp Olive Oil\n\n&gt; 1 Tbsp Tahini\n\n&gt; 1 Med Cucumber\n\n&gt; 2 clove Garlic\n\n&gt; 6 fresh Mint Leaves\n\n&gt; 2 sprig Dill\n\n&gt; 1 tsp Salt\n\n&gt; Blend until smooth\n\nMy Halal Chicken or Lamb Seasoning\n\n&gt; 1 Tbsp Coriander\n\n&gt;1 Tbsp Cumin\n\n&gt;1 Tbsp Paprika\n\n&gt;1 tsp Cardamom\n\n&gt;1 tsp Cinnamon\n\n&gt;1 tsp Cloves\n\n&gt;1 tsp Nutmeg\n\n&gt;1 tsp Pepper\n\n&gt;1 tsp Sumac\n\n&gt;1 tsp Turmeric\n\n&gt;1/2 tsp Allspice\n\n&gt;1/2 tsp Cayenne\n\n&gt;1/2 tsp Ginger\n\nMy Halal Chicken (or Lamb) Marinade\n\n&gt;Marinate 2 Lb Boneless, Skinless Chicken Breast and Thighs (or Lamb pieces) and 1 Sliced Med Onion, in 1/2 Cup Yogurt, 2 Tbsp Olive Oil, 1 Tbsp Lemon Juice, 1 Tbsp My Halal Seasoning, and 1 tsp salt for at least 30 min, then grill with an additional Tbsp Seasoning and break into pieces as it cooks.\n\nMaybe I'll go back and try to follow this recipe with just changing the sauce and not the marinade and spices, but I'm honestly not seeing it being any better. I'll admit the spices probably tend a little indian, but the mere addition of the sliced onion really boosted the final product. \n\nI for one would love to get the full recipe that Kenji actually uses at home both the all yogurt white sauce, and any other changes he makes.\n\nP.S. I think one could improve the rice with more spices too.\n\ntl;dr: This mayo based white sauce tastes like garbage, even kenji goes for an all yogurt sauce when he makes it. ",
        "created_utc": 1521963715,
        "upvote_ratio": ""
    },
    {
        "title": "Quality of Serious Eats ever since Kenji has been less involved",
        "author": "reversemidastouch",
        "url": "https://www.reddit.com/r/seriouseats/comments/86vhd7/quality_of_serious_eats_ever_since_kenji_has_been/",
        "text": "I'm pretty new to this sub but I've been following Serious Eats closely for quite some time, and not sure whether this has been much discussed here. \n\nFor the past months when Kenji has been busy with other stuff I've not felt the excitement browsing Serious Eats as I once did when Kenji was producing a lot of content on the site. His experiments and Food Lab in general really taught me the majority that I know about cooking, and I was always excited to come back to browse the site and I think it had more of a community feeling with Kenji discussing his experiments with the users in the comment section.\n\nThose were the times when I feel a lot of the Serious Eats recipes had more impact and many of them were life-changing for me. I've never talked to my friends so enthusiastically about recipes that I had tried. It seems that a vast majority of the recipes that are discussed in this sub are from this \"period\".\n\nThese days a lot of the content seems to be sponsored (I, of course, get that a site like this needs funding and the quality of this content  is not disturbing overall) and several different recipe round-ups from the older times. Obviously there's still plenty of good recipes and I've enjoyed Daniel Gritzer's content for years, and I'm happy to have him continuing in Kenji's footsteps.\n\nI guess some of this has to do with Kenji's personality, being an exceptional writer and his ability to get me so excited about his experiments in his tongue-in-cheek style stories behind the recipes.\n\nPerhaps the whole point of this was just to finally show my respect and gratitude to Kenji for the importance he's had on my cooking and my sentimentality for the importance of those times. Fortunately there's still plenty content on the site to keep me occupied in the kitchen for quite some time.\n\nEDIT: Just to avoid any confusion, I'm talking about the website, definitely not about this sub!",
        "created_utc": 1521920960,
        "upvote_ratio": ""
    },
    {
        "title": "Help with foccacia",
        "author": "Melded1",
        "url": "https://www.reddit.com/r/seriouseats/comments/86tr2w/help_with_foccacia/",
        "text": "In the serious eats no kneed focaccia https://www.seriouseats.com/2015/02/how-to-make-the-best-olive-rosemary-pistachio-focaccia-bread.html is the water temperature important? Normally you need to activate the yeast with water around 110f but how does it work with this method? ",
        "created_utc": 1521905619,
        "upvote_ratio": ""
    },
    {
        "title": "Home Cured and Smoked Molasses Bacon",
        "author": "Atwamp",
        "url": "https://i.redd.it/1nthz7prumn01.jpg",
        "text": "",
        "created_utc": 1521863946,
        "upvote_ratio": ""
    },
    {
        "title": "Home Cured and Smoked Molasses Bacon",
        "author": "[deleted]",
        "url": "https://i.redd.it/sjlmxvuhsmn01.jpg",
        "text": "[deleted]",
        "created_utc": 1521862945,
        "upvote_ratio": ""
    },
    {
        "title": "Kenjis cold ferment + no knead method",
        "author": "lallsonu",
        "url": "https://i.redd.it/ft4xx8vtqln01.jpg",
        "text": "",
        "created_utc": 1521849646,
        "upvote_ratio": ""
    },
    {
        "title": "Chicken Scarpariello",
        "author": "bwbell",
        "url": "https://i.redd.it/1v0afecxpln01.jpg",
        "text": "",
        "created_utc": 1521849356,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most essential cookbooks?",
        "author": "ariella17",
        "url": "https://www.reddit.com/r/seriouseats/comments/86o6nv/what_are_the_most_essential_cookbooks/",
        "text": "In your opinion, what cookbooks do you think everyone should own? I’m looking to expand my collection. I’d like to know what are classic, must haves, and what new cookbooks are really worth it. I’d like to find something very usable in each type of cuisine. ",
        "created_utc": 1521839545,
        "upvote_ratio": ""
    },
    {
        "title": "Cheap steaks for marinades?",
        "author": "max_p0wer",
        "url": "https://www.reddit.com/r/seriouseats/comments/86ns8h/cheap_steaks_for_marinades/",
        "text": "Been looking for cheap steaks to marinade, but skirt steak in the supermarket is $15/lb!!  I thought it was supposed to be a cheap cut of beef that can be made tender and flavorful through marinades. Flank steak is $10, and I look for hanger and flap but can’t find any. What other cuts of meat should I be looking for? Or am I just shopping in the wrong store?",
        "created_utc": 1521836379,
        "upvote_ratio": ""
    },
    {
        "title": "Chicken biryani recipes 😍😍😍",
        "author": "[deleted]",
        "url": "https://www.desiblitz.com/content/chicken-biryani-recipes-regions-india",
        "text": "[deleted]",
        "created_utc": 1521833577,
        "upvote_ratio": ""
    },
    {
        "title": "I decided to get this after making some Stella(r) brownies, wish I got it sooner.",
        "author": "raaaaaandyb",
        "url": "https://i.redd.it/z4znk7kk7kn01.jpg",
        "text": "",
        "created_utc": 1521831068,
        "upvote_ratio": ""
    },
    {
        "title": "Chorizo potato tacos with charred salsa verde, yum! Recipe links in comments.",
        "author": "notenoughtimetohike",
        "url": "https://i.redd.it/vaa6c9oh5kn01.jpg",
        "text": "",
        "created_utc": 1521830384,
        "upvote_ratio": ""
    },
    {
        "title": "Shrimp Rolls (New England Style)",
        "author": "Akkuma",
        "url": "https://imgur.com/a/gS3yF",
        "text": "",
        "created_utc": 1521815760,
        "upvote_ratio": ""
    },
    {
        "title": "Shrimp Rolls (New England Style)",
        "author": "[deleted]",
        "url": "https://lh3.googleusercontent.com/T_S8fk-AtMFasqxEAZYhksKkFElCdfrj_j5VDTo-3uhbivmm4PzjwLdnQzuDA2pG6IZ17Br22Ci6csoJingbImTQrxpLLeDFTcgbqFA4ur6pbqsiLOmu6udvtKNPUFpJ4VTV9efqUC3F01wCCHJzj2pU6RO3ORl9xfAbYuKBjq0_LM_2gsll8QXuJJ_K7FMqm82GrIJHz4K0qGPBJpgwutjzru0zjOC_06EZMtcTwUpbvTk-X9na4PPzHfc_cYBlMbt8HoAMrYA1K42JNYKZQLM3nZVd4RS5QXyykLqJ3hZFMs_UlnBhaKaZiTF9WCibF_rhc6FlqhaxrfMyzMWK6yC-x1vqZAerhTPrqq6dEaV5OrjaUfKIUjl4wU1bH8DFRSY2Z9Z-Zw9x9bhjcK8_rMgYM4F3lqOpp0KHr7_2Jl50bwfDhfMu8BEAthvISGSHpCUWY-lPEmeSTwdTuyV2rr0rNJLsrLCR6LxuKe0iBfFxo8EnbbVG0dlG2IJAKSdWRkaYGjbDOoS3b9gzA-Ts-Ys1pjUk1qUfbY-hm6RtrnhpYMuEHp2Y1WP03K9t1jidyWHkIWmNPEO9XAFVV0TBPz47bKvsRD8tECq46v1yESjCPCbXIlrAiPK6r3DKM3MysGUdTN_5NgQzaNWgQ1iK7nQ_p9ciP5LU=w2800-h2100-no",
        "text": "[deleted]",
        "created_utc": 1521814330,
        "upvote_ratio": ""
    },
    {
        "title": "How can I make a safe olive oil and garlic sauce?",
        "author": "Endur",
        "url": "https://www.reddit.com/r/seriouseats/comments/86foik/how_can_i_make_a_safe_olive_oil_and_garlic_sauce/",
        "text": "My friends really like the chimichurri I occasionally whip up for them, so as gifts I want to jar a bunch of it and hand them out. But I’ve heard there is a botulism risk when putting raw garlic in olive oil.\n\nIs there a way I can treat the garlic and oil to make it safe?",
        "created_utc": 1521757546,
        "upvote_ratio": ""
    },
    {
        "title": "What techniques are most important?",
        "author": "e4amateur",
        "url": "https://www.reddit.com/r/seriouseats/comments/86fbke/what_techniques_are_most_important/",
        "text": "I've been gradually getting into cooking for a few years now, and have gone from zero to... acceptable. About 6 months ago I stumbled on Kenji and that got me really passionate about food. \n\nI've been picking up techniques here and there: salting at every stage of the process, cooking fish skin side down, resting meat... But some techniques are obviously far more useful than others. Knowing to cross hatch the fat on a duck breast hasn't got much on being able to dice an onion. \n\nWhat I'd love to have is a skill road map. From the most consistently useful, to the most painfully esoteric. So I can as much as possible tasting as good as possible as soon as possible. \n\nSo what techniques give you the most bang for your buck? What skills do you use again and again, from dish to dish? What improves the flavour of a meal by leaps and bounds, rather than centimetres and inches? What do you wish you learned the day you started cooking?\n\nEDIT:\nMany thanks to everyone that responded. That was a lot more volume and detail than I was expecting. Some great advice here, that I look forward to applying in the kitchen. ",
        "created_utc": 1521754689,
        "upvote_ratio": ""
    },
    {
        "title": "Halal Chicken Recipe for Smaller Batches",
        "author": "lemongrassgogulope",
        "url": "https://www.reddit.com/r/seriouseats/comments/86f0f2/halal_chicken_recipe_for_smaller_batches/",
        "text": "Has anyone tried making the halal chicken for 2-3 people or even as an individual serving? Any suggested modifications? I just halved everything and I had trouble getting enough marinade for the chicken and the rice was a bit dry\n\nAlso, I was trying to look for the original Food Lab article for halal chicken (with the whole write up on experimentation) but I could only find the recipe. Anyone have that text archived?",
        "created_utc": 1521752218,
        "upvote_ratio": ""
    },
    {
        "title": "The Skillet-Braised Chicken with Tomatoes, Olives and Capers",
        "author": "[deleted]",
        "url": "https://i.redd.it/9trtdj4bddn01.jpg",
        "text": "[deleted]",
        "created_utc": 1521748247,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's fool-proof pan pizza; how to adjust recipe for 12\" cast iron",
        "author": "chocolate_babies",
        "url": "https://www.reddit.com/r/seriouseats/comments/86bnyb/kenjis_foolproof_pan_pizza_how_to_adjust_recipe/",
        "text": "I made this recipe last week and it was great, but a little on the small side for two hungry adults. I wanted to use my 12” cast iron and up the dough recipe, but I was wondering what adjustments I should make.",
        "created_utc": 1521727025,
        "upvote_ratio": ""
    },
    {
        "title": "Proud moments thanks to Kenji",
        "author": "donteatmysandwich",
        "url": "https://www.reddit.com/r/seriouseats/comments/868wvt/proud_moments_thanks_to_kenji/",
        "text": "It snowed its ass off today, so I decided to make beef stew. I’ve tried the Serious Eats recipe and really liked the flavor, but I didn’t have all the ingredients this time. I decided to wing it and go at it without a recipe, just basing it entirely off my preferences and memory from old recipes. \n\nIt turned out amazing. This is going to sound lame, but I was so proud of myself for putting to use some things I learned from SE. My stew was separating so I added gelatin. It didn’t have that mouth watering flavor so I added fish sauce and Worcestershire. I just cooked it off of what I wanted to taste instead of a stock recipe. \n\nAfter it was all finished I felt so accomplished. I felt like a real cook instead of some guy just copying a recipe word for word. I thought back to what I learned from SE and applied them to make a meal that was completely my own. Thank you so much Kenji and every other contributer who got me to this point! ",
        "created_utc": 1521693222,
        "upvote_ratio": ""
    },
    {
        "title": "Some Italian Pizza in my life!",
        "author": "mcmare212",
        "url": "https://i.redd.it/ri49atbef8n01.jpg",
        "text": "",
        "created_utc": 1521688446,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji’s easy and foul proof Focaccia: one of the best things I’ve eaten",
        "author": "raaaaaandyb",
        "url": "https://i.redd.it/uqu1cfonl7n01.jpg",
        "text": "",
        "created_utc": 1521678416,
        "upvote_ratio": ""
    },
    {
        "title": "Pork vindaloo - too many chilli's",
        "author": "olasaustralia",
        "url": "https://www.reddit.com/r/seriouseats/comments/865c94/pork_vindaloo_too_many_chillis/",
        "text": "I was looking at this recipe - https://www.seriouseats.com/recipes/2013/02/beyond-curry-pork-vindaloo-recipe.html\n\nAnd comparing it to other recipes on the internet. I just find that this recipe has to many chilli's compared to other recipes. It uses 15 chilli's for half a pound of pork while other recipes use the same quantity for a kilo. Granted its Kashmiri chilli's which are more for colour than taste.\n\nHas anyone else made this? And is it good",
        "created_utc": 1521662850,
        "upvote_ratio": ""
    },
    {
        "title": "Help me with pasta sauce?",
        "author": "Jakeisdumbpp",
        "url": "https://www.reddit.com/r/seriouseats/comments/864yho/help_me_with_pasta_sauce/",
        "text": "Alright so I cook a lot of food for my family and they seem to like or Love most of the dishes. Bread or steak they almost always say it’s one of the best they’ve had. The one thing that lacks something however is my tomato sauce. I’ve made kenjis slow cooked sauce dozens of times and daniels quick version as well and they all prefer my fathers sauce. What I don’t get however is why. I know my sauce needs improving mostly from a technique POV but all he does is mix garlic, hunts tomato sauce, oregano, and Romano cheese. After he sautées the garlic in olive oil he just throws the rest in and let it reduce a little bit. Any clue why those ingredients could beat out what I’ve been doing? Thanks a ton",
        "created_utc": 1521660124,
        "upvote_ratio": ""
    },
    {
        "title": "Bool Kogi fried rice",
        "author": "fazik93",
        "url": "https://i.imgur.com/mDRGYPY.jpg",
        "text": "",
        "created_utc": 1521656381,
        "upvote_ratio": ""
    },
    {
        "title": "Celebrated the arrival of Spring by uncovering the grill and making fajitas last night.",
        "author": "mrleicester",
        "url": "https://imgur.com/a/gBVre",
        "text": "",
        "created_utc": 1521641375,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's slow-cooked tomato sauce with beef - meal prepped (in 1-cup portions) and ready to go in the freezer!",
        "author": "[deleted]",
        "url": "https://i.redd.it/djdirnsgv1n01.jpg",
        "text": "[deleted]",
        "created_utc": 1521609168,
        "upvote_ratio": ""
    },
    {
        "title": "Ate at Wursthall last night and met J. Kenji Lopez-Alt. We asked his recommendation and ordered it all. Everything was amazing!",
        "author": "nusigf",
        "url": "https://imgur.com/BE4Jfsp",
        "text": "",
        "created_utc": 1521605045,
        "upvote_ratio": ""
    },
    {
        "title": "Vietnamese Coffee anyone?",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=mY5cY5gM1lI",
        "text": "[deleted]",
        "created_utc": 1521558863,
        "upvote_ratio": ""
    },
    {
        "title": "What Are Mother Sauces. A Introduction to Mother Sauces and How They Are made.",
        "author": "retrobite",
        "url": "https://www.retrobite.com/what-are-mother-sauces/",
        "text": "",
        "created_utc": 1521538973,
        "upvote_ratio": ""
    },
    {
        "title": "Rosemary and Garlic crusted Lamb lollipops!",
        "author": "Mdonsean",
        "url": "https://i.redd.it/nbtqjmnxotm01.jpg",
        "text": "",
        "created_utc": 1521510018,
        "upvote_ratio": ""
    },
    {
        "title": "Halal cart chicken: quick, easy, and delicious!",
        "author": "ExaltedNecrosis",
        "url": "https://i.imgur.com/uvFkdgE.jpg",
        "text": "",
        "created_utc": 1521508678,
        "upvote_ratio": ""
    },
    {
        "title": "Pressure cooker Chicken Chile Verde, Spanish rice, and Mayocoba beans",
        "author": "Duffuser",
        "url": "https://i.redd.it/puyaa68fetm01.jpg",
        "text": "",
        "created_utc": 1521506487,
        "upvote_ratio": ""
    },
    {
        "title": "Home made soda bread",
        "author": "Justo1980",
        "url": "https://i.redd.it/rk1q3xxvrqm01.jpg",
        "text": "",
        "created_utc": 1521474691,
        "upvote_ratio": ""
    },
    {
        "title": "My third loaf of Irish Soda Bread. At least I got a photo of this one before it was gone.",
        "author": "XeniaGaze",
        "url": "https://imgur.com/j1KNMe2",
        "text": "",
        "created_utc": 1521465816,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's Ricotta Gnocchi and Slow-Cooked Bolognese",
        "author": "ramses202",
        "url": "https://i.redd.it/8898spp5xpm01.jpg",
        "text": "",
        "created_utc": 1521464449,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji, I have seen people online adding fruits like kiwis or pineapple to marinades, claiming it makes meat more tender. Any truth to this?",
        "author": "zsrocks",
        "url": "https://www.reddit.com/r/seriouseats/comments/85gm5y/kenji_i_have_seen_people_online_adding_fruits/",
        "text": "",
        "created_utc": 1521430617,
        "upvote_ratio": ""
    },
    {
        "title": "Bucatini all'Amatriciana",
        "author": "LilHummingBird",
        "url": "https://imgur.com/747ByW1",
        "text": "",
        "created_utc": 1521426207,
        "upvote_ratio": ""
    },
    {
        "title": "Finally mastered the secret to no oil baked crispy wings",
        "author": "oana-oana",
        "url": "https://www.instagram.com/p/Bge5huOHRbx/?taken-by=dish.bish.eats",
        "text": "",
        "created_utc": 1521416719,
        "upvote_ratio": ""
    },
    {
        "title": "Chocolate Guinness stout cake (w/shaved chocolate)",
        "author": "ratpH1nk",
        "url": "https://i.redd.it/xyz5oohdrlm01.jpg",
        "text": "",
        "created_utc": 1521413985,
        "upvote_ratio": ""
    },
    {
        "title": "Stella’s Cherry Pie",
        "author": "Dowarner",
        "url": "https://i.redd.it/t0q7erudykm01.jpg",
        "text": "",
        "created_utc": 1521404234,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's Corned Beef and Cabbage",
        "author": "arbarry85",
        "url": "https://imgur.com/UVWrRsc",
        "text": "",
        "created_utc": 1521389171,
        "upvote_ratio": ""
    },
    {
        "title": "Corned Beef and Cabbage",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/seriouseats/comments/85c21u/corned_beef_and_cabbage/",
        "text": "[deleted]",
        "created_utc": 1521388567,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji’s corned beef and cabbage for St. Paddy’s Day",
        "author": "EggMcFuckin",
        "url": "http://imgur.com/t6nAmxA",
        "text": "",
        "created_utc": 1521388455,
        "upvote_ratio": ""
    },
    {
        "title": "Avocado toast with chicken and egg",
        "author": "oneofwe",
        "url": "https://i.redd.it/4czmlf5jffm01.jpg",
        "text": "",
        "created_utc": 1521337364,
        "upvote_ratio": ""
    },
    {
        "title": "Ragú Napoletano",
        "author": "violicorn",
        "url": "https://i.redd.it/bf3a96myjdm01.jpg",
        "text": "",
        "created_utc": 1521314638,
        "upvote_ratio": ""
    },
    {
        "title": "\"This is the best pizza I've ever had.\" Foolproof pan pizza with pepperoni and mushrooms",
        "author": "liquid_fritz",
        "url": "https://i.redd.it/u5x22br4mbm01.jpg",
        "text": "",
        "created_utc": 1521291151,
        "upvote_ratio": ""
    },
    {
        "title": "\"This is the best pizza I've ever had. \" Fool Proof Pan Pizza",
        "author": "[deleted]",
        "url": "https://i.redd.it/70inri0tlbm01.jpg",
        "text": "[deleted]",
        "created_utc": 1521291041,
        "upvote_ratio": ""
    },
    {
        "title": "Kenji's cold fermented dough cooked on a 10mm thick steel",
        "author": "plodbax",
        "url": "https://imgur.com/7WJ5j0B",
        "text": "",
        "created_utc": 1521267252,
        "upvote_ratio": ""
    },
    {
        "title": "Not the greatest pic, but Kenji's tonkotsu broth was perfect for wisdom tooth extraction recovery",
        "author": "butaud",
        "url": "https://i.imgur.com/g7cOvhL.jpg",
        "text": "",
        "created_utc": 1521259945,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a serious eats idea of what to cook for a potluck that will wow some people.",
        "author": "Bigbadabooooom",
        "url": "https://www.reddit.com/r/seriouseats/comments/850mgn/looking_for_a_serious_eats_idea_of_what_to_cook/",
        "text": "",
        "created_utc": 1521251190,
        "upvote_ratio": ""
    },
    {
        "title": "I made my first recipes from The Food Lab tonight and it turned out alright...",
        "author": "Hyrum_Graff",
        "url": "https://www.reddit.com/r/seriouseats/comments/850e50/i_made_my_first_recipes_from_the_food_lab_tonight/",
        "text": "I made the chicken Marsala and the Risotto.  Problem is I’ve never made either recipe before and was terrible with timing.  It’s difficult to make one recipe you’ve never made and get the recipe right but I tried two.\n\nI read the recipes and prepped most everything upfront and tried to start stuff at the appropriate times but didn’t have them memorized.  I screwed up the sequence of adding ingredients and made a bunch of mistakes. \n\nBut... it turned out edible!  Not only was it edible, it was decent.  Just need more practice and getting the timing down.  With more practice everything will finish at the same time.  Don’t make 2 new recipes (especially Risotto) together...\n\nEven with adding stuff in the wrong order because forgot still turned out ok.  Thanks for such a great cookbook Kenji!  ",
        "created_utc": 1521248748,
        "upvote_ratio": ""
    },
    {
        "title": "I did it.....Vegan Pulled Pork",
        "author": "cgeezy93",
        "url": "https://www.youtube.com/watch?v=1VKoZXnxC8M",
        "text": "",
        "created_utc": 1521168753,
        "upvote_ratio": ""
    },
    {
        "title": "Beef Bulgogi",
        "author": "AlabamaAviator",
        "url": "https://i.redd.it/5eosu1ha81m01.jpg",
        "text": "",
        "created_utc": 1521165436,
        "upvote_ratio": ""
    },
    {
        "title": "A warning to those thinking of making Stella's brown butter and ricotta cookies..",
        "author": "monkeyman80",
        "url": "https://imgur.com/a/h4gzM",
        "text": "",
        "created_utc": 1521155079,
        "upvote_ratio": ""
    },
    {
        "title": "Sites with Serious Eats/Food Lab style content?",
        "author": "lazerblind",
        "url": "https://www.reddit.com/r/seriouseats/comments/84oxub/sites_with_serious_eatsfood_lab_style_content/",
        "text": "I miss Food Lab updates and the general dearth of new content on Serious Eats, the focus has seemed to shift more toward the podcasts and product reviews with affiliate links.\n\nI know Kenji has been busy with other projects but does anyone have any websites they can recommend that have a similar style as Serious Eats and particularly the Food Lab series?\n\nThanks.",
        "created_utc": 1521139924,
        "upvote_ratio": ""
    },
    {
        "title": "Coconut- and Aji Amarillo- Braised Chicken gets five stars at my house. Easy to make and great flavor. Will definitely be a regular dish for me.",
        "author": "mandisays",
        "url": "https://imgur.com/kT61jWc",
        "text": "",
        "created_utc": 1521135905,
        "upvote_ratio": ""
    },
    {
        "title": "The best series in Ramadan 2018 series hidden worlds",
        "author": "princehalem",
        "url": "https://www.taslyia.net/tag/%D9%85%D8%B3%D9%84%D8%B3%D9%84-%D8%B9%D9%88%D8%A7%D9%84%D9%85-%D8%AE%D9%81%D9%8A%D8%A9/",
        "text": "",
        "created_utc": 1521118169,
        "upvote_ratio": ""
    },
    {
        "title": "I made Shao Z’s Clay Pot Rice With Spicy Sausage and Mushrooms (and it’s really tasty)",
        "author": "vespertilio_rosso",
        "url": "https://i.redd.it/b428riwdutl01.jpg",
        "text": "",
        "created_utc": 1521076001,
        "upvote_ratio": ""
    },
    {
        "title": "I made D.Gritzer's osso buco for my birthday dinner. Best meal of 2018.",
        "author": "strangecanadian",
        "url": "https://i.redd.it/3xvldpjr7tl01.jpg",
        "text": "",
        "created_utc": 1521069467,
        "upvote_ratio": ""
    },
    {
        "title": "McDonald's style Apple Turnover from Bravetart",
        "author": "[deleted]",
        "url": "https://i.imgur.com/2DCclot.jpg",
        "text": "[deleted]",
        "created_utc": 1521056342,
        "upvote_ratio": ""
    },
    {
        "title": "Happy Pi day, r/seriouseats! (cross posted to r/baking)",
        "author": "raeaction",
        "url": "https://imgur.com/gallery/14deE",
        "text": "",
        "created_utc": 1521045785,
        "upvote_ratio": ""
    },
    {
        "title": "My first [spatch]cock - can’t wait to carve this bird up!",
        "author": "RudimentsOfGruel",
        "url": "https://i.imgur.com/GpnzKwB.jpg",
        "text": "",
        "created_utc": 1520976762,
        "upvote_ratio": ""
    },
    {
        "title": "Stella’s Brownies with Pasilla Chile",
        "author": "raaaaaandyb",
        "url": "https://i.redd.it/inpz2r9x7ll01.jpg",
        "text": "",
        "created_utc": 1520971592,
        "upvote_ratio": ""
    },
    {
        "title": "Made Daniel's Ropa Vieja with black beans and rice",
        "author": "Duffuser",
        "url": "https://i.redd.it/ldq4cdzzakl01.jpg",
        "text": "",
        "created_utc": 1520960527,
        "upvote_ratio": ""
    },
    {
        "title": "Going to make this Cordon Bleu, but with Mozza and Bacon and 18% cream, how should I modify the recipe?",
        "author": "[deleted]",
        "url": "https://www.seriouseats.com/recipes/2013/05/pork-tenderloin-cordon-bleu-recipe.html",
        "text": "[deleted]",
        "created_utc": 1520947612,
        "upvote_ratio": ""
    },
    {
        "title": "Some photos from Wursthall's opening night tonight.",
        "author": "[deleted]",
        "url": "https://imgur.com/a/tVhXD",
        "text": "",
        "created_utc": 1520915342,
        "upvote_ratio": ""
    },
    {
        "title": "Sous Vide Short Rib, Miso Mushroom Jus, Ricotta Gnocchi (from SE)",
        "author": "AlabamaAviator",
        "url": "https://i.redd.it/kz4chk5wtfl01.jpg",
        "text": "",
        "created_utc": 1520906391,
        "upvote_ratio": ""
    },
    {
        "title": "Halal cart chicken not the prettiest plating but one of he tastiest meals I’ve had in weeks",
        "author": "Bmxmp2613",
        "url": "https://i.redd.it/150zpne6mfl01.jpg",
        "text": "",
        "created_utc": 1520903748,
        "upvote_ratio": ""
    },
    {
        "title": "Who’s going to Wursthall tonight?!",
        "author": "richinsunnyhours",
        "url": "https://www.reddit.com/r/seriouseats/comments/83z0s9/whos_going_to_wursthall_tonight/",
        "text": "Hey Serious Eaters! Who is headed to Wursthall tonight? I live about 1.5 hours away and am fighting the urge to hop in my car right now. Unfortunately my first visit won’t be for a week or two. Anyone going to opening night? This should go without saying, but please report back on your experience! ",
        "created_utc": 1520892465,
        "upvote_ratio": ""
    }
]