[
    {
        "title": "Being irrelevant is a b…h",
        "author": "usurper31",
        "url": "https://www.reddit.com/r/socialskills/comments/1143z2b/being_irrelevant_is_a_bh/",
        "text": "What can I say? I have been irrelevant for whole my life. I tried to do my best, I tried to make happy my parents, I tried to be better then my older brother but at the end I got nothing. Literally nothing. A career which makes me regret, a relationship which has gone for four years and has castrated four potential good years of my life, loss of my old man when I was 18 yo etc. I have always thought that the pain would enlarge my perspective but this is not the case. Pain is only a source of philosophical and artistic source. You cannot get tougher by facing pain, you only get imprisoned in your comfort zone because of the pain and the moment you quit that comfort zone you realise that you are irrelevant. Ffs you got the point…",
        "created_utc": 1676588759,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25F) blew up my life during a depressive episode. Need advice on starting over &amp; regaining social skills.",
        "author": "ProjectorLocal3672",
        "url": "https://www.reddit.com/r/socialskills/comments/1143v57/i_25f_blew_up_my_life_during_a_depressive_episode/",
        "text": "TLDR: Anxious about making new friends and reaching out to old ones after being socially isolated and depressed/psychotic for 3 years.\n\nTitle is as reads. I don't want to give too much detail, but i unintentionally cut off all my friends, support system, &amp; friend group for the last 3 years and isolated myself from all my college friends and loved ones during a depressive/psychotic episode triggered by a car accident after I graduated in 2020. Since then, I moved to a new state 6 months ago and haven't made any new friends since. My 25th birthday just passed, i got little to no birthday messages. My Instagram was deleted and my other social media accounts including my online business have been dark since last year, as I am in a personal injury case awaiting settlement and just didn't have the energy to post or be online talking about my depression/the abysmal state of the world.\n\nI'm not coming here to ask for sympathy. I now understand the gravity of what I did and how it hurt others. I made the mistake of genuinely thinking nobody would care if I disappeared and while my personal life was on fire, time just flew. But, I'm ready to move forward. I don't have any friends who understand the intense fear/anxiety I have about reaching out to my old friends and apologizing for my erratic behavior during psychosis. Hell, I'm anxious about even being perceived online. I have a great boyfriend of 6 years, and he's been very supportive of my healing journey. But at this stage of my healing, I realize that I need friends outside of my relationship and cant put all the weight of my emotional safety on him. \n\nPrior to my trauma, I was a very social and outgoing person. Since being unemployed, losing weight due to depression, and just really coming to terms with myself after a CPTSD/BPD diagnosis, I get really anxious being in social situations, let alone responding to a text in under 1 hour.\n\nI have been working on reconnecting to old friends, but I struggle with navigating conversation skillfully and being my former bubbly self whilst being honest about where my life is right now (no job, physical therapy, cognitive rehab, cbt, dbt).. without sounding like I want sympathy or to be a charity case. I just picked up hobbies after having none for the last 2 years, so I know those are great talking points. but i dont want to come off as self centered only talking about myself.  I would appreciate all and any advice on how to go about\n\n\\-  regaining social skills to text and talk to strangers confidently. i have a housewarming party in my neighborhood that a mutual friend of another invited me to for this weekend. I'd love to make local friends without coming off as weird and scaring people off with baggage.\n\n\\- reconnecting with old friends as an adult woman. life has pretty much moved on without me, but i still care for them and just want them to know I'm sorry about what i did/how i left things off. I cut off my entire former dance team of at least 11 women. I know we wont be as close as we used to be, but I'm trying to reach out to 1 old friend a day and nurture existing friendships in ways that aren't just venting about sad life things. \n\n&amp;#x200B;\n\nIf you read this far, thank you. I truly appreciate all words of wisdom and encouragement including books, websites, and any resources in general.",
        "created_utc": 1676588492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strangers talking about/staring at me?",
        "author": "Quick_Apartment_836",
        "url": "https://www.reddit.com/r/socialskills/comments/1143sfs/strangers_talking_aboutstaring_at_me/",
        "text": "It’s been kinda driving me crazy lately. If I’m in public, especially at my university, people are constantly either staring or groups of strangers will talk about me?? I was sitting alone on my computer, wearing nothing special, minimal makeup, doing nothing out of the ordinary and a group of strangers at another table became preoccupied for over an hour with me. Discussing that I looked intimidating, encouraging each other to go talk to me, walking by and telling each other what homework problem I was on, and taking turns outright staring at me. Trying to avoid eye contact if I wasn’t looking at my computer I would avert my eyes to the hallway area, near the floor, where I could see an alarming about of people studying at my face, like I was a zoo animal. This sort of thing happens frequently and it’s making me avoid going to public places when I’m not in the mood to be observed. Does anyone have any idea why this is happening? I just don’t know if I’m missing something or how to deal with it",
        "created_utc": 1676588314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it disrespectful to not say “you’re welcome” after someone thanks you for something?",
        "author": "Connect_Wait_6759",
        "url": "https://www.reddit.com/r/socialskills/comments/1143q7d/is_it_disrespectful_to_not_say_youre_welcome/",
        "text": "Title. It feels awkward to me when someone doesn’t say “you’re welcome” back, because it feels like they didn’t genuinely want to do whatever you’re saying thank you for.",
        "created_utc": 1676588149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I self sabotage while making relationships",
        "author": "Own-Beginning9589",
        "url": "https://www.reddit.com/r/socialskills/comments/1143jz6/why_do_i_self_sabotage_while_making_relationships/",
        "text": "I work with this cute girl and idk how but we hit off really well. She always comes to me to talk about random shit. We start laughing plus we talk more outside work. I have always made a mistake of escalating a relationship faster, by like calling her to hang outside of work more and more. I don’t want to make the same mistake with her and take it too fast. But I worry if I am throwing my opportunity away. I feel like she is giving me a lot of signs and fuck idk what to do. I work with her, I don’t want to read her wrong and then make it awkward for both of us. She is new and I don’t want her to be uncomfortable if I want to take this relationship to the next level.",
        "created_utc": 1676587701,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't even socialize right when playing video games",
        "author": "Time_Apricot",
        "url": "https://www.reddit.com/r/socialskills/comments/11430j1/i_cant_even_socialize_right_when_playing_video/",
        "text": "Idk why this has been bothering me so much, but I wanted to talk about it here because I just wonder if anyone else relates. I always hear about people making friends online if they cant do it in real life, but I can't even do that. If anything I feel like I come across even weirder online. Theres this Minecraft server I enjoy playing on, the majority of people on there are in my age range. Everyone has their own groups on there though, I don't understand how they all know each other so well. I wonder if some of them are friends irl? I just don't know how to talk on there. I don't understand the etiquette of live chatting I guess. \n\nIf someone asks a general question like, whats your favorite color (just as an example), I answer but then regret it because I start wondering if they even intended me to answer. No one says anything back to me when I do. A couple of times I've awkwardly tried to join their conversations but no one responds back to me. I realized later that they probably thought it was weird because they didnt expect me just join in. Sometimes I ask questions and no one answers. Sometimes when they do, I feel like they think I'm dumb or annoying, just from the tone of their words.\n\nI've had some nice interactions on there too. But sometimes I log in and just feel dread because I feel like they must be thinking, oh god theres that weird player again. Even though I enjoy playing on there. I dont understand, should I just stop trying to interact with people on there? How do people even get to know people online or in video games?",
        "created_utc": 1676586353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know an app for acquiring social skills ?",
        "author": "Pyrenees_",
        "url": "https://www.reddit.com/r/socialskills/comments/1142xsj/do_you_know_an_app_for_acquiring_social_skills/",
        "text": "yeah",
        "created_utc": 1676586155,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to grow deeper friendships in a new city?",
        "author": "Fickle_Low_8266",
        "url": "https://www.reddit.com/r/socialskills/comments/1142re8/how_to_grow_deeper_friendships_in_a_new_city/",
        "text": "[removed]",
        "created_utc": 1676585707,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't connect with people",
        "author": "SadWin99",
        "url": "https://www.reddit.com/r/socialskills/comments/1142hhf/i_cant_connect_with_people/",
        "text": "I'm incredibly lonely, I try to go to events and things to meet people but I just can't connect with anyone, I can smile, make small talk and jokes but thats it I do not feel a connection to anyone, I don't really know what to do anymore I never had any close friends and I feel like I never will",
        "created_utc": 1676585019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be weird to tell my neighbor that I think he has sleep apnea?",
        "author": "Beansidhe0",
        "url": "https://www.reddit.com/r/socialskills/comments/1142agw/would_it_be_weird_to_tell_my_neighbor_that_i/",
        "text": "So the walls in my apartment building are very thin. I can hear nearly everything in the neighboring apartments. The neighbor on one side is a single man. I've never spoken to him other than saying \"Hey\" when we pass each other. He snores. Which is fine. Lots of people snore, but I hear him gasping for breath in his sleep, too, which does not sound healthy. I don't hear a CPAP, so he either knows and isn't being treated or doesn't know. I'm concerned about his health, but it also seems really weird to give unsolicited medical advice to someone I haven't spoken to very much.",
        "created_utc": 1676584542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the reason people stare and avoid me at university",
        "author": "FemmyWitch",
        "url": "https://www.reddit.com/r/socialskills/comments/1141h0f/am_i_the_reason_people_stare_and_avoid_me_at/",
        "text": "I'm currently at the end of my second year at university and I haven't been able to interact with any students at all other than my current roommate who I rarely speak to. I notice also people stare but I guess it is because I have some piercings (septum, earrings, cartilage, nostril ring). I also notice people literally avoid sitting near me. I thought I smelled and asked   took 5 showers a day and my roommate/people on my floor said I never smelled to begin with so I'm not sure what is happening. I thought about transferring  universities because even my cs professor noticed and doesn't know why. Idk is it just k look weird because south I'm not sure. I thought this year would be better because the first year my hair was purpleish because a friend from home didn't wanna have it done alone. I wish someone would just yell at me and tell me if I'm a freak or something so at least I know why people avoid me. I understand I don't look like the conventional CS student but I don't think that means you just avoid them right",
        "created_utc": 1676582510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always inclusive but almost never included",
        "author": "amokforpeace",
        "url": "https://www.reddit.com/r/socialskills/comments/1141cjd/always_inclusive_but_almost_never_included/",
        "text": "So frustrating, also, people never responding. Email invite to a group? No response, text to a group, no response? I get not always responding with a no, but damn it makes you feel invisible. Sometimes I restart my phone just hoping it was glitching.",
        "created_utc": 1676582213,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do at parties?",
        "author": "carrot_apl",
        "url": "https://www.reddit.com/r/socialskills/comments/11419es/what_do_i_do_at_parties/",
        "text": "For the first time in my life someone invited me (17m) to an event. What do you normally do at parties, what do I talk about (we are not friends, and don’t know eachother very well).\nPeople don’t normally associate with me so this is very strange to me why someone would want to hang out, and I am scared that this is only a Setup to mock me.\nIf it does turn it to be a real invite though:\nIs there anything I should avoid so I don’t seem weird or asocial?\nAnd how long do you usually stay at a party (it Beginns at 8pm)",
        "created_utc": 1676581992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being socially inept is getting in the way of my long-term goals and I can't see a way to change that given my track record and previous attempts to change.",
        "author": "thatsthewayitbe",
        "url": "https://www.reddit.com/r/socialskills/comments/11417p4/being_socially_inept_is_getting_in_the_way_of_my/",
        "text": "[removed]",
        "created_utc": 1676581874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being socially inept is getting in the way of my long-term goals and I can't see a way to change that given my track record and previous attempts to change.",
        "author": "thatsthewayitbe",
        "url": "https://www.reddit.com/r/socialskills/comments/11411qj/being_socially_inept_is_getting_in_the_way_of_my/",
        "text": "[removed]",
        "created_utc": 1676581464,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friendships keep getting worse",
        "author": "vilecreature8371",
        "url": "https://www.reddit.com/r/socialskills/comments/11410xu/my_friendships_keep_getting_worse/",
        "text": "I’m using made up names to make it more clear, I don’t know if it helps but whatever.\n\nOkay. So at the beginning of the school year (roughly in september) I was moved to a new school. Kids in my class were nice, and I eventually got into a friendgroup (friendgroup A), but then a 2-3 months later we sorta just… split apart? Like, my 3 favorite guys from the group just started somewhat disliking me (except for 1) and I fucking hate it. \n\nThen, few weeks later, I start talking to some chill dude (i’ll call him Tim) and start hanging out with his friends (friendgroup B). Everythings going fine, but then some piece of shit moron tells friendgroup B to not hang out with me alongside some bullshit rumor.\n\nAnd then, all of a sudden Tim just doesn’t really talk to me. I don’t know what to fucking do.\n\nThen something else happens. A somewhat popular kid starts talking to me, and his friends do so to. And some other girls as well. But i’m pretty introverted and don’t know what to do when they say hello or some shit. I’m scared that they won’t like me if I keep just saying like \"yo\" and then walking away like i’m in a hurry.\n\nJust some ranting, but now to my question. How do I get the people from any given friendgroup to like me again? I have nothing to live for. Not even friendship. No friendship has lasted longer than 3 months for me (on this new school). Anyways, please tell me how I can rejoin a friendgroup.",
        "created_utc": 1676581405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for feeling nervous when talking to new people",
        "author": "imboredaa",
        "url": "https://www.reddit.com/r/socialskills/comments/1140xag/any_tips_for_feeling_nervous_when_talking_to_new/",
        "text": "Hi guys m(22) last year of college (for now, I may go back for something else but currently unsure as I don’t overly like school) how do you recommend I overcome my nerves when talking to new people. I find when I talk to some people I have absolutely no problem striking up a conversation about anything. But there’s times where I’ll sit with my thoughts debating whether or not I should talk to someone. This happens sometimes during class, but mostly outside of class and just in public settings. What are some suggestions to help me be more relaxed before talking to someone new and just go for it?",
        "created_utc": 1676581151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone mind practicing calls?",
        "author": "Carefleew",
        "url": "https://www.reddit.com/r/socialskills/comments/1140vzq/anyone_mind_practicing_calls/",
        "text": "First of, I’m terrible on the phone. All comprehensibility is gone and into the nearby trash can. If anyone else struggles with this we can struggle together? No exchange of personal info required",
        "created_utc": 1676581055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to give the same gift/item to two people who are my friend?",
        "author": "XSpcwlker",
        "url": "https://www.reddit.com/r/socialskills/comments/1140tcz/is_it_wrong_to_give_the_same_giftitem_to_two/",
        "text": "Long story short, I will be seeing this one particular person after such a long time. I wanted to get her this one gift i found on etsy and I am super happy about the customization. However, I've forgotten that a similar gift was given to someone else.\n\nIts not ***EXACTLY*** the same. Same item but different quote kind of item and I really like this item and how the quote would look when I get it .\n\nThey dont even know they exist but I am worried that I am doing something wrong here. The item is pretty expensive because you need to customize it with quotes and the frame is an extra which I don't mind. I know the quote is different from the other item because this quote in particular focuses on each other and our time as friend. \n\nAm I overthinking this?",
        "created_utc": 1676580862,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being a doormat?",
        "author": "CB_Cold",
        "url": "https://www.reddit.com/r/socialskills/comments/1140bpu/how_do_i_stop_being_a_doormat/",
        "text": "I've made various posts relating to my dilemma for the past couple days, but now I've finally come to the reason my life's been shit. It's because I'm a complete b****. I was sure my wallet was stolen but I let myself and others convince me that my wallet was left at home or in the car because I wasn't aware enough to realize I had it until I got in class and someone stole it from me while I was laying at my desk asleep. I can't believe I let this go on for 2 days in fact. By now my wallet is most likely in the trash somewhere with my driver's license and my cash in someone else's pocket. I'm 18 years old and I have the confidence of a toddler. I can't believe I let this happen to me, but I've had enough of being a coward. Going to school tomorrow, I'll file a report to see if anyone can at least point me in the direction to the asshole who stole it while I was taking a nap, but I need to make sure I never let another incident like this happen again. I need to stop being such a pussy, and start taking back what's mine whenever someone tries to steal from me the second it gets taken.",
        "created_utc": 1676579603,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be confident.",
        "author": "KrispyKreamBoi",
        "url": "https://www.reddit.com/r/socialskills/comments/1140b1b/how_to_be_confident/",
        "text": "[removed]",
        "created_utc": 1676579553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does no one like me?",
        "author": "liam3317",
        "url": "https://www.reddit.com/r/socialskills/comments/11407t7/why_does_no_one_like_me/",
        "text": "[removed]",
        "created_utc": 1676579328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does no one like me?",
        "author": "liam3317",
        "url": "https://www.reddit.com/r/socialskills/comments/113zx2d/why_does_no_one_like_me/",
        "text": "[removed]",
        "created_utc": 1676578546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toxic friends or am I just the one in the wrong?",
        "author": "BigNamerYT",
        "url": "https://www.reddit.com/r/socialskills/comments/113zvae/toxic_friends_or_am_i_just_the_one_in_the_wrong/",
        "text": "[removed]",
        "created_utc": 1676578418,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex [27F] and I [30M] talk, but it’s very formal. Any advice on how to make things more friendly?",
        "author": "Controversy_CatYT",
        "url": "https://www.reddit.com/r/socialskills/comments/113zsyk/my_ex_27f_and_i_30m_talk_but_its_very_formal_any/",
        "text": "[removed]",
        "created_utc": 1676578243,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I best answer “what are your hobbies/interests or “what do you like to do for fun”?",
        "author": "_Dream_out_loud",
        "url": "https://www.reddit.com/r/socialskills/comments/113zqlb/how_do_i_best_answer_what_are_your/",
        "text": "I literally freak out every time and I struggle with what to say when I get asked about my hobbies anything similar (even tho I really shouldn’t), idk like it makes me feel super out of place and weird that I don’t really have anything substantial that I would consider as hobbies (anything of substance other than hanging out w friends, shopping, restaurant/bar hopping or anything generic). Literally everyone I meet says I’m “basic” or boring prolly bc of this and it doesn’t feel great to hear that. I used to have hobbies before but over the years I’ve been bullied a lot, went through a rough breakup and lost a sense of myself and knowing who I really am bc I kept trying to be like everyone else, and ik it’s bad and not having hobbies is a red flag 🚩 How do I fix this, ik it can’t happen overnight and takes work but where do I start?",
        "created_utc": 1676578076,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be confident.",
        "author": "KrispyKreamBoi",
        "url": "https://www.reddit.com/r/socialskills/comments/113zp2j/how_to_be_confident/",
        "text": "[removed]",
        "created_utc": 1676577963,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make friends out of acquaintances",
        "author": "CyberoX9000",
        "url": "https://www.reddit.com/r/socialskills/comments/113znaa/how_to_make_friends_out_of_acquaintances/",
        "text": "I know making friends with strangers could be a common topic but I'm wondering about how to make friends with people you already know.",
        "created_utc": 1676577836,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is it better to reflect on what I could have done differently vs accept the other person is a jerk?",
        "author": "NeoEcho747",
        "url": "https://www.reddit.com/r/socialskills/comments/113zgr9/when_is_it_better_to_reflect_on_what_i_could_have/",
        "text": "This might be an issue with enforcing personal boundaries.\n\nIf something goes wrong, I think of what I could have done differently to avoid it happening again. In a self improvement sense this is good. It is bad in the sense some people are assholes and that's got nothing to do with me.\n\nFor example my friend was mad at me but wouldn't tell me why. Is there a point thinking about it? In this specific case I could wait a while for her to cool down then ask again. OTOH maybe it means I should spend less time with her if she's going to be indirect.",
        "created_utc": 1676577383,
        "upvote_ratio": 1.0
    },
    {
        "title": "i got blocked for ghosting a friend for three months",
        "author": "averageboydestroyer",
        "url": "https://www.reddit.com/r/socialskills/comments/113zcy1/i_got_blocked_for_ghosting_a_friend_for_three/",
        "text": "sooo i (f17) was going through a lot the last months, leaving my abusive house and having to rely on myself while juggling my last year of pre medicine and dealing with recently diagnosed depression. i self isolated completely for 3 months, i only talked to one person but that's because i saw her at school. we didn't talk much on text. i didn't have the energy to be on my phone much and i posted a private story (which only had my close friends obv) explaining everything and saying ive disappeared cuz i was going through a lot, didn't have the energy for people, etc and my friends all saw my story so i assumed it was all good,,\n\nsomeone I've known since 2018/2019 blocked me a few days ago. i had said hi to her then noticed my text on whatsal hasn't been delivered for a few days so i texted her facebook to ask if she deleted her whatsapp. she opened it right away and ignored. an hour after i sent a follow up text and asked if im blocked and got ignored again. i sent her 2 paragraphs of apology and explained that i was going through a lot and that i ghosted everyone i know, and told her i never meant to hurt her. she ignored it and i assumed something was wrong on Facebook so i texted her instragram too, wrote another para and it's ignored.\n\ni might be wrong for saying this but im honestly hurt that she saw me going through what i did and never bothered to send a \"how are you\" or if i needed support. i didn't blame her, but i honestly expected her to at least understand, and she always reassured me she did anyway, she always said i don't owe anyone my time and that i can disappear whenever i want. when she was doing her last year of college, i also went months not hearing from her and i just understood that she was busy. i never once got upset, and now I'm kinda hurt someone I've known for so long just blocked me and isn't responding to my paragraphs\n\nam i in the wrong here?",
        "created_utc": 1676577094,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a toxic person",
        "author": "Acrobatic-Ad3012",
        "url": "https://www.reddit.com/r/socialskills/comments/113zblm/im_a_toxic_person/",
        "text": "Ever since I got out of a toxic relationship last year, which left me scarred, I have a hard time socializing with my friends, I'm very anxious all the time even thought they still look up to me for advice, I'm sort of the group leader, I always take the initiative for any sort of plans with them. Ever since a month I grew sort of tired of taking care of everyone but me, I isolated myself a bit, we still all talk through a WhatsApp group but I don't get out as often with them anymore, yesterday I wanted to talk to one of them privately and I sent him a meme, he took it very badly. Apparently he came to my house two weeks ago and told me he was feeling pretty down, that he even attempted suicide and despite me and other friend knowing I didn't give a shit. He also told me I have been making all sorts of jokes against him.\n\n I feel bad as I always have this burden of taking care of others and no one actually gives a damn if i need time, I can't remember anything about the conversation I had with him but I guess he did told me (that is very rare since I usually remember even the smallest of details, but I supposed \"isolation\" is making me not think as much of others) I'm tired of giving everyone time but me, yet I can't stop, I hate myself and is easy to help others I guess... The thing is, even though I do that i can be pretty mean at times, and it's hard for me to change, be more conscious of what I say before I say it",
        "created_utc": 1676576998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else have social issues when it comes to figures of authority?",
        "author": "Illusive_Owl",
        "url": "https://www.reddit.com/r/socialskills/comments/113z015/anyone_else_have_social_issues_when_it_comes_to/",
        "text": "Basically boss at work are having issues with my work performances and have had chats/confrontations towards me about it. I work a physically demanding job as a daytime floor stocker lifting stacks of boxes 9 feet tall, averaging about 30k steps a shift on my feet and basically am struggling to get all the incoming stock of the day all out of the boxes and stocked onto the salesfloor in a organized manner before my shifts end. It’s gotten to the point where I don’t really even speak or greet people at work because I feel like I have so much I have to get done. So the confrontation goes “you’re not finishing, what’s going on? What do you think you can do better? Is there anything I can do to help you meet expectations, because this ain’t it and you’re not meeting goals and it’s really embarrassing.” As well as them saying they don’t like my attitude as I’m silent all the time and they say I look too angry to the point where they asked “do you even want to be here?!” \n\nI usually just keep my eyes down and say “mhm yeah okay that’s valid yep” but I’m shaking, fake is turning red, and I’m holding back tears of frustration, and while I may have actual answers, I hold them back because I can’t express them without breaking down or going off my rocker causing me to lose my composure, so I feel I just become a hollow yes man and just agree even when I really don’t. And when confronted in the moment all my explanation or reasonings I have in my brain vanish completely in the moment. I feel I’m about to get fired because this is the third time I’ve had this kind of talk. If anyone has insights on what I could do I’d really appreciate it.",
        "created_utc": 1676576162,
        "upvote_ratio": 1.0
    },
    {
        "title": "this girl told me that she would not like to indulge in these relationship things during college too . what should i make of this?",
        "author": "ChungusSamaWalksIn",
        "url": "https://www.reddit.com/r/socialskills/comments/113y7uv/this_girl_told_me_that_she_would_not_like_to/",
        "text": "she has never indulged before too. She said she does not like these things. So what should I make of this, she seriously doesn't want to indulge or she just wants to clear me that if I am seeking a chance I should let my hopes down. no, I have not either asked her out before or at that moment, we were on our way home.",
        "created_utc": 1676574156,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m impossible to talk to",
        "author": "mechafrenchfry",
        "url": "https://www.reddit.com/r/socialskills/comments/113y7ks/im_impossible_to_talk_to/",
        "text": "I think I realized why some people find me impossible to talk to- I only ever want someone else to lead the conversation. If the conversation runs dry, I’ll bring up a new topic, try to set up a convo, but ultimately have no follow up and end up relying on the other person to carry it. \n\nObviously this poses two problems: 1. I’M introducing a topic for conversation, not the person which means that 2. When the other person doesn’t want to talk about that topic, the conversation dies because I have no follow up.\n\nI grew up abused and extremely neglected. I’ve been in therapy for a little over a year now. My therapist told me recently that even though I grew up with both parents, I ended up growing up with no support, comparing me to orphans. The reason I bring this up is because I know I have this internalized feeling that nothing I say is good enough to be listened to. \n\nI want to make friends. I want a support system. \n\nI’m hoping someone could provide some helpful advice on some smaller steps I can take during conversation to make it worthwhile not just for them, but for me as well. Something I can do or read to be more interesting? \n\nThank you for reading",
        "created_utc": 1676574136,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm trying to learn self respect, should I do this?",
        "author": "Final_Biochemist222",
        "url": "https://www.reddit.com/r/socialskills/comments/113y0qs/im_trying_to_learn_self_respect_should_i_do_this/",
        "text": "If not invited, don't go\n\nIf not told something others in a group are telling each other, don't ask\n\nIf they invite you late, then decline\n\nI always felt like I don't really have that much self-respect. I would have to be the one to approach people and ask what they're doing, where are they going etc. Sometimes I feel like they don't really like me, like I don't offer much value to the dynamic but they just tolerate me as a tagalong: I don't tell funny jokes, come up with fun things to do, not particularly good looking. If anything, I would consider to be that 'weird guy' who's somewhat adjusted through masking (I have ASD)\n\nI don't want to stand the disrespect of people treating me like a parasite and constantly having to chase after them. It's humiliating and emasculating. I'm completely fine on my own, but my problem is that it's not something really acceptable by society's standards.\n\nShould I push all of that aside and do things as mentioned?",
        "created_utc": 1676573670,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stay normal near girls?",
        "author": "Thin-Pound-8870",
        "url": "https://www.reddit.com/r/socialskills/comments/113xxnk/how_do_i_stay_normal_near_girls/",
        "text": "I am 20M and I feel like I act differently near girls and not in a good way. I am mostly nervous near them and frankly, I hate that.\n\nI literally have zero problems with hanging out with guys doesn't matter if I'm meeting them for the first time or not. But in case of girls, I get nervous, or shy or something... I don't really know. I just act not-normally.\n\nI wanna be able to talk to any girl normally and not have to think a million times before any action. I have almost no experience with women as you can probably guess which I think is part of the problem but I cannot just magically make that problem disappear. What should I do?",
        "created_utc": 1676573452,
        "upvote_ratio": 1.0
    },
    {
        "title": "GIRLS ARE HARD",
        "author": "ChungusSamaWalksIn",
        "url": "https://www.reddit.com/r/socialskills/comments/113xp8c/girls_are_hard/",
        "text": "I have been trying to get this girl , even as good friends. I teach her sometimes , i help her in tests and help her any way possible in college. I try to be fun and we even once travelled together to our home from college. Still i don't get why i don't feel like that we are good friends , idk where the problem is i think that most of my friends are not my friends but just acting or using me. I very rarely or almost never get this sense of eternal friendship , i am always worried that they will leave me the next moment they'll get a chance to. Today she talked to me like usual but she sat with this guy in the classroom and this got on my nerves and i can't stop thinking that she has already moved on or that's her she got who she wants to be friends with. That is also the reason i very rarely text my friends cuz i have this sense that may not like me and will get annoyed if i talk to them very much. I even believe that i will never get into a relationship with any girl i like because she will never like me.",
        "created_utc": 1676572869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling conflicted",
        "author": "No_Ranger_120",
        "url": "https://www.reddit.com/r/socialskills/comments/113x9iy/feeling_conflicted/",
        "text": "I feel like I have pretty good social skills overall and I’m definitely not socially awkward, but the one area I’m lacking in is keeping a conversation going. I feel so conflicted and confused though because I feel like if I actually had good social skills I wouldn’t have a problem with this, but at the same time, based on what people tell me and how they treat me, I don’t have bad social skills. Am I like some kind of fraud? What even am I? Can anyone relate? Haha this is making my brain hurt, I think I’m overanalyzing all this too much 😅",
        "created_utc": 1676571756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whi i can't be the same person i am with my brother when i am around friends",
        "author": "matty-y",
        "url": "https://www.reddit.com/r/socialskills/comments/113wuw3/whi_i_cant_be_the_same_person_i_am_with_my/",
        "text": "I'll explain better.I have almost no friends at school.I just speak to three people everyday in class and for the rest of my classmates i am so shy i can't open up.But when i am at home i am a whole different person.I have such a dominant personality and gold humor (mostly with my 2 year younger brother) that i feel like the cool kid you see everyday in school:confident,funny and cool.\n\nWhen i am in school is the exact opposite.It feels like i completely forget how my personality is and all my behaviours.I am just sitting there like a bean.Barely talking to the three people i usually talk to.I have a little bit more friends from other classroom wich i speak to but it's the same story.I just cannot use the dominant personality i have at home.When i talk with them i show almost no emotions and i don't seem an intersting person.\n\nNow let's begin with a more analitic part.Why this happens in my opinion.\n(1)I am unconfident:\nNot making dobuts about this because i am sure that i am uncofident around other people.I am just thinking if this could be a factor.Maybe i am scared of using my personality around people because i am scared they'll male fun of me?\n\n(2)When i am in school i think too much\nShould i speak to him/her?How could i approach someone today?Wich is a cool way i could walk?How can i get longer conversations with that guy?\nWhen i am with my brother i never think like this and i get good conversations and i have that strong personality i love about me.\n\n(3)I am impressed about seeing strong personalities like the mine when i am in school\nNot saying that my brother has a weak personality but for sure he is educated and acts more calmly and less crazy than me (don't know if i have explained well).When i am at school i see strong personalities like the mine in my classroom and i am not abituated by seeing strong personalities like the mine at home and i am unconfortable seeing that i am not at the center of the group.\n\n\n\n\n\nI am just thinking about how cool and amazing it would be to use the personality i use with my brother and family also with my friends and start opening up in class.I am almost sure that my personality would be one of the best in my friends group.....if i only knew how to use it outdoor.Does anyone went trought this.Why this happens?How can i use my home personality with my friends?",
        "created_utc": 1676570673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (20M) need some advice, but I’m not sure how to title this.",
        "author": "Thro-it-a-way",
        "url": "https://www.reddit.com/r/socialskills/comments/113wl4k/i_20m_need_some_advice_but_im_not_sure_how_to/",
        "text": "So, I’m a 20 year old guy with Asperger’s and social anxiety. I’ve spent my whole life trying to make close friends but ever since middle school haven’t really had any. Well, I have one who I just met a year ago, a co-worker, and we’re pretty close, but beyond that I don’t really have any. And I focused a lot on my loneliness and the fact I had no friends for a long time in high school and this past two years of college.\n\nBesides my co-worker, there’s kids in my classes I talk to and get along with, just like in high school, but I can’t call them friends because outside of class were not close enough to hang out.\n\nAnyways, I’ve decided instead of focusing on all of that to instead focus on bettering myself and becoming who I want to be. I’ve started lifting, running, eating healthier and eating more, focusing on academics, caring more about my personal hygiene/appearance, putting more effort and time into my mental health, and working harder in my work. Not for the sake of other people but for the sake of feeling better about myself, more confident and happy.\n\nOnly a week has passed since I first started all of this but I already feel better about myself and am happier. I just wish I had more opportunities in class to talk with people, because I love it, love making them laugh and smile, but outside of class I just can’t seem to do it, and I never have since middle school.\n\nAnd there’s this girl in my lab who is absolutely amazing, but again I can’t keep any sort of sparks alive. I’ve made her laugh, made her smile, and we talk but not as much as I’d like and not enough to get close. It’s this sort of thing that always happens, whether its with friends or with more than friends.\n\nNot really sure what I’m looking for but I’d appreciate whatever advice you think I need.",
        "created_utc": 1676569995,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the socially acceptable way to attempt to dance with someone at a concert or club?",
        "author": "Pure_Negotiation_452",
        "url": "https://www.reddit.com/r/socialskills/comments/113wb61/what_is_the_socially_acceptable_way_to_attempt_to/",
        "text": "So I'm someone who had a realization not too long ago ([https://www.reddit.com/r/socialskills/comments/108i4ab/how\\_do\\_you\\_reform\\_from\\_being\\_a\\_creep/](https://www.reddit.com/r/socialskills/comments/108i4ab/how_do_you_reform_from_being_a_creep/)) that I was going about meeting women in a creepy way, and wanted to reform.  So far, I feel like since this post I've been a lot better about it.  I've generally limited how much I talk to random women I don't know, but when I did decide to start convos, I kept to venues where I'll more likely find age-appropriate people and people might be more willing to chat (bookstores and coffee shops in the burbs rather than the streets of a university), got better at looking for signs someone doesn't want to talk me (ex: yesterday a cute girl sat at the table beside me at a coffee shop, but when I took my headphones off to maybe start a convo, I noticed she pretty quickly put her headphones on, so I took that as a sign of disinterest and put mine right back on and left her alone), and trained myself to not approach someone if I lingered too much (ngl, this one still gets me sometimes, it's hard to just work up the confidence in the spur of the moment, but I'm at least not doing stupid socially braindead like walking down the aisle they're on several times and making them think i'm stalking or following them).  I'm also slowly trying to incorporate starting convos (when the opportunity naturally presents itself) w/ random dudes/cashiers/etc... and doing kind things for strangers with no expectation of a return (ex: let this older women skip ahead of me in line at a grocery store because she had just one item.  \n\nSo while I feel like I'm making progress on learning how to socialize like a normal human being with all sorts of people, one area I'm struggling with is nightlife environments.  Concerts are probably my biggest passion in life, I go to lots of shows and festivals.  I don't go just to try to meet women or make friends, but I wouldn't hate it if it happened naturally, as these sorts of people likely share common interests with me.  Last night I was at a concert, mostly just minding my own business and having fun, and there was this girl that stood next to me.  We looked at each other a few times and moved a bit closer to each other and kinda started \"dancing\" together (moreso just bumping into each other, something in between dancing and moshing).  We did this for like three minutes, but at some point she just stopped and her energy mellowed out.  She later moved to the side of the crowd, seemingly to go meet up with a friend (unsure if maybe a boyfriend or just a friend).  So that's when my OCD (which I have a bit of a severe case of, am in therapy and on medication, but it still can takeover from time to time) started casting a lot of doubt on me.  My ocd started making me feel like a total creep for this interaction, making me doubt if she was even into the dancing that it felt like she was clearly participating in.  Made me wonder if she was creeped out by me and that's why she left... or if maybe she'd even try to go get security or her friend to confront me after the show.  Making me wonder if I had just inappropriately danced on a girl who had no interest, becoming a groper.  Essentially... the difficultly in reading non-verbal consent to dance in a crowded, loud, dark environment leads to my ocd just filling in the blanks and assuming the worst of myself anytime I try to make a move in an environment like this.\n\nSo moving forward, how do I manage myself in these situations?  If I could go back in time to last night and change how I acted, what would I do?  Do I just stand in the back when I go solo and not try to participate.  Do I just tap on her shoulders and ask for permission to dance with her in the middle of the song?  Do I just keep reading body language/context clues and try to do my best to not cross any boundaries?  Like last night I'd have loved to keep dancing with her, and honestly it feels to me like she just got bored of me because I didn't make a move beyond just bumping into her, but at the same time the doubt in the back of my head makes me feel like if I did try to do something further I'd be crossing a line and making some extremely uncomfortable.",
        "created_utc": 1676569263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uni student who feels like the people I thought were my friends are all against me",
        "author": "Sad-Amoeba4975",
        "url": "https://www.reddit.com/r/socialskills/comments/113w25l/uni_student_who_feels_like_the_people_i_thought/",
        "text": "[removed]",
        "created_utc": 1676568641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admired female figures?",
        "author": "Most_vvanted",
        "url": "https://www.reddit.com/r/socialskills/comments/113v8gk/admired_female_figures/",
        "text": "Which women do you look up to, in terms of self-confidence, way of thinking about life, success, etc.?",
        "created_utc": 1676566544,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the event I find someone who wants to talk to me, what do I even say?",
        "author": "no-thanks-kids",
        "url": "https://www.reddit.com/r/socialskills/comments/113uuib/in_the_event_i_find_someone_who_wants_to_talk_to/",
        "text": "I (24f) have a big problem with finding people to talk to. My routine consists of going to work and going home. I don't have anywhere else to go and spend time at. Everything I read says to go to the gym, go to a coffee shop, go to a festival, download a meet up app, but none of this has worked. \n\nPeople at the gym and coffee shops don't go there to talk to each other. My town doesn't do festivals or anything like that. I've downloaded meet up apps but every time I try to talk to someone they never respond. I even had this problem in school. Just because I was in the same room as these people all the time doesn't mean I get to talk to them or that they want to talk to me.\n\nHow do you just start talking to a stranger out of the blue without coming across as a freak?",
        "created_utc": 1676565532,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the right way to approach a guy who is always surrounded by a group of friends?",
        "author": "Nervous_Wreck360",
        "url": "https://www.reddit.com/r/socialskills/comments/113utv4/what_is_the_right_way_to_approach_a_guy_who_is/",
        "text": "I want to get past the waving while walking by point, but I feel like it’s rude to interrupt a conversation (isn’t it?)",
        "created_utc": 1676565488,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does different colored heart emojis mean?",
        "author": "Thatbasic",
        "url": "https://www.reddit.com/r/socialskills/comments/113unkf/what_does_different_colored_heart_emojis_mean/",
        "text": "For context : I invited a girl to watch a movie. She declines but in the reply she sent \" ahehe thanks don't spoil me tenchuu 🤍 \" \n\nI think there are a lot of meanings for different heart emojis. Does anyone know any of them?",
        "created_utc": 1676565054,
        "upvote_ratio": 1.0
    },
    {
        "title": "why was this recommended for me",
        "author": "Southern-Ad-124",
        "url": "https://www.reddit.com/r/socialskills/comments/113ufvw/why_was_this_recommended_for_me/",
        "text": "Reddit must got somethin to say because why would it recommend that I need this group?",
        "created_utc": 1676564504,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get over toxic interaction?",
        "author": "LearningGnome",
        "url": "https://www.reddit.com/r/socialskills/comments/113ufn7/how_do_i_get_over_toxic_interaction/",
        "text": "I recently became a supervisor at work. I have a very small staff of 5 people. Most of them are reasonable but one is very hostile and passive aggressive. Every time I bring up reminders to staff this person will instantly reflect whatever it is back onto me and some how make it my fault that this occurred in the first place. I know I can't let it get to me, and I'm not going to give this person special treatment for my own comfort to avoid their toxic behavior. So, I am looking for advice to not let the things they say bother me and just move on (always easier said than done).",
        "created_utc": 1676564488,
        "upvote_ratio": 1.0
    },
    {
        "title": "No speech filter yet overthinks",
        "author": "neckpain0",
        "url": "https://www.reddit.com/r/socialskills/comments/113u9as/no_speech_filter_yet_overthinks/",
        "text": "Normally when someone overthinks a lot on what they have to say they will say the appropriate thing. But for some reason sometimes its a little weird for me, sometimes i overthink a lot on what i have to say, yet i ended up saying the most outrageous thing. It's almost a part of my brain want people to see me as a dumb person. Most of the time i feel hilarious right after i said it, but immediately regret it after knowing i just make everyone uncomfortable.",
        "created_utc": 1676564035,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Story Of Confidence And Assertiveness: 7 Through 16 Years Old",
        "author": "Glittering_Bonus_321",
        "url": "https://www.reddit.com/r/socialskills/comments/113txd4/a_story_of_confidence_and_assertiveness_7_through/",
        "text": "Hey everyone.   \nI'm here to share a story of someone that I know. And why I have chosen to do this is because I have never seen a person quite like this girl.\n\nYou see, 9 years ago, when she was just 7, and probably weighed 30 kg max - I approached her. I had noticed that she was a very confident kid. One time I asked her if she wanted to be friends. Her response was: \"No.\" And she walked away.\n\nWhile that was rude, I wasn't bothered. She, however, had a very, very, very confident personality and everybody wanted to be around her, as all the other kids her age were just dumb, playful, immature kids. Obviously they wanted to follow her around as they saw her a leader.\n\nAt 16 years old, 9 years later, we met again.\n\nI will not say the circumstances that led to our meeting, but it was unpleasant. However, observing her behaviour I saw the same thing: her being confident, getting everybody to do what she wanted, everyone gladly following her footsteps and wanting to be her friend.\n\nAnd this made me notice, or realize, one thin. It's that 7 year old kid's personality isn't gonna change when the kid grows up. Sure, it can be altered and molded through age and experience. But most people's personalities are the exact same as from when they were 7.",
        "created_utc": 1676563207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poor social skills because I never left home.",
        "author": "FeelMyBagel",
        "url": "https://www.reddit.com/r/socialskills/comments/113tv4p/poor_social_skills_because_i_never_left_home/",
        "text": "[removed]",
        "created_utc": 1676563044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel fake when I talk to people?",
        "author": "pizzapixel05",
        "url": "https://www.reddit.com/r/socialskills/comments/113tv13/why_do_i_feel_fake_when_i_talk_to_people/",
        "text": "Whenever I talk to people I’m not very close with, I just feel so fake and bland. It’s like I’m physically unable to be myself. I think I have a hard time “being myself” because “myself” isn’t really the type of person that would be outgoing and talk to people, let alone enjoy it. Any advice would be greatly appreciated.",
        "created_utc": 1676563036,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is it so scary asking my friends to hang out?",
        "author": "_mrs_gil",
        "url": "https://www.reddit.com/r/socialskills/comments/113ttln/why_is_it_so_scary_asking_my_friends_to_hang_out/",
        "text": "~~like~~ it doesn't matter if i've known them for a few months or 10 years i STILL get really nervous texting them and asking them to hang out. it's not like i'm forcing myself to do it i genuinely do want to hang out with them it's just the asking part that's really difficult for me. any tips on how to overcome this fear?",
        "created_utc": 1676562931,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any introverted jobs that don't require talking in a corporate world?",
        "author": "PlaneAnxiety9815",
        "url": "https://www.reddit.com/r/socialskills/comments/113tl8w/are_there_any_introverted_jobs_that_dont_require/",
        "text": "M, 25, left my previous job to pursue what I have graduated (Marketing) because my head flows with great ideas sometimes, unfortunately things are not going to fall in  line, I decided to find jobs suited for me. I'm introvert, however, I can and will do the job around other people as long as they don't disturb me with nonsense but I can and will join the mood if I can.\nIn a world like being extrovert is more preferred how an Introvert survive?\n\nI don't have IT skills, that's why I can't do remote jobs.",
        "created_utc": 1676562315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breakup Text Help",
        "author": "Intelligent-Meet3603",
        "url": "https://www.reddit.com/r/socialskills/comments/113ti31/breakup_text_help/",
        "text": "[removed]",
        "created_utc": 1676562080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idk what title",
        "author": "HYH2709",
        "url": "https://www.reddit.com/r/socialskills/comments/113t3li/idk_what_title/",
        "text": "I saw this on Quora\n\nDo you:\n\nobsess over and talk about someone who doesn’t even care/know you exist?\n\nDo you occupy your time with drama?\n\nDo you do anything to get attention? Especially if it degrading or embarrassing yourself?\n\nDo you not work on yourself?\n\nDo you not go away when you are asked to or do you hang around a person who don’t want you there?\n\nDo you pull stunts and say things you don’t understand or care about to fit it?\n\nDo you copy and follow whatever everyone else is doing?\n\nDo you have no identity besides a group identity?\n\nDo you make up stuff about other people because you think they are better than you?\n\nAre you jealous?\n\nDo you like to ruin other people’s lives to make yourself feel better about your own?\n\nAre you hobby-less and/or talentless?\n\nDo you not have dignity (huge one)?\n\nDo you need to see other people down to feel up?\n\nDo you hang out with or associate closely with losers?\n\nDo you pretend to be unique when your not and actually you think and act like everyone else?\n\nDo you feel the need to prove yourself to other random people?\n\nDo you get offended easily?\n\nDo you take care of yourself?\n\nDo you have all criteria of narcissistic personality disorder?\n\nBe Honest.\n\nIf yes to a large amount of these then you are a loser.\n\nI said yes to all of these and I want to fix it, but I want to know the root cause to why I do these stuff.\n\nAny help is appreciated.",
        "created_utc": 1676561018,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Need Tips And Tricks To Find A Life Partner",
        "author": "goldcrusty",
        "url": "https://www.reddit.com/r/socialskills/comments/113sdh6/i_need_tips_and_tricks_to_find_a_life_partner/",
        "text": "Hello Everyone, A year ago, I wrote a post titled:  \n\n\n\"Is It Okay To Give Up On Trying To Make Friends?\"  \n \n\nA lot has happened since then, and I finally reached a social level that even I don't believe! I can make friends and enjoy social conversations. I even communicate with at least five strangers a day!\n\n   But now, finally, I feel like a bigger challenge has emerged! The one I have been dreaming about since I was a little kid That is finding the person you want to spend your life with. But where do you even start? Does it happen naturally? Is there anything that I can do that gives me a better chance than normal? \n\n   Even the internet is torn on this subject, so I am confused. Some even don't believe there is love. But I want to believe I can find that girl; I know she is out there and it is only a matter of time, but I need some tips to speed up the process!  \n \n\nTL:DR I know my love is out there, but how can I find her? Any tips?",
        "created_utc": 1676559071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your social skills are probably fine, but you're never in the mood to socialize so you have no idea.",
        "author": "Professional_Ear1507",
        "url": "https://www.reddit.com/r/socialskills/comments/113sbyt/your_social_skills_are_probably_fine_but_youre/",
        "text": "This could possibly be something a lot of us with \"bad social skills\" face, and I wanted to address this because this may give you guys hope.\n\nI always consider myself to be someone with bad social skills. Super awkward at times, not knowing what to say or how to accept a compliment and definitely awkward silences while conversing with me. This in turn led me to not have many friends. However, on the flip side I alway noticed something else...\n\nI rarely actually WANT to social and be social. Usually doing the bare minimum to get by in any social interaction. Which once again leads me to having little to no friends. But this week I realized that being good at socializing is directly tied to wanting to socialize.\n\nThursday and Friday of last week I was in the mood to socialize ( which only happens a few times a month honestly ) it's honestly a night and day difference. I work in retail so talking to customers is pretty common, but because I DON'T want to socialize I'm a lazy ass conversationalist. Very boring and bland with no personality or any effort shown, but when I actually WANT to social I'm a fucking social monster. I mean I'm telling ACTUALLY funny jokes, witty comments, a very bright and vibrant personality and a good ass mood and vibes to boot. I also have HIGH confidence when talking and say things I normally wouldn't due to fear of being judged.\n\nLast week, I was feeling so social that me and couple had such a good conversation at my job that they both added me on Facebook and invited me to hang out this Thursday ( Tonight) and meet their friend group. BOOM! I instantly got new friends. Then the next day I asked a girl I've been crushing on for her number and she gave it to me! Neither one of these things would've happend if I didn't feel like socializing. Normally I have so much social anxiety, but whenever I'm in the mood to socialize there's just no stopping me. I'm charismatic and friendly, but I feel like a different person because this RARELY happens. ( I'm talking like 3-4 times a month). I can carry a conversation amazingly and I have no fear.\n\nMaybe I'm doing something that makes me act this way? I don't drink or do drugs and my lifestyle has been the same for years, so I'm not sure why that happens but it does! Just something to think about, guys. Maybe you do have it in you but you're just never in the mood. How to get into this mood every day?",
        "created_utc": 1676558958,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know what to say anymore",
        "author": "Hugginghost",
        "url": "https://www.reddit.com/r/socialskills/comments/113sbkm/i_dont_know_what_to_say_anymore/",
        "text": "I feel like all of my classmates are quick-witted and funny, meanwhile I'm not able to say anything clever back. I mostly just be faintly amused at whatever ridicoulous thing that's happening and people don't really notice I'm there. Even in regular conversations I can't think of anything interesting to say and just answer their questions with yes or no. How do I be more interesting?",
        "created_utc": 1676558925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coworker power-playing me",
        "author": "These-Ad2374",
        "url": "https://www.reddit.com/r/socialskills/comments/113sb6h/coworker_powerplaying_me/",
        "text": "[removed]",
        "created_utc": 1676558894,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make conversation with someone who I don’t have much in common with?",
        "author": "llamaperson8",
        "url": "https://www.reddit.com/r/socialskills/comments/113s88i/how_do_i_make_conversation_with_someone_who_i/",
        "text": "[removed]",
        "created_utc": 1676558671,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am outgoing but i get shy talking to attractive guys",
        "author": "poemsdoll",
        "url": "https://www.reddit.com/r/socialskills/comments/113s3nd/i_am_outgoing_but_i_get_shy_talking_to_attractive/",
        "text": "[removed]",
        "created_utc": 1676558326,
        "upvote_ratio": 1.0
    },
    {
        "title": "How/When to Speak Up for Yourself",
        "author": "HaileyQuinnzel",
        "url": "https://www.reddit.com/r/socialskills/comments/113rxx6/howwhen_to_speak_up_for_yourself/",
        "text": "23F. I have this internal feeling that nothing I say matters to anyone, they only care about being heard. All my life, I’ve been told that when I ask questions it’s too much, and when I have an opinion it never matters because people argue with me, and nothing useful comes out of the interaction. I’m just very used to being shut down all the time. This is apparent when dealing with rude managers &amp; peers. Instead of speaking up, I just ignore it, but foster resentment because they can’t seem to realize (or don’t care) about how they’re acting.\n\nFor example, I worked the wrong pants to work (they were too casual, but for some reason my other coworkers can all wear t-shirts) &amp; my manager said I’m acting/dressing like I don’t want to be there. I thought it was very rude of her to try &amp; read my mind, and insinuate my wanting to work based on a uniform mistake, despite my diligence while working. However, of course I didn’t because no one cares about what’s fair or polite/right, they only care about making their point. With my peers, a friend invited people to an outing that was just planned for us without telling me. I didn’t say anything cause it was at the last second, &amp; just resigned to not going out with her again.\n\nSo, when do I speak up? I can’t command respect &amp; people in my life are always rude or unfair to me. I’m really sick of it &amp; wish I could speak up better, I just don’t know when or how.",
        "created_utc": 1676557882,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a outgoing person but I get shy talking to guys",
        "author": "poemsdoll",
        "url": "https://www.reddit.com/r/socialskills/comments/113rjmy/i_am_a_outgoing_person_but_i_get_shy_talking_to/",
        "text": "[removed]",
        "created_utc": 1676556765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Huge workaholic as friend?",
        "author": "DarkFite",
        "url": "https://www.reddit.com/r/socialskills/comments/113ri4z/huge_workaholic_as_friend/",
        "text": "I have a friend who really doesn't have time for anything for a year. Every month she is in two film projects or traveling or doing a customer order. As soon as she gets back from a 6 month trip she is back in a film project. She doesn't take time for herself or her friends. I asked her yesterday if she would like to join an activity that she would definitely like to be a part of but she ignored the message read and did not respond. This is nothing new with her and she is very unreliable when it comes to doing things with friends or making time for them. Even for her boyfriend she takes relatively little time and he is frustrated that she is never at home. Only from time to time she appears at parties because they are in the evening. How do you deal with such people? Would you address this even if it has already been talked about?",
        "created_utc": 1676556646,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you tell if someone is either shy or just don’t wanna talk to you?",
        "author": "catmaidsama",
        "url": "https://www.reddit.com/r/socialskills/comments/113r11q/how_can_you_tell_if_someone_is_either_shy_or_just/",
        "text": "As the title states. I’d like to start making conversation with people in my lecture classes or labs, but I’m not sure whether the other is shy about the new interaction or if they’re just not in the mood and are polite by giving short responses. I ask because I’m an extremely shy person, but whenever someone would make conversation with me I do enjoy it.",
        "created_utc": 1676555306,
        "upvote_ratio": 1.0
    },
    {
        "title": "not sure how to ask the question",
        "author": "PaddyPowerless",
        "url": "https://www.reddit.com/r/socialskills/comments/113qyr5/not_sure_how_to_ask_the_question/",
        "text": "[removed]",
        "created_utc": 1676555117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking a girl out",
        "author": "PaddyPowerless",
        "url": "https://www.reddit.com/r/socialskills/comments/113qxqq/asking_a_girl_out/",
        "text": "[removed]",
        "created_utc": 1676555035,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (16M) stop getting this weird feeling every time I befriend a girl?",
        "author": "aidamReddit",
        "url": "https://www.reddit.com/r/socialskills/comments/113qtqw/how_do_i_16m_stop_getting_this_weird_feeling/",
        "text": "I have been in a boys only boarding school for almost 5 years now and I havent had an actual conversation with a girl in that duration until a few weeks ago where I started going to after school tuition.\n\nNow thankfully I'm not having any trouble talking with girls, in fact I've actually managed to get some girl friends. But a problem I'm facing is that I get this weird feeling of excitement/crushing?? every time I talk to / befriend girls. Please help me get rid of this feeling as it makes me extremely confused on whether I actually like someone or I just want to be friends.",
        "created_utc": 1676554700,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (16M) stop \"crushing??\" on every girl I talk to?",
        "author": "aidamReddit",
        "url": "https://www.reddit.com/r/socialskills/comments/113qaej/how_do_i_16m_stop_crushing_on_every_girl_i_talk_to/",
        "text": "[removed]",
        "created_utc": 1676553067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Digital communications consumes all my mental energy and my social relations suffer as a result, because I'm too tired and just want everyone to leave me alone. I'm stuck.",
        "author": "Douchebak",
        "url": "https://www.reddit.com/r/socialskills/comments/113q5ow/digital_communications_consumes_all_my_mental/",
        "text": "I give up, it’s a white flag from me. The pandemic has accelerated the shift to everything digital. As a result, sheer number of communications reaching me has increased 10 times. \n\nI’m an introvert. Yet I like and need people, socializing and quality relationships. But my capacity for interruptions, messages, email, phone calls is limited. At some point during second half of my day, I just need to cut it all off, including people I care for, not to lose my sanity. I reach my capacity sooner than most people. Often I cut off before people start their evening activity: talking to other people, exchanging memes, arranging meetings, etc. By that time, I am often silent and disengaged because I am not able to handle it anymore. I do miss out on social occasions, but I don’t mind, mostly. \n\nOn the contrary, there is no fatigue when it comes to human-to-human interactions. I genuinely enjoy it. I’ve been reading and thinking, trying to understand. I think digital comms and notifications stream is unnatural. For example: imagine you are in an open office, co-workers around. Some talk on the phones, some talk to each other, some talk to you directly, some don’t notice you. In real environment brain effortlessly filters all of this and focuses on the most important.  \n\nIn digital environment it’s completely different. Imagine all office people being silent, but everyone, one by one, coming right up to you, tapping you on the shoulder (the notification), indicating that there is a piece of info you might want to know about. You open it, and oh, it’s a meaningless conversation about someone’s cat from far end corner of the office. Open another one – some irrelevant stuff. Open third one – oh, this one is somewhat relevant. Hit or miss. \n\nOn the digital surface, everything is equally important. I am constantly busy filtering the incoming shit and get little focused stuff done. Unfortunately, I am not able to turn everything off. I work mostly online, and communications is important part of my job. Keeping track of information is crucial, as there is key information buried in all the noise. It may be less than 5%, but I cannot afford to miss it – it’s a key part of the job. This creates serious anxiety on my part, monitoring all the noise, stressed out not to miss that key info once in a while, and expanding nearly all of my mental energy in the process, to the point that later in the day I am not able to handle ANY more communications, including my loved ones. Every single new message stresses me out and feels like an uncompleted to-do item. In the end, I come out as non-social person and looking like I don’t care for other people. But I do. I just don’t have the energy left. \n\nUnfortunately, I am not in position to change digital communications culture in my job environment to make it more efficient.  Also, due to my real life financial obligations, changing my job to a calmer one is not an option, as I already struggle financially.   \n\n\nI am stuck. I’m aware that this is not going away, and most things are beyond my control. I’m doing what I can to cope. Mostly – maximizing my mental battery capacity. Eating and sleeping well, going for walks when I can, planning ahead and preparing, and so on and so on. But my mental bandwidth is something I cannot expand.   \n\n\nI might need a fresh set of eyes, an outsider’s look. I’m for sure not the only one facing such conundrum. Any thoughts on this would be much appreciated!",
        "created_utc": 1676552671,
        "upvote_ratio": 1.0
    },
    {
        "title": "In my work place i talk to one person, always with me starting first conversation since from 2022 June until 2022 December.",
        "author": "Okaydog97",
        "url": "https://www.reddit.com/r/socialskills/comments/113q3jd/in_my_work_place_i_talk_to_one_person_always_with/",
        "text": "But the person now works part time now and last time I seen him work was in December 2022.\n\nI see him work again last week and i didn't speak to him first, since it's me always talk to him first.\nNo conversation between us last week.\n\nYesterday same thing happened, the worker again yesterday didn't said a word to me first.\n\nI am fine with the this co worker don't talk to me first.\n\nBut why are some people like that or it's just a warehouse job thing.",
        "created_utc": 1676552502,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with people taking pictures in the changing room in a polite, assertive manner?",
        "author": "octopusvenom",
        "url": "https://www.reddit.com/r/socialskills/comments/113q2qk/how_to_deal_with_people_taking_pictures_in_the/",
        "text": "I'm seeing more and more people taking selfies in the gym's changing room. This annoys me to no end. I mean, is this even legal? Some of these selfies end up online and the background consists of people (un)dressing. Today I complained to the gym's receptionist and she didn't seem to care much (which, ok, I understand, it's not her job to educate people), but I'm afraid of confronting strangers and this seems to be an issue most people don't care about - especially in this day and age when everyone is obsessed with pics. I don't get it. Advice?",
        "created_utc": 1676552444,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make friends in meetup events",
        "author": "MilkyWayDot",
        "url": "https://www.reddit.com/r/socialskills/comments/113pvaw/how_to_make_friends_in_meetup_events/",
        "text": "I've forcing myself to go to meetup groups after ages of isolation, and I've been to a couple of them. But it's always talking abd talking and then leaving. These events don't happen that often where I live. How can I make friends after talking to them during the events?",
        "created_utc": 1676551798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making friends is hard",
        "author": "muffinhater69",
        "url": "https://www.reddit.com/r/socialskills/comments/113pmx9/making_friends_is_hard/",
        "text": "I’m (16F, junior in high school) slowly realizing I’m the “that one person who follows you around and thinks they’re in the friend group” person I see people talking about on TikTok. I don’t have a lot of friends; I have depression which makes it hard for me to make them. I try to be kind to my classmates- I always say hi to them, I compliment them, I offer to help them with their work, if they don’t have a place to sit I offer for them to sit with me, etc.- and at first I figured we weren’t clicking well because most of them come from wealthier backgrounds than me. However, I’ve come to realize I think they all think I’m just annoying. They invited everyone in our math class but me to a group chat for a reason after all.\n\nI’m not sure how to deal with it. Maybe the tiktoks I’ve seen from people talking about “the weird kid who tries to be friends with you” have made me paranoid, but I’m in a bind. How am I weird for not having friends yet when I try to make them everyone treats me like the plague? Everyone fell into a bunch of friend groups when we were in elementary school and now it’s impossible to break in. They all spend their afternoons on half days and weekends having fun while I sit at home doing work. I never get invited to anything, when I try to join conversations everyone gets annoyed, kids literally laugh and glare at me for answering questions in my classes when no one else will. I’m not sure what to do.",
        "created_utc": 1676551038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can AI help us become better at social skills?",
        "author": "Flag_Red",
        "url": "https://www.reddit.com/r/socialskills/comments/113pmsr/can_ai_help_us_become_better_at_social_skills/",
        "text": "I'm pretty awful at conversations. I have social anxiety, and come off as simultaneously aloof and blunt to most people. In particular, I have a very hard time keeping up my end of a conversation. I tend to either say too much, or too little.\n\nI'm also an AI engineer, and have been working on an AI chatbot that's friendly and nonjudgemental, in the hopes that it can help me (and others like me) practice social skills.\n\nThe AI is still very much a work in progress, but I was wondering if anyone else here has thoughts on using AI to practice social skills? Do you think it would be helpful? Or do you think it would be a crutch that would ultimately make things worse? I'm trying to get the personality and responses right to encourage people to share and practice being vulnerable, but having very little idea of how good conversations normally go makes that hard lol.",
        "created_utc": 1676551026,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Manager told me that I talk too much, How do I socialize in a career hospital setting?",
        "author": "weighingthelife",
        "url": "https://www.reddit.com/r/socialskills/comments/113p7oc/my_manager_told_me_that_i_talk_too_much_how_do_i/",
        "text": "So I am in a CMA internship with the hope of using the company to pay for my imaging studies degree. I really wanted to come in and WOW them but so far, that hasn't happened. I pick up everything very quickly, that isn't the problem. The problem is socialization. I really like my coworkers and I try to match their tone and subject topic. I feel they tolerate me. I know coworkers aren't my friends. They are very polite and kind. They have all worked together for years so I really do feel like a new character on season 5 of a show. \n\n My manager told me last performance review that I was talking too much, and it was affecting work, and that I needed to work on filter with the clients, apparently I told someone during a A1C check they had big hands. The thing about being an intern is that I have an internship profile so I can't do the day to day work things like send off controlled meds for doctor approval, answer phones, send messages, ect. They want me doing only clinical things but unless someone needs a test run/ I'm rooming someone/ I'm giving a shot/preparing a shot/ or A1C then I am just sitting there looking over my notes. We are talking literal hours of re-reading the same notes. I was previously in kitchen work where there is ALWAYS something to do. I imagine it is an environment mismatch. \n\nI had always suspected I had ADHD and was diagnosed as a child but stopped taking the medicine as a pre-teen. This performance review was the kick in the butt I needed to get diagnosed. I am on Adderall now. I am much more focused. I started speaking a lot less. I figured well great! I am doing better. It seemed like my coworkers were being more cordial to me. I just got done with phlebotomy training (2 days, so I can do it in a pinch but absolutely not a master and need more training).\n\nI recently had another performance review and I was told that maybe being a CMA wasn't for me. My manager was really kind. She said that I made too many conversations with the patients when I was rooming them and not everyone wanted my life story.  I asked if I had any more complaints and she said no, that the patients seemed to really like me. So I don't know what to do with this information. I was a little bummed because I thought that I was just being friendly. When my Mom had cancer it always made her feel better to be greeted cheerily and have a small chat. I asked if my rooming time was too long and she said that my rooming time was average and didn't need any speeding up. She said that I still have 3 months in the internship but she was considering seeing if I can be transferred as a full employee over to phlebotomy. \n\nI really like phlebotomy and being a full employee means a pay raise and I would get more training to where blood draws would be second nature. I can't help but feel a little bummed. I thought I was doing so much better. My second plan was to become a travel CMA so my self confidence has been mildly affected. She said that I was very smart and that the company does not want to lose me but maybe being a CMA just isn't for me. I feel pretty petty. I think maybe I just won't talk unless spoken to and I will just say hello to patients and get straight down to business. Forget about asking about how their day is going. The funny thing is that I know once I do this everyone would like me more in the office. I genuinely don't know how much quieter I can get and why do my coworkers get to talk about how their days are going but I can't? \n\nI am polite, I am not rude, and I keep on light subjects. I am a little baffled because I thought CMA would be perfect for me. Any advice about what to do? I am seriously just about to stop talking all together since it seems not skill, not intelligence, but socialization is what I need to work on and I don't know what to say or where to go. I seriously thought I was improving so much. Thank you!",
        "created_utc": 1676549648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problems with friend group.",
        "author": "Kiwibread0781",
        "url": "https://www.reddit.com/r/socialskills/comments/113p651/problems_with_friend_group/",
        "text": "So I have a friend group and we usually walk together during recess, they usually walk with pair, and I usually walk alone behind the group. And I've been having problem with my feelings when I'm being shoved behind by people around me in crowded places.\n\nEverytime this happends I felt my heart sinks, this had happend multiple times and it made me think that I'm not as important as they don't turn back or wait for me. Maybe I'm just being an overthinking person, I'm the kind of person who prefer to walk with one or two friends. Because whenever I'm in a friend group I felt like everyone ignores me or prefer to talk to other people than me.\n\nAnyone have the same problems? Maybe giving some advice would help, thanks a bunch.",
        "created_utc": 1676549501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really want to go partying tonight but have noone to go with",
        "author": "theonewhoknock_s",
        "url": "https://www.reddit.com/r/socialskills/comments/113p2ip/i_really_want_to_go_partying_tonight_but_have/",
        "text": "Long story short, today is a special day in my country that involves pretty much everyone going out at night and partying in clubs or on the streets. Due to various reasons, my friends can't go out tonight so I've noone to go out with. But I'll be very bummed if I have to stay at home and I'm considering going partying on my own for the first time in my life. I'm a very socially inept person, so this is really stressing me out, but it's also sort of exciting. I'm sure others have done this at some point, so I'd like to ask for some advice. My plan currently is to pick a place with music I like and dance like nobody's watching, blow off some steam, or go home if I'm not feeling it. How have your experiences been partying alone?",
        "created_utc": 1676549168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is making mistakes so bad?",
        "author": "Danphy_777",
        "url": "https://www.reddit.com/r/socialskills/comments/113p212/is_making_mistakes_so_bad/",
        "text": "I don't think I am a sloppy person. But it is just inevitable that I sometimes make mistakes. I feel so ashamed and cannot stop blaming myself when someone pointed out the mistakes I made. I guess this is related to the fact that I was raised in a very intolerant culture. The education I received is not to help you improve but to pinpoint whether you are good or bad students. Then, I moved to another country and people are more tolerant. But when I work with people from my home country, I feel they are judging me. I imagine them saying 'How can you make such a silly mistake. Even a 5 year old knows this.' I am so struggling. On the one hand, I want to be more tolerant of myself and others, because I don't think there is much sense to say what's wrong and what's right. If the other person's made a mistake, just let them know. The more important thing is to solve the problem rather blaming someone. But I feel that people in my home country is so judging. They would not treat me in the same tolerant way. What should I do?",
        "created_utc": 1676549127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want friends but don't want to befriend people",
        "author": "throwawayveggies",
        "url": "https://www.reddit.com/r/socialskills/comments/113owe6/i_want_friends_but_dont_want_to_befriend_people/",
        "text": "Not sure why I feel this way now. I've had crappy luck socially my entire life but I don't hate anyone for it. I used to search for new buddies but now I don't want to do that anymore. I feel lonely sometimes and want friends but thinking about searching for new friends make me go \"No.\" Pretty much I have 1 acquaintance that probably forgot about me by now, 2 family members I don't feel like talking with often for good reason and a LDR that makes me question myself frequently if I want to break it off or wait and see if the person is decent upon meeting up. I didn't expect to be in a relationship so I'm fine with remaining single for the rest of my life if this one falls through.\n\nI don't talk that much and don't go out much so I'm unsure if any friendship would even work. I kinda wonder if there is a bot I can find that'll just ping me on social media every now and then just to have my phone light up.\n\nI thought about getting a pet but I want something to adequately communicate with every now and then. Since technology hasn't advanced enough yet I'm not sure how to proceed.",
        "created_utc": 1676548600,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to thank someone but too scared to do so",
        "author": "Secure_Paramedic_865",
        "url": "https://www.reddit.com/r/socialskills/comments/113otlg/i_want_to_thank_someone_but_too_scared_to_do_so/",
        "text": "Here is the thing, I changed schools mid semester as a result friend groups were already made and class dynamics established, it wouldn’t be that much of a problem if I wasn’t so bad at socializing ( you can’t imagine how awkward I sometimes can be ). So I didn’t really get the chance to talk with any of them, but there is one person and I insist on them being the only who without having any prior interaction kept on encouraging and helping me out.\nAs example we once had to work in groups for a project however since I didn’t know anyone there, as one would expect, I stayed alone well not really since that one person came up to me and asked if I would be okay joining their team, in my head it was the carnival I was like “heeeell yeaaah dude, thanks!” But instead a lazy boring “ok” come out of my mouth as I didn’t get the chance to thank them but even though they kept on being nice to me.\nWhich is why I am here today, to ask all of you a favor please help me find a way to thank them (as I am aware that they are not obliged to act that way towards me and that for some reason they are chosing)as I tried many times the past week but just couldn’t.",
        "created_utc": 1676548325,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I dont talk Im just a quiet guy, If I talk Im the annoying friend",
        "author": "Intrepid_Mention_550",
        "url": "https://www.reddit.com/r/socialskills/comments/113oooh/if_i_dont_talk_im_just_a_quiet_guy_if_i_talk_im/",
        "text": "I hate this so much. Is there a way to be talkative without being annoying? I show interest to people, I even compliment them  and I listen to them while they are talking",
        "created_utc": 1676547828,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve become dry",
        "author": "Master-Amphibian-374",
        "url": "https://www.reddit.com/r/socialskills/comments/113oiu8/ive_become_dry/",
        "text": "\nTLDR: I suck at f!irT!ngg now and I was a god at it once, I even struggle to have a good conversation. This all happened after going through a lot of tragic experiences. Am I just depressed or am I just going through a bad phase which’ll get over? I basically lost my r!zz…",
        "created_utc": 1676547223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personality glow down.",
        "author": "Master-Amphibian-374",
        "url": "https://www.reddit.com/r/socialskills/comments/113oi44/personality_glow_down/",
        "text": "[removed]",
        "created_utc": 1676547140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personality glow down",
        "author": "Master-Amphibian-374",
        "url": "https://www.reddit.com/r/socialskills/comments/113ofgb/personality_glow_down/",
        "text": "[removed]",
        "created_utc": 1676546878,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to meet new friends not in a group setting?",
        "author": "logie2019",
        "url": "https://www.reddit.com/r/socialskills/comments/113o9mi/how_to_meet_new_friends_not_in_a_group_setting/",
        "text": "All the advice to make new friends is joing a club, take a class, go to a meetup group. All these are group activites and I get overwhelmed in groups. How can one meet people who are on their own and you don't have to compete for their attention?",
        "created_utc": 1676546274,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the normal thing to do here",
        "author": "xavdil",
        "url": "https://www.reddit.com/r/socialskills/comments/113nuji/whats_the_normal_thing_to_do_here/",
        "text": "if this isnt the proper sub for this kind of thing apologies !!!\n\nso essentially im in a group chat of acquaintances cause we all attend the same club and i wanted to message and let them know i cant make it to some plans that were organised for this weekend but the last message sent into the gc was a joke made by someone who i feel like is usually not responded to when they make comments, jokes, etcetc. - im probably projecting here but i cant help but get into an 'if i was them id feel crappy and anxious about that' mindset, and so im thinking i should respond to the joke. But my mind is completely blank on what i could say. and then im getting stressed because me saying i cant make the plans is time-sensitive and im getting very confused and anxious over this - yes i know its a bit much for something so small but here we are.\n\nshould i be just saying i cant make plans and leave it at that? should i figure out how to respond to the joke and then say i cant make it? \n\nsocialising is honestly new to me and i really like these people, the last thing i want to do is make someone feel bad or come across as rude or uncaring or something.",
        "created_utc": 1676544668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complicated friendship",
        "author": "Winter-Following8910",
        "url": "https://www.reddit.com/r/socialskills/comments/113n35r/complicated_friendship/",
        "text": "I have a crush on an online friend with whom I have been talking since June 2022. I had feelings for him since then. The problem is I deliberately tried to be closer to him(as a friend). I felt quite lonely at that time and ranted a lot about how I don't have many friends(online and irl) and all those things. Every time the rant ended with me asking him whether he considered me a close friend or not. I was too stupid to ask this when we had just started talking. Couldnt realise it back then. In the beginning 2 3 months, he used to say that I am a good friend, not close. He said he feels comfortable in opening up or sharing things with me but that I have too many expectations from him. He is also generally a late replier. He told he replies late to his irl friends too. I used to fight with him over this thing and asked a lot whether late replies meant he was not interested in talking to me. He used to deny. Also he replies on time whenever I need some help or advice. Just because I wanted him to be closer to me, I even used to ask what kind of bonding he had with his other online friends, how much he texted them, etc. I admit i was quite insecure and asked such questions often which frustrated him. At that time, he was in a rough phase too, had his entrance exams around the corner etc He meets his other online friends who lives in the same city as him and apparently feels closer to them which hurts me. Now the problem is he considers me a close friend but says not as close as his other friends because maybe I keep questioning every small freaking thing i guess and deliberately rushed things. I haven't asked him about it since 3 months as I do think it will ruin our friendship completely now. Right now, we do keep talking normally often as there is an ongoing convo on an app since the beginning, idk how close he feels to me. What do you guys think about this? Any advice? Does he not feel close to me because I pushed closeness on him and asked way too many questions?",
        "created_utc": 1676541577,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to end a friendship",
        "author": "ValuableStrawberry72",
        "url": "https://www.reddit.com/r/socialskills/comments/113mto2/how_to_end_a_friendship/",
        "text": "About 3 years a go i met this dude at school who was suppost to be just a classmate, however i used to help him in some school stuff when he need as well as that we went through some situations which made him thinnk that we are freinds. Maybe thats my fault cuz i am alwyas kind with others and make them feel that i like to have them around however  for me he was just a classmate nothing more and to be honest ( i dont want tl sound rude) but i never enjoyed hangging around with him. he also became part of our group, i believe my freinds got along with him but i never. what makes it worse us that he likes me the most between our group and i believe he sees me as his best frienfd. i know thats sad but i cant force my self to like someone who i dont feel comfortable around. he alywas would ask me to go out or have lunch together and i always force my self to join him, however recently i would makes excuses to avoid going out with him. i tried to ignore him alot but somehow he never get it. what makes it worse is that we live really close and he is already part of our group so i can't even tell him that we should end this freindship\n\n\nSo was it my fault from the begining ?, and how should i deal with this ?",
        "created_utc": 1676540493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nobody likes me",
        "author": "lauralolliepop2023",
        "url": "https://www.reddit.com/r/socialskills/comments/113m2yq/nobody_likes_me/",
        "text": "Nobody likes me everyone hates me, I'm going to go eat worms.",
        "created_utc": 1676537385,
        "upvote_ratio": 1.0
    },
    {
        "title": "I, 18M, fell in love with a 35F married woman, and it's tearing me apart internally.",
        "author": "No_Unit5540",
        "url": "https://www.reddit.com/r/socialskills/comments/113l46v/i_18m_fell_in_love_with_a_35f_married_woman_and/",
        "text": "[removed]",
        "created_utc": 1676533420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would someone who may not like you give you a spontaneous recommendation?",
        "author": "MoonlitVermont",
        "url": "https://www.reddit.com/r/socialskills/comments/113ku4k/why_would_someone_who_may_not_like_you_give_you_a/",
        "text": "I’m a student in college, and currently in a program. This program has about 70-90 students and I’ve been in it for the past year. The orientation (first) day of this program involved the newer members to interact with each other. I was sitting alone and a girl came up at sat with me and started a conversation and we chatted a bit and then listened to older students train us. Several days or so after this orientation, I followed her on Instagram with no reciprocal follow back (so I unfollowed her after a few months). There was also an instance a few months later where she was sitting in the front row of the lecture hall, she turned around made eye contact with me but didn’t really smile or anything. I assumed that maybe by following her too soon on Insta in combo it’s my personality made her not like me.\n\nSeveral months later, I apply to a fraternity with a speed interview process and a formal interview process. She speed interviews me (for one-minute) and in this minute she’s very happy and kind, but she kinda has to be. I made it through the initial cuts but didn’t get in after the formal interviews (this is relevant later on)\n\nToday, however, I ended up in the same elevator as her as we were going up 9 floors and we did the typical pleasantries. And she asked me if I received an email from the directors of the earlier mentioned program to which I said no. Apparently, she recommended me to be a director to the current administrators of the club. Mind you, I’m sure she knows other people in this program, and there has been no announcements/selection for directors yet at all. I was honestly baffled at this because we have only spoken twice (one of which was today).\n\nI’m theorizing tha:\n\n1) She may have felt bad about my fraternity rejection and tried to make up for it —&gt; however, why would she take it upon herself? She was one of the 60 people of speed interviewed me and not even 1 of the 3 people who formally interviewed me.\n\n2) She completely lied about this email because she realized that I may have assumed that she was mean/shallow in my mind because she didn’t follow me back/her presumably dry instances so she created a narrative where she lies so that I have a good perception of her\n\n\nI have genuinely no clue what happened here. Could anyone help me theorize or just process my thoughts please. Thank you!",
        "created_utc": 1676532289,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m more confident around people less confident than me",
        "author": "Sunfofun",
        "url": "https://www.reddit.com/r/socialskills/comments/113ked6/im_more_confident_around_people_less_confident/",
        "text": "Hey guys, I want to be truly confident around everyone, but I tend to find myself forcing confidence around people I feel are more confident than me. \n\nBut with people I feel are less confident than me, I feel I just relax and just flow. I find myself doing and saying exactly how I’d want to be with confident men or  women\n\nI find that hanging out around really confident/intimidating people helps as an overcompensation, so lowers stress later when around people that are kind of confident. But there’s only so much of that I can do and it can be draining to keep up that maintenance. That superpower so to speak wears off quick. \n\nI just have this dream of relaxing and living to my absolute full potential around confident men and women that right now I am a bit intimidated by. \n\nAny tips, advice, mindsets?? Thanks",
        "created_utc": 1676530557,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone else want to reconnect with people they went silent on?",
        "author": "throwaway42093702",
        "url": "https://www.reddit.com/r/socialskills/comments/113kdgv/does_anyone_else_want_to_reconnect_with_people/",
        "text": "I am not silent anymore and I want to talk to people but that would fall out of line with how I usually act now and that would be abnormal. I feel so alienated and I hate myself for it. This is real life btw, for a couple months I couldn't talk to people.",
        "created_utc": 1676530460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it because I don’t know how to socialize?",
        "author": "Responsible-Bird-234",
        "url": "https://www.reddit.com/r/socialskills/comments/113k5rw/is_it_because_i_dont_know_how_to_socialize/",
        "text": "Ok, I know for sure that I’m not shy, nervous or anxious at all around people.\nAnd mostly with small group of people I can socialize well. And I’m that kind of person that I don’t rely on someone to go to some events and places and I can go everywhere and anywhere by my own, I feel totally comfortable with myself and around people outside too.\n\nBut I’ve got this problem, when I go somewhere full of people and I know no one or barely know them.. I just don’t know what to do.. I’m sure it is not shyness and I don’t think I’m socially awkward actually but it is just I feel like I’m in the middle of no where and don’t know what to do or who to talk to…  I see everyone in small groups or two or more people talking together and I can’t just go there and start talking to them if I don’t know them at all it would make me look very weird lol.\n\nAlso I’m not easily getting interested in people so if I’m not so interested in someone I don’t wanna get engaged.. so me lacking socializing in places like this I was thinking that it makes me look awkward and even tho I don’t mind being seen as the quiet girl I sometimes don’t want to be seen this way.. but most of the times it is just I might not want to enter a group coz I simply don’t know anyone.. or other times I tried interacting with some people and I didn’t like their personality or I didn’t enjoy their company so I went away..\n\nWhere I live people tend to be very very social even if they meet for the first time they you won’t tell you’ll think they have known each other forever.. I’m just.. not like them.. I sometimes don’t think I fit in my culture.. I find myself different in many ways and that kind of makes me feel sad sometimes.. \n\nSo for example when a friend asks me to go for camping or a hiking trip with his group of friends.. or when I’m invited to an event (party or whatever) and I only know the person that’s ahold of the party and no one else~ or when we’re filming for a commercial or movie.. many of the actors and actress I might not know.. except the staff that work there and I see them every time I go.. but they’re all busy and it’s not like I’ll be talking to them while they’re busy with their own stuffs lol \nFor example in the breaks or while we’re waiting until the film starts.. almost everyone’s talking to each other and I just don’t know what to do..\n\nI think now I’m starting to hate it to be the only quit girl sitting there not doing anything.. I wanna be like them.. sometimes~ simply because I don’t wanna look different or them looking down on me maybe thinking I’m shy or socially awkward.. I wanna socialize and talk with random ppl just like how they do.\n\n+ it’s always the beginning of being in a new place once I’m there a little bit more I get very comfortable around them I socialize and make many friends too also talked to lots of ppl.. but it always annoys me how I can be quiet and awkward in the beginning.",
        "created_utc": 1676529644,
        "upvote_ratio": 1.0
    },
    {
        "title": "improvement has been made",
        "author": "Goamoth",
        "url": "https://www.reddit.com/r/socialskills/comments/113k0r4/improvement_has_been_made/",
        "text": "Last Sunday I introduced myself to a girl I started to notice a month ago. We are both in our mid-late 20s. 10 years ago I never would've imagined myself doing this. \n\nA few times last month I would sneak a look at her. I believe she started to notice. A couple weeks ago I see her walking across the room and I lost a bit of self control and just kinda gave a \"wow she's very pretty look\" stare/gaze. She held the gaze with a little smile, which I think is a good sign.\n\nAnyways, towards the end of the superbowl party, I finally thought to myself \"screw you, you're a man, get up and talk to her\". And I did. Exchanged a few words, and she greeted me with the warmest smile. She had open body langauge, and when I got shy again and couldn't think of anything to say, we just stood there for a minute until my friend jumped in to say goodbye. Everything about it just felt right.",
        "created_utc": 1676529104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with an \"awkward\" friendship?",
        "author": "OogaBoogaBoog3yMn",
        "url": "https://www.reddit.com/r/socialskills/comments/113jlls/dealing_with_an_awkward_friendship/",
        "text": "[removed]",
        "created_utc": 1676527566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I [26F] wrong for ghosting a long term friend?(30F)",
        "author": "Throwaway476978",
        "url": "https://www.reddit.com/r/socialskills/comments/113jhtl/was_i_26f_wrong_for_ghosting_a_long_term_friend30f/",
        "text": "[removed]",
        "created_utc": 1676527216,
        "upvote_ratio": 1.0
    }
]