[
    {
        "title": "Was this guy following up long after the fact to be friendly?",
        "author": "Dsg1695",
        "url": "https://www.reddit.com/r/socialskills/comments/10vq6ql/was_this_guy_following_up_long_after_the_fact_to/",
        "text": "[removed]",
        "created_utc": 1675737645,
        "upvote_ratio": 1.0
    },
    {
        "title": "am I missing out on the college experience?",
        "author": "purplesoul222",
        "url": "https://www.reddit.com/r/socialskills/comments/10vprpf/am_i_missing_out_on_the_college_experience/",
        "text": "I don’t enjoy college but I feel like I should. I see other people having an amazing time, finding lifelong friends, partying all the time, and seeming so happy. in high school and early college I would party, smoke weed all the time, do other drugs, etc. things have changed a lot and while I take school seriously and I’m mostly sober, besides drinking sometimes, I miss the social life I used to have. I work and take 5 classes a semester to speed up my graduation and I feel stressed a lot of the time. I don’t have a lot of friends here and most of the ones I do have are older and busy with work/other responsibilities. I can’t wait for college to be over but sometimes I feel like I’m missing out on bonding with people my age and I’m growing up way too fast. I just feel like I’m missing out on social experiences and I’m falling behind my peers socially..",
        "created_utc": 1675736554,
        "upvote_ratio": 1.0
    },
    {
        "title": "22 yr old w hardly any friends, facing resistance when meeting new people, don’t know where to start/how to find meaningful relationships",
        "author": "Comprehensive-Cod160",
        "url": "https://www.reddit.com/r/socialskills/comments/10vpp2p/22_yr_old_w_hardly_any_friends_facing_resistance/",
        "text": "I’m still in college but I’m at the age where people my age have formed their friend groups, and I can’t insert myself into any of them very easily. Interactions seem forced and with more small talk than anything else. I also don’t feel very inspired and find it pointless sometimes. \n     My school doesn’t have a strong sense of community, so I’ve just accepted that it may be pointless randomly talking to people in my classes and progressing from small talk to inviting them out, etc. \n    I have some bball buddies I’ll play with a few times a week, and I’ve thought about getting involved in new hobbies in the city, but I don’t even know where to start. \n    It’s just tough to make friends when you sometimes don’t even know yourself… and you don’t have a lot to offer to people. I wish it was just as easy as walking up to someone and asking them to befriend me and show me how they get down. \n    Nothing new for me though I’ve been pretty alone most of my life.",
        "created_utc": 1675736362,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to setup a much needed conversation without initially coming off serious?",
        "author": "rvdms",
        "url": "https://www.reddit.com/r/socialskills/comments/10vpgt5/how_to_setup_a_much_needed_conversation_without/",
        "text": "Hope the title isn’t confusing.\n\nI’d like to have the conversation (in person if possible) and cut things off with a 5 year long FWB romantic relationship. It’s been off and on, mostly off and the other person doesn’t want to end it.\n\nHow do I go about setting this up via text without emphasizing my intentions?",
        "created_utc": 1675735773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel like they cant match other peoples vibe emotionally?",
        "author": "Old_Vehicle_3360",
        "url": "https://www.reddit.com/r/socialskills/comments/10vpe59/anyone_else_feel_like_they_cant_match_other/",
        "text": "I want to connect with people but often conversations beg emotional responses.  I feel like my emotions are just very dull, and I suck at forcing reactions.  I’m not depressed but my emotional reactions to things are mild at most, and this is especially hard with people im unfamiliar with.  Someone tells a joke and I might let out a bit of awkward laughter, or if I get a compliment from someone, all I can really give them is a stale “thanks”.  And it doesn’t really help that I cant think of anything to say to people so Im mostly just in the background during social gatherings.  I haven’t been this way my whole life and I can’t really pinpoint a specific cause for it.  Anyone else have/had this problem and is there any way around it?",
        "created_utc": 1675735570,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you solve a living based problem",
        "author": "HastpallODBITWSESss1",
        "url": "https://www.reddit.com/r/socialskills/comments/10vpboq/how_do_you_solve_a_living_based_problem/",
        "text": "I've rented a tiny dorm for college where i'm majoring in cs. And i'm being surrounded by idiots. They would make unnecessary noises, they would hit the walls for fun, next to my head where i'm at my laptop. Well, though they got good grades while they are doing those, i'm failed in all exams and assignments, mainly on six most important subjects, although i was studying half of the day every days, hence i'm failed at college.\n\n&amp;#x200B;\n\nBut to me, they are still idiots.\n\nAnd trust me, i'm civil. I didn't think much of the effect they cause, from  goosebumps to fight-or-flight response that i face every single day. Not to mention that i also experience a horrible event where your landlord would watch you at day while you are sleeping undressed, and your landlord can visit every time.\n\n&amp;#x200B;\n\nBut it affects the way i think, the way i control the paradigm. I was always trying to be normal and i dont want to lose it. That's all i care.\n\n&amp;#x200B;\n\nAnd i don't want to spend more of my times on being furious and paying attention to those things.\n\n&amp;#x200B;\n\nI also just realized that looking for a job in my country is far harder than the others, espescially when i dont have degree. I just tried to searching for work online such as data entry and it's just zero sum in the end. Just the same thing happened a month, half year, and a year ago. So it's not possible to move. And it won't be easy to try to do so.\n\n&amp;#x200B;\n\nIt might could be better if the walls are separated within space, but hold on that's not how reality works.\n\n&amp;#x200B;\n\nWhat i want is just as simple as being able to read books comfortably at night, retrying to study stuff from the past, taking some time to grief after embracing such a painful failure and more failure and just live.",
        "created_utc": 1675735390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take it to heart?",
        "author": "Krayzkattt",
        "url": "https://www.reddit.com/r/socialskills/comments/10vox2g/should_i_take_it_to_heart/",
        "text": "Recently I got bangs, to my dismay my boyfriend was talking to his friends about how I looked emo (no offense to Emos, you guys are fricken cool but it wasn't the look I was going for) but the fact that he was talking to it between them and didn't straight up tell me hurt a bit. I know I may come off as sensitive and it's a small deal but I really wanted him to like it and throughout seeing him I was nervous as to what he'd think. They said, and I quote \"well you're wearing a black top and jacket plus your hairs like that so it's practically emo\" they then continued to say I have dark and weird eyebrows. When I got these I was genuinely excited and thought it looked nice. But now I don’t even want to attend my class tmrw just so I don’t have to hear that again. idk, I just wish my boyfriend told me rather than me just finding out that way of how I looked “super weird”. the rest of my walk home kind of hurt.",
        "created_utc": 1675734346,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I ask somebody if they want to go to a party as friends?",
        "author": "Weeegia",
        "url": "https://www.reddit.com/r/socialskills/comments/10voij8/how_do_i_ask_somebody_if_they_want_to_go_to_a/",
        "text": "Basically the simplified version is a group I'm a part of is throwing a party and I want to ask someone if they're interested. I have never done this before and I have no idea how.",
        "created_utc": 1675733291,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stop seeing people as superior?",
        "author": "Independent_Slide932",
        "url": "https://www.reddit.com/r/socialskills/comments/10vohpv/how_do_you_stop_seeing_people_as_superior/",
        "text": "Whenever I’m with someone I see as “higher” or “cooler” than me, I change personality without realising because I’m scared they’re gonna judge me. How can I stop this?",
        "created_utc": 1675733232,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find a solution of my problem of over smiling man🙂 (as a dumb)?",
        "author": "Rough_Impact1649",
        "url": "https://www.reddit.com/r/socialskills/comments/10vohoi/how_to_find_a_solution_of_my_problem_of_over/",
        "text": "I m a guy 20s, that really over smile in every time, i m also having a lack of relationships with friends, for me it’s hard to create friendships easily or even fastly, but when i have the chance to talk to someone or a group i find myself everytime smiling like i m happy that they finally accepted to talk to me (just one reason).\nI have also a lack of self confidence.",
        "created_utc": 1675733229,
        "upvote_ratio": 1.0
    },
    {
        "title": "How you changed yourself from social anxiety to Extroverty? The recipe",
        "author": "Rough_Impact1649",
        "url": "https://www.reddit.com/r/socialskills/comments/10vnrbp/how_you_changed_yourself_from_social_anxiety_to/",
        "text": ".",
        "created_utc": 1675731320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking",
        "author": "Left-Ad6005",
        "url": "https://www.reddit.com/r/socialskills/comments/10vnaqt/talking/",
        "text": "[removed]",
        "created_utc": 1675730104,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP ME!! Q&amp;A questions needed",
        "author": "JustA_CuriousJo",
        "url": "https://www.reddit.com/r/socialskills/comments/10vnalz/help_me_qa_questions_needed/",
        "text": "[removed]",
        "created_utc": 1675730093,
        "upvote_ratio": 1.0
    },
    {
        "title": "26M. Moved from India to Ireland, 4 months ago. How do I integrate with the locals and make deep friendships?",
        "author": "solitudeMan",
        "url": "https://www.reddit.com/r/socialskills/comments/10vn4gy/26m_moved_from_india_to_ireland_4_months_ago_how/",
        "text": "I recently moved from India to Dublin. I had observed that most people from my country that I know do not make any attempts to socialize with people who are not from India (also observed the same pattern in people from other nationalities).\n\nI have always loved learning about various cultures and decided to make conscious effort to make friends with people from all places. And also to integrate with the locals. I do find the local culture, mannerisms, fascinating and would love to interact with the people on a more serious level.\n\nI love living in Dublin, have joined plenty of groups. There is a sports group, a book club, some art clubs, and have also become a regular at various meetups.\n\nI have gotten tonnes of phone numbers (from both men and women), and I would say have made a few friends as well. I fit in quite well even. However, I am yet to form any close friendships with anyone! Example: I am invited to sports events, or a group hike, or the pub with a bunch of people. But never invited to someone's home, or on a 1-1 brunch or dinner. (Basically, tonnes of nice surface level friendships, but nothing too deep). At this stage, I can't ask anyone here for a 1-1 dinner either. \n\nMy question is, how do I become better (close) friends with people? \n\nI feel like if I keep living here, I will absorb the various traits of the locals and seem less and less like a foreigner and would integrate better.\n\nHow long does such a process take? Is 4 months way too less for something like this?\n\n**Things that I have been doing correctly:**\n\n* I go out and do plenty of activities I genuinely enjoy, and I go with the intention to enjoy the activity and not just to meet people or hit on women. Like my sports club, or the gym, etc\n* I take care of my hygiene. Cleaning my clothes often, always using deodorants/perfumes etc.\n* I am very polite. Always thank people for hosting an event, or for inviting me etc. I speak very clear English, as I grew up speaking English. Have also picked up phrases in other European languages.\n\n**Things that I am planning to do:**\n\n* Volunteer\n* Joining a local college for evening classes.\n\n**Things I have not been doing correctly**\n\n* I rarely invite any of my casual friends to my home, or ask them for a 1-1 lunch or something. Maybe I could start doing that.\n* I don't have a lot of nice pictures of myself, so with the few pictures that I have, Bumble etc have not worked out at all.",
        "created_utc": 1675729652,
        "upvote_ratio": 1.0
    },
    {
        "title": "26M. Moved from India to Ireland, 4 months ago. How do I integrate with the locals, make deep friendships, and romantic relationships?",
        "author": "solitudeMan",
        "url": "https://www.reddit.com/r/socialskills/comments/10vn27p/26m_moved_from_india_to_ireland_4_months_ago_how/",
        "text": "[removed]",
        "created_utc": 1675729479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't talk to anyone at all because my parents coddled me",
        "author": "Loud_Flow_7029",
        "url": "https://www.reddit.com/r/socialskills/comments/10vlnui/cant_talk_to_anyone_at_all_because_my_parents/",
        "text": "[removed]",
        "created_utc": 1675725860,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I meet people I actually like?",
        "author": "i-vent-here",
        "url": "https://www.reddit.com/r/socialskills/comments/10vll84/how_do_i_meet_people_i_actually_like/",
        "text": "Ever since I moved away for college I’ve been finding it hard to find friends I actually connect with. For some reason everyone feels like a chore, and it makes me feel lonely despite having many surface levels friends. I talk to a therapist and we’ve narrowed it down to the fact that I’m just brute-forcing my friendships.\n\nI go to events and clubs and meet people. I am fairly good at making and carrying conversation. The problem is, we never talk about anything I actually care about. The close friends I had back home, we could talk for days and I would not get bored. We never go beyond talking about surface level stuff like school, family, whatever is going on, because we just have nothing in common. I figured out why socialising was always so tiring and not so rewarding - it’s because I was too worried about whether the person liked me that I didn’t even consider whether or not I liked the person.\n\nI am an introvert. But I enjoy socializing, in a lowkey manner. Like watching movies together, playing games, doing something that doesn’t require heavy socializing. I never meet people I click with. I can’t seem to click with anyone. I don’t know if I’m doing something wrong or I’m just not meeting the right people, but I’m sick of it. I just want a circle of friends I enjoy hanging out with. Please help :(",
        "created_utc": 1675725674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird to make noises in the morning?",
        "author": "GlitteringBug734",
        "url": "https://www.reddit.com/r/socialskills/comments/10vlcjs/is_it_weird_to_make_noises_in_the_morning/",
        "text": "So in the morning, I always stretch my body out when I wake up. And I release these funny noises and go “Eeeeeaaaahhhh!”. I’m worried this is weird. Like you know when you wake up in the morning and stretch. I’ll move around in the bed while still laying down and just stretch out and make really loud noises. I used to think it was funny but I’m worried it weird. Does anyone else do this?",
        "created_utc": 1675725077,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 months ago I made a post about meeting a girl, You said I shouldnt I am gonna do it anyway",
        "author": "TryFederal4936",
        "url": "https://www.reddit.com/r/socialskills/comments/10vkwxb/4_months_ago_i_made_a_post_about_meeting_a_girl/",
        "text": "3000km away. Going to do it anyway. Fuck it I dont care anymore I am gonna do it anyway. You all said it wasnt that good of an Idea I am still doing it.",
        "created_utc": 1675724051,
        "upvote_ratio": 1.0
    },
    {
        "title": "What causes people to go through their day-to-day life being hateful to strangers?",
        "author": "igivebadadviceAMA",
        "url": "https://www.reddit.com/r/socialskills/comments/10vkpzb/what_causes_people_to_go_through_their_daytoday/",
        "text": "Not responding to anyone, glaring, acting passive aggressive unprovoked, not saying “thank you” when a door is held open for them, etc. \n\nWith my job I’m face to face with customers daily, and some of them are so rude and hateful for no reason and I always wonder what’s going on with them mentally.",
        "created_utc": 1675723591,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a shy student in my junior year, there’s a really cute girl in my class this semester. I sit near her and I want to talk to her but I don’t know what to say. Any advice?",
        "author": "AmericasBiggestNerd",
        "url": "https://www.reddit.com/r/socialskills/comments/10vki44/im_a_shy_student_in_my_junior_year_theres_a/",
        "text": "The Title",
        "created_utc": 1675723062,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to turn down a girl without being too harsh?",
        "author": "ronnyronny33",
        "url": "https://www.reddit.com/r/socialskills/comments/10vjt75/how_to_turn_down_a_girl_without_being_too_harsh/",
        "text": "TL DR:\n\n\\-She gives signs of interest\n\n\\-I play dumb\n\n\\-She insists again\n\n\\-I get I little bit colder\n\n\\-She gets mortified\n\n\\-I try to cheer her up by making a couple of jokes to break the awkwardness\n\n\\-She starts to insist again\n\nISSUE: I just want to be \"friends\" / \"friendly coworkers\"\n\n&amp;#x200B;\n\nI'm a delivery guy. There is this one girl in a restaurant that has been giving me clear sign of interest. At the moment I'm working to exhaustion daily to put my life of track from a bad place, so I don't have nor the time neither the energy for anyone (and I'm actually gradually fixing things). I've been playing \"dumb/stupid\" pretending not to notice the hints, just not to hurt her feelings, hoping that she would leave it alone. But she kept insisting till I started getting a bit cold (just a bit, to be clearer) which I think made her understand my lack of interest, and mortified her, because she started \"over-avoiding\" me like plague.\n\nNow, with the intention of trying to \"cheer her up\" and also break the awkwardness that had arisen I tried to crack some jokes (while waiting for the orders to get ready). It was my way to say \"I can't, but we can still be friendly\"\n\nBut I'm assuming she misinterpreted my jokes because now we are back to square one.\n\nSo, question 1)\n\nHave I made a mistake by trying to crack some jokes in order to break the awkwardness? Was I supposed to keep it, although it would have made the interactions \"unpleasant\"?\n\n&amp;#x200B;\n\nQueston 2)\n\nHow am I supposed to go about this?\n\n&amp;#x200B;\n\nThanks",
        "created_utc": 1675721409,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to turn down a girl without being too harsh?",
        "author": "Delicious-Pop-6316",
        "url": "https://www.reddit.com/r/socialskills/comments/10vjrls/how_to_turn_down_a_girl_without_being_too_harsh/",
        "text": "[removed]",
        "created_utc": 1675721295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is she gaslighting me ?",
        "author": "nnnnbhppppp",
        "url": "https://www.reddit.com/r/socialskills/comments/10vjnbh/is_she_gaslighting_me/",
        "text": "[removed]",
        "created_utc": 1675721003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for talking to other players while gaming?",
        "author": "Ill_Oven_6347",
        "url": "https://www.reddit.com/r/socialskills/comments/10vj53v/tips_for_talking_to_other_players_while_gaming/",
        "text": "I've always played videogames alone because the thought of talking to others online really stressed me out, but now I think I might try finding some groups to play with on discord. What should I talk about/say and how can I avoid any awkwardness? (I'm really bad at small talk so idk what's normal to talk about)\n\nI haven't done this before so I'm gonna need some advice, thanks!",
        "created_utc": 1675719834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever pretend to know someone because you want to start a conversation?",
        "author": "DeerOnATree",
        "url": "https://www.reddit.com/r/socialskills/comments/10virog/do_you_ever_pretend_to_know_someone_because_you/",
        "text": "So I’m a college student. In class there are like 400 seats and 120 students. Only people with their friend groups sit together, everyone else kinda just spaces out around the room. I’m a transfer student so I don’t have many friends here, but there are quite a few people that sit alone in class that I wouldn’t mind talking to. It would be super weird to sit right next to anyone when there are like 6 empty seats in a row.\n\nWould it be weird if I pretended to know someone? Like saying “Did you go to elementary in Mississauga? Oh, I thought you were this girl I knew named Emily, my bad! But anyway, my name’s Andrew, what’s your name?” And starting a convo like that? I just don’t know how to start a convo without making it weird, and I want to have more familiar faces on campus.",
        "created_utc": 1675718938,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with extreme emotional attachment to friend?",
        "author": "CCC1270",
        "url": "https://www.reddit.com/r/socialskills/comments/10viqu3/how_to_deal_with_extreme_emotional_attachment_to/",
        "text": "I have this one friend who (due to being quite manipulative in the past but he's not like that anymore) it makes me feel like intense butterflies in my stomach and shake a bit when there's any disagreement with him and it only goes away when that disagreement goes away. This feeling just stops me from concentrating on anything or doing anything productive during that time, and in effect makes my life harder so I want to get rid of it. However, it's not really his fault anymore and I still really want to remain friends with him. How do I do that without being so emotionally attached? Thanks for any advice.",
        "created_utc": 1675718882,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and mind blanking",
        "author": "Fenino",
        "url": "https://www.reddit.com/r/socialskills/comments/10vi9f4/adhd_and_mind_blanking/",
        "text": "I’m wondering how others cope with this?\n\nI feel like my mind is typically just empty, even writing this post has taken me a few attempts as it’s as though my mind just struggles to structure sentences and think of words. \n\nI’m not typically shy, I do like socialising but I find it difficult and it makes me feel really worn out. I feel like NT people have brains working on automatic and mine is a manual lol, like I’m kicking my brain trying to force it into making connections.\n\nEven if I’ve received a text, I find myself googling about the topic of conversation just to get inspired as my mind seems to just have tumbleweed. \n\nMeds don’t seem to have any impact on this either. \n\nAny advice on how to improve on this please?",
        "created_utc": 1675717757,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I ask someone for their snapchat?",
        "author": "Ok_Decision_5808",
        "url": "https://www.reddit.com/r/socialskills/comments/10vi45l/when_can_i_ask_someone_for_their_snapchat/",
        "text": " \n\nI like this guy and we've talked a couple times, although it was mostly joking around. I don't see him very often and I want to get his snapchat, but I don't know if it's too soon? When is it appropriate to ask someone for it?",
        "created_utc": 1675717409,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I ask someone for their snapchat?",
        "author": "Ok_Decision_5808",
        "url": "https://www.reddit.com/r/socialskills/comments/10vi208/when_can_i_ask_someone_for_their_snapchat/",
        "text": " \n\nI like this guy and we've talked a couple times, although it was mostly joking around. I don't see him very often and I want to get his snapchat, but I don't know if it's too soon? When is it appropriate to ask someone for it?",
        "created_utc": 1675717263,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I ask someone for their snapchat?",
        "author": "Ok_Decision_5808",
        "url": "https://www.reddit.com/r/socialskills/comments/10vi1zc/when_can_i_ask_someone_for_their_snapchat/",
        "text": " \n\nI like this guy and we've talked a couple times, although it was mostly joking around. I don't see him very often and I want to get his snapchat, but I don't know if it's too soon? When is it appropriate to ask someone for it?",
        "created_utc": 1675717261,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I ask someone for their snapchat?",
        "author": "Ok_Decision_5808",
        "url": "https://www.reddit.com/r/socialskills/comments/10vhyo5/when_can_i_ask_someone_for_their_snapchat/",
        "text": " \n\nI like this guy and we've talked a couple times, although it was mostly joking around. I don't see him very often and I want to get his snapchat, but I don't know if it's too soon? When is it appropriate to ask someone for it?",
        "created_utc": 1675717066,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it normal to stalk ppl on Instagram",
        "author": "FaithlessnessAny5393",
        "url": "https://www.reddit.com/r/socialskills/comments/10vhsvz/is_it_normal_to_stalk_ppl_on_instagram/",
        "text": "[removed]",
        "created_utc": 1675716691,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I ask someone for their snapchat?",
        "author": "Ok_Decision_5808",
        "url": "https://www.reddit.com/r/socialskills/comments/10vhoyu/when_can_i_ask_someone_for_their_snapchat/",
        "text": " \n\nI like this guy and we've talked a couple times, although it was mostly joking around. I don't see him very often and I want to get his snapchat, but I don't know if it's too soon? When is it appropriate to ask someone for it?",
        "created_utc": 1675716431,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my presence makes people uncomfortable",
        "author": "Competitive_Law_2811",
        "url": "https://www.reddit.com/r/socialskills/comments/10vhg7g/i_feel_like_my_presence_makes_people_uncomfortable/",
        "text": "TLDR at the end\n\nI never really talk to anyone or do anything to stand out, but even so I feel like people are drawn away from me for some reason. Besides gym class, I'm not really talkative at all and just mind my own business and I feel it's hurting the impression or assumptions people may have about me.\n\nIt doesn't help that I also have somewhat low confidence in public situations, social anxiety, and below average looks. The reason I feel this way is because people are always hesitant to interact with me (besides my friends and gym bro's), whether I initiate or not. The things that played into this was that whenever the class is told to be partners or groups, even if they are alone they don't wanna be partnered with me.\n\nOr how today I was holding the door open for a girl and she just stopped and let me through. Then I overheard her a second later say \"The f*ck was that\" and laugh. \n\nOr how someone I know never ever initiates conversation or accepts invitations to things but never participates. I feel though that this was warranted because I'd always get suggested their Instagram account but never knew them. Then once I actually met them I followed them. I feel like this makes me seem like a creep and stalker. The signs are there it seems: they take literal days to respond, and they've removed their profile picture and posts ever since.\n\n\nDo you have any ideas as to why people are uncomfortable around me? Is it their lack of information about me? Am I THAT ugly? Idk \n\nTLDR: Why might people feel uncomfortable around me even though I don't talk and mind my own business?",
        "created_utc": 1675715892,
        "upvote_ratio": 1.0
    },
    {
        "title": "people here who run business, may we open a discussion ?",
        "author": "DELKAH1",
        "url": "https://www.reddit.com/r/socialskills/comments/10vhd9a/people_here_who_run_business_may_we_open_a/",
        "text": "In my opinion, it's not spotted as a personnel question, so Whatever the business you are in, how would you open a discussion that lead to close the deal with the other part?  Or what's the question you would ask to open the discussion ? \n\n\nYou can mention one of your experiences As an example",
        "created_utc": 1675715709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, will you like to be my English conversation partner?",
        "author": "filled_with_life",
        "url": "https://www.reddit.com/r/socialskills/comments/10vh9kf/hi_will_you_like_to_be_my_english_conversation/",
        "text": "\n\nHello!\nI am looking for a conversation partner to practice english speaking with. \n\nI have graduated from college just a few months ago and now i am preparing for job. And I want to be able to hold good conversations and speak with confidence. Is someone also in need to improve their communication skills? I will love to see your comment! Please tell me something about you. And if you are willing to be my conversation partner, I am grateful. Hoping for the best!\n\nSome more information about me. \nI am excited to learn about economics \nI like reading (but very specific about that)\nI like understanding people and help them if i can\n And I love Jesus, He is the number 1 in my life. I completely depend on Him for everything.",
        "created_utc": 1675715477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking a friend for someone's snapchat?",
        "author": "APartyOf4",
        "url": "https://www.reddit.com/r/socialskills/comments/10vgyvw/asking_a_friend_for_someones_snapchat/",
        "text": "First of all I know this is a pretty dumb question. I'm a freshmen in college and I've been hanging out with a couple folks from my department, I want to invite one of the chicks I was hanging with to an event tonight but I forgot to get her info. Is it weird to ask another girl (who I've known for a while) for her snap?",
        "created_utc": 1675714799,
        "upvote_ratio": 1.0
    },
    {
        "title": "i cannot connect with anyone",
        "author": "Qwoboo",
        "url": "https://www.reddit.com/r/socialskills/comments/10vgw7d/i_cannot_connect_with_anyone/",
        "text": "Recently i’ve been trying so hard to make friends. over the past years i haven’t been able to make friends i’ve always been pretty bad at talking and social cues. It’s super hard to say what’s on my mind or explain myself. Everyday i feel guilty and horrible because im so bad at talking every-time i try to talk with someone or interact my mind just instantly shame/ myself for not being as good as them at talking or not thinking what they were thinking. i feel so plain, boring and unfunny. i really want to change im tired of having no connection and being alone but it’s so hard i try to not give up but i don’t know what im doing wrong i keep telling myself i’ll make a connection soon but it’s just not happening.\nI’ve also been losing touch with my best friend and i can barley talk to them either. it’s so weird because i used to be good at talking to them as well. It’s like i lost my spark and the will to just be able to talk and do normal things \n\nhow do improve with talking?",
        "created_utc": 1675714625,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help",
        "author": "Born_Marzipan9022",
        "url": "https://www.reddit.com/r/socialskills/comments/10vgor2/please_help/",
        "text": "My social skills are awful because people know me as the wierd kid in school. I try to make friends and talk to people but they just look at me wierd and ignore me most the time.",
        "created_utc": 1675714167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend immediately responds to text messages and it stresses me out",
        "author": "ThrowRA13582057105",
        "url": "https://www.reddit.com/r/socialskills/comments/10vglwx/friend_immediately_responds_to_text_messages_and/",
        "text": "One of my friends always immediately reads and responds to my text messages, often times as i'm still writing my replies. \n\nTexting is overwhelming to me and i need at least a few hours in between to respond again, because the fact that every reply i send is met with a new response that i have to answer again just exhausts me. \n\nAt this point i turn off my internet when i reply to them, and then turn it back on after i leave the app, but this has been a major point of frustration for me. I can't ask them to not reply to me immediately anymore, because this is just how they go about things, and they never gave me crap for not replying back as fast either, but i feel guilty for not replying back immediately when they do.\n\nIt literally sends me into sensory overload if i have to reply to people's messages constantly. Does anyone else have this problem? I'm generally a terrible texter, i just prefer to speak to people face-to-face.",
        "created_utc": 1675713983,
        "upvote_ratio": 1.0
    },
    {
        "title": "asking all extroverts...",
        "author": "aFluffyCatsShaggyDog",
        "url": "https://www.reddit.com/r/socialskills/comments/10vgfv3/asking_all_extroverts/",
        "text": "How does it feel to be you? \n\nI think i know an extroverted person bc everyone around me says he's pretty extroverted, but I think he's just a guy who is uses talking As a shield. \n\nHe's very knowledgeable, but he's the laziest person I know. And I mean lazy. If he goes to work that day he says to himself, I'm not doing anything else. Even if it's just washing his clothes. He comes home and goes straight to his pc and starts gaming. When his car broke down he wouldn't call the shop to make an appointment. Instead he had someone else do it. And when it came time to renew his sticker for his liscence plate he waited until the last day, and made an excuse saying I don't have time, and asked someone else to do it for him. \n\nThis can't be an extrovert. Now that I'm reading what I write, I'm starting to see this clearly. Or am I wrong? \n\nAlso how does it feel to be you?",
        "created_utc": 1675713618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone just shouted at me at the gym calling me an annoying c*** cause I walked in front of his camera (didn’t even know it was there) and instead of saying something back I just said “Sorry mate.” I feel like such a coward. I wish I didn’t let people disrespect me like that.",
        "author": "1111diamante",
        "url": "https://www.reddit.com/r/socialskills/comments/10vg38t/someone_just_shouted_at_me_at_the_gym_calling_me/",
        "text": "See title.",
        "created_utc": 1675712836,
        "upvote_ratio": 1.0
    },
    {
        "title": "When someone you know won’t look at you/make eye contact during a social gathering?",
        "author": "shnu_bb",
        "url": "https://www.reddit.com/r/socialskills/comments/10vfyh3/when_someone_you_know_wont_look_at_youmake_eye/",
        "text": "Just thinking about how this is one of the most socially confusing things for me as a shy person. I just end up assuming the person is purposely avoiding me for some reason, when I’ve tried to catch their eye multiple times. Or they are similarly as awkward as me. But I generally do not know what to do in these situations when it’s someone I thought was a friend or acquaintance, and coming round to force a hello feels really awkward for me and like an ambush?",
        "created_utc": 1675712533,
        "upvote_ratio": 1.0
    },
    {
        "title": "I turned to Reddit cause I literally have no friends",
        "author": "yahuitldlsl",
        "url": "https://www.reddit.com/r/socialskills/comments/10vfnwu/i_turned_to_reddit_cause_i_literally_have_no/",
        "text": "[removed]",
        "created_utc": 1675711856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went to the convocation today despite having zero friends in university and I think I handled myself well",
        "author": "heisenberg_2013",
        "url": "https://www.reddit.com/r/socialskills/comments/10vfgn9/went_to_the_convocation_today_despite_having_zero/",
        "text": "So today was my convocation. I attended sitting quietly alone while everyone else was catchup up and talking with their friends which made me a bit sad. I had to approach professors to write me a recommendation for my further studies so I had to attend this event.\n\nDespite seeing everyone happy and taking pictures with each other while I was out there all alone it didn't break me and I went there not caring about it at all and got my work done.\n\nJust wanted to share this since I have been frequently sharing my life here and you all have been super helpful here. Thank you.\n\nI hope I am able to make friends in the next journey of my life.",
        "created_utc": 1675711401,
        "upvote_ratio": 1.0
    },
    {
        "title": "No idea how to respond to women",
        "author": "eldenblooder",
        "url": "https://www.reddit.com/r/socialskills/comments/10vfaib/no_idea_how_to_respond_to_women/",
        "text": "[removed]",
        "created_utc": 1675711009,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to ask my friend for help, but...",
        "author": "ShAssiiiE",
        "url": "https://www.reddit.com/r/socialskills/comments/10vena0/i_want_to_ask_my_friend_for_help_but/",
        "text": "Okay, so I want to ask my friend who I'm somewhat close to if I can stay at his place for at least part of my summer break due to my parents uhh. Having issues that I don't really want to be around for. (As in they're fighting, it's bad, and I don't think I can handle 3 months of it.) The problem(s) are: he lives in Canada, I live in the US, and while I can renew my passport and find transportation on my own, I... I have some abandonment issues, I don't know the source, and I'm scared that this might be asking too much of him. \n\nIt's not so much that I'm afraid he'll say *no,* if he says no, that's fine, I can try to figure something else out-- it's more the fact that I'm afraid that I might be asking too much. And I'm just really scared because his friendship means a lot to me. \n\nHe has done absolutely nothing to warrant this fear, btw, *it's my fear,* I don't know where it came from, if it's connected to my parents or what, but I just want to make it perfectly clear that my friend hasn't done anything to make me afraid of losing him. \n\nI just really don't know what to do. I feel like I'd be crossing a boundary I'm not supposed to, and I genuinely have no idea if it's just my own distorted sense of reality or what. \n\nIf anyone has any advice, whether it's for me to keep my mouth shut and figure out where I'm gonna go on my own, or if I should ask him, or if you're thinking of something else I can do... any help is appreciated at this point.",
        "created_utc": 1675709523,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate how socially demanding everything is in life",
        "author": "Expensive_Let_469",
        "url": "https://www.reddit.com/r/socialskills/comments/10vejpq/i_hate_how_socially_demanding_everything_is_in/",
        "text": "[removed]",
        "created_utc": 1675709287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel like a child when talking to other people their same age and hate it?",
        "author": "Patient_Dot_3861",
        "url": "https://www.reddit.com/r/socialskills/comments/10veic7/anyone_else_feel_like_a_child_when_talking_to/",
        "text": "Like not immature, but more like I don’t feel like I’m on your level, often times the person is someone whos really emotionally mature or adventurous or just plain smart.\n\nIve also been told I come across as super naive or innocent, most likely because I keep personal stuff to myself and I don’t engage in gossip/don’t like talking about other people behind their backs. I would very much like to come across as someone who’s normal and on top of their shit instead.",
        "created_utc": 1675709198,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most important quote about people that changed how I approached every social interaction",
        "author": "OkCriticism8548",
        "url": "https://www.reddit.com/r/socialskills/comments/10veg63/the_most_important_quote_about_people_that/",
        "text": "“If you are willing to look at another person’s behaviour toward you as a reflection of the state of their relationship with their self rather than a statement about your values as a person, then you will, over a period of time, cease to react at all” - Yogi Bhajan\n\nTake a minute to think about the psychology of the people you’re dealing with in social situations",
        "created_utc": 1675709059,
        "upvote_ratio": 1.0
    },
    {
        "title": "20 years old, finally sinking in that nobody likes me, nor has ever liked me.",
        "author": "Ok-Yoghurt-7179",
        "url": "https://www.reddit.com/r/socialskills/comments/10veesi/20_years_old_finally_sinking_in_that_nobody_likes/",
        "text": "[removed]",
        "created_utc": 1675708967,
        "upvote_ratio": 1.0
    },
    {
        "title": "The amount of friendships i have to maintain has become increasingly overwhelming. How do I isolate myself and cause the least amount of damage in doing that?",
        "author": "anxiousi",
        "url": "https://www.reddit.com/r/socialskills/comments/10veata/the_amount_of_friendships_i_have_to_maintain_has/",
        "text": "I’m a uni student living with a roommate. I legitimately do not remember the last time I spent more than half a day alone. I am an introvert by nature so this is becoming too much for me. I want to isolate myself for a week or two but i’m always the one making plans for my friend group and bringing them together so my friends keep reaching out to me to hang out. It’s like the cannot hang out with each other unless I’m there and when i say i’m busy they blame me for ruining their plans or whatever. I really, really want to be myself for a while and focus on my own life.\n\nMy question is; how do I isolate myself from everyone for a while without upsetting people?",
        "created_utc": 1675708714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since I deleted instagram and facebook my life has been so much better but also lonelier",
        "author": "Much_Hold_9055",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdxe2/since_i_deleted_instagram_and_facebook_my_life/",
        "text": "...like without any friends whatsoever. Seems my \"friends\" are only online \"bots\" who just spend all their day and time on their phone,endlessly browsing social media stuff,watching instagram stories,upvoting pics on facebook,tinder fishing and whatnot.\n\nI also had a difficult time keeping in touch with my highschool friends because I no longer use/have access to said social media.\n\nBut life has improved as well,I get out more(even its just by myself cause I have no one else to go with),less toxicity and less cringy jokes,guys talking how they get laid with this girl,etc.\n\nI'm a 22 yr old dude and right now covid makes college harder too.\n\nMaybe I'm just more mature andstepping faster into adulthood than they are,but still I feel like I'm wasting my youth by being alone,like I feel that's the problem.",
        "created_utc": 1675707871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why 99% of people never improve their social skills and are stuck",
        "author": "Stunning_Oil_8056",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdxdd/why_99_of_people_never_improve_their_social/",
        "text": "There's a mystery when it comes to why some people are social, outgoing, confident, and can freely express themselves... and why some people are shy, reserved, quiet, unconfident in themselves, or struggle to make deep connections.\n\nIf you're someone who has resigned to the idea of making more friends, or you don't really want to put in the work to improve your social life, then this post is not for you.\n\nHowever, if you're someone who likes to be around other human beings, you WANT to interact with them, have a good time with friends and make meaningful connections; and most importantly, you want to make people HAPPY, and you want to HELP people and contribute to their lives...\n\n…but you feel like you're awkward, or you don't have anything to offer, or you don't really know how to get past the small talk and really connect on a deeper level…\n\nIf you're one of these people, then I want to break this myth people have about their social skills once and for all; the big mystery about our abilities to be truly social and confident.\n\nMost people have this idea that someone just IS a certain way. Almost like they were BORN outgoing, or BORN more quiet and reserved. They'll say things like: \"I'm just a quiet person,\" or \"that's just not really me,\" as if their identity was set in stone because they were CREATED that way.\n\nBut the truth is, you've LEARNED to be a quiet person. You've LEARNED to be reserved. And someone who is outgoing LEARNED to be outgoing. We just LEARNED these things at a very young age. Often, without even KNOWING this learning was taking place at all.\n\nAnd yeah.…maybe it seems unfair. Just like it's unfair that some kids grow up learning two languages from their parents, while the rest of us weren't so lucky. They didn't have to necessarily work for it, they just happened to grow up in an environment where their parents spoke two different languages…\n\nAnd for everyone else that wants to be bilingual? They have to put in the work. They have to study. They have to find a teacher. They have to practice. They have to IMMERSE themselves.\n\nThis is EXACTLY the same with your social skills.\n\nYes, your upbringing has shaped it; and yes, you've had traumatic experiences that have shut you off from people and make it very difficult and scary to open up... you've experienced past failures that make rejection very painful…\n\n...but it didn't have anything to do with the way you were born or the structure of your DNA. You just happened to LEARN certain skills and to behave in particular ways.\n\nSo think about it… if you wanted to travel to, say, Italy (maybe you wanted to live there!), and you really wanted to learn to speak Italian; but you weren't one of the lucky kids who was born with Italian-speaking parents… do you just give up?\n\n\"That's not me. I'm one of those non-Italian speaking people. That's just the way I am.\"\n\nNo! That's ridiculous! You just have to LEARN.\n\nSo, what do you see here? You don't have to just settle for being the quiet, reserved, awkward person that you feel you are. You just have to learn that \"second language,\" learn that new way of being: the SKILL of being social and confident!\n\nThe good news? It can be much easier than learning a second language if you do it right.\n\nSo if you want to overcome these problems, be more social, and NOT be stuck the way you've learned to be, then let's continue this conversation. Comment with what specifically you'd like to learn how to do to transform your social life (or of course feel free to message me if it's too personal).",
        "created_utc": 1675707870,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with monologues",
        "author": "Endroine",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdvbi/how_to_deal_with_monologues/",
        "text": "How do you deal with a person that has monologues about boring subjects? My bf continuously talks about his work and legit the most detailing details and i need all my social power to not say 'i dont give a shit.' And I promise this is not me being an asshole because I genuinly want to listen when he tells about his worries and hardships or good things that happened (all he says is negative or complaining and critisizing) it just takes all my energy. I'm trying to make it a conversation every time but there's just nothing i can say because i dont know or care about the subject. \n\nHow do i try to make him stop having these monologues and actually have a conversation.",
        "created_utc": 1675707737,
        "upvote_ratio": 1.0
    },
    {
        "title": "When someone insults you, they aren’t insulting YOU. They are insulting their current perception of their understanding of your identity which is NOT you.",
        "author": "Amazing_Reserve_8002",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdtq0/when_someone_insults_you_they_arent_insulting_you/",
        "text": "I hope you feel more confident now.\n\nEdit: Thanks for the awards, i'm really appreciate it. The 5 bear awards really touched me though ngl. You guys need to spread good knowledge that's what internet is for.",
        "created_utc": 1675707639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to form a friend group and feeling left out and wish I was lucky to experience fun things in my youthful years",
        "author": "postcryglow",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdmkd/struggling_to_form_a_friend_group_and_feeling/",
        "text": "I am 24F. I’ve been a student my whole life. I never really had friends outside of university &amp; classes. For example, I’ll have friends for the duration of the program or duration until I graduate to realize that the friendship lasted because we saw each other in classes and we were so much like classmates and not really friends outside of it. \n\nHappened in high school, happened at my first university and my second university. I keep touch with all of them on social media (Instagram) but that’s as far as things go. \n\nI see people having fun and doing fun things with their friend groups like girls nights, taking trips, dressing up and going to dinner and I can’t help but feel sad and bit jealous inside \n\nI graduate and I have a job that starts in the upcoming months but I’ll be at work 12 hours a day and kind of worried but hope that I find work life balance, but I work night shift and not sure if I’ll ever find the energy but I’m going to make effort because i have been missing sisterhood and sense of friendship and community. \n\nNothing hold me back like it used to because previously my classes were a huge blockage but now I am working and I’ll make enough money to afford tickets, dinner, and nice clothes etc but super worried that I will never find my group of girls and will waste away my youth to be a worker 12/4",
        "created_utc": 1675707198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Needs some advice. Everyone really likes me, but I don't have any deep relationships with anyone.",
        "author": "Level-Hunter2298",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdi7q/needs_some_advice_everyone_really_likes_me_but_i/",
        "text": "So, on the surface, I'm a very popular person. Everyone loves it when I'm around, everyone admires me to a certain time extent, and I can probably walk up to literally anyone and have a nice chat.\n\nBut no one would really consider me their close friend. When people naturally form groups, I'm always the \"outsider\" that they love to have around. This trend has continued in any place where people start to form relationships with each other. I'm never in any inner circles.\n\nAny advice? How do you build these types of relationships with people? I think you know the type that I mean.",
        "created_utc": 1675706929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just did something incredibly scary and I'm panicking a bit right now",
        "author": "Own_Toe9616",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdfov/i_just_did_something_incredibly_scary_and_im/",
        "text": "[removed]",
        "created_utc": 1675706766,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can never speak within a group of 4+ people.",
        "author": "Ok_Refuse_1689",
        "url": "https://www.reddit.com/r/socialskills/comments/10vddug/i_can_never_speak_within_a_group_of_4_people/",
        "text": "When I'm in a group of 2 or 3 people (whether it's online or in person), I'm a fine conservationist. I can be loud, keep the conversation going, etc. But when it's more than that, I can **never** get a word in. It's not because I'm shy, but everybody talks on top of me and no one lets me speak.\n\nI was on on a discord call today with \\~10 of some good friends of mine, we were having fun and all but I don't think I was able to say anything in all 2 hours of that call. I just feel like the instant I start talking, someone talks on top of me?\n\nIn contrast, one of my other friends is extremely loud and can pretty much dominate the conversations (in fact, the group centers themselves around him. When he left, everyone else did because he kept the call vibrant and fun).\n\nWhat am I doing wrong? How can I be more dominant in group conversations? I try to be louder and more confident when I say things but I still get talked over. Am I just not timing my entry properly?",
        "created_utc": 1675706652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad to reply to someone a year later or am I over thinking this?",
        "author": "Liberty-Viceroy",
        "url": "https://www.reddit.com/r/socialskills/comments/10vddfg/is_it_bad_to_reply_to_someone_a_year_later_or_am/",
        "text": "Let me explain, I haven't logged into facebook in years, I haven't used Facebook in so long that I forgot the email address I used to create the account. Until today, for some unknown reason the email address randomly popped into my head so I log into facebook just out of curiosity.\n\nI checked my messages and it was from an old friend who I haven't spoken to since I wanna say 2017? Nothing happened we just kind of drifted apart. No bad blood or anything.\n\nShe sent me a message a year ago saying 'hey man, how's it going?' I'd like to talk to her again but I think I because it's been so long I'm not sure how I'd come accross if I messaged her back now even if I did explain my situation.\n\nAm I right in my assumption or am I over thinking it?",
        "created_utc": 1675706627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel inferior to the nicer people around them/feel unworthy of their help?",
        "author": "Suspicious_Fly7131",
        "url": "https://www.reddit.com/r/socialskills/comments/10vdc59/anyone_else_feel_inferior_to_the_nicer_people/",
        "text": "I have had some troubles in my academic life and have recieved overwhelming support and extra help from the people around.So much so that I almost cried today from the unexpected help I recieved.\n\nI am grateful for everything,but at the same time I feel so out of place,like I shouldn’t be on these people’s radar at all.I feel like I should not recieve help from anyone and only today it dawned on me that I have this problem.\n\nJust a lil’ ramble.Wanted to get it off my chest and see if you guys experienced anything of the sort.",
        "created_utc": 1675706547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alone because I'm depressed, depressed because I'm alone.",
        "author": "Ok_Sentence4133",
        "url": "https://www.reddit.com/r/socialskills/comments/10vda6s/alone_because_im_depressed_depressed_because_im/",
        "text": "[removed]",
        "created_utc": 1675706429,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who ask you what you were going to say after you're interrupted are the best",
        "author": "Live_Bumblebee_8362",
        "url": "https://www.reddit.com/r/socialskills/comments/10vd2cc/people_who_ask_you_what_you_were_going_to_say/",
        "text": "Just had this happen to me and it made me feel like someone actually cares about what I have to say!",
        "created_utc": 1675705955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else ever feel like you always have to initiate hangouts with friends to actually have some sort of social life? Would be so nice to be invited sometimes..",
        "author": "Worldly_Marzipan_513",
        "url": "https://www.reddit.com/r/socialskills/comments/10vd0am/does_anyone_else_ever_feel_like_you_always_have/",
        "text": "[removed]",
        "created_utc": 1675705830,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 groupmate only look at each other when talking in a group",
        "author": "Pretty-Instruction56",
        "url": "https://www.reddit.com/r/socialskills/comments/10vczci/2_groupmate_only_look_at_each_other_when_talking/",
        "text": "So my group consists of 3 people and my other 2 group mates only look at each other when asking questions or talking about an assignment. Not saying that they ignore me, even though it does feel like it sometimes because they're only making eye contact with each other when talking which makes me feel not included. I would ask questions and they would both answer me, but usually when talking about an assignment they would only look at each other. What does this mean?",
        "created_utc": 1675705772,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have so much energy but conversations are so tiring",
        "author": "Normal_Quality_2258",
        "url": "https://www.reddit.com/r/socialskills/comments/10vcydb/i_have_so_much_energy_but_conversations_are_so/",
        "text": "It's almost like I care for the person, I'm interested in them, but I can't be bothered to talk to them. It's just so much effort for me, does anyone feel the same and/or has advice?\n\nLike I much rather just chill with them in silence but they start to feel awkward and start some nonesense one-sided conversation with me after a while and I'm like „okay, okay, really?, woah dude!“ and I seem uninterested to them when it‘s really just me listening to them.",
        "created_utc": 1675705708,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have never had a single best friend because I always end up being third wheeled or eventually left out of the group.",
        "author": "Alone-Fly-1374",
        "url": "https://www.reddit.com/r/socialskills/comments/10vcwcw/i_have_never_had_a_single_best_friend_because_i/",
        "text": "I am ( 22 F) a very social and easy to get along with person. I mainly grew up on video games so most of my Close friends were guys. When I got to college it was really easy to make friends, I was able to make so many cool friends (both guys and girls) but I noticed over the years that I would not know how to maintain my female friendships. I still have a few; but I'll get to that in a second. The problem was that my friendship circles eventually became mainly guys again, and it was a problem because... I'm not really \"one of the guys\" like they would eventually plan things just \"for the boys\" and I was obviously not invited. They would do this often and eventually I felt like I was drifting from them, I didn't know anything about their inside jokes during their hangouts, I was feeling completely left out, like none of them see me in the way I see them... which sucked. Feeling left out with the guys, my close friends, arguably my best friends at the time, was a real heartbreaker. So I thought about this time in my life again and decided that maybe I needed closer female friendships so that I never had to feel left out. Well at first it went well, I was spending holidays with them, we did a gift exchange, I was always invited to almost everything I could go to. But one day a few months before the pandemic, I found out that all my close female friends went to an amusement park without me. I was really upset and sad when I found out, but then I thought maybe they thought I was too busy (since I am pre med) and didn't invite me for that reason. But then it kept happening, one day they went to a beach house, and I was so upset and sad that I finally told them how I felt and they said that they were sorry and it was \"spur of the moment\". We made up and I honestly did see them doing more things without inviting me since then, but obviously I tried to treat it like a \"spur of the moment\" like they said. I want to believe them, and I know they love and care about me. But tonight was honestly the worst night for me. I texted one of my close gfs that I had some gifts for her birthday, that I really wanted to celebrate it with her and that I really really missed her. Then I texted my other best friend that we need to plan something for her bday but she almost kinda ignored my text about the bday and responded to something else I showed her. I thought it was weird but I tried to think nothing of it. Later that night, I was looking at our other friends Instagram and saw that they had all went to a vineyard together to celebrate the birthday. They were there all day today. And I didn't even know about it. These are my actual best friends, and I couldn't help but feel anger, sadness, and loneliness. And I want to text them and say how disappointed I am, and how I had wished I had received an invite but I just don't want to create drama on her birthday. It's not drama to me, it's honestly my feelings. I feel horrible, honestly. I wish I could have a single best friend that I know loved me wholeheartedly like I would love them. It's just so depressing. I value friendship so much and feel like I'm always feeling betrayed and hurt.",
        "created_utc": 1675705578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody feel envy/jealousy towards acquaintances and friends you know that have tons of friends themselves?",
        "author": "No-Caramel3124",
        "url": "https://www.reddit.com/r/socialskills/comments/10vcsk0/anybody_feel_envyjealousy_towards_acquaintances/",
        "text": "I dont have that many friends, because of my social anxiety/awkwardness, so whenever I see a photo of one of my friends/acquaintances with a bunch of their friends, or getting a lot of comments on their social media posts, I get feel so jealous and sad inside. I want what they have so bad but my personality just won't let that happen. And I usually get super guilty once I experience that jealousy.\n\nDoes anybody else feel this way?",
        "created_utc": 1675705327,
        "upvote_ratio": 1.0
    },
    {
        "title": "The best way to get over social anxiety and feeling self conscious is to think about how people react when you secretly judge them (exactly: nothing)",
        "author": "Ok-Impress6050",
        "url": "https://www.reddit.com/r/socialskills/comments/10vcqfh/the_best_way_to_get_over_social_anxiety_and/",
        "text": "I (19F) used to have an extreme social anxiety and would often have panic attacks for seemingly ridiculous reasons. What REALLY helped me was when one day I saw a girl wearing a blouse backwards.. (seriously) When I first saw Her I kinda giggled and I was like.. omg someone needs to tell her.. she was sitting with some friends and no one seemed to care or even notice (it wasn't really obvious) AND THEN IT HIT ME! No matter how hard I'm gonna judge her, no matter how much I would be laughing at that when I remember it SHE WILL NEVER KNOW! And it'll never affect her..\n\nPoint is: when you feel/think that someone is secretly judging you, take a moment and think about how it would never affect you no matter how hard they think about it\n\nin other words OWN IT",
        "created_utc": 1675705197,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it with people and their need to put the “quiet” ones down?",
        "author": "No_Employment_3987",
        "url": "https://www.reddit.com/r/socialskills/comments/10vc9sm/what_is_it_with_people_and_their_need_to_put_the/",
        "text": "I am tired of the fact that being “quiet” or not as talkative at first is such a problem for everyone. How does this immediately equalize with being boring? Why is it that people always go for loud, very chatty people who only have that to offer? Ive noticed that at my workplace, everyone’s so connected with one another and I feel like they have labeled me as the shy, quiet one even tho all I do is hold small talks with them for the sake of their wish because every time I shift convos to other directions, people seem to just get bored or lose interest. I am just exhausted of everyone not leaving me be myself and think I’m enough just because I am not all chatty about daily things. And the way everyone now uses the word “quiet” in such a degrading way, when in their mind they’re thinking of “boring”.\n\n edit: thank you guys so much for taking your time to talk about this. I genuinely thought It’d just be another impulsive post of mine that’ll go unnoticed, but I was thrilled to read the comments. There were so many helpful tips, and I feel enlightened just having read what you had to say! Also thanks for the awards :’) precious.",
        "created_utc": 1675704130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't be the person who gossips negatively about other people.",
        "author": "Thick_Baseball6807",
        "url": "https://www.reddit.com/r/socialskills/comments/10vc6yo/dont_be_the_person_who_gossips_negatively_about/",
        "text": "I understand that people gossip, and I'd be lying if I said I never gossip. HOWEVER, if you're the type of person who is a chronic gossiper and can't hold a conversation without bringing someone down, people will stop talking to you.\n\nIt's hard to trust someone who is a chronic gossiper. You're always questioning what kind of stuff they're saying behind your back because they are talking behind your back. If your conversation can't hold without talking negatively about someone, you know you're the topic in a different conversation.",
        "created_utc": 1675703950,
        "upvote_ratio": 1.0
    },
    {
        "title": "I always feel like no matter how close I am with a person that nobody likes me.",
        "author": "Witty_Ant2169",
        "url": "https://www.reddit.com/r/socialskills/comments/10vc4qz/i_always_feel_like_no_matter_how_close_i_am_with/",
        "text": "[removed]",
        "created_utc": 1675703810,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know who I am",
        "author": "No_Scene7884",
        "url": "https://www.reddit.com/r/socialskills/comments/10vc322/i_dont_know_who_i_am/",
        "text": "I dont really know what kind of personality I have. I'm always switching and switching based on the person I'm talking to. I wish i could just get one of my own and stick with it",
        "created_utc": 1675703703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is being antisocial a bad thing?",
        "author": "IsaacBoaz123456",
        "url": "https://www.reddit.com/r/socialskills/comments/10vc03t/is_being_antisocial_a_bad_thing/",
        "text": "I’m 21 years old and I’m a little bit antisocial. A lot of people my age like to go out and party, go to clubs, that type of thing, whereas I just like to stay home and chill during my free time. I’ve never really been a “party” type of person, my way of having fun is staying home and playing video games, watching a movie, or something like that. I’m not saying I hate people or anything like that, I’m just super socially awkward and I enjoy the peace and quiet of my own home. Is this a bad thing? Some people say that I’m weird and that I should go out more, should I go out more and learn to be more social, or is it okay to be antisocial?",
        "created_utc": 1675703515,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADVICE: Be honest with friends, especially if they are doing something wrong which is making you hurt. If you wish to stay as friends, this could save your friendship. A good friend should understand, apologise and change.",
        "author": "Busy-Instruction7814",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbz0j/advice_be_honest_with_friends_especially_if_they/",
        "text": "I know that it can be so difficult to point out such a thing to a friend. You might feel like maybe they won't understand, that maybe it will worsen things or you are simply too shy. I get that but it will do you so much good and will take so much sadness off your shoulders.\n\nIf you have a friend that is a decent human being: they should understand you, apologise and change for the better; allowing you both to stay happy and to stay as friends. You also need to understand that your friend most likely didn't mean it on purpose. They didn't intentionally want to cause you sadness. Don't take it so personally.\n\nAs an example (if you are interested) once a friend said something that hurt me quite a bit, but I pointed it out to them and they realised their mistake:\n\n*We were discussing jewellery and a friend told me that she remembers that I have a silver bracelet on my hand. I was surprised that she knew that. She later asked me what jewellery she wears and I didn't know and I got it wrong. She then says \"It just depends on how much someone cares\", implying that I don't care enough about her to remember what she wears. This instantly made me sad as I clearly do care about her and what she said isn't true. I pointed it out that what she said made me sad and she instantly realised her mistake. She explained to me that she wanted to say that SHE cares about ME, but it just came out wrong. I felt better now knowing that it was just a misunderstanding, and we were all good. She apologised and that was that. I didn't bottle up my feelings and I didn't get negative thoughts. It made me feel so much better.*\n\nTrust me, being honest will do God's work for your relationship!",
        "created_utc": 1675703447,
        "upvote_ratio": 1.0
    },
    {
        "title": "My coworker used me as a confidence prop to make other friends",
        "author": "cuz78910",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbyzm/my_coworker_used_me_as_a_confidence_prop_to_make/",
        "text": "A bit of a rant. A coworker I pass by on occasion and engaged in small talk a few times said we should hang. \n\nWe get around to talking and I find out he's been strictly going to work and going home and doesn't have much of a social life. No judgement here, I was much the same not long ago. \n\nWell he invites me out...to a Meetup for people to mingle and get to meet new faces. We meet each other there and I feel a bit overwhelmed honestly. I talk to some people and even him a little. But he seemed more interested in meeting the others. I bowed out after maybe an hour. \n\nI guess it would've been nice to get to know him a little better one on one. Instead I feel a bit used - having a \"friend\" (using that term loosely) made him confident to seek out a social gathering. He doesn't reach out anymore and we just kind of give a friendly nod to each other around the office. \n\nHe still goes to those meetups and has met some cool people from the sound of it. All kick-started by using me it feels.",
        "created_utc": 1675703445,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to accept not having any friends and be okay with that?",
        "author": "manic_unicorn",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbwu6/how_to_accept_not_having_any_friends_and_be_okay/",
        "text": "I am looking for advice on how to accept the fact that i don’t have any friends and be okay with it. I am always actively pursuing ways to make friends but it’s been over 10 years and just still hasn’t happened for me yet unfortunately. So i am at the point where i’d like to just accept that i won’t have any friends and be okay with that. Any advice? What are some things you do to fill the void of not having a social life? I read a lot but looking for other things. Thank you!",
        "created_utc": 1675703312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I have told my colleagues that I had my dog put down?",
        "author": "AgingLolita",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbwnc/should_i_have_told_my_colleagues_that_i_had_my/",
        "text": "I told a colleague earlier today and that she (my dog) had been ill for a long time, and very ill for two weeks. My colleague told me I should have said something about it sooner because it would have explained why I was so upset.\n\n1. I didn't realise it showed\n2. I didn't realise it was anyone's business.\n\nShould I have done this differently? I'm having a very difficult time adjusting to my dog's death and didn't want the burden of anyone fussing around me.",
        "created_utc": 1675703299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confidence is key",
        "author": "RealityOdd6868",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbtlu/confidence_is_key/",
        "text": "I used to be really introverted because I was bullied, and very self conscious. Then one day I said forget it and I decided to stop caring what others thought of me, and I stopped trying to please everyone/fit in. Because of that my confidence skyrocketed, and now in new social situations I have no problem being myself and talking to new people! When you really don’t care what they think of you, it’s so much easier to let go and be yourself. I know it’s a lot easier said than done, but I personally am very grateful for the confidence I have now. As always, you do you and don’t let anyone tell you that you can’t be yourself, but to me loving yourself and having confidence in your abilities is one of the best social skills out there\n\nUpdate: I did make this sound much easier than it is to do, it took me a long time to truly become comfortable in my own skin, and to get that confidence in my personality. But because I’m happy with myself I don’t feel the need to change to fit in, or be who others want me to be, which is what I was referring to when I say I don’t care what others think. But my main point is be happy with yourself, and love yourself. Although it can be difficult to accomplish, it’s well worth it :)",
        "created_utc": 1675703098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is saying, \"I'm meeting with a friend\" assumed to be a date.",
        "author": "deith69420",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbtil/why_is_saying_im_meeting_with_a_friend_assumed_to/",
        "text": "[removed]",
        "created_utc": 1675703093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aren’t people genuinely nice?",
        "author": "Ok_Nefariousness8851",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbpza/why_arent_people_genuinely_nice/",
        "text": "I feel like I go out of my way to be just genuinely nice to my friend or people in the group. Always offering what I can, comment on a pic, helping grab something, reaching out to invite others to come(this is a big one) etc. I know this doesn’t feel like a big deal but it seems like nobody else is matching me? Maybe it comes off as socially awkward or too available? I don’t know.\n\nI just try to treat people how I want to be treated. Ex. I love it when people invite me so I invite them\n\nEdit: I’m not expecting anything in return. I’m just wondering why my actions don’t always come off as “just being nice”. Or maybe they do and it’s just me over thinking it. I just feel like when I’m nice to people they take it as too eager, or like I need them to have fun bc I don’t have other friends, or that I’m a pushover when really I’m just trying to be outwardly nice and do what I can to make people’s lives easier.\n\nI’m not talking “big acts” of kindness either. I usually just always comment/like people’s pics, give compliments, invite them to the group, carry something if their hands are full, offer to help with little things etc.\n\nTl:dr I just don’t like to come off as weak when I’m not.",
        "created_utc": 1675702859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else here feel like a \"guy/girl next door\"?",
        "author": "CuriousCODR_5",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbo5e/does_anyone_else_here_feel_like_a_guygirl_next/",
        "text": "For context, by saying \"a guy/girl next door\", I (19M) mean someone who is perceived as familiar, approachable, and dependable not in a romantic context, someone who you would call last when inviting people to go out, someone who you wouldn't call a friend, but rather a close acquaitance, someone, when teaming up for projects, you would pick if all other options wouldn't be available. Basically, a \"spare\" friend, who you wouldn't visit if they were at the hospital, because they just aren't that close to you.",
        "created_utc": 1675702767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nearly always the second choice for everybody. Could this have affected my ability to bond with other people?",
        "author": "Fit_Fee_4779",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbn3h/nearly_always_the_second_choice_for_everybody/",
        "text": "In school I've always been the second choice for nearly all people. As I got older I developed some kind of issue with bonding with other people and caring for them. I take extremely long for this.\n\nCould this be the reason for this? And does someone experience the same thing?",
        "created_utc": 1675702695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else not see their birthday as a special day?",
        "author": "Interesting-Key-2198",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbkou/does_anyone_else_not_see_their_birthday_as_a/",
        "text": "It’s not cuz I think I’m more mature or even because I’m depressed. It’s just that my family doesn’t rly give much importance to birthdays and certain holidays (eg:Mother’s Day or Valentine’s Day etc).\n\nAnd tbf because I’ve always had a small circle of friends so I’d either do something small with them or a lot of the times not even that, and I mean that in the least saddest way lol.\n\nAnd maybe because of that over time I’ve just not really cared about birthdays much and I don’t know if people would see that as sad or weird.\n\nBut like I honestly don’t care much, im fine with people saying happy birthday and going about their day. I’ve got my 18th coming up and i know it’s supposed to be a big thing, but I wouldn’t mind if it isn’t.",
        "created_utc": 1675702534,
        "upvote_ratio": 1.0
    },
    {
        "title": "My housemates use the kitchen as a social area, how do I get over my anxiety and cook when I want?",
        "author": "Da1sycha1n",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbh1u/my_housemates_use_the_kitchen_as_a_social_area/",
        "text": "So my housemates are using the kitchen as a hang out spot and almost always in there. \n\nI work a tiring job teaching under 5s and I often don't have the social battery to have a big chat after work. They are both quite intense people who like to be honest and open about their feelings (and one of them has a 3 year old!!). Last week one of them called me rude for telling them that I wasn't up for having a chat whilst I was cooking... they are all about connection, authenticity etc... but it just tires me out to keep up with small talk/big talk all the time. I have told them this and they said they understand but I still feel almost afraid to go downstairs and deal with either 1) having a chat when I don't want to or 2) having to be awkward and express that I don't want to talk. Also, the kitchen has a small cooking area... there's only space for one person to do food prep at a time... I'm just tired and anxious so the thought of navigating any social situation right now feels like a lot.\n\nI really wish there was a way I could say hi and use the kitchen without engaging in a full on conversation but I worry this will seem rude or awkward. I'm sure I'm overthinking it but any advice for navigating this, or polite ways to say 'hi, not up for chatting, just here to cook' would be amazing",
        "created_utc": 1675702293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Anyone Else Bad at Telling Stories?",
        "author": "Apprehensive_War2124",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbf8z/is_anyone_else_bad_at_telling_stories/",
        "text": "I'm asking this because of my past conversation with my Psychiatrist where I tried telling her a story but I just ended up pausing a lot of times during the story just to remember the exact details of the story or the exact order of the events of that story. She then asked me if she should call my parents instead so that they can explain for me. She told me that I kinda had a \"slow brain\". And I was hurt by this but I agreed that she can call my parents to explain for me. So after that conversation, I kept thinking whether or not I really have a slow brain. And then I realized that I don't think I've ever actually told a story to anybody before that conversation.",
        "created_utc": 1675702175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody else randomly think about someone they haven’t talked to in years and wonder if they ever think about you?",
        "author": "Consistent-Tea9762",
        "url": "https://www.reddit.com/r/socialskills/comments/10vbb90/does_anybody_else_randomly_think_about_someone/",
        "text": "Sometimes I will just be day dreaming and I start thinking about someone I was friends with when I was younger or maybe a teacher that made an impact on my life and I wonder if they ever think about me. Do you guys ever randomly think of people you haven’t talked to in years? Every time this happens it makes me wonder if I made a big enough impact on their life for them to ever think about me and I wanted to see if this is something other people experienced.",
        "created_utc": 1675701911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whenever you feel awkward around people remember they don't care as much as you think.",
        "author": "SpecialAway7283",
        "url": "https://www.reddit.com/r/socialskills/comments/10vb9ci/whenever_you_feel_awkward_around_people_remember/",
        "text": "We get worried about how we come off towards others and it's really just a waste of time. Maybe you got food stuck in your teeth and people around you mention it. Most likely you'll say something like \"omg I can't believe it! That's so embarrassing\" and make a big scene out of it. Really all you have to do is say \"whoops my bad, I'll fix that\" and carry on with the conversation like it didn't phase you. People react to how you react so if you care too much it's gonna cause more attention but if you don't care people won't care either. Other people don't care and are probably worried about themselves to so stay cool and collected there's nothing to be worried about.",
        "created_utc": 1675701788,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to recover a new friendship/relationship after being left on “read”",
        "author": "Inside_Push_6238",
        "url": "https://www.reddit.com/r/socialskills/comments/10vb5ql/how_to_recover_a_new_friendshiprelationship_after/",
        "text": "This recently worked for me so I figured I’d share.\n\nSo you and your new friend/prospective partner and having a lovely conversation, and all of a sudden, they stop responding. Where do you go from here?\n\nFirst thing’s first, give them an hour or two. Maybe they got caught up with something personal or work related. It doesn’t mean they hate you, just that they thought their time was better spent elsewhere.\n\nIf a lot of time goes by and you still haven’t heard from them, add something new to the conversation. Don’t say “where did you go,” add an afterthought to the last thing you said, or even something new and interesting. It’s more likely to pull them back into the conversation and doesn’t paint you as begging for their attention.\n\nIf you get left on read again, don’t say anything else. Wait a few days. You have better things to do with your time than talk to someone who’s not listening. Your time is just as valuable as theirs, and this gap in time will let them know that. I suggest 3 days to a week.\n\nTry one last time, this can be a simple “hey,” but really anything works. If they have any interest in talking to you, they should respond at this point. If they don’t, they weren’t worth it in the first place and it’s time to move on to someone who really respects and values you.",
        "created_utc": 1675701554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Geez, I'm officially two-decades-old...",
        "author": "Ok_Swing_9514",
        "url": "https://www.reddit.com/r/socialskills/comments/10vb3rd/geez_im_officially_twodecadesold/",
        "text": "WOW! that's actually a scary fact, just the other day I was 16 years old, time really flies man.\n\nThis post is just something I wanted to get out there. A part of me is kinda sad that my teenage years is done, but another part is excited about the future. I have learnt A LOT of things over these past years, everything from always being honest to friends to always enjoy the little things in life, I have experienced so much yet I can't help but feel as if I haven't fulfilled what most people have.\n\nI have never been in a relationship before (just situationships that all go south), I have never done things on the spur of the moment and from what I recall, I don't have any really embarrassing moments or stories to tell from a wild night out.",
        "created_utc": 1675701422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Realized I've Been Carrying My Bullied, Powerless Childhood Self Around Me Everywhere For Years (Ready For A Change)",
        "author": "Old_Boysenberry3832",
        "url": "https://www.reddit.com/r/socialskills/comments/10vb0os/just_realized_ive_been_carrying_my_bullied/",
        "text": "It is the early, early morning. The birds are just waking up, and I just woke up from a kind of habitual social anxiety nightmare where everyone I knew and cared about mistreated me, disregarded me, laughed at me. I was trying to deliver some object across some magical realist expanse, in a kind of Willy Wonka's Chocolate Factory environment, and met all these people in my life along the way. Their abuses and extraneous factors thwarted my mission to deliver the object over and over again. Often for many years now I have these dreams of social ostracization. While the people in the dreams and the interactions seem utterly real, the environment is always magical in some sense, which exacerbates the feeling of powerlessness and unknowability.\n\nI've made great strides in the realm of self love and self compassion recently. But in interpreting this dream tonight, I realize for the first time just how much being bullied as a young girl (I'm now a transgender man) shaped my current almost subliminal (so engrained they are hard to see) feelings of inferiority compared to others. THE DARKEST PART IS, these feelings of inferiority have had me act in people pleasing ways which actually do manifest in some people (who are maybe predisposed to bullying) seeing me as inferior, someone not as worthy of respect, someone to use, even if they feel this way only unconsciously. In any case, I am now taking responsibility for the role I have played in my own victimization. At the same time, I must work hard to develop self compassion insofar as realizing the bullying in the past did not happen because of any inherent deficiency within me. Back then, it really wasn't my fault. In learning to not blame myself for the past abuses, I hope I can take accountability for my own desires to be treated with respect today. Also, it is only a fraction of my friends and loved ones who treat me with this lack of respect. Most do. But the wound opened by these types of bullying people in my life have a disproportionate impact because I think another aspect of having been bullied is that I'm also inherently suspicious of people who claim to care about me, or my peers in general.",
        "created_utc": 1675701215,
        "upvote_ratio": 1.0
    },
    {
        "title": "21 looking for advice on how to culture a sense of humour and be able to make small and deep talk",
        "author": "ExpensivePhysique",
        "url": "https://www.reddit.com/r/socialskills/comments/10vb0ao/21_looking_for_advice_on_how_to_culture_a_sense/",
        "text": "For clarity, I’m autistic, so my brain doesn’t click pieces together like it should.\n\nI desperately want to develop social skills and a sense of humour, as I don’t even know if I even have a proper friendship anymore.\n\nI’m struggling with a lack of social skills, namely I can’t keep a conversation going for that long, or make any humour pis comments, which has destroyed my chances of a social and/or love life.\n\nThis is even worse for me since I’m from a country where all the normal people have very quick and witty humour, I’m mentally slow due to the level of autism I have, and I never really had a chance to develop proper social skills earlier in life.\n\nPlease help, I want to be better than this, and I’m sure that with your tips and tricks I can be!",
        "created_utc": 1675701188,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being so awkward?",
        "author": "Designer_Access_5664",
        "url": "https://www.reddit.com/r/socialskills/comments/10vay18/how_do_i_stop_being_so_awkward/",
        "text": "I've never been diagnosed , but i'm certain i have social anxiety. I know i have a lot to offer; but in conversations with people, i just go blank. When im drunk or high,im the light of the party. I am funny and i'm witty and i have interesting things to say. I'm drawn to people like this because i know thats how i am... but i cant Let It Out. Its almost like i'm afraid. My mind blanks and i come off as so uninteresting and boring and someone i wouldnt even want to talk to , myself. And it sucksss so muchhh. I wanna be their friend so badly. I want to be myself without needing drugs. I quit weed recently because it was messing with my mental abilities( as fucked as they already are), but my anxiety is full blown back now as a result.\n\nAnyone else feel this? What did you do? What can i do?",
        "created_utc": 1675701044,
        "upvote_ratio": 0.5
    },
    {
        "title": "I think I'm a relatively boring person.",
        "author": "r3dc1ph3r",
        "url": "https://www.reddit.com/r/socialskills/comments/10vaxle/i_think_im_a_relatively_boring_person/",
        "text": "[removed]",
        "created_utc": 1675701017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overreacting??",
        "author": "RacoonMan22",
        "url": "https://www.reddit.com/r/socialskills/comments/10valat/am_i_overreacting/",
        "text": "[removed]",
        "created_utc": 1675700205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I talk too much?",
        "author": "Hash_Hasher",
        "url": "https://www.reddit.com/r/socialskills/comments/10v9owj/did_i_talk_too_much/",
        "text": "Well for starters I am an Introvert. I rarely have a full conversation with people, I either just reply with a few words or just laugh nervously (idk why I started doing that to be honest). \n\nBut there is an exception, I can have a full conversation when it’s between people that I never knew or never knew me. And the ending is always almost the same, most of them just disappears mid conversation. Not in abrupt way though, they always say they have other things to do. And in a couple of minutes they never came back to continue the conversation, instead just go to another group to talk.\n\nSo I’m genuinely confused at this point. Is it my fault?\n\nBecause I did what I supposed to do every time, I rarely talk about myself and always putting them first. I follow their body movement slightly so they are more comfortable when talking to me. I know it doesn’t sound natural but Im an introvert in general so I can’t really help it.\n\np.s tbh I just wanna take this off my chest by writing this cuz I’ve been thinking bout it all day.\n\nThanks for reading :)",
        "created_utc": 1675698070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes people seem to assume I'm (male) gay?",
        "author": "Switch_B",
        "url": "https://www.reddit.com/r/socialskills/comments/10v9irc/sometimes_people_seem_to_assume_im_male_gay/",
        "text": "I grew my hair out and now have a look that might suggest I'm not straight to some people. Since my hair has gotten past my shoulders people seem to interact with me differently, especially women. For example, in one of my last college courses I sat next to a woman and we became casual acquaintances for the class, talking during down time, doing small group assignments, etc. She would talk to me about \"girlier\" things than any woman ever has with me. She would show me pictures of her boyfriend to show me how cute he is, which no woman has ever shown me before. Several times she brought up topics like makeup, skin care, hair care, as if I had a lot of experience with these things. All I do is take care of my hair but it seems to have a lot of implied baggage with it. \n\nShe never said anything outright (and maybe I'm just thinking way too hard about this) but she seemed so comfortable sharing these things and seemed so confident that I wasn't interested in her that I'm convinced she thought I was gay. For full context, I'm bi but wouldn't have mentioned that under any circumstance at the time. It just felt very different from my friendships with the opposite sex in the past. I've been wondering since, if she had known that I wasn't gay, would she have been as open with me or discussed the same topics? Would she have thought I wouldn't want to talk about hair, makeup, or her boyfriend if she thought I was straight?\n\nIt makes me a little uncomfortable how differently some strangers interact with me too. When I had short hair and looked like a traditional man, strangers just didn't talk to me, period. Now I have random people striking up conversations in public, I get compliments from women and men alike, which feels great ngl, but it seems like nobody was ever comfortable approaching me like that when I looked like everybody else. \n\nI just don't really understand why people would be treating me so differently and the only major difference I can think of is that maybe women think I'm gay and less likely to misinterpret their complements as a sexual advance? Or maybe people find a more feminine appearance more approachable just cause? Probably both? What do you think, random internet stranger?",
        "created_utc": 1675697650,
        "upvote_ratio": 1.0
    },
    {
        "title": "I continue to feel uncomfortable around women even after being married",
        "author": "Khazar_Dictionary",
        "url": "https://www.reddit.com/r/socialskills/comments/10v9f9h/i_continue_to_feel_uncomfortable_around_women/",
        "text": "[removed]",
        "created_utc": 1675697417,
        "upvote_ratio": 1.0
    }
]