[
    {
        "title": "how to stop being scared to go to the gym",
        "author": "aizenaya",
        "url": "https://www.reddit.com/r/socialskills/comments/11ll1e1/how_to_stop_being_scared_to_go_to_the_gym/",
        "text": "hello, i got a lot of weight recently and i wanna lost it before july arrives. i am 14 and i stopped being to school last year so yeah socially i am really bad. I asked my dad to bring me on the gym to make me discover but i didn't like it at all. I was the only one that was really small, that was 14 and i felt like i was watched by everyone.. my anxiety is impossible to control.. i stopped school because of it but i want to at least go to the gym.. i dont wanna look fat when i go to the beach on my country..",
        "created_utc": 1678246421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to tell people you are lonely or will that just make them pity you.",
        "author": "Silly_goose_rider",
        "url": "https://www.reddit.com/r/socialskills/comments/11lkv7a/is_it_okay_to_tell_people_you_are_lonely_or_will/",
        "text": "?",
        "created_utc": 1678245961,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find social groups?",
        "author": "Illusive_Owl",
        "url": "https://www.reddit.com/r/socialskills/comments/11lkgxk/how_to_find_social_groups/",
        "text": "When I asked people in general where they’ve made friends I hear’ “high school, work, friend of a friend” but I was wondering are there ways to locate social groups or events? For me I feel like I’ve already gone through coworker I could but also thought what about people who work remotely or at a job where the staff is small or they work independently, how do they get their social needs met? I’m aware of meet up but haven’t had much luck with it as the use base in my town is small and not really have many people around my age (mid-twenties) while a lot of the user base on meet ups locally is people who are in their 40s and 50s at a different point in their lives where I don’t feel I can relate or connect with them. Is moving my only real option?",
        "created_utc": 1678244913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for dealing with evasive people",
        "author": "papasaturn",
        "url": "https://www.reddit.com/r/socialskills/comments/11lkfu7/tips_for_dealing_with_evasive_people/",
        "text": "People who you can’t just avoid (coworkers, etc.). The more I try to clarify information with these types of people the more they play games (confuse you, poke at you, change the subject, etc.)\n\nI feel like I have to be so clear and almost lawyer like when speaking to people like this. When I’ve phrased questions in such a way they almost change personalities and act strange. Sometimes I think end up leaving the conversation more confused than when I entered it. When I do end up getting the information I was looking for it seems like such a huge amount of energy was wasted on both sides.\n\nI have a feeling it has to do with how direct I am when it comes to things but I don’t know how to else I’m supposed to get information from people.",
        "created_utc": 1678244831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you go from acquaintances to friends?",
        "author": "isjs8sj",
        "url": "https://www.reddit.com/r/socialskills/comments/11lk32q/how_do_you_go_from_acquaintances_to_friends/",
        "text": "I assume this is like some kind of a spectrum. On the far left, we have \"acquaintances\"-type conversation topics, like the weather, the traffic, the news, etc., - very non personal topics.\n\nBut then when we go to the far right, we have \"extremely friendly\" topics, topics that you only talk about with your best friends (I assume), such as your hopes and dreams, your dark secretes, etc. \n\nAt least this is how I always imagined it.\n\nBut what are the topics in the middle? I guess talking about your favorite sports would be somewhere in the middle, but how do you steadily, over time, progress from left to right? What type of topics do you talk about and in what order?",
        "created_utc": 1678243923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people try to come over or invite themselves over after they’ve been told they can’t come over?",
        "author": "Darkmaskdiva89",
        "url": "https://www.reddit.com/r/socialskills/comments/11lise5/why_do_people_try_to_come_over_or_invite/",
        "text": "I’ve had to end longtime friendships and new friendships since moving to this place where it’s too inconvenient and invasive to have company. I keep telling people they can’t come over and I also now refuse to give people my address.",
        "created_utc": 1678240590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people try to do things like invite themselves over or come over when I have told them it’s not ok?",
        "author": "Darkmaskdiva89",
        "url": "https://www.reddit.com/r/socialskills/comments/11lif3x/why_do_people_try_to_do_things_like_invite/",
        "text": "[removed]",
        "created_utc": 1678239622,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel aggressive when trying to act confident. But tired of being “too nice”",
        "author": "ObjectiveIngenuity20",
        "url": "https://www.reddit.com/r/socialskills/comments/11lh37p/i_feel_aggressive_when_trying_to_act_confident/",
        "text": "From my observations, to not look arrogant, confidence has to be combined with friendliness and smile. \nWhat do I do if I don’t like being too nice and warm, especially with strangers? (It feels to me like being a people pleaser).\n\nSo possible combinations are:\n\nInsecure + cold = looks shy and scared\nInsecure + friendly = looks like a people pleaser\nConfident + cold = looks arrogant and rude\nConfident + friendly = probably looks good but feels like too much..\n\nSeems like I just hate being “nice” to people? Lol. It really feels a bit humiliating sometimes especially when done out of anxiety.",
        "created_utc": 1678236213,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do offline people talk about",
        "author": "2great2deny",
        "url": "https://www.reddit.com/r/socialskills/comments/11lgz9g/what_do_offline_people_talk_about/",
        "text": "[removed]",
        "created_utc": 1678235932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel like they are obligated to act insecure and unconfident?",
        "author": "ObjectiveIngenuity20",
        "url": "https://www.reddit.com/r/socialskills/comments/11lgnjo/does_anyone_feel_like_they_are_obligated_to_act/",
        "text": "I could just say “I am not confident”, “I am shy” but it feels like I am completely different on the inside. And I act insecurely because “I have to”, that’s my role for a lifetime and I do not deserve any better. And people will think I am being aggressive or showing off or just funny for trying to step out off this role of a shy person. As if I was trying to fake French accent while I am not French.\n\nIt feels like everyone else in this is allowed to be confident but not me. \nAnd if I dare to they’ll look at me as at a child pretending he/she is an adult.\nI don’t have sever anxiety. Just this strange awkward feeling and fear",
        "created_utc": 1678235111,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to prevent conversations from always being superficial?",
        "author": "No_Ranger_120",
        "url": "https://www.reddit.com/r/socialskills/comments/11lfti0/how_to_prevent_conversations_from_always_being/",
        "text": "Hi. I'm kind of at a loss right now because I don't know what to do. When I'm socializing, if I fake myself and pretend to be happy and engaged, I can keep a conversation going but it always feels draining and superficial and I feel like it hinders my ability to form deeper, genuine friendships. But on the other hand, if I really just try to be myself, I feel like I'm so boring to talk to and I just can't keep a conversation going, especially when I don't really know someone. I don't know what to do. How do I be an interesting person while also being myself and not letting the conversation always be so shallow?",
        "created_utc": 1678233116,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to talk about with people you don’t know well?",
        "author": "ThrowRAshmeyah",
        "url": "https://www.reddit.com/r/socialskills/comments/11lfakx/what_to_talk_about_with_people_you_dont_know_well/",
        "text": "I get pretty quiet on dates or with friends of friends idk. I’m usually an observer or will just react to what the other person is saying if it’s 1 on 1. I want to bring more to the conversation and be more expressive/interesting. Any good book recommendations or advice for this?",
        "created_utc": 1678231860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lack of social skills impacting relationships",
        "author": "cowboybootzzz",
        "url": "https://www.reddit.com/r/socialskills/comments/11lf9xd/lack_of_social_skills_impacting_relationships/",
        "text": "Not sure if this is the right place to ask for advice, but I am naturally a quiet and introverted person. When I have thoughts, it doesn't necessarily occur to me to share them when I'm in conversation with someone, and I never know how to keep a conversation going. But when I try and pressure myself to speak, it's like my mind goes blank. It tends to impact my relationships and people that I try to get close with, because they can't get close to me. Does anyone have any tips on how I can be more extroverted/talkative/engaging?",
        "created_utc": 1678231817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I smile so much?",
        "author": "Demonicspy",
        "url": "https://www.reddit.com/r/socialskills/comments/11lexk7/why_do_i_smile_so_much/",
        "text": "     Growing up, I was always given compliments about my smile. I always thought it was because I was a goofy looking kid with a cleft pallet.\n\nAs I grew older, I still managed to keep that shy smile. You can tell me horrific news, and I would probably still smirk a bit. I mean, that's a bit of an exaggeration, but you get the point \n\nI see people's faces light up when I genuinely smile.\n\nHowever, it can come off a bit weird. I always smile whenever I'm in someone's presence. I get overly excited. I was never diagnosed with autism, but with this information, would I fall in the spectrum?",
        "created_utc": 1678231029,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with a toxic friend?",
        "author": "phantomsort",
        "url": "https://www.reddit.com/r/socialskills/comments/11ldonm/how_to_deal_with_a_toxic_friend/",
        "text": "I met him, let's call him Travis, in my junior year of high school and we instantly clicked. We liked the same games, music, etc. He was one of the funniest people I know and we had great memories together. \n\nFast forward to now, we haven't seen each other in a while (because of quarantine). So, I reached out and reconnected with Travis and he has changed. Travis gets silent or furious toward others when losing (in a casual/unranked game mode), constantly gossips/lies about other friends behind their backs, and uses the hard-r and other slurs in almost every sentence. A good friend of mine kindly asked Travis to stop being so mean to him. Travis responded, \"But I'm a dick to everyone though.\" And the bullying continued. \n\nAt times, it feels like a coin flip of whether or not he'll be somewhat nice to everyone. Making a small mistake in a game is enough to make him ballistic and it's becoming stressful/unfun to play or be with Travis.\n\nShould I continue to put up with the behavior or follow suit with other friends and leave too?",
        "created_utc": 1678228288,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I start talking to a girl I see everyday at school?",
        "author": "goofyuhh",
        "url": "https://www.reddit.com/r/socialskills/comments/11lct1i/how_can_i_start_talking_to_a_girl_i_see_everyday/",
        "text": "[removed]",
        "created_utc": 1678226391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with Passive Aggressive Friend",
        "author": "Interesting_Bit_2208",
        "url": "https://www.reddit.com/r/socialskills/comments/11lcs0p/dealing_with_passive_aggressive_friend/",
        "text": "I've had this friend that I've known since 7th grade, though I don't really remember becoming good friends with them until our sophomore year of high school. Overall, we've known each other for about 5 years now. We don't talk much outside of school, and even in school, we don't discuss much outside of homework.\n\nRecently, she's taken to being very passive-aggressive. She nitpicks and criticizes everything I say, and is always trying to find fault in my words. We're both considered advanced students and have high expectations of myself due to mental health issues like anxiety, and she constantly criticizes me for freaking out about tests and work, even though, as I mentioned before, I've been diagnosed with Generalized Anxiety Disorder by my therapist.\n\nOne really good example of this was when I was talking about an experience with an ex that deeply hurt me, she takes it upon herself to announce to the whole friend group some clearly sensitive and very intimate information. Afterward I called her out from informing her that I told her not to tell people she says, \"I'm sorry, I forgot.\"\n\nAnyway, I normally brush off her comments or I correct her while she tries to correct me and get her to shut up. Today, however, she just kept pushing. \n\nWe both have a journalism class together and I had to put together an interview for this girl. I asked my friend what the girl's name was and then loudly says, \"do you pay attention to anything?\" \n\nI'm not sure why I got so mad, but I shot back, \"No, I don't pay attention to anyone but myself because of my mental health.\" \n\nI've struggled with being a people pleaser for years and have ended up in bad situations because I'm so consumed with other people. My therapist has recently told me to start focusing on myself, and I've been doing just that. \n\nOf course, she doesn't know this so then she says, \"Well that's narcissistic.\"\n\nI then said, \"It's not narcissistic to focus on yourself. I care about people, but I don't pay close attention to people because people don't do that for me. I'm focused on myself, and other people are focused on them.\"\n\nShe then said that instead of criticizing myself, I should start paying attention to other people, and I almost yelled, \"Yes, that's why I'm in therapy!\"\n\nShe then fires off a list of questions at me, stating that I'm \"always off in my own world\" and that I don't pay enough attention to my surroundings because I'm always in my head. Finally I told her, \"I don't like how I'm being treated by you. I'm constantly being questioned and I'm sick of it. Either fix your behavior or stop being my friend.\"\n\nI apologized over text later for snapping at her, but then I said that she needs to stop making comments on things she has no idea about and that she needs to stop being so passive-aggressive towards me. I feel bad for being mean, but I'm incredibly tired of her behavior.",
        "created_utc": 1678226328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why invite me and then not reply?",
        "author": "jilljackmuse",
        "url": "https://www.reddit.com/r/socialskills/comments/11lci9z/why_invite_me_and_then_not_reply/",
        "text": "Last night, I went to a university society event in town and it was the entire committee except for me. They were all really great and after the event, we went on a little pub crawl and then went to the club. One of them was talking about going out the next day and making plans and turned to me and said \"you're invited!\". A little later, I talked to her to confirm if she really meant that and she said she really did and gave me her Instagram and said to message her the next day in the evening. When we were all walking back, she confirmed the event again and said \"maybe I'll see you tomorrow\" and so did another committee member. \n\nIt's today, I messaged her a few hours ago on Instagram (she added me back this morning) and asked what's the plan tonight? She hasn't replied and she posted on her story recently of her taking photos of herself in her room.\n\nThe thing is, yesterday is apparently a weekly event and so after having such a good time with them yesterday I thought I'd go again next week. However, I currently feel snubbed by them and embarrassed about seeing them again. I just don't know why they'd invite me and not say anything.\n\nTL;DR Went to a uni society yesterday, had a lot of fun, they invited me to go out the next day (today) and to see them again at the next event next week. They didn't reply to me asking what the plan is tonight and I feel snubbed and embarrassed about going to the society event next week.",
        "created_utc": 1678225729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me settle beef with someone",
        "author": "arandomtestaccount",
        "url": "https://www.reddit.com/r/socialskills/comments/11lcb2n/help_me_settle_beef_with_someone/",
        "text": "I know this is long, but please hear me out. It would really help.\n\nThere’s this kid at my school (we’re both 16) and he’s being a dick to me for no reason. Whenever I ask what’s wrong with him, he always replies with a lame-ass insult that doesn’t answer the question. He wants to fight me for no reason whatsoever, and always calls me a pussy if I don’t comply. Right now, whenever he says “you and I are fighting today” I always say “okay then” without actually fighting because I don’t want to look like a wimp in front of him. (maybe that’s the problem there) He’s around the same size but 40 pounds bigger than me, and he’s active often, so I know he’s much better. He’s fairly popular, and we share several mutual friends that want me to fight him because they either hate him too (he’s obnoxious to everyone but they won’t unfriend him) or want to see a fight, and most of them want me to win as well. I have a slight chance of beating him, but I’m going to end up aching and/or suspended either way.\n\nI see him every day, but at my school, we have block scheduling, which means our schedules are different every other day. On one day, I have the same lunch period as him, and on the other, I have math with him. He’s pretty easy to avoid on lunch days, as we both sit at different tables, but math is completely different. Math is where most of the worst beef comes from.\n\nAt math, we have free seating because there’s only 9 people in the whole class, but I always sit next to him because 1) we have a mutual friend who sits at that table and 2) so he can copy off my paper without being a distraction. He always soft-punches, taps, and calls me insults me during class, but it doesn’t stop me from paying attention to the lesson as long as I ignore it. The teacher noticed him several times, but all she does is move us away to empty seats. Then, whenever we get an assignment, he always switches up and acts all nice to me so I can let him see my answers. I don’t have a problem sharing my answers, and he was no different. Even if I moved to an empty table myself, he would always follow me to that table and won’t stop until he saw my answers.\n\nI’ve asked him several times on what he wants to stop beefing, and he always said he wants my money. Basically, I would “buy his friendship” which means I give him one dollar every day to act nice. I’ve given him a few dollars, but I know damn well he’s just manipulating me. I know he uses the money to buy snacks from the vending machine and feed his hungry ass. I’m the only person he does this to, he beefs with other people too but not on this level.\n\nI don’t want to fight him, but I also don’t want to look like a pussy either. I don’t want to tell the school staff, because when they do something about it (they’re not afraid to step in) he’s gonna know it was me, get mad and tell everyone, then probably beat me up too. I have a semi-decent popularity at my school, but they all like seeing fights and would get mad at me for pussying out. I would rather lose popularity without getting beat up, but don’t want to become completely irrelevant either. I assume it’ll stop at the end of the year in mid-May when he’ll probably forget about me and beef with someone else, but that’s not anytime soon. I’m tired of pretending he’s my friend and he’s just playing. I’m still open to telling the staff, but please come up with an idea that doesn’t involve that or any violence.",
        "created_utc": 1678225290,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to project more self confidence?",
        "author": "coconutmochaaa",
        "url": "https://www.reddit.com/r/socialskills/comments/11lbyw4/how_to_project_more_self_confidence/",
        "text": "I started a new job 4 months ago. I am good at what I do and I learn fast. I work with a team of mostly new people as well. My boss has his eye on me (due to my skillset/motivation) and will likely promote me. I know I’m not bad at my job per my performance review, but I notice that this still doesn’t stop less informed coworkers from talking down to me or acting like they need to teach something to me. \n\nWhenever someone has tried to talk at me or unnecessarily tell me how to do something I just say “I’m aware.” but there has to be a better way to combat this and make them stop. I have credentials in our field when most on the team do not…and I hear them describe concepts or foundational knowledge incorrectly. Yet they have the audacity to tell me how to do things? I was bullied a lot as a child (entirety of K-12 tbh), was raised immigrants by super strict immigrants who didn’t let me have the normal experiences kids have, and I am quiet. I have been successfully working to crush people pleasing tendencies but I am very over being spoken to like this. What’s the best way to deal with these people who try to act like I don’t know what I’m doing?",
        "created_utc": 1678224540,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to initiate a hangout?",
        "author": "LopkiBear",
        "url": "https://www.reddit.com/r/socialskills/comments/11lbq92/how_to_initiate_a_hangout/",
        "text": "I’m a high schooler and I have really never hanged out with anyone outside of school, despite having many friends. I’m not really apart of a definitive ‘friend group’, not apart of any group chats or nothin. I have some friends in mind who I'd like to hangout with but I just don't know how I would bring it up  or where to go.\n\nI just want to have some people I can hangout with by the time summer comes around. I've overcome all my social problems over the past years,and I feel like this is the big hurdle, and I'm excited! I know my problem is I just haven't initiated anything, but I don't really know where to start. Any help?",
        "created_utc": 1678223991,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you address someone who 's giving off mixed signals?",
        "author": "The_Bread_Ghost",
        "url": "https://www.reddit.com/r/socialskills/comments/11lbc5f/how_do_you_address_someone_who_s_giving_off_mixed/",
        "text": "I've got a friend who's had a rough time lately and I learned today they're pretty angry with our friend group for not reaching out more to check on them, which I acknowledge is valid. My thing is, they've had their discord status as Do Not Interact and been either offline or on do not disturb mode for a few days, which to me is a clear indication they'd like to be left alone. Honestly, I figured they were just taking a break from social media stuff (discord included) to relax without any interruptions. \n\nNow I feel very conflicted about reaching out because they've still got Do Not Interact as their status, plus I'm afraid it'll seem forced since they just told us how angry they were about this. I want to make sure they're okay and support them because we're friends and I care about them, but I also don't want to overstep any bounds here. Any advice?",
        "created_utc": 1678223134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it mean not getting flowers for my friends on women's day?",
        "author": "Nyrk287",
        "url": "https://www.reddit.com/r/socialskills/comments/11laril/is_it_mean_not_getting_flowers_for_my_friends_on/",
        "text": "[removed]",
        "created_utc": 1678221900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Request for flowers",
        "author": "Nyrk287",
        "url": "https://www.reddit.com/r/socialskills/comments/11lami7/request_for_flowers/",
        "text": "[removed]",
        "created_utc": 1678221592,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to restart a conversation that I stopped 1.5 months ago?",
        "author": "Lezonidas",
        "url": "https://www.reddit.com/r/socialskills/comments/11laddu/how_to_restart_a_conversation_that_i_stopped_15/",
        "text": "Long story short I tried to be exclusive with one girl and it didn't work out, I want to restart the conversations that I had with other girls, but I kind of \"ghosted\" them, how do I fix this?",
        "created_utc": 1678221036,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got blamed after my friend broke up with me",
        "author": "Malaysia345",
        "url": "https://www.reddit.com/r/socialskills/comments/11lackz/i_got_blamed_after_my_friend_broke_up_with_me/",
        "text": "[removed]",
        "created_utc": 1678220988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Face muscles keeps twitching everytime I talk to new people. How do I deal with this?",
        "author": "Chicken_wings1074",
        "url": "https://www.reddit.com/r/socialskills/comments/11l9v8a/face_muscles_keeps_twitching_everytime_i_talk_to/",
        "text": "Does anyone else experience this? It's been real tough meeting new people because everytime i engage in a conversation, my face muscles just twitches on its own, even if I feel comfortable. It becomes so obvious that I need to look somewhere else or sometimes even walk away. It's been like this for a while now and it's becoming frustrating.",
        "created_utc": 1678219878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Face muscles twitches everytime i meet new people. Advices?",
        "author": "mcqueef091",
        "url": "https://www.reddit.com/r/socialskills/comments/11l9q9i/face_muscles_twitches_everytime_i_meet_new_people/",
        "text": "Does anyone else experience this? It’s been real tough meeting new people because everytime i engage in a conversation, my face muscles just twitches on its own, even if I feel comfortable. It’s been like this for a while now and it’s becoming frustrating.",
        "created_utc": 1678219585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snappy Roommate",
        "author": "Expensive_Dinner5769",
        "url": "https://www.reddit.com/r/socialskills/comments/11l9iuc/snappy_roommate/",
        "text": "I currently live in student accommodation with 5+ people and have no problems with my roommates. If there is a problem everyone communicates calmly and the issue is put to bed.\n\nHowever there is one exception. My housemate “F” can be really snappy. In the group chat they’re constantly complaining about how “everyone keeps leaving their shit around” and berates everyone when the kitchen is less than spotless when they wake up (around 2 hours before everyone else).\n\nWe’ve tried to nicely explain about how it’s a shared space and everyone puts effort in but F still complains. \n\nI now get sharp looks from them because I accidentally ate some of their chips, because we buy the same brand. I apologised and offered to replace them but was completely blanked.\n\nIt’s all small stuff but their attitude has left one our housemates staying up extremely late making sure the kitchen is immaculate just so F won’t make a snarky comment.\n\nI’m not good at confrontation and we’re all living together for the next year and a half - what should I do?",
        "created_utc": 1678219156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird to follow a new friend/acquaintance on Instagram?",
        "author": "atomicpunk88",
        "url": "https://www.reddit.com/r/socialskills/comments/11l977a/is_it_weird_to_follow_a_new_friendacquaintance_on/",
        "text": "We're in college and see each other about once a week with a group of mutual friends. Don't really talk or hang out one on one but they seem cool. I looked up their name on ig and their account showed up. Our mutual friends aren't following them (not sure if any of them are very active on ig)",
        "created_utc": 1678218448,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to stop feeling inferior to people",
        "author": "vanillabeanbagel",
        "url": "https://www.reddit.com/r/socialskills/comments/11l8w12/i_want_to_stop_feeling_inferior_to_people/",
        "text": "I always feel like the inferior participant in any conversation, whether it's with friends or family members or strangers. How do I change this and feel like an equal in social situations?",
        "created_utc": 1678217744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grandma keeps talking about passing away",
        "author": "Great-Maybe-9317",
        "url": "https://www.reddit.com/r/socialskills/comments/11l8v94/grandma_keeps_talking_about_passing_away/",
        "text": "I am someone who gets very uncomfortable with talking about anything related to people passing away. This becomes especially true when my grandma always jokes about passing away soon. She seems to make light of it and understands that it’s a part of life. But I get extremely uncomfortable because she will say something like, “I know that my time’s coming since I am getting older. It’ll be nice when I pass on so that I won’t have to feel any more knee pain, right?” And she expects me to respond. Like how do you respond to something like that? I usually just awkwardly laugh and don’t say anything else. But it makes me uncomfortable when she talks about dying because it’s not something I like to joke about. Any thoughts on how to respond to these kinds of things?",
        "created_utc": 1678217697,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to deal with people?",
        "author": "Sufficient-Walrus-26",
        "url": "https://www.reddit.com/r/socialskills/comments/11l8qvx/how_to_deal_with_people/",
        "text": "I have always lacked social skills, as in I don't know how to react in some situations. I don't usually know when to act cool, be kind or when to be aggressive and be a little rude. \nI have a friend who treats me nicely when we  are together alone but when we are together with our other friends she act as if I don't exist. I want to make her feel how it feels to be lonely but then I am way over dependent on her and am afraid to lose her, so I always end up treating her nicely.\nAnd this is a small example of where it confuses me on what should I do with these kinds of people, I need her but still am angry at her on how she treats me.",
        "created_utc": 1678217428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help for my social awkwardness",
        "author": "WorkerCertain",
        "url": "https://www.reddit.com/r/socialskills/comments/11l8e40/need_help_for_my_social_awkwardness/",
        "text": "I cant fix my friendship skills.No one wants to talk with me besides my besties.Actually i am not close enough even with them.Because i guess i am boring person and thats why they dont wanna talk with me.I cant meet with new people.Everyone acts like i am not with them.They are acting like they didnt hear anything i say.I am unnecessary +1 in my every friend group.I am pushing people from myself in a bad way somehow.When i say my thought about anything,awkward silence occurs and they are treating me like i said something so silly.I am making them feel cringe i guess.Maybe really my thoughts are silly idk.Everytime i am telling to myself that i will change these things,setting goals for myself but i failed everytime.I am still unwanted one in groups.I cant tell anything about my life to anyone because i dont have life.Sometimes i feel hopeless and feel like i am carrying a curse that pushes people from me.I feel like i will stay as a loser in my whole lifetime.That thoughts are coming to my mind almost everytime during a day.But how can i be funny and talkative person?Is there a secret school for that?I am trying so hard but everytime i fail,i lose some of my hope about changing.I am losing my motivation to doing good things for myself because i feel like they are pointless.No one will consider me worthy enough to talk anyways.I cant see any solution.I am tired of being unnecessary.I'd like to hear your advices and i really need it.Thanks.",
        "created_utc": 1678216636,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to be a shut in, but I moved across the country to live by myself.",
        "author": "EIegeant",
        "url": "https://www.reddit.com/r/socialskills/comments/11l6rcq/i_used_to_be_a_shut_in_but_i_moved_across_the/",
        "text": "[removed]",
        "created_utc": 1678213009,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to be a shut in, but I moved across the country to live by myself.",
        "author": "EIegeant",
        "url": "https://www.reddit.com/r/socialskills/comments/11l6n5t/i_used_to_be_a_shut_in_but_i_moved_across_the/",
        "text": "[removed]",
        "created_utc": 1678212747,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to be a shut in, but I moved across the country to live by myself.",
        "author": "EIegeant",
        "url": "https://www.reddit.com/r/socialskills/comments/11l6l16/i_used_to_be_a_shut_in_but_i_moved_across_the/",
        "text": "[removed]",
        "created_utc": 1678212612,
        "upvote_ratio": 1.0
    },
    {
        "title": "anything i do is annoying",
        "author": "NNobal",
        "url": "https://www.reddit.com/r/socialskills/comments/11l60rs/anything_i_do_is_annoying/",
        "text": "Anything  i do is annoying, if i speak its annoying, if i do anytbing that i do its annoying,  i cant do anything in my life withhout my self esteem getting shattered.\n\nAlso its not my mind saying im annoying, its everyone calling  me annoying and its making me so fucking depressed thst i am loosing my anger on people around me.\n\nPlease help me i dont know what to do this is making me severally depressed and making my mental health go down. \n\nPlease help someone",
        "created_utc": 1678211384,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I ask someone on Bumble BFF to hang out?",
        "author": "harryshome97",
        "url": "https://www.reddit.com/r/socialskills/comments/11l5tqd/how_do_i_ask_someone_on_bumble_bff_to_hang_out/",
        "text": "I recently joined Bumble BFF and want to ask people to hang out but I am not sure how. \n\nOne girl and I were talking about how we both like yoga and how she goes to a yoga class in the area. Is it okay to ask if she wants to do a yoga class with me this week?\n\nDoes it sound okay to ask the others if they would like to ski (we live in a ski town and have talked about liking skiing) or ask if they want to get dinner this week?",
        "created_utc": 1678210928,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to distinguish good and bad social advice? Is there a data-based guide to social skills?",
        "author": "mementoTeHominemEsse",
        "url": "https://www.reddit.com/r/socialskills/comments/11l5n8a/how_to_distinguish_good_and_bad_social_advice_is/",
        "text": "The  social skill scenes is full of hacks. I'm sure everyone here is more or  less aware of that. There are also those that, while having genuinely  good intentions, just don't know what they're talking about.\n\nIssue  is that it seems more or less impossible to differentiate those two  groups, call them the know-nots, from those with actually good advice.  The only way one can test the validity of their ideas is by applying  them and \"compiling\" results over months. Not only can this permanently  damage social status, it can also lead to failure anxiety.\n\nAre  any of you aware of a solution? Optimally, is there data-based social  advice anywhere? This way I wouldn't have to suffer through the  application phase myself, and could instead learn from the suffering of  others lol.",
        "created_utc": 1678210513,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s agonizing to not have anyone who cares (23m)",
        "author": "polyhedron__",
        "url": "https://www.reddit.com/r/socialskills/comments/11l5ivn/its_agonizing_to_not_have_anyone_who_cares_23m/",
        "text": "People who constantly brush you off, dismiss you, refuse to take you seriously, patronize you and never value your time. For me this is 99% of people in my life. I can’t live like this and it almost literally drives me insane. I just don’t know why I’m not good enough. Don’t tell me I have value even though no one can see it. I don’t care. No one can be happy without being valued. \n\nWhy does everyone expect me to accept this state of inferiority? Why can’t anyone be genuine or honest with me as to why they treat me this way?\n\nEdit: yes I shower and go to the gym. I have a good amount of muscle",
        "created_utc": 1678210237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting little challenge with myself",
        "author": "destrii228",
        "url": "https://www.reddit.com/r/socialskills/comments/11l5a1h/starting_little_challenge_with_myself/",
        "text": "As someone who struggles with bit of anxiety and doesn't smile a lot, I want to try to smile to at least one random person a day if we make an eye contact and I feel like it. \n\nI know this may sound stupid but this is hard for me as I tend to be reserverd in public. I want to get out of my comfort zone and who knows, maybe even potentially make someone's day better\nI want to get better and overall be more comfortable socially so I thought this would be good baby step",
        "created_utc": 1678209658,
        "upvote_ratio": 1.0
    },
    {
        "title": "How o distinguish good and bad social advice? Is there a data-based guide to social skills?",
        "author": "mementoTeHominemEsse",
        "url": "https://www.reddit.com/r/socialskills/comments/11l5155/how_o_distinguish_good_and_bad_social_advice_is/",
        "text": "The social skill scenes is full of hacks. I'm sure everyone here is more or less aware of that. There are also those that, while having genuinely good intentions, just don't know what they're talking about. \n\nIssue is that it seems more or less impossible to differentiate those two groups, call them the know-nots, from those with actually good advice. The only way one can test the validity of their ideas is by applying them and \"compiling\" results over months. Not only can this permanently damage social status, it can also lead to failure anxiety. \n\nAre any of you aware of a solution? Optimally, is there data-based social advice anywhere? This way I wouldn't have to suffer through the application phase myself, and could instead learn from the suffering of others.",
        "created_utc": 1678209089,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw this girl in the hallway and I dont know how to approach her",
        "author": "DrAgo-n_en",
        "url": "https://www.reddit.com/r/socialskills/comments/11l4oef/i_saw_this_girl_in_the_hallway_and_i_dont_know/",
        "text": "When I was leaving class someone passed right pass me I looked at the persons face and it was a girl which I found very cute cute.Everytime I try to approach her I cannot find the right words to push my confidence to talk to her.i honestly have no idea.Can u help me in my confidence situation?",
        "created_utc": 1678208328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend hasn’t responded to me in a while",
        "author": "Statiscit",
        "url": "https://www.reddit.com/r/socialskills/comments/11l4e2x/friend_hasnt_responded_to_me_in_a_while/",
        "text": "So I basically have a friend here and we used to be somewhat close I guess u could say? We used to call a lot and text quite often and we even hanged out occasionally.\nA while ago I moved and we both are currently in different timezones, me being around 8 hours ahead of her I think. \n\nNow let me get to the problem part, I text her a lot to the point I almost just spam her with several mini paragraphs of whatever and she replies to me like once every few weeks with a few texts and once she goes offline, she goes offline. I asked her once if it was annoying whenever I did that and if it was I’d stop but she told me how she didn’t mind and actually told me how she enjoyed reading them whenever she went online.\n\nShe claims that she’s very busy with her life and stuff (Ex: School, exams) which while I do believe but I do tend to question if it is the truth sometimes. Recently I noticed how she’s active on one of her other socials, not really posting anything but rather commenting and reposting other posts which made me debate whether if she really is busy as she says.\n\nOne of the reasons I even bother texting her still is mainly because she’s one of my only friends left and also because she’s made a big impact onto my life at one point but it’s been a pain waiting for replies to come especially when half of the things I send end up being ignored or something \n\nSo what do u think? Any advice on this?",
        "created_utc": 1678207680,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Need advice im severely suffering from low self esteem and it’s ruining my life",
        "author": "Strange_BubbleTEA223",
        "url": "https://www.reddit.com/r/socialskills/comments/11l4b46/i_need_advice_im_severely_suffering_from_low_self/",
        "text": "The feeling when you realise that you’re everyone’s last choice, and there’s always someone who they like better than you, is the most painful feeling at school. \n\nI put so much effort to make people like me, every single day, I know I shouldn’t, I keep doing it. I have zero confidence to make things worse, and my classmates aren’t helping, it’s not like they know my suffering anyway.\n\nI am not a good person. This phrase replays in my head. I cannot love myself. I try to love myself, but when I look in the mirror I see a weak, useless, rude, ugly and worthless person staring back. \n\nI hate myself. I hate myself. I hate myself. When I tell you I’m such a hypocrite and compulsive liar. I can’t stand it when people succeed and I don’t, especially when I’ve worked hard. I can’t even stand it when people have loving bonds and friendships. I want to ruin their friendship. To feel what I felt.\n\nAt school I act like the complete opposite of who I really am, always. Every time I try to be myself, people don’t like me. Or that’s what I think. \nI’ve kept changing my self, that I don’t even know who I am anymore. I can’t be myself anymore.\n\nI hate my friends. I wish they noticed all that respect, hard work and effort I put in for them. I wish someone cared for me the same way I cared for others. \n\nI hate that I always lie. I hate that I get jealous. I hate that I can never feel genuinely happy for someone else. I hate that I hate myself. I hate everything. Why is there not a single person to understand me. Why do I walk into school with immense worries weighing me down. Why am I so stupid. Why do I get nervous all the time. Why am i so weak minded and sensitive. Why do i hurt others. Why do I pretend to be someone I’m not. \n\nI wish I had at least one understanding friend. I wish I wasn’t so socially awkward. I wish I stopped hating myself. I hurt the people around me by inflicting my pain on them. I hate myself for that. I get angry for the slightest reasons, and I cry at least twice a day. I wish I didn’t overthink every single thing. I wish I’d been nicer.\n\nI wish someone actually liked me for my true self. I want to stop pretending to be someone else but I can’t help it. I don’t know how to be myself. And it’s like my life’s mission for others to like me. And this kills me.\n\nI’m sorry i just realised this might sound quite cringe and stupid. I felt like venting out my feelings thanks for reading though.",
        "created_utc": 1678207495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I write a message to a friend a year after her failed suicide attempt?",
        "author": "Ancient_Badger5777",
        "url": "https://www.reddit.com/r/socialskills/comments/11l4aut/should_i_write_a_message_to_a_friend_a_year_after/",
        "text": "Basically nearly a year ago my friend tried to kill herself, but luckily she survived. Should I write her something about it, like telling her I'm happy she's alive or something like this, or it is better to not remind her, because probably it is already a hard day?",
        "created_utc": 1678207479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice on attachments",
        "author": "Stfubishhh",
        "url": "https://www.reddit.com/r/socialskills/comments/11l48r1/need_some_advice_on_attachments/",
        "text": "Hello Everyone\n\nSo let me get straight to the point. \n\nSo i have been a very lonely person, I usually work from home, go to the gym and just come back. I have like 0 social interaction. It's just me and myself because i live on the outskirts of the city and all of my friends have drifted apart. \n\nSo i text my childhood friends not on a daily basis but we have a conversation once in a while , so last week I decided to meet them. Let's call them J and S. I met J after 3 years and S after 2 months. So S and J bring their friend groups along to meet. ( We were at a summit ). So J's friend A was a very nice person to me and we got along well. We hung out for half a day it was fun. So the other half of the day and the following whole day was spent with S and his friends. After the summit we went back to S' place we basically had a sleepover. We had a few drinks and lots of talks and fun. We played a few games etc etc. It was real fun.  I have met S' friends before but this was the first time we had a sleepover and had a good time. \n\nSo now the weekend is over I came back home (outskirts of the city) i am not sure when I'll meet them again. We have been texting slightly. I'm not in their friend's WhatsApp group. But we have been talking a bit. One S' friends kinda stopped replying this morning and the other two friends talk but they seem a bit not interested. I kinda feel i have a attachment for them. But they don't feel the same. Also J (the other friend group) is out on a trip with her classmates (also her ex ) and hasn't replied to my text i kinda feel now the summit is over we will go back to being once in a while friends. \n\nI feel they are wonderful people everyone from S and J 's friend groups. I am not sure on how I can blend so i'd also get good friends for life.\n\nThis is kinda disturbing, I'm not sure what to do. I don't wanna start being alone again because i enjoyed being with people around. \n\nI'm trying to make real friends. I'm not sure how to handle this. I'm open to being friends from Bangalore (india) or anywhere. I would like to meet people and socialize. If you're from Bangalore and is looking to make new friends please text me. I am also not sure If me posting my feelings is weird. Please provide some advices on what i can do.\n\nThanks for reading until the very end. Looking forward to meet my new friends :)",
        "created_utc": 1678207341,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to have conversations with XX chromosome humans",
        "author": "Feisty-Ad396",
        "url": "https://www.reddit.com/r/socialskills/comments/11l487v/how_to_have_conversations_with_xx_chromosome/",
        "text": "[removed]",
        "created_utc": 1678207309,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to chit-chat with anyone in everyday situations?",
        "author": "TinyCuteGorilla",
        "url": "https://www.reddit.com/r/socialskills/comments/11l4635/how_to_chitchat_with_anyone_in_everyday_situations/",
        "text": "I'd like to chat up strangers in everyday situations (2-3 short sentences at most). Like cashier in a grocery store, gym staff etc) I rarely do it but when I do it makes my day better and I also notice the other person enjoys it as well. Do you have any tips how to do it consistently?\n\nI feel like \"I don't have anything to say\" but noticed that lots of people always have something to say, even if they don't know the other person at all, I'm trying to learn why that is - they might be more \"present\" so they notice unusual things to comment on maybe?",
        "created_utc": 1678207178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are some older women so mean to me and treat me like I’m a dumb teenage girl when I’m not?",
        "author": "brunettelindsaylohan",
        "url": "https://www.reddit.com/r/socialskills/comments/11l44j5/why_are_some_older_women_so_mean_to_me_and_treat/",
        "text": "I’ve noticed when I work a summer job, I have at least one older woman that is one of my co-workers who will be incredibly mean to me to the point where I wanna cry. In addition, they also think that I’m a dumb yet pretty teenage girl and they treat me like it, when in reality I’m in my early 20’s and in university. Why do some older women treat me like this?",
        "created_utc": 1678207076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that I don't want to sext, send nudes or spice the chat when talking to someone I met on Tinder?",
        "author": "larsvon-tryhard",
        "url": "https://www.reddit.com/r/socialskills/comments/11l42tj/is_it_weird_that_i_dont_want_to_sext_send_nudes/",
        "text": "I suck at that stuff and I think I want to get to know the person instead of just sending them nudes, but if the majority of people on Tinder only want that so I'm feeling like a major virgin. Another factor is that I'm feeling really bad about my body lately. Idk just wanted to ask if I am indeed a major virgin",
        "created_utc": 1678206962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions for the ladies: What mannerisms or characteristics do you consider feminine vs masculine",
        "author": "cosmicfruitsz",
        "url": "https://www.reddit.com/r/socialskills/comments/11l419f/questions_for_the_ladies_what_mannerisms_or/",
        "text": "[removed]",
        "created_utc": 1678206865,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to match a girl’s energy when talking to them (and should I?)",
        "author": "Feisty-Ad396",
        "url": "https://www.reddit.com/r/socialskills/comments/11l3xd3/how_to_match_a_girls_energy_when_talking_to_them/",
        "text": "[removed]",
        "created_utc": 1678206625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does this guy (24M) act like this with me (19F)?",
        "author": "Independent_Slide932",
        "url": "https://www.reddit.com/r/socialskills/comments/11l3qb4/why_does_this_guy_24m_act_like_this_with_me_19f/",
        "text": "This guy at uni acts really weird whenever I’m around. When we talk he looks really uncomfortable and pissed. He’ll start breathing weirdly, walk differently, doesn’t know what to say or respond when I speak, which makes our interactions really awkward. He even tries to avoid me sometimes. Once he asked me if I wanted to go out with him and his mates, so I went, but he almost didn’t speak to me the entire time. The next day he tried avoiding me, but texted me two weeks later out of nowhere to know if I wanted to go to a house party. Anyway I’m really confused, I can’t tell if he likes me or hates me. He seems really different around other people (and he’s had girlfriends in the past), but why is he like this with me?",
        "created_utc": 1678206173,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i talk more?",
        "author": "Abnormal_stuff",
        "url": "https://www.reddit.com/r/socialskills/comments/11l3f94/how_do_i_talk_more/",
        "text": "My friends or basically anyone who i talk to always tell me to talk more. I dont know how to talk more and it often leads to just awkward situations.",
        "created_utc": 1678205471,
        "upvote_ratio": 1.0
    },
    {
        "title": "I work in a very quiet office and my coworker beside me is always eating snacks like pretzels and chips. The sound of the bag crinkling and her very loud chewing is extremely distracting and annoying to me. Would it be impolite to ask her to please bring a quieter snack or eat in the break room?",
        "author": "FantasyNerd94",
        "url": "https://www.reddit.com/r/socialskills/comments/11l2ehe/i_work_in_a_very_quiet_office_and_my_coworker/",
        "text": "I don’t want to be rude and make her feel bad but I have really bad sensory issues and the sounding of people chewing is unbearable to me. I’ve tried putting in AirPods to drown out the sound but I can still hear her. \n\nWould it be rude or entitled of me to ask her to please go to the break room to eat her snack?",
        "created_utc": 1678203143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend Issue",
        "author": "snackinson",
        "url": "https://www.reddit.com/r/socialskills/comments/11l214h/friend_issue/",
        "text": "Friend always serves cold food at parties.\n\nI have this friend that always insists on hosting our friend group get togethers. They always stress that they don't want anyone to bring anything and that they have everything covered. However, every damn time they cook everything hours before the party. By the time everyone gets there, the food is cold and soggy. It's fucking gross and I have gotten sick from it. I've brought it up a couple times but they shrug it off. How do I fix this? I rarely get to host because they are adamant about doing it themselves but ugh.",
        "created_utc": 1678202304,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help!",
        "author": "Lopsided_Spinach6968",
        "url": "https://www.reddit.com/r/socialskills/comments/11l1yzw/i_need_help/",
        "text": "So i've been having friendship problems with a friend of mine because she always hanging out with a friend she made in school in theather and now they're doing everything together i feel jealous because they have sleepovers, call each other and they gave each other rings for \"Marraige\" and they also cuddle and hug everytime they  see each other whenever i see them together it makes me not want to go near them at all and it makes me feel like that my friendship is losing touch with her i've talked about it with her and also talked about it in therapy but i feel like nothing is working at all so what can i do?",
        "created_utc": 1678202160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Say yes to everything (within reason)",
        "author": "changosabio",
        "url": "https://www.reddit.com/r/socialskills/comments/11l1knu/say_yes_to_everything_within_reason/",
        "text": "Last summer, I got invited to go on a camping trip with someone I hardly knew.\n\nThis wasn't a small trip. \\~30 people were sharing this one large site. I recognized a total of 2 people.\n\nBut, against my better judgment, I had nothing else going on and I decided to check it out.\n\nAs you can imagine, the beginning was tough. Awkward small chat as far as the eye can see. And I couldn't escape the awk bc we were out in the wilderness.\n\nYikes.\n\nI figured fuck it, might as well embrace the fact that nobody knows me and start talking to everyone I can. It turned out to be fantastic! I managed to make new friends, play guitar with a crew that jams, and found a guest for my podcast.\n\nSo many wild adventures came from this one night I showed up, all because I decided to show up. \n\nNow, when I'm nervous about going to social situations (networking, parties with randos), I think back to this memory as a point of strength. It proved that I did it once I can do it again. Really helps the nerves.\n\nKinda like the David Goggins \"cookie jar\" concept.\n\nIf you expose yourself to more and more social random situations, you can be more confident in the little everyday ones. Say yes to all social situations that come your way, even if you hardly know the people. It'll make you a more interesting, adventurous, and confident person.",
        "created_utc": 1678201213,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the appropriate responses when people talk about their trauma / shitty home life ?",
        "author": "SnooSuggestions2267",
        "url": "https://www.reddit.com/r/socialskills/comments/11l13no/what_are_the_appropriate_responses_when_people/",
        "text": "I am in a new environment right now and has just started making friends. For some reason, most of my friends have some kinda shitty parent situation at home. The thing is, I don’t know how to quiet react when people that I have known for 1-2 weeks maximum tell me their traumatic experiences. \n\nEven though my parents don’t like each other, I grew up mentally and financially stable. My parents have never been abusive towards me, so I don’t have any relatable experiences to share. I just show sympathy with my face and tell them what their parents did was shitty. But the voice inside my head is like ‘they already know that, idiot’. What are the appropriate reactions in these situations?",
        "created_utc": 1678200045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend made an offensive joke",
        "author": "Gamer_345",
        "url": "https://www.reddit.com/r/socialskills/comments/11l125y/friend_made_an_offensive_joke/",
        "text": "In the cafeteria at school today we were talking about a boy who had other boys around him. We were discussing wether they were his friends cause he is usually sitting alone. One of my friends says: \"nah, he just has companions, like [insert my name here]\" He said it was just a joke but it still stuck up to me. No one backed me up. I have social anxiety and don't talk much so that may be the reason.",
        "created_utc": 1678199944,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I improve people’s perception of me? (23m)",
        "author": "polyhedron__",
        "url": "https://www.reddit.com/r/socialskills/comments/11l0yq5/how_can_i_improve_peoples_perception_of_me_23m/",
        "text": "I’ve been struggling with this my whole life; people have looked at me like I’m worthless. I have to fight to get respect and be treated like everyone else when I’m just as good.\n\nIt’s demoralizing to have to go through this your entire life. The only things that could stop this were being athletically talented, and smart. \n\nI don’t know why people always look down on me. I can’t improve my social skills if no one is open to conversation. I can’t be accepted anywhere unless I go out of my way to prove my worth. \n\nIt’s easy to say not to worry about these other people and not to value their opinion, but it’s not normal for everyone to make these assumptions about you, and being alone sucks (I’ve done it for a few years now).\n\nI don’t have anywhere where I’m accepted, I’ve struggled with this since middle school. People write me off before they even know me; I didn’t think I was that ugly, but any advice would be appreciated.",
        "created_utc": 1678199712,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am \"blunt\" apparently and its probably ruining my relationships",
        "author": "AdNervous6767",
        "url": "https://www.reddit.com/r/socialskills/comments/11l0kpx/i_am_blunt_apparently_and_its_probably_ruining_my/",
        "text": "[removed]",
        "created_utc": 1678198769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lonely in uni, first year. The boat swam away",
        "author": "Mainaccsuspended99",
        "url": "https://www.reddit.com/r/socialskills/comments/11kzlal/lonely_in_uni_first_year_the_boat_swam_away/",
        "text": "\nI always had friends throughout high school and middle school. I never tried, we just clicked and became friends. \n\nNow in college I’m dealing with a couple of injuries and I’m seen as someone who looks mad so nobody really stuck with me to become friends. \n\nI don’t want to be friends with anyone in class all of a sudden because it’s like 7 dudes and 25 girls. How the fuck do I  get over this shit? I made friends throughout my uni but NOT in my class where I spend the majority of my time.\n\n\nI don’t see other friends often. It’s been lonely as fuck. They already have they own groups and I can’t become friends now with them since they don’t show interest in the first place so it was never mutual.\n\nI’m thinking of switching classes where I have my friends there but I gotta survive these lonely months. I’m in med school so busy all the time.",
        "created_utc": 1678196324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cannot be warm/loving to anyone anymore",
        "author": "Gasko_Skurtt",
        "url": "https://www.reddit.com/r/socialskills/comments/11kzjp3/cannot_be_warmloving_to_anyone_anymore/",
        "text": "22y.o male. Had some major events happen, close relative pass, not really super relevant here because ive had this problem long long before this ever happened. I was doing some journaling, and realized every time I feel like my best, Im very warm, caring, loving, mostly outside of romantic stuff, to friends, people I just happen to meet. Family ive always struggled with being warm to more, idk why. I think it has something to do with shame/ I feel weird about when theres any kind of social expectations and I know ill struggle to meet them because I get in my head about it. A good example of this is parents birthdays, idk why, but I struggle to even tell them happy birthday, not because I dont want to, but because I feel like I wont meet expectations of what they want. I've got a couple friends, That I actually never want to see really, dont have the need, Im happier (( more comfortable) at the house in my own company, where I never have to overthink anything, or wonder if someone understands. Anyways I cant connect to really anyone any more.  Ill even look back to 2 years ago and think \" wow I was a lot better at talking to people, connecting to people, putting out love into the world in general\" The death has changed my perspective a bit, because it made me really wish I had a partner to go through everything with, as I feel like i dont have much of a support system and guys biggest support by far is their partners. not only that but its a wake up call. I dont wanna be like this in another 2 years. Hell, I dont want to be like this NOW. but thats more for my moms sake as I wish I could do better to emotionally support her. Just to  emphasize this again, Im talking in and especially outside of standard romantic relationships. I wanna be loving to everyone again. or atleast maybe someone as a start.",
        "created_utc": 1678196206,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between incredulous and flat look?",
        "author": "hopesanddreamsbox",
        "url": "https://www.reddit.com/r/socialskills/comments/11kzdud/whats_the_difference_between_incredulous_and_flat/",
        "text": "Often described in books people have a incredulous or flat expression / look when hearing or reacting to something stupid. Is there a difference though?",
        "created_utc": 1678195783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any one feel emotional after socializing or having fun with friends/partner ?",
        "author": "cute3_14",
        "url": "https://www.reddit.com/r/socialskills/comments/11kya2l/any_one_feel_emotional_after_socializing_or/",
        "text": "I have no idea why, but when I spend my day hanging out with others laughing and having good times, and am at home just chilling by myself, a wave of sadness hits me. I get emotional and cry over silly things that aren't rlly sad in any way; like a cat falling over a table or a baby with a sad face. It's really weird, I would like to know why this happens casue it makes no sense",
        "created_utc": 1678192760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be vulnerable but it makes me suffer",
        "author": "RedditorNo463",
        "url": "https://www.reddit.com/r/socialskills/comments/11ky1ga/i_want_to_be_vulnerable_but_it_makes_me_suffer/",
        "text": "I like to tell things I did in a humorous way, I like sharing my insecurities, the goofy/cringe moments I had or the stupid things that I did. But some stuff I do is way too stupid or cringe, or because I tell it in a nonchalant way; I feel like my friends judge me for it. After sharing I fear that they eventually will leave me or gossip about me or distance themselves from me and I get upset. This leaves me with two options:\n\n1- Not sharing these things\n\nI can do this but then I feel like an impostor and that I hide my 'true self . I think it would be better to push myself to be more vulnerable.\n\n2- Not doing the cringe things itself\n\nI wouldn't feel like an impostor if I don't do these things in the first place. But this is harder for me to do than the first option because I sometimes act impulsively and I can't push myself to care enough.\n\nWhat should I do?\n\n**-&gt;** ***Below part is optional.***\n\nTo give an example for the stupid things I do:\n\nI sleep while watching stuff from my phone. One day while doing that I forgot to connect it to wifi and my phone bill got to 1000x in my countries currency. Normally the phone bill is 100x. I panicked because my mom pays my phone bill and she would explode if she saw that.\n\nMy mom sends me a screen shot of my phone bill and asks me if she sees it correctly, if it is 100x or 1000x. She has trouble reading and knowing that, I said it is 100x, then paid my phone bill myself (which was really painful). I thought I had an enormous brain and that I fooled her.\n\nThen. Turns out she actually knew it was 1000x from the beginning and played me all along to see how I would react.\n\nThis is really funny to me and I shared every step of this to my friends while living through it. But I felt like my friends judged me. Also, I am 23 and I feel insecure that I am not mature enough, that I don't act like my age. I am still in college and I am not financially independent, my family supports me.\n\nI constantly try to improve myself and become a better person but I am torn apart when I have to decide what to share or what not. Or how to share it or how not...",
        "created_utc": 1678192110,
        "upvote_ratio": 1.0
    },
    {
        "title": "join my discord",
        "author": "GreenEnvy98",
        "url": "https://www.reddit.com/r/socialskills/comments/11kxr9s/join_my_discord/",
        "text": "https://discord.gg/rwmZZSnB",
        "created_utc": 1678191321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating someone with support worker",
        "author": "Critical-Kangaroo-95",
        "url": "https://www.reddit.com/r/socialskills/comments/11kxpj3/dating_someone_with_support_worker/",
        "text": "[removed]",
        "created_utc": 1678191192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should i tell my friend group my real name?",
        "author": "Aggravating-Record92",
        "url": "https://www.reddit.com/r/socialskills/comments/11kxg9f/should_i_tell_my_friend_group_my_real_name/",
        "text": "[removed]",
        "created_utc": 1678190474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "Antique_Sir9132",
        "url": "https://www.reddit.com/r/socialskills/comments/11kx87y/help/",
        "text": "[removed]",
        "created_utc": 1678189819,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I deal with the thought of my friend group will be broken apart since everyone is going to be an adult!",
        "author": "Sam_21000",
        "url": "https://www.reddit.com/r/socialskills/comments/11kx7po/how_can_i_deal_with_the_thought_of_my_friend/",
        "text": "So all of us are in our early twenties and this stage in our life.. that everyone is forcing on their life.. and that i feel like we’re slowly losing our each other.. we go out every weekend but i feel like we’re not seeing each other anymore… we been friends even since we were in high school.. am I overthinking about it?",
        "created_utc": 1678189780,
        "upvote_ratio": 0.99
    },
    {
        "title": "What can I say to coworkers who get upset when I don't speak to them?",
        "author": "Princess_Butt_Kick",
        "url": "https://www.reddit.com/r/socialskills/comments/11kx70u/what_can_i_say_to_coworkers_who_get_upset_when_i/",
        "text": "This is for non-work related social interactions.\n\nI (26F) work in a male dominated industry, with a majority of older men 50+ who are very old fashioned. They expect me to be the \"work wife\" and tend to everyone else's social needs.\n\nI am the type of person that gets a little serious at work. I come in to do my job, that's what I get paid to do. That doesn't mean I am completely antisocial, there are some people I enjoy talking to about things outside of work. But there are some types of men that seem to get irritated that I don't give them my attention.\n\nThey seem to take it personally when I don't go out of my way to talk to them, so they have resorted to picking on me to try and get a rise out of me? There's this one guy that comes in occasionally. He will call out to me \"Oh, there's the chatterbox!\" or if I say excuse me to get by him he's like \"Oh my gosh, that's the most I've ever heard you talk!\", I just looked at him and kept walking to my workbench.\n\nA small group of guys had an \"intervention\" with me because I didn't go out of my way to say good morning to them.. the next day I said good morning to them and they ignored me (I assume on purpose). I literally do not care or get upset if someone doesn't say good morning to me, it doesn't affect me at all.\n\nThe guys that have a problem with me are not people I'd like to get along with anyway. One of them I had to report for sexual harassment. Another guy used to be nice to me until another guy he hated got fired. He then started to target me as his next nemesis. \n\nI am also someone who can be content with not saying much. I have a great personal life outside of work, and I can just be in my head and be happy. But I notice a lot of people here cannot be content in their own mind, and constantly have to verbally project to feel satisfied. The harasser one day told me that he doesn't know what to talk about with me, and I told him that's okay, because I am fine with not talking (I don't think he heard me bc he has poor hearing). \n\nWhat are some lines I could say to the guys that try and pick on me about not talking? I really hate confrontation though, and try not to give it back to them, because they will think I'm down to tango in their games. Thank you.",
        "created_utc": 1678189723,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop being physically stoic and stiff??",
        "author": "Lara_Al",
        "url": "https://www.reddit.com/r/socialskills/comments/11kx47j/how_to_stop_being_physically_stoic_and_stiff/",
        "text": "Recently I’ve noticed that my body language is very awkward, stiff, and almost robotic. I wanna teach myself how to move like I’m actually a human being. Any advice???",
        "created_utc": 1678189499,
        "upvote_ratio": 0.99
    },
    {
        "title": "Two of my friends hate each other",
        "author": "yayuly",
        "url": "https://www.reddit.com/r/socialskills/comments/11kwp9v/two_of_my_friends_hate_each_other/",
        "text": "Okay then, so i have two friends and value them both, these two were originally friends but one decided to hate each other\n\nSo friend A and B were originally online friends at first, it was a pretty long story but basically Friend A noticed about Friend B's background as a lot of things Friend B's stories does not line up, thats when Friend A's suspicions grows, and did a background check and investigated Friend B, thats when Friend A feels betrayed and thats when Friend A started hating Friend B\n\nFriend B's defense on the other hand, Friend B does not want to tell things as they were only online friend probably whether they are privacy concern and etc, i on the other hand does not care about Friend B's real info as I wouldn't reveal my personal info in any kind of way in Online and i've never really been interested in so. And Friend B also found the idea of Friend A breaching Friend B's privacy super creepy and cause of that, both hate grew.\n\nNow whenever i am associated with Friend B, Friend A shits on me for being with that person (i.e chatting or playing games together)\n\nFriend B never really did anything bad to me so i can't just hate the person, but Friend A saying things like would i be okay to be friends with like * insert one of the most infamous people to ever exist* if he never done any bad things to me and etc. \n\nWhat should i do in this situation?",
        "created_utc": 1678188253,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to approach a girl who is 2 years older than me ?",
        "author": "bruh_12345_hi",
        "url": "https://www.reddit.com/r/socialskills/comments/11kwoez/how_to_approach_a_girl_who_is_2_years_older_than/",
        "text": "I'm [20 M] and I'm an engineering student. So I met this one girl in train and despite being 2 years older than me, we both talked a lot. I really liked her vibe and personality.\n\nThe thing is, she is a law student but we are currently living in same city and there is this small age gap. We did exchanged Instagram IDs with each but I really want to know her better.\n\nSo can I get any suggestions on what should I message her on Instagram?",
        "created_utc": 1678188180,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm cringe and people ignore me?",
        "author": "Legitimate_Cicada_67",
        "url": "https://www.reddit.com/r/socialskills/comments/11kvnqg/im_cringe_and_people_ignore_me/",
        "text": "I'm pretty confident. Well, outwardly. I do kinda panic inside. Despite this, the things I say just don't seem to click with people. I joke with people and they ignore me. If someone says a joke to me, no matter what, I laugh and try and make a bigger joke out of their joke with them, unless it's offensive. Usually it works and I grow closer with that one person but people don't really tend to talk with me specifically because I'm the annoying one.\n\n\nIt feels like everyone gets responded to, everyone can talk and they're fine... Until I come in. It feels like I'm some sort of clown that just arrives uninvited.\n\n\nPeople I've met kind of see me as last priority because I get so excited to talk to people and I'm so forgiving that they don't really need to make an effort, and it's easy to use me, it's happened so many times. It knocks my self esteem inside down to -10000 and I say such horrible things to myself in my head because of it, *yet continue to be uncontrollably an idiot on the outside.* I give up on people easily because I feel crappy when yet another person just sees me as either irritating or their personal entertainment with no feelings of my own.\n\n\nMaybe I'm with the wrong people or maybe I have no idea in the moment that I'm just being annoying and cringe. Thoughts??? Should I just stop trying to be funny and take a more serious view on life? How do I do that?",
        "created_utc": 1678185044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nail biter for 14 years. How do I take care of them?",
        "author": "J2Hoe",
        "url": "https://www.reddit.com/r/socialskills/comments/11kv2q9/nail_biter_for_14_years_how_do_i_take_care_of_them/",
        "text": "Before you begin reading, please note that I am choosing to give up biting my nails. I don't want to be told that it's okay to do blah blah blah. I purely just need grooming advice, please \n\nI started biting my nails at 5 to cope with my anxiety and I never stopped. it caused issues with my self image and I've been made fun of about it for years. I've tried everything like wearing gloves, sitting on my hands when I've had the urge to bite, and wearing fake nails. recently, I've had a burst of motivation (and im being aided by a special nail polish that stops you from biting) and so far I'm doing pretty well but the problem is, i don't know how to take care of them in terms of filing them etc. I've never had to cut my nails or painted them. Can I have some advice on how to keep my nails clean and tidy incase it gets to that point? I'm really scared for the day I need to cut them and stuff because I don't know how to. Advice?",
        "created_utc": 1678183187,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stop overanalysing and ruining a good interaction",
        "author": "Left_Function_8612",
        "url": "https://www.reddit.com/r/socialskills/comments/11kup5b/how_to_stop_overanalysing_and_ruining_a_good/",
        "text": "i’m pretty lacking socially and i’m pretty awkward 99% of times. Just then i had a conversation with someone i’m working on a presentation with ( i don’t know them that well) and it was genuinely one of the best ones i’ve had in a while, i feel like we were actually exchanging insight/ mutual experiences and being honest, but now i can’t help but overthink about the potentially awkward or cringey things i’ve said or done, or maybe i was being too clingy when they didn’t even want to talk to me at all. how do i stop overthinking social interactions, especially actually good ones? thank you",
        "created_utc": 1678181848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking other opinions on situation with roommate",
        "author": "RagingMayo",
        "url": "https://www.reddit.com/r/socialskills/comments/11kuhyq/seeking_other_opinions_on_situation_with_roommate/",
        "text": "Hello people, so I am a 31 year old dude, living in a shared apartment with two others. I like both of them very much and this is my favourite shared apartment I have ever been in. \n\nSo one of my roommates is very vocal, when she is annoyed by something. Let's call her Cindy. In the past it were things like the other roommate running the washing machine late in the evening (while Cindy's room is next to the bathroom). I understood it totally and we kept it in mind. \n\nShe was annoyed by us having our shoes not in the cupboard for the shoes. I honestly ignored that one because I only had the pair of shoes that I use daily on the floor, put towards the wall, so they aren't in the way. Other roommate does the same. \n\nAnother time Cindy told me that she woke up, when we closed the door from the apartment, when coming home late at night and asked us to turn around the door knob, when coming in, so she doesn't wake up from it.\n\nWe agreed on hanging our washed clothes in the living room. I kept the window open, but she later complained that the apartment was \"cooling out\" from the air coming in. Temperatures are very cold here now admittedly. I kept the window open because I was scared of getting mold in our living room. But she told me that we could also open the window every once in a while for 5 minutes. I could understand that as well.\n\nSimultaneously she asked me to not open the window for so long in the bathroom after I was showering because the apartment would \"cool out\", but I am again scared of mold, so I kept it open still. I usually take showers right before I have to leave, i.e. before going to work. So I don't have the time to close it some time later. Cindy said that I could write on in our whatsapp group next time that I left the window open and if someone could close it later. Tbh I don't want to text in the group each time/each day after showering and leaving the apartment. \n\nTo sum it up, it feels somewhat controlling. I showered this morning and left because I had an appointment with my therapist today, but I left the window in the bathroom open. I must admit I feel a little bit stressed over it because I am pretty sure that my roommate is still annoyed by it. I can understand her reasoning that she feels like the apartment gets cool from leaving a window open, but I would usually just expect the roommate to use the bathroom to simply close the window by him- or herself.\n\nIt's all not the worst situation I had in a shared apartment. I went through way worse in the past with other people. And I do really like both my roommates. Is it okay, if I ignore her last request in regards to the bathroom window? Or would I be an ass, if I did so?",
        "created_utc": 1678181090,
        "upvote_ratio": 1.0
    },
    {
        "title": "I M22 feel like I have a shitty personality.",
        "author": "Friendly-Employ-5595",
        "url": "https://www.reddit.com/r/socialskills/comments/11kthi0/i_m22_feel_like_i_have_a_shitty_personality/",
        "text": "[removed]",
        "created_utc": 1678177320,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (20M) I'm starting to find many people boring",
        "author": "milleven_",
        "url": "https://www.reddit.com/r/socialskills/comments/11kslus/i_20m_im_starting_to_find_many_people_boring/",
        "text": "I wouldn't call myself an introvert, I mean those people are friends of mine and we hang out a lot, but recently I'm starting to feel most of my interactions with people are just... repetitive should be the right word here",
        "created_utc": 1678174114,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I message a relative for advice?",
        "author": "Canners19",
        "url": "https://www.reddit.com/r/socialskills/comments/11ksjmw/how_do_i_message_a_relative_for_advice/",
        "text": "In film school and have a cousin as a Facebook friend who is an acting teacher. Our lead dropped out and we’re looking for a new one urgently. I was hoping to message him asking if he knew someone. How do I craft this message without it being weird since we’ve never actually met?",
        "created_utc": 1678173885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have to purchase food at a networking event?",
        "author": "pinkbluepurple1",
        "url": "https://www.reddit.com/r/socialskills/comments/11kshzr/do_i_have_to_purchase_food_at_a_networking_event/",
        "text": "I’m going to my first networking event. I found it on meetup. It’s at a restaurant. I’m not sure if I’m just supposed watch, listen and mingle. Or do I buy food. What’s the rules lol",
        "created_utc": 1678173718,
        "upvote_ratio": 1.0
    },
    {
        "title": "would it be weird to invite my coworkers to my wedding?",
        "author": "kikil980",
        "url": "https://www.reddit.com/r/socialskills/comments/11ksddh/would_it_be_weird_to_invite_my_coworkers_to_my/",
        "text": "im socially awkward and dont know if this is weird or not. additionally, my partner (and probably me too) is autistic so i’m not sure if she can get a good feel on the situation. really just need outsiders perspective. \n\nmy fiancé and I work together and get along really well with a three of our coworkers. i’ve been at the job for almost two years and worked with all for 1-2 years. my fiancé just came on a few months ago but previously worked with one of them for six months. \n\nthey’re a married couple and the wife’s best friend since high school so they’re all super close. we are in early 20s and they are in mid thirties so it makes sense to not be close outside of work even though we spend more time talking with them (at work) than we do any of our friends. we have only hung out a couple times outside of work. \n\nmy fiancé thinks it’s fine, but i’m not sure if it’d be awkward to invite them. the wedding is literally only 35 people so they’d show up and be the only ones who aren’t family or friends that we’ve had for years. we just dont have any any other distant friends to invite to make it seem more normal to invite them. i’m not sure if im justified in feeling weird though because I feel awkward about the whole wedding in general. should we invite them or is it kinda weird?",
        "created_utc": 1678173262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not fitting in at uni",
        "author": "dandelions124",
        "url": "https://www.reddit.com/r/socialskills/comments/11kscr9/not_fitting_in_at_uni/",
        "text": "I just started uni and Idk.. i feel like i just don’t vibe with anyone. Like, one of my biggest interest is video games(specifically indie games) and i haven’t found anyone into that.\nI talk with some people from my classes but they talk about stuff i have no interest in , like they’re talking about celebrity drama  and gossiping about others, and i just sit there awkwardly not saying much. I’m kinda upset honestly especially cause i’m not the most social person in fact i’m pretty socially awkward so i have trouble finding others in the first place and my life is super boring, never drink or go to parties cause i have no interest in that stuff so i have no cool stories to tell either… i’m kinda just feeling lonely and disappointed, idk",
        "created_utc": 1678173201,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to go out more without getting exhausted?",
        "author": "sssharmmm",
        "url": "https://www.reddit.com/r/socialskills/comments/11ksb4h/how_to_go_out_more_without_getting_exhausted/",
        "text": "I enjoy going out and would like to go more. But I’m the kind of person who gets absolutely exhausted after a social outing. Like, I need several weeks between social events to recharge. I’m also usually exhausted on weekdays after work, and on weekends I want to do chores and relax after. I want to challenge myself to go out more, and I usually enjoy it once I’m out there, but it takes soooo much energy to get out of my pajamas and drag myself out the door.\n\nOther than sleep more (which I’m admittedly bad at doing), what can I do increase my energy levels?",
        "created_utc": 1678173038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is being witty sometimes dependent on a mindset?",
        "author": "thequeasydream",
        "url": "https://www.reddit.com/r/socialskills/comments/11kru3y/is_being_witty_sometimes_dependent_on_a_mindset/",
        "text": "It annoys me so much, because often when talking to people, my good comebacks won’t come to my mind till after the moment has passed. Not long after, sometimes by a matter of seconds and without me trying. An interaction will happen and then I’ll walk away and at that moment is when the comeback will just pop into my mind. \n\nI think my social anxiety messes this up and I look boring to people on the outside. \n\nIs anyone else technically able to be witty but gets all screwed up thanks to social anxiety?",
        "created_utc": 1678171487,
        "upvote_ratio": 1.0
    },
    {
        "title": "online dating",
        "author": "stuckunderthecovers",
        "url": "https://www.reddit.com/r/socialskills/comments/11krszt/online_dating/",
        "text": "[removed]",
        "created_utc": 1678171381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fear that I’m stupid when I used to feel I was very smart",
        "author": "nikotbt",
        "url": "https://www.reddit.com/r/socialskills/comments/11krp9k/fear_that_im_stupid_when_i_used_to_feel_i_was/",
        "text": "Hey guys, I’m 20 yrs old in college and I’m a computer science and cyber security major . I have had a lot of stress, anxiety, and health problems in the past few years and I feel like I’ve gotten dumber in a sense. I hate the idea of being dumb. It was my strongest attribute . I forget words sometimes. Just overall feel stupid. Idk what to do with myself . Anyone feel like this ?",
        "created_utc": 1678171043,
        "upvote_ratio": 1.0
    },
    {
        "title": "I met someone at the beach and am not sure whether to text them",
        "author": "user246801357",
        "url": "https://www.reddit.com/r/socialskills/comments/11krnxp/i_met_someone_at_the_beach_and_am_not_sure/",
        "text": "I’ve been wanting to make new friends where I live, but I don’t know how to feel about an encounter I had last week. My therapist wasn’t sure about it either. Some of my past relationships have been dangerous and unhealthy, so I’m feeling wary.\n\nSo I rode my bike to the beach several days ago. I watched the ocean for a bit and before I was about to bike back, a lady came up to me asking about my bike, where I got it, and how much it was. She was very chatty, but I didn’t feel uncomfortable. She said she was “done with men” and needed a friend, specifically some girlfriends in her life. She mentioned her “baby daddy,” so I assume she has a child, but she didn’t mention it. She’s 31 and didn’t seem to mind the age gap between us since I’m in my early 20s. I also don’t mind having older friends. She asked if I liked traveling and that she’d give me a ride if I needed since I don’t own a car. Honestly, my thoughts went straight to human trafficking tactics. A lady I don’t know asking to travel with me? She also said “[she helps] people with their small businesses” and didn’t elaborate. My thoughts then went straight to pyramid schemes. Other activities she suggested though: getting coffee, biking and skating at the beach, all things that sound fun for me. I was unsure, so I asked for her number and said I’d text. I still haven’t. I enjoyed talking with her and like the types of quality time she suggested, but I don’t know how my gut feels.\n\nShould I take a risk and text her, maybe meet up at a public place? I have a history of trusting the wrong people, so I don’t know what to do. I want more friends, but I want to protect myself too, ya know? What are your thoughts?",
        "created_utc": 1678170922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make more friends.",
        "author": "Ok-Swing-505",
        "url": "https://www.reddit.com/r/socialskills/comments/11kridj/make_more_friends/",
        "text": "I haven't has as much luck as I wanted making friends. I easily made friend in elementary school but now in gr 12 I am not able to make friends easily. Appreciate any advice/insight/anything.",
        "created_utc": 1678170417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird to offer/ask for phone numbers instead of socials?",
        "author": "ThrowRA64822",
        "url": "https://www.reddit.com/r/socialskills/comments/11krel3/is_it_weird_to_offerask_for_phone_numbers_instead/",
        "text": "I’m a first year university student who hasn’t made any friends yet. Recently I’ve had a few new people join one of my classes and unlike a lot of people here they came across as friendly and mature. It actually felt relatively easy to talk them and I didn’t really feel awkward at all for once. It’s crossed my mind that they might ask for any social media to talk about things such as assignments and I’m worried it will be odd given that I’m a guy and they’re all girls. Would it be weird?",
        "created_utc": 1678170083,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized I'm autistic.",
        "author": "i_have_a_squeegee",
        "url": "https://www.reddit.com/r/socialskills/comments/11krcbn/i_just_realized_im_autistic/",
        "text": "I just lost two friends recently and it's a very long story but when I thought about it I realized I don't know how to gage too much distance and overly invasive. I'm extremely introverted and I default to silence when I'm in social situations. It's always been awkward with people for reasons no one could ever relate to, and I think so differently that no one I open up to actually understands. I'm not going into the detail of why I think I am but I'm reasonably sure I am. Some of my experiences are very specific to autism. I'm 38 and I have never been diagnosed, so I have no idea how to navigate social situations with my thought process. \n\nAre there any resources I can use that can help? I'm a veteran but the VA can only diagnose me. They don't do autism treatment or behavior modification training. My body never responded well to medications for depression and anxiety, so psychiatry isn't really an option. I need therapy, or at least therapy related resources to help me recognize social cues and respond appropriately.",
        "created_utc": 1678169890,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to send message to people more often? What topics that people usually talk?",
        "author": "PennyPannaCotta",
        "url": "https://www.reddit.com/r/socialskills/comments/11kr24v/how_to_send_message_to_people_more_often_what/",
        "text": "I just have a few friends, hang out very little and my inbox usually really empty. I have seen that people around me chatting really often, they always have new message. How could I change and make new friends?",
        "created_utc": 1678169020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Some Advice - Preferably from those that have figured it out",
        "author": "_plAAstik",
        "url": "https://www.reddit.com/r/socialskills/comments/11kr0u3/need_some_advice_preferably_from_those_that_have/",
        "text": " Originally my plan was to...\n\nLife  unfortunately gave me ASD. I'm now all alone, 24, and still struggle to  make friends, get dates, and living like a normal, successful human  being. It's not getting easier. There's only a few of you here that even  beat the odds and have good social skills. I believe this is the key to  a good life and that is my personal belief. I hope to hear from actual  successes. May your wisdom guide me.\n\n1. Pour many, many, many hours into learning social skills. Reading. YouTube.\n2. Practice on many thousands of random social circles\n3. Gain close friends for feedback\n4. Mastery\n\nHere's documents of my plan in more detail:\n\n[https://www.mediafire.com/file/cqcyqx36p3glnw7/Bar.zip/file](https://www.mediafire.com/file/cqcyqx36p3glnw7/Bar.zip/file)\n\nIt's too slow. I just want to stop being socially deficient now.\n\nI  just got promoted to a customer job that is fairly socially demanding.  Earlier than what I would have liked. I wanted to get to the point where  I could at least know to how easily talk to strangers about anything,  but a difficult choice was made. I would like to know what to do as soon  as possible. Their expectations are that of normal humans and I'm not  one.\n\nI  just want to be able to do what everyone else can do. Have fun at  random parties. Get dates. Have valuable skills and people respect. Have  some respect. Be somebody. What the fuck do I have to do? I have very  little resources to work with unfortunately. I'm basically all alone in  my struggles and can't say I amount to much...\n\nWhat's  the crash coarse to getting great social skills? Do any of you know? I  want this quickly. I'm afraid that I'm condemned to die alone with  scraps for retirement. I'm all alone in this and I hope to find some  answers. Seriously, to anyone that has beat the odds, what path did you  take? I desperately need answers. I'm at a total loss.",
        "created_utc": 1678168914,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i send this txt or be the bigger person",
        "author": "Cuznflip91",
        "url": "https://www.reddit.com/r/socialskills/comments/11kqrg7/should_i_send_this_txt_or_be_the_bigger_person/",
        "text": "I just cut a friend off whos a complete leech and I've done nothing but look out. I was just thinking of sending one last text that says \"your wife should of gotten on her knees the night she askeed me for money\".my wife says no be the bigger person.",
        "created_utc": 1678168159,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to identify what's off putting about myself?",
        "author": "Lovingbutdifferent",
        "url": "https://www.reddit.com/r/socialskills/comments/11kqg7f/how_to_identify_whats_off_putting_about_myself/",
        "text": "I'm 23F, and have been intensely antisocial my whole life (my parents were awful people.) Now, I have a hard time making friends- I've been lied to and fucked over by the only two close friends I've made in adulthood, and with everyone else I seem to always have to make the effort to make plans or exchange phone numbers or whatnot. I always text first, etc. We'll talk for a month or two and then drop off. \n\nThe thing is, I haven't gotten any feedback that helps me figure out what I'm doing wrong. I try to ask questions about others and not talk about myself too much, I think I'm kinda funny, I think I'm kind. People always tell me I'm a nice person and then just not seem to have any interest in a friendship with me. I've heard from multiple people that I'm just \"weird\" when they thought I couldn't hear them. My hobbies aren't that weird, mushrooms, embroidery, making wine, at least not in an off-putting way. I'm so lonely.",
        "created_utc": 1678167207,
        "upvote_ratio": 1.0
    }
]