[
    {
        "title": "I'm [26M] and I feel very insecure about not dating and that I've missed out on my teen and my early 20's by not socializing and missing out on my youth What should I do to let go of those feelings and does anyone relate?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676226030,
        "upvote_ratio": 0.99
    },
    {
        "title": "I failed college socially",
        "author": "PresentCity6535",
        "url": "https://www.reddit.com/r/socialskills/comments/110lgz1/i_failed_college_socially/",
        "text": "No matter how hard I tried, I could never make friendships or get invited to parties. I just felt like I was never meant to have friends. I tried joining clubs only to be socially isolated in the end. I can't play sports or music, so those aren't options for me. I tried rushing a few frats, but I just got rejected from all of them. My whole college experience has been lonely. I don't even know what I did with my time.\n\nMy college experience was literally worse than my high school experience. At least in high school, my teachers cared about me and said hi to me. My professors hate me and I got bad grades in college. I can't even find a job post-graduation, and I don't know how I am going to survive post-college.\n\nI don't know how I am supposed to look my parents now when they are in their 60s and about to retire, yet they still need to keep supporting me somehow because I am unemployable.",
        "created_utc": 1676223776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best social media scheduling tool",
        "author": "Immediate-Function37",
        "url": "https://www.reddit.com/r/socialskills/comments/110krf3/best_social_media_scheduling_tool/",
        "text": "[removed]",
        "created_utc": 1676222002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Handshake, Fist Bump, Hug, Bro Hug? It all scares me",
        "author": "tommy_tune",
        "url": "https://www.reddit.com/r/socialskills/comments/110kmxr/handshake_fist_bump_hug_bro_hug_it_all_scares_me/",
        "text": "I enjoy social settings and I have no problem carrying a conversation, but wondering how I will greet new people or even my best friends gives me social anxiety. Part of me wishes we could agree on how we'll greet each other before we show up. How can I conquer this fear? How do I make greetings less awkwardly executed? Much Appreciated!",
        "created_utc": 1676221694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social anxiety",
        "author": "raffaelferrante",
        "url": "https://www.reddit.com/r/socialskills/comments/110khe1/social_anxiety/",
        "text": "Brief background info on me: I was bullied pretty badly in the 5th/6th grade. The rest of my school years were more enjoyable, but overall also very challenging. Since my graduation and the pandemic period, I have been struggling with depression and anxiety, which also limits me in my everyday life. That's why I was in a psychosomatic clinic in 2021, and since then I've been in long-term therapy and taking antidepressants.\n\nAfter not being around people for a relatively long time, I was invited to a birthday party for the first time again yesterday.\n\nJust before I was about to leave, I suddenly had a very high heart rate, broke out in a sweat and had an extremely strong cramping feeling in my stomach.\n\nWhen I arrived at the place and greeted everyone, the thought loops started and I had the impression that I could suddenly hear criticism or rejection in every comment. Of course, my alcohol consumption that evening intensified the whole thing, which in retrospect was also a mistake.\n\nSince this morning, scenes from last night have been flashing in my mind's eye again and again, always connected with the basic feeling and fear/worry of having said the wrong things and having made a total fool of myself.\n\nDoes anyone have any advice on how to deal with this in the future and what I could do myself to be less anxious in such situations in the future?",
        "created_utc": 1676221314,
        "upvote_ratio": 1.0
    },
    {
        "title": "See description.",
        "author": "PossessionJazzlike66",
        "url": "https://www.reddit.com/r/socialskills/comments/110js70/see_description/",
        "text": "i dunno if this is the right sub for this sorta thing, but lately after confessing my feelings for someone, getting rejected and friendzoned later on has seemed to have skyrocketed my confidence and belief in myself and social skills, i just feel like a much better and stronger version of myself than how i was 2 weeks ago. \nany idea of why this happened?",
        "created_utc": 1676219541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was it petty of me to end the friendship",
        "author": "krueger_1993",
        "url": "https://www.reddit.com/r/socialskills/comments/110jgrm/was_it_petty_of_me_to_end_the_friendship/",
        "text": "I was just looking through my old high school yearbook and going down Memory Lane. \n\nI was friends with one fellow from high school, let's call him Max, and in fact I'd go so far as to say I was my best friend for many years. About halfway through our junior year of high school, Max suddenly starts sort of distancing himself from me and hanging out more with another classmate, who we'll call Jeff. \n\nFor the remainder of the year, Max sits next to Jeff every class and hangs out with him all the time. We rarely spoke to each other in class and almost outside of school. I didn't know what happened, but I just sort of thought the friendship was over. \n\nJeff transferred schools just before the new school year, and suddenly, Max decided he's going to be my friend again. He starts sitting next to me in class again, asking me to hang out, and so on\n \nI basically distanced myself at that point. I declined his suggestions we hang out and didn't talk to him unless I really had to. I eventually just told him I no longer had any interest in bring friends. \n\nLooking back, 17-year old me was more than a little petty and dramatic. What do you think?",
        "created_utc": 1676218748,
        "upvote_ratio": 1.0
    },
    {
        "title": "I act like an idiot during foreign social interactions, how do I fix it?",
        "author": "Demirboy",
        "url": "/r/CasualConversation/comments/10zuu2z/i_act_like_an_idiot_during_foreign_social/",
        "text": "",
        "created_utc": 1676218694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is short conversation a bad sign?",
        "author": "Kirane_Husky",
        "url": "https://www.reddit.com/r/socialskills/comments/110j803/is_short_conversation_a_bad_sign/",
        "text": "I'm in a mindset that friendships are doing great because of conversations lasting hours, and mine's not so great because it's only like one topic or two. I know it sounds like a fantasy, but I'm absolutely certain that good friends are texting or talking for long, always finding topic after topic. Just because we're friends, we can talk to eachother for hours, right?\nI know it's totally different if it is a group of people, but I mean like one to one.\nCan someone please tell me how it is really or just prove me wrong?\nPeople who just live overthinking-free life in this segment, how long do your conversation last? And are you satisfied with them or you wish something to change?",
        "created_utc": 1676218130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roomate",
        "author": "Sad-Ad-8993",
        "url": "https://www.reddit.com/r/socialskills/comments/110ic3m/roomate/",
        "text": "How do I politely ask my roommate  to wash her sheets? The room reeks of her body odor, it smells like pepperoni, Mayo, and mildew. And there is literally a ring of dirt where she lays. The smell is so strong that it rubs off on my clothes. Personally, I wash my sheets 1-2 weeks depending on the weather. This is what I was raised to do but apparently at college people think it’s insane and I’m afraid me asking her to wash her sheets may come off as rude.",
        "created_utc": 1676215826,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to make friends. What steps should I take to accomplishing that?",
        "author": "anon38848168",
        "url": "https://www.reddit.com/r/socialskills/comments/110hou1/i_want_to_make_friends_what_steps_should_i_take/",
        "text": "I’ve been at college for a few months now but I’ve been too scared to try and make any friends. I realize nothing’s gonna happen if I do nothing, so I want to know what I can do to achieve that goal. There’s a ton of clubs, I’m mostly taking in person classes, and although I’m not particularly religious, there is an organization of students that my family recommends I join. However, I’m always worried that I’ll weird people out in class if I try to talk to them out of nowhere, or that I’m not good enough to join any clubs. What steps should I take to get better at talking to people in class, or finding out what I’m good at so that I can join a club?",
        "created_utc": 1676214111,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop being insulted",
        "author": "hideout_007",
        "url": "https://www.reddit.com/r/socialskills/comments/110ho61/how_to_stop_being_insulted/",
        "text": "Not really a fan of revealing details but I'm 17M, student and have a friend group with quite interesting people.\nBut they've been insulting and joking on my personal insecurities and personal stuff I've revealed to them myself. I feel miserable and inferior around them as they are the \"cool guys gang\" and they get girls. So as they make use of me as some sort of laughing content everyone laughs at me and my respect is totally gone and my classmates(other guys) started to make fun of me as well who had been respectful before. They also broke physical boundaries and begin to hit me(not abuse just small guys stuff like slaps etc) and this has made me angrier to become more stronger(I'm thin af)\nI feel I brought this on myself. Nobody respects me and I have become the laughing stock of my entire class.\n1 month to go for school end so how can I prevent this in college. I'm already planning on leaving the friend group.",
        "created_utc": 1676214065,
        "upvote_ratio": 0.99
    },
    {
        "title": "I made a mistake",
        "author": "juka-004",
        "url": "https://www.reddit.com/r/socialskills/comments/110hlgo/i_made_a_mistake/",
        "text": "[removed]",
        "created_utc": 1676213885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I Disrespectful to people?",
        "author": "CookieFlup",
        "url": "https://www.reddit.com/r/socialskills/comments/110hjil/am_i_disrespectful_to_people/",
        "text": "This happened a while back but there was this girl I liked, lets call her Lexi (we where friends for 5 years) Lexi was nice, cute and she would always come to me if she needed help or was sad. but after a while of us being friends Lexi began to message me less and ignore me at school. And to this day I blame it on her best friend, we would do everything together until she came into the picture. Lexi and I would do everything together, we went out and we called. and her best friend ruined everything, I then had the thought that she wasn't interested anymore and decided to block myself from her entirely, but she came back asking me to unblock her, so I did. But a couple of days later I blocked her again because she didn't message me at all, and she came back again doing the exact same thing, so I messaged her this: \" Look I have been in love with you for 5 years now, I don't get how you haven't noticed but I have decided I don't want to be your friend anymore, your bestfriend has been a real disturbance in our friendship and I have to say she is a bitch i do not like how she treats me, and she makes you happy I will leave you with her\". and i ignored her for 2 years until she moved away.",
        "created_utc": 1676213735,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m and extrovert but I don’t have friends. Help.",
        "author": "wellspaul13",
        "url": "https://www.reddit.com/r/socialskills/comments/110hgy3/im_and_extrovert_but_i_dont_have_friends_help/",
        "text": "Basically I’ve always been an extrovert, I like being around people, it gives me energy and I hate being alone. But I only have one friend right now in college. Which means I’m alone most of the time (no relationship and family lives far away). I don’t find it hard to talk to new people. I talk to new people all the time in classes and on campus but it just never goes anywhere. At this point I have like hundreds of acquaintances but only one actual real friend I can hang out with outside of class. It seems like I just can’t connect with many people on a deeper level. And in most cases I don’t even have a chance to find out. It seems like many people are not looking for friends in college and only consider me a classmate. Like they never even think about the possibility of being friends with me outside of class. It sucks so much because I feel miserable being alone. I wish I was an introvert so I could enjoy my alone time but this just sucks. I don’t know what to do. :(",
        "created_utc": 1676213538,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this odd?",
        "author": "redking2005",
        "url": "https://www.reddit.com/r/socialskills/comments/110h3k2/is_this_odd/",
        "text": "I hate it when people try to enforce conversations with me but I really enjoy having the option of conversation not having it be mandated, I started thinking about it cause I visited family I don't usually about a month ago and I realised that it might be odd for us to mainly just be on our phones with small conversation at random points (when xyz felt like it) and I really enjoyed the time I spent with them even if conversation wise we spent a relatively short time talking to each other.",
        "created_utc": 1676212490,
        "upvote_ratio": 1.0
    },
    {
        "title": "I struggle at making friends irl",
        "author": "howdoihow",
        "url": "https://www.reddit.com/r/socialskills/comments/110gga5/i_struggle_at_making_friends_irl/",
        "text": "I (23F) have always struggled at making friends after primary school. Throughout high school I was a floater between groups and I feel like I had a lot of jealousy and resentment issues, and when high school ended I deleted all my close friends on social media, partially to let them know how I felt excluded (not a healthy way to deal with it, I know).\n\nRight from starting Uni I met my first long term (ex) partner and was pretty good socially, hanging out with him and our mutual friends all the time (mostly introduced by him to them). 4 years later when it ended, I found most of our mutual friends didn't talk to me anymore. \n\nI am good at making friends on online platforms and I'm good at texting, but right now my closest friends are my partner (22M) and sibling (17NB). I am a pretty gloomy person and I worry I bring others around me down. When I hang out with friends (especially female for some reason) face to face I feel like there's a mask over my emotions and the way I talk and I can't push through it to be authentic, and I feel like that gets in the way. I also know I restrict a lot of my authentic self out of fear of being annoying or saying the wrong thing.\n\nI also am really sensitive to exclusion and feel like it happens to me a lot. I do also struggle with resentment and sometimes jealousy still, and I will often go to the extreme ends of things when I feel like I've been treated negatively even though they are minor things. When I have a disagreement with someone, I become paranoid because I feel like everyone must be siding with the person who I had the disagreement with.\n\nReading this back I know I should talk to my therapist about it but I find a lot of our time together is occupied by my OCD, family issues, anxiety etc. that I wouldn't know how to fit that in and when I talk to her this stuff just seems at the back of my head but I do feel lonely a lot and I struggle with that.\n\nI would just appreciate any advice with building relationships once I've passed some of the formative years to make them (high school and Uni). I know it isn't too late but I don't even know where to start, and how to do the self-work to make myself a healthier person to be friends with.\n\nI hope this goes in this sub-reddit but I apologise if it isn't. Thank you :)",
        "created_utc": 1676210651,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really struggle at making friends irl",
        "author": "howdoihow",
        "url": "https://www.reddit.com/r/socialskills/comments/110gbhh/i_really_struggle_at_making_friends_irl/",
        "text": "[removed]",
        "created_utc": 1676210275,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happened? What am I doing wrong?",
        "author": "Own_Today6913",
        "url": "https://www.reddit.com/r/socialskills/comments/110fw3d/what_happened_what_am_i_doing_wrong/",
        "text": "Everything was going fine at work and I was friendly and having fun with everyone but now it seems like everyone hates me and i feel like I’m being so awkward and idk what to do. I feel like this happens all the time when I finally make friends",
        "created_utc": 1676208977,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get a girl to be interested in me romantically?",
        "author": "TheHiddenPoro",
        "url": "https://www.reddit.com/r/socialskills/comments/110f650/how_do_i_get_a_girl_to_be_interested_in_me/",
        "text": "[removed]",
        "created_utc": 1676206764,
        "upvote_ratio": 1.0
    },
    {
        "title": "My female friends think I’m gay?",
        "author": "Emotional_Battle_278",
        "url": "https://www.reddit.com/r/socialskills/comments/110f10g/my_female_friends_think_im_gay/",
        "text": "[removed]",
        "created_utc": 1676206283,
        "upvote_ratio": 1.0
    },
    {
        "title": "about to give up on making irl friends.",
        "author": "yummyspiders",
        "url": "https://www.reddit.com/r/socialskills/comments/110e7qs/about_to_give_up_on_making_irl_friends/",
        "text": "[removed]",
        "created_utc": 1676203510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guy keeps making remarks and tries to belittle me",
        "author": "lifelover9",
        "url": "https://www.reddit.com/r/socialskills/comments/110d813/guy_keeps_making_remarks_and_tries_to_belittle_me/",
        "text": "Basically I have this guy at work who keep making some remarks about me in front of people, he tries to play it cool and funny, but it's clear his intentions, kind of trying to belittle me. \n\nI'm an introvert and private guy, so I try to mind my business, but when I get in to the conversation or when I'm the subject, he always try to \"cockblock\" me (sorry for the term, I'm not a native English speaker but this work fits well), also there are some women there, and he seems to always try to impress them, just to be clear: I don't have any romance interest in them.\n\nI don't have the social skills to handle it and, then, when I get home, I always keep thinking what I could say.\n\nA little and dumb examples, which already happened: \n\n\\-He asked if I really work out, because it doesn't seems that I do (he works out and always try to show his body);\n\n\\-After a woman said I look strong for a cyclist, he said, as I cut a watermelon: \"Omg, you must have so much muscle to be able to cut a watermelon with a spoon\" \n\nAnd so on... just examples to help you guys to help me.",
        "created_utc": 1676199751,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does a hug from behind mean?",
        "author": "ThorOdinsson10",
        "url": "https://www.reddit.com/r/socialskills/comments/110cu2a/what_does_a_hug_from_behind_mean/",
        "text": "Last night I had a party and a woman I went to school with many years ago comes up from behind, wraps her arms around me and hugs me from behind. She does this on two different occasions during the night. \n\nWhat is the meaning of a hug from behind?",
        "created_utc": 1676198323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going back to uni after a two year break, any advice on making friends ?",
        "author": "Sad_Efficiency69",
        "url": "https://www.reddit.com/r/socialskills/comments/110bm63/going_back_to_uni_after_a_two_year_break_any/",
        "text": "I took a 1.5 year break because of COVID and did work unrelated to my field. I’ve come back to finish my final year but I’ll be starting from zero since friends I knew have graduated and entered the work force. The social club scene is pretty poor at my uni since it’s more of a commuter college, but I’ll try and rejoin my school Soc ofc. It almost seems like common sense I just wonder if anyone has any tips that I haven’t thought of in this situation.",
        "created_utc": 1676193680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is more generous: Rich or Poor?",
        "author": "Gullible-Duck-3665",
        "url": "https://www.reddit.com/r/socialskills/comments/110b8f4/who_is_more_generous_rich_or_poor/",
        "text": "I'll say rich people are more generous. From my experiences.",
        "created_utc": 1676192163,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do I deal with people who are very clearly racist and know that they are racist but encourage it.",
        "author": "AbhayXV",
        "url": "https://www.reddit.com/r/socialskills/comments/110awdu/how_do_i_deal_with_people_who_are_very_clearly/",
        "text": " \n\nSo I usually don't post on reddit and try to keep my problems to myself, but these days it has become unbearable really.\n\nSo I am a high schooler from Kolkata, and my class has quite a bit of very far right students(its a boys' school), and they make many racist remarks, insults and jokes regarding me almost everyday; even dismissing valid points by just saying \"chup Bihari(Its a geographical identity in India, but a lot of people treat it like race)\" and going so far as to deny me a chance to participate in things I am passionate about such as debates and the MUN(Model United Nations) (as most of these students are from the student council and debate committee).\n\nI try not talking to them and denying them attention, but I really dont know to deal with this(I can deal with a single person, but with this many people I often feel cornered in a way, its around 8-9 people) so any helps/suggestions would be appreciated.\n\nHope y'all have a good day:)\n\nTLDR: Classmates are actively racist and are aware of it. How do I deal with them?",
        "created_utc": 1676190753,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with intense feelings that I won't make any friends in the short term",
        "author": "Nonny00",
        "url": "https://www.reddit.com/r/socialskills/comments/110ar6s/how_to_deal_with_intense_feelings_that_i_wont/",
        "text": "I've just graduated university and I didn't make any friends in university. I didn't make any friends in high school either. I don't think I can make any friends in the short term because I don't live near a lot of events. \n\nI've been trying to learn a language, do coding exercises, play games but I just can't sometimes due to these intense feelings of isolation. I've been going to a language exchange weekly but I don't think I can become friends with the people there. I want these feelings to go away but I feel like they'll only go away once I make friends. I want friends so that I can get life experience going out to lunch, stores, etc., and so that I can go on trips with my friends. I'm just so sick of living this lifestyle for so long.",
        "created_utc": 1676190172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bing bong",
        "author": "SleeperAdgentJarJar",
        "url": "https://www.reddit.com/r/socialskills/comments/110agbi/bing_bong/",
        "text": "[removed]",
        "created_utc": 1676188897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear New Friend",
        "author": "Sea-Relative5597",
        "url": "https://www.reddit.com/r/socialskills/comments/110ag8i/dear_new_friend/",
        "text": "[removed]",
        "created_utc": 1676188888,
        "upvote_ratio": 1.0
    },
    {
        "title": "need some help",
        "author": "nhlheadlineig",
        "url": "https://www.reddit.com/r/socialskills/comments/110a8ro/need_some_help/",
        "text": "not exactly sure if i came to the right place here but i’ll give it a shot. i’m 18 doing college online and have a part time job, everything is fine right now. big problem i’m noticing is i’m scared to do basic adult things. for example, i get weird with simple stuff like going to the grocery store, picking up my brother from school, picking up take-out, etc. i have social anxiety so that definitely has to do with it but another big part of it is driving. driving to my job is not a big problem because it’s a very short drive and i’m very used to it by now, but if someone asks me to drive somewhere i’m not used to driving, i get weird about it. i might know exactly where it is because i’ve been driven there and i’ve been there, but i haven’t personally drove there myself. my question is where do i start to solve this? obviously i’m not gonna take an hour long drive to get over my fears, i wanna take it step by step. an idea that ran through my head was taking some drives at night. might sound weird, but i actually prefer driving at night due to the small amount of people on the road. i get most nervous when there’s a lot of people driving. i could do this pretty easily too considering it’s not a must for me to be up early-point is, i can stay up late without worrying about the next morning. please help me out, where do i start to fix all this? thank you",
        "created_utc": 1676188044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice Needed: Tramua ridden hermit that needs to change",
        "author": "Unfair_Elderberry780",
        "url": "https://www.reddit.com/r/socialskills/comments/1109ujw/advice_needed_tramua_ridden_hermit_that_needs_to/",
        "text": "[removed]",
        "created_utc": 1676186463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Felt like the least cool and important person in the room.",
        "author": "Chakkster",
        "url": "https://www.reddit.com/r/socialskills/comments/1109qk0/felt_like_the_least_cool_and_important_person_in/",
        "text": "Went to a social event yesterday in Toronto and there were a LOT of cool people as I would describe them. I’m from a city about 45 mins from there and don’t usually hang around people like them. They were like IG influencers all around me. What sucked that I felt so unimportant and small around them. Like invisible. I’m an artist so I performed there but it felt like no one quite cared I was there. I definitely trusties going around talking to people but still felt quite small. I keep thinking about it. What to do?",
        "created_utc": 1676186023,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cant tell if my coworker is actually my friend and im very sad",
        "author": "amysterygirl",
        "url": "https://www.reddit.com/r/socialskills/comments/1108tcs/i_cant_tell_if_my_coworker_is_actually_my_friend/",
        "text": "So me (24f) and my coworker (25m) clicked really well and became good friends at work. We have hung out twice outside of work in about 6 months. Ive invited him to group things but he just never texted me back which at first i was taken aback by because he verbally expressed to me multiple times that he wanted to hang out and be friends, but ultimately i decided hes just like that and it didnt really bother me a ton. and hes not a people pleaser or anything- he didnt casually talk with of our staff in general and i dont doubt that he liked my company. \n\nHe quit last week and ive texted him 3x, one i just worked my first shift without him and i was pretty sad actually, hes super funny and always did bits and impressions that would be the highlight of my day, so i texted him a picture. of us on out last day someone took and that i miseed him. he didnt say anything. Then i texted happy birthday and he said thank you. then I asked him if he started reading a book we randomly both acquired  the same week and we were gonna read it at the same time and do a mini book club, he just never answred. I am a bad texter too and i get it but i just thought he wanted to be my real friend and i dont think we are close enough to have that thing where you dont talk for months and then its just like youre best friends again. maybe but i just think he will forget about me is all. i just thought like cause we dont see eachother all the tome if he wanted to be friends he would text me back now and im pretty bummed, thats an understatement.\n\nIm scared ill never see him again. i really liked him i thought we were friends. he told me he thought of me as a good friend so i dont think im insane but i also feel so dumb cause i dont even think he cares that much its embarrassing. I just dont have a lot of friends and he was an little light in my life for a moment there. \n\nHow can i not tell if hes really my friend? Are some people just like that?",
        "created_utc": 1676182528,
        "upvote_ratio": 1.0
    },
    {
        "title": "I actually cannot speak with girls it’s so bad",
        "author": "CFA321",
        "url": "https://www.reddit.com/r/socialskills/comments/1108goe/i_actually_cannot_speak_with_girls_its_so_bad/",
        "text": "I’m 17, I’m your stereotypical virgin who can’t speak to women, I’m insecure about my height, (5’5). I feel I’m not ugly per se, and yet I lack all confidence what so ever. Today I had a horrible experience, was out with 4 or so guys. Take in I can talk to guys perfectly fine, they usually say I’m funny and a chill guy. The guys who was out with are the complete opposite of me, they’re able to speak with girls so easily it’s almost like an art form I don’t get it. Regardless, they managed to get 3 girls over fast forward a bit we’re watching a movie. I’m left on the couch alone with a girl I don’t know. I kid you not an hour goes by and we still haven’t even exchanged words. I literally had absolutely no idea what to say or what to do… everyone else was downstairs doing god knows what. I just feel like a complete inept fucking idiot. It amazes me how I’m able to talk to dudes perfectly and always have something to say but with girls it’s a different story.",
        "created_utc": 1676181267,
        "upvote_ratio": 1.0
    },
    {
        "title": "“If I were a guy, I’d wanna look like you”",
        "author": "Glorianorthwood",
        "url": "https://www.reddit.com/r/socialskills/comments/1108djl/if_i_were_a_guy_id_wanna_look_like_you/",
        "text": "[removed]",
        "created_utc": 1676180952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Co-worker finds me intimidating.",
        "author": "FalseVerthandi",
        "url": "https://www.reddit.com/r/socialskills/comments/1107m8i/coworker_finds_me_intimidating/",
        "text": "I work part-time in a supermarket. I'm well-liked and cordial to everyone I have an excuse to interact with. But our store has literally hundreds of employees. So sooner or later I'm just not going to be acquainted with every single one of them... \n\n&amp;#x200B;\n\n1. Co-worker/friend named Nick playfully approached me with a secret involving me. \n2. He'd been talking with a cleaner I'm unacquainted with around our age named Sarah. \n3. Sarah told him that she found me intimidating (curious). \n4. I have no opinion of Sarah since we don't know each other. \n5. Nick laughed and told me I'm the least intimidating person around. \n6. Later on Nick bizarrely introduces me to Sarah. \n7. I've spoken to severely mothers at work in confidentiality over this. \n8. All the mothers instantly assumed this girl liked me. \n9. I had to explain to all of them that this girl already is taken. \n\nWhy does a complete stranger find a very non-threatening person intimidating?",
        "created_utc": 1676178187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Female co-worker finds me 'intimidating'",
        "author": "FalseVerthandi",
        "url": "https://www.reddit.com/r/socialskills/comments/1107f0l/female_coworker_finds_me_intimidating/",
        "text": "[removed]",
        "created_utc": 1676177512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else struggle with this?",
        "author": "detectivera",
        "url": "https://www.reddit.com/r/socialskills/comments/1106ozk/does_anyone_else_struggle_with_this/",
        "text": "My social skills are fine. I am an introvert. Though, in social situations, I can hold conversations pretty well and introduce myself well to people.\n\nI feel like my only issue is building a deep friendship/connection with people. I feel like all I end up doing is making a bunch of loose acquaintances. I know having acquaintances as connections can be good, but I haven’t had a deep friendship in years.\n\nI recently joined my campus’s sorority and am part of the new member class this semester, and although I’ve met a lot of the girls and introduced myself to them and talked to them, I can’t seem to start building a close bond with them, but other new members are already making strong bonds. \n\nLike I talk to one girl in the sorority and have a good conversation, but then after that I would rarely see her again, and this happened so many times. Do you guys have any advice on what I should do?",
        "created_utc": 1676175021,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should you do when someone won’t stop interrupting you?",
        "author": "ConsciousAssistant37",
        "url": "https://www.reddit.com/r/socialskills/comments/110684r/what_should_you_do_when_someone_wont_stop/",
        "text": "I (22M) was in a situation recently with a few other guys where we were having a pretty wide ranging conversation, and people were pretty much just taking the discussion to a new subject every other sentence. Video games, universal healthcare, marriage, drinking, and more were all covered so it was a little hard to keep up sometimes. That being said, when I did speak up, I was frequently barreled over by one or two guys. I tried the charisma on command approach of just continuing what I was saying, but he kept talking anyways and drowned me out. I didn’t know if it would be excessive to ask him to be quiet and wait to talk, but I became increasingly frustrated by how I couldn’t even participate in the conversation when I actually had substantiated and thought out opinions to voice. In this type of situation, what should the progression of your responses be? Should you just leave if you ask someone to let you talk and they refuse or ignore you?",
        "created_utc": 1676173457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being called rude",
        "author": "IllustrationArtist0",
        "url": "https://www.reddit.com/r/socialskills/comments/1105lcl/being_called_rude/",
        "text": "So basically i and this guy were having a conversation about work and stuff. He said that he  can do many different things in art like painting, drawing, sculpture and ceramic, even though he study graphic design and also he do photography. So i asked him “ what are you good at” and the accused me of being rude for asking that question. I really wanna ask was i being rude for asking such a question like that. Since, he can do many different things doesn’t mean he good at it.",
        "created_utc": 1676171372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends not respecting me enough.",
        "author": "MAureliuz",
        "url": "https://www.reddit.com/r/socialskills/comments/1105imn/friends_not_respecting_me_enough/",
        "text": "So I was out drinking. Was hanging with a buddy. I wanted to get in contact with my friend group that was at another bar. Our friend group had a FB arrangement for like a month. We had been talking for a while about going out this weekend, but I was in my sisters birthday before I went out drinking. It might be that I prioritized going to her rather than their pre party.\n\nWhen I tried to call them they did not pick up. And when I sent a message by Snapchat I could see my friend look at the message but not respond. My english is not the best to convey what i feel, but they ignored me when I tried to get in contact with them. It feels shitty asf too be honest. We are late twenties.\n\nThese guys are my main friend group, but it feels like they don't really respect me when they don't even pick up the phone when I call. I called 3 of them. What should I do. Is this something I should just accept? Is it cool for them to act this way since I went to my sisters birthday before out planned pre party?\n\nToo be honest it feels kind of lonely to be at a bar calling all my bros and none of them responding when I know they are all our drinking. Am I a fuck up with no friend or am I over reacting? Would love some feedback :)",
        "created_utc": 1676171121,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get people to stop calling me a certain name ?",
        "author": "jessi387",
        "url": "https://www.reddit.com/r/socialskills/comments/1105hpk/how_to_get_people_to_stop_calling_me_a_certain/",
        "text": "So lately a bunch of people have been calling me by a variation of my name. Think of it like how someone named Debra might be called Debbie or Deb. I really do not like it. How can I get people to stop. I’ve already corrected one person and they said “ oh my gosh I’m so sorry”. A week later they were back at it again. Can I get some feedback?",
        "created_utc": 1676171044,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am stranded by my boyfriend",
        "author": "theofdevil",
        "url": "https://www.reddit.com/r/socialskills/comments/1105290/i_am_stranded_by_my_boyfriend/",
        "text": "I went on a trip down south with my bf and on thursday night we fell out and the next morning i went out for a subway (sandwich shop) myself, when i came back the caravan we rented was gone, with all my stuff in it, all i have right now is my cracked to heck phone which a shop will not buy, i have asked friends and my small limited family for help or to drive down (no help, thats another story for advice on these toxic people i have in my life) i have no idea what to do, my wallet and ids are in my gymbag in the caravan, bank cant help me transfer money to my empty paypal, i have no id to withdraw in person with my credit line, i have no where near enough money for the train home, liam (bf) has blocked my number, ive tried calling his parents but theyre not getting involved EVEN THO OF THESE CIRCUMSTANCES currently in the same clothes, not eaten, charging my phone at a bus stop, been awake 48hours and im running out of options. Is there any services that can help me anywhere please, i am scared and dont know what to do, i dont have much credit/data left, online support advixe suggested contacting formums and said their are lots of helpful people out there &amp; i need your help. im sorry, im very sorry",
        "created_utc": 1676169675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hard time expressing thoughts/ coming up with things to say",
        "author": "TrueTeddy",
        "url": "https://www.reddit.com/r/socialskills/comments/1104ogq/hard_time_expressing_thoughts_coming_up_with/",
        "text": "Hello, 22M here, and I've never really been able to express what I want to say vocally, especially face to face, unless I explicitly prepare for it (like an oral presentation of some sort etc).\n\nFor example, if someone asks for an update from me in a team meeting for a project. Even if I have a clear idea on what I want to say going into the meeting, I have a hard time explaining what I've done, what problems I've faced, what kind of solutions I've tried etc.\n\nI also have trouble in job interviews. I usually go off on tangents, even for simple questions. I also sometimes start talking about one scenario (i.e for like a STAR question), then I might spontaneously decide to talk about a different scenario.\n\nThe same goes for stories. For example, a cousin recently asked me what exactly I do for a job, but I don't think they really understood what I do, or what I was trying to say.\n\nHopefully, this is the right sub to ask\n\nI appreciate any advice and TIA!",
        "created_utc": 1676168484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im really bad with showing that i care",
        "author": "hjhfcewnlk",
        "url": "https://www.reddit.com/r/socialskills/comments/11049wm/im_really_bad_with_showing_that_i_care/",
        "text": "Dont get me wrong i do care about how someone feels. I can easily understand what someone is going through must feel like. I just suck at *showing* it  \nIf something exciting happens to someone and i feel very happy for them, i still act like i dont. I DONT KNOW HOW TO ACT HAPPY FOR THEM EVEN IF I AM.   \nOr a friend could ask \"Do i look good?\" i think \"you look super pretty and nice\" but then i say \"you look fine\"  \nOr if someone is crying, or sad and ranting to me about something, i care a ton but then i act all uncomfortable and like i just want it to be over (which tbh i kind of do because im so embarrassed about my awkwardness) \n\nOver text im way better at expressing what i actually think, because i dont have to worry about the tone of my voice or facial expressions. But over text i can hug someone or i may seem less genuine because i never compliment them like that irl idk. \n\nThis is kind of a rant but also i kinda want advice",
        "created_utc": 1676167213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it easy to tell that someone is a virgin?",
        "author": "WorkingTissue",
        "url": "https://www.reddit.com/r/socialskills/comments/11048o0/is_it_easy_to_tell_that_someone_is_a_virgin/",
        "text": "[removed]",
        "created_utc": 1676167110,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do once I get their phone number?",
        "author": "AlexInThePalace",
        "url": "https://www.reddit.com/r/socialskills/comments/11041gn/what_do_i_do_once_i_get_their_phone_number/",
        "text": "I’m so happy that I finally got someone who might become my first ever college friend after over half a year of extreme loneliness (minus discord friends). We have a couple classes together, so bump into each other multiple times a week, and we live on the same floor. \n\nI was finally able to work up the courage to reach out to him and ask for his number, and now I sit with him in our classes. We’ve had a few text exchanges, but at this stage, I don’t think he’d text me unless I texted him first (but he does seem happy to respond), and he seems to have other friends he hangs out with.\n\nIt feels weird to continually reach out to him first and ask what he’s up to and see if I can join some hangout with us friends or something. I already asked yesterday and he was tired, so I don’t know if it’s appropriate to do it again today.\n\nWhat do I do at this stage? Is it better if I try to find ways to meet up with him one-on-one or if I try to join him with his friends?",
        "created_utc": 1676166493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snapped on a guy who wouldn’t close his mouth about something personal. Now it seems like everyone dislikes me.",
        "author": "demon_mode",
        "url": "https://www.reddit.com/r/socialskills/comments/1102xae/snapped_on_a_guy_who_wouldnt_close_his_mouth/",
        "text": "Quite embarrassed to find myself here posting this, as I’ve never looked to the internet for questions to issues like this,  as I’ve always handled stuff myself but I know that there is often good advice and I’m in a situation where there is nobody else to seek advice from. I’ll go ahead and mention that I’m well aware that people will not like you in life and it’s just a part of life. So I apologize if this seems like a small stupid issue and I overreacted but I am more confused that anything.\n\nA few days ago I snapped on a guy who was with a group of people that was mocking me about some personal things. I told him “cut that shit out”. He didn’t listen and I got enraged and stormed over to him and grabbed him and yelled in his face for a few seconds and then I let him go. Now I’m a person who has always been pretty good at handling shit like this myself and I’m cool and respect others until they cross my line. He and the group seemed to find it funny, which I don’t understand because I feel like most normal people would get the hint and we’d just move on. Unfortunately the group was also taking part in it as well but I knew I couldn’t just snap on 7 other guys. Some of them I usually am chill with and I thought we were cool and everything. They all know that what they were doing I hated. After that incident, the people who saw that and were there don’t talk to me and a guy who I was pretty close with just avoids me as well. I had also told him to cut it out as well. Since I thought we were friends and I even had a conversation with him about how I hated when people mocked me about that stuff like a year ago, I’m enraged to find out that he doesn’t give shit. I’m angry at myself for responding, usually I’m good at keeping my cool and all but that morning was bad, imagine 10+ people mocking you about a family member and you really can’t do anything. That’s pretty much how I felt. I feel a little immature for lashing out but I wasn’t just about to tolerate it. Something that would be worth mentioning is that I go to an all male school so it’s a bunch of guys caged up with each other and we live on campus. I’ve known these people for 3 years and we’ve pretty much lived with each other for that time. I’m most angry that I’m still thinking about this but the only reason is because ever since, these people act like what I did was horrible or something just because I wasn’t taking any shit them. It’s made me angry that there’s people who I spent 3 years thinking we were boys and we had each others backs, only to find out right before we graduate that nah that wasn’t the case. I always find myself leaving other people behind because they never ended up truly being your friend. Is it me or them. It’s almost a cycle now. \n\nIf you’ve gotten this far, thank you for reading this and I hope I can get some good advice. I myself do not have a good enough heart to help strangers on the internet so I have somewhat of a respect for you and thank you.",
        "created_utc": 1676163177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts about traveling different countries?",
        "author": "Cheva_De_Kurumi",
        "url": "https://www.reddit.com/r/socialskills/comments/1102nge/thoughts_about_traveling_different_countries/",
        "text": "I always dreamed of traveling around the world and meet new people, new cultures and stuff, but idk if I'm gonna like it since I have SA and my social skills are the worst, I don't wanna regret this decision because it might increase my SA and get me into depression (that's what happened to me couple of years ago when I tried to fight it back and meet new people)",
        "created_utc": 1676162391,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make friends ?",
        "author": "Karinitaa_25",
        "url": "https://www.reddit.com/r/socialskills/comments/1102e4b/how_do_i_make_friends/",
        "text": "[removed]",
        "created_utc": 1676161646,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the signs of an emotional unavailable woman when it comes to friendships?",
        "author": "MusicGoddess22",
        "url": "https://www.reddit.com/r/socialskills/comments/1101wak/what_are_the_signs_of_an_emotional_unavailable/",
        "text": "I am a woman and I realized that some of my ex female friends were shallow and only seeked superficial friendships. I heard that this is one trait of emotional unavailability, but I need to learn more so I can weed out the shallow people regarding friendships.",
        "created_utc": 1676160218,
        "upvote_ratio": 1.0
    },
    {
        "title": "My good friend just moved back but is annoying me. How do I deal with this?",
        "author": "coffeeandlattee",
        "url": "https://www.reddit.com/r/socialskills/comments/1101b4g/my_good_friend_just_moved_back_but_is_annoying_me/",
        "text": "My good high school friend, just moved back. She was living in Minneapolis for 4 years. \n\nShe’s been living here for about 1 month 1/2. She’s been asking me to hanging every single week. We’ve already hung out 4 times. \n\nI understand that I may be he only friend in the area and she’s desperate to go out, but I’m started to feel smothered. (She does have a boyfriend she can do things with). \n\nShe’s coming off very desperate. She told me to introduce her to my work friends and to invite her to any gatherings that I do. \n\nI don’t want to get to a point of resentment.",
        "created_utc": 1676158604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends are holding back my social life, but Im also part of the problem. Any advice?",
        "author": "LMR_Sahara",
        "url": "https://www.reddit.com/r/socialskills/comments/11016lh/friends_are_holding_back_my_social_life_but_im/",
        "text": "I currently have about two close friends, with roughly 10 people in my friend group. First and foremost I'm fully aware that I'm lucky to have friends in the first place, as a lot of people do not and I value them to death, they are kind and supportive. However, here comes the rant;\n\nI'm sick and tired of spending my Friday and Saturday nights just sitting at home, doing nothing. And I'm part of the reason why, before I elaborate on the latter, lets touch on my friends first.\n\nThey're all great dudes, but quite frankly they're all pretty introverted. I'm a college student in a small town in Utah, the college parties here are pretty lame (think of a lot of people in tiny, small cramped condos) so really the only social interactions to do here are to either go to the local bar, or school events. I try asking my friends at least once a week if they want to go out to the bar or to whatever school event is going on. The responses I typically get are either \"I'm tired\", \"I'm just not feeling it tonight.\" \"I have a gf man, she wouldn't appreciate me going to the bar.\" or \"I have a lot of homework.\" What results is everyone either staying in their rooms playing video games, or watching some anime in the living room. Which there's nothing wrong with, but I feel like that is something that can either be done on a weekday night, not every weekend night consistently.\n\nNow onto me and how I'm equally part of the problem - I'm in this weird middle ground of being extroverted enough to want to go out and meet people, but too introverted to actually go out and do it alone/have the social skills to do it confidently - especially when you walk into a bar by yourself or a school event and everyone you see is already circled around closed off in their own friend groups. Even last weekend, I started messaging some people I would run into at the bar occasionally, people I barely know and filled them in on how my friends never want to go out, and that \"We should hangout sometime.\" Which I know, comes off as desperate - and predictably didn't go anywhere. But quite frankly, being a single guy with valentines day coming up, I feel pretty desperate on the inside. I want a friend group that goes out and does stuff - go to events, concerts, the outdoors, get a gf, etc. And I just don't see it happening huddled around a TV with friends who are just getting high and watching Anime (which I'm not a huge fan of).\n\nGranted, as someone who has had pretty low self esteem the past year or two I've started taking steps to improve my confidence as of a few months ago.\n\n\\- I've started spending a good chunk of change to upgrade my wardrobe - wear clothes that are stylish and actually fit well. As well as fashionable accessories.\n\n\\- I've started paying good attention to hair care, good hair styles, and grooming/trimming my beard.\n\n\\- I've started cleaning up my diet, bulking in a caloric surplus, and hitting the gym. Lifting 4x a week, spin cycle class 1x a week, and yoga 1x a week. Improving my posture, etc.\n\n\\- I tried to join a couple clubs at college, one is interesting (Creative Writing), however everyone's persona and personality is just way too different from mine. People there are your more typical politically orientated english/writing majors, whilst Im more of a non-political (as far as domestic politics are concerned) surfer/mountain biker type business major person, granted joining this club was also a good experience where I forced myself to approach strangers and as them questions, something I feared doing. I also joined a lifting club - which is more of my type of crowd however they rarely meet if at all.\n\n\\- I started investing into self help books, both for finding a potential partner and self talk ('Models', by Mark Manson and 'The Subtle Art of Not Giving a Fuck' type books).\n\n\\- I've been making more of an effort to talk to people who sit next to me in class - granted this feels like I always have to initiate a conversation and am usually carrying the conversation - where as I notice other people just naturally conversate without even trying.\n\n\\- I'm also working on improving my social skills, Im starting this off with having better eye contact, such as when Im at a walmart or walking between classes at college, If people stare at me Im typically the first person to look away after a second or two out of shyness/concerns about my appearance - which I am also working on internally (being less insecure). Hopefully over time I can progress to not running out of things to say in a conversation as well as approach strangers Im interested in meeting instead of thinking I will be a burden they will want to get away from if I do so. I feel like this process of developing better social skills would be way easier if I had friends to go out and develop them with, but this would bring us back to the first few paragraphs of this rant. Full circle\n\nI understand a lot of the points I outlined above will be more of a long term process. Hopefully I can get to the point of being more confident and improving my social life if I continue to follow the points above.\n\nTl,Dr; Friends never want to go out, I do but am too shy to do it on my own. I'm currently in the process of working on myself to become happier as a person via self improvement and expand my social circle and confidence.",
        "created_utc": 1676158268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends are holding back my social life, but Im also part of the problem. Any advice?",
        "author": "LMR_Sahara",
        "url": "https://www.reddit.com/r/socialskills/comments/11013y1/friends_are_holding_back_my_social_life_but_im/",
        "text": "[removed]",
        "created_utc": 1676158072,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my friends are holding me back, and I'm part of the problem. Any advice?",
        "author": "LMR_Sahara",
        "url": "https://www.reddit.com/r/socialskills/comments/11010iy/i_feel_like_my_friends_are_holding_me_back_and_im/",
        "text": "[removed]",
        "created_utc": 1676157811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to make friends in university",
        "author": "zack2203",
        "url": "https://www.reddit.com/r/socialskills/comments/1100y4a/trying_to_make_friends_in_university/",
        "text": "I met this guy at the beginning of the semester, he's in two of my classes at university. When we had a quiz in class, I asked if he wanted to do it together, so he suggested we exchange Snapchat. I asked him to let me know when he was planning to do it since he had another class afterward, otherwise I would have suggested we go after that. When I asked him in person about studying for our other class, he seemed to want to, but I messaged him about it, and he said he was working on a project for another class but he would let me know, and he didn't. Idk if I'm overthinking and he actually doesn't want to hang out with me.\nHe still sits bv me in both classes and talks to me",
        "created_utc": 1676157620,
        "upvote_ratio": 1.0
    },
    {
        "title": "why he is showing this attitude?",
        "author": "pejetron",
        "url": "https://www.reddit.com/r/socialskills/comments/1100bg6/why_he_is_showing_this_attitude/",
        "text": "[removed]",
        "created_utc": 1676155850,
        "upvote_ratio": 1.0
    },
    {
        "title": "any tips on going to a club/bar for the first time at 25 by myself?",
        "author": "lonelysadbitch11",
        "url": "https://www.reddit.com/r/socialskills/comments/110086w/any_tips_on_going_to_a_clubbar_for_the_first_time/",
        "text": "I never ever been to a club or bar and I want to go tonight but I'm really scared and anxious. \n\nAny tips or advice for an older person doing this for their first time? \n\nHow to talk to people? What to talk about in these environments? \n\nAnything advice would be nice.",
        "created_utc": 1676155608,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I make things better with my friend?",
        "author": "ThreeDotsTogether",
        "url": "https://www.reddit.com/r/socialskills/comments/110051i/how_do_i_make_things_better_with_my_friend/",
        "text": "So, I'm kinda pissed about my friend because he's never around me anymore. I hardly ever see him at school anymore. I would speak to him about this, but then I realize I don't know what I'd do if he did spend more time with me\n\nI don't know how to make conversation or how to just chill with someone. This arrangement pisses me off so much, but I don't know what I can do about it. How do I get myself out of this?",
        "created_utc": 1676155365,
        "upvote_ratio": 1.0
    },
    {
        "title": "When making payments towards and receiving payments towards friends, they seem to be pretty picky about every penny.",
        "author": "yacwanderer",
        "url": "https://www.reddit.com/r/socialskills/comments/11002nh/when_making_payments_towards_and_receiving/",
        "text": "Like if paid for something that cost 11.97, they’ll only send $11.97 to me.\n- Here, if I was the one owing them money, I’ll just send $12 for the ease of convenience.\n\nOr, if they bought something for me that was $8.10, they’ll expect me to give them the .10 cents with the 8$.\n- Here, I wouldn’t care if they just sent me $8, if they were the ones that owed me.\n\nIf we are getting a lot of items in one sitting, like a big dinner or multiple orders, then it makes sense to add the pennies up. \n\n\nI see the idea of that if something is $11.97, instead of seeing it as $11.97, it is seen as just one whole item.\nMeaning, like when doing a task that was asked of you, did you fulfill the task from what was asked of you?\n\nAt the same time, I’m thinking it’s just some pennies. It’s faster to send you $8 instead of $8.04. I’m not sending you back your car with a small scratch on it. They’re coins. Nobody cares about the look of coins if they’re just using them for transactions, unless maybe your coins are tremendously ugly.\nSo, is it truly a serious deal? Does it feel like I’m intentionally and proactively trying to steal money from them when I don’t send .04 cents or .10 cents?",
        "created_utc": 1676155196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telling someone you dont like and whos not a good perso you don't want to talk to them ?",
        "author": "Lavender216",
        "url": "https://www.reddit.com/r/socialskills/comments/11000m4/telling_someone_you_dont_like_and_whos_not_a_good/",
        "text": "I'm talking abt someone who would post racist stuff on their fb page, who bullied other classmate. He was a dude and was physically abusive to a girl in class.\nNever talked to him but that mfer was constantly trying to talk to me and was hella familiar. It's really grating and just reeks off entitlement. \nHe was like \"you don't talk\".\nI wanted to answer i taln just not to you.\n\nThat's why i'm stuck w 2 options:\n1) ignoring them when talk to me. Upside: not wasting energy in confrontation.\nDownside: might be interpreted as shyness rather than rejection.\n\n2)telling them straight theyre a pos and not worth talking to upside: at least it's direct and wont be mistaken for anything other than rejection\nDownside: having an enemy and risk harrassment.\n\nHas Antoine bien in the same situation and how did it work out for you ?",
        "created_utc": 1676155037,
        "upvote_ratio": 1.0
    },
    {
        "title": "help me comprehend this attitude",
        "author": "pejetron",
        "url": "https://www.reddit.com/r/socialskills/comments/10zzohj/help_me_comprehend_this_attitude/",
        "text": "[removed]",
        "created_utc": 1676154140,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to move forward in my social life if I don't do/particularly enjoy activities that are commonly used to make friends? (introverted)",
        "author": "hoshino-satoru",
        "url": "https://www.reddit.com/r/socialskills/comments/10zzghe/how_to_move_forward_in_my_social_life_if_i_dont/",
        "text": "M21. Done with college. I live far from college friend group and high school friend groups. I still regularly contact them through dms, chat, calls, games, etc. But I am not able to meet up with them in person. I'm wondering how I could expand my social circle in a new area.\n\nI'm introverted and don't like clubs/bars etc. I'm also likely invisible in larger group settings since I don't really ever feel the need to draw too much attention (and likely just don't have much to say). \n\nMost of my hobbies and things that I currently spend my free time can be done mostly alone and that's what I choose to do most of the time. \n\nIt feels like I have to completely take up new hobbies I'm not currently interested in to make new friends. And I feel like in order to sustain these new relationships, I'd have to do things that I don't enjoy. I feel trapped by my own personality",
        "created_utc": 1676153566,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I approach her?",
        "author": "sk1592",
        "url": "https://www.reddit.com/r/socialskills/comments/10zz7vt/how_do_i_approach_her/",
        "text": "I met this girl on NYE, got her insta, spoke to her for a few days, she flaked on a couple of dates, I mean it was cold those days. \n\nWhile talking I find out shes in the same gym as me, although we have different timings or wtv. \n\nStopped chatting with her since I was traveling for 5 days,  dropped her a message she hasn't opened it yet. \n\nSaw her in the gym after that once, I guess she saw me too, not sure, but the question is how do I approach her at the gym or do I even ?",
        "created_utc": 1676152926,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get over the fact that my friends in college are smarter than me?",
        "author": "leahpayton22",
        "url": "https://www.reddit.com/r/socialskills/comments/10zz6da/how_do_i_get_over_the_fact_that_my_friends_in/",
        "text": "Particularly one of my friends. She’s just so naturally smart. Like every single class is a piece of cake for her. She barely studies, is doing 2 internships at the same time, is very engaged in student life in college, yet still has gpa 4.0. \n\nThe worst is that she’s always talking about how smart she is like always bragging with her grades and achievements. And I feel like she looks down on me because I’m not as smart as her. \n\nEvery time I’m with her or see her bragging online, I feel so stupid and so worthless. Like I’m never gonna be just as good as she is. My gpa is around 3.5 and back in high school I had almost all A’s, I think I had like two B’s during the whole high school. But my high school wasn’t that difficult, college is way harder. And even when I study all the damn time, I still get a B sometimes. I also get rejected for internships a lot. I feel like a failure compared to her. \n\nHow do I stop feeling this way? :/",
        "created_utc": 1676152817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help dealing with condescending and immature coworker",
        "author": "Fantastic-Store2495",
        "url": "https://www.reddit.com/r/socialskills/comments/10zyttu/help_dealing_with_condescending_and_immature/",
        "text": "I just got a job that I was in desperate need for. One of my coworkers is the one that let my wife’s friend know there was an opening. However, he didn’t put a good word for me or anything. Now he is supposed to teach me how to close the register at the end of my shift. He’s the only one who knows how to do it, besides from the manager, since the other employee who’s been here for a year never bothered to learn. I do want to learn how to do it since I did it at my previous job, which was even harder, only in this new place there is a different method. Anyways, this guy only comes for a couple minutes a night to close the register and he’s got the manager (who’s a very kind and reasonable man) by the balls, since he has to rely on him for closing. However, he’s not doing very much in the way of teaching me, only brushing off a little bit and has a really condescending and passive aggressive attitude towards me, often humiliating or mocking me when I make a mistake he clearly knows I’ll make because he hasn’t taught me yet. This seems to have intensified since I made a mistake at the register on my second day of work that caused a short but was entirely my fault and I immediately called the manager to let him know/take the amount off my paycheck, of which he was entirely understanding and forgiving. Now, I’m used to work with mature, respecting people and always do my best to earn that respect but for this guy doesn’t seem to be the case. I want to know how to best deal with this situation and his character. Thank you.",
        "created_utc": 1676151909,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m friends with this guy who either doesn’t respond or responds three days later",
        "author": "OtakuDub",
        "url": "https://www.reddit.com/r/socialskills/comments/10zyt40/im_friends_with_this_guy_who_either_doesnt/",
        "text": "I was hanging with a friend when she brings up the guy saying we seem like such good friends I say I’m kind of upset with him right now. She asks why. I say that he doesn’t respond when message him on discord even though he is active (we are on the same school organization’s server).\n\n I’ll text him asking how he is doing or if he wants to hang out and he won’t respond to me then ask me a week later if I want to hang out I usually say yes. When he does respond he responds 2-4 days later even though he is active on discord talking to people on the server. I tell my friend that I’m thinking of not being friends anymore because it’s obvious he is doesn’t even respect me enough to say yes or no to hang out. My friend says I’m overacting that he seemed nice the times I brought him to hang out. My friend said he is probably busy but I respond no one is so busy that they can’t say “no I’m can’t this week.” \n\nI know he sees the messages but doesn’t respond because when I planned a group hang out. Everyone told me they were going to be there before hand (I asked 3 days in advance like usually) while he just texted me an hour into the hangout and said where you at. I told him and he came but he didn’t respond in the three days before the event to let me know he was coming. This has happened multiple times where he just ignore the invite told me nothing even with one on one hangout. \nI’ll say “I’m going to watch this movie after class tomorrow you want to watch it with me?”\nHe will say nothing so I’m like I guess not then he will just show up. \n\n\nYou guys think I’m overreacting being upset?\n\nThree days ago, I asked this guy and our mutual friend if they want to hang out tomorrow. Our mutual friend said ya I’m free that day (the same day I asked) while the guy still hasn’t responded. I feel awkward about arranging to meet up with our mutual friend alone in group chat but it seems like the guy isn’t going to be there.",
        "created_utc": 1676151855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to make a new friend in my classes",
        "author": "zack2203",
        "url": "https://www.reddit.com/r/socialskills/comments/10zyp0l/trying_to_make_a_new_friend_in_my_classes/",
        "text": "I met this guy at the beginning of the semester, he’s in two of my classes at university. When we had a quiz in class, I asked if he wanted to do it together, so he suggested we exchange Snapchat. I asked him to let me know when he was planning to do it since he had another class afterward, otherwise I would have suggested we go after that. When I asked him in person about studying for our other class, he seemed to want to, but I messaged him about it, and he said he was working on a project for another class but he would let me know, and he didn’t. Idk if I’m overthinking and he actually doesn’t want to hang out with me. He still sits by me in both classes and talks to me",
        "created_utc": 1676151559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sent an embarrassing text to a guy I just met.. feel really bad",
        "author": "Starry_nights248",
        "url": "https://www.reddit.com/r/socialskills/comments/10zxpo8/sent_an_embarrassing_text_to_a_guy_i_just_met/",
        "text": "Hi everybody, hope it’s ok to ask for advice about something like this on this subreddit! Basically I just met a guy a few days ago and gave him my number. After he texted me saying hello, I got really nervous and didn’t feel like responding immediately. I responded after a while, saying “hi so sorry for the late response! Feel free to lag on me” I was overthinking the entire day about what to say, and I ended up texting that a bit impulsively. I had meant it in a lighthearted way, like “hey I took a while to respond so feel free to do the same!” But now I’m really wondering if it was just a dumb thing to say, or maybe it sounds like I’m being too casual. What do you guys think? Please be gentle because I’m overthinking like crazy lol",
        "created_utc": 1676148964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for people to be friends with extremists and be ok with it?",
        "author": "gudetamagotchl",
        "url": "https://www.reddit.com/r/socialskills/comments/10zxlo5/is_it_normal_for_people_to_be_friends_with/",
        "text": "to get to the point, two friends (who i want to drop for a myriad of reasons) are buddy buddy with a guy who wants me dead for being queer. he also hates poc and anyone who isn’t exactly like him. \n\ni know once the school year ends i’m going to block both of them on everything and forget about it, but in the meantime they don’t take my feelings about this seriously. i can’t drop them yet because we’re physically close to each other and they *really* like me.\n\ni’ve said aloud and clearly multiple times that i’m uncomfortable with them being friends with him and laid out my reasons. i always get brushed off as if someone wanting me to die for the way i am is totally normal.\n\nam i nuts? is everyone like this? please tell me people aren’t usually like this.",
        "created_utc": 1676148666,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop your conversations from devolving into sadness?",
        "author": "PotAssmium",
        "url": "https://www.reddit.com/r/socialskills/comments/10zx8h8/how_to_stop_your_conversations_from_devolving/",
        "text": "I(16) live a stupid and sad life and I'm an attention whore. That's it. 80% of the time i try to have conversations, whether irl or online, i fuck it up and start talking about my problems. \n\nI don't have any friends and i try to vent to random people i have conversations with or to my online friends. \n\nHow do I stop this? I'm genuinely not happy and want someone to help me but i know they can't so i vent because I'm feeling sad and i want to cry but i can't even cry because I'm emotionally numb. \n\nI just want to stop bothering people with my problems.",
        "created_utc": 1676147685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please explain friendships over text messages to me (F22)",
        "author": "humanredditw",
        "url": "https://www.reddit.com/r/socialskills/comments/10zx7lv/please_explain_friendships_over_text_messages_to/",
        "text": "[removed]",
        "created_utc": 1676147622,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Road to Being Confident with Strangers: Everyone wants kindness.",
        "author": "curiositykilledmatt",
        "url": "https://www.reddit.com/r/socialskills/comments/10zwww1/the_road_to_being_confident_with_strangers/",
        "text": "I made some prompts which I’m using to help me become more confident speaking to strangers. Today’s prompt was  **‘Ask someone for the time’**.\n\n**Before:**\n\nAnother seemingly easy prompt that can be done easily. I have to remind myself that even though they are simple, it’s important I go through with them just to get used to approaching people and getting out of my own head.\n\n**Experience:**\n\nAs usual, in my own head walking around, saw a woman in a mask, approached and said ‘sorry to bother you, my phone just died, do you have the time?’. She seemed a bit caught off guard, found her phone and told me the time. I thanked her and moved on. \n\n**Thoughts:**\n\nNote to self: people in masks probably not the best choice but otherwise, once I'd done it I was happy. It's important that I keep going with this process to ensure that I keep getting better at initiating conversations.\n\nSomething I’ve noticed is that my interactions with people I know has improved massively. The act of speaking to strangers has had a profound impact on my interactions with my family + friends, as I’m just more aware of them, giving them more of my energy and more open to share obscure bits of my day which leads to more laughter.\n\n**If you have any thoughts/ideas for prompts which I could use to slowgress towards confidence with strangers then lmk.**",
        "created_utc": 1676146851,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is their future of toxic competitors in their careers?",
        "author": "Magnanimity420",
        "url": "https://www.reddit.com/r/socialskills/comments/10zwjq0/what_is_their_future_of_toxic_competitors_in/",
        "text": "I see people who use toxic means to get ahead of me. They would do things to intentionally distract me. I have cut off from them but one question still arise in my brain. Will they even get ahead in their careers? Till when will this last? Even though others have more potential will these people still get ahead of them?",
        "created_utc": 1676145899,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you joke/make people laugh without making fun of yourself or others in any way?",
        "author": "angrymustacheman",
        "url": "https://www.reddit.com/r/socialskills/comments/10zwhu2/how_do_you_jokemake_people_laugh_without_making/",
        "text": "Hello, my usual way of soliciting laughter is self-deprecating humor but my therapist has recently told me I should probably avoid it for the time being as it's doing a number on my already very poor mental health. \n\nI also heavily dislike talking badly about people outside of me in general no matter the setting, but since I've always been able to find bones to pick with myself that hasn't been a problem... at least until now.\n\nSo, what now?",
        "created_utc": 1676145762,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMO the worst feeling is being lonely despite trying hard to make friends.",
        "author": "lockjacket",
        "url": "https://www.reddit.com/r/socialskills/comments/10zw02o/imo_the_worst_feeling_is_being_lonely_despite/",
        "text": "People with social anxiety that gets in the way of making friends can at least be able to know why they don’t have any. But what are you supposed to do when you try, again, and again for years  only for people to brush you off? \n\nHow am I supposed to feel confident about myself when something about turns people away? I just don’t get it, I am always kind to people, I always respect people and their boundaries, and I always try to start conversations. So why is it that people either dislike me or don’t want to be anything more than acquaintances? I made friends in Elementary, even a tiny amount in middle school, heck I’ve had so many online friends over the years and those were always easy to make. So why is it that I’ve gone through four of highschool wandering the hallways alone? Never talking with friends in class? Always being the one kid who no one comes up and talks to? I just don’t understand, what is so wrong about me? How can someone try so hard to be social but rejected by nearly everyone around me?",
        "created_utc": 1676144468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety on a \"me day\" that i should be spending time with friends.",
        "author": "titanbuble14",
        "url": "https://www.reddit.com/r/socialskills/comments/10zvrlv/anxiety_on_a_me_day_that_i_should_be_spending/",
        "text": "I have this all the time but whenever a have a \"me day\" where i charge myself by just gaming or chilling all by myself, i feel like a huge anxiety hanging over me that i could have been gaming with friends or at least send them a message\n\n\nBecause of this I do not enjoy and recharge from my \"me days\" as much as i would like.\n\nI think its because iam pretty bad at keeping in contact with my friends, just like to hangout sometimes but not all the time and feel like that puts people off or they think iam not as interested in them as their more social friends are.\n\nDoes anyone else feel this way sometimes and how do you deal with it.?",
        "created_utc": 1676143872,
        "upvote_ratio": 1.0
    },
    {
        "title": "so how is interacting supposed to work?",
        "author": "2yungtobedrunk",
        "url": "https://www.reddit.com/r/socialskills/comments/10zvefi/so_how_is_interacting_supposed_to_work/",
        "text": "Recently I was on a field trip with class. I found that I hated myself for being quiet, and when I got over the fear of taking and actually did it, I hated myself for talking. When people told jokes, I couldn't laugh. I don't feel human anymore. I just want to be alone to avoid making a fool out of myself, but I long for connection.",
        "created_utc": 1676142940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t people split up food/other things equally?",
        "author": "the_ruby_unknown",
        "url": "https://www.reddit.com/r/socialskills/comments/10zvc3g/why_cant_people_split_up_foodother_things_equally/",
        "text": "Is there like an unspoken rule “if you don’t eat your portion in X minutes, then others can eat it”? I am a slow eater and I get pissed when someone silently eats my share of food. For example, 8 slices, 4 people, so each gets 2 slices, isn’t that so simple? Happens from time to time, I start doubting my sanity at those moments :/",
        "created_utc": 1676142773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why cant people be nice to each other?",
        "author": "DirtyDan2705",
        "url": "https://www.reddit.com/r/socialskills/comments/10zv7m2/why_cant_people_be_nice_to_each_other/",
        "text": "I get the feeling that people forgot how to behave like adults. Nowadays when you have a opinion it feels that no matter what you say you are screwed. They spin around your words in order to make you look bad even though you just said something ordinary. You want to know my opnion? As long as you dont hurt anyone i dont give a single damn what you are. Gay, Trans, Non binary, female or whatever. Just be a decent person and you are Ok in my book. These days everything is about being on one side. Cant i just be on no side? I just want to be left alone with all this drama. These movements were a good thing and showed some serious issues in society. These were kind and respectful people who wanted to show kindness and love to others and wanted to raise awareness and have serious disscussions about certain issues. Then some biggots came and started calling everyone a phob when they didnt agree with something. You know what happend next? People stopped listening to the core of the message. The minority ruined the core aspect of all of it. And now you are either annyoed of all of it or scream your lungs out. Is it really so hard to just be an adult about this and talk instead of shouting and accusing people? Arent we better then this?\n\nSorry for the rant but i really needed to get this of my chest.",
        "created_utc": 1676142451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I doing too much?",
        "author": "Aggressive_Maki",
        "url": "https://www.reddit.com/r/socialskills/comments/10zujvm/am_i_doing_too_much/",
        "text": "Context: First time meeting in person\nSo first of all it was not planned, I wasn’t talking to this guy for almost a week bc that’s just how I decide to do this situationship, I never reach out first. \n\nThen he dmed me asking if I would be in campus today, I said I was, and he was too bc he will be dropping off his brother. He immediately asked me to go get coffee (I have been unfortunately turning down his previous attempts bc i was honestly too busy), I said I can’t, I will be in campus bc I have to work with my group mates for something. Then he came to ask if he can just see me instead during my study break, so I told him its up to him cuz it will be VERY SHORT. \n\nHe asked where I would be and I did the same.Then he said he will be the one going to where I was. But unfortunately when I was already in the cafe where I will be working with my group, he said that he was still inside campus and asked ifmy loc was too far from him. I told him for someone whose not from this campus, it can seem far. So i told him Id go to him instead cuz I know he would only end up lost if we did the initial plan. He asked me again and again if I was sure since he didnt want me to do the works since he was the one who initiated to meet. \n\nOne of the friend found out what I did and told me I should not have, that I should’ve just leave him to do all the work. In my defense, I felt bad that I keep turning down his offer when he wants to meet or call bc im swamped with studies, that was the only time that I felt I can somehow reciprocate his effort, I was familiar with the place, and I didnt want to waste time if I were to wait for him to find me or my location. \n\nso the question is, should I have just acted all princess “you need to do everything for me if u want to see me”type, or did what I do was okay? was it too much IDK.",
        "created_utc": 1676140738,
        "upvote_ratio": 1.0
    },
    {
        "title": "The girl I'm texting asked me how many girls I text. She thought I am texting multiple girls. The truth is, I only text her. Should I tell her that I only text her, or should I tell her that I text multiple girls? I've read that girls like guys who girls want.",
        "author": "ImHerzen11",
        "url": "https://www.reddit.com/r/socialskills/comments/10zubgr/the_girl_im_texting_asked_me_how_many_girls_i/",
        "text": "This girl is wondering how many girls I text. I've been texting her for about 2 weeks now. When I asked her how many guys text her, she said here and their other guys spark a convo with her too, but the conversation with them doesn't last long, meaning shortly after these guys text her the conversation ends forever.",
        "created_utc": 1676140157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Signed up today to be a basketball coach in a league (6-8yo), my friends are all calling me a creep for doing it. Is it creepy for a guy in his 20s to work with kids?",
        "author": "StrugglingMale1",
        "url": "https://www.reddit.com/r/socialskills/comments/10ztxv8/signed_up_today_to_be_a_basketball_coach_in_a/",
        "text": "\nI’m thinking about withdrawing my name from coaching. My local gym is starting a basketball league for kids 6-8 and needs coaches. I love coaching and working w kids. \n\nWhen I got excited and told me friends they said I need to withdraw. They said a 25 yo single guy who’s never had kids and wants to coach them is nothing but red flags.\n\nI was planning on having some to parents as assistant coaches and wanted this kids to enjoy the game. I wish being single and a guy didn’t necessarily mean creepy. First thing I’ve enjoyed doing in a while.",
        "created_utc": 1676139193,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a nerdy voice and I hate it",
        "author": "TheRealAccount886",
        "url": "https://www.reddit.com/r/socialskills/comments/10ztqzn/i_have_a_nerdy_voice_and_i_hate_it/",
        "text": "I have this really shit nerdy voice which sounds awful. I know people dont like the sound of their voice, but in my case I've had some people actually make fun of the way I speak sometimes \n\nIt's like this nasal voice that comes out and makes me sound like I'm stupid. I literally cant be taken seriously at all and get aired alot of times because of it.\n\nEven if I speak from my chest or diaphragm it still comes out really shitty. Please, anyone teach me how to get a normal voice. It doesnt even have to be deep or seductive or anything, I just want a normal voice man",
        "created_utc": 1676138702,
        "upvote_ratio": 1.0
    },
    {
        "title": "im scared to fundraise",
        "author": "Rich-Lavishness-33",
        "url": "https://www.reddit.com/r/socialskills/comments/10ztdko/im_scared_to_fundraise/",
        "text": "i have a fear of knocking on peoples doors, talking to them, and then begging for money. i am very self conscious about doing this because i think im gonna look stupid doing this. my social skills also arent the best to be able to talk to strangers and get money. please help as i get very anxious just thinking about it.",
        "created_utc": 1676137748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help my friend lead a conversation. (SERIOUS)",
        "author": "Previous_Garbage8938",
        "url": "https://www.reddit.com/r/socialskills/comments/10zt96v/help_my_friend_lead_a_conversation_serious/",
        "text": "Soo there is this girl that he likes. After a long time they meet and exchange numbers. He is still unsure whether she is married or not and doesn't wanna be too direct. How can he talk in such a manner that the conversation ends up to marriage plans or marriage itself?\nThanks in advance.",
        "created_utc": 1676137419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend I vibe really well with just randomly ignores me, goes back to talking to me like it's normal, then ignores me again. Suddenly takes a week to respond to messages.",
        "author": "Pedestr",
        "url": "https://www.reddit.com/r/socialskills/comments/10zsopk/friend_i_vibe_really_well_with_just_randomly/",
        "text": "I met this really nice girl at school through text, andwe had so many of the same interests, and we even shared the same passion to grow our art career online. I'll admit, I kind of even liked her, until she was lesbian and had a partner. I respected her boundaries and moved on. I mean I was still really glad to be friends with her since I admire her art skills and I only have 1 other friend with the same interests.\n\nOne day I texted the girl asking if she's read the latest chapter of the manga we both love. The text got left on delivered and she only responded after a week. I then kept seeing her more often walking along the halls at school and I'd try to say hi but she'd look down and quickly walk past me. Even if I don't say hi to her she looks down and quickly walks past me.\n\nBefore she used to respond minutes after I texted, after that week of ghosting me online she takes 1-3 days to respond whenever I text her. We mainly text on Facebook and she is really active there at the same time she ignores me. and she still ignores me at school in the few times we encounter each other.\n\nI recently texted her last Monday, almost a week ago. I tried saying hi to her again at school and she finally waved back, but she still hasn't responded to my text to this day.\n\nWhat does this mean? It's like she is ignoring me but isn't at the same time.\n\nI have severe social anxiety so the thought of asking her about it scares the crap out of me. She said we were friends, was that a lie? She said she wanted to meet me in person more at school since we mainly talk online and never really had a conversation in person, was that a lie too?",
        "created_utc": 1676135949,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make friends?",
        "author": "nanananananabatman4",
        "url": "https://www.reddit.com/r/socialskills/comments/10zseyh/how_to_make_friends/",
        "text": "Been trying to make friends at college I'm the UK but doing really badly. Everytime I talk to people they seem uninterested in me. I only have a couple if groups I can sit with In lessons. The people I sit with at lunch are starting to become extremely selfish and show little care for me as their more focused on playing games on their phones. I have no one else to sit with as I have no other friend at my school. How do I fix this?",
        "created_utc": 1676135234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl I vibe really well with just randomly ignores me, goes back to talking to me like it's normal, then ignores me again.",
        "author": "Pedestr",
        "url": "https://www.reddit.com/r/socialskills/comments/10zsc03/girl_i_vibe_really_well_with_just_randomly/",
        "text": "[removed]",
        "created_utc": 1676135027,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I like this.",
        "author": "AccomplishedMouse371",
        "url": "https://www.reddit.com/r/socialskills/comments/10zs6cr/why_am_i_like_this/",
        "text": "Let me give a brief info about me. I'm a 20yo guy from India. I've completed my UG and pursuing my PG rn. I'm an extreme introvert. Now getting to the point. I made 3 friends in my UG of which one is my crush. We were all good friends. But I always knew this friendship wasn't gonna long since we were all from different parts of the country. And as I expected the two of them stopped talking to me except my crush. I'm pretty sure she doesn't have any romantic intrest in me but still she texts me almost everyday and I really liked talking to her. I have a no first text policy so its always her initiating all the convos and I for my part always reply in an instant. And in the past few weeks the frequency of her texts have reduced drastically and she didn't text me at all this week. I really want to talk to her but I can't bring myself to text her. I have no clue why I am like this. Its almost as if even if I love somebody I can afford to lose them.",
        "created_utc": 1676134646,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I stop being jealous of other people living my old life?",
        "author": "cman5020",
        "url": "https://www.reddit.com/r/socialskills/comments/10zromz/how_can_i_stop_being_jealous_of_other_people/",
        "text": "I was lucky enough to go and live abroad for a while and it was easily the greatest time of my life. I had to return home at the end of last year but a lot of my friends were natives there or able to stay longer than I was. I would go back tomorrow if I could but I can’t. But I can’t stop dwelling over it all. Staying in contact with all of them is impossible without seeing them all live the life I want to live and it’s making me very jealous. What are some good tips to help me get over this and start enjoying my old life again?",
        "created_utc": 1676133373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go to University?",
        "author": "workwork2221",
        "url": "https://www.reddit.com/r/socialskills/comments/10zrclh/should_i_go_to_university/",
        "text": "[removed]",
        "created_utc": 1676132530,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you become more interesting ?",
        "author": "Dense_Condition2927",
        "url": "https://www.reddit.com/r/socialskills/comments/10zr1r1/how_do_you_become_more_interesting/",
        "text": "Like the title said : how do you make yourself interesting so people will actively go towards you ?  \nI have hobbies , passions, lifegoals and try my best to look good physically but I don't know why for the hell of me I can't captivate people in conversations like someone popular would, I don't know if my interests are just too dull and boring objectively or if I just have 0 charisma, I avoid getting into the people pleasing trap but do I just have to act the opposite and stop being an active listener and caring about other people lives, any advice ?",
        "created_utc": 1676131799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird situation",
        "author": "DanMarel843843",
        "url": "https://www.reddit.com/r/socialskills/comments/10zqqjz/weird_situation/",
        "text": "[removed]",
        "created_utc": 1676131072,
        "upvote_ratio": 1.0
    },
    {
        "title": "The opticians broke my second pair of glasses, offered me a new pair, and I feel awkward going in and asking for it",
        "author": "castrosbeard123",
        "url": "https://www.reddit.com/r/socialskills/comments/10zqcpg/the_opticians_broke_my_second_pair_of_glasses/",
        "text": "what would you recommend?",
        "created_utc": 1676130250,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do about a friend who everyone complains to me about when they're around them?",
        "author": "Soft-Intern-7608",
        "url": "https://www.reddit.com/r/socialskills/comments/10zq7dl/what_do_i_do_about_a_friend_who_everyone/",
        "text": "First I have to say it's been gnawing at me recently that I also don't particularly enjoy hanging out with this person either, but I've always hung around a lot of toxic people so I didn't think much about it before, but now it's also becoming an issue where being around them is making other people not want to hang out with me by association.\n\nOne friend later was asking me \"who's that snappy guy? He seemed to be really impatient and kind of angry at everyone for no reason\"\n\nAnother friend said he was asking them about where they're from, since they're Asian, and kept asking questions about that country even though they haven't lived there since they were a little kid and are around 30 now.\n\nI went to a couple bars and restaurants with them where they started to be impatient and rude with the staff there and I had to play it off and try de-escalating because I could tell those people were starting to get annoyed and I didn't want people to spit in our food.\n\nActually when I hang out with them I get a constant vibe of them being impatient and ready to snap at any time and it makes me very uncomfortable. Even so uncomfortable as to not be able to tell them about this because they might snap at me for it.\n\nThis is also while sometimes dumping their problems on me as their personal therapist and I really just don't know what to say or do around them anymore.\n\nI've known this person for a long time but I didn't really hang out with them much until they moved back where I live now and then I realized I don't actually like them much. I've tried avoiding them but they don't get the hint and I don't know how to deal with them.\n\nI think they may have the idea that our friendship is more than it actually is because I now cringe when they text me and I dread having to be around them. I don't want to be around them one on one and I don't want to bring other people around them and make those people not like me because of this person",
        "created_utc": 1676130029,
        "upvote_ratio": 1.0
    }
]