[
    {
        "title": "Would it be inappropriate to ask to split air bnb for my partner’s birthday party?",
        "author": "Serious_Rat",
        "url": "https://www.reddit.com/r/socialskills/comments/10v96sc/would_it_be_inappropriate_to_ask_to_split_air_bnb/",
        "text": "Hi all, if it’s inappropriate or weird I won’t do it. I just have never been in this situation so I don’t know what is okay and what isn’t. \n\n Basically, my partner’s birthday is next month and i’m thinking of getting an air bnb for him and his three best friends (and me as well) to surprising him with a small house party/little getaway. My partner and I both live with our parents which is why I can’t host. All of of us are young working professionals, but to be honest, I don’t make much. I wouldn’t be able to afford the $300 on my own, as embarrassing as it is. \nI thought maybe I could ask if his friends like to go in on an airbnb for him to surprise him for his bday, but as the party planner I can’t tell if that would be inappropriate to do. \nHelp!",
        "created_utc": 1675696836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I a target of this type of thing? I think I’m being bullied.",
        "author": "fearlesswalrusondeck",
        "url": "https://www.reddit.com/r/socialskills/comments/10v96li/why_am_i_a_target_of_this_type_of_thing_i_think/",
        "text": "[removed]",
        "created_utc": 1675696823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I being insensitive towards someone who's family has been trhough an earthquake?",
        "author": "ThrowRAthrowaway15",
        "url": "https://www.reddit.com/r/socialskills/comments/10v93lw/was_i_being_insensitive_towards_someone_whos/",
        "text": "I know someone on social media (not personally) and she is from a country where an earthquake took place today.\n\nShe was partially from a place that was severely affected. I took the initiative to ask her how she and her family are doing. She said thank you and said that some of her family's house was destroyed and that some of them got hurt. \n\nImportant to know: I follow her friend and she said that she has a go fund me page for people in Turkey. I had never heard this from her. Only from her friend.\n\nI told her that I am praying for them and that I'll see if I can donate. \n\nShe said that my prayers were more than enough and said \"thank you so much\".\n\nEverything seems fine but I still want to better myself, so my question is, was I being insensitive by offering donation? I don't know if she understood that I know that she has a go fund me page. I also don't know if that was insensitive in any other way.",
        "created_utc": 1675696615,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been solo for a long time",
        "author": "NamelessIllusion",
        "url": "https://www.reddit.com/r/socialskills/comments/10v8wg8/i_have_been_solo_for_a_long_time/",
        "text": "It had been 3 Years since I have been in a relationship, and I hadn’t have a relationship prior to that.\n\nI was a star back at the university days, I was a role model and inspiration for many but I struggled to find love, and when I did, it was magical, but that someone didn’t want to continue with me because she was afraid that she would hurt me, with her issues, and when I tried to help her, she tossed me around and ended everything.\n\nIt was the first time to love, and till now, it’s the last, I had been numb ever since, it feels like if I am not interested in relationships anymore, but I miss being loved, I miss being admired and idolized, for who I am my beliefs.\n\nBut I am so tired and drained to pursue love, as I chose to bury myself at work, and it resulted that I am being successful at my career.\n\nI would really appreciate your advices.",
        "created_utc": 1675696120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any interest???",
        "author": "soggybread30",
        "url": "https://www.reddit.com/r/socialskills/comments/10v8u9i/is_there_any_interest/",
        "text": "Ok so I’m (M22) working on a film production as we speak, and my responsibility for today is to “supervise” a group of dancers that are rehearsing for a musical number. And considering that I’m generally a shy and reserved person, I don’t always feel the need to talk to others or introduced myself, especially since the dancers are basically doing their own thing while I’m off on the side making sure nothing goes wrong in our rehearsal space.\n\nThat being said, one blonde-haired dancer in particular introduced herself to me and asked for my name, which I thought was somewhat strange considering that most of the dancers haven’t interacted with me at all (nothing beyond a simple “hi” or “good morning”).\n\nI’m definitely overthinking this, but does it seem as if she has any interest in me??? Like, what should I do?",
        "created_utc": 1675695965,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get out of my own head while casually flirting over text?",
        "author": "Tensest_Pilot",
        "url": "https://www.reddit.com/r/socialskills/comments/10v7s4s/how_to_get_out_of_my_own_head_while_casually/",
        "text": "[removed]",
        "created_utc": 1675693290,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become more talkative?",
        "author": "Important-Lie-2350",
        "url": "https://www.reddit.com/r/socialskills/comments/10v7bo2/how_do_i_become_more_talkative/",
        "text": "I remember being a super quiet introvert ever since 7 years old. And though it’s not something I want to 180 on and completely change I want to figure out how to contribute more to conversations when I talk to people so for one the conversation don’t feel completely one sided, and two, so I can seem more interesting and not have to have the other person completely carry the conversation. I can ask decent questions and get someone else talking but the problem I always face is having anything to contribute other than a follow up question which makes it end up feeling like a one sided conversation or an interrogation. Any tips or advice on how to contribute more to conversation/ be more talkative is appreciated.",
        "created_utc": 1675692061,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you not feel so shitty about yourself when you make a move on a friend you have a crush on and they don’t want to continue the friendship anymore?",
        "author": "FlatPerspective1",
        "url": "https://www.reddit.com/r/socialskills/comments/10v72nk/how_do_you_not_feel_so_shitty_about_yourself_when/",
        "text": "And I don’t mean like physically pouncing on them.  Just testing the waters verbally or being lightly affectionate.  \n\nEspecially when they first say everything is cool and it won’t change anything, then they slow fade you and when you ask what’s up, they confess they weren’t comfortable.  Felt like I was lied to, had I known they needed space at the beginning, I would have been fine with that.",
        "created_utc": 1675691417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Racism/Sexism exist?",
        "author": "YamiMarik28",
        "url": "https://www.reddit.com/r/socialskills/comments/10v6myc/why_does_racismsexism_exist/",
        "text": "One thing since I was younger which I’ve always questioned and never fully understood is why we discriminate someone for the way they were born? We do not choose how we are born, it isnt a video game where we customize our appearance so why do some humans dislike others solely for that? Its as dumb as disliking someone because they have blue eyes and you have brown. Anyone have answers/opinions?",
        "created_utc": 1675690181,
        "upvote_ratio": 1.0
    },
    {
        "title": "An attempt to understand the situation",
        "author": "AyanTypes",
        "url": "https://www.reddit.com/r/socialskills/comments/10v62j4/an_attempt_to_understand_the_situation/",
        "text": "I wasn't sure whom to ask but luckily I found this sub so I hope maybe you guys can help me up with this.\n\nSo there's a friend of mine whom I have known for a year now. At least, we met in person a year ago. Before that there was pandemic but after institutions reopened, we met. We spoke and we even vibed.\n\nWe were even talking until Dec. After vacation was over and we came back in Jan, I noticed that this other person hasn't spoken to me all so well. They reply enthusiastically over socials, they have liked my stories and replied to them as well. \n\nBut in person, they're different. They aren't maintaining eye contact, they brush past like a stranger. Pretty much avoiding me. I thought they weren't comfortable but then the replies are fast and enthusiastic. \n\nI'd like to know what this is. I was a little confused so I thought that maybe you people might have an answer.",
        "created_utc": 1675688522,
        "upvote_ratio": 0.99
    },
    {
        "title": "Looking for exercises to train social skills",
        "author": "boomtao",
        "url": "https://www.reddit.com/r/socialskills/comments/10v5cqh/looking_for_exercises_to_train_social_skills/",
        "text": "Hello everybody,\n\nSince I have been isolating myself for far too long due to my struggling businesses (I am always working), my social live has become dead. \n\nI'd like to have some concrete exercises to develop and train my social skills. Is there a source of information about this?\n\nThanks a lot for any useful suggestions!",
        "created_utc": 1675686344,
        "upvote_ratio": 1.0
    },
    {
        "title": "People tell me I look freaked out, or ask if I'm on drugs a lot.",
        "author": "PhoShizzity",
        "url": "https://www.reddit.com/r/socialskills/comments/10v58qi/people_tell_me_i_look_freaked_out_or_ask_if_im_on/",
        "text": "Is this normal? Obviously I don't know what I look like, I can't see in the third person or anything like that, so I can't attest to how accurate they are. But I hear this a lot, at raves (my only real way of socialising, I have nothing else involving other people) occasionally people ask if I'm alright, or if I've taken anything, or stuff like that. \n\n\n\nI tell them that I'm fine, and if need be that I'm completely sober, but they don't always seem to understand and repeat the question sometimes. I've also had dates tell me I look really freaked out, when I felt perfectly normal, so... Is this a commonplace occurrence?",
        "created_utc": 1675686000,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I'm working on talking to strangers using prompts.",
        "author": "curiositykilledmatt",
        "url": "https://www.reddit.com/r/socialskills/comments/10v53zs/how_im_working_on_talking_to_strangers_using/",
        "text": "I'm using card based prompts to help myself speak to more strangers. I realised that I really struggle with speaking to strangers and start a conversation out of nothing; even if I get good eye contact, I just don't know what to say. I've read the books but found myself not making progress because the goal of going out and speaking with strangers is currently too lofty/ambitious for me to make it a habit I can make consistent progress with. So, being the analytical bastard I am, I've made Prompts for myself to make slowgress towards being able to speak with strangers. \n\nI have 3 piles that I'm working through: easy, medium, hard. Everyday I pick up from the 'easy' pile such as 'focus on eye contact in a conversation today', write about my experience of it and then celebrate and move forward onto the next one until I've finished the easy pile and can move onto the 'medium' pile which is more conversation/commitment until I've finally made it to the apex which is more intimidating prompts.\n\nWhilst the hardest part is initiating, I feel a bit better about it when I have a goal in mind or an idea of what I could say. So far, I've only spoken with old people and people serving me my coffee but the interactions have been much more enjoyable and I come away smiling!",
        "created_utc": 1675685582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use social media like a normal person?",
        "author": "Verne_Dead",
        "url": "https://www.reddit.com/r/socialskills/comments/10v44pt/how_to_use_social_media_like_a_normal_person/",
        "text": "I've seen a lot of advice lately when it comes to getting to know someone that involves or boils down to \"give them your instagram/twitter, it gives them a perspective on who you are and what you're like\"\n\nMy Instagram has no posts, at all, same with twitter. I just never saw a point cause I also don't have followers. And I feel like if I ever gave someone either account they'd look at it and be weirded out by that. But for the life of me I cannot think of how to post like a human being, what's normal? What's normal things to post or say? \n\nIgnoring my cripling self image issues where I feel like I'm the ugliest person to ever live, I also just don't know how to take a selfie or if posting that sort of thing would seem vain. I don't eat anything that would be worth taking a picture of. My hobbies are not exactly the kind of hobbies that are very photo-able or filmable. I'm at such a total and complete loss.",
        "created_utc": 1675682212,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Good morning” and “Good night” messages can literally make us happier because they activate the parts of our brain responsible for happiness",
        "author": "Livebeam",
        "url": "https://www.reddit.com/r/socialskills/comments/10v3j88/good_morning_and_good_night_messages_can/",
        "text": "[https://medium.com/@hadda.selvin/mind-blowing-psychological-facts-you-should-know-about-yourself-6a484ce3be0c](https://medium.com/@hadda.selvin/mind-blowing-psychological-facts-you-should-know-about-yourself-6a484ce3be0c)",
        "created_utc": 1675679984,
        "upvote_ratio": 1.0
    },
    {
        "title": "We should stop using the term “Nice Guys” as though it is an actual psychological concept.",
        "author": "TarotSpa",
        "url": "https://www.reddit.com/r/socialskills/comments/10v39zl/we_should_stop_using_the_term_nice_guys_as_though/",
        "text": "It’s made up bullshit from a book which gave the word “nice” a new definition of something like “treating a relationship as a transaction.”  I checked the dictionaries.. none of them offer that definition of nice.  The dictionaries say “agreeable, pleasant, and satisfactory.”  How is someone who is nice being rejected if they are satisfactory?  Is the term “nice” supposed to be in quotations?  Is that implied?    \n   \n   Some guys are trying to do things to elevate their attraction but none of them are biological or social (status elevating) so they don’t work.  The authors solution began (and ended for me) with “do masculine hobbies.”  As a non-binary person who avoids masculinity because it is psychopathic in its extremes (can you imagine if Hitler were a woman?  Doubt it), I am totally against being more masculine than I naturally feel.\n   \nI am a nice person.  I have had transactional relations before and I did get my money’s worth (strippers, only fans, seeking… you know, where ugly guys absolutely must go for affection).  Many guys… probably the bottom half, must be transactional or alone.  Will they find their soul mate that way?   I’m really sorry to break the news but international marriages are lasting more than 25% longer than your cultural norm marriages in the US, and most of the women are looking for the opportunities of gaining citizen as a top reason.  So yes, transactional relationships also work.   \n   \nHere is what doesn’t work, simping behavior where you gift things from a non “working woman” and doing favors in hopes she is going to see you as a beautiful man that you actually are.  But that’s not being nice, that’s lowballing a woman by offering next to nothing for something that you are not approved of (her affection).   \n   \nP.S.  I challenge you to tell me how any relationship is not transactional?  Just a few years ago (50) and every year before that, the primary exchange was for women to provide domestic work and for men to work in the economy.  Now it’s a different combination in terms of work trade off.  However, if two people aren’t both contributing in terms of relationship effort, then the relationship will fail.  Want to know why?  Because the relationship is a transaction of fulfilling each other’s wants and needs.  Prove me wrong.",
        "created_utc": 1675678956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women should work on soft rejections if they want to reduce the number of creeps THEY have been cultivating.",
        "author": "TarotSpa",
        "url": "https://www.reddit.com/r/socialskills/comments/10v2yee/women_should_work_on_soft_rejections_if_they_want/",
        "text": "[removed]",
        "created_utc": 1675677660,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you level up your networking/room that you’re in?",
        "author": "Mission_Honeydew_597",
        "url": "/r/RedPillWomen/comments/10v24b1/how_do_you_level_up_your_networkingroom_that/",
        "text": "",
        "created_utc": 1675677308,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to do when people know a bit too much about your relationship?",
        "author": "Magnanimity420",
        "url": "https://www.reddit.com/r/socialskills/comments/10v2rbv/what_to_do_when_people_know_a_bit_too_much_about/",
        "text": "[removed]",
        "created_utc": 1675676883,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a super outgoing and positive person, but no one seems to like me :(",
        "author": "VerySadSrry",
        "url": "https://www.reddit.com/r/socialskills/comments/10v2eh7/im_a_super_outgoing_and_positive_person_but_no/",
        "text": "I’m a junior in high school and I always try my best to be a kind outgoing person. I’m told I’m a good listener and a supportive friend but it just never seems like enough. I’m pretty good at meeting new people and leaving a good first impression, but it seems like they eventually drift away after a couple months.\n\nI just have never been able to keep any friends, ever. It’s like the same people who would once laugh at my jokes and sit with me at lunch leave me for their other friends. I’m always the last option and I can’t take it anymore. It’s really starting to affect me. I probably cry everyday over this stuff because I just don’t know what’s wrong with me that drives people away like this. I even ask them if everything is okay and if I did anything to upset them but it never leads to anything. Just them denying that anything is wrong.\n\nI am autistic and oftentimes I find myself blaming my autism for all of these problems, because I just don’t fully realize how I may be acting a bit odd socially. But I’m just so confused because people say they like me and appreciate me and my personality so I don’t understand the issue. \n\nI guess there’s the possibility that they could be keeping quiet to spare my feelings but I feel like keeping quiet is bringing me more anxiety than anything. And I feel like they would know that. \n\nI just don’t know what I’m doing wrong. Does anyone else feel this way? I would really appreciate some help here if possible, thank you so much for reading :)",
        "created_utc": 1675675361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will someone be actually able to accept me ?",
        "author": "unknown-dontknow",
        "url": "https://www.reddit.com/r/socialskills/comments/10v1z86/will_someone_be_actually_able_to_accept_me/",
        "text": "[removed]",
        "created_utc": 1675673695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting yelled at in public",
        "author": "Affectionate_Pin4666",
        "url": "https://www.reddit.com/r/socialskills/comments/10v1xpa/getting_yelled_at_in_public/",
        "text": "Ive have recently lost two female friends who yelled at me in public. I don’t mind if they disagree with me and tell me in private. But i get triggered when someone yells at me in-front of other people. Is it just me ? I end friendships as soon as it happens because i hate it with a passion. Thoughts ?",
        "created_utc": 1675673514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety is potentially C**k Blocking...need a little help",
        "author": "AwkwardBunny052290",
        "url": "https://www.reddit.com/r/socialskills/comments/10v002m/anxiety_is_potentially_ck_blockingneed_a_little/",
        "text": "Hey all,\n\nI am a 32yo male that suffers from anxiety and escaped from a psychologically (and once physically) abusive wife. The abuse I suffered from my (soon to be ex) wife, has made me a little gun shy talking to anyone, especially another woman.\n\nWith a little background information out of the way, here is my current conundrum:\nThere is a girl that works at a nearby gas station. Shes really nice and really easy on the eyes. A friend of mine says that she is basically throwing hints to me left and right. I have kinda picked up on this myself but my anxiety and trauma, I can't bring myself to shoot my shot.\n\nThe main thing I'm scared of is rejection, but not in the traditional sense. I'm worried of making an ass of myself and then having to see her every time I go to the store, which I'm usually going a few times a day.\n\nI'm trying to approach this in the best way possible without making things awkward and I'm never gonna have the balls to go back to this store. \n\nCan someone please give me some kind of advice?",
        "created_utc": 1675665912,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m starting at collage soon. Can anyone give me some suggestions/tips on how to make a good impression?",
        "author": "gay_syi-gui701",
        "url": "https://www.reddit.com/r/socialskills/comments/10uztlf/im_starting_at_collage_soon_can_anyone_give_me/",
        "text": "I’m starting a college degree near the end of this month. I’m exited to do it as it’s an arts degree, but I’m also really nervous about first impressions. I don’t want to put my expectations too high, but I’m hoping to find a group or at least a few people that I could eventually become friends with. \n\nI’m really hoping to avoid missing any opportunities or chances to meet people or make connections, so any suggestions or tips would be greatly appreciated 🙏",
        "created_utc": 1675665249,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i get people to want to talk to me?",
        "author": "SoloRich",
        "url": "https://www.reddit.com/r/socialskills/comments/10uzpk5/how_do_i_get_people_to_want_to_talk_to_me/",
        "text": "I do everything i can to be approachable and yet i see others in the social settings i am a part of having people talk to them but i am always left out.",
        "created_utc": 1675664855,
        "upvote_ratio": 1.0
    },
    {
        "title": "been feeling really depressed &amp; anxious",
        "author": "parosmia2000",
        "url": "https://www.reddit.com/r/socialskills/comments/10uzo88/been_feeling_really_depressed_anxious/",
        "text": "I just needed a place to share my feelings right now. I'm feeling really sad and can't stop crying, so I decided to come here and type up how I feel (kinda like Journaling, which is something I should probably start).. anyways, past few days I've been feeling extremely sad, depressed, and lonely, and like a failure.. I'm almost 23 years old.. all my life ive never had close friends who I could hang out with or share my feelings to.. I'm not sure what the reason is, and till this day I'm trying to figure that out.. I feel like I always get to an acquaintance level, but then begin feeling like I'm someone who doesn't deserve friends and I get scared that I might be boring the people who I'm trying to befriend or that they just act like they like me, but inside they don't.. I also have a hard time being myself in front of others no matter how much I try to relax.. it's uncontrollable honestly... when I'm with other people, I'm just this whole other person. ive been in a kind-of-sort-of friend group b4, but for example if it was a group of 5, then 2 friends were close, the other 2 were close, and I always felt like I was standing in the sidelines and didn't matter..  I've always wanted proper friends.. I don't know how to say this without it sounding weird or seeming like I'm bragging or something, but pretty much everyone describes me as the nicest person ever.. for example, once we had a get-together/party at my workplace, and I met one of my coworker's mom. My coworker literally introduced me to her mom by saying, \"Mom, this is 'name', literally the nicest sweetest person youll ever meet.\" Anyways, do you get me? Like in general, I won't say I try too hard to be nice or anything, but that's kinda my personality from a very young age and all my life. I don't really get into drama with others and am not rude/mean, you know? In fact, I used to be a teacher for like 2 years (I don't have a degree, it's hard to explain how I got to teach) and many times my students have told me that I'm their \"favorite teacher\" and so much more.. Basically, long story short, I don't understand why I'm not able to make friends.. in fact, I don't even know how to at this point.. I know doing things like maybe sending a gift, or asking to hangout could help start a friendship, but what if they get bored of my personality? What if I'm a bother? Anyways, also I'm almost 23 and have never been in a relationship.. I really want to be and feel loved. Even if I don't have friends, I wish I could at peast just find my forever best friend aka future husband who I can share my feelings with and who I can support and love.. I'm almost 23 years old, and dont have a college degree yet.. it's complicated. I have no hobbies.. I haven't achieved anything in life.. I still have maybe around 2 years of college to go which feels so long to me.. almost everyone who is my age/all my classmates have not only graduated with their bachelor's, but also masters... constantly seeing so many people have degrees, good jobs, friends.. it makes me feel so sad.. I try not to compare myself to them, but even then, I still feel lonely in essence to the core. There was so much more I wanted to say, but I actually side tracked and didn't really mention too much about the reason that I'm crying, but that's bascially the reasons why I'm always feeling down... I have no motivation to do anything.. I enjoy mindlessly scrolling through tiktok to distract my brain from all these feelings, or watching shows... anyways, that's it for now.. thanks for reading..",
        "created_utc": 1675664724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 15 and not sure what job would be right",
        "author": "its4_47am",
        "url": "https://www.reddit.com/r/socialskills/comments/10uzj5i/im_15_and_not_sure_what_job_would_be_right/",
        "text": "I have severe anxiety and, a bit of adhd, and misophonia along with other things. I enjoy being able to listen to music as it helps me focus more.\n\nI haven't socialized very much for about 2 years due to personal reasons, 10 hours of socialization(even with breaks)= a weeks worth of socialization for me.\n\nI've never had a job and I know i should get one. I don't like the heat so a kitchen might not be the best, plus I'm... not good at math whatso ever. \n\nI live within Utah if that helps at all(maybe people in this subreddit live in Utah as well and have suggestions, thats why I'm adding this)\n\nI can add more things if anybodies curious as to what I'd be comfortable with but dont expect much cuz, personally I dont know at all",
        "created_utc": 1675664241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I go to make friends as a 19 year old NEET, in my city?",
        "author": "stupid-contagious",
        "url": "https://www.reddit.com/r/socialskills/comments/10uz3ew/where_do_i_go_to_make_friends_as_a_19_year_old/",
        "text": "NEET = not in employment education or training \n\nI have no money for classes and I’m looking for jobs but I don’t think I’ll be able to make friends there if I have to focus on work \n\nI’m sick of being alone and regularly getting dark thoughts, my mood is low all the time and I need someone to chill out with \n\nI’m autistic but I can hide some of my traits it’s just stressful, but I’ll do it if I don’t have to be alone 24/7",
        "created_utc": 1675662786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to tell family how I was mistreated or is that gossip?",
        "author": "OGKush-96",
        "url": "https://www.reddit.com/r/socialskills/comments/10uz180/is_it_okay_to_tell_family_how_i_was_mistreated_or/",
        "text": "I was visiting relatives in Florida and they mistreated me the whole time. \n\nGaslighting, projecting their racism, belittling, stereotyped me as 'sheldon' for being autistic, constantly pushed their conservative agenda, they drove past trumps house even though I said NO and yelled at me to look when I was ignoring it. \n\nGave me a violent front man bear hug when we was hugging goodbye, it hurt me and gave me trouble breathing while I was squeezed. \n\nWould I be right to tell my family about this or would it be gossip? \n\nI don't like talking negative about people and even though it was a traumatizing experience, I still feel it goes against my values to talk about the negative.\n\nBut my stepmom and lil bro is going there next month, and I know they're gonna try to turn my brother against me.\n\nMy cousin visited them before, and after she left, they trashed her as a ''racist trump supporter''.\n\nEven though my cousin is a left wing pansexual woman in a same sex relationship. To this day, my stepmom still believes my cousin loves trump (they took her to trumps house even though she said no and told my stepmom she wanted to go there)\n\nI'm sure they're gonna push the same narrative about me, since they took me to his house while driving, even though I clearly said NO.\n\nI am autistic and have problems with basic social skills so I don't know how I deal with this??\n\nDo I just ignore and keep my values about not gossiping? (while they possibly convince my fam to believe their evil narrative??)\n\nor do I tell them about the harassement I experienced and make it clear that I was taken to trumps house AGAINST MY WILL.\n\nmy fam knows I care about climate change and weed legalization, so it would be weird if they believed I went there willingly\n\nand yes I realized my florida relatives are toxic, I'm never going there ever again.",
        "created_utc": 1675662572,
        "upvote_ratio": 1.0
    },
    {
        "title": "i think i struggle socially and feel I'm stupid.",
        "author": "Magnanimity420",
        "url": "https://www.reddit.com/r/socialskills/comments/10uyvzi/i_think_i_struggle_socially_and_feel_im_stupid/",
        "text": "22m. Whenever i sit in groups of friends or new people who i think i'm vibing with it starts very well. But sooner or later they start roasting me which is okay. But that roast goes around as if i'm an idiot or stupid person. I topped my batch and im good in studies yet it always end up as if I'm the stupid one. I try to give them my all understanding, i see what people's weaknesses are and try not to comment on them so that i don't become the bad person but always its me who ends up getting scrutinized. I'm good in studies and love to teach people around me with the knowledge i have but yet it ends up me being the clown even when i don't do anything as such. What do i do to move ahead from this feeling? I feel very bad this way and feel like i don't know anything. I have tried socializing and changing groups but its not helping.",
        "created_utc": 1675662072,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOS Please lmao. I feel hopeless.",
        "author": "Beavidya",
        "url": "https://www.reddit.com/r/socialskills/comments/10uys8a/sos_please_lmao_i_feel_hopeless/",
        "text": "Hello /r/socialskills! I am here to ask for some help. I have a lot of trouble socially, and it's destroying my life (not a joke). I'm gonna go through the stuff I have problems with, and honestly even if no one has any ideas to directly help me, just writing this stuff out and getting it somewhere will help me I'm sure. If you're not interested in the backstory (I'm mostly writing it for my own catharsis) just skip to after the line break.\n\nI used to be a very charismatic and charming person. I was legitimately likeable and easy to be around. Then, in 2016 I very suddenly developed a severe dissociative disorder. I basically got completely ripped out of reality and lost most of my ability to communicate with the world outside of my brain. (Also, warning to the person that sometimes watches my account and reads my posts - name starting with a D - , please stop reading this post now. Please.)\n\nAfter I got this disorder, my worldview totally shifted from one of general positivity and optimism, to the COMPLETE opposite. I felt the world was hostile and terrifying. And THEN I moved in with someone I had met literally a month before. Since then (\\~May 2016) I have been COMPLETELY socially isolated. I locked myself away completely from the world. I did not speak to anyone except for a passing comment to a cashier or a whispered \"thank you\" to someone that held a door open for me. I only communicated regularly to one person - this person I moved in with. Since then I have tried fruitlessly to make friends and get involved, and I am just not able to. \n\nGonna do a line break here, and get into the actual stuff I'm experiencing.\n\n\\-------------------------------------------------------------\n\nI'm going to describe all the stuff I feel like contributes to my lack of social skills. Some of this comes from my disorder, some from other things. These are gonna be a bit disjointed, and in no particular order:\n\nThe main big one - I have a dissociative disorder lol. I have a disorder that literally blocks me from connecting with other people. It can be cured and I've gotten a lot better over time, but it still prevents any meaningful connection. When all I'm having are surface-level interactions, this works great. When I want to make friends that will be around for awhile, it gets weird fast because nobody knows anything about me because I don't know how to open up.\n\nI am INCREDIBLY pessimistic in my head. I try to speak with optimism, but my core views are currently highly pessimistic. I think people can tell there's a disconnect from what I presently believe, and the ways I am speaking. I know in my heart that one day I can return to being naturally optimistic, but until then I feel a bit phony. \n\nI have no frame of reference for my life. I feel like I have no idea what my life is, or where it's headed. When people ask me about my life, I have no idea what to say or how to describe what I am doing. \n\nIn line with the last one: I have no life to even talk about lmao. I am taking classes to hopefully enter a more lucrative career, and that's where most of my energy is going towards. I'm 25 years old, and I haven't exactly been making leaps and bounds towards my ambitions, so I feel like I don't deserve to be enjoying myself until I catch myself back up to my peers. I know that's bullshit and not fair to me, but it puts a block in between me and enjoying my life. Even when I go and do something fun or enriching, it's like I subconsciously block myself from enjoying it.\n\nMy self confidence is nil. I know how to fake it, but I've been faking it for years at this point, so I'm not even drawing from genuine experience anymore. \n\nIn my head, I have become convinced that I am the most disgusting, creepy, uncomfortable person to be around. After thinking those kinds of thoughts for years and years, they are becoming a self-fulfilling prophecy and I am unintentionally acting like that kind of person.\n\nI get INSANELY frustrated at myself for being unable to connect with others in a flowing and appropriate way. The thing is, I can still feel the part of me that understands social situations, and what to say, and how to act, but my anxiety completely blocks me from accessing it. I can absolutely tell when I'm acting weird or closed-off, but I can't stop it. \n\nWhen I AM able to tap back into that wellspring of optimism and freedom, I am instantly overwhelmed with shame for some reason. I don't know why, but it happens every time. I will have about 10 seconds of being like \"yes! I feel like I can open myself up again!\" and then a wave of guilt and shame washes over me, and washes those feelings away.\n\nI don't know. I'm just tired. Everything used to come so naturally to me. I could relate to people almost instantly. I could tap into and read the vibes of a situation pretty easily. I could give and receive love. I could make my friends genuinely laugh, not just an uncomfortable \"haha dude...\". It would just flow out of me. Now I've essentially turned myself into a weird shut-in with no idea what to do. I know I still have it in me to get out of this and grow into the kind of person I want to be, but I'm so tired of cycling through friend groups and friends because I stick into people's lives like a splinter. There's so much more nuance and reasons why than I've written here, but this is all I can come up with for now. I'm gonna go to bed now and try not to cry. And don't feel bad, if you don't have anything to say, just writing this all out has helped me a little bit.",
        "created_utc": 1675661725,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I socialize at a 5k?",
        "author": "GroundbreakingWord9",
        "url": "https://www.reddit.com/r/socialskills/comments/10uyiin/how_do_i_socialize_at_a_5k/",
        "text": "Hello I(28F) and I want to improve my social life. I have been running for a majority of my life so I figure I can do a 5k for fun and meet people. The 5k I am planning on doing in a month will have an after party. I want to introduce myself and to have an conversation in a non awkward way.",
        "created_utc": 1675660829,
        "upvote_ratio": 1.0
    },
    {
        "title": "[M16] I have no friends but I don't have social anxiety. How can I meet more people and make friends?",
        "author": "MattImmersion",
        "url": "https://www.reddit.com/r/socialskills/comments/10uyhmh/m16_i_have_no_friends_but_i_dont_have_social/",
        "text": "I have no friends but don't have social anxiety, I'm comfortable around people and have no fear of talking. I'm starting to think that I'm a boring person although I do have lots of interests. People ghost me and I don't know why. I have some people I'm not really friends with but want to be friends with, so I ask them out, but they always say they are busy and can't. I'm getting paranoid and I'm starting to believe they aren't really busy, they just try to avoid me because it almost always goes like this.",
        "created_utc": 1675660749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why won't my Brian work fast enough",
        "author": "Quagleman",
        "url": "https://www.reddit.com/r/socialskills/comments/10uxl41/why_wont_my_brian_work_fast_enough/",
        "text": "Does anyone have any tips on how to think of things to say on the spot,  whenever I talk to random people I have a hard time thinking of responses to what they say, I then spend about 10 minutes after thinking of the things I could have said to keep the conversation going.",
        "created_utc": 1675657835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only fans",
        "author": "Yesenia_musclemommy",
        "url": "https://www.reddit.com/r/socialskills/comments/10uxjgv/only_fans/",
        "text": "How do you successfully promote your onlyfans?",
        "created_utc": 1675657695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for ideas for indoor activities to do / great games to play while having another family (parents and kids) over.",
        "author": "Complete-Equipment90",
        "url": "https://www.reddit.com/r/socialskills/comments/10uxi16/looking_for_ideas_for_indoor_activities_to_do/",
        "text": "Just looking for ideas on what people do when they’re hosting their friends‘ (parent age) families over, besides drinking and video games / movies. \n\nWe often do food and board games (or simple ones like cards against humanity), and sometimes karaoke.  At other people’s houses, we’ll often do jackbox-type (18yo+ party video games that scale well for big groups of more random people).  Usually the younger kids break off to play on their own and other times.  We can’t always count on that.\n\nTl;Dr What kinds of activities do you do, for this kind of social situation?  I’d like to get better at it.\n\nThe reason that I’m asking, is because I’m looking for better ideas when we invite new friends or families that we don’t know that well over.  Especially with less emphasis on drinking.  It’s fine, but I feel like it’s a part of everything, and I’m finding that some of our friends are not that into drinking, especially as we get older and more boring.  I can usually get psyched up for small talk.  But, it’s harder when someone’s at my house, and I’m in charge of everyone having fun.  Thanks!",
        "created_utc": 1675657568,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m invisible",
        "author": "Blueberrypie666",
        "url": "https://www.reddit.com/r/socialskills/comments/10ux8bi/im_invisible/",
        "text": "I'm a 17-year-old guy and lately, I feel like everyone just ignores me. My friend of 3 years never invites me to anything, She even sent me selfies from when they went to a movie that I wasn't invited to, and when I told her I would love an invite she just looked at me weirdly and ignored me saying that. What makes it even worse is that she invited my other friend to her birthday who I introduced to her, and no one told me that she was having a birthday party. I don't know what I did to deserve this I thought I was genuinely their friend but lately, I've been feeling very weird.",
        "created_utc": 1675656716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do women care so much about confidence?",
        "author": "RexCarsalot2020",
        "url": "https://www.reddit.com/r/socialskills/comments/10ux6py/why_do_women_care_so_much_about_confidence/",
        "text": "[removed]",
        "created_utc": 1675656582,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to have a bday party but feel weird",
        "author": "FBWDC1380",
        "url": "https://www.reddit.com/r/socialskills/comments/10uwg5q/i_want_to_have_a_bday_party_but_feel_weird/",
        "text": "[removed]",
        "created_utc": 1675654322,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I work on my awkwardness",
        "author": "FragrantTour3695",
        "url": "https://www.reddit.com/r/socialskills/comments/10uwfis/how_can_i_work_on_my_awkwardness/",
        "text": "I feel so awkward all the time. I feel like I don’t react to people the way I should be. At work there was a customer who made a joke towards my manager and she laughed and joked back with them, but later on when I brought them their food they tried to throw a joke at me as well and i genuinely thought it was funny but the way i reacted seemed as if I didn’t think it was funny. (The joke: this water is diet right..”) My response was *slight pause* “OH! yea it is😅” I didn’t even laugh or anything idk i feel like if i laughed it would have sounded fake even tho it wasn’t going to be a fake laugh :/ I don’t know what’s wrong with me. I wish I could communicate with people like a normal person but it feels so difficult. I wish there was a class or something to help me feel better with socializing idk",
        "created_utc": 1675654269,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle roommate shit",
        "author": "Late_Replacement_983",
        "url": "https://www.reddit.com/r/socialskills/comments/10uwddn/how_to_handle_roommate_shit/",
        "text": "I've just moved to a new city, and I'm living on my own for the first time\n\nCurrently staying at a homeless shelter, until I can find a job and a shared apartment to stay at. It'll have to be shared with a few roommates, since I'll only be able to get min-wage jobs, due to my severe lack of job experience and extremely poor school grades\n\nI'll don't know how I'll mange living with a few strangers in an apartment. My social skills are atrocious, and I'm pretty bad at chores. I've always tried my best to clean-uo after myself when I lived with my parents, but could never get things clean 100%. I'd imagjbe that could piss-off my roommates. I'm also not sure whether to keep to myself, or to try and speak to my roommates. I'm leaning more towards the formee, because I never had any friends and people always kinda hated me. Whether because I was annoying, or they didn't want my bullying to rub-off on them\n\nPlease help me with this",
        "created_utc": 1675654102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people exclude me? Why people don't tell me clearly things? Why do people dislike me?",
        "author": "MarcelHolos",
        "url": "https://www.reddit.com/r/socialskills/comments/10uwdag/why_do_people_exclude_me_why_people_dont_tell_me/",
        "text": "So there was a vegan bbq which I was invited to, that was coordinated for yesterday, but last Thursday it was cancelled because the organizers were going to have a water outage in their home in that same day. But today I saw in Instagram stories that they held the bbq without warning, and without telling me. I really feel excluded, specially because they're people who I had known for more than two years, and who I had trusted.\n\nDo people dislike and hate me? Why they exclude me? Why people don't trust me? Am I repellent? Because this has happened recurrently for all of my 18 years of social life (I'm going to be 21 this year) and I don't know what to do.. I think I am going to be alone for my whole life.",
        "created_utc": 1675654093,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle a supervisor's sudden change of behavior ?",
        "author": "MrTOM_Cant901",
        "url": "https://www.reddit.com/r/socialskills/comments/10uw595/how_to_handle_a_supervisors_sudden_change_of/",
        "text": "Is there a term that best describes someone who exhibits an artificial personality of him or herself to conceal their genuine personality. I ask because prior to leaving my job my supervisor initially displayed a disrespectful, patronizing demeanor toward me and after roughly 7 months i had come to the decision to quit. Immediately after submitting my two week notice he/she had a sudden change in personality and began behaving in a kind, respectful demeanor toward me. Am absolutely certain the sudden change of behavior was an attempt to conceal the hostile behavior I consistently dealt with at work. If anyone has advice on how to handle such a situation if this were to occur again in the future I will be very appreciative thank you.",
        "created_utc": 1675653438,
        "upvote_ratio": 0.99
    },
    {
        "title": "How do you find and maintain friendships in your 20s",
        "author": "HocusPocus419",
        "url": "https://www.reddit.com/r/socialskills/comments/10uvwww/how_do_you_find_and_maintain_friendships_in_your/",
        "text": "F25. I'm interested in forming and maintaining new friendships with other women so that I can have a healthy tribe. My closest female friend is very occupied with her child and relationship, and it has become very difficult to carve out time for just us. \nAny advice? Ideas? How do you even do friendships at this age?",
        "created_utc": 1675652767,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for insight into traits my brother has",
        "author": "lassachronicity",
        "url": "https://www.reddit.com/r/socialskills/comments/10uvu5w/looking_for_insight_into_traits_my_brother_has/",
        "text": "my brother is in his mid-20s, but he's conversed like this for the last decade at least in my memory:\n\n- he doesn't take cues when someone isn't interested in what he's talking about\n- pretty short with his responses / disengages quickly when it isn't a topic he chose\n- often looks like he's thinking of something else instead of actively listening\n- *most puzzling to me* will interrupt another conversation that's going on AND has gotten mad when people don't abruptly stop to engage in his convo, as though he's the one getting interrupted\n\nlooking for some understanding and any tips for effectively communicating with him.\n\nty in advance!",
        "created_utc": 1675652542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is asking about a friend's friends too nosy? Or even how they met them?",
        "author": "SensitiveShallot967",
        "url": "https://www.reddit.com/r/socialskills/comments/10uvos2/is_asking_about_a_friends_friends_too_nosy_or/",
        "text": "Like I don't wanna come off as clingy or jealous. Just wanting to make genuine conversation going off what my friend has posted (her vacation pictures).",
        "created_utc": 1675652124,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I help a homeschool kid learn social cues?",
        "author": "spirit_moth",
        "url": "https://www.reddit.com/r/socialskills/comments/10uvnmd/how_do_i_help_a_homeschool_kid_learn_social_cues/",
        "text": "[removed]",
        "created_utc": 1675652035,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I join a conversation?",
        "author": "Zuber4tt",
        "url": "https://www.reddit.com/r/socialskills/comments/10uvfcw/how_do_i_join_a_conversation/",
        "text": "Sometimes when I'm walking home with my 2 other friends, they talk about a mutual friend between them, and I don't know how to join.",
        "created_utc": 1675651368,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you balance spending time with different groups of people?",
        "author": "UsualMorning98",
        "url": "https://www.reddit.com/r/socialskills/comments/10uv422/how_do_you_balance_spending_time_with_different/",
        "text": "So I (24F) have an online friend group (19-32 years old between them) I spend most days with and really enjoy hanging out with. But then I have an irl friend (22M) who wants to meet up more and has insisted we do it alone like old times, rather than with my online friends or younger brother (16M), who I’m also close with and need to make more time for\n\nNow I also recently got into an online relationship. This guy (25M) is great and I obviously want to make sure I’m spending time with him without accidentally burning friendship bridges too. \n\nBut it’s hard. For years I’ve always only ever had one true friend or friend group, then I’d fade away from them for one reason for another (but usually it’s due to me sucking at communication) before I end up in another. I’m getting better at the communication stuff now, which is why I’m happy with being in a relationship now. But that’s led to me being in multiple groups because I’m not fading from them like I used to. Balancing multiple friend groups is hard and I don’t know what I’m doing.\n\nI thought having them all together a little bit would help. I’m in a Discord server with all of them in one place, but my boyfriend and one of my online friends don’t mesh well so they don’t stay in the same place at once often, my irl friend only wants to hang out with me (which is understandable but irl socialising drains my social battery so quickly) and then there’s other minor factors like time zones and availability. Everyone is friendly with each other but hanging out with each person/group separately makes the most sense.\n\nHow do I do it?",
        "created_utc": 1675650469,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if my problem wasn't that I don't understand people,",
        "author": "dihydrogen_m0noxide",
        "url": "https://www.reddit.com/r/socialskills/comments/10uv2rk/what_if_my_problem_wasnt_that_i_dont_understand/",
        "text": "but that I don't like them?",
        "created_utc": 1675650364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a red flag or am I overreacting?",
        "author": "No_Ranger_120",
        "url": "https://www.reddit.com/r/socialskills/comments/10uuw7d/is_this_a_red_flag_or_am_i_overreacting/",
        "text": "I have a friend who I’ve been very close to for a while; let’s call them M. M is a really great friend overall -- nice, funny, caring, and fun to be around. However, one thing about M that has always bothered me a little is that they have a tendency to talk a lot about their other friends when it’s just the two of us, and a lot of the time it feels like M brings up these other friends even when there isn’t a good reason to. It almost feels like they’re trying to rub in the fact that they have other friends to me. For example, sometimes when we’re hanging out one-on-one, M will randomly start talking about how they hung out with so-and-so earlier that week, or the funny thing that happened between them and another person. M also tends to check their phone and verbally announce that they got a text from someone else in front of me (ex. “oh so-and-so just texted me!”), even if it has nothing to do with me. I also noticed that M seems to try to gatekeep -- for lack of a better word -- friendships from me. For example, if I'm talking to someone else (especially if this person is one of M's friends), M will frequently butt into our conversation and interrupt us just so they can make sure they're not left out. I get that nobody likes to feel left out of a social circle, but sometimes it feels like M is going too far. It's interesting, though, because whatever M is doing seems to be working; they have a lot of friends.\n\nI feel bad talking about M like this because they truly are a great friend in pretty much every other aspect, but their habit of doing this always leaves me with a bad taste in my mouth. I'm wondering how big of a problem I should consider this (or if I should consider it a problem at all). Am I just overreacting and being toxic?",
        "created_utc": 1675649831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you (men) deal with other men? I don’t know how the deepest discussions are made with men, (just have sisters )",
        "author": "Rough_Impact1649",
        "url": "https://www.reddit.com/r/socialskills/comments/10uu1ku/how_do_you_men_deal_with_other_men_i_dont_know/",
        "text": "Can you tell us any way to cultivate myself in any domain ( hidden YouTube videos, blogs,…) or even some ideas that changed your life and way of thinking. Because I really feel empty inside and cannot keep any conversation going .\nThis also other problem is how to deal with men. Because actually i have just sisters and i m in my 20s so don’t really know how the discussions are made with men (the deep things) really all the same senarios of superficial relationships are repeating themselves every time. I m talking about the manly (virile, masculine ) manner. Really do not have a point of view, always smiling, saying yes,.. i feel really bad about myself because i m not enjoying this life as a man.",
        "created_utc": 1675647499,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just don’t know.",
        "author": "Turbulent-Bridge-362",
        "url": "https://www.reddit.com/r/socialskills/comments/10uu06y/i_just_dont_know/",
        "text": "[removed]",
        "created_utc": 1675647393,
        "upvote_ratio": 1.0
    },
    {
        "title": "My lack of humour is killing my social skills",
        "author": "nyuzq",
        "url": "https://www.reddit.com/r/socialskills/comments/10utzw3/my_lack_of_humour_is_killing_my_social_skills/",
        "text": "I started learning the basics of social skills 6 mounth ago. I think I am quite good at it because i am naturaly curious.\n\nI know most people of my school and i could speak with most of them without problem.\n\nBut i am rarely invited to party/bar, no one wished my birthday. I feel like i'm just one more nice guy that people apreciate but that's all. \n\nI think my problem is my lack of humour. I envy people who are able to have funny conversation, to make people laught, to play games with people. \n\nMost of the time discutions are me asking questions to people them replying and then me trying to dig more.\n\nI tried to improve this by going to improvisation theater courses. It helped me with social skills a bit but not as I expected. \n\nAm I wrong ? Is the problem somewhere else ? Any tip?",
        "created_utc": 1675647369,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to flirt and keep the concept going in a group setting with a girl?",
        "author": "Ok-Artist1056",
        "url": "https://www.reddit.com/r/socialskills/comments/10utmgs/how_to_flirt_and_keep_the_concept_going_in_a/",
        "text": "[removed]",
        "created_utc": 1675646370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was a guy being creepy towards me?",
        "author": "Ok-Interaction-3692",
        "url": "https://www.reddit.com/r/socialskills/comments/10utla6/was_a_guy_being_creepy_towards_me/",
        "text": "A few days ago, I was walking around my campus, and a guy came up and called me beautiful. This was surprising as I'd never met him, and strangers typically don't come up to me and say stuff like that.  Still, I didn't think much of it and forgot about him until about an hour ago. \n\nI was walking again and ran into him. He was holding a pink rose and asked if I wanted it. I thought it was just a Valentine's Day thing, and maybe he only had one flower left, so I said sure. Then he asked for a hug, and I got creeped out. Since I didn't want to get him mad, I hugged him, though. Then he asked for my number, and I said I didn't have my phone with me, but I realized I was holding the phone in my hand. He wasn't offended and asked for my name instead, which I gave. He told me he's seen me around and again said that I'm beautiful before walking away. \n\nI have no experience with this kind of thing, and I don't know anything about this guy, so I'm pretty scared. Am I overreacting?",
        "created_utc": 1675646281,
        "upvote_ratio": 1.0
    },
    {
        "title": "My best friends family hates me and it’s very noticeable",
        "author": "SpartanFlame11",
        "url": "https://www.reddit.com/r/socialskills/comments/10ut9hw/my_best_friends_family_hates_me_and_its_very/",
        "text": "[removed]",
        "created_utc": 1675645412,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm charismatic and funny online but not in real life",
        "author": "Overall_Set_2658",
        "url": "https://www.reddit.com/r/socialskills/comments/10ut6ix/im_charismatic_and_funny_online_but_not_in_real/",
        "text": "I've been told multiple times online that I'm very easy to get along with and fun to talk to, and many people assume that I go to parties and have tons of friends irl. Like, when I told one guy I don't really do stuff like that and I actually come off pretty introverted irl he seemed quite shocked. Not to toot my own horn but I am often the center of attention and making everyone laugh over and over online. But out in the real world I'm just quiet and kind of awkward. I can't really benefit from editing my sentences irl so I can stumble over my words, blank out and not know what to say. I can get pretty nervous occasionally which makes it even worse. Sometimes I overly fixate on bad interactions, beat myself up for acting like an idiot. It's really just a form of self sabotage but it's hard to get myself out of that mindset sometimes. I have made myself take a few customer service jobs to get better at my issue with nerves and anxiety. Since that I've been told by people around me that I seem a lot more confident but I still get these moments where I have clammy hands and nervous sweating and it's really frustrating. Does anyone relate to what I've experienced?",
        "created_utc": 1675645212,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Thanks I made this personality just for you\" Uhh... what?",
        "author": "yourdadsnewwife420",
        "url": "https://www.reddit.com/r/socialskills/comments/10ut3y7/thanks_i_made_this_personality_just_for_you_uhh/",
        "text": "\"Wow you're so easy to talk to! Our personalities match so well!\" \n\n\n\"Thanks I made this one just for you\"\n\n\n\nI see versions of this joke on social media a lot anc it's never made sense to me. I can't grasp the concept of changing your personality depending on who you're talking to. I mean I understand not speaking to your boss the way you'd talk to a friend, or a child or your boyfriend mom etc.\n\n\nBut changing your personality between friends? Coworkers? Strangers? I just don't get it. I am always \"me\" and I don't get how to not be. I feel like that explains a lot about why I struggle to make friends. I am unable to \"match\" someone else's personality. \n\n\nIs this a common skill that I should have developed by now? Do people really do this?",
        "created_utc": 1675645032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I get better reception from Gen X and boomers than Millennials and Zoomers?",
        "author": "BreadfruitPhysical26",
        "url": "https://www.reddit.com/r/socialskills/comments/10usljf/why_do_i_get_better_reception_from_gen_x_and/",
        "text": "[removed]",
        "created_utc": 1675643673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know how to talk to people on dating apps",
        "author": "Amallee",
        "url": "https://www.reddit.com/r/socialskills/comments/10usl5o/i_dont_know_how_to_talk_to_people_on_dating_apps/",
        "text": "[removed]",
        "created_utc": 1675643647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considered as funny but also seen as someone easy to be made fun of.",
        "author": "coffeecompanion",
        "url": "https://www.reddit.com/r/socialskills/comments/10us9dv/considered_as_funny_but_also_seen_as_someone_easy/",
        "text": "To be clear my friends are great and they are good people. However I don't like the feeling that they always considered me as funny, but at the same time the one who's always easy to be made fun of. I guess having a funny attitude makes it easier for people to just make fun of me and never take me seriously. I wanted to change how people view of me but with my current personality and for how long theyve known me (almost a year), its difficult. I lose the feeling of sense of respect sometimes even though were great friends.",
        "created_utc": 1675642811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life's going really well lately, but somehow I worry of lose them one day, how do I keep good things last?",
        "author": "Objective-Bag-6990",
        "url": "https://www.reddit.com/r/socialskills/comments/10us3wd/lifes_going_really_well_lately_but_somehow_i/",
        "text": "Life's going really well lately, but somehow I worry I will lose them one day, how do I keep good things last? What should I do to avoid the nervous feeling?\n\nCan anyone help me in a psychology way or just with some life hacks or tips?\n\n&amp;#x200B;\n\nMany thanks.",
        "created_utc": 1675642432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficult person or Different communication style?!",
        "author": "Princess3156",
        "url": "https://www.reddit.com/r/socialskills/comments/10urqlf/difficult_person_or_different_communication_style/",
        "text": "I don’t like watching movies or playing video games with the lights on, we’re in a common room with three of us using the entertainment system. \n\nWoman walks into room who happens to pay the bills so obviously there’s no rights for the others in the common space.\n\nConversation goes like this:\n\nWoman turn on light in living room\n\nI ask after observing her for a while that she’s on her phone and doesn’t seem to be reading or writing. \n\n“Do you need the light on right now?”\n\nMy tone is neutral\n\nShe replies\n\n“Which light?” \n\n(Because there are so many Damn lights on) \n\n“I said the one above you, do you need it right now?” \n\nShe replies back \n\n“Do you need shades for the house?” \n\nJust insanity, could just reply “yes or no” ffs. \n\nHas anyone ever dealt with someone like this? How do you cope? Am I the crazy one for questioning it?",
        "created_utc": 1675641532,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make good quality friends?",
        "author": "icedancedreamer",
        "url": "https://www.reddit.com/r/socialskills/comments/10urjjg/how_do_i_make_good_quality_friends/",
        "text": "[removed]",
        "created_utc": 1675641041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my coworker (22F) following me (23M)?",
        "author": "fsdklas",
        "url": "https://www.reddit.com/r/socialskills/comments/10urfxy/is_my_coworker_22f_following_me_23m/",
        "text": "Every Saturday, I go to the library because every weekend I like to read books in the morning, and then buy groceries afterwards. I walked into one of the history isles because I enjoy reading history and what do you know, I saw her sitting on the floor reading a book. Normally the library is empty in the morning so I approached her and said it's a coincidence that we met each other and I said I enjoy reading books on the weekends. We talked for a little bit and then I left to checkout an autobiography of a WW2 survivor. Afterwards I needed gas so I stopped at a gas station around 15 minutes away and filled up my tank. It took a total around 30 minutes because of a line. Then I went to the grocery store nearby. As I was leaving, I saw her coming into the grocery store. Now I was thinking “what a coincidence it's a second time meeting someone here”. We started talking for a little bit and she said she normally buys groceries too on the weekends. In my mind, I thought it was kind of strange how someone would drive 15 minutes away from the library to get groceries when there might've been some place closer for her. Regardless, I said my goodbyes and left. \n\nAfterwards, I met up with some friends and went snowboarding, it’s around an hr drive near us. After snowboarding for 5 hrs, we drove back from the ski resort to a nearby Italian restaurant. As we were walking in, guess who I saw? The same coworker with a group of her friends in front of us waiting for a table. \n\nAt this point I thought this was too weird and I approached and asked if you’re following us. She said “No and in fact she assumed I was stalking her”. I said we went to snowboarding and they said they just came from knitting sweaters at someone’s house. We parted ways and she said we’ll meet me at work \n\nI could just be paranoid but I realized this whole time I had my Snapchat and Instagram location shared on and we’re friends online\n\nMaybe I’m reading too much into this but could she be following me?\n\nTLDR; I saw my coworker 3 times today and each time was weirder and she could be following me with my location sharing turned on",
        "created_utc": 1675640786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for ppl with social anxiety to feel like ppl are judging or talking behind ur back??",
        "author": "Dismal_Bag_1266",
        "url": "https://www.reddit.com/r/socialskills/comments/10ur58o/is_it_normal_for_ppl_with_social_anxiety_to_feel/",
        "text": "I'm tryna tell myself it's just anxiety but is this a normal thing ppl experience?",
        "created_utc": 1675640041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social anxiety when introducing myself but only in the daytime",
        "author": "TopheTriesHard",
        "url": "https://www.reddit.com/r/socialskills/comments/10uquib/social_anxiety_when_introducing_myself_but_only/",
        "text": "I like to go out at night but am not a big drinker to start off. Whenever I introduce myself to girls at bars I have no issue starting a conversation, and no I am not even “loosened up”. But whenever I try to introduce myself to a cute girl when I’m out and about (target, costco, trader joes, etc.) I tend to to stutter or forget to even say my name. I mess up terribly with small talk in these situations, but I have no issue in a “normal” social setting. I understand that it is probably because it’s already a social setting where I am comfortable, but any advice on introductions or small talk while simultaneously showing interest. Usually happens after eye contact that is more than just a glance. Along the lines of I want to see what you are like but while grocery shopping",
        "created_utc": 1675639297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shouldve i said anything different",
        "author": "Picklerick6789",
        "url": "https://www.reddit.com/r/socialskills/comments/10uqkjq/shouldve_i_said_anything_different/",
        "text": "Disclaimer: was in a similar situation a few years ago and when i told my friend about it she told me that thats not how you talk to authority figures and that i couldve handled it better. \n\nIts currently 2:52 am here and i was driving home just 10 minutes ago and there was a police check point 3 mins away from home. So i stopped and this is how the conversation went? \n“Can i have your license and registration?” \n“What” \n“Can i have your license and registration?”\n“I dont have my license on me” *looks for registration* \n*gives him an expired registration cause idk where the renwed one is* \n“So you’re driving without a license?” \n“I have one just not on me right now sorry”\n“Who’s car is this” \n“My dad’s” \n“The registration is expired” \n“Yeah theres a new one but i cant find it sorry” \n“Are you sure there’s a new one” \n“Yes” \n“Where is it” \n“Somewhere but i cant seem to find it now sorry” \n“Do you have your id?”\n“No not on me now sorry, but i can give you my id number so you check the license as well” \n“You dont have any form of id right now?”\n“No but my house is around the corner ill go get one n come if thats okay” (i said this like 3 times cause he looked at me funny then i said) “one of you can come with to check” \n“Not even a picture?”\n“Not sure ill look” \n*takes 10 minutes to look* \n“We wont take up more of your time you can go” \n“Sure?” \n“No such thing as sure here we’re telling you to go so just go” \n“Okay thanks” \n\n\nWhat couldve i said better ? How couldve i handled the situation better",
        "created_utc": 1675638598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t know topics-",
        "author": "Exspressio",
        "url": "https://www.reddit.com/r/socialskills/comments/10uqkg9/dont_know_topics/",
        "text": "So, I have a friend, that I want to get to know more. I don’t want them to seem like I’m playing 50 questions every phone call, but whenever we do call we’re silent or talking about the same things over and over again. I don’t want to bore them because I also am interested in going farther with our relationship in a way to see if we can work out. We make time out of the day to communicate, it’s just we can go silent the whole call, and I feel like I’m a bore. How do I go about this?",
        "created_utc": 1675638591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zero social life in university",
        "author": "Maleficent-Lettuce60",
        "url": "https://www.reddit.com/r/socialskills/comments/10uqh6c/zero_social_life_in_university/",
        "text": "I'm 19 years old, currently in my 2nd year of university, and I kinda suck at making friends. I have a good couple of \"friends\" in my course, but after classes, everybody kinda goes their own way and meets their own friend group. Unless there is a project, a deadline, homework or anything academic related, I am pretty much left alone for majority of the time. I've tried inviting them out but everybody either forgets or doesn't really have the time for it. I truly think of them as study \"colleagues\" rather than my friends. They dont even hang out with each other, its like everyone just does it for the grade and leaves.\n\nThe weekend's are horrible because I speak to nobody besides my parents on call, and it gets so lonely. Things did look really bad last semester but I've taken up self improvement more seriously and that is keeping me sane. But I still am clueless on how to solidify my friendships, its hard to work with people who have zero interest in hanging out after class. \n\nThe other thing I can try is branch out, but since its the middle of the semester I can't join any clubs as of yet, and I'm not much of a \"cold approach\" guy where I walk up to random people and strike up a convo. I think I may be glorifying those TV show friend groups because after high school I never really fit into any, and maybe my idea of a friend group could be flawed. But I am willing to try new things to meet new people, because I need some flavour in my life or I'll end up in a bad place.\n\nAny advice would help honestly..",
        "created_utc": 1675638347,
        "upvote_ratio": 1.0
    },
    {
        "title": "was this a rude thing to say??",
        "author": "squitwerttennisballs",
        "url": "https://www.reddit.com/r/socialskills/comments/10uq7pj/was_this_a_rude_thing_to_say/",
        "text": "So sometimes I'll say something not thinking much of it, but then when I think back on what I said a few days later I'll realize that I was accidentally being kind of rude?? So I want to know you guys' thoughts on this short conversation I had with my coworkers.\n\nSo my coworker brought himself a pizza to eat on break, and he asked me and another coworker if we wanted a slice and we both declined. He was like \"fuck y'all too then\" (jokingly) and we all laughed. My other coworker was like \"She (referring to me) doesn't want no pizza, she doesn't like that.\" And then he asked \"wait DO you like pizza??\" And I was like \"Yeah, why wouldn't I like pizza?\" And then, idk, he looked at me funny?? Maybe I misinterpreted his body language, but was that too... Idk rude??? Then the guy that brought pizza asked if I liked sushi, and the conversation continued elsewhere, but yeah, was that a weird question for me to ask?",
        "created_utc": 1675637697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was this rude of me?",
        "author": "RacoonMan22",
        "url": "https://www.reddit.com/r/socialskills/comments/10upevt/was_this_rude_of_me/",
        "text": "I was hanging out with family friends and one guy I met was from India and he said a sentence and it was very clear and crisp. I made a joke how this guy is already Canadian.\n\nNow I am thinking it was kinda rude of me to say that.\n\nThis was back in November of last year btw",
        "created_utc": 1675635745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn the Secrets of Ryan Reynolds Humor for Everyday Conversations",
        "author": "ThenBenefit",
        "url": "https://www.reddit.com/r/socialskills/comments/10up79r/learn_the_secrets_of_ryan_reynolds_humor_for/",
        "text": "Hello everyone,\n\nAre you tired of feeling tongue-tied in social situations? Do you struggle to find the right words to make people laugh and connect with others? Look no further! In this video, I take a closer look at the comedic style of Ryan Reynolds, a master of sarcasm and explicit humor in roles such as Deadpool. By analyzing his jokes, I have discovered four key elements of his humor that you can use in your everyday conversations.\n\nI also explore the importance of storytelling in Ryan Reynolds' humor. Many people think that his comedy is all about one-liners, but I have discovered that he also knows how to tell great stories. I share my formula for crafting stories that will have people laughing and engaged.\n\nBy emulating Ryan Reynolds' comedic style, you can unlock the power of humor to connect with others and improve your communication skills. So, stick around and learn how to bring some of Ryan Reynolds' humor into your own personal life.\n\nhttps://youtu.be/CE-3kLqH2IY\n\nLet me know what you think in the comments!",
        "created_utc": 1675635243,
        "upvote_ratio": 1.0
    },
    {
        "title": "atomic habits applications for social skills?",
        "author": "No_doxx_pls",
        "url": "https://www.reddit.com/r/socialskills/comments/10uoat7/atomic_habits_applications_for_social_skills/",
        "text": "Everyone has been talking about that book recently, from language learning circles to math guys to body building circles and everything in between. I read it and have already started utilizing it for some of my hobbies, I just want to see if anyone has utilized it for social skills. Here are some of my thoughts, I'd love to hear more\n\nThe first part where he talks about identity I see where I am truly stuck, I see myself as someone who is not good at social skills. I have always had a growth mindset with every other skill, math, music, games etc, but I have never seen it that way with social skills. Every other goal I have right now I have some evidence for that identity, I am a guy that likes working out, I am a guy that likes to cook, but I don't have any evidence yet where I can say I am a guy who can talk with people. Using his 2 minute rule, I might have a path for that but we'll see.\n\nStarting basic, I think something as simple as 'when I see someone alone I smile and say How's it going'. It's so simple that it seems worthless, but when that feels natural, once I have that habit, I can build off of it. When I ask how someone's day is I can ask them to elaborate, I can introduce my name etc, that's down the line but if I can start there, I can (hopefully) start having pleasant interactions, and get to a point where I have enough evidence for a new identity of 'I am a guy who can talk with people'.\n\nSlightly schizo rant I know, but I'm sitting in a coffee shop and I just had an epiphany, so I figured I'd share",
        "created_utc": 1675633049,
        "upvote_ratio": 1.0
    },
    {
        "title": "No close friends and struggle to make new ones",
        "author": "TheDownDad",
        "url": "https://www.reddit.com/r/socialskills/comments/10uo56c/no_close_friends_and_struggle_to_make_new_ones/",
        "text": "Hi all\n\nHopefully don't rant to much but struggling for friends at the moment and it's something that has really taken a toll on my mental health.\n\nWhen I was young, from primary school up to early 20s I had a massive group of friends, up to 30 of us would often hang out but as life went on the groups all split off (uni, moving to new areas, life in general) the few which didn't really make much of them selves (me included) kind of stayed together and had a tight group up untill mid 20s, my mental health really took a spiral and the break down I had really shook me and I didn't leave the house accept for appointments or cigarettes. I noticed at this point people started to not respond to me once I started to pull my way back out and realised I had 1 friend who was there through it all. A few months down the line he met his new gf and as time went on he moved over that way (she lived few hours away) and I saw him less and less and not seem him now for over 5 years. \n\nNow I haven't got anyone really who I would call a regular friend, one that I can count on and see. I have tried to make new friends but I have turned very bitter towards things and have a very shit outlook towards life and I think this rubs off on people and they don't want to be around me and my social skills are really poor, to the point where I stare at the floor while talking to people. I have a football team I've started playing for and tried to make a few friends there but I seem to be repellant, they seem to want to end the conversation quickly and then go and talk else where. I have even taken on personalities of people to try and pretend I'm similar to see if this helps with making friends but people have now started saying you don't know which version of me is turning up. \n\nI just wondering has anyone got any advise as this has now been going on for over 5 years, I can tell it's also upsetting my gf as she sees how upset I get when I feel as though I'm making friends etc to find out I'm not and it was just someone being friendly.",
        "created_utc": 1675632669,
        "upvote_ratio": 1.0
    },
    {
        "title": "0 SOCIAL SKILLS",
        "author": "Missgurlyyyyy",
        "url": "https://www.reddit.com/r/socialskills/comments/10unwqq/0_social_skills/",
        "text": "heyy \n\ni just started uni and i am soo bad at starting conversations and i am scared. the first 2 days i left school early because i could not take being alone while others was starting to get to know each other. \n\ni have been sick in my bed for the past 2 years with 0 social interractions (beside my family) and now i am out in the real world again and it feels like i forgot how to talk to people.",
        "created_utc": 1675632105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I bad at socializing or am I a misanthrope?",
        "author": "EndOfTheLine00",
        "url": "https://www.reddit.com/r/socialskills/comments/10unw6n/am_i_bad_at_socializing_or_am_i_a_misanthrope/",
        "text": "I like talking about deep topics but really hate all the associated maintenance to get there, to the point that a lot of the times I prefer reading a book. The \"maintenance\" and \"grunt\" work of relationships is just too exhaustive to me. I hate small talk, I don't care about people's day and hate having people ask mine even more because it makes me feel self conscious about having nothing to say and puts pressure on me to have a life that's interesting yet acceptable for other people to not think is weird. The people I have felt closest to in my life are the ones I feel truly accept me. Those whom I know aren't judging me when they ask about my day, those who support me. Then I do care about their day, I do care about how they are doing, how they are feeling. But for most people I just can't get there. Is there something wrong with me? Am I a psychopath or just too hard to please?",
        "created_utc": 1675632066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nervous Stutter when I dont talk to people for a while",
        "author": "TheLonerCoder",
        "url": "https://www.reddit.com/r/socialskills/comments/10unib7/nervous_stutter_when_i_dont_talk_to_people_for_a/",
        "text": "Does this happen to anyone else? Basically, sometimes I go days with very minimal verbal communication with people and, as a result, i find myself having to \"adjust\" to society/people again. Like it's just like I just get so anxious around people people and stumble on my words and start stuttering making a fool of myself.. But i'm not usually like this. Usually I have no issue talking to people. It's only when I dont talk to them for days when this happens. And it usually takes like 1-3 days to adjust again to how I normally am. It's such an inconvenience since I'm not a big extroverted person who's always going out with friends nor interacting with strangers. Anyway to avoid this?",
        "created_utc": 1675631146,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I stop being awkward when hanging out with new people?",
        "author": "Independent-Bank-536",
        "url": "https://www.reddit.com/r/socialskills/comments/10un86o/how_do_i_stop_being_awkward_when_hanging_out_with/",
        "text": "Hello. I'm going out with a new friend these days and I'm a really nervous and strained person. I don't want to mess this up but sadly, my social skills terribly deteriorated. Over the course of a month, I haven't been out, so my communication skills are really bad right now. Reddit, what should I do? How do I not embarrass myself?",
        "created_utc": 1675630501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is confidence in certain situations offensive or a challenge to others?",
        "author": "870SWMAN",
        "url": "https://www.reddit.com/r/socialskills/comments/10umxcl/is_confidence_in_certain_situations_offensive_or/",
        "text": "I’ll be the first to admit I’m not the most confident person. I’ve struggled with it my whole life. I don’t know if I’m doing something wrong at work. \n\nI’m a guy in his late thirties. I’m told I look about ten years younger. People say I look like an average fit white guy. I’m a lifelong runner and lifter. I did mixed martial arts and Brazilian ju jitsu for a few years. \n\nI’ve never run into this type of situation I’ve outlined in my personal life or in public on my off time. People are always super polite and friendly with me and I try to reciprocate. I feel like I never have a problem being myself. I make it a point to never insult or make fun of anyone. I don’t ever get into fights or arguments.\n\nI’ve been in the retail and restaurant world my whole life. I own a retail business. For the last ten or so years I’ve either been management or an owner. \n\nWhen I greet customers I smile and look them in the eye. I’m trying to be genuine and friendly and approachable. I never say anything other then welcome or hi.\n\nThe only time I have issues is when I have a male customer who (I think) wants to be the loudest man in the room or center of attention or the alpha. When I’m at work I’m there to take your order and get you in and out. I’m not there to get into a verbal exchange. I feel like now the aim of their visit it to knock me down by engaging in a weird dialogue or exchange. They’ll insult you or make fun of you or challenge you. Everything about what they say or does seems to have a goal of elevating them and diminishing me.\n\nI could be crazy but I get the feeling that this person expected to come into a business where all the workers are terrified of him or inferior to him or submissive to him. When he sees someone who might not be any of those it pisses him off and then he has to put them in their place by engaging with them. I think it happens 99 percent of the time if I make eye contact with them. I swear the eye contact offends them somehow. \n\nMost times I ignore it. I’ve noticed if you open your mouth it usually makes it worse. This is especially true if you try to defend yourself or stand up to him. It only escalates the situation.",
        "created_utc": 1675629791,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some advice",
        "author": "dick_in_beard",
        "url": "https://www.reddit.com/r/socialskills/comments/10um30k/i_need_some_advice/",
        "text": "For the last couple months I've been having trouble with anxiety and depression and such spent most of my days in my room and I turned down a lot of invites to hang out. But now as I am emerging from that my Friends have just stopped inviting me but I see them hanging out without me and not even asking if I wanted to hang out in the first place. I don't know who to be mad at my friends or myself. what should I do I can just feel myself slipping back down in depression.",
        "created_utc": 1675627800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Places to make new friends",
        "author": "axsperr",
        "url": "https://www.reddit.com/r/socialskills/comments/10ulzbo/places_to_make_new_friends/",
        "text": "Hey everyone. I’ve recently moved with my mom to a whole different city knowing zero people here. My mom works a 10-6, meaning I’m home alone all the time. My college begins in 6 months, meaning I’m all to myself for the next 180 days. And to my surprise, I actually don’t like being all alone and inside all the time. But I really don’t have anyone to go with, cause all my friends are in a different city.\n\nSo do you all know any places to make quality friends, the kind that hang out even outside where I met them.",
        "created_utc": 1675627552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I went to 3 bars alone yesterday with the intention of meeting new friends",
        "author": "InquisitiveSheep",
        "url": "https://www.reddit.com/r/socialskills/comments/10ulqbs/i_went_to_3_bars_alone_yesterday_with_the/",
        "text": "Hi all! I wanted to share this experience on this subreddit.\n\nI had been feeling pretty lonely and I wanted to have a fun night out. My friends were busy but I really wanted to do something. I am a pretty witty and charming girl (22F). When I am with 1 friend at a bar, I am almost always able to meet new interesting people OR be approached. \n\nArriving alone, was a very different experience. \n\nI switched venues 3 times, tried to strike up a conversation in all places (didn't go anywhere) and nobody approached me. All 3 were popular bars in a major city and I was just alone for the whole night! I spoke to girls my age, guys my age, bartenders, etc and every try was a fail. \n\nI had some awesome uber drivers between each bar and they were the only conversations I had, thank goodness for them. It was kindof sad that the plans went south and I ended up being in bed by 10:30. \n\nI was out from 6pm-10pm (it is dark here during all of those hours, and bars were busy)\n\nWhen I go out to bars with friends (or 1 friend) and we meet new people, we almost always invite them/get invited to a club and have a really fun night. Maybe it was naive to expect this would happen alone?\n\nPlease do not interpret this the wrong way! I am not looking for pity, moreso I am just curious to know if anybody has tips for this specific type of situation. I am soon moving to a totally new city and I will have no option but to go to bars alone for a while. \n\nIs it weird to go to bars alone? How do you recommend a lone gal make some new friends?",
        "created_utc": 1675626966,
        "upvote_ratio": 1.0
    },
    {
        "title": "How weird is it for someone to ask you when you last had sex",
        "author": "Zappawhappa",
        "url": "https://www.reddit.com/r/socialskills/comments/10ulnei/how_weird_is_it_for_someone_to_ask_you_when_you/",
        "text": "I had a casual job and a couple others in the place were absolute asshole/bullies wont go into it.\n\nBut one time hes like when did you last get some?\n\nI just made up some stupid answer. But shoudlve made joke like last night with your mum.\n\nBut its always bugged me out being asked that, is that strange haha. I mean thats just not cool and what does it say about him tbh oh well life goes on nothing major. Was a moron guy anyway.\n\nPersonally im private person and also especially about my sex life so even friends or other jobs people speak and ask similar things I get stressed, even if I had sex last night or last year not the issue I just feel that my private life is mines and dont enjoy thinking people even thinking about me and that it gross me out and feel offended/abused.",
        "created_utc": 1675626765,
        "upvote_ratio": 1.0
    },
    {
        "title": "question relating too speech issues and intelligence",
        "author": "emery103",
        "url": "https://www.reddit.com/r/socialskills/comments/10ulk4w/question_relating_too_speech_issues_and/",
        "text": "hi, I have been diagnosed with anxiety and severe ADD-inattentive every since I was 8 years old (16m now). I’ve always had trouble expressing my thoughts into words and communicating properly face to face. I often think because of that I must have a low iq because I feel like I have a inability to come up with things to say or keep conversations going and often use wrong words that don’t relay my thought clearly and often get misinterpreted. I talk much less now because of social anxiety so it’s worse. I took a official medical IQ test and I was told I scored very well and above average overall, however when it came to the section of the test where I was given words and asked to explain the definition or examples of it being used and I failed miserably. I kept using like/and/kind of it was incredibly embarrassing to be honest. is there something wrong with me? Is this something I can fix?",
        "created_utc": 1675626542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Incident in class",
        "author": "AnthraciteKid",
        "url": "https://www.reddit.com/r/socialskills/comments/10ulcfk/incident_in_class/",
        "text": "[removed]",
        "created_utc": 1675626033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pull back from people that don't start conversations with me?",
        "author": "Hot-Variation-2003",
        "url": "https://www.reddit.com/r/socialskills/comments/10ul7k6/should_i_pull_back_from_people_that_dont_start/",
        "text": "Hello. I have this habit of completely ceasing any form of contact (or at least reducing it) if I feel like someone isn't trying to initiate conversations with me. I don't like being the only one trying to keep in touch. If that someone doesn't try to contact me, I just assume they don't want me around enough and just move on. Is this behavior healthy? If not, what should I do instead? I feel like just talking about it would be awkward, but literally NO ONE tries to keep in touch. I feel like I'm the last person alive that actually tries to keep a relationship going, and it's driving me nuts.",
        "created_utc": 1675625697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puking some thoughts into some 0's and 1's",
        "author": "mrazulazo",
        "url": "https://www.reddit.com/r/socialskills/comments/10ukqzj/puking_some_thoughts_into_some_0s_and_1s/",
        "text": "[removed]",
        "created_utc": 1675624592,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need an advice",
        "author": "PAPACEUCIO",
        "url": "https://www.reddit.com/r/socialskills/comments/10uk5ai/i_need_an_advice/",
        "text": "[removed]",
        "created_utc": 1675623189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else experience this and have any solution?",
        "author": "Careless_Seaweed_569",
        "url": "https://www.reddit.com/r/socialskills/comments/10uk3hj/anyone_else_experience_this_and_have_any_solution/",
        "text": "I try to be social but I often feel worse after I do. I am always worried about saying the wrong thing or not being polite enough or whatever. I've always had trouble being friends with people cause I am always worried I'm one dumb comment or bad joke from losing that friend. This makes me feel like I should just stay away from people cause I just end up miserable after I hang out with people. I end up spending my time after thinking about the things I shouldn't have said and the mistakes I made. I feel like they will never want to hang out with me again. Then when they do I end up feeling like it was just because they feel bad for me or are trying to get something from me. I am just tired of trying so hard and feeling like its never good enough.",
        "created_utc": 1675623068,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know what’s wrong with me",
        "author": "Thecryingcoquette",
        "url": "https://www.reddit.com/r/socialskills/comments/10ujyzp/i_dont_know_whats_wrong_with_me/",
        "text": "I used to be considered a social butterfly. I would go out a lot and had a wild-child image. I used it to my advantage by being able to obnoxiously converse (and lick) anyone with no harm bc it was just “who I was.” Acting upppp lol. \n\nI thought I was powerful, but started to feel like people would use me for entertainment/inspo and I would (ugh) fall into their trap just to stay relevant. \n\nI got sober and kind of went through a hermit phase where I fell madly in love with myself. I developed hobbies and dance alone often. \n\nSocializing is a big sore spot for me now because I just don’t know how to be fake with people anymore. Like what if I don’t want to be happy at an event, what if I want to contemplate life obsessively amongst the company of others? Why is that such a mood killer? Why do we have to talk about surface-level shit and then act like we have a deep relationship? \n\nI feel like I’m being harsh. Like maybe people socialize to be the person they want the world to know them as. Who am I to judge? But am I dense to not want to engage with them?",
        "created_utc": 1675622776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rejected when I tried to make friends in college",
        "author": "Ill-Ebb1837",
        "url": "https://www.reddit.com/r/socialskills/comments/10ujyza/rejected_when_i_tried_to_make_friends_in_college/",
        "text": "I had social anxiety throughout my whole life, and I finally had the confidence to go out and try to talk to someone. So before class I tried to talk to someone the first time only to get rejected.  People kept telling me most people are nice in college and are happy to meet new people. I feel dumb and don’t want to talk to anyone else because I am so terrified of rejections",
        "created_utc": 1675622775,
        "upvote_ratio": 1.0
    },
    {
        "title": "A quote I found really uplifting",
        "author": "Any_Coast5028",
        "url": "/r/socialanxiety/comments/10uem4e/a_quote_i_found_really_uplifting/",
        "text": "",
        "created_utc": 1675622145,
        "upvote_ratio": 1.0
    },
    {
        "title": "My university convocation is next week and I am totally dumbfounded on how to interact with other people there",
        "author": "heisenberg_2013",
        "url": "https://www.reddit.com/r/socialskills/comments/10ujiis/my_university_convocation_is_next_week_and_i_am/",
        "text": "So I have to attend a convocation next week at the university I studied for my bachelors. I didn't make any close friends or kept contact with anyone after university ended because university was in a online mode of education for 2 years and partly because I was an antisocial loner when I had to chance to attend university. I barely interacted with 2 people and they said they are not attending the convocation.\n\nSo the thing is I have to attend this convocation because I want to meet my former professors requesting a letter of recommendation and all the details about it which can't be discussed via email but I have a little stressed about how to survive 5 hours there.\n\nI don't want to talk about what I have been upto with my former classmates since I want to keep it a secret partly because I don't like to discuss my life goals until I have achieved them and second I think many of them will try to take the same career path if I tell them what I have been upto.\n\nSo the advice I am seeking here is what else can I talk about with former classmates except what I have been upto or what could be appropriate story to tell them what I have been upto instead ?",
        "created_utc": 1675621689,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend texts me first but when I reply she ghosts me",
        "author": "shinigamirunner",
        "url": "https://www.reddit.com/r/socialskills/comments/10ujfr8/my_friend_texts_me_first_but_when_i_reply_she/",
        "text": "She'll say \"Hi, how are you doing?\" I'll reply with \"I'm good\" or whatever I'm up to, then ask for her day. Then she replies about what she's doing. Then when I ask her a question again she ghosts me. \n\nThen like a week later she says \"Hi\" again as if she didn't just leave me hanging. This has happened countless times and I'm thinking of not talking to her anymore. She insists that she cares and that I'm her friend but I don't buy it. She's quite immature for a 21 year old tbh. I think I'm done with her good this time, but why would she? I mean I just wanted to talk to her and I thought that was what she wanted too since she said Hi. But I guess not..",
        "created_utc": 1675621507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suddenly conscious of my English accent and feeling very embarrassed",
        "author": "iknownothingsir",
        "url": "https://www.reddit.com/r/socialskills/comments/10ujb39/suddenly_conscious_of_my_english_accent_and/",
        "text": "So for a friend's birthday, I sent her a voice message in English wishing her happy birthday. I feel more comfortable with English rather than my native language, so I always write in English but rarely talk. Her first response was that \"all aside, but that was an accent\" and a few laughing emojis. I tried to play it cool saying \"I know! Since I learned English on my own and have no one to practice it with, you better adjust a bit\" She did say thank you after this. But now I'm very conscious of saying things in English in front of her or anyone. Even last night, someone asked me to send a voice message and I talked in English.   \nI can't help but feel ashamed that maybe she thinks I tried to fake an accent too. But I honestly didn't. It just happens naturally. Every time I speak English, my voice becomes a bit lighter and maybe it's because I've always consumed western media and never had anyone talk to me in English in my country. I know my friend didn't have any bad intentions when she told me never to do this accent in front of others or they'll laugh at me... I don't know I'm just feeling very embarrassed all of a sudden. I didn't mean to do this.",
        "created_utc": 1675621199,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone else struggle speaking with purpose i need tips",
        "author": "throwaway4654885",
        "url": "https://www.reddit.com/r/socialskills/comments/10uin6g/anyone_else_struggle_speaking_with_purpose_i_need/",
        "text": "i need to to break into the habit of thinking more about what im saying and broadening my vocabulary i always speak empty dumb words from my subcouncous i want my words to be more meaning and careful",
        "created_utc": 1675619619,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to charm and connect with these different groups of people",
        "author": "SierraMejor",
        "url": "https://www.reddit.com/r/socialskills/comments/10uiad2/how_to_charm_and_connect_with_these_different/",
        "text": "**Goal:** My goal for writing this post is to gain insight into how to deal with different groups of people as well as to provide some of my own insights. \n\nI figure that each person here has a unique perspective they can contribute and it would be awesome to have a guide to give us at least a general idea of how to deal with different types of people in a charming way.  Again, I'll share my own perspectives and you can jump around to each section. I'd really appreciate it if you gave me some insight on my own struggle points too. \n\n**Background:** I'm 23M. I'm squarely middle class. I work in tech surrounded by people much older and more experienced than me as well as much younger and more talented than I am. I have a handful of close friends I talk to and I try to stay in touch and somewhat close to family despite being far away. I mostly play a few video games or watch youtube in my spare time, but I also enjoy just learning and studying sciences and tech in general - I keep to myself most of the time, but I do enjoy company.  \n\n**People I find easy to talk to and enjoy spending time with:**\n\n* **Younger kids (1-8yo), especially family**, in smaller groups: This age group of kids are fairly easy to deal with. The main thing to keep in mind is \"They just want to play.\" So keep a playful spirit, listen to whatever they have to say and go along with it. Carry them (if you have the strength to do it safely), run with them, play pretend with them, poke and tickle them, play video games with them - whatever it is they want to do. Most of the time you can let them take the lead, especially if they're outgoing. If they're more shy and quiet just be a friendly face from afar and don't force them. Let them come to you when they feel comfortable, THEN you can slowly start playing with them - they WANT to play, they just need to be sure you're safe first.   \nThe one caveat I would give to this is to remember that you're the adult. You're bigger and scary to them and you're the one in charge of making sure they're safe. So go along with what they want to play, but make sure they're not playing right next to the kitchen knives. These kids are pretty creative and have close to no filter at this age so the entertainment value can be pretty rewarding. \n* **Guys my age with the same interests**: This one is pretty simple too. I can talk for hours on end as long as I know the other guy respects me (lets me talk, doesn't steamroll me, we can bounce ideas and thoughts off each other, etc.) I'm fine with some ribbing as long as I know it's a joke and nothing but a joke. Once it starts to feel like it's not just a joke anymore, I lost interest. I typically have them as activity partners and we play games together after we talk about our days and things going on in our lives. Often, we'll do this in between rounds. If I had to generalize, I'm down to vibe with guys who are respectful towards at their core, want to spent time with me, and are willing to do something with me - activity partners. \n\n**Dealing with me (or people** ***like*** **me):** \n\nI can give more info about me if you'd like, but I think it's best to start with the types of people I enjoy speaking with. I *will* reiterate that I'm very introverted but not shy; I don't go out of my way to start conversations with people but I do enjoy a conversation being started with me. \n\n**People I enjoy spending time with:**\n\n* **People who talk A LOT:** To the point that a lot of other people find them annoying or overbearing. It usually comforts me since I don't talk as much so I can let them talk as much as they want. They usually have a lot to teach me and I enjoy hearing from them. There's one caveat: When I start talking and contributing to the conversation, I don't want to be steamrolled or ignored. They can talk as much as they want as long as I feel respected; I lose interest when they lose respect. Just listen and hear me talk for a bit, acknowledge what I said even briefly, then you can go back to talking for 30 mins on your own again. I don't mind. I actually enjoy it. \n* **Activity Partners**: people who ask about me and what I have going on in my life, but don't necessarily pry too deep. We hang out because of a shared activity most of the time, and I totally enjoy and am fine with that. Whether it's playing video games or we're in the same Tae Kwon Do class, as long as they like hanging out with me just to play games and I feel like they see me as a person (by talking to me, sharing some of their stories, and letting me share some of mine) without caring too much about it, then I'd spend time with them any day I'm free. Even on days when I'm not free, I would probably make time for this type because hanging out like this can be a stress reliever. \n\n**People I'm interested in connecting with (but want advice on):**\n\n* **People decades older than me**, especially those who have built up their wealth and whose wealth of experience and adventures I find hard to relate to (I don't have the time, money, or life experience that they've had). *My goal is to be able to relate to them in any real way and form an actual friendship with them, rather than just be an acquaintance.*\n* **Family entering their tweens**, especially younger family members who you built a good relationship with. As I talked about earlier, it was really easy to build a relationship with kids 1-8 because you just play with them. But as they grow older and they slowly lose their child-like wonder and excitement about everything, I don't exactly know how to relate to them as much, especially long distance. *I want to know what makes tweens have a good experience with their uncles and want to spend time with them as much*. I understand it will be a lot less than when they were younger, but I still want to keep up good family relationships. \n* **Family a generation above you**: I don't quite understand how to be charming with family members a generation above you - I'm talking about aunts and uncles. To be fair, I don't talk to them as much, but I'd at least like to make a good impression besides them asking me they typical \"How's work? How's the relationship? Where do you live now?\" etc. and being impressed by some things and not others. I guess I never really ask them about themselves too much but I think I freeze up because I don't know which topics are touchy for them and which aren't. *I want to be seen as the \"favorite nephew\" to people in their 40s - what can I do to do that?* \n\n&amp;#x200B;\n\nI'll likely be updating these with edits as I go along, think of more and get more feedback.   \nPlease contribute, I think having a collection like this could really help with community insights.",
        "created_utc": 1675618744,
        "upvote_ratio": 1.0
    }
]