[
    {
        "title": "Going to see a place to rent. Any help appreciated",
        "author": "sandersonprint",
        "url": "https://www.reddit.com/r/socialskills/comments/11axskw/going_to_see_a_place_to_rent_any_help_appreciated/",
        "text": "I'm going to see a flat tomorrow in an area I very much want to move into. Due to some pretty horrible life events and my mental health, this will be my first time attempting living alone and I am feeling overwhelmed. I would appreciate some help and advice.\n\nI have seen a couple of other flats but they weren't what I was looking for whereas I even know the building this one is in and it's exactly what I'm looking for. What kind of questions should I be asking? How do I ask if the rent is negotiable without putting myself on a blacklist with the landlord/estate agent? How much is a reasonable amount to try to haggle off the rent without being cheeky? I'm in the UK if that makes much of a difference in attitudes.\n\nI'm worried that there are unspoken rules that I have no idea about and don't want to put myself out of the running depending on how much interest they get.",
        "created_utc": 1677262031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t you hate when you have a falling out with someone, and you are at a place and see something that you both loved to talk about, and are tempted to contact them knowing they’ll appreciate it, but you don’t want to open up a can of worms?",
        "author": "huntee85",
        "url": "https://www.reddit.com/r/socialskills/comments/11axhdg/dont_you_hate_when_you_have_a_falling_out_with/",
        "text": "That’s exactly how I feel as I’m walking around an anime convention.  It’s depressing af.",
        "created_utc": 1677261255,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i get rid of low self esteem?",
        "author": "Cautious_Number_95",
        "url": "https://www.reddit.com/r/socialskills/comments/11axel4/how_do_i_get_rid_of_low_self_esteem/",
        "text": "M 23 - My brain completely shuts down in group situations sometimes and people i am not very comfortable with in university. There have been numerous occasions when my friends have bantered with me and bevause my brain shuts down i am unable to respond properly. Shuts down as in i become nervous, start mumbling and dont know what to say. What should i do about this? I ignore the banter but it gets to the point where sometimes i become the butt of the joke which i hate. How do i not do so? Obvjously i come off as dumb certain times but its because i cant seem to think of anything. \n\n\nThis and this general feeling of lack of importance and respect. I have noticed that while a couple of friends invite me, call me while i am with a couple of friends from my group i have to put a whole lot of effort than them. As in i have to talk, initiative conversations otheerwise nothing happens and its boring as fuck.  And often times i feel disrespected. Now the problem is that i only have this group of friends. I have been with em since 2 years and i am on good terms with some of em but cant seem to converse with a couple of em.  \nAnd most of them have other groups of friends and this makes me feel insecure a bit. \n\nWhat do i do?",
        "created_utc": 1677261052,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start a random conversation with my peers?",
        "author": "Specialist-Dust-3973",
        "url": "https://www.reddit.com/r/socialskills/comments/11axad8/how_do_i_start_a_random_conversation_with_my_peers/",
        "text": "[removed]",
        "created_utc": 1677260747,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's wrong with me.",
        "author": "caywna",
        "url": "https://www.reddit.com/r/socialskills/comments/11ax35v/whats_wrong_with_me/",
        "text": "I started talking to this girl a few weeks ago bc she's in my class and I always wanted to be her friend! We talked a lot bc we like similar games and stuff. Then my friend also started talking to her bc she was my friend, so she invited us to join a group chat to play games etc but when we joined we saw that there were so many people in there that we didn't know. \n\nMy friend got \"\"accepted\"\" in this group v well, she made a bunch of friends, she's fully apart of it. I thought it was normal bc i'm more reserved and timid but I still try, whenever i text the group, people rarely answer. Ik I'm not fully from the group. They 100% must think im boring or sick in the head idk. \n\nAlso my friend got closer to that girl, which is nice! They got close rlly fast but we didnt (even tho we started talking first), shes fun and we're v similar but it seems she just doesnt want to be my friend anymore.\n\nI just feel sad bc I feel like a failure. Like i can't even get close to other people. I don't know how to make friends. I just wanted to be friends w everyone.",
        "created_utc": 1677260226,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate everything about myself and have lost all hope that anything will get better",
        "author": "MC-Mantt",
        "url": "https://www.reddit.com/r/socialskills/comments/11awvg3/i_hate_everything_about_myself_and_have_lost_all/",
        "text": "My social skills are complete crap and I feel so alone. I’m unable to meet people not because I don’t want to but because I can’t hold a conversation for the life of me. I feel like I give off the vibe that I don’t want to talk to people when in reality I’d do anything for a conversation with someone. I have lost the will to do anything productive I don’t know what to do anymore and I have no clue what is wrong with me. I just want someone to talk to.",
        "created_utc": 1677259705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Skills Advice",
        "author": "Then_Landscape6474",
        "url": "https://www.reddit.com/r/socialskills/comments/11awqei/social_skills_advice/",
        "text": "&amp;#x200B;\n\nim 17 I really want to get into sales its something I need to learn to become the successful person I want to be everything I want to do in life requires it I used to have severe social anxiety, but now it's a little better since working in fast food, \n\nI don't go to college\n\n&amp;#x200B;\n\nbut my number 1 priority is to Improve my communication decreasing my social anxiety right now\n\neveryone says \"socialize to more people in person\" but I can't really resonate with that right now\n\n&amp;#x200B;\n\nhas anyone Improved their social skills significantly through online platforms such as discord or Omegle?",
        "created_utc": 1677259356,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do when someone you don't know asks you a weird question?",
        "author": "totally_expected",
        "url": "https://www.reddit.com/r/socialskills/comments/11awoz8/what_to_do_when_someone_you_dont_know_asks_you_a/",
        "text": "I was walking down the hall and some random person asked \"do you like black people?\" I decided to ignore him but what would be the best way to answer to this kind of stuff?",
        "created_utc": 1677259265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couldn’t understand what others are saying because I think they speak too fast and a bit unclear",
        "author": "ElaienyKg",
        "url": "https://www.reddit.com/r/socialskills/comments/11avwo8/couldnt_understand_what_others_are_saying_because/",
        "text": "So I’m not a native speaker in English, but I would say I have a pretty decent level (studied English for years, passed TOEFL, took the SAT, now in a U.S college). When I have casual conversations with some (not all) American college students I find it hard to know exactly what they are saying, especially in noisy environment which is the case all the time in college I guess. I find them speaking rather fast and a bit unclear. It really sucks not knowing exactly what they are talking about and having to secretly guess it and come up with vague answers or follow-ups. I also feel like an outsider too. What should I do?",
        "created_utc": 1677257313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small talk",
        "author": "Affectionate_Sky7192",
        "url": "https://www.reddit.com/r/socialskills/comments/11avvww/small_talk/",
        "text": "Hello,\n\nIt’s my first time posting here.\nI have this situation where our Directors from US will be visiting us (I work in a specific country here in Asia) in the coming weekend and I was told by my manager to meet them first in the hotel before he will pick us all to have a dinner.\nI’m so nervous. I don’t have any exposure in meeting high level officers with my previous jobs and to think they’re Americans and that I have to speak English. While I am not that bad in speaking it, I’m just worried how to carry and hold the small talk with them while we wait for my manager in the hotel lobby.\n\nIt’s their first time travelling here, and I kinda wanna set as well a good impression. I’m not a totally shy person but Im just so nervous for this weekend. What topics can we talk about? Or questions I can ask to them to trigger a conversation?\n\nThank you!",
        "created_utc": 1677257258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help socializing",
        "author": "s_online_",
        "url": "https://www.reddit.com/r/socialskills/comments/11avspb/need_help_socializing/",
        "text": "Im at first yr in uni and school has been so stressful lately (probably cuz its first yr and im just not used to it). But i wasn't able to socialize as much as i wanted to. I also have really bad social anxiety so that could also play a role. I want to reach out to people more and cuz like check up on them, see how they are and ask to hang out and stuff like that but i have this irrational fear that they might judge me for doing\nthat (?) or that they dont want to to talk to or bother them. \n\n Ik it sounds so dumb but it's really been holding me back. I also just wanna text people to talk but these are l people i haven't talked to in a\nfew months. I also have this problem where i can only talk about school and assignments or exams and i hate it cuz it feels like i cant make friends or have a normal conversation. Like what do people even talk about?\n\nI really need help to fix this. Are there any suggestions on how i can reach out, and what i should say to people to start real conversations?",
        "created_utc": 1677257028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for witty clap backs at people who make jokes because you are not drinking alcohol.",
        "author": "fulmenspei",
        "url": "https://www.reddit.com/r/socialskills/comments/11aunzc/looking_for_witty_clap_backs_at_people_who_make/",
        "text": "Obviously you could go ahead and explain how it is way healthier not to drink, but that’s not my point. I am looking for funny retorts.",
        "created_utc": 1677254157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Techniques on actually making the move back at home",
        "author": "Only_Minute8998",
        "url": "https://www.reddit.com/r/socialskills/comments/11aulyo/techniques_on_actually_making_the_move_back_at/",
        "text": "So I’ve had recent trouble with finishing the deal with a a girl once we go back home. I’m a 24m and have had girlfriends in the past with no issue hooking up. Obviously the first few times are a little awkward to get started but once I knew what she liked and didn’t, it was easy.\n\nNow that I’m single, I’ve had a few opportunities when girls that I’ve met at the bar, hit it off with, and then we go back to a friends house and I just can’t seal the deal. \n\nWhat are some tips or techniques to feel the girl out and instigate the start of intercourse?",
        "created_utc": 1677254013,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to cope with broken friendship after confession?",
        "author": "saltyrookieplayer",
        "url": "https://www.reddit.com/r/socialskills/comments/11auhcg/how_to_cope_with_broken_friendship_after/",
        "text": "Long story short, I had a friend group, all of them are closer together than me, I’m only close with one guy in it.\n\nAs my feelings grow for that guy, I confessed, then I kinda got kicked out because he couldn’t accept the fact that I’m homosexual. This was 6 months ago. We still kept contact because we are classmates but we’re nowhere as close as before. \n\nWe used to go everywhere together, today is the first time they went to the bar without inviting me, even intentionally avoiding me. \n\nFeels really bad as they were the most enjoyable friend group I’ve ever had in my life. Any tip for coping with these kind of emotion?\n\nI know I’m way too emotionally attached to them, but after reading other articles I still have no idea how to get out of this shit feeling.",
        "created_utc": 1677253683,
        "upvote_ratio": 1.0
    },
    {
        "title": "i dont even know how to talk to people anymore",
        "author": "cuaides",
        "url": "https://www.reddit.com/r/socialskills/comments/11au9ds/i_dont_even_know_how_to_talk_to_people_anymore/",
        "text": "So basically i have social anxiety, but i stopped using my meds because it got better. At least i thought so.Whenever i hang out with my friends or when im at school, i just say things i dont want to say.It just comes out of my mouth. I cant control myself. And i always regret it afterwards.I dont even feel like myself anymore, i forgot who i am.I always hurt people i care about because of this situation and they just wont talk to me anymore. How can i feel like myself again?",
        "created_utc": 1677253101,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it feel like for someone to tell you they’re suicidal?",
        "author": "not_throwaway3357",
        "url": "https://www.reddit.com/r/socialskills/comments/11au6pu/what_does_it_feel_like_for_someone_to_tell_you/",
        "text": "I told a guy I just met yesterday a story and I mentioned that I was really suicidal just two days ago. It’s normal to me because I’ve been thinking about it for years and at this point I guess I don’t really know what suicide sounds like to normal people anymore? I sent that guy a friend request on Fb and he didn’t accept it, which I think is pretty dumb because he knows he’s gonna see me next Sunday at church and being fb friends literally barely means anything so he should’ve accepted out of courtesy, but anyway is it socially unacceptable to tell people you’re suicidal lol",
        "created_utc": 1677252898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being black and not fitting the stereotype makes socialising hard",
        "author": "No-Initial8412",
        "url": "https://www.reddit.com/r/socialskills/comments/11atxjf/being_black_and_not_fitting_the_stereotype_makes/",
        "text": "[removed]",
        "created_utc": 1677252228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Investigating whether sexual fantasies are associated with personality, desire, and beliefs about one's own thoughts.",
        "author": "SophW13",
        "url": "https://www.reddit.com/r/socialskills/comments/11atvve/investigating_whether_sexual_fantasies_are/",
        "text": "\\*\\*Content Warning\\*\\* - Sensitive/Sexual topics. As part of my Psychology degree at the University of Lincoln, I am carrying out research for my final dissertation project. If you are aged 18 years old or older and can read/write in English, I would appreciate it if you could take the time to complete my study, which will take about 20 minutes. This study is examining the influence of beliefs, personality traits, and desire on sexual fantasising. Gender will also be investigated as an influence. You should only take part if you feel comfortable with these topics, specifically sexual fantasy content. The brief in the study link will provide more information and details of what the study will involve (ethics approval code: 2022\\_10295). Please note, if you are negatively affected by the questions/topics, you are free to withdraw from the study while participating by closing the browser. Please feel free to share this, along with the study link, to friends or group chats who you think may be interested in taking part. Your help would be very valuable. Thank you! \n\n[**https://unioflincoln.eu.qualtrics.com/jfe/form/SV\\_eXwS4nz1Z4SB3jo**](https://unioflincoln.eu.qualtrics.com/jfe/form/SV_eXwS4nz1Z4SB3jo)",
        "created_utc": 1677252099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my psychologist [38F] being naive or am I [27F] the one who is?",
        "author": "12daysof",
        "url": "https://www.reddit.com/r/socialskills/comments/11atb3k/is_my_psychologist_38f_being_naive_or_am_i_27f/",
        "text": "[removed]",
        "created_utc": 1677250590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I [27F] experiencing gaslighting by her [38F] or am I just incredibly misinformed?",
        "author": "12daysof",
        "url": "https://www.reddit.com/r/socialskills/comments/11at41m/am_i_27f_experiencing_gaslighting_by_her_38f_or/",
        "text": "[removed]",
        "created_utc": 1677250063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I [27F] trust the most common views that are expressed online, on Reddit and on this subreddit. Or should I trust the views of the people in my life? [33F] [62F] [56M]",
        "author": "12daysof",
        "url": "https://www.reddit.com/r/socialskills/comments/11aszue/should_i_27f_trust_the_most_common_views_that_are/",
        "text": "[removed]",
        "created_utc": 1677249741,
        "upvote_ratio": 1.0
    },
    {
        "title": "I consider myself an extrovert, but sometimes I physically cannot start/join conversations. why?",
        "author": "dandy_dandy_dandy",
        "url": "https://www.reddit.com/r/socialskills/comments/11asqnd/i_consider_myself_an_extrovert_but_sometimes_i/",
        "text": "This happens both verbally and over text. When I try to start a conversation either my mind goes blank and I'm totally incapable of thinking at all, or my throat and mouth feels like it's sealed shut and it takes so much effort to make any sort of sound (or if I'm trying to send a DM or join an online chat, I can't type at all because either my hands freeze or my mind is totally empty).\n\nI don't think it's an anxiety thing because I don't feel nervous or shy when I talk (although this does happen more often during serious/stressful talks).\n\nIs there a way to fix this?",
        "created_utc": 1677249054,
        "upvote_ratio": 1.0
    },
    {
        "title": "is anyone ever too busy for their friends?",
        "author": "Disastrous_Purple735",
        "url": "https://www.reddit.com/r/socialskills/comments/11asokp/is_anyone_ever_too_busy_for_their_friends/",
        "text": "if your friend says she’s busy to even hang out with you or answer your text does it mean she’s lying or don’t care.\n\nLike I myself work 10 hour shift each day and go to school but I always, always, always make time for my friend. \n\nlike she never asked to hangout, or FaceTime or call. I remembered one time she said, she thinks it better if I ask because I’m busy but like why not ask. \n\nalso one time I asked her if I could vent to her and she said yeah and when I vented she didn’t even reply. I know venting means to just let everything out but she just like left on read. It’s like she didn’t want to be there but when she wanted to vent about her toxic friends I was there. \n\nI know you don’t know her side of the story but I’ll never get it as well because when I tried to contact her she doesn’t even answer my text. \n\n(sorry if it doesn’t make sense)",
        "created_utc": 1677248905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone says face is the mirror of mind. But my face don't convey the emotions in my mind. My face always have a dull,sad expression. People always misread me as a rude person. I dont know how to control what to show in face",
        "author": "justlivingforsake",
        "url": "https://www.reddit.com/r/socialskills/comments/11asmx4/everyone_says_face_is_the_mirror_of_mind_but_my/",
        "text": "This has always been a problem for me. Everyone thinks iam unapproachable and have sneer expression. But infact i will be anxious in my mind.",
        "created_utc": 1677248782,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked my coworker out for a coffee, Had a good time with her. Got her number",
        "author": "mahijendra",
        "url": "https://www.reddit.com/r/socialskills/comments/11asiw0/i_asked_my_coworker_out_for_a_coffee_had_a_good/",
        "text": "I asked my coworker out for a coffee and, Went out after work today. Had a great time catching up with her. Tales about lot's of stuff. Got her number, What follow up text should I send her? Any advice would be helpful.",
        "created_utc": 1677248481,
        "upvote_ratio": 1.0
    },
    {
        "title": "A friend of mine i havent seen in years invited me to a birthday party. is it weird if I go alone?",
        "author": "thisguyjuly",
        "url": "https://www.reddit.com/r/socialskills/comments/11asgl2/a_friend_of_mine_i_havent_seen_in_years_invited/",
        "text": "I met this girl in 2018 and we talked on and off throughout the years. She suddenly invites me to one of her friends birthday party. None of my friends want to go but a really want to go, is it weird if I go alone? I only know her and i dont want to seem like a weirdo.",
        "created_utc": 1677248307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtual Social Skills Club - Any Interest?",
        "author": "MGH-Coaching",
        "url": "https://www.reddit.com/r/socialskills/comments/11as32m/virtual_social_skills_club_any_interest/",
        "text": "Hey everyone - trying to gauge interest in starting a virtual (Zoom) social skills club.\n\nI'm an experienced Coach/Mentor/Facilitator, and I would love to create an online space where a small group of people can get together and share social skill challenges they're facing, and where we can all help each other out.\n\n**Full disclosure**, I would be charging for membership, but nowhere near the cost of some of the programs out there - I'm thinking something like $20-30/month for 4 meetings/month (some programs cost hundreds per month, or charge you over $1,000 up front).\n\nThoughts/Questions/Concerns?",
        "created_utc": 1677247280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having no friends sucks",
        "author": "leejimmy90",
        "url": "https://www.reddit.com/r/socialskills/comments/11argvt/having_no_friends_sucks/",
        "text": "I'm an off-putting person, so I have no friends, even online. I know it's hard for me to change myself, so I accept that I'm a loner and try to hang out on my own (eating out, watching movies...). Yeah, it's pretty enjoyable &amp; comfortable.\n\nBut sometimes when I go to such public places and see groups of friends socialising with one another, it reminds me of how lonely I am and it hurts. Being alone sucks. And I'm not born as someone who can completely enjoy my alone-ness like those \"stereotypical introverts\". From time to time I do wish I could have friends to talk to like other people.\n\nThanks for reading my rant.\n(sorry for my English)",
        "created_utc": 1677245514,
        "upvote_ratio": 1.0
    },
    {
        "title": "What questions and topics for discussion help to maintain communication at a distance?",
        "author": "RickyDickyDahlia",
        "url": "https://www.reddit.com/r/socialskills/comments/11ardyh/what_questions_and_topics_for_discussion_help_to/",
        "text": "I'm chatting with one girl and sometimes there is quiet days when we don't send anything to eachother. We try to meet halfway and equally suggest topics to discuss but sometimes we just have nothing to say. I like what we have and don't wanna lose it due to lack of life experience and lack of any knowledge in my head.",
        "created_utc": 1677245275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for activities that will place me in social situations (late 20s, M)",
        "author": "Jealousturtle31",
        "url": "https://www.reddit.com/r/socialskills/comments/11aqkax/looking_for_activities_that_will_place_me_in/",
        "text": "I've always been introverted, and lately I've been struggling with getting out and having social interactions. Like probably 5 days a week the only person I talk to is my wife, I almost never see or talk to other people. \n\nOccasionally I'll talk to my neighbor or I'll call my mom, but a couple of these interactions a week aren't very satisfying. I wouldn't say I'm looking for friends per se, I usually prefer to do things by myself or with my wife, but I am looking for ideas for social events where I can meet some people, practice my social skills, bond over a particular activity and have a good time. I've tried attending some local community events, a couple volunteering gigs, and a local tennis club, but in all three situations I was mostly hanging out with people twice or even three times my age. I don't have a problem with that in theory, but it is kind of hard being a late 20's guy in a group of other people who are all the same age. \n\nSo now I'm back to the drawing board. I loved the idea of the tennis club, where you go and occasionally see people you know, sit down and have a chat for a while, maybe play a game. It was a great idea, but the club was kind of exclusive (very cliquey) and also everyone was over the age of 40 except me and one other guy who was never around. So I guess I'm kind of looking for something like this, but with more young people and ideally not that exclusive. Like something where I can see people around, make a few casual friends, etc.\n\nA few things that might be relevant. I don't like following/watching sports at all so that is out of the equation. I will play them casually though. I also don't drink and generally dislike bar/club culture so anything related to that is out as well.\n\nThank you for the help in advance!",
        "created_utc": 1677242736,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 20M and I never know what to say",
        "author": "milleven_",
        "url": "https://www.reddit.com/r/socialskills/comments/11apw9y/im_20m_and_i_never_know_what_to_say/",
        "text": "Like I'd be sitting with strangers or a colleague whom I'm not too familiar with and my brain goes blank, just nothing crosses my mind so I just sit there awkwardly waiting for that interaction to end.",
        "created_utc": 1677240529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Silent Treatment Abuse",
        "author": "sir_tomasu",
        "url": "https://www.reddit.com/r/socialskills/comments/11ap8l8/silent_treatment_abuse/",
        "text": "I just want to hear some other perspective on this relationship of mine. Sorry the long text, some notes in the end. \n\nI've got this thing going, unfortunately, that I gave silent treatment to a friend of mine. I had already done it once to him and we sort of solved it. But I did it again. Of course, this was 1 year ago and I've learned a lot, beginning with what means giving the silent treatment. I think I started this with him (in a deep way) and now I understand what it might weights on him. My reason to do it both times was because I didn't feel like I should say something, I didn't have the \"right\" to complain so I just shut myself off and went away. Of course that dealt enormous problems in him and he is anxious, so everything went off charts... We had a lot of communication problems, specially during covid where we just talked through messages.\n\nRight now, I am outside of the country and it made it easy to live our lives (we never spoke to each other again) but I'll be going back and we share a lot of friends connections in common making it inevitable that we will cross paths again.\n\nHaving in mind that he specifically said that he would never talk to me again if I stopped talking to him one more time after I first gave him the silent treatment, **should I still try to apologize to him?**\n\nI intend to at least apologize to him and help him close the cycle and make him recognize that what I did was emotional abuse (I recognize now) but should I offer the help and explain myself to him?\n\n____________________________\n\n\n(notes: first time I did what I did was because I felt bad with what he did to me but I had no right to lecture him in how to behave towards me, I don't want to feel I control people and he had the willingness to come and talk to me, he gave me the openness for me to explain and he recognized and we sorted things out. Second time I did it because of a misunderstanding (now I recognize) but I felt I was being ignored by him and as a response I just gave up and ignored him back because I felt I was the only one trying ~again (in my head, because he also did in the past), to be friends with him.\n\nBetween these times we had other minor issues because we were both busy and miscommunication happened again and I purposefully ended our friendship because I thought it was the best for both, we agreed. We were really down for a period and I couldn't be ok so we kind of reconciliated by my push, but of course, things were not the same and I had a huge guilt on me.\n\nI'm impulsive and I have intense feelings on things, he has a go with the flow vibe but overthinks somethings)",
        "created_utc": 1677238227,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with sympathy",
        "author": "Fun-Kaleidoscope-616",
        "url": "https://www.reddit.com/r/socialskills/comments/11aogw2/how_to_deal_with_sympathy/",
        "text": "Lets say A member of my family is q.q died around 10 months ago .whenever i have to tell new people that i meet that q is dead ,they feel sympathy towards me  which makes me extremely uncomfortable",
        "created_utc": 1677235328,
        "upvote_ratio": 1.0
    },
    {
        "title": "unsatisfying friendships",
        "author": "zaelan89",
        "url": "https://www.reddit.com/r/socialskills/comments/11ans4f/unsatisfying_friendships/",
        "text": "The older i get the more difficult it seems to maintain good, satisfying friendships. People seem to care less and make good conversation, they couldn't be any less interested. I wonder too if i come off the same way coz i know i can get so absorbed in my own thoughts..",
        "created_utc": 1677232679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feels awkward when they walk in public with empty hands?",
        "author": "henlo_oo",
        "url": "https://www.reddit.com/r/socialskills/comments/11ank91/does_anyone_else_feels_awkward_when_they_walk_in/",
        "text": "[removed]",
        "created_utc": 1677231801,
        "upvote_ratio": 1.0
    },
    {
        "title": "unsatisfying friendships",
        "author": "luces410",
        "url": "https://www.reddit.com/r/socialskills/comments/11anhyv/unsatisfying_friendships/",
        "text": "[removed]",
        "created_utc": 1677231547,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(25)am texting a 21 year old girl who has a baby and has recently split from her husband.She isn't divorced yet.She doesn't wanna see me yet becuase has fear of being seen with another guy until she gets divorced.She said she likes me but not giving me much attention. What do I do?",
        "author": "ImHerzen11",
        "url": "https://www.reddit.com/r/socialskills/comments/11anf8r/i25am_texting_a_21_year_old_girl_who_has_a_baby/",
        "text": "So I started texting this girl roughly about 1 month ago. Ever since, we text each other every day, but we exchange only a couple of messages a day. Every couple of days we talk on the phone but the conversation doesn't last more than 10 minutes. I call her only when she has a break at work. At home she doesn't wanna talk because she lives with her parents and for some reason she doesn't want her parents to hear the conversation.\n\nShe says she has been split from her husband 2 months now, and that she's gonna divorce him legally soon. She said she doesn't love him and won't return to him.\n\nShe told me she likes how I look, my sense of humour and she thinks I'm cute. However, she doesn't give me much attention. She takes 1-2 hours to reply to my messages. During those 1-2 hours she's oftne online on messenger. She admitted other guys text her too.\n\nShe said she doesn't wanna go out with me until she gets legally divorced.\n\nThe bottom line is, I like her, but she obviously wants to take things slow. Would it be a good idea for me to text other girls too? That way I would not focus all my attention on this particular girl. What I'm afraid of is that if I start texting random girls, one of the girls might happen to be friends with this girl that I decribed in this post, and this girl might get angry. Do you think there's a risk of that happening?",
        "created_utc": 1677231237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! What to do with this friend?",
        "author": "Mehcky-Man",
        "url": "https://www.reddit.com/r/socialskills/comments/11andr2/help_what_to_do_with_this_friend/",
        "text": "I don't find her a bad person, and she doesn't always have time for me... I think. But yeah, she's fairly popular and has a lot of friends.\n\nBut everytime I see her talking to some people, I feel a bit jealous because she does treat people differently, like she asks what they're doing and stuff. But as far as I can remember, she has never asked me that and honestly, I don't want to hurt her but I find myself getting petty when she does that around my friends. :/ It's honestly draining for me even though it's not her fault. But I want her to treat me a certain way, but I've had friends leave me because I was draining and sensitive and people have to be careful of what they say as to not hurt me. Her opinion of me is the same as everyone elses though.\n\nI don't know what to do.",
        "created_utc": 1677231062,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(25)am texting a 21 year old girl who has a baby and has recently split from her husband.She isn't legally divorced yet.She doesn't wanna see me yet becuase has fear of being seen with another guy until she gets legally divorced.She said she likes me but not giving me much attention. What do I do?",
        "author": "ImHerzen11",
        "url": "https://www.reddit.com/r/socialskills/comments/11an7aw/i25am_texting_a_21_year_old_girl_who_has_a_baby/",
        "text": "[removed]",
        "created_utc": 1677230335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding it hard to meet and connect with girls",
        "author": "ThrowRA-jeshsb",
        "url": "https://www.reddit.com/r/socialskills/comments/11amntk/finding_it_hard_to_meet_and_connect_with_girls/",
        "text": "[removed]",
        "created_utc": 1677228146,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm never able to talk to a single person...",
        "author": "EquivalentEvent6277",
        "url": "https://www.reddit.com/r/socialskills/comments/11amlbs/im_never_able_to_talk_to_a_single_person/",
        "text": "[removed]",
        "created_utc": 1677227873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it ok?",
        "author": "ShadowSlash__",
        "url": "https://www.reddit.com/r/socialskills/comments/11aml8e/is_it_ok/",
        "text": "I used to learn Korean with a tutor for a long time. But we stopped learning and we haven't spoken in a year. I want to come back to learning now. \nI still have access to the workbook we used to work in, but it has a lot of audio files. I want to ask her if she can send them to me. Is it okay or not? I don't pay her anymore so...",
        "created_utc": 1677227862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friends forgot 2 times my birthday.. why?",
        "author": "diego947",
        "url": "https://www.reddit.com/r/socialskills/comments/11amj29/friends_forgot_2_times_my_birthday_why/",
        "text": "So long story short I'm here asking for some advice.. Not sure if I'm bad at social skills or need to improve\n\nTwo of my best friends (a couple) forgot my birthday two times for two years in a row..\n\nFirst time they completely forgot but then we reconnected after a while and they said sorry that they forgot my birthday. After few months they have sent me a gift.. \n\nThat time I haven't forgot their birthday and sent also a gift the same day of their birthday. It took me a lot of time to create a personalized gift because I do care of my friends \n\nThe second time they forgot my birthday again but they didn't say anything... \n\nSo this year in few weeks it will be my friends birthday and I'm thinking.. Should I say happy birthday to them or not? \n\nBecause they forgot my birthday for two years in a row.. So why should I remember their birthday then? \n\nAre they real friends or not? \n\nWhy do I care so much then? I used to love them but it looks like they don't care \n\nLast time we went out they made fun of me for no reason and made me very uncomfortable \n\nI don't understand why. \n\nAm I the problem? \n\nOr should I just cut them off my life completely and find new friends? \n\nI know it's weird asking this here lol but I'm trying to improve my social skills as well so I'll be happier with great relationships with friends. \n\nI think life is too short to deal with people that don't care about you.. right",
        "created_utc": 1677227616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ways to calm screaming matches?",
        "author": "Exringdong",
        "url": "https://www.reddit.com/r/socialskills/comments/11amijo/best_ways_to_calm_screaming_matches/",
        "text": "What are some good ways to calm down screaming matches as a third party? I'm not the one involved in them, but I have to deal with them regularly and it drives me insane. How do I get 2 assholes to shut the fuck up?",
        "created_utc": 1677227555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone Else Literally Never Had Friends?",
        "author": "PickledMang0es",
        "url": "https://www.reddit.com/r/socialskills/comments/11am40k/anyone_else_literally_never_had_friends/",
        "text": "Throughout high school, I only hung out with two people and they were both toxic and used me as a punching bag to alleviate themselves from their own insecurities, so I don't count them as friends. Other than that, I've literally never had friends. The first time I ever hung out with someone outside of school was when I was 15, and that was with the aforementioned people above so it doesn't really count. I've never experienced going to a birthday party, going to the beach with friends, or even just casually hanging out and talking about anything. I rotted in my room for over a year during the beginning and the middle of the COVID pandemic. It's not like I haven't tried. I'm in a couple of orgs in university but everyone I meet ends up just being casual acquaintances. I feel like I am just one out of million people destined to be alone.",
        "created_utc": 1677225988,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidently blocked my coworkers attempts at conversation",
        "author": "jinkers20",
        "url": "https://www.reddit.com/r/socialskills/comments/11am3gz/i_accidently_blocked_my_coworkers_attempts_at/",
        "text": "My job revolves around taking care of children during after school hours. During work today my coworker made several attempts to begin a conversation trying to find out similar interests and such however I was so preoccupied with the children that I ended up giving really short answers that seem like I didn't really care about what she was saying.  Thing is she is always the one initiating  whether it be asking me to help her with something or joining in the games me and the kids are playing. How do I let her know that I am interested in what she has to say and that I enjoy her company?",
        "created_utc": 1677225929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consistent negative experiences in social settings",
        "author": "brunette_mh",
        "url": "https://www.reddit.com/r/socialskills/comments/11alczh/consistent_negative_experiences_in_social_settings/",
        "text": "I don't know if this is a right sub for this question.\n\nThis is something that has been bothering me from my teenage and it's only recently I have got words together to describe my experience.\n\nI have been consistently getting insulted/made fun of in social settings (group conversations, dinner out with friends, casual office chitchat) for around 17 years now and I have realized this only recently.  \nAnd this happens even before I start talking. Sometimes the conversation has absolutely nothing to do with me but gets directed to me somehow and I am made fun of.\n\n\nSocial settings also include beauty salons, doctor's appointments, shopping. Like all these people have insulted me on my face when I was literally just standing there. \n\n\nI don't understand. It's very hard to ask of I'm doing something wrong to strangers on internet. But still I'd go ahead and ask you guys - what it is that I might possibly be doing wrong to be on the receiving end? \n\n\nI want to know if there are any specific characteristics - body language, dressing, facial expressions that can make someone easy target for bullying.\n\nShould I start being rude to people? But I would suck at being rude. I never have witty replies either.",
        "created_utc": 1677223125,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so rude",
        "author": "QJ8538",
        "url": "https://www.reddit.com/r/socialskills/comments/11akw1m/i_am_so_rude/",
        "text": "People would say hi and I'd freeze and proceed to spend a good minute trying to figure out if they were talking to me or not. Then they'd leave and I come off as extremely rude",
        "created_utc": 1677221323,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if a person likes me and I should keep talking to them",
        "author": "1nkycap",
        "url": "https://www.reddit.com/r/socialskills/comments/11ajy5x/how_do_i_know_if_a_person_likes_me_and_i_should/",
        "text": "I met a friend of an old friend today and texted each other for a few hours. They’re a bit of a dry texter so I can’t tell if they liked me or not and I’m unsure if I should message them again tomorrow because I’m not really good at making friends. We have a lot in common though and go to the same school so it’d be a good idea to message them again right? If so what do I say?? I’m not really good at socializing and I’m honestly a bit nervous to make friends",
        "created_utc": 1677217965,
        "upvote_ratio": 1.0
    },
    {
        "title": "I talk to myself :/",
        "author": "ashleyriot31",
        "url": "https://www.reddit.com/r/socialskills/comments/11ajo91/i_talk_to_myself/",
        "text": "I work nightshifts and so I'm alone most of the time, I think it helps somewhat, I think it's better than talking in your mind the whole night. Anyone else?",
        "created_utc": 1677217026,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate everything about myself and have lost all hope that anything will get better",
        "author": "MC-Mantt",
        "url": "https://www.reddit.com/r/socialskills/comments/11ajep2/i_hate_everything_about_myself_and_have_lost_all/",
        "text": "My social skills are complete crap and I feel so alone. I’m unable to meet people not because I don’t want to but because I can’t hold a conversation for the life of me. I feel like I give off the vibe that I don’t want to talk to people when in reality I’d do anything for a conversation with someone. I have lost the will to do anything productive I don’t know what to do anymore and I have no clue what is wrong with me. I just want someone to talk to.",
        "created_utc": 1677216127,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to text?",
        "author": "Alessandr8n",
        "url": "https://www.reddit.com/r/socialskills/comments/11ajabo/how_to_text/",
        "text": "[removed]",
        "created_utc": 1677215724,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you introduce yourself in new social settings where you don'tknow anyone?",
        "author": "melanatednite",
        "url": "https://www.reddit.com/r/socialskills/comments/11aj90w/how_do_you_introduce_yourself_in_new_social/",
        "text": "Today my professor asked me to go to a luncheon where they would be talking to students in my degree program to ask them how they feel about the program. I had no idea what to expect or what it would be like. I was the first one there and it was in a big hall with lots of tables and some snacks in the front. I grabbed an apple and juice and picked a table then went to the restroom. When I came back there were 2 other students who were friends and sat together and a group of 3 faculty members and a student that sat at another table. They were all 2 tables away from me and were all chatting. I ate my snack and listened to them all talking but no one really acknowledged me. Then the faculty got up so I got up too and ask if this is the whole luncheon or if there would be a speaker (there was a podium set up). They tell me no this is it and that I should have introduced myself to them earlier. \n\nI have social anxiety and am confused because was I supposed to just grab my stuff and sit closer to them and jump into their conversation? I figured that would be bad social manners to do that but now I'm not sure. Exactly what was someone who knew no one supposed to do?",
        "created_utc": 1677215602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if this is a \"sheltered childhood\" but I still feel clueless in a lot of areas.",
        "author": "Some-Restaurant6110",
        "url": "https://www.reddit.com/r/socialskills/comments/11ainvd/not_sure_if_this_is_a_sheltered_childhood_but_i/",
        "text": "To start, I'm an only child. It sucks and sucked growing up. I never had any understanding of what that type of family relationship with someone was like. It was just me and my parents. And because my parents had me later on, I was too young to relate/get along really well with most of my cousins. Most of my cousins lived closer to my grandparents and as such, I felt not as close to my family and have still had issues with being social towards a lot of them.\n\nSchool was really what made me feel sheltered. I went to a super tiny school and graduated 8th grade with under 8 ppl in my grade. It was like under 80 ppl with 8 total grades. A lot of the ppl have turned out fine, but having no siblings/much family interaction mixed with a small school did not help me one bit. This was a very religious school and it felt like I was in this bubble. I was in middle school and had no understanding of the real outside world. I felt like I was led to believe people who didnt practice my religion were all terrible. Gay people were bad it felt like, and I didn't get stuff like racism for a long long time after. I feel stupid looking back.\n\nEverything in my life (with a couple exceptions) was connected to church and religion. Church league basketball scrimmages taught me teamwork, but when I did an actual mini basketball league, i had NO CLUE on any positions, plays, or how to play. I went to church every week, my small number of friends all came from church/my school. When I did outside activities that had no connection to religion, i was lost. Didn't socialize, didn't know what to say. I thought these ppl were these horrible ppl who had bad parents, they were probably just basic teens who would swear.\n\nMy mom was too overprotective in some ways. I was like 8 years old with a car seat, couldn't sit up front until I was like 12. She was way too worried about me and it bugged me. I'm not too mad that I got my first phone at 13, and it was a crappy one. But I could never watch fun disney shows. Any show that was like rated PG, nope couldnt watch for a while. I was watching shows made for 6 year olds when I was 10-13. I was allowed to watch good shows that were about superheroes (if rated TV Y-7) and other animated shows.\n\nGoing to an actual high school (still was a religious one) with way more ppl was horrible for me. Ppl swearing, talking about porn/sex, watching such bad shows like family guy, it scared me. I was silent. Ppl made harmful jokes about me and I took them too far. I didn't understand it.  I got more social over time, but was still saying horrible jokes, and was really pervy it felt like.\n\nI was so clueless about a lot of the real world. Still am. I don't know much about non school-smart things. I got better socially, but I still am very awkward. I can talk to old people just fine but someone my age by myself? Good luck. I've learned religion is very harmful sometimes, and I feel so ignorant and clueless for not knowing basic things sooner.\n\nI'm too nervous to go to some college classes, though that is often due to my mental health. Idk how to cope normally, self h*rm and bottling stuff up became my go to. I wish I was more social around family. I'm afraid to call anyone who isn't my parents or very close friends. I just wish I could have had a more free childhood, it took too long for it to feel normal.",
        "created_utc": 1677213655,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m afraid of being an annoyance.",
        "author": "Significant-Artist54",
        "url": "https://www.reddit.com/r/socialskills/comments/11aiepl/im_afraid_of_being_an_annoyance/",
        "text": "I have a friend, my only friend, and he’s honestly one of the nicest people I’ve met. I however am afraid of being an annoyance. For context, everyday he goes for an hour plus walk and when he’s on it, we voice call. He says he really likes our conversations, but in the back of my head I’m left feeling as though I’m an annoyance. Im not sure why I feel like this, he’s done absolutely nothing wrong, and it’s all me. How do I stop this thinking, it makes me hurt inside?",
        "created_utc": 1677212812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we all agree on here that saying “I need some time/space” and/or “I’ve been dealing with a lot and can’t talk now” is just sugar coating “I never plan to speak to you again?”",
        "author": "huntee85",
        "url": "https://www.reddit.com/r/socialskills/comments/11ai2f4/do_we_all_agree_on_here_that_saying_i_need_some/",
        "text": "\n…”but I’m afraid of being harassed by you trying to change my mind or say something mean about me, so I’m just going to lie to you instead and ghost you if you hit me up again in a year from now because you violated my boundary…yes, one…year…later”",
        "created_utc": 1677211715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else have a deep fear of 1-on-1 interactions?",
        "author": "DistinguishedQube",
        "url": "https://www.reddit.com/r/socialskills/comments/11ai0ed/does_anyone_else_have_a_deep_fear_of_1on1/",
        "text": "[removed]",
        "created_utc": 1677211540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Its my 20th birthday today and my \"friend\" group doesn't care",
        "author": "piruuu__",
        "url": "https://www.reddit.com/r/socialskills/comments/11ahfu7/its_my_20th_birthday_today_and_my_friend_group/",
        "text": "I feel pretty hopeless, I want to make a change in my life but it seems impossible at the moment. I have been hating the way people have treated me everyday in my life. I want to stop being a pushover with people but I just can't seem to stop. Either way I just wanted to vent this out",
        "created_utc": 1677209758,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find topic and start an conversation?",
        "author": "PennyPannaCotta",
        "url": "https://www.reddit.com/r/socialskills/comments/11ah0ba/how_to_find_topic_and_start_an_conversation/",
        "text": "I usually don’t know what to say, how to have a good conversation. I really want some tips",
        "created_utc": 1677208468,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's that saying, something like \"if you don't care, people neither\"",
        "author": "zsfzu",
        "url": "https://www.reddit.com/r/socialskills/comments/11agr4e/whats_that_saying_something_like_if_you_dont_care/",
        "text": "Or \"people start caring only when they realise you do\"?",
        "created_utc": 1677207691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanting to make friends",
        "author": "Indian_girl_001",
        "url": "https://www.reddit.com/r/socialskills/comments/11agqxq/wanting_to_make_friends/",
        "text": "[removed]",
        "created_utc": 1677207678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please tell me why do people feel the need to hold things in and let out during an argument?",
        "author": "Many_Line9136",
        "url": "https://www.reddit.com/r/socialskills/comments/11ag4fc/can_someone_please_tell_me_why_do_people_feel_the/",
        "text": "Are you supposed to watch what you say to not have thrown back in your face?\n\nAre you supposed to make room for an argument or anticipate one? \n\nShould you hold back on how your days go?\n\nShould you not share too much?\n\nIf all these are the case then what’s the point. I don’t understand human beings why do they feel the need to hold stuff in to let it out during an argument. I won’t ever be able to understand nor do I want to. I don’t think it’s right.",
        "created_utc": 1677205824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very useful technique for social anxiety",
        "author": "Expert-Buyer8634",
        "url": "https://www.reddit.com/r/socialskills/comments/11ag1pf/very_useful_technique_for_social_anxiety/",
        "text": "https://youtu.be/zMCtCQRXOBI",
        "created_utc": 1677205598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Socially akward",
        "author": "Curious_OnEarth",
        "url": "https://www.reddit.com/r/socialskills/comments/11ag134/socially_akward/",
        "text": "A lot of the time when I meet someone I vibe with say at work for example. I mostly wait for them to start the conversation. otherwise I feel I come off as to needy or clingy if I start the conversation or go sit with them for lunch or something. I feel like I’m unwanted unless they invite me. Does anybody else feel this way?\n\nA true story to illustrate what I mean. a couple years back when I was working this factory job. I made a small group of friends. At lunch they would invite me to eat with them so I ate lunch with them every day. But for our morning break I would eat by myself. I would want to eat with the group but I felt they would not want me there or I was being to needy or they didn’t invite me to chill with them so I shouldn’t go.",
        "created_utc": 1677205543,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to talk to new people?",
        "author": "not_government_spy",
        "url": "https://www.reddit.com/r/socialskills/comments/11afiho/how_to_talk_to_new_people/",
        "text": "\nA kid just moved from another country and started going to my school less than a month ago. We have one class together, chemistry, and we sit on opposite sides of the classroom. I see him eating lunch alone and he doesn’t talk much. I find it very hard to make friends or be included in things so I tend to notice when other people are experiencing the same. \n\n\nI want to be friends with him, but I have awful social skills myself and I do not really know what is socially acceptable or considered weird to most people. How do people just randomly talk to people? Usually I am never the one to approach other people. I don’t know if he would be comfortable discussing his country because he was forced to flee due to less than favorable conditions (active war zone). \n\n\nWhat should I say and how do I find something to talk about with someone I know nothing about?",
        "created_utc": 1677204042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend who doesn't know when to stop talking",
        "author": "Mertjintje",
        "url": "https://www.reddit.com/r/socialskills/comments/11afely/friend_who_doesnt_know_when_to_stop_talking/",
        "text": "I have a friend who is a good person, but is unintentionally pushy. She's well-meaning, but she keeps giving advice about family and getting my degree, and there's no way out of it. She can't take a hint. When I say \"yeah, maybe, I'll think about it,\" she thinks that means keep talking. When I say, \"I'm going to do it this way instead,\" she thinks that means \"let's debate this.\" When I say, \"this is what works for me, so I'm doing this,\" she goes, \"yeah but I'm just saying,\" and goes around and around with it. I even feel like I'm being blunt, almost rude, but it's not blunt enough. But then if I'm too blunt she might be offended.\n\nI feel like the problem is twofold. One, she isn't socially aware enough to know that you don't give unsolicited advice on people's personal lives. Two, there's a disrespect that comes from talking down. It's not that it comes out of a bad place, but you're not to talk to me that way. It's really difficult between women to be direct with another woman like this, but she doesn't have good nonverbal cues to help soften the blow. Otherwise, she's a good friend.",
        "created_utc": 1677203727,
        "upvote_ratio": 1.0
    },
    {
        "title": "When a girl stares at you and smiles after she finishes her sentence, is that a sign that she wants to end the conversation or doesn't mind talking with you?",
        "author": "Beersz",
        "url": "https://www.reddit.com/r/socialskills/comments/11af6tn/when_a_girl_stares_at_you_and_smiles_after_she/",
        "text": "[removed]",
        "created_utc": 1677203087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for Indoor Adult Party Games?",
        "author": "TriplePlaysandKs",
        "url": "https://www.reddit.com/r/socialskills/comments/11aemn3/ideas_for_indoor_adult_party_games/",
        "text": "Hosting a party with some friends this weekend that don’t really drink alcohol. Looking for some creative games to help make the mood more fun!\n\nIdeally a non-board game/ not something I would have to purchase",
        "created_utc": 1677201505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I text the girl i wanted to text?",
        "author": "SirTunaBey",
        "url": "https://www.reddit.com/r/socialskills/comments/11ae5sl/should_i_text_the_girl_i_wanted_to_text/",
        "text": "[removed]",
        "created_utc": 1677200206,
        "upvote_ratio": 1.0
    },
    {
        "title": "A simple \"happy birthday\" or a birthday message?",
        "author": "ConsReader",
        "url": "https://www.reddit.com/r/socialskills/comments/11adi5w/a_simple_happy_birthday_or_a_birthday_message/",
        "text": "I'm embarrassed I needed to ask this but which is more comfortable for the receiver? I have this friend who I really love and appreciate but I'm afraid she don't even see me as a close friend or smt like that. I want to wish her happy birthday but I might come off as too much if I send her a whole ass message I already prepared. So uh what should I do?",
        "created_utc": 1677198358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Egotistical friend",
        "author": "Competitive_Law_2811",
        "url": "https://www.reddit.com/r/socialskills/comments/11ad6lx/egotistical_friend/",
        "text": "So long story short I have this egotistical friend and he's alright to be around but whenever we play val comp he has such a bad mental and  ruins the fun for me. He's always on about how his team sucks and how stuff like that. Funny thing is that he's playing with bronze's and silvers which is has some fairly new players. \n\nI'm bronze 3 and even though he doesn't directly say it to me, him saying his team sucks, and how are we losing, and other toxic and criticizing things, it annoys me so much because no one wants to hear you complain all game, and if you're so good why aren't you out of the rank you're in.\n\nAnyways, I'm wondering if I should stop playing with him, or tell him to work on his mental. Because these past couple weeks have made me not want to touch Valorant because of the bad vibes he gives. I've also tried to tell him in the past but I think his ego is too massive or something lmao.",
        "created_utc": 1677197496,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your mood right now?",
        "author": "Suhngie",
        "url": "/r/Peeled/comments/11acmm6/whats_your_mood_right_now/",
        "text": "",
        "created_utc": 1677197298,
        "upvote_ratio": 1.0
    },
    {
        "title": "my friend suggested we hang out",
        "author": "milleven_",
        "url": "https://www.reddit.com/r/socialskills/comments/11ad0aj/my_friend_suggested_we_hang_out/",
        "text": "So a friend of mine suggested that I go out with him and his group of friends, non of which I ever met before, now there are two things that worry me here, one is as I said before I never even met them before, so I'm somewhat anxious about that, and the other is I feel like I'm a burden here, as if he just threw that suggestion by way of us talking.",
        "created_utc": 1677197028,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm going to a welcome gathering of a university club today -- any advice?",
        "author": "Edgedancr",
        "url": "https://www.reddit.com/r/socialskills/comments/11acv4s/im_going_to_a_welcome_gathering_of_a_university/",
        "text": "So I'm a second year international student at university, and my main goal for this semester (other than to pass my classes, ofc) is to actually make friends. Last year I've made none. My first step in this endeavor is to join a club, specifically the student association of international students from my home country, since I figured it'd be much easier to start out by making friends with people from similar backgrounds. I was supposed to do this last year; in fact, I did sign up for the club, but I skipped out on all the events due to social anxiety.\n\nI'm REALLY nervous about the meeting. My social skills have not recovered from Covid isolation, so I'm looking for some tips as to how I can make a good impression, and possibly make a few friends.\n\nSome of the things I'm most anxious about are:\n\n1. That I'll be the only one in the meeting who went alone, without any friends.\n2. Apparently there'll be games and ice breakers... I never know what to say at these things.\n3. That I'll come across as boring or uninteresting",
        "created_utc": 1677196673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm going to a welcome gathering of a university club today -- any advice and tips?",
        "author": "Prestigious_Drive955",
        "url": "https://www.reddit.com/r/socialskills/comments/11actj4/im_going_to_a_welcome_gathering_of_a_university/",
        "text": "[removed]",
        "created_utc": 1677196548,
        "upvote_ratio": 1.0
    },
    {
        "title": "I struggle to connect to people and I want to meet new and better friends",
        "author": "Evening-Teaching-733",
        "url": "https://www.reddit.com/r/socialskills/comments/11acs3l/i_struggle_to_connect_to_people_and_i_want_to/",
        "text": "Ive never struggled to make friends, sort of, but all of my friendships feel very surface level and more like acquaintances. I get invited out, but never as a 1 on 1. I have friends that constantly stay the night at other friends houses or seem inseparable from another. I just want something like that. But anytime that I meet somebody new, we never seem to talk again. I started photography and I talk a lot to one of the people there as we have a lot in common, but it diesnt go any further. We just talk at photography. If I didnt have any friends from years ago who introduced me to new people, id be alone.Im in my 3rd year of university and havent met anybody new, besides a friend that my other friend met, and I suspect that im being replaced. I dont want to be alone next year. I just want to meet new friends that I feel close to. Im just not sure how to meet new people and really connect with them, not just hold a conversation.",
        "created_utc": 1677196443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reconnecting After Depression",
        "author": "wolf_chow",
        "url": "https://www.reddit.com/r/socialskills/comments/11acqno/reconnecting_after_depression/",
        "text": "I (29M) have struggled with depression most of my life and was deeply traumatized by school. My depression comes and goes, and on those special days I don't have it I feel like a superhero; I have great conversations, my jokes land, and generally everything feels easy. Unfortunately, after working the same job for a while, I inevitably have depression bouts that last a few weeks where I don't really talk to people much, and when they do talk to me I respond awkwardly and don't get/make jokes. It's like my sense of humor dies and I become an empty robot going through my day. The depression eventually passes, but after this happens people treat me differently.\n\nI've been at my job long enough to go through a few of these cycles and it's become very bad for me because I can see how connected everyone else is and I feel like a total outsider. When I join a conversation half the time people immediately walk away, and often when I talk everyone just ignores me, even if the conversation is about something I'm into. Idk what to do to reconnect with people, and the lack of connection makes the depression worse and more frequent. I feel trapped. I want friends but I feel like it's not fair to impose myself on people when I'm eventually not going to be able to show up for them when my depression gets bad.",
        "created_utc": 1677196332,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got invited to a pool party which has bring your own alcohol. How much should I bring?",
        "author": "jimmytimma",
        "url": "https://www.reddit.com/r/socialskills/comments/11acmie/i_got_invited_to_a_pool_party_which_has_bring/",
        "text": "The party’s has probably around 14 people coming. \nShould I bring a box of 24 or is that too much?",
        "created_utc": 1677196022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to not text a friend all week but still hang out on the weekends?",
        "author": "OPKatakuri",
        "url": "https://www.reddit.com/r/socialskills/comments/11ackak/is_it_normal_to_not_text_a_friend_all_week_but/",
        "text": "I want to reach out to them during the week but I feel that maybe I'll be a burden or something. We still hang out every weekend so that's always fun to look forward to. \n\nJust wondering if anyone else experiences something similar where there is no contact the whole week yet you always meet up at the end of the week or so. I'm a big texter and maybe they're not or maybe they just don't want to text me in particular for one reason or another. I'm also an overthinker.",
        "created_utc": 1677195859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I contact this guy for having dinner?",
        "author": "wonderfulme203",
        "url": "https://www.reddit.com/r/socialskills/comments/11acc0l/should_i_contact_this_guy_for_having_dinner/",
        "text": "[removed]",
        "created_utc": 1677195246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time to get out of the comfort zone!",
        "author": "Davoshy",
        "url": "https://www.reddit.com/r/socialskills/comments/11abzb4/time_to_get_out_of_the_comfort_zone/",
        "text": "\nHi folks, I got way too comfortable being alone/isolated during the pandemic and with moving to a different country I reached new levels of shyness (over 9000!). It seems like my social skills have been suffering over this long period of time, because I spent too much time being in my own thoughts. Mostly feeling socially awkward or worried about social gatherings that ultimately I started avoiding social contact.\nBut I am on my journey on self-improvement and also wanting to start my own project/start-up to make this world a better place. And to be a great leader I need to be great with people and feel comfortable being around different people! So here I start and set myself up with this challenge:\nTalk to 66 strangers until 6/6/2023 (Birthday Challenge!)\nI figured I should start to play the numbers game, practice practice practice. And out of those 66 strangers, I am sure that some interesting connections will be made\nTo get this thing done I was thinking to do most meetings online via zoom, but I’d also be open to meet in person for coffee or any activity (once I reached some confort level lol) I am located in Fountain Valley, California.\nI Set up a calendly, so anybody who just wants to talk, about anything really - just book a 30 min call under this link with me:\nhttps://calendly.com/david-doan1989/challenge-talk-to-100-strangers\n\nI am David, 33 years old - male. Moved from Germany(Berlin) a year ago, just took a selfie for you 😅. That should be enough, we can talk over anything else in our meeting :)\nLooking forward to talk to anybody!\nCheers!",
        "created_utc": 1677194358,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with the fear of abandonment?",
        "author": "pootishedj",
        "url": "https://www.reddit.com/r/socialskills/comments/11abm68/how_do_you_cope_with_the_fear_of_abandonment/",
        "text": "[removed]",
        "created_utc": 1677193425,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello! i’m not sure how to word this title but i just want some advice",
        "author": "theoo2023",
        "url": "https://www.reddit.com/r/socialskills/comments/11abhvq/hello_im_not_sure_how_to_word_this_title_but_i/",
        "text": "[removed]",
        "created_utc": 1677193146,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I could find a partner / friends with grey hairs",
        "author": "insan3710",
        "url": "https://www.reddit.com/r/socialskills/comments/11ab2fr/how_i_could_find_a_partner_friends_with_grey_hairs/",
        "text": "[removed]",
        "created_utc": 1677192076,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel as if my confidence and self-esteem did not grow as much as I thought it did and I am trying to improve it.",
        "author": "firm_1101",
        "url": "https://www.reddit.com/r/socialskills/comments/11aaz54/i_feel_as_if_my_confidence_and_selfesteem_did_not/",
        "text": "[removed]",
        "created_utc": 1677191853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gaining back confidence and self esteem",
        "author": "firm_1101",
        "url": "https://www.reddit.com/r/socialskills/comments/11aaxfb/gaining_back_confidence_and_self_esteem/",
        "text": "[removed]",
        "created_utc": 1677191734,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so weak",
        "author": "IDKog",
        "url": "https://www.reddit.com/r/socialskills/comments/11aatbz/im_so_weak/",
        "text": "[removed]",
        "created_utc": 1677191461,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so weak",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677191283,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm really dumb",
        "author": "IDKog",
        "url": "https://www.reddit.com/r/socialskills/comments/11aanxo/im_really_dumb/",
        "text": "[removed]",
        "created_utc": 1677191091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think it would be a good idea for me to post in a local Facebook group asking if anyone wants to go to a bar with me?",
        "author": "Leftshoulderguy",
        "url": "https://www.reddit.com/r/socialskills/comments/11aanis/do_you_think_it_would_be_a_good_idea_for_me_to/",
        "text": "[removed]",
        "created_utc": 1677191063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to a club my friend belongs to and doesn't seem to want me at?",
        "author": "CableLate3582",
        "url": "https://www.reddit.com/r/socialskills/comments/11aah78/going_to_a_club_my_friend_belongs_to_and_doesnt/",
        "text": "[removed]",
        "created_utc": 1677190630,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to cut someone off but I’m afraid I will be painted as a villain",
        "author": "Delicious-Abroad-614",
        "url": "https://www.reddit.com/r/socialskills/comments/11aaaz3/i_need_to_cut_someone_off_but_im_afraid_i_will_be/",
        "text": "There is someone who I feel uncomfortable around and cannot continue to be friends with. Im going to break off the friendship when the semester ends. We used to be close and would talk every day, and we go to school together. I realized later that this person tends to make me uncomfortable in ways that no friend ever has before. We have a lot of mutual friends and even a friend group and I’m afraid that when I cut him off he will paint me as a villain or a bad person to our mutual friends (he’s done this before) and they’ll lose contact with me. I’m not very social and I don’t frequently keep in touch with this friend group so I don’t know how I would get to explain it to them. They’re closer to him than to me. Is it worth it to try to keep in contact with this friend group? I have friends outside of this group, but I do like the others of the group. It would just honestly just be a little upsetting to see them go on with this person without me because I did have fun with them",
        "created_utc": 1677190193,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to talk about with people?",
        "author": "Successful-Fun7540",
        "url": "https://www.reddit.com/r/socialskills/comments/11aa5n7/what_to_talk_about_with_people/",
        "text": "I don’t know what to talk about with people, not even my mom. I don’t have any friends. I spent a lot of time alone and lost my social skills.\n\nWhen I talk to people my mind goes blank and there is a lot of awkward silence. I have no idea what to talk about.\n\n Any advice?",
        "created_utc": 1677189833,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stay in touch with friends?",
        "author": "O_OniGiri",
        "url": "https://www.reddit.com/r/socialskills/comments/11a9v0i/how_do_you_stay_in_touch_with_friends/",
        "text": "Hi there! \n\nMy name is Aaron and I'm studying at San Jose State University. For my final project, I want to learn about how people stay in touch with their friends. It's important for me to do this project well so I can graduate.\n\nIf you're willing to help, I would really appreciate it if you could take part in a 30-minute interview with me. To make sure you're eligible, please fill out the form below:\n\n[https://sjsu.qualtrics.com/jfe/form/SV\\_cAMG7sHG6Dropds?Q\\_CHL=social&amp;Q\\_SocialSource=reddit](https://sjsu.qualtrics.com/jfe/form/SV_cAMG7sHG6Dropds?Q_CHL=social&amp;Q_SocialSource=reddit)\n\nIf you have any questions, please don't hesitate to DM me.\n\nThank you for your time and help!",
        "created_utc": 1677189123,
        "upvote_ratio": 1.0
    },
    {
        "title": "I say less than 50 words a day and sometimes I don’t speak at all. How can I improve my speaking and communication skills?",
        "author": "Introvertedwin",
        "url": "https://www.reddit.com/r/socialskills/comments/11a8taw/i_say_less_than_50_words_a_day_and_sometimes_i/",
        "text": "As the title says. I barely speak to anyone, and with the exception of phone calls from my family, I don’t speak at all. This make my speaking skills really weak, and sometimes I talk like a baby learning how to speak for the first time. Even my family have hard times understanding me sometimes, and I’m honestly tired.",
        "created_utc": 1677186517,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I deal with someone insulting me behind my back as a sensitive women?",
        "author": "PurpleLarkspur00",
        "url": "https://www.reddit.com/r/socialskills/comments/11a8maw/how_can_i_deal_with_someone_insulting_me_behind/",
        "text": "Hi everyone,\n\nA neighbour of mine (male) who I barely know, meaning I never spoke to him and only saw him a few times before, is saying really bad things about me to other people behind my back. \n\nMost of the things he says are lies or half truths but they are very nasty and insulting. It seems like he is just making assumptions about me and running with them. \n\nI recetly saw him again a few times when walking my dog and he ignored me and kind of tried to hide from me. \n\nI’m hurt by the whole situation. \n\nI was wondering if you guys have any advice on how should I deal with this?\n\nWhat would you do, confront the person or move on?\n\nIf you have even been in a similar situation What did you do?",
        "created_utc": 1677186051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social screw ups.",
        "author": "13Nobodies",
        "url": "https://www.reddit.com/r/socialskills/comments/11a8jbj/social_screw_ups/",
        "text": "I think allowing room for error, mistakes, discomfort is as much apart of improving social skills as any other aspect. Does it bug anyone else when people allow some of these things to stop a conversation dead in its tracks?",
        "created_utc": 1677185865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do some people not realize they're talking over?",
        "author": "partyFreek2",
        "url": "https://www.reddit.com/r/socialskills/comments/11a8eq2/do_some_people_not_realize_theyre_talking_over/",
        "text": "So this ''friend'' of mine keeps talking over me, makes me feel like shit... Invisible too. \nI have tried not stoping my speech and speaking louder as she cuts but this girls grabs all the attention and I eventually have to shut up.\n\nI have tried stoping abruptly mid-speech as soon she starts cutting but hey! She continues her talk as if I never made a sound. \n\nConversations with my friends, I feel excluded.",
        "created_utc": 1677185553,
        "upvote_ratio": 1.0
    }
]