[
    {
        "title": "question about agile",
        "author": "mbrseb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zxx8ul/question_about_agile/",
        "text": "[removed]",
        "created_utc": 1672292775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a tool to orchestrate HTTP calls? Similar to Camunda?",
        "author": "TowardsBetter2morrow",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zxgozb/is_there_a_tool_to_orchestrate_http_calls_similar/",
        "text": "Looking for a tool that will let me fire a bunch of apis in sequence or in parallel with some configuration.",
        "created_utc": 1672251502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I register for CEng after completing \"Computer Science and Electronic Engineering MEng\" &amp; after working as a software engineer.",
        "author": "Dazzling-Shop5019",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zxbglh/can_i_register_for_ceng_after_completing_computer/",
        "text": "I will be completing this Integrated MEng Degree at Liverpool: [Computer Science and Electronic Engineering MEng](https://www.liverpool.ac.uk/courses/2023/computer-science-and-electronic-engineering-meng) accredited by the [IET](https://www.theiet.org/).\n\nAfter the degree I plan on working as a Software Engineer, my question is can I apply and successfully qualify as a CEng or do I have to work as an electronic engineer to be able to qualify for a CEng.\n\n&amp;#x200B;\n\nI am asking this as the information on the website was quite confusing.\n\n&amp;#x200B;\n\nThank you in advance!",
        "created_utc": 1672239092,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am getting crazy because of this",
        "author": "builder_jt",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zx3tae/i_am_getting_crazy_because_of_this/",
        "text": "So I always wanted to become a software engineer even before I saw what it earned.\n\nBut now I am older and know it pays a lot, but I live in the Netherlands and I really want to know what I am up to in the future: cars, house, luxurious in my live.\n\nSo can anyone indicate the amount someone with a cs degree and maybe 5 years of experience earns in Amsterdam?\n\n(I know I bother a lot of you by asking)",
        "created_utc": 1672213726,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI for Software Development: Can Machines Write Good Code?",
        "author": "Veerans",
        "url": "https://bigdataanalyticsnews.com/ai-for-software-development/",
        "text": "",
        "created_utc": 1672211315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that wrong to put libraries in all projects considering clean architecture?",
        "author": "moareddit0",
        "url": "/r/softwarearchitecture/comments/zwwoq1/is_that_wrong_to_put_libraries_in_all_projects/",
        "text": "",
        "created_utc": 1672191519,
        "upvote_ratio": 1.0
    },
    {
        "title": "England based university exam for computer science for year 2 on: software engineering, database and structures, Algorithms data structures and probability matrices. anyone confident that they can do well in them?",
        "author": "007_eric",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zww913/england_based_university_exam_for_computer/",
        "text": "",
        "created_utc": 1672190259,
        "upvote_ratio": 1.0
    },
    {
        "title": "What pay (if any) should I expect for Internship?",
        "author": "jabronisauce138",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwpvzg/what_pay_if_any_should_i_expect_for_internship/",
        "text": "Currently doing online school for JS, HTML, and CSS, and optimistically looking to apply for internships soon. What kind of pay should I expect/aim for? I'm located in Charlotte, NC and am very new to this whole situation, but eager/nervous for the outcome.",
        "created_utc": 1672174496,
        "upvote_ratio": 1.0
    },
    {
        "title": "I NEED HELP please recommend.",
        "author": "Invincible_N",
        "url": "https://www.reddit.com/gallery/zwpbcj",
        "text": "Just talked to someone from SNHU.its completely online but what puts me off kind of is it says computer science first.it says the main focus is software engineering and its a software engineering degre on the white page photo.its 38,400 for the degree (320$/120 credits) and i wanna know if you guys know any better colleges i can get a degree from?They also told me there are not that much live lectures from instructors.my LAST question is…is there a difference between software development and and engineering??i hear both there is and its not really a difference.",
        "created_utc": 1672173112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are government agencies, or laws, preventing airlines from upgrading their internal software?",
        "author": "kingcammyg",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwodg3/are_government_agencies_or_laws_preventing/",
        "text": "After this whole Southwest Airlines situation blowing up the internet, someone inside the company shared that it was because their crew scheduling software went “belly up”. It sounds like the software is very old, and likely fragile. \n\nIs the FAA or some other agency limiting airline companies from improving their software? Are there laws making it more difficult to innovate on the software side? I know airlines have made great progress in autopilot for planes, so they must have a lot of wiggle room.\n\nI ask because it’s curious how there hasn’t been any sort of service developed for these airlines to just consume. Handling scheduling data for ~1 million flights per year per airline is not too crazy, and simplifying the process for scheduling on its own could save airlines on headcount cuts.",
        "created_utc": 1672170803,
        "upvote_ratio": 1.0
    },
    {
        "title": "SANE over SOLID",
        "author": "SaneJimmy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwnyyz/sane_over_solid/",
        "text": "[removed]",
        "created_utc": 1672169803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too late to switch to SWE?",
        "author": "MrBulldog25",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwnr1n/too_late_to_switch_to_swe/",
        "text": "Hi everyone!\n\nHope you all are doing well.  In short, I'm a sophomore at Yale who was pretty dead-set on going the IB/Finance route, but I'm having a lot of second thoughts.  I took my first CS class this fall and really liked it, and I'm starting to think the SWE route (or another career in tech) might be more suitable for me.  I only know how to program in Racket right now, but I'm a motivated self starter that can learn a lot about something in little time if interested, and I've always been very quantitatively inclined.  I'm currently majoring in Econ + Math (joint major) but I can easily switch that to CS + Math.\n\nWhen do apps for SWE internships start?  I have to start applying to banking very shortly, so I'm kind of hoping it's not also super early, but some things I've seen online indicate that the applications for Summer 2024 come in early fall of '23.\n\nThank you all!",
        "created_utc": 1672169269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Development Lessons from Brewing 100 Pour-Over Coffees",
        "author": "Annual-Material-8040",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwhfrs/software_development_lessons_from_brewing_100/",
        "text": "Today I used the last filter in the 100-pack of filter papers and took a moment to reflect on this wonderful journey of brewing pour over coffee using a Hario V60. There are several lessons learned over the past 3+ months of brewing coffee and I could draw some parallels to my experience developing software.\n\nhttps://vibhor.dev/software-development-lessons-from-brewing-100-pour-over-coffees-a301f575390f",
        "created_utc": 1672152995,
        "upvote_ratio": 1.0
    },
    {
        "title": "bitcask-rb: A Log-Structured Hash Table for Fast Key/Value Data",
        "author": "dine-ssh",
        "url": "https://github.com/dineshgowda24/bitcask-rb",
        "text": "",
        "created_utc": 1672151730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Development Cost Calculator | Estimate your App Development Cost",
        "author": "creolestudios",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwd26j/software_development_cost_calculator_estimate/",
        "text": "Are you curious to know how much your software development will cost? Well, that’s an ideal and common question for every entrepreneur, startup owner, and business to know to ensure the worth of their idea. Having a project idea and want to convert them into reality then this [**free software development cost calculator**](https://medium.com/@creolestudios/cost-calculator-tool-for-software-and-mobile-app-development-eaa70db94f86?utm_source=reddit&amp;utm_medium=bookmarking&amp;utm_campaign=software_cost_calculator) can help them to determine the immediate cost of their app/software development.",
        "created_utc": 1672138705,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i or should i don't",
        "author": "Imaginary_Brother291",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zwbpq2/should_i_or_should_i_dont/",
        "text": "I got an offer letter from cognizant for international voice process, I've done b.tech in computer science have less than 6.5 cgpa also my 10th and 12th marks are less than 60% I'm trying a lot to get a job in software domain but unfortunately not getting it, should i wait for opportunities or should i join this company for voice process?",
        "created_utc": 1672133384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eliminate OTT Platform Flaws with Quality Engineering",
        "author": "AmbitiousAntelope850",
        "url": "https://www.impactqa.com/blog/eliminate-ott-platform-flaws-with-quality-engineering/",
        "text": "",
        "created_utc": 1672120794,
        "upvote_ratio": 1.0
    },
    {
        "title": "HAPPY HOLIDAYS, X2 2022/2021 EMV SOFTWARE TUTORIAL 2022/2021 X2 PACK TELEGRAM GROUP: http://t.me/thegriot001 INCLUDES ATR TOOLS APDU TOOLS CARD INITIALIZE TOOL X2 2022/2021 CARD VALIDATOR SOFTWARE JCOP ETC. TAP IN ASAP FOR A HOLIDAY DISCOUNT!!!",
        "author": "Jonnsnoww001",
        "url": "https://v.redd.it/1v2wlu37jb8a1",
        "text": "",
        "created_utc": 1672093602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roadmap to becoming a successful Software Engineer?",
        "author": "Ambitious-Frame-6766",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zvyq7g/roadmap_to_becoming_a_successful_software_engineer/",
        "text": "\nI'm a 21 year old Male currently working in the auto industry. Recently, i've gotten the itch to get out of it &amp; make a better life for myself.\nI have always had an interest in Software and know C++, Java, &amp; am learning Python. I am looking at going to school for a four year degree. \n\nMy question(s) are: \n1- What can I do now to help my success down the road, especially in such a seemingly intimidating field.\n2- Looking back, what would you guys do differently? Is there anything you wished you explored or tried that you didn't?\n\nAny and all information is appreciated, I am pretty clueless so any direction would help.\n\nThanks everyone",
        "created_utc": 1672093468,
        "upvote_ratio": 1.0
    },
    {
        "title": "DOWNLOAD SOFTWARE PC 2022 | dnztvofficial",
        "author": "CharmingGazelle6524",
        "url": "https://www.dnztvofficial.com/download-software-pc-2022",
        "text": "",
        "created_utc": 1672093152,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the hardest part about relationships with women as a male programmer?",
        "author": "ekchatzi",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zvw8cn/whats_the_hardest_part_about_relationships_with/",
        "text": " Hey reddit, I am working on a project and am curious about everyone's thoughts about the hardest thing for programmers when in comes to women and dating",
        "created_utc": 1672086986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opportunities for a sociology graduate with sales and teaching experience",
        "author": "nmaximovich",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zvsyvf/opportunities_for_a_sociology_graduate_with_sales/",
        "text": "Hey!! \n\nSo I know a lot of software developers lack soft skills and whatnot. I’m trying to get into software development next year but my only jobs have been sales positions and an ESL position in Kazakhstan.\n\nHow can I talk myself up from here in a hypothetical interview?\n\nDo tech companies want people with a social edge for specific roles? \n\nI’m trying to get math prerequisites down for things like machine learning. Would it help to get google’s project management certification?\n\nThanks!!",
        "created_utc": 1672078289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations regarding hiring a professional resume writer?",
        "author": "alireza29675",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zvnmfw/any_recommendations_regarding_hiring_a/",
        "text": "Hey, Reddit community!\n\nI'm a Senior Frontend Developer looking to revise my resume/CV professionally. Has anyone here worked with a resume writer to improve their resume?\n\nIf yes: what's the best person/company to go to for rewriting my resume/CV in ATS and giving me the best feedback in my specialty? What should I expect from them, and what should I not expect?\n\nAny advice, experiences, or tips would be greatly appreciated. Thanks!",
        "created_utc": 1672062941,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use JMeter non-GUI mode to run tests",
        "author": "men889",
        "url": "https://www.blazemeter.com/blog/jmeter-non-gui-mode",
        "text": "",
        "created_utc": 1672044012,
        "upvote_ratio": 1.0
    },
    {
        "title": "No code computer vision AI platform",
        "author": "darkapostle666",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zvhfmu/no_code_computer_vision_ai_platform/",
        "text": " What are your thoughts on building a no-code image analysis/ computer vision platform. One where people can import images and label images to train their own deep learning/AI platforms through labeling as well as do more of the traditional computer vision work such as color spaces, CLAHE, etc? Then create a type of workflow that will automate this for an image/ set of images without writing any kind of python or c++ code? It has been my idea for a while to develop something like this for researchers or even for companies? Is there a potential market for this kind of software? Even expanding it to DICOM?",
        "created_utc": 1672038134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reflecting question",
        "author": "RuFuckingK1ddingMe",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zva9r4/reflecting_question/",
        "text": "At which point software engineering became people engineering?",
        "created_utc": 1672013221,
        "upvote_ratio": 1.0
    },
    {
        "title": "in order to become a successful software engineers. Did you go to college of coding Bootcamp for a trade?",
        "author": "yourloserdree",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zv7b44/in_order_to_become_a_successful_software/",
        "text": "",
        "created_utc": 1672004232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech Jobs Compensation Survey",
        "author": "NobileTech",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zv3ggi/tech_jobs_compensation_survey/",
        "text": " **If you are a senior in college who already received a job offer or a recent grad who recently began working, please fill out this form. Trying to collect data for a study about how recent tech layoffs and the overall market conditions affected compensation in the industry.**  \n\n\n[forms.gle/Asmqq3o2bfRpVCCR8](http://forms.gle/Asmqq3o2bfRpVCCR8)  \n\n\n**Please help us out it only takes 1 minute to fill out and would be a great help. Thank you!**",
        "created_utc": 1671992571,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you make a pseudocode for booking a cab!!",
        "author": "Dear_Kick_7551",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zuwypi/can_you_make_a_pseudocode_for_booking_a_cab/",
        "text": "[removed]",
        "created_utc": 1671970134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech culture in Chennai",
        "author": "futile_but_alive",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zut5pa/tech_culture_in_chennai/",
        "text": "I'm a Chennaite and a Software Engineer at Chennai. What I see is, here most of the people are workaholics, working day and night like there's no tomorrow. And majorly there's no software dev culture (like flexible timings, no mandatory swipe in/swipe out, general shift, less micromanagement, no dress code) prevailing here as we observe in Bengaluru. There are moderate to major differences in work culture between Chennai and Bengaluru branches even for the same company (even product companies) [There may be very few exceptions and I would like to know more on it]. Since Chennai is majorly a manufacturing hub, I feel, a similar production factory kind of work culture and slave mindset is propagated into the Chennai IT corporates (which is mostly composed of service-based companies) too. \n\nI'm a hard worker but I can't be a slave or a workaholic anyday. Also, people here often want information on your personal life or opinions about other people so that they can judge you and then play politics accordingly. But I can't compare and comment on this aspect with other city, since I haven't experienced it long enough. Is Chennai meant only for factory culture or IT support culture?\n\nAny insights on this?",
        "created_utc": 1671953129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are no internships available?",
        "author": "kselight",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zus7et/why_are_no_internships_available/",
        "text": "Hello,\n\nI  am originally from Germany. I completed a dual study program in Germany  as an IT specialist with business informatics. After that I worked as a  fullstack developer for 1 1/2 years.\n\nI  am currently in the USA as part of an exchange program. Through the  exchange program I have a J-1 with work permit. The program consists of a  study part and a workphase(full-time job/internship). The work phase  should be in the subject area. The job has to be paid and should be 40  hours per week. The intended time slot is from 16th January until 16th  June.\n\nI have already sent over  100+ applications to companies. Most companies don't answer at all and  if there is interest it fails because of my visa. Also, many companies  only offer internships during the summer.\n\nI don't know what to do anymore to find an internship.\n\nDo any of you know companies/people that offer internships from January to June?",
        "created_utc": 1671949057,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become a software engineer?",
        "author": "qingqunta",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zuqfcq/how_do_i_become_a_software_engineer/",
        "text": "Hi. I'm writing to y'all for some guidance. I've been looking for a job in software engineering over the last month, and while I've gotten far in the interviews I've done so far, it always falls apart for me when I reach technical interviews on pure software engineering. I can easily handle programming interviews, I do LeetCode exercises frequently and do well at them.\n\nNow, this isn't really surprising. I just recently finished my masters in mathematics, focusing on theoretical CS. Over that period I've dealt with a fair amount of programming languages, mostly C, Java and Python. I understand the basic data structures quite well, such as stacks, hash tables, queues and trees. Some variants of these are more complex, but I can generally implement them in a timely manner in one of the aforementioned languages. I have a solid understanding of time/space complexity as well, due to my background. I'm not super comfortable with OOP theory questions, but in practice it's fine.\n\nMy real problem lies with software engineering, as I've never had a class on this. Things like patterns, software design... I guess it does sound stupid to look for a SW engineering job while failing at SW engineering questions. But, I like the area and I don't really see myself doing something other than this. What advice do you have for someone with a background like mine?",
        "created_utc": 1671942084,
        "upvote_ratio": 1.0
    },
    {
        "title": "make a pseudocode for booking a cab",
        "author": "Dear_Kick_7551",
        "url": "https://i.redd.it/jw6yk71nxy7a1.png",
        "text": "",
        "created_utc": 1671941070,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've got an idea for a startup but I need some more information from a software engineer.",
        "author": "Jaxthestone",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zuprd8/ive_got_an_idea_for_a_startup_but_i_need_some/",
        "text": "Would it be possible for AI algorithms to match people with similar interests and backgrounds? Could this be used for a social media platform?",
        "created_utc": 1671939529,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are large Java projects structured efficiently? I used to believe the OOP hate was just to be different, but I think I hate OOP…",
        "author": "Slow-and-low",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zuns8d/how_are_large_java_projects_structured/",
        "text": "I used to think Java’s boilerplate was part of its super power. I used to think inheritance and abstract classes were super powers. \n\nI no longer think that. How does a Java engineer avoid closely coupling their code with the use of abstract classes or inheritance? No real large project is not essentially using a version of Scala’s cake pattern. functions are put in classes they don’t necessarily need to be in if you try to cut corners on S.O.L.I.D principles for less boilerplate. If you follow S.O.L.I.D you have so much boiler plate and basically have to completely ignore D.R.Y unless you want to take the risk of using a generic. I have been using dependency injection, but the need to add a library to bend the language to achieve something so simple is ridiculous. \n\nI have begun using composition to decouple my classes, but I’ve run into a new problem, the abundance of parameters on a larger function, and the need to pass so many variables into each class. \n\nCan someone show me an example of good, decoupled clean java code that does not use spring or some other DI framework?",
        "created_utc": 1671932141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Computer Science not really taught anything about Software Engineering?",
        "author": "Beautiful_Semantics",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zum3xw/are_computer_science_not_really_taught_anything/",
        "text": "A conversation that I had with some co-workers recently popped in my head recently.  We were talking about our schools' computer science programs, and I brought up the fact that I had to take a Software Engineering class in college.  I also described the stuff that I learned (how to draw up an architecture, design patterns, how to gather requirements from stakeholders, etc), and my co-workers said that they didn't learn any of that at their colleges.\n\nIt made me wonder if that's a common thing or if I'm just hanging out with aberrations.",
        "created_utc": 1671926358,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is some screenshots of the software I developed with flutter",
        "author": "fatihdemirag",
        "url": "https://www.reddit.com/gallery/zulgao",
        "text": "",
        "created_utc": 1671924196,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the steps to becoming a successful software engineer?",
        "author": "viploven1",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zulbkm/what_are_the_steps_to_becoming_a_successful/",
        "text": "i want to pursue being an engineer, i dont know where to start,should i go to a college,trade school,or coding bootcamp....",
        "created_utc": 1671923781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hardest Part About Onboarding At New Company?",
        "author": "Cool_Statistician558",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zugqpq/hardest_part_about_onboarding_at_new_company/",
        "text": "[removed]",
        "created_utc": 1671909779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for advice for my university course",
        "author": "Conscious-Young-5869",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zufc00/looking_for_advice_for_my_university_course/",
        "text": "I    am a high school student living in Dubai and i'm going for university    next summer, the university i'm going for is University Of Birmingham    Dubai, but i'm unsure which course to enroll in.\n\ni'm    interested in computer science and is choosing between Software    Engineering  4-year Bachelor and Masters program  and  Computer Science    3-year bachelor's program, initially i went for SE cause thats the  only   CS related engineering course so i thought i wouldn't need to  worry   about my Masters. But I've just realized that if I chose SE now,  I won't   have the option to change my subject of study if I change my  mind  after  completing my Bachelor's.\n\nI   was  inspired to study CS since a several years ago watching tech   youtubers  like LTT, and i'm more interested to computer hardware wise,   but i'm  also worried about i will loose interest to it after learning   though the  course.\n\nMy parents   totally  support all of my decisions, however they believe that studying    engineering is on a different level than the course those arent    engineering. I wonder if this is true.\n\nTherefore,    i'm requesting for your advice to help me take my decisions, or tell    about how your course is for those who is taking/taken SE/CS which  could   help me alot, thank you so much!!",
        "created_utc": 1671905643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Build the modular monolith first",
        "author": "fagnerbrack",
        "url": "https://www.fearofoblivion.com/build-a-modular-monolith-first",
        "text": "",
        "created_utc": 1671897681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using ChatGPT to get better at Coding.",
        "author": "Motor_Hunter7607",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zu83fr/using_chatgpt_to_get_better_at_coding/",
        "text": "[removed]",
        "created_utc": 1671881572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boot Camp recommendations for web development?",
        "author": "Opti-Free31",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zu2u4u/boot_camp_recommendations_for_web_development/",
        "text": "Hi I love web design\n\nAnd want to get caught up with the latest design programming / features being used.\n\nI know I could just learn this online using Udemy or some other online platform. \n\nBut I’m really bad at procrastinating and forcing myself through online lessons. But if it was in person I know I could commit myself to that.\n\nI was wondering if anybody has any recommendations or if they recommend community college over a boot camp?\n\nAlso I want to go into this currently I’m a back end programmer but I love front end design. \n\nWhat is your guys opinion on web development as a side hustle / career in 2023?",
        "created_utc": 1671860179,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you think about this project",
        "author": "King_charlotte001",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/ztvj9x/what_do_you_think_about_this_project/",
        "text": "[removed]",
        "created_utc": 1671837296,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Years of Rimac In-vehicle Infotainment with Qt",
        "author": "the_ivii",
        "url": "https://www.youtube.com/watch?v=PWU6ce4ZvxM",
        "text": "",
        "created_utc": 1671837129,
        "upvote_ratio": 1.0
    },
    {
        "title": "A lot of people seem to prefer complexity over simplicity",
        "author": "mcweirdy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/ztvala/a_lot_of_people_seem_to_prefer_complexity_over/",
        "text": "I've been partaking in a lot of opinionated code reviews of late and it's surprising to me that no matter what team or organization you go to, people will still bend over backwards to complicate simple logic/architecture. A lot of times, I think they want to show that \"I know this trick or niche library\" more than they want to actually help you improve your code, and it can be frustrating sometimes. was I naive to think this was a rookie thing to do or do you guys experience it more often than not?",
        "created_utc": 1671836651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entity lifecycle tracking tool",
        "author": "jgengr",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/ztscnu/entity_lifecycle_tracking_tool/",
        "text": "Hello,  Our team has a difficult time tracking all the business and technical logic of some of the entities on our application. For example, during frontend/backend development we want to track what happens  when we onboard, edit, delete organizations.  We try to track this using a confluence page or set of pages, but that's not very visual or easy to track the entities in their stages.  A decision tree seems too simple. Are there any other tools or structures that can help manage this? TIA.",
        "created_utc": 1671828809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys can anyone help me do a state diagram or the following use case? I barley understand the state diagram and i have to submit this in less than a week",
        "author": "Shalabijo",
        "url": "https://i.redd.it/ysxy0p4o0q7a1.jpg",
        "text": "",
        "created_utc": 1671815113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys i need your help. What do you think about my use case diagram? Is the login located in the right place?",
        "author": "Shalabijo",
        "url": "https://www.reddit.com/gallery/ztjvjq",
        "text": "",
        "created_utc": 1671810299,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Best Data Science Programming Languages to Know In 2023 | USDSI",
        "author": "ankitaanand22",
        "url": "https://www.usdsi.org/data-science-insights/10-best-data-science-programming-languages-to-know-in-2023",
        "text": "",
        "created_utc": 1671809120,
        "upvote_ratio": 1.0
    },
    {
        "title": "My wife and I created a parody video about software engineer job interviews. Check it out!",
        "author": "PrestigiousAnimator4",
        "url": "https://www.tiktok.com/t/ZTRq5eupY/",
        "text": "",
        "created_utc": 1671793143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling Lost and Confused Learning Systems",
        "author": "lordkranth",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zt8z7a/feeling_lost_and_confused_learning_systems/",
        "text": "I have been a software engineer for two years. I’ve worked at various companies like Amazon and faced massive imposter syndrome and confusion when joining my team. I’ve been recently joined a new company and have had a hard time understanding how cloud architecture works. I’ve tried going through my team’s wikis, but it seems that the documentation is outdated. I was wondering if any fellow developers face this problem or any other similar problems and could provide some advice.",
        "created_utc": 1671779083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Containers are chroot with a Marketing Budget",
        "author": "fagnerbrack",
        "url": "https://earthly.dev/blog/chroot/",
        "text": "",
        "created_utc": 1671778868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas to check for code plagiarism for Project-based submissions",
        "author": "ramsane",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zt7v0p/ideas_to_check_for_code_plagiarism_for/",
        "text": "With existing plagiarism tools like MOSS or other available sass solutions, we can do file-to-file comparisons. But If each student submits a set of files like a Full stack assignment, Is there any way to do it efficiently?",
        "created_utc": 1671775013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which phrase are you most familiar with?",
        "author": "Gamecocklatino",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zt1q2t/which_phrase_are_you_most_familiar_with/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/zt1q2t)",
        "created_utc": 1671755346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Agile unlocks the combined solutioning power of a team (as opposed to individuals)",
        "author": "AgileRant",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zszqk3/agile_unlocks_the_combined_solutioning_power_of_a/",
        "text": "I believe Agile is more than just a framework or set of ideas, especially something rooted in software, product and process development. Or even business tasks. It is a way for teams to collaborate, communicate, problem solve and build better things together. More so than other SDLC, frameworks, processes and others that came before it. Check out [Agile VS Waterfall](https://www.agilerant.info/agile-vs-waterfall-10-ideas-you-need-to-know/) from Agile Rant if interested in more info.",
        "created_utc": 1671750469,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you log API in your application?",
        "author": "asadeddin",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zsuxiu/how_do_you_log_api_in_your_application/",
        "text": "Hi all, how do you currently log all API calls made and received by your  application? Do you use a tool or do you build your own logging  solution? Thanks!",
        "created_utc": 1671738242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free NeetCode Roadmap - Algorithms",
        "author": "FunkMasterDraven",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zsumia/free_neetcode_roadmap_algorithms/",
        "text": "NeetCode made a roadmap for his LeetCode videos.\n\nhttps://youtu.be/jgQjes7MgTM",
        "created_utc": 1671737446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello I am a universty student I have an assignment to do a research about the impact of cloud data centers on the environment. I would be grateful if you would take the time and answer this survey . #environment #IT #SoftwareEngineer #ITstudents #university #student #CollegeStudent",
        "author": "Royal-Relation9334",
        "url": "https://docs.google.com/forms/d/e/1FAIpQLSeGLE51e0eD-1bxzesHoNiTwSrBVpjLAGin4JqfKoa1CVM4MQ/viewform?usp=sf_link",
        "text": "",
        "created_utc": 1671735611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reducing BigQuery Costs: How We Fixed A $1 Million Query",
        "author": "fagnerbrack",
        "url": "https://shopify.engineering/reducing-bigquery-costs",
        "text": "",
        "created_utc": 1671724874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kubernetes liveness and consumer applications",
        "author": "TheBuckSavage",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zsni3q/kubernetes_liveness_and_consumer_applications/",
        "text": "\n\nI want to understand how people generally implement consumer applications for Kubernetes in such a way that unhealthy pods don't receive any messages.\n\nI'm deploying a program on kubernetes that opens a listener to a queue/topic on startup. I'm wondering how I can refactor the program so that it waits for K8s liveness probe to succeed before opening the listener.",
        "created_utc": 1671719732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Services good, microservices bad, change my mind",
        "author": "CutToTheChaseTurtle",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zsn3n1/services_good_microservices_bad_change_my_mind/",
        "text": "I'll be honest I never ever worked with a microservice architecture (as defined in [https://en.wikipedia.org/wiki/Microservices](https://en.wikipedia.org/wiki/Microservices)) and it doesn't sound appealing to me. I understand why having services is a good idea:\n\n1. Independent CD pipelines for unrelated code,\n2. Independent scaling for APIs that use very different data,\n3. Removing complexity from widely distributed libraries/binaries in favor of thin clients that don't take much memory/CPU and don't need to get substantial updates often.\n\nAnd so on - there are valid reasons why service-oriented architecture is a good thing for many products.\n\nBut why on Earth would I want to pay the cost of RPCs and worry about API versioning if none of these reasons apply? It's more overhead, it's harder to maintain, it's harder to understand, it's harder to iterate on safely because of versioning concerns - I just don't see a single good thing in favor of making a service out of every single module.\n\nIf you like microservices, why? Convince me that they can be a good thing!",
        "created_utc": 1671718624,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to get into the field... learn. i need to get a laptop to do it. what specs would you all reccomend. just to give me a ball park of what works for others. i wanna learn frontend. then backend development eventually.",
        "author": "theoniwan87",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zs5k8x/trying_to_get_into_the_field_learn_i_need_to_get/",
        "text": "",
        "created_utc": 1671666288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Methods/Languages/Libraries for Upskilling",
        "author": "Lintaar",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zrxyur/best_methodslanguageslibraries_for_upskilling/",
        "text": "Hey guys, I've been working in analytics for some time, and am starting interviews for an internal transition into SE in about 3 months.\n\nRight now, I work mostly in BI and in python exclusively with these libraries: Numpy, Pandas, TF, Seaborn, Matplotlib. \n\nShould I focus on learning other languages often used in engineering such as C, C++, JS, Perl, etc.? Should I get familiar with Git and Gitlab? Should I just focus on expanding my python knowledge?\n\nAny advice for upskilling is appreciated, there's so much I want to learn its difficult to decide on just a few things.",
        "created_utc": 1671650221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strategies to keep dependencies updated",
        "author": "filmaluco",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zrxo3i/strategies_to_keep_dependencies_updated/",
        "text": "Rare  is a project that does not have  external dependencies. Me being an  Android Developer I can safely say  it's impossible for Android  development. Every team has it's own approach, and every approach has  it's on pros and cos.\n\nI think I  summarized in this 6:\n\n1. Ignore it\n2. Check sporadically\n3. Check regularly\n4. Check on every Pull Request\n5. Check before every major release\n6. Automate Dependency Management\n\nI  really would like to know what approaches I might have missed, and have stories about the pros and cos you learned along the way. Having said that I hope iit'sts okay to share a blog post about this topic that my team and I wrote where we really go into detail on our views of the matter.  \n[https://www.bloco.io/blog/6-strategies-for-updating-software-dependencies](https://www.bloco.io/blog/6-strategies-for-updating-software-dependencies)",
        "created_utc": 1671649531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non CS-major software engineers: what did you major in and how'd you get into software engineering?",
        "author": "SeaworthinessBoth381",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zrtedd/non_csmajor_software_engineers_what_did_you_major/",
        "text": "",
        "created_utc": 1671640442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spring Boot main program - a first impression",
        "author": "Lanky-Apricot7337",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zrg481/spring_boot_main_program_a_first_impression/",
        "text": "Being new to Spring Boot, I couldn't help being not positively surprised at how things look at a very (very) first glance.ngrok\n\n    @SpringBootApplication\n    public class HsqldbDemoApplication {\n    \n    \tpublic static void main(String[] args) {\n    \t\tSpringApplication.run(HsqldbDemoApplication.class, args);\n    \t}\n    \n    }\n\nBeing specific and -I admit it- quite fussy:\n\n* At a first look this look like *an application which calls an application which calls the first application which... etc*. The main program does not only not reflect in an obvious way what is really going on, but tends to reflect what is actually not going on at all. I don't imply that the real logic is not easily guessable after a second thought; it's obviously so after a little reflection on the annotation, Spring ways of working and so on. I just say that the model depicted in the very main app is misleading in a neutral context.\n* *There are no explicit dependencies stated*. While I understand that hiding complexity is generally a good thing if done in a consistent way (meaning: in a way that is consistent with the accepted business rules at a given level of abstraction, across the abstraction hierarchy) this hiding is happening after an explicit dependency-based process of configuring the application generation - the Spring Starter configuration: *first we made them explicit, then we again made them implicit*.",
        "created_utc": 1671616969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparing TCP and QUIC",
        "author": "fagnerbrack",
        "url": "https://www.potaroo.net/ispcol/2022-11/quicvtcp.html",
        "text": "",
        "created_utc": 1671616898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it too late to make the Switch?",
        "author": "KENDRICK3291",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zrf6ro/is_it_too_late_to_make_the_switch/",
        "text": "Hey Chat.\n\nI’m Network Engineer of 8 years that’s looking to tryout Software Engineering. I’ve coded a little in the past, worked w/  python,html, &amp; CSS.  Tbh it was fun as hell. However, I stopped bc I don’t want to start all over and be back at the bottom. Im not sure what the pay is like for newbs in SE but for us NE entry level is like 30/hr at best.  I just don’t to switch paths and get burned, I’m getting old man I’m turn 35 next year",
        "created_utc": 1671613522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Compiler...from scratch",
        "author": "Bob_bobbicus",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zr8a06/compilerfrom_scratch/",
        "text": "I'm looking to make my second (bytecode) compiler. The first functioned but was entirely handwritten, very messy, and a piece of trash. \n\n\n\nThis time, I'd like to try make it able to link with external c libraries via either lib or dll, but have absolutely no idea how to even start with that. Any advice or ideas would be extremely helpful, because the only ones I've had are not going to work",
        "created_utc": 1671591214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the cuts to the Twitter infrastructure team going to have an impact on the amount of downtime?",
        "author": "plett1985",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zr81th/are_the_cuts_to_the_twitter_infrastructure_team/",
        "text": "https://www.nytimes.com/2022/12/20/technology/elon-musk-twitter-resign.html?smid=nytcore-ios-share&amp;referringSource=articleShare",
        "created_utc": 1671590562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse engineering Linear’s sync magic",
        "author": "segfaultbanana",
        "url": "https://marknotfound.com/posts/reverse-engineering-linears-sync-magic/",
        "text": "",
        "created_utc": 1671588113,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Need for Product Software Engineering",
        "author": "WMRamadan81",
        "url": "https://medium.com/p/2302ad7bf62d",
        "text": "",
        "created_utc": 1671586107,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does *your* company go from writing code to production code to production software?",
        "author": "bassthefishkind_",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zr1435/how_does_your_company_go_from_writing_code_to/",
        "text": " When  you're working for a company and your pull requests are approved, how  is the code integrated to the production software? As far as I know,  it's now on the main branch, but how does that code reach the users?\n\nAre  there any sources online that cover what practices, or processes, that  companies follow on how they work with production code? (Which may vary  depending on their software development process.)\n\nDo  you just have a local repository at your production server that pulls  from the main branch on the remote repository on a scheduled basis?\n\nOr  is it the same as mine, have someone that just manually copies code  from the main branch to the server and run scheduled tasks to run each  script?\n\nI have to ask, as these questions have been festering in my mind for quite some time.\n\nAt  my small-ish company (I'm the only developer, IT guy, Help Desk, etc.),  all code is written and pushed through git and any code / script  changes pulled to the main branch is manually copied over, by me, to our  production server. At our production server, I just have a task  scheduler that runs these scripts on a scheduled basis.\n\nI'm  sure this isn't the norm and I want to ensure the process I'm using to  produce and push code is the standard way of doing things, however I  can't find any sources online that show how this works?",
        "created_utc": 1671573751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 2 more years of school really worth $30,000?",
        "author": "AnotherFuckinGuy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zr0ww1/is_2_more_years_of_school_really_worth_30000/",
        "text": "[removed]",
        "created_utc": 1671573293,
        "upvote_ratio": 1.0
    },
    {
        "title": "BlueYonder/JDA WMS experience?",
        "author": "jyft106",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zqz1rm/blueyonderjda_wms_experience/",
        "text": "Anyone have experience with this application? My organization needs some help in this area and is asking a few of our systems analysts if they are willing to learn. Having trouble finding any free or reasonably priced training resources...",
        "created_utc": 1671568867,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Have to Pirate Colors Now",
        "author": "PressTab123",
        "url": "https://www.youtube.com/watch?v=3PhpgOC_XQY",
        "text": "",
        "created_utc": 1671567798,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do The Holidays Impact Engineering Productivity? A Statistical Analysis.",
        "author": "dpee123",
        "url": "https://www.statsignificant.com/p/how-do-the-holidays-impact-engineering",
        "text": "",
        "created_utc": 1671565472,
        "upvote_ratio": 1.0
    },
    {
        "title": "multi-month study plan for becoming a software engineer",
        "author": "Creative_Work7221",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zqw7dy/multimonth_study_plan_for_becoming_a_software/",
        "text": "hi community !\n\ni just want to share with you   a complete CS self-taught program \n\nthank me later :)\n\n[here](https://github.com/jwasham/coding-interview-university)",
        "created_utc": 1671562055,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do One-Time passwords work?",
        "author": "fagnerbrack",
        "url": "https://zserge.com/posts/one-time-passwords",
        "text": "",
        "created_utc": 1671552096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Web Dev major apply to software engineering internships?",
        "author": "SeaworthinessBoth381",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zqrmjg/can_web_dev_major_apply_to_software_engineering/",
        "text": "I'm currently getting a bachelor's in Web Development - would this major allow me to apply to software engineering internships ? On internship postings, I see that they list majors such as CS, math, computer engineering, etc, but I've yet to see one include web dev. \n\nSecond question: if I do an undergrad in Web Dev, do you think I'd be able to pursue a master's in computer science or software engineering? \n\nThank you for your help! Sorry if these questions seem silly - I'm just starting out",
        "created_utc": 1671550917,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Build Software Products Faster by Thinking Like a Data Engineer",
        "author": "thabarrera",
        "url": "https://airbyte.com/blog/data-tools-for-software-products",
        "text": "",
        "created_utc": 1671539443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Approaching task completion delay in AGILE development",
        "author": "bmtkwaku",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zqlyjm/approaching_task_completion_delay_in_agile/",
        "text": "Hello guys 👋🏾 , I have a question about AGILE development &amp; working in teams. So let’s say you have a scenario where tasks are planned out and everything, and assigned to different people in the team. Let’s say we’re working in a sprint, 2 weeks. Now let’s say there’s a person A who a task has been assigned to but is lagging in progress, but yet it’s a major part of what is being built. During stand ups, person says there’s no problem and they’re working on it, but sprint is about to end in about 3 days. \n\n1) Is it good practice for someone else to pick that task up w/o Person A’s knowledge? \n\n2) Is there a way to approach Person A w/o making them feel like they’re dragging the team progress down? \n\nI’m basically looking for the approach which is encouraged in a situation like this.",
        "created_utc": 1671535470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coaching Tips",
        "author": "nfisher32",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zqcai0/coaching_tips/",
        "text": "I just accepted a job offer as a software engineering coach. I will \"work with other software development teams across the enterprise for engineering best practices which includes BDD, TDD, Unit Testing and Cucumber or Gherkin. This team helps by pair programming, code reviews and teaching/coaching sessions.\" \n\n&amp;#x200B;\n\nI have extensive experience with BDD, TDD, and all of the relevant technologies for the position but I've never worked as a coach or tech lead? Does anyone have advice or good books/resources to help me prepare for this kind of role?",
        "created_utc": 1671505020,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ain’t capping here. Anyone who’s ready get at me for ya X2 EMVs, DuMps 4 cloned cards hmu and we finna eat together. To place ur order t.me/thegriot. I got a great holiday discount for bulk purchase. I'm available 💳♨️🤝 t.me/thegriot001",
        "author": "Jonnsnoww001",
        "url": "https://v.redd.it/cm78u60fiy6a1",
        "text": "",
        "created_utc": 1671500119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineers who failed out of cs",
        "author": "National_Daikon_9745",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zq6n2t/engineers_who_failed_out_of_cs/",
        "text": "Are there any engineers here who have a career despite failing out of a CS program? Is it even possible?",
        "created_utc": 1671491184,
        "upvote_ratio": 1.0
    },
    {
        "title": "best bootcamp/certification?",
        "author": "Bigcrief",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zq3trk/best_bootcampcertification/",
        "text": "Hi all! I really want to get started with software engineering/coding/ web developing etc but am lost at where to start. I been a CDL driver for quite a while, would be an absolute beginner but it's something I've always wanted to do and been envious of asking people what they do and they say ya know, backend engineer, cyber security etc \n\nI looked at bloomtech and it seems promising. Haven't looked at much else, would like some recommendations that will help me land a decent job after getting my certification and training. Also money wise what's best specialty to pursue? Really wanna make 80k+ \n\nThanks!",
        "created_utc": 1671484622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which would you share if you could only share your professional resume/LinkedIn or GitHub with an employer?",
        "author": "marvinshkreli",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zq06oj/which_would_you_share_if_you_could_only_share/",
        "text": "",
        "created_utc": 1671476235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master or go to work after graduation?",
        "author": "Ayoubimad_",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpzsg3/master_or_go_to_work_after_graduation/",
        "text": "hi guys, maybe this is not the right place to ask this question.  But in your opinion, after graduating in computer engineering/software engineering , is it better to do a master's degree, like in artificial intelligence or big data, or go to work?",
        "created_utc": 1671475362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineer I vs Junior Software Engineer. Same or different?",
        "author": "TheDopeJackalope",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpywtv/software_engineer_i_vs_junior_software_engineer/",
        "text": "I’m applying for roles and I always see theses title posts and I’ve always assumed Software Engineer I II, III, etc we’re akinto Junior, Mid-level. Senior etc.\n\n\nIs this the case or is there a deeper meaning I’m unaware of?",
        "created_utc": 1671473414,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help need advice.",
        "author": "No_Peanut_5240",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpxak4/please_help_need_advice/",
        "text": "I work at UHG in india right now , i worked here for an year, was an angular developer here , suddenly the project restructuring came and everyone was removed from the project and assigned to new ones. i have been on bench for 2 months and as per my manager i have 1 more month before i would be asked to leave. I don't know if that's true or my manager is messing up with me. I cannot even talk to the HR here , i texted her several times she doesn't give an F. \n\nI know the recession and i won't get a new job soon, i dont want to be in coding, i am done my btech in cse and am not a bad coder, but i dont like doing it.\n\nI can't ask my brother for help in this decision , he works in Morgan Stanley and being in Investment banking , he doesn't listen to me when i say I wanna quit the job,  always downplays  me and undermines me. Please help me select the options. \n\nOption 1: I want to pursue mba or any different field, i was here for the job exp. But i had to do so much work before that I could not even study for Gmat or CAT ( indian mba exam ) , now should I quit and prepare for Gmat GRE , i only have a total of 1.5 years of work ex so i might get mim admission in Europe mostly , and no mba. I would prepare for 8 months apply for different mba programs and get a seat in 2024. \n\nOption 2: not quit job entirely and become analyst somewhere, therefore i will have time to study and work exp to showcase. And meanwhile prepare.",
        "created_utc": 1671469860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crazy Ideas developed using Chat GPT or GitHub Copilot?",
        "author": "Santosh_Lakkoju",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zps61h/crazy_ideas_developed_using_chat_gpt_or_github/",
        "text": "Any crazy ideas developers cracked using Chat GPT or GitHub Copilot?",
        "created_utc": 1671457978,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Bridge Analogy",
        "author": "DelatBabel",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpqjak/the_bridge_analogy/",
        "text": "You’re driving along a country road, out in the wilderness area away from cities and towns and the such like. At one point the road ends at a river. There is a team of construction engineers building a bridge across the river to connect to a road on the other side of the river.\n\nSo you ask one of the construction team “when will the bridge be ready?”. He answers “in about 3 weeks”.\n\nYou reply “well, I told my client that I’m going to drive over this bridge tomorrow, so I’m going to come back here tomorrow and drive over this bridge whether it’s finished or not”.\n\nWhy is this unacceptable in construction engineering, but standard practice in software engineering?",
        "created_utc": 1671453678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineering Jobs",
        "author": "International_Tell90",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpoxfe/software_engineering_jobs/",
        "text": "Hey guys, I hope all you guys are having a good day!\n\nI have question about getting a job as a software engineer. My biggest goal is to get to a level where I will be able to get an online software engineering job so I can work from home while getting paid good. \n\nMy first and most important question is, I will start to a University soon but not in Software Engineering major, but in a different irrelevant major. And I will study software engineering in a different course myself (The course gives certificate as well). **So does it matter which major I graduated from to be a software engineer as long as I have a university degree? And will I be able to get an online job as a software engineer?**\n\nMy second question is, do I need a university degree at all? Like will I still get to my goal?\n\nMy first question is my main curiosity. And I am sorry in advance if these questions are so common, but I am in a critical timeline and I had to ask this. Thank you all so much in advance. ^^",
        "created_utc": 1671448781,
        "upvote_ratio": 1.0
    },
    {
        "title": "When would you edit the configurations of a module bundler?",
        "author": "web_deb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpo26i/when_would_you_edit_the_configurations_of_a/",
        "text": "I have some experience using webpack(through create-react-app) and Vite, I've seen some articles that go in depth about them but I'm a but confused as to why we would want to even touch their configurations. From my experience, they were completely abstracted from my work and everything worked fine. So I wanted to understand in which use cases would it be relevant to edit their configurations?",
        "created_utc": 1671445875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Scrum an awful project management methodology?",
        "author": "Annual-Material-8040",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpljqt/is_scrum_an_awful_project_management_methodology/",
        "text": "or is it our testing strategy that is awful?\n\nhttps://medium.com/serious-scrum/is-scrum-an-awful-project-management-methodology-f9bbad4f304c",
        "created_utc": 1671436413,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you measure developer velocity in an ongoing sprint?",
        "author": "myTiroApp",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpji8j/how_do_you_measure_developer_velocity_in_an/",
        "text": "This is specifically for experienced software engineers that regularly run sprints and manage a team of developers. Have you put any systems in place to figure out if your sprint is successful and you’re moving in the right direction while it is ongoing? Other than using a burndown chart, and talking to your team during stand-up meetings, what has been useful to capture/measure additional insights on sprint velocity?",
        "created_utc": 1671429304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problems managing small dev team",
        "author": "swentso",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpek72/problems_managing_small_dev_team/",
        "text": "Hi,\n\nI work on a startup in early stage. Our product moves a lot since we didn't find market fit yet.\n\nWe aree a small 5 devs team. We have a kanban. But It's obvious that some members work harder than others (2 of the devs are less productive,  take way more time to finish their task).\n\nI'm thinking about trying to distribute the tasks evenly at sprint planning instead of giving the choice of tickets. In that way I can more clearly set personal objectives with each one.\n\nHow would you deal with that?",
        "created_utc": 1671414411,
        "upvote_ratio": 1.0
    },
    {
        "title": "HEY GANG. YALL STILL NEED THAT X2 2022/2021 EMV SOFTWARE WT TUTORIAL 2022/2021 X2 PACK?? HMU on TELEGRAM @ http://t.me/thegriot001 INCLUDES DUMPS ATR TOOLS AND MORE. TAP IN",
        "author": "Jonnsnoww001",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zpdsow/hey_gang_yall_still_need_that_x2_20222021_emv/",
        "text": "[removed]",
        "created_utc": 1671412159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please recommend a chrome or firefox extension that can replace a static file url with a local file",
        "author": "leafygiri",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zp88tj/please_recommend_a_chrome_or_firefox_extension/",
        "text": "Looking for a chrome or firefox extension that can replace static resources (e.g. JS, CSS etc.) with local files. For example, when I load a page [example.com/bla](https://example.com/bla) a JS file from [example.com/static/js/bla.js](https://example.com/static/js/bla.js) might be loaded. I want to replace that one with a local file, /my/local/directory/js/bla.js. \n\nA chrome extension (also available as a desktop app for Mac) called requestly can achieve this. But I would like to know what other alternatives are out there and how are they better/worse than requestly. Thanks.",
        "created_utc": 1671397176,
        "upvote_ratio": 1.0
    }
]