[
    {
        "title": "About to graduate",
        "author": "avrsn",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/105blxl/about_to_graduate/",
        "text": "Hi, I’m about to graduate with my Software Engineering degree.\n\nI’m kept too busy to really specialize in something and my university always has me learning the basics of new technologies. As a result I have a super shallow understanding of computer architecture, java, and web development. \n\nI want to work in fin-tech so what should I do?",
        "created_utc": 1673054004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever migrated from a Monolith?",
        "author": "tiagoboldt",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1059rbg/have_you_ever_migrated_from_a_monolith/",
        "text": "[removed]",
        "created_utc": 1673049280,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to decide what tech field to specialize in - frontend or backend or mobile dev or AI/ML or blockchain or DevOps or UI/UX or product management etc ?",
        "author": "mike02022001",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1054pqp/how_to_decide_what_tech_field_to_specialize_in/",
        "text": "As a college student, i am really confused on which one I should specialize. I would very helpful if senior or experienced people in any of these fields could tell me what skills are required and how to decide if this field is for me or not .",
        "created_utc": 1673037264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programming languages: Why this old favorite is on the rise again | ZDNET",
        "author": "weeska",
        "url": "https://www.zdnet.com/article/programming-languages-why-this-old-favorite-is-on-the-rise-again/",
        "text": "",
        "created_utc": 1673026681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is This Why You’re Bad At Programming?",
        "author": "Outrageous-Layer362",
        "url": "https://www.youtube.com/watch?v=ZobVQ_J7HtI&amp;list=PLEx5khR4g7PK5eoUB7oqZ7lXRnUdIgudd",
        "text": "",
        "created_utc": 1673011750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding Bootcamps",
        "author": "Jupidness",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/104tvoe/coding_bootcamps/",
        "text": "Not sure if this is the place to ask. But, being new to all of this and possibly wanting to pursue a career in computer engineering (preferably coding), is it realistic to get a job from a coding bootcamp like everyone says it is?",
        "created_utc": 1673010767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fitness App: What Features Should It Have?",
        "author": "el_garry",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/104qkkn/fitness_app_what_features_should_it_have/",
        "text": " Fitness apps have become increasingly popular over the past few years, with people using them to monitor their health and fitness goals. However, not only are users making the most out of them, but businesses are also. Fitness apps offer a great opportunity for any business to get their products and services in front of potential customers that may need to  be reached via traditional marketing methods.    \n\n\n \n\nCompanies can use various features such as nutrition tracking and workout reminders to promote their products or services by creating an app dedicated to fitness and health topics. \n\nBut **how much does a fitness app cost?** And what features should it have to be truly effective? This blog post will answer those questions and more. So, let’s begin!  \n\n\nRead more : [https://www.pixelcrayons.com/blog/how-much-does-it-cost-to-build-a-fitness-app/](https://www.pixelcrayons.com/blog/how-much-does-it-cost-to-build-a-fitness-app/)",
        "created_utc": 1672999806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work Remote - US Travel",
        "author": "cherryrazzles",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/104n7rr/work_remote_us_travel/",
        "text": "I was just wondering if anyone here is traveling around the states while working remotely?\nLike for example I want to go places, like say Texas for a month or Chicago for two months, where would you look for places to live? Besides Airbnb and VRBO, where you would search short term rentals? #travel",
        "created_utc": 1672987375,
        "upvote_ratio": 1.0
    },
    {
        "title": "coin image recognition",
        "author": "Beneficial_Wing_2255",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/104iyie/coin_image_recognition/",
        "text": "I want to put coin images through software to identify year, type, mint marks and errors. Where should I start?",
        "created_utc": 1672974425,
        "upvote_ratio": 1.0
    },
    {
        "title": "What degree/school will be recognized by employers? I'm a stay at home mom looking to start a career in something worth while but I have no idea where to start.",
        "author": "Bitter-Past1089",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1049xnf/what_degreeschool_will_be_recognized_by_employers/",
        "text": "",
        "created_utc": 1672952238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I tell my manager I'll search for another job if I don't get my desired pay rise?",
        "author": "research-journey2023",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1049oxc/should_i_tell_my_manager_ill_search_for_another/",
        "text": "[removed]",
        "created_utc": 1672951666,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 Software concepts I learned in 2022",
        "author": "creasta29",
        "url": "https://medium.com/@neciudan/10-software-concepts-i-learned-in-2022-19843b330014",
        "text": "",
        "created_utc": 1672934178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineering Bachelor's Degree Program Online - WGU",
        "author": "SirWade27",
        "url": "https://www.wgu.edu/online-it-degrees/software-engineering-bachelors-program.html",
        "text": "",
        "created_utc": 1672933098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend claims he's making 300k as a brand new SWE... True?",
        "author": "Mysterious_Dog_190",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103u0uk/friend_claims_hes_making_300k_as_a_brand_new_swe/",
        "text": "My buddy is a fresh college grad who majored in \"Cognitive Science\", which at my uni consists of a blend of courses in psychology, philosophy, and some basic computer science. He recently told me he got a job offer working as a \"Machine Learning Engineer\" at a large software company, and is making 280k all-in comp straight away out of college. I was initially super happy for him but I've started to develop a healthy amount of skepticism. \n\nFor one, I looked up \"Machine Learning Engineer\" on LinkedIn and all the other employees at his company with that job have PhD's in computer science and decades of experience. Secondly, another friend of mine (comp sci major) got a job at Apple and says he's making well under that amount, and claims he doesn't know anyone in software (even at Google and Apple) making that much all-in comp straight away. \n\nIs my friend exaggerating something? Or does his story sound realistic? \n\n(I know nothing about SWE, or tech careers)",
        "created_utc": 1672908054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social media app with JavaScript",
        "author": "Junior_Vacation3308",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103s5sp/social_media_app_with_javascript/",
        "text": "I want to create a social media app. Can you do that with only html, css and javascript?",
        "created_utc": 1672901351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Servant Leadership with a team working agreement",
        "author": "HeathdornCoach",
        "url": "https://v.redd.it/ppsvmayyv6aa1",
        "text": "",
        "created_utc": 1672891063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, It's That Time of Year Again",
        "author": "Jankopotamus",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103ndgj/well_its_that_time_of_year_again/",
        "text": "Goal-setting. I hate it.\n\nMy Question: What are some personal or work goals that you have set for yourself that you look back on with pride?\n\nMore Background:  \nI am a senior software engineer with fourteen years experience. I enjoy most of the aspects of software development, and am always willing and able to learn and become adept in the ever-changing landscape of tooling and practices adopted by my organization and/or the industry at large.\n\nI have a hard time with setting goals. I am aware of the SMART or CLEAR frameworks, but my issue is less about how to measure an outcome, and more along the lines of: what can I plan to do this year that will result in my personal growth as an engineer, and also be valuable to the company?\n\nSome ideas: use some unfamiliar programming language to build something, obtain a relevant certification for X cloud platform, regularly contribute to open source projects the company uses, read some books about a particular topic.\n\nMy problem is that for any given year, I only have a limited amount of time to devote to these activities. They are usually only tangentially related to the work that I get paid to do, so I want to choose goals that are in-line with that work, or that I would enjoy doing after-hours.\n\nAs I'm typing this out, I'm realizing that the real issue is that I don't have time during the work day set aside to pursue these goals, so I feel like I have to do them after-hours. If it's after-hours, I don't want to do more company work, I want to do something different and refreshing that I choose that's fun to work on.\n\nContributing to an open source project is probably my best bet, since I'll be exposed to a variety of people and processes, and I can choose what issues look interesting to work on.\n\nSo in the end, this was something of a rubber duck session, but I'm still interested in any constructive thoughts. Thanks for your time. :)",
        "created_utc": 1672886946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving Firefox stability with this one weird trick",
        "author": "fagnerbrack",
        "url": "https://hacks.mozilla.org/2022/11/improving-firefox-stability-with-this-one-weird-trick",
        "text": "",
        "created_utc": 1672882459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Design engineer to Software engineer",
        "author": "anon0one",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103hrqb/design_engineer_to_software_engineer/",
        "text": "I (27) am an aerospace design engineer (mostly composite) in the UK. \nWhile I like the industry, I am not enthusiastic about the wage growth.\nI am considering changing career to software engineering but still within Aerospace. I have limited experience in programming and will most likely go the self taught route. \n\nLooking for advice from those that have done this and from software engineers within the Aerospace industry. \n\nWhat software do you use? And what skills and experience do I need to demonstrate?",
        "created_utc": 1672872667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are CodeAcademy certificates worth it?",
        "author": "MagazineDue1793",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103hroc/are_codeacademy_certificates_worth_it/",
        "text": "Can any industry professionals tell me how codeacademy certificates are viewed? Are they worth it? I am a college student trying to bolster my resume. I have a github portfolio im constantly working on and adding to, was curious if the certificate would be a plus or if its worthless. Thanks",
        "created_utc": 1672872663,
        "upvote_ratio": 1.0
    },
    {
        "title": "worm o larvae stuck laptop monitor between display and screen? Hay una larva entre la pantalla y el display de mi laptop, help me!",
        "author": "Leep-Te",
        "url": "https://v.redd.it/b95e4208h3aa1",
        "text": "",
        "created_utc": 1672867792,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a healthy habits app specifically for software engineers? Thanks",
        "author": "Better_Do",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103e1ee/is_there_a_healthy_habits_app_specifically_for/",
        "text": "",
        "created_utc": 1672864080,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can get the information about Recipient Type for azure users from GRAPH API",
        "author": "sickwalker",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/103960x/how_can_get_the_information_about_recipient_type/",
        "text": " As i have to differentiate between the mailbox type and get the user  with shared mailbox , and i want to get this information from GRAPH API ,  even if there is not any direct way to get this information , but if  there any property change or something which happens and can be get  through GRAPH API which might be helpful , to get the shared mailbox  user , cause i am not able to find the answer in web",
        "created_utc": 1672852825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Twitter Didn’t Go Down: From a Real Twitter SRE",
        "author": "fagnerbrack",
        "url": "https://matthewtejo.substack.com/p/why-twitter-didnt-go-down-from-a",
        "text": "",
        "created_utc": 1672848076,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI for Software Development: Can Machines Write Good Code?",
        "author": "Veerans",
        "url": "https://bigdataanalyticsnews.com/ai-for-software-development/",
        "text": "",
        "created_utc": 1672843233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help for an ML based Videoconferencing website.",
        "author": "Pale-Progress-6893",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102yr46/help_for_an_ml_based_videoconferencing_website/",
        "text": "I am building a Videoconferencing website just like Google meet and zoom but want to add AI features to it like hand gestures detection and face detection to it. I have done various projects on AI and ML and was able to create a solo program for each feature but I am facing a problem of integrating it into video conferencing. Can anyone guide me to the right path and name some technologies that I can learn to create this website.",
        "created_utc": 1672822911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machine Learning for new age AI | MIT - Massachusetts Institute of Technology",
        "author": "ankitaanand22",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102xnm1/machine_learning_for_new_age_ai_mit_massachusetts/",
        "text": "[removed]",
        "created_utc": 1672818799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backend Software Engineer",
        "author": "Nervous_Outcome_4158",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102uh4u/backend_software_engineer/",
        "text": "Assuming there is already a system for contacts (name, address, email), and you’re asked to develop a second system (like a microservice) that provides extra information (payroll data, bank details, tax info, etc.), what are the FIRST basic considerations would you take when first designing the new system? (DO NOT DESIGN THE SYSTEM, just what would be your first points of investigation.)",
        "created_utc": 1672808334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you want your Unit Testing to Rock?",
        "author": "MiserableActivity860",
        "url": "https://medium.com/@ukkuru/do-you-want-your-unit-testing-to-rock-d55ff482ebb5",
        "text": "",
        "created_utc": 1672803543,
        "upvote_ratio": 1.0
    },
    {
        "title": "System Design Question",
        "author": "Nervous_Outcome_4158",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102siga/system_design_question/",
        "text": "If developing a system to run in the cloud, using managed services (e.g. email system, messaging queues, storage, etc.), what techniques or tools would you use in your LOCAL development process?",
        "created_utc": 1672802570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Scrapping tool is best for extracting data from ecommerse sites using Python, BeautifulSoup, Selenium or Scrappy?",
        "author": "sharzun",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102qfcn/which_scrapping_tool_is_best_for_extracting_data/",
        "text": "I'm doing my research for my Final Year Project. I have to scrap the data of statistic of people buying certain items according to the season. Eg.: how frequent people buy school uniforms is January - July, price difference, or may be what are the products being sold the most in January comparing to July, like that.\nSo which scrapper framework is better BS, Selenium or Scrappy?",
        "created_utc": 1672796849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Course",
        "author": "Antique_Door2728",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102o5ww/course/",
        "text": "Hey Guys, so I am about to begin my second year studying software engineering. To give you guys some context I never coded before first year however now that first year is over I do indeed find programming interesting especially coming off of last semester. However prior to university I wanted to also study commerce (enjoyed business studies at high school and just enjoy business) and was thinking of switching to double degree of computer science and commerce, however my WAM is pretty low at 70 (WAM is GPA out of 100) and to switch I need a WAM of 75. So I was thinking if I should then switch to either the double degree of computer science and economics (also seems very interesting) or just stick to software engineering. What would you guys suggest really confused here.\n\nThanks",
        "created_utc": 1672791012,
        "upvote_ratio": 1.0
    },
    {
        "title": "#X2EMVSOFTWARE I DUNNO WHAT YOU WAITING FOR MANE. N#GGAZ CASHING OUT ERRDAY B. NEW YEAR DISCOUNT 4 X2 EMVS SOFTWARE TUTORIALS DUMPS, CLØNËZ. WHAT YA NEED? I WANNA KEEP SEEING YOUNGINS CASHED OUT STEPPIN ON MFS NECKS. APPLY PRESSURE. LETS GET THIS BREAD ASAP GVNG 📈📲 HMU ASAP t.me/thegriot001",
        "author": "Jonnsnoww001",
        "url": "https://v.redd.it/h5co6tamrw9a1",
        "text": "",
        "created_utc": 1672786540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with Lack of Motivation",
        "author": "ilDavide2100",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102iabc/dealing_with_lack_of_motivation/",
        "text": "This past year, I've been attempting to change careers into SWE (JS web development with a background in Python), and one factor holding me back is my slowness in getting personal projects done. Friends have encouraged me to do more projects that I enjoy, but I find it more difficult to find things that I care about. Generally, I enjoy tutorials and small projects to improve my skills, as well as studying system design and programming concepts. However, I find myself simply uninterested in creating impressive projects or solving real-world problems. This is partially because I've been burned out from being on the job market for so long, so I hate the idea of using my time for projects just to get ahead and impress other people. Maybe this would change once I'm employed, but I don't know.\n\nHow do you find the motivation to be engaged and do interesting work when things are difficult? Where do you look to find creativity or inspiration? Thanks.",
        "created_utc": 1672777275,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Code During The Day? (yes, it's that bad)",
        "author": "sudoaptupdate",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102hd4e/how_do_i_code_during_the_day_yes_its_that_bad/",
        "text": "I think most of us are familiar with the popular preference for coding at night. This is especially true for me where it seems like I can \\*\\*only\\*\\* code at night. During my 9-5, I mostly just answer emails, attend meetings, go down rabbit holes of documentation, get distracted, etc. It's not until night (usually after midnight) that I can actually write good-quality code. As a result, it feels like I'm working more because I have to go to work 9-5 and also actually be a software engineer late at night. Does anyone here feel the same way? What do you do to overcome this? It seems like this is a fairly common issue among software engineers judging by the number of articles I found online and from my experience in the industry. Do you think this is a big enough issue to warrant software teams take more creative approaches to work hours?",
        "created_utc": 1672775072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preparation for test automation interviews",
        "author": "CompetitiveGram",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102b58o/preparation_for_test_automation_interviews/",
        "text": "[removed]",
        "created_utc": 1672760284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking of changing my career direction to Software Engineering",
        "author": "Yogi_Bur",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/102842v/thinking_of_changing_my_career_direction_to/",
        "text": "I’m a process engineer for an Active Pharmaceutical Manufacturing company, graduated in 2021 and I don’t see too much growth with the path I chose. Sure, my career depends on how I make it but I’m not as motivated and interested in my field as I did when I graduated.\n\nWith that said, I don’t want to go back to school. This post is mainly to ask what should I do to start learning everything I need to have a good chance and being a software engineer. I’m aware that I should focus on Java, Javascript, C++, and SQL. But I don’t know where to start are there free/inexpensive courses I can take independently? Bootcamps? Things of that sort. I want to hear what you guys have to suggest!",
        "created_utc": 1672752142,
        "upvote_ratio": 1.0
    },
    {
        "title": "9 Must-Read Books for Software Engineers in 2023",
        "author": "leonadav",
        "url": "https://grantisom.com/2023/01/02/mustread-books-for.html",
        "text": "",
        "created_utc": 1672740151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will companies prefer a student with SE degree (PEng Approved) than a CS degree?",
        "author": "Striking-Warning9533",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101y4fx/will_companies_prefer_a_student_with_se_degree/",
        "text": "",
        "created_utc": 1672720219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent Graduate Electrical Engineer wanting to break into tech",
        "author": "Chef_Playful",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101t1dw/recent_graduate_electrical_engineer_wanting_to/",
        "text": "I've been working as an electrical engineer at a chemical manufacturing site for about six months now and I am fascinated with coding and analytics the only exposure to coding was from c++ and embedded systems in college, for the analytics side I look at a lot of different data trends for the equipment I am managing. . I was wondering what would be my best way of getting into the tech industry would I need MBA in data analytics or a master's in computer science?\n\nAny advice?",
        "created_utc": 1672706358,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPT-3 And Future Of Software Engineering",
        "author": "YarrikSeelight",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101sgva/gpt3_and_future_of_software_engineering/",
        "text": "Okay as a current software engineering student realizing the power of GPT-3 made me incredibly worried about the future of software engineering. It actually got me thinking of switching major even tho I like my current major a lot. Seeing it do my programming exam tasks in &lt;5 seconds made me really doubt the future job market for software developers. Increasing amounts of software professionals are taken in to schools every year. Will there be enough jobs in the future? If trying to look from objective view without any biases do you think it would be a good idea to switch major and why? Also which segments or roles of software engineering do you see as the most fragile and which ones as most future-proof ones?",
        "created_utc": 1672704928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actuarial science to software engineer?",
        "author": "Many-Gain-8204",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101q35c/actuarial_science_to_software_engineer/",
        "text": "\nHi guys, I am looking to switch to a more technical career since these actuarial exams are very tough and I mostly enjoyed my python/SQL/VBA work so far, and hate dealing with insurance regulators. Anyone by chance had a similar switch? \n\nI am pretty close to acquiring my ASA (associate of the society of actuaries - first official actuarial credential abt 7 exams needed). I am wondering if this might be worth finishing before I switch since it may benefit me in an engineering role requiring business/risk knowledge and/or fintech?",
        "created_utc": 1672699154,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have 6 years experience as a web programmer. Can I become a software architect?",
        "author": "cyberjunkie777",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101povz/i_have_6_years_experience_as_a_web_programmer_can/",
        "text": "I have been working with web tech for 6 years. I have experience with PHP, JavaScript, HTML, CSS, as well as libraries like Reactjs. I understand UI, UX, and good design. I have experience with the security side of projects. I know what clean and scalable code is. I have experience working with teams and project managers. I also had client facing roles.\n\nCan I use all this experience to transition into becoming a Software Architect? What additional knowledge can a web developer gain for a better chance at obtaining this new role?",
        "created_utc": 1672698209,
        "upvote_ratio": 1.0
    },
    {
        "title": "software maintenance",
        "author": "Haunting-Craft-3899",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101k66y/software_maintenance/",
        "text": "are there any automation tools used for documentation during the software maintenance process? Like for documenting the changes are made and keep the software document up to date",
        "created_utc": 1672685261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highschool dropout want to ask an important question",
        "author": "itzariadre",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101eufx/highschool_dropout_want_to_ask_an_important/",
        "text": "i want to get my GED to go to college for a comp sci degree but I'd like to know what math should i learn to prepare for college courses? just would like some advice thank you.",
        "created_utc": 1672672185,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best goal tracking app for software engineers",
        "author": "daquila1",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101doa4/what_is_the_best_goal_tracking_app_for_software/",
        "text": "I have been looking for a goal tracking app specifically to track career goals and milestones. I want to be able to track if I am:\n\n* reaching goals I've set out to do and learning new skills\n* Track time spent working on projects at work and on my side projects (we all have 37+ side projects lol).\n* to journal all career wins/impacts to be used at reviews/promotional times\n\nI am currently using ClickUp for goals, Toggl for time-tracking, and a google spreadsheet for journaling but I find these are too generic and get annoying to manage. Sometimes I give up tracking for a few weeks when things get busy at work. I recently set weekly one on ones with myself to fill out my tracking software, which has helped a little bit but still not ideal. I also don’t like that I have to use 3 different services. \n\nThank you for your answers in advance!",
        "created_utc": 1672669132,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Multi-Factor Authentication? &amp; How it Helps in Securing Applications",
        "author": "Dilip-Rajpurohit",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1019azj/what_is_multifactor_authentication_how_it_helps/",
        "text": " \n\nNowadays, security is a major issue for any type of application. Increase in large ransomware attacks, traditional passwords are no longer secure. It is recommended to have a few extra layers of security for every account online. Multi-factor authentication provides double security to access any application.\n\n## What is Multi-Factor Authentication (MFA)?\n\nMulti-Factor Authentication (MFA) is an authentication technique that needs the user to complete two or more verification layers to gain access to a particular resource such as a [web/mobile application](https://volansys.com/software-development-services/?utm_source=linkedin&amp;utm_medium=Article&amp;utm_campaign=AWS+Consulting+Partner&amp;utm_id=Software+Engineering&amp;utm_content=M05), online account, Windows PC system, or a VPN connection. MFA is a core component of a strong identity and access management (IAM) policy.\n\nFor example, If a user wants to access any application then the user must log in with the first login page using a valid username and password. After that, an additional security factor is visible for a second-time authentication. The system, application, or network will not allow you to access it unless you succeed in getting all these verification right.\n\n## There are multiple options for the 2FA\n\n1. Push notification on a mobile device\n2. OTP via SMS\n3. Mobile applications like Google Authenticator application\n4. IVRS call\n5. OTP via Email\n\n \n\n## There are also hardware type devices for the MFA\n\n1. FIDO Security Token\n2. Hard Token(Time and Event-based)\n\nBy using MFA, users are unable to access applications without a valid passcode. Despite one layer breaking, the attacker will still have to take on one or more barriers to gain access which is not an easy job for the attacker.\n\n## Why is Multi-Factor Authentication Important?\n\nA major benefit of MFA is that it will enhance your organization’s security by making your users authenticate more than just their username and password. Even though usernames and passwords are important, they can be easily stolen by third parties through brute force attacks. You can be sure that your organization will stay safe from cyber criminals by enforcing MFA factors such as a thumbprint or physical hardware key.\n\n## How Does Multi-Factor Authentication Work?\n\nThe method of multi-factor authentication involves the use of additional verification information which is also known as factors. The most common MFA factor that users use is one-time passwords (OTP). OTPs are those 4-10 digit codes that you often receive via email, SMS, or mobile app.\n\nWith OTPs, a new code is generated periodically or each time an authentication request is submitted. The code is generated based on a seed value that is assigned to the user when they first register. There are multiple ways or implementations to generate the OTPs or provide the second-factor passcode. Here is the list of different MFA Authentication methods that OTPs generate and how users receive those OTPs.\n\n&amp;#x200B;\n\nRead more... [https://volansys.com/blog/multi-factor-authentication/](https://volansys.com/blog/multi-factor-authentication/)",
        "created_utc": 1672654819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free YouTube Download v4.3.80.705 Multilingual Free Download | universeofsoftware.com",
        "author": "FalsePhone5903",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10170rg/free_youtube_download_v4380705_multilingual_free/",
        "text": "[removed]",
        "created_utc": 1672646252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free YouTube Download v4.3.79.630 Premium Free Download | universeofsoftware.com",
        "author": "FalsePhone5903",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101702q/free_youtube_download_v4379630_premium_free/",
        "text": "[removed]",
        "created_utc": 1672646178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software engineers: do you prefer working with technical or non-technical product managers? Why?",
        "author": "cs342",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1016zz9/software_engineers_do_you_prefer_working_with/",
        "text": "",
        "created_utc": 1672646169,
        "upvote_ratio": 1.0
    },
    {
        "title": "FontLab v8.0.0.8222 Beta Free Download | universeofsoftware.com",
        "author": "FalsePhone5903",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1016zb0/fontlab_v8008222_beta_free_download/",
        "text": "[removed]",
        "created_utc": 1672646102,
        "upvote_ratio": 1.0
    },
    {
        "title": "EF Commander 2022.07 Multilingual Free Download | universeofsoftware.com",
        "author": "FluidSalamBhai",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10154dz/ef_commander_202207_multilingual_free_download/",
        "text": "[removed]",
        "created_utc": 1672639711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy2Convert JPG to TGA Pro v3.1 Free Download | universeofsoftware.com",
        "author": "FluidSalamBhai",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/101537z/easy2convert_jpg_to_tga_pro_v31_free_download/",
        "text": "[removed]",
        "created_utc": 1672639600,
        "upvote_ratio": 1.0
    },
    {
        "title": "YouTube Movie Maker Platinum v22.03 (x64) Free Download | universeofsoftware.com",
        "author": "FluidSalamBhai",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10152q7/youtube_movie_maker_platinum_v2203_x64_free/",
        "text": "[removed]",
        "created_utc": 1672639553,
        "upvote_ratio": 1.0
    },
    {
        "title": "BitRecover MBOX Viewer v9.2 Latest Version Free Download | universeofsoftware.com",
        "author": "Fluid_Wait_7614Sanu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1014m64/bitrecover_mbox_viewer_v92_latest_version_free/",
        "text": "[removed]",
        "created_utc": 1672638044,
        "upvote_ratio": 1.0
    },
    {
        "title": "BitRecover MBOX to Gmail Wizard v9.0 Free Download | universeofsoftware.com",
        "author": "Fluid_Wait_7614Sanu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1014lfa/bitrecover_mbox_to_gmail_wizard_v90_free_download/",
        "text": "[removed]",
        "created_utc": 1672637981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ashampoo WinOptimizer v25.00.14 Multilingual Free Download | universeofsoftware.com",
        "author": "Fluid_Wait_7614Sanu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1014kph/ashampoo_winoptimizer_v250014_multilingual_free/",
        "text": "[removed]",
        "created_utc": 1672637915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another Bridge Building Parable",
        "author": "DelatBabel",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1014k4l/another_bridge_building_parable/",
        "text": "A client asks you to build a bridge across a river.\n\nWhat is the first question that you ask?  Not “how”, but “why”.\n\nThe client answers “because I need to get some people from one side of the river to the other side”.\n\nNow it just so happens that bridge building materials are very expensive at the moment – concrete, steel, stone, etc, have all recently become very expensive. However you do know someone who has a whole bunch of cheap boats for sale or rent, just nearby.\n\nSo you can solve the client’s problem (getting people across a river) in a different way. You can use all of those boats, which will be cheaper and hopefully no less efficient than building a bridge.\n\n**Moral of the story**: Always ask the rationale behind a software requirement. There is usually more than one way to solve any given problem, and sometimes the requirement itself might be badly stated or badly thought out. It is not the job of the software architect to blindly follow instructions. It is the job of the software architect to ask questions, understand the rationale, and propose solutions that best, and most cost effectively, meet the client’s goal.",
        "created_utc": 1672637863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Network Engineer here - I'd like to understand more about how systems/applications are designed. Any books you would recommend?",
        "author": "Fiveby21",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10147yw/network_engineer_here_id_like_to_understand_more/",
        "text": "I know... very little about what goes into designing/deploying an application beyond just the network layer. I'd like to fill that gap. Are there any good systems design books out there that you'd recommend for someone like me?",
        "created_utc": 1672636786,
        "upvote_ratio": 1.0
    },
    {
        "title": "High-Logic FontCreator v14.0.0.2856 Free Download | universeofsoftware.com",
        "author": "JavedAlisanu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100pn6j/highlogic_fontcreator_v14002856_free_download/",
        "text": "[removed]",
        "created_utc": 1672597340,
        "upvote_ratio": 1.0
    },
    {
        "title": "IM-Magic Partition Resizer v4.1.4 Latest Version Download | universeofsoftware.com",
        "author": "JavedAlisanu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100pmhg/immagic_partition_resizer_v414_latest_version/",
        "text": "[removed]",
        "created_utc": 1672597287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revisiting “Inventing on Principle”",
        "author": "iski1",
        "url": "https://medium.com/@shashikanth_a/revisiting-inventing-on-principle-447ef57f129b",
        "text": "",
        "created_utc": 1672596314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apeaksoft iOS Unlocker v1.0.36 Multilingual Download | universeofsoftware.com",
        "author": "Jaded-Ad4423",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100ow9v/apeaksoft_ios_unlocker_v1036_multilingual/",
        "text": "[removed]",
        "created_utc": 1672595376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Minitab v21.2 + Fix Key Latest Version Free Download | universeofsoftware.com",
        "author": "Jaded-Ad4423",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100otww/minitab_v212_fix_key_latest_version_free_download/",
        "text": "[removed]",
        "created_utc": 1672595195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apeaksoft iOS Unlocker 1.0.36 Multilingual Free Download | universeofsoftware.com",
        "author": "Jaded-Ad4423",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100ot8b/apeaksoft_ios_unlocker_1036_multilingual_free/",
        "text": "[removed]",
        "created_utc": 1672595145,
        "upvote_ratio": 1.0
    },
    {
        "title": "All Video Downloader Pro 7.10.3 Free Download | universeofsoftware.com",
        "author": "Jaded-Ad4423",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100os1a/all_video_downloader_pro_7103_free_download/",
        "text": "[removed]",
        "created_utc": 1672595061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is a better career path: CFA (FINANCE) or Software Engineering?",
        "author": "Happy-Author8649",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100oi4p/which_is_a_better_career_path_cfa_finance_or/",
        "text": "I am final year undergraduate pursuing Economics with a minor in Computer Science (India).\n\nI have done some Leetcode to practice Data Structure and Algorithms but left it when it became difficult, maybe didn't give my 100%,\n\nI am equally inclined to both paths. I want to dedicate next 9 months before applying for jobs. I want to decide in next few days and dedicate 6 months just on that (CFA L-1 or Coding on GFG/LeetCode).\n\nWhich path is more lucrative and offers more opportunities.\n\nMy aim is to grow quickly and move abroad.",
        "created_utc": 1672594311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepting Toil: Lego Mindset vs. Woodworking Mindset",
        "author": "subsun",
        "url": "https://scottstevenson.substack.com/p/lego-mindset-vs-woodworking-mindset",
        "text": "",
        "created_utc": 1672590679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best major for good money while also having a social life MIS or CS?",
        "author": "Putin666",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/100lc48/best_major_for_good_money_while_also_having_a/",
        "text": "Making money is important to me, but I don't need 200K/year. I do however want a safe job with good work life balance and decent pay. I want to be able to spend a decent amount of my life making friendships and spending time with friends.\n\nPlease help me decide Management Information Systems vs Computer Science, I'm losing my mind lol.\n\n# Computer Science (CS)\n\nPros:\n\n* More likely to make a lot amount of money.\n* Probably more work from home jobs.\n* If AI starts stealing everyone's job 15 years from now, CS might be a good place to be if I can get into machine learning and help run the AI.\n* Problem solving can be cool\n* Maybe way worse work life balance than MIS in college, but way better work life balance than MIS like 2 years out of college??\n\nCons:\n\n* Courses are much harder than MIS, thus less time to spend building friendships.\n* To be competitive for internships and jobs you also need to spend a significant amount of time outside of classes learning actual skills. So even less time free time as if the classes don't demand enough time.\n* Supposedly there is huge saturation, at the very least there is in the entry level. This is maybe one of the biggest cons. The big issues from my understanding that causes this and why it is a real issue and not just short term like the recession/tech layoffs are as follows:\n\n1. The huge rise of social media selling the idea that everyone can make 100K if they come into the industry. Now seems like everyone is doing boot camps.\n2. Even without the self-learning and boot camp craze, the computer science graduates per year have doubled from 50K ten years ago to now over 100K new CS grads per year.\n3. Global outsourcing.\n4. ChatGPT/AI will advance exponentially, and will allow for workers to be more efficient leading to less workers needed, if any at all eventually.\n\n# Management Information Systems (MIS)\n\nPros:\n\n* Supposedly it's pretty common for people to make 80K starting from Temple University with MIS, I can easily go to this school.\n* MIS is mix of CS and business stuff, so I'd imagine I'd have way more jobs I can get into with this degree for way better job safety. AND if I want to, I can always self-learn most CS skills if I wanted to get CS jobs. And I could get masters in CS if I wanted to.\n* Probably was less competition and saturation than CS field.\n* MIS is known to be an easier degree, plus I don't need to learn a hole bunch of stuff on top of the courses just to get hired, so more time for friends.\n\nCons:\n\n* Maybe easier job to replace with AI?? If AI takes over every job, it will be harder to get into the AI/ML stuff with MIS\n* Probably slightly lower average pay and lower ceiling for pay??\n* People call it the CS drop out degree\n* Maybe not as many work from home jobs, although honestly it's probably comparable??\n* Maybe initially work life balance is better than CS, but not long term??\n\n&amp;#x200B;\n\nNo matter which degree I choose, I am still a dedicated student and will work hard to be competitive for internships and jobs, I just really value work life balance so I can spend time with friends.\n\nWhich path do you think makes sense if I want to make decent money, but also be able to have plenty of time to touch grass and hang with friends?\n\n&amp;#x200B;\n\nTLDR: MIS will maybe give me more free time than CS with only a bit less money???",
        "created_utc": 1672585185,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Sell Event Tickets Fairly",
        "author": "fagnerbrack",
        "url": "https://barnabas.me/blog/2022/11/selling-tickets-fairly",
        "text": "",
        "created_utc": 1672536901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for computer recommendations",
        "author": "roseboy19",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1002c6t/looking_for_computer_recommendations/",
        "text": "Hello all! I am starting a software engineering program this semester and am looking for computer recommendations. \nHere are the parameters the school suggests:\n\nFHD resolution\n16GB Ram\n512GB SSD HD\nIntel Core i7 (Gen 6 or later) \nWindows 10th ed os, x-64 bases processor \nBuilt in ethernet port\nSolid State Drive\n\nAny help is appreciated\n\nThanks!",
        "created_utc": 1672516893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to get into industry.",
        "author": "gunnerSmate45",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1000e08/trying_to_get_into_industry/",
        "text": "So I am attempting to leave education and get into the software engineering field. I have a BA in History and will begin studying Linux and Unix on my own starting Monday. My friend and colleague got a job working in the industry with only an Accounting BS. Basically my question is, is it possible to get a good paying job in the industry without a degree specifically in Software Engineering?",
        "created_utc": 1672511286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting started with ERPs?",
        "author": "andres910",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzyxk8/getting_started_with_erps/",
        "text": "Hey guys, It's come to my attention recently that where I live there is still a surprising amount of businesses that handle inventory and accounting MANUALLY. I've talked with 2 friends that work at family owned businesses (that move a good amount of money) and have told me they need some sort of inventory system.\n\nI've only done web dev in the past and know nothing about this area (ERPs). The only advice I've gotten is it's better for the business to find an off-the-shelf solution rather than contracting a local company to develop and maintain a system.\n\nSo I'm here to ask how can I get started and what off-the-shelf solutions do you guys recommend? Also how do you go about charging businesses for setting these systems up?",
        "created_utc": 1672507296,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the date of the latest version of JDeodrant? and does it still have wide uses",
        "author": "Weak_Employee_3156",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzxmbf/what_is_the_date_of_the_latest_version_of/",
        "text": "",
        "created_utc": 1672503679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advanced System Care Pro v15.4.0.250 + Fix Free Download | universeofsoftware.com",
        "author": "InformalBrief1692",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zztpyj/advanced_system_care_pro_v1540250_fix_free/",
        "text": "[removed]",
        "created_utc": 1672491968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Video Converter Professional v7.1.6 + Fix Download | universeofsoftware.com",
        "author": "InformalBrief1692",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zztpd9/any_video_converter_professional_v716_fix/",
        "text": "[removed]",
        "created_utc": 1672491912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adobe Premiere Pro 2022 v22.5.0.62 (x64) Free Download | universeofsoftware.com",
        "author": "InformalBrief1692",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzto4q/adobe_premiere_pro_2022_v225062_x64_free_download/",
        "text": "[removed]",
        "created_utc": 1672491806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adobe Premiere Pro 2022 v22.5.0.62 (x64) Free Download | universeofsoftware.com",
        "author": "InformalBrief1692",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zztn53/adobe_premiere_pro_2022_v225062_x64_free_download/",
        "text": "[removed]",
        "created_utc": 1672491717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classroom Spy Professional v4.8.6.0 Free Download | universeofsoftware.com",
        "author": "Legitimate-Leg431",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzr8sp/classroom_spy_professional_v4860_free_download/",
        "text": "[removed]",
        "created_utc": 1672482913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Active Partition Recovery Ultimate v22.0.0 (x64 Download | universeofsoftware.com",
        "author": "Legitimate-Leg431",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzr7uh/active_partition_recovery_ultimate_v2200_x64/",
        "text": "[removed]",
        "created_utc": 1672482816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Active Partition Recovery Ultimate v22.0.0 (x64 Download | universeofsoftware.com",
        "author": "Legitimate-Leg431",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzr6xe/active_partition_recovery_ultimate_v2200_x64/",
        "text": "[removed]",
        "created_utc": 1672482717,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I create a gantt chart for software development project?",
        "author": "web_deb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzqmfs/how_do_i_create_a_gantt_chart_for_software/",
        "text": "I'm trying to sketch a roadmap (we already have our requirements written in high-level) but I can't find any examples online, the templates I've come across haven't really given me a good understanding. My boss knows that any timelines will be just an approximation, but I still have to show something. Basically I'm trying to put things like devops, testing, development, ui/ux etc into some sort of timeline, the project is just me and another developer. Any suggestions or examples will be much appreciated!",
        "created_utc": 1672480474,
        "upvote_ratio": 1.0
    },
    {
        "title": "$1,064 Worth of 21 Programming Books by Packt for $15 ( -98% OFF)",
        "author": "Sebert6812",
        "url": "https://dealshumb.com/soft",
        "text": "",
        "created_utc": 1672477352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have I become an example of the Peter Principle?",
        "author": "MaybePeter",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zzhjaq/have_i_become_an_example_of_the_peter_principle/",
        "text": "[removed]",
        "created_utc": 1672449781,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Amazon Distributed Computing Manifesto",
        "author": "fagnerbrack",
        "url": "https://www.allthingsdistributed.com/2022/11/amazon-1998-distributed-computing-manifesto.html",
        "text": "",
        "created_utc": 1672437902,
        "upvote_ratio": 1.0
    },
    {
        "title": "So can getting a computer science bachelors get me in software engineering?",
        "author": "Invincible_N",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zza5a2/so_can_getting_a_computer_science_bachelors_get/",
        "text": "Im really trying to find out ways to get in software engineering and ive heard you can get a software engineering job with a computer science degree.is this true?",
        "created_utc": 1672430969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why talented Software Engineers Leave good companies.",
        "author": "MethodElectrical2686",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zz98rx/why_talented_software_engineers_leave_good/",
        "text": "[removed]",
        "created_utc": 1672428769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Materialised views for serious performance gains",
        "author": "dine-ssh",
        "url": "https://dinesh.wiki/posts/materialized_view_sql_queries_on_steroids/",
        "text": "",
        "created_utc": 1672419113,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Amazing Software Testing Books You have to Read",
        "author": "creasta29",
        "url": "https://medium.com/@neciudan/5-amazing-software-testing-books-you-have-to-read-6f12ab3cb2d2",
        "text": "",
        "created_utc": 1672390608,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're a software engineering student, check this out 👇",
        "author": "PrintHot5598",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zyu7ab/if_youre_a_software_engineering_student_check/",
        "text": "[removed]",
        "created_utc": 1672384967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Digital Marketing project",
        "author": "One_Direction_Lover",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zysygv/digital_marketing_project/",
        "text": "So heyy I got a project to make a Software on Digital Marketing Business/Agency. So I don't understand what model to use and what things I should include\n\nP.S - We just have to create a documentation and not the actual software (things like requirement gathering,SRS and all).",
        "created_utc": 1672380748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leetcode optimization question",
        "author": "Place-Wide",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zysio3/leetcode_optimization_question/",
        "text": "I'm very new to LeetCode, but I am an experienced developer.   I just submitted the answer to a problem 2 ways, one was memory optimized and one was speed optimized.  Leetcode told me my mem optimized code was better than most for mem optimization, and my space optimized code was better than most for space optimization, which is predictable.  What I'm wondering though is is there a way to see how far from an optimal solution my code was?  Like if there was a way to optimize for both time and space that I am missing?",
        "created_utc": 1672379378,
        "upvote_ratio": 1.0
    },
    {
        "title": "RecoveryTools Office 365 Backup Wizard v6.4 Download |universeofsoftware.com",
        "author": "Tasty-Hold-1696",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zypqib/recoverytools_office_365_backup_wizard_v64/",
        "text": "[removed]",
        "created_utc": 1672371081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Power Data Recovery 11.0 With Key Free Download |universeofsoftware.com",
        "author": "Tasty-Hold-1696",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zypnp2/power_data_recovery_110_with_key_free_download/",
        "text": "[removed]",
        "created_utc": 1672370857,
        "upvote_ratio": 1.0
    },
    {
        "title": "MyLanViewer v5.3.2 Enterprise Portable Free Download",
        "author": "Tasty-Hold-1696",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zypmo5/mylanviewer_v532_enterprise_portable_free_download/",
        "text": "[removed]",
        "created_utc": 1672370773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Messed up my terminal",
        "author": "arc99999",
        "url": "https://v.redd.it/bag1q8w85z8a1",
        "text": "",
        "created_utc": 1672361462,
        "upvote_ratio": 1.0
    },
    {
        "title": "ML Roadmap, and is it the same as being a Data Scientist?",
        "author": "Holahola836",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zyjlm9/ml_roadmap_and_is_it_the_same_as_being_a_data/",
        "text": "What’s the difference in skill set?",
        "created_utc": 1672355333,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up",
        "author": "madurhere",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zyg41c/i_messed_up/",
        "text": "I'm a web developer student. Currently we are learning how to do the backend. I need to install MongoDB but for some reason the password isn't working in my WSL terminal when I type it in. I'm guessing I have the wrong password. I'm unable to continue with my course until I install MongoDB and am completely stuck.   \nAny tips or tricks to resetting the password in WSL?\n\nOR  \n\n\nIs there another way to install MongoDB to where I don't need my password for WSL?  \n\n\nI'm completely stuck and appreciate any help.",
        "created_utc": 1672347208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noob question: Does message brokers (like Kafka) require proxies?",
        "author": "_seeking_answers",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/zy1mhx/noob_question_does_message_brokers_like_kafka/",
        "text": "I’m a software engineering student and I was arguing with a colleague about some projects we’re carrying on. In this particular case our requirements say we must use KAFKA as message broker to handle some events.\nSince KAFKA is a broker (message broker) I say that we must use 2 PROXIES (skeleton and stub) to handle client and server network requests. My colleague, otherwise, thinks that since proxies aren’t explicitly requested (only KAFKA is required) we don’t have to use them.\n\nI don’t agree with him because if we don’t use proxies, which software component handles network exceptions? If Kafka couldn’t reach any server how our software responds? Who filters duplicated network requests? And I could go on….",
        "created_utc": 1672307846,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Need for Product Software Engineering",
        "author": "WMRamadan81",
        "url": "https://medium.com/@wmramadan/the-need-for-product-software-engineering-2302ad7bf62d",
        "text": "",
        "created_utc": 1672298449,
        "upvote_ratio": 1.0
    }
]