[
    {
        "title": "The Jury is Out on Build vs. Buy: Thanks to Subhash Choudhary, CTO at Dukaan",
        "author": "naughtyguiman",
        "url": "https://truto.one/blog/the-jury-is-out-on-build/",
        "text": "",
        "created_utc": 1677005582,
        "upvote_ratio": 0.5
    },
    {
        "title": "Ordering variables and functions alphabetically",
        "author": "Undisclosed_Argument",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1188vwa/ordering_variables_and_functions_alphabetically/",
        "text": "[removed]",
        "created_utc": 1676997312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Java Virtual Threads – Easy introduction",
        "author": "mike_jack",
        "url": "https://blog.ycrash.io/2023/01/20/java-virtual-threads-quick-introduction/",
        "text": "",
        "created_utc": 1676983542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Benefits of outsourcing software development",
        "author": "SovTechZA",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1182auh/benefits_of_outsourcing_software_development/",
        "text": "In the fast-moving arena of today’s global market, you need to ensure that your company is doing everything possible to maximise efficiency, minimise costs, and maintain quality. One increasingly popular way to do this is through outsourcing. Outsourcing is the way companies can delegate specific tasks to others who may be more specialised in that field. It involves hiring an outside company or individual to provide the necessary services without requiring your company to hire in-house employees for the job.\n\nFor many companies, software development is a vital area of their business. Without in-house software development experts, however, this task can take an inordinate amount of time and money from the business that could be used for more beneficial purposes. This is why many of the world’s top companies are choosing to outsource software development. With outsourcing, companies are getting access to teams of experts they may not otherwise have. Choosing the right software development company is essential, as your company needs to hire a team that offers its services with security, quality, and reliability.\n\n## Why Outsourcing Software Development is Beneficial for Your Business\n\nSoftware development outsourcing carries with it several advantages. Without it, companies that may not be founded upon software development, but may need it for specific purposes, would be forced to go through the long and tedious process of finding, interviewing, and hiring experts. Additionally, because they would only need their services for a brief period, many experienced software developers would not be interested in working on a short-term contract.\n\nThe other benefits of outsourcing software development include cost savings, access to specialised skills, faster market release, and the ability to stay up-to-date with the latest technologies. More than this, outsourcing gives companies flexibility, and the right software development company can provide quality assurance so that you can be confident of the results. Allow us to elaborate:\n\n## The Cost Effectiveness of Outsourcing Software Development\n\nOne of the most compelling advantages of outsourcing is that it can help companies save money by reducing costs associated with in-house software development projects. There are several reasons for this. Firstly, by outsourcing, your company does not have to put in the time and money required of HR to find and hire a team of developers. Instead, you would only be paying for the software development.\n\nSecondly, external companies typically charge lower hourly rates than those set by internal personnel due to their lack of overhead expenses, such as office space. This ties right into the third point. By outsourcing, your company also reduces operating expenses. Because it is what they are solely focused on, software development companies will already be equipped with the right tools and technologies for the job, so you don’t have to worry about those costs.\n\nLastly, your company saves time by outsourcing, and as they say, time is money. While the software development company works on your project, HR and other departments in your company will have more time to spend on the tasks that require their attention.\n\n## Access to Specialised Skills from Software Development Experts\n\nUnlike what you might get when hiring individuals on a short-term contract, outsourcing software development allows you to work with highly experienced developers from around the world. Additionally, software development companies will often have different teams of developers who possess specific skill sets that are necessary for the successful creation of complex software projects, such as artificial intelligence or blockchain experts. Outsourcing to a company with these teams means you can hand-pick the team with the right skillset required for your software.\n\nOutsourcing software development also means that you will have access to a team made up of not only elite programmers but agile project managers, business analysts, and CTOs. This presents your company with the added benefit of software specialists who can advise and consult on the development of your software.\n\n## Why Outsourcing Software Development Leads to Faster Market Release\n\nWhen you outsource software development to a third-party firm, your company can benefit from streamlining processes related to project management. While the experts work on creating and revising your software, your in-house teams can focus on preparing a fast and seamless go-to-market strategy. This might mean spending more time on marketing or the placement or targeting of your investments.\n\nThis increased efficiency results in a faster market release without compromising on quality standards. Outsourcing also means that the team of expert developers will be solely dedicated to your project and, therefore, will be able to deliver results faster, rather than having internal staff that might be distracted by having to perform multiple tasks.\n\n## The Importance of Staying Up to Date with the Latest Technologies in Software Development\n\nWhen [developing software](https://www.SovTech.co.za/software-development/) in today’s global market, your company needs to be using the latest first-rate technologies. If you use an in-house team of developers, you would need to acquire these technologies and ensure the team knows how to use them. On the other hand, if you hire a software development company, they will already have access to these tools, and their teams will have experience with them.\n\nFurthermore, to stay on the cutting edge, software development companies are always looking into the latest tech and finding ways to implement them into existing and future projects. Outsourcing to such a company allows your business to have your software developed with the best technologies to suit your objectives, resulting in a completely custom and modern solution to improve your software.\n\n## How to Choose the Right Software Development Company\n\nNow that you know the benefits of outsourcing, you need to know how to find the right [software development company](https://www.sovtech.co.za) for your needs. The best company is one that has extensive experience in the field, working with many different organisations and developing different kinds of software. Ensuring the company considers legal compliance is another vital factor to look out for.\n\nIt is also beneficial to work with a software development company that partners with the giants of technology, like AWS and Zendesk, so that you can know you are getting the best results. Finally, the company your business works with should have a managed team structure, where they take care of all the particulars of software development rather than leaving the management up to your in-house staff.",
        "created_utc": 1676982548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Software Testing Company In India",
        "author": "palanikumar9",
        "url": "https://www.biovustechnologies.com/software-testing.php",
        "text": "",
        "created_utc": 1676972740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Design principle against sending all the data into another system just because we can",
        "author": "stonefudge",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117zi9r/software_design_principle_against_sending_all_the/",
        "text": "My boss does not have a software engineering background. And yet, he now claims to be the solution architect of a marketing project. \n\nI'll cut to the chase. We want to send a detailed transaction event to a destination (a marketing platform). It's quite a big event (a rather hefty JSON payload). I'm against sending everything in the event to the destination system just because we can. I have spent time going through all the data in the file to pick only relevant information and come up with a good mapping model.\n\nTo him, it just does no harm. Just send the entire thing anyway. Maybe someone will use them in the future.\n\nIf we put the extra cost of unnecessary updates aside, how can I convince him that this is not a good design decision? Are there any Software Development principle or Design Pattern that helps my argument?",
        "created_utc": 1676972198,
        "upvote_ratio": 1.0
    },
    {
        "title": "web development",
        "author": "benjicode",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117yfwy/web_development/",
        "text": "hello I have been getting into web development lately , I have learned basics of  html/css/js , built small projects  and started  learning react, actually my goal is to get a job, I have big gap in my career due to sickness  ,  l have watched few YouTube videos where ppl have been talking about learning either c++ / java with data structure and algorithms for getting a job,  now   I don't know what to do now, I am interested in front end   , does anyone suggest any roadmap for getting a job , lately I have been overthinking without learning anything about not  getting a  job  in the end  ,  is getting a job for me in software impossible? I am willing to learn java with DSA but thinking if it would actually benefit me or not , I am stuck in between choosing c++/ java or continuing with my front end path,  I am open to suggestions please help me figure out a way , thank you in advance.",
        "created_utc": 1676967990,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking to build a team for my social media app that I'm creating. Also one of my questions was how do big social media companies handle large amount of users. I understand it has something do with network overload/CPU/IO/RAM usage. please let me know if anyone is interested in discussing furthe",
        "author": "Individual-Ad5877",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117v686/im_looking_to_build_a_team_for_my_social_media/",
        "text": "",
        "created_utc": 1676956207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Document repository options. The pros and cons of the current offerings",
        "author": "mrpiggy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117m3pa/document_repository_options_the_pros_and_cons_of/",
        "text": "I have never worked anywhere, where everyone could agree what made a good documentation tool. I've used Confluence, Github discussions, Google Docs, as well as being forced to use solutions like Dropbox. We do like to complain as a professional group, but this topic does seem to be a contentious one. \n\nGithub discussions do keep the docs close to the code. But are limited in what you can do within a document. And often docs don't really belong tied to any one repo. They do seem to have the best commenting options. But not having a rich document search feature, seems a big down side to me. \n\nConfluence seems to have a rich set of content and media creation tools. It also has the potential benefit of being able to link docs to Jira objects. It probably also has the best doc search tools I've come across. Of course Confluence, and most other Atlassian tools can be bloated beasts. I've also heard complaints that it's easy for documents to get lost or burried in the way that navigation is handled. \n\nDon't get me started on using Dropbox or other like tools. But I'm curious to know what other people find useful, or super painful, in the tools they've had to use for documentation creation, and discov ery.",
        "created_utc": 1676930906,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all the competent developers who actually write \"good\" code, do you get recognized for your work and does it feel good to get said recognition?",
        "author": "FlyingAces",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117c9pb/to_all_the_competent_developers_who_actually/",
        "text": "It feels good to be recognized for a job well done, be it plastic surgery, art, cabinet making, or software development.  Do good software engineers get recognized, and if so, from who?  Does it feel good?  I'm sure a good developer get a favorable reputation over time and have head hunters blowing up their phones.  I can seen how that could feel good and annoying at the same time.  But aside from that, where else does the recognition come from?",
        "created_utc": 1676910303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going for Masters in US, which is a better choice from below options.",
        "author": "Marshal_programmer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117b1tw/going_for_masters_in_us_which_is_a_better_choice/",
        "text": "[removed]",
        "created_utc": 1676908657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going for Masters in US, which is a better choice from below options",
        "author": "Marshal_programmer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/117apsn/going_for_masters_in_us_which_is_a_better_choice/",
        "text": "[removed]",
        "created_utc": 1676908181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mac vs Windows (PROGRAMMING)",
        "author": "SnapMeOutOft",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1179s8h/mac_vs_windows_programming/",
        "text": "Good day people\n\nI am tired of all the marketing, yes I get it Mac is far superior hardware/design/user experience and people claim software engineers all tend to go for them.\n\nI used Mac for about 10 years and since becoming a software engineer I have been using windows and enjoying it just fine, love the snapping windows and window previews you get on windows as well.\n\nBut now I need a new personal machine and looking at the arm macs which are blazing fast but I mean for strictly dev, mainly backend what actual reasons can you give me that mac is better? (no I don’t want linux at all lol)",
        "created_utc": 1676906882,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is one project you wanted to do but couldn’t",
        "author": "jouman99999",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/11772nq/what_is_one_project_you_wanted_to_do_but_couldnt/",
        "text": "Whether it was money, complexity, time, having too ambitious idea, or any other issue stopping you from going through?",
        "created_utc": 1676900838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey for Software Engineering candidates",
        "author": "spicy_spicy_boi",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1174kcp/survey_for_software_engineering_candidates/",
        "text": "Hello! We're a team of students from the National University of Singapore conducting a survey to learn about the experiences of software engineering candidates during technical interview preparation.  If you've participated in such an interview, we'd love to hear from you! \n\nThe survey takes just 5-10 minutes to complete, and all responses are anonymous. Your feedback will be invaluable in helping us create a more effective and useful interview preparation platform!  Survey link: [https://forms.gle/f5cUhAVDac67iJ1R8](https://forms.gle/f5cUhAVDac67iJ1R8)  \n\nPlease share this survey with any other software engineering friends who may be interested. Thank you for your participation!",
        "created_utc": 1676893323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to spend $2k Learning &amp; Development budget?",
        "author": "This_Armadillo_4970",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1173ybf/where_to_spend_2k_learning_development_budget/",
        "text": "[removed]",
        "created_utc": 1676891087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test Isolation is Expensive",
        "author": "emanresu_2017",
        "url": "https://www.christianfindlay.com/blog/test-isolation-expensive",
        "text": "",
        "created_utc": 1676889650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Continuous File Backup/Snapshotting with Versioning",
        "author": "bakaasama",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1172mtw/continuous_file_backupsnapshotting_with_versioning/",
        "text": "Is there a public tool for continuous backup of uncommitted code? eg. for when you invariably delete a file you spent a week working on and need to roll back.\n\nWhen I was at Google, we had a tool called CitC (Code in the Cloud) that performed of \"magic\" snapshots of file history.\n\nThere was a magic folder structure that looked something like\n\n    /\n    - .snapshots/\n      - seconds_ago/\n        - 1/\n        - 2/\n        - 3/\n        ...\n      - minutes_ago/\n        ...\n      - hours_ago/\n        ...\n      ..\n\nGoing into the appropriate directory would reveal a full snapshot of the files and directory structure at that time.\n\nIt doesn't have to be as magical or be implemented the same way as above, but any sort of snapshot or incremental backup suggestions are welcome.\n\nThanks! :)",
        "created_utc": 1676885978,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is my humble take on microservices, with quite a long content and several links for more articles. I hope you like it!",
        "author": "alexhernandezeng",
        "url": "https://alexhernandez.info/articles/microservices/",
        "text": "",
        "created_utc": 1676880340,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Continuous Testing Can Help You Test Smarter?",
        "author": "testmetrys",
        "url": "https://testmetry.com/how-continuous-testing-can-help-you-test-smarter/",
        "text": "",
        "created_utc": 1676876375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Global Engineering Teams",
        "author": "TheAeseir",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116wwo1/global_engineering_teams/",
        "text": "Some of the challenges I see with clients stem from globally distributed teams and team members, especially now that a lot move towards remote first to be able to access greater talent pools.\n\nKeen to learn how you have dealt managing globally distributed teams?\n\nHave you come across material that has helped you tackled this challenge?\n\nAre there key rules you abide by to help you reduce impact of this challenge?",
        "created_utc": 1676864967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project design help",
        "author": "Dazed_Monkey44",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116om0e/project_design_help/",
        "text": "I’m embarking on a project that will tokenize video formats (mp4, .mov, etc). \n\nBy parsing the contents of the video, it will generate a unique key. Each unique video will create its own unique key. \n\nIn addition, by submitting a file to the server, you can also get a response based on whether a key was created previously for that video or not.\n\nAt this time, it will only accept the original file as an identical, but the program will become more flexible by authenticating using real-time contents of the video.\n\nGuidance here will be appreciated,\n\nor any questions I can address.\n\nThanks.",
        "created_utc": 1676842406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding boot camp. Is it worth it? Will I be able to get a job? Bootcamp recommendations welcome.",
        "author": "Zolofty9",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116n8yg/coding_boot_camp_is_it_worth_it_will_i_be_able_to/",
        "text": "So far I’ve self-taught myself html css JavaScript and a few other small things through projects. Ive build websites from scratch and have some projects on my GitHub. But I want to really dedicate myself to learning and get into software engineering and development. \n\nAre coding bootcamps worth it? They’re pricey and I don’t mind paying for it as long as I know it’ll be respected when I try looking for a job in the field. \n\nWhat bootcamps would be recommended?\n I’m currently leaning towards Georgia Techs coding bootcamp. Is it good? Is it respected?",
        "created_utc": 1676838969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hotspot Shield Crack Free Download - Shan PC Crack",
        "author": "usmanalio",
        "url": "https://shanpccrack.com/hotspot-shield-crack-free-download/",
        "text": "",
        "created_utc": 1676830887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pinegrow Web Editor 7.2 Crack + Serial Code Free Download",
        "author": "usmanalio",
        "url": "https://shanpccrack.com/pinegrow-web-editor-crack/",
        "text": "",
        "created_utc": 1676829246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entrepreneurship guidance?",
        "author": "Acceptable-Win4485",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116hwn0/entrepreneurship_guidance/",
        "text": "Hi,  \nI'm a Software Engineering graduate who's just got there foot into the industry 2 years post graduating. I have a couple of ideas I would like to start up as an entrepreneur but have absolutely no clue on how to implement them on such a scale I have thought about. I thought getting my foot into the industry as an SE would help but it's only confused me even more on how to execute my ideas.\n\nI realise the question I'm about to ask have pretty obvious answers to them. But, nonetheless, I guess I'm looking for some tailored motivation or direction? Are there any similar Software Developers/ Engineers who have been in a similar position as me? And do you guys have any advice on how to progress? Or even take the first step in the right direction?",
        "created_utc": 1676826011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a tool to convert GIT repositories to diagrams",
        "author": "Inmortal2k",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116f2qv/is_there_a_tool_to_convert_git_repositories_to/",
        "text": "Is there a good tool to convert a given GIT repository to UML diagrams? I am trying to get familiar with a new python codebase and would like to be able to see a high level view of it before I start reading the code. \n\nI mean something like this [https://www.gituml.com/](https://www.gituml.com/), but better.",
        "created_utc": 1676821249,
        "upvote_ratio": 1.0
    },
    {
        "title": "The right feature at the right place",
        "author": "nfrankel",
        "url": "https://blog.frankel.ch/right-feature-right-place/",
        "text": "",
        "created_utc": 1676818051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peer review issues",
        "author": "Haki_User",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116buf8/peer_review_issues/",
        "text": "Hello,\nRecently I submitted a merge request for a ticket that was assigned to me. Everything was tested thoroughly and the code was solid. \n\n2 senior developers passed by the project and they left a few useful reviews, which I applied. \n\nBut then a third senior developer went and left like 40 comments. Basically it was all about formatting and that I implement things his way. Whenever I argued that I don't believe the alternative he proposes addes any value he says readabilty.\n\nEverytime I apply what he says he leaves new comments. Sometimes he asks to change exactly what he proposed. He reviewed my MR like 6 times. \n\nI'm working on another ticket and every time he does this I have to completely stop what I'm doing and go back to deal with another one of his endless remarks.  \n\nIs this common? Did it happen to someone else? How do I deal with the situation?",
        "created_utc": 1676816771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your software workflow complicated? Here's How To Fix It",
        "author": "marshallalllen",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/116841d/is_your_software_workflow_complicated_heres_how/",
        "text": "As the software industry expands, it's critical to find new ways to streamline workflows and ensure the security of your products, which will put you ahead of your competitors in 2023.\n\nThat's where Web3 comes in. Web3 technology has the potential to revolutionise the way we work and enhance productivity and security in the software industry.\n\nLet's discuss seven innovative ways that Web3 will influence the software industry in 2023.\n\n1. Streamlining Data Management with Decentralized Storage Solutions\n2. Automating Workflows With Smart Contracts and Blockchain Automation\n3. Simplifying Payment Processing with Crypto Payment Gateways\n4. Enhancing Collaboration with Decentralized Applications (DApps)\n5. Reducing Cost with Decentralized Finance (DeFi) Solutions\n6. Boosting Efficiency with Web3 APIs and Blockchain Interoperability\n7. Redefining Asset Monetization with NFTs (Non-Fungible Tokens) on the Blockchain",
        "created_utc": 1676805585,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Software Projects Are Hiring Managers Looking For?",
        "author": "ORKinSpace",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115xa31/what_software_projects_are_hiring_managers/",
        "text": " I've been looking for software jobs recently and I'm curious to know what kinds of software projects are in high demand among hiring managers and companies. I know that there are certain programming languages and technologies that are more popular than others, but I'd love to hear more about specific software projects that companies are looking for.",
        "created_utc": 1676768353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone .Im trying to access to a database with different computer .computers are on same Lan , just ports are different but this problem occurs , any idea?",
        "author": "Original-Frame-9384",
        "url": "https://www.reddit.com/gallery/115mzed",
        "text": "",
        "created_utc": 1676748183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Got a Job as a Software Engineer its My First One as Such",
        "author": "subinatub32",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115kfya/just_got_a_job_as_a_software_engineer_its_my/",
        "text": "So I just got hired on as a SE at the company I work with and started this week. Im still in college and feel unprepared and overwhelmed. What is some advice to just try and continue to show I can do this. I feel like they could have picked someone better than me and I have zero clue as to why they chose the dumb college kid for this position kind of deal. Thanks for the read!",
        "created_utc": 1676741335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Help about CS fundamental subjects.",
        "author": "urvashi_rautela_fan",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115h4t1/need_help_about_cs_fundamental_subjects/",
        "text": "Hey everyone! I am from India preparing for Coding interviews. Apart from coding, subjects like os, DBMS, computer networks are also very important. So I was needing some website (Like gfg) to read about the subjects and make notes. What is the best website other than gfg for these purpose.",
        "created_utc": 1676732304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Freelance Jobs",
        "author": "Andy_DeWitt",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115gk7c/freelance_jobs/",
        "text": "Hello, I'm a software engineer, I live in the Czech Republic, and I hear information about good freelance offers very often with stories like \"I'm working as a developer or DevOps and making 10-30k$/month\".  Where do you find such jobs guys? Do you sign a B2B contract?",
        "created_utc": 1676730629,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to stand out",
        "author": "No-Dimension69",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115dlss/how_to_stand_out/",
        "text": "so i just finished my first semester in engineering and i've got good grades however i feel like now grades aren't enough and to actually land a job and become successful u need more than that. so i was wondering what would u recommend me to do to become better in general. also what skills will i need to learn to be able to get a remote internship as i live in a country that doesn’t provide that many tech opportunities",
        "created_utc": 1676720894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanna complain about my boss with my boss's boss, is it a good idea?",
        "author": "DeadLockException",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/115dl3h/i_wanna_complain_about_my_boss_with_my_bosss_boss/",
        "text": "Hi all, I am a software engineer and I have been working for this big company for 3 years. Last year I changed team and my current manager is very incompetent. I have tried talking to him but it seems that every month he comes with some awful idea that, in my opinion, has the only consequence of breaking teamworking. \n\nThe point of my question is not much about those decisions but about the idea of complaining with his boss. I want to understand how bad this idea is as I can't see how things can go well for me.\n\nAdding a bit of context, my manager is not doing anything illegal or unethical but he is feeding a team culture based on blaming games that can only break thrust within the team and pushing people to leave the team(half of which has joined last year, so turnover is quite huge). My boss's boss works out of the team and I am afraid he is not aware of shit happening. Unfortunately I don't know him, only met a couple of time, seems smart but no idea how he would react.\n\nMy idea is to go to my boss's boss and politely inform him about the situation within the team, asking if he is aware about these decisions and what he thinks about them. The obvious situation I am worried about is him agreeing with his decisions, going to reveal my complain plan and breaking my already not great relation with my manager.\n\nI have recently got a good bonus and raise from this team, thing that paused my plan to change team again.\n\nDo you have experience complaining about your boss with your boss's boss?",
        "created_utc": 1676720811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a cheap/free way to autodial a single number over and over?",
        "author": "jmoney6",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1158kw0/is_there_a_cheapfree_way_to_autodial_a_single/",
        "text": "An ex bf of my wife's was released from prison, yeah messed up story I know. \n\n&amp;#x200B;\n\nEither way she cannot change her number because shes had it for a long time and its connected to our business. \n\n&amp;#x200B;\n\nShe blocked his main number but he just makes google voice numbers to harrass her. Police wont do anythign bc they cant prove its him. \n\n&amp;#x200B;\n\nSo I have his main cell phone number. Is there a way I can have a bot just call that number over and over randomly at like 3am Like call it 10 times. Then at random do it again?",
        "created_utc": 1676700862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future",
        "author": "Nkmupedziswa",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1152nis/future/",
        "text": "Would it be ok to do a minor in compsci. Would I be at a extreme disadvantage or could I take internships and learn that way",
        "created_utc": 1676681495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frustrated wife of a software engineer who had 8 jobs in 2 years.",
        "author": "Direct-Tadpole-9438",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/11516av/frustrated_wife_of_a_software_engineer_who_had_8/",
        "text": "My husband is a software engineer, and had about 6 to 8 jobs in a span of two years and cannot keep an employer for more than a year. It has started affecting our marriage.  He said that he is not feeling fulfilled at his job. He was recently hired at one of the high tech jobs in the country, and now he wanted to leave again after eight months. Our son is currently in therapy and need insurance to keep going. He said that he would get another job but I’m afraid we will be in the same predicament every year.  I’m not afraid of us not affording things because he has always been a good provider, but I don’t know what to do.  He says he needs my support, but I’ve been going through this for two years now and it seems like I’m in Groundhog Day, every 2 to 6 months. I told him that I am willing to compromise as long as he keeps the job for at least a year so that our son can have therapy and that he can put in his experience that he at least kept that job in high tech company for at least a year. After that year is over, our son can be qualified to go to school and get speech therapy without needing insurance. But again, he refused, and he wants to quit. Any advice?",
        "created_utc": 1676677279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Staging vs QA",
        "author": "the_current_solution",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1150nl2/staging_vs_qa/",
        "text": "Which is the purpose of QA and which is the purpose of Staging?\n\nIn my experience, having:\n\n- local\n- dev (for testing ideas work with automation)\n- staging (for making sure multiple dev changes work well together)\n- prod\n\nNot sure where QA falls into this - maybe it's the same as what I'm calling dev?",
        "created_utc": 1676675867,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to do with my comp sci degree?",
        "author": "Curious-Ad633",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1150bti/what_to_do_with_my_comp_sci_degree/",
        "text": "Hey guys, first reddit post here from me. I just want to say if you read all this and take your time to respond, I really appreciate it and any feedback you may have for me. \n\nI need some guidance on what to do with my career. I graduated from McMaster University (Hamilton, Canada) in April 2022 with a B.Sc in Mathematics and Computer Science (it’s not a double degree, it’s just half math and half computer science courses), I have applied to around 400 jobs since then and have given maybe like 4 interviews throughout this whole time, none of them being successful past the first round. I am currently considering three different options, the first is doing a master’s in Software engineering, the second is doing a 3 to 4 month coding bootcamp, the third is completely changing career paths. \n\nIf I was to do a masters, that would be around 2 more years before I can get a software engineering job, and it’s not like I would be able to “use” the fact that I am currently doing a master’s to my advantage on my resume, as employers don't care if you are currently pursuing a master’s, they want to see if you actually have the masters. Another problem with this route is that a master’s in comp sci / software engineering isn’t really that beneficial as say other fields. For example, typically to get a data science or Machine Learning related job you would need a master’s or PhD, so it would make sense there and it would actually be worth your time and money, but not so much as here in the software engineering field. \n\nThe second option of doing a coding bootcamp doesn't seem so bad, but they are relatively expensive (15k cad on average). For a 3 month program you’re paying 5k per month, which is most people's salary for the month, that's more expensive than university in Canada (my total university program cost was around 40k over 4 years). Another problem is that if I start the bootcamp and I get a job offer, what now? I may have paid a couple thousand dollars into the bootcamp already but now I have finally gotten a job offer, so that couple thousand dollars will essentially be a waste if I were to accept the job offer. Something else relating to the bootcamp is that let’s be honest, nowadays you can learn anything online, and build your own portfolio just through udemy courses. Yes I know that staying consistent without anything there to hold you to account (like the money I would be paying for the coding bootcamp) is extremely difficult, and although 99 % of people think they can do that, only 1% actually can. Two other nitpicks I have with the coding bootcamp is that I am located in Toronto Canada, where jobs are nowhere near as much as they are in the U.S. In the U.S there's a job for everyone, and that includes software engineering jobs - as long as you even have just a degree, some company out there will hire you soley based on that (I know as a Canadian citizen I can apply to jobs in the U.S, but U.S employers really only consider exceptional Canadian candidates since they need to sponsor the individual etc). Also for me to be in debt of my university tuition plus the coding bootcamp tuition and to land a small 65k CAD (49k USD) software engineering job, is it really worth it? I have bills to pay etc, it’s not like I can just pay that debt off in a couple of months with my salary. One last thing about the coding bootcamp(s) is that they are full stack focused, I want to be more on the back end side of things, because I like solving those DS &amp; A  problems (although I am not very good at them, I can barely do the easy ones - but I am keeping at it). And companies usually look for front end only, or back end only engineers when it comes to juniors, full stack engineers are more of a senior position. Fullstack at the junior level is like being a jack of all trades master of none type of thing (maybe I’m wrong though). \n\nThe last option of switching careers, this is honestly only out of desperation if I do end up doing it, but regardless I want a career (whether it is in software or anything else) that allows me to climb up and grow, both in my knowledge and my monetary compensation. I was thinking of something like a sales job, since there are opportunities to grow in that field. But with my computer science degree will they really hire me? I believe they won't, I would need at least a year of customer service experience working in something like Walmart, which in that case wouldn’t it be better just do the bootcamp and if I were to do the master’s degree, I would only have a year left to complete it.\n\nThank you for reading all that, even if you don't respond, I really appreciate you taking the time to do so.",
        "created_utc": 1676674972,
        "upvote_ratio": 1.0
    },
    {
        "title": "MLOps Survey",
        "author": "munchkin_ak27",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114zqid/mlops_survey/",
        "text": "Hi, we are grad students and wanted to better understand current MLOps tools that engineers are using. This survey will take less than 3 minutes of your time. We would really appreciate it if you can fill it out: [https://forms.gle/nJCbiwGPWESNxJmG7](https://forms.gle/nJCbiwGPWESNxJmG7)\n\nThank you!!!",
        "created_utc": 1676673402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering rant!",
        "author": "thesardorbek",
        "url": "https://sardo.substack.com/p/engineering-rant",
        "text": "",
        "created_utc": 1676660160,
        "upvote_ratio": 1.0
    },
    {
        "title": "SWE &amp; security: What can I do?",
        "author": "ovbent",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114kd3i/swe_security_what_can_i_do/",
        "text": "I should have perhaps asked this here. What can I do with SWE (full stack) in cyber security? I'm a SOC analyst, but will be going to a boot camp for full stack engineering.\n\nI'd prefer to remain in the IT security field, but don't know what role this would be called.\n\nSecond question: As a capstone project what are recommendations as far as relating it to security that I could showcase?  Thank you.",
        "created_utc": 1676640683,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Day in the Life of a Software Engineer (Working Remotely):",
        "author": "devbjorn",
        "url": "https://youtu.be/-imwK6ajztY",
        "text": "",
        "created_utc": 1676640658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know a decent open source word processor in react / next.js?",
        "author": "Lumpy_Tangerine_4208",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114fwsl/does_anyone_know_a_decent_open_source_word/",
        "text": "",
        "created_utc": 1676628307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mechatronics switch to Software Engineering? Any opinions, I need help",
        "author": "rubenfigueroaa_",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114cd9h/mechatronics_switch_to_software_engineering_any/",
        "text": "[removed]",
        "created_utc": 1676614272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Agile. Recent hire with experience.",
        "author": "hallakZ",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114bpd4/agile_recent_hire_with_experience/",
        "text": " I did one on one chat with tech lead who came back from vacation. I have asked him feedback on my story on why it’s not working properly. I was explaining the story and trust me he did not understand what I was talking about. I got to UI code and showed him how it works but did not get what I was talking about. He asked me what’s your experience. I’m newly in using angular, node.js. I talked why another coworker is working on different field can share ideas or get the knowledge of how to do my story and wasn’t invited to the meeting. And he said, we have expectations. Why don’t you be like that college developer? I stated that I have only been working in agile for one month and it’s actually my first officially task to work on for this sprint. Instead of wasting 33 minutes talking about expectations and my skill set. As tech lead, you could have gave me feedback on my story or assist me. I can tell you as software developer who has experience. I do not like agile. If the tech lead is not motivating his developers. I’m afraid his going set me up for failure. I’m not getting enough information to pick up the pace. The information isn’t shared among developers. Only close developers work with one another. Let me know what I should say to my manager",
        "created_utc": 1676611888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terminology -- \"Coroutine\" and \"Coroutine Function\"",
        "author": "jack_waugh",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/114b551/terminology_coroutine_and_coroutine_function/",
        "text": "The subject of coroutines includes, when we want or need to speak in precise, clear and unambiguous terms, a concept of a static artifact of programming, contrasted with a concept of the dynamic runtime structure that embodies the state and carries out or supports the execution. These are analogous to procedures and procedure activations. I asked ChatGPT what terms to use to distinguish these concepts and after some back-and-forth, I settled on \"coroutine\" for the dynamic manifestation and \"coroutine function\" for the static artifact. Are those definitions consistent with your understanding?\n\nAlso, comparing \"coroutine\" to terms that are semantically close, like \"coöperating thread\", \"lightweight thread\", looking in W'pedia and consulting ChatGPT, I feel that none of the other terms wants to eat up \"coroutine\" on the grounds of greater familiarity with the other term by software engineers without loss of the precise semantics. Do you agree? Choice of terms can be fraught as it guides the naming of libraries and entry points therein. A wrong choice is hard to undo and can interfere with readability. The coroutine concept I'm thinking of includes these features:\n\n- for purposes of understanding access to shared memory, interrupts are in effect always disabled. A coroutine has to give up control, of its own volition, in order for the scheduler to get control or any other coroutine or the main thread to get control. In some programming languages, this yielding of control can be written as `yield`. In the Apollo Guidance Computer, a special entry point had to be called.\n\n- code designed to be run in a coroutine can be run under a scheduler chosen or coded by the application programmer; this can be specialized e. g. to support priorities or not, support the possibility to cancel (abort) a running coroutine or not, and for testing whether code meets requirements concerning blocking or order of execution and concerning effects that \"eventually\" happen. A fake scheduler used for testing can be run to completion and the effects checked for.\n\n- I forget if there were any other important features to mention.",
        "created_utc": 1676609999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Three SafeMode Enhancements for Ransomware Protection | Pure Storage",
        "author": "A-Dog22",
        "url": "https://www.youtube.com/watch?v=d87NzV8OCfw",
        "text": "",
        "created_utc": 1676603282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laptops",
        "author": "mynameispie774",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1145qdi/laptops/",
        "text": "Okay my friend is currently needing a new laptop. she uses pretty much all development tools and has a budget around $800. she’s looking for atleast 32gb of ram as well as a gpu card within the system.",
        "created_utc": 1676593421,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEWARE SCAM: Salem Media Group",
        "author": "rockitsaway",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1143b0c/beware_scam_salem_media_group/",
        "text": "Salem Media Group is real. The lady, Julie Milius, is real. But someone is posing as her under the email:\n\njw@salemmediagroupcareers.com\njw@salemmediagroupcareers.com\njw@salemmediagroupcareers.com\njw@salemmediagroupcareers.com\n\nThis is NOT a real person. \nIf the process to getting a SE job is easy, it's a scam. And this one certainly is. In my experience, anyone that sends you a .doc or .rtf file to write your answers on and return... it's a scam.\n\nPlease beware.",
        "created_utc": 1676587070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Awesome remote companies",
        "author": "fireball787b",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/113w6qk/awesome_remote_companies/",
        "text": "I'm tired of working on companies that don't care about their people, therefore I created a curated list of awesome [100% remote working companies](https://en.wikipedia.org/wiki/Telecommuting) with values and a healthy work-life balance.\n\nThe list is still ongoing and I try to add new companies every day but it takes time to find very good ones.\n\nFeel free to check it out at [Github](https://github.com/fireball787b/awesome-remote-companies) and suggest new companies or changes :)\n\n&amp;#x200B;\n\nCheers!",
        "created_utc": 1676568952,
        "upvote_ratio": 1.0
    },
    {
        "title": "A beginner-friendly explanation of password hashing and salting",
        "author": "muhib21",
        "url": "https://blog.muhib.me/understanding-password-hashing-and-salting-for-enhanced-security-1",
        "text": "",
        "created_utc": 1676567099,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 BEST Automated Software Testing Tools",
        "author": "SebastyanPapp",
        "url": "https://javascript.plainenglish.io/6-best-automated-software-testing-tools-b67a86aa5012",
        "text": "",
        "created_utc": 1676559450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Do Many Software Developers Prefer To Use Macs (MacBooks)?",
        "author": "SebastyanPapp",
        "url": "https://javascript.plainenglish.io/why-do-many-software-developers-prefer-to-use-macs-macbooks-fdb2c89e1622",
        "text": "",
        "created_utc": 1676557011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you actually do (system) design?",
        "author": "carlomatteoscalzo",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/113o1ki/do_you_actually_do_system_design/",
        "text": "Hello,\n\ndo you (or other people in your team) actually go through a (system) design phase before you start writing code?\n\nAll of the companies I've worked for skip the design phase part altogether - can you please tell me how you do it in practice?\n\nDo you create diagrams first, using something like C4 or UML?\n\nDo you also create skeleton code (i.e., signatures for functions and methods) for each module / component?\n\nHow do you make sure the devs follow the designs? \n\nDo you add the diagrams to the repo?\n\nDo you set up the repo so that devs can't modify the skeleton code (i.e., name and parameters for methods / functions) but only add code to the body of those methods / functions?\n\nIs there anything else you do to make the whole thing work?\n\nThanks!",
        "created_utc": 1676545403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get Git and Jira Analytics in Under 10 Minutes - Check it Out!",
        "author": "maheshiyer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/113hdb3/get_git_and_jira_analytics_in_under_10_minutes/",
        "text": "Faros Essentials launched on ProductHunt today: [https://www.producthunt.com/posts/faros-essentials](https://www.producthunt.com/posts/faros-essentials)  \n\n\nCheck it out and spread the love, would appreciate your feedback and comments!  \n\n\nregards,  \nMahesh",
        "created_utc": 1676519900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Agile methodology",
        "author": "hallakZ",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/113bwtq/agile_methodology/",
        "text": "Does anyone follow agile methodology at work?",
        "created_utc": 1676503871,
        "upvote_ratio": 1.0
    },
    {
        "title": "HEY GANG. YALL STILL NEED THAT X2 EMV SOFTWARE WT TUTORIALS DUMPS FULLS. TELEGRAM GROUP: http://t.me/thegriot001 INCLUDES DUMPS ATR TOOLS BPTOOLS EVERYTHING YOU NEED..",
        "author": "Jonnsnoww001",
        "url": "https://i.redd.it/pkqpi7wglfia1.png",
        "text": "",
        "created_utc": 1676501262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anything that can go seamlessly back and forth between a diagram and code without manual intervention?",
        "author": "LeahNightBus",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/11359t5/is_there_anything_that_can_go_seamlessly_back_and/",
        "text": "So I'm looking at Archimate, PlantUML, Structurizr, Enterprise Architect, UML in general, visual scripting, etc. and all they can do is draw what you describe to them. And then there's a handful of code analysis tools that show you dependencies and things based on the code you actually have already written. But I want to do my design and documentation, management, test coverage, all that in the same tool. (And this is also along the same track as the person who asked about the state of software project management. There's so many processes and pieces of software to help out here and there but with the amount of manual stitching between them, it all falls apart) With all the tools we use to automate stuff, I feel like there ought to be something out there that both auto-gens code from diagrams, and can read your code to create diagrams. You could use it to diagram out your code, flesh it out, and then when you've got it at the high level, move into your IDE to fitness, but then continue to have the same diagrams be regenerated for automatic documentation.   \nI've been searching for years for something like this, but as a mostly aerospace engineer who happens to make software for such applications, I'm not enmeshed enough in cutting edge software engineering to know if such a thing exists, or if there's a very good reason why it doesn't. Thanks for reading, I'd love to know your thoughts!",
        "created_utc": 1676486637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microsoft SQL Server - Rapid recovery using FlashBlade",
        "author": "A-Dog22",
        "url": "https://www.youtube.com/watch?v=pkYMwVWNYLM",
        "text": "",
        "created_utc": 1676482585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you agree that Web3 will reduce the complexity of workflow in software industries?",
        "author": "ivy-211",
        "url": "https://i.redd.it/r22hbc86adia1.gif",
        "text": "",
        "created_utc": 1676473254,
        "upvote_ratio": 1.0
    },
    {
        "title": "What courses should I be taking to get a degree in computer science and become software engineer?",
        "author": "Clear-Part1904",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112qaja/what_courses_should_i_be_taking_to_get_a_degree/",
        "text": "I’m 16 in highschool (grade 11) I’m not sure what courses I should be taking to become a successful software engineer but I’d really like to know what I should be taking in highschool to be accepted into a school and get my degree.",
        "created_utc": 1676438382,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the biggest headache that you face while coding?",
        "author": "Important_Diamond_18",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112ogds/whats_the_biggest_headache_that_you_face_while/",
        "text": "[removed]",
        "created_utc": 1676432094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Percentage of SWE jobs that will remain remote in 2023",
        "author": "Mediocre-Proposal856",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112jvkk/percentage_of_swe_jobs_that_will_remain_remote_in/",
        "text": "I know that some SWE jobs are becoming hybrid rather than 100% remote.  I'm wondering if most 100% remote jobs will be converted to hybrid over the next 1 - 2 years?  I'm currently a SWE with 15 years experience and 100% remote.  I'm thinking of moving to a much smaller city with a weaker job market where it would be more difficult to find a decent SWE job.  \n\nThanks in advance",
        "created_utc": 1676418442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone frustrated abt the disjointed state of software project mgmt?",
        "author": "maniksar",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112foo2/is_anyone_frustrated_abt_the_disjointed_state_of/",
        "text": "I've worked at software companies big and small for about a decade and the one common theme I see is they all can do a better job organizing information about the software they build and maintain.\n\nThings like architecture diagrams (high/low level diagrams, UML diagrams etc.), UI flowcharts, documentation, metrics etc. are all scattered across various tools that all do that one thing very well. E.g. metrics are in Splunk, documents are probably in Confluence/G-Docs etc.\n\nBut it's hard to know how they all tie together unless you have it \"hardcoded\" in your head. E.g. you must know which dashboard in Splunk surfaces the metrics you're looking for, you must also know which document/runbook in Confluence has the relevant information on how to act on those metrics. And more often than not this documented information, if it exists at all, has drifted from reality i.e. the resources they point to don't exist anymore.\n\nWorse yet, the need for this \"hardcoded\" information is precisely what makes onboarding new hires hard; it's my least favorite part of joining a new team.\n\nAt one of my previous employers, we created a \"team page\" on the internal wiki that aggregated the team members' directory links, listed the services we owned, included some basic documentation and embedded metrics via iFrames. But even that didn't meet our needs fully.\n\nWondering what this community feels about this problem (is it even a problem?) and if someone's using a tool that solves this for them at some level.",
        "created_utc": 1676407570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why you should not use JWT for authentication",
        "author": "muhib21",
        "url": "https://blog.muhib.me/why-you-should-not-use-jwt-for-authentication",
        "text": "",
        "created_utc": 1676404450,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Not-So-Typical Software Engineering Career",
        "author": "Just-10247-LOC",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112e6l2/my_notsotypical_software_engineering_career/",
        "text": "I've been a software engineer for 35 years now. Embedded software, defense and aerospace. It's been a rugged career with a lot of turmoil - recessions, layoffs and market changes. I counted up my jobs over the years. 35 so far. That's 35 regular employers, or contract assignments/employers/clients. Unless I'm forgetting some. One lasted only about seven days. I've been laid off three times. I've left companies that were about to lay me off or go under eight times. I've been fired three times. Been on Performance Improvement Plans (PIPs) three times. I've walked out in protest a few times. Like the last one.\n\nAnd after all is said and done I still make about $175K per year (America). I am currently looking at contract jobs that pay between$100 and $140 an hour W-2, regular at 170K plus.\n\nAlways been able to find the next gig. Usually an improvement. But then there are people I started with who ended up retiring by now as fellow engineers, or geeky CTOs or company presidents with their yachts on small lakes.\n\nToo much anger, too much pride for my own good. I tend to speak my mind freely and then things need to change. Some of my favorite manager quotes over the years:\n\n\"There is not one person in Raytheon who has a single good thing to say about you.\" - Raytheon manager. I walked out.\n\n\"We don't have time to sit next to you, hold your and and spoon feed you!\" - NGC AWACS Program mid-level functional manager. - I left for better job in NH. She left for L3Harris. I then joined L3Harris and she was the SW Director.\n\n\"Hoh! John! Thank God you are here!\" - Bombardier Project Manager.",
        "created_utc": 1676403743,
        "upvote_ratio": 1.0
    },
    {
        "title": "What apps or programs do you need for your software engineering courses?",
        "author": "Aijin11",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112ami2/what_apps_or_programs_do_you_need_for_your/",
        "text": "",
        "created_utc": 1676394818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended Database Schema",
        "author": "lankymooseprogrammer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112agmb/recommended_database_schema/",
        "text": "[removed]",
        "created_utc": 1676394404,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to get into programming, but before buying a course I want to do some self learning. Where’s a good place to start learning about programming and software engineering for beginners ? thank you",
        "author": "Ok-Material7878",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/112a5tq/i_want_to_get_into_programming_but_before_buying/",
        "text": "",
        "created_utc": 1676393681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Took an offer from a defense company but got a call for another interview from a different defense after I took the offer.",
        "author": "asavage0304",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1127081/took_an_offer_from_a_defense_company_but_got_a/",
        "text": "",
        "created_utc": 1676385745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diigo PDF Reader",
        "author": "Puzzled_Judgment_265",
        "url": "https://diigo.com/0ro0eo",
        "text": "",
        "created_utc": 1676379374,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you perform visual regression testing today?",
        "author": "ashishnigam018",
        "url": "/r/QualityAssurance/comments/11232bn/how_do_you_perform_visual_regression_testing_today/",
        "text": "",
        "created_utc": 1676374045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penetration Testing For Web Application - Observations And Fixes",
        "author": "amitgupta05",
        "url": "https://techpearl.com/blog/penetration-testing-of-web-application-observations-and-fixes/?utm_campaign=blog-web-traffic&amp;utm_medium=penetration-testing-of-web-application-observations-and-fixes&amp;utm_source=reddit&amp;utm_content=&amp;utm_term=",
        "text": "",
        "created_utc": 1676371311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there 4 metamodels (4 viewpoints) defining the views from Kruchten's 4+1 views approach?",
        "author": "sci_and_eng",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/111yi82/are_there_4_metamodels_4_viewpoints_defining_the/",
        "text": "In software architecture, an architectural view should adhere to a viewpoint. If a viewpoint is undefined, an architectural view is then ambiguous, cannot be validated, and it is open to misinterpretation by different people who are free to interpret elements in each view with their own individual semantics. A viewpoint is simply a metamodel, for example a UML class diagram, showing what elements a view is allowed to have. It also shows their relationships. \n\nhttps://preview.redd.it/n7gikflxf4ia1.png?width=2070&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f9542d0d6d880c56dafa771894ab2f054debff04",
        "created_utc": 1676366226,
        "upvote_ratio": 1.0
    },
    {
        "title": "SAML 2.0 SSO Asp.Net",
        "author": "DueEntrepreneur3113",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/111vfkm/saml_20_sso_aspnet/",
        "text": "[removed]",
        "created_utc": 1676354536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Education Background Checks",
        "author": "Gio2135",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/111rd5n/education_background_checks/",
        "text": "I attended college from 2015-2018 then dropped out to work for my dad from 2019-2020. Was about to re-enroll in college in fall of 2020 but ended up getting a job that summer, and never went back. Here’s the issue, on my resume it says I attended college from 2016-2020…. which is wrong.\n\nIf I do my background check and check the “no degree” box, could I just explain to HR that I put the wrong dates for my education(auto filled using online resume creator)? I’m scared they may check years attended.",
        "created_utc": 1676341664,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Design A Library With Multiple State Stores",
        "author": "SpaceInstructor",
        "url": "/r/VisualCoding/comments/111l7zc/how_to_design_a_library_with_multiple_state_stores/",
        "text": "",
        "created_utc": 1676326464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding Effective Used Capacity (EUC) | Pure Lightboards",
        "author": "A-Dog22",
        "url": "https://www.youtube.com/watch?v=KN1sD-vYgI8",
        "text": "",
        "created_utc": 1676326332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking practical methods for analyzing the product",
        "author": "UnnamedLotus",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/111epdo/seeking_practical_methods_for_analyzing_the/",
        "text": "Hello everyone.\n\nI'm currently coordinating some projects in a junior enterprise, and here we work based on backlog tasks, a list of tasks including its priority, difficulty and definitions of done. I'm the one supposed to create and detail these tasks. Up until now, I don't use a method for analyze the product exhaustively and foresee exactly what the developers need to implement for the application be considered done. Instead, this initial phase of analyzing the project almost doesn't exist, and all I do is creating some initial and kinda obvious tasks and populating the list of tasks based on the needs we find out programming the project.\n\nI know that this is a bad thing, so I would like to know if there is some kind of method that I can follow to guide me understanding the project before we start programming it, some set of diagrams or patterns. Our products are only websites and mobile apps.",
        "created_utc": 1676309238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Desktop vs Cloud Data Modeling Tools: Benefits, Inconveniences, and How to Choose",
        "author": "FunBig7887",
        "url": "https://soft-builder.com/desktop-vs-cloud-data-modeling-tools-benefits-inconveniences-and-how-to-choose/",
        "text": "",
        "created_utc": 1676307190,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Sustainable Software?",
        "author": "Priest_Yoda",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/111bqxr/what_is_sustainable_software/",
        "text": "Recently I had a debate with a colleague about sustainability in general and then for sustainable software. Coming across different sites and blogs, this article caught my eye and got me into thinking. But really, do we all know what the sustainable software is? \n\nWhat do you think guys? \n\n[https://www.innoq.com/en/articles/2023/02/what-is-sustainable-software/](https://www.innoq.com/en/articles/2023/02/what-is-sustainable-software/)",
        "created_utc": 1676301865,
        "upvote_ratio": 1.0
    },
    {
        "title": "steps to build software from scrach",
        "author": "Affectionate_Lab1279",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/11191f8/steps_to_build_software_from_scrach/",
        "text": "",
        "created_utc": 1676297196,
        "upvote_ratio": 1.0
    },
    {
        "title": "75k USD in India or 200k USD in USA for a 24 year old indian SDE",
        "author": "OverallPatient2607",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1118937/75k_usd_in_india_or_200k_usd_in_usa_for_a_24_year/",
        "text": "Hey folks i am 23 year old software developer passed out of college last year with a B.tech in CSE.\nI grabbed a remote job opportunity for an european start-up working as backend engineer.\nI was planning to go for maaters in US in 2024 spring but after getting a job offer worth 75k USD in India I am in a dilemma.\nRecently have observed with such money one can have a lifestyle similar to USA with all basic amenities and household help.\nBut wanted to go to States for exposure as i have seen many average folks working in mass recruiter even getting good pay after masters.\n\nCan u pls help me with my dilemma as i am new to the software industry.\n\nThanks in advance.🙏",
        "created_utc": 1676294951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggeling with Authorization Concept",
        "author": "Super_Flounder8098",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1117zlf/struggeling_with_authorization_concept/",
        "text": "Hello folks,\n\nI'm having a mental knot regarding an authorization concept. I have many companies which may have many users. Users have a role that is valid only in the context of a specific company. Meaning a user may be an admin in one company and a usual user in another. Thats why I modelled the role to be an attribute of the relation between Companies and Users.\n\n[Relations visualized](https://preview.redd.it/gcpau1mcgyha1.png?width=441&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1eff94ef25be3115d158f3d858c5464ab6ee36ac)\n\nMy problem is; How do I implement this with a role or scope based concept, without multiplying the roles/scopes by the number of companies e.g. CompanyA:Admin, CompanyB:User? What am I missing?\n\nThis should be a common scenario but I am at a loss of how to realie this  - with token context only - and standard OIDC/OAuth2 mechanisms",
        "created_utc": 1676294168,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get into software engineering?",
        "author": "Unlikely-Strategy596",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1110lx1/how_do_i_get_into_software_engineering/",
        "text": "I work in banking and hate what I’m doing. I want to be smart and get into tech. I’m 24 and I wanna go into the tech route. I have an undergrad from a target. Can I become a software engineer through a masters program?",
        "created_utc": 1676266640,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is The most interactive software Code Learning App for Android?",
        "author": "GiveAllRecive11420",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110zele/what_is_the_most_interactive_software_code/",
        "text": "Obtaining a Google Careers certification to become a UX Designer, software engineer and DevOps practitioner.\nI need helpful learning apps to help me study. Shouting out to any developers and engineers out there willing to discuss common processes and preferred languages. Open to intern or protege.",
        "created_utc": 1676262659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best languages to learn for getting a remote job quickly",
        "author": "Ok-Victory3711",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110x935/best_languages_to_learn_for_getting_a_remote_job/",
        "text": "[removed]",
        "created_utc": 1676255855,
        "upvote_ratio": 1.0
    },
    {
        "title": "My startup failed - what to do with it?",
        "author": "Regular_Habit144",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110puym/my_startup_failed_what_to_do_with_it/",
        "text": "Hi everyone,\n\nMy online bank startup has failed and we have pretty lost everything.\n\nWe have however since months creating what I think is good software including custom APIs, dashboards, App, Website and more.\n\n&amp;#x200B;\n\nIs there anywhere, where I could sell this?",
        "created_utc": 1676234891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is freeCodeCamp enough to give this felon a new lease on life?",
        "author": "Avid_Savant",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110gpg1/is_freecodecamp_enough_to_give_this_felon_a_new/",
        "text": "So I (30y/o male) have been on the journey of learning to code for about 46 days. Wanting to find a better paying career path and a interest in computers/technology led me to start with Cs50. I did a lot of research on learning to code(procrastinating for 6 months while googling ways to learn to code and watching YouTube videos) and in the process stumbled across Harvard’s CS50 and something about a free course from Harvard got me going. After completing week4, I started freeCodeCamp a few days ago. I plan to finish cs50 &amp; freeCodeCamp, then see how I’ve come along as a programmer. At first I thought I was making no traction, but I’ve noticed I’m becoming better at using proper terms to explain my problems when asking others for help.\n\nSo while I’ve made some incremental progress upon putting a lot of time into this and although I enjoy it, my financial situation doesn’t allow me much time for the things I enjoy/fun. In my mind I can’t afford to waste time learning(which is never a waste of time, right) a skill that could leave me in my current situation, when I could be working a second job to make extra cash.\n\nThis brief background information leads me to my questions:\n\nIs coding boot camp necessary or is supplemental learning adequate enough to land a job?\n\nThe next question that really worries me and alters my motivation at times:\n\nI have a criminal record that contains felonies(plural) and no college  degree. What are the odds that I can even get a job in this field?",
        "created_utc": 1676211385,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I become software engineering after taking commerce with maths. plz give good suggestion for my future",
        "author": "hello_v_r_o",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110dn1y/how_can_i_become_software_engineering_after/",
        "text": "",
        "created_utc": 1676201352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which diagram represents my System best?",
        "author": "vstyler93",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110d68q/which_diagram_represents_my_system_best/",
        "text": "Hey guys, i have following situation. I want to make a Diagram that shows the relation between systems. I have an automated system where a self written API (Rest) gets triggered. This will allocate the structure of a specific server from a database (Which one is being passed by the api request), store architecture Informations of it to Netbox and it will store login credentials to Vault. Afterwards it triggers a CI/CD Job in Gitlab which executes a bash script. This bash script runs Terraform Code which creates all virtual Machines documented in Netbox.  \n\n\nIs there an UML Diagram which can represent this? I Thought about Component Diagram, but i am not sure, as i did UML Diagrams in University only for a Software System. Would appreciate any help!",
        "created_utc": 1676199603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advices for new software engineer",
        "author": "bodahm1122",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/110b4qj/advices_for_new_software_engineer/",
        "text": "Any advices for new graduates students \nAny certificate I can go for?\nAny programming language I need to learn or focus on?",
        "created_utc": 1676191725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apple pro 11 inch with Apple pen 2?",
        "author": "Draqula32",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/1106omu/apple_pro_11_inch_with_apple_pen_2/",
        "text": "While using Apple Pen 2, the middle of the screen of the ipad pro 11 inch is getting hotter and hotter. Is it normal? Because it is the first time, I am using apple products. Should I call see the Icare? Thank you,",
        "created_utc": 1676174991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-Taught Software Engineer Seeking Feedback on UI/UX",
        "author": "NikGrmek11",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10zz7s5/selftaught_software_engineer_seeking_feedback_on/",
        "text": "Hey everyone!\n\nI am a self-taught software engineer and while UI/UX is not my passion, I still recognize its importance. I'm currently working on a cloud storage software project and I'd love to get some feedback on the UI/UX aspect of it.\n\nPlease note that the software in the screen recording is currently quite glitchy, so I'd appreciate it if you could focus solely on the UI/UX. Any constructive feedback would be greatly appreciated.\n\nThank you in advance!\n\nScreen recording: [Screen recording of the software](https://youtube.com/watch?v=70pQYj6QSsc)",
        "created_utc": 1676152917,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can code, but I feel lost when it comes to building applications.",
        "author": "tostitos6",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ztu7n/i_can_code_but_i_feel_lost_when_it_comes_to/",
        "text": "I consider myself a proficient Python programmer and know my way around html ,css and js,etc. I have no issues with leetcode, oop principles, but I struggle a lot when it comes to building applications, tools, and web pages. I don't know where to start and I don't understand how the hosting side works.\n\nDoes anyone else feel this way? I don't need to do a \"Python tutorial\", but I also don't know what to learn / research to get better at building applications / tools.\n\nAny advice/resources are greatly appreciated",
        "created_utc": 1676138932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top websites to learn Data Structure &amp; Algo💻 #shorts #shortsfeed #coding #datastructures #algorithm",
        "author": "TechieBundle",
        "url": "https://youtube.com/shorts/r6opvRPs_w4?feature=share",
        "text": "",
        "created_utc": 1676137301,
        "upvote_ratio": 1.0
    }
]