[
    {
        "title": "Am I only one who feels anxious about code reviews?",
        "author": "HaveNoIdea20",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rofxe/am_i_only_one_who_feels_anxious_about_code_reviews/",
        "text": "I'm getting very anxious and self-conscious when someone reviews my code. After reading review comments I have thoughts like: Why I did this mistake? Why I didn't think about it ? Am I stupid?\n\nHow to get rid of this feeling?",
        "created_utc": 1675340114,
        "upvote_ratio": 1.0
    },
    {
        "title": "My efforts to become employed are failing pathetically.",
        "author": "biglimprowski",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rfxot/my_efforts_to_become_employed_are_failing/",
        "text": "My efforts are failing and I’m not sure what to do.\n\n9 months ago I committed to applying for jobs as a self taught developer. I spent hours outside of my regular old job studying my ass off and applying to jobs. I got interviews all the way up to November then they just stopped out of nowhere. I still bust my ass every day trying to make my passion come true. The worse part is that here I am developing full stack applications, freelancing big software projects to get some experience and all of it has got me nowhere. I wont give up. I refuse to give up. I chose this field because I truly have a passion for it. It’s supposed to be in demand. Id have a better chance at getting a jr accountant position than I would as a developer right now. Id work as an unpaid intern right now even. I have the skills, I have the experience. Maybe I was wrong all along. I spend a day a week doing a re evaluation of my method for improving. I keep improving. This is the only path in my life that shows no reward for hard works. This career is insane for not rewarding hard work. What’s going on?",
        "created_utc": 1675309969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes writing the documentation for my software first helps me contemplate the intricacies, nuances, and caveats of my design. Is it generally a good idea to do this?",
        "author": "CurdledPotato",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rf23j/sometimes_writing_the_documentation_for_my/",
        "text": "",
        "created_utc": 1675307475,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is Inheritance In Object-oriented programming",
        "author": "Darshanapci",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rbya0/what_is_inheritance_in_objectoriented_programming/",
        "text": "[removed]",
        "created_utc": 1675299371,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do for developing software developing/engineering skills?",
        "author": "KenQueue1",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rbw86/what_to_do_for_developing_software/",
        "text": "Hello, I'm new to programming and I learned all the basics of Python, and it seems like I'll proceed in software developing/engineering field. Do you have any tips for me (e.g. learn some libraries, learn a different programming language)? I'm planning to start learning GUI coding, do you think it's helpful?",
        "created_utc": 1675299225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which course should I choose? Web Dev vs iOS Dev vs Android Dev",
        "author": "realisticJoJo",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10rbbl3/which_course_should_i_choose_web_dev_vs_ios_dev/",
        "text": "I have the chance to take some free CodePath courses, and as an SWE major, I'm trying to decide which one might be more beneficial to me...or if it really doesn't matter and I should just pick whichever one I want to do.",
        "created_utc": 1675297778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a recommendation.",
        "author": "MrBeastStaff",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10r8srs/looking_for_a_recommendation/",
        "text": "I am currently looking for the best/ most knowledgeable person/broker/company in the industry for business software, including CRM, ERP, resource planning, resource budgeting and tracking like Yardi, communication, whiteboard like mirrow/figma/lucid, calendar gant charts etc, to implement at our YouTube channel. If you have any suggestions on how to find the person(s) with a broad knowledge of business software and in-depth understanding of all their functionalities please help me connect with them. We are looking to update our software systems and flows.",
        "created_utc": 1675291635,
        "upvote_ratio": 1.0
    },
    {
        "title": "DriverMax Pro Crack 16.2.5 With Keygen Torrent Download 2023",
        "author": "CrackMine",
        "url": "https://crackmine.net/drivermax-pro-crack-download/",
        "text": "",
        "created_utc": 1675278343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice",
        "author": "Glittering_Candy_783",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10r2he7/advice/",
        "text": "If anyone is kind enough can anyone give any advice for someone starting out completely fresh? Like what resources could I use to get knowledgeable, what platforms could I use to practice on, etc. Appreciate it kind people",
        "created_utc": 1675277175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Bachelor degree in software engineering",
        "author": "PerfectObjective5828",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10r1f3b/online_bachelor_degree_in_software_engineering/",
        "text": "I am trying to help a friend in finding a good online Bachelor in software engineering. Are there any recommendations?",
        "created_utc": 1675274767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Workload as a dev in different industries",
        "author": "workinghardyes",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10r0mcu/workload_as_a_dev_in_different_industries/",
        "text": "So I been working as a software engineer in automation industry, pharmaceutical company and hospital. I know every company is different but from what I heard working as a dev in government is quite relaxing compared to fintech or startup. What about working as a dev in university?",
        "created_utc": 1675272906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice?",
        "author": "nicdunz",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10r0btz/career_advice/",
        "text": "im a junior in high school and up until now i had no idea what i wanted to study. after this wave of ai stuff happened and i realized how interested i am in it, im wondering if maybe i should study something involving ai. i have no idea where to start though. software engineer? machine learning engineer? i would love if someone could help decide what i actually would want to do for a career and what i should major in to get me there. thank you.",
        "created_utc": 1675272204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know if European Leadership University is legit? I find it kinda sus throughout the web",
        "author": "c9walterwhite",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qzxbg/does_anyone_know_if_european_leadership/",
        "text": "I've done my research but there is nothing valid pointing if it is legit or if anyone has ever graduated from elu.",
        "created_utc": 1675271282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Corp to Corp jobs",
        "author": "hamsterofdark",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qzspd/looking_for_corp_to_corp_jobs/",
        "text": "Hello,\n\nCan anyone recommend any processes for landing a job like this?",
        "created_utc": 1675270981,
        "upvote_ratio": 1.0
    },
    {
        "title": "need developers for startup",
        "author": "DrinkWitty",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qzha3/need_developers_for_startup/",
        "text": " Hey, hope you're doing well! I wanted to reach out to the talented software and app developers in this community and see if anyone is interested in joining a low budget startup with a goal of developing cutting-edge software. If you're passionate and want to get in on the ground level of a promising new venture, this might be a great opportunity for you! Let me know if you're interested, I'd love to chat more about the project and see if we're a good fit for each other.",
        "created_utc": 1675270246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi everyone in 1 month I’ll be entering Software engineer career, I’m looking for a laptop, any recommendations?",
        "author": "not_actuallly",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qy9c4/hi_everyone_in_1_month_ill_be_entering_software/",
        "text": "",
        "created_utc": 1675267284,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I still use Flash in 2022",
        "author": "fagnerbrack",
        "url": "https://foon.uk/how-flash-2022",
        "text": "",
        "created_utc": 1675267271,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Technical Skills Does A Software Engineer Need in 2023 (except writing code)?",
        "author": "LordGravyOfLondon",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qv6ev/what_technical_skills_does_a_software_engineer/",
        "text": "[removed]",
        "created_utc": 1675259409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have a chance joining Google summer of code as a junior frontend developer ?",
        "author": "Aromatic-Ad-2235",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qtzcz/do_i_have_a_chance_joining_google_summer_of_code/",
        "text": "I am a computer engineering student at my last year and I was wondering are there projects in GsOc that need junior frontend devs I looked at last years projects and I got the feeling that most of them required far more knowledge than what average students have. So is that it or am I wrong ?",
        "created_utc": 1675255882,
        "upvote_ratio": 1.0
    },
    {
        "title": "We are participating in a hackathon and need market research. Front-end developers please help us out with answers (5 min survey). Thank you! ❤️",
        "author": "TheArdentOne",
        "url": "https://forms.gle/UmETgR4Veg8wHm9D8",
        "text": "",
        "created_utc": 1675251054,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is Object-Oriented Programming (OOP)? You Need To Know - Ennicode",
        "author": "educationprograming",
        "url": "https://www.ennicode.com/what-is-object-orient-programming-oop/",
        "text": "",
        "created_utc": 1675221794,
        "upvote_ratio": 1.0
    },
    {
        "title": "CS major and minor in SE",
        "author": "shewasere",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qcth5/cs_major_and_minor_in_se/",
        "text": "Has anyone done this and how was your experience. Meaning was the workload alot more or there's no point in minoring SE",
        "created_utc": 1675204764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Path to SE",
        "author": "LocoHama-045",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qamg3/best_path_to_se/",
        "text": "Here is my situation, \n\nI am 24 and looking at transitioning to the CS Field. My undergraduate degree is in English Literature and I’m thrilled to have had the experience to learn it. Covid shifted plans now I searched for alternatives. I’ve been self learning CS while working full time at a startup tech company as a CSM where I learned that I do have a deeper curiosity for the product. Should I go back to school, i have enough grant money left over to pay for my second bachelors. However, having missed out on many classes to obtain a CS degree, I’d need 96/124 credits which would equate to 5 years or so of school while maintaining a part time job (according to my academic advisor). \n\nBootcamps are something I’m familiar with having also completed one for UX, and while it didn’t land me a roll as a designer it did help me land my user centric roll at the moment. \n\nMy concern is would a bootcamp allow me to have experience and knowledge to enroll at an MS level course? \n\nMy question is should: \n\n-go back to get a second bachelors in CS, and complete the degree in 4-5 years (I’d be 28-29) \n\n-get a bootcamp certificate and then get a MS in computer science since work experience could test me out of some pre requisite classes\n\nnote: my company is pretty fluid and while working as a csm, I can likely wear other hats and transition to an implementation engineer then work fully on the product team.",
        "created_utc": 1675199498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Code Analysis",
        "author": "Open-Duck-5309",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10qa5l2/code_analysis/",
        "text": "Hi folks,\n\nI am a software engineer.. and trying to learn more of real-world programming, and to do so, I looking for a full code analysis to big open source projects like Single, Kubernetes or anything similar..\n\nIf you seen anything such, in any form (blogs, articles, books, videos, etc.) please share it with me.. it is fine if it wasn’t complete.. \n\n(I am interested in back-end with languages that I am familiar with: golang, csharp, java, python)\n\nThnx in advance:)",
        "created_utc": 1675198416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing army service job title to something more industry related",
        "author": "r2123123",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10q7z9k/changing_army_service_job_title_to_something_more/",
        "text": "Hi everyone, \n\nI finished a computer science degree, and before that i served in the army as a \"management officer\", in that roll i used excel, vba and power bi to analyze data to send to my superiors, my question is, now that i want to find a job as a developer, should i lie about the job title? no one really knows what is a management officer, i thought to put something like \"BI developer\" or \"BI analyst\", what do you think?",
        "created_utc": 1675193176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was told \"We want to be sure you learned the fundamentals of SE from university\". About to have final meeting and I do not have the tech-stack asked for (which is known). What do I study?",
        "author": "Clear_Your_Mind",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10q5e5q/was_told_we_want_to_be_sure_you_learned_the/",
        "text": "I have been interviewing with a company for the better part of 2 weeks. It is an associate SE position and I am about to have the third/final interview. However, I do not meet the requirements (my tech-stack is different). I brought this to light and was told \"We want to be sure you learned the fundamentals of SE from university. The rest we can teach you.\" I am worried. I am unsure what I should study/review given how vague the response was. Any help would be greatly appreciated.",
        "created_utc": 1675187117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everything You Know About Latency Is Wrong",
        "author": "fagnerbrack",
        "url": "https://bravenewgeek.com/everything-you-know-about-latency-is-wrong",
        "text": "",
        "created_utc": 1675180872,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a container?",
        "author": "ayushsinghal90",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10pyamd/what_is_a_container/",
        "text": "The evolution of computing environments has led to the growth of more efficient and flexible systems. Starting with single servers, the demand for better resource utilization led to the introduction of virtualization. \n\nVirtualization allowed multiple virtual machines to run on a single physical server, each isolated from the others and with its own operating system. This greatly improved resource utilization and made it easier to deploy and manage applications.  \n\nHowever, virtualization has its own limitations, such as increased overhead and complexity. This led to the development of containerization, where applications are packaged into containers that run on a shared operating system. Containers provide even greater efficiency, consistency, and portability compared to virtualization.  \nLearn more about containers and how they overcome the limitations of virtualization.  [https://ayushblog.medium.com/what-is-a-container-595d258af6ed](https://ayushblog.medium.com/what-is-a-container-595d258af6ed)",
        "created_utc": 1675169650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical Billing Software For Billing Companies",
        "author": "ziaccu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10pwmha/medical_billing_software_for_billing_companies/",
        "text": "[removed]",
        "created_utc": 1675164295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Data processing framework for decoupled pipeline",
        "author": "Soggy_Trash_1595",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10pt97o/data_processing_framework_for_decoupled_pipeline/",
        "text": "I'm looking for a data processing framework (or whatever you want to call it) that allows me to easily orchestrate and manage a processing pipeline that consists of several steps. Each step can have an arbitrary number of processing nodes and process data from an input queue and write it to an output queue. The system should handle node failures automatically.\n\nDoes anyone have experience with such a setup and advice on how this is most easily implemented?",
        "created_utc": 1675154486,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 best microservices monitoring tools to follow in 2023",
        "author": "TheLostWanderer47",
        "url": "https://blog.bitsrc.io/best-microservices-monitoring-tools-to-follow-in-2023-489c993b57c6",
        "text": "",
        "created_utc": 1675137995,
        "upvote_ratio": 1.0
    },
    {
        "title": "New SE student",
        "author": "VintexLens",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10pnhi5/new_se_student/",
        "text": "This year I want to challenge myself by deep diving into software engineering specialization",
        "created_utc": 1675137013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boost with RPMs",
        "author": "cIueIess1",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10pj0hy/boost_with_rpms/",
        "text": "Hi everyone, \n\nJust wanted to ask regarding Boost, specifically version 1.74, which I currently have as a tar.  Does Boost itself has a tool to generate a rpm, or would I need to specifically create a rpm out of the Boost tar? And in either case, how would I go about doing it?\n\nThanks in advance",
        "created_utc": 1675124865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Design Docs",
        "author": "vivekbis",
        "url": "https://www.designdocs.dev/",
        "text": "",
        "created_utc": 1675117038,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to software engineering",
        "author": "chrissytheexplorer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10paql2/new_to_software_engineering/",
        "text": "[removed]",
        "created_utc": 1675105034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deployment Strategies Explained In-Depth | DevOps",
        "author": "KaranJagtiani",
        "url": "https://karanjagtiani.medium.com/deployment-strategies-explained-in-depth-devops-bb14fb7d5cbc",
        "text": "",
        "created_utc": 1675097642,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to rebuild social media on top of RSS",
        "author": "fagnerbrack",
        "url": "https://tfos.co/p/rebuild-social-media/",
        "text": "",
        "created_utc": 1675094470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Open Source Product Ideas",
        "author": "nannerspanners",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10p40nq/looking_for_open_source_product_ideas/",
        "text": "Hello,\n\nMy team and I are starting an open source product in the coming weeks. I was hoping to get some ideas from professionals in the industry in terms of what problems they face with the technologies they use. We would like to work on developer libraries, tools, or services, especially in web development. Of most interest to us are GraphQL, Kubernetes, Svelte, and Docker and we are most experienced in Javascript, React, Express, and SQL/NoSQL databases. \n\n1. What are developers missing?\n2. What has been done but could be done differently, better, or simplified for the developer experience?\n3. What's new that needs tooling?\n\nThank you! Happy Coding",
        "created_utc": 1675089002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Senior Software Engineer | App Developer | Shahnawaz Babar",
        "author": "nimra_12",
        "url": "https://byshahnawaz.com/",
        "text": "",
        "created_utc": 1675082532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Senior Software Engineer | App Developer | Shahnawaz Babar",
        "author": "nimra_12",
        "url": "https://byshahnawaz.com/",
        "text": "",
        "created_utc": 1675081288,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI APIs Implementation - Stack and recommendations",
        "author": "WhereIsBryan",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10oyaeb/ai_apis_implementation_stack_and_recommendations/",
        "text": "Hi everyone ! I had this weird idea lately, with the rise of AI to the mainstream, to implement some kind of \"Simulator\", where one could input a webcam picture, some basic info through a form, &amp; get an alternate small narrated video narrated of one's future.\n\nI'm looking for suggestions for open source AI APIs I could use for it. My idea, very simplistically put, is to combine them through input, outputs and some basic logic manipulation.\nI'm also looking for recommendations for the stack I could use. I've worked with NodeJS and Java w/ Spring Boot on backend, &amp; Angular for frontend. Any recommendations based in the APIs?",
        "created_utc": 1675072892,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Canada, is it possible to eventually get a job in a fortune 500 company without having a CS degree?",
        "author": "BOBBYBlTCH",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10okkzd/in_canada_is_it_possible_to_eventually_get_a_job/",
        "text": "(20m) I'm studying political science but I've always been interested in programming. I want to learn a few languages and then make a few projects for fun. In the off chance that I like it a lot and want to transition into software engineering, is it to late? Do I have to go back to school? I see online that people get jobs after doing a boot camp or if they have really good project. I wanted to know how realistic it is to actually getting a software engineering job without a degree.",
        "created_utc": 1675031053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning by doing: An HTTP API with Rust",
        "author": "nfrankel",
        "url": "https://blog.frankel.ch/http-api-rust/",
        "text": "",
        "created_utc": 1675012942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leveraging the power of AI for software development",
        "author": "dead_diode",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10o6gz1/leveraging_the_power_of_ai_for_software/",
        "text": "Hi there folks!\n\nIt's hard to be a sofware developer in 2023 without worring a bit about all the advancements in AI automating a lot of the work that we do. But since there is no point fighting technological advancements, I've decided to just adapt and try to leverage these tools. So far I've used chatGPT to help me create a couple of functions and the results were quite impressive. \n\nAs it's a fairly new concept, I thought it could be helpful to discuss the best way to actually take advantage of these tools while working with development, as well as which skills are/will be useful when working alongside an AI.",
        "created_utc": 1674994922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snippets and Pattern are different. Snippets tends to be smaller and more specific. Pattern seems to be more abstract and architectural Idea. Do i understanding this correctly ?",
        "author": "minimalist-lifestyle",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10o3fvl/snippets_and_pattern_are_different_snippets_tends/",
        "text": "",
        "created_utc": 1674983075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urgent help on a hw question",
        "author": "_mmagix",
        "url": "https://www.reddit.com/gallery/10o04je",
        "text": "",
        "created_utc": 1674970795,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the meaning of \"Modal\" in Modal Dialogue",
        "author": "minimalist-lifestyle",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10nzszk/what_is_the_meaning_of_modal_in_modal_dialogue/",
        "text": "I always understand that the Modal Dialogue is somehow the dialogue that will block the background but I don't really understand the meaning of \"Modal\" What does it really mean ?",
        "created_utc": 1674969721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career advice: IT vs. Software Engineer",
        "author": "Silver-Welder9053",
        "url": "/r/careeradvice/comments/10nvxsl/career_advice_it_vs_software_engineer/",
        "text": "",
        "created_utc": 1674967847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding black-box and white-box testing",
        "author": "Akmandev",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10nslqv/understanding_blackbox_and_whitebox_testing/",
        "text": "[removed]",
        "created_utc": 1674947882,
        "upvote_ratio": 1.0
    },
    {
        "title": "What every SWE must know: Project Management for Beginners (free course from PMI)",
        "author": "sci_and_eng",
        "url": "https://www.pmi.org/shop/p-/elearning/project-management-for-beginners/16183",
        "text": "",
        "created_utc": 1674935685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for SDE career",
        "author": "Candid-Worker-1377",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10nl544/suggestions_for_sde_career/",
        "text": "I have been a deployment, release engineer and Oracle DBA for the past 6 years.\nMy skillset includes - perl scripting, gradle, Jenkins build, oracle dba\nMy work has always been ticket based and on backend with minimal to no recognition until something is wrong. My last few years has been primarily db administration. I want to reskill or upskill myself and I am not really into support and I am okay to start as a fresher too. Could anyone please guide me on where to start? I am also planning on doing some certifications. Please help",
        "created_utc": 1674928749,
        "upvote_ratio": 1.0
    },
    {
        "title": "RealCoders helped me alot",
        "author": "gajo01",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10njd21/realcoders_helped_me_alot/",
        "text": "Hi guys, I just came across this new thing RealCoders from my local community. Filled email on there landing page/form and got really great experience on developing Node project. They just provided 1 medium sized project with detailed tickets and testing infra to proceed with those tickets. As I'm not having much work at my current job this thing really saved me.  I guess they can provide projects on any tech stack, at least this is what they say on this link. Just wanted to share, you can check it as well:  \n[https://form.questionscout.com/63d529341729ac29d5ad8350](https://form.questionscout.com/63d529341729ac29d5ad8350)",
        "created_utc": 1674924125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Six ways of dependency injection in Spring Boot — A Deep Dive",
        "author": "indian_dev",
        "url": "https://codingchronicles.adityakarad.com/six-ways-of-dependency-injection-in-spring-boot",
        "text": "",
        "created_utc": 1674908357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is VS Code an IDE?",
        "author": "Defiant-Technician24",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10n9zzm/is_vs_code_an_ide/",
        "text": "Hi! So the title basically. I'ev heard many people saying it is not an IDE, but why exactly? It has all the features I would ever leed from and IDE and more. I've been coding Python for 5 years for the university and various companies. Using PyCharm, Eclipse (yeah...) and VS Code. VS Code is just as much an IDE as these, if not more. I don't really get the comparison between text editors and VS Code, when it is (in my opinion) clearly much more of an IDE than a text editor. \n\nSo what exactly makes VS code not an IDE?",
        "created_utc": 1674893805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do swe’s apply for unemployment when laid off?",
        "author": "WildWild420",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10n9exv/do_swes_apply_for_unemployment_when_laid_off/",
        "text": "",
        "created_utc": 1674891602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hmmm…",
        "author": "Draqula32",
        "url": "https://twitter.com/draqula32/status/1619176577471860736?s=61&amp;t=GwkP_pHnLLhiiCjwkbTcuQ",
        "text": "",
        "created_utc": 1674876980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon Dev List Experience and Question",
        "author": "Ok-Bug-1269",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10n2cz5/amazon_dev_list_experience_and_question/",
        "text": "[removed]",
        "created_utc": 1674869260,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often is your one-on-one with your EM? Do you set it up or does he?",
        "author": "Tech_1111",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mtboe/how_often_is_your_oneonone_with_your_em_do_you/",
        "text": "",
        "created_utc": 1674847000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Video Object Recognition Help",
        "author": "BigBubbles9000",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mp843/video_object_recognition_help/",
        "text": "Hi there!\n\nI am looking for a program that can give an output from a video.\n\nI need something which can detect how many of a specific shape are present in the video every \\~1/10 of a second or per frame for short (\\~4-5 minute) videos (.mov).\n\nI know there are a few programs that provide information/insights about what is going on in videos (e.g., faces, themes, tone, object recognition, etc.). But I need something which specifically gives an output of how many of this shape there are.\n\nDoes this sort of program exist?",
        "created_utc": 1674837324,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get into the field?",
        "author": "fedexgroundemployee",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mn6m5/how_to_get_into_the_field/",
        "text": "Hey y’all, sorry if this has been asked to death.\n\nLooking into getting into the field, but not sure what’s the best route to go. \n\nRight now I’m stuck between starting a 4 year degree for computer science, or finding a bootcamp online.\n\nThe end goal would be to land a job via the most cost effective and efficient route I can.\n\nIf I can avoid college that’d be great, but how would I go about that? Wouldn’t potential jobs look for certifications? What would I need to do?\n\nOr would you guys recommend just biting the bullet and going to college?\n\nI’m willing to put the work and time in I just don’t want that to be all for none if I chose the wrong option. Thanks for any input!",
        "created_utc": 1674832336,
        "upvote_ratio": 1.0
    },
    {
        "title": "KC Software has suspicious behaviour",
        "author": "SilveraPlanet",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mmy1a/kc_software_has_suspicious_behaviour/",
        "text": "[removed]",
        "created_utc": 1674831738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you recommend your current employer?",
        "author": "No_Access_4548",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mlfvg/would_you_recommend_your_current_employer/",
        "text": "Hi,\n\nI am a mom and software engineer. I would like to change my job after my maternity leave. Currently I work at Amazon. But there is no chance I can&amp;want to juggle all that work load after having a child. \n\nSo I am curious about how software engineers (especially moms) feel like in their current companies. Do you recommend them?\n\nThank you! 🙏 💜",
        "created_utc": 1674827840,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a developer, will I become more valuable if I learn Mandarin?",
        "author": "absentbrain",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ml0i8/as_a_developer_will_i_become_more_valuable_if_i/",
        "text": "I want to take time off, spend at least a year in China and learn Mandarin. But this is going to burn through a lot of cash, so I'm looking for a good excuse to do it.\n\nDevelopers get paid more in the states than China, so I likely won't get a pay bump as a dev.\n\nI am an extroverted person, so I don't mind pivoting to software sales or management. However, I'm sure that there's plenty of Chinese developers who know English. So I don't see how I would stick out more than others in this sense.\n\nSo would I be increasing my value whatsoever, if I decide to move to China and learn Mandarin for a bit?",
        "created_utc": 1674826684,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does java back end OOP apply to real life?",
        "author": "No-Fail8790",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10mc3xs/how_does_java_back_end_oop_apply_to_real_life/",
        "text": "So i'm a entry level QA, and I've been coding for about a year now, but only on either Vanilla HTML, CSS, JS or java based application projects. So i'm kind of familiar with how code works but I was refreshing over some java OOP principles and this question came upon me that I cant figure out. So I was watching a youtube video that was talking about Interfaces, now in the video he used a the example of a fitness website. Where the base class was a User, then he had different child classes that would extend the User class (like a Employee, Manager, Customer, etc...), then he made an object of each of those classes in the main method, passing the arguments for the custom constructor and was showing the methods that where available in each object that came from the base class. The question that popped in my head was \"If this java code is backend, and it connects to, lets say a JS front end, and lets also assume that there is code that talks to each end via api or whatever may be. What input could a client (who is using the Fitness website) possibly put to make the back end create a object in the main method?\" Like it seems like he was doing all this OOP stuff, to be able to create an object in the main method that reflects a real user with all its real properties, but my question is if a user was to sign up to the fitness site, of course there isn't a programmer in real time going into the main method creating an object and passing that clients parameters in the custom constructor, so how does the instructor in the video showing that he can create a object with arguments and that that object has certain objects available correlate to a real situation where a user is interacting with the fitness site.",
        "created_utc": 1674793837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Silly software programs ideas",
        "author": "willcodeformaoam",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10m8i0o/silly_software_programs_ideas/",
        "text": "I work full time as a big data engineer, and typically don't do any coding in my personal time. I'm feeling like making some stupid, almost pointless programs purely for the joy of it. A lot of suggestions on the web are for people to hone their skills/strengthen their resume, but that's not what I'm looking for.\n\nAnyone got any suggestions?",
        "created_utc": 1674782969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I become a SW Engineer?",
        "author": "JohnmanJones",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10m5xjg/should_i_become_a_sw_engineer/",
        "text": "[removed]",
        "created_utc": 1674775757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music/arts companies that need software devs",
        "author": "lizt20",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10m5l7m/musicarts_companies_that_need_software_devs/",
        "text": "Do you guys know any music/arts companies that require software engineers? If you do please comment some",
        "created_utc": 1674774853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Use Postgres for Everything",
        "author": "fagnerbrack",
        "url": "https://www.amazingcto.com/postgres-for-everything/",
        "text": "",
        "created_utc": 1674770708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse engineering",
        "author": "owenhickey13",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10m3ifu/reverse_engineering/",
        "text": "I just got off the phone with the manufacturer of an obsolete peice of software I'd like to use, but they have informed me that they no longer offer licensing for their software. I have a copy of it, but it refuses to run without a \"software key\". I'm just wondering if there would be a way of making the software work since the company refuses to give the key to anyone.",
        "created_utc": 1674769639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will ChatGPT replace software engineers anytime soon?",
        "author": "centdam",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10m1l81/will_chatgpt_replace_software_engineers_anytime/",
        "text": "[removed]",
        "created_utc": 1674764874,
        "upvote_ratio": 1.0
    },
    {
        "title": "IOS and Android development vs web development",
        "author": "BraveAtmosphere",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lupwk/ios_and_android_development_vs_web_development/",
        "text": "Hi,\n\nWhen developing web applications, when I made changes in the code, I just push it to the production servers and the users can see the changes without the need to do something from their side (the next time they will visit the website they will get from the production servers the updated code)...  \n\n\nBut, when using IOS applications, for example, the users need to update the app in order to see differences and get the latest changes to the code..  \nWhy is that? what is the difference?  \nThanks",
        "created_utc": 1674747715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Control and boundary classes UML",
        "author": "ph4n7om2000",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lmfpm/control_and_boundary_classes_uml/",
        "text": "I have a task to designing an e-commerce system with the following actors and use cases. \n\n&amp;#x200B;\n\nAdmins:\n\n* Add/remove products\n* Add/remove sellers\n* View sales reports\n* Manage customer accounts\n* Manage orders\n\nSellers:\n\n* Add/remove products\n* View sales reports\n* Manage orders\n\nCustomers:\n\n* Browse products\n* Add/remove items from cart\n* View cart\n* Purchase items\n* View order history\n* Cancel orders\n* Leave product reviews\n\nI need to identify the boundary class and control class for Browse Products, Purchase products and Leave product review use cases but I am not able to grasp the concepts of those 2. Can somebody help me?",
        "created_utc": 1674718316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to make a career as project management. What should I start from as a bachelor in software engineering?",
        "author": "Medical-Apple-5959",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lmc98/want_to_make_a_career_as_project_management_what/",
        "text": "I’m doing bachelors in software engineering. I’m currently enrolled in my third year. I want to become a project manager. I’m not exactly sure how though. I have completed all my courses related to software requirement, testing, quality assurance etc and I am pretty confident in them. But idk where to start now. Obviously there are no internships or jobs related to software project manager at entry level so which jobs should I target? And are there any certificates for project management required? (I heard from someone)  \n\nI am thinking of applying as a developer (I am an okay code ig) I am also interested in game development. \n\nAll in all I’m confused but I’m sure that in all of this project management is something I wanna do. Considering it’s a high pay job and it’s actually along the line what I enjoy a lot.",
        "created_utc": 1674717895,
        "upvote_ratio": 1.0
    },
    {
        "title": "On Backend Development, would you prefer putting data validation logic on Application Layer or Database Layer",
        "author": "restingisimportant",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ljwdu/on_backend_development_would_you_prefer_putting/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10ljwdu)",
        "created_utc": 1674708941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for upcoming internship",
        "author": "Montgomeryburns1291",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lit9d/resources_for_upcoming_internship/",
        "text": "[removed]",
        "created_utc": 1674705425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music Playlist Generation Feature",
        "author": "Just_R1ght",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lg9ju/music_playlist_generation_feature/",
        "text": "Hey all! I'm a student studying Software Engineering and for one of my classes our group project is thinking of making a Playlist Generation Feature that is based off of user input and prompt.\n\nI'll post a quick description here (same brief we have used for our project):\n\n**“SpeedList”** is a Spotify tool that can generate playlists based on prompts from the user. For example, a user could input the requested playlist type as \"80s Country Music\" and the feature will create a playlist with songs of the specified genre(s).\n\nThe idea for this post is to get some feedback on specific (or non-specific) traits for this feature to use as base requirements for us to program with. We are also required to crowd-source some requirements, so this is helping us with that as well. Some example requirements look like this:\n\n* Users must be able to search keywords from available tags (genres, artists, time periods, etc.) which SpeedList will then analyze and generate a playlist according to user input, which then can then save to their Spotify library.\n* Users should be able to give a specified number of songs or an approximate time length that the playlist must reflect.\n* A playlist generation must take under 10 seconds.\n* The SpeedList web application must be responsive such that the SpeedList page(s) loads in under 2 seconds.\n* A minimum 50% of songs in the generated playlist must not be contained in a user's 'Liked' songs to promote the uniqueness of SpeedList's generation engine.\n\nYour feedback can be as unique as you like and will be helpful to us regardless of your perspective and how you use Spotify (artist, listener, playlist curator, etc.). You can even let us know what you think if you don't use Spotify, maybe you use something like YouTube or Apple Music. Thanks for your insights!!\n\n&amp;#x200B;\n\nGoogle Form for interaction (completely anonymous): [https://forms.gle/EADUsmYdsY39SCf89](https://forms.gle/EADUsmYdsY39SCf89)",
        "created_utc": 1674697799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deciding the right tool for this use case.",
        "author": "FlyingRaijinEX",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ldbw9/deciding_the_right_tool_for_this_use_case/",
        "text": "My company is insisting that I use a CRM tool (Similar to salesforce) to build a system for our latest client. \n\nThe system needs to collect data from the users and generate recommendations based on the contents of it. Think of it like this. A system that suggests movies based on your preferences. And also they can add a list of movies into the database if they wanted to. \n\n&amp;#x200B;\n\nAs of now, I'm telling them we can build our on system from scratch. But, they want it to be quick, so they are planning to purchase some CRM tool. As far as I know, CRMs are meant to be used for in-house and not an application that is open to the public. They argued that building something from scratch will take a longer time as I am developing it alone (Full-stack). \n\n&amp;#x200B;\n\nSo right now, I'm trying to learn my way around the CRM and trying to make sense about all of it. I'm just not seeing how I'm going to build the system using the CRM in the long run. Do note that I need to add custom functions as well to fulfill the requirements from the stakeholders. \n\n&amp;#x200B;\n\nThus, my question is, should I continue with the CRM and struggle my way in to create something that they want, or should I convince them that we can build it from scratch and implement whatever function that we want. \n\n(Also, the system needs to communicate with other data sources/apis/etc)\n\n&amp;#x200B;\n\nI'm completely lost and unsure what to do next. \n\n&amp;#x200B;\n\nThank you",
        "created_utc": 1674689706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is computer science degree needed to be a software engineer? (UK)",
        "author": "TheNicestQuail",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10lb4eo/is_computer_science_degree_needed_to_be_a/",
        "text": "I'm not sure exactly what I need to do to become a software engineer in the UK but in general the answer seems to be that I must obtain a computer science degree. However it's also confusing because not all job applications actually ask for one?\n\nCan someone please tell me what I need to do to be qualified?",
        "created_utc": 1674684191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help I have no experience in C++",
        "author": "PotatoMan2810",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10l9du5/help_i_have_no_experience_in_c/",
        "text": "For context, I'm looking for my first job as next month I'm entering college.\n\nI somehow landed a awesome internship for Firmware development, the thing is, they want someone who knows advanced C++\n\nI've been coding for \\~4 years, but I always used Python, Javascript or Lua for my aplications, and the only thing I know about C++ is Arduino.\n\nCan I somehow learn C++ in 2 days? Should I do lots of Leetcode questions or focus on theory and read a lot?\n\nPlease help!",
        "created_utc": 1674679975,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made chatGPT write an article about \"best books for developers\" and it did suggest really great books, i have already read some od the books it suggested but I'm going to read the rest of them...",
        "author": "ilyasipek",
        "url": "https://link.medium.com/9uDltGizSwb",
        "text": "",
        "created_utc": 1674659486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Podcasts/something to listen to during work?",
        "author": "Sanfran_hippie",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10l0b9v/podcastssomething_to_listen_to_during_work/",
        "text": "I'm looking for some recommendations on coding podcasts or something I can half listen to and still learn something while I work. I'm currently doing web and mobile dev but like all the developments. \nHope you have a great day",
        "created_utc": 1674658098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad documentation can lead to technical debt - here’s how you can solve it",
        "author": "9millionrainydays_91",
        "url": "https://javascript.plainenglish.io/bad-documentation-is-tech-debt-heres-how-you-solve-it-ce1d0b3ee760",
        "text": "",
        "created_utc": 1674652240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineering and Design eBook Bundle",
        "author": "Pixel2023",
        "url": "https://www.humblebundle.com/books/software-engineering-and-design-taylor-and-francis-books?partner=arcgamer&amp;charity=1112198813371",
        "text": "",
        "created_utc": 1674650148,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ain’t capping here. Anyone who’s ready get at me for ya X2 EMVs, X3 FOUNDRY,, X2 GOT JCOP BPTOOLS CARDPEEK etc, DuMps WITH HIGH BALANCE hmu and we finna eat together. To place ur order t.me/thegriot001. I got a g👀d discount for bulk purchase. t.me/thegriot001",
        "author": "Jonnsnoww001",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10kxdhg/i_aint_capping_here_anyone_whos_ready_get_at_me/",
        "text": "",
        "created_utc": 1674649237,
        "upvote_ratio": 1.0
    },
    {
        "title": "When reviewing code how much time do you spend on style vs core logic?",
        "author": "ASAPGosu",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ko3f3/when_reviewing_code_how_much_time_do_you_spend_on/",
        "text": "Hey everyone, I’m just curious about how much effort you guys put into making sure the proposed changes conform to the style of the repo. Is that something you care about?",
        "created_utc": 1674615044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ai voice cloning besides Descript.",
        "author": "Ancient_Vegetable_62",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10kmuqp/best_ai_voice_cloning_besides_descript/",
        "text": "",
        "created_utc": 1674611435,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get into software sales step by step?",
        "author": "markgrayson69",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10kj9yu/how_to_get_into_software_sales_step_by_step/",
        "text": "Hello awesome people. Currently studying Econ and minoring in sales leadership at university and I’m looking for a summer internship in software sales. Best way to go about this?",
        "created_utc": 1674601738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding black-box and white-box testing",
        "author": "Akmandev",
        "url": "https://akman.hashnode.dev/understanding-black-box-and-white-box-testing",
        "text": "",
        "created_utc": 1674594587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Risky Resume",
        "author": "SuperFlyGuy578",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10kedqw/risky_resume/",
        "text": "[removed]",
        "created_utc": 1674589895,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi…. Jobless 17yr old…. Got a few questions",
        "author": "Heavy-Refuse-3733",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10kblpr/hi_jobless_17yr_old_got_a_few_questions/",
        "text": "Ok. I am in the UK, aged 17, and have been deciding on university. I have chosen to do my beloved course philosophy/theology, however, the meme is apparently true, there are no jobs for the modern Aristotle. my secondary interest, is in software, and think this would be a cool career path. Basically the plan is thus: go to university, get philosophy/theology degree, do conversion/masters in software engineering course (or whatever it is called), then go into a job…..\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nis this in any way feasible, am I missing anything, is this stupid, or is this a decent plan?",
        "created_utc": 1674583200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it legal for my employer to change my job role overnight?",
        "author": "SemperZero",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10k8ith/is_it_legal_for_my_employer_to_change_my_job_role/",
        "text": "Hello! I am a software/ML engineer from Romania with 4-5 years experience, working for a company in Silicone Valley. They have an office here, but we work directly with the people there (hours of late night meetings), but for 5x less pay. \n\nI have doing gruesome and janitor work of extremely awful code bases, debugging impossible bugs happening due to weird workarounds to prohibited by compiler things, done low level C optimizations to the data pipeline / computation mechanism. I have done exemplary work, got only congratulations, though i burned out and got to 50% speed after months of janitor work (they did not say i was underperforming, just subtly saying i have to be faster)\n\nFinally, when the promised day came and i was going to start working on a ML project, after months of promises (i also proposed and designed over 20 until this point), they changed my team to the frontend team. Without any previous warning, simply in the day i had to start working on the project, they told me my team has been changed. Is it legal for them to do this? Is there anything i can do? They fucked my career plan for the next at least 6 months, possibly 1 or 2 years because of this. I want to work in ML engineering, but now i have nothing on my CV to show for because of this. \n\nI can't resign because i don't have enough money put aside (the pay was very low) and i need the health insurance. Now i have to learn thousands of lines of new code for something i am not interested at all in working and have to do something i hate for months until i find another job. Is there anything i can do legally? Or i just have to take the punch, learn a lesson, respect myself more and find a better job in months?",
        "created_utc": 1674575436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineering Student here. Gauging the popularity, community size, and support for the following backend paths/ languages",
        "author": "flinchFries",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10k7bdu/software_engineering_student_here_gauging_the/",
        "text": "Hi, I'm trying to research what language is a good investment here. My courses are heavily focused on Ruby. Before joining the school, I only heard amazing things about Python from developers and heard some nasty stuff about PHP. Thankfully, I have many resources out of class to learn Python.\n\nI know that each language shines based on certain applications. And I'm well aware that Python excels in machine learning and data science.\n\nI would like to know what the overall feel is here in this subreddit.\n\n[View Poll](https://www.reddit.com/poll/10k7bdu)",
        "created_utc": 1674572219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maximizing flexibility with Test automation in Agile and DevOps",
        "author": "serenagray2451",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10k73iq/maximizing_flexibility_with_test_automation_in/",
        "text": "Companies have embraced the concept of test automation in agile as it not only accelerated their testing process but, also led to frequent customer feedback. This in turn led to enhanced product development, thereby churning out a high-quality software product. Products are released within shorter timelines. Agile development can simply carry out its activities at a faster pace than expected through the incorporation of automation testing. Test automation also plays a crucial role in the DevOps platform. A large portion of the development pipeline can be automated. Initially, a single end-to-end scenario is automated and then run the test on a scheduled basis. In this article, you will get to know how flexibility can be maximized by implementing Agile and DevOps.\n\n**What is test automation?**\n\nIt is a software testing practice wherein a software product such as a web application is automatically reviewed and validated. This is done to make sure that the predefined quality standards for user experience, functionality (business logic) and code style are met.\n\nTest automation tools play a key role in carrying out automation testing activities efficiently. As many organizations are adopting agile and DevOps lifecycle, it becomes important to utilize test automation across the lifecycle to unlock the key benefits of DevOps and agile.   \n\n**The strategic role of test automation in agile:**\n\nFaster product release requires accelerated testing, which, in turn, requires accelerated coding. Whenever a new update to the application is released in the market, every user using that specific application expects the app to be perfectly functional. If the users are not happy then there are chances that they might switch to a competitor, which in turn may impact the brand image of the organization.  \n\nFlawless functioning is ensured by testing each update and feature comprehensively. Such complex and feature-rich software will take a lot of time and effort to perform manually and hence automation testing is considered to be a feasible option.\n\nTest cases are created by QAs through automation testing in agile approach. Whenever a new code is pushed to the code repository for a specific application then these test cases will run automatically. This specific practice is called as continuous testing in agile and ensures that the new code is free of bugs before it hits the production environment.\n\nSeveral tools and frameworks such as Cypress, selenium etc. are used for implementing test automation in agile.  \n\n**The strategic role of test automation in DevOps:**\n\nTesting becomes a shared responsibility of the entire team through the DevOps platform. Developers can ship code changes quickly through the automation testing platform. Unit tests are written by developers to validate the code works as expected. \n\nAutomated UI tests are created by product owners and quality practitioners through which the end-to-end user experience is validated. Exploratory testing sessions are organized by quality practitioners where the various application areas for issues are examined by the team manually.\n\nRunning automated tests as often and as early as possible within the CI/CD pipeline is considered to be a DevOps best practice. Automated UI tests in production are run so that user experience issues are proactively monitored. Synthetic transaction monitoring is performed by applications that rely on numerous services. Tests are run in production so that issues can be detected with third-party services before your users do.",
        "created_utc": 1674571606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search results for soql -Salesforce query",
        "author": "veena_desai",
        "url": "https://power-bi.in/index.php?qa=search&amp;q=soql#.Y8-64n10GlU.reddit",
        "text": "",
        "created_utc": 1674558208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the big lay offs mostly just the results of an ending pandemic?",
        "author": "DonDandara",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10k0k3m/are_the_big_lay_offs_mostly_just_the_results_of/",
        "text": "Hey everyone,  \n\n\nSo i have been thinking quite a bit about these lay offs recently and wanted to share this .  \nAre the lay offs mostly just a result of the end of the pandemic?  \nSince the begining of the pandemic, the scope of work has been increased by a lot as every small business needed some online presence.  \nDuring these times, everyone was employing Software engineers as much as anyhow possible, so since peolpe are less home, using those services less and small businesses do not need them to operate, could the lay offs just be going back to the state before covid?  \nSeems to me its mostly just that to be honest.  \n\n\nSpotify even said something along these lines as people now listen less, they are doign a 6% cut in employees..",
        "created_utc": 1674547543,
        "upvote_ratio": 1.0
    },
    {
        "title": "What positions or skills are in demand in the software job market ?",
        "author": "Away_Examination_216",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jymwy/what_positions_or_skills_are_in_demand_in_the/",
        "text": "I currently work as a software developer and I'm trying to build my resume by learning some skills. What are some in demand skills in the job market ? how do you find them ?",
        "created_utc": 1674539888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search results for soql - Salesforce explore",
        "author": "veena_desai",
        "url": "https://power-bi.in/index.php?qa=search&amp;q=soql#.Y89XNHSO92A.reddit",
        "text": "",
        "created_utc": 1674532692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Apache Hadoop a project idea?",
        "author": "Joonscene",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jrriq/is_apache_hadoop_a_project_idea/",
        "text": "I'm in college, taking Software Engineering II. First off, this is not homework help. I need someone to tell me I'm not insane. \n\nMy professor denied my project Idea of Voice Cloning AI and gave me \"Apache Hadoop\". How is that a project exactly? Can someone explain? My first step in the project is to draw a Block Diagram for the project.\n\nHow would one go about doing this? \n\nTo add on, how am I supposed to \"draw a use case, showing classes and interfaces for your project\"?",
        "created_utc": 1674518535,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you guys think of the Coursera Meta courses? Worth it?",
        "author": "Live-Selection5206",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jr64i/what_do_you_guys_think_of_the_coursera_meta/",
        "text": "So I’m actually a marketer and I really want to become a front end dev. I’ve started a coursera course by Meta. To get me started. It looks like a good starter course. \n\nhttps://www.coursera.org/professional-certificates/meta-front-end-developer\n\nYou build a website at the end, they give you interview advice and they open you up to the Meta jobs portal where companies that want Meta trained devs have signed up to. Has anyone heard anything about it or have any experience with this?\n\nAny advice? I’d really appreciate it.",
        "created_utc": 1674516985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Identity Management &amp; Multi Account design",
        "author": "TheAeseir",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jqjpl/identity_management_multi_account_design/",
        "text": "Heya friends,\n\nI'm doing some research on tenancy and identity management design and an seeking your valuable help.\n\nSpecifically using single identity to be linked to multiple accounts/tenants. Think Slack and the ability to have single identity, but be able to change tenants (workspaces) as needed.\n\nHow did you handle this challenge? What content have you come across that helped you design a solution?  \nAny resources on this topic is welcome.",
        "created_utc": 1674515409,
        "upvote_ratio": 1.0
    }
]