[
    {
        "title": "Software Design Document - Lite",
        "author": "Over-Use2678",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jp77i/software_design_document_lite/",
        "text": "I'm trying to build some documentation on some new development work. This would be targeted towards other software engineers to be used as a guide for building an internal library, with about a dozen users. Ideally it will have sections for purpose, interface guidelines, how to add additional functionality in the future, and so on. The library will mostly function as an adapter to other functionality, with some mediation going on. \n\nI went looking for a template to use for documenting this, but everything seems overblown and way too detailed. I want people to read it, not skim and forget it because it is too much. \n\nDoes anyone have suggestions for a good document template that is digestible but not a tome?",
        "created_utc": 1674512074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pair programming",
        "author": "rhde",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jp63z/pair_programming/",
        "text": "Hey developers, quick question.. what percentage of your job consists of pair programming?  \n\n\nI'm currently at a bootcamp that pairs us up 4/5 days a week and I hate it, I am learning how to communicate my code better but I'm not good at thinking/learning with someone else, I like doing it alone.  \n\n\nIt's really doing my head in, any advice would be great.",
        "created_utc": 1674511996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for better work/life balance in the new year?",
        "author": "lifeatmastercard",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jk0o8/looking_for_better_worklife_balance_in_the_new/",
        "text": "Are you interested in working for a true technology company where you can learn, grow, take on new challenges and still experience a great work/life balance? You can find that here at Mastercard! We have a company focus on creating a flexible work environment, so you can have the flexibility to deliver your best and most innovative work. \n\nLearn more about the tech behind Mastercard in [this video](https://www.youtube.com/watch?v=0IHqbqaYSsQ) \n\nWe encourage you to explore and learn more about growing your engineering career at Mastercard!\n\nView jobs and apply:  https://mstr.cd/3XV0zg1",
        "created_utc": 1674499566,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who studied software engineering career at university, do you learn really important and useful stuff?",
        "author": "Available-Evidence40",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ji1w9/people_who_studied_software_engineering_career_at/",
        "text": "   \nI'm just interested to know things like, Was there any point in taking that career? Did you get a job fast? Things like that",
        "created_utc": 1674494933,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created a system design diagram for Coinbase API. What do you think? Your feedback is welcome. Thanks!",
        "author": "mikhails1",
        "url": "https://www.reddit.com/r/fintechdev/comments/10i27f1/coinbase_api_system_design_for_fintech_developers/",
        "text": "",
        "created_utc": 1674493296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help With College Major",
        "author": "Latter-Medicine2142",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jg9j5/help_with_college_major/",
        "text": "I’m currently a CS major in college but the math sucks. I recently read that I could major in Computer Information Systems and get the same career outcomes with less math. I want to be a software engineer so does anyone know the legitimacy of those claims?",
        "created_utc": 1674490584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salary increase to lv4",
        "author": "strawberryrsa",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10jfxrp/salary_increase_to_lv4/",
        "text": "What is the typical raise when promoting from level 3 (entry level software engineer) to level 4 (still software engineer, not senior)? How much does it vary? I'm more interested in the base since stocks take so long to receive.\n\nDon't want to reveal the details but I heard a colleague who got promoted got only get a slightly higher raise than me (who wasn't promoted) last year and that seems unusual.",
        "created_utc": 1674489767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why code documentation is broken - and how we might have finally fixed it.",
        "author": "TheLostWanderer47",
        "url": "https://javascript.plainenglish.io/code-documentation-is-broken-but-i-think-swimm-may-have-fixed-it-daaa7547d834",
        "text": "",
        "created_utc": 1674487466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking Back “Software Engineering” – Craftsmanship is Insufficient • Dave Farley",
        "author": "Resident-Research799",
        "url": "https://www.youtube.com/watch?v=ephM9Nw9pAA&amp;list=PLEx5khR4g7PKuDrMVDkHvItDxCsB0msAs",
        "text": "",
        "created_utc": 1674479389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help With My College Major",
        "author": "Significant_Low_3113",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10j2n4t/help_with_my_college_major/",
        "text": "I’m in college trying to get a degree in CS and become a software engineer but I recently read somewhere that I could major in computer information systems and do less college math with the same job outcomes. Anybody know if this is true or not?",
        "created_utc": 1674444627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing design docs",
        "author": "mcweirdy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10j0pci/writing_design_docs/",
        "text": "I've been trying to get goid resources on writing design docs for a while now, but I can't find any. what resources would you suggest??",
        "created_utc": 1674438726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Agile: The Only Science That Works in Software Development",
        "author": "gamachexxx",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10iyxqh/agile_the_only_science_that_works_in_software/",
        "text": "Hey everyone,\n\nI just published a new article on the topic of software development and the Agile methodology on LinkedIn. If you're interested in the advantages of Agile over the Waterfall approach, this article is for you!\n\nI'm convinced that you'll love reading about the key elements of Agile methodology such as adaptability, collaboration, and flexibility. I'm looking forward to reading your comments and impressions on the article.\n\nThanks in advance for your time, you can check it out here: [https://medium.com/@oliviergamache/agile-the-only-science-that-works-in-software-development-86d01b05f049](https://medium.com/@oliviergamache/agile-the-only-science-that-works-in-software-development-86d01b05f049)\n\nSincerely,  \nGamachexx",
        "created_utc": 1674433575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there jobs that combine web development with biostatistics?",
        "author": "Accomplished_Pipe563",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10iy04y/are_there_jobs_that_combine_web_development_with/",
        "text": "",
        "created_utc": 1674431020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linux Beginner Resources!!!",
        "author": "Agreeable-Ad-7350",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ixvo4/linux_beginner_resources/",
        "text": "Hey guys, my passion is making cs education accessible to all and digestible for students who find the material too dense. Youtube videos got me through all my cs courses, so I wanted to make my own. I’ve been wanting to create videos on different topics and finished my first one on Linux commands. I wanted to share it here and see if I could get feedback :) This could be a super helpful resource for others' learning, starting out with Linux. I also wanted to work on new basic coding topics and would love some ideas for topics to start with!\n\n([https://youtu.be/AWDxfZkGW\\_w](https://youtu.be/AWDxfZkGW_w))",
        "created_utc": 1674430671,
        "upvote_ratio": 1.0
    },
    {
        "title": "To join a bootcamp or not?",
        "author": "External_Jeweler8785",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10itmpg/to_join_a_bootcamp_or_not/",
        "text": "I have an undergraduate in sw eng from a really good school, but I honestly didn't do well during school and barely scraped out with an 3.0. Nevertheless I have a solid programming job at an okay company (for its sector)\n\nI feel like I am very lacking in the innovative and creative design, communication skills (both listening and explaining) and I'm lacking in overall programming skills.\n\nShould I join a bootcamp, read some books to further my design skills, or what should I do?",
        "created_utc": 1674420072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thesis ideas in software engineering",
        "author": "saeed0994",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10iq9x3/thesis_ideas_in_software_engineering/",
        "text": "I planned to start my master degree thesis and my advisor told me to start searching for an idea. if you could suggest me an idea or any challenges in software engineering it would be appreciated..",
        "created_utc": 1674411715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I in danger of loosing my job?",
        "author": "Beese__Churger",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ip1im/am_i_in_danger_of_loosing_my_job/",
        "text": "Can anyone advice me what to expect or do in my situation?\n\nI'm a fresh grad having only a 3 months experience in a non-tech company as an intern and I had finally gotten my dream job at a product based company I've been trying to get into after graduation for so many times but my team lead gave me a warning/slash foreshadowed that I might not be here after the probation.\n\nMy probation was of 3 months. During which, first month was pretty much used up in getting me to learn Angular (I had no Angular background), the product itself, the codebase, their coding practices and such. The second month, probably in the late December, I was given my first task split into 3 tickets. All had similar work or the solution was similar in all 3 of them. So I got to work, I admit, since it is remote work so I was kinda little slow since the nature of the task was easy and I knew I could do it. So I completed the tasks before the sprint ended, actually a few days before the sprint ended and I submitted my tickets for PR.\n\nThe problem began with the constant issues rising in the PR during my team lead's feedbacks. I kept implementing those changes (mostly coding practices related and stuff). The team lead even had a peer coding session with me to show me proper coding practices of TypeScript and I learned a lot during that and thanked him for it. The issues kept rising in the 3 tickets to the point that only 1 PR got approved at the end of the sprint while the rest of the 2 kept getting reviewed in the next sprint. I was also assigned more tickets but couldn't work on those as the API wasn't available from the backend team.\n\nI also kinda fucked up cuz I misunderstood a team lead's message and merged a branch of one of the tickets without approval. That ticket also had a syntax error that I didn't see so I worked with a guy from I'm guessing he was from QA or something, to fix this issue and roll back the changes which were thankfully only on the preview stage and nothing was harmed. But it was very humiliating for me (I didn't know approval of PRs was strictly followed and it is my mistake for forgetting that even though it was written in the coding practices document shared with me)\n\nDuring the probation, I had a few communication issues with my team for which I took complete responsibility and apologized and promised to be better and I did. Got more active and responsive on Slack and etc. Now a few days ago, I requested a 1 : 1 with my team lead asking for help in clearing a blocker since the culture really emphasizes on the fact that everyone should help clear each other's blockers. That's where my team lead said something to me that is still worrying me to right now ;-;\n\nAfter clearing the blocker. He said that he's not satisfied with my productivity and the quality of my work, and I'm also lacking on communication side. That I was given more than enough time to learn Angular but still I'm getting stuck on trivial problems. That even the blocker today was something covered in my course (it wasn't, I confirm this) and that I shouldn't have been stuck on it. And that, since its my probation, its very risky time for me and that once the probation ends, my manager would ask for his review and he would give his review being loyal to the company. He said that even tho I'm a fresh grad, I should really step up my game and that its a golden opportunity for me to be in this company as they don't hire fresh grads and only experienced engineers (which is true and the company is OG). That I should really step up my game and all since my probation is nearing its end and all that.\n\nThank goodness the camera wasn't turned on during the meeting cuz I was literally crying while saying \"okay.. okay.. yes.. my apologies.. you're right\" and he was like \"I'm not comparing you with the other hire we have (he's also a fresh grad but had a year experience in another company so he's way ahead of me in terms of productivity and coding)\" and all that. I am forgetting a few other details of what he said.\n\nAfter that, I completed my PR feedbacks in the next day and completed the ticket and merged it. I am trying my best right now to be as productive as I can, as soon as I got the API set up, working with the backend guy, I made sure I could complete as much work on my end as possible on Friday before the weekend. \n\nBut I am still worried that I have left a bad impression on my team lead and that I should kiss my job goodbye and all.. I have a meeting with my manager tomorrow.. I am scared on what to expect.",
        "created_utc": 1674408641,
        "upvote_ratio": 1.0
    },
    {
        "title": "The litany of bugs",
        "author": "IWAHalot",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ieity/the_litany_of_bugs/",
        "text": " \n\nI must debug.\n\nBugs are the code-killer.\n\nBugs are the little-errors that bring total miscalculation.\n\nI will find the bug.\n\nI will run every possible test and corner case.\n\nAnd when they have passed, I will turn the bug report to “resolved”.\n\nWhere the bug has gone there will be nothing. Only a feature.",
        "created_utc": 1674374751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breaking down AI Neural Networks like LEGOs",
        "author": "JSlicky",
        "url": "https://medium.com/ai-in-plain-english/breaking-down-ai-neural-networks-like-legos-1db46a2546a0",
        "text": "",
        "created_utc": 1674372358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work split on modules horizontal or vertical?",
        "author": "mbrseb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10icseh/work_split_on_modules_horizontal_or_vertical/",
        "text": "[removed]",
        "created_utc": 1674368088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think switching from Sr. tech lead to Individual contributor/senior software Engineer is like taking a step down the ladder?",
        "author": "nutandevjoshi",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10i88er/do_you_think_switching_from_sr_tech_lead_to/",
        "text": "",
        "created_utc": 1674353139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from medicine to software",
        "author": "DistinctDiscussion0",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10hvmq9/switching_from_medicine_to_software/",
        "text": "Hey everyone,\n\nI just wanted some advice on potentially switching to the software engineering/coding industry. Currently, I’m a 2nd year medical student and unfortunately, I have a health issue that came up. It’s getting more and more difficult for me to continue with medicine due to the high tuition and relentless pressure of my studies. I also worry about my future as a physician with my condition and I believe it would be better for me to pursue a work-from-home job such as software engineering.\n\nI was wondering what is the most cost-effective and sure-fire way for me to land a position (at least starting off as a junior web-developer). I have heard that there are boot camps, are these worth pursuing? What languages should I learn? How much time will it take me generally? I have a bachelor’s in biology with no tech experience.\n\nAny other advice would be much appreciated. :)",
        "created_utc": 1674319963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enabling static analysis of SQL queries at Meta",
        "author": "fagnerbrack",
        "url": "https://engineering.fb.com/2022/11/30/data-infrastructure/static-analysis-sql-queries/",
        "text": "",
        "created_utc": 1674317076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why developers are always to be blamed?",
        "author": "_end_of_line",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10htxfk/why_developers_are_always_to_be_blamed/",
        "text": "Hi all, I am writing my first post here. I have worked so far in more 7 companies and I noticed following trend. There are plenty multiple roles in software engineering  chain: business analysts, testers, administrators, managers, developers and so on. However, I noticed that it always goes on in this very way. Whatever  happens bad, developers always guilty and blamed. I have had situations like this: automated tests were dead broken, deployments were broken, infrastructure for devs down for days, whole project was delayed because of thus 3 months and more, then nobody cares you have less 10 business days to complete quite a big migration from spring boot 1 to 2 for big financial project ( 100+ endpoints developed for many years ). I have migrated this in time and gave it to QA testers. Nobody noticed that one ( from 100+ ) was broken, even qa testers until it hits production ( after more than 1 month \"testing\" ). Surprise, I am blamed for this, nobody else. Just I am wondering, if nobody here was guilty except from me, why companies do hire testers and others to do nothing ( because their \"testing\" has no binding value ). Is it the same for your or i simply work for bad companies? The list of the mess of that broken environment, is much much longer and I didn't want to bore you more",
        "created_utc": 1674315488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those working in large teams How do you guys keep your environments from breaking?",
        "author": "doodleboy123",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ht563/those_working_in_large_teams_how_do_you_guys_keep/",
        "text": "I’m working on a billing product with lots of configurations and modules,and require the flow working e2e for testing my code,however every time i find the environment isnt up fully due to someone changing the configuration from db or doing an ssh to the env and changing the deployment , so requesting experinced members of the sub to pls share some tips",
        "created_utc": 1674313298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career movement to Cloud",
        "author": "SuperHeroww",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10hse7g/career_movement_to_cloud/",
        "text": "Hi all,\n\nI am based in Canada and I am a software engineer for a big bank for the past 1.5yr (100k + 12k bonus). \nMy whole career (12yrs) I worked with Mainframe development - Cobol etc…\nI feel like I am stuck here, there are only few big companies that I could get a job, since Mainframe is not common.\n\nMy question is…How do I prepare myself for a career movement to cloud? I am asking because I’ve been studying AWS, but companies always ask for experience…\n\nDid anyone go through something similar? If so, how did you overcome it?\n\nThank you!!",
        "created_utc": 1674311156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real-life examples of the software engineering process from the very start (requisite gathering) to the end.",
        "author": "SoloUnoDiPassaggio",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10hnohx/reallife_examples_of_the_software_engineering/",
        "text": "As title, is there any place where I can look at some real-world example? I’m in a strange situation where I do this professionally but I’m alone and apart from reading books (Ian Somerville) I don’t have real-world experience of a well established set of good engineering practices, and my employers have no intention of investment in education.",
        "created_utc": 1674294557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self taught front end engineer looking for career guidance",
        "author": "torgian",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10hl7pr/self_taught_front_end_engineer_looking_for_career/",
        "text": "Stats:\n\nU.S. citizen currently working in japan as a front end engineer and starting to learn backend (php Laravel since that’s what the company uses)\n\n5 years experience\n\nSkills: JavaScript, html css, Vue / Nuxt framework, some php, Python and Django\n\nCurrent Role:  I manage an entire project and am the lead developer now. I manage a few part timers in a health care startup.\n\nPast: Military veteran and a few jobs since then while teaching myself software development before I secured my current role.\n\nQuestions:\n\nSo first, I’m looking for work back in the States and am basically looking for career advice. I know I’m not the smartest tool in the shed, and I am a slow learner, but I learn.\n\nMy mentor in my current company helped me a lot with best practices, clean code, etc. I’m a lot better at my craft now than I was even two years ago.\n\nHowever, now that I’m looking to move back to the states with my wife, I feel like I need to learn something more. I know front end roles still exist, but am a little worried about securing a good role to support my family.\n\nSo… advice? Should I potentially look at moving into management? Or should I continue focusing on developing backend skills?\n\nI’ve also considered taking an online MIT course for machine learning, but to be honest, I’m not sure if it’s a good fit for me.\n\nI know I’m not a FANG type, but I’m obviously doing something right because I secured this startup role in Tokyo and have done well. \n\nI just don’t have a lot of experience in this field, not like those who have done it since college. I’ve got good soft skills, but I’m also 40 (let’s not pretend ageism does not exist). \n\n\nSo… advice? Advice on locations on where to look too. My wife and I wish to live in California, but we will live and work anywhere until she has her finance cpa finished.",
        "created_utc": 1674284453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent Tech Layoffs",
        "author": "Bacon-80",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10hgzz9/recent_tech_layoffs/",
        "text": "I’m not sure if this is the right subreddit but here it goes.\n\nI am extremely infuriated by the wrong information that’s coming out about these tech layoffs. People are insulting tech jobs, the companies, and employees who are still employed at the companies.\n\nFirstly, none of the employees knew this was coming. It was a shock, for a lot of them it came through them trying to login for work in the morning/trying to access a building. It really really sucked for those affected.\n\nSecondly - there seems to be a lot of misinformation about _which_ roles got laid off exactly. Majority of them were HR, admin, operations, recruiting, etc. Not many of them were software engineering roles &amp; the ones that were happened to either be super senior roles that were basically resting &amp; vesting, or new employees who had barely been there for a year. Software engineering isn’t a dying market and it won’t be replaced with Ai anytime soon. Anyone who thinks that clearly doesn’t understand how Ai operates 🤦🏻‍♀️\n\nEveryone knows big tech hit a hiring surge &amp; hired an insane amount of employees. Meta was in the need about hiring over 100k new employees as were many faang companies. These layoffs seem to be roughly the same % hired during that time. \n\nIt really sucks how it happened, but for everyone worrying about them getting jobs…you have to realize these people all have big tech on their resumes &amp; will likely be scooped up by other companies in a heartbeat because of their expertise.",
        "created_utc": 1674270051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone been to Confoo conference in Montreal",
        "author": "ForeignCabinet2916",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10h9nca/has_anyone_been_to_confoo_conference_in_montreal/",
        "text": "Planning to attend Confoo 2023 conference in Montreal and was wondering if anyone has been to one in past and could share their experience",
        "created_utc": 1674251839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guidance for scholarship in masters abroad or a student loan",
        "author": "Medical-Apple-5959",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10h2c7z/guidance_for_scholarship_in_masters_abroad_or_a/",
        "text": "Third year student year here. I’m from a third world country and I want to do my masters abroad. Since I can’t really afford it and don’t really have a strong background. \n\nI want to apply for a scholarship. I have 3.3 GPA for now and I’m pretty sure I will be able to keep it up till my bachelor is done. \nHas anyone done master here on scholarship? I need guidance on what to do and where should I look to apply. Secondly if my GPA is too low I don’t mind going for student loan as well. What are my options and what would be your suggestion?",
        "created_utc": 1674234676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendation for philosophy background",
        "author": "bonsense3",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10h1jpz/book_recommendation_for_philosophy_background/",
        "text": "Hello, I've been studying software engineering at a college for a year now. And I majored in physics and philosophy at university. \n\nCan anybody recommend me some books that explain software and programming languages from a philosophical perspective?",
        "created_utc": 1674232823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Came across this listing today, what is so useful about this? Is it really worth that much?",
        "author": "wallace_mcwater",
        "url": "https://www.ebay.com/itm/314336035324?mkcid=16&amp;mkevt=1&amp;mkrid=711-127632-2357-0&amp;ssspo=28kna5nlqpe&amp;sssrc=2349624&amp;ssuid=28kna5nlqpe&amp;var=&amp;widget_ver=artemis&amp;media=COPY",
        "text": "",
        "created_utc": 1674226627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please can someone help me out, in a bit of a pickle, and all x",
        "author": "scranbat",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gxgvz/please_can_someone_help_me_out_in_a_bit_of_a/",
        "text": "Basically, I'm doing some work for a client, it might be a little bit out of my comfort zone, but I thought I'd give it a go, and worst comes to worst I pay someone else to do it for me. This might not be the best place to post this as it's probably fairly nooby lol, so if I should post it somewhere else please let me know! I can speak basic javascript and python, and so can my old man, so together we should be able to sort it out. Just need some recommendations.\n\nEssentially I need to find a way for the client to fill out the form attached (its a rough mockup) and for that form to filled out to automatically go into a template and can be sent or saved as a PDF.\n\nIt's for a small catering business that just want to be able to fill out a form of all the timings and useful information and that information to turn into a template. I have attached the form and the template they want to use.\n\nI might not have explained it very well, so if you have any questions please let me know. I would really appreciate the help on finding out how to actually do this, I'll even buy someone a coffee if they can help. Yep, a whole coffee. \n\nThank you all.",
        "created_utc": 1674222691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all these big tech lay offs because of a combination of the upcoming global recession and recent AI advancements?",
        "author": "Signal_Put9723",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gu2kj/are_all_these_big_tech_lay_offs_because_of_a/",
        "text": "",
        "created_utc": 1674212326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Search results for soql - run soql query",
        "author": "veena_desai",
        "url": "https://power-bi.in/index.php?qa=search&amp;q=soql#.Y8puCE2JVX0.reddit",
        "text": "",
        "created_utc": 1674210866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Salesforce? - Salesforce Software",
        "author": "veena_desai",
        "url": "https://power-bi.in/index.php?qa=3339&amp;qa_1=what-is-the-salesforce#.Y8ps3RaANyk.reddit",
        "text": "",
        "created_utc": 1674210604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are volunteer positions doing software engineering worth it",
        "author": "FigOk9487",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gqzph/are_volunteer_positions_doing_software/",
        "text": "if I have no experience as a software engineer?",
        "created_utc": 1674200907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse codex?",
        "author": "Sucker_Chump",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10goqkg/reverse_codex/",
        "text": "Codex writes code given a description. Can it write a description given some code?",
        "created_utc": 1674193155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Schooling/programs for certifications, and other questions.",
        "author": "diesel6991",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10glnfp/schoolingprograms_for_certifications_and_other/",
        "text": "Hello, as the title suggest I am inquiring about schools or programs to get started in this field. I am currently a diesel mechanic (I know completely opposite career field). But I have always been tech savvy and wouldn't minding getting into something along the lines of software engineering or coding, are those terms interchangeable? I am thinking of a backup career field in IT, due to the physical stress that being a mechanic has, and will, put on my body in the future. I am only 26, so I am perfectly fine right now. I like to have options though. I am a veteran as well, so any programs or schools that accept the GI bill would be a bonus. I am not looking into getting a degree but more of a certification. Based on my research so far, it seems very possible to get started in this field without one? Any insight on the pros and cons of either would be appreciated. Are these 6 month part time courses legit or just a marketing scheme to get your money? I want to learn the skills needed to accel in this career, and not just nonsense in order to get my certification. I'd prefer real life scenarios that will prepare me for the future. I have absolutely zero experience or knowledge in software engineering, so bare with me if I am making assumptions that aren't necessarily true. Are these classes difficult as far was work load goes? I do work full time, so going to school full time is not an option. But I am single and have no kids so putting in the effort after work is not an issue. Also the big question, what kind of salary is expected when starting out in this field? I feel like I could do much better for myself in this field than my current situation, but I could be wrong as well.",
        "created_utc": 1674183951,
        "upvote_ratio": 1.0
    },
    {
        "title": "If most ML is done in Python, then what are some ways in which these ML implementations are ported over to mobile apps?",
        "author": "pantshirtshoes",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gkeo0/if_most_ml_is_done_in_python_then_what_are_some/",
        "text": "Disclaimer: I don't know Python, nor mobile app development that well - yet.  \nYou know those image recognition apps for your Android, or iOS....where it recognizes the type of plant you're looking at - Is all the processing \\*always\\* being done on the server side? or let's say I take upon an ML project where I want to train my data to recognize when the baby has crawled out of his crib, versus when he's in the crib (don't get stuck on the specifics - it's just an example) - I'm assuming that I will have to point a webcam at the baby and train my data using Python libraries, etc. - But then let's say I decide that my mobile device is the best medium on which I can cheaply set-up my app...   \nHow do people bridge these two technologies?",
        "created_utc": 1674180535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Roadmap help please",
        "author": "_Interaction",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gitod/need_roadmap_help_please/",
        "text": "Hi Everyone, I have been making up mind for a while know to make a career shift from finance field to software engineering field, I want help from experts what can i do to persuade a career in software engineering what am looking for basically is a road map so that I don’t get lost, i read about software engineering and i found out that there are several roads like: \n\nFull stack develop \nFront end developer\n Backend developer \n\nHow can i start to become a reliable full stack developer ? \n\nAny roadmap please and even sources to read more would be much appreciated.",
        "created_utc": 1674176284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing proper technical articles - Stavro Xhardha",
        "author": "stavro24496",
        "url": "https://coroutinedispatcher.com/mistakes-during-blogging/",
        "text": "",
        "created_utc": 1674161665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid UX Research Study",
        "author": "WereAllMad",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gc8sl/paid_ux_research_study/",
        "text": "My company is developing an app for tech professionals and we are looking for people to provide feedback on our new designs. We pay $50 for up to one hour of your time. If you are interested, please DM me with your job title and a good email I can reach you at. Thanks, hope to hear from you soon!",
        "created_utc": 1674160028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with designing my application",
        "author": "88sSSSs88",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10gb4oh/help_with_designing_my_application/",
        "text": "I'm not sure if this is the best subreddit to discuss this, but I'm looking for advice on how to design my application.\n\nI'm creating an application wherein a user inputs String and Password. Password will encrypt String and store that cyphertext in my database. I will not store Password.\n\nIn order to recover String, the user must input some identifier for String and Password again to decrypt the cyphertext.\n\n**My problem:** Regardless of whether Password is correct or not, my application will always output something(Of course, the only time output is meaningful is if Password is correct).\n\n**My solution:** Along with storing String, I will store a hash of Password in every entry. When retrieving, my application will output if and only if the new Password's hash matches the hash stored in my database.\n\nThe structure of every entry in my data would subsequently be structured as follows:\n\nid || Secondary Index || Cypher of String || Hash of Password\n\n**My questions:** Is this standard/acceptable practice? Is this secure?\n\nThanks!",
        "created_utc": 1674157426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remote jobs for juniors",
        "author": "Gigz_Jugz",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10g14wj/remote_jobs_for_juniors/",
        "text": "Is it hard to find a remote job as a junior Software Engineer these days?",
        "created_utc": 1674133277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech leads or Senior engineers",
        "author": "billy123h",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fyy8k/tech_leads_or_senior_engineers/",
        "text": "Do you still enjoy or love the job as much now compared to when you first started ?",
        "created_utc": 1674126172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civil to software",
        "author": "Pitiful_Selection_84",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fxwuo/civil_to_software/",
        "text": "Hi\nHow would I go about going from civil Eng degree to software engineering",
        "created_utc": 1674122260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding practices at Google and Microsoft vs. startups",
        "author": "mgreiler",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fww0e/coding_practices_at_google_and_microsoft_vs/",
        "text": "Hey, I recently sat together with Michael Lynch, an ex-Googler and ex-Microsoftie who now runs his own tech start-up, Tiny Pilot.   \n\n\nI asked him about software engineering practices at Google and Microsoft and how they differ from what he now does at his own start-up. We are both code review fans, so we also talked about this engineering practice.  \n\n\nIn a nutshell, he stressed that at Google and Microsoft, you write code that has to be supported for many, many years. In a start-up, you might not even know if the code will ever have customers. So, quality concerns are totally different.    \n\n\nHe also said that in a start-up, as a technical founder, you do not have to convince anybody to pay back technical debt. It's at your own discretion. So moving fast at the beginning is not such a problem.  \n\n\nStill, at his own start-up, he does code reviews, also to mentor his contractors and to ensure the code is maintainable and consistent. And he also writes tests.   \n\n\nBut he does all of that always with an eye on the return on investment, which we should also do in other settings.\n\nSo, if it's too hard to write that unit test, he writes an integration test. And if he sees manual testing is sufficient at the moment, he does not write tests.  \n\n\nI found the conversation very interesting and insightful. If you want to listen to it, you can check it out here: [https://www.software-engineering-unlocked.com/coding-practices-maang/](https://www.software-engineering-unlocked.com/coding-practices-maang/)",
        "created_utc": 1674118240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Apple’s 70/30 Model is No Longer Cutting It for Developers",
        "author": "DilankaMcLovin",
        "url": "https://blog.archway.io/why-apples-70-30-model-is-no-longer-cutting-it-for-developers-ee60fe5ae552",
        "text": "",
        "created_utc": 1674113614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software Engineering in 5-10 years",
        "author": "Beautiful_Dragonfly9",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10frlna/software_engineering_in_510_years/",
        "text": "I am absolutely horrified that AI will replace my job. I am not sure what else is there for me to do. How to mitigate it? What areas to work on? Does it even make sense?\n\nI can literally feed a function to GPT-3 chat and it will write some pretty darn good tests. It'll cover a lot of the edge cases, if not all of them. It does it in seconds. \n\nBear with me, it has greatly improved my workflow. I get more stuff done. I am not entirely sure how to deal with this. I love the tech, but I also like having a job. I need to pay my bills. I need to contribute something to society. \n\nWhat the hell should I do?",
        "created_utc": 1674100094,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 code documentation tools for improving overall dev experience and team collaboration in 2023",
        "author": "TheLostWanderer47",
        "url": "https://javascript.plainenglish.io/5-dev-tools-for-documenting-react-code-like-a-pro-b9bb70420a9d",
        "text": "",
        "created_utc": 1674093977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is an apprenticeship worth it?",
        "author": "Dooleyisntcool",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fkeca/is_an_apprenticeship_worth_it/",
        "text": "Basically title, im trying get into a decent career path and to teach myself java right now (very early into it) and im seeing software development apprenticeships for places like home depot or catalyte, i was wondering if anyone had experience with these and could say if theyre worth it?",
        "created_utc": 1674080900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Civil to Software",
        "author": "Pitiful_Selection_84",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fhnr9/civil_to_software/",
        "text": "Hello, how would I go about transitioning from a civil engineering degree in the UK, to go into software engineering , any masters degree I should take etc? Or could I get into a job at software, what would be the best way? As I really want to go into software engineering",
        "created_utc": 1674073445,
        "upvote_ratio": 1.0
    },
    {
        "title": "switching to software engineering?",
        "author": "Shock_Fit",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fhj77/switching_to_software_engineering/",
        "text": "hello all, \ni’m currently a sophomore in college majoring in mechanical engineering. however i’m looking to switch to software engineering. i am pretty far into my major, and i enjoy the material im learning. how would you recommend switching to software engineering? should i switch my major completely or just finish out my program and pursue a masters or complete a coding boot camp? any advice would be great!",
        "created_utc": 1674073131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one is the best for a software Eng. Student? Apple or Windows?",
        "author": "acbst0",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fem80/which_one_is_the_best_for_a_software_eng_student/",
        "text": "Hello everone,\n\nI need a laptop. What is the best chose? Apple or Windows?",
        "created_utc": 1674066285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding and Software Engineering goal for beginner.",
        "author": "Suspicious-State8020",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fdt1i/coding_and_software_engineering_goal_for_beginner/",
        "text": "Greetings Internet,\n\nThis is all very new to me, not the internet, but making reddit posts and opening up to strangers. I've had very deep moments of self-reflection in this new year and I want more out of my life. I went to school back in 2010 for computer science and dropped out for a decent job I was offered. I always looked back and wish i stuck it out because I do find a good amount of interest in the field. I have a very analytical mindset and I do very much enjoy problem-solving. So this brings me to this post, I have researched around and talking with my peers has led me to want to take on a project of learning how to code on the side, and potentially becoming a software engineer. I am here as a 33 year old man with a very passionate motivation to learn how to code, but I have no direction or at least don't know my best approach to doing this on the side. Any words of advice from experienced coders/software engineers on a good place to start? Without the necessity of university?\n\n&amp;#x200B;\n\nIf this is the wrong area for this I apologize. Once again am new here.\n\n&amp;#x200B;\n\nThank you for your time.",
        "created_utc": 1674064436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I drop out of Software Engineering?",
        "author": "Asareddo",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10fcycm/should_i_drop_out_of_software_engineering/",
        "text": "Should I drop to CS. It costs less, gets me the same jobs and has less math and science. Help?",
        "created_utc": 1674062444,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Colleagues Refused to Document the Code So I Built a Bot That Does It for Them",
        "author": "codewithbernard",
        "url": "https://v.redd.it/ifftla2sltca1",
        "text": "",
        "created_utc": 1674055835,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best universities that offer software engineering masters degrees. (On campus preferred)",
        "author": "Parking-Age-6974",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10f9nag/what_are_the_best_universities_that_offer/",
        "text": "I feel like i should also add that I’m a business bachelor (will that be an obstacle?)",
        "created_utc": 1674054581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interview knowledge (Junior developer)",
        "author": "bullishfish",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10f76ps/interview_knowledge_junior_developer/",
        "text": "Hey all,\n\nSorry if the question is too basic to this sub.\n\nI'm just getting started on the path to software dev and I'm going through data structures. I'm wondering if I need to know how to code up all the data structures on the fly for interviews, or do I just need to know where and why they are used?",
        "created_utc": 1674047850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software engineering degrees",
        "author": "DylanM583",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10f5gwb/software_engineering_degrees/",
        "text": "Starting a software engineering degree currently at a community college doing 2 years. Just wondering if anyone here can speak from experience and give advice if I could make a career in this field and decent money with just an associates degree or is it not possible to have a successful career with just 2 years of school. I might sound dumb to you guys but a 4 year degree is kind of out of reach for me right now.",
        "created_utc": 1674042539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Architecting a Globally Distributed Software Organization for Continual Development [PDF]",
        "author": "anastas",
        "url": "https://www.agilealliance.org/wp-content/uploads/2022/05/Tomas-Gustavsson-184_xp2022-stoyanovsky_v2.pdf",
        "text": "",
        "created_utc": 1674013974,
        "upvote_ratio": 1.0
    },
    {
        "title": "What online school did you go too.",
        "author": "Additional-Equal9309",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10etbdd/what_online_school_did_you_go_too/",
        "text": "I’m restricted only to online school because of me being in the military. I would like to get a software engineering degree of sorts. What online school is good for this.",
        "created_utc": 1674003388,
        "upvote_ratio": 1.0
    },
    {
        "title": "app development: make or buy",
        "author": "DiscreetLateComer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10eplz2/app_development_make_or_buy/",
        "text": "hi all, i need for advice here.\nI have an app idea that implies database, network management and cross platform for the MVP. I would like to work with a remote freelancer (fiver, Upwork...). But I'm afraid they steal my idea. \n1. Should I trust them?\n2. make them sign a NDA?\n3. TRY to build it my self? that could take months.\n4. have you already work with remote freelancers for innovation projects? \n\nThanks by advance for the answers",
        "created_utc": 1673994363,
        "upvote_ratio": 1.0
    },
    {
        "title": "app development: make or buy",
        "author": "DiscreetLateComer",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10eomep/app_development_make_or_buy/",
        "text": "hi all, i needs for advice here.\nI have an app idea that implies database, network management and cross platform for the MVP. I would like to work with a remote freelancer (fiver, Upwork...). But I'm afraid they steal my idea. \n1. Should I trust them?\n2. make them sign a NDA?\n3. TRY to build it my self? that could take months.\n4. have you already work with remote freelancers for innovation projects? \n\nThanks by advance for the answers",
        "created_utc": 1673992088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career path",
        "author": "Xrqton",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10end72/career_path/",
        "text": "Hello everyone, \n\nFirst sorry if my english is not that good - not natively speaking. \n\nJust wanted to have a feedback on my career path, maybe this will resonate to some of you. \n\nI've been working for 10 years mainly around project management and managed to reach the status of tool and infrastructure manager for a tech company. I'm managing a devops engineer team who also  delivers and supports a wide range of tools for our collaborators. \n\nI've been using my technical skills as software engineer (I have a graduation in computer science) to facilitate the collaboration betweens teams, to sensibilize top execs to technical stakes in order to win sponsorship or negociate budget. In parallel, i'm always trying to keep updated on new technological trends as this is mandatory in our domain. \n\nThe thing is, since my graduation, I haven't had the occasion to put my technical knoweldge in practice. In other words, I haven't put my hands in the \"dirt\" by programming. I've kept this \"high level\" vision and only worked on making my team to converge on the objective to deliver my projects. Never got involved in the micro tasks by programming. \n\nI feel that I've skiped a huge step in my career and feel the need to go back to real technical stuff. I miss developping. I do code in my spare time btw (mainly game development). \n\nI now start to feel the impostor syndrom when I discuss with senior engineer even though I understand them and manage to get aligned on our objectives. I'm afraid that this lack of technical experience puts me in a position where i'm not relevant anymore. \n\nDid anyone already have this kind of path and reflexion ? How this kind of situtation should be apprehended according to you ? \n\nI'm really curious to have your point of view,",
        "created_utc": 1673989206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to reach further than I should?",
        "author": "cashgobrr",
        "url": "/r/docker/comments/10eifs5/trying_to_reach_further_than_i_should/",
        "text": "",
        "created_utc": 1673977928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proper data generation for development in the tech companies",
        "author": "paperknight-404",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10efy4x/proper_data_generation_for_development_in_the/",
        "text": "I am curious how and what is the proper way to generate data for the development team to test their code before puahing it to production. Especially when your production has a complex system storage ( a few table joins and data is stored in different ways (s3, rds, cassandra, etc)).\n\nCurrently my company doesn't have a proper way to do it and the engineers need to manually create the data for development. The issue is it's very hard to come up with a dataset to test the entire flow of the system and as we are having more business requirement it seems impossible to keep up if we were to do it manually. \n\nPlease share how your companies are doing it so I can propose to my manager. Thanks in advance!!",
        "created_utc": 1673971695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Avoid Tight Coupling of Tests to Implementation Details",
        "author": "nejcko",
        "url": "https://dev.to/nejckorasa/avoid-tight-coupling-of-tests-to-implementation-details-a7",
        "text": "",
        "created_utc": 1673971229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Decision making",
        "author": "Rough-Row5997",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10eey9x/career_decision_making/",
        "text": "I am currently an undergrad stuck between going into Occupational therapy or software engineering. I have done a few shadow opportunities under OTs and it seemed like a really cool career to do; however, the downside of it is the tremendous amount of debt I will inquire (I come from a low-income family). \n\nFor software engineering, I would have no debt at all and will a higher salary then if I was to become an OT; however, it won't be something I enjoy, but instead something I can tolerate/hate.\n\n&amp;#x200B;\n\nWith all this in mind, what would you do in my shoes?",
        "created_utc": 1673969212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Role of Ad Hoc Testing in the Realm of Software Engineering - Explained",
        "author": "AmbitiousAntelope850",
        "url": "https://www.impactqa.com/blog/ad-hoc-testing-everything-you-need-to-know/",
        "text": "",
        "created_utc": 1673947657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with internship",
        "author": "BackgroundCod1873",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10e3r2a/struggling_with_internship/",
        "text": "[removed]",
        "created_utc": 1673932584,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make an ontology business model understandable to everyone in a company?",
        "author": "gianniskks",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10e1hpt/how_to_make_an_ontology_business_model/",
        "text": "Hi folks,\n\nI stumbled upon the following problem/case.\n\nWe have a CRM system (Salesforce) and a subscription management system (like Stripe), and we just saw that the connection between our different ontologies is vague to the rest of the employees. \n\nDo you have any idea how could we approach that case?\n\nFor example, each CRM account can be connected to only one Stripe account, one CRM contact can be connected with multiple CRM accounts etc..\n\nWe have a very big and not documented ontology business logic and we do not feel sure yet what should be the connection between these ontologies. e.g. If a SQL Query returns two Stripe Accounts connected to one CRM Account, how could we be sure that our analysts know that this is an invalid case?",
        "created_utc": 1673925954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free server to deploy api backend and job writen in Node.js",
        "author": "ahelord",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10e12xr/free_server_to_deploy_api_backend_and_job_writen/",
        "text": "Free server to deploy a node.js api backend and a node.js job/worker that runs every week possibly 100 monthly users",
        "created_utc": 1673924784,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will you use chatGPT API for?",
        "author": "Most-Ad-8709",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10e0a3l/what_will_you_use_chatgpt_api_for/",
        "text": "I’m a college students who likes to make personal projects for fun and experience.  OpenAI announces the chatGPT API is coming soon and I’m wondering in what ways you plan to use this.  I must not be very creative, but what use could chatGPT have outside the original site? It’s not like you could create better answers to questions with the API rather than the normal site right?",
        "created_utc": 1673922545,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to decompress?",
        "author": "Namsudb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dxs98/how_to_decompress/",
        "text": "Recently one of the senior engineers we have is away right and I’ve been trying my best to take over the work and stuff that’s due.. my Brain is fried but I can’t seem to stop thinking about all the problems at work that need to be solved that I’m working on.. any help? I’d consider myself a junior engineer… I just got off a bit late again today. I feel like a zombie lol. How do you guys do it seriously?",
        "created_utc": 1673915869,
        "upvote_ratio": 1.0
    },
    {
        "title": "After learning Scratch 3 Programming, what should I learn next?",
        "author": "FigOk9487",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dwabs/after_learning_scratch_3_programming_what_should/",
        "text": "I hope to eventually become a Software Engineer or Computer Programmer?",
        "created_utc": 1673912122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need insight",
        "author": "jak21162",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10duj7e/need_insight/",
        "text": "I’m about to enroll in Springboards 9 month software engineering course. Will I be able to start a career with only that? Is it a waste of time? Should I just quit my job and start college? I really just want to know the best path to take to become a software engineer fastest. I’m not worried about starting salary or anything like that. But the odds of me actually landing a job in the field. Please let me know what you think.!",
        "created_utc": 1673908049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi everyone, I am currently a Business Analyst, trying to switch to software engineering. I want to ask how the job market is for a new person coming into software engineering sector. Do they employ someone with no experience but a portfolio",
        "author": "Mysterious-Pain7399",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dqcl8/hi_everyone_i_am_currently_a_business_analyst/",
        "text": "",
        "created_utc": 1673900560,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a good resource for finding average/minimum specs according to demographic?",
        "author": "zachtheperson",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10do9hf/whats_a_good_resource_for_finding_averageminimum/",
        "text": "For example, I'm currently developing an app targeted at being used in schools but has to do a lot of 2D drawing. I'd love to know minimum specs for the average school computer or Chromebook.",
        "created_utc": 1673895789,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the most useful thing that your org/ team wasn't doing?",
        "author": "mcweirdy",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dnkwr/whats_the_most_useful_thing_that_your_org_team/",
        "text": "\nTake this as my crowd sourcing post to figure out all the new technology for devs. \n\nThere's tooany journals and articles about heuristics etc., and I just can't keep up. What thing would you suggest everyone else does? I'd be particularly grateful if it's related to native software development :)",
        "created_utc": 1673894307,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to include visuals with source code documentation?",
        "author": "darn42",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dng47/how_to_include_visuals_with_source_code/",
        "text": "Some ideas are verbose and difficult to describe in words but a simple visual would communicate them quickly. The issue is, how do I include these diagrams with my source code such that future readers can easily access it and track through version control.\n\nASCII art has been my go-to, but especially in my most recent project which requires a lot of geometry and informal proofs, the limitations of ASCII have been difficult to work around.\n\n&amp;#x200B;\n\nHow do you approach this kind of documentation and what tradeoffs do you make in the tools you use to generate it?",
        "created_utc": 1673894033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are the offices for FAANG locations? America.",
        "author": "Void3tk",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dlehy/where_are_the_offices_for_faang_locations_america/",
        "text": "",
        "created_utc": 1673890644,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is business application and business functionality?",
        "author": "aiai92",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10diw5q/what_is_business_application_and_business/",
        "text": "I have been coming across these terms alot lately while going through enterprise application tutorial such as SOA OSB. How is business application different from enterprise application? What does business functionality mean?",
        "created_utc": 1673886482,
        "upvote_ratio": 1.0
    },
    {
        "title": "why software engineering?",
        "author": "uzom1_",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10dgqmq/why_software_engineering/",
        "text": "[removed]",
        "created_utc": 1673881389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backend, Full-Stack or iOS: Which Dev Path to Pursue for a Current College Student?",
        "author": "Specialist-Ad-6223",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10d7pm4/backend_fullstack_or_ios_which_dev_path_to_pursue/",
        "text": "Hey everyone, \n\nAs a second year university student studying Computer Science, I am preparing to apply for internships during my third year. However, I have no personal projects to showcase to potential employers. \n\nI am currently considering which dev path to take to specialize in and become a valuable swe in the future. Here's how I see it (please let me know if my assumptions are wrong): \n\n\\- **Backend development**: This field seems to offer high-paying jobs with a higher barrier to entry. Specialization in this area is a good choice as all companies will need backend engineers especially in infra/security. \n\n\\- **Full-Stack development**: This path doesn't seem like it would be as specialized as backend, since you would be working on both frontend and backend. However, it would make me a more versatile programmer. \n\n\\- **iOS development**: Only need Swift, Objective-C and SwiftUI for iOS dev, can easily specialize in, smaller pool of iOS devs since you can only use macOS to develop iOS apps. The thing that is stopping me from picking iOS is the possibility that iOS could become irrelevant in 10+ years possibly with VR or some other tech. \n\n&amp;#x200B;\n\n# TLDR; College sophomore wants learn Backend, Full-Stack or iOS engineering, specialize and become a valuable engineer. Thinks iOS is best for specializing, but fears it might become irrelevant in the future.",
        "created_utc": 1673852080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking About Switching to Software Engineering",
        "author": "MiFern",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10d4zm0/thinking_about_switching_to_software_engineering/",
        "text": "Hi all, I'm a recent college grad who's on a premed trajectory. I'm meant to be applying to med schools in June. \n\nThroughout my undergrad, I've always struggled with the idea of being a doctor due to lifestyle and the duty of dealing with patients but kept on pushing down that path cause it's what I've been saying I was gonna do since I was little. However, I've always wondered if I should have studied CS instead and actually tried to switch programs my freshman year. Now that I graduated with a Chemistry degree, I'm beginning to wonder if I made the wrong decision in not switching - I don't think I'm passionate about medicine. I did programming classes every year in high school, but because it was one of the few subjects I didn't find incredibly easy I felt like I shouldn't have pursued it.\n\nI'm at a point now where I want to explore some tech-related fields to see if it's a good fit for me. So I've got a few questions I hope I can get some help on here:\n\nWhat are some ways that I can get familiar with SE and what the job is about? As much as I feel that I'm not passionate about a physician's work, I need to learn about other jobs and see what I am passionate about. \n\nI haven't coded much in the 4 years since hs, so what are some good sources to sharpen my skills and improve - in HS we mainly did Python\n\nIf I were to pursue SE, what's the route to take? Get a bachelors in CS? Masters? A Bootcamp? Not sure how the roadmap would look for someone in my position.\n\nAny advice is appreciated, thanks!",
        "created_utc": 1673843293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to create a website who gets data in real time",
        "author": "afposthuman",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10d1gih/want_to_create_a_website_who_gets_data_in_real/",
        "text": "Hi, I want to create an informative website who gathers data from another source, like this website: [Garita Center Reporte Garitas Tijuana Línea San Ysidro Otay](https://www.garitacenter.com/)  \nThis website gathers data from the CBP website and shows it in a more clean manner. How they do this and what I need to learn to do the same?  \nThanks for your attention, your answers will be aprecciated.",
        "created_utc": 1673833013,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the tests in the various environments?",
        "author": "bfrancois91",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cxr42/what_are_the_tests_in_the_various_environments/",
        "text": "I am currently learning to code however I am a bit confused in regards to the various environments and the test that re done in each environment. For example I understand DEV, INT, QA and PROD and what they are for. However I am confused at what test can be done is each of these environments. Per the research I did it seems that Functional Unit Testing is done in DEV, System Integration Testing is done in INT and User Acceptance Testing is done in QA. Is this accurate and are there an other test that can be done in these environments?",
        "created_utc": 1673823517,
        "upvote_ratio": 1.0
    },
    {
        "title": "X2 EMV SOFTWARE PLUS TUTS AVAILABLE RN. TAP IN. TELEGRAM BELOW",
        "author": "Jonnsnoww001",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cxn9h/x2_emv_software_plus_tuts_available_rn_tap_in/",
        "text": "[removed]",
        "created_utc": 1673823255,
        "upvote_ratio": 1.0
    },
    {
        "title": "The various environments and test",
        "author": "Pristine_Dealer_1649",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cwxms/the_various_environments_and_test/",
        "text": "[removed]",
        "created_utc": 1673821529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former CheE major to SwE?",
        "author": "EXT_SF",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cwgu3/former_chee_major_to_swe/",
        "text": "What would you guys advise me to do as a former CheE major who's interested in learning how to code and get into software development? Get into a SW Engineering degree or should I just do a bootcamp or something similar?",
        "created_utc": 1673820381,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to set as mandatory the relationship between entities in GraphCMS?",
        "author": "jdbr1995",
        "url": "/user/jdbr1995/comments/10cvzry/how_to_set_as_mandatory_the_relationship_between/",
        "text": "",
        "created_utc": 1673819689,
        "upvote_ratio": 1.0
    },
    {
        "title": "any way to have my portfolio viewed more, other than applications?",
        "author": "beatmaister",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cv722/any_way_to_have_my_portfolio_viewed_more_other/",
        "text": "I'm a college junior and looking to secure and internship this year. I have several projects under my belt because I've always loved programming, I recently put together a portfolio site, and I'm somewhat proud of it. But is there any way to have possible recruiters see it other than on my resume or during applucations?",
        "created_utc": 1673817332,
        "upvote_ratio": 1.0
    },
    {
        "title": "My career doesn’t exist",
        "author": "Visual-Grapefruit",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cu95l/my_career_doesnt_exist/",
        "text": "For two years I have been working at a small tech company. I have mainly developed in house stuff with javascript and some general sys admin stuff. I feel i don’t really know anything. Ive been studying leetcode, i’m okay at it and improving fast. My concern is getting hired at a new job and not really knowing what to do and how to work with a team. This was my first job out of school and i mainly worked alone.",
        "created_utc": 1673815147,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel tired",
        "author": "ClimateFar2481",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10ct4nb/i_feel_tired/",
        "text": "Hello Everyone,\n\nAt this moment I am an android engineer at a small company. Most of my time I'm doing a routine job (coding/code review/meetings). When I started doing android at the beginning, it was quite challenging for me, to learn these new things, and How to use them properly. But at this time I rarely learn anything new because I don't even know that I want to write apps for android. Sometimes I feel comfortable when I'm learning the theory of distributed computing, and sometimes hardware engineering. Could you, please, suggest me anything? Am I crazy? I started coding 3 years ago, at the beginning I was a Full-stack engineer, doing PHP, and HTML,... after that, I encourage myself to become an android engineer. And now I'm in the same situation as I was 2 years ago. I don't think that It's normal to don't know what I want to do.",
        "created_utc": 1673812491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book review: API Design Patterns",
        "author": "nfrankel",
        "url": "https://blog.frankel.ch/api-design-patterns/",
        "text": "",
        "created_utc": 1673805974,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we call this kind of diagram ? Is there a text to diagram to I can use to create this ?",
        "author": "restingisimportant",
        "url": "https://www.reddit.com/gallery/10cpo7i",
        "text": "",
        "created_utc": 1673804293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Client-side vs server-side rendering performance for route changes",
        "author": "web_deb",
        "url": "https://www.reddit.com/r/SoftwareEngineering/comments/10cpgkg/clientside_vs_serverside_rendering_performance/",
        "text": "Hi everyone, I'm building a react web application that has around 7 different routes. They're all pretty much part of the same fill-out/select form in some sense. The landing page is a sign in route that has a background image it retrieves from cloud storage (according to the url params, as several different client stores will use the domain). I'm trying to choose between client-side rendering or server-side, SEO is not important for me. I would like the initial page load to be fast but also the subsequent page views, and from my reading CSR is better for subsequent pages and SSR is better for initial page loads\n\nBut I was unsure if route changes are considered subsequent page loads? because doesn't the window tab itself does not actually go through a page load(?) ( for example in comparison to when I enter a url in the browser and click enter) So if this is truly the case, is SSR just as good as CSR for these route changes in my app? Also, I know initial page load is faster with SSR but I was wondering if maybe the CSR initial load page time is also good enough usually? Meaning the user experience isn't hurt",
        "created_utc": 1673803787,
        "upvote_ratio": 1.0
    }
]