[{"title":"The Mandalorian - S03E02 - Chapter 18 - Discussion Thread!","author":"titleproblems","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11lq0zc\/the_mandalorian_s03e02_chapter_18_discussion\/","text":"&#x200B;\n\n['Star Wars: The Mandalorian' Episode Discussion](https:\/\/preview.redd.it\/2or6x7w70mea1.png?width=1616&format=png&auto=webp&v=enabled&s=5f5d18ec6dc8142d465eed9014bd545c277d97bb)\n\n**EPISODE SCHEDULE**\n\n* **~~E01 - Chapter 17:~~** ~~March 1~~\n* **E02 - Chapter 18:** March 8\n* **E03 - Chapter 19:** March 15\n* **E04 - Chapter 20:** March 22\n* **E05 - Chapter 21:** March 29\n* **E06 - Chapter 22:** April 5\n* **E07 - Chapter 23:** April 12\n* **E08 - Chapter 24:** April 19\n\n**SPOILER POLICY**\n\n**All season 3 spoilers must be tagged until 14 days after the season finale.**\n\n['Star Wars: The Mandalorian' Subreddit](https:\/\/preview.redd.it\/fo62qg290mea1.png?width=1616&format=png&auto=webp&v=enabled&s=f2440cfa04c39aaf1c80d5651457779e10c0b722)\n\nBe sure to check out the 'Star Wars: The Mandalorian' subreddit - r\/TheMandalorianTV\n\n[Places to check out](https:\/\/preview.redd.it\/r9p04zca0mea1.png?width=1616&format=png&auto=webp&v=enabled&s=3cf819db2578a2eeb7f22d9df838b0163761a511)\n\n**Official** [**r\/StarWars**](https:\/\/new.reddit.com\/r\/StarWars\/) **Discord server** \\- [discord.gg\/StarWars](https:\/\/discord.gg\/StarWars)\n\n**Star Wars Television Discord server** \\- [discord.gg\/SWTV](https:\/\/discord.gg\/SWTV)","upvote_ratio":0.97,"created_utc":1678261512.0},{"title":"The Bad Batch (Season 2) - Episode 12 - Discussion Thread!","author":"titleproblems","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11lq0yo\/the_bad_batch_season_2_episode_12_discussion\/","text":"**SPOILER POLICY**\n\n**All season 2 spoilers must be tagged until 14 days after the season finale. Keep discussions contained to the stickied discussion threads. Any comments and images outside of them must be spoiler flaired or use the spoiler tag.**\n\n**SUBREDDIT**\n\nBe sure to check out the 'Star Wars: The Bad Batch' subreddit - r\/TheBadBatch\n\n**PLACES TO CHECK OUT**\n\n**Official** [**r\/StarWars**](https:\/\/new.reddit.com\/r\/StarWars\/) **Discord server** \\- [discord.gg\/StarWars](https:\/\/discord.gg\/StarWars)\n\n**Star Wars Television Discord server** \\- [discord.gg\/SWTV](https:\/\/discord.gg\/SWTV)","upvote_ratio":0.98,"created_utc":1678261511.0},{"title":"I visited Coruscant over the weekend","author":"Mat0fr","url":"https:\/\/www.reddit.com\/gallery\/11q3qgj","text":"","upvote_ratio":0.97,"created_utc":1678694834.0},{"title":"Genevieve O'reilly (current Mon Mothma) looks strikingly similar to Caroline Blakiston (original Mon Mothma) when she was younger","author":"Nemarus","url":"https:\/\/i.redd.it\/yf4n7sq41gna1.png","text":"","upvote_ratio":0.9,"created_utc":1678685847.0},{"title":"Cobb Vanth looks like a kid dressed up as a mandalorian for Halloween","author":"Responsible-Fuel","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pmhhr\/cobb_vanth_looks_like_a_kid_dressed_up_as_a\/","text":"","upvote_ratio":0.89,"created_utc":1678647287.0},{"title":"Made a cool edit of Darth Nihilus holding a dark saber!","author":"Excellent_Tackle_857","url":"https:\/\/i.redd.it\/hmuoqu7zkina1.jpg","text":"","upvote_ratio":0.87,"created_utc":1678698657.0},{"title":"X - Wing in hyperspace (Blender render)","author":"DereChen","url":"https:\/\/i.redd.it\/mqfopm0dyfna1.png","text":"","upvote_ratio":0.92,"created_utc":1678684861.0},{"title":"What are the chances we see Watto again in the Mando verse? I don’t think there is a canon answer as to what happened to him post Ep 3.","author":"GusGangViking18","url":"https:\/\/i.redd.it\/5ih0ybmpchna1.jpg","text":"","upvote_ratio":0.83,"created_utc":1678683769.0},{"title":"The clones were slaves.","author":"Sufficient_Cricket_2","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pn7ez\/the_clones_were_slaves\/","text":"Let's face it. Clones are slaves\/machines of war programmed to serve orders and fight for a corrupt system they are programmed to belive in, in other words brainwashed from birth. They are bread to be soldiers. They have no choises in life but to follow orders, sometimes that order could mean facing an inevetable death, and to be slaves to the corrupt republic fighting a war they bearly understand\/understood. \n \nSPOILERS AHEAD FOR STAR WARS THE CLONE WARS Season 5 or 6 (can’t remember) \n\n\n\nI think people like the clone traitor Slick and Barris Offee was 100% right and i do see why they become traitors along with their opinions on the jedi\/republic and what it had become. The jedi had defently lost their way and weren’t peacekeepers. I don’t agree with their violent actions, however. \n\nI think the Confederancy Of Indipiendent systems is 100% a better system politically wise but was ruled by sith count dooku. But other than being ruled by evil sith they’re not necesarily bad people with a bad political system. And dosen’t necesarily support the sith’s selfish ways. Alot of them just want indipendence from the republic.","upvote_ratio":0.89,"created_utc":1678648932.0},{"title":"A golden Stormtrooper I drew.","author":"Backfisch85","url":"https:\/\/i.redd.it\/i9xujgmm5ina1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678711722.0},{"title":"I played the part of Sors Bandeam -- The youngling in Revenge of the Sith and I'm fighting in a charity boxing match for Cancer Research UK (March 25th) 🥊","author":"RossBandeam","url":"https:\/\/i.redd.it\/1fpuup75dina1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678714061.0},{"title":"Argentinian Mando","author":"HDCase72","url":"https:\/\/v.redd.it\/kt9r48w8bbna1","text":"","upvote_ratio":0.89,"created_utc":1678708535.0},{"title":"Are purrgils in someway connected to the force? Or are they just able to travel through hyperspace?","author":"femboi_remade","url":"https:\/\/i.redd.it\/mlj2sg8jm9na1.jpg","text":"","upvote_ratio":0.98,"created_utc":1678590217.0},{"title":"Tried to make a Starkiller Custom Lego Figure. What do y’all think?","author":"snieves0426","url":"https:\/\/i.redd.it\/vosnlp0bdhna1.jpg","text":"","upvote_ratio":0.78,"created_utc":1678683972.0},{"title":"Jon Favreau wielding the Darksaber on the set of Mandalorian","author":"SappyGilmore","url":"https:\/\/i.redd.it\/3pcfsc5z06na1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678564712.0},{"title":"Mandalorian: S3 concept drawing","author":"DrLove77","url":"https:\/\/i.redd.it\/ffx6ulaueina1.jpg","text":"","upvote_ratio":0.79,"created_utc":1678696595.0},{"title":"I just realized something that makes me so sad.","author":"HungryDiaper","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p9t3v\/i_just_realized_something_that_makes_me_so_sad\/","text":"I just realized that Ahsoka Tano believed that Anakin Skywalker had died defending the Jedi Temple as a hero. She believed this  until she saw him in rebels and had to change her mindset of him dying a hero, to him having been the evil that destroyed the Jedi, and then immediately had to fight her old master as he tried to kill her.","upvote_ratio":0.95,"created_utc":1678611338.0},{"title":"The level of detail at Disney Star Wars Land is astounding","author":"HankScorpio4242","url":"https:\/\/www.reddit.com\/gallery\/11p4q21","text":"","upvote_ratio":0.98,"created_utc":1678593894.0},{"title":"If you time-traveled to making of the Original Trilogy and have the opportunity to change whatever you wanted to, what would you alter?","author":"C-C93","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pq1og\/if_you_timetraveled_to_making_of_the_original\/","text":"I personally would hint at things that were made several years later, but only in very small ways as to not disturb the original movies.","upvote_ratio":0.83,"created_utc":1678655630.0},{"title":"yeah just change the title so its not obvious you copied..","author":"jubjub2300","url":"https:\/\/i.redd.it\/rpl28mw43jna1.jpg","text":"","upvote_ratio":0.78,"created_utc":1678704763.0},{"title":"How did you react when seeing this scene for the first time?","author":"the_penis_taker69","url":"https:\/\/i.redd.it\/fo2olft2eina1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678714356.0},{"title":"Will there be more seasons of Tales of the Jedi?","author":"yxngM7","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pic8e\/will_there_be_more_seasons_of_tales_of_the_jedi\/","text":"","upvote_ratio":0.91,"created_utc":1678637629.0},{"title":"A Weirdly Good Watch Order","author":"SemperMuffins","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pvmnw\/a_weirdly_good_watch_order\/","text":"So I was thinking about Star Wars (as most people here probably have), and came up up with a weird way to watch Lucas’s films that might actually be kind of good.\n\nFirst is the Phantom Menace, where we meet our cast and get introduced to the world. As I’m writing this from the perspective of a first time watcher, Darth Vader isn’t a concept yet, and who the heck knows who the Sith Master is.\n\nSecond is A New Hope (with the note that it takes place many years after TPM). Threepio and Artoo are together on some random starship, which immediately adds intrigue and tells us that things have really changed along with the new empire. We meet Luke and probably make the assumption that Anakin and Padmé grew up and had a kid. Obi-Wan‘s an old man now, and Anakin was killed Darth Vader. No clue what happened to Padmé, other than the fact that she’s probably dead. We learn something called the Clone Wars happened, and that Obi-Wan taught Vader after Anakin (which he definitely had time to do considering how old he looks compared to when we last saw him). Obi-Wan dies, we probably think about Qui-Gon’s death, and we finish the movie.\n\nNext we have Attack of the Clones. Ani’s all grown up and everything’s very bittersweet now that we know they’re both killed by Darth Vader. Sure enough, our logical assumption was logical and grown-up Anakin and Padmé have a thing. We hear the Imperial March for the first time, after Anakin kills the Sand People and the clones are shipped out for war, but only connect the music as ominous. We learn what Obi-Wan meant in ANH when he mentioned the Clone Wars, and start wondering when the heck we’re going to meet little Darth Vader.\n\nAfter AOTC is Empire Strikes Back. We hear the Imperial March a lot when Vader’s onscreen, and make the assumption that it’s the general \\~evil\\~ music. Luke meets Yoda, and we’re all very excited since that last time we saw him he was having a full-blown wizard’s duel with Dooku. He acts like a backpack, and Leia and Han do stuff that doesn’t connect to the prequels at all. No mention of Padmé yet. Bespin happens, Vader reveals he’s Luke’s father and f\\*\\*\\*. That actually makes sense.\n\nNext is Revenge of the Sith and dang it Anakin! Why’d you have to be evil!? Also, it turns out one of the random background senators from ATOC is Leia’s dad, which is pretty cool. They don’t really look alike, but it’s not like we’ve met her mom. Stuff happens, turns out the creepy Supreme Chancellor is the Sith Lord, which we really should have seen coming, even if he’s not half as wrinkly as he was in ESB. Anyway, Anakin’s Vader, he and Obi-Wan fight and… Luke and Leia are twins??? When the heck did that happen?? Vader’s got his suit and  Luke and Leia? Twins?? (I guess that explains the mind talking thing from Empire, though)\n\nFinally, we’ve got Return of the Jedi. Han gets rescued and wow. Luke and Leia are twins. Luke goes to see Yoda and IT REALLY WOULD HAVE BEEN NICE TO LEARN THEY WERE TWINS BEFORE THE HOTH KISS THANKS OBI-WAN. More stuff happens, we FINALLY get a mention of Padmé, only for Luke to later go and practically quote her in front of Vader and HE MENTIONS OBI-WAN INSTEAD. Anyway, disappointing lack of Padmé aside, the ending fight is great in all ways, stupid Palpatine finally dies, Anakin dies, which is sad, but at least he’s good again. Sad\/sweet funeral scene that mirrors Qui-Gon’s, Ewok party, and we get to see ghost Anakin, which is just… feelings. The End, Happily Ever After, There Is No Sequel Trilogy.\n\nTL;DR 1 4 2 5 3 6, we learn information in a fun and surprising slow order.","upvote_ratio":0.75,"created_utc":1678669344.0},{"title":"Theory as to what this thing in episode 2 of Mandalorian was. I think it could be some form of Basilisk the wardroid that ancient Mandos used to use in legends","author":"Soaptimusprime","url":"https:\/\/www.reddit.com\/gallery\/11q8eca","text":"","upvote_ratio":0.8,"created_utc":1678710668.0},{"title":"I'm starting The Clone Wars for the first time. Any tips or knowledge that I need to know before I start?","author":"visualaviator","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11psum1\/im_starting_the_clone_wars_for_the_first_time_any\/","text":"","upvote_ratio":0.74,"created_utc":1678662212.0},{"title":"If Shaak Ti, Cin Drallig and Serra Keto all teamed up against Knightfall Vader, would they have won?","author":"Dragonic_Overlord_","url":"https:\/\/i.redd.it\/5ffgwi08fina1.jpg","text":"","upvote_ratio":1.0,"created_utc":1678714725.0},{"title":"clone wars (animated series ) and Anakin Skywalker (the character) “the redemption arc”","author":"Viko85","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q507b\/clone_wars_animated_series_and_anakin_skywalker\/","text":"I used to hate the character of anakin in the prequel with passion due to the bad writing and less than average acting (that my personal opinion and has no hate on the actor as person ). However, after watching the CW animated from the early episodes that anakin showed up in them I start liking the character big time and that’s another example of that how CW animated is gift to the Star Wars universe","upvote_ratio":0.7,"created_utc":1678699603.0},{"title":"Appreciated the vibes in the Bad Batch Retrieval","author":"Sandgrease","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pw209\/appreciated_the_vibes_in_the_bad_batch_retrieval\/","text":"Retrieval had plenty of good nods to Labor vs Capitalists in the episode. It had \"employee of the week\" as a motivator to produce more for Mokko, Echo says \"you shouldn't have to compete to eat\" which we all literally do every day (in most countries anyway), and they acknowledge these exploitative tactics are the hallmark of The Empire. Mokko claims their mine is producing subpar product but actually isn't and keeping the profits for himself. I also really appreciated at the end that Ben says now that Mokko is gone they're splitting the profits. So many little things young people will learn from watching this show. Bravo.\n\nStar Wars dropping more and more philosophy and economics all the time.","upvote_ratio":0.72,"created_utc":1678670476.0},{"title":"I am shameless in admitting it","author":"F0XF1R396","url":"https:\/\/v.redd.it\/ir8ojkpbv6na1","text":"","upvote_ratio":0.93,"created_utc":1678574852.0},{"title":"Bo Katan Darksaber","author":"Weightyyy","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q5szf\/bo_katan_darksaber\/","text":"I’m currently on my re watch of Rebels and can’t for the life of me work out how Bo Katan loses the Darksaber to Moff Gideon leading to the Mandalorian. She obviously gets the blade handed to her by Sabine in Rebels , but how does she lose it to Gideon? Because to my knowledge the Bombing Of Mandalore was before Rebels? Just really confused.","upvote_ratio":0.67,"created_utc":1678702518.0},{"title":"What’s something you like from a Star Wars film (or show) you dislike?","author":"time-to-bounce","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q5hd1\/whats_something_you_like_from_a_star_wars_film_or\/","text":"For me, The Phantom Menace is pretty mediocre. It’s not the worst Star Wars film but it’s far from the best.\n\nBut man the pod race is exceptional (in a series renowned for its score, the choice to do most of it without music was stellar). The fight with Maul is one of the series’ best (in terms of action and story impact). And I’ll take all I can get of Ian McDiarmid.\n\nWhat’s your pick?","upvote_ratio":0.57,"created_utc":1678701397.0},{"title":"I can't wait to see the ghost crew in live-action! I hope we see Hera and Sabine in this season of Mando.","author":"Key_Monitor_958","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q9otl\/i_cant_wait_to_see_the_ghost_crew_in_liveaction_i\/","text":"&#x200B;\n\nhttps:\/\/preview.redd.it\/hawr1s3eeina1.jpg?width=480&format=pjpg&auto=webp&v=enabled&s=0c8661baddfcfdc64adf6b35ceacca03d0972f01","upvote_ratio":1.0,"created_utc":1678713997.0},{"title":"Chirrut and Baze Tales of the Jedi","author":"XLBR424","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ppmj6\/chirrut_and_baze_tales_of_the_jedi\/","text":"If we get Tales of the Jedi season 2, do you think we should get episodes with Chirrut and Baze? I feel like anything exploring the Rogue One characters is welcome.","upvote_ratio":0.71,"created_utc":1678654626.0},{"title":"Mandalorian pancake art","author":"FlippinArtDude","url":"https:\/\/i.redd.it\/vf7hwt5no9na1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678590926.0},{"title":"Thoughts on Bo Katan in S3 E2 of the Mandalorian?","author":"BossHogg1984","url":"https:\/\/i.redd.it\/wqbw8piyfjna1.jpg","text":"","upvote_ratio":0.57,"created_utc":1678709075.0},{"title":"How did Vader know Luke was his son(legend)","author":"Horror-Cockroach-576","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q7kkf\/how_did_vader_know_luke_was_his_sonlegend\/","text":"I know what it was like in the Canon series, but how it happened in the legend","upvote_ratio":0.57,"created_utc":1678708365.0},{"title":"Former Terrorist Lady just wants to be left alone","author":"VanillaEnjoyer1138","url":"https:\/\/i.redd.it\/t9oqfochx5na1.png","text":"","upvote_ratio":0.98,"created_utc":1678563516.0},{"title":"Lego Star Wars Stop Motion Film: Revenge of Death Watch","author":"UttyLego","url":"https:\/\/youtu.be\/Sedwj-vMBoA","text":"","upvote_ratio":0.5,"created_utc":1678708298.0},{"title":"Bo-Katan and Obi Wan 's Fighting Style","author":"Broken_Mau23","url":"https:\/\/i.redd.it\/ke3sq0wzz7na1.gif","text":"","upvote_ratio":0.96,"created_utc":1678588743.0},{"title":"Star Wars animated series’s watch order","author":"EnvironmentalPiece51","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q7eep\/star_wars_animated_seriess_watch_order\/","text":"I have watched all of the movies obviously, and the live action stuff on Disney plus, and I want to watch the clone wars\/the bad batch and I’m unsure of which one to watch first, is there an order I should go in? Someone told me that the bad batch happens at the end of the clone wars.","upvote_ratio":0.4,"created_utc":1678707836.0},{"title":"A Droid Short Story","author":"Tublz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q74kg\/a_droid_short_story\/","text":"I think a cool concept would be a Battle Droid on a forgotten CIS Command Base, after the fall of the empire and all the other droids have shut down way back when the Empire began, and every day he just goes on his programmed route, like a Wall-E concept, but idk how it woukd continue like maybe he was a special prototype of battle droid made near the end of the clone wars, a type that lasted longer and has the ability to think independently but it has to be activated and maybe he's doing some engineer work and gets electrocuted and that triggers the independent thinking program, and he realizes whats happened in all the years hes beeen at his base, so he creates more droids like him using the shut off droids and they dont go out and attack or anything but they make the base their home and maybe repell pirate\/smugler attacks.","upvote_ratio":0.5,"created_utc":1678706989.0},{"title":"I don't believe people are born inherently evil. Do you think they will ever expand on Sidious's lore as to what led him down a path to the dark side? I believe much like Anakin, he too was groomed to be led down this path. Will we ever know his past as far as the films\/shows are concerned?","author":"kangfromkonoha","url":"https:\/\/i.redd.it\/uos6pcnl06na1.jpg","text":"","upvote_ratio":0.9,"created_utc":1678564626.0},{"title":"Morlocks = Alamites","author":"Careless-Purchase892","url":"https:\/\/www.reddit.com\/gallery\/11oxwo2","text":"Did anyone else's brain went straight to think the underground monsters from Mando Chapter 18 reassemble the same underground creatures from 1960's The Time Machine??","upvote_ratio":0.98,"created_utc":1678575566.0},{"title":"The Jedi let Grievous escape multiple times. The clone commandos…","author":"freehotsaucedragon","url":"https:\/\/v.redd.it\/da8kqnzgh8na1","text":"","upvote_ratio":0.99,"created_utc":1678576418.0},{"title":"I built a Cantwell-class Arrestor cruiser using the same techniques ILM did in the 70s and 80s","author":"ProfessorLaser","url":"https:\/\/www.reddit.com\/gallery\/11oubxp","text":"","upvote_ratio":0.99,"created_utc":1678566841.0},{"title":"Different story but in the starwar universe","author":"Whole-Pop-9702","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q515v\/different_story_but_in_the_starwar_universe\/","text":"I'm not even a Star war fans But after watch some star war lore on TikTok and I wonder why they don't make a random story like slice of life or horror movie \nStar war universe have many possibilities to make many different types of stories\n\nSorry for my bad English","upvote_ratio":0.6,"created_utc":1678699699.0},{"title":"Star Wars Anti-Drunk Driving PSA from 1979 \/w Reconstructed Audio","author":"thebestbobever","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pinp3\/star_wars_antidrunk_driving_psa_from_1979_w\/","text":"Found an old PSA featuring the Cantina Band and regulars from 1979, but the copy I had lacked any audio tracks. I threw the famous background music and some sound effects together to round this out. I checked the rules, and do not believe that this post violates any of this community's guidelines, but please inform me if it does and I will remove it.\n\n [https:\/\/youtu.be\/EqvEZ2l9w1k](https:\/\/youtu.be\/EqvEZ2l9w1k)","upvote_ratio":0.8,"created_utc":1678638383.0},{"title":"Was anyone else tramuatised by the scene in ROTJ where the Gammorean guard Jubnuk got eaten by the Rancor?","author":"Any_Needleworker_966","url":"https:\/\/i.redd.it\/cbftlxjjljna1.png","text":"","upvote_ratio":0.38,"created_utc":1678710956.0},{"title":"Confused About Mandalorian S2-3","author":"pissalisa","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q44av\/confused_about_mandalorian_s23\/","text":">!Why is Grogu with him at the beginning of S3? S2 Ends with him leaving Grogu in Luke’s care. No?!<\n\nWhat am I missing?","upvote_ratio":0.38,"created_utc":1678696305.0},{"title":"Chewbacca, Pencil","author":"OkBreakfast9021","url":"https:\/\/i.redd.it\/yo14mpy4p9na1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678591095.0},{"title":"Book of Boba Fett: Can someone explain the Spice thing?","author":"whoami4546","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pzawn\/book_of_boba_fett_can_someone_explain_the_spice\/","text":"I am watching the book of Boba Fett.  I am very confused about the plot point of the spice trade.  I have the following assumptions. \n\n1. The spice is a illegal substance.  \n2. The spice is being traded throughout the galaxy by the bad  guys. \n\n\nQuestions\n\n1. Is the spice being made on the planet or transported through the planet? \n2. With space transport available by a powerful organized crime ring, why are they using ground transports? Especially, in the outer rim.\n\n\nThe whole plot line does not make sense to me.   It seems like a western plot with space stuff just added on as an after thought.","upvote_ratio":0.58,"created_utc":1678679507.0},{"title":"Padawan’s life","author":"kanawalksonwater","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pvolq\/padawans_life\/","text":"I’m new to the Star Wars book and novels community, I’m curious to know if there’s a book or series that starts at a young age of their life to older age and going through with becoming a Jedi (or sith, I wouldn’t mind) to maybe their death. Besides the obvious, being Anakin Skywalker. Please let me know!","upvote_ratio":0.71,"created_utc":1678669489.0},{"title":"If lightsabers are so difficult to control, then why was the shapeshifter able to use a lightsaber easily against Ashoka?","author":"The_tin_canz","url":"https:\/\/i.redd.it\/yr2tsk2s26na1.jpg","text":"","upvote_ratio":0.88,"created_utc":1678565253.0},{"title":"Can anyone expain this scene from Last Jedi to me","author":"brobruhbrabru","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q2ecm\/can_anyone_expain_this_scene_from_last_jedi_to_me\/","text":"I recently watched the last trilogy and there was a scene near the end of the middle episode which didn't make sense to me. It involves some random kids, one in particular seen staring at the sky as our heroes pass overhead. What is the significance of these random children? is it laying ground work for eps 12-15 or something?","upvote_ratio":0.56,"created_utc":1678689889.0},{"title":"marc Thompson does a much more intimidating voice of thrawn","author":"millerabm18","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pn0k3\/marc_thompson_does_a_much_more_intimidating_voice\/","text":"","upvote_ratio":0.59,"created_utc":1678648497.0},{"title":"I created a R2D2 montessori tower for my little girl","author":"Flaky-Quit2826","url":"https:\/\/v.redd.it\/6pbnga2kw5na1","text":"","upvote_ratio":0.98,"created_utc":1678563236.0},{"title":"I want Brendan Fraser in Star Wars. What would be the perfect role for him?","author":"Bioslack","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q0xbo\/i_want_brendan_fraser_in_star_wars_what_would_be\/","text":"","upvote_ratio":0.44,"created_utc":1678684582.0},{"title":"Future \"Tells Of The Jedi\" episodes should really get experimental","author":"Ziggy_Black_Duke","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q6o4c\/future_tells_of_the_jedi_episodes_should_really\/","text":"If the show's gonna be just 6 10 minute-ish episodes, GO ALL OUT meaning, dont play it safe again with just Clone Wars stuff...\n\nShow the High Republic, show Luke killing Abeloth, explore the possibility of a multiverse, DO MORE than just mini CW episodes please","upvote_ratio":0.33,"created_utc":1678705492.0},{"title":"This is the spray","author":"icanfly-77","url":"https:\/\/i.redd.it\/tzp1yar3c9na1.png","text":"Just saw this in the pharmacy","upvote_ratio":0.96,"created_utc":1678586715.0},{"title":"An interesting detail in Kenobi....","author":"I-Am-Excalibur-Umbra","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pzoyc\/an_interesting_detail_in_kenobi\/","text":"I was watching the final episode of the Kenobi series, when Vader and Obi-Wan have their duel in the darkness of night. I reached the part where Obi-Wan injured Vader enough to the point where the helmet is broken, and half of Anakin’s face could be seen. As they speak, I noticed when Anakin says “I will destroy you!” the bright red glow of his light saver is much more apparent on his face. Could this signify how Anakins hate is now reignited through his words? He speaks of destruction, and perhaps the sudden bright glow of his sober symbolizes his rage. It might just be me, but I also notice Obi-Wan’s saber glow a bit less. \n\n\nSo, I’d like to ask you all. Do you think I’m going too deep into this? Or has anyone else noticed this detail? If you say I’m crazy and the detail I speak of never even appeared, then so be it, I suppose I’ll accept it as truth.","upvote_ratio":0.47,"created_utc":1678680665.0},{"title":"I wonder if they will add more clans in the Mandalorian","author":"ChrisBailey145","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pqs48\/i_wonder_if_they_will_add_more_clans_in_the\/","text":"I know in Star wars rebels and star wars the clone wars they mentioned quite a bit of Mandalorian factions. But I would really want to see new Mandalorian clans being added in. Also would want the true Mandalorians to be recannonized. There is just so much they could do with this show. Hope we get a Boba Fett cameo. It would be interesting on how Din Djarin manages to unite the Mandalorians.","upvote_ratio":0.62,"created_utc":1678657366.0},{"title":"What’s the most fatal job in the grand army of the republic for a clone?","author":"Apachewolf11","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pz29b\/whats_the_most_fatal_job_in_the_grand_army_of_the\/","text":"","upvote_ratio":0.44,"created_utc":1678678769.0},{"title":"Grogu by me","author":"renancampus","url":"https:\/\/i.redd.it\/jiu0umzpw8na1.jpg","text":"","upvote_ratio":0.97,"created_utc":1678581537.0},{"title":"Remember being in the theater in ‘02 when this happened? Really wish I could go back…","author":"Renegade257","url":"https:\/\/i.redd.it\/9cqcuo10t1na1.gif","text":"","upvote_ratio":0.88,"created_utc":1678495538.0},{"title":"tv-1200$ cat- still counting$ chilling with my best bud watching STAR WARS -pricless","author":"kaoskrim","url":"https:\/\/i.redd.it\/5nacbdwyx8na1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678581957.0},{"title":"George lucas action figure","author":"CyberTrooper997","url":"https:\/\/i.redd.it\/h715whupg9na1.jpg","text":"I'll never open this.","upvote_ratio":0.94,"created_utc":1678588262.0},{"title":"Why did Anakin let Padmé die?","author":"brosnevercry","url":"https:\/\/i.redd.it\/7awr3cbf9jna1.jpg","text":"\nIs he stupid","upvote_ratio":0.33,"created_utc":1678706879.0},{"title":"When did the Crimson Dawn became so powerful, also when did it stop being a group of just Mercenaries?","author":"ArmZealousideal8305","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pl7f1\/when_did_the_crimson_dawn_became_so_powerful_also\/","text":"Was it because of Maul, or their rise to power happened before him?\n\nBesides them being a group of ruthless mercenaries I can't find anything about what they were before Maul","upvote_ratio":0.57,"created_utc":1678644315.0},{"title":"Episode IV Tractor Beam Control question","author":"Sufficient_Ad7816","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pvcgq\/episode_iv_tractor_beam_control_question\/","text":"In A New Hope, the tractor beams controls seem to be located in a strange place. Is there any advantage to locating them on a narrow walkway seemingly above more than a 100' drop?\n\n[https:\/\/imgur.com\/a\/uCUJN5L](https:\/\/imgur.com\/a\/uCUJN5L)","upvote_ratio":0.5,"created_utc":1678668623.0},{"title":"Choose a song and a battle in star wars that would go great together","author":"Tooshortforreddit","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pv03t\/choose_a_song_and_a_battle_in_star_wars_that\/","text":"It can be from any Star Wars content, and any kind of battle (lightsaber, space, clone wars, etc.) and any song.\n\nI’ll listen to as many as possible","upvote_ratio":0.38,"created_utc":1678667703.0},{"title":"Who is attending Star Wars celebration this year","author":"Dalton_1980","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pltru\/who_is_attending_star_wars_celebration_this_year\/","text":"And dis toy but photo\/autos. I have the 4 day tickets but photos were way to overpriced","upvote_ratio":0.59,"created_utc":1678645779.0},{"title":"Today in 2004 - The theatrical trailer for Revenge of the Sith was premiered on StarWars.com. That moment when Palpatine ignites his saber...chilling! What was your jaw-dripping moment when the trailer was released.","author":"CrucialCrewMember","url":"https:\/\/i.redd.it\/weab87gs39na1.jpg","text":"","upvote_ratio":0.88,"created_utc":1678583913.0},{"title":"Watch order if I’ve seen the movies but wanna watch the tv shows chronologically?","author":"Treethan__","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pu8ur\/watch_order_if_ive_seen_the_movies_but_wanna\/","text":"I wanna watch the shows I low key hate how I feel required by my ocd to watch them all like I legit think I start at clone wars but every time it’s just starts as a kids show! However is that the right spot to start the watch order?","upvote_ratio":0.5,"created_utc":1678665703.0},{"title":"If Obi-Wan didn't let Vader beat him in Episode IV and they both fought their hardest, who would win?","author":"realzachwong","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ptq7n\/if_obiwan_didnt_let_vader_beat_him_in_episode_iv\/","text":"","upvote_ratio":0.46,"created_utc":1678664376.0},{"title":"Star Wars comic book","author":"Dictectivecomics2739","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pt4gm\/star_wars_comic_book\/","text":"I want to read a short SW comic book before Unlimited ends.\n\n1. I never read any of them. I have no idea what’s going on going comics universe.\n2.Not the biggest fan of SW. Only original trilogy & Mandalorian.\n3. I don't have much time, so I can’t read a really long run.","upvote_ratio":0.5,"created_utc":1678662884.0},{"title":"The Clone Wars first watch","author":"wls_silver","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pcfmn\/the_clone_wars_first_watch\/","text":"I just finished all of the clone wars and it was absolutely amazing, but now I have emotional trauma.  The story amazing.  The character development amazing. The emotional moments amazing.  I loved every second of it.  However I have one question.  Why can anakin have a padawan when he isn’t a master Jedi.  Honestly I have no idea why he can but I just ignored it because ashoka is now one of my favorite characters in the entire series.  I can’t wait to watch bad batch and rebels now but in the meantime can someone answer that question","upvote_ratio":0.64,"created_utc":1678620846.0},{"title":"Idea for Cal Kestis Comics","author":"miindd","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pxnid\/idea_for_cal_kestis_comics\/","text":"I had a really cool idea about Cal having a comic series. As you all know the games let us customize Cal to our liking (ranging saber colors, fighting styles and soon to be in Survivor, even more in-depth character customization and fighting styles) and that could lead many people to wonder what his canonical style and look would be like. My idea was that they could put out a series about Cal, and make each issue slightly DIY. For example, each time he ignites his lightsaber, the page puts a saber outline and allows you to fill in the color, a classic comic book with a minor modification allowing coloring to things such as The Mantis, his clothing, hairstyles, while allowing the comic to still be an actual comic. It could be a stupid idea but I thought it would be a cool way to allow us all to have a personal experience in a large part of the official Star Wars universe. Of course, the detailing wouldn’t affect the overall story but allows us to each feel unified yet individual with a character we feel is each our own.","upvote_ratio":0.33,"created_utc":1678674816.0},{"title":"Mara Jade and Starkiller as Inquisitors. Art by Jake Bartok.","author":"WarWolf343","url":"https:\/\/i.redd.it\/3i91tuz1a6na1.png","text":"","upvote_ratio":0.91,"created_utc":1678567787.0},{"title":"Everyone inaccurately compares Ben Solo to Zuko when in reality Bo-Katan is nearly identical to the redemption arc poster boy in several aspects of her characterization.","author":"Numerous_Coach_8656","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pwfi9\/everyone_inaccurately_compares_ben_solo_to_zuko\/","text":"Royalty? Check.\n\nMajor sibling issues? Check.\n\n“I must have X to restore my honor!” Check.\n\nThere are certainly other similarities that I haven't figured out yet and listed here. If you can think of some more similarities, type 'em down in the comments!","upvote_ratio":0.44,"created_utc":1678671485.0},{"title":"I am trying to create a custom droid for my star wars fan fiction","author":"ChrisBailey145","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pqvz0\/i_am_trying_to_create_a_custom_droid_for_my_star\/","text":"This droid would be taking place in the old republic era serving a localize monarchy that controls a a few systems. As this monarchy is militaristic in nature with a large industrial capacity. Just needing a standard humanoid droid name so the droids can fight alongside the soilders in my fan fiction that takes place in Star wars","upvote_ratio":0.43,"created_utc":1678657617.0},{"title":"After watching the first 2 series of The Mandalorian and The Book of Boba Fett, my wife's theory is Grogu is a pure evil sith, using the dark side to manipulate everyone into liking him","author":"theklinker","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pqs2o\/after_watching_the_first_2_series_of_the\/","text":"To set things straight I don't believe it either, this is also from the same person who describes Star wars as \"it's all just sand jabbas and space bears\" 🐻","upvote_ratio":0.5,"created_utc":1678657364.0},{"title":"Some pics from our trip to Galaxies Edge","author":"Darth2099","url":"https:\/\/www.reddit.com\/gallery\/11oyihn","text":"","upvote_ratio":0.95,"created_utc":1678576993.0},{"title":"Is andor worth watching?","author":"AlternativeTennis388","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q1wd6\/is_andor_worth_watching\/","text":"My girlfriend just sat through all of rebels and was bored out of her mind with the show. Andor isn't leaving a great first impression on her. I watched the show myself but don't have any strong opinions on it, so I wanted to know if people consider it to be worth skipping?","upvote_ratio":0.33,"created_utc":1678688056.0},{"title":"low quality darth maul (i drew in mspaint lmao)","author":"Thingyyyyyyyyyy","url":"https:\/\/i.redd.it\/bpjvllzn6gna1.png","text":"","upvote_ratio":0.38,"created_utc":1678687737.0},{"title":"501st representing at the St. Patrick’s parade","author":"orion3999","url":"https:\/\/www.reddit.com\/gallery\/11ovfw7","text":"","upvote_ratio":0.92,"created_utc":1678569575.0},{"title":"What is happening with the Disney Plus project\"A Droid Story\"?","author":"GuardiansOfTheEdge","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pbe80\/what_is_happening_with_the_disney_plus_projecta\/","text":"It was announced all the way back in December 2020, said to be featuring 3PO and R2 with a new droid. It wasn't announced to be either a show or a movie, but signs did point to it being a Disney Plus exclusive special. \n\nThe latest I've heard about it is rumors back in January 2022 that Anthony Daniels was doing mocap for an unannounced project, but seeing as nothing with his involvement has occurred, perhaps it was for Droid Story?\n\nMaybe they'll announced it at Star Wars Celebration this year? Similar to Marvel announcing their Special Presentations with a shorter gap than their shows and movies, maybe if its announced at Celebration, we could see a Late 2023 release date.","upvote_ratio":1.0,"created_utc":1678617110.0},{"title":"I thought jedi mind tricks didn't work with the trade federation.","author":"kemonkey1","url":"https:\/\/www.reddit.com\/gallery\/11p2csf","text":"","upvote_ratio":0.71,"created_utc":1678587113.0},{"title":"Where can I buy the full Clone Wars DVD set?","author":"FancifulCat","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11powim\/where_can_i_buy_the_full_clone_wars_dvd_set\/","text":"Hello, sorry if this is the wrong place to post. \nI want to buy the DVD set in UK for clone wars (and Rebels if possible) as a gift for someone who loves it.\n\nI’ve looked on google and the seasons seem fragmented and mostly sold second hand (I rather purchase new for the sake of having clean discs and not deal with the faff of returning if the quality is below par). \n\nCan anyone recommend a store? I am willing to import outside UK too. Thanks in advance 😊","upvote_ratio":0.45,"created_utc":1678652912.0},{"title":"What possible canonical reason could there be for characters having either British or American accents?","author":"theCleverClam","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pudgr\/what_possible_canonical_reason_could_there_be_for\/","text":"To my knowledge, no reason for the differing accents has ever been given (nor will they as it is just actors speaking their native accent). I am just wondering if anyone can think of a reason that could still work for every character. It doesn't seem to be based on location, good\/evil, or economic status.\n\nAnother wrinkle is that it does seem like there are accents in Star Wars that are native to certain populations (Gungans). \n\nIf you have come up with something that you use to explain this to yourself, I want to hear it!","upvote_ratio":0.42,"created_utc":1678666022.0},{"title":"My first tattoo!","author":"Elderberry_Honest","url":"https:\/\/i.redd.it\/v9xekcvhu8na1.jpg","text":"","upvote_ratio":0.76,"created_utc":1678580788.0},{"title":"If Star Wars had been made today","author":"MrZister","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11q39z6\/if_star_wars_had_been_made_today\/","text":"Darth Vader and Luke Skywalker can still be enemies, if anything I think (as I made another comment about) the greater fandom-betrayal would be fangirls selfshipping with Vader (who people would harass anyway because \"the Empire is space Nazis so liking them makes you a real Nazi\") because of all sorts of imaginings they'd have through 4 and 5 of what he looked like under the suit (which would change from \"hot twink who uses the voice thingie to sound more intimidating\" to \"hot dad\" once they heard the father reveal) seeing his disfigured true self in 6 and feeling like the writers did that on purpose just to piss them off","upvote_ratio":0.19,"created_utc":1678693129.0},{"title":"Free Star wars mod on a Free fps. Win win !!!","author":"HippCelt","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pvrg0\/free_star_wars_mod_on_a_free_fps_win_win\/","text":"Operation Harsh Doorstop is a free game , but it's more like a Gary's mod  for fps games . \n\nAnyway Somebody has made a Star wars mod for it. Check it out and then maybe pop over to steam \n\n[https:\/\/www.youtube.com\/watch?v=QWO2QciFjUw&ab\\_channel=HippCelt](https:\/\/www.youtube.com\/watch?v=QWO2QciFjUw&ab_channel=HippCelt)","upvote_ratio":0.44,"created_utc":1678669696.0},{"title":"Tried my hand at making a Lego Rebels Anakin. Legs are a third party Kylo Ren (lost his original legs...) and hair is from a Jurassic Park character.","author":"GrandAdmiralSpock","url":"https:\/\/i.redd.it\/nmj5c3ude9na1.jpg","text":"","upvote_ratio":0.87,"created_utc":1678587480.0},{"title":"Star Wars Teen Drama Intro - Prequels","author":"cskamosclow","url":"https:\/\/v.redd.it\/39pcuc8yb7na1","text":"","upvote_ratio":0.84,"created_utc":1678580586.0},{"title":"Wookieepedia has an announcement","author":"Baconandbeers","url":"https:\/\/starwars.fandom.com\/wiki\/Forum:SH:An_Apology_from_the_Administration_for_Wookieepedia%27s_Harmful_History","text":"","upvote_ratio":0.63,"created_utc":1678593577.0},{"title":"Just got my first Hot Toys figure, Ahsoka Tano! Decided to do a quick photoshoot to celebrate","author":"Same-Classic1507","url":"https:\/\/www.reddit.com\/gallery\/11ox8ux","text":"","upvote_ratio":0.91,"created_utc":1678573960.0},{"title":"Have you noticed this in the new mandalorian episode?","author":"Much-Food-4689","url":"https:\/\/www.reddit.com\/gallery\/11pzmqr","text":"On the right side you can see a droid similar to bd-1 this might be an easter egg for the upcoming game jedi survivor","upvote_ratio":0.38,"created_utc":1678680475.0},{"title":"Obi Wan Kenobi was pretty good. What’s with so much negativity?","author":"buhoo115","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p01qa\/obi_wan_kenobi_was_pretty_good_whats_with_so_much\/","text":"I finally got around to watching Obi Wan on Disney plus and all around it was pretty solid. There were parts that could’ve been better but still overall I enjoyed it a lot. Reva was decent too, not sure why a lot of people disliked her. The Vader and Obi Wan fights were dope too, especially at the end when he slices his mask and sees what’s left of Anakin. Definitely a 8\/10","upvote_ratio":0.55,"created_utc":1678580804.0},{"title":"Hear me out. Easter, but…Star Wars.","author":"electroskippy","url":"https:\/\/v.redd.it\/9j6gikem19na1","text":"","upvote_ratio":0.88,"created_utc":1678583364.0},{"title":"Hot take: Solo was actually a great film.","author":"hybridtheory1331","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11obg2y\/hot_take_solo_was_actually_a_great_film\/","text":"","upvote_ratio":0.78,"created_utc":1678511435.0},{"title":"Why haven't I seen a story about a backwater planet ruled by oligarchs or thugs? let me finish-","author":"donjohndijon","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pjpms\/why_havent_i_seen_a_story_about_a_backwater\/","text":"One that first rejoices when the empire arrives and destroys the existing regime. Only to realize the reality of their situation and possibly even end up working with the deposed regime to rebel.","upvote_ratio":0.5,"created_utc":1678640831.0},{"title":"One of the most iconic scenes of the prequel Star Wars era.","author":"Sleepyweasel211","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11owin8\/one_of_the_most_iconic_scenes_of_the_prequel_star\/","text":"Re-watching (about the 1000th time) TPM and I remember seeing this in theaters and feeling the rush of excitement when this scene began. From Qui-Gon telling the others, \"We'll handle this', to the 'Duel of Fates' reaching the crescendo, and Maul igniting the second blade of his saber, say what you want about the prequels, but this moment is what Stars Wars is all about.  Too bad Maul couldn't keep it together for the other two prequels.... (See what I did there?)\n\nhttps:\/\/preview.redd.it\/ed5wdeg5m6na1.jpg?width=1280&format=pjpg&auto=webp&v=enabled&s=b24cd781650dfc10b010213e480c11ba85af32dc","upvote_ratio":0.95,"created_utc":1678572194.0},{"title":"What's your opinion on Warhammers Imperium of Man?","author":"Dektarey","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pvnwo\/whats_your_opinion_on_warhammers_imperium_of_man\/","text":"I've seen more and more often people complaining about how incompetent the Star Wars Empire is, how the story is always the same of an underdog good guy defeating the big bad Empire in some heroic cause.\n\nThese complaints are always and without fault responded to by comments which say something along the lines of \"The Empire are Nazis, they arent meant to be sympathetic! I dont want my Star Wars to be morally ambiguous. This always was a kids franchise. Fascism is on the rise...\" and so on and on.\n\nPersonally i am of the opinion the Empire should be **extremely** competent. (I also want to have more empire story lines, but thats just me).\n\nThing is, having an antagonist who's just a fool doesnt make for good story telling. Nobody is impressed if some martial arts fighter defeats a drunk, diabetic cripple in hand-to-hand combat after all. And sadly Star Wars only has these kind of story lines. Andor spiced things up, but even there the foundation of \"Empire cant possibly ever achieve anything\" holds true. The Mandalorian may have been the worst example to date in that regard. I merely think we need to make the bad guys scary again. Like genuinely terrifyingly intimidating -kind of scary.\n\nNow having established how extremely anti-empire this subreddit in particular is: \n\nWhat do you think of the Imperium of Man from the 40k (or 30k) Franchise? I know its an entirely different setting aimed at vastly different demographics with 40k being extremely 18+ by design, but i think the Galactic Empire could really use some of that 40k level of intimidation. Being competent, ruthless, no-nonsense. An opponent who doesnt pull punches just because its Star Wars.\n\nI'd like to know whats your opinion on the Imperium considering just how prevalent the Anti-Antagonist sentiment among you is.\n\nI dont want the Galactic Empire to drop all it is just to copy another franchise. I just want it stop pulling punches. To be scary again.\n\nThis question mostly came to my mind because, as above, this sub is *very* black and white and 40k is the polar opposite. There isnt another discussion on this out there. I looked. Whenever you mention Star Wars and 40k in the same sentence its always and without a fault some kind of \"Who would win\" kind of deal.\n\nI hold both franchises dear, but over the last few years seeing as Star Wars devolved for the most part, i've grown ever closer to preferring Warhammer over it.","upvote_ratio":0.13,"created_utc":1678669433.0},{"title":"I want Vader to have his own personal apprentice in the new cannon","author":"ChrisBailey145","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pqnlx\/i_want_vader_to_have_his_own_personal_apprentice\/","text":"I kinda really missed Vader having a apprentice like he had Star Killer in legends. Idk it would be great if Vader's apprentice would be used as Vader's personal assassin as Vader trains his apprentice on Mustafar where Vader's castle is. It would really be interesting to get another Vader apprentice moment in cannon this time","upvote_ratio":0.33,"created_utc":1678657069.0},{"title":"Question","author":"Soft-Hamster-4525","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pu2m0\/question\/","text":"Even as Vader, does Anakin still hate sand?","upvote_ratio":0.27,"created_utc":1678665264.0},{"title":"Is there a Clone Wars\/Rebels YouTube Debrief to prepare for this Mandalorian season?","author":"KeepingItKosher","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pgexw\/is_there_a_clone_warsrebels_youtube_debrief_to\/","text":"I saw Clone Wars a while ago and my wife & I have a baby. She does not have the time to give either show a chance, but is open to a YouTube video explaining everything significant about Mandalore’s destruction and why Thrawn is a big deal. Any help would be greatly appreciated!","upvote_ratio":0.5,"created_utc":1678632927.0},{"title":"Is beskar fossilized mythosaur poop? 💩","author":"Starwarsordie","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ogotj\/is_beskar_fossilized_mythosaur_poop\/","text":"Just a question. Have at it scientific community.","upvote_ratio":0.83,"created_utc":1678529975.0},{"title":"Mandalorian and Empire display coming along nicely.","author":"GarfieldLeChat","url":"https:\/\/v.redd.it\/wb14hraxi8na1","text":"","upvote_ratio":0.94,"created_utc":1678576943.0},{"title":"Why did Commander Mayday take orders from the Lieutenant when Mayday is a higher rank than him?","author":"4ronr","url":"https:\/\/www.reddit.com\/gallery\/11ot419","text":"","upvote_ratio":0.88,"created_utc":1678563830.0},{"title":"Does anyone have any info on CT-0001(if that's boba then CT-0002)","author":"StartOptimal6576","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ppwj8\/does_anyone_have_any_info_on_ct0001if_thats_boba\/","text":"Just curious, perhaps he could be almost a doppelganger to jango fett.","upvote_ratio":0.33,"created_utc":1678655286.0},{"title":"Lightsaber unveiled at SXSW 2023","author":"Nooker","url":"https:\/\/twitter.com\/sw_holocron\/status\/1634639795677806592","text":"","upvote_ratio":0.85,"created_utc":1678565379.0},{"title":"Galatic Empire vs EndWar Earth","author":"CoolVoice3753","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pj1zs\/galatic_empire_vs_endwar_earth\/","text":"In this scenario Earth in the Endwar universe has been found by the galatic Empire, realizing that Earth has untapped resources and is to valuable to give up the Emperor sends a force to subjugate the planet, without destroying it's natural resources. \n\nIn this Scenario the 3 world powers that were fighting amongst themselves are forced to work together in order to fight back against the Empire's forces landing on Earth. Both the USA and EF have their orbital weaponry for a short time before they are blasted out of the sky (if able are used againstthe Empires ships). RF is able to keep their WMD since it is not orbital based but must use it strictly for the worst case scenarios. \n\nAt the same time the Reble Alliance has caught wind of Earth and are still located on Hoth.\n\nVader while hearing about Earth has is focus on the Rebellion and Luck Skywalker.\n\nRound 1- How long can the three powers hold Earth and are they able to push the Empire off planet?\n\nRound 2- The Alliance plans to send forces to aid the planet can Earth hold out long enough for the Rebellion to bring aid?\n\nRound 3- If Earth proves to difficult to conquer and the Emperor is forced to send Vader how long can Earth hold on before the Rebellion sends reinforcements?","upvote_ratio":0.25,"created_utc":1678639331.0},{"title":"best mandalorian character, she spends her time scamming din djarin","author":"saphi717","url":"https:\/\/i.redd.it\/enyu905urzma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678470932.0},{"title":"Setting the empire up to fail, aka the pyrrhic the Bad Batch is leading towards.","author":"PucaFilms","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pd35v\/setting_the_empire_up_to_fail_aka_the_pyrrhic_the\/","text":"So despite the episode to episode plots of the Bad Batch being somewhat uneven, the overarching story of the clones being phased out and the stormtroopers replacing them is a very interesting one. Here's how I think it all comes together and where the show is leading.\n\nThe rest of season two.\n* In the remaining four episodes of S2, I think we'll see 13\/14 be about the batch cutting ties with Cid for good. They've realised how she treats them, and after the core themes of the season (feeling lost, finding purpose, the need for a home) it'll lead directly into the squad reuniting with Rex and Echo. \n* Based on the data from the Zillo beast that the batch sent to Rex, we'll learn about Mount Tantis in 15\/16, where the batch will infiltrate the fortress (why I'm not sure, perhaps Crosshairs sends out a message for help) and escape with Crosshairs and some other clones who are being experimented on. There, Crosshair and Rex will reunite with Cody, who unfortunately has been brainwashed in one of those black suits. Successfully escaping and setting back the cloning operation when Nala Se is killed in action, her last words a whisper to Hunter regarding Omega's true purpose. Escaping barely with their lives, the batch now find themselves with the clone rebellion (and crosshairs) whether they like it or not, determined to fight for all clones across the galaxy...\n\nSeason Three\n* A hypothetical third season features an expanded bad batch as they are now part of the clone resistance, taking up residence on a ruined Kamino. Growing in members after reuniting with Gregor and clone commander Wolfe, they all take on the mantle of Clone Force 99, convincing more and more to their cause. They are hunted by the new mind controlled clones, turning their own against them, lead by Cody. The batch try to build bridges with Crosshair, but find opening back up to him hard after all he did. All roads lead to more and more open rebellion, with eventually hundreds of clones, sporting the colours and armour of their lost companies, commanders and brothers taking on the full force of the empire, where they hold their own but are ultimately overran by the endless waves of newly revealed stormtroopers, and eventually met by Darth Vader himself. With Crosshairs standing up for his brothers, he dies in battle, and Echo unknowingly faces off against his old master when Vader kills him, with perhaps the slightest hint of regret and sadness from the ex-jedi who once helped rescue Echo. The rebellion crushed, the batch and Rex's group are seperated, seemingly defeated, though their victory would not become apparent for many years...\n\nSetting the empire up to fail\n* So, the clones cannot win. The rebellion doesn't fully form until years later, and we know the empire rises to power without the help of the clones. So, wouldn't this feel like a downer ending for the show? That's where I think the secret victory comes in. The clones amass, gather and rebel, leading to the stormtroopers being recruited, trained and pushed through the ranks of the empire early. Too early in fact, for most are barely equipt to fight, and have the aim of someone who's barely ever held a blaster. They may overwhelm and defeat the clones in the end through sheer numbers, but this push set up the stormtroopers to be weak, and despite the empire seeing their visitory as a sign of strength, it eventually sets them to fall, almost two decades of poor training and arrogance later.\n\nAn extra irony\n* In season three we begin to see more brainwashed clones, dubbed 'death troopers', a last ditch attempt to make the clones tools of conformity for the empire. With Cody hunting the group against his will throughout Season 3, eventually they beat him, setting him free as he dies in Rex's arms. Knowing the stormtrooper push eventually helped undermine the empire, an extra level of irony comes from knowing the death troopers, brainwashed elderly clones, were the most powerful of the empire's forces, and had they stuck with clones, perhaps even in their old age, the empire would have a more effective army.\n\nSomehow, Palatine returned\n* While the bad batch is working to improve the Rise of Skywalker by fleshing out the empire's secret cloning efforts, it also plays a key role in the story, as Palptine's efforts to control cloning for himself paid a bigger price than anticipated, with the batch unknowingly setting his plans back years. It's not just helping the weaker parts of the franchise, but the control over cloning and wanting to clone himself directly plays into the themes of the show and the eventual loss of the empire.\n\nWhat about the batch, Season Four and Omega?\n* A few years after the rebellion on Kamino, an aging Hunter, Wrecker and Tech travel the galaxy with Omega. As she rises in power, their rapid aging is beginning to kick in, and after laying low and taking on missions with less need for firepower, the group once again find themselves lost for purpose, and seperated from Rex and the others. I think perhaps it makes the most sense that Omega is indeed a force sensitive clone - I know that's not exactly a huge twist as it's been commonly predicted, but given how she has been shown meditating, praying and overall being quite spiritual, it makes sense for her character, while also showing how close Palatine and the Empire were to having the secret of force sensitive clones, had they known the truth. It all just fits really nicely.\n\nHow does it l end?\n* I don't think the show could end with the clones being defeated, which is why I've given four seasons instead. Carrying on a few years after the big rebellion can help highlight the vistory they've set in motion even after defeat, as well as highlight the rapid aging of the clones. I think a key theme has been about how the clones, supposed to be rigid and unchangeable, have developed not just their own personalities, but their own paths in life, and we'll see a much different Tech, Wrecker and Hunter find a new life for themselves, perhaps one out of the action, where, like Cut, they can have families of their own. As for Omega, she wants to forge her own path, and the show ends with hunter saying goodbye to his daughter, who is now grown and ready to find her own purpose following her growing force powers. If any one character is going to appear in other places in the franchise, it's Omega. Plus, getting another season gives us more time to bridge the clone wars and rebels era. There's still a few more people I'd like to see how up (Omega and Boba pretty much have to meet).\n\nThe changing dynamics of the group\n* I think, no matter how it ends, the most important thing is that the batch changes. They outgrow their original purposes and find new identities. You can see their armour changing piece by piece, and hopefully by the end of the show they all look new and have changed from their programming. Perhaps Hunter sustains a serious injury, maybe even a lost limb, in the escape from Tantis. Going forward, he trains with echo to get used to his disability, and eventually gives leadership of the batch to Tech, who has been learning many lessons this season. As Crosshairs redeems himself and Echo goes from separatist-hater to freedom fighter, we just need an arc for Wrecker as he too changes into something new and unexpected. They begin as soldiers, and end as people.","upvote_ratio":0.56,"created_utc":1678623085.0},{"title":"Full size Lego darksaber","author":"Weird_Basil5389","url":"https:\/\/www.reddit.com\/gallery\/11p2mcn","text":"","upvote_ratio":0.61,"created_utc":1678587862.0},{"title":"Dark saber question","author":"shweenerdog","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p593j\/dark_saber_question\/","text":"Why does Din Djarin struggle to wield the dark saber but Bo Katan can swing it like a lightsaber? I’m talking about Mandalorian season 3 episode 2","upvote_ratio":0.6,"created_utc":1678595497.0},{"title":"Favorite correction the First Order did to make up for the mistakes of the former Empire?","author":"godzillavkk","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pgrl3\/favorite_correction_the_first_order_did_to_make\/","text":"A. More secure and less exposed Star Destroyer bridges\n\nB. Putting more reliance on TIE Fighters\n\nC. Giving their TIE fighters shields and hyperdrive\n\nD. Putting cable cutters on their walkers\n\nE. Stormtroopers being at least somewhat better shots and having melee weapons\n\nF: Getting rid of Ilum's sentient and dangerous life forms\n\nG: Making Starkiller Bases weak spot much more secure\n\nH: Not killing subordinates for failure as often","upvote_ratio":0.43,"created_utc":1678633780.0},{"title":"Hogwarts Legacy made me realize how badly we need a Star Wars game where you play as a Padawan or a Sith Acolyte","author":"Duck-of-Doom","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11och57\/hogwarts_legacy_made_me_realize_how_badly_we_need\/","text":"Two campaigns, one set in the old republic era in which you’re a student on Korriban, hunting for Sith artifacts, conspiring with various high ranking Sith who have their own separate goals & motivations, all while competing with, & often murdering, fellow acolytes as you climb the ranks\n\n& another set slightly before Phantom Menace in which you go on missions with various Jedi Knights & explore the Jedi temple on Coruscant, learning about all aspects of the force — all while struggling with dark side temptation that may make the game much easier but push you further towards corruption.","upvote_ratio":0.91,"created_utc":1678514913.0},{"title":"Solidjj's \"Darth Vader does an Oopsie\":","author":"Rosie-Love98","url":"https:\/\/youtube.com\/watch?v=meqC7Oyo3Wk&feature=share","text":"","upvote_ratio":0.7,"created_utc":1678580100.0},{"title":"Found at Ollie’s 🔥","author":"Jayr2357","url":"https:\/\/www.reddit.com\/gallery\/11oxekf","text":"","upvote_ratio":0.69,"created_utc":1678574343.0},{"title":"Can anyone else Imagine Charles Dance (Tywin Lannister) casted as a Imperial Commander?","author":"Rogue_4TW","url":"https:\/\/www.reddit.com\/gallery\/11noazb","text":"Not exactly At the very top. But definitely on the field,making on the ground decisions.\n\nI can totally imagine him planning Battle strategies with Lieutenants with Rebel Arty in the background and him being TOTALLY UNFAZED whilst every else in taking cover.\n\nHe just needs to be a total boss making the hard choices. the most f'd up decisions, but all for a just cause. He needs to sacrifice a certain platoon to save a whole batallion. And needs to straight up make devious tactics and war crimes, but at the end of the day, its the hard choice that needs to be done to protect the empire (just like Tywin lannister condoning the red wedding)\n\nBut for this to fully work, it needs to be a storm trooper pov movie. imagine AQOTWF but with stormtroopers.\n\nNot exactly the \"villain\" but the antagonist who ignores the misery of his soldiers. views them as pawns to achieve the bigger picture. \n\nHes not sucking up to higher ups and darth Vader\/sidious either. Hes not trying to impress them or gain their validation. But hes loyal to the idea of \"order\" and doesnt tolerate anarchy and instability. He had to be politically driven. \n\nHis gotta atleast make one badass speech in this movie. something that makes all the soldiers zeal and gives up goosebumps.\n\nImagine the start of that mw2 missions where shepard is staring in the battle reloading his revolver, ordering Pvt allen to fight. Bur instead of shepard, its Charles Dance.\n\nThat's all..Might edit and vent more stuff, idk. Just a crazy thought i got.","upvote_ratio":0.95,"created_utc":1678452511.0},{"title":"If you could write a followup to this, what would you do?","author":"godzillavkk","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ph80t\/if_you_could_write_a_followup_to_this_what_would\/","text":"According to Wookiepedia, durring the canon New Republic era, rumors had it that multiple Geonosian eggs survived the sterilization of Geonosis. If this is true, it means there might still be hope for the Geonosians. Any surviving Geonisoans are probably living in hiding, because they fear the galaxy might still be angry at them for associating with the Sepratists and being the original founders of the Death Star.","upvote_ratio":0.17,"created_utc":1678634906.0},{"title":"Battle above the Sarlacc pit!","author":"stirredturd","url":"https:\/\/i.redd.it\/a1wb1l41kxma1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678462124.0},{"title":"“Chaos in armor” | oil on canvas","author":"DXLLL","url":"https:\/\/i.redd.it\/8qq09q6xe1na1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678490803.0},{"title":"Star Wars Visual Trivia 2023 #21","author":"--TheForce--","url":"https:\/\/i.redd.it\/6q91lnhey5na1.jpg","text":"","upvote_ratio":0.73,"created_utc":1678563796.0},{"title":"A little concept I had, lore in the comments","author":"VLenin2291","url":"https:\/\/i.redd.it\/2cpj281867na1.jpg","text":"","upvote_ratio":0.72,"created_utc":1678578790.0},{"title":"How to replace batteries?","author":"Rude_Neighborhood_93","url":"https:\/\/i.redd.it\/mc58v870z7na1.jpg","text":"","upvote_ratio":0.65,"created_utc":1678570200.0},{"title":"I have a question, I have always been hearing people say that emperor palpatine is the strongest sith to exist but is that true?","author":"SKY_FORCE05","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p4xqo\/i_have_a_question_i_have_always_been_hearing\/","text":"I've always heard people talk about palpatine being the strongest of the sith, and like are they being serious?\n\n\nI've heard people talk about Nihilus and Darth Malgus\n\nBeing some of the strongest sith out there, Nihilus who ate planets, and Malgus just being a Beast Amoung the sith \n\n\nSo how is palpatine stronger then then? Or am I missing something","upvote_ratio":0.63,"created_utc":1678594536.0},{"title":"Unpopular opinion - Obi Wan Kenobi is undoubtedly the most underrated Star Wars project ever","author":"RandomName00_","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pkl4w\/unpopular_opinion_obi_wan_kenobi_is_undoubtedly\/","text":"I really like this show. It does an excellent job of highlighting Obi Wan’s trauma, Vader is brilliant in it, it creates an excellent link to Ewan McGregor’s prequel Obi Wan and Alec Guinness’s A New Hope Ben Kenobi. Leia I think I’d a lot of fun in it. The planet on EP 2 is so cool.\nYes it obviously isn’t perfect the chase scene in ep 1 is poor, the planets other than the one in EP 2 are boring and unimaginative, Riva’s arc is strange and uninteresting at worst and distracting at best, and yes there are a lot of issues with part 4.\nHowever, I think it’s honestly a really good story and  a good watch.","upvote_ratio":0.46,"created_utc":1678642875.0},{"title":"Do you think Piett was a fool?","author":"godzillavkk","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pgzwg\/do_you_think_piett_was_a_fool\/","text":"Admiral Versio's first line in Battlefront 2 has become something of a meme. But do you think he's right?","upvote_ratio":0.25,"created_utc":1678634336.0},{"title":"how would the star wars universe have been changed if Grievous escaped Utapau for Mustafar and then Anakin tried to kill Grievous and the other separatists and then Grievous and Obi-wan teamed up to fight Anakin on Mustafar?","author":"Edward2704","url":"https:\/\/i.redd.it\/wl2nv7v748na1.png","text":"","upvote_ratio":0.54,"created_utc":1678589978.0},{"title":"Do shorts exist in the Star Wars universe? All these desert planets and I can't recall ever seeing anyone wear shorts.","author":"PirateMushroom","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nsnsm\/do_shorts_exist_in_the_star_wars_universe_all\/","text":"","upvote_ratio":0.95,"created_utc":1678463361.0},{"title":"The Phantom Menace isn’t bad","author":"Comfortable_Cream608","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ob3nn\/the_phantom_menace_isnt_bad\/","text":"Just watched episode 1 for the first time in forever and I honestly don’t understand the hate this movie received. It’s really not that bad, especially when one considers that its 1.) the first chapter of a 6 part story and 2.) a movie made primarily for kids.","upvote_ratio":0.73,"created_utc":1678510319.0},{"title":"mando x time machine?","author":"Kumorocks064","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p70ml\/mando_x_time_machine\/","text":"did anyone else think of the monsters from the time machine movie when mandalore had its own beasts?","upvote_ratio":0.4,"created_utc":1678601086.0},{"title":"Let's say one of the upcoming films has another Death Star. But this time, it has no weakness. The good guys can't destroy it. No matter how hard they try. Then what? What does that movie look like?","author":"--TheForce--","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11phgjs\/lets_say_one_of_the_upcoming_films_has_another\/","text":"And by can't destroy it,  I mean in the usual manner - some kind of weakness they attack from the outside. They'd have to get inside somehow. Or neutralize its destructive power with some new kinds of planetary shields. Stuff like that.","upvote_ratio":0.36,"created_utc":1678635496.0},{"title":"Could SW Bad Batch get a actor played movie or series?","author":"Matej1889","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pe2g0\/could_sw_bad_batch_get_a_actor_played_movie_or\/","text":"It would be awesome! As much as I love animated series I must say I am missing real actors! The same format like Mando would be great.","upvote_ratio":0.36,"created_utc":1678626215.0},{"title":"Star Wars fashion: what are your favorite non-film (ie alternative, ones we havent already seen) outfits from the old EU, comics, books, games etc for your best loved Star Wars characters? i love the sunglasses here lol would love to see more of the same for Leia, Qi’ra, Mara Jade in particular","author":"gunners98","url":"https:\/\/i.redd.it\/qyjxlc326zma1.jpg","text":"","upvote_ratio":0.98,"created_utc":1678463607.0},{"title":"Clone Wars Interest?","author":"Neat-Carpenter-6256","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pemjn\/clone_wars_interest\/","text":"I always find it so hard to get Star Wars casual fans to watch the clone wars. I recently finally was able to convince my girlfriend after a year and she now wants to watch most of the show \n\nMy question is how do you guys pose watching the show to people? I think the animation really turns people off and so many people are missing out on a great show","upvote_ratio":0.31,"created_utc":1678627913.0},{"title":"Finally watched Andor after not having much optimism for the series. It's now my favorite Disney+ show","author":"ATK42","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o8j5l\/finally_watched_andor_after_not_having_much\/","text":"Tying in really well with Rogue One, which was my favorite post-Disney acquisition movie\n\nDon't get me wrong, The Mandalorian is very good, but Andor edges it out to me","upvote_ratio":0.85,"created_utc":1678502281.0},{"title":"Name of Count Doku appropriation of the Hindi word \"daku\"?","author":"aagee","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pobts\/name_of_count_doku_appropriation_of_the_hindi\/","text":"\"daku\" is a word for the bad guy in Hindi. How come nobody has ever made this connection?!","upvote_ratio":0.15,"created_utc":1678651571.0},{"title":"Who shot first the chicken or the egg","author":"glowsquid4life","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11phi4a\/who_shot_first_the_chicken_or_the_egg\/","text":"","upvote_ratio":0.29,"created_utc":1678635611.0},{"title":"Star Wars: The Deckbuilding Game Review","author":"LawAndOrder559","url":"https:\/\/www.ign.com\/articles\/star-wars-the-deckbuilding-game-review","text":"","upvote_ratio":0.6,"created_utc":1678591577.0},{"title":"New Star Wars Book Expands Fallen Order’s Silliest Cutscene","author":"BurtBruh","url":"https:\/\/kotaku.com\/star-wars-fallen-order-jedi-battle-scars-cal-greez-salt-1850208142","text":"","upvote_ratio":0.57,"created_utc":1678591425.0},{"title":"(32m) First time watching all 9 movies","author":"PDX_Blazer","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o0w6i\/32m_first_time_watching_all_9_movies\/","text":"Somehow Star Wars escaped me for a long time. I am not sure how. I am into LOTR, Pokémon, Indiana Jones, etc. I just don’t have anyone around me that is\/was into Star Wars, so I passed on it. Anyway, I just watched all 9 in order of release and truly loved them all. I’m sincerely shocked at the anger and hatred that many have for the prequels and sequels as a new Star Wars fan. I expected to come to this sub and see fandom, but I feel like it is mostly gatekeepers. Are there plot holes, cliches, and annoyances in some of them, sure. But name a 9 movie series that doesn’t have that? The hatred for the sequels is shocking to me honestly. Anyway, glad to be aboard now, may the force be with you all.","upvote_ratio":0.85,"created_utc":1678482465.0},{"title":"Bo-Katan Art","author":"Nagrom_TheCreature","url":"https:\/\/i.redd.it\/fsdg8msbjzma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678468070.0},{"title":"Is there every an explanation for why Palpatine wasn’t recruited by the Jedi?","author":"TheGeckoLord4343","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p2a2o\/is_there_every_an_explanation_for_why_palpatine\/","text":"I understand sometimes things slip through the cracks, but Palpatine was from a Core planet (I’m pretty sure Naboo was at least), and he was extremely powerful in the force. Later in life he could hide that sensitivity due to his training but shouldn’t he have been noticed as a baby before his desire for evil?","upvote_ratio":0.4,"created_utc":1678586907.0},{"title":"Reintegrating some of the Clones' Mandalorian identity in Canon","author":"dadsushi","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p25k5\/reintegrating_some_of_the_clones_mandalorian\/","text":"One of the things I loved so much about Legends lore was the fact that some clones considered themselves to be Mandalorian. Specifically, some of the ARC troopers and clone commandos such as Fordo who were trained under Mandalorian such as Kal Skirata, were given Mandalorian names and all that stuff. For all intents and purposes they were Mandalorians who were just wearing clone uniforms and serving under the Republic. Anyway, after the dissolution of the Galactic Republic, there were a lot of these Mandalorians who happened to be clones who left the service of the Empire and returned home to Mandalore. \n\nIn the current canon, I don't think they've ever acknowledged that side of their identity (which sucks because it would've been interesting when the Siege of Mandalore happened). But I'm hoping that it would be or I'm hoping that they'd return even some of the old Mandalorian clone characters such as Commander Fordo who was such a badass in the 2003 Clone Wars cartoon.","upvote_ratio":0.4,"created_utc":1678586553.0},{"title":"At this point, Dooku probably should have realized Sidious wasn't the ideal master.","author":"Jr9065","url":"https:\/\/v.redd.it\/22cdn0t2h1na1","text":"","upvote_ratio":0.88,"created_utc":1678509600.0},{"title":"Here’s a quote","author":"Soft-Hamster-4525","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p1wj9\/heres_a_quote\/","text":"“Like you said, only the strongest shall rule”","upvote_ratio":0.66,"created_utc":1678585852.0},{"title":"Was anyone reminded of Dr. Demagol when looking at the cyborg creature from SE3EP2 of the Mandalorian?","author":"e_faulkk05","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p8oh3\/was_anyone_reminded_of_dr_demagol_when_looking_at\/","text":"After watching some breakdowns about Chapter 18 on YouTube alot of things occurred to me. Demagol and this 'unidentified cyborg' share alot in common \n\n1. There practices for experiments\/torture are very similar. In that they are both highly invasive and lickey to result in either death or permanent mental or physical harm. As seen by Darth Malak, respective to Demagol. And Din Djarin's possible fate with this creature.\n\n2. They are both mandalorian or have affiliation to mandalore. Dr. Demagol was a mandalorian scientist and doctor near the times of the Mandalorian War. This creature resides on the glassed planet and aftermath of the Great Mandalorian Purge. Both have affiliation to war and mass destruction.\n\n3. This creature clearly has a pension for blood and screams. Both Demagol and this creature have very psychopathic and apathetic tendencies when it comes to people. Not letting up or showing any form of mercy.\n\n4. The tools and apparatuses used by both are similar in a lot of regards. This point rides alot of the same ideas as No.1. Both have varying degrees of a torture table, an element in which to torture their victims with. Demegol electroshock, and this creature had heat elements. While Demagol used radiation on Darth Malak, this creature siphoned the blood out of Din Djarin's body. \n\n5. These two beings have sort of the same thing going on with their armor, or in the case of the creature, it's entire body. Both are very obtuse and unorganized. Opting for a more ravaged and manic appearance for their armor or body. Both have pipes running down their bodies. The cyborg creature likely uses the metal or fallen mandalorian's armor as a method of customization too. \n\nThat is all I have for their similarities and why I think that this could have been an ever so subtle reference or cue to Dr. Demagol from the old republic era. Great historic figures like Mandalore the Great have also been mentioned too. Am I alone in my thoughts let me know below.","upvote_ratio":0.36,"created_utc":1678606889.0},{"title":"Bo-Katan's hairband","author":"ketsugi","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p13da\/bokatans_hairband\/","text":"Is it ever explained what Bo-Katan's hairband actually is? Is it literally just a fashion accessory, or something to keep her hair in place under her helmet? Or do the lights on it indicate that it's a piece of tech?","upvote_ratio":0.44,"created_utc":1678583564.0},{"title":"Lone wolf and cub….","author":"ManBatman121","url":"https:\/\/i.redd.it\/6ukqmug4n2na1.jpg","text":"","upvote_ratio":0.88,"created_utc":1678505667.0},{"title":"Making Mando helmet","author":"_Levkin_","url":"https:\/\/v.redd.it\/coh6v16vm0na1","text":"","upvote_ratio":0.92,"created_utc":1678481469.0},{"title":"Kenobi show","author":"Zanny73","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11pa5iv\/kenobi_show\/","text":"One thing I just realized is that in the Kenobi show Leia ofc is known to be associated with Obi-Wan. Wouldn’t there be like a criminal record of some kind in the empire for them to know that. If there is some record of them working together she couldn’t have become a senator and they would also have her as suspect for conspiracy or treason against the empire, and her parents. And if they don’t have a criminal record of some kind it is stupid. So what do you think? Is there something I missed?","upvote_ratio":0.35,"created_utc":1678612619.0},{"title":"Got this today, I wonder if there is a RoTJ Jedi Knight Luke one 🤔","author":"DeathForever3","url":"https:\/\/i.redd.it\/6cdk83qit8na1.jpg","text":"","upvote_ratio":0.6,"created_utc":1678580463.0},{"title":"After literally “blowing it” all those years ago, he’s finally getting his chance.","author":"phanon1666","url":"https:\/\/www.reddit.com\/gallery\/11n9krv","text":"","upvote_ratio":0.98,"created_utc":1678409244.0},{"title":"Jedi Battle Scars - Cal and Cere","author":"Super_Jane17","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11omedn\/jedi_battle_scars_cal_and_cere\/","text":"So I’ve noticed this whilst reading Battle Scars. It’s very clear that Cal and Cere are from two different generations of Jedi and why they are different is why the Order fell. \n\nCere was trained to be a keeper of the peace. She had the “normal” training of a Jedi. Whereas Cal was a Padawan during the Clone Wars. Instead of training to be a peace keeper, he was trained to be a commander and fight in battles. \n\nThis is very clear in the books as Cal and Cere both want different things and I think it does have something to do with their Padawan training.","upvote_ratio":0.64,"created_utc":1678547163.0},{"title":"my workplace still has a mint Star Wars Pepsi machine from 99'","author":"Notalabel_4566","url":"https:\/\/i.redd.it\/hfudsqijr1na1.jpg","text":"","upvote_ratio":0.8,"created_utc":1678508886.0},{"title":"Darh Noctyss appreciation post","author":"Odd_Bean-_-","url":"https:\/\/i.redd.it\/c4aiq62hh1na1.jpg","text":"Love her lightsaber","upvote_ratio":0.89,"created_utc":1678491661.0},{"title":"A star wars battelship movie","author":"astroSubway","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oorre\/a_star_wars_battelship_movie\/","text":"We have gotten a lot of media that’s in the transition period between the republic and the empire. And i love that but it would be cool to see something where they are on more equal footing. A movie i think would be cool if they made would be a battleship movie. It could be about an MC80 that has taken damage to its hyperdrive so they can’t travel far, and are getting hunted down by an imperial task force. We could see the MC80 raiding imperial supply depots and causing trouble for the imperial supply lines. It could be the Star Wars version of the movie Masters and Commanders. And take inspiration from WW1 with Von Spees east Asia squadron where they raided for supplies behind the front line.","upvote_ratio":0.71,"created_utc":1678553229.0},{"title":"Unpopular opinion, but having seen the original movies when they were new, they're still the only SW things I love. I've seen 99% of the film and TV, but I just don't love ANYTHING else. (R1 & Andor were ok). Am I the only one who watches everything but only loves the original trilogy?","author":"NoYoureACatLady","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p2q3r\/unpopular_opinion_but_having_seen_the_original\/","text":"","upvote_ratio":0.47,"created_utc":1678588164.0},{"title":"I made a Super tiny X-wing Diorama, what do you think?!","author":"aart112","url":"https:\/\/www.youtube.com\/watch?v=wyKHVDfNehA","text":"","upvote_ratio":0.56,"created_utc":1678574260.0},{"title":"MANDALORIAN Chapter 18 RECAP","author":"Midway-4301","url":"https:\/\/youtu.be\/1GBsQ92ZeDM","text":"","upvote_ratio":0.4,"created_utc":1678587100.0},{"title":"Finally getting my stuff put up after moving!","author":"Sineater224","url":"https:\/\/www.reddit.com\/gallery\/11o0blx","text":"","upvote_ratio":0.95,"created_utc":1678481109.0},{"title":"Did the Father know he was going to die, or was his death not according to plan?","author":"Nicolas-matteo","url":"https:\/\/i.redd.it\/l6ttmrf4w1na1.jpg","text":"","upvote_ratio":0.89,"created_utc":1678496586.0},{"title":"I'm looking to make a SW quiz for work. Any sneaky questions I could put in?","author":"IReallyLoveNifflers","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ow22g\/im_looking_to_make_a_sw_quiz_for_work_any_sneaky\/","text":"","upvote_ratio":0.56,"created_utc":1678571089.0},{"title":"Has there ever been major uproar about this scene in episode 1?","author":"Atalkingpizzabox","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ovc23\/has_there_ever_been_major_uproar_about_this_scene\/","text":"These days a lot of hate towards SW is the sequels, I however hate none of the movies I love them all. However there is one scene in episode 1, which used to be the most disliked SW movie, which I'm surprised I've never heard much about. It's the part where the eopie farts on Jar Jar. \n\nI know everyone hates him (though I don't as I watched episode 1 as a young kid) but like I would expect this particular scene to be far more notorious and stand out from others with him as I know fans would find it horrendous to include this sort of thing in canon. Even I agree its terrible even though as a kid I found it funny. On vhs I remember the scene being quite short but I've seen the extended version and I guess they cut it out for a good reason. And why did George Lucas include this scene? It's almost like he was trying to punish Jar Jar.","upvote_ratio":0.5,"created_utc":1678569314.0},{"title":"My favourite little war criminal 🧡","author":"joueur_Uno","url":"https:\/\/i.redd.it\/op7qg6bxstma1.gif","text":"","upvote_ratio":0.98,"created_utc":1678416723.0},{"title":"SW VIN collection Millennium Falcon 3D Diagram","author":"llompy","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ouke1\/sw_vin_collection_millennium_falcon_3d_diagram\/","text":"Where can I get the 3D plans for the star wars vintage collection millennium falcon smugglers run? I would like to create a 3d printed escape pod that was part of the Lando millennium falcon that could be attatched to this version.","upvote_ratio":0.4,"created_utc":1678567428.0},{"title":"Could be totally wrong but I think she is a clone","author":"YourBoyJakey","url":"https:\/\/i.redd.it\/phe6b5adxyma1.jpg","text":"","upvote_ratio":0.85,"created_utc":1678460685.0},{"title":"a star wars ARG that's kind of like Pokemon GO","author":"Master_Trimdir","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ou63p\/a_star_wars_arg_thats_kind_of_like_pokemon_go\/","text":"Just as the title suggests, I feel like their should be a Pokemon GO style Star Wars game","upvote_ratio":0.5,"created_utc":1678566442.0},{"title":"How do pilots not get concussions when stopping hyperspace?","author":"manychins5","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11otz2g\/how_do_pilots_not_get_concussions_when_stopping\/","text":"Hi, I’m new to the sub, and have a question about hyperspace and light speed. How do pilots and travelers, not get concussed when stopping hyperspace?! They are going from the speed of light, to 0mph almost instantaneously. Feel free to scroll past.","upvote_ratio":0.6,"created_utc":1678565965.0},{"title":"Star Wars science question","author":"theZoid42","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p2ac8\/star_wars_science_question\/","text":"Reading the Timothy Zahn book “Outbound Flight”.  Spoilers ahead..\n\nWhen Thrawn is first up against the Trade Federation ships, he decides to jam all possible transmissions to get around the “unjammable” Trade Federation signal, like the whole light spectrum?","upvote_ratio":0.29,"created_utc":1678586930.0},{"title":"Can lightsabers overheat and explode?","author":"Claude_AlGhul","url":"https:\/\/i.redd.it\/ndtu2q6251na1.png","text":"","upvote_ratio":0.78,"created_utc":1678505563.0},{"title":"Younger Christopher Lee vs younger Dooku","author":"Dega704","url":"https:\/\/i.redd.it\/6vitfgig0rma1.png","text":"","upvote_ratio":0.96,"created_utc":1678382893.0},{"title":"bo katan short!!","author":"Midway-4301","url":"https:\/\/youtube.com\/shorts\/82YUOWmKKNM?feature=share","text":"","upvote_ratio":0.6,"created_utc":1678562868.0},{"title":"A sketch of Grogu that I did today :)","author":"redbear18","url":"https:\/\/www.reddit.com\/gallery\/11o3l66","text":"","upvote_ratio":0.86,"created_utc":1678488947.0},{"title":"has there ever been a major Human character from Coruscant in either Legends or Canon?","author":"King_Kenobi","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ogsjl\/has_there_ever_been_a_major_human_character_from\/","text":"it's the planet with the highest population, it's the homeworld of humanity, and it's the capital of the galaxy, yet the only major human character from Coruscant is Qui-Gon in Disney canon, and in Legends he was from an unknown planet. Luke and Anakin are from Tatooine, Padme and Palpatine are from Naboo, Obi-Wan is from Stewjon, Dooku is from Serenno, Leia is from Alderaan, Han is from Corellia, Lando is from Socorro, Rey is from Jakku and Ben Solo was raised on Ossus. only one major human character that i know of has Coruscant as their homeworld","upvote_ratio":0.67,"created_utc":1678530366.0},{"title":"Cool Usernames","author":"ComplexChimp","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p2wvn\/cool_usernames\/","text":"Hey guys, I've been brainstorming quite a while for a new and catchy username, but I'm not able to find one..any ideas?   \nI would like it to be \"dark and mystical\"…but at this point ill take anything =)  \n\n\nThanks!","upvote_ratio":0.14,"created_utc":1678588664.0},{"title":"What is the Character you hate the most and the one you love the most in whole Star Wars?","author":"Klogott9","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p00bz\/what_is_the_character_you_hate_the_most_and_the\/","text":"","upvote_ratio":0.42,"created_utc":1678580706.0},{"title":"Explaining how Clone Troopers would develop different personalities.","author":"Knalxz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p1j77\/explaining_how_clone_troopers_would_develop\/","text":"The first and easiest is just mutations in their cloning pod. Maybe one got a little too much oxygen while in their little bauble and grew up differently, either commended for their differences like the Bad Batch or ended up like 99 who IMO it was kind of an insult for the Kominoains to make him a janitor while watching his brothers go on to become the soldier he was bred to be. I mean, he was clearly tactically sound, make the guy an officer or something...anyways.\n\nThe second is difference in overseers. Jango and his pals raised the clones as well as many Kaminoains. These people obviously couldn't spend ever second with every clone and as we saw from the clones interactions with the Jedi, they'd often start showing the traits of their Jedi leaders or directly contrast them because Clones often didn't vibe well with their Jedi. (Anakin and Rex is actually extremely rare relationship.) Come to think of it, this might of been done on purpose by SHEEV so the clones would have an easier time committing to Order 66 and of course Palpatine would want Anakin to like his CT Officer.\n\n3 is my favorite, which is situation. Let's say Jango Fett hates being last in line so Clones would often rush to be first in line but Clone A gets to the line first because his room is closer to where the line starts so he just gets there faster then Clone B. Clone B, knowing he's going to be later then clone A constantly prepares to be ahead of time so he can beat clone A. A and B often try to one up each other trying to be first in line so they grow into competitive clones while Clone C in the line knows that his room is too far to even try to compete with these two but he has to be in line behind them so he becomes more contempt with his assured position in line. He grows up seeing competition as being kind of pointless if you can't do anything about your position. Then there's Clone D. Clone D is so far back in line, that he never even sees A, B or C so he thinks \"I'm never going to be first so I might as well never even show up to the line in the first place.\" D doesn't even show up to the line, goes to his room and plays Pazaak for hours often forgetting to even go to the line because he's having so much fun playing Pazaak that he is often very late, and is looked down on because of it, so he grows up to resent preset roles and kind of just wants to have fun. Then there's clone E. E is at the back on the line with D and he can atleast see Clone C but since he constantly watches D not even show up to the line, Clone E berates D and often has to deal with his BS because he wants D to show up but D doesn't see a point to it all. E often gets his trouble because he's trying to look out for D and him seeing D not care jades him. Clone E grows up thinking how important roles are and hates slackers.\n\nFourth and final one is age. Clones do have older and younger brothers. The way Jango would interact with older and younger siblings would be reflected in all of the clones all of the time. Now take into consideration the different types of clones who could come about from the situations above, and now put them as the elder or younger sibling in a relationship and how they'd react to their siblings faced with whatever happened above. So let's say a clone with positive mutations, had terrible overseers that he actively works against and was clone C in the line had a little brother who has no mutations, is directly trained by Jango himself and is clone D in the line order. If the younger just randomly bumped into the elder, the interactions between these two would be drastically different than other types of combinations that could come from what is listed above.\n\nSo to put it simply, clones have as much diversity as normal people. They certainly have less time in the galaxy to develop and live very strict lives but them being the same but unique is equal to any human.","upvote_ratio":0.25,"created_utc":1678584799.0},{"title":"Quick sketch of Grogu! What do people think about Season 3 so far?","author":"Tom_Romain","url":"https:\/\/i.redd.it\/2rnhba9kmzma1.png","text":"","upvote_ratio":0.85,"created_utc":1678487255.0},{"title":"Like Master, Like Padawan","author":"Ezrabine1","url":"https:\/\/www.reddit.com\/gallery\/11nrrpk","text":"","upvote_ratio":0.94,"created_utc":1678461259.0},{"title":"BANJO DUBSTEP. STAR WARS. BABY YODA... This is the way","author":"twistedfister_","url":"https:\/\/v.redd.it\/doporqfztzma1","text":"","upvote_ratio":0.75,"created_utc":1678489771.0},{"title":"After six consecutive canon books, time for me to get back to some legends content","author":"Jr9065","url":"https:\/\/i.redd.it\/e8m4b09kf0na1.jpg","text":"","upvote_ratio":0.87,"created_utc":1678496948.0},{"title":"I'm getting this clone helmet autographed by Dee Bradley Baker next week. what quote would you have him add to it?","author":"landon1397","url":"https:\/\/i.redd.it\/gn5yczji2tma1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678407803.0},{"title":"Do we think that Rampart killed Cody, or did he really go AWOL?","author":"LondonC66","url":"https:\/\/i.redd.it\/iajwk1falvma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678420302.0},{"title":"Mando poster edit cause i was bored","author":"MrChimmiChanga","url":"https:\/\/i.redd.it\/dobakad6dxma1.jpg","text":"","upvote_ratio":0.95,"created_utc":1678459911.0},{"title":"Is the light side or dark side stronger?","author":"Damn_Man1954","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11p54zz\/is_the_light_side_or_dark_side_stronger\/","text":"","upvote_ratio":0.27,"created_utc":1678595135.0},{"title":"Billy Ackbar and his band play their biggest hit!","author":"Galactic_Rep","url":"https:\/\/v.redd.it\/u2obazad12na1","text":"","upvote_ratio":0.78,"created_utc":1678498857.0},{"title":"Mando S3 E2","author":"Dfrickster87","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nyn00\/mando_s3_e2\/","text":"Did anyone else notice that Din was the \"Damsel in distress\" as Bo came to save him? \n\n\nLol, I love this show.","upvote_ratio":0.78,"created_utc":1678477177.0},{"title":"It's a bit rough around the edges, but I'd give it an 8 out of 10. What's your rating? {Matt Lanter - Anakin Skywalker}","author":"SMmania","url":"https:\/\/v.redd.it\/hjtrio7sk0na1","text":"","upvote_ratio":0.68,"created_utc":1678498733.0},{"title":"What did you think the Clone Wars were before the prequels came out (assuming you watched the OT first)?","author":"Bootlebat","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ompyl\/what_did_you_think_the_clone_wars_were_before_the\/","text":"I thought they involved some mad scientist or something killing people and replacing them with evil clones (think something like Invasion Of The Body Snatchers). I also thought they were a separate event unrelated to the Jedi purge and the rise of the Empire","upvote_ratio":0.5,"created_utc":1678548001.0},{"title":"Was order 66 permanent?","author":"Jlangley414","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ohoa8\/was_order_66_permanent\/","text":"Specifically relating to the Bad Batch, was the reprogramming of order 66 permanent or was it conditional? We see in the first few episodes, the clones behave very robotically immediately following the end of the war. But as time goes on, they regain their personalities and seem like they become more independent again. Citing the episodes on Ryloth, it doesnt seem like the clones were fully happy about being part of the empire and some are going against their programming. Could this be foreshadowing and possibly provide a better reason why the clones were phased out?","upvote_ratio":0.6,"created_utc":1678533526.0},{"title":"I had an idea for a story","author":"GrimBoah","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ouw0c\/i_had_an_idea_for_a_story\/","text":"So maybe my idea is not the most original but I had the idea of the story following a Sith warrior\/lord or whatever and them actually being much more morally good than other Sith and him trying to break the current With Empire and turn it into smth better\/stronger (obv they wouldn't be a \"good person\" as growing up in such an environment will not make you a very kind person but they still care about the Empire that they see how corrupt and broken it is)\n\nAnd yes this concept is heavily inspired by the light-side Sith Warrior from The Old Republic","upvote_ratio":0.2,"created_utc":1678568236.0},{"title":"Hondo","author":"distry100","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o5hpg\/hondo\/","text":"So I’ve been watching the clone wars for the first time and I’m on season 5 and I just wanted to say how good hondos character is. Definitely one of my top 10 across the whole of Star Wars.","upvote_ratio":0.77,"created_utc":1678493748.0},{"title":"Finished The Clone Wars Season 5 and I’m left wondering if Asajj Ventress was ever pardoned for her crimes as promised by Ashoka?","author":"WaffleHousesNewHost","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11orazg\/finished_the_clone_wars_season_5_and_im_left\/","text":"","upvote_ratio":0.38,"created_utc":1678559498.0},{"title":"Can anyone explain a scene in AOTC for me?","author":"Semenetta","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11or2v3\/can_anyone_explain_a_scene_in_aotc_for_me\/","text":"I have a question about a scene in Attack of the Clones. So when the assassin probe drops off the killer centipedes, Anakin, Obi-Wan and R2 come into the room, kill the centipedes. After this, OBI-WAN jumps through the window to catch the flying droid. \n\nWhich, like, fine, it's all a little silly that its killer centipedes and whatnot, but why was it Obi-Wan that jumped out of the window? Wouldn't it be way, way, way more in character for Anakin to have done that? Obi-Wan didn't even really want to be there, says something along the lines of \"we're just bodyguards, we're not here to start an investigation,\" hated when Anakin jumped out of the speeder like 2 minutes later and said \"I hate it when he does that,\" implying Anakin recklessly jumping out of things happens frequently enough. And wouldn't Anakin be more willing to do crazy stuff to protect or avenge padme? But nope, it's Obi-Wan that goes and essentially starts an investigation by falling to his potential death.\n\nWatched the movie recently and could NOT think of really a single reason why Anakin wasn't the one to jump out of the window, it just seems so wildly out of character for both of them. Has Lucas or Ewan McGregor or anyone who worked on the movie ever explained this in an interview or something? Or is just AotC being AotC? I'd be curious to know the decision-making process behind this one...","upvote_ratio":0.33,"created_utc":1678558941.0},{"title":"Pottery.","author":"chakkoffthemap","url":"https:\/\/i.redd.it\/nmlj5f090yma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678449552.0},{"title":"We sing Dee Bradley Baker a lot of praises…but Disney+ reveals in every language, there is a voice actor who dubs over all the clones and I think they aren’t celebrated enough","author":"raittarian","url":"https:\/\/i.redd.it\/fx99lm2m7vma1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678415705.0},{"title":"In sw rebels, when maul wanted them to stay and said \"I cannot defeat Vader alone\" and \"we\", was he trying to get Ahsoka and Kanan to help him fight and defeat Vader but Kanan didn't believe him BC he used to be a sith?","author":"Automatic_Ad_4454","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o9i7d\/in_sw_rebels_when_maul_wanted_them_to_stay_and\/","text":"","upvote_ratio":0.83,"created_utc":1678505245.0},{"title":"Made a two sided pendant from maple","author":"Roscoe-33","url":"https:\/\/www.reddit.com\/gallery\/11ntfe9","text":"","upvote_ratio":0.9,"created_utc":1678465109.0},{"title":"TIL: Padmé tried to kill C-3PO","author":"RandomNPC1337","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ozfg3\/til_padmé_tried_to_kill_c3po\/","text":"Just like in the title, today I learned Padmé during a search for Master Yoda once sent C-3PO to a Separatist droid firing squad to be murdered and when that failed she threw a grenade at him.","upvote_ratio":0.1,"created_utc":1678579245.0},{"title":"Is the Millenium Falcon Waterproof or Just Water Resistant?","author":"Unisterra","url":"https:\/\/i.redd.it\/khrz4r40v2na1.jpg","text":"","upvote_ratio":0.67,"created_utc":1678508319.0},{"title":"This is AMAZING","author":"SingerAncient7967","url":"https:\/\/youtube.com\/shorts\/AO8ZZCq78uo?feature=share","text":"","upvote_ratio":0.14,"created_utc":1678571162.0},{"title":"The bad batch season 2 should’ve had crosshair as the protagonist","author":"Fickle_Switch_5581","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11otg22\/the_bad_batch_season_2_shouldve_had_crosshair_as\/","text":"","upvote_ratio":0.2,"created_utc":1678564682.0},{"title":"This movie would've never flopped if this song was used in the trailer","author":"ChewyOnTheInside","url":"https:\/\/www.youtube.com\/watch?v=oM_WvP4bVKs","text":"","upvote_ratio":0.72,"created_utc":1678501585.0},{"title":"What is your favorite moment in all Star Wars media?","author":"Backpacks_Got_Jets","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nvzvq\/what_is_your_favorite_moment_in_all_star_wars\/","text":"Ever since I was a little kid, the single moment that was always the most powerful for me and still gives me goosebumps:\n\n*TOSSES SABER ASIDE\n\n[You've failed your highness... I am a Jedi.  Like my father before me](https:\/\/youtu.be\/PqaiKmm8gsY?t=31)\n\nSo be it.  *Jedi*.\n\nThe contempt Palpatine has for the word is awesome.  \n\nThe moment that Luke truly defined himself as a Jedi.\n\nBest moment in Star Wars\n\nFight me","upvote_ratio":0.88,"created_utc":1678471105.0},{"title":"Batteries in Star wars?","author":"Jlangley414","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ohs6s\/batteries_in_star_wars\/","text":"Relating to the many armors of Star wars: from clone trooper to average run of the mill armor, alot of armors have powered features. A Heads Up Display, sometimes  lights, or life saving equipment. And even the Big Bad himself, Darth Vader relies on his suit to keep alive. So where are the batteries?","upvote_ratio":0.33,"created_utc":1678533881.0},{"title":"could s7 of CW would of have Delta Squad then Bad Batch","author":"Best-Neighborhood784","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ovypg\/could_s7_of_cw_would_of_have_delta_squad_then_bad\/","text":"I was watching the Bad Batch along season 7.I have a thought, what would have been if Disney didn't bought Star Wars, do you guys think Delta could've been in season 7 and not replaced by the Bad Batch. What's your take.","upvote_ratio":0.1,"created_utc":1678570853.0},{"title":"What are your star wars OC’s?","author":"HarmonyTheConfuzzled","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11op3yp\/what_are_your_star_wars_ocs\/","text":"Gimme a full rundown I’m curious. Also pls don’t be mean. Creativity should be celebrated.","upvote_ratio":0.4,"created_utc":1678554073.0},{"title":"What are some actors\/actresses you would like to see appear in Star Wars?","author":"howishowisguuut","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ot0ud\/what_are_some_actorsactresses_you_would_like_to\/","text":"I would looove to see Hunter Schafer.","upvote_ratio":0.25,"created_utc":1678563618.0},{"title":"Jedi and Sith together","author":"Doctor-_-Bacon","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11osgol\/jedi_and_sith_together\/","text":"So, sorry if this doesn’t fit on this subreddit, but my friend and I are having a debate about just how powerful Jedi and Sith are. The question is: if you took EVERY force user in Star Wars history (Dark and Light) and put them on a team together, is there any other team\/team of teams that could defeat them in a hypothetical battle?\nTo be clear, we’re talking Legends continuity, so God Luke and planet-eating Nihilus, just to make it more fun.","upvote_ratio":0.22,"created_utc":1678562263.0},{"title":"Does anyone else feel the Mandalorion and the Bad Batch are competing to put out the best episode each week?","author":"DimitriHavelock","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nxo3q\/does_anyone_else_feel_the_mandalorion_and_the_bad\/","text":"This week in particular, the Mandalorion has action, arc advancing plot points, and great pacing. Then the Bad Batch comes in with a relatively quiet, but highly emotive episode showing Crosshairs continued journey. His gradual realisation that the organisation, which has literally been his whole life, is abandoning him and his brothers is very powerful.","upvote_ratio":0.69,"created_utc":1678474923.0},{"title":"George Lucas reacts to Star Wars Episode 1 (Rought Cut Review)","author":"InterestingCake1","url":"https:\/\/www.youtube.com\/watch?v=aTn8sn3dZBk","text":"","upvote_ratio":0.73,"created_utc":1678480915.0},{"title":"Loth Wolf","author":"NamarGaming","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oj9b5\/loth_wolf\/","text":"I showed a friend the last season of Rebels for the first time and he was convinced he saw the Loth Wolf somewhere else, possibly Clone Was. Are there any similar animals that showed up before he might be mistaken them for?","upvote_ratio":0.33,"created_utc":1678538511.0},{"title":"mando season 3 ep2 question","author":"Difficult-Willow-829","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o8v1g\/mando_season_3_ep2_question\/","text":"Why in the hell is he traveling around looking for an IG part when he specifically tells Peli he has no room for a R5 astro Droid made to fit into his ship? She only fixes the problem by reinstalling the astro Droid port, so how was he thinking he'd get IG to mandolore?","upvote_ratio":0.78,"created_utc":1678503295.0},{"title":"Star Wars Dragon","author":"Unisterra","url":"https:\/\/i.redd.it\/cre9rekmvxma1.jpg","text":"","upvote_ratio":0.72,"created_utc":1678480223.0},{"title":"My recently approved 501st staff office costume","author":"agent-squirrel","url":"https:\/\/i.redd.it\/l2cj1urtusma1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678405231.0},{"title":"Hi guys.How many Star Wars movies have you seen in the theatre ?","author":"Key_Database9095","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oeeml\/hi_guyshow_many_star_wars_movies_have_you_seen_in\/","text":"For me , I have only seen Star Wars Episode 7 The Force Awakens in the theatre .","upvote_ratio":0.5,"created_utc":1678521795.0},{"title":"what's canon??","author":"millerabm18","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11omx9g\/whats_canon\/","text":"Are red kyber crystals bled or are they synthetic? \nAlso what's the deal with TOTJ doesn't it conflict directly with the ahsoka book?","upvote_ratio":0.25,"created_utc":1678548547.0},{"title":"Interesting fact, in Legends, IG-88 had a robo crush on Darth Vader","author":"cjnshrmpoby","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oe96r\/interesting_fact_in_legends_ig88_had_a_robo_crush\/","text":"After he was booted up, IG-88 revolted against his designers and copied himself into four other chassis of the same model.  He then went to a planet specializing in droid production and started a revolution, killing all the human personnel and initiating a plan to exterminate all organic life in the galaxy via a mass droid uprising.  However, when Darth Vader visited the planet, IG-88 became fascinated by how Vader was a fusion of man and machine and considered him the only life form worth sparing so Vader could rule alongside it.","upvote_ratio":0.57,"created_utc":1678521301.0},{"title":"Does anyone think baby yoda is a bit of a cashgrab?","author":"bluejeans90210","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oe5qo\/does_anyone_think_baby_yoda_is_a_bit_of_a_cashgrab\/","text":"Make him do unexpected things but otherwise like a cute kid.  I liked the dig at the simpsons when the star wars ranch had them referencing \"digital eyelash rendering\".","upvote_ratio":0.5,"created_utc":1678520958.0},{"title":"You've a time machine, and you can go back and have George Lucas make one tweak to any of the six films he made or one of the projects he oversaw. What do you have him do?","author":"RexBanner1886","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nw09k\/youve_a_time_machine_and_you_can_go_back_and_have\/","text":"I'd have him alter the wording of 'bring balance to the Force', and eliminate, once and for all, endless fan debate about it meaning the destruction of the Jedi and the Sith (it means, per Lucas himself, the destruction of the Sith).\n\nIt would also massively reduce the likelihood of future films, books, or shows making stupid noises about true enlightenment coming from the 'balance of light and dark within you' (as happened in Colin Trevorrow's 'Duel of the Fates' draft).\n\nOne problem is that 'Balance of the Force' does sound very zen and profound in a way that 'Destroy the Sith' or 'Save us from the dark side' does not. I'm not sure, exactly, what I would change the wording to. \n\n**Runner up:** I'd have them simply make - as Attack of the Clones *clearly,* in my opinion, intends - Sifo-Dyas a dead Jedi whose identity Dooku used to order the clones: not a Jedi whose plan Dooku and Sidious somehow hijacked.","upvote_ratio":0.71,"created_utc":1678471129.0},{"title":"Were there any characters that embraced both the dark side and light side of the force?","author":"yuessir","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11odqev\/were_there_any_characters_that_embraced_both_the\/","text":"","upvote_ratio":0.45,"created_utc":1678519404.0},{"title":"My dad made a metal x-wing!","author":"lucuzo54","url":"https:\/\/www.reddit.com\/gallery\/11ms2lo","text":"","upvote_ratio":0.99,"created_utc":1678368181.0},{"title":"I just can't wait!","author":"OfSunMoonEarth","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nxzfl\/i_just_cant_wait\/","text":"&#x200B;\n\n[It's so cool!](https:\/\/preview.redd.it\/gk6uotgdnyma1.png?width=1056&format=png&auto=webp&v=enabled&s=153028362a4eee0f3dea6e91aecdb52a4ee4a419)\n\nI finally saved up enough extra cash to get the Dark Saber, and I'm going nuts waiting for this to arrive! None of my friends are that into star wars but I don't care because I've wanted this since I saw it in the Mandalorian. I just love the Dark Saber so much and I'm so happy that I could finally afford one!\n\nI don't care if I'm the only star wars fan in the house.","upvote_ratio":0.72,"created_utc":1678475644.0},{"title":"*That* Plaque from the Latest Mando Episode, Brightened, Straightened, and Cropped","author":"tocard2","url":"https:\/\/i.imgur.com\/TR3NdZ7.png","text":"","upvote_ratio":0.98,"created_utc":1678388528.0},{"title":"I was doodling and couldn’t stop so i kept going","author":"Epik-Eko","url":"https:\/\/i.redd.it\/1qy9c3giqvma1.jpg","text":"","upvote_ratio":0.92,"created_utc":1678422058.0},{"title":"Star Wars Resistance","author":"Wilson_serenity10","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11od3e3\/star_wars_resistance\/","text":"Clone wars was great, Rebels wasn’t half bad, but Resistance sealed the deal for me feeling like they turned something great into cheap children’s entertainment fodder with no actual thought about the Star Wars franchise as a whole.  No continuity with the classic Star Wars vernacular ie: saying we’re sitting ducks instead of we’re sitting mynokcs, poor character development, little to no explanation with all the “stories for another time”, and doesn’t exactly instill an emotional connection.  What do you all think about it?  Everyone is entitled to their opinion and there’s no reason for argument against each other when maybe seeing things from a different point of view would be beneficial and I just want to get other opinions and discuss the material that contributes to these opinions.  I’m hoping we can all have civil understanding communication about this.","upvote_ratio":0.5,"created_utc":1678517124.0},{"title":"New Jedi Order","author":"nodog300","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ogne8\/new_jedi_order\/","text":"In a galaxy far, far away, the Galactic Empire had been defeated, and a new Republic had been established. Luke Skywalker, the last Jedi, had passed away peacefully, leaving behind a legacy of hope and courage. But the Force had other plans for the galaxy.\n\nRey, a young scavenger from Jakku, had discovered that she was strong in the Force. With the help of Chewbacca and the droids BB-8 and C-3PO, she had joined the Resistance and fought against the First Order, led by the evil Supreme Leader Snoke and his apprentice Kylo Ren.\n\nIn the final battle, Rey had faced Kylo Ren in a lightsaber duel, and had overcome him with her courage and determination. She had spared his life, hoping that he would turn away from the dark side of the Force.\n\nBut the victory had come at a great cost. Leia Organa, the leader of the Resistance, had sacrificed herself to destroy the First Order's flagship. Poe Dameron, the daring pilot, had lost his best friend Finn, who had given his life to protect the Resistance.\n\nWith the First Order defeated, Rey had traveled to the planet Ahch-To, where Luke Skywalker had lived in exile. There, she had found a hidden Jedi temple, and had begun to train a new generation of Jedi.\n\nAmong her students were Ben Solo, the redeemed Kylo Ren, who had renounced his old name and his allegiance to the First Order, and had vowed to make amends for his past mistakes. He had become Rey's most devoted student, and had mastered the ways of the Force with astonishing speed.\n\nBut the galaxy was not at peace. A new threat had emerged from the shadows, a dark cult called the Sith Eternal, who worshiped the memory of Emperor Palpatine, the former leader of the Galactic Empire. They had rebuilt the Death Star, and had planned to use it to destroy the new Republic and establish a new Sith Empire.\n\nRey and her students had received a distress call from the planet Exegol, where the Sith Eternal had built their fortress. They had traveled there in secret, hoping to stop the Sith's evil plan.\n\nBut they had walked into a trap. The Sith had captured Rey and her students, and had brought them before the resurrected Emperor Palpatine.\n\nPalpatine had revealed that he had created Rey, using his own Sith powers, and that she was his true heir. He had offered her the chance to join him and rule the galaxy together.\n\nRey had been tempted by the offer, but had refused it. She had declared that she was a Jedi, and that she would never join the dark side.\n\nThe Sith had unleashed their army of Sith troopers, and a fierce battle had ensued. Rey and her students had fought bravely, but they had been outnumbered and outmatched.\n\nJust when all seemed lost, a miracle had happened. The spirits of the old Jedi, including Luke Skywalker, Obi-Wan Kenobi, Yoda, and Anakin Skywalker, had appeared to Rey and her students, and had given them the strength to overcome the Sith.\n\nTogether, Rey and Ben Solo had faced Palpatine in a final duel. They had used all their skills and powers, and had defeated the Sith Lord once and for all.\n\nWith the Sith defeated, Rey and her students had returned to the galaxy, and had begun a new era of peace and prosperity. They had established the New Jedi Order, a group of guardians who would protect the galaxy from all threats, and who would uphold the legacy of the Jedi.\n\nAnd thus, the Force had been balanced once again, and the galaxy","upvote_ratio":0.33,"created_utc":1678529826.0},{"title":"My Star Wars Creation Book #1","author":"YuaxzqOnXbox","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ocgop\/my_star_wars_creation_book_1\/","text":"Hey everyone! Now I'm not sure if This is even Allowed but whatever.\n\nOver the span of days I've \"written\" 3 Books about my character. Now I know most of you will pull your hair out with the characters. But just give it a chance. It's my first time writing and I have nowhere else to post it. Now I've used Chatgpt so can I really take credit lol.\n\nNow also you realize I added Darth Vader at the end. well the problem is that I didn't include Darth Vader in Book 2. So kind of ignore the last part.\n\nI will be adding a new Book with this text everytime On Every Saturday. And if you see errors please let me know\n\nAnyways I hope you enjoy\n\n\n\n\n\nName: First Name:Wyatt. Last Name: Unknown\n\nSpecies: Human\n\nAge: 35\n\nAppearance: Wyatt has brown, slicked back hair and a distinctive line scar that runs down his left eye. He wears a menacing all-red mask with blood-print hands on the cheeks and black anti-lightsaber armor.\n\nBackground: Wyatt was born on the planet Vjun, into a powerful and influential family. He was trained in the ways of the dark side from a young age, and his natural talent and strength in the Force were quickly recognized. After Wyatt killed 100 Jedi in a single minute, he was granted the title of Sith Marauder.\n\nPersonality: Wyatt is determined and brave, with a ruthless streak that allows him to achieve his goals at any cost. He craves power and is determined to be one of the strongest entities in the galaxy, feared by all who oppose him. He is highly loyal to the dark side and believes that the strongest individuals should live, but he also believes in giving others a chance to learn and develop their own power.\n\nAbilities: Wyatt is known for his prowess in lightsaber combat, having mastered every fighting form available to him. He also has an almost scary connection to the Force, and is a peak human in terms of strength. Wyatt can be prone to losing control when he gets angry, but his power and determination make him a formidable opponent.\n\nRelationships: Wyatt has a close relationship with Darth Vader and Darth Revan, who recognized his potential and helped him develop his skills. He is highly respected by the dark side and has a large following of admirers.\n\nBeliefs: Wyatt has a fascination with Yoda and is almost angry at the fact that the Jedi Master hasn't turned to the dark side. He believes that the strongest entities should be the ones to survive, but he also has a strict code when it comes to killing, never targeting children.\n\n\nStory:\nBook 1 \nWyatt: The Rise of a Sith\n\nChapter 1: Birth on Vjun\n\nWyatt was born on the planet Vjun, a harsh and unforgiving world where power and strength were prized above all else. His family was among the wealthiest and most influential on the planet, and from a young age, Wyatt was groomed for greatness.\n\nAs the eldest son of his family, Wyatt was expected to carry on the family legacy and become a powerful leader in his own right. His father was a prominent politician and a skilled warrior, and his mother was a shrewd businesswoman with connections throughout the galaxy.\n\nFrom an early age, Wyatt showed signs of great strength and potential. He was fiercely competitive and driven to succeed, and his natural abilities with the Force set him apart from his peers. He was also a quick learner, absorbing new information and skills at an impressive pace.\n\nAs he grew older, Wyatt began to understand the importance of power and influence on Vjun. He saw firsthand the rivalries and feuds between the planet's most powerful families, and knew that he would need to be strong and cunning to survive in this world.\n\nDespite the pressures of his upbringing, Wyatt had a rebellious streak. He chafed under the strict rules and expectations of his family, and longed for something more. He dreamed of adventure and excitement beyond the confines of Vjun, and yearned to explore the galaxy and test his skills against the best and brightest.\n\nBut for now, he would have to bide his time and continue his training. He knew that his destiny lay in becoming a powerful Sith, and he was determined to do whatever it took to achieve that goal. \n\n\nChapter 2: Early Training\n\nWyatt’s early training in the ways of the Force began shortly after his fifth birthday. His father, who was a powerful Sith Lord, knew that his son had the potential to become a great warrior and leader. Thus, he arranged for Wyatt to be taken under the tutelage of a respected Sith teacher.\n\nWyatt was initially overwhelmed by the training, as he had never been exposed to the Force before. But he soon learned to harness his natural abilities and strength. His teachers were impressed by his ability to focus and his natural instincts for combat.\n\nThe young Sith learned quickly and soon became adept at basic Force techniques such as telekinesis, mind tricks, and Force push. He also showed a remarkable affinity for lightsaber combat, quickly mastering the basic forms.\n\nDespite his young age, Wyatt was incredibly determined and disciplined. He would often spend hours each day practicing and refining his skills. His teachers were impressed by his work ethic and dedication, and they began to see him as a potential star pupil.\n\nAs Wyatt progressed through his early training, he began to realize that he was different from the other students. He had a deeper connection to the Force, and he was able to tap into its power in ways that others could not. This realization both excited and frightened him, as he knew that his potential for greatness was immense.\n\nBut with the power of the Force came great responsibility, and Wyatt was keenly aware of this fact.\n\n\nChapter 3: Family Tensions\n\nWyatt had always been aware of the power struggles within his family. But as he grew older, those tensions became more pronounced, and he found himself caught in the middle of them.\n\nHis father, a powerful Sith Lord, was constantly at odds with his uncle, who was equally ambitious and cunning. They were always vying for more power, more influence, more control.\n\nWyatt tried his best to stay out of it, to focus on his training and his own path to becoming a Sith Lord. But it was difficult when he saw the way his father and uncle looked at each other, the way they spoke to each other, the way they fought over every little thing.\n\nOne day, when Wyatt was in his early teens, he overheard his father and uncle arguing about who should be in charge of a particular mission. His father insisted that he was better suited for the task, while his uncle argued that he had more experience and should be given the opportunity.\n\nWyatt listened intently, feeling a knot form in his stomach. He didn't like the way they were talking to each other, the way they seemed to be trying to one-up each other at every turn.\n\nFinally, he couldn't take it anymore. \"Why can't you two just work together?\" he blurted out, surprising both his father and his uncle.\n\nThey both turned to him, surprised by his outburst. \"What do you mean, boy?\" his father asked, his voice cold.\n\n\"I mean, why do you have to fight over every little thing? Can't you see that you're both on the same side? You both want power and control, right? So why not work together to get it?\"\n\nHis uncle chuckled, a sly smile spreading across his face. \"You're more clever than I thought, boy. Perhaps you should be the one in charge.\"\n\nWyatt felt a surge of pride at his uncle's words, but he knew better than to let it show. He still had a lot to learn, a lot of training and discipline to go through before he could even hope to be considered for a leadership role.\n\nBut the tension between his father and uncle didn't dissipate, and Wyatt knew that there would always be struggles and rivalries within his family.\n\n\nChapter 4: The Jedi Attack\n\nWyatt had always known that his family was powerful, but he had never truly understood the extent of their influence until the day the Jedi attacked.\n\nHe was only twelve years old at the time, but he could remember the events of that day like they had happened yesterday. He had been sitting in his father's study, watching as his father and uncles discussed politics and the state of the galaxy. His mother had been there too, her usual stern expression softened slightly as she watched her son play with a holopad on the floor.\n\nSuddenly, the room had been filled with the sound of blaster fire and the clash of lightsabers. Wyatt had looked up in confusion, only to see several hooded figures entering the room. They were Jedi, he realized with a start, their blue and green lightsabers illuminating the room in a kaleidoscope of colors.\n\nHis father had drawn his own lightsaber, a deep crimson color that Wyatt had always found mesmerizing. He had been a skilled warrior, trained in the ways of the dark side by his own father before him. But even he had been no match for the Jedi, who fought with a ferocity and skill that Wyatt had never seen before.\n\nWyatt's mother had pushed him towards the door, urging him to run and hide. But he couldn't tear his eyes away from the fight, watching in horror as his father was struck down by one of the Jedi. His uncles fought bravely, but they too were eventually overcome by the Jedi's superior numbers.\n\nWyatt knew then and there that he would never forgive the Jedi for what they had done. His father had been everything to him, his mentor and his guide. He had taught him how to harness his powers, how to channel his anger and use it to his advantage. And now he was gone, cut down by those who claimed to be defenders of the peace.\n\nAs the Jedi left, Wyatt's mother had gathered him in her arms, holding him close as he cried for his father. But even as she comforted him, he could feel a burning anger growing within him. He would make the Jedi pay for what they had done, he swore to himself. He would become stronger than any of them, and he would make them fear him.\n\n\"Mother,\" he said, his voice trembling with emotion. \"I want to learn how to fight like father did. I want to be strong, like him.\"\n\nHis mother had looked down at him, her eyes softening with a mixture of love and sadness. \"You will, my son,\" she said. \"But you must be patient. Your time will come.\"\n\n\nChapter 5: Revenge\n\nWyatt had never felt such burning anger before. The Jedi had taken everything from him - his father, his family's power, his sense of security. He knew he could never rest until he had exacted revenge upon them. And so, Wyatt began to take steps towards joining the Sith.\n\nHe knew it was a dangerous path, but he felt he had no other choice. The power he would gain from the dark side of the Force was the only way he could hope to avenge his father's death. He began to seek out other Sith, learning what he could from them and showing them what he was capable of.\n\nIt wasn't long before Wyatt was noticed by a powerful Sith Lord. The Lord saw potential in Wyatt and took him under his wing, teaching him the ways of the Sith. Wyatt's thirst for power and revenge made him an eager student, and he quickly became a formidable force to be reckoned with.\n\nAs he continued his training, Wyatt's anger and hatred towards the Jedi grew stronger. He began to focus all his energy towards becoming stronger and more powerful, with the ultimate goal of destroying the Jedi order.\n\nOne day, as he meditated in the darkness of his chambers, he heard a voice whispering to him. It was a voice of power and temptation, and it promised him even more power if he would only give himself fully to the dark side. Wyatt hesitated for only a moment before accepting the offer.\n\nHe emerged from his meditation a changed man, his eyes burning with the red glow of the dark side. He knew there was no turning back now, and that he would do whatever it took to achieve his ultimate goal of revenge. The Jedi would pay for what they had done to his family, and he would make sure they feared the name Wyatt.\n\n\nChapter 6: Mastering the Dark Side\n\nUnder the tutelage of the most powerful Sith masters in the galaxy, Wyatt honed his skills in the ways of the Dark Side. He became a master of the lightsaber, and his Force abilities grew more powerful by the day. He spent long hours training with his fellow Sith apprentices, learning new techniques and tactics, and sparring with one \n\nanother to test their abilities.\n\nWyatt's natural talent and determination impressed his teachers, and he quickly rose through the ranks of the Sith order. He relished the power that came with his new status, and eagerly embraced the darkest aspects of the Force. As he continued to push his limits and test the boundaries of his power, he discovered new depths of strength within himself that he had never thought possible.\n\nOne day, as Wyatt was sparring with a fellow Sith apprentice, he felt a surge of energy coursing through his body. He unleashed a powerful burst of dark energy, sending his opponent flying across the room. The other apprentices stopped their training and stared at him in awe.\n\n\"You are strong,\" one of his fellow apprentices said, bowing to him in respect. \"I have never seen anyone wield the Force like that before.\"\n\nWyatt grinned, relishing the praise. \"The Dark Side has given me power beyond my wildest dreams,\" he said. \"And I will continue to master it until there is no one left who can stand against me.\"\n\nAs he continued to train and grow stronger, Wyatt began to feel a sense of invincibility. He knew that he was destined for greatness, and that no one could stand in his way. His teachers warned him to be careful, to not let his arrogance blind him to the dangers of the Dark Side, but he paid them no heed. He was too consumed by his lust for power and his desire for revenge against the Jedi who had killed his father.\n\n\"I will not stop until the Jedi are all destroyed,\" he said to himself, as he continued his training. \"And I will do whatever it takes to make that happen.\"\n\n\nChapter 7: The Battle of Coruscant\n\nThe sky above Coruscant was filled with the deafening sounds of blaster fire and the hum of lightsabers. Wyatt stood among the ranks of the Sith, his eyes fixed on the enemy lines. The Jedi had been pushed back, but they were not going down without a fight.\n\nWyatt's heart pounded in his chest as he ignited his blood-red lightsaber. He had waited for this moment for so long, to finally face the Jedi in battle and prove himself to the Dark Lords of the Sith.\n\nThe two sides clashed, and the battle raged on for hours. Wyatt fought with a fierce determination, his lightsaber cutting through the air with deadly precision. He could feel the power of the Dark Side coursing through him, fueling his every move.\n\nAs the battle raged on, Wyatt found himself face-to-face with a Jedi Master. The two locked eyes, each sizing up the other. For a moment, the world around them seemed to fade away as they prepared to fight.\n\nThe Jedi made the first move, charging towards Wyatt with a swift strike. Wyatt countered, parrying the blow with ease. The two fighters clashed, their lightsabers creating a shower of sparks with each blow.\n\nThe battle was intense, and Wyatt could feel his strength starting to wane. But he refused to give up, pushing himself to the limit. The Jedi was strong, but Wyatt was determined to emerge victorious.\n\nIn the end, it was Wyatt who emerged triumphant, his lightsaber slicing through the Jedi's defenses and striking a fatal blow. The Jedi fell to the ground, defeated.\n\nAs the battle came to a close, Wyatt stood among the victorious Sith. He had proven himself to be a fearsome warrior, and his reputation among the Dark Lords of the Sith only grew.\n\n Chapter 8: The Seduction of Power\n\nWyatt stood atop a balcony overlooking the dark and twisted landscape of Korriban. He had come a long way since his childhood on Vjun, and he could feel the weight of his power resting on his shoulders.\n\n\"I can feel it,\" Wyatt said to his closest advisor, a fellow Sith Lord named Xander. \"I am destined for greatness.\"\n\nXander nodded slowly. \"Indeed, my Lord. But be careful not to let your ambition consume you. Power can be a seductive mistress.\"\n\nWyatt scoffed. \"I am not so weak as to be seduced by power. I control it, not the other way around.\"\n\nXander bowed his head. \"Of course, my Lord. But remember, the stronger you become, the more enemies you will make. The Jedi and the Republic will not stand idly by while the Sith rise to power.\"\n\nWyatt turned to face Xander, his eyes blazing with anger. \"Let them come. I am not afraid of the Jedi or the Republic. They will all bow before me.\"\n\nAs the days turned into weeks, Wyatt became more and more obsessed with gaining power. He would spend hours poring over ancient Sith texts, seeking any knowledge or technique that would make him stronger.\n\nHis fellow Sith Lords began to whisper that he was becoming too dangerous, too unpredictable. But Wyatt paid them no mind. He was on a mission to become the most powerful Sith in the galaxy, and he would let nothing stand in his way.\n\n\n\nChapter 9: The Betrayal \n\nAs Wyatt rose in the ranks of the Sith, he found himself becoming more powerful and influential. He relished in the fear he instilled in others, and reveled in the admiration and respect he received from his fellow Sith.\n\nBut as his power grew, so too did his paranoia. He began to suspect that there were those who coveted his position, and he constantly watched his back, always on the lookout for any sign of treachery.\n\nIt was during one of these moments of hyper-vigilance that Wyatt stumbled upon a plot to overthrow his mentor, Darth Vader. The revelation shook him to his core. He had been loyal to Vader for years, and the thought of turning against him was unfathomable.\n\nBut as he dug deeper, he found that the plot was real, and that some of his closest allies were involved. Wyatt knew that he had to act quickly if he wanted to save Vader, and himself.\n\nHe began to work in secret, gathering information and building alliances with those he knew he could trust. It was a delicate dance, and he had to be careful not to be discovered.\n\nFinally, the day of the coup arrived. Wyatt was ready, and he struck swiftly and decisively. In a matter of hours, he had eliminated the traitors and saved Vader's life.\n\nBut the victory was bittersweet. Wyatt realized that he could never fully trust anyone in the Sith Order, and that he would always be looking over his shoulder, waiting for the next betrayal. The knowledge weighed heavily on him, but he pushed it aside. He was determined to remain in power, no matter the cost.\n\n\nChapter 10: The New Sith Order \n\nAfter the events of the betrayal, Wyatt found himself in a state of turmoil. He had always been loyal to the Sith, but the recent events had shaken him to his core. He knew that he needed to make a decision about where his true loyalties lay.\n\nAs he sat alone in his chambers, contemplating his next move, a familiar voice interrupted his thoughts.\n\n\"Your hesitation does not go unnoticed, young one,\" said a deep, gravelly voice from behind him. Wyatt turned to see Darth Vader, his mentor and one of the most powerful Sith lords in the galaxy, standing in the doorway.\n\n\"Master,\" Wyatt said, rising to his feet and bowing. \"I...I have been struggling with my loyalty to the Sith.\"\n\n\"Explain,\" Vader said, his voice betraying no emotion.\n\nWyatt took a deep breath and began to speak. He told Vader about the betrayal he had uncovered and how it had shaken his faith in the Sith. But even as he spoke, he could feel the pull of the dark side, urging him to seek more power.\n\nVader listened silently, his expression unreadable. Finally, he spoke.\n\n\"You are not the first to face such a crisis of faith,\" he said. \"But know this, Wyatt. The Sith are not just a means to an end. They are a way of life. To betray them is to betray yourself.\"\n\nWyatt nodded, but he knew that his decision was not so simple. He could feel the power of the dark side calling to him, tempting him with promises of untold strength and influence.\n\n\"Master, I...I don't know if I can stay true to the Sith,\" he said, his voice shaking slightly. \"But I also know that I can't turn my back on the power that comes with it.\"\n\nVader regarded him for a moment, his eyes seemingly piercing through Wyatt's very soul. Then he spoke.\n\n\"The path of the dark side is not an easy one,\" he said. \"But if you are truly committed to it, then you must be willing to make sacrifices. You must be willing to do whatever it takes to achieve your goals.\"\n\nWyatt nodded, his mind made up. He knew what he had to do.\n\n\"Master, I am with you,\" he said, his voice firm. \"I will do whatever it takes to help you achieve your goals.\"\n\nVader nodded, a small smile playing at the corner of his mouth.\n\n\"Good,\" he said. \"Then we have much work to do.\"\n\nAnd with that, the two Sith lords left the chambers, ready to take on whatever challenges lay ahead.","upvote_ratio":0.67,"created_utc":1678514872.0},{"title":"Han Solo was the best part of force awakens","author":"ISimplyDontBeliveYou","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o7ola\/han_solo_was_the_best_part_of_force_awakens\/","text":"He has so many funny lines early on and then shit just gets dark. He goes from “what was the second one?” To getting killed by his son when you think they had reconciled. It’s honestly beautiful and sad and poor chewy.","upvote_ratio":0.57,"created_utc":1678499812.0},{"title":"Anyone know where this image originates from?","author":"MaximumSpidercide","url":"https:\/\/i.redd.it\/ur0v1fmswxma1.jpg","text":"","upvote_ratio":0.74,"created_utc":1678466409.0},{"title":"Katee Sackhoff appreciation post[Mandalorian s3 spoilers]","author":"hroafelme","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mrb5h\/katee_sackhoff_appreciation_postmandalorian_s3\/","text":"can we all just appreciate how badass Katee Sackhoff is and just hope for more darksaber fighting from her  \nlove you Starbuck <3\n\n&#x200B;\n\n[https:\\\/\\\/www.slashfilm.com\\\/1220428\\\/the-mandalorian-season-3-episode-2-proves-bo-katan-deserves-the-darksaber\\\/](https:\/\/preview.redd.it\/nxw5ii9xlpma1.jpg?width=780&format=pjpg&auto=webp&v=enabled&s=7d4406e1b1414bff916c2e10df40314818ae0518)","upvote_ratio":0.95,"created_utc":1678366038.0},{"title":"A good friend got me this rug, so I put it with my lego collection","author":"onipaa","url":"https:\/\/i.redd.it\/2giw9bbhuuma1.jpg","text":"","upvote_ratio":0.97,"created_utc":1678411297.0},{"title":"Still Raining in Batuu West","author":"Unisterra","url":"https:\/\/v.redd.it\/fck7idant2na1","text":"","upvote_ratio":0.5,"created_utc":1678508002.0},{"title":"My first Star Wars tattoo.","author":null,"url":"https:\/\/i.redd.it\/g3gwj6f4jyma1.jpg","text":"","upvote_ratio":0.55,"created_utc":1678455895.0},{"title":"I absolutely need a printed A3 poster of this image. It's the coolest poster I've ever seen. Where can I get an official version in good print quality?","author":"Fornocerous","url":"https:\/\/i.redd.it\/jqbuahy17wma1.jpg","text":"","upvote_ratio":0.78,"created_utc":1678445736.0},{"title":"Rise of Skywalker Discussion(Ben and Rey scene)","author":"tooter37","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o9fbf\/rise_of_skywalker_discussionben_and_rey_scene\/","text":"So the last Jedi came out, and I was thoroughly disappointed. Rise of Skywalker came out and I had expectations of a meme movie. A movie I would love to see for the preposterous narrative, “unexpected” twists, and just plain ridiculousness. I was not disappointed. With the scene of Rey and Ben kissing, with everything up until that point I enjoyed. How many just cringed at that moment. My girlfriend at the time loved it. I still, how many years later can’t get behind it. Anyone wanna tell me why it works?","upvote_ratio":0.5,"created_utc":1678504988.0},{"title":"Star Wars pro cosplayer and content creator responds to a comment","author":"Trietero","url":"https:\/\/v.redd.it\/riquqrfq1mma1","text":"","upvote_ratio":0.9,"created_utc":1678322774.0},{"title":"For those who haven't watched \"Rebels\" and might be wondering why a certain character in \"Mandalorian\" is having difficulty with a certain task...","author":"Educational-Tea-6572","url":"https:\/\/www.youtube.com\/watch?v=5XhIED5ON1U","text":"","upvote_ratio":0.91,"created_utc":1678419055.0},{"title":"Mando","author":"Huongsolo","url":"https:\/\/v.redd.it\/x4dxej294wma1","text":"","upvote_ratio":0.87,"created_utc":1678426715.0},{"title":"What’s in the ice?","author":"MegaCoreMagnetizer","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o061i\/whats_in_the_ice\/","text":"In the most recent Bad Batch episode, Mayday tells Crosshair that the vultures will be his doom if whatever’s “in the ice” doesn’t get him first. Was this a reference to the raiders, the harsh weather, a dark inside joke between the clones, or is there a creature out there we didn’t see?","upvote_ratio":0.67,"created_utc":1678480745.0},{"title":"Did theatergoers clap when Luke appeared in Empire Strikes Back?","author":"Danielnrg","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o7tu0\/did_theatergoers_clap_when_luke_appeared_in\/","text":"My dad always told me that when he saw Empire Strikes Back in theaters back in 1980, and Luke removed the mask over his face in the opening of the film, the audience cheered. \n\nCan anyone else who saw the film back when it first released corroborate this reaction? Was it widespread?","upvote_ratio":0.54,"created_utc":1678500213.0},{"title":"Star Wars Visual Trivia 2023 #20","author":"--TheForce--","url":"https:\/\/i.redd.it\/fpdf9vvyxxma1.jpg","text":"","upvote_ratio":0.65,"created_utc":1678466798.0},{"title":"Am I the only person who thinks Grogu is bringing down The Mandalorian","author":"PossessionCorrect829","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11orpcj\/am_i_the_only_person_who_thinks_grogu_is_bringing\/","text":"Idk why but I just find him so annoying and it always makes it harder to enjoy it when he’s on screen","upvote_ratio":0.34,"created_utc":1678560458.0},{"title":"Mando & Grogu","author":"BrickPanda82","url":"https:\/\/i.redd.it\/lyiuiulo6rma1.jpg","text":"","upvote_ratio":0.98,"created_utc":1678366964.0},{"title":"The 'Mine Dweller' from Chapter 18 and the Martians from 'The War of the Worlds'","author":"RexBanner1886","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nxdod\/the_mine_dweller_from_chapter_18_and_the_martians\/","text":"This could be a coincidence, but I think it's probably a deliberate, known influence. In H.G. Wells's 'The War of the Worlds', the Martians:\n\n\\- have evolved to a state in which they are '*practically mere brains'*\n\n\\- rely on different mechanical devices for movement and action, *'wearing different bodies according to their needs just as men wear different clothes or take a bicycle in a hurry'*\n\n\\- sustain themselves by draining the blood from other animals:  *'Strange as it may seem to a human being, all the complex apparatus of digestion, which makes up the bulk of our bodies, did not exist in the Martians. They were heads—merely heads. Entrails they had none. They did not eat, much less digest. Instead, they took the fresh, living blood of other creatures, and injected it into their own veins'* \n\nI personally hope the creature is never more thoroughly explained: I thought this was a terrific bit of sci-fi\/fantasy horror and that the things we can infer about it are probably more interesting left unexplained.\n\n* It's a mechanical genius\n* It was once fully 'alive', and had at least one other eye (its current eye is not symmetrical; it looks like a humanoid's left eye) \n* It lives somewhere that was (two?) decades before, essentially nuclear-bombed - something which would leave terrible injuries, and likely - depending on the Star Wars science used - some degree of radiation.","upvote_ratio":0.64,"created_utc":1678474271.0},{"title":"Looking for some comics","author":"damascusdalek","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oak7o\/looking_for_some_comics\/","text":"Does anybody happen to have a link or something to where I can read the maul comics? The one where talzin comes to save him. I know the broad overview of what's in them but I've decided to finally read them. any help would be appreciated, thanks in advance.","upvote_ratio":0.25,"created_utc":1678508588.0},{"title":"What if a Baby Huttlet was raised amongst the Mandalorians?","author":"Swagvikar","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nu02a\/what_if_a_baby_huttlet_was_raised_amongst_the\/","text":"Like how Grogu is in the care of Mando. I could imagine them turning into some jacked Hutt like Grakkus.","upvote_ratio":0.64,"created_utc":1678466426.0},{"title":"Just finished watching Obi Wan Kenobi, and it proved me right. He really is the greatest Jedi ever!","author":"Swordfish_Common","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nqn7u\/just_finished_watching_obi_wan_kenobi_and_it\/","text":"","upvote_ratio":0.6,"created_utc":1678458445.0},{"title":"Help !","author":"Solventless4life","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o57el\/help\/","text":"Hey everyone apologies if this isn’t the best place for this question ,was getting very nostalgic and I’m trying to find a Star Wars game I played on the original Xbox. I don’t remember the title but I will try and describe it as best as possible. All I really remember is a side game that I loved so much. It was a capture the flag type game with bases. You operated a ship\/vehicle of some kind and tried to capture the opponents bases. Remember playing it around the mid 2000’s I realize this is rather vague but I’d love to recreate some memories if anyone has some insight would love to hear suggestions.\nThanks so much !","upvote_ratio":0.5,"created_utc":1678493007.0},{"title":"Looking for a wall mount for my Vader Helmet?","author":"sam-sp","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o52td\/looking_for_a_wall_mount_for_my_vader_helmet\/","text":"I am theming my bonus room with some Star Wars accessories. I am planning on hanging a collection of buckets on the wall, mostly the Hasbro Black series. The standard motorcycle helmet brackets from Amazon will work for Mando, Boba Fett & Stormtrooper buckets, but the Vader one is much bigger because of the flare of its shape. Does anyone have suggestions as to a bracket they have used that works well with it?","upvote_ratio":0.5,"created_utc":1678492710.0},{"title":"Tales of A Jedi Season 2 hopes","author":"mainman105","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nvujf\/tales_of_a_jedi_season_2_hopes\/","text":"- Origin of Kenobi-Satine Love story\n-Captain Rex on Geonosis meeting his first Jedi General.\n-Jedi Knight Yoda \n-Palpatines fall to the dark side","upvote_ratio":0.67,"created_utc":1678470749.0},{"title":"Bad Batch is a lighthearted kids show","author":"digdeepbirdman","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mvhjz\/bad_batch_is_a_lighthearted_kids_show\/","text":"After watching the newest episode of the Mandalorian last night and then the latest of Bad Batch,  we were getting ready for bad when my wife (completely serious) said, \n\n“…next week can we watch Bad Batch first? I want to end on a more lighthearted note.”\n\nHad to laugh that I can’t decide which is the gunslinging bounty hunter space western and which is the fun-filled kid-friendly adventure series.","upvote_ratio":0.9,"created_utc":1678376723.0},{"title":"Which are ur favorite Sith and why? :)","author":"Odd_Bean-_-","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o4l52\/which_are_ur_favorite_sith_and_why\/","text":"Mine are\n\nDarth Sion the Lord of Pain\nAnd\nDarth Noctyss \n\nDarth Sion has achieved which all Lords\/Lady's of the sith want, immortality. He used the Force to hold his decaying body together and ressurect himself with it. The downaide to his immortality was his constant pain. In the end he gave up of ressurection after being shown compassion by the Jedi Exile, Meetra Surik, and admittimg that his existence in constant pain was not worth it. \n\nDarth Noctyss is a Sith we have only heard about from two books so far. She was one of the sith was was looking for immortality on exegol long before episode 1. She fell for a trap set up by Darh Senguis... She got her immortality but her body was twisted into a fraile deformed creature. \nShe wielded a lightsaber that looked like a hook or a syphe. Truly cool","upvote_ratio":0.5,"created_utc":1678491443.0},{"title":"Why couldn't the kaminoans make clones from the genetic material of the clones?","author":"Asi_Ender","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o9dbt\/why_couldnt_the_kaminoans_make_clones_from_the\/","text":"","upvote_ratio":0.33,"created_utc":1678504818.0},{"title":"Star Wars Jedi Fallen Order","author":"Whole_End_710","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nilr1\/star_wars_jedi_fallen_order\/","text":"I'm 26 y.o and this video game has single handedly gotten me into Star Wars so much. I want to explore the lore but I know there is SO MUCH that it can be a bit of a headache to take in so, is it worth it? It seems so fascinating I might give it a try. Darth Vader is incredible by the way. Haven't been living under a rock, just never had an interest until I gave this game a shot and wow I'm impressed. So much to learn and explore!","upvote_ratio":0.85,"created_utc":1678434458.0},{"title":"What are your thoughts on Star Wars Rebels?","author":"Ryoliz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o99fg\/what_are_your_thoughts_on_star_wars_rebels\/","text":"I am 2 episodes off from finishing it and have been enjoying it so far. I feel like when compared to clone wars, it is obviously a tremendous downgrade, but I feel like it holds its own as an alright Star Wars show. Here are the things I like and the gripes:\n\nLikes:\n\n- It explores deeper into the force in an interesting and unique way\n- It introduces fan favorites like Vader, Ahsoka, Palpatine, etc without overdoing (with hondo being an exception)\n- It adds more info to the lore of the beginnings of the rebellion\n- I really love Kanaan’s character. His backstory and how he is so deeply connected with the force, plus his blindness make him a really likeable character, although a questionable master.\n- The Maul arcs are pretty cool, plus his dialogue with obi-wan is a small but cool detail\n\nGripes:\n- The dialogue is often very bad and Disney-fied (but a lot of Star Wars dialogue is bad, no?)\n- Doesn’t do the best job of developing all of the main characters\n- it is pretty predictable every episode what will happen\n- Not enough lightsaber fights (I like shiny things what can I say)\n\nOverall, I give it a 6-7\/10 without seeing the last two episodes yet.\n\nWhat are your thoughts?","upvote_ratio":0.38,"created_utc":1678504491.0},{"title":"Star Wars Audio Experience Anyone?","author":"HuntersHope93","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o3uob\/star_wars_audio_experience_anyone\/","text":"Don't have the ability to do a poll so here goes nothing..\n\nWould you listen to and\/or donate to a Star Wars Audio Experience Series that had a full cast, original soundtrack, ambient sound and effects with the right story?","upvote_ratio":0.57,"created_utc":1678489581.0},{"title":"Art at the end of Mandolarian episodes","author":"AHumanIBelieve","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ny4dz\/art_at_the_end_of_mandolarian_episodes\/","text":"Basically I was wondering about the art shown during the credits sequence at the end of episodes of the Mandalorian. I have two questions:\n\nIs it concept art or is it made after the episode? \nAlso, can I buy prints of it? \n\nThanks in advance, \nAHumanIBelieve","upvote_ratio":0.71,"created_utc":1678475965.0},{"title":"In The Mandalorian Season 3, what was the point...","author":"TheOldStag","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mx4wv\/in_the_mandalorian_season_3_what_was_the_point\/","text":"... of Mando being so dead set on getting IG-11?\n\nThe first episode was centered around him being fixated on needing this specific droid to the point of being unreasonable. He is told by multiple characters that he'd be much better off with a different droid. He's told the memory drive is destroyed, and his response is to find a new memory drive? As if it would retain the memories of the old drive? He is so adamant that it be this specific droid.  \n\nThen in the next episode he immediately gets grifted by Peli into buying a crappy astro droid? Is there something I'm missing or was that just a dumb storyline?","upvote_ratio":0.88,"created_utc":1678380637.0},{"title":"This is the Whey (PTS 1 & 2)","author":"Velocirapper0311","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o8cmf\/this_is_the_whey_pts_1_2\/","text":"This is the Whey (PTS 1&2)\n\nThe Mandalorian received a new bounty from Greef Karga, this time it was for a former action movie star named Dolph Lundgren who had gone rogue and was wanted for multiple counts of theft and assault. He was last seen in an egg bar in a far-off planet called Viroth.\n\nMando arrived at the egg bar and found Dolph sitting at the counter, munching on a plate of eggs. The former actor was much bigger in person than he appeared on the screen. Mando had his hands on his blaster and approached him cautiously.\n\nDolph noticed Mando and smirked, \"Well, well, well, what do we have here?\"\n\nMando didn't reply and instead showed him the bounty puck. Dolph chuckled, \"I suppose it's time to get back to reality.\"\n\nAs Mando moved closer to apprehend Dolph, the actor grabbed a plate of eggs and threw them at him. Mando was momentarily stunned but quickly recovered and subdued Dolph with some protein bars he had on him.\n\nDolph was on the ground, panting. Mando towered over him and said, \"This is the whey.\"\n\nDolph groaned, \"Oh come on, that was terrible.\"\n\nMando chuckled and radioed Greef Karga that he had captured Dolph Lundgren. It was another successful bounty for the Mandalorian, but he couldn't help but think about that pun he just made.\n\nMando secured Dolph Lundgren with binders, and escorted him to the Razor Crest. He was not a big talker, but as they walked, Mando couldn't help but think of the irony of it all.\n\nYears ago, Lundgren was a world-famous action star, playing larger-than-life characters that took on armies of villains, and now, he was reduced to petty theft in a far-off planet, hiding in an egg bar.\n\nThe Mandalorian wondered what could have caused such a fall from grace. Maybe it was the pressure to maintain his physique, or the constant competition with other actors. Or maybe it was the realization that his fame and fortune were temporary, and that he would eventually fade away like all of the stars that came before him.\n\nDolph, for his part, remained silent throughout the trip back to Nevarro. He knew that his career was over, and that his only hope was to strike a deal with the authorities, and hope for a lighter sentence.\n\nAs the Razor Crest landed on the planet, Mando was greeted by Greef Karga and Cara Dune. They took Dolph into custody and Mando received his payment. He was about to leave when Greef asked him if he wanted to grab a drink.\n\nMando was hesitant at first. He had a reputation to maintain, and he knew that the less he interacted with the authorities, the better. But something about Greef's offer seemed genuine, and he found himself nodding.\n\nThey went to an egg bar in the city, and sat down at a table. Greef ordered a round of drinks, and they began to talk. They talked about the bounty, about the state of the galaxy, and about their lives.\n\nMando found himself opening up to Greef, telling him about his upbringing, his training as a Mandalorian, and his journey as a bounty hunter. He was surprised to find that Greef was a good listener, and that he could relate to some of his experiences.\n\nAs they finished their drinks and prepared to leave, Greef looked at Mando and said, \"You know, I never thought I would be friends with a Mandalorian.\"\n\nMando looked at him and said, \"This is the way.\"\n\nGreef smiled and nodded, \"This is the way.\"\n\nMando left the egg bar feeling oddly satisfied. He had completed another bounty, but more importantly, he had made a friend. And for a solitary man like him, that was a rare and valuable thing.","upvote_ratio":0.25,"created_utc":1678501743.0},{"title":"Just finished my SW short film! I’d mean the world to me if you’d check it out;","author":"DutchSpaceNerd","url":"https:\/\/youtube.com\/watch?v=hIoxmYxVgHc&feature=shares","text":"","upvote_ratio":0.69,"created_utc":1678460806.0},{"title":"Why is the Empire filled with evil and incompetent officers?","author":"Master_Megalomaniac","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o32dl\/why_is_the_empire_filled_with_evil_and\/","text":"Why is the Empire filled with evil and incompetent officers? In the latest Bad Batch episode, Crossfires kills his own commanding officer due to his cruelty. Tarkin blows up a planet, ensuring that people will hate the Empire even more. It seems like the Empire is sowing the seeds of its destruction. Is Palpatine so evil that he has no sense of pragmatism and he is intentionally putting people in charge who will be hated by the people of the galaxy? I guess the Empire is trying to combine the worse aspects of Nazi Germany and the British Empire, but these officers make the rebellion inevitable rather than a mere possibility.","upvote_ratio":0.45,"created_utc":1678487655.0},{"title":"Legends after episode 6.","author":"Orf34s","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o2plq\/legends_after_episode_6\/","text":"So I want to read the legends adaptation of what happens after episode 6 with mara jade darth caedus ben and all that stuff but im not sure what novels I have to read? Is it the Thrawn trilogy?","upvote_ratio":0.6,"created_utc":1678486810.0},{"title":"Shaak-Ti's Death","author":"NamarGaming","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o2a1t\/shaaktis_death\/","text":"In the current cannon, is there an official death? By Grievous or Anakin? Or did she survive order 66 like in the Force Unleashed?","upvote_ratio":0.6,"created_utc":1678485792.0},{"title":"Has anyone else considered that the reason Ties are so loud is for an intimidation tactic?","author":"Hot_Independent_1683","url":"https:\/\/i.redd.it\/1hhe2xnimqma1.png","text":"","upvote_ratio":0.93,"created_utc":1678360182.0},{"title":"Ursa Wren Live Action Fancast","author":"wornoutwoodchuck","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11obiao\/ursa_wren_live_action_fancast\/","text":"I just saw the news about Sandrine Holt playing Vanessa Fisk in the new Daredevil series, thought she would be perfect to play a live-action Ursa Wren (if she ever made it to live-action). Thoughts?\n\nhttps:\/\/preview.redd.it\/9uvqdt1an1na1.jpg?width=1600&format=pjpg&auto=webp&v=enabled&s=f6a2da21313dc52c011ed0175949a538f4e65219","upvote_ratio":0.25,"created_utc":1678511651.0},{"title":"Would you see Natalie Portman reprise her role as Padmé in a future TV show or movie?","author":"Obi-Cat","url":"https:\/\/i.redd.it\/cn8d8cp4elma1.jpg","text":"","upvote_ratio":0.86,"created_utc":1678314840.0},{"title":"Hello there! I was frustrated by the propaganda art using latin fonts so I made, remade, propaganda and advertising for it could be displayed in an inworld environements for your LARPG for exemple. Enjoy and share!","author":"Droid_K2SA","url":"https:\/\/www.reddit.com\/gallery\/11nmhj5","text":"","upvote_ratio":0.73,"created_utc":1678447411.0},{"title":"When will there be a Star Wars spinoff about Boga? He was a very compelling character.","author":"HiFromChicago","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o64fj\/when_will_there_be_a_star_wars_spinoff_about_boga\/","text":"","upvote_ratio":0.42,"created_utc":1678495437.0},{"title":"Saber blade","author":"CombatC1","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o5u0y\/saber_blade\/","text":"Anyone know where I can find a RGB lightsaber blade or battle blade compatible with Disney's lightsaber?\n(Love the Hilt,wish blade was a bit better)","upvote_ratio":0.38,"created_utc":1678494645.0},{"title":"What if:","author":"Soft-Hamster-4525","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11oel8h\/what_if\/","text":"Luke met Anakin","upvote_ratio":0.15,"created_utc":1678522457.0},{"title":"Watching StarWars","author":"AgentSoReNa","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o9eyq\/watching_starwars\/","text":"Hello. I want to watch the Star Wars movies (not the TV shows). But I prefer not to watch the old ones. What is your suggestion to watch in story order?","upvote_ratio":0.22,"created_utc":1678504954.0},{"title":"do you prefer phase 1 or phase 2 armor?","author":"thetruememeisbest","url":"https:\/\/www.reddit.com\/gallery\/11mojrh","text":"","upvote_ratio":0.97,"created_utc":1678356649.0},{"title":"I don't understand.","author":"Teff1313","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o3jxe\/i_dont_understand\/","text":"Is there any in universe reason that the gunship following Dooku didn't use its laser cannons to shoot him down? Obviously it would have shortened the movie, but I can't accept the reason of being \"out of rockets\"","upvote_ratio":0.43,"created_utc":1678488862.0},{"title":"a commission I did for a friend a bit ago","author":"MrsPuff95","url":"https:\/\/www.reddit.com\/gallery\/11mx4fl","text":"","upvote_ratio":0.97,"created_utc":1678380608.0},{"title":"Watch order reccomendations","author":"PerhapZZZZZ","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o3h8o\/watch_order_reccomendations\/","text":"What's up y'all, I've been a star wars fan since I was 5 (im 21 now) I watched it originally in release order and really enjoyed it. \n\nI showed my ex-girlfriend it in machete order (4-5-2-3-6) and she loved it and watched clone wars rebels and mando all by herself after. \n\nI'm seeing someone new now whose also never seen star wars and tonight we're staying together and she told me she wants to start star wars tonight. My friend recently watched rouge one before watching a new hope and said the transition was really amazing. So right now  I'm leaning towards machete order with rouge one at the beginning what do y'all think?\n\n I'm open to any suggestions her star wars knowledge is really limited she may not even know the twist in episode 5. I also wanna avoid the really awful movies like the sequel trilogy, episode 1, and solo but am open to including episode 1. I also wanna show her clone wars too down the line I really think she'd love it based on her tastes so keep that in mind.","upvote_ratio":0.25,"created_utc":1678488665.0},{"title":"Rise of Skywalker Ending -SPOILERS","author":"Inevitable-Ad-6432","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ob28q\/rise_of_skywalker_ending_spoilers\/","text":"I seriously doubt anyone here hasn’t watched The Rise of Skywalker yet, but just in case, stop reading now if you haven’t. \n\nAnyway, I’ve just finished watching it for about the 100th time, & every day, the main thought I come away with is: was it really necessary for Ben to die? Seriously. Why couldn’t they just wrap it up, nice & neat, with a happy ending AND an epic love story? We’ve already had one tragic romance with Anakin & Padmé, we didn’t need another one. & Leia & Han’s relationship was strained. Couldn’t they just give us this one? I mean, she turned him from the Dark Side. It’s the ultimate romance. I don’t think it was too much to ask to let them live happily ever after…😭","upvote_ratio":0.35,"created_utc":1678510198.0},{"title":"Andor *before* Rogue One, recommended?","author":"cylonlover","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nwb4n\/andor_before_rogue_one_recommended\/","text":"Hi all. I watched Rogue One and it was easily some if the best SW I have every seen. Then I watched Andor and it surpassed it and made a deep impression on me. I am sort of the curator of scifi (no discussion of definition here plz, lol), here in my household, and I am going to watch it all again with my wife, and I know she will love it, no doubt about *that*. I am however in doubt about if we should watch Rogue One *after* Andor, mostly because the end of that movie is so incredibly epic, both for the character and the loopback into the story from '78!!\n\nWhat is your opinion? Would you think there are cons to watching them not in the released order? I am genuinely interested in hearing i put, so many thanks in advance!","upvote_ratio":0.4,"created_utc":1678471802.0},{"title":"My concept for the next Star Wars movie. Thoughts?","author":"FizzyCocoaMan","url":"https:\/\/i.redd.it\/1554zg85ftma1.png","text":"","upvote_ratio":0.84,"created_utc":1678394027.0},{"title":"Rebels question - A World Between Worlds. (POSSIBLE SPOILERS for anyone who hasn't watched S4 Rebels).","author":"xX_69noob_Xx","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o1r55\/rebels_question_a_world_between_worlds_possible\/","text":"I've just finished rewatching Rebels for the second or third time but still I don't understand the world between worlds, what it is, how it works, even after searching online. To me, it simply seems like time travel, even though I have seen people say it isn't. I also hope not as it'd kinda ruin Star Wars for me if it were to head in the direction of time travel\/alternate timelines. I'm guessing in the upcoming Ahsoka show it will make a return. Anyway, did Ahsoka always survive? How and why was Ezra able to save her? Did Vader think he killed her? I just can't wrap my head around it. I'm a fan of the show but I have mixed feelings (mostly negative) about the wbw.","upvote_ratio":0.29,"created_utc":1678484533.0},{"title":"Star Wars the clone wars watch through","author":"sussymogusnuts","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o4qvg\/star_wars_the_clone_wars_watch_through\/","text":"Since the start of Mando season 3, I’m interested in watching the clone wars, however there are a lot of episodes. I want to know which arcs I should watch, just the good ones and important ones for the live action star wars, and bad batch and rebels","upvote_ratio":0.2,"created_utc":1678491862.0},{"title":"How common are certain languages in the Star Wars galaxy?","author":"SakamotoSkywalker","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nvedm\/how_common_are_certain_languages_in_the_star_wars\/","text":"After watching the season 3 premiere of Mando with the scene where Din tries to communicate with the anzellans and asks if they know Huttese, it made me wonder how common some languages are in the galaxy—\n\nFor example I live in the US, and while we don’t have an official language, the two most common are easily English followed by Spanish. So it makes me wonder if Star Wars is the same way, with Basic being the most common with Huttese the next most. Seems like if you know one or both you shouldn’t have problems communicating, outside of the more remote planets where only the native language is spoken of course","upvote_ratio":0.5,"created_utc":1678469671.0},{"title":"Can two force-users use the force on eachother. So they can get to their destination faster?","author":"MrArtastic","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nut8w\/can_two_forceusers_use_the_force_on_eachother_so\/","text":"","upvote_ratio":0.33,"created_utc":1678468288.0},{"title":"These two have something in common that no other Jedi ever achieved in the history of the galaxy. It might not be what you think. Lets see who finds it first.","author":"AdministrativeDay802","url":"https:\/\/i.redd.it\/kisc89bn9oma1.jpg","text":"","upvote_ratio":0.76,"created_utc":1678331640.0},{"title":"Clan Wren","author":"BinyominSilverman","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11now9j\/clan_wren\/","text":"With Mandalore itself destroyed, due in part to Clan Wren’s uprising instigated by Sabine and Ursa Wren, what happened to Krownest the seat of Clan Wren, did it get the Mandalore treatment? What is Clan Wren’s place in Mandalorian society, outcasts? Traitors? War Mongers?","upvote_ratio":0.56,"created_utc":1678454055.0},{"title":"Mando n1 star fighter","author":"jkredjk","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o74c0\/mando_n1_star_fighter\/","text":"Idk if this is the correct place to talk about this but I despise mando having the Naboo star fighter. The razor crest was a perfect ship for mando but I’m glad they opened him up to have more ships. I like that mando isn’t locked into one weapon or ship. But the Naboo star fighter is a single man fighter specifically a very expensive single man fighter. This most recent episode proves the fact  that it doesn’t fit him at all. How does the Astro mech get into the ship with that third engine. Where does the prim go? Mando either needs to get a bigger ship to attach the Naboo star fighter on. ( like the ghost and lhontom from rebels) or get a different ship and leave the Naboo fighter with boba.","upvote_ratio":0.29,"created_utc":1678498199.0},{"title":"Can anybody help me finish a debate with my friends that has been going on for a very long time?","author":"Skyyborn","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o61s1\/can_anybody_help_me_finish_a_debate_with_my\/","text":"General Grievous VS Anakin Skywalker (clone wars) \n\n1v1 to the death who wins?\n\nIn my opinion I personally believe that Grievous wins.\n\nHe is stronger, smarter and not as reckless as Anakin. He also leads the whole droid army alongside him. I can go into a lot of arguments, but that is what the comment section is for. Please list your opinion alongside some reasoning. Thanks!","upvote_ratio":0.22,"created_utc":1678495230.0},{"title":"Bob Iger: The company still is being “very careful” with developing Star Wars feature films","author":"LadyDarry","url":"https:\/\/deadline.com\/2023\/03\/disney-star-wars-marvel-ceo-bob-iger-1235283774\/","text":"","upvote_ratio":0.86,"created_utc":1678394636.0},{"title":"Just got this new Darth Vader tattoo.","author":"sethlfc20","url":"https:\/\/i.redd.it\/b4zv0fk3hrma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678370466.0},{"title":"Found Boba","author":"Danthorpe04","url":"https:\/\/i.redd.it\/eu0nsudo60na1.jpg","text":"Had to pick this up,. Found Boba Fett sitting by himself alone at a TJ Maxx","upvote_ratio":0.42,"created_utc":1678475927.0},{"title":"3D printing Star Wars: The Mandalorian S3 helmet&bust","author":"eSUN3DPrinting","url":"https:\/\/v.redd.it\/skc2ghicntma1","text":"","upvote_ratio":0.78,"created_utc":1678414808.0},{"title":"If I wanted to start reading Star Wars books, where should I start?","author":"redpanda_be","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11njkni\/if_i_wanted_to_start_reading_star_wars_books\/","text":"","upvote_ratio":0.6,"created_utc":1678437778.0},{"title":"The Mandalorian Tries New Religions (Fan Film)","author":"theschroeder","url":"https:\/\/youtu.be\/mAAL-1PTa4E","text":"","upvote_ratio":0.29,"created_utc":1678471076.0},{"title":"Alamite grunt similarities between the Goons from Dying Light","author":"father_with_the_milk","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11npnpq\/alamite_grunt_similarities_between_the_goons_from\/","text":"Correct me if I'm wrong, but did they use the same sounds for the Alamites (while Bo-Katan combats them on her way to the semi-droid's hideout) as they did for the Goons in Dying Light?","upvote_ratio":0.5,"created_utc":1678455998.0},{"title":"Opinion: Reva being ObiWans Padawan would have made her anger more personal","author":"Screenwriter6788","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o0xxb\/opinion_reva_being_obiwans_padawan_would_have\/","text":"She has a hatred for obiwan because of the massacre, but that could be said for any Survivng Jedi. If she’s was supposed to be his padawan, but left her at the temple instead of taking her to Upatau, then her focusing on obiwan would have made more sense","upvote_ratio":0.33,"created_utc":1678482587.0},{"title":"My Star Wars book collection. Only 2 in here I haven’t read yet. Which has been your favorite Disney canon book?","author":"jonnnysniper","url":"https:\/\/i.redd.it\/2ylaygtjqsma1.jpg","text":"","upvote_ratio":0.89,"created_utc":1678385752.0},{"title":"For first-times who watched the movies from EP 1 > 9, how was your experience?","author":"AnAttackCorgi","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nyceq\/for_firsttimes_who_watched_the_movies_from_ep_1_9\/","text":"I assume most watch the movies from Episodes 4-6, to 1-3, and then to 7-9; by release date. But for first-timers who watched the movies chronologically, Epsidodes 1 - 9, did the story beats hit you differently?","upvote_ratio":0.2,"created_utc":1678476489.0},{"title":"Mr. Sorry My Lady, My Look Makes You Uncomfortable","author":"Ajspradbrow","url":"https:\/\/i.redd.it\/hi16tab1dyma1.jpg","text":"","upvote_ratio":0.5,"created_utc":1678453849.0},{"title":"full watching\/reading order","author":"bumded","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nu0yp\/full_watchingreading_order\/","text":"could someone give me every single star wars movie\/show in release order and a good comic reading order","upvote_ratio":0.5,"created_utc":1678466484.0},{"title":"Kotobukiya Official on Twitter: \"From the acclaimed animated series Star Wars: The Clone Wars™ on Disney+ emerges a familiar face from the shadows of the dark side of the force - Darth Maul™!\"","author":"Exastiken","url":"https:\/\/twitter.com\/Kotobukiya_EN\/status\/1633694602988498944","text":"","upvote_ratio":0.86,"created_utc":1678421132.0},{"title":"Dumb Fan Theory - RotJ Sarlacc Battle is shown from Han's inaccurate point of view","author":"DanOfTheDead","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nx6hv\/dumb_fan_theory_rotj_sarlacc_battle_is_shown_from\/","text":"I was thinking about the cheap death Boba Fett got in RotJ. Totally get that at the time he wasn't supposed to be the big deal he became, but like a lot of other fans I too really love the character and happy we've gotten more screen time with him over the years. \n\nHan stumbling his way into saving the day multiple times is honestly a great bit, but it occurred to me one interpretation of the scene is that's all just what Han thinks happened, given his limited awareness from hybernation sickness.\n\nChewie and the gang just smile and nod whenever he's retelling his version.\n\n\"From a certain point of view...\" and all that.","upvote_ratio":0.33,"created_utc":1678473802.0},{"title":"My three year old, who knows nothing about Star Wars, just called my Jedi robe a “smarty-pants alien shirt.”","author":"BrickPiper","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nfjgn\/my_three_year_old_who_knows_nothing_about_star\/","text":"","upvote_ratio":0.6,"created_utc":1678425081.0},{"title":"James Waugh confirmed we will see more of Star Wars: Eclipse, Quantic Dream at Star Wars Celebration. Both Eclipse and Acolyte moving forward in development.","author":"AntonN_2","url":"https:\/\/www.youtube.com\/watch?v=f0l-OuG3BVg&t=333s","text":"","upvote_ratio":0.5,"created_utc":1678452116.0},{"title":"The Bad Batch Season 2 Episode 12...","author":"Lenorayez","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nbes9\/the_bad_batch_season_2_episode_12\/","text":"Is this the first time we ever saw red\/human BLOOD in animated Star Wars? I kinda like it lol \n\n&#x200B;\n\nhttps:\/\/preview.redd.it\/ohauaejgktma1.png?width=983&format=png&auto=webp&v=enabled&s=8fb03b67c10673d7121c626ce28dfa080da87819\n\nhttps:\/\/preview.redd.it\/7kyu1ejgktma1.png?width=503&format=png&auto=webp&v=enabled&s=ed50d7d7b651dae13597fd15a1708d09bbe7da58\n\nhttps:\/\/preview.redd.it\/us1q9ejgktma1.png?width=585&format=png&auto=webp&v=enabled&s=a15ce02fa6452c1d32ad22e4cd769312fd052e5c\n\nhttps:\/\/preview.redd.it\/f969y2kgktma1.png?width=520&format=png&auto=webp&v=enabled&s=ea1f7167bfd195cfbbd67fe7a5436249b39fffb7\n\nhttps:\/\/preview.redd.it\/kymll2kgktma1.png?width=711&format=png&auto=webp&v=enabled&s=7fa11146dde10ec97542e3081f40212dbe059a4c\n\nhttps:\/\/preview.redd.it\/c0vtg2kgktma1.png?width=681&format=png&auto=webp&v=enabled&s=f18601b6663b939c68f918c3b37aa7ae9d03ebc6","upvote_ratio":0.78,"created_utc":1678413893.0},{"title":"can the force work in its own will?","author":null,"url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ntacj\/can_the_force_work_in_its_own_will\/","text":"you obviously get the standard force traits but can it inhibit how a person fights like when you see a jedi with his back to a armed gunman and he just stands\n\ncan the force stop him from shooting or even just make him think he doesn’t want to shoot","upvote_ratio":0.33,"created_utc":1678464789.0},{"title":"Why isn't there more use of the force in duels?","author":"East_Pickle_9342","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nt38s\/why_isnt_there_more_use_of_the_force_in_duels\/","text":"So I'm a massive fan of the films in general (even with my complaints of the Sequel trilogy but alas, another time) and am getting into the canon novels now slowly but surely. I've looked on this page for a similar post and only found one that didn't really help so thought i'd put it here. Title is pretty much self explanatory I reckon and apologies if it's a dumb question. I understand that from a movie perspective it wouldn't be as interesting to watch if they didn't use lightsabers or spent most of the time flinging rocks at each other or choking etc but from an actual universe perspective is there any canonical explanation as to why? This becomes more relevant when we think about the older Jedi who would focus more on being at one with the force etc e.g. Yoda, Qui Gon etc - think about battle between yoda and palpatine as well. Wouldn't we expect there to be more force wielding etc?  I have read that it has something to do with the field or \"aura\" idk that  jedi masters\/sith lords etc have around them that makes it easy to deflect force based attacks but we've seen plenty of instances now where characters are hit by objects used by force etc etc. I'm also thinking of the duel between obi wan and anakin and how there's a point where they're both using the force against eachother (the shot is of their hands opposing eachother) before they're pushed apart like repelling magnets) and wondering if it would amount to a stalemate of sorts between two experienced force users that it boils down to their duelling skills etc?  Then again we see vader jusy annihilate the inquisitor in obi wan with just the force so i don't even know anymore haha!","upvote_ratio":0.29,"created_utc":1678464337.0},{"title":"Am i late to the party noticing this design similarity? Maurader vs. saberdart","author":"Trooper_7567","url":"https:\/\/i.redd.it\/b52t1hl9omma1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678312341.0},{"title":"Found this old McDonald's toy while going through the garage, boy does this take me back","author":"Sidrat02","url":"https:\/\/i.redd.it\/clnt7ik25sma1.jpg","text":"","upvote_ratio":0.89,"created_utc":1678378528.0},{"title":"People who were lucky enough to Empire Strikes Back in theaters back in 1980, what went through your head when Vader revealed he was Luke's father?","author":"Odd-Sample-1824","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nvt44\/people_who_were_lucky_enough_to_empire_strikes\/","text":" I feel like crazy plot twists like that are a dime a dozen these days, but did the audience go ballistic?","upvote_ratio":0.36,"created_utc":1678470648.0},{"title":"Do you think The Thrawn Trilogy was the Original Sequel Trilogy?","author":"Winnipegjetsfan4","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o3ski\/do_you_think_the_thrawn_trilogy_was_the_original\/","text":"Haven't read The Thrawn Trilogy (Planning on it someday) but I know the story and the characters in it. I'm wondering if people thought that it was the Sequel Trilogy until the Disney one unless if lots of people still think that way. \n\nDisney's Sequel Trilogy is a mess.","upvote_ratio":0.17,"created_utc":1678489444.0},{"title":"Life imitates art","author":"DarkSpartan267","url":"https:\/\/i.redd.it\/gdrkyvuljnma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678322881.0},{"title":"Pillio planet is so pretty! Source- EA Star Wars Battlefront II","author":"DueReception7103","url":"https:\/\/i.redd.it\/62nwr7nfhqma1.jpg","text":"","upvote_ratio":0.9,"created_utc":1678376584.0},{"title":"“They’re Not Just Another Number, None of Them Are.” I would love to see a plaque or list of all the clones from the first to die on Genosis to the last Jango Fett Clone to die. So we never forget the Brothers we lost.","author":"DeathSkullBlood","url":"https:\/\/www.reddit.com\/gallery\/11mzpaw","text":"","upvote_ratio":0.76,"created_utc":1678386557.0},{"title":"“The Sith”, Digital Drawing by me.","author":"Leadjockey","url":"https:\/\/i.redd.it\/bfzc3x5s0jma1.jpg","text":"","upvote_ratio":0.97,"created_utc":1678286137.0},{"title":"Need help with buying lightsabers","author":"-Wriskica-","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nli6i\/need_help_with_buying_lightsabers\/","text":"Hi everybody! I am not sure why it never crossed my mind to ask here as I've been searching for months.\n\nMe and my fiance are getting married this June and we are planning an industrial wedding with Star Wars details. We are both huge Star Wars fans and having at least few details from the SW Universe just made sense to us.\n\nWe found everything we need, except lightsabers. Our budget is €50 per lightsaber and we need 4 (for us, best man and maid of honor). I already ordered some back in December, but they came broken, so I returned them.  Now I don't want to make the same mistake.\n\nIf anyone has any advice where to buy these and that they can be shipped to Croatia by Jume 3rd, I would highly appreciate it. Thanks in advance.","upvote_ratio":0.4,"created_utc":1678444285.0},{"title":"After walking around the park with our son, my wife surprised me with this.","author":"RebelQwertyBoy","url":"https:\/\/i.redd.it\/3g8peq0kdpma1.jpg","text":"","upvote_ratio":0.97,"created_utc":1678363060.0},{"title":"\"M\" by Vladimir Matyukhin","author":"Nikephoros_II_Phokas","url":"https:\/\/cdnb.artstation.com\/p\/assets\/images\/images\/057\/800\/203\/4k\/vladimir-matyukhin-ft-906mando.jpg?1672703169","text":"","upvote_ratio":0.75,"created_utc":1678391044.0},{"title":"Started by watching Episode I and II. Please tell me it gets better.","author":"tanja510","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11o4a3s\/started_by_watching_episode_i_and_ii_please_tell\/","text":"I might have made a mistake by deciding to watch the films and series in order of story. Just finished episode II and am starting to want to give up.\n\n When can I hope for it getting better? Is it the IV? I'm ready to get through another film and then the good part, but if this needs 3 more films to get better. I don't know If I can do it.","upvote_ratio":0.18,"created_utc":1678490664.0},{"title":"What was going through this Tie Pilot's mind in this exact moment?","author":"AnalogueInterfa3e","url":"https:\/\/i.redd.it\/n7d7mpvokpma1.png","text":"","upvote_ratio":0.88,"created_utc":1678365524.0},{"title":"The Mandalorian S3E2 is a theme park ride concept and I’m okay with that","author":"Yokelele","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nbtvl\/the_mandalorian_s3e2_is_a_theme_park_ride_concept\/","text":"A lot of ish was said in S1 and 2 about how this show is a money-making gimmick for Disney. Well, duh. But it’s also fanfare. The scenes where Mando heads to the Mines of Mandalore was clearly… CLEARLY made for merchandising (Lego maybe?), video games and maybe even theme park attractions. I want to hear your thoughts but I’ll say this - having an OLED 4K in my home makes this feel like being on a roller coaster ride simulation in my own living room with a drink in my hand - wouldn’t trade it for the world. Loving how this season is starting.\n\nEdit: bot told me I picked the wrong flair. But I didn’t see TV as an option. Maybe I need new glasses?","upvote_ratio":0.57,"created_utc":1678414964.0},{"title":"Is The Mandalorian Avoiding Mentioning Satine Because It Could Get Casuals Confused With Her And Sabine?","author":"CarsonWentzGOAT1","url":"https:\/\/www.reddit.com\/gallery\/11nrimq","text":"","upvote_ratio":0.45,"created_utc":1678460650.0},{"title":"Let’s be honest the true draw of Star Wars is Reylo fanfic.","author":"MisPai","url":"https:\/\/www.reddit.com\/gallery\/11o7hlz","text":"","upvote_ratio":0.3,"created_utc":1678499254.0},{"title":"Mimban photo - by me","author":"MrJFrayFilms","url":"https:\/\/i.redd.it\/dn3wjkpo0tma1.jpg","text":"","upvote_ratio":0.8,"created_utc":1678389160.0},{"title":"“He Left With A Handful Of My Pupils…” Are These The Knights of Ren?","author":"pissalisa","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11njk4c\/he_left_with_a_handful_of_my_pupils_are_these_the\/","text":"Or what happened to those pupils?\n\nI was just in the middle of rewatching The Last Jedi and I realized I hadn’t payed attention much to this part. \n\nI was also always confused about where these knights came from.","upvote_ratio":0.5,"created_utc":1678437722.0},{"title":"Custom LEGO Ahsoka Tano from The Mandalorian S2","author":"bricksbygus","url":"https:\/\/i.redd.it\/piysbho5kqma1.jpg","text":"","upvote_ratio":0.89,"created_utc":1678359390.0},{"title":"Another fanart of a Grown Up Omega with her design updated!","author":"armynblaster","url":"https:\/\/i.redd.it\/n2uxekf8pima1.png","text":"","upvote_ratio":0.96,"created_utc":1678283700.0},{"title":"Attack of the Clones soundtrack appreciation post","author":"Odd-Sample-1824","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nbo7g\/attack_of_the_clones_soundtrack_appreciation_post\/","text":"Couple examples:\n\n\\-\"Zam's Dirty Trick\" (not on the soundtrack but look it up on YouTube, starts at 1:40):  Plays during the scene on Coruscant when Anakin talks to Obi-Wan about having nightmares about his mother. It's a darker version of \"Shmi's Theme\" (not sure if that's the actual name, not on TPM soundtrack either) from TPM and great reference to Anakin's character development and growing fear of loss.\n\n\\-\"Confrontation with Count Dooku and Finale\". Good Lord, what a track. Starts with a haunting melody for Dooku and Sidious then transitions to the Imperial March as Palpatine sends the Clones to war, then Across the Stars for Anakin and Padme's wedding. But my favorite part is at the end (around 9:30 on soundtrack, shame it didn't make the movie cut), when there's a quick transition from TPM's \"Anakin's Theme\" to Across the Stars to Imperial March, which describes Anakin's entire journey through the prequels.\n\nHonorable mention: \"Zam the Assassin\", captures the chaos of the chase scene. And the use of Duel of the Fates when Anakin goes full revenge mode on Tatooine.\n\nI rest my case. The dialogue might be cringe AF, but John Williams is a genius.","upvote_ratio":0.72,"created_utc":1678414561.0},{"title":"From a Certain Point of View: Return of the Jedi – Cover Reveal","author":"TheMastersSkywalker","url":"https:\/\/www.starwars.com\/news\/from-a-certain-point-of-view-return-of-the-jedi","text":"","upvote_ratio":0.67,"created_utc":1678403588.0},{"title":"i just finished the sequel trilogy.","author":"paiigelisa","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nijbj\/i_just_finished_the_sequel_trilogy\/","text":"not as bad as i thought they’d be, but still…. disappointing. i’m really sad that that was how the skywalker saga came to an end. any recommendations for what i should watch next? i’ve seen all of the movies (rogue one and solo too) and mando. what should i watch next?","upvote_ratio":0.47,"created_utc":1678434237.0},{"title":"The little things in the Clone Wars","author":"Solidpeach333","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n2ggv\/the_little_things_in_the_clone_wars\/","text":"I love how the Clone Wars expands not just massive events and implications for the galaxy but also little character moments that show how these characters are actually friends.\n\nFor example season 7 episode 2;\nAnakin and Rex have an extremely close friendship that is told just by Rex covering for Anakin to go talk to Padme. After Rex awkwardly lies to Kenobi, it’s revealed that Kenobi knew the entire time that Anakin was talking to Padme and makes a joke. These little interactions show loyalty and trust that make the world feel more real and make us actually care about what happens not only in the show but the other media as well.","upvote_ratio":0.74,"created_utc":1678392910.0},{"title":"I randomly decided to pitch an idea for a Star Wars comic...","author":"ErikSlader713","url":"https:\/\/twitter.com\/ErikSlader\/status\/1634216098982756352?t=cA5ypXOVSxHrY4bHxC9LdA&s=19","text":"","upvote_ratio":0.2,"created_utc":1678468387.0},{"title":"Recreated a scene pic with my dog hope you all enjoy :)","author":"Jerrio2002","url":"https:\/\/i.redd.it\/2ddqx3imupma1.jpg","text":"","upvote_ratio":0.95,"created_utc":1678350801.0},{"title":"Found in a thrift store. Can anyone shed some light on its origins?","author":"NAMESPAMMMMMM","url":"https:\/\/www.reddit.com\/gallery\/11n3tsu","text":"","upvote_ratio":0.69,"created_utc":1678396034.0},{"title":"What Scene genuinely made you cry in the Star Wars Book\/Tv\/Movie etc?","author":"Upbeat_Cobra4753","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n52ch\/what_scene_genuinely_made_you_cry_in_the_star\/","text":"&#x200B;\n\nhttps:\/\/preview.redd.it\/qhfcc7hpbsma1.png?width=930&format=png&auto=webp&v=enabled&s=f2e9af217d05bbce692e210a140fc0fb368de024\n\nhttps:\/\/preview.redd.it\/7etjqkbrbsma1.png?width=1500&format=png&auto=webp&v=enabled&s=bfbd87c3c4ad98f0d73f3b7b7f2e088c7d01005a\n\nhttps:\/\/preview.redd.it\/s1dx8wqtbsma1.png?width=1280&format=png&auto=webp&v=enabled&s=c5b433febae23802349054815be3b1f8f0bc5834","upvote_ratio":0.82,"created_utc":1678398841.0},{"title":"Got a Clone Wars Rex\/Ahsoka tattoo done today. Very pleased!","author":"ninjafrombtd6","url":"https:\/\/i.redd.it\/veurc1x5bmma1.png","text":"","upvote_ratio":0.96,"created_utc":1678307940.0},{"title":"Does anyone know what this symbol (the circle on the top right hand corner) means on the building in Star Wars in Hollywood Studios?","author":"erfinb","url":"https:\/\/i.imgur.com\/JQh3pPp.jpg","text":"","upvote_ratio":0.67,"created_utc":1678406101.0},{"title":"True or False","author":"JimmyBr33z","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nqttl\/true_or_false\/","text":"Anakin became Darth Vader the exact same day Luke and Leia were born","upvote_ratio":0.3,"created_utc":1678458905.0},{"title":"Question","author":"Soft-Hamster-4525","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ng8bw\/question\/","text":"What clone wars character fits the song My Time by Bo en?","upvote_ratio":0.4,"created_utc":1678427145.0},{"title":"Almost as bad as Pong Krell.","author":"The_Norfolkian","url":"https:\/\/i.redd.it\/a84yekda2jma1.png","text":"","upvote_ratio":0.97,"created_utc":1678286668.0},{"title":"Design I made for Tatooine. Starting a series for different places, where to make next? Hoth is almost done, maybe doing Endor after.","author":"BronsonLockwood","url":"https:\/\/i.redd.it\/pne3jd2nfjma1.png","text":"","upvote_ratio":0.99,"created_utc":1678291287.0},{"title":"Watching Episode 4 of Andor, I noticed Aldhani looked oddly familiar. Turns out I hiked the same valley (Cruachan, Argyll, Scotland) last year! First pic is a still from the episode, the second is one I took myself.","author":"Unforgivingshart","url":"https:\/\/www.reddit.com\/gallery\/11m1fyp","text":"","upvote_ratio":0.98,"created_utc":1678294414.0},{"title":"Anyone have a Star Wars toy that shouldn't exist? Here's my submission","author":"BryanwithaYnotanI","url":"https:\/\/www.reddit.com\/gallery\/11m6aop","text":"","upvote_ratio":0.98,"created_utc":1678305342.0},{"title":"Bikes… REBELS = BoBF","author":"Money-Frame-2038","url":"https:\/\/i.redd.it\/e45koi29wvma1.jpg","text":"","upvote_ratio":0.44,"created_utc":1678423989.0},{"title":"Whatnot score. Won these for 56 bucks.","author":"J_Stash","url":"https:\/\/i.redd.it\/qvppeq0y9oma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678331738.0},{"title":"Girlfriend has never seen Star Wars","author":"igloonasty","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ms2cy\/girlfriend_has_never_seen_star_wars\/","text":"Convinced my girlfriend to watch the original trilogy to begin with. We had watched A New Hope recently and then Empire Strikes Back last night. I knew she knew of the “No, I am your father” line because of pop culture and I mean, who doesn’t at this point? \n\nThe cool part is that she’s really enjoying everything so far which has me excited, but when Vader spoke that line she had no expectation of it being him to tell Luke that. She literally gasped and squeezed my leg in disbelief and it was just awesome to see someone react to it in that way, it had been so long since I first had heard it myself.\n\nWe’re now on to finish the rest by her request, which has me amped for it. From a girl that was pretty much refusing to watch it to her finally giving in to my Opera appeals, it’s cool to get to share something that’s always been a part of my interests with her.\n\nEdit: Changed from original 6 to original trilogy so tissn doesn’t cry themselves to sleep tonight.","upvote_ratio":0.79,"created_utc":1678368162.0},{"title":"A discussion: If a clone army as unethical, as military draft \/ conscript as well?","author":"Smokescreen69","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nix8m\/a_discussion_if_a_clone_army_as_unethical_as\/","text":"So my friend ( a philosophy and poli sci major) and I were discussing the new bad batch episode. During the discussion the topic of ethics came up and we both came to realization that a mandatory conscription\/ military draft is unethical for similar reasons as a clone army. Both require people to serve without consent and both require people born to fight ( a nations people vs clone bred to fight) We also were stoned if that helps. \nBut what are your thoughts ?","upvote_ratio":0.38,"created_utc":1678435509.0},{"title":"Mando - Digital Drawing [OC]","author":"liquiciti","url":"https:\/\/i.redd.it\/0ad9z2hvqqma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678361648.0},{"title":"So, its a story about a guy on a quest to take a magic bath to atone for taking off his helmet? ,...and he travels with a baby gremlin for some reason.","author":"hhyyz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nybsd\/so_its_a_story_about_a_guy_on_a_quest_to_take_a\/","text":"I guess I just don't get what everyone sees in Mando?","upvote_ratio":0.19,"created_utc":1678476444.0},{"title":"AT-AT for aquariums","author":"SAT0725","url":"https:\/\/i.redd.it\/1pv103na4mma1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678323640.0},{"title":"Accidentally took this cool foto while watching 2003 clone wars","author":"Mysterious_Ad380","url":"https:\/\/i.redd.it\/elhqy7hhblma1.jpg","text":"","upvote_ratio":0.86,"created_utc":1678295937.0},{"title":"Regarding Crosshair.","author":"Enaith","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mqmuk\/regarding_crosshair\/","text":"Hi. I just wanted to share my thoughts on this - I've seen a number of people say that they see the season ending with Crosshair reuniting with the Batch and then dying in the end, in some sort of heroic, self-sacrificial way. I wanna say, please, let my boy survive and make amends with his brothers, rejoin them for good, maybe even for a hypothetical 3rd season. Watching yesterday's episode, I actually got teary-eyed when he was hugging with Mayday to try and stay warm, and I don't usually get this emotional unless it really struck me in some way. He's been through so much, let my boy have some peace... And not in the Fives way.","upvote_ratio":0.79,"created_utc":1678363981.0},{"title":"Non-Clone Members In The Early Days Of The Empire","author":"J-x-3","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nbtfi\/nonclone_members_in_the_early_days_of_the_empire\/","text":"As I watch more and more of season 2 of The Bad Batch, I start to get more and more curious of where all these higher-ranking officers that aren’t even in clones are coming from. I know that not everyone who served in the Grand Army of the Republic was a clone, but unless I know these people were involved in operations prior to the empire, why are they being put into positions of power? Is it to help phase out the clones?\n\nI’d like to think they served in the Grand Army of the Republic, but most who served who weren’t clones actually had respect for them - these guys are just stuck-up snobs that see them as cannon fodder and probably got their rank ‘cause they stood out at some imperial academy.","upvote_ratio":0.57,"created_utc":1678414934.0},{"title":"Great message for all fans.","author":"valosdm","url":"https:\/\/v.redd.it\/an87r7kl2mma1","text":"","upvote_ratio":0.97,"created_utc":1678305068.0},{"title":"My version\/vote for of Grand Admiral Thrawn","author":"Money-Frame-2038","url":"https:\/\/i.redd.it\/sg1chcu4c0na1.jpg","text":"","upvote_ratio":0.12,"created_utc":1678477758.0},{"title":"How did Palpatine have a kid? Did he really clone himself?","author":"Will_da_Thrill12","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n23we\/how_did_palpatine_have_a_kid_did_he_really_clone\/","text":"Rey is palpatines grandchild but how? Some people have told me that the cannon is that palpatine had a clone which started a family so that palpatine could have an heir so this plan for him to be immortal could work. And like for some reason his son wasn’t strong enough so he tried it with Rey. \n\nIs that correct? Or did palpatine just start a family when he was younger and then forget about them? \n\nWhat’s the official real story and can you share sources?","upvote_ratio":0.56,"created_utc":1678392107.0},{"title":"Which character has the worst light saber skills?","author":"zztop610","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n136t\/which_character_has_the_worst_light_saber_skills\/","text":"","upvote_ratio":0.64,"created_utc":1678389742.0},{"title":"Yassified Darth Maul by me :) I think piercings suit him","author":"cccrouton","url":"https:\/\/i.redd.it\/m7ghuftbznma1.jpg","text":"","upvote_ratio":0.85,"created_utc":1678328170.0},{"title":"Whats the goal of The Bad Batch?","author":"Letywolf","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nwsmv\/whats_the_goal_of_the_bad_batch\/","text":"The series is getting extremely boring and pointless.\n\nWhat is their goal? where are they going too? Or are they going to keep doing odd jobs for the lizard lady and keep calling them \"missions\"? \n\nThere is barely to none progress in the story except for Omega feeling sad sometimes, no character development whatsoever for the squad (except Crosshair on the last episode).\n\n&#x200B;\n\nAt this momentI don't see the point of keep watching the series if there is no cliffhanger, nothing to look forward to.","upvote_ratio":0.2,"created_utc":1678472916.0},{"title":"This week's episode of Bad Batch has given me my new favorite quote","author":"Educational-Tea-6572","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mhgyz\/this_weeks_episode_of_bad_batch_has_given_me_my\/","text":"**\"Oh I'm confident, I'm just not stupid,\"** now joining \"Welcome to our disaster!\", \"This is the Way,\" \"I have spoken,\" and \"Do or do not, there is no try\" as my top 5 Star Wars quotes.","upvote_ratio":0.94,"created_utc":1678332700.0},{"title":"Games\/ Remasters we need! Let’s go Lucasfilm Games!","author":"snieves0426","url":"https:\/\/www.reddit.com\/gallery\/11lydbv","text":"","upvote_ratio":0.89,"created_utc":1678287292.0},{"title":"Why Luke didn't have his last name changed to Lars?","author":"MiedzianyPL","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n0ez2\/why_luke_didnt_have_his_last_name_changed_to_lars\/","text":"","upvote_ratio":0.62,"created_utc":1678388215.0},{"title":"Star Wars Visual Trivia 2023 #19","author":"--TheForce--","url":"https:\/\/i.redd.it\/y5llwa950qma1.jpg","text":"","upvote_ratio":0.73,"created_utc":1678370685.0},{"title":"I recently got my 94 year old grandmother into Star Wars","author":"Titan828","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mx2ql\/i_recently_got_my_94_year_old_grandmother_into\/","text":"2 years ago when I was heading off to University, my grandmother got me a card that I couldn't open until I arrived at the University. When I opened it I saw it had a stormtrooper on it and inside she wrote that when she found this card at the store, it had to be the chosen one for me. I phoned her and asked if she had gotten into Star Wars because of the stormtrooper card and \"the chosen one\" but she said that she liked the helmet design on the card, though didn't know where it was from, and \"the chosen one\" was just a coincidence. She told me that one day, her and I need to watch a Star Wars movie together because she has ignored the franchise for too long.\n\nIn December 2022, I phoned my grandmother and told her that a Star Wars movie, A New Hope, is on in 10 minutes. That night she told me she really enjoyed the movie, great action scenes and great choreography. One question she had was why Obi-Wan disappeared after Vader killed him, which I answered. A month ago, I told her the next Star Wars movie, Empire Strikes Back, was on. She started watching it 30 minutes in and also really enjoyed.\n\nAfter she told me she wasn't interested in seeing more Star Wars movies after ESB, I told her that Leia is Luke's sister.","upvote_ratio":0.78,"created_utc":1678380497.0},{"title":"Mando S3E2 question","author":"dcj012","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n8w39\/mando_s3e2_question\/","text":"After the events of episode 2, isn’t the dark saber rightfully Bo Katan’s now? Mando was defeated by the cyborg, then Bo defeated the cyborg. Each one taking the Dark saber from the previous. Is there any discussion around this.","upvote_ratio":0.5,"created_utc":1678407536.0},{"title":"The best part of wearing this at cons is getting to go around saying “hello there” at people.","author":"Foombamaroom","url":"https:\/\/www.reddit.com\/gallery\/11m092t","text":"","upvote_ratio":0.93,"created_utc":1678291700.0},{"title":"Darth Vader drawing i made","author":"Silentrebel_69","url":"https:\/\/i.redd.it\/tuekzeuedrma1.jpg","text":"","upvote_ratio":0.72,"created_utc":1678369226.0},{"title":"This is the w…wait what..??","author":"ManBatman121","url":"https:\/\/i.redd.it\/137ovyjemoma1.jpg","text":"","upvote_ratio":0.84,"created_utc":1678335929.0},{"title":"Luke Skywalker, my favorite character and cosplay :)","author":"lovinglyme91","url":"https:\/\/www.reddit.com\/gallery\/11lcs9t","text":"","upvote_ratio":0.8,"created_utc":1678226345.0},{"title":"Some cool Interviews I found on YouTube with David Stone","author":"WaveCandid906","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n7l2y\/some_cool_interviews_i_found_on_youtube_with\/","text":"He played Wioslea the Alien that Luke sold his Speeder to in A New Hope, a Rebel Pilot that was later named Will Scotian in The Empire Strikes Back and a Rebel Pilot that was later retconned into being Keyan Farlander in Return Of The Jedi\n\nhttps:\/\/youtu.be\/ietHmBwIPwg\n\nhttps:\/\/youtu.be\/2iBBYxYrLBs","upvote_ratio":0.44,"created_utc":1678404458.0},{"title":"Today in 1977 - MARVEL'S STAR WARS #1 IS SHIPPED OVER TWO MONTHS BEFORE THE FILM IS RELEASED. THE SERIES WOULD CONTINUE RUN FOR 107 ISSUES BEFORE ENDING IN 1986. My time not watching Star Wars was reading the comic adaptations over and over again.","author":"CrucialCrewMember","url":"https:\/\/i.redd.it\/28ykz2xxknma1.jpg","text":"","upvote_ratio":0.97,"created_utc":1678323330.0},{"title":"What are ya'll thought on Omega Theme in Bad Batch","author":"Starfighter89","url":"https:\/\/i.redd.it\/507wrp7ugsma1.jpg","text":"","upvote_ratio":0.67,"created_utc":1678382486.0},{"title":"My Painting of Padme at Her Wedding","author":"Soluryn","url":"https:\/\/i.redd.it\/d88hh9fcmmma1.jpg","text":"","upvote_ratio":0.9,"created_utc":1678329695.0},{"title":"I really want to jump into the canon and non canon literature","author":"millerabm18","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n710a\/i_really_want_to_jump_into_the_canon_and_non\/","text":"So I want to get into some audio or e books. Its been years since Ive read any. I hear a lot about rots novelisation. What adds depth to the universe is there a list? Any recommendations on a good place to find them? Any help is much appreciated and may the Force be with you!","upvote_ratio":0.6,"created_utc":1678403184.0},{"title":"Am I the only one who noticed that Ahsokas facial markings look like the fulcrum symbol in rebels?","author":"Whatwillbemynameguys","url":"https:\/\/i.redd.it\/hyj2liparxma1.png","text":"","upvote_ratio":0.34,"created_utc":1678446554.0},{"title":"A fan made Star Wars story short film made by me, have been trying to create some sort of bounty hunter team story. Does anyone have amy tips on how to do this? Any help would be great!","author":"Ki-Adi-Mundi-69","url":"https:\/\/youtu.be\/XiZJZDszbwQ","text":"","upvote_ratio":0.63,"created_utc":1678378853.0},{"title":"Watching the Bad Batch for the first time!!!","author":"Jlangley414","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n5q1g\/watching_the_bad_batch_for_the_first_time\/","text":"Spoilers for the bad batch and potentially  others ahead… >! With omega being a sister to Boba, very similar in aging, do you think we would see an adult version of her appear in The Book Of Boba Fett? !< its just an idea I would love to see from Lucas\/Disney","upvote_ratio":0.58,"created_utc":1678400283.0},{"title":"my high school is playing The Imperial March as a bell","author":"SpeedyStar7","url":"https:\/\/v.redd.it\/b83f13twqima1","text":"","upvote_ratio":0.98,"created_utc":1678282810.0},{"title":"A Toys R Us action figure aisle when Star Wars Return of the Jedi was released. (not OC)","author":"Kingkrool1994","url":"https:\/\/i.redd.it\/rdd9nxqqocma1.png","text":"","upvote_ratio":0.97,"created_utc":1678301856.0},{"title":"Dooku gets some revenge on Maul. From Son of Dathomir.","author":"Jack-mclaughlin89","url":"https:\/\/i.redd.it\/m08udnf5wqma1.jpg","text":"","upvote_ratio":0.87,"created_utc":1678363420.0},{"title":"Why is Gregor in Bad Batch already like his hyperactive persona, which we first witnessed in Rebels?","author":"Ken_Brz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n4odw\/why_is_gregor_in_bad_batch_already_like_his\/","text":"I‘m guessing because surviving a Rhydonium explosion messes with your mind either through trauma, chemical inhalation or both. Plus he already had amnesia, so that probably didn‘t help.\n\nJust thought it was curious to see that he had already changed into that persona in bad batch. In the clone wars episode before the explosion, he acted more like a „normal“ clone.\n\nPlease add your perspective and ideas 👍","upvote_ratio":0.43,"created_utc":1678397954.0},{"title":"What I love most about the new Disney+ series: how they depict the Empire.","author":"DannyDeadhack","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mfesi\/what_i_love_most_about_the_new_disney_series_how\/","text":"What I love about all the recent Disney+ series taking place between III and IV, is that we’re seeing how fascistic and cruel the Empire is. The xenophobia, the weird experiments on people, their enslavement of political dissidents, their vast intelligence network infrastructure, the literal inquisition for Jedi, etc.\n\nWe never really saw any of that on the ground level, other than them committing the ultimate genocide of blowing up entire planets.\n\nThe Empire has always been such a massive machine, that just grinds alien and human life into dust, but it’s interesting how they keep finding ways to make you despise them even more.","upvote_ratio":0.86,"created_utc":1678327085.0},{"title":"My first tattoo! This will start my star wars sleeve","author":"ericczifrik","url":"https:\/\/i.redd.it\/kwgvwrf1ukma1.jpg","text":"","upvote_ratio":0.93,"created_utc":1678290070.0},{"title":"Star Wars Visual Trivia 2023 #18","author":"--TheForce--","url":"https:\/\/i.redd.it\/t18nyn4wjjma1.jpg","text":"","upvote_ratio":0.91,"created_utc":1678292574.0},{"title":"Driving through Wabash Indiana today and saw these near the entrance to a metal recycling center. Very cool!","author":"LondonDavis1","url":"https:\/\/www.reddit.com\/gallery\/11ma719","text":"","upvote_ratio":0.99,"created_utc":1678314272.0},{"title":"An alternate way they could have presented Luke in TLJ","author":"MassDND","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ngl99\/an_alternate_way_they_could_have_presented_luke\/","text":"Like many here, I have very ambivalent feelings about TLJ. One of my reservations was how Luke was presented. I didn’t like the petulant and bitter side that was extremely prominent, but I did like the fact that he was withdrawn—both for story purposes (an active Luke would never have allows the FO to emerge) and so he has an arc.\n\n\nAnother thread got me thinking that they could have done this by just making Luke very meditative and mysterious—unreachable not because he’s come to some obviously erroneous conclusion as a result of a misunderstanding as in the movie—but because he is exploring how to intervene in a conflict without violence, including through the power of force projection. This might require years of stasis (as in that cool concept art of him buried in sand). \n\n\nThe conflict between Rey and Luke is still there (active\/passive), and the arc is still there for Luke, but the presentation is much more satisfying because it builds on top of the growth that Luke achieved in the OT and presents a subsequent challenge: how does he continue to be a force for good in the galaxy after having effectively sworn off combat? By looking inside and discovering powers hitherto unknown.\n\n\nThis would also open the doors to additional media chronicling other stuff he got up to before dying. That window is pretty much shut now due to TLJ.\n\n\nAny other ideas for how Luke could have been written into the story in a way that gives him an arc and allows the first order to emerge? Travel outside the galaxy? Or have him be captured and give him a role like Maverick in the new top gun, with a lighter arc about teaching the new generation despite complicated past  familial trauma?","upvote_ratio":0.43,"created_utc":1678428207.0},{"title":"Peli Motto is one of the most annoying characters I’ve ever seen on TV or film. The actress over acts every line like she’s in a pantomime. Every time she’s on screen I want to fast forward. Thoughts on this\/why they’ve kept her on so long?","author":null,"url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nmajw\/peli_motto_is_one_of_the_most_annoying_characters\/","text":"","upvote_ratio":0.41,"created_utc":1678446808.0},{"title":"Shrunken Down hot toys heads on my 1\/12 Sh figuarts Obi Wan and Anakin.","author":"snieves0426","url":"https:\/\/www.reddit.com\/gallery\/11n2tb0","text":"","upvote_ratio":0.46,"created_utc":1678393732.0},{"title":"I find this movie to be so overhated, it's not great but pretty solid imo Thoughts?","author":"ShrektheSmurf277","url":"https:\/\/i.redd.it\/gmpslponrmma1.png","text":"","upvote_ratio":0.73,"created_utc":1678313489.0},{"title":"A Day at the Beach, toy photography by me","author":"DSteep","url":"https:\/\/i.redd.it\/xb6q5mxazkma1.jpg","text":"","upvote_ratio":0.96,"created_utc":1678291848.0},{"title":"I slept on Andor","author":"riointhepocket","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11me6lz\/i_slept_on_andor\/","text":"I didn’t get past the first episode when I first tried to watch it. Maybe I was distracted, but I just finished watching it last night and it is now one of my favorite Star Wars stories. I am so sorry Cass it took me so long to connect to your story.","upvote_ratio":0.75,"created_utc":1678323813.0},{"title":"how many books have you read?","author":"zionkage","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mutf6\/how_many_books_have_you_read\/","text":"It can be canon novels, legends novels, even comics, how many?\n\nI","upvote_ratio":0.57,"created_utc":1678375091.0},{"title":"Fixing Anakin's fall to the dark side","author":"MoonDustAllergy","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n6knc\/fixing_anakins_fall_to_the_dark_side\/","text":"It may have been 18 years but it has always bothered me how easy it seemed that Anakin fell to the dark side in ROTS. I'm a big fan of the prequels but this moment is the most important in those stories. And I've never found it entirely convincing how quickly Anakin goes from Jedi Chosen One to killing younglings.\n\nBut I've realised there's actually a simple fix by beefing up an earlier scene. I'm talking about when Anakin confides in Yoda about having visions.\n\nRather than this, Anakin should have felt so desperate about his fear of Padme dying that he approaches the whole Jedi Council, confesses his marriage and that he is the father of her unborn children. He begs them to help save her saying he will do anything.\n\nBut the Council refuse. They explain that they of course knew of the marriage and chose to turn a blind eye. Obi Wan is the most sympathetic, while Mace is totally unforgiving. He threatens to expel Anakin from the Order.\n\nAnakin becomes very angry and after a brief potential for a light saber fight in the Council chamber, he storms out.\n\nFrom there, the interactions with Palpatine (\"not from a Jedi\") have much more meaning for Anakin. \n\nHis discovery of Palpatine as Sidious initially leads Anakin to see it as a way to guarantee the Jedi helping him and Padme. But when confronted with choosing between Mace and Palpatine during their fight, he realises that the Sith are the only ones who are willing to save Padme.\n\nAnd as with his plea to the Jedi Council, he will do anything to ensure that happens, including killing younglings.\n\nAnyway, just a fun thought. Someone else may have suggested it already.","upvote_ratio":0.47,"created_utc":1678402167.0},{"title":"big up to rachel morrison for this additional vibe","author":"lawrencetokill","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n0k7c\/big_up_to_rachel_morrison_for_this_additional_vibe\/","text":"she very clearly has an adoration for and a practical interest in every single part of every performance, including monsters, puppets, stunts, everything.\n\nshe's a great cinematographer, but in the sense that, in my experience there are loosely 2 kinds of DP's: technical DP's who can sometimes operate on an island, with the goal of creating the best image from shot to shot; and less technical DP's who kinda wanna serve the process and the scene and the performers slightly more than or as much as the image. these are generalizations, but basically there are DP's who use the light meter a ton, and there are DP's who use it much less, to be very very general and anecdotal. just saying, a stereotypical DP is a little micromanage-y and doesn't have a vivid dialogue\/dynamic with performers.\n\nwatching that episode, every single shot design decision, camera movement, and choice of what to spotlight performance-wise, I was like \"WHO DIRECTED THIS.\"\n\nthere's a kinda recent trend, kinda bolstered by John Wick, of experienced hands with a sorta trenches relationship with performers, getting director jobs, and it's a great trend. stunt performers are becoming directors more, working actors too. a DP becoming director is not that, but rachel clearly has an intimate joy and familiarity with everybody else's job, and in that episode, she's making visual decisions to bounce off the performers' choices. she's photographing moments of pause, she's designing shots to best spotlight micro gestures and even the transitional movements of the stunt performers. she's directing beat changes during single-shot fight choreography, she's directing stuntpeople with the same spotlight as leading actors, whereas most action movies, the fights are designed and then shot like, with weirdly separate processes.\n\nshe just directed with such care and clarity and obvious collaboration and empowerment, you watch that and you're like, I want to work on that set. she's using the whole buffalo and the whole thing gets to breathe. big fan.","upvote_ratio":0.5,"created_utc":1678388529.0},{"title":"If you were in a dog fight, who would you want as your wingman and why is it Wedge? (Sorry if this has been done before)","author":"Ok-Journalist-2060","url":"https:\/\/i.redd.it\/5b7l8jt33oma1.jpg","text":"","upvote_ratio":0.69,"created_utc":1678329438.0},{"title":"My digital painting of Din and Grogu 🌌🌌🧔👽","author":"DreamerRealityArt","url":"https:\/\/i.redd.it\/z08m8bmeyjma1.png","text":"","upvote_ratio":0.93,"created_utc":1678297572.0},{"title":"Mando and Bo-Katan","author":"Realistic_Ad_6681","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n5lub\/mando_and_bokatan\/","text":"I’m confused on the relationship between Mando and Bo-Katan. Do they hate each other? Respect one another?","upvote_ratio":0.38,"created_utc":1678400033.0},{"title":"What did Obi Wan Kenobi mean when he said “If you strike me down, I shall become more powerful than you can possibly imagine.”","author":"mourningreaper00","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mzkdv\/what_did_obi_wan_kenobi_mean_when_he_said_if_you\/","text":"I’ve always been curious about this and I apologize if this has popped up way too much, but is there any deeper context besides becoming one with the force? Becoming a force ghost? Or anything of that sort. Is there any other text or theory to this moment in A New Hope?","upvote_ratio":0.45,"created_utc":1678386245.0},{"title":"Is there a book or comic or something that goes into detail about how Obi-Wan and Satine first fall in love?","author":"chesterforbes","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n5e0i\/is_there_a_book_or_comic_or_something_that_goes\/","text":"I mean there’s a printed story about the reasons why R5 (the red one) purposefully blew his motivator. There has to be something about this great romance","upvote_ratio":0.44,"created_utc":1678399562.0},{"title":"Je'daii Code, source - Star Wars Dawn Of The Jedi 00 (2012)","author":"DueReception7103","url":"https:\/\/i.redd.it\/rtx20feyunma1.png","text":"","upvote_ratio":0.74,"created_utc":1678344713.0},{"title":"What’s your favorite Bad Batch episode so far?","author":"InfiniteDedekindCuts","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mydnn\/whats_your_favorite_bad_batch_episode_so_far\/","text":"For me it’s probably a toss up between The Solitary Clone and Aftermath","upvote_ratio":0.6,"created_utc":1678383520.0},{"title":"Cal Kestis, Din Djarin, Cassian Andor & The Third Sister are all similar in age","author":"Ricozilla","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n7oux\/cal_kestis_din_djarin_cassian_andor_the_third\/","text":"If my knowledge of the current canon timeline is correct Cal, Din, Andor & Reva are all roughly around the same age? \n\nCal & Reva were both young Padawans during the Clone Wars, in a flashback during The Mandalorian Season 1 we see a young Din hiding from Super Battle droids & we see a young Andor watching Clone Troopers marching through Ferrix. \n\nJust an observation I thought about. \n\nI would like to see Cal & Reva interact in live action at some point.","upvote_ratio":0.45,"created_utc":1678404693.0},{"title":"I’ve been showing someone Star Wars for the first time","author":"J-D-B-9-8","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11moemu\/ive_been_showing_someone_star_wars_for_the_first\/","text":"So my sister has never seen Star Wars. I was really intrigued by what her opinions would be, considering she hasn’t got any fan bias; she also tends to find it hard to get into older films a lot of the time.\n\nA New Hope - she was blown away by how much she enjoyed it\n\nThe Empire Strikes Back - she loved it, and said that she liked A New Hope even more now that she could see the groundwork it did\n\nReturn of the Jedi - she said it was one of the best films she’d ever seen\n\nThe Phantom Menace - she was visibly disappointed with this one, but she loved JarJar\n\nAttack of the Clones - she claimed this was “way better” than Episode I\n\nRevenge of the Sith - she thought it was really good\n\nThe Force Awakens - she really liked it, but did think it borrowed too much from the original\n\nWe’re moving to The Last Jedi next week.\n\nHer ranking and ratings:\n\n1. Return of the Jedi (10)\n\n2. A New Hope (9.5)\n\n3. The Empire Strikes Back (9)\n\n4. Revenge of the Sith (8.5)\n\n5. The Force Awakens (8)\n\n6. Attack of the Clones (8)\n\n7. The Phantom Menace (5\/6)","upvote_ratio":0.83,"created_utc":1678356118.0},{"title":"Found a Boba Fett B&W kodak print. Is it official?","author":"Mikey_Moonshine","url":"https:\/\/i.redd.it\/1hlkem09erma1.jpg","text":"","upvote_ratio":0.6,"created_utc":1678369509.0},{"title":"We need this… Lucasfilm please give us Tales of the Sith","author":"snieves0426","url":"https:\/\/i.redd.it\/g3imi3uebhma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678247484.0},{"title":"Palpatine if his true form was revealed earlier (edits)","author":"throwawayoogaloorga2","url":"https:\/\/i.redd.it\/0vg0e7r1djma1.png","text":"","upvote_ratio":0.87,"created_utc":1678290284.0},{"title":"Why does C-3P0 say his job is \"human-cyborg relations?\"","author":"Bootlebat","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mxrht\/why_does_c3p0_say_his_job_is_humancyborg_relations\/","text":"IIRC we never actually see him facilitating a meeting\/translation between humans and cyborgs (I think Vader is the only cyborg in the OT, correct me if I'm wrong.) Instead, he mainly translates between humans and other (biological) aliens.","upvote_ratio":0.62,"created_utc":1678382099.0},{"title":"Lego Buildable Dark Trooper I made long ago","author":"Lordfindogask","url":"https:\/\/i.redd.it\/pmp06ap30lma1.png","text":"","upvote_ratio":0.91,"created_utc":1678310190.0},{"title":"Anakin self cosplay. Grew my hair out for a year and a half and topped $500 for this hope it’s worth it !","author":"ItsNotAMankey","url":"https:\/\/www.reddit.com\/gallery\/11ljod8","text":"","upvote_ratio":0.95,"created_utc":1678242859.0},{"title":"a guess, a theory on the mandalorian.","author":"Training-Ad-9765","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mk7a6\/a_guess_a_theory_on_the_mandalorian\/","text":"Mandalore and the Mandalorians had many rulers in the past. All contributing to the eventual scattering. They tried everything. Being pacifist, violent, conquering, aligning with Jedi and sith, and opposing both. \n\nNothing worked out for them and the people scattered among the stars. \n\nBo-Katan saving Din represents both. The sister of the pacifist and a child of the watch. Representing both the old ways and the new Mandalorians. The past wields the dark saber with great proficiency and Mando struggles.\n\nWhere Satine was too pacifist bo-katan doesn't fear violence but knows where it leads and shows restraint. Din doesn't and just walks in, kicks ass, and takes names.\n\nBoth are required to rule the Mandalorians as a people. Warrior-like in nature and honorable by the creed. Pacifist in nature but a force to be reckoned with when threatened.\n\nMy guess or theory is that they have to co-rule the Mandalorians. I have this in no way fleshed out but just a hunch or guess.","upvote_ratio":0.74,"created_utc":1678340926.0},{"title":"A Toast…to the man with the biggest balls in The Empire","author":"illagorilla","url":"https:\/\/i.redd.it\/nmcz386p3gma1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678232783.0},{"title":"When does the \"Night of A Thousand Tears\" take place?","author":"BigFatFrog5","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mmg1b\/when_does_the_night_of_a_thousand_tears_take_place\/","text":"I need know for a project but every thing I read, including Wookiepedia is unclear so I got the thought to ask all I need is a year and the only info I for know is true is that it can't take place before \"Star Wars: Rebels\"","upvote_ratio":0.86,"created_utc":1678348589.0},{"title":"How do cosplayers make armor or helmets? Do they all just buy them off of Etsy or is there a way to make it and make it comfortable?","author":"criosovereign","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n66e1\/how_do_cosplayers_make_armor_or_helmets_do_they\/","text":"My friends and I are new to this and are looking to make clone and mandalorian armor for a convention, what do most fans do?","upvote_ratio":0.33,"created_utc":1678401282.0},{"title":"I want your opinion. Does this sound like a cool idea for a Star Wars series?","author":"Curious447","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mm9gp\/i_want_your_opinion_does_this_sound_like_a_cool\/","text":"Instead of having a show about a specific character the show would be about a planet.  Coruscant.  It would tell the story of the planet throughout its history.  Coruscant itself would be the narrator of the series.  The series wouldn't have any overarching villain or anything it would simply consist of 15 to 20 minute episodes showing Coruscant at different points in its history.\n\nCoruscant: I have seen it all.\n\nSome of the episodes would include the distant past when epic wildlife walked the surface, a period when it was at earth like level of development, when it was the epic capital of the galaxy and the distant future when it is a fallout like post-apocalyptic wasteland with ruined buildings and not a living thing in sight.  It would include other episodes at different time stages too.\n\nThe series would end with the camera zooming in and a small creature pokes its head out of the rubble in the world that was thought to be dead and Coruscant says the will of the force is life.  Then the credits roll.\n\nAlso featured would be epic moments like Darth Malgus and the ancient Sith invading Coruscant, the building of the Jedi Temple and of course the classic Palpatine Unlimited Power!\n\nI want your honest opinion folks does this sound like it would be a cool idea?","upvote_ratio":0.71,"created_utc":1678347922.0},{"title":"Mando s02e03 revelations and possible...fun","author":"allannon","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nf513\/mando_s02e03_revelations_and_possiblefun\/","text":"Here be spoilers.\n\nExogorth-sized ones.\n\nDon't say you weren't warned.\n\n(Edit: if there's a way to block-spoil things, so you don't have click eleventy-dozen times to read all this, I'm all ears.)\n\n>!So three things happened that I think have interesting implications:!<\n\n1. >!Yup, the big one: the mythosaurs are back!<\n2. >!Bo-katan won the Darksaber in combat!<\n3. >!There are now two great Mandalorian symbols in play.!<\n\n>!Where's the fun?  I think we're headed to a second Mandalorian civil war.!<\n\n>!Oh, and Mandalore (the planet) is habitable.!<\n\n>!So, here's my thinking:!<\n\n>!The mythosaur is the original symbol of...well, being a Mandalorian.  Mandalor the Great, yada and so on.  I have this sneaking suspicion that if someone were to replicate that, they'd be like Mandalor the Great II.!<\n\n>!Bo-katan took the darksaber and killed the...um...whatever that thing was.  Cheap Grievous knockoff with a beetle tank?  (Please don't actually be Grievous.)  Anyway, she took the Darksaber and killed the knockoff, and the knockoff had taken the saber after beating Din, so I think it's now properly (by Mando custom) hers again.!<\n\n>!So we come to the matter of symbols; I don't think I need to explain the mythosaur and Darksaber around here.  But what is important is that there's two.  Din already had one, the Darksaber, but could never use it with any more facility than I would a solid-iron baseball bat; Bo-katan, on the other hand, uses it like...well, a trained swordswoman with a sword.  On the other hand, I think Din's oddly (for a religious fanatic) more flexible than Bo-katan, and will end up forming some bond or agreement with the mythosaur...whereas Bo-katan will try to take it's skull.!<\n\n>!So I think we're going to end up with a civil war.  On one side are \"Din's Mandos\": traditionalists who value the older symbol (that being the bond with the mythosaur, rather than it's skull hanging over a throne) more, and value Mando society over trappings.  On the other is Bo-katan's ideal Mando society, who want to push themselves back to the forefront of combat and demonstrate that with trophies.!<\n\n>!Side note: I don't think Boba Fett will get much involved.  Before taking a vacation in the Sarlacc (1 out of 5 stars: terrible service, worse housekeeping) he probably would have sided with Bo-katan, but I think now his leanings would be toward Din...but he'd also recognize the stupidity of yet another Mandalorian civil war.!<\n\n>!As for the war itself, I don't think it'll be extended.  In the end Din will take his Mandos, and leave the shell of Mandalore to Bo-katan, just not seeing them as having the same importance as the Mandalorian people.!<","upvote_ratio":0.24,"created_utc":1678423937.0},{"title":"help I'm making fanfiction","author":"ArbiterOfRichard","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n5pu5\/help_im_making_fanfiction\/","text":"Alright so I was making a list of clones for a platoon in the 104th Attack battalion on a whim that had an Arquitens Light Cruiser as their headquarters. But, I need to know if an AT-TE can fit in the Arquitens. Any help would be appreciated.","upvote_ratio":0.29,"created_utc":1678400269.0},{"title":"Small pack of salt from collaborative funding campaign with Mark Hammil for Ukraine","author":"blinkinski","url":"https:\/\/i.redd.it\/ijxuzbnjkmma1.jpg","text":"","upvote_ratio":0.87,"created_utc":1678311098.0},{"title":"Lucasfilm, I pitch to you the idea of Tales from the Clone Wars, a spiritual successor to the Clone Wars and a way to do the arcs we never saw.","author":"snieves0426","url":"https:\/\/www.reddit.com\/gallery\/11m75fd","text":"","upvote_ratio":0.72,"created_utc":1678307240.0},{"title":"2.5x3.5\" Darth Vader Sketch Card I drew for Gabe's Cave!","author":"OptimusPyle","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mvxdy\/25x35_darth_vader_sketch_card_i_drew_for_gabes\/","text":"&#x200B;\n\nhttps:\/\/preview.redd.it\/kse77z03lqma1.png?width=1280&format=png&auto=webp&v=enabled&s=457d7b12545e530e624f694870b285418325eb77","upvote_ratio":0.5,"created_utc":1678377764.0},{"title":"In case you didn’t make the connection in Tales of the Jedi…","author":"KulaanDoDinok","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11ndu4v\/in_case_you_didnt_make_the_connection_in_tales_of\/","text":"Yaddle was mentioned in Fallen Order by Greez, and Cere mentions she’s a member of the Jedi High Council.","upvote_ratio":0.29,"created_utc":1678420259.0},{"title":"Mando drawing I did","author":"DylanRRRR","url":"https:\/\/i.redd.it\/rr1w056x8lma1.png","text":"","upvote_ratio":0.88,"created_utc":1678295076.0},{"title":"Why are all stormtroopers human?","author":"No_Literature_8903","url":"https:\/\/i.redd.it\/jkpuveq67fma1.jpg","text":"","upvote_ratio":0.92,"created_utc":1678221849.0},{"title":"New Star Wars movie","author":"rego21","url":"https:\/\/www.madeiraislandnews.com\/2023\/03\/madeira-as-a-backdrop-for-the-new-star-wars-movie.html","text":"","upvote_ratio":0.54,"created_utc":1678376069.0},{"title":"What event or character story would you like to see brought to screens","author":"WaffleHousesNewHost","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n0zxp\/what_event_or_character_story_would_you_like_to\/","text":"Can be anything from legends to books, cannon magazines or just anything really?","upvote_ratio":0.25,"created_utc":1678389537.0},{"title":"Rebels Spoilers - More Connected Sequels","author":"NamarGaming","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11na6eo\/rebels_spoilers_more_connected_sequels\/","text":"Recently, I finished rewatching Rebels to prepare for Mando season 3 and it occured to me how cool could've been if the sequels connected better with the shows. Imagine instead of Poe and BB8, we had Jacen Syndulla and Chopper.","upvote_ratio":0.23,"created_utc":1678410757.0},{"title":"Sequel vs Prequels","author":"wolfey200","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11nelxe\/sequel_vs_prequels\/","text":"The reason I believe the prequels are more loved than the sequels (even with both being hated when they were released) is that there was a plan and a story with the sequels. George Lucas knew what he was setting up for and he knew what the whole premise of the prequels were. Even though major details were poorly described in the movies, the Clone Wars series tied everything together. The sequels were thrown together in an attempt to hurry and finish the story. There are interviews where the creators didn’t even know what they were going to do with Rey up until the last minute and they made her a Palpatine. This isn’t a hate post it’s just my opinion on why the sequels get so much hate.","upvote_ratio":0.16,"created_utc":1678422409.0},{"title":"Droid Rebellion","author":"Zestyclose-Level5222","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n0m7c\/droid_rebellion\/","text":"What if a droid rebellion broke out in star wars world and jedi + sith were fighting against droids? Would you like to watch such an saga? Which side do you think would win?","upvote_ratio":0.33,"created_utc":1678388660.0},{"title":"Opinion: The Bad Batch season 1 and 2 (so far at least)>>>>>>> TCW season 1 and 2","author":"WilMeech","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n0f6a\/opinion_the_bad_batch_season_1_and_2_so_far_at\/","text":"","upvote_ratio":0.4,"created_utc":1678388229.0},{"title":"Waititi’s Movie","author":"chicagojedi2017","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n9nur\/waititis_movie\/","text":"Do you think they’re trying to bring back IG 11 in The Mandalorian because he’s gonna play a big part in the movie?","upvote_ratio":0.1,"created_utc":1678409459.0},{"title":"The idea that the Clones were forced to retire and slowly faded away hits the right level of Evil Governing that the prequels tried to go for.","author":"Knalxz","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mgyu2\/the_idea_that_the_clones_were_forced_to_retire\/","text":"To think that these legendary soldiers who saved the galaxy and brought the Jedi Order to the brink of extinction didn't go out in some blaze of glory against their insurmountable foes, they weren't given esteemed cushy jobs and allowed to give lives like the ancient Hutts, they were told \"Good job, now go home.\" It hits so hard like what happened to so many war vets too, it reminds me of the final scenes of Band of Brothers were they're just playing baseball wondering what to do now and one phone call and two nukes later, the war is over.\n\nIt's just a sad way to go, especially for people literally breed to serve a military life. It's like forcing a dog not to bark, just a twisted thing to do.","upvote_ratio":0.76,"created_utc":1678331296.0},{"title":"becoming a bartender on tatooine | Star Wars Battlefront VR","author":"itsjustmonty_","url":"https:\/\/youtu.be\/7DCqktXodys","text":"","upvote_ratio":0.5,"created_utc":1678374121.0},{"title":"Omega’s voice","author":"Wilson_serenity10","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mjjnz\/omegas_voice\/","text":"Does anyone else think it’s weird that Omega has an accent even though she was taught how to talk by the Kaminoans?","upvote_ratio":0.78,"created_utc":1678338821.0},{"title":"If you could have any canon ships from the movies, tv shows, and comics in real life, what would you pick, and why?","author":"cmoore993","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mznzb\/if_you_could_have_any_canon_ships_from_the_movies\/","text":"","upvote_ratio":0.25,"created_utc":1678386475.0},{"title":"In the name of the Galactic Senate of the Republic, you're under arrest, Chancellor feat. Red Dead Online","author":"TheQuietNotion","url":"https:\/\/v.redd.it\/4wu9olqwakma1","text":"","upvote_ratio":0.81,"created_utc":1678301747.0},{"title":"Anyone else not want din to rule mandalore or be the sole ruler?","author":"JaxonV21","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mtjoo\/anyone_else_not_want_din_to_rule_mandalore_or_be\/","text":"I know din has the dark saber and there is a theory he will find the mask of mandalore the great or something in the mines. But honestly I think bo katan should become the ruler instead of din. He doesn’t strike me as a leader or more accurately a king. I at least think they should rule together. Thoughts?","upvote_ratio":0.47,"created_utc":1678371961.0},{"title":"It's hilarious how autotuned this hutt's voice is lmao (sorry for bad video quality)","author":"ReadyPlayer12345","url":"https:\/\/v.redd.it\/at1ntq2nlmma1","text":"","upvote_ratio":0.66,"created_utc":1678329475.0},{"title":"Clone Wars S1 E6","author":"TransportationFew393","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11myajt\/clone_wars_s1_e6\/","text":"been rewatching clone wars here and there, jumping about wherever I feel like it, I never noticed how garbage the animation is in this specific episode?\n\nlike it's god awful, some scenes are better than others, but half the time shits barely even rendered. this is even by season 1 standard, where there was always shit that looked dicey, but never this bad??\n\nthe medbay scene is so horribly bright, the opening scene has the characters barely moving, and the hologram of obi-wan is hilariously unrendered. there's even a shot of Greivous as a hologram where one of his hands isn't even posed at all? his fingers are outstretched, and it looks so funny.\n\nby no means do I hate the arc. it's still been a good episode, but sweet Mary mother of God was it rough. I have to say though, the unorthodox soundtrack is really cool. it stands out way more than other episodes, where the songs are much more traditional star wars vibes.\n\nis there any bts reasons it was so bad here in particular? did they not get enough time, was it the first they worked on? it's much worse than the rest of the season so there must be a reason.","upvote_ratio":0.33,"created_utc":1678383319.0},{"title":"Looking for a friend to join for Star Wars celebrations in London.","author":"Rare_Sand1625","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11moen3\/looking_for_a_friend_to_join_for_star_wars\/","text":"This is a long shot but can I join anyone on the Saturday Star Wars celebrations? My friend has cancelled on me and I don't really want to go on my own but those tickets were expensive and you can't get a refund and I was wondering if I could join anyone\/ a group. 20M, I have good convention etiquette, I'm very friendly and good company and if you want to know more about me PM.","upvote_ratio":0.75,"created_utc":1678356118.0},{"title":"saw this today, i guess boss nass' design was probably based on this concept or at the very least a leftover.","author":"FizzyCocoaMan","url":"https:\/\/i.redd.it\/in1hdxzrpgma1.jpg","text":"","upvote_ratio":0.99,"created_utc":1678240218.0},{"title":"Star Wars novels","author":"Interesting_Dog_2712","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mxy8k\/star_wars_novels\/","text":"Which ones are worth reading? Ik thrawn is in some and I’m kinda interested in whatever Mara jade is in with Luke. I just don’t know if they’re worth reading and where to start.","upvote_ratio":0.43,"created_utc":1678382531.0},{"title":"What story would you like to see brought to screen that hasn’t already been made?","author":"WaffleHousesNewHost","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mscal\/what_story_would_you_like_to_see_brought_to\/","text":"Can be from legends magazines cannon books or literally just anything!","upvote_ratio":0.4,"created_utc":1678368912.0},{"title":"Best Mando recap podcast?","author":"One_Zookeepergame233","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mx0jq\/best_mando_recap_podcast\/","text":"I loved Mallory Rubin and Jason Concepcion’s Binge Mode show. I loved how they both recapped and did an exhausting deep dive into some topic or character in that episode. I know they’re both doing their own thing now. Do either of their shows come close to recapturing that dynamic?  I’ve tried both Ringerverse and X-Ray Glasses. I thought Ringerverse was closer to what I was looking for but is there a better, more heavily researched podcast I’m not aware of that I should check out that comes closest to what Binge Mode was like?","upvote_ratio":0.25,"created_utc":1678380342.0},{"title":"Not happening, but they should bring this concept back from Legens for R5-D4. lol.","author":"MagosBattlebear","url":"https:\/\/i.redd.it\/b60b9njo3oma1.jpg","text":"","upvote_ratio":0.65,"created_utc":1678329634.0},{"title":"What did Qira and Maul Do after Solo?","author":"WaffleHousesNewHost","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mqtbp\/what_did_qira_and_maul_do_after_solo\/","text":"Where did Qira go? \n\nWhat happened to Maul? \n\nWhat was their plan what did they get up to? \n\nHow does Qira die?","upvote_ratio":0.5,"created_utc":1678364524.0},{"title":"I wish Disney was still doing home video releases for the tv shows.","author":"DuctTapeHero","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11m4k13\/i_wish_disney_was_still_doing_home_video_releases\/","text":"Especially in this era of $10 million+ episodes, such a shame to limit to streaming quality. My clone wars box set feels incomplete without season 7, and Mando is begging for a full 4K dolby vision steelbook. I find it hard to believe the releases wouldn't be profitable.","upvote_ratio":0.84,"created_utc":1678301470.0},{"title":"Does everybody just refer to their Astromech droid by their general series? lol","author":"xijingpingpong","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mkptj\/does_everybody_just_refer_to_their_astromech\/","text":"If there are multiple of the same series of Astromechs kept together, I would assume that calling them \"R4\" or \"R2\" would get very confusing very fast. lmao","upvote_ratio":0.8,"created_utc":1678342602.0},{"title":"…This Boba Fett Lightsaber makes no sense.","author":"Fotographo","url":"https:\/\/i.redd.it\/ako1ypkg0nma1.jpg","text":"","upvote_ratio":0.75,"created_utc":1678316444.0},{"title":"a sucker for references..","author":"PhysicalAccount4244","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mq07a\/a_sucker_for_references\/","text":"I have not been a fan of StarWars for long.. started watching it seriously about 2 years ago.. and I have watched every show and movie to date and played Fallen Order (not read any books or comics)\nAnd, I am a sucker for references!!\n\nWhen I played Fallen Order, I loved every moment spent in areas I've seen in the shows. Best part was when getting a new Kyber Crystal. I was like \"over there Yoda stod, and that door is truley massive, and the big crystal hanging from the ceiling.. .. \"\n\nThese things just makes me feel great, and it's just nice when developers and show writers pay attention to these details..\n\nWatching the madalorian S3E2 gave another one of these feelings when we got to see a certain city in live action for the first time!\n\nBut.. enough with the feel good details..\n\nDoes anyone here noticed the opposite.. when they reference an old thing, and it looks, sounds or feel nothing like the source? And it made you feel disapointed?\n\nFor me, that was the live action Grand Inquisitor.. I loved his performance, but if no one told me that he was the Grand Inquisitor, I would just assume he was some other random Inquisitor, as he has no resemblence at all to his original look.\n\nWhat are your favourite good references, that gave you the most goosbumps?\nAnd what are the most disapointing failed references, that left a big black gaping hole in your soul?","upvote_ratio":0.5,"created_utc":1678361971.0},{"title":"Isn’t Bo-Katan roughly the same age as Obi-Wan? Why does she look so young in the Mandalorian?","author":"savva1995","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11m6phc\/isnt_bokatan_roughly_the_same_age_as_obiwan_why\/","text":"Say she’s max 10 years younger than Obi-Wan. By the time of Mandalorian Obi-Wan would be in his 60s. Which would put Bo in her 50s. She looks in her 30s.","upvote_ratio":0.74,"created_utc":1678306231.0},{"title":"wanted to share my baby shower invitation","author":"BoysenberryAshamed","url":"https:\/\/i.redd.it\/njrt8hizcnma1.jpg","text":"","upvote_ratio":0.61,"created_utc":1678320654.0},{"title":"The mandalorian season 3 episode 2 (spoilers)","author":"jpvegacreative","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mxz9u\/the_mandalorian_season_3_episode_2_spoilers\/","text":"Was that supposed to be general grievous? Or is it just an homage, I heard a subtle cough, maybe it’s his cyborg body scraped from his corps… I would like to discuss but no sources yet.","upvote_ratio":0.42,"created_utc":1678382598.0},{"title":"how does light enter the city when it's just one big mental dome ?","author":"IceAndFire23","url":"https:\/\/www.reddit.com\/gallery\/11mew2t","text":"","upvote_ratio":0.61,"created_utc":1678325663.0},{"title":"The Mandalorian concept art from the end credits of Chapter 18","author":"NaiadoftheSea","url":"https:\/\/www.reddit.com\/gallery\/11lrexq","text":"","upvote_ratio":0.97,"created_utc":1678266232.0},{"title":"What did Padmé think of Anakin’s tattoos?","author":"Difficult_War_840","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n7cym\/what_did_padmé_think_of_anakins_tattoos\/","text":"","upvote_ratio":0.25,"created_utc":1678403947.0},{"title":"So everyone knows how vitiateb\/ tenebrae was the closest to Anakin with 25200 midchlorians, correct? If he was to reach his fp of that (like 1\/2k more than Luke) how powerful would he have been compared to legends Luke and fp Anakin and other legend characters","author":"Automatic_Ad_4454","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n2wzg\/so_everyone_knows_how_vitiateb_tenebrae_was_the\/","text":"","upvote_ratio":0.29,"created_utc":1678393952.0},{"title":"What Tales of the Jedi would everyone want to see?","author":"ii-middleton","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mco3q\/what_tales_of_the_jedi_would_everyone_want_to_see\/","text":"Personally I really hope that we get an episode around Obi-Wan and Satine when they were younger","upvote_ratio":0.66,"created_utc":1678320014.0},{"title":"Really liking my boba wall.","author":"vibez-28","url":"https:\/\/i.redd.it\/u3wiuroaykma1.jpg","text":"","upvote_ratio":0.83,"created_utc":1678291502.0},{"title":"[OC] “He means more to me than you will ever know.” (Me, Digital)","author":"Lazy2320","url":"https:\/\/i.redd.it\/lt8p0xqf8mma1.jpg","text":"","upvote_ratio":0.69,"created_utc":1678325069.0},{"title":"Have we ever seen a Starwars prison?","author":"sonofloki13","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11myed1\/have_we_ever_seen_a_starwars_prison\/","text":"Im not talking someone being captured, I mean a real prison like after being tried and found guilty. If we have when? It may be obvious im just not sure. Thanks guys🤟🏻","upvote_ratio":0.38,"created_utc":1678383566.0},{"title":"question, so people call legends Luke > pre exile Luke, but isn't pre exile Luke pretty much legends Luke? because this is \"pre exile\" Luke, meaning it's before he went into exile and he's alot older and has more knowledge so wouldn't legends Luke be equal to pre exile Luke in all but knowledge?","author":"Automatic_Ad_4454","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mocz1\/question_so_people_call_legends_luke_pre_exile\/","text":"","upvote_ratio":0.57,"created_utc":1678355974.0},{"title":"So I finally got around to watching Star Wars rebels and I don’t see where all the hate comes from. It has some pretty good writing. Why do so many people not like it?","author":"Loud_Remove5140","url":"https:\/\/i.redd.it\/d7uxts75jfma1.jpg","text":"","upvote_ratio":0.9,"created_utc":1678225871.0},{"title":"Din Jarin seems to have far less battle prowess than every other Mandalorian -- he is saved only by wearing *literal* plot armor","author":"Nemarus","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n1wb2\/din_jarin_seems_to_have_far_less_battle_prowess\/","text":"I like that in all of the seasons of The Mandalorian, Din Jarin is, at best, a mildly competent fighter. Compared to Bo-Katan, or Boba Fett, Din spends a lot more time taking hits than delivering them. \n\nYet his pure Beskar armor (which he got by *hunting down a baby and then reneging on a contract*) basically makes him virtually invulnerable.","upvote_ratio":0.27,"created_utc":1678391617.0},{"title":"Ask me A question about Star Wars then change the Question after I answer to make me look bad","author":"Flat_Scheme4874","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11myvno\/ask_me_a_question_about_star_wars_then_change_the\/","text":"Feel free to ask anything nothing is off limits Do your Best!","upvote_ratio":0.31,"created_utc":1678384688.0},{"title":"We ever getting bothans?","author":"mariorac","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mjr7d\/we_ever_getting_bothans\/","text":"Have we seen any between live action and animated? My boy Borsk Felya needs to get some respect.","upvote_ratio":0.54,"created_utc":1678339485.0},{"title":"DLT-19 3D Printed Model Test","author":"Holybeardman","url":"https:\/\/www.reddit.com\/gallery\/11m69l3","text":"","upvote_ratio":0.85,"created_utc":1678305273.0},{"title":"Random thought of the day: people really be sleeping on Din Djarin's piloting skills.","author":"Educational-Tea-6572","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mj6t4\/random_thought_of_the_day_people_really_be\/","text":"That is all.","upvote_ratio":0.61,"created_utc":1678337739.0},{"title":"Does anyone have a good quality gif of Anakin lighting his saber and turning into Darth Vader?","author":"Redguykillsu","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mxbiz\/does_anyone_have_a_good_quality_gif_of_anakin\/","text":"","upvote_ratio":0.13,"created_utc":1678381068.0},{"title":"[Spoiler] Thinking about the weapons the Empire used","author":"Kiloku","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mfsks\/spoiler_thinking_about_the_weapons_the_empire_used\/","text":"To truly destroy Mandalore, they used *fusion* bombs. Usually we get Sci-fi sounding weapons, but fusion bombs are thermonuclear bombs that have been tested in our world. The most powerful nuclear explosion in history was from a fusion bomb test.  \n\nIt feels meaningful to me as Star Wars tech levels probably make this type of weapon rare, because they are too crude. Maybe they chose thermonuclear weapons to cause radiation to poison the planet (as everyone seemed to believe it had)? Or maybe it's still the most powerful choice for non-deflector-shielded but useless otherwise?","upvote_ratio":0.67,"created_utc":1678328096.0},{"title":"Here’s my custom Mandalorian armor, made and modified over 2 years","author":"ReProps","url":"https:\/\/www.reddit.com\/gallery\/11lkui7","text":"","upvote_ratio":0.98,"created_utc":1678245911.0},{"title":"is it still possible to see the original theatrical version of starwars ?","author":"IceAndFire23","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11meypc\/is_it_still_possible_to_see_the_original\/","text":"","upvote_ratio":0.63,"created_utc":1678325857.0},{"title":"Best playthrough of fallen jedi on youtube","author":"Cbabber","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mm1ed\/best_playthrough_of_fallen_jedi_on_youtube\/","text":"Need recommendations on starwars fallen jedi playthrough on youtube.","upvote_ratio":0.6,"created_utc":1678347110.0},{"title":"Obiwan ver. Grand Inquisitor cosplay by me!","author":"D0mhnail","url":"https:\/\/www.reddit.com\/gallery\/11lhd7i","text":"","upvote_ratio":0.97,"created_utc":1678236937.0},{"title":"Settle this dispute: Uncle Luke says he sensed the evil in Kylo and for an instant was going to kill him. His nephew claims he only become evil because his uncle tried to murder him in his sleep. Both of these stories seem like total bullish but one has to be true, but which one?","author":"Groundbreaking-Pea92","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mvw0h\/settle_this_dispute_uncle_luke_says_he_sensed_the\/","text":"","upvote_ratio":0.38,"created_utc":1678377683.0},{"title":"Why is this so iconic?!","author":"SMmania","url":"https:\/\/youtu.be\/7dQP8oBOfHI","text":"","upvote_ratio":0.5,"created_utc":1678345389.0},{"title":"Official Celebration Poster: “Guardians of the New Republic”","author":"Fulcrum_is_no_Jedi","url":"https:\/\/i.redd.it\/7udhn741ocma1.jpg","text":"","upvote_ratio":0.94,"created_utc":1678191193.0},{"title":"'Star Wars': Kevin Feige, Patty Jenkins Movies Shelved","author":"TheSharkFromJaws","url":"https:\/\/variety.com\/2023\/film\/news\/star-wars-kevin-feige-patty-jenkins-movies-shelved-1235545774\/","text":"","upvote_ratio":0.96,"created_utc":1678221478.0},{"title":"Might be an unpopular opinion, but does anyone else find how Bad Batch handles the transition from Clones to Recruits compared to Legends or even most of Canon previously, kind of dumb? Why force your entire army, the majority still loyal, to retire extremely early?","author":"Blitz_Prime","url":"https:\/\/i.redd.it\/x17800w8lpma1.png","text":"","upvote_ratio":0.48,"created_utc":1678365666.0},{"title":"How did PROXY get to Jabbas Palace in TFU?","author":"asperl2030","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mkr6g\/how_did_proxy_get_to_jabbas_palace_in_tfu\/","text":"In the tattoine dlc of the first Force Unleashed game, after you fight the rancor and get into what I'm assuming is some sort of scrap yard(?) You come across PROXY (the holodroid that accompanies you throughout the game) who is missing limbs and not looking too hot, there's some pretty straightforward dialogue and he helps you one last time before you either leave him behind or he is taken when you try to bring him with, and I have not found anything that would indicate how he got there in the first place, is this left unexplained? I understand that the dlc are not exactly tied into the story and more 'what if' scenarios, but it made me question it as Starkiller seemed to show some sadness when thanking his friend for the last time.\n\nRun-on, I know, I'm sorry.","upvote_ratio":0.67,"created_utc":1678342727.0},{"title":"I FINALLY got my hands on the two Captains in Lego form! All though not the actual minifig, i'm still pretty happy! + Here are 2 MOC \"Old Clones\" minifigures","author":"Mysterious-Advance73","url":"https:\/\/www.reddit.com\/gallery\/11m3jad","text":"","upvote_ratio":0.8,"created_utc":1678299136.0},{"title":"Bring him HOME","author":"the800kidd","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mk4yj\/bring_him_home\/","text":"Just finished rewatching Rebels (AGAIN) and I've only got one thing to say: #findezra #returnofbridger #familyreunion","upvote_ratio":0.57,"created_utc":1678340717.0},{"title":"Mandolorian Civil War Series","author":"Screenwriter6788","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11m9q88\/mandolorian_civil_war_series\/","text":"Maybe it can be told from the perspective of Jango Fett and how the ordeal made him desperate enough to make a deal with Dooku.","upvote_ratio":0.86,"created_utc":1678313196.0},{"title":"I made a pretty stupid action figure","author":"psybermonkey15","url":"https:\/\/i.redd.it\/xm65wz3pudma1.png","text":"","upvote_ratio":0.96,"created_utc":1678223567.0},{"title":"Was there ever anything like the Star Trek Prime Directive in the Star Wars universe?","author":"raknor88","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mjneq\/was_there_ever_anything_like_the_star_trek_prime\/","text":"I know in Star Wars most of the galaxy is mapped and settled, or at least is seems like it is, but did the Republic or Old Republic ever have a rule similar to the Prime Directive when dealing with pre-space age civilizations?","upvote_ratio":0.5,"created_utc":1678339148.0},{"title":"Watching Star Wars for the first time...","author":"No_Weird_4204","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mjhh1\/watching_star_wars_for_the_first_time\/","text":"Watched the Original trilogy. Then Episode 1 and 2. Now I'm on episode 3.\n\nI'm only about 20 minutes in, and looking forward to seeing Anakin's transition. But why does General Grievous keep coughing?! Isn't he a robot? It makes no sense that a robot is coughing. Is there more to his story? What am I missing?","upvote_ratio":0.54,"created_utc":1678338627.0},{"title":"Mount Rushmore of Star Wars Pilots","author":"Dfrickster87","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mjc6y\/mount_rushmore_of_star_wars_pilots\/","text":"Inspired by the post a few minutes ago. \n\n\nBest 4 pilots in Star Wars, who ya got?","upvote_ratio":0.45,"created_utc":1678338174.0},{"title":"10 minutes into Mando S3E2 and…","author":"gilligansisle4","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11n1h37\/10_minutes_into_mando_s3e2_and\/","text":"I’m raging right now because this makes no sense to me at all. Mando spends the whole first episode trying to get his old droid buddy back on Nevarro, insisting repeatedly that he can only take THAT droid with him on his journey because they’re besties. HIGH Magistrate Karga says they’ve got some of the best droidsmiths there and that he can pretty much take any droid he wants, but NO… he MUST have his FRIEND.\n\nSo he goes to Tattooine to try his luck with the Jawas to get the part he needs, and the second they say no, he decides to take some beat up old R5 unit that is clearly terrified and doesn’t want to go.\n\nWTF!? It makes NO SENSE! Is this absolutely terrible writing or am I missing something?","upvote_ratio":0.31,"created_utc":1678390612.0},{"title":"My wife said I could order a new Barbecue and didn’t want to help me pick one out. This will be arriving in 8 weeks. (She is not a StarWars Fan) This should be funny! 😂","author":"BlacksheepEDC","url":"https:\/\/i.redd.it\/65lzmu6ru9ma1.jpg","text":"","upvote_ratio":0.91,"created_utc":1678157146.0},{"title":"That snake thingy from the clone wars episode Brothers","author":"Zimboy112","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mhvz4\/that_snake_thingy_from_the_clone_wars_episode\/","text":"It’s pretty weird how he did not notice the family resemblance between Savage and Darth Maul, and didn’t figure that his “master” was his brother who he was looking for and just assumed that he would eat him.","upvote_ratio":0.33,"created_utc":1678333898.0},{"title":"Will we see more of Qira and Maul any time soon or at all?","author":"WaffleHousesNewHost","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mo08p\/will_we_see_more_of_qira_and_maul_any_time_soon\/","text":"I haven’t really been keeping up with leaks does anyone know if there’s been any rumours or anything? \n\nThe ending of Solo feels empty since it kind of leads to nothing.\n\nWill a Solo 2 ever come out or a spin off show?","upvote_ratio":0.4,"created_utc":1678354561.0},{"title":"Thoughts on Mando s3 ep2","author":"PHANTOMBITZ","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mh94j\/thoughts_on_mando_s3_ep2\/","text":"HOLY SHIT HOLY BALLS THEY BROUGHT THE FUCKING MYTHOSAUR BACK","upvote_ratio":0.53,"created_utc":1678332089.0},{"title":"I now own the Original Trilogy on 6 different formats.","author":"BebopHop515","url":"https:\/\/www.reddit.com\/gallery\/11l20e3","text":"","upvote_ratio":0.98,"created_utc":1678202255.0},{"title":"Could Mandalore’s mask show up in the Mandalorian?","author":"Optimal-Region5437","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mnpak\/could_mandalores_mask_show_up_in_the_mandalorian\/","text":"I have a theory, since as of late in the Mandalorian it seems that there may be a plot point that Mando and Bo Katan may have to fight to get the dark saber since without winning it in combat she couldn’t become leader of Mandalore but there is another solution that I personally think would be really cool and make sense. That being Bo Katan finds Mandalore’s mask. For context Mandalore was the title given to some of the great leaders of the Mandalorians and they had a mask simply known as Mandalore and something at the end, the mist famous being Mandalore the ultimate who if you didn’t know was defeated in one on one combat against the Jedi Revan who took his mask and hid it. He eventually came back to the planet he hid it on and he gave it too his Mandalorian ally Canderous Ordo who eventually became Mandalore the Preserver before he died and if I recall it’s not really mentioned if it was destroyed or not when he died, I think it was damaged but not destroyed. This all happens thousands of years before the Mandalorian takes place meaning that if someone found it they would be in a better position of power than having the dark saber plus there’s no rule about giving the mantle to someone who you trust. This is sadly all in legends although it would make sense for them to bring it back since slowly they’ve been reintroducing characters into the Canon (example: Revan being mentioned being the name of one of the sith trooper legions in TROS) and I personally think it would be so cool especially because I love KOTOR and I love the Mandalorian so seeing it would be a huge plus at least for me. Also the reason why they would try to find now is because it was lost to time and perhaps they find something like a manifest or something like that on it’s potential location.","upvote_ratio":0.33,"created_utc":1678353366.0},{"title":"It's been exactly 9 years since Fives died (7th March 2014), and I'm still not over it.","author":"I__Am__No__Jedi","url":"https:\/\/www.reddit.com\/gallery\/11kurle","text":"","upvote_ratio":0.97,"created_utc":1678182097.0},{"title":"Looking for worthwhile new star wars content to binge","author":"dadsushi","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mq1ve\/looking_for_worthwhile_new_star_wars_content_to\/","text":"Hi, I haven't gotten into Star Wars in years (mostly because I thought some of the new canon was disappointing), however it's pretty good again so I'm looking for recommendations of things to watch and\/or read so I'm hoping that you guys could drop some worthwhile lit. Thanks!!","upvote_ratio":0.27,"created_utc":1678362118.0},{"title":"The ending I want for Ahsoka Tano","author":"Travok224","url":"https:\/\/www.reddit.com\/r\/StarWars\/comments\/11mgps9\/the_ending_i_want_for_ahsoka_tano\/","text":"This is the ending I want for Ahsoka Tano:\n\n\\#1: Ahsoka needs to get a happy ending. Anakin, Obi-Wan, and Luke (the S-tier main characters of Star  Wars in my opinion) all get a happy ending, and I believe she deserves to be in that elite group.\n\nIn order for this to happen, several other things need to happen:\n\n\\#1: Ahsoka learns Anakin was redeemed. This is the biggest thing unresolved from Ahsoka's character arc, and she can't be truly happy with this thread unresolved.\n\n\\#2: Ahsoka needs to basically \"retire\" from the galaxy, or from fighting in war-like events. When we see Ahsoka at her most recent point in the timeline, she is around 45 years old and has been fighting in some form or another for at least 20 years (from 14 when she enters the Clone Wars to around 34 in Rebels), and she deserves a very long break from that to rest. This could be her death, which I don't like but would be ok with if she learns Anakin was redeemed, moving to a remote part of the galaxy, or possibly going to Mortis somehow.\n\n\\#3: This isn't necessary for her to have a happy ending, but I would like for her to do something with Luke's Jedi Order, such as teaching the students there or storing the knowledge she has in a Holocron. This would give her a connection to the New Jedi Order, which she could impart some wisdom on.\n\nI would like to know what you think about this, and also what you think Ahsoka's ending should be.","upvote_ratio":0.44,"created_utc":1678330623.0},{"title":"How powerful was canon Grandmaster Luke before his exile compared to jedi of the prequel era?","author":"throwawayfetish294","url":"https:\/\/i.redd.it\/p6brr8xcjlma1.png","text":"","upvote_ratio":0.53,"created_utc":1678316598.0}]