[
    {
        "title": "Dr. Cathleen McCabe - Give Back to Grow Your Practice: How Charitable Giving Can Boost Morale and Profitability",
        "author": "Audrey_W_OBA",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/11h1rzv/dr_cathleen_mccabe_give_back_to_grow_your/",
        "text": "[removed]",
        "created_utc": 1677852775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family and doctors and teachers of children/adults diagnosed with ODD/ASPD/sociopathy: when did you know and (for the family) how have you been treated by people who know?",
        "author": "FleedomSocks",
        "url": "/r/AskReddit/comments/112b781/parents_of_childrenadults_diagnosed_with/",
        "text": "",
        "created_utc": 1676694393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to be a medical receptionist with an undiagnosed learning disorder, sleep disorder, and CPTSD and failing miserably. I'm tempted to quit",
        "author": "Monthly_Vent",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/1052erl/trying_to_be_a_medical_receptionist_with_an/",
        "text": "I'll make this quick since I'm really tired but I was offered a medical receptionist job by my doctor. It's my very first job and not only am I not in the medical field but I also have had a ton of academic struggles that have surfaced back up because unfortunately I'm unable to get treatment or self-accomodate for my sleep struggles (long story). I'm also super terrified of the own people I'm supposed to talk to because a lot of them are my parents' age and I can't shake the feeling they're going to be just like my parents. (Though I will say, in terms of getting use to talking to middle-aged adults and older, I'm getting better as time goes on, so there's something at least).\n\nI originally took the job because I really needed some sort of income independent from my parents and when I accidentally let it slip to my doctor that I was searching for a job and haven't heard from anyone due to my previous lack of experience, he offered and being desperate for money I took it. It also doesn't help they called my parents (was busy, couldn't pick up the phone for the day) and then my parents told their relatives and to make a long story short they basically kept celebrating that the one kid they thought was too stupid to do anything finally got a job. (This isn't how I see myself, this is just how my family sees me)\n\nIt's... a *lot*. I don't know how you guys do it. There's so much multitasking and so much to do - even if I'm just paid to pick up the phone and deal with fax it's still stressful because I feel like every phone call and half of the fax I get is just a completely different experience I have no clue how to handle. Not being in the medical field means I have no clue what most things mean; not being immersed in insurance means I have no clue what guidelines are for all of this. Not being a quick learner means I'm screwed.\n\nFor context, I keep making small mistakes, unable to remember most things and as much as I do try leaning to my coworkers, they're all busy with more important things and I feel embarrassed when I *know* it's something I was taught but don't remember. I had a notebook to write it all down but shoutout to my mom for misplacing it somewhere when I accidentally left it in my car. So I'm back to square one, on week three.\n\nI know some tricks to help me remember things. It took so many years to develop but I have them; they just take too much energy to actually do anymore cause of my sleep disorder. My doctor knows about both of these struggles but thinks I'm just dealing with depression, and even if he did believe me he can't do anything because my parents will fight tooth and nail to make sure I don't get any type of specialized treatment or medication for it, which they have a right to since they're paying for the insurance.\n\nI feel so tempted to quit. I keep thinking of how much I'm screwing my doctor over with mistakes I have trouble fixing and how much this goes on his reputation and license. How much work the job is and if I would be better working at retail or some job where the worst a mistake can do is lose someone I'm never going to be seeing again anyways. How much someone straight out of med school will kill for this job and how it was given to someone without the qualifications for it because I got one-sidedly buddy buddy with the \"boss\". How every mistake could've been prevented if someone else picked up the phone and every way that can pose the worst consequences for the doctor as a whole. \n\nI won't lie, I keep holding back mainly because of what my family thinks when I quit, though also partially because my coworkers are very nice and are always making sure I'm okay, and I'm not sure if I can find that type of work environment anywhere else. On week two I thought I'd surely improve, then week three hit and now I'm not so sure anymore. I don't know. I just need to let this out of my chest I guess. I'm going to stay for one more week to both see once more if I can handle it and also because that's when I get my check, but if it doesn't work out how I wanted it to then I think I need to quit.",
        "created_utc": 1673031796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm only 32 and having a colonoscophy...",
        "author": "TheColonoscophee",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/9ip0yf/im_only_32_and_having_a_colonoscophy/",
        "text": "On Wednesday. The whole prep leading up to it sounds miserable and I don't fully know what to expect. I will be posting about my experience as it occurs here:\n\nhttps://twitter.com/MonsterColon?s=09",
        "created_utc": 1537848868,
        "upvote_ratio": ""
    },
    {
        "title": "A frequent flyer in the ER.",
        "author": "TriscuitFlavor",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/9f3v82/a_frequent_flyer_in_the_er/",
        "text": "Hey friends! I just found this subreddit, and I'm so happy I found my people! \n\nI work with the ER, doing admissions and charge entry at nights. Often times, people ask me how it is working with the ER at nights and I always say that the saying \"The freaks come out at night\" is always true. \n\nLet me tell you about a certain methhead white trash patient we have, who always seems to make the best stories. \n\nI was first introduced to this patient by not only having the lab tech and a nurse keep me back, but also having seven cops and our paramedic tech dragging him into restrain him to a bed. He was screaming at the top of his lungs saying the following: You can't arrest me, police brutality, you racists, and You can't arrest me because I am Prince. I am the Artist formally known as Prince. \n\nHe was brought in for medical supervision due to the amount of meth and alcohol he has taken in. He got into a bar fight and attacked the police first. \n\nA couple hours and a B52 later, and he's somehow still awake, singing Bohemian Rhapsody at the top of his lungs. Other patients in other rooms aren't upset but more have a face of WTF. I agree. I don't remember Prince singing Queen songs. \n\nThe next time we had the pleasure of seeing him was when he faked being asleep and ran out to try to steal a helicopter that was here for a transport. Needless to say, he was tackled by police. Again. \n\nEdit: forgot to mention he was only wearing a hospital gown when he was attempting to steal the heli.\n\nAnd finally, the last time I saw him was two night ago. He came in for running from police after an assault, and you guessed it, was tackled by police while high as a kite.\n\n As far as I know, he's now back in jail. But we never can tell with this guy. ",
        "created_utc": 1536719579,
        "upvote_ratio": ""
    },
    {
        "title": "I saw a doctor at a small hospital affiliated with a large hospital in my state ...",
        "author": "1Os",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/95qozh/i_saw_a_doctor_at_a_small_hospital_affiliated/",
        "text": "My doctor left his practice, and I researched alternatives before settling in on a nurse practitioner at a small hospital in my area.  \n\nHe came highly recommended, and the hospital was affiliated with one of the largest hospitals in my state.\n\nOn my first visit, I was told I had bronchitis (I have had bronchitis a couple times a year for many years).  He prescribed prednisone, antibiotics, and said he wanted to see me in three months, but to call if there was no improvement.\n\nI got a call a few days later saying he would not be available for six months, and the appt was changed to Sept.\n\nWell, I didn't get better, and called for an appt, assuming someone else was covering his practice.  I was told Sept was the earliest I could get an appt.\n\nA month later I started coughing blood, and went to an urgent care center.  I have pneumonia.  \n\nHere's where it gets interesting ...  they sent a copy of the radiology report to my primary (the nurse practioner), and I got a call saying to come in.\n\nAs it turns out, he was available, but the hospital administrators had canceled the follow up appt he had made.  \n\nThis obviously had to do with money, not medicine.\n\nHaving watched too many medical tv shows, I've heard \"capitated structure\" mentioned.  Is this a real thing?  Do hospitals really have an agreement with insurance companies that pay a flat fee, giving them an incentive to NOT see patients?\n\nI'm not getting a lawyer, or anything like that.  But if this is the case, I've had pneumonia for months because it wasn't cost effective to follow my medical practitioners advice.\n\nI'm beyond pissed.",
        "created_utc": 1533766807,
        "upvote_ratio": ""
    },
    {
        "title": "Geriatrics gives me the giggles",
        "author": "catwithaglasseye",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8z46sc/geriatrics_gives_me_the_giggles/",
        "text": "Just found this thread, finally the place I belong! \n\nI finished a geriatric rotation for mental health in April. Dementia is hard work, and those nurses deserve a god damn medal. \n\nThere was one patient who went down hill pretty quick, but usually remembered me because I carried around a pink MacBook every day. One day when she was giving the nurses a hard time, her family a hard time, and refusing pretty much everything and getting pretty agitated. (PT, me, nursing, and her family just simply asking her to stand and walk -well within her capabilities.) she was adamant she couldn’t. No pain she reported, just was having a bad day. Finally as everyone is getting frustrated and about leave I said, \n\n*”hey mrs. Patient, I just got a baby ferret. He looks kind of like your cat. Do you wanna see a picture of him?”* in attempts to deflect and calm her down. Her response? \n\n“Oh my goodness, yes let me see. Wait let me get my glasses” \n\nAnd then she got up and walked. \n\nGeriatrics my friends, it gives me the giggles. ",
        "created_utc": 1531682138,
        "upvote_ratio": ""
    },
    {
        "title": "Crap Coworkers?",
        "author": "accordingtomyself",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8xv171/crap_coworkers/",
        "text": "I work in a very small Dr. Office. When someone is sick or on vacation, it's tough going, but we get by.\n\nI have a coworker who takes off at just about any opportunity ie: leaving early to get a tattoo- and we all just hustle and do our best.\n\nI've been sick this week: constipated to the point of dysuria and vomiting, so I decided tp get checked out... I was then put on meds that made me sh** like Niagra Falls every few minutes- still at work, still puking.\n\nThen I started puking blood. I told my coworker and she sarcastically asked if I was pregnant, then told me that SHE went to work with pneumonia once, because that's just 'what you do.' \n\nMind you, she hasn't worked a full week since April or so, and she's full time.\n\nI cleared my departure with my manager told her \"screw you\" and left out the door with her cussing me out.\n\nAnyone else have awful coworkers?",
        "created_utc": 1531270237,
        "upvote_ratio": ""
    },
    {
        "title": "Good timing",
        "author": "DaddyBeanDaddyBean",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8ksygt/good_timing/",
        "text": "I hope a nursing-home tale fits in this sub.  Let's call my wife Angela\\*.  Her grandmother was in a nursing home temporarily, recuperating from a broken hip. Dementia (Alzheimer's?) had started before her injury, but really seemed to accelerate after.  She was in a wheelchair, but was not supposed to stand without assistance; she was not restrained, but they had installed an alarm to alert staff if she tried to get up on her own.  \n&amp;nbsp;  \nSo Angela &amp; I were visiting one afternoon, and when it was time to go, we said our goodbyes and left the room.  I happened to be in the lead, Angela right behind me.  As we entered the hallway, Grandma's chair alarm went off.  The rest happened in much less time than it takes to read it - just a few seconds.  \n&amp;nbsp;  \nWe turned around &amp; went back in, so now Angela is in the lead.  We are the same height so I really couldn't see anything past her.  She saw that Grandma was out of the chair, bent over, with one hand on the arm of the chair and the other on the bathroom doorknob.  The chair was starting to roll backwards, and the door starting to swing open (away from Grandma).  \n&amp;nbsp;  \nIn an almost clairvoyant moment, Angela knew two things.  She knew she could not get across the room in time, and she also knew that I was somehow already reacting to a problem *that I could not possibly have seen yet*, and simply stepped aside as I blew past her, almost at a run, and caught Grandma as she fell.  Literally one second later would have been too late.  \n&amp;nbsp;  \nSo I caught her as she went down, and we all just froze for a moment, Grandma wondering what the hell just happened, and Angela &amp; I wondering HOW the hell that just happened.  I lifted Grandma back into her chair and just pretended like it was no big deal, nah, Grandma, you're fine, no worries.  The shakes started about five minutes later, when we got to the car.  \n&amp;nbsp;  \n(P.S. Grandma said she was just \"leaning\" out of her chair to close the bathroom door - it was already closed, I'd been leaning on it during our visit - and yes, we told staff what had happened.)",
        "created_utc": 1526826766,
        "upvote_ratio": ""
    },
    {
        "title": "The most unbelievable thing a patient has ever asked me.",
        "author": "TopazRose",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8jqr2x/the_most_unbelievable_thing_a_patient_has_ever/",
        "text": "Hello all, I work as a front desk receptionist for a small medical practice, only 3 providers and about 15 employees. We live in a small town of about 30k people, but our schedule tends to be pretty full.\n\nAnyway, I was speaking with this patient, a regular patient of ours. Let's call him Important Guy. You'll see why later.\n\nMr. Important Guy calls in, asking for an appointment. \n\nMe: Of course, Mr. IG. The next available with your doctor is about 10 days from today, at 1:45. Would that work for you?\n\nIG: Well, actually, my prescriptions run out in 6 days, and I'm going on vacation on Friday. So I need something this week.\n\nMe: Okay, I apologize, but we don't have anything available for then. How about this, can I set up the appointment for when you return, and put you back through to the nurse's office so you can inquire about a temporary refill?\n\nIG: Well, can't you just call someone on the schedule and reschedule them so I can be seen?\n\nI would love to say I had a witty response, but I'm pretty sure I just said \"No, sir, I'm afraid that's not possible. Let me transfer you to the nurse's office.\"\n\nThe nurse for his doctor came up to me and asked \"...did he ask you the same thing he asked me?\" We all had a good laugh about it. The nurse considered calling him up one day and telling him \"I'm so so sorry, Mr. Important Guy, but someone needs to get in... can we reschedule your appointment?\"",
        "created_utc": 1526431599,
        "upvote_ratio": ""
    },
    {
        "title": "I wrote a song about patients",
        "author": "rijoys",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8isb08/i_wrote_a_song_about_patients/",
        "text": "(Firstly, on mobile so sorry for formatting)\n\n I work in a primary care setting and have been slowly writing a song over the last few years about Needy People. I recorded the first part of it here, and will record the rest at a later time. Not sure if this is the correct place, but I thought maybe some of you would enjoy it a little!\n\nhttps://youtu.be/18fK02e1oEg\n\nEdit: partial lyrics to save you the click \n\nThe PCP's Lament- a song for health care workers. Sung to the tune of \"My Darling,  Clementine\"\n\nNeedy people,  needy people, \n\nNeedy people everywhere.\n\nHow I wish these needy people\n\nWould just get out of my hair.\n\n\nPhone is ringing, hear it singing\n\nLike a chorus straight from hell.\n\nI just want to run for cover\n\nBut there goes that damn doorbell.\n\n\n\nThey are crying, claim they're dying\n\nAnd in need of more refills\n\nCuz they're painful or disdainful\n\nBut then they don't pay their bills. \n\n\nThey buy big screens, new SUVs\n\nLatest iPhones in bright green. \n\nAsk them today for their copay, \n\nAnd they chastise me for greed. \n\n\nThey want Norco, they want Benzos,\n\nStimulating salt combos. \n\nDo they eat right? Sleep,  exercise? \n\nDo their P.T.? Awe hell no. \n\n\nInsurance will say \"Needs a P.A.\"\n\nI cry out \"Oh, lord please no!\"\n\nAll the time spent makes me lament\n\nMy youth gone out the window. \n",
        "created_utc": 1526082701,
        "upvote_ratio": ""
    },
    {
        "title": "A beast in the Lung Function Unit",
        "author": "candles_in_the_dark",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8idt5s/a_beast_in_the_lung_function_unit/",
        "text": "This is a story my dad told me tonight about a patient at his work. He is a respiratory specialist in his hospital’s specialist clinic and so has many interesting people come through. \n\nToday a lady called as she needed to book an appointment. She had been part of a sleep study with her GP and one of the doctors at dad’s clinic “Dr Paul” had written the report on her, based on the results from the study, to send to her GP. The GP had obviously read it back to her and told her she needed to see one of the respiratory specialists at my dad’s clinic. \n“The Beast” will be the patient and “Dad” will be my dad.\n\nThe Beast: “Hello my GP has told me I need to book an appointment with you about about the results of my sleep study” \nDad: “Yes, sure, that’s fine, when suits you?”\nThe Beast: “I was just wondering, did it have to be with Dr Paul? I don’t want the appointment to be with Dr Paul because he called me a beast”\nDad: “I’m sorry, what?”\nThe Beast: “He called me a beast so I don’t want my appointment to be with him.” \nDad: “Okay... that’s fine you can have it with one of our other doctors”\n\nMy dad and the receptionists were all trying to work out why on earth Dr Paul would have written that she was “a beast” in the report because it’s unprofessional and even if she had been a horrible person, the doctor still wouldn’t have called her a beast because that’s just weird. When the report came through to the office, they had a look through it so they could document it properly and found that Dr Paul had in fact written that the patient was “obese” and so she had clearly just misheard the GP and assumed that the doctor had called her “a beast”. \n",
        "created_utc": 1525947509,
        "upvote_ratio": ""
    },
    {
        "title": "Clinic Horror Stories",
        "author": "scarredlegs",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8i52gm/clinic_horror_stories/",
        "text": "It's been a fear of mine to open up as I have a skin condition. Atopic dermatitis. I also have selective amnesia as when I was a toddler, it was at its absolute worst.\n\nMy skin was mostly scabs, brown and black patches, and there were barely any healthy skin present. Even my scalp and the pads of my feet were infected and scabby. I usually smelled disgusting as described by my mother. The pus smelled horrible and most of my scabs were weeping and/or excreting pus.\n\nSo. She brought this up to my doctor. I don't know when but one day I just remember going in the clinic and sitting in the \"chemist's\" room as I described it back then. My younger self felt weird. They were treating me differently.\n\nNeedles usually didn't scare me back then but at that moment, their behavior scared me. I told them no and that I didn't want it. I held my left arm tightly to my chest and curled into a sitting fetal position. The nurse couldn't wrestle it out herself so she called for backup. Four nurses came in and had to wrestle my arm from my grasp and hold my arm and myself down. I remember kicking and screaming and hitting them. Then my memory ends there.\n\nIt just resumes when my mom and I are going home in the car. I was in so much pain. I was covered in Betadine and gauze. She had the driver stop in front of my favorite fast food restaurant as a child.\n\nI wanted to go in but she told me to stay in the car as people would stare at my now orange self.\n\nShe bought me food and adopted a stray puppy \\(RIP my beautiful boy,Cholo\\) just to make my child self happy again. We went home and that's how I've always remember it.\n\nUntil recently that is.\n\nMy mom and I talked about our medical history and she said I had the most painful one. I asked her why. She filled in the blank moments in the memory.\n\nAfter getting a blood sample against my will, I was wheeled into a room \\(which was basically still in the same room but just a bed that's surrounded by curtains. Basically the beds in ERs.\\) stayed there for a few hours.\n\nPeople were not let into the clinic and the last clients were finished up quickly. They brought in a large plastic tub, several large bottles of hydrogen peroxide, a bundled up wad of gauze and a bottle of betadine. Several nurses had come in and had forcefully undressed me.\n\nI was kicking and screaming as held me still as they soaked a large wad of gauze and soaked my scabby legs in the burning and now bubbling liquid.\n\nMy mom was sounded so regretful and so guilty when she told me this. She told me that my shrieks and screams of pain were so painful to hear and my aunts present outside of the clinic were crying when they heard me cry for my mother and for them to stop or to at least go easy on me. A child going through that horrid pain. It scars them mentally and emotionally. For a child to beg adults to go softly with the scrubbing to taper off the pain for just a bit. I feel so sorry for my child self.\n\nThat wasn't the worst part. The worst part was when they took a bundle of gauze and started scrubbing my legs with a ball of gauze soaked with hydrogen peroxide. Throughout my screaming, I just remember this one moment. The words the nurse told me. He said \"You'll thank me one day.\" That's what I remember.\n\nThey worked so fast and hard on my legs that my legs were bleeding and raw from the rough treatment.\n\nThen I was bandaged up and sent home.\n\n10 years after that treatment and here I am. Riddled with scars on my legs. I've never gone out with shorts on. It's always jeans, leggings, ankle length skirts.\n\nI never went back to that clinic.",
        "created_utc": 1525863672,
        "upvote_ratio": ""
    },
    {
        "title": "Adult Girl-Child From the The depths of HELL",
        "author": "Timoris",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8hnwqo/adult_girlchild_from_the_the_depths_of_hell/",
        "text": "The following has been assembled from my texts during my week-long stay at a Hospital\n\nThis is our story - TUN. TUN.\n\nHaving been admitted to the the ER overnight, I was transferred to the second floor the following day for extended observation and treatment (I'm going to be fine)\n\nI was lucky enough to get a two person room to myself, overlooking the gravelled roof of the cafeteria and grey stone walls of the adjacent ward.\n\nDirectly across the hall was also a patient with a two person room to Herself (earlyish 20s?), for reasons which will be made abundantly clear. \n\nFrom what I gathered, she has been in the ward since the previous day, when I was sleeping in the ER.\n\nHow do I know this? GIRL IS LOUD. She was talking to her friend on her cellphone, about how she was Piss drunk coming back from a guy's house (not her boyfriend) Pissed in her car and crashed. \n\nMy introduction to her was actually a nurse telling her, and I quote \"Do you realize we're being cold with you? We're not giving you a lecture, you're old enough to know better.\"\n\nShe might have whiplash or lower back problems because she's been put on Morphine and was in a wheelchair.\n\nBut that's not even the start - she was CONSTANTLY screaming at other people, other patients - \"CLOSE YOUR FUCKING JACKET! I DON'T WANT TO SEE YOUR BUTT!\" When they passed in front of her door. Mind you, she refused to wear the jacket, Kept her single change of clothes and Beanie hat. Also - don't fucking look. Also Also, just close your damn door.\n\nHell!\n\nShe even went into OTHER PATIENTS ROOMS and scolded them to properly tie their jacket. The patients are all elderly, so I never heard anything from them\n\nOf course, she curses out the Nurses for confiscating her smokes because she tried to light up in her room. \"I'LL FUCKING SUE YOU!\" Yeah. Sure.\n\nWhen she got the evening meal she yelled into the hallway because she doesn't like apple juice and wanted something different.\n\nShe never rang the Nurse bell. She just MOANS loudly when someone passes to try and get their attention. All. The. Time.\n\nShe talked to me ONCE; the first night I was in the ward. After lights out I got up (I had 2 tubes running into my arm and one going from my nose to my stomach. That one was fun. /Sarc.), haunched over and holding onto the drip pole, I shuffled to my room's bathroom (Each bathroom is in between two adjacent rooms, having a door opening to each side, this is important for later) As I was opening the door, with difficulty, again, being bent over, holding myself for support, dragging wires, she just states: \"I can see your butt.\" She would have had to be sitting on the edge of her bed and peering outside her room purposefully to even spot me between curtains.\n\nMy mind went to two places - the first and strongest instinct, 65% of me wanted to respond \"Then just don't look.\" although the other 35% won out, thinking, \"Nope, she has the crazy, don't make yourself a target, deescalate\" So I calmly stated \"I'm going to the bathroom.\"\n\nThis worked, I don't think she expected any response because she said the calmest thing I heard all week from her : \"Oh.\"\n\n**NEEEEEEEEEEEEEEEEEEEEEEXT morning** (I think, I was on a cocktail of drugs and time seemed to all meld together): **ALL aboard the Crazy Train**\n\nI wake up to her YELLING across the ward, to the room diagonally across the hall from her (adjacent to me, sharing a bathroom) to an older person clipping their nails \"WHAT'S THE FUCKING NOISE!? STOP MAKING THAT FUCKING NOISE! ARGH! MAKE IT FUCKING STOP IT!\"\n\nShe had also vomited in the bathroom in the morning and had asked a nurse for a doctor to look at it. Well, the doctor wasn't there yet.\n\nWell, a person in other connected room had to go to the bathroom, so obviously they had flushed. Thus, Miss-Bottle-of-Joy-and-Sunshine started yelling obscenities at her from her own room \"YOU FUCKING STUPID CUNT BITCH! WHY DID YOU FLUSH!\" etc etc etc. That got her nowhere. So, instead, she decided to climb onto a wheelchair and run after a patient whose butt she saw, screaming \"I WILL RIP OFF THEIR JACKET! IT'S FUCKING DISGUSTING!\" No idea what happened with that, but she did come back soon after. I don't think anybody was assaulted.\n\nThat night she called her actual boyfriend and started questioning him (LOUDLY) about red dots on her crotch. She swears it's not from her because she was tested before being with him (Oh and remember the reason why she was in the Hospital in the first place? Driving back from a guy's house? That mysteriously didn't come up) Through pressure on the Boyfriend, he admitted to diddling a girl when he was at that girl's place. Miss Sunshine turned up her psychotic yelling to 11, trying to get him to admit to more, then locked herself in the bathroom. That did not help the sound volume situation.\n\n**LATER** (Or next afternoon? I don't know anymore. Drugs. IVs) : **Dinner and a Show**\n\nShe yelled at the nurses saying that she did not want her side of the bathroom door locked (which you can unlock easily with a push pin) because \"It wakes her up when other patients go to the bathroom. I told them ***SIX TIMES*** not to go to the bathroom but they don't listen!\"\n\nShe was back in bed, pressing the Nurse call button, moaning loudly, calling out into the hallway - she wants morphine. \n\nNurse comes in \"You're not due for morphine for another 27 minutes.\"  \nMiss Sunshine: \"Before it was every 2 hours, now it's every 4 hours, what's it going to be next time, every 8 hours!?\"  \nNurse: \"That's exactly right.\"\n\nMore yelling, then Her Dinner Tray goes **FLYING**\n\nNurse: \"No. Nope. No.\" Steps out into the hallway \"Call a Code White.\"\nIntercom: \"Code White. 2nd Floor. E Ward, Room 2200. Code White.\"\n\nThree Security guards come running in.\n\nMiss Sunshine is pinned down, under protests from her, almost like trying to drown a Cat with each hand at the same time. She's strapped down, Legs, arms, Wrists, Neck.\n\nResident Doctor comes in, tells her she can wait, or have two Advil.\n\nMiss Sunshine says, and I quote \"NO! I don't drugs that will mess with my mind\"  \nDoctor: \"You're taking Morphine. That messes with your mind. A lot.\"  \n\nShe is then given a Choice for the Advil, Orally or Suppository. She answer \"Not the in mouth!!!\" Sooooooooooooooooooooooooooooooooooooooooooooo\n\nShe then learns what a Suppository is.\n\nRemember how she is strapped down?\n\nRemember How she refuses to wear the jacket?\n\nRemember how she's still wearing her only change of clothing?\n\nThe Jeans are ripped\n\nCrying is had, in between sobs all I hear is \"OW OW OW. IT BURNS. IT BURNS. OW. IT BURNS.\" \n\nAll I can think of is \"Stop clenching.\"\n\nShe is left strapped in, door closed, reports and paperwork are made out in the hall.\n\nShe is being left to scream and tire herself out, untill the meds and morphine kicked in.\n\nSilence in the ward is soothing and creepy.\n\n**SHORTLY AFTER - WHEN IT RAINS, IT POURS**\n\nCoincidentally, her GrandMother came by to visit her. She somehow got a heads up, While still being strapped in. She's pleading, PLEADING to be unstrapped so her Grandmother doesn't see her like this. Nurses aren't having any of it. \n\nLife pro tip, yelling \"WHAT! LOOK HOW CALM I AM!\" Is not the best way to convince someone to unstrap you from the bed.\n\nGrandMother comes in and leaves maybe 45 minutes later, Miss Sunshine is still strapped in, not much sound came from her room.\n\nRemember how she went into other patients' rooms and lectured them about not using \"her\" bathroom?\n\nOnce her Grandmother left, she starts yelling again. She says she wants to pee, right before she pissed herself. Nurses responded: \"Okay, well all you had to do was cooperate. You had many, many, MANY chances. Now you have to wait in your pee.\" Cue Full exorciste mode for about AN HOUR.\n\nThey finally unstrapped her after 3 or 4 hours - honestly, no sympathy. She really needed to be strapped - heck, she was one step away from assaulting other patients.\n\nThey brought in an Psych to listen to hear her, so, kudos to the Hospital.\n\n\"They ripped my only pants! I peed my only pants! My pants are ruined!\" \n\nWell, guess now you have to wear the jacket. Funny how that works out.\n\n**THE NEXT DAY**\n\nThere is a doctor now, consulting, they took away her smokes, they are refusing give them to her (Doc included) \n\nSuddenly:\n\nIntercom: \"Code White. 2nd Floor. E Ward, Room 2200. Code White.\"\n\nThey called another Code White because she was yelling and SPAT at a senior Doc who was listening to her. \n\nCue Security, Cue being strapped down again.\n\nNurse told the guards to use face shields because she's a spitter. And has Unknown VD.\n\nShe started cry-breaking\n\nFinally breaking down, it seemed. The crying was different. A Distinctive note powerlessness underneath it all, unmistakable. \n\nBut that was just an illusion, because she went full psychotic as soon as they unstrapped her for the night.\n\nThey closed all the doors in the ward, the Nurses and Nurse aides visited each patient and told them that the entire WARD had been prescribed Ativan to help us sleep, opt-in, of course, but it's their if we wanted it.\n\nThe next morning her kid (because if course she has a kid at that age) came to visit and I was discharged that afternoon\n\nNo idea what happened to her.\n\nDon't really care to find out.\n\nReal winner. ",
        "created_utc": 1525703404,
        "upvote_ratio": ""
    },
    {
        "title": "[Patient Story] When nurses screw up accidentally",
        "author": "anabear2803",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8e0kzo/patient_story_when_nurses_screw_up_accidentally/",
        "text": "So a little background on me, I'm a Lupus patient and about 8 years ago had to be hospitalized for one reason or another when I was 10. Now I know that nurses work really hard and I don't want to be mean to them or anything. This story is just one where 2 nurses just did not follow proper procedures and not all nurses are represented by these people and these nurses were probably not awe full either so onward with the story.\n\nWhen I was admitted, I was put in the isolation ward which meant that the only people I see were my family, doctors and only nurses no other patients to talk to or see what they do to me. One thing to mention is that my mum works so she was not there 24/7 so she did not see what happens either. \n\nNow because of my condition they had to perform a blood test and all the usual to make sure my blood work was fine. These 2 nurses come in and they start doing the test and honestly being 10 at that time and having done blood tests for 3 years already I did not object to them and let them do it. So one might assume cool 2 nurses wouldn't have much trouble with the blood test just sanitize the area, prick the needle, let blood flow into the bottle and cap the tiny bottle off. But before reaching that last step, they drop the bottle causing it the land on the bed I was laying in and spilling onto the bed sheets. Of course afterwards they sheepishly asked to perform the blood test again and being that same weird 10 year old I agreed.\n\nThey did come back into the room to change the bed sheets. But oh boy when my mum came to visit me was she upset. You see, the nurses did not contact my mum for permission to take blood from me and once I told her about how the nurses had to do the test twice, she looked like she could kill.After which I was promptly moved to a different ward. Though they did put me on drip without telling my mum about it in the other ward. But I forgot what kinda happened then so that won't conclude.\n\nNow a disclaimer, I do not hate nurses or resent them in anyway. Y'all put up with so much shit on a daily basis so I am not trying to say that you all suck. and obviously in what happened there were some flaws in how the situation could have been better handled. It has also been 8 years since then and I'm sure that things are better now. Heck now a days the bottle that blood is collected in doesn't even leak but blood can still enter, really cool stuff. Thanks for reading my story.",
        "created_utc": 1524365239,
        "upvote_ratio": ""
    },
    {
        "title": "Traumatised A First Year Medical Student",
        "author": "ashakilee",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/8bo1pc/traumatised_a_first_year_medical_student/",
        "text": "I was in the emergency department last month for a couple of days for a bit of a health issue. Anyway because i had been transported to the hospital from work i was alone and waiting on an Emergency Department bed to be further assessed and admitted to the right department. \n\n\nAs with any medical setting there was some time spent waiting for things to happen. I was not in a life-threatening situation i suppose, and had been hooked up to some electrolytes and what not. I'm people watching and observing the hustle and bustle of the ED. \n\n\nAfter about an hour i was approached by a doctor who asked me if it would be alright if a group of first year medical students did a standard set of examinations on me, including a tummy palpitation. I said okay why not since i was quite bored. \n\nA group of 5 very young, eager looking medical students fresh out of high school and embarking on their successful medical careers, crowd around my bed and draw the curtains for some privacy. So the one chosen for the examination is the most nervous looking, skinny Asian kid, i am sure he will be an excellent doctor and make his parents very proud. In any case this appears to be first time for a practical, as the supervising doctor is basically guiding the student with everything. So the Asian student will nervously demonstrate observing my pupils, asking me to put my nails together or tapping my foot or something, all the while announcing what he is doing and being corrected or prompted by the doctor as necessary. \n\nThen comes the 'tummy palpitation'. The student looks extra nervous as he asks me to lift up my gown and tells me that if i feel uncomfortable or pain at any moment to please tell him to stop. He presses his fingers ever so gently on my upper bare tummy slowly as he announces that there is no hardness, all seems to be okay... then he gently presses the middle... then on the side...\n\n'URRRRRRGHHHHHH!!!!' \n\nI cringed and sat bolt upright in bed clutching my tummy, as the students and even the doctor literally jumped away from me in horror and shock. \n\nAt this moment i quit my acting and jovially informed them that i was 'just kidding', and raucous, nervous laughter followed. The Asian kid looked like he may need some electrolytes himself. \n\nAnyway that was some fun i had with some med students, as i seem to get chosen every time i am in hospital to be probed and examined and studied upon. That's my bit of contribution to medical science. ",
        "created_utc": 1523513676,
        "upvote_ratio": ""
    },
    {
        "title": "Apple Cider Vinegar",
        "author": "bdoz779",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/83qpdw/apple_cider_vinegar/",
        "text": "I work as a nurse in a wound care center. Patient came in with a wound between his toes. He states he has athlete's foot that he's been treating with apple cider vinegar, he soaks cotton balls in it then sticks it between his toes long enough to deteriorate to a wound, almost to the bone. Luckily we've been able to heal it enough and prevent infection before we resorting to amputation of his toes. \n\nDoc thinks he's like the dad from 'My Big Fat Greek Wedding', but apple cider vinegar instead of Windex. \n",
        "created_utc": 1520812101,
        "upvote_ratio": ""
    },
    {
        "title": "Snapshot of “saving a life”",
        "author": "phamh02",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/831vz3/snapshot_of_saving_a_life/",
        "text": "My coworker and I were the first ones to arrive and initiate life saving CPR to a patient who went into cardiac arrest. The patient was sent to the ICU where less than 24 hours later I was the one who helped put him into a body bag after his passing. I finally understand that everything we do in medicine is just prolonging the inevitable. ",
        "created_utc": 1520550021,
        "upvote_ratio": ""
    },
    {
        "title": "A Triple Dose of Huh??",
        "author": "Gaia227",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/81uard/a_triple_dose_of_huh/",
        "text": "I work in an FQHC (federally qualified health center). We rotate the Saturday shifts for the walk in clinic and today was my Saturday.  I have three funny/'did they really just say that?' tales for you.  \n\n\nFirst,  a woman in her 30's comes in,  borderline panicking because she had taken a home pregnancy test and it came back positive.  No problem,  we offer free pregnancy test so I'm getting her on the schedule to do the urine test and she tells me she needs to see the Dr like right away.  Of course,  I ask her what else is going on and she tells me that she has Pinworms,  there is NO way she got pregnant through sex so the Pinworms that currently reside in her butt must be male worms and they crawled out of her butt and into her vagina thus getting her pregnant.  At first I thought she was kidding.  She wasn't. \n\n\nSecondly, guy comes in and says 'I think I have lice but on the other hand it could just be cracker crumbs.'  Huh?  You say 'lice' and we get you into an exam room asap, cracker crumbs or not.  \nNo lice. Must have been those damn cracker crumbs.  \n\nAnd finally, woman comes in and say's 'I had my big toe removed a few weeks ago and its done grow'd back!'  \n(It had a cyst/abscess on it)\n\n\nI'm going to work more Saturday's! These people are a hoot. ",
        "created_utc": 1520123705,
        "upvote_ratio": ""
    },
    {
        "title": "Shoutout to all the staff in this hospital",
        "author": "Silentlybroken",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7yopkc/shoutout_to_all_the_staff_in_this_hospital/",
        "text": "THANK YOU.\n\nI've been admitted with sepsis and everyone has been fantastic. They are caring, wonderful and run off their feet. I'm in the UK. Just wish the silly cow opposite would stop yelling help every two secs! There's always one. Woman wanted a nurse to just sit with her as well. Thank God I'm Deaf.\n\nAnyway, I just wanted to rave about both the ward and the emergency department staff. They were so good to me.\n\nHere's to getting better.",
        "created_utc": 1519064158,
        "upvote_ratio": ""
    },
    {
        "title": "dogs are absolutely amazing creatures; loyal, forever faithful and comforting. dogs can also ruin your relationship when they take a dump.",
        "author": "darlingyrdoinitwrong",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7ru36i/dogs_are_absolutely_amazing_creatures_loyal/",
        "text": "i do not know if my story is allowed here, as i work in veterinary medicine (veterinary technician, to be specific), so please remove if not welcomed. to me, medicine is medicine, regardless of species practiced on. this is something i have personally validated via some really... interesting story swapping with my cousin, who is a human GP.    \n\nso the hospital i have worked at for the past 3.5 years is a large one: six doctors, boarding facilities, etc. there is always, without fail, something that occurs every single day that just blows my mind. (usually in the not so good way, but occasionally owners (our clients) also surprise me.) the following story falls into the former category, unfortunately for the clients involved.     \n\nin order to board your dog at our facility one of the requirements is a negative fecal screening. on any given day i look at multiple fecal floats, find the occasional interesting parasite, and lots of hookworms, coccidia, giardia, and the like. so this dog came in for boarding, i get a little plastic bag FULL of poo in order to set up the standard float. (pro tip: we only need 2-3 g of stool, no need to bring your pupper's entire pile 'o poo in, but i digress.)     \n\nso i open the bag after gloving up and attempt to dig a small bit of poo out with the stick end of a cotton tip applicator. i noticed there was what appeared at first to be a plastic grocery bag encased in the particular log i chose. suddenly curious, as perhaps this pupper ate something it ought not to have, i decide to search the entire sample for foreign objects.    \n\nas i dig through this dog's huge poop in order to extract the offending object i soon realized the plastic looking stuff i saw was not a benign shopping bag or something equally boring. no. instead i slowly extract *an intact and entire condom from the stool.* naturally, i am dumbfounded (and curious as all get out!) so i quickly go report this finding to a doctor.     \n\nunfortunately for the poor doctor in question, he is obligated to inform the owner(s) of abnormal findings. so he gets on the phone to have an already awkward conversation go from uncomfortable to potentially relationship ending.     \n\nyou see, the people in question who own said condom fiend of a canine are a *same sex (female) couple*, whose dog had just announced one of the partner's infidelity by taking an innocent dump. i so wanted to be a fly on their wall that evening around the dinner table. never found out if that was the end of said couple, but have always felt kinda bad for just doing my job.     \n\n**tl;dr:** dog came in to board, i found a condom in its stool sample, dog belonged to a lesbian couple, awkwardness ensued. ",
        "created_utc": 1516491882,
        "upvote_ratio": ""
    },
    {
        "title": "A Medical Receptionist's Pet Peeves",
        "author": "amanda7207",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7rm6aa/a_medical_receptionists_pet_peeves/",
        "text": "So, I'm a receptionist at a fairly busy family medicine center, we don't do walk ins,  and we're always booked out about a week out with no same day appointments. We are not an urgent care, we have multiple signs stating that we do not do emergent visits. So here's what grinds my gears day after day, from the front end of things!\n\n-People coming in expecting to be seen TODAY. When I tell them we can't, they need to go to an Urgent Care or a walk in clinic, I get the good old, 'Oh so you don't care if I DIE?!' ... \"I do care, and if you're having that much trouble I would be happy to call 911 and get you to a hospital!\" 'No, I want to see MY doctor!' \"Then the next apt I can schedule you with them is a week out.\" ... 'Fine I'll take that...'\n\n-When you go to check someone in and ask them for their name. Then they only give you their First or Last name. ... You aren't the only John or Smith in the world, idiot.\n\n-When you ask for their birthdate for confirmation and they ask, 'What's yours?' ... hilarious, never heard that one before...\n\n-When you are scheduling their next appointment, and you say, \"My next available is 2 weeks from now!\" 'Do you have anything sooner?' ... DO YOU KNOW WHAT NEXT AVAILABLE MEANS?!\n\n-When you're scheduling someone and tell them an available date and time and they ask, \"What time is that?\" You repeat yourself. \"And what date?\" If you listen to the words coming out of my mouth YOU'D KNOW!\n\n-When you ask the reason for their visit so you can put it into the appointment notes to give the doctor a head's up on what they'll be seeing a pt about, and the pt refuses to tell you because 'It's private!' It's MY JOB.\n\nBut the worst by far was the person who threatened me over a simple form. For every form we intake for a doctor to fill out, we have the pt fill out an Intake Form, it tells us who their doctor is, what the form is, and how they'll be receiving the form when it's complete. It is one page long, and everyone dropping off a form has to fill one out, it's just our policy. So this older gentleman throws a fit about having to fill it out one day, even though I tell him it's just policy and I'd be happy to help him fill it out. In pure rage, he says to me, \"You're lucky I can't bring my gun in here.\" ...... Or what dude, you'd SHOOT ME?! Over a one page form?! Ridiculous, I don't get paid enough for this.",
        "created_utc": 1516401595,
        "upvote_ratio": ""
    },
    {
        "title": "God help me! I AM Dr M!",
        "author": "Underwritingking",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7qaua9/god_help_me_i_am_dr_m/",
        "text": "this is a story from long ago when I was a junior doctor.  In this long gone days, there were no mobile/cell phones in common use, so us hospital doctors carried a radio pager.  If somebody wanted us they rang the hospital switchboard, who paged us.  We then answered and they put us through to the caller.  The switchboard operators did this all day - sounds simple enough?\n\nOn the day in question I was working in paediatrics, and my fellow junior was a New Zealand guy.\n\nI will be Dr M\nSwitchboard operator will be SBO\nNew Zealand Guy will be NZG\n\nMy pager goes off while I'm drinking coffee in the canteen.  I walk to the phone and dial switchboard\n\nSBO - \"Hello?\"\n\nDr M - \"Hi, it's Dr M, you just paged me\"\n\nSBO - long pause.....  \"Sorry NZG, we paged you in error.  We wanted Dr M\"\n\nDr M - \"This is Dr M speaking\"\n\nSBO - (sounding confused) \"Oh, sorry Dr M.  Did you want NZG?\"\n\nDr M - \"No.  I don't want anyone - you paged me\"\n\nSBO - \"just a minute\".........   \"sorry NZG, Dr M doesn't seem to be answering his pager\"\n\nDr M - \"No, no - listen to me - I am not NZG, I AM Dr M.  You paged me.  Why did you page me?\n\nSBO - long pause - \"Sorry NZG - did you want Dr M?\"\n\nDr M - (sounding frustrated) - \"NO!  How many times do I have to tell you - I AM Dr M\"\n\nSBO - \"Ah!  I see!\"  So do you want us to page NZG for you\"\n\nDr M - \"NO!  Listen... YOU paged ME.  I don't know why.  Does someone want me or what??\n\nSBO - further pause, then....  \"I so sorry NZG.  We paged you in error.  We wanted Dr M\"\n\nDr M - long baffled pause.....   hangs up.\n\nGod knows what was going through there mind.  I never found out who they wanted, or why....",
        "created_utc": 1515919543,
        "upvote_ratio": ""
    },
    {
        "title": "How often do these happen in hospitals?",
        "author": "taewoo",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7pb5sf/how_often_do_these_happen_in_hospitals/",
        "text": "1. Elderly patients with dementia walking away from their rooms/hospitals\n\n2. Newborn kidnapping\n\n3. Attacks from gunmen / ex cons / people with known history of mental illness \n\nBackground history- I work on ai based surveillance that can detect persons of interest. I'm working on specific use cases in hospitals\n",
        "created_utc": 1515539382,
        "upvote_ratio": ""
    },
    {
        "title": "Give it a Twirl!",
        "author": "RooshunVodka",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7oq0z2/give_it_a_twirl/",
        "text": "I’m a night shift ER nurse. Unsurprisingly we have many, many weird tales and anecdotes, but one of the all-time greats (that I had the questionable fortune of getting to experience firsthand) is a tale we simply refer to as “Baton Girl.”\n\nIt’s sometime in the summer (July, I think), and at about 3:30 in the morning. Ours is not the biggest ER in the city, so things are pretty dead. We’re all at the nurse’s station goofing off and gossiping when one of us spots a young woman standing at the registration desk out front. We grumble that fun time is over before noticing two things: she’s wrapped in a heavy blanket (again, middle of summer), and she’s standing and moving really, really weirdly.\n\nSomething is under that blanket. Something awful. Something that is gonna make a damn fine story. We can all feel it.\n\nI bring her back for triage. Standard starter question: What brings you here tonight? She mumbles a painfully obviously fake story about “falling off a couch before landing on it” as she pulls back the quilt to reveal….\n\n...yup. That’s a majorette twirling baton, shoved riiiight up her nether regions.\n\nOh no. Oh NO.\n\nOn a good day, I am not the best at keeping a straight face, yet somehow I managed to maintain it all the way through the rest of the triage. Back out to the nurse’s station, where everyone is huddled and eager for the story. Of course we all lose it. On its own the tale of Baton Girl is going into the legends of our ER. The, uh, extraction is fairly painless and anticlimactic. Our doc (Dr. E) gets it out no problem. After all, she’d just shoved it up there-- too much of a good time, I guess?\n\nBut while Dr. E and I were working on that, one of the other nurses pokes about in her chart a little bit. Our hospital is one of a big system in the city, so with the wonder of electronic charting we can see anyone’s history so long as they visit a doctor or hospital within said system. WELL. She finds out that Baton Girl was at another hospital in the system roughly two hours before coming to us where she up and left. Turns out, the ambulance she called took her to Hospital B. Turns out she didn’t like the way they treated her there (she later told us they were rude), so she checked herself out and WALKED to us.\n\nWalked. A good mile and a half. At 3:30 in the morning. Through the ghetto part of our city. With a baton shoved up her nether regions.\n\nYou can’t make this stuff up.\n\nNow Dr. E is a fiendish little prankster when she wants to be. She talks to the patient and we get the whole story before we discharge her. We find out that a friend of hers (Dr. O, let’s call him) was working at hospital B that night. Soon as she finds that out. Dr. E picks up her phone and speed dials Hospital B’s ER.\n\n“Hey, this is Dr. E from Hospital A. Tell Dr. O that I have the baton.”\n\nThen she slams down the phone. We all burst into hysterics. Five minutes later Dr. O calls us laughing and cursing. “God damn it, I was going to spin that damn thing when I got it out!” More husterics ensue, and no one is able to behave like a responsible adult for the rest of the shift. Even now half of us can’t even say “baton” without giggling and/or retelling the story...",
        "created_utc": 1515322766,
        "upvote_ratio": ""
    },
    {
        "title": "Helped accident victim, now taking HIV meds as a precaution",
        "author": "volcs0",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7o55zi/helped_accident_victim_now_taking_hiv_meds_as_a/",
        "text": "I am a physician. I was the first responder to a car accident the other night. It was a bad, single car accident, where the vehicle hopped the curb and ran into a light pole. We didn't see it happen, but we saw the light explode on top of the pole, and we were upon the scene just as two guys that were thrown from the vehicle were regaining consciousness. As I ran up, I could see (and smell) that they were at least drunk, if not more. I asked if there was anyone else in the car, to which one guy said his brother was.\n\nThe car was completely mangled. I looked inside and saw the guy, legs pinned under the steering wheel with most of his body in the back seat. The inside of the car was really crumpled, so the back seat and front seats were pretty close together.\nWhile my wife called 911, I squeezed myself into the car to see if there was anything to do. There was blood coming from his mouth, and he was unconscious. I felt for his pulse, and confirmed that he was alive and breathing. I did my best to keep his head/neck supported until EMS arrived. I also tried to keep the other two guys calm, preventing them from trying to forcefully extricate the guy from the car. It was eerily quiet for the six minutes it took for the first police and fire trucks to arrive. Once they did, the response was pretty overwhelming. It took them a long time to get the guy out - he was really wedged in there. They carted him off in an ambulance. I have no idea if he survived or not. I asked if I should make a statement, but I was told that since I didn't see the accident, I didn't need to. So, my wife and I went home.\n\nI immediately went to wash the blood off my hands. That's when I saw that at the base of my index finger, there was a cut/puncture wound, probably from the broken glass. I washed it out well and didn't note any other cuts or scrapes. All of the blood was on my hands and nowhere else.\n\nThe next morning, I contacted our ID specialist. She confirmed what I already knew - that the safest thing to do would be to go on HIV prophylaxis until we can confirm the vistim's HIV status. I live in an urban area, and not knowing anything about the guys in the car, the risk is certainly higher than the general population.\n\nI was only able to find out what hospital he went to, but I have not yet been able to get his name. I have been told I need to come to the main police station to request a copy of the report. Another option is to go to the compliance group at the accepting hospital. A third option will be to try to get some back-channel information [probably my best bet].\n\nIn the meantime, I've started two HIV meds, which cost me $150 in co-pays. The side effects aren't too bad - some dizziness and fatigue - but noticeable.\n\nIf I had to do it again, I don't think I would do much differently. I still would have tried to help the guy. I didn't do much, though perhaps my major contribution was keeping the drunk brother from trying to pull the guy from the car by force. But I should have assessed myself before I went home and perhaps inquired about his ID, etc. before we left. Maybe.\n\nIs there another lesson here? Thanks for listening.\n\ntl;dr: Helped out in a car accident. Got blood on my hands and a cut. I've been placed on HIV prophylaxis until we can determine the ID and HIV status of the victim.\n\nEdit: Just got word that all testing was negative (HIV, HepB, HepC), so I can stop taking the meds. Phew.\nThanks for the comments and suggestions.\n",
        "created_utc": 1515092436,
        "upvote_ratio": ""
    },
    {
        "title": "To medical staff who worked during the holidays,",
        "author": "Csherman2",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7nviqf/to_medical_staff_who_worked_during_the_holidays/",
        "text": "Thank you. \n\n\n\nMy dad started having signs of a heart attack during church Christmas Eve. We went the the ER and spent the night there and everything turned out alright. \n\nIt wasn't a great Christmas Eve but I would have been worse if there wasn't any medical staff working on the holidays. Thank you to anyone who sacrificed their holiday time to be there for those who needed help. ",
        "created_utc": 1514995151,
        "upvote_ratio": ""
    },
    {
        "title": "Oi, Aussie Swaggers...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7n7soa/oi_aussie_swaggers/",
        "text": "[deleted]",
        "created_utc": 1514714732,
        "upvote_ratio": ""
    },
    {
        "title": "Calling all hospital staff (EMT's, Nurses, Doctors, CNA's, you name it...) What's the most memorable story you have from working in the hospital?",
        "author": "adcable2018",
        "url": "https://www.reddit.com/r/AskReddit/comments/7mjq3y/calling_all_hospital_staff_emts_nurses_doctors/",
        "text": "",
        "created_utc": 1514435314,
        "upvote_ratio": ""
    },
    {
        "title": "The Worst Case of Smiling Mighty Jesus I’ve Ever Seen.",
        "author": "Hemidesmosone",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7ldo0y/the_worst_case_of_smiling_mighty_jesus_ive_ever/",
        "text": "[removed]",
        "created_utc": 1513901702,
        "upvote_ratio": ""
    },
    {
        "title": "The love of cigarettes and a case of lice",
        "author": "Uglybass",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7gfq2j/the_love_of_cigarettes_and_a_case_of_lice/",
        "text": "I work as a unit tech on an oncology floor while I am in nursing school. Everyday I see the effects of smoking and how much people are addicted to it, getting wheeled out by family to smoke in non-smoking areas (aka the entire grounds of the hospital) and arguing with security about it.  One case a few months ago I will never forget though.\n\n\nThis 75 year old lady came in with COPD exacerbation and excessive blood-tinged sputum . She has a history of lung cancer and, of course, a 2 pack a day 40 year history of smoking. From the moment she came in she was rude and confrontational, complaining about every aspect of care and saying how she doesn't even know why she has to stay in the hospital (yet she stays.) She got a chest x-ray and it showed a node in her lung. She has a biopsy ordered and after the doctors and nurses pleaded with her to not smoke for 24 hours, she hesitantly agrees, but needs like 3 nicotine patches to get by, whatever. \n\n\nI don't know if this was just not seen by the ER, the x-ray tech, doctors or what, but she also has lice. We found out when a nurse doing an assessment soon after she got to our floor and noticed some little bugs crawling around on her bed, then checked her hair and saw the little bastards running rampant. Its not just her though, we also find the little kids her family had brought in, the ones running and screaming up and down the hallways, are also infested with lice. They are informed they aren't allowed back on the floor, which was met with a lot of anger and resentment, of course. \n\n\n\nShe gets her biopsy done and is told by the doctors post op that she SHOULD NOT SMOKE AT ALL for at the very least 5 days to avoid inflammation and bleeding from her surgical site, it is very important. What does she do immediately after getting back on the floor? Gets wheeled out by her daughter to go smoke. The hospitalist and nurses reinforce how important it is that she doesn't smoke. Her reply was \"Ahm gonna smoke till it kills me and aint nobody gonna tell me otherwise.\" The frustration is growing and now she is basically denying her plan of care. \n\n\n\nI am her unit tech at this point and I go in to check on her. She tells me how awful she has been treated and that she is damn tired of being told she can't smoke. \"Smokers have rights you know! You're violating my rights by telling me I cant go smoke. And this whole lice thing? The hospital is unsanitary as it is, how do y'all know I didn't get it here??\" I want to tell her maybe because the fucking kids in her family are running around with it, but I just nod and smile. I tell her \"You're right maam, we can't stop you from smoking, we just highly encourage you not to.\" She then gets carted down for her 3rd cigarette in the last 2 hours. The nurses even tried to lock the wheel chair in the supply room and only use it if necessary, but the daughter grabbed one from another floor (nobody stopped her) and took her down.\n\n\n\nAt this point we are all fed up with her shit. The hospitalist, who is the nicest guy I know, wants her the hell off the floor. She made it easy for us by telling us this was the absolute worst care she has ever been given and she is going to leave with or without a proper discharge, she didn't even want to stay at the hospital, she is fine. The doctor writes up her discharge, has her sign a refusal of treatment form and she gets instructions from the nurse. \n\n\n\nExcept one little, tiny snag. When the nurse asks about her home oxygen and if she can consistently get a supply, she answers \"I ain't had a workin oxygen tank in 9 months. It stopped workin so I just haven't been using it.\" This is a lady who desats to 70 as soon as she is off 3L of oxygen, so she has basically been living on 70% O2 sat for the last 9 months, while smoking, with who knows what other environmental pollutants in her house. It then becomes a huge ordeal with the case worker scrambling to find a replacement, setting up home delivery and home health to check on her etc etc... They pull it all off three hours later and she is wheeled out, scowl on her face the Same as when she came in.\n",
        "created_utc": 1511982288,
        "upvote_ratio": ""
    },
    {
        "title": "Went to finals ended up with my pants pulled down",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7797ye/went_to_finals_ended_up_with_my_pants_pulled_down/",
        "text": "[deleted]",
        "created_utc": 1508356930,
        "upvote_ratio": ""
    },
    {
        "title": "Why is my race “C”? I’m not colored!",
        "author": "lizafigz",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/761aud/why_is_my_race_c_im_not_colored/",
        "text": "I work at the front desk of a primary care office. I (unfortunately) didn’t answer this particular call, but my coworker was telling me about one of our patients.\n\nA few months ago, she called the office and sounded upset. She looked at her lab order and noticed that her race is “C”, so she started yelling at my coworker. “This is ridiculous! I’m not colored! This better be fixed right now! I’m never coming back to this office!”\n\nGuess what? She showed up for her appointment today. I’d like to think that she figured out that “C” stands for “Caucasian” because, you know, it’s 2017. People really astound me sometimes. 🙄",
        "created_utc": 1507855225,
        "upvote_ratio": ""
    },
    {
        "title": "Pool juice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/74mrnk/pool_juice/",
        "text": "[deleted]",
        "created_utc": 1507285812,
        "upvote_ratio": ""
    },
    {
        "title": "Urgent Care, I.D., &amp; the Big Fat \"No\"",
        "author": "NancyCA555",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/7419f9/urgent_care_id_the_big_fat_no/",
        "text": "My 18 y.o. daughter came down with a serious case of strep throat. She had to travel over an hour by bus in a major city to get to the closest urgent care facility that accepts our insurance (Aetna Blue Cross HMO purchased through her dad's work). \n\nWhen she arrived at urgent care, she was told she had to present a picture i.d., but she hadn't brought it with her. She did, however, have her insurance card. She was refused treatment. \n\nCrackly voiced, my daughter called me on the phone and asked what she should do. I live two hours away, so there wasn't much I could do by that point. It was too late in the day for her to bus back to her apartment and  back again before the facility closed for the day. I told her to ask if they'd accept a photo of my i.d. since we're both on the same insurance plan. They refused (I get it, she's an adult, privacy, and all that.)\n\nOut of options, she had to return home. She was so sick. She'd really tried, and I was really sad for her. \n\nI get it. The medical profession is a business, and they've been tricked  by uninsured people pretending to be other people (so they could receive medical treatment--how evil of those people), and then the facility loses out on payment. At the same time, there must be more flexibility in allowing someone to receive medical treatment. In this case, a very sick young woman was legitimately insured, went to the facility approved by insurance, had her insurance card with her, but ritual adherence to rules meant a big fat \"no\" to medical treatment. \n\nShe had to return home sicker than when she arrived.\n",
        "created_utc": 1507045769,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's a pulled muscle\" to my Aunt with a major fracture",
        "author": "erinyslyric",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/72pf0n/its_a_pulled_muscle_to_my_aunt_with_a_major/",
        "text": "This isn't my story, but my Aunt's, and it's a bit of a long one. My Aunt recently started playing tennis. During a game a few months ago, she missed the ball, fell, grabbed the net, and the next thing she remembers is being on her back, on the court.\n\nParamedics were called, she was taken to the local hospital. Specifically, the newest \"top of the line\" hospital in Glasgow. She was taken in, and then put in the waiting room. Blood on her face, in a large amount of pain. Now, my Aunt has a bad habit of disassosiating from her pain. She was in the waiting room for over an hour, not moving, so the pain lessened a little, but was still there. When she was finally called through, and stood up, she says the pain was suddenly horrendous, like nothing she'd felt before, and she started crying involuntarily. The doctor said \"Oh for goodness sake, you were fine a minute ago!\" Strike one.\n\nIn the triage room, the doctor asked her to stand, and let her arm hand naturally by her side. My Aunt said she couldn't do that, it hurt too much. (It may be worth pointing out that the paramedics had given her a sling in the ambulance, and, on arrival, the hospital had given her strong pain meds.) The doctor said \"Yes you can, it's not that bad.\" Strike two.\n\nFinally, as my Aunt was worried she was wasting the doctor's time, she said that the pain had gotten better. (Remember the meds they gave her? That's why.) So, the doctor said, \"Well, you're in far too much pain for me to examine properly(WHAT?!) here's some Ibuprofen. Go home and get some rest, you won't need a sling.\" So she did.\n\nThe next morning, my Aunt called her GP. Got an emergency appt, and was sent straight back to A&amp;E. The first *nurse* she say, after hearing of the blackout, did a neuro exam. (thankfully no harm done there.) She was then sent for x-rays. She had fractured the top of her humerous so badly, that every time she moved her arm, the deltoid was pulling the fractured section away from the rest of her humerous. If she hadn't gone back in, she would have needed surgery in less than a week.\n\nShe was back in the sling for over a month. On large doses of painkillers so she could function. She has since sent a complaint to the hospital director, and had no response. The \"customer facing\" officer (I can't remember her actual title) kept saying she didn't know why they weren't responding, and they would find out. (Newsflash, she didn't). It's been nearly four months now, and still nothing. Not even an apology. *BUT* the original doc she saw sent a letter to her GP. \"I understand that you sent *patient* back this afternoon. She wasn't in much pain when I saw her, and so I concluded that it was unnecessary to investigate further.\"\n\nI wanted to travel the 200 miles to Glasgow and smack the doctor in the face for that. I went to my local A&amp;E once for some rather severe hip pain (hadn't fallen or anything, but was so sore it was difficult to walk on), and, although there was a long wait (car accident), they sent me to xray from triage, and made sure I was comfortable. Thankfully, it wasn't serious, but the dramatic shift in care levels astounds me.\n\nI will say, when she went in the second time, the new staff were appalled at her previous treatment, and incredibly helpful. (She has since tried to advance the complaint to head of NHS Scotland, but was told they can do nothing until she gets a response from the hospital head.) Our NHS has troubles, I admit, but they do the best they can with the (NO) money they get. This, however, was a lazy doctor, who just couldn't be bothered. I have a great respect for all of you who are in the medical profession, but I just can't imagine doing this job and NOT caring about the people you see.",
        "created_utc": 1506479753,
        "upvote_ratio": ""
    },
    {
        "title": "Unicorn patient",
        "author": "SirStevil",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/72czhl/unicorn_patient/",
        "text": "I apologize in advance, I'm not a great writer and this will be a short but sweet story.\n\nI have worked in the hospital system for several years and I have seen the best of people to the very worst. Sadly it's usually the family/friends of patients that are the problem.  I am not a doctor so generally I do my job and I am quickly forgotten about.  However after a very long weekend, I had a patient give me a gift for helping her through a very rough time.\n\nTo me these people are already struggling and so they lash out and I never take it personally.  However when they remember you afterwards and take time out of their day to let you know that they are grateful for us showing compassion it makes the job that much more worthwhile.",
        "created_utc": 1506351807,
        "upvote_ratio": ""
    },
    {
        "title": "Doctor Shopper Wants Satisfaction Before Paying",
        "author": "superdupersara",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/71tflc/doctor_shopper_wants_satisfaction_before_paying/",
        "text": "I work at a mental health clinic as part of the admin staff.  Yesterday, we had a new patient come in for one of our NPs.  He refused to pay his copay until he was seen.  He harangued the receptionist about it for so long, she had to go to lunch and pass it off to her relief person.  I overheard this and decided to linger up front to provide back-up if needed.\n\nPatient is P, Relief is R, M is me.\n\nR:  Our office policy is we collect payment at time of service.   \nP:  What if I'm not satisfied with my visit?     \nR:  Sir, that is not how it works.  You are paying for the service of an evaluation from the NP.   \nP:  Well, what if I don't get the medication I need for my medical condition?   \nR:  Sir, the policy is, you pay for your visit before you are seen.    \nP:  Well that doesn't make sense.  That means I'm out that money, and what if she doesn't give me what I need?  Can I speak to someone else?    \nR:  This is our office policy sir.  Anyone else in the office would say the same.  You need to pay or you need to leave.   \nP:  Well what do I do if I'm not satisfied?  Sue her?    \nM:  *standing behind R, laughs loudly*  Sir, you are paying for an evaluation by the nurse practitioner.     \nP:  Well, what if she doesn't give me the medication I need?    \nM:  The nurse practitioner decides what your diagnosis is, and what the treatment for that diagnosis is.  She dictates that, not you.  The fee is $150, to be paid at time of service, and that is your final answer.    \nP: *is quiet a moment*  Do you have a scanner?     \nR:  A scanner??       \nP:  For my card.  I want to swipe it.  *sticks his hand through the check-in window, flailing around for the \"scanner\"*       \nR:  Sir, you cannot put your hands in my window *draws a square in the air around her*  This is my space, and there is protected health information back here, you are not allowed to put your hands through my window.      \nP:  Well I'm not giving you my credit card, you can't have it. \n *grumbles and leaves*      \n\nI am barely back in my own office when another receptionist comes running back, saying I need to go back up front, the patient has re-entered the lobby.  Apparently, he opened the lobby door and scoped out the lobby.  Dude was a flat-affect, dead-eyed white guy who was clearly doctor-shopping for benzos, and my staff was getting twitchy that he was going to get violent.  I grabbed my cell phone and headed to the parking lot to make sure he wasn't up to any fuckery.  We didn't hear from him after that, but I was shaking for a good hour afterward, and was scanning my surroundings constantly on my lunch break.  \n\n\nTLDR;  Doctor shopper wants benzos, isn't gonna pay to be seen by the NP if he doesn't get benzos, gets dismissed from the practice.\n",
        "created_utc": 1506109219,
        "upvote_ratio": ""
    },
    {
        "title": "I still talk about my ex-FWB at work.",
        "author": "lizafigz",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/71egqc/i_still_talk_about_my_exfwb_at_work/",
        "text": "Only because his body is *so* broken.\n\nHe was diagnosed with a herniated disk and mild DDD. Poor guy limped around like an old man. Literally, there was a very old professor who had the same limp. He was fine after the surgery, though; can't really say the same about the old professor (he's still alive though!).\n\nHe also had ACL surgery *for the fourth time* this year. We had a very in-depth discussion of how bionic limbs would be a pretty viable option for him at this point.\n\nI wonder how he's doing.",
        "created_utc": 1505943653,
        "upvote_ratio": ""
    },
    {
        "title": "Affection Injection",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/70lmzv/affection_injection/",
        "text": "[removed]",
        "created_utc": 1505623655,
        "upvote_ratio": ""
    },
    {
        "title": "Mod Note: Flairs and mods",
        "author": "syzmcs",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6xk9ig/mod_note_flairs_and_mods/",
        "text": "Hi everyone,\n\nIts been 9 months since I took over this sub and its been a pleasure reading all your great stories. When I took over I started flaring all the posts as I approved them...currently there are 4 flair categories which are linked below and in the side bar.\n\n**Search By Flair**\n\n* [Featured Stories](https://www.reddit.com/r/talesfrommedicine/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AFeatured%2BStory)\n* [Staff Stories](https://www.reddit.com/r/talesfrommedicine/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AStaff%2BStory)\n* [Patient Stories](https://www.reddit.com/r/talesfrommedicine/search?sort=new&amp;restrict_sr=on&amp;q=flair%3APatient%2BStory)\n* [Discussion](https://www.reddit.com/r/talesfrommedicine/search?q=flair%3ADiscussion&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n**Moderators**\n\nThe quantity of submissions are steady but more than manageable for one mod. However I'd like a fellow mod to bounce ideas off and see if we can find some new features that would be welcome to those that visit us on a regular basis. \n\nThe last time I advertised for mods I appointed two mods, one of which didn't even accept the mod invite and the other than didn't log on for weeks after being appointed. I was gutted. \n\nSo this is an open invitation to anyone who would like to work with me to put an application in. I've outlined what sort of mod I'm looking for above...there isn't any deadline. \n\nPlease submit your applications via modmail and not directly to me so your applications won't get lost among my other notifications. ",
        "created_utc": 1504334417,
        "upvote_ratio": ""
    },
    {
        "title": "And I can't even get a text back. 😒",
        "author": "lizafigz",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6xjgue/and_i_cant_even_get_a_text_back/",
        "text": "I work at the front desk of a primary care office. I do mostly data entry, so my back's always turned to the reception area. One of our patients (MP) walked in and asked the receptionist (R) about one of our other patients (FP).\n\nMP: Hello, is FP done with her appointment yet?\nR: Ummm... *confused because they have different last names*\nMP: Oh, I'm her ride for today.\nR: Oh, I see! How do you two know each other?\nMP: Well, me and FP used to be engaged a long time ago. She's still a very dear friend of mine. If anyone tries to hurt her, I'll kill them. Seriously.\nR: Yes, she's a very nice lady. I'll let her know that you're here.\nMe: *crying internally because I literally can't even get a text/call back but, you know, I'm not bitter or anything*\n\nI think Mrs. MP was out in the car too. I've never seen MP pick up FP before, and neither has the receptionist; both of us have been at this office for at least a couple of years. I wonder if the car ride was awkward at all.\n\n",
        "created_utc": 1504321859,
        "upvote_ratio": ""
    },
    {
        "title": "[Very short] More than a decade after my circumcision...",
        "author": "Vergolob",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6wvbnt/very_short_more_than_a_decade_after_my/",
        "text": "I just found out the skin on my penis grew back a little strangely! There's a hole in it and I can put objects through it! Can't wait until I have a girlfriend to make jokes about it all the time! :D If you want a photo then you're out of luck, I'm not sending dp's to any of you.",
        "created_utc": 1504050886,
        "upvote_ratio": ""
    },
    {
        "title": "No one is putting anything in my ears.",
        "author": "Izzeh",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6wr48s/no_one_is_putting_anything_in_my_ears/",
        "text": "This actually happened a long time ago, but was prompted by [this thread](https://www.reddit.com/r/AskReddit/comments/6wohrs/serious_doctors_of_reddit_what_is_the_most_stupid/?st=j6xfmxak&amp;sh=afc3ba8a). After writing it up, I felt it may be more appropriate over on this sub.\n\n*Illustrated for those without audiological knowledge*\n\nI am a hearing aid audiologist. I perform my role for a British high street retailer.\n\nNow, I like to believe I am a genial person. Patients routinely comment on my demeanour and this means a lot to me when it is well received. Obviously, not every patient finds this welcoming; some find it irritating and my general optimism to be naive. This is fine, of course no one should expect to gel with every single other person. \n\nOne day however, it was clear upon getting my next client from the waiting area that this person was my opposite. She was terse and didn't even bother meeting my gaze when I smiled to greet her. If I'm [this guy](https://cdn.daysoftheyear.com/wp-content/images/happy-cat-month-1-e1472814679231-764x382.jpg), she was [this guy](http://meowoof.com.au/wp-content/uploads/2014/05/TGIF_87_HI.jpg). Whatever, a lot of people are anxious about seeing someone like me because they don't want me to tell them their hearing is below par.\n\nUnperturbed, we continued. We spoke about her history, what she wanted to achieve in her appointment with me and her initial brusqueness did not wear off so it was clear it wasn't nerves - alas, she was clearly just a bit of a dick. Again, whatever.\n\nHowever it got weird when I explained I was going to look into her ears with my [otoscope](https://www.a1medicalsales.com/Merchant2/graphics/00000001/w2070-f.jpg).\n\nShe immediately bolted upright, and the shouting began.\n\nPatient: You will do no such thing! **No one** is going to put anything in my ears.\n\nAt this point, I will admit that I was genuinely a bit dumbstruck. Rather than give in to my rising irritation, I calmly asked what she thought was going to happen in an audiology appointment.\n\nHer response?\n\nPatient: 'Are you stupid?'\n\nMe: 'I don't think so, I like to think I'm reasonably intell-'\n\nPatient: 'Just give me one of those hearing aids that does **not** go in my ear so I can leave! How long is this going to take?'\n\nMe: 'No hearing professional, anywhere, is going to conduct any procedure with you without first looking in your ear. It is a legal requirement. '\n\nPatient: 'Just give me one of the hearing aids. That. Don't. Go. In. My. Ear.'\n\nMe: *thinking for a moment, wondering where the cameras are* 'Do you mean something like a [bone anchored hearing aid](https://thebahablog.files.wordpress.com/2015/03/baha-5-sound-processor-gray-hair.png)? You can even get those without the prerequisite surgery, something like [this](http://www.cochlear.com/wps/wcm/connect/973c7a13-e6e0-4fce-8c58-23a02524a398/En-Baha-4-discover_sb_instructions_3-300x300.jpg?MOD=AJPERES&amp;CACHEID=ROOTWORKSPACE-973c7a13-e6e0-4fce-8c58-23a02524a398-kf3S51w). Otherwise, you might be talking about a [cochlear implant](http://limpingchicken.com/wp-content/uploads/2014/05/Traditonal-cochlear-implant.jpg)? I'm sorry, but these aren't things that I can offer you here. These are, in the most part, surgical options. Surely you didn't expect that from today?\n\nPatient: 'But your adverts say you can walk out with a hearing aid that same day! Are you going to give me one or not?!'\n\nMe: [...](https://media.giphy.com/media/SDxzM5LAVq5Tq/giphy.gif) I'm sorry Mrs RudePerson, I really don't think I can help you today. Besides, as I mentioned, no hearing professional will conduct your appointment if you don't let them look into your ear-\n\nPatient: What a waste of my fucking time. \n\nI hear her continuing to rant as she walked through the clinic floor, demanding to speak to a manager.\n\nMe, sat in my room: [You know what?](https://media.giphy.com/media/l4FsHizA8I7rGWiY0/giphy.gif)\n",
        "created_utc": 1504012260,
        "upvote_ratio": ""
    },
    {
        "title": "Saved by bridezilla!",
        "author": "Jjjjjjapie",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6w6lg7/saved_by_bridezilla/",
        "text": "About 4 months ago, after a dinner party at my inlaws, I had a painful burning sensation on my chest, radiating to my back. It was bad enough to keep me awake all night, rolling around. It was gone at around 8 AM and I figured I had too much to eat and it must've been reflux.\n\nIt would occasionally happen again, always after a large meal, but then about a month ago I had it for a week straight. I went to the doctor, who also said it was reflux and she gave me some pills to try out. Didn't work, and I had another attack during the night. My gf took me to the ER, where they told me again that it must be reflux, and I got sent home with other pills.\n\nThat seemed to work, but a week later I had the worst attack I've had since. I was on 120mg of pantoprazol daily, it couldn't be reflux. So my gf dragged me to the ER again and demanded I'd get the full checkup. ECG, bloodwork, thorax picture, echo, etc. Turns out my gallbladder was full of stones! My gf is a nurse and she'd been saying it was my gallbladder ever since my first attack, so I got a big pile of I told you so.\n\nAnyway, the blood didn't show any signs of infection, so I'd be sent home and put on a 4 week waiting list for surgery...right around the time we are to get married. The surgeon's assistent kept insisting there was nothing she could do about that, and that I would just have to wait. My gf then called every hospital in the country, searching for faster options. Eventually she found someone, a surgeon's assistant at another hospital, who knew the surgeon at the hospital I was at. She called him up, explained my bridal situation, and he said he'd take care of it. The next morning I got a call about my surgery being planned for the next day! \n\nSurgery took twice as long as expected. Turns out, it was insanely infected and about to burst. 'A ticking time bomb' the surgeon called it. They had to flush my abdomen with antibiotics, but now, 2 weeks later, I'm fully recovered!\n\nIf it weren't for my gf's attitude and persistence, I'd be in a lot worse shape now. Nothing stands between her and the wedding.\n\nQuick reminder for surgeons in training: blood results don't tell the whole story! If a patient explains how he rolls across the floor all night long due to the pain he's experiencing every single night, you don't send him home to wait it out for 4 weeks until surgery. Take a closer look. Also, take their situation into account! Rescheduling a holiday is one thing, but a wedding? That's nearly impossible this close to the wedding date without losing your entire investment. Put in that extra bit of effort for your patients. If my own surgeon's assistent had explained my situation to the surgeon, my gf wouldn't have had to spend the entire day calling every hospital in the country for other options.",
        "created_utc": 1503766170,
        "upvote_ratio": ""
    },
    {
        "title": "People don't speak to each other enough nowadays.",
        "author": "lizafigz",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6vstr4/people_dont_speak_to_each_other_enough_nowadays/",
        "text": "I work at the front desk of a primary care office. Our power's been out for much longer than we expected - it was supposed to be out from 12-1 during our lunch break, and I'm posting this at 2:29. I was expecting the lobby to be totally silent because the tv isn't on, and I figured at least one person would complain about the extra wait time while we were trying to figure out how to access our EMR. Thankfully, everyone in the front had a lovely conversation. I think it was mostly about watching the eclipse and other outdoor activities. \n\nPeople aren't so bad sometimes. 😊",
        "created_utc": 1503599459,
        "upvote_ratio": ""
    },
    {
        "title": "Doctors Can Be Pricks",
        "author": "sweet_darling666",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6vbhix/doctors_can_be_pricks/",
        "text": "First things first I'll give you the backstory, I got pregnant at the age of 15. I was young and scared, therefore, did not tell anyone that I was pregnant. My mother noticed that I hadn't had a period, and decided to take me to an OBGYN. Whilst in the waiting room, I broke out in hives because even though I knew that I was pregnant, my mother did not. We get called back, I give a urine sample, obviously the doctor comes back and tells me that I'm pregnant. I had only had unprotected sex once, 6 months beforehand. So, we rightfully assume that I am 6 months pregnant, ultrasound confirms. \nMy mother is irate, screaming at me telling me that I'm not keeping the baby. Abortion is the first thing that comes to her mind. Obviously, since I'm 6 months pregnant, that's not an option. The doctor tells my mother not to come to such rash decisions (although, it was not her decision to make). So, there's the backstory. \n\nFast forward a couple of weeks to my next appointment. I'm laying on the examination table, legs spread, asking questions that a young girl who is pregnant would ask. The doctor is down there, checking me out, answering my questions with a very judgemental tone. I asked how long labor could be, and he says it could be for several days. I reacted with a gasp, a little scared, because, ya know, I'm 15 and so nervous about all of this. \n\nHe responds with the most ridiculous and harsh statement.... he says \"WELL MAYBE NEXT TIME YOU SHOULD KEEP YOUR LEGS CLOSED\".\n\nI started to cry, but not sob, so he didn't notice. I couldn't believe how unprofessional he was! I mean, I know I was young, but damn! You don't have to be a fucking asshole about it! ",
        "created_utc": 1503413227,
        "upvote_ratio": ""
    },
    {
        "title": "One week post-op from mediastinal teratoma removal. I feel amazing, like I'm 13 again!",
        "author": "SBA_pen",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6v7xpm/one_week_postop_from_mediastinal_teratoma_removal/",
        "text": "So doctors had always told me, for years, that I was perfectly healthy and everything checked out. Here's my list of health problems I was having:\n\nAge 8 - I realized I could never get comfortable sleeping on my back, it felt like there was something pushing down on my chest so that I couldn't breathe. Always slept on my side.\n\nAge 23 - Started getting back pains, coincided with my first office job. I blamed the chairs and started putting pillows behind my work chair.\n\nAge 25 - Brought back pain issue up with a doctor, she dismissed it and said that I was young and healthy and didn't even need to see a doctor every year at my age.\n\nAge 26 - Back pains much worse. Start spending $40 a week on chiropractors. Also notice a stiffness at the front of my chest too. Constantly doing weird things like bending backwards over sharp cubicle corners to relieve one specific pain area in my back, on the opposite side of my heart.\n\nAge 28 - Brought up back pains with another doctor, got it dismissed again. Started going to the gym, thinking working out my back muscles would help. I notice a rash start growing on the right side of my face and nothing seemed to get rid of it. One day I get very bad chest pains after going to the gym, like my heart was swelling up to the point of pain. Went to another doctor, she did an EKG and said the EKG looked great. She said my only issue was that my resting heart rate was about 100 beats per minute, which was a little unusual because I'm skinny and 28. I mention I feel a sharp pain every time I try to inhale or exhale deeply, so I can only take small breaths. She tells me to take it easier at the gym. Heart pain continues for a couple more weeks.\n\nA few weeks later I was using the sauna at the gym because the back pain was so bad it was resonating to my shoulder, my chest, my left arm, my left elbow, my left wrist, even my jaw. I curled up on a bench in a gym and couldn't move, and someone called an ambulance on me. At that point I got rushed to the ER.\n\nER nurse: What's she in for?\n\nParamedic: Back pains.\n\nER nurse: That's it?\n\nThe ER nurse asked me if I had ever tried using a heating pad, but the young ER doctor ordered a CT scan and found my 7cm teratoma. He gave me the bad news speech and transferred me to a cardiothoracic surgeon. Cardiothoracic surgeon said he wasn't going to operate on me unless I had a biopsy first, and since I became an outpatient it was another month and a half before I got my surgery.\n\nBy then other problems began to pop up: all four of my wisdom teeth started hurting at around the same time and hurting CONSTANTLY, I started feeling pressure against my stomach which made me lose my appetite, I started getting pains in my ear canals, and even the occasional sharp stab of pain on the left side of my head about once every 20 minutes. Every time I stood up I felt a sharp pain in my chest a few seconds later, like a bunch of blood was rushing through a compressed vein.\n\nThen I got my surgery. Surgeon did a median sternotomy, 12 cm. Took 4 and a half hours because he said that my teratoma had wrapped itself around a major nerve and blood vessel. Not only that, but my teratoma wasn't made of squishy things like hair and soft organ tissue. It was made of skeletal bone/calcification, no wonder everything hurt.\n\nFirst two days after surgery were hell, but now it's been a week and I'm mostly recovered. I feel AMAZING! Every single symptom I mentioned earlier in the post is gone. My back no longer hurts, it no longer hurts to stand up, my chest doesn't hurt much anymore, ear pains are gone, tooth pain is gone, headache is gone, even the rash on the left side of my temple is gone. I can sleep on my back without feeling any pressure. I am only 1 week post-op and already I feel like I'm 13 again!\n\nAlso my sternotomy scar turned out very straight (I was worried it would be crooked but didn't even mention my concerns to the surgeon), a nurse complimented it while I was in the hospital and wanted to know who did it.",
        "created_utc": 1503367507,
        "upvote_ratio": ""
    },
    {
        "title": "My surgeon uses slang",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6uucvl/my_surgeon_uses_slang/",
        "text": "[deleted]",
        "created_utc": 1503211562,
        "upvote_ratio": ""
    },
    {
        "title": "The EMT that got on with her work while she hurt... a lot.",
        "author": "MartijnCvB",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6uruo8/the_emt_that_got_on_with_her_work_while_she_hurt/",
        "text": "About 9 years ago, just before my 18th birthday, I was cycling between two Dutch villages at about 10pm, on a cycling lane next to the road. On that road, drivers were allowed to go 80km/h (50 mph). There is some grass and the occasional tree in between the road and the cycling lane, but no barriers. \n\nJust before I came to a bend I heard a loud crash, followed by what sounded to me like metal tearing. When I came around the bend I saw 3 cars piled up. One of the drivers was outside of his car, and staggering around a bit. I figured he was in shock, but later it turned out that he was *just* over the legal alcohol limit (by so little that he would most likely have been given a warning by a police officer if he hadn't just driven into another car), and he had been speeding (they estimated 100km/h (62mph)). What had happened was that the drunk-ish driver had hit a car, that car had hit another car (sandwiching the car in the middle), and the last car had shot across the grass into the cycling lane, hitting a cyclist. The driver of the middle car and the cyclist were in bad shape, the other two had bruises and minor cuts. \n\nAt the time I didn't know all this of course, and I told the driver that was staggering around to sit down in the grass while I called 112 (European alarm number). I helped with assessment of the injuries as best as I could. The injured driver was stuck inside his crumpled up car, and he couldn't move most of his body either. I don't need to tell you that that was a bad sign and he did indeed turn out to need a wheelchair for life. The cyclist was unconscious and didn't appear to be very badly hurt except for a head wound. \n\nAn ambulance arrived. The first responders. Two EMTs come out, I point one towards the cyclist (I was standing next to the stuck driver at the time) and she walks over there. Without comment she starts administering first aid to him. I'll be honest, I was mostly focused on helping the other EMT with assisting the driver, as I figured that EMT might need a hand more than the one with the cyclist. After a few minutes, just before the second responders arrived, I heard a sob. I looked over and the EMT next to the cyclist was crying, mostly silently, while going about her job. As in, tears streaming down her face. When the second ambulance arrived, they took over from her, and she dissolved into tears. \n\nI later found out that the cyclist was her brother. He died; brain dead. He had hit his head during his fall on a concrete edge similar to a curbstone. \n\nAbout 5 years later, I fell off my bicycle in a much less severe accident and needed an ambulance. Guess which EMT came to help me? Despite her personal trauma from that day, she carried on working her job as an EMT. She's, if you ask me, a hero. ",
        "created_utc": 1503179643,
        "upvote_ratio": ""
    },
    {
        "title": "Woman born without vagina crowdfunding surgery",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6ur8n1/woman_born_without_vagina_crowdfunding_surgery/",
        "text": "[removed]",
        "created_utc": 1503173003,
        "upvote_ratio": ""
    },
    {
        "title": "Question/story: Does being unprofessional correlate to skill?",
        "author": "CriitR",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6tpsy2/questionstory_does_being_unprofessional_correlate/",
        "text": "So to start, I did not see the doctor until an hour after my appointment was supposed to be at. Once I was finally placed in a room I could hear patients and staff conversations through the walls. (not that I was trying to but its happens). I heard the doctor talking to a patient saying \"Dr____ is here to make your bladder gladder.\" This type of cheesy line and a similar voice made me think of Saul goodman from breaking bad, or better call saul. Maybe this played into my perception of him later, but we'll get to that. He seemed nice when he first came in, but upon seeing the cyst he said \"Oh THIS tiny thing?\" as if i was stupid which was a little insensitive for something the patient may be very self conscious about. After answering my questions (some of which he blew off either because he thought I was making excuses or because he didn't want me to worry about anything. Saying things such as \"I'm sure it did\" and \"I bet\") and scheduling another appointed, he slapped my back and without removing his hand said 'I know what I'm doing, they call me Dr. Dick.\" \n\nI assumed he was doing this to make a doctor patient bond and being that I'm 17 he may thought I would appreciate the humor, but the image of him as a shady lawyer from breaking bad had me apprehensive. I have done my research and he is well established and certified, it's just that his mannerisms just seem to be unprofessional. \n\nPS: not a frequent user of this subreddit if there is a better sub to post this just let me know and I can move it. ",
        "created_utc": 1502748011,
        "upvote_ratio": ""
    },
    {
        "title": "a doctor told me to watch his youtube channel, so I did",
        "author": "thelancingmems",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6t5naz/a_doctor_told_me_to_watch_his_youtube_channel_so/",
        "text": "[removed]",
        "created_utc": 1502501313,
        "upvote_ratio": ""
    },
    {
        "title": "\"Y'all are killing me\" (bad choice of words for a doctor's office)",
        "author": "lizafigz",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6t163c/yall_are_killing_me_bad_choice_of_words_for_a/",
        "text": "Our new patient today is complaining about his $15 copay.\n\n\"I'm just here to get refills of my medications. There ain't nothing wrong with me.\"\n\n...So why are you on those medications in the first place? 🤔",
        "created_utc": 1502458430,
        "upvote_ratio": ""
    },
    {
        "title": "The injection that went wrong",
        "author": "KopKhunFukYoo",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6r32eu/the_injection_that_went_wrong/",
        "text": "In my first year of dental school, my colleagues and I learned much anatomical theory, including dissection of the head, neck and thorax of a kindly gentleman who donated his body to science.\n\nIn our second year we were let loose, to practice our skills on real humans who came to have free treatment at the teaching hospital.\n\nOn the whole, very few patients suffered, and indeed the one in this story didn't. However, while trying to give a numbing injection for the lower jaw; a local anaesthetic which could only be properly delivered by the correct identification of certain anatomical landmarks, rather than direct vision, one of the  students got it wrong and put the needle through the patient's cheek and proceeded to deposit the lignocaine on the adjacent wall of the surgery rather than next to the nerve bundle supplying the lower teeth.\n\nThe patient didn't realise what had happened and the injection was repeated sucessfully by a more experienced clinician, but oh we did laugh!\n\n",
        "created_utc": 1501666637,
        "upvote_ratio": ""
    },
    {
        "title": "The patients who complain about waiting are the ones who need a long time with the doctor",
        "author": "GeneralLeighFuhktoff",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6pnw5e/the_patients_who_complain_about_waiting_are_the/",
        "text": "I'm a receptionist at a clinic in a poor area, we see a variety of patients and some days are busier than others. Today was one of the busiest. The doctor was a bit late seeing patients, it happens sometimes and I'll call him if there are are more than 2 people waiting to see him and try to get an ETA. A patient starts complaining literally 3 minutes after his appointment time. I apologize and tell him we're a little behind because we get some people with complex medical issues and medical emergencies. They ask me 'what's the point in having appointment times if you wont stick to them?' I repeat we can't always estimate the time a consultation will last and we have a duty of care to all our patients.\n\nPatient is called into the doctor's room... and stays there an hour. I call to advise doctor the waiting room is full, he is constantly delayed by this patient asking the same 3 questions over and over. Then, the patient asks for a discount. The doctor was nice enough to give a 33% discount and waived the charge for medication and materials, the patient wanted more of a discount. The patient ends up paying and the doctor feels like crap because he lost money by charging the patient too little and had other patients cancel because they were waiting so long. \n\nIf this was an emergency situation I know we would have happily given a discount, the doctor really does his best to provide treatment to everyone who needs it, but this patient just needed a form completed. While trying to get a bigger discount the patient then starts asking ME for medical advice. No. Just no. We put them in contact with people who can help if the patient has concerns after the clinic is closed and had to politely shoo them out of the clinic. ",
        "created_utc": 1501074401,
        "upvote_ratio": ""
    },
    {
        "title": "Someone came into A&amp;E and waited 2 hours to let us know that he was almost bitten by a dog.",
        "author": "chimpyang",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6pgf5y/someone_came_into_ae_and_waited_2_hours_to_let_us/",
        "text": "",
        "created_utc": 1500992399,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know a sketchy doctor in southern cali that will prescribe me prometh/ codine syrup ?",
        "author": "fishtacos69",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6oktf1/does_anyone_know_a_sketchy_doctor_in_southern/",
        "text": "[removed]",
        "created_utc": 1500600669,
        "upvote_ratio": ""
    },
    {
        "title": "The time I got Lasik eye surgery in Mainland China",
        "author": "SBA_pen",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6n530t/the_time_i_got_lasik_eye_surgery_in_mainland_china/",
        "text": "So 9 years ago, nineteen-year-old me wanted to get Lasik eye surgery. My mom is Chinese and decided that rather than for me to get it done in the US, she would have me get it done in China because her sister there is a pediatrician. Her sister knew a reputable eye doctor and I went there for the surgery.\n\nNow I don't know if they do this differently in the US, but all they gave us were eyedrops to temporarily numb the pain. I got my eye drops first, and then went into a room and lay on a table.\n\nThe eye surgeon was pretty young, maybe early to mid thirties. He was also a bit of an asshole. He looked at my birthday and asked why I was getting Lasik at such a young age, but then started the surgery. They clipped something over my eyeball so I couldn't move my eye, and then told me to look straight ahead.\n\nBzzz bzzz bzzz. I tried to look straight ahead but the light was so blinding my eyes kept naturally trying to avoid it. The surgeon yelled \"don't move!\" And then when the surgery was over a minute later, he was so mad that he put his hand on my shoulder and shoved me off the operating chair. I heard him then angrily snap to the people around him, \"what's a child so young getting surgery for anyway?\"\n\nAnyway, then I got redirected down a hallway and sat on a bench. 5 minutes later, the next patient took a seat next to me. Then the one after that. We all had the same surgeon and it was like a factory line, lol.\n\nBy then my eye drops were wearing off and my eyes were burning hard. My eyes instantly teared up and the salty tears caused the rest of my eye anesthetic to come out. I started crying from the pain, my eyes just dripping tears. By the time my aunt was guiding out of the hospital I was clutching onto her arm for dear life because I couldn't see and was in a lot of pain. This was maybe an hour after the surgery.\n\nA young woman - the last of the patients walked past us and asked what was wrong with me. My aunt replied I was in pain. The other patient said she didn't feel anything at all and that I needed to get over it.\n\nWell, after I went home and slept it off, I woke up feeling much better. The searing pain was just a mild pain. The next day we went back to the hospital, and guess who we pass on our way into the elevator? The same girl who told me she didn't feel any pain and that I needed to get over it.\n\nTurns out since I was the first one to get the procedure done, my eye drops had already worn off while hers had not. She was crying so hard she had to back into the elevator with tissues pressed against her face!\n\nKarma, bitch!",
        "created_utc": 1499985192,
        "upvote_ratio": ""
    },
    {
        "title": "It never ceases to make me laugh",
        "author": "LtDrinksAlot",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6mpwgh/it_never_ceases_to_make_me_laugh/",
        "text": "Happens atleast once a day. \n\n*me calling out patients name listed in chart*\n\nAngrily a patient walks up to me, \"Excuse me I go by *insert name not listed in chart*\"\n\nAh yes how could I have made such a blunder, I should have known. ",
        "created_utc": 1499813659,
        "upvote_ratio": ""
    },
    {
        "title": "Got diagnosed with a 7cm teratoma in my chest",
        "author": "SBA_pen",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6mcc07/got_diagnosed_with_a_7cm_teratoma_in_my_chest/",
        "text": "Seeing a doctor at age 25...\n\n\"You're young, you're healthy, everything looks good. You don't even need to see a doctor every year at your age, once every three years is enough...\"\n\n\"My back always hurts\"\n\n\"You can always do some stretches at work, or get up and walk around\"\n\nSeeing a doctor at age 28...\n\n\"You are young and everything looks fine. Is there anything else you are concerned about?\"\n\n\"My back always hurts\"\n\n\"Oh yeah, I would recommend just getting up and walking around\"\n\n...1 month later, got sent to the ER in an ambulance...\n\nER doctor: \"CT scan blah blah mass blah blah it's a decent size, seven centimeters blah blah mature teratoma blah calcified. It's most likely pressing on your nerves, which was causing the pain. How long did you say you had back pains for?\"\n\n\"Five years.\"\n\n\"Five years???? And you never had it checked out?\"\n\n\"I thought it was because I worked at a desk job, and that I was getting older.\"\n\n\"'Getting older' at 28?!\"\n\nThe doctor was explaining that having a tumor press against your nerves/heart was a very different level of pain from ordinary back pains and he couldn't believe I put up with it for 5 years.",
        "created_utc": 1499662183,
        "upvote_ratio": ""
    },
    {
        "title": "Actually, yes that is my job!",
        "author": "Katmac1987",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6l152n/actually_yes_that_is_my_job/",
        "text": "I've worked the front desk at a physical therapy office for 7.5 years now. In this story, we'll call the star of the story, Man.\nMan is the typical older gentleman who wants to bond with a younger dude, so he feels the need to talk chicks, and curse often.  He came in one day and spent an hour going on and on with male therapist/boss about how lazy his wife is, how she doesn't do anything to make herself better, and how women in general are basically not as good as men.  He even tried to get Nice Male Patient to chime in about how bad women suck, but Mrs. Nice Male Patient was in the waiting room and he would never talk like that about her anyway.  Man tells therapist a story about a movie he watched and quite loudly talks about c@ck$ in face and the like...\nHe is overall loud and obnoxious and very open with his far left wing political views, as if anyone cares to hear.  He thinks we owe him for patients coming into our clinic that live in the same area as him because he's responsible for referring them ALL to us.  Anyway..I'll get to the story.\n\nMan was scheduled for an 11:30 appointment one day.  He was still not here at 11:43 and the 12:00 patient is very hands on, and Man is super high-maintenance so there was no way the two could be doubled.  I call him at 11:43: \nMe: \"Hi Man, we had you scheduled for an 11:30 appointment today, I was calling to see if you would like to reschedule\"\n\nMan: Hunh, I thought it was 12:30, I'll be there in 10 minutes.\n\nMe: I'm sorry, that won't work today.  I can reschedule you for 2:00 this afternoon with female PTA, or male PT at 4:00PM.  But I already have you on for Wed/Fri this week, so we can just wait until then if you'd like.\nMan: Ugh, no hold on... I'm driving I need to pull over to check my schedule.\n\nMe: Okay, I'll wait.\n.....\nMan: You know, sometimes I come in and have to wait over 30 minutes for you people to see me.  But you call me when I'm ten minutes late and expect me to change my schedule, you know my time is important too.\n\nMe: No sir, we never have anyone wait 30 minutes for an appointment.  Our policy is that if you are more than 15 minutes late, you will need to reschedule.\n\nMan: No, you've had me wait 15-20 minutes for an appointment before.  But you call me at 11:42 and say you can't take me when I told you I'd be there in just a minute.\n\nMe: Okay, well it won't work out for today.  So, we'll just see you on Wednesday.\n\nMan: Fine, okay fine, I'll be there Wednesday. (plus more griping...I can't remember right now...)\n\nWe both hang up...Man calls back, I'm on the other line so I put him on hold and let Male therapist/boss take the call.\nBasically Man tells boss that refusing to treat a patient at the time they want to be treated is bad for business and will not keep us competitive with the industry.  Man says I know that girl has been here along time but she should not have the right to tell ME I cannot come in for my appointment...\nblah blah blah...actually sir, that's exactly what my job is...",
        "created_utc": 1499101348,
        "upvote_ratio": ""
    },
    {
        "title": "Infection From Wisdom Tooth Extraction",
        "author": "lilscizorspizza",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6l14qj/infection_from_wisdom_tooth_extraction/",
        "text": "[removed]",
        "created_utc": 1499101256,
        "upvote_ratio": ""
    },
    {
        "title": "Infection from Wisdom Tooth Extraction",
        "author": "whocansamkan",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6l0uhz/infection_from_wisdom_tooth_extraction/",
        "text": "Hi friends! Last Friday 6/23 i had three of my wisdom teeth removed! 2 on the left because they had completely grown in and were completely fine to take out, and 1 on the bottom left because that had impacted another tooth. Didn't get the top right taken out because it hasn't gown and in, and dr said it look aight so i figured i'd cross that road when i got there. \n\nHealing process was going well i thought. I actually noticed like the tiniest white spot on my stitches on the right tooth but that was the impacted one) but i thought it was skin healing (but i think it was pus). Around that time the stitches turned yellow for like a hot sec but i thought that's because I had a pickle chip. I thought i was doing fine like I taking all my meds, rinsing the extraction site whatever. \n\nThen like 4 days after the wisdom tooth extraction, i noticed bruising under my chin, then it hurt a lot to swallow, but I thought it was part of the healing process. \n\nThursday night 6/27, it hurt like crazy to swallow and the whole right side of my face was super swollen. I could barely swallow my pain meds and they didn't help. my oral surgeon prescribed me amoxicillin over the phone that night, but i hadn't gone to see him because  i was supposed to meet with him the next morning. Instead when i woke the whole right side of my face, under my tongue, and under my chin were all swollen. i could barely talk and and hurt worse to swallow.\n\ni decided to go to the hospital instead of my dentist. they did scans which revealed a large infection sack(abscess) in my throat, luckily it never affected my airway. i went into surgery that night (Incision and Drainage) which feeds a pipe from the crease between the neck and jaw through my throat and into the abscess.\n\nThey kept this pipe in post surgery as it allows gravity to drain the fluid over time. I thought it was going really well, like i was swallowing water and broth but not taco bell :(\n\nWell yesterday morning I woke up worse than the the morning I actually went to the hospital. I basically looked and felt like this: [great goblin](https://i.ytimg.com/vi/TtUlQ0zXN1w/maxresdefault.jpg)\n\nThey gave me a ct scan and determined the abscess had spread from the right side of my throat to the middle of my throat and deeper. Still didn't affect my breathing tho. So last night they had to do the same surgery, with a bit different of a process. I will have to have a third surgery tomorrow morning to make further clean out the infection site and remove some tubes from me. \n\nToday I am attached to a lot of tubes. i have tube coming out of my mouth and both arms. I have a catheter in me but i didn't even know but apparently i'm peeing normal and i'm probably peeing currently you're welcome. My pain is significantly less than yesterday which i take as a good sign and i can swallow things ;). not water tho i really miss drinking water. and taco bell. \n\nThanks for reading all that if you did it just feels good to talk about my experience. This is my first surgery ever and i've had 3 in one weekend! Luckily i have my friends and family around me so i am not alone :) I just can't believe this happened because of my wisdom. Sorry for spelling mistakes and/or things that may not make sense i'm on drugggzzzz and i don't have my glasses on. \n\n[TL;DR]: had my wisdom teeth taken out, got two surgeries so far due to infection in my throat, and due to have one more tomorrow morn.\n\nPlease send me your surgery stories if they're related, heartwarming stories, OR CATS!!!!!!!! ",
        "created_utc": 1499098512,
        "upvote_ratio": ""
    },
    {
        "title": "XXXXXXAAAAAANNNNNAAAAAXXXXXX",
        "author": "Squeak_Squeakum",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6krmcs/xxxxxxaaaaaannnnnaaaaaxxxxxx/",
        "text": "Today I had an argument\" with a 78 year old lady about how to spell \"Xanax\". \n\nShe's a new patient; filling out her paperwork which includes a page asking to list any current medications you are taking. She comes up to the front desk with her paperwork in hands and asks \"how do you spell 'xanax'?\" \n\n\nAnd I start \"X-A-\" and she immediately scrunches up her face and exclaims: \"no! No, it starts with a 'Z'\". \n\nme: \"no ma'am, it starts with an \"X\"\" \n\nher: \"no. It starts with a \"Z\" and she leans really far over the front counter and loudly and slowly drawls out  \"XXXXXAAAAANNNNNNNAAAAAAAAAXXX\"\n\nThen she leans back and crosses her arms and looks at me smugly like she just laid out the most ironclad argument anyone ever has declared. \n\nI pause and stare into her smug eyes and remember that I am an adult. I say carefully: \"ma'am. It. Starts. With. An. \"X\"\" and she kinda flip/waves her hand at me and makes a 'tutting' noise like I am an unreasonable moron and she spins around and flounce-shuffles off to sit down in her chair in a huff. \n\nFine. No skin off my nose. Enjoy trying to tell the doctor xanax starts with a Z.",
        "created_utc": 1498971671,
        "upvote_ratio": ""
    },
    {
        "title": "Remember your rights",
        "author": "imaswedishpagan",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6ifhau/remember_your_rights/",
        "text": "When I was searching for neurologists for a pretty bad tremor mainly in my arms/hands (sometimes in the lower half of my body but I digress) I went to see this one doctor.  A doctor I found out every doctor in town I've talked to HATES. \n\nSo my then psychiatrist referred me to this doctor because of my tremor after some discussion with her.  My appointment was in a few weeks and it was the standard for getting referred to a new specialist (i.e. fill out a crap ton of paperwork on medical history and symptoms and the like) and soon enough, it became time to go see the guy.  He did the knee reflex test, had me walk across the room and stuck me with a safety pin.  Told me I just had an essential tremor, nothing he can do and kicked me out the door.\n\nAfter I talked to my mother about it that night I was feeling rightly pissed off so she told me to call my GP to get set up for another referral.  After a brief examination even the GP that I hardly ever saw had determined it wasn't \"just\" an essential tremor and sent me off to honestly the best doctor I've ever been to.\n\nHe listened to me, he looked at the paperwork.  He offered to start me on carb/levo (which worked for a few months). He'd also made a point of saying (and has said so in the past 4 appointments I've had with him) that his former colleague (he was at that practice before shifting up to my states medical college) shouldn't have treated me that way because if anything, my previous doctor should have had even MORE reason to treat me.\n\nA little information about my current neuro.  He's said repeatedly that  in the 18 years he's been a practicing neurologist he can count on one hand the amount of patients he's treated under the age of 25.  My first appointment with him was when I was 18 YEARS OLD.  I'm now 19 and he's almost positive that it isn't simply an essential tremor but PARKINSON'S.   \n\nMy first neuro sent me a 400 dollar bill just to tell me nothings wrong and there's a very good chance that I have Parkinson's.\n\nTL:DR  If you aren't happy with what one doctor tells you REMEMBER.  YOU HAVE THE RIGHT TO SEEK A SECOND OPINION",
        "created_utc": 1497979095,
        "upvote_ratio": ""
    },
    {
        "title": "Just one more thing - there appears to be a small brain tumor on your CAT scan.",
        "author": "OldWomanoftheWoods",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6ib5er/just_one_more_thing_there_appears_to_be_a_small/",
        "text": "&gt;It doesn't have anything to do with the fainting and dizzy spell that brought you into the ER tonight,  but you should follow up with your primary care physician.\n\nI do the whole \"be the calm person\" while my husband spends the next week in panic mode. He gets the first available with his PCP, which is a month.   This bewilders me, but it's his MD, not mine.   Drive him to the appointment, go back with the nurse.  She asks, 'So what brings you in today.'    Husband starts frantically talking about fainting and dizzy spells, visiting the ER, having to follow up.   \n\nThe nurse nods and takes notes looking remarkably unconcerned,  until I add,  \"The main point is to get a follow-up CAT about the possible brain tumor.\"\n\nThe nurse looks stunned, and in about two minutes we are talking to the MD.   My beloved, heart of my heart, dearest of men,  scheduled the follow-up and *didn't mention the ER's CAT scan at all*.\n\nI can tell this story now, laughing at the sheer nuttiness of it, because we got the follow-up results, and he's clear.  No tumor, just an artifact of the process.",
        "created_utc": 1497924991,
        "upvote_ratio": ""
    },
    {
        "title": "Can't get rid of scabies?",
        "author": "ivermectin_throaway",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6h04p3/cant_get_rid_of_scabies/",
        "text": "[removed]",
        "created_utc": 1497363346,
        "upvote_ratio": ""
    },
    {
        "title": "Refused to let me take her BGL because all she had were milkshakes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6g9yvj/refused_to_let_me_take_her_bgl_because_all_she/",
        "text": "[deleted]",
        "created_utc": 1497030028,
        "upvote_ratio": ""
    },
    {
        "title": "What happens during an organ procurement from a nurses perspective and the emotions that nurses experience when we participate in organ donation.",
        "author": "laceyjadechristie",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6dxegv/what_happens_during_an_organ_procurement_from_a/",
        "text": "[removed]",
        "created_utc": 1496020651,
        "upvote_ratio": ""
    },
    {
        "title": "How could you miss a paramecium?",
        "author": "demonaspet",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6apftk/how_could_you_miss_a_paramecium/",
        "text": "This isn't my story, but a friend who worked at a lab. Also, not sure paramecium is the right critter but close enough; it was a microscopic (commenters say its Trichomonas vaginalis; ty)\n\nFriend worked at a lab. Someone sent down a urine sample with orders to screen it for paramecium, a tiny organism swimming around. He looked at it under the microscope and reported back it was negative.\n\nA nurse came down and said \"Boy are you in trouble, you messed up that paramecium screening bad!\" \n\nConfused, he asked what she meant. She showed him a plastic bag with a comb in it.\n\n\"You didn't find any paramecium under the microscope, they were so bad I was able to get one with a *comb!*\"\n\nHe had to explain that a paramecium is a tiny organism you can't see with your eyes, and what she caught with her comb was not a paramecium, it was crabs.",
        "created_utc": 1494566274,
        "upvote_ratio": ""
    },
    {
        "title": "Dr. Robert Liston Accidentally Cut Off a Man's Testicle",
        "author": "historicallydumb",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6aeogw/dr_robert_liston_accidentally_cut_off_a_mans/",
        "text": "[removed]",
        "created_utc": 1494441334,
        "upvote_ratio": ""
    },
    {
        "title": "The time when my doctor was so nervous that she gave me my results... without giving me my results.",
        "author": "MartijnCvB",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/69tq1h/the_time_when_my_doctor_was_so_nervous_that_she/",
        "text": "I was in hospital in 2012 because I was suspected of having cancer, though there were some other possibilities (including benign tumours for example). They did a biopsy (stomach area), the little wound from the biopsy got inflamed, I had a fever (got up to 39.8 degrees Celsius!), so I had to stay in hospital for a little under a week while on antibiotics and other medication. I had an appointment for the biopsy results for that Monday, but since I was there already anyway, and they had the results on Saturday, they decided to give me the results that day. \n\nI had two doctors, let's call them Dr. Fancy and Dr. Nervous. Dr. Fancy was about 50, and he was just... well, fancy. He walked as if the whole hospital belonged to him. Big moustache. Blond, curly and slightly graying hair, no baldness. He talked with a big, booming voice and an accent that made it clear that he was born with a silver spoon... or more than one... up his ass. Dr. Nervous was roughly the opposite. She was young, maybe 25, and an immigrant from Northern Africa or thereabouts. She spoke perfect Dutch (this whole thing happened in the Netherlands) but with a heavy accent. She had impressively long, black hair. She was nervous about everything. She once apologised 3 times to me for dropping her pen, when the pen came nowhere near hitting me. Just to give you an idea. \n\nAnyway, results day. Both doctors were there. Dr. Nervous started talking. \"Mr. /u/MartijnCvB, the t-t-t-tumours we found will require surgery and...\" and without missing a beat Dr. Fancy piped up and boomed \"For gods sake Nervous, you haven't even told the man that he has cancer yet!\"\n\nThey were - for totally different reasons - the most tactless doctors I've ever talked to. But it does make a good story when I look back on it. That was the last time I spoke to those doctors by the way. They referred me to another hospital with more expertise and I filed a complaint with the hospital on how that conversation had gone. The hospital only replied that \"measures had been put in place to avoid such circumstances in the future\" without going into details. \n\nPS: for those who are curious about my health; I still have cancer - a rare liver cancer called fibrolamellar. I've had surgeries to remove all (or so they thought) tumours in 2012, 2014 and 2016, and I currently have 4 tumours inside of me (none in the remnants of my liver luckily) and I am on life extending chemo therapy. ",
        "created_utc": 1494190551,
        "upvote_ratio": ""
    },
    {
        "title": "Always get your results alone",
        "author": "tailorDr",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/68j2c8/always_get_your_results_alone/",
        "text": "Scribe here. This is one of my favorite stories from my first few shifts in the ED. \n\nYoung female patient checks in with a female guest, she's here for nausea and dizziness. During the initial interview we come to find out she's had these symptoms for at least 2 weeks but due to being kicked out by her parents, lack of insurance, blah blah blah she couldn't come in before now. We also learned they were a lesbian couple that had been living together for at least a month.\n\nWe run the usual tests and everything comes back negative except one. \n\nWe re-enter the room and the first thing the doctor asks is \"may I give your test results in front of her\" *points to female guest*. Patient agrees. \n\nDoctor: \"Okay well ma'am everything came back negative but you are pregnant\" \n\nYou could've heard a pin drop in that room. \n\nDoctor gives his exit speech and we run out just before all hell broke loose. After 30 minutes of screaming and crying the patient and her guest are escorted out of the ED. Doc and I shared a few jokes about immaculate conception and then moved on. God I love the ED. Gotta wonder about the backstory for a lot of the patients though. ",
        "created_utc": 1493600396,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hey Dad! I'm not pregnant!\"",
        "author": "BrogerBramjet",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/66mjbw/hey_dad_im_not_pregnant/",
        "text": "A few years ago, I had stomach pains.  So at the time, I was a late 20's male (note that).  Eventually, my parents convinced me to go to our small-town hospital at 3am.  I am the ONLY patient in the ER.  After revisiting my dinner, I was sent for an ultrasound.\n\nI asked the tech for a hypothetical comparison to others in my situation as for what it may be.  She said, \"I can tell you without a doubt that you aren't pregnant.\"\n\nAs I am wheeled back to my room to wait for an official diagnosis, I see my father.  \"Good news, Dad!  I'm not pregnant!\"  He looks at the nearest nurse, grinning, and says, \"That's my boy!\"\n\nFYI, gall bladder blocked, later removed.",
        "created_utc": 1492742317,
        "upvote_ratio": ""
    },
    {
        "title": "What a fantastic community of doctors",
        "author": "Hi_I_am_a_doctor",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/64992d/what_a_fantastic_community_of_doctors/",
        "text": "[removed]",
        "created_utc": 1491683940,
        "upvote_ratio": ""
    },
    {
        "title": "A unique definition of \"No-Fault\"",
        "author": "rasputin1",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/6415of/a_unique_definition_of_nofault/",
        "text": "My office handles mostly accident cases. I had a patient come in with a No-Fault case. Upon taking his history, he mentioned his neighbor beat him up with a baseball bat. I asked \"How is that No-Fault?\" His response: \"because it wasn't my fault.\" \n\nI really wish I was making this up. \n\nThe worst part was his PCP heard the whole story and referred him to us because he doesn't take No-Fault cases. ",
        "created_utc": 1491579788,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't think I should pay the co-pay for office visit..\"",
        "author": "DierdreWolf",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/63ujf1/i_dont_think_i_should_pay_the_copay_for_office/",
        "text": "I work at a call center for a health insurance company. 90% of calls are old people angry at something or think they should get everything free just cause they are paying a premium. This one from this afternoon took the cake for the day.\n\nWoman called in..Had an Echo Cardiogram done at the specialists office. Specialist office visit for her plan is $45. \n\nWoman (W) -- Me (M) \n\nW : Why did I have to pay a $45 co pay to get my results!? I don't think I should pay the copay for the office visit since I didn't see the specialist. I saw the nurse.\n\nM : Well the co-pay for your plans specialist visit is $45. That's why you had a co pay. \n\nWoman went on and on about how she didn't see the specialist and she shouldn't have to pay it. She just wasn't understanding what I was telling her. \n\nM : Ok, Ma'am. Did you just go in and get a print out from the receptionist?\n\nW : No.\n\nM : Ok, did you pass through the waiting room and go back into the doctor's offices? \n\nW : Yes. Of course. The Doctor's nurse sat down with me and explained the results to me..\n\nM : Ok, then you had an appointment. You went into the doctor's offices and saw the nurse that works for the doctor. You'd have a co pay for that.\n\nW : Well, I don't think that's right. Is there anyone else I can speak with?\n\nM : I can get you to a supervisor that will tell you the same information. We cant see the claim since it was just yesterday you went in. If you wait 30 days for the claim to process - we can see exactly why you were charged. \n\nLuckily she said she'd call back in 30 days or so. That last part I lied on. Sometimes it does take that long for a claim to process or even be able to be seen. \n\nThe claim was in the system pending but I saw they charged for office visit. I just didn't want to talk to her anymore. It was like talking to a brick wall. \n\nShe wanted it her way and wanted to talk to someone else to try for a mommy, daddy thing. Mom told me no. Maybe dad will  tell me yes. No..dosnt work that way. You don't get it for free. You still took up the nurse/PA's time in the office. You still owe a co-pay regardless if you saw the specialist themselves or not. Specialist office. Specialist co pay for appointment. Go away.",
        "created_utc": 1491500810,
        "upvote_ratio": ""
    },
    {
        "title": "Are You Still Paying Copays or Out Of Pocket for Doctor Visits?",
        "author": "SexyMary90",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/62muxw/are_you_still_paying_copays_or_out_of_pocket_for/",
        "text": "[removed]",
        "created_utc": 1490983244,
        "upvote_ratio": ""
    },
    {
        "title": "Emergency",
        "author": "gamingsherlock",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/62hk79/emergency/",
        "text": "[removed]",
        "created_utc": 1490915531,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't know what to do!\"",
        "author": "LtDrinksAlot",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/62hgdv/i_dont_know_what_to_do/",
        "text": "First time posting here. \n\nI use to work as a floor nurse and routinely had a full patient load. This was a particularly busy night with my patient load having two post op ortho patients, two GI patients, a post stroke patient, and one AMS sun downer whose a fall risk. \n\nStandard night, all patients are stable but at about 2300 the sun downer starts getting ornery refusing her medications and attempting to get out of bed setting off the alarm every 30 minutes. Try the old fold towels for me trick, but nothing is working. She's effectively a one on one patient keeping me from properly assessing my other five much more critical patients. \n\nAt around 0200 I've had it. I've tried calling the internist to get an order for a Geri-Chair but he isn't answering his calls. I finally approach my charge to see if I can get a sitter or a video monitor ANYTHING. The floor is full of AMS patients who keep trying to get out of their beds and we can't find any other staff to sit. \n\nAt this point I look out the corner of my eye and see a naked old woman using the trash can as her walker slowly make her way out of the room. Behind her she is trailing her gown by her legs and with the bed alarm still attached but untriggered. I run down the hall with my charge nurse and hold her up as my charge gets a chair to sit her down in as she's wobbling so much. At this point she is screaming \"RAPE\" at the top of her lungs. Phlebotomist doing the nightly draws are sticking their heads out the door, nurses from other units are coming in, and it's at his point the bed alarm triggers and sends an ear piercing alarm. \n\nI feel my phone vibrating at this point. It's an intern who is returning my call. I quickly relay to her the situation. I've got the patient sitting in a chair in the hallway naked in the middle of the night and she's screaming at me also I can't find the little hole in the bed alarm to stick the pin in it. \n\nThe first thing the new doctor blurts out to me is \"I...I don't know what to do!\" \n\nAt this point i was so mentally exhausted all I could muster was a laugh. I asked for an Geri Chair order and an order for Ativan. She said yes and promptly hung up. \n\nShe ended up parked in front of the nurses station for the rest of the night shouting for me. Around 0500 she calmed down and we were able to move her back to bed. By the time day shift came on she was fast asleep. Did my report to the oncoming nurse went home and the next day I came back on to see my patients the nurse told me what a nice patient she was. \n\n\"She slept all day!\" \n\nNo shit. \n\n",
        "created_utc": 1490914441,
        "upvote_ratio": ""
    },
    {
        "title": "Accidentally sexually assaulted a medical student.",
        "author": "JugglinB",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61ymfc/accidentally_sexually_assaulted_a_medical_student/",
        "text": "Male OR nurse here.  \n\nIt is not uncommon for new starters or students to faint whilst watching an operation. I don't think it's about the blood or gore, but just standing in once place hyper focused without moving. (In a different life I often saw people collapsing on parade if asked to stand still for too long)\n\nMost people before they go down give some warning signs first; they go pale, they might start to lose balance and wobble a bit, state that they feel strange, even start to slur words etc.  However this female medical student was fine.  I'm talking to her when she went down.  In all my years in theatre I've never seen anything like it.  Upright and talking.  Moment later - down like a sack of potatoes.  Boom.\n\nWe revive her using all normal techniques and send her off (with a member of staff) to get a drink and food.\n\nAn hour or so later she comes back.  I'm now doing off duty on the computer, and have my back to the room.  The student was behind me, but facing the opposite way as watching the op.\n\nSuddenly the consultant surgeon gasped loudly.  Since I was already on hyper alert about this student I assume that it is that she's going down again.  Since last time she went down so fast that she was lucky to not gain a concussion I act fast!\n\nI spin around on my chair, grab her, and pull her down onto my lap to arrest her fall safely.  \n\nProblem was that she hadn't fainted. She was fine and that gasp was about something in the actual operation... And I'd managed to grab her by her boobs and pulled her onto my seated groin.\n\nBEAT. Everyone in the room just stopped.  And looked... \n\nMe to student: (Still with my hands full) You weren't fainting were you?\n\nNo.\n\nI let go.  Both student and I completely mortified about what happened...",
        "created_utc": 1490698351,
        "upvote_ratio": ""
    },
    {
        "title": "The worst elevator ride",
        "author": "omgjuststoppp",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61ydln/the_worst_elevator_ride/",
        "text": "I'm a phlebotomist at a medium sized city hospital. The patients are weird and the shenanigans are constant.\n\nPart of being a phlebotomist in a hospital is carrying your supplies around with you. We have carts. Since the building has multiple floors, I spend a lot of my time traveling​ on elevators.\n\nI was waiting for an elevator, and was joined by a visitor. She was nice, we exchanged pleasantries, and when an elevator arrived we both got on. A patient was already in it, holding an unlit cigarette, clearly on her way outside to smoke.\n\nNow, the patient was either weirdly fat, or pregnant. It was hard to tell, especially in the shapeless gowns they give out. Either way, nobody's business, she's allowed to make bad choices if she wants to.\n\nMs. Yenta looked at Ms. Marlboro, and while staring pointedly at her belly, sweetly said \"Oh honey, you shouldn't smoke, you know it's so bad for you.\"\n\nMs. Marlboro, in a flat but somehow upset voice, replied with \"Well I just lost my baby, so.\"\n\nIt was like the atmosphere froze. Ms. Yenta squeaked out \"Oh I'm so sorry to hear that...\" and kind of trailed off into the most uncomfortable silence I've ever experienced, as we all avoided eye contact with each other. I cringed so hard I very nearly collapsed into myself. Thank god, five ~~years~~ seconds later, we got to my floor and I could run away.\n\nMs. Yenta and Ms. Marlboro, unfortunately, still had another 6 awkward floors to travel.",
        "created_utc": 1490694135,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry we didn't track down your patient.",
        "author": "SavoryStroganoff",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61swa1/sorry_we_didnt_track_down_your_patient/",
        "text": "First time posting here and hopefully won't be my last.  I've been working in hospitals for close to 10 years with most of it being in sterile processing or as an OR tech.  The last 2 years though I've been doing front desk work for the radiology department.  I basically handle outpatients as they come in, field phone calls for the department, and make sure reports get where they need to.  The biggest thing I do is make copies of imaging for patients or doctors to come pick up.\n\nSo last Friday we had a patient come in for a Myelogram, she was nice enough if not a bit on edge.  While she is in her exam I get relieved for lunch.  Come back to an empty waiting room and my relief tells me that a CD with imaging is being burned for that patient and catches me up on the rest of what's going on.  Patient never comes back so we just file the disc away as sometimes people forget or they come back a few days later.  Cue hours later and that patient calls us asking why we didn't give her the disc.  We ask her if she left to which she says she did.  Well sorry lady but if you left that's on you.  She hangs up clearly not happy with the outcome, but oh well.\n\nSo here I am this morning, things going well when I get a call from a doctor's office telling me that one of their patient's told them we wouldn't give them a copy of their imaging.  Already knew something was fishy and after getting some info guess who that patient was?  So this lady had not only left without her CD but then decided to tell her doctor's office that we refused to give it to her.  Told the office what the story was and they said they would be sending her over to get it from me so we will see what story she has when she gets here if she even comes.",
        "created_utc": 1490629317,
        "upvote_ratio": ""
    },
    {
        "title": "From a patient - to each and every one of you - thank you from the bottom of my heart",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61q9t9/from_a_patient_to_each_and_every_one_of_you_thank/",
        "text": "[deleted]",
        "created_utc": 1490590872,
        "upvote_ratio": ""
    },
    {
        "title": "Psychiatrist in Brooklyn",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61mjkb/psychiatrist_in_brooklyn/",
        "text": "[removed]",
        "created_utc": 1490547213,
        "upvote_ratio": ""
    },
    {
        "title": "Vampire Phlebotomist",
        "author": "stacer12",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61jcch/vampire_phlebotomist/",
        "text": "Hopefully this story makes someone chuckle.\n\nWhen I was a new RN, my first job was on an in-patient psychiatric medical unit at a very large hospital in Central Florida.  I was the only nurse on my unit who knew even a modicum of Spanish (and what I know isn't all that great).\n\nOne of our sweet phlebotomists came on the unit to draw labs on an elderly, Spanish-speaking gentleman with dementia who was very paranoid.  After being in the patient's room for a few minutes, the phlebotomist comes to get me to ask if I could explain to the patient what he was doing, because the patient wasn't letting the phlebotomist near him.\n\nNow, a little background on Spanish verbs.  There are two verbs in Spanish that roughly translate into \"to take,\" though they have different literal and contextual meanings.   One of these is \"sacar.\"  The other is \"tomar.\"\n\nSo I go in this guy's room with the phlebotomist, whipping out my mad Spanish skills.  I introduce myself and tell him I'm a nurse.  \"Me llamo Stacer12 y estoy una enfermera.\"  Introduce the phlebotomist.  \"El se llama ___.\"  Tell him we need to take his blood.  \"Necesitamos tomar sangre.\"  Patient just looks at me like \"what the fuck?\" but after a few minutes of cajoling in Spanish, he reluctantly allows us to draw his blood.  Patient looks sort of worried the whole time.  No big, some people don't like getting their labs drawn.  I've dealt with way worse.\n\nAfter leaving the room, I go back to the fish bowl (on our psych unit the nurse's station is behind bullet proof glass.  I've seen some crazy shit go down.).  Sitting there charting.  Almost immediately forgot about the incident because it was uneventful, right?\n\nA few minutes later, it suddenly hit me that the phrase for \"to take blood\" isn't \"tomar sangre.\"  It's \"sacar sangre.\"  The verb tomar means to take, yes, but it means \"to take in.\"  As in, ingest.\n\nI told our paranoid patient that we were there to drink his blood.\n\n Edit: grammar",
        "created_utc": 1490494419,
        "upvote_ratio": ""
    },
    {
        "title": "Being filmed for various documentaries",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61j93u/being_filmed_for_various_documentaries/",
        "text": "[deleted]",
        "created_utc": 1490493200,
        "upvote_ratio": ""
    },
    {
        "title": "How DARE you?!",
        "author": "omgjuststoppp",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/61gepj/how_dare_you/",
        "text": "I'm a phlebotomist at a medium-sized city hospital. The patients are weird and the shenanigans are endless.\n\nThe phlebotomy team was down in the lab for our morning break. LaQuisha looked at our trackboard and said \"Ugh Mr Jones just came up on the draw list. I hate that guy!\"\n\n\"Why, what's wrong with him?\"\n\nApparently Mr Jones was a 50something year old creeper, aka too young for it to be potentially endearing, but more than old enough to know better. Everyone but me had apparently met this fine specimen of masculinity, and been thoroughly grossed out by him- he had told LaQuisha and Aaliyah how much he liked tall black women. He told Mary how much he'd like to just bury his face in her... flowers on her badge holder. He asked Jen if she had a husband, and when she said that he did he asked if he let her have gentleman friends.\n\nDude, slow your roll.\n\nAnyway, the point was nobody wanted to draw his blood. I happened to be having a good day, and was kind of curious to meet someone so unabashedly sleazy, so I volunteered to go do it. Mary, Jen, and LaQuisha decided this was the kind of action they just had to experience, so the followed me upstairs to his room and all kind of [clustered around his door](http://media.gettyimages.com/photos/older-man-peering-nervously-around-office-cubicle-picture-id10189526?s=170667a), waiting to hear what he came out with. I walked into the room, ready for anything.\n\n\"Hi, Mr Jones, I'm Stoppp. Your doctor has ordered some bloodwork on you, ok?\"\n\n[MOTHERFUCKER DIDN'T SAY A WORD ABOUT ME.](https://s-media-cache-ak0.pinimg.com/564x/4c/24/21/4c24218e6889513ce916e790c7770446.jpg)",
        "created_utc": 1490459842,
        "upvote_ratio": ""
    },
    {
        "title": "Chocolate Gurneys",
        "author": "47599",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/614jf8/chocolate_gurneys/",
        "text": "I found out about this sub 3 minutes ago and wanted to share one of my more intriguing stories. \n\nMy partner and I were picking up a patient from the hospital to take back to their nursing home. She was there for abdominal pain, and the following day, they were being discharged cause apparently everything was just fine and dandy. I take my jacket off while we wait for the nurse to give us a report before transporting.\n\nThis patient is pretty old and frail, so my partner and I take extra special care. We prep the bed and gurney, pull out the sheets, on the count of 3 slide the patient over to our gurney, make some adjustments to situate her, strap all 5 straps (2 shoulder straps, three cross body straps), raise the gurney, and we're off.\n\nWe make it down the hall to the elevator. While we're waiting, our patient taps me on the shoulder and says \"I need to go to the bathroom really badly.\" \n\nGreat. There's a bathroom right next to the elevator, so I go back and ask the nurse if the patient can use it and if she needs assistance, would she be willing to help her. Nope, the patient needs to go back to the room and use the portable toilet. We roll her back to her room, lower the gurney, and as we start unbuckling and prepping to get her off the gurney, a nurse says \"I'll take care of it.\" My partner and I head outside, closing the door behind us.\n\nA good 10 minutes pass, then suddenly the door slides open a few inches with the nurse popping her head out. \"Can I get some help in here...?\" A few more nurses head inside.\n\nTurns out, this \"fine\" patient ended up having rectal bleeding and explosive diarrhea. Turns out, signs pointed to some colorectal issue that wasn't present before. Turns out, the nurse didn't remove her from our gurney and instead tried using a bed pan. Turns out, the bed pan was more for decoration after she was done.\n\nOnce the patient was \"done,\" we were given disposable aprons used for child birth before heading into the room to help move the patient back to their bed. The room was spotless... except for our gurney that had bloody, drippy shit on the gurney sheet, on the handrail, running down the side of the gurney.\n\nNeedless to say, it took us a few minutes longer to clean up before our next call. Remember the jacket I took off? I didn't, till I tried to turn on our ambulance but couldn't find the keys... which were left in my jacket. I head back up, pick up my jacket, and see 5 medical personnel or so in that patients room with the patient completely naked laying on the bed. One nurse looks to the other and says \"I think we need to call it.\"\n\nTo this day, I don't know if that patient died in the half hour or so it took us to clean up, reset our ambulance, finish the paperwork, and grab my jacket. \n\nSorry for the wall of text, but hopefully you felt like you were with me in that hospital.",
        "created_utc": 1490302013,
        "upvote_ratio": ""
    },
    {
        "title": "Checking in another patient to OR",
        "author": "JugglinB",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/611cms/checking_in_another_patient_to_or/",
        "text": "Checking in a patient for an emergency laparoscopic appendicectomy.  \n\n\"Have you had any operations in the past?\"\n\n\"Yes - I had my appendix taken out at (*nearby hospital*) 18 months ago.\"\n\nWT actual F?!?  Checked with surgeon.  Told to carry on.\n\nWe did and took his appendix out.  In full HD vision.  Clear as anything.  It's complete not a stump.  No scaring at the tip.\n\nGod only knows what random body part (*nearby hospital*) took last year...",
        "created_utc": 1490269646,
        "upvote_ratio": ""
    },
    {
        "title": "UK NHS vs Private",
        "author": "JugglinB",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/60u7ag/uk_nhs_vs_private/",
        "text": "OR nurse (or theatre practitioner as we are called in Britain) checking a private patient into theatre.   It's an NHS hospital, but we have PP's too.  \n\nMe: \"And have you had anything to eat or drink since midnight?\"\n\nPP: \"Yes.  I had a light breakfast.\"\n\nMe: \"Oh...  Didn't you get a letter about not eating and drinking?\"\n\nPP: \"Oh... well... I thought that was just for NHS patients.\"\n\nYes.  The big plan to save money is to starve NHS patients.  Shush. Don't tell the public...",
        "created_utc": 1490184565,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't you just hold on to that?",
        "author": "omgjuststoppp",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/60tcsq/why_dont_you_just_hold_on_to_that/",
        "text": "(expanded from a comment I made a couple days ago)\n\nI'm a phlebotomist in a medium-sized city hospital. The patients are weird and the shenanigans are constant.\n\nPart of working in a hospital is that you occasionally get hit. It sucks, but that's life- I'm waking up people that I know absolutely nothing about, so that I can poke them with a needle. Sometimes they're demented, sometimes they're other forms of mentally altered, it's just an unfortunate reality.\n\nIf we're lucky, a patient who is known to be violent will have a sign on their door telling us to call the nurse before going in, or the nurse will catch us and warn us. If a nurse sucks, she won't go out of her way to warn anyone. If she's awful, she'll watch you go into a room, say nothing, and when you come out having been slapped she'll say \"Oh, yeah, that one gets a little combative sometimes.\" YOU WATCHED ME WALK IN, YOU COULD HAVE WARNED ME YOU HORRIBLE BITCH.\n\nI had just left a room where the nurse was the third kind of nurse, so I had a sore arm and was in a pretty bad mood.\n\nThe next lady was pretty confused but very pleasant. When I walked into her room she was kind of fiddling with a bandage on her foot with one hand, but confused people often fidget and it was just like oh well she's not hurting anything.\n\nI was feeling her arm for a vein and she said something like \"Here, sweetie, maybe you should have this?\" and put something in my hand. I looked down and couldn't figure out what was going on, like it was kind of shriveled and had a weird texture and was kind of blackish and OH MY FUCKING GOD THAT'S PART OF HER TOE\n\nOnce I finished staring at my hand with my mouth open, I looked on the room's whiteboard to find her nurse's number so I could call- oh, same nurse as the previous room. Good to know.\n\nI more or less calmly handed the toe back to the patient, told her to hang on to it in case she needed it, drew her blood, left the room, and told her nurse that the patient had been picking at her bandage and maybe she should take a look to make sure everything was ok.\n\nThe faint scream I heard as I hastily walked away was everything I had hoped for. I fucking hate that nurse.\n\n**Tl;dr- I become irate when I get punched, and then I become inventive.**",
        "created_utc": 1490169905,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy old lady *wink*",
        "author": "guitargirl300",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/60s5sj/crazy_old_lady_wink/",
        "text": "I'm a (female) optometrist, and at the time of this story I was working at a small retail optical chain store (9 employees total). We were in a pretty low income part of town, on the edge of a small city, but near where the landscape quickly shifted to be very rural. We got all kinds of interesting patients. \n\nOn this day, I walk in to examine a seemingly nice, normal 78-year-old lady (new patient to us). We finish the exam and I walk her down the hallway to the optical area to hand her off to an optician to help her pick out glasses. The first optician to walk out is a young 30's, trim, good looking guy. Her eyes widen at the sight of him, as he politely greets her and says he will help her pick out some glasses. She replies \"well thank you, you sweet gorgeous thing.\" I hide a smile and am about to walk away to go see my next patient when she drops her purse (clearly intentionally) and asks the optician to pick it up for her. As he bends down, she makes eye contact with me and *winks.* I turned and walked away before I burst out laughing, leaving him to fend for himself with this crazy old lady.\n\nIt gets better. I go see another patient, during which time she was pretty normal in picking out glasses. When I came back out front again, they'd gotten her checked out and finished, but she's stalling. She starts asking the store (and everyone in it, staff and patients alike) if they'd heard of her ex-husband So-And-So, \"he was soooo popular on the radio, everyone's heard of him.\" We all shake our heads no. Finally she singles out a lady who's seated at an optical table to get her glasses adjusted.\n\nCrazy old lady: Are you from [nearby small town]?\n\nNormal lady: (hesitantly) no, I'm from [this town we're currently in]\n\nCrazy old lady: did you know the DJ So-And-So? \n\nNormal lady: no...\n\nCrazy old lady: (speaking in her loudest voice) well he fucked everyone around here!\n\nAwkward silence...\n\nCrazy old lady: but I don't need him, my new husband takes GOOD care of me EVERY NIGHT! (gestures to the front door) \n\nOn cue, an 80-something frail old man opens the door and hobbles slowly in with his walker.",
        "created_utc": 1490150861,
        "upvote_ratio": ""
    },
    {
        "title": "Records",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/60kp5k/records/",
        "text": "[deleted]",
        "created_utc": 1490059139,
        "upvote_ratio": ""
    },
    {
        "title": "\"They probably can't reattach that, right?\"",
        "author": "omgjuststoppp",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/608usg/they_probably_cant_reattach_that_right/",
        "text": "I'm a phlebotomist at a medium sized city hospital. The patients are weird and the shenanigans are constant.\n\nNurses are mostly wonderful people, but with so many in the building at any given time, there's always a few fools, some weirdos, and others that just don't make sense.\n\nI was in a room drawing someone's blood when I heard a little scream from next door. Not like 'the patient is killing me help', more like 'a cockroach just ran towards me' (it's an old hospital, this happens more frequently than you'd think). Next came the sound of the nurse calling her supervisor, which went something like \"IT JUST CAME OFF I DONT KNOW SHE SAID HER FOOT HURT AND I TOOK HER SOCK OFF AND IT CAME OFF WITH THE SOCK WHAT DO I DO\"\n\nWait what? Did this lady's *foot* fall off?\n\nAnother nurse ran in and also yelped a little. I had to know what was going on, so I wrapped up my blood draw as quickly as possible and poked my head into the room next door.\n\nWhat greeted me was...\n\nNot as exciting as I was hoping. Apparently the lady's toenail had decided to fall off. No blood, it just didn't want to be there anymore. We all looked at the toenail (painted, fungusy), then at the toe (definitely missing a nail), and I left.\n\nThe conversation that followed me down the hall, though.\n\n\"What do we do with it? We can't just throw it out, right? They probably can't reattach it... can they?\"\n\n\"I don't think so... The residents might want to see it, though. Should we page them? It might be important. I'm gonna page them.\"\n\nTo the poor resident who got woken up at 4 am about a toenail, I'm so sorry.",
        "created_utc": 1489905174,
        "upvote_ratio": ""
    },
    {
        "title": "Can I get rabies vaccination after being scratched by a dog before 12 days?",
        "author": "vterminator007",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/603wgv/can_i_get_rabies_vaccination_after_being/",
        "text": "[removed]",
        "created_utc": 1489840895,
        "upvote_ratio": ""
    },
    {
        "title": "What were emergency rooms like in the 1950's, writing a story about a boy being rushed in at that time and want to know what it would be like?",
        "author": "codyong",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/603rv7/what_were_emergency_rooms_like_in_the_1950s/",
        "text": "[removed]",
        "created_utc": 1489838563,
        "upvote_ratio": ""
    },
    {
        "title": "You have to WHAT?!",
        "author": "omgjuststoppp",
        "url": "https://www.reddit.com/r/talesfrommedicine/comments/5zirdh/you_have_to_what/",
        "text": "I'm a phlebotomist at a medium-sized city hospital. The patients are weird and the shenanigans are constant.\n\nIf there's one thing I've learned since I started working as a phlebotomist, it's that patients are 98% lovely people, but that 2% is awful beyond words. Do they go out of their way to be awful because they just don't know any better? Is horrible just how they go through life? Is yelling at people how they make themselves feel better about their shitty existences? Answer, probably yes, mixed in with some personality disorders and substance abuse problems. And to be fair, I generally meet them sometime between 0200 and 0600, waking them up for the millionth time that night to poke them with needles (if they're lucky, for the first time that day. If they aren't, it's the second or third or fourth needle stick that night). I'd be grumpy too.\n\nNormally they don't get to me, no matter how awful they are. Sure, tell me I suck at my job, or that I probably don't have any friends, or whatever, just please let me do my thing and leave, often so that I can laugh at you in the hall for being so cartoonishly ridiculous. There's one exception to that- the time I had to leave the room before I actually slapped a patient.\n\nThis lady was homeless, had what I'm going to politely refer to as *some mental health issues*, and had a raging heroin problem. Thanks to the heroin issue, she also was rocking a nice case of sepsis (plus who knows what else) so they were pumping her full of antibiotics to try to, I don't know, save her fucking life.\n\nThe thing about some antibiotics is that you need to test blood levels sometimes. How much is left at what should [be a medication trough](https://labtestsonline.org/understanding/analytes/vancomycin/tab/test/)? It's annoying, but it's important to getting dosages right.\n\nMs. Poppy had been doing heroin for years, and her veins were *wrecked*. Normally she wouldn't let anyone draw her blood before breakfast (\"It doesn't flow until I've eaten.\" Then you're a medical miracle but whatever I guess) but this midnight test was for some reason mildly acceptable.\n\n\"Hi, I'm Stoppp, and I'm here to dra-\"\n\n\"I know what you're here for just draw my fucking blood and get out of here. You're not gonna find anything anyway.\"\n\n*Ok, sure, be a bitch*\n\n\"Alright, ma'am, let me just see your ar-\"\n\n\"NOT THAT ARM DO NOT FUCKING TOUCH THAT ARM\"\n\n\"Ok, let's see this other one.\"\n\nTrack marks as far as the eye can see. She'd clearly been using dirty needles, because it wasn't just scars, it was craters and signs of old abscesses. Like, what am I going to do with this? But I'm a professional, let's try.\n\nI stuck her. Got a flash in the needle, but no blood would flow.\n\n\"I told you you weren't gonna get anything. Do you know how to do your job? I thought you people were supposed to be able to draw blood but everyone here just sucks at it\"\n\n*Maybe if you didn't inject what appears to have been raw sewage into your veins this wouldn't be such an issue*\n\n\"Ok, ma'am, is it ok if I try one more time?\"\n\n\"Fucking FINE but you're not going to get anything, what am I even doing here, nobody knows anything...\"\n\nI let her talk and looked for a vein. I mean I *looked*. Everywhere that she might possibly have missed something, everywhere that looked like scars old enough that maybe some blood was flowing through it again, anything I could find. She had to have *something*. Meanwhile, she was huffing and puffing and sighing about the incompetence of the entire hospital, how much she just wanted to get back to sleep, etc.\n\nI found it. A tiny, crappy, surface vein that was untouched, probably because it didn't seem like it was going to hold up to anything. It was all I had, so it was what I was going to try.\n\n\"Ok ma'am, here we go\"\n\nI stuck the vein. I got a flash. Holding my breath, I put a tube on the hub, praying I'd get blood flow.\n\nJackpot.\n\nIt flowed. Not well, it was coming very slowly, but as long as we just waited for a couple minutes, I'd have enough to get the trough, and maybe a couple other labs as well. It was starting to drip into the tube, this was going to work, we just needed to wa-\n\n\"Hey take that out I gotta pee.\"\n\n**WHAT.**\n\n\"Excuse me, ma'am, if you can wait just a minute or two we'll have enough and I can get out of your wa-\"\n\n\"I SAID TAKE IT FUCKIN OUT I HAVE TO PEE WHAT THE FUCK DO YOU WANT ME TO PEE MYSELF BITCH\" etc.\n\nI took the needle out, said I was going to leave so she could use the restroom in peace, and went out to the hallway so that I wouldn't start hitting her. After a couple deep breaths, I called her nurse and told him what was up.\n\n\"Oh well since you got her the one time, could you try once more? We really need that vanc level...\"\n\nI. Will. Kill. You.\n\nI stuck my head into the room.\n\n\"Ms. Poppy, is it ok if I try one mor-\"\n\n\"HELL NO I'M NOT A PINCUSHION WHAT ARE YOU PEOPLE THINKING WITH ALL THESE FUCKING NEEDLES GET OUT I NEED SLEE-\"\n\nI shut the door on her rant, told the nurse she was his problem, and told my supervisor I was going on a break and she could call me if there was an emergency. Wisely, nobody called until I got myself calmed down. For a few days afterwards, I had nurses asking me what had happened- apparently I was mad enough that word got around, and everyone wanted to know what was up.\n\nMs. Poppy, if you're out there... [fuck you](http://data.whicdn.com/images/55374826/large.gif).",
        "created_utc": 1489576839,
        "upvote_ratio": ""
    }
]