[
    {
        "title": "If you're going to map your z: drive to a folder off the root of your c: drive...",
        "author": "burner70",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yzvrj/if_youre_going_to_map_your_z_drive_to_a_folder/",
        "text": "[removed]",
        "created_utc": 1519163295,
        "upvote_ratio": ""
    },
    {
        "title": "\"My son is mad at me because I've filled up the hard drive\"",
        "author": "dannythetwo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yzivi/my_son_is_mad_at_me_because_ive_filled_up_the/",
        "text": "I was on the phone trying to help this woman with download some files to her hard drive and quickly noticed that there wasn’t enough storage. I checked the local disk and was shocked to see barely a few hundred megabytes left on her terabyte hard drive. \n\n“Yeah, my son has been complaining about this,” She said. “I have no idea what I’m doing with this stuff and he says that I’ve downloaded a bunch of stupid stuff that made it run out of space. I would love to clear it up, so he wouldn’t have a problem with his YouTube stuff.”\n\nI told her I needed a few minutes to figure out what was taking up the storage. I have helped her before and can confirm she isn’t the best at technology, but she’s always willing to learn. I also knew her son. I’ve never worked with him on technology stuff, so I couldn’t confirm how tech savvy he was, but I knew he knows more than his mom. \n\nFirst thing I checked was control panel, uninstall programs. The biggest program was Microsoft Office which was a mere gigabyte. There were only about ten or so third-party programs and that being the biggest meant that wasn’t the problem.\n\nNext, I ran disk cleanup. No luck. In fact, there was less there than I had ever seen. I check documents and pictures, expecting to find a folder full of old pictures and videos, but found nothing. \n\nBaffled, I went to the source. C drive, Users, and the default account. I selected all and was told it was 998 gigabytes or so. I checked folder by folder until I got to the “Videos” folder. I didn’t check this because I rarely ever see it used. I was blown away to see that it was exactly 777 gigabytes. I opened it found gigantic uncompressed video files that were all screen recordings of random games. Then it hit me. The son had been uploading the videos to YouTube and not deleting them from the hard drive. \n\n“You’re not going to believe this,” I said, “but you were in the right the entire time. You have barely anything on this computer, and nearly 90% of the storage is your sons.” (not just the video, but several games and screen recorders I found)\n\nCoincidentally, right after I told her this and gave her options like buying an external hard drive or just deleting the files that are already on YouTube, her son called her. I have not heard how the rest of the story yet, but I can’t wait to hear how her son reacted to realizing it was his fault the whole time.\n\n\n*Edit:* You guys are so helpful. I've learned a lot of valuable stuff through your comments. 10/10 community ",
        "created_utc": 1519160768,
        "upvote_ratio": ""
    },
    {
        "title": "Patches? Patches? We don't need no stinkin patches!",
        "author": "Disenfran45",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yzgf8/patches_patches_we_dont_need_no_stinkin_patches/",
        "text": "My first post and it will be a short tale.\n\nI started at a $company several years ago in which the IT department was growing after what I'm told were requests for more staff were denied.  Finally the department was granted approval to hire on a few more people.  I was hired on as a system administrator along with a several techs.\n\nThe original staff was pretty small consisting of less than 10 people for over 500+ users and even more assets in what is best described as a geographically diverse organization.  The $company consists of many different offices and departments spread out in different buildings over a several mile radius.\n\nLet's just say that $company provides services to others and is very specialized in what it does (and yes I am purposely keeping this vague as I still work here and if I tell you what it is it will be easy to connect the dots).\n\n$Disenfran45 - me\n\n$Admin1 - original sysadmin\n\n--------------------------------\n\nMost of the servers at $company are virtualized.  There are a few physical servers running specialized tasks or setup for some redundancy outside of the virtual environment.  All are located in a single server room that $company has all its main IT assets in.\n\nAfter working at $company for a few months I noticed a disturbing trend - every single server I log into is prompting me for running updates and the number of updates is well over 100 on most (several servers show well over 200 updates pending).  This is both the physical and virtual servers alike.\n\nI don't know about you but I've always tried to be diligent about patching systems especially when it comes to important things like servers.  All of these servers were production as some are very critical to the functioning of $company.  For many of these servers the last update had been applied over 2 years ago.  The servers are a mix of Windows 2003, Windows 2008, Windows 2008 R2, and a few Windows 2012 R2 systems.  The newer the OS the fewer patches it needed.  Most updates were applied when the server was spun up and that was it.  How $company didn't have serious problems is a small miracle.\n\n------------------------------\n\n$Disenfran45 - Um, $Admin1, I was looking around and noticed that most of the servers needed updates.  Aren't the systems updated on a regular basis?\n\n$Admin1 - I don't apply updates since it breaks things.\n\n$Disenfran45 - Is that wise?  Just about every compliance audit will require that systems are kept up to date to pass.\n\n$Admin1 - We don't have to worry about that since they don't apply to us since we are $type-x.\n\n$Disenfran45 - You said updates will break things?  How?  Surely the environment isn't *that* fragile that a simple OS update will break something.  (Little did I know that is wasn't just the servers that needed major updates.  I suspected as much but didn't know the true horrors of it until much much later)\n\n$Admin1 - I used to updated all the time but when I got busy it was pushed back until it didn't happen anymore.  Besides we can only update on $maintday during the weekly maintenance window.\n\n$Disenfran45 - With the number of updates needed it will take a very long time to apply them.\n\nAfter several months of going back and forth on this problem to including arguing, team meeting discussions, etc I was finally able to start updating the servers.\n\nI spent the next several weeks getting the servers updated during the maintenance window.  It didn't help that the WSUS server had to be rebuilt l since it died.   I suspect it hasn't been updated in quite a long time and just couldn't handle the load of both server and workstation updates.  After the WSUS server was rebuilt it was discovered just how long workstations had not been receiving updates.  It had been several months since the average was 100+ updates per system.  Before the WSUS server rebuild it was not uncommon for workstations to have problems with Windows Update requiring manual intervention from the helpdesk.  The server was basically setup and left to run.\n\nWith the WSUS server rebuild all the problems with the Windows workstations were fixed.  After the servers were caught up on updates things became *surprise* a lot more stable.  \n\nI'm not sure how $Admin1 has kept their job except that since $company is $type-x it kept this from coming to light.  Anywhere else they would have been fired a long time ago.\n",
        "created_utc": 1519160286,
        "upvote_ratio": ""
    },
    {
        "title": "\"Lets delete everything to recover data that was never deleted\"",
        "author": "InevitableHorror",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yz9fh/lets_delete_everything_to_recover_data_that_was/",
        "text": "Apologies if this is hard to follow, FTP, etc.\n\n-Me, part time employee\n\n-Management team, typical middle management who often was as vague as can be\n\n-LazyUser, the kind of person who calls you over to his workstation and then wants you to do various aspects of his job for him yet has an unwarranted sense of self importance\n\n-VP, no nonsense old school leader type\n\n&amp;nbsp;\n\n**BACKGROUND**\n\n   A few years ago, I was working part time at a relatively small production facility doing several roles. It was mostly inventory control and data entry. \nBecause of my background knowledge, and the fact that IT support was outsourced (and usually swamped with nonsense) things took awhile to take care of. \n\n\n   So, I became the unofficial helpdesk support in addition to my normal duties. After several people left, I became one of the only users who had even the slightest understanding of how the SQL based software we used to track maintenance operations, spare parts inventory, as well as incoming orders for spare parts worked on more than a surface level.\n\n\n   Usually my responsibilities were something as simple as getting a thin client set up somewhere, or the ever present ‘help the printer is broken’, to the occasional unspecific “I need help” -aka *I’m too lazy to write this email do it for me* which is what LazyUser often did.\n\n&amp;nbsp;\n\n   This SQL system mentioned above stored an equipment list used in the factory, and users would use it to create tasks to bill parts and labor to the equipment when it needed repairs or modifications, which would then be stored in another database after completion that could be searched and referred to. One type of tasks were ones that were predetermined ahead of time and repeated, such as preventative maintenance. The other was as needed work preformed, such as a bearing failure. Both types of task creation was very simple to operate, and users followed a step by step procedure. \n\n&amp;nbsp;\n\n   Unfortunately, the impatient ones would often spam click next or even create a piece of equipment that doesn’t exist, and due to the age of the system and lack of support nobody could figure out how to prevent this. Thus, several pieces of equipment in the equipment list were jibberish or just a dash (-) and were assigned to tasks.\n\n&amp;nbsp;\n\n**Story**\n\n   One morning I was given a printout of a long email chain in which several managers discussed an upcoming audit in which they needed a current list of equipment. Obviously, having jibberish in this list is not acceptable for an audit. I was given an excel doc with certain things highlighted and I was instructed to delete these entries ASAP. I verified that they wanted these gone from the system entirely.\n\n   There was only dozen or so, but I had to painstakingly go in and modify the recurring task list to remove any nonsense equipment entries, and re-assigned them to the actual equipment the repeating task was related to. E.G the task “Oil Machine #1 every 5000 hours” would actually bill to and be filed under “Machine #1”, and not “dash” or a blank field. The maintenance tasks would not be changed or deleted, just have the correct thing assigned to them thus allowing me to remove the incorrect equipment from the table.\n\n   An hour later I managed to clear up all these entries and informed management that the list is cleaned up with the bad entries removed.\n\n&amp;nbsp;\n\n   Cue a week later, I clock in and everyone is in mass panic. Apparently, a bunch of data was missing from the system. With no time to ask questions, I was told that we were in the process of a 7 day rollback and be prepared to re-enter a ton of data including incoming orders and all tasks created in the last week. I was told to back up everything ‘new’, but I explained that this wasn’t really possible from within the system itself, and having zero permissions in the server the best I could do was export and re-enter later. It was decided that the missing data was too important, and we would do the rollback, and it would be my responsibility to get caught up.\n\n&amp;nbsp;\n\n   With the rollback done, and looking at days of data entry ahead of me, I decided to ask around and see what is actually ‘missing’.\n\n   Turns out LazyUser was using the now deleted ‘dashes’ as a search term field to locate the past history of work he had done, and thus unable to find any work assigned to that machine (mind you, that machine no longer exists and never existed in the first place) Since he couldn't find these records linked to a machine that doesn't exist and never really did exist, he wrote an email to management and VP stating that since his data is gone we would be screwed in any audits and spun everyone into a panic. \n\n&amp;nbsp;\n\n   At no point did anyone try to contact the software vendor, verify with someone that understood how the system works that the data was really gone, or contact IT and see if they could somehow merge the database backups.\n\n   I explained to one of the managers what was going on, and how the past history of maintenance work still existed in the task list and could be found by simply viewing the list as a whole or searching by a piece of equipment that actually existed.\n\n   I went to talk to the VP, who was now understandably upset that the inventory, task list, and orders for parts was a week out of date, I explained that I’m 99% sure we didn’t need to do the rollback. Luckily we had a system backup of about 5 hours before the week long rollback happened, and we restored to that point.\n\n&amp;nbsp;\n\n   The best part of all of this was that the management team only wanted the highlighted entries removed from the excel list. Why this needed a 15 page long email chain and why someone took the time to highlight them and not just delete them from excel while they had the file open, why this was even given to me if it would be so quick to do, and why I was told \"yes\" when I asked if they wanted these entries completely gone eludes me.\n\nLuckily, I was never blamed for this misunderstanding.\n\n&amp;nbsp;\n\n**Tl;dr- Deleting a weeks worth of company data on a whim to recover data history that was never gone in the first place is not the best idea.**\n",
        "created_utc": 1519158942,
        "upvote_ratio": ""
    },
    {
        "title": "It's not rebooting...",
        "author": "XpL0d3r",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yz7zf/its_not_rebooting/",
        "text": "Keeping this one short, none of that LTL crap that nobody cares about.\n\n$Me - Me\n\n$TOG - The Other Guy\n\nSo, $TOG received a new laptop. He's in a remote office, so I send him instructions on how to PXE boot to our network to install out image of Windows 10. Most of this installation process is automated, but there are a couple steps that the user needs to take first that require a quick BIOS settings change.\n\nSo I send the user my instructions. A little while later, a call from the user comes in....\n\n&gt; $TOG: \"Hi, I'm on step 3 of your instructions. I've enabled the buttons and hit apply, but now it' saying to reboot the computer. It's just sitting here and won't reboot. It's been 30 minutes now!\"\n\n[for the record here, step 1 is to turn on the PC, step 2 is to press F2 to enter system BIOS, step 3 is to enable UEFI network stack]\n\n&gt; $Me: \"Hi, $TOG, so you just enabled the UEFI network stack button and applied? Did you click on the exit button?\n\n&gt;$TOG: \"No, the instructions say to reboot the computer. I don't want it to exit, I want it to reboot.\"\n\n&gt;$Me: \"Pressing the exit button will leave the BIOS and will reboot your computer. That's what you need to do.\"\n\n&gt;$TOG: *getting defensive* \"But the instructions say to reboot, not to exit, so how I was supposed to know?\"\n\n&gt;$Me: \"Well, your only other options in that BIOS screen were to restore settings, or to apply the changes, which you already did, so-\"\n\n&gt;$TOG: \"THE INSTRUCTIONS SAY THE COMPUTER WILL REBOOT AND IT DOESN'T REBOOT UNLESS I PRESS EXIT, SO YOUR INSTRUCTIONS ARE BAD AND SHOULD SAY TO EXIT INSTEAD OF REBOOT!\"\n\n*thinking to myself:* Well, our receptionist who just retired in December after working here for 45 years was able to figure out what to do here, and she can't even figure out how to turn off her PC (true story; for years she \"shut it off\" just by turning off her monitor). This guy is an applications engineer and he got stuck on *this* out of all things?\n\n&gt;$Me: *what I actually said to $TOG:* \"I will modify the instructions to prevent this issue from occurring in the future.\"\n\nAnd I did.  Just for him.\n\nTL;DR: A computer savvy user stared at his laptop for 30 minutes, thinking it would reboot automatically. He needed to press \"Exit\".\n\nEDIT: formatting",
        "created_utc": 1519158665,
        "upvote_ratio": ""
    },
    {
        "title": "The Second Monitor",
        "author": "mattswer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yy44j/the_second_monitor/",
        "text": "About a year ago I was working as an IT intern at a mid-size company. We had a bunch of extra monitors so I was setting up second screens for a lot of employees. Most of the set-ups were fairly routine but this one lady, who I'll call Marie, was unintentionally hilarious. She's late 20s to early 30s so I expected her to have some basic knowledge about how computers work. For context, she had one monitor and a laptop at her desk before I set the second monitor up.\n\n\nMe: Alright, I finished setting up the second monitor, you're good to go.\n\nMarie: Oh ok, thanks!\n\nMe: Do you need anything else before I head back?\n\nMarie: Um, do I still need my laptop since I have the second monitor?\n\nMe: ...Yes, you still need the laptop.\n\nI was speechless for a good 3 seconds. It's 2017 I thought we were past the whole \"monitor = computer\" thing. I wondered if she was joking for a second but one look at her face and I knew she was completely sincere.",
        "created_utc": 1519150834,
        "upvote_ratio": ""
    },
    {
        "title": "When you cut so many corners you end up with a circle",
        "author": "savacli",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yxbl6/when_you_cut_so_many_corners_you_end_up_with_a/",
        "text": "Now, I get it, people sometimes have to resort to \"band-aid\" type setups or fixes for the sake of time, deadlines, pressure from management, etc. And I also get that eventually, the band-aid fix becomes someone else's mess to uncover and bring before the network gods for interpretation. Today's tales is a band-aid setup so complex it may have well been a full-body cast.  \n\n&amp;nbsp;\n\n***In the beginning...***  \n$ExtD was pulled into $TheAncientOne's office and was asked to look into a virtual setup for $AccountingOrg. The concept was pretty neat: $AccountingOrg had leased equipment from $LocalFarm and were offering accounting services to the community. Community members could lease their own private server (virtual machine created by $AccountingOrg) to load their $AccountingSoftware and even ask for a CPA (Certified Public Accountant) from $AccountingOrg in the case that said community member didn't have an in-house accountant. Everyone would then get a remote shortcut of sort to dial into their own server to work on their books. The concept sounded amazing.....but of course I wouldn't be typing up this story if things were going as planned.  \n\n&amp;nbsp;  \n\n***\"Remote Access of Sort\"***  \nIt turns out that the everyone was just provided a .rdp shortcut to dial into the virtual environment. What's worse is that the individual .rdp files already had the username/password programmed into it so anyone with the file could get right into the virtual environment without any other challenges. Shortcut aside, the firewall just had an open port for RDP, and we all know how secure that has been lately. But surely there was some degree of filtering such as IP whitelisting, MAC addresses, etc...right? Oh how I wish that was the case.  \n\n&amp;nbsp;  \n\n***\"Lease Their Own Private Servers\"***  \nIf the servers were a cake they would be a lie. The problem here was that there were not server**s**, it was just a single virtual server that everyone was remoting into. It wasn't even a Desktop OS but rather a full fledged Server OS that folks were walking into.  Normally Windows OS's limit the amount of remote sessions you can concurrently run, but a registry hack had been put in place to allow for an unlimited amount of remote users. To top it all off the server was just using Local Users and Groups for account management, and it has half named-user-accounts and half-titled-user accounts. From what we were told there wasn't really maintenance on user accounts so usernames would be shared across multiple people and passed on to successors instead of new accounts being created.  \n\n&amp;nbsp;  \n\n***\"...Their Own Server to Work on Their Books\"***  \nSurely, with as many people remoting into the same box the security had to be next level to make sure that everyone's data was kept separate from one another, right? RIGHT?! This is where I come back with a giant NOPE lit up in the sky by Commissioner Gordon himself. I will summary the tragedy to one statement: *Everyone: Full Control*. Yep....just let that sink in for a second. For anyone not familiar with ACL's let me break it down for you. That means that **EVERYONE** had **FULL CONTROL** over most of the folders stored on the server. What was in the folders you may ask? Accounting data. Things couldn't possibly get any worse....  \n\n&amp;nbsp;  \n\n***\"Load Their Accounting Software\"***  \nIt got worse. There was only a single installation of the $AccountingSoftware on the server which meant that essentially everyone that had signed up for this server was getting to use $AccountingSoftware for free. Sure, folks were occasionally asked to buy licensing, but there wasn't really a place for the license key to be inputted nor was the licensing information being recorded anywhere. To top it off, everyone was set up as a Standard user (What?! I finally see a security measure?!!) so something as a simple an $AccountingSoftware update walled everyone until an admin would remote in to install the update as the software wouldn't run otherwise.\n\n&amp;nbsp;  \n\nSooooo......this was our mess to fix up now. We were brought in as consultants to make the virtual environment run more smoothly and obviously make their setup compliant with regards to EULA's and ToS's. How did we do that?  \n\n&amp;nbsp;  \n\nFirst off, we cried; we cried a whole lot as fixing this mess was going to take up our lives for the next couple of weeks. Secondly, we had to ~~assemble the Avengers~~ put together a team of experts to come up with the best solution for this. Lacking in experts we settled for $ExtD, $Cable, and myself. $ExtD was responsible for reworking the way folks remoted in to make it more secure. $Cable streamlined creation of virtual machines so that each client could have their own machines. I worked on the remote environment experience so that people were getting access to the right resources. Collectively we all looked over each other's shoulders to make sure we weren't overlooking any security measures.  \n\n&amp;nbsp;  \n\nIt took us over 3 weeks from draft to implementation of the new virtual environment, and I am on week 2 of talking with the community folks and getting them migrated over.  \n\n&amp;nbsp;  \n\n**Happy Ending?**  \nFor the most part, yeah. The Accounting folks are super happy with how easy and user friendly the new system is, and they have since been able to ramp up their Accounting services to offer it to more people. Most importantly, we made sure that all licensing/EULA/TOS were being adhered to to make sure they were as compliant as we could possibly make them.\n\n&amp;nbsp;  \n\n**TL;DR** Band-aids belong in a first aid kits not in a production network.  \n\n&amp;nbsp;  \n\nEdit: Formatting and added text for clarification",
        "created_utc": 1519145118,
        "upvote_ratio": ""
    },
    {
        "title": "Vague emails are so much more painful when in ALL CAPS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ywzzg/vague_emails_are_so_much_more_painful_when_in_all/",
        "text": "[removed]",
        "created_utc": 1519142767,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me during your lunch period?",
        "author": "TechieYoda",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ywo1v/can_you_help_me_during_your_lunch_period/",
        "text": "ltl, ftp and all that.\n\nThis just happened this morning. For context, I work tech support at a school.\n\n**Edit:** Right before the Teacher (T) walked in, I had just responded to ticket from a student:\nhat reminds me, before Teacher walked in this morning, one of her students emailed my boss yesterday to ask\n\n&gt; \"can i get the administer password to install plugin?\"\n\nMy first reaction was\n\n&gt; *wut? Fuck no*\n\nThen I emailed\n\n&gt;Student,\n\n&gt;We do not give students administrative access to school owned machines. If this is for a class, please have your faculty member submit a ticket and we will address it.\n\n&gt;Mr. TechieYoda\n\nFew mins after this email went out, Teacher walked in...\n\n/edit\n\n\nSetting: I'm working on dev stuff, turned away from main entrance. two coworkers, also turned away working on other users' devices.\nTeacher (T) walks in.\n\n&gt;T: Could someone help me? I can't seem to print in color\n\n&gt; Me: (after a long moment of silence) Sure, give me just a sec.\n\n&gt;T: (glares impatiently)\n\n*solves problem (printer was not configured correctly)*\n&gt; Me: Ok all set. *starts turning back to dev stuff...*\n\n&gt; T: Oh by the way, since I'm here. I've been having this problem in the computer lab. Students need *specific plugins installed*. I put in a ticket back in the fall saying the software was out of date and it was never fixed.\n\n&gt;Me: Hmm... If I recall correctly, we updated the software as requested back then.\n\n&gt;T: But the plugins are still not installed and I have class today during X period, I think that's when you go to lunch. Are you available to help then?\n\n&gt;Me: *Wut?...* Unfortunately we have several appointments today before and after lunch...\n\n&gt;T: Well this has been an ongoing problem. I notified in the Fall, and students cant get their work done without the plugins\n\n&gt;Me: The problem that was reported in the Fall was addressed. We updated the software as was requested. There was no mention of plugins. *pulls up ticket*\n\n&gt;T: Well can I have the admin password to install them myself? I keep loosing class time since students cant do their work and try to install the plugins.\n\n&gt;Me: (*Did she just ask for God powers???*) I'm sorry, but we don't give out the IT admin password. We can add you and Other Teacher as administrators to the machines in the lab, if it's open before your class.\n\n&gt;T: It's in use all day today.\n\n&gt;Me: *facepalm*\n\ntl;dr: your lack of detail in your tickets does not make it an emergency for me. Especially not during my lunch break.",
        "created_utc": 1519140250,
        "upvote_ratio": ""
    },
    {
        "title": "Troubleshoot X, Fix Y, and Do Z all right now.",
        "author": "truesnafu",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ywifk/troubleshoot_x_fix_y_and_do_z_all_right_now/",
        "text": "Backstory: I am an IT at a refurbishing warehouse for one of the most hated cable companies in the world. I keep the systems running, software on the units, fix random stuff and run the networking.\n\n$Me == Yours Truely\n\n$Sup == The only other IT guy here. \n\n$Dale == The Shipping Manager\n\n$Boss == Branch Manager\n\n$Davis == Supervisor of one of the Refurbishing machines\n\nToday started with me wanting to complete what I was working on yesterday. $Boss wanted me to run 3 network drops that they have moved over from another station and to make them work. I spent the latter half of my shift yesterday taking my probe and toner and trying to trace the wire to our MDF, but I have yet to find it. I was hoping to find it today, but then this happened.\n\n$Dale: We need to get this place cleaned up. There's to many carts here and we have visitors tomorrow.\n\n$Sup: I'll get $Me to do it. He can handle it.\n\n$Dale: Hey $Me, are you doing anything right now?\n\n$Me: Yeah I'm running network drops. \n\nAfter that hearty conversation is over, I turn to $Sup. \n\n$Me: If I'm doing this, can you at least run the network for $station? \n\n$Sup: No, I think it'll take longer if I do it. You already know what you're doing. \n\n$Sup took off, to go hide and play a phone game in the headend room. \n\nSo I'm assuming that cleaning up isn't that high of a priority then getting an entire station online, so I continue trying to trace the cables. I was interrupted by $Dale, who wondered what I was doing.\n\n$Dale: Hey $Me, this is important. Put all units on pallets, and organize them neatly. What you're doing can wait. \n\n$Me: But I have to run these by the end of today.\n\n$Dale: How long is it gonna take?\n\n$Me: I'm not sure...\n\n$Dale: Well you can put units on pallets for now. We gotta get this place cleaned up man.\n\nI see $Davis walking, so I walk up to him and explain what just happened.\n\n$Me: I don't see why they don't put $Sup up to do this.\n\n$Davis: That's because he never does anything.\n\nAfter that I ended up taking my break to write this, and $Sup came in here to tell me that one of the stations isn't receiving internet. I tell him to plug in a cable, simple stuff first, but he says I can do it and he'll leave it to me. \n\nI have heard things around here about $Sup how he doesn't do anything and never helps out, and I should have noticed that sooner. I have more stress enduring stories if you guys would want to read them, and I would love criticism on how this was written. \n\nEdit 1: Formatting",
        "created_utc": 1519139067,
        "upvote_ratio": ""
    },
    {
        "title": "Don't fire your senior system operator then",
        "author": "syberghost",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yw1uq/dont_fire_your_senior_system_operator_then/",
        "text": "This was very long ago, my first job back in IT after a long foray into other fields. I was Senior System Operator for an ISP, which means 100% technical lead for everything but the boss (we were the first two employees) didn't want to call me System Administrator for some reason (probably because he thought I'd bail on him with that on my resume').\n\nThere are many stories I can tell but today we're starting at the end; the week I was fired.\n\nAll the documentation was stored in a subdirectory in my home directory, with a symlink in the Samba share so everybody could read it. By this point I had two junior sysops I was supervising, as well as a couple of PC support folks (we also built PCs and supported small networks etc.) who were semi-trained to fill in for phone support for the ISP etc.\n\nThe reasons I was fired weren't special, the manager was a crook and I wouldn't play ball, ratted him out to customers etc. What matters is the fact of it; I got fired. While I was being fired, one of the junior sysops, I'll call him Bob, made a phone call and by the time I got home I had a job offer waiting on my answering machine. (Cellphones weren't universal back then.)\n\nThat very day, the manager logged in and saw the documentation in my home directory, and assumed I'd made a copy of it, so he deleted it all. This would of course become important later.\n\nTwo days later, somebody accidentally fired off an rm -rf in /home on the server that contained customer web pages. They'd wiped out about 1/3rd of the customers before they realized what was going on and stopped it.\n\nI was home enjoying my brief vacation (new job had made me an offer and I hadn't accepted yet, was still making my own phone calls), when the ISP manager called me:\n\n&gt; me: Hello?\n\n&gt; manager: Hey, uh, this is Manager, I'm, uh, sorry to bother you, but, uh, how do we recover a backup?\n\n&gt; me: You don't fire your senior system operator. *click*\n\nBrief pause to laugh my ass off, then I log onto ICQ and hit up Bob.\n\n&gt; me: Bob, you alone?\n\n&gt; Bob: Yep.\n\n&gt; me: WTF dude? Manager just called me.\n\n&gt; Bob: Somebody wiped half the customer directories, and we can't figure out how to restore a backup.\n\n&gt; me: Docs are on the Samba share, it's step by step.\n\n&gt; Bob: The Samba share is empty. There's nothing there.\n\n&gt; me: Dafuq? There's a whole pile of docs, marked read-only to the Samba user, there's no way to delete them without going into my home directory and doing it as root. Wait, look in my home dir.\n\n&gt; Bob: Yeah, it's not there; but now that you say that, Manager said something about erasing a copy of the docs in your home dir.\n\n&gt; me: LOL OH SHIT he wiped all your docs man. OK, here's how to be the hero. Do not tell anybody I gave you this, this is thanks for the call to New Employer. *instructions to restore the document that contains the backup restoration procedure*. That command will pull the backup docs back, then you can follow them to restore anything else you need. Wait an hour and then be the hero.\n\n&gt; Bob: Will do, thanks man. Enjoy the new job.\n\nI didn't, but that's a story for another time.\n",
        "created_utc": 1519135081,
        "upvote_ratio": ""
    },
    {
        "title": "So can I close this call?",
        "author": "Aphala",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yvfj5/so_can_i_close_this_call/",
        "text": "So this is a small one about PST files and Outlook mail management (apparently this user is incapable), Just a standard recovery of a PST file and re-adding it or so I thought...so enjoy. \n\nUser-: Manages about 4 main team mailboxes so has about 1100 unread emails to which I was internally screeching about, she's also a VIP user so she expects the full suite\n\nMe-: Second line remote support and apparently also doing someone else's job for them.\n\n\n\n&gt;Me: *Usual introductory spiel and remote on to the machine and explains to the user about PST files being kinda rubbish overall*\n\n&gt;User: Okay all looks well with this file I can see all emails that I require good job!\n\n&gt;Me: *Ego boosts* \"Is that everything can I close this call for you?\"\n\n&gt;User: \"No I have one more query about Outlook, I have 4 mailboxes to manage and was wondering if you could have a look at this?\"\n\n&gt;Me: \"Are you able to clarify what **specifically** you are wanting me to do?\"\n\n&gt;User: \"I would like you to assist in sorting through all of my work emails if that's possible?\"\n\n&gt;Me: \"No, I am only here to support you on a technical level so I would not be inclined to sort through you mailbox as it's not part of me job.\"\n\n&gt;User: \"Oh okay...\"\n\n&gt;Me: \"Am I able to close this call then since we've done the require work?\"\n\n&gt;User: \"No I'd like this call kept open until someone assists in sorting me mailbox\"\n\n*[This is where it goes downhill]*\n\n&gt;Me: *Trying as hard as I can to stay professional in light of her new attitude change*\n\n[Head off and speak to my Line manager about this as she is heading the the direction of difficult, then head back and explain thoroughly that it's not out job to sort the mailbox but she's not having it and proceeds to get worse but not angry just...snarky]\n\n&gt;Me: \"Right we'll keep this one on hold for you for now but again we aren't tasked with sorting your own mailbox(s) out, are you sure about keeping this call open?\"\n\n&gt;User: \"Yes, I'd like to keep this one open out of protest thanks\" *laughs and hangs up*\n\n Legitimately what happened she word for word. Just sitting there scratching my head and taken back by how quickly the call went from 1 - 10 in the space of 5 or so minutes.\n\nSo it turns out my two of my colleagues had also tried to convince her but she wasn't having it, she ignored calls from the area manager (step one to getting fired) as she's been straight up ignoring all calls related to our number, it got to the point a board of directors members had to bring the hurt I mean you really have to push the buttons to get a BoD member to visit you onsite but hey ho if you're going to basically ask someone else to do your job for you...\n\n\n",
        "created_utc": 1519128751,
        "upvote_ratio": ""
    },
    {
        "title": "Obviously that its a crypto-locker.",
        "author": "haggur",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yv8mb/obviously_that_its_a_cryptolocker/",
        "text": "[removed]",
        "created_utc": 1519126520,
        "upvote_ratio": ""
    },
    {
        "title": "But you got nothing to do!",
        "author": "mastapetz",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yusyk/but_you_got_nothing_to_do/",
        "text": "So after reading several simlar storries, and sometimes writing \"me too\" let me tell the full tale:\n\n$me is me   $her  the lady in question  $rd1 and $rd2 other colleagues in office.\n\nFor it was one of those days. Checking and updating our database which has moments of me sitting infront of my PC looking like a very bored zombie. *$her* who only is every now and than in the office comes in sits down and is mumbling to herself (or to someone I didn't pay much attention neither did anybody else).\n\nThe printer is to the left of me. *$her* asigned seat to the right of me. I am  support for one of our specialist tools, so IT while not IT (don't ask).\n\nI will also include some of *$her* monologues .. I am still not sure if they were monologues.\n\n&gt;**$her**: So this needs to be printed, oh my lots of pages. Which printer is this again? Oh this one.  \n**$me**: *staring unfocused on my screen while the dataimport flashes green and white*  \n&gt;**$her**: (by now standing at the printer) Why isn't it doing anything. Oh now, wait ....  \n&gt;**$me**: *checking something on reddit for a tech problem I had before, blissfully unaware of what she wants*  \n&gt;**$her**: (reading screen of printer, it kinda sounded like I write it, if you wonder what the weird spacing is) TOoh neerrrr empty, pleeeessss reeeFFFFeeeellllll...  \n&gt;**$her**: Mastapetz! What does that mean?!?!?!  \n&gt;**$me**: (explains in German, turns back to work)  \n&gt;**$her**: Hooooow?  \n&gt;**$me**: The display shows you pictures, follow them.   \n&gt;**$her**: Where is the toh nuuuh, mastapetz?  \n&gt;**$me**: (sounding slightly irritated) How would I know.  \n&gt;**$her**: This is your office, you MUST know where the toh nuuuh is. \n&gt;**$her**: Hey $rd1 and $rd2 why doesn't mastapetz know where the toh nuuuh is, do you know.  \n&gt;**$rd1** and **$rd2**: (look at her, at me, behind them in the open rack) Usually you need to get one from the front desk.  \n&gt;**$her**: mastapetz, go and ask the front desk and change the toner for me.  \n**$me**: raises eyebrow  \n&gt;**$her**: You got nothing to do! I need to print this.  \n&gt;**$me**: I **am** working here on an important data import, which has to be finished **today** I need to watch for even the tinies of an error, so **no**  \n&gt;**$her**: But you are Aii Teeee!  \n&gt;**$me**: No, I am head admin and head support for this tool, not general IT.   Oh my import is done, and lots of red, I need to call someone now.  \n\nI did not listen to her, am not sure if she talked to me, about me or anything else, the project I was working on was way more important than her print job at that point. \n\nSeriously, that woman feels so entitled sometimes, be it her opinion or something she needs. Everytime she is here the table looks like a mess of tossed around papers and her typing sounds a herd of hippopotamus is going over the keyboard. Like \"hey listen I am here and I am working, why aren't you working as loud as I am\"\n\nI always expect her to ask me to do something for her. No, I wont bring you coffee. No, i wont change toner for you. No, I wont refill paper I would not even know where it is.\n\nOn that a tidbit:  \n&gt;**$her**: Why don't you know where toh nuh and paper are? This is your office!!!  \n&gt;**$me**: (Sitting at a desk without almost no printed paper) The only thing I print 99% of the time, are labels for our tools. I don't need to know. When I need to replace it, I ask the front desk, like everybody else.  \n\nOne of the few people I actually dislike to have in our open space office. ",
        "created_utc": 1519120970,
        "upvote_ratio": ""
    },
    {
        "title": "Development hell",
        "author": "SemiPerm_Throwaway",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yuq1u/development_hell/",
        "text": "The company I work for builds all kinds of custom solutions. We can build stuff from industrial mobile devices, networks and backends to drive them. Often we offer the whole system as a turnkey solution.\n\nWe sometimes do business with this freelancer sales guy, who has his own company but orders projects from us as needed. The projects are usually extremely poorly specced with the freelancer nor the customer knowing what they really need or want. As we are a small company, we have to take what comes in if it's even remotely reasonable.\n\nI'm sent to a meeting with the freelancer and his customer. I expect absolutely nothing as the whole thing is described to us by the freelancer as 'a data system, where people can get information using a computer'. And yes, this is exactly the type of project description we get out of him, so we always need to send someone to ask the actual questions of what they really need.\n\nAn hour into the meeting I realize this is a very rare case of the freelancer striking gold. The customer is a small but growing express delivery company, that needs a system to communicate parcel pickups and deliveries to the drivers efficiently. The system would also work as a fleet tracker. The company has grown quickly from its original 'guy and a van' setting into employing dozens of workers and they're still using paper slips and calling the drivers about new pickup requests.\n\nArmed with what I learn, we plan a system that has a touchscreen UI for the driver and a central database server and pitch this to the freelancer. We get an order for it the same week. The freelancer appoints himself as a project manager for this project. We already have one manager, but he insists it's more of a overseeing thing.\n\nThe development begins and the problems. This project is planned to happen over several months and it's easily biggest the freelancer has ever been part of. He begins to request daily updates with screenshots. We can't give him screenshots, as we start off with the server side of the software and it has no GUI as it runs on Linux. Not good enough, the freelancer has promised the customer screenshots and he presses the issue hard. We have to have one guy to do a very rudimentary GUI for the driver terminal and show that to the freelancer. The GUI is basically just couple of buttons in the screen, which can be pressed but nothing happens because there's no code to listen to the events.\n\nThe freelancer comes over and pokes the buttons on a demo Raspberry system we've set up. After that he promptly reports the customer we're a month ahead of schedule (after 1.5 weeks of work) as the driver GUI was planned to be tested at around month and a half into the project. We tell him we have absolutely nothing done in that code and he starts to argue that it must be complete because he used it himself. We explain that the GUI he saw is like drilling holes to a piece of plywood and installing some buttons in it without any wiring. He's not satisfied but leaves.\n\nA week later he comes back and and starts asking questions about the code. He learns we use Python and he requests we switch to Ruby on Rails. There's a moment of silence, as everyone within earshot mentally bang their heads against the desk. The freelancer has done some googling and learned RoR is a way to make development faster. He is explained that this is not a web based system to which he insists that he knows Ruby can be used to build graphical applications in Linux. After lots of arguing he leaves, letting us know he's not happy with us.\n\nWe have a rather good go-to industrial car PC system we use for projects like this. We usually don't keep many stocked as they're pretty expensive and we prototype stuff with Raspberry pi instead. The freelancer arrives to hover at our shop and sees both, the industrial PC and a Raspberry pi running the same software. He asks about the Raspberry's price, then starts to inquire why we need to use the expensive industrial PC when the Raspberry can be bought for next to nothing. We explain about the industrial PC's reliability, especially in extreme weather conditions we have around here and the fact it has place for a LTE modem, it can live off directly from a van's/truck's power system etc. The freelancer quickly devices up a plan of a system, that has a mobile router and a Raspberry pi, both living off cigarette lighter adapters and makes huge fuzz about it saving us so much money. We aren't thrilled. The freelancer is disappointed in us and calls us inflexible and difficult to work with.\n\nThe system is finally reaching very early trial state, when the freelancer rushes in and starts asking questions about the server side. He has read about some Linux kernel exploit and wants to make it all run on Windows 2012 server. We're a 100% open source shop, so we aren't exactly thrilled by the idea. We also explain the system is pretty much 'closed'; the clients VPN in and save the VPN server running in a firewall box, the system has no parts visible to the hostile Internet. The freelancer opens a click-bait news site article on his mobile browser about the Linux exploit, puts the phone on the table and acts like he dropped a nuclear bomb grade news to us. We explain him about how Linux security updates work and that even with all the firewalls etc. in place, the server still receives security updates. He has also asked someone whenever Python runs on Windows and he tries to use that to hammer his Windows 2012 idea. After a lot of back and forth, we tell him we cannot support the system if it runs on a server platform we didn't develop it for. He's not happy and leaves after letting us know we suck.\n\nThe alpha testing goes well and we install the system with the production hardware into one of their vans to start the beta testing. The system is feature complete, although we hit a minor bug here and there. The freelancer is there when we train the initial drivers to use the system. There's an advanced function menu that isn't needed in daily operations of the system, which has a bug we only discovered that morning. It causes the GUI to freeze. We inform the freelancer that we won't be demonstrating that part this morning, when he comes to hover around. Teaching the drivers is extremely painful, as the freelancer just won't shut up. It's like my colleague starting a sentence and the freelancer finishing it wrong, it goes something like this:\n\n- Colleague: 'When you want to do X, you start with...'\n- Freelancer; 'press this button here!'\n- Colleague: 'uh... actually you press this button'.\n\nThe drivers are very confused as the whole event becomes extremely disjointed with constant conflicting advice. The freelancer also drops a lot completely unnecessary of Star Trek-grade technobabble, making the non-technically oriented drivers just look at us with a blank stare. After we're done, one driver asks about the 'advanced' menu and before I can say anything the freelancer takes the wheel and starts talking about the menu, shows the driver how to open it and manages to freeze the GUI. The driver left looking very unimpressed and the freelancer tells us this could have gone better.\n\nAfter the trial run with real world use cases we iron out the bugs and the system is closing to version 1.0. In the end we hit very close to bullseye with our development time table and cost. After the initial confusion the drivers picked up the system quickly and save some old guy complaining how he trusts his pen and paper more, everything is running smoothly.\n\nOne day I receive an e-mail from the delivery company owner. The initial quoted part is him praising the system, commenting how much it saves from paper work etc. The e-mail is a part of a longer conversation, which I scroll down to see, how the freelancer is pretty much taking all the credit for whipping us into fold  and guiding us when we were lost.\n\nYou're welcome buddy, you're welcome.",
        "created_utc": 1519119873,
        "upvote_ratio": ""
    },
    {
        "title": "Best part about not having IT support is having IT support",
        "author": "UpUpLeftLeft",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yu0ma/best_part_about_not_having_it_support_is_having/",
        "text": "A client who ran into hard financial times decided they no longer required IT support about 2 years ago.\n\nFor the next few months, I fielded a few simple calls that got increasingly more frustrating, given the client would always start with \"I know we aren't meant to call any more, but...\"\n\nAll had gone quiet for a good year or so when this morning she calls and I could hear in her voice the hope that I didn't recognize her and know instantly we don't support her\n\nher$ \"My emails not working, can you check the system?\"\n\nme$ \"Sure, can I know what error you are getting?\"\n\nher$ \"Something about the server or error or you know, one of those messages\"\n\nme$ \"I see, could you read it out to me?\"\n\nher$ \"*sigh* umm.. ok .. The action could not be completed due to a lack of hard drive space, please clear some space and try again\"\n\nThen came the back and forth of her promising me that she had hard drive space, yet couldn't check. Asking me if I could remote in and fix it.. asking if I could install software so \"this will never happen again\".\n\nI did thoroughly enjoy the moment of coaxing and deflecting her into opening my computer and reading out how much free disk space she had. 20KB.\n\nher$ \"that's plenty, shouldn't affect my mail\"\n\nme$ \"That is absolutely nothing, I am surprised it's actually still working. Once you clear off some files everything will be working\"\n\nThe fumbling and awkwardness of her being unable to blame something we had done and having to deal with this problem all on her own, coming to terms with being unable to demand anything because she doesn't pay any more was one small victory in a battle of constant losses.",
        "created_utc": 1519110189,
        "upvote_ratio": ""
    },
    {
        "title": ", AKA Maria, you gotta see her!",
        "author": "GyahhhSpidersNOPE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ysinv/aka_maria_you_gotta_see_her/",
        "text": "\n**FIRST LET ME BEGIN WITH THIS: THIS IS NOT MEANT TO STEREOTYPE, OFFEND, INSULT, OR BOTHER *ANYONE* BY WRITING THIS IN MY USER'S ACCENT. SHE LITERALLY DOES NOT CARE AND I MEAN NO HARM BY IT. I WAS *ASKED* TO WRITE MORE ABOUT $MARIA, PLEASE DO NOT TAKE OFFENSE!**    \n\n----------------------------------------------------------------------\nHey TFTS,     \n    \n\n\n\nI wrote most of this up awhile back when I had gotten a pretty good response from y'all about a woman I work with who we call $Maria. I think this is a *perfect* way to show you how my day goes when she is online working but not where *I* am. She lives in another city now so mostly I support her from afar.      \n      \n\n    \n  \nI am the IT Mangler for a life science company. My department supports several sites in the US and abroad as well as remote users.    \n   \n\nKey players:\n\n$Me - well, me   \n\n$Maria - the head of all things to do with sales in my company; a fiery tiny Latin woman with an adorable accent and a wrath greater than Khan could dream of. $Maria is the General Manager of my site, Vice President of the division of the company I work with directly, and President of Asia/Pac. Impressive. She's brilliant (and hot). I love her (most of the time). She loves my wife - seriously she leaves meetings to go see my wife when she visits my work and $Maria is there. This works in my favor now and then. This day did not seem to be that day though.\n      \n$MB - Maria's Boss, President of our divison and pretty high up in general. Stand up guy.    \n\n$MYTECH - My tech, helpdesk guy. Level 2\n      \n__________________________________________\n\nOn to the tale (which is really a 3 in one) because I promised someone who knows me on here that I would post this (this was late summer):     \n&gt;      \n     \n\n\nThursday night I received an email from Maria to myself and my tech stating \"Thank joo guys for all joor help this week!!! Joo guys are the best!\" - a pretty nice gesture but I knew that feeling wouldn't last; this is Maria we're talking about folks. But it did make me feel good and appreciated, even if it was for just a fleeting moment.  \n       \n\nAnecdotally, I love to get in to work early. It gives me a chance to see if anything is broken or if anyone on the really early shift needs help. Maria gets up very early, too. I had just gotten my first cup of coffee and was about to go sit outside and sweat and smoke and wake up (it's really hot even in the early AM here), when I heard my phone's text notification. Who was texting me at 4:30, at home? Maria. To send me a photo of her NotFruitWinTab Pro 4 screen showing Outlook was disconnected. And to demand that I \"feex it right now!\" (remember the accent, the text said \"fix\" - I type in her accent) I texted her back and just as I hit send she sends me another text \"It jeest conn-ected\". I jokingly told her that her NFWTP4 was scared of me and knew she had contacted me. Her response was simply:\"Yes\"   - uh OK.   \n       \nI get ready and roll into work about 6:45. 90% of my site arrives @8 or right after. I log in, I look at Skype For Business and I see Maria is online and green. \"Good!\" I thought - maybe everything is OK. Nope.    \n    \n     \nAt 6:51 I get an email saying titled **\"I NEED THIS PROGRAM TO WORK!\"** that said she could not open **any** PDF's with a screenshot of Adobe Reader saying the file she was opening was corrupt. She also forwarded the file to me. I was only on my second cup of coffee for the day (issues with creamer at home, sigh) but I was awake enough to tell that that was NOT a PDF file, it was a JPEG &amp; Windows was trying to use Reader to open it. I call her on S4B (on video) and get her to share her screen with me, give me control and I changed the default viewer back to Photos.      \n   \nHow that got changed in the first place I don't know, but Maria bitched at me the whole time until I got the file opened up for her:     \n\n&gt;$Maria: GEEEEEEEEEEE, EVERY TIME JOO OOPDATE MY LAPTOP JOO GUYS NEVER POOT IT BACK RIGHT!!! HOW THE FOOK DEED EET GET CHANGED??!!? (etc.)      \n  \n&gt;$Me: Probably an update (knowing it wasn't an update but most likely a user error on her part but whatever I'm gonna fi it for her.)    \n   \n\n&gt;$Maria: BUT $MYTECH JOOST UPDATED IT JESTERDAY! EEET WAS WORKING!    \n  \n&gt;$Me: I KNOW HE DID, BUT HE WOULDN'T HAVE CHANGED YOUR DEFAULT PHOTO VIEWER, HE HAS BETTER THINGS TO DO THAN THAT, PLEASE CHECK IT NOW! (I was losing patience as I still had not had my second cup of coffee - bear in mind we are on a video call &amp; we are both irritated - we do this, it's not fighting or arguing but we are both passionate women)      \n   \n    \nMaria clicked over to her file that opened correctly this time. \n&gt;$Maria: OHHHH, There eeet is, thank Joo Dear!\" she says with an admittedly cute grin and she hangs up. I go back to making coffee.   \n    \n   \nI am in the kitchen area across from my office and I hear the S4B calling notification, and of course it's Maria so I answer it.    \n  \n&gt;$Maria: I CANNOT GEET TO MY ARCHIVED EMAIL AND I NEED TO GEET TO AN OLD EMAIL!    \n    \n\n&gt;$Me: You have to click on the blue arrow next to your name &amp; then to go a folder in that mailbox, not your name as that won't work (does it in my Outlook and sends Maria a screenshot).     \n    \n&gt;$Me: Check your email I just sent you a screenshot showing how to get to it (sometimes she does learn to fish so I keep trying to jiggle the bait)         \n\n&gt;$Maria: NOOOOOOOOO, JOO NEED TO FEEX IT NOW! I NEED THAT EMAIL!   \n   \n\n&gt;$Me: (Audible Sigh) Fine. Share your screen with me and give me control.    \n              \n    \nI go into her Outlook, click on the arrow, ask her if she saw the arrow turn blue and how I got it to open.    \n    \n&gt;$Maria: OH THANK JOO! THERE THEY ARE! Thank joo again, Dear! (she hangs up)    \n    \nI have meetings and things to do and around 9:54 I get **another** email from Maria:         \n\n&gt;$Maria:\"I HAVE LOST ALL MY MAPPED DRIVES!\" and another one right after: \"HELP!!!  I HAVE A MEETING WITH $MARIASBOSS IN 5 MEENOOTS!!!!!!!\"    \n   \nI call Maria back on S4B. This is how that call went:    \n\n&gt;$Me: You are logged onto the VPN, correct?    \n\n&gt;$Maria: Jess \n\n&gt;$Me: Share your screen with me and give me control (I barely get the last word out and she starts SCREAMING at me - the whole time I am sending her links in the IM's to the mapped drives so she could at least get her files for the meeting)    \n\n&gt;$Maria: OH MY GOD, GEEEEEEEE!!! ALL OF MY DRIVES ARE GONE!! I FOOKING NEED THESE! JOO HAVE TO FEEX THEES, OR JOO ARE GOING TO HAVE TO CALL $MARIASBOSS AND TELL HEEM I CAN-NOT MEET WITH HEEM AND EET EES JER FAULT!    \n    \n&gt;$Me yelling back: LET ME HAVE CONTROL OF YOUR SCREEN OR I CANNOT FIX IT MARIA!!!! (still on video wither her and pretty sure everyone on my floor heard this exchange but *like hell that was my fault*)    \n\n    \nShe gives me control. I open Windows Explorer to see &amp; it opens in the Default view. She screams at me again:    \n&gt;$Maria: SEE THEY ARE NOT THERE!!!!     \n   \n\nRemember, I have an NFWTP4 as well. I also know somewhere between 1507 and 1703 on Win10 updates (revisions I guess is more appropriate) File Explorer is a bit more detailed than it used to be and things are all over the place &amp; not necessarily where they were before. Mapped drives are no exception. You HAVE to click on \"This PC\" to get to C *and* your mapped drives. They don't just hang out on the left and below where one would expect them to be.   \n    \n&gt;$Me: OK watch what I am doing Maria (I navigate to \"My PC\" and open it and go to her mapped drives - which are ALL THERE by the way!)   \n    \n?$Maria: JESS JESS, DO NOT HANG UP JET (opens up a drive to get the presentation she needs for her meeitng with her boss) - OH MY GOD THANK JOO SO MOOCH! she hangs up on me again.     \n    \nI checked a few minutes later and I could see she was in a S4B call with her boss.  About an hour later I get another email from Maria:    \n&gt;\"THANK JOO FOR HELPING ME THEES MORNING!!!\"        \n   \nSo for now, I think my department is back in her good graces.   \n    \n      \nHoly crap this is a LOT longer than I thought it would be, sorry about that but I hope you enjoyed reading it!     \n\nTL/DR: Executive gets NotFruit Pro 4 laptop updated while onsite by local IT. Goes home and freaks out over every little perceived \"problem\" with her laptop resulting in several hours of pain and screaming that ultimately resulted in everything working out OK. *Maria, you gotta SEE her!*   \n   \nIf any edits appear they will be due to accent inaccuracies, grammatical errors and general bad spelling. Also, I really take my coffee seriously. ",
        "created_utc": 1519094215,
        "upvote_ratio": ""
    },
    {
        "title": "The day that email died",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ysdn5/the_day_that_email_died/",
        "text": "[removed]",
        "created_utc": 1519092894,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know what your job is, or do you just like lying to people?",
        "author": "daKEEBLERelf",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yrbb4/do_you_know_what_your_job_is_or_do_you_just_like/",
        "text": "[removed]",
        "created_utc": 1519083512,
        "upvote_ratio": ""
    },
    {
        "title": "I guess my job description includes everything...",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yqsub/i_guess_my_job_description_includes_everything/",
        "text": "I'm a small cog in a large consulting firm doing work at an even larger client. Even though my title has the words 'security' and 'consultant' in them, it seems most of my job is making, delivering and explaining status documents   \n \nI get a phone call from an ex boss, asking for a favor. Normally I'd have kept a distance, but I was bored.  \n  \nEx-Boss:\"Hey, LawTechie. I hear you're doing well... Well, that's enough chit-chat. A buddy of mine has a web company he's got to sell off. He made some _assertions_ about their security and I want to see how far we are from the truth there.\"  \n  \nme (staring at a massive spreadsheet and wondering why someone thought orange with yellow background was a good idea):\"Well, I'm busy, but I might be able to spare a few hours\"  \n  \nEx-Boss:\"Great. I'll pay half of the take for the remediation work.\"  \n  \nme:\"And a flat rate for the rest?\"  \n  \nEx-Boss:  \n  \nclick.  \n  \nI get an email with the details. TravelSite is a booking service for hotels in a specific geographical area. It's got some airline magazine level copy, decent photographs and an 8 year old version of WordPress.   \n  \nI really hope they're doing something smart with credit cards, like not touching them at all.  \n  \nI email Ex-Boss, asking for an introduction to the people running TravelSite. I'm hoping to do this like a consulting project- a kickoff call explaining what I'm doing, interviews and some kind of report and plan at the end.    \n  \nInstead, I get Mike and Spider on a surprise conference call.   \n  \nme:\"Hello? \"  \n  \nSurprise conference call:\"HEEEEEEEEEYYYYYYYYYYY!!!!!!!!! BRRRRROOOOOOOOOO!!!!!\"  \n  \nme:\"I'm not sure who you are. Who do you work for?\"  \n  \nMike:\"This is TravelSite. I understand you're here to fix everything\"  \n  \nme:\"Well, that's probably beyond my ability today.\" \n  \n  \nMike:\"We need something who can do everything. Why can't you?\"  \n  \nme:\"I can help solve some problems, but it doesn't make sense for me to do it all myself. For example- your WordPress installation is a risk\"  \n  \nSpider:\"Why? What's wrong with it? It's not down, is it? Let me check. No. It's up. Is it not coming up on Edge? Shit.\"  \n  \nI hear Spider get up and walk away from the phone. I decide to try to assert control over this situation.  \n  \nme:\"As an example- your WordPress install should be patched. I _could_ do this, but I'd rather refer you to someone who works with this more often. It'd be cheaper and better than me deep diving WordPress to update it.\"  \n  \nMike:\"Well, we need someone who can do the hand's on things. We can't update the WordPress install.\"  \n  \nme:\"Why? Are you using some oddball plugin?\"  \n  \nMike:\"No, we fired everybody in ops and development\"  \n  \nme:\"Who is left?\"  \n  \nMike:\"I'm the director of marketing. Spider's a web designer\"  \n  \n[Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/80tmay/i_guess_my_job_description_includes_everything/)\n\n  \n\n  \n ",
        "created_utc": 1519079261,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry, but at 30k feet, I can't change the toner.",
        "author": "graywolf0026",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yqk9b/sorry_but_at_30k_feet_i_cant_change_the_toner/",
        "text": "Short but facepalm worthy. I've posted before, yadda yadda.\n\nBasically after a week in New York I'm flying back home. Work calls in the process of boarding, and it's my one boss who ain't that bright, $Him.\n\n$Him: \"Hey I need you to come in and change the toner in the color printer.\"\n\n$Me: \"Well it's kind of difficult for me to do that right now.\"\n\n$Him: \"There can't be a single good reason why you can't. I need this done.\"\n\n$Me: \"Well. I'm going to be at 30k feet in a few minutes, so...\"\n\n$Him: \"So? Get in here and do it.\"\n\n$Me: \"... I'm going to be on a plane for the next 6 hours.\"\n\n$Him: \"... Oh. Well. ... Fine I guess I can do it.\" (Click)\n\n$Me: \"... I should update my resume.\"\n\n\n.... I love air travel....",
        "created_utc": 1519077391,
        "upvote_ratio": ""
    },
    {
        "title": "Cotton tales",
        "author": "Twirlonmythumb",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yqj9c/cotton_tales/",
        "text": "[removed]",
        "created_utc": 1519077189,
        "upvote_ratio": ""
    },
    {
        "title": "Tales in how not to manage a team - Prologue and Part 1",
        "author": "MetricAbsinthe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yqcin/tales_in_how_not_to_manage_a_team_prologue_and/",
        "text": "These tales are my reflections on a year under a manager who was markedly efficient at lowering morale, breaking down trust, increasing workload and decreasing the perceived value of our team. \n\nThe mainstay cast for these stories are:\n\nMetricAbsinthe - Myself, a senior telecom engineer for $DataCompany (in this tale, I've since moved on)\n\nMachine - My team lead, works colossal hours\n\nTrojainous - My Manager. Why Trojainous? [Because thats what I'd name a troll. Everytime.](https://youtu.be/Ek7F6HX8zso)\n\nDetails in my stories will be scrubbed of identifying information.\n\n***\n\n**Prologue - Setting up the cast**\n\nI had met both Machine and Trojainous at my previous job, $VoiceMS. Machine and I had become good friends. He had a lot of telecom experience however $VoiceMS was giving him the runaround and leaving him on the MACD team while I had been moved up to the Tier 2 collaboration team.\n\n*Sidenote - MACD stands for Moves, Adds, Changes and Deletions. Essentially the easy busy work and minor troubleshooting. Having this team lets me and the other Tier 2 engineers focus on critical issues. Also, you'll see me use telecom and collaboration interchangeably regarding what I do. Technically, a telecom engineer strictly deals with phones, but I also deal with video conferencing and IM. Cisco had dubbed this all encompassing role as \"collaboration\" since it involves different avenues of communication other than just phone services.*\n\nMachine was getting annoyed at being left behind with work he was overqualified for and reached out to an engineer who had left a few months prior and had become manager over voice and video at his new company, $DataCompany. The previous engineer was none other than Trojainous. Trojainous became manager over a team and given a few contractors to start off with but told he could direct hire a team lead. Machine was a solid candidate so he left for $DataCompany. Before he left, he told me all the details Trojainous had relayed. They had a vendor handling the management of the Collaboration environment (all the servers dealing with communication services) and Machine only had to worry about keeping contractors in line as they handled MACDs while learning the infrastructure so he could take over support once their contract with the vendor ended. The workload was supposed to be light, working remote a couple days a week was fine, the benefits package was generous and Machine would be on the fast track to managing his own collaboration environment since Trojainous said he preferred to let his people do their job and he'd just handle the politics and money management.\n\nMeanwhile, back at $VoiceMS, we had gotten a new VP who had put on a good face at first, but events quickly went downhill. The long list of incompetent decisions that were half-assedly implemented without the engineers input can be another story. Suffice to say, my job was getting a lot harder despite the actual workload staying the same. One issue that had almost been resolved before the new VP came on, was that my salary had remained on par with the tier 1 team. The other tier 2s hired directly to the position were making $40K over what I made. The previous administration and I had a verbal agreement on the new payscale and it was just pending HR approval. Then the new VP came in and essentially said \"That's crazy you don't give more than 10% bumps at a time\" albeit with more corporate babble added in. So I was left with an offer to be bumped up to $38K less than everyone else. This had set off many texts to Machine asking about vacancies at $DataCompany.\n\nFast Forward a few months and I'm headed to my interview with Trojainous and machine dressed in a suit. I pull into the address, but worry I'm at the wrong place until I see Machine and Trojainous wave to me. My interview was at a World Of Beer. The interview went well in that I wasn't being interviewed. I sat down and listened to Trojainous' speil about how amazing $DataCompany is and how great it'll be to work for him. Then he made an offer, and a good one at that. I hastily accepted and he gave me my starting date. It was only 3 weeks out. An important note is that this interview was last second. Machine called me at 5PM and said \"Dude, I don't care what you're doing but be at &lt;address&gt; by 6PM.\" In just a couple hours I went from despondent about my job at $VoiceMS to excited to ecstatic about a new job in 2.5 hours.\n\n**Part 1 - Missed Red Flags**\n\nMy first month at $DataCompany went as smooth as a first week could go...as far as I saw at the moment. I had been lubed up with excitement about the opportunity and luged through the week without looking at my surroundings. Looking back now, there had been multiple red flags that I brushed off, but they would prove to be consistent issues.\n\n**Red Flag 1: Trojainous' attitude towards the contractors**\n\nYou know how common advice when dating someone new is seeing how they treat wait staff or anyone else in a service position? Well, contractors are a company's wait staff sometimes. We had two contractors that I knew were not long for this job. The first, we'll name something useless since he essentially was. Denuvo seemed like a good guy on team calls, but his ticket metrics were not up to par with the rest of the team. I closed 50 tickets the first week (lots of simple changes) while still learning the layout of the infrastructure. Denuvo closed 20 in that same week. He kept saying he was doing support for the HQ office, which may have been legit, I didn't want to judge since I was new. Within a few weeks, Trojainous decided he wanted Denuvo gone and he managed to do it in the douchiest way possible. He called the contracting rep and that's where his communication ended. We were never told and Denuvo had to find out from an email regarding the policies for his upcoming exit. It's important to note Denuvo is fully remote. Denuvo called Trojainous multiple times to ask what was going on but Trojainous never answered. So Denuvo reached out to Machine who said he'd talk to Trojainous. Trojainous balked at the idea that he'd talk to Denuvo saying \"I told our contracting company rep. He can talk to her.\" There was never any closure for Denuvo and he was left screaming \"What did I do? Why am I being let go?\" until his access was cut off. I accepted Trojainous' answer at the time. Technically he did what he was required to do, but he also failed to treat Denuvo like a human and give him some notice and closure. \n\nRex was contractor 2. He was from the old guard. I wouldn't have been surprised if Rex was in the room with Alexander Graham Bell when the first call was made. Now, he was still a good MACD tech even if he was only lightly familiar with the Cisco suite of communication apps. We kept him on long after Denuvo because he could close tickets better than anyone. He also had been with the original company that was now $DataCompany so he had intimate knowledge of not just the current layouts, but also the legacy layouts. That kind of knowledge is valuable and we asked Trojainous multiple times to just leave him on the staff as a MACD guy. Trojainous would hear none of it and then later told us to give him all our hard and annoying tickets saying \"I want him begging to be off this account.\" Again, Trojainous was amazing at dehumanizing his employees. Rex would later be let go when his contract needed to be renewed and Trojainous straight lied to him about how his hands were tied and his contract couldn't be extended.\n\n**Red Flag 2 - Gaslighting**\n\nTrojainous was a master bulshitter. He'll tell three different people three different things because thats what they wanted to hear. That means that he'd have to backtrack on some of what he said, or more accurately, claim he never said any of that and come up with a 4th thing to say. This was shown to me when he was telling me about his plans to move away from the vendor managed environment we had so we could control everything 100%. I later brought up something regarding our future plans in a meeting and he acted like I totally misunderstood him saying we were only planning on lowering our support level with the vendor, which was nothing like what he had just told me. I would later find out that never nailing down a plan 100% and changing it from meeting to meeting was one of his tactics to never be held to promises. Meanwhile he'd act like you were stupid or crazy for thinking he said what he said last time.\n\nThere were other red flags, but they tie into their own tales.\n\nTLDR: I seriously hate it when I think I'm biting into a chocolate chip cooking and end up finding out it's an oatmeal raisin cookie.\n\nThis will likely be the longest post in the series, I just didn't want to do only the prologue.",
        "created_utc": 1519075767,
        "upvote_ratio": ""
    },
    {
        "title": "Windows XP and Old POS Software vs My Boss",
        "author": "Rathwood",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ypxhl/windows_xp_and_old_pos_software_vs_my_boss/",
        "text": "Okay, third time's the charm! This story was previously posted in a comment on this sub, and was made into a proper post 6 months ago, but was removed for what I assume was profanity. I didn't notice it was taken down, I just thought nobody cared. I reposted it yesterday, but within 24 hours of another story, so it was taken down again. Hopefully, I've got it right this time!\n\nAnyway, I posted about this job before. If you're interested in reading that story, in which I poisoned a user, it's [here.] (https://www.reddit.com/r/talesfromtechsupport/comments/5gujya/you_poisoned_my_keyboard/) The story I double-posted with this one (the one that caused this one to be taken down) was also about this job. It's [here.] (https://www.reddit.com/r/talesfromtechsupport/comments/7yiih8/fwd_i_need_you_to_stop_my_employee_from_working/) Give it a read if you wanna hear about the time one of my execs forgot he hired a social media manager.\n\nSo, I worked for a medium-sized retail company a few years back when Microsoft announced that they were officially ending support for XP (well, they were ending it in a few months- several announcements had probably been made by then).\n\nSo Boss assigns me the task of eliminating XP from our environment. Okay... most of the head office was using Windows 7 laptops already... no problem there. Just a handful of old curmudgeons who needed to be \"persuaded\" into taking a new computer. In at least three cases, this meant me staying late and sneakily carting off their workstations after I'd ported their files and software.\n\n\"What's that, Karen? Why no, I have no idea where your old Dell Optiplex 580 went! I'll have to look through the storage area to find it- may take me awhile... hey- tell you what! Why don't you try using that snazzy new i5 laptop I set you up with last week while I search! I'll send you an email when I find the old machine!\" (big customer service smile)\n\nThe problem came in when I had to deal with the computers in our stores. We had 20 or so stores nationwide and most of them had already been partially upgraded. Office computers, customer kiosks, etc- these were already running Windows 7 and chugging along nicely. But the POS (Point Of Sale) Machines...\nAll of them were running XP. ALL! And they HAD to, because the POS software our company used was originally coded in the neolithic era on the walls of a cave dwelling in southeastern France. I spoke to our POS team lead (POSTL).\n\nPOSTL: \"Nope! Sorry, Rathwood! Can't be done! Buttwerks LLC went out of business in 2001- we don't even have people to call for support! We've been trying to force it to run on Win7 for three years- nothing works!\"\n\nSo I spoke to Boss.\n\nMe: \"Hey Boss- so I've eliminated every XP machine except for the POS units in the stores\"\n\nBoss: \"What? Then you're not even half done. Those account for most of our machines.\"\n\nMe: \"Yes. And I spoke to POS Support. ButtPOS doesn't work on Windows 7. They told me they've been trying to port it for years and it can't be done. Looks like we'll have to upgrade to new POS software and replace the machines in one go.\"\n\nBoss: \"And who's going to pay for that, Rathwood? Have you even looked at our budget? DO YOU THINK THIS COMPANY IS MADE OF MONEY?!\"\n\nMe: \"...I mean...What else would a company be made of?\"\n\nBoss: \"...Get out of my office. I want those machines replaced, and you're going to find a way to do it, or it's your job.\"\n\nIt was typical of my boss to try to force square pegs through round holes. He was not a smart man. Naturally, my project instantly languished, and I started redirecting all of the heat for this project to POS Support. I decided that if my boss was going to be an out-of-control ape, he could be one in the POS Team's office. I was not going to go to battle for them in the fight between their reality and my boss's demands.\n\nEventually, though, my \"project\" hit critical mass when I got a call. It was Peggy from Accounting (PFA).\n\nPFA: \"Hey Rathwood, how am I supposed to run this check software from ButtCrack Bank? I need admin privileges on my computer.\"\n\nNo, you don't. \n\nMe: \"Send the CD to me, I'll install it on your machine for you.\"\n\nSure enough, I got the CD, attempted to install it, and... nope, only works on XP. Fine. I gave ButtCrack Bank a call.\n\nBCSG: \"This is ButtCrackSupportGuy (BCSG) from ButtCrack Bank, how can I help you?\"\n\nMe: \"Hi. This is Rathwood from BigButts Inc. I have a copy of [ButtCrack banking software] on a disc here and I need the most recent version, but I can't find anything on your website. Can you direct me to a download link?\"\n\nBCSG: \"What version do you have, sir?\"\n\nMe: \"12.34982 or whatever\"\n\nBCSG: \"That is the most recent version, sir.\"\n\nMe: \"Wait- what? Is there a Windows 7 version?\"\n\nBCSG: \"No, sir. Windows XP only sir.\"\n\nGreat.\n\n\"Well, maybe I could have a VM set up with XP just to run this thing,\" I thought, \"Then I can train Peggy from Accounting in how to use it.\" I approached NetworkEngineer (NE). He was the only one with the requisite skills and permissions to do this.\n\nNE: \"No way. I'm too busy with projects X, Y, and Z.\"\n\nSo now I found myself setting up an XP machine down in accounting, which is the exact opposite of what I was supposed to be doing. I knew my boss will hit the ceiling when he found out, so I went to the VP for approval. The VP was a significantly more reasonable man.\n\nME: \"Hey VP. So now that I've explained the situation, I need to ask for your approval to install one Windows XP machine so accounting can communicate with ButtCrack Bank. It'll be temporary, until NE can set up a secure VM to do the job.\"\n\nVP: \"All right. It better not be there long. Keep after NetworkEngineer to get it done. I'm going to talk with ButtCrack Bank about this. If they're not supporting Windows 7 yet, I'm not so sure I want them to be holding our money for us.\"\n\nNaturally, Boss found out eventually and was irate. He stomped over to my desk as I was in the middle of a phone call a couple days later.\n\nBoss: \"Rathwood, WHY IS THERE A NEW WINDOWS XP MACHINE IN ACCOUNTING?! You told me you eliminated them all!\"\n\nMe: \"ButtCrack Bank requires it for their software and NetworkEngineer doesn't have time to set up a VM. It's temporary.\"\n\nBoss: \"I don't care. Take it down immediately!\"\n\nMe: \"Talk to VP.\"\n\nI could have cooked a pot of ramen on his scalp at this point.\n\nBoss: \"You went over my HEAD?!\"\n\nMe: \"I'm on the phone, boss. Could we please have this conversation later?\"\n\nBoss then stomped down the hall to the VP's office. No idea what exactly was said in there, but Boss probably called for me to be fired at least twice during that conversation. Threats were a central pillar of his managerial style.\n\nI never was fired, but I did quit not too long after this. Hated that job.",
        "created_utc": 1519072769,
        "upvote_ratio": ""
    },
    {
        "title": "I was headed in for surgery",
        "author": "nearlyotaku",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ypc0v/i_was_headed_in_for_surgery/",
        "text": "Many years ago (2004) when I was the IT Support tech for medium sized private, cable installation / telecommunications company, I was having a mountain of lower back and associated spinal issues that finally coalesced into requiring surgery or I'd soon never be able to leave my bed again. Most everyone knew - I was friends with a ton of coworkers and 99% were fully sympathetic. One part of my job however was arriving early to setup the routes for the field PC techs. It was easy part of the gig and it was a bonus 50 bucks every morning at the time.\n\nDue to the surgery I'd setup with an alternate to do the routing for the period I'd be away from work and ensured any training was done well in advance. He came in with me every day for a full 2 weeks before my surgery date, he did the routing while I showed him how to ensure everything was properly distributed, done by zip code for \"X\" number of techs, etc. It was *NOT* a difficult task - by end of week one he had it down in my opinion. Week 2 - he was doing it daily and I didn't even have to chime in on it any longer.\n\nThe day of my surgery my wife and I were at the hospital at 6am, signing me in and whatnot and I still had my phone on by accident - and it rang, at 6:10am. It was the guy who was doing the routing for all the field techs. Apparently that weekend he'd somehow forgotten everything he'd been doing for 2 weeks, nearly without fail or issue. I told him, \"dude, I am literally standing at the counter of the hospital where I'm about to be wheeled into a 7+ hour surgery....I'm not sure what I can do for you now. You've done this for 2 weeks!!!\" He starts coming unhinged, not angry - but freaking out like the job will simply never get done, the techs will miss every job, be in wrong areas, and other craziness.\n\nAfter listening for about 20 minutes as my wife finished my paperwork for me it was time to get ready and wheeled back. I told the guy, \"look, if you can't figure this out just get all the techs in the room with you and spread out every workorder by zip code. Tell them to start picking all the jobs in their respective areas - they're greedy and they will grab EVERYTHING they can. You're probably going to have a couple techs who are even lighter than normal. If not - any jobs leftover, YOU RUN THEM!\"\n\nThen I hung up, turned off my phone, and got in the wheelchair, blah blah blah - surgery - blah blah.\n\nI didn't call work for about 5 days after that. When I finally did I learned one of the techs who I'd never \"taught\" to route just came in and started doing it since the other guy was failing miserably at it. Although the 1st day of spreading the jobs out worked exactly as I told him it would and they scooped up everything they could their hands on.\n\nI never did get an apology from that a-hole who called me on surgery morning. I don't think we even spoke once I returned for like 6 months, heh. Jackwad.",
        "created_utc": 1519068611,
        "upvote_ratio": ""
    },
    {
        "title": "Hello IT? Your local server room is on fire.",
        "author": "Lord_TheJc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ynzp6/hello_it_your_local_server_room_is_on_fire/",
        "text": "This is a story from many years ago.\n\nI was in highschool at that time, and our school gave us the possibility to do 1-2 week apprenticeships during the year and/or summer vacation.\n\nThe dad of a friend/classmate worked as a technician for the city, and since the city was also the chief town of the district, he worked together with the admins of the entire district (which were also high-level local technicians). This allowed both me and my classmate to spend 2 fantastic weeks with him and with the admins.\n\nThe day of this story me and my classmate were in the control room along with the other 4 district admins.\n\nThe admins wanted us to be part of their typical day, so we spent some time with every one of them, we took part as silent guests into some meetings, and calls were put on speakerphone.\n\nWhile we were at the 18th floor of this super cushy skyscraper, 99% of the offices were spread across the cities in different buildings, each one with its own little server room.\n\n$Admin 1 to 4 are the admins (duh), $Lady is the person that called us, me and my classmate have basically been silent the whole time.\n\nPhone rings.\n\n&gt; $Admin1: $Admin1 here, we have students here today so please note you are on speakerphone.\n\n&gt; $Lady: Yes hello, I'm calling from [Other building in another part of the city]. Your local server room is on fire.\n\n\n3 seconds of silence. Then $Admin2-3-4 jumped from their chairs and went to their jackets.\n\nMe and my classmate looked at each other, knowing that this was going to be a great day for an IT student. Probably less for an Admin.\n\n&gt; $Admin1: I'm sorry, but did you say \"on fire?\"\n\n&gt; $Lady: Yes!\n\n&gt; $Admin1: Fuck. $Lady are you safe? \n\n&gt; $Lady: Yes yes. I'm at the second floor of [Building], I can see the server room from here!\n\n\nWe will learn later that this particular server room was on the ground floor, and the access door was on the inside couryard, which was visible from many windows.\n\n&gt; $Admin1: Perfect. $Lady do you see flames?\n\n&gt; $Lady: No.\n\n\nAnother stop. The other admins, now with their jackets on, stopped going for the door and started looking suspiciously at the phone.\n\n&gt; $Admin1: ...do you see smoke?\n\n&gt; $Lady: No!\n\n\nMe and my classmate looked again at each other, with a WTF look on our faces. Admin2-3-4 were taking off their jackets and going back to their chairs.\n\n&gt; $Admin1: How do you know there is a fire? is there an alarm ringing or something? \n\n&gt; $Lady: No, I opened the window and I was overwhelmed by the smell of something burning! It must be your server room!\n\n&gt; $Admin2: Temperature control of their server doesn't report anything strange. Tell her if she took her medicines.\n\n&gt; $Admin1: I appreciate your proactivity, but from here we do not see anything strange.\n\n&gt; $Lady: But it must be your server room!\n\n&gt; $Admin2: I have the camera feed. No fire. I insist about the medicines.\n\n&gt; $Admin1: A kind colleague just checked the local camera, we can guarantee there is no fire.\n\n&gt; $Lady: But...\n\n&gt; $Admin1: (annoyed) $Lady, we have no reason to suspect a fire. If you feel unsafe ask [Name of building boss] to check the server room in person or call the fire brigade. Thanks for your call.\n\n\nClick!\n\n&gt; $Admin3: There are 3 lessons to be learned from this call kids.\n\n&gt; $Admin3: The first one is the first rule of IT: \"all users are stupid\"\n\n&gt; $Admin3: The second one is that the first rule isn't strong enough.\n\n&gt; $Admin3: The third one is that if you have a choice, it's better to be several kilometers and 18 floors away from said users. Also having to ring a bell to enter the floor helps.\n\n&gt; $Admin2: I'll add a fourth one. If someone calls you about a fire, remember that you probably have a temperature monitor on your server.\n",
        "created_utc": 1519058830,
        "upvote_ratio": ""
    },
    {
        "title": "Retail sales gig",
        "author": "viceroy_2000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ymvm1/retail_sales_gig/",
        "text": "[removed]",
        "created_utc": 1519049425,
        "upvote_ratio": ""
    },
    {
        "title": "Ignorant Users &amp; Dumb users can be devs too",
        "author": "550c",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ylof6/ignorant_users_dumb_users_can_be_devs_too/",
        "text": "I received a voicemail recently from a user asking for help. Here's what she said: \"Hi, I'm having a problem with my computer. There's something missing on it. I don't know what it is because it's missing, if it were there I could tell you what it is but since it's not there I don't know what it is, I just know it's not there. Can you please fix it?\" I called her and asked her to show me where this missing thing isnt. She opened her browser and then said she's not sure but something is missing. I told her to call me back if she remembers what it is and I just closed the ticket. I don't have time to deal with that.\n\nWe recently switched from traditional fax machines to an efax system. I was told to port all the fax numbers to the new system and cancel the old services. After doing this I get a call from a user that the fax doesn't work anymore. I explain to her what's going on and that she can't use that fax machine anymore and that it will be removed soon. I send her instructions on using the efax and consider the matter closed. About an hour goes by and she calls back saying that she followed the instructions and sent a test message but it didn't work. I asked her where she sent the test fax. That's when she states that she sent it to the old fax machine. This same user another day had called me and was upset because she said whenever she's on a website that uses her location it says she's in San Diego. She's logged into a xendesktop session from a third party and the servers are located in San Diego. I try to explain to her how remote desktops work and that it says San Diego because that's where the servers are and her response is \"well not everyone is in San Diego\". She then hangs up the phone and I decide to just close the ticket. Ain't nobody got time for that.\n\nAt my previous job I was a network and Linux admin for a software company. I had a developer call me on a Saturday and ask me for help connecting to the company wifi. After going through the basics and asking him questions, I get responses from him that aren't making any sense. I come to find out he's at home about 20 miles away from the office. I told him wifi doesn't work that way and from that point on I started treating devs the same way I treat a secretary, lots of hand holding. Turned out to be a good strategy. I expected a lot more out of developers but that was a mistake.\n\n",
        "created_utc": 1519034810,
        "upvote_ratio": ""
    },
    {
        "title": "Speed up your data cleansing by setting all your values to 0",
        "author": "paul_wilde",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ylj3s/speed_up_your_data_cleansing_by_setting_all_your/",
        "text": "Another quick one this morning, via proxy of one of my friends.\n\nWorking at a hardware parts refurbishing place of some sort, my friends boss was trying to explain the process of secure wiping a hard disk drive to a customer.\n\nFor clarity, this place use a fairly simple disk erasing software that just writes 0 across the disk a couple of times.\n\nFor some reason, the customer wanted to know how long this would take. The boss responded with a typical \"boss\" response\n\n&gt; Well, it depends on the amount of data on the disk. If the disk is fairly empty then it will all be 0's anyway so the software doesn't need to write that bit.\n\nYes, because read time costs nothing and a 0 bit value means no data. /s\n\n*clap clap*",
        "created_utc": 1519032695,
        "upvote_ratio": ""
    },
    {
        "title": "An ISP's theory on updates",
        "author": "paul_wilde",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yli37/an_isps_theory_on_updates/",
        "text": "Hoping this will be a short one, but it's a funny one\n\nSo, it's a Thursday, I got a call from a client saying they are experiencing some internet issues, the speed was really poor. The client was also, at the same time, on the phone to his ISP. \n\nNormal checks, making sure the server wasn't backing up or anything (poor upstream on this connection, so a backup can cause upload latency, perceived as download issues), all was fine though.\n\nTook a look at router logs, and I can see 3 or 4 PC's really going hell for leather on download use...immediately, I *knew*...Windows 10 Fall Creators Update, 4GB of download going to each of these PC's...I was right.\n\nHowever, all this time, I am talking to my client on the phone whilst they are also on the phone to the ISP. I'm brainstorming ideas as I'm looking at things and as I get closer to the cause, I say \n\n&gt; Ah, Windows updates....\n\nMy client, for some reason, relays this onto the ISP saying\n\n&gt; Could it be Windows updates causing it?\n\nThe ISP respond (I could hear them) with possibly the greatest line  I have ever heard from somebody that is supposed to be technically knowledgable. This line has stuck with me since, and will stay with me for a long time. This line will make me the \"funny guy\" at a party. This line will make my friends happy in times of sadness. This line I will share with you now.\n\nThis line...is the best...(remember it is a Thursday)\n\nThis line...is...\n\n&gt; No, it can't be updates. Updates only happen on Tuesdays\n\nAnd thus ends my story. Have a great day.",
        "created_utc": 1519032297,
        "upvote_ratio": ""
    },
    {
        "title": "How outsource QA team saves money",
        "author": "seimungbing",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ykc23/how_outsource_qa_team_saves_money/",
        "text": "[removed]",
        "created_utc": 1519016920,
        "upvote_ratio": ""
    },
    {
        "title": "The time I disrupted internet access for ~20 homes and businesses in my city.",
        "author": "FormationOfBabby",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yk323/the_time_i_disrupted_internet_access_for_20_homes/",
        "text": "I got my start in IT doing small-time tech support for a local law firm, owned by the people who would eventually become my in-laws. I worked in retail prior to landing this gig, studying A+ materials to break out. Presumably, these kind folks felt just as bad for me as I felt about myself, so they offered me a job. I happily accepted.\n\n\nOver time, my role evolved from basic desktop support to basic network administration - configuring switches, setting up VPN connections, etc. I did my fair share of reading and learning, so naturally I thought I was hot shit. I was a real IT guy! I started to experiment with the equipment after hours, which went as well as it could have until one fateful evening.\n\n\nI had learned about NAT - sort of. I knew what it did. What I didn't know was that NAT works automatically on consumer routers, which is where the \"sort of\" comes in. One evening, looking through the router's GUI, I found a page titled \"One-to-One NAT.\" Aha! I know what that is! Better meddle with it. After all, I'm a bona fide IT guy.\n\n\nI opened the page and saw no entries in the NAT list. *What? NAT isn't being used in this business? Thank God for these people that I am here!* I proceeded to map a public IP address to each device on the LAN, which luckily consisted only of 20 or so devices total. I went home, patting myself on the back for adding value to the business.\n\n\nI showed up to work the next morning and was immediately called into my boss' office. He received a call from [ISP] informing him that their NOC techs had traced some IP address conflicts to our office. Several locations in my city, including businesses, were experiencing intermittent internet connectivity at best. [ISP] let us know that our service would be dropped if this did not stop immediately. My boss gave me a look that I will never forget.\n\n\n&gt;\"Uhhh... I'll... uhhh... take a look at it.\" \n\n\nI hastily began removing the static NAT entries I created the night before when my *other* boss walks in, holding a piece of paper with a grave look on her face. Silently, she hands over the paper and I take a look at the text printed thereon:\n\n\n&gt;\"Hi. My name is [John Doe] with [Company]. It appears that your printer is being advertised on the internet.\" \n\n\nSomeone troubleshot their connectivity issue and discovered that an HTTP request to their own IP address was directed to a printer. *Our printer*. The letter went on to explain the connectivity issues explained by the [ISP] tech beforehand. It hits me. *Our servers, printers, phones... Everything is exposed to the internet...*\n\n\nAnyway, I removed the entries, rebooted the router, and everything was fixed - except my dignity and reputation.\n\n\nShockingly, my benefactors did not fire me. I worked there for three more years, became a CCNA, and now I work for the same company whose customers I pissed off years ago.  \n\n",
        "created_utc": 1519014113,
        "upvote_ratio": ""
    },
    {
        "title": "Saved the company by listening to an incompetent tech.",
        "author": "xredgambit",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yjobx/saved_the_company_by_listening_to_an_incompetent/",
        "text": "[removed]",
        "created_utc": 1519009921,
        "upvote_ratio": ""
    },
    {
        "title": "Windows XP and Old POS Software vs My Boss",
        "author": "Rathwood",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yik78/windows_xp_and_old_pos_software_vs_my_boss/",
        "text": "[removed]",
        "created_utc": 1518998973,
        "upvote_ratio": ""
    },
    {
        "title": "FWD: I need you to stop my employee from working. Immediately.",
        "author": "Rathwood",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yiih8/fwd_i_need_you_to_stop_my_employee_from_working/",
        "text": "In keeping with my tendency to share these stories immediately when I'm reminded of them, I must confess that I posted this once already as a comment in /r/gaming without even thinking of you guys. Sorry about that.\n\nWhat follows is a story that comes from my first few months at [medium-sized company]. I previously posted here to tell [a story about the time I poisoned a user] (https://www.reddit.com/r/talesfromtechsupport/comments/5gujya/you_poisoned_my_keyboard/), and [another story about that time I stealthily upgraded users to Windows 7 by moonlight (now with a working post)] (https://www.reddit.com/r/talesfromtechsupport/comments/7ypxhl/windows_xp_and_old_pos_software_vs_my_boss/).\n\nSo anyway.\n\nI was a tier 1 phone jockey and this was my first “adult job” after college, so you can imagine how surprised and nervous I was when one day I get an email with the subject line “FWD: DISABLE FACEBOOK NOW!!” \n\nIt was written just like that- in all caps, two (or maybe three) exclamation points. Inside, there was a long message chain containing an extended rant from our marketing executive (MKT), sent to the CEO, replied to, forwarded to the CIO, replied to, forwarded to my manager, and then kicked down to me with no explanation.\n\nMy manager did this kind of thing a lot- rather than open a ticket in the ticketing system he insisted we use a certain way, or explain anything in his emails, he would simply forward us an email chain of a conversation he’d been having with some store or department manager, some executive, or some vender, and we’d have to read through all of it to figure out what he wanted. \n\nThis email was one of those. And since it had come from people up the chain from him, I had to read through all of his pathetic groveling and deferential boot-licking to reach the part where he made his unqualified promises about what I’ll do in how much time. \n\nEventually, I surmised the following:\n\n-MKT is upset that his employees are spending work time on social media.\n\n-He has decided that this is all IT’s fault.\n\n-He wants social media \"disabled on ALL computers.\" \n\n-He sent this complaint to the CEO, because it’s not good enough to contact IT and open a ticket to get something done, he has to try to get someone fired while he’s at it.\n\nOkay, fine. We actually had Websense, so I wrote up a ticket, opened up the admin console in Websense, and added Facebook’s URL to the blacklist. Done and done. \n\nI reply-alled to the message chain and let the executives know that we’re good. Immediately I got hammered with replies from the CEO, my manager, and MKT (who had made the request). They all wanted to know why I disabled Facebook on *their* machines.\n\nExercising all the restraint I had, I apologized and explained that when they said “disable Facebook on ALL computers” I didn’t realize that they meant for there to be exceptions to the rule.\n\nI grabbed one of our Tier-3 guys and he helped me set up MAC filtering in Websense. We made a group for the executives and managers to be excepted from the social media blackout, and then blocked twitter, instagram, and all the other common social media sites while we were at it.\n\nThinking the issue has now been properly dealt with, I updated the executives, who seem placated, updated the ticket, and then closed it.\n\n15 minutes later, a red-faced young woman (SMM) appeared in the IT office. She’s from marketing and was upset because she couldn’t reach Facebook or Twitter. I gently explained that those had just been blocked at the request of her department’s exec.\n\nSMM: “But you’re NOT supposed to block ME! I’m a social media manager! It’s MY JOB to be on FACEBOOK. NOW I CAN’T WORK!”\n\nMe: “Oh. Hang on.”\n\nI placed a quick speakerphone call to MKT and got his admin assistant (AA).\n\nAA: “MKT’s office.”\n\nMe: “Yeah, can I speak with MKT? It’s about the Facebook blackout he requested.”\n\nAA: “Ooh yeah, he’s pretty upset about that.”\n\nOf course.\n\nMe: “Can I speak to him?”\n\nAfter a minute, she got him on the line.\n\nMKT: “Rathwood! Glad you finally got it right.”\n\nMe: “Sir? SMM is in my office right now.”\n\nMKT: “So? Tell her to get back to work.”\n\nMe: “Sir, she can’t. She says it’s her job to run the company’s social media pages and she can’t work now because of the block. Do I have your permission to unblock her?”\n\nMKT: “...”\n\nMe: “...”\n\nMKT: “You mean we’re paying someone to be on Facebook?”\n\nMe: “...she works for your department, sir.”\n\nMKT: “Unblock her for now, and tell her to come see me in my office.”\n\nMe: \"Okay.\"\n\nOkay.\n\nI turned to look at SMM, and she was already walking out.\n\nME: “Hey- are you alright?”\n\nShe turned back to me. \n\nSMM: “I’m fine. This is the third time this month that dinosaur has forgotten that I work here. I’m used to explaining my job to him.”",
        "created_utc": 1518998516,
        "upvote_ratio": ""
    },
    {
        "title": "Encyclopædia Moronica: S is for Specifications Kill",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yid7g/encyclopædia_moronica_s_is_for_specifications_kill/",
        "text": "A few years ago, I was working for a place that still holds a special place in my heart; a blackened, twisted place that is the birthplace of nightmares, demons, and other screaming terrors.\n\nOur equipment interfaced with the customer's equipment via a standardised interface board. The last change to the standard was put into effect in the nineties, so at this point in time, the standard had been unchanged for well over a decade.  \nThis will be relevant soon.\n\nThe interface manufacturers, however, had not been resting on their respective laurels; in fact, one such manufacturer had gone to great lengths to develop their product - it had additional outputs that could be connected to local systems, so that when the equipment we monitored went into an alarm state, whatever local equipment the customer desired to install could also detect the change by simply monitoring for an open/closed circuit change.  \nThey were actually pretty good units, and the company forged ahead, developing new functionality where previously the industry had stagnated.  \nAnd when the original equipment manufacturer for some fairly popular equipment released a statement saying that they were not going to incorporate the latest protocol changes into their interface devices? Well, this company went right on ahead and made their unit 100% compatible with that equipment.\n\nBut then I got a call.  \nAnd that call was the beginning of the end.\n\n---\n\n&gt; ME: Joe's Discount Surgery and Tech Support, how may I maim you today?\n\n&gt; Field Tech (FT): Hey G, I think we've got a problem here.\n\n&gt; ME: What's up?\n\n&gt; FT: Well, we had an activation at *{site}*, but we never got an alarm message about it. And *{other message recipients}* never showed up, either - which is fine, it was a false alarm, but still... They really should have.\n\n&gt; ME: That's very... odd. Do you know when this happened?\n\n&gt; FT: Yesterday.\n\n&gt; ME: Weird... That site has two *{system interface boards}* on channel one, right? And a third one on channel two?\n\n&gt; FT: Yip - that's it.\n\n&gt; ME: I'm looking at the history for *{site}* now, and there's no activation message. However, there is a communications failure message for the boards on channel one, at *{time}*. The board on channel two doesn't seem to have an outage at that time, though.\n\n&gt; FT: Huh. I'm looking at the logs on the equipment here, and I'm seeing an activation at almost that exact time.\n\n&gt; ME: Hmmm... Our system sync from a different time source, so it's entirely possible that we're looking at the same event.\n\n&gt; FT: But... how would we prove it?\n\n&gt; ME: Hey, I've got an idea. I'll turn off all outgoing messaging - I'll see it, but it won't get sent to you or to the *{other message recipients}*. Then you trigger an activation, and we'll see what happens.\n\n&gt; FT: Okay. You're sure it won't get sent to anyone?\n\n&gt; ME: Absolutely; I've just turned off all outgoing messaging now. Activate the equipment now, please.\n\n&gt; FT: Okay, if you're sure... Activated now.\n\n&gt; ME: And I've got the alert here.\n\n&gt; FT: Damn.\n\n&gt; ME: Hey, I've got an idea - this system has got two units next to each other, right?\n\n&gt; FT: Yeah.\n\n&gt; ME: So if you turned off the master control system that feeds them both, then we should get simultaneous activations on both systems, yeah?\n\n&gt; FT: I think so; yeah, that makes sense.\n\n&gt; ME: Alright, let's do that. The outgoing messaging is still off, so go ahead when you're ready.\n\n&gt; FT: Okay, and... now.\n\n&gt; ME: And I've got...\n\n&gt; ME: Communications failure. Okay, WTF?\n\n&gt; FT: Hey, all the lights have gone out on the units here!\n\n&gt; ME: WTF?!\n\n&gt; ME: Let's just undo what you just did.\n\n&gt; FT: Okay... Master control system is back online and feeding both systems as normal. Hey, the lights on both units just came back on!\n\n&gt; ME: What.\n\n&gt; ME: The.\n\n&gt; ME: F\\*CK.\n\n&gt; FT: Does that mean you don't know what happened?\n\n&gt; ME: Oh, I know what happened.\n\n&gt; FT: Qué?\n\n&gt; ME: The power to the units cut out, which explains both the lights going out and the reported communications failure.\n\n&gt; FT: But... why would the power be turned off when we activate the equipment?\n\n&gt; ME: I don't know... but I'm going to find out.\n\n---\n\nAfter a brief conversation with the CEO about the cost, I obtained an order for three of the system interface boards in question. Once they arrived, I configured them exactly the same as the ones installed at the affected site, and repeated the test.  \nThe same behaviour was observed: activating a single system caused no issues. Activating multiple systems on a single channel would cause power loss.\n\nI dug into the schematics for our monitoring board. Sure enough, there was a current limiter across the power output for the channel - exceed 100mA, and the power is cut off. It's a built into the hardware; I couldn't adjust it, even if I wanted to. More so, it protects a DC to DC converter that provides isolated power to the channel - and an investigation revealed that the converter was only rated to 86mA, so running it at 100mA was technically outside of it's operating specifications (116% of maximum).  \nI pulled the specification. In black and white, it stated that the quiescent operating current of each device on the channel was never to exceed 25mA, and that the combined current of all devices on a single channel was never to exceed 100mA.\n\nSo it seemed that the only way for an in-use channel to drop it's output power to 0V was to draw more than 100mA of current. But the specification stated that the devices could not draw more than 100mA.  \nI tried one last experiment - this time, I connected a battery and ammeter to the channel's power line; in effect, providing an alternate current source.  \nI flicked the switch, simultaneously activating both units.\n\nThe communications channel stayed up.  \nThe ammeter reported that current draw was a steady 120mA.\n\nFindings irrefutably in hand, I called the unit manufacturer.\n\n&gt; Lead Engineer (LE): Hey Gambatte! How can I help you?\n\n&gt; ME: I've been doing some testing on one of your units here, and it looks like your unit is pulling about 60mA when in alarm.\n\n&gt; LE: Yes, that's right.\n\n&gt; ME: But the specification says it should never draw more than 25mA.\n\n&gt; LE: Well, yes, but that's really more of a guideline. The monitoring equipment can provide a lot more than that!\n\nThis is true, 100mA is more than 60mA. I'm not sure quite what our competitor's equipment maximum current draw is, but I'm sure it's more than our equipment can provide (as ours is a smaller, cheaper unit).\n\n&gt; ME: Yes. But the specification ALSO says that you can connect four of these on a single communications channel.\n\n&gt; LE: Well, yes, this is true...\n\n&gt; ME: And the specification states that the combined operating current for all four devices will never exceed 100mA.\n\n&gt; LE: Well, in normal conditions, yes.\n\n&gt; ME: But not during an actual activation.\n\n&gt; LE: Well, no, they draw more in that state, because the relays are energized...\n\nBingo. They've used standard relays, which draws ~20mA while activated. Multiply that by the number of relays, and suddenly the low power unit has just massively exceeded the current allowance.\n\n&gt; ME: Wait, so you're not using latching relays?\n\n&gt; LE: Latching... No; what are they?\n\n&gt; ME: They might also be called pulse or impulse relays? Basically, you apply a short burst of power to them, and then they switch and lock into the new position, until power is applied again. They're used for low power systems like these because they only need a short burst of power, rather than a constant drain.\n\n&gt; LE: Never heard of them.\n\n&gt; ME: Damn. It's what literally everyone else in the industry is using.\n\n&gt; LE: I'll look into it, I guess. Can't you just increase your current output?\n\n&gt; ME: It's hardwired - and we're already over the limit for the DC isolation converters, just to meet the spec maximum. We cannot increase it any further.\n\n&gt; LE: Well, I don't really see this as an urgent issue...\n\n&gt; ME: I feel I should point out that *ANY* site that has more than one of these units installed on a single communications channel will cause an immediate power failure during an actual activation event, rather than reporting the activation.\n\n&gt; LE: Oh! Hmm, I wonder how many affected sites there are; can't be that many, surely...\n\nI was prepared for this moment.\n\n&gt; ME: Right now? I'm showing over a hundred affected sites. A lot of them are for *{big corporate customer}*.\n\nI swear I could hear the colour draining out of his face over the phone.\n\n&gt; LE: Oh God... Yeah, *{big corporate customer}*... We did a bulk discount and everything... I gotta go, I need to get on this immediately.\n\n&gt; ME: Let me know what you come up with, okay?\n\n---\n\nI never did hear from him again.  \nI assume he got in touch with the CEO, however, as they were old friends, and the CEO asked me several times over the next few weeks if we could alter the overcurrent protection trigger level; by the third time I explained that it was hardwired and thus not adjustable, AND at the level stated in the specification, he seemed to understand.\n\nA few months later, I heard that LE's company had declared voluntary administration, and soon after, the company entered liquidation.  \nFrom what I understand, he tried to make things right, but the cost of replacing hundreds of units was too much. At last, unable to stave off the creditors any longer, he folded the company.  \nLast I heard, he was asking my CEO to be a reference for his resume.\n\n**TL/DR: Don't ignore ANY part of the specification.**",
        "created_utc": 1518997096,
        "upvote_ratio": ""
    },
    {
        "title": "FWD: I need you to stop my employee from working. Immediately.",
        "author": "Rathwood",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yiant/fwd_i_need_you_to_stop_my_employee_from_working/",
        "text": "[removed]",
        "created_utc": 1518996415,
        "upvote_ratio": ""
    },
    {
        "title": "Laser Induced Headdesk",
        "author": "S-IVB_Upper_Stage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yhobd/laser_induced_headdesk/",
        "text": "LTR;FTP;SAMF\nSome background: I work at a science and mathematics focused public senior college. Probably what they would have called a \"school for the gifted\" in days gone by. We get a lot of government funding and therefore have some pretty expensive toys. At the end of last year we had all the desktops replaced, including the one that is plugged into the laser cutter.\n\nI'm  the school's Laser cutting guru. People basically just come to me if they need something cut for a project. Anyway, we get back a couple of weeks ago from the summer holidays, we have all new machines throughout the entire school, and everything is looking good. I ask the IT guy if anything's changed with the laser cutter. He says that we now have to log in with our own accounts (previously there had been a dedicated account for the laser cutter). I say that's fine, bid him adue and head for my first class. Nobody needs to use the cutter for the first couple of days, but pretty soon I get a request to do a job for one of the students. So, we trudge up to the tech area, I log into the laser computer and load up the student's adobe illustrator file, check it all to make sure that it's all ready to cut and the like, and hit print. \"Illustrator couldn't export file\" I try again, same problem. I turn the computer off and on, same problem. I turn the cutter off and on, same problem. I check the cables from the computer to the cutter, they're fine. I get the IT guy in, he goes through all the settings, same problem. We look at where the computer is trying to print to. \"Downstairs Photocopier (colour)\".... **headdesk**\n\nTL;DR, photocopiers can't laser cut.",
        "created_utc": 1518990765,
        "upvote_ratio": ""
    },
    {
        "title": "Why I shouldn't have left my dad alone with our new ISP's service technicians.",
        "author": "thenastynate",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yerwx/why_i_shouldnt_have_left_my_dad_alone_with_our/",
        "text": "[removed]",
        "created_utc": 1518966587,
        "upvote_ratio": ""
    },
    {
        "title": "That time when I paid to be tech support",
        "author": "Draco_Ranger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yeo1c/that_time_when_i_paid_to_be_tech_support/",
        "text": "A few months back, a couple friends and I decided to spend New Years in Montreal.  This was a terrible decision, due to it being -40 degrees with windchill, but overall we had fun with the standards of Netflix, Elder Sign, and Uno.  The tech support part of this vacation began on the second morning when the wifi's DHCP failed.  \n\nWe were staying at an Airbnb, with a owner who chose to leave the router in a guest's bedroom, which provided connection for about 12 guests over two units.  Our property was fine, as we just assigned ourselves static IP addresses and carried on.  The other one complained that they couldn't connect to the internet.  \n\nThe owner sent us a text message telling us to stop messing with the internet.  This continued over the next few hours, with increasing frequency and aggression.  We were out, and hadn't been messing around with the wifi, so we ignored it until we get back. By that point, the owner took it upon herself to come to us in person and tell us to knock it off.  \n\n&gt;&gt;\"I don't know what you did, but the wifi's not working.\" The owner said.  \n&gt;&gt;\"Sorry, but it is working,\" my friend said, pulling out his phone and demonstrating. \"The issue is that DHCP failed for some reason.  You can get around it by setting a static IP address like this.\" as he manually input an example static IP into his phone.  \n&gt;&gt;\"But you should just type in the password and it will connect. What did you do?\"  \n&gt;&gt;\"We didn't do anything.  Something went wrong, and this is a workaround in the meantime.\"  \n&gt;&gt;\"No, it's not working.  What did you do?\"  \n&gt;&gt;\"We didn't do anything.\"  \n\nThis continued for some time, with us asserting that we hadn't changed anything, it was a DHCP issue, and that she needed to call tech support.  \n\nShe insisted it was our fault, and that we didn't know what we were talking about, as this had never happened before.  Therefore, we had obviously done something wrong as the router was in our part of the property.  \n\nThe highlight was her claim that \n\n&gt;&gt; \"I don't know if it's different in the United States, but here all you do is type in the password and you get internet.\"  \n\nFinally, I say we should restart the router.  Which we do, which doesn't work.  \n\nThe owner decides to call tech support, and my party heads out for lunch.  \n\nWhen we get back, she had been on the phone for most of an hour, and made little progress.  I ask to take over, since I am capable of saying which lights are blinking.  \n\nA couple hours later, I have the wifi back up, have given the admin controls back to the owner, and tested DHCP.  She says thanks and walks off.  \n\nThis really should have been the end of it.  We had demonstrated that we knew more about the network than she did, and we were willing to work for her, the owner of the house, to fix something that didn't affect us.  \n\nBut it continues.  \n\nLater that night, she accuses us of having 13 people in the property, because that was the number of devices connected to the wifi.  We explain that this is the number of devices and most people have a computer and a phone.  \n\nLater that week, she changes the password without telling us.\n\nEvery so often, various tech issues are laid at our feet, none of which were remotely related to anything we actually did.  \n\nFor our final review, she chided us for messing with the wifi and causing her all that trouble.  \n\nSo, yeah, that is the story how I spent 2-3 hours doing someone else's job, then got blamed for everything that went wrong with it for the rest of the week.  ",
        "created_utc": 1518965566,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, shut down works too",
        "author": "Beall619",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ycp5k/yes_shut_down_works_too/",
        "text": "[removed]",
        "created_utc": 1518935971,
        "upvote_ratio": ""
    },
    {
        "title": "I don't understand her logic",
        "author": "SpaceOctopus94",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ycl0c/i_dont_understand_her_logic/",
        "text": "So one of my job responsibilities is to help students print. Black and white is 10 cents a page and color is 30 cents. I had spent the last 20 minutes walking this student through the process of getting on a computer, getting on to word and as I'm doing this I try to explain to her how printing works at my job. Of course she ignored me. \n\nShe gets done with her paper and informs me she is ready to print. Again I try to explain to her how printing works. She tells me that 20 cents is too expensive so she wants to save her paper on her flash drive. Ok whatever. So I help her and then she tells me that she plans to drive around and find a place where she can print out for cheaper.\n\nInternally I face palmed but I wished her luck and she went on her way. So like, I get that students sometimes don't like to pay for their prints but to waste gas to attempt to find a cheaper place is a new low. ",
        "created_utc": 1518934383,
        "upvote_ratio": ""
    },
    {
        "title": "One of the few times I actually said NO",
        "author": "GyahhhSpidersNOPE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ybj38/one_of_the_few_times_i_actually_said_no/",
        "text": "This won't be very exciting probably,  but I was just reading the week's top TFTS's and thought about this again &amp; it still is irritating me. So my apologies for a vent over something that probably isn't nearly as bad as it seemed to me!    \n   \nI am an IT Mangler for a life science company. I have offices and users all over the globe. It's the local ones though that keep me there - most are like family to me.\n    \nRemember when you were in school and you had some kids that were \"teacher's pet\" AKA \"brown-nosers\"? I work with one of those and they report directly to the same guy I have a \"dotted line\" to at my site (I report *directly* to the CIO ) who I will just call \"Boss\". This person is well known for constantly demanding things from office supplies to lab equipment and of course IT stuff. None of us in the service areas really like to work with them because of the added strain of dealing with a whiny tattletale. Sorry if that sounds harsh, but this person is borderline abusive to my dept and several others.     \n    \nOrdinarily I don't mind these types of people, because my department is committed to great \"customer service\" so I usually am able to ensure a good relationship off the bat. I even get top management from Corporate &amp; worldwide that come to my site give me their devices to fix / answer problems / fix something my domain admin rights let me &amp; while my boss appreciates it, my teammates up at Corporate are a bit jealous of me because my reputation is better than theirs. My point there is that I really try to take care of user issues, even the ones they cause themselves. It just makes my life easier. But this one? One of the most demanding people I have ever met and just plain rude. And they were promoted last week to \"Lab Mangler\" so there's a drunk with power layer there as well as aforementioned terrible traits.  \n    \nI had a meeting with Boss Tuesday (and every Tuesday, sigh) and as we were talking he mentioned that just because I am *asked* to do something, I don't *have* to because*\" some of his staff\"* was \"a bit demanding &amp; wants *everything* but you don't have to do it just because *they* want it done, it's your department\".      \n   \nWell well, this is going to be interesting. I knew what manager he was talking about - the one nobody likes because they are just not likable.  \n\n*Side note: 2 weeks ago I fell (at home, dog pee, slick slippers in case you were wondering; better but still have 3 more dr visits/weeks) &amp; messed up my heel and achilles tendon on my right foot. I do a LOT of walking at work (and honestly I could spend entire days just walking around my site). I'm in a walking boot &amp; it was really hard to get around the last couple of weeks so I was trying to stay off of it &amp; again, EVERYONE knows this.*\n    \nSo, my special lab mangler teacher's pet (known henceforth as $SLM) shoots me an email yesterday morning: \n    \n&gt;$SLM: My Citrix isn't working when I put my address in (includes snip of Citrix Receiver asking for the address (site)... aaaaaaaand they had their email address in it not the receiver site)    \n   \nLet me just say right here that this user not only sent it marked of High importance to me but to their boss (my dotted line boss as referenced above) and the helpdesk (based out of Corporate and they assign EVERYTHING to me for my sites for me to reassign) - and like a ton of HD programs, it creates a new ticket for each new email &amp; then they have to be assigned or marked as duplicates - by Corporate. Oh and Corporate upgraded Citrix yesterday and told the rest of the world about it 5 minutes beforehand. Seems only one of my users were affected...\n\n    \nI email $SLM back. I copy Boss but not helpdesk (because it will generate a new ticket)   \n\n&gt;$ME: Hey $SLM, just put in https: //myapps.xxxxxxxxxxxxxxxxxxxxdotcom in the box and click Next all the way through and you'll be fine.     \n    \nI get an immediate response.\n&gt;$SLM: I used to have this on my computer and it started automatically. I want YOU, $ME you to come here and fix it because I need it now. (again, me, boss, helpdesk &amp; yes, YOU and my name were in caps for whatever reason, effect maybe?)    \n    \nI'm not usually cranky on Fridays but this was a rough week and this person was in several meetings this week with me and was well aware I was trying not to walk.   \n   \n&gt;$ME: (boss copied also, not helpdesk but in all bold italics)    \n***$SLM, ALL YOU HAVE TO DO IS COPY THE ADDRESS BELOW IN THE BOX. IT WILL STAY THERE***   \n&gt;Thanks, $ME    \n   \nI get an email ~3 minutes later. Just to me, not boss or helpdesk.\n&gt;$SLM: I fixed it.    \n    \n   \nInternally: Of course you did. I literally could not have done better. Literally.\nI reply back. I copy boss.   \n\n&gt;$ME: Thank you for letting me know - I am closing the tickets you opened &amp; I will let Corporate know you were affected by the upgrade. There was an email sent this morning stating this could happen if you logged in at X-timeframe and you did, hence the resulting problem.     \n   \nI hit send and realize I have other, new emails and tickets from $SLM *demanding* other things for their labs (network drops, PC's, a ton of stuff they didn't budget for apparently)&amp; copying Boss and the helpdesk. Nope. That can wait until Monday.   \n   \nTL/DR: \"Recently promoted known to be a pain\" user demands that I *personally* walk to their office 2 buildings away from me to type 38 characters I already sent to them, knowing I am in a walking boot because I hurt my foot badly. Got to say no and be a bit snarky without worrying about the wrath of their direct boss who is also my dotted line boss.      \n     \n\nEdit: I spelled \"site\" as \"sight\" &amp; fixed it. Thanks /u/ShoulderChip :)    \n2+ edits: typos, spelling\n_________________________________________________________________    \n    \n\n3rd and hopefully final edit: I answered \"what is a dotted line boss?\" in the comments but thought I would add it here also:    \n    \nI report up through our Corporate office, and I report directly to the CIO. I am the head of IT for a division of the company that has several divisions under it. \"Boss\" reports to my boss's boss (as of a few months ago) &amp; Boss is also the plant manager of the site I work out of (Which is an Ops position like mine). So he can tell me what to do but he cannot fire me directly, approve PTO, give me a raise or promotion or performance review, etc - CIO does that.    \n     \n\nAnd I love my boss, I really do - when CIO told me on a Skype call that I was going to have a dotted line to Boss I literally said \"But... but he's such a DICK!\" &amp; his response was \"I know but just try to get along with him\" - we have a great relationship. Boss signs off on my projects for the sites I own that he is also responsible for &amp; all my company credit card purchases (that's one thing I really do not like, he questions everything even if it was stuff he had me buy); he is really there for local oversight. He is a real dick, and I have a few tales just about him someday I will write up.",
        "created_utc": 1518921952,
        "upvote_ratio": ""
    },
    {
        "title": "The colors are different",
        "author": "Twpak",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7yae5z/the_colors_are_different/",
        "text": "Got a ticket that the user was not getting display. \n\nI get there and within 5 mins I determine the GPU (looks beefy) is dead. I take it out and plug the VGA cable to the mobo and get display. \n\nIt is an old 1st gen i5 with Intel HD graphics. I think she could live without a GPU\n\n&gt;me: what do you mainly use the PC for?\n\n&gt;user: checking gmail, MS word, occasionally watching YouTube\n\n&gt;me: In that case, you wouldn't notice that much of a difference. You don't have to buy another GPU.\n\nshe gives me a puzzled look then asks\n\n&gt;user: how much would it cost to replace that?\n\n&gt;me: well if you really want to replace it then around $100. I wouldnt recommend spending any more than that. Until we replace it you can continue to use the PC with the integrated Graphics.\n\n&gt;user: How is the computer supposed to work without the motherboard?\n\n&gt;me: What I took out was not the motherboard. It is the GPU. You have 2 GPU's. 1 of them died, so we are using the other one.\n\n&gt;user: Why do I have 2 of them?\n\nI am stumped. I am speechless. Best strategy is to drown her with technical jargon. Give her a speech about GPU and IGPU's\n\n&gt;user: will the computer work without that? It looks important.\n\n&gt;me :Yeah it will work, the GPU is there to power the display.\n\n&gt;user: So it makes the colors?\n\n&gt;me: Yeah you can say that it makes the colors.\n\n&gt;user: Will youtube have colors if I use the PC without that thing?\n\n&gt;me: Yes it will have colors.\n\nShe's skeptical, opens YouTube and watches a random video.\n\n&gt;user: Will my documents have color?\n\n&gt;me: Yes they will\n\nBeing the skeptic she is. Opens a PDF document that is typed entirely in black font.\n\n&gt;user: I don't see any colors\n\n&gt;me: Because there are no colors in this file. \n\nOpen another document with some logos to show her.\n\n&gt;user: will xyz have color?\n\nnot wanting to do this all day.\n\n&gt;me: Look, you won't notice a difference at all. Everything will have color. There wont be a difference. Nothing will change. Your computer will be exactly the same.\n\n&gt;user: but but, will I have color?\n\nI keep repeating my above line to her next 10 questions.\n\n\nSatisfied she lets me leave. Get a memo the next day that she does not have color. I have to go back.\n\n&gt;user: Look, I went home last night and my home Laptop has more color. This is different. I want color.\n\nI take a look at the PC. Everything is good. I have no idea what she is talking about. She keeps telling me that her laptop has better colors. \n\nConvinced she has lost her mind I just keep repeating the same (You have color, the computer is exactly the same as it was before, there hasn't been a change) again and again to all her questions. Offer to buy her a GPU if she pays for it but assure that it wont make a difference. Finally she lets me go.\n\nNext day get another memo that I still have not fixed her problems. She does not have color. I have to go back.\n\n&gt;user: I bought my laptop, see it is different.\n\nI see it instantly. @#$%ing Windows Aero. The laptop has transparency. The intel HD graphics does not support Aero.\n\n&gt;me: If you want transparency you will have to buy the GPU. Yeah on this one we cant have those colors.\n\nuser is now smug\n\n&gt;user: but you said it will be exactly the same. You now see how they are both different right?\n\nShe is right. I am left speechless.\n\n&gt;me: Ask for approval for the new GPU so I can get it for her.\n\n&gt;user: Nah it is ok. It works fine. I think I can live without the colors.\n\n\nI am beginning to think I must be losing IQ points after such interactions. \n",
        "created_utc": 1518910412,
        "upvote_ratio": ""
    },
    {
        "title": "The Bird's Nest",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ya5hm/the_birds_nest/",
        "text": "Working Tuesday to Saturday instead of Monday to Friday has its benefits. I do not have to deal with the busy Mondays and I also get to experience the weird calls and tickets that are recieved on Saturdays. For those who haven't seen my stories, I work as a tier 2 tech support agent for an ISP.\n\n\nThis story is about a ticket I recieved a call about from a Tech. It was sent off a few days ago and had just today reached a technician. The ticket was for a standard no connection issue but was also affecting the phone. The Tech needed some information that only I or my other coworkers can access. I provided it to him. This conversation ensues:\n\n\nT: ...now I'm just going to go check the terminal to see what's going on here--  \n\n\n**SQUAWK!**\n\n\nT: *profanity, shuffling noises* Well, I know why they're having issues. There's a crow's nest inside the terminal! Close the ticket. I can't do anything here. I'm going to call animal control and have them moved.\n\n\nAfter hearing that, I sat for a few minutes going over if I really just heard that there's a crow nesting inside the terminal box. When I realized that I did just hear that, I closed the ticket with the following: \n\n\n\"*Bird nesting inside terminal box. Referring to a third party to have the nest removed.*\"\n\n\nThis is the first time in my short two year support career that I've ever dealt with something like this.",
        "created_utc": 1518908059,
        "upvote_ratio": ""
    },
    {
        "title": "Gets to work, infected server.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/techsupportgore/comments/7y9cjd/gets_to_work_infected_server/",
        "text": "[deleted]",
        "created_utc": 1518900965,
        "upvote_ratio": ""
    },
    {
        "title": "*Croaking noises*",
        "author": "M1ghtypen",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y91fs/croaking_noises/",
        "text": "[removed]",
        "created_utc": 1518897958,
        "upvote_ratio": ""
    },
    {
        "title": "Tech support issue",
        "author": "ItsPhilosopher",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y88ux/tech_support_issue/",
        "text": "[removed]",
        "created_utc": 1518890956,
        "upvote_ratio": ""
    },
    {
        "title": "Customer expects his IDE HDD to be cloned over within 5 hours....on a Friday afternoon.",
        "author": "The_Tech_Monkey",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y85u9/customer_expects_his_ide_hdd_to_be_cloned_over/",
        "text": "[removed]",
        "created_utc": 1518890200,
        "upvote_ratio": ""
    },
    {
        "title": "Medical emergencies and the need for basic troubleshooting",
        "author": "LividLager",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y7e23/medical_emergencies_and_the_need_for_basic/",
        "text": "My father was in the middle of a quad bypass shortly after having a heart attack and stroke simultaneously which nearly killed him. I had taken a few days off to be there during the surgery and to keep my Mother company. I really didn't want her to be alone if my father died during the operation. About 5 hours in we still had not gotten a single update despite us being told a nurse would update us periodically, so we were really on edge.\n\nI get a call from a VP at work, apparently he was having trouble signing a digital contract. There were a few young kids sleeping in the waiting room so I left the room to be polite and helped the VP for 10-15 minutes, he did ask how the operation was going and to be fair it may have been just an excuse to see how we were doing. To be honest at the time I was just grateful to get my mind off of things and to focus on anything else.\n\nAfter getting off the phone I head back to the waiting room and it turns out about 2 minutes after I took the call a nurse had come in and thankfully gave my mom some good news. My fathers surgery was going well and they were just finishing up, which was a huge relief.\n\nIt wasn't until I was driving home that it really hit me just how insensitive it was of the VP to call me for basic tech support, while being fully aware of the situation. There was also the fact that there were other people in IT who were more than capable of handling his situation. I just couldn't get over the \"What if\" out of my head. What if my mother had gotten bad news while I was out of the room and not only had to deal with it alone, but then would have had to explain it to me a few minutes later after I got back.\n\nI know I shouldn't dwell on something like this too much, especially since it ended up being a best case scenario but it's something I'll never forget.",
        "created_utc": 1518882836,
        "upvote_ratio": ""
    },
    {
        "title": "A tale of two bosses",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y71hm/a_tale_of_two_bosses/",
        "text": "[deleted]",
        "created_utc": 1518879194,
        "upvote_ratio": ""
    },
    {
        "title": "The Perfect Storm",
        "author": "YesIBrokeIt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y5vfd/the_perfect_storm/",
        "text": "Howdy all!\n\nI'm still trying to get round to writing up some of my older stories, but heres one from yesterday, and yes, it was entirely my fault and No, that doesnt make me feel better!\n\nThe company I work for is going through some substantial growth (4 staff to 30 staff in less than a year). This is coupled with an MD who likes to save money wherever possible. Recently moved into a new building and bought a £70 Cisco 3750 POE switch from Fleabay to get us in the door and working, its only 10/100 and the console port is fried so I can't admin it. This gorram switch has been giving me issues Every.Single.Day since we got it. I know its got some VLANs on it, but for the life of me I can't figure out wth is going on with it.\n\nAfter spending the better part of an hour troubleshooting yet more IP phone issues, I finally had enough and persuaded MD to buy a shiny new switch. I want Meraki, he wants cheap... naturally we meet in the middle with a Cisco SG500x... ($Newswitch) BUT it comes from Fleabay (half the list price). The ad says fully functional so we buy it\n\n**fast forward 3 days for delivery**\n\n&gt; $New switch arrives - YIBI is a very happy IT Manager\n\n\n&gt; Test new switch on desk, make sure all ports provide POE and there are no glaring issues.\n\n\n&gt; Victory! Maybe Fleabay has come up trumps for once\n\n\n&gt; Stay late and fit shiny $newswitch confident in the fact that the users will appreciate the improvement\n\n\n&gt; do final test and head home, quietly looking forward to NOT waiting forever to transfer ISOs to hyper-v server!\n\n\n&gt; ~get an early night~ Do some more work on shiny switch from home with a strong drink until 1am and then sleep\n\n\n&gt; Wake up breifly at 4am because phone is buzzing, check its not a user and silence it\n\n\n&gt; Wake up again at 6, start going through daily notification checks - emails etc\n\n\n&gt; realise $NetworkMonitoringServer has been crying for attention since 4 saying critical devices are offline\n\n\n&gt; silently curse and grab my first $500mlEnergyDrink of the morning and see whats off\n\n\n&gt; discover all POE devices are off\n\n\n&gt; Curse not so silently and head into the office (now about 7:15 am)\n\n\n&gt; $newswitch is still on and seems to be behaving well. Check config changes to check I didn't make a rookie error, nothing obvious\n\n\n&gt; restore to backup before config changes. Still no POE (but everything else is fine, Check everything I can find, nothing obvious\n\n\n&gt; Message $worldbestsecondliner (whos going into a new job with $suckers) to see if he has any useful insights, none forthcoming, just light abuse ($git!)\n\n\n&gt; start to sweat, users will be here soon and they tend to whine\n\n\n&gt; restore to factory defaults, Still no POE. \n\n\n&gt; give up, remove $Newswitch and reinstate $oldbattlebusswitch\n\n\n&gt; put $newswitch on the side and decide to do more testing when I get an hour, also ping Fleabay seller a quick message to ask for help/get replacement/refund\n\n\n&gt; $MD comes in and asks why his PC is still connecting at 100meg and why isnt the \"expensive\" $newswitch install\n\n\n&gt; Advise $MD switch is not behaving as expected and will be tested further today\n\n\n&gt; $MD suggests YIBI did something wrong and perhaps $MD could fix it.\n\n\n&gt; Offer to write resignation letter (We both know I'd NEVER quit this job, but it was now 9:30 and I wasn't up for \"banter\"\n\n\n&gt; $MD brings more $Energydrink for his ~only~ Favourite IT admin\n\n\n&gt; Fleabay seller comes back asking for more information - sensible questions - Seller clearly not a moron, YIBI appreciates this.\n\n\n&gt; much testing later shows that plugging $NewSwitch into another POE switch causes $Newswitch to try and provide POE to the other POE switch and fail because it can't supply enough power.\n\n\n&gt; seller confused, YIBI confused, $MD annoyed because \"his\" new switch is bust\n\n\n&gt; Seller suggests new firmware as a last test before returning\n\n\n&gt; Firmware is 3 years newer. Cue eye roll, This can't be a firmware issue... Surely?!\n\n\n&gt; New firmware fixes this. YIBI hangs head in shame. Concious decision to not update firmware (It appeared to be working, and had other priorities)\n\n\n&gt; $MD looks as if he is about to give YIBI some stick for making a rookie error, gets greeted by a steely glare and retreats to his office\n\n\n&gt; YIBI learns an important lesson and recieves abuse from $worldsbestsecondliner for not doing the \"obvious\"\n\n\n&gt; Now in on saturday to reinstate $newswitch and hating life\n\nProbably going to spend the next hour fixing formatting. Let me know if you would like more stories from my incredible c**kups!",
        "created_utc": 1518861934,
        "upvote_ratio": ""
    },
    {
        "title": "If the oncall phone rings and doesn't wake me up, what happens?",
        "author": "dave999dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y5qjl/if_the_oncall_phone_rings_and_doesnt_wake_me_up/",
        "text": "20 years ago I was given my first on call device, a pager. Back then cell phones were way too expensive. Shortly after my on-call duties began I asked my boss this question:\n\n\n&gt;Me: I'm a fairly heavy sleeper. What happens if the on call pager goes off and it doesn't wake me up?\n\n&gt;Boss: Well, I think there are a few things you can do to prevent that. Before you go to bed turn the volume up as loud as it can get. You may also try something like putting the pager in a metal can. The vibration should make a decent racket.\n\n\nThen 10 years ago I got a new job and was given the on call phone for my first rotation. And I asked my new boss the exact same question as my old one.\n\nHe thought about it for a second, said this, then went back to his coffee.\n\n&gt;Boss: Then it doesn't wake you up.",
        "created_utc": 1518859559,
        "upvote_ratio": ""
    },
    {
        "title": "I thought I'd never see the day",
        "author": "SpaceOctopus94",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y55yd/i_thought_id_never_see_the_day/",
        "text": "Since this deals with what went down at a college computer lab I thought this would fit here. \n\nTo give some much needed background, I work at my community college's computer lab located in library. Before I even started working there (and I've been working there almost 3 years now) there was an angry old man who would come in. \n\nThe man was not only always in a near psychotic rush but also was always rude and overly aggressive. He would break computers, card readers, berate students and workers alike. He even pushed a friend of mine's mother down the stairs when she was \"taking too much time: to get off the bus\". \n\nAnywho, despite all of this crap he would do he would never get in trouble or get kicked out for whatever reason. I dreaded every time he would come in. Until one night that his behavior caught up to him.\n\nIt was the end of my shift and a coworker had come to relieve me of my post. Old man was there and angry that his student card wouldn't work. When he wasn't able to get my coworker's help because she was helping other students he flipped out and chucked his card at a girl who worked at the front desk before escaping into the night. \n\nWeeks later he comes back into the library and is talking to my bosses boss (I miss her so much) and he tries to deny everything but she isn't having any of it. She simply tells him that we have him on tape and he is banned from the library. \n\nMoral of the story: If you're going to be a mean old man, don't do it on camera. ",
        "created_utc": 1518850222,
        "upvote_ratio": ""
    },
    {
        "title": "What happens when you outsource everything",
        "author": "Frozen-assets",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y4601/what_happens_when_you_outsource_everything/",
        "text": "I get paged, Virtual Host crashed, 30 VM's down. Open the bridge, start paging out to everyone, start engaging all the various application teams that had VM's on that host. I'm going through my troubleshooting 101 list of questions to ask. Very quickly realize what happened. Someone couldn't connect to their VM, they call Ops and raise a ticket. Ops pages server support to investigate, server support is desperately overworked and can't be bothered so they just tell Ops to engage on-site support to reboot the server. You can probably guess what happened next, Ops indeed engages on-site (who are actually deskside PC tech's), gives them a serial# and tells them to go reboot it. Of coarse this is a VM and not a physical box and the serial# they were given was for the host. At no point did a light bulb go off for anyone involved in this clusterfuck.\n\nThe best part? This happened twice more before they realized that no one in this process could be trusted. The solution? Remove all serial #'s for hosts from the inventory so the process could not be followed. ",
        "created_utc": 1518837069,
        "upvote_ratio": ""
    },
    {
        "title": "My remote computer is slow!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y2gqa/my_remote_computer_is_slow/",
        "text": "[deleted]",
        "created_utc": 1518819954,
        "upvote_ratio": ""
    },
    {
        "title": "D'oh mail server setting change",
        "author": "kd1s",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y2cst/doh_mail_server_setting_change/",
        "text": "[removed]",
        "created_utc": 1518818988,
        "upvote_ratio": ""
    },
    {
        "title": "A TSTO error like I've never seen before! Or A Tale of the Fox and the Vegtable",
        "author": "Ofmiceandusers",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y1c7h/a_tsto_error_like_ive_never_seen_before_or_a_tale/",
        "text": "Players   \n\n&gt; **$Ofmiceandusers** - A Systems Engineer in charge of several physician clinics's network, workstations and everything associated with it. Also Me.\n\n&gt; **$Tooeducatedtobesmart** - An OBGYN who, for as well educated as they are, seems to have trouble with basic functions sometimes.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nThis tale starts at a fairly large OBGYN clinic, and I was making my rounds on the building as we had just given everyone e-mail. Now, most users were using the OWA rather than Outlook itself as that would be expensive but some users did have Office like the Administrators and Physicians because they get the best. I was making sure everyone was integrating properly with the typical \"How do I make a new e-mail?\", \"How do I log in?\" and \"How do I get to my e-mail again?\"\n\nBut one user in particular, in this case a physician, pulled me aside into their office and the conversation was as follows.\n\n&gt; **Tooeducatedtobesmart**: Oh hey *Ofmiceandusers*, I want to know. How do I read my email?  \n\nNow at this point, I had assumed they meant how do I open an e-mail, a simple enough task. I showed them how to open the e-mail but they repeated the question.\n\n&gt; **Ofmiceandusers**: W-well, after you double click on an e-mail you want to open it'll open up by itself, but it's easier to just click once and view it in the preview display to your right.\n\n&gt; **Tooeducatedtobesmart**: I got that, but how do I read it?!\n\n&gt; **Ofmiceandusers**: ...Just...look right there. *Points to where the previewer was displaying an e-mail* You can read it right there. \n\n\n$Tooeducatedtobesmart stared at the e-mail for about a full minute before a look of recognition overcame their face. \n\n&gt; **Tooeducatedtobesmart**: Oh! Ok! I figured it out. Thanks!\n\n\nAll the while, I could only think...were they asking me how to read English? Things like this are all too common it seems, with those that have obtained higher learning. ",
        "created_utc": 1518810231,
        "upvote_ratio": ""
    },
    {
        "title": "\"YOU are the ones who ruined my PC!!!\"",
        "author": "TyTyTuesdays",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y0w6x/you_are_the_ones_who_ruined_my_pc/",
        "text": "So, be me, working in desktop support. I get a call from someone who said they received a new PC but now can't find a printer to print to a PDF. Okay sure I can help. \n\n*30 seconds into call*\n\nMe: \"I'll have you navigate to a website when you're ready\" *remote support*\n\n*navigates her to website*\n\nHer: \"Okay I'm here.\"\n*needs to enter a name and key, blank page with only these two boxes*\n\nMe: \"Okay so your first name will be fine, and---\"\n\nHer: \"What!?\"\n\nMe: \"Oh, did you get to the website alright?\" *being very nice, just making sure we were on the same page*\n\nHer: *really sour tone* \"You know, I'm trying to follow your directions here and I'm getting pretty angry. YOU are the ones who ruined my PC, and I'm trying to follow your directions and you....*trails off*\"\n\n\nOnce I got connected, it turns out she needed to use the scroll bar to scroll over to find the printer she wanted. Really dude????\n\n\n\nSeriously I can handle idiots, I can handle high call volume, but I can NOT handle people who are rude as shit and immediately standoff-ish, when they are just plain wrong or blind. WTF???",
        "created_utc": 1518806576,
        "upvote_ratio": ""
    },
    {
        "title": "Just had a heart attack (an hour ago).",
        "author": "MiataCory",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y0nzs/just_had_a_heart_attack_an_hour_ago/",
        "text": "    Disclaimer: Not actual cardiac arrest. I lived.\n\nIt's Friday. Lunch is at noon. It's been a long week.\n\nAs I get up to my pre-lunch bathroom break, one of the ladies from the office stops me in the hallway. \n\n&gt;Hey, MiataCory, did you get the voicemail that I left you less than 20 seconds ago? The mailstation won't print again.\n\nGood news, this isn't a story about the printer. It's broke, I don't want to deal with it (second one that's broken in a month). That's for another day.\n\nAs I get back to my desk, it's 11:47. 13 minutes until the sweet release of Baked Ziti all over my mouth. Just gotta file a ticket with the MailStation supplier and I'll be on my way. \n\nBut what is this?!! Google isn't loading? You're not connected to the internet? Oh god no! Not on Friday! Windows is trying, I haven't touched the hardware. I crawl around to my 8-port switch and it's blinking away happily.\n\nThen I see the IP phone. It's off. PoE phone is completely off. This is... strange. Now I'm having complications. Now I'm having thoughts of one of our 2 switches in the server room being down for some reason. No one should be in there, what happened?! We're a small company and they won't let me buy a spare backup switch! This is bad!! It's lunch time I don't have time to diagnose a switch, and everyone's going to be PISSED that they can't get on facebook during lunch! The sky is falling and I just want to go hooommmeeee!!!\n\nSo, I grab my server-room-key and head off to the closet. On my way there, I get an idea. I check the phone on another desk that I know is plugged into the same switch as my line. Low and behold, it's on and working! \n\nThe network isn't down! The world is okay! It's just me! This is a problem I can deal with! Lunch is saved!\n\nLong story short: My phone died. Since it's the first link in my desktop-network chain (being the only PoE device, it's pass-through), everything downstream of it loses connectivity, which is why my internet cut out. \n\nHeart attack avoided. Phone bypassed. Lunch eaten. \n\nStill debating on if I want to get a replacement or not. \n\nDamn phones. ",
        "created_utc": 1518804755,
        "upvote_ratio": ""
    },
    {
        "title": "The pencil with invisible ink",
        "author": "TheGammel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y0cn6/the_pencil_with_invisible_ink/",
        "text": "[removed]",
        "created_utc": 1518802322,
        "upvote_ratio": ""
    },
    {
        "title": "What's notepad?",
        "author": "aducky18",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y06qb/whats_notepad/",
        "text": "So a little back story - The company I work for recently merged and the merging parties used different computer systems, 1/2 uses citrix on HP thin clients and the other 1/2 uses HP thick clients with regular windows 7. Because of this, there is always a little bit of confusion when the users go to different offices. This story made my head hit the desk almost literally. \n\n\n\nMe: obviously me on helpdesk\n\nIU: Idiot user\n\n\n\n&gt;Phone rings  \n&gt;Me: IT this is aducky18  \n&gt;IU: Hello, my citrix session is frozen and I need to check my email and read a PDF sent to me, can you help?  \n&gt;Me: Sure, just give me a second and I'll close out of your applications and log you off this particular citrix server, we're having a problem with it right now.  \n&gt;IE: Okay, thanks, I really need to read that PDF right now.  \n&gt;Me: Just one more second, I'm making sure you are off the server so when you open an application you will jump to a different server.  \n&gt;Me: Okay go ahead and open notepad. *when troubleshooting we always have users open either notepad or calculator first since they are the smallest application available and they get logged onto a citrix server much faster.*  \n&gt;IU: Notepad? What's Notepad? I'm not familiar with this application, can I check my email in it? I really need to read this PDF.  \n&gt;Me: Uhhh, it's notepad...like a stripped down version of word...you're just opening it so I can verify that you get onto a different server and so your citrix session opens faster...  \n&gt;IU: Well I need to check my email, why should I open notepad????  \n&gt;Me: Because it logs you onto the citrix server faster so your session can continue quicker *and because I asked you, you asshole*  \n&gt;IU: Well fine, I don't understand why I can't just open outlook, maybe the company needs to buy us better computers and stop cheaping out on internet connections and hardware, my last company wasn't like this.  \n&gt;At this point I start to argue with IU about how the company purchases what we are able to purchase and that his old company was about 100x larger than this one so it can't really be compared as far as budget limitations go. I also open notepad and then outlook for him since IU is too busy complaining about how \"cheap\" we are.  \n&gt;Me: Well outlook is open and I can open the PDF you spoke about, have a good day. *click*  \n&gt;Immediately called my manager and was told next time IU complains to ask them who their manager is so that my manager can have a talk about budgeting with them.  ",
        "created_utc": 1518801005,
        "upvote_ratio": ""
    },
    {
        "title": "\"You did WHAT on the production system?!?!?!\" (Or how to burn six digits in six seconds).",
        "author": "funtimeswithaix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7y01jo/you_did_what_on_the_production_system_or_how_to/",
        "text": "**Background**\n\nSo I work at a large software company, on a very... *unique* product. This product connects to the different software systems you run. It can monitor them in numerous ways, it can document, approval flow, and distribute changes to these systems, etc... \n\nOne of the things it also does is coordinate with the maker of the software. The product sends basic information automatically (can be disabled at customers discretion) like installed product versions, servernames/IPs, kernel/OS/DB info, etc... this allows us to proactively identify customers and contact them when we become aware of critical issues (example: Database corruption can happen if customer is Running Database A version B on OS C version D with parameter XYZ set to true). \n\nFor other customers, they contract work from us in a variety of ways. We create an order for the work in the backend, which is synchronized to the customer's frontend, and they can see the date, the status, etc. - and when the final report is available (documentation of what we did / documentation produced about the environment, configuration, issues, etc.) we upload it in our backend and it is synchronized to the frontend. This is a good approach because it ensures the documentation is linked to in a central place where it won't get lost between IT team/leadership changes and it provides transparency. It's also good because the cost of each document produced (in effort) is usually measurable in thousands of dollars, if not tens of thousands of dollars, and the value of most of the documents is long lasting (architecture/technical diagrams and documentation can be invaluable when you have an issue or are looking to upgrade or change a business process, etc. and actually understand it).\n\n**Enter the outsourcer**. \n\nThe outsourcer is a firm you've heard of (think \"nobody got fired for buying...\" territory), and they actually don't have a reputation for being generally bad. Like many things in life, there are good ones and bad ones at the outsourcer. The outsourcer in charge of the relevant team has a manager provided by the outsourcer who only visits the actual customer office *one week a month*. This means that his four onshore guys (not nearly enough for the application the customer was running) get virtually no oversight, and they're also worked to the bone (four is not enough people for what the customer ran, but customer dictated the budget). This means that the four onshore guys regularly need to push more onto the dozen or so offshore guys, who have much less experience and oversight.\n\n**The busy Wednesday**.\n\nThree projects are starting, management is pushing for a move from onsite hosting to a partner hosted hardware for the servers in addition to that, there's an upgrade of an existing system underway, and a monitoring effort that I am working on, along with the partner's guys. This leaves one of the most junior offshore resources with full administration rights in the monitoring/management application. Junior goes to one screen on the application and sees a dropdown with a lot of options. He decides to try to be helpful and clean that up, so he deletes it. It even asked him if he was sure!\n\nWhat junior somehow missed is that he deleted *X*, in an application called \"*X* Manager\". It is the central concept of how things are organized. Systems are put into it, the reports are in it, the different monitoring functionalities are hooked into it. Not only does the deletion of *X* remove all of those associations locally, it also is only supposed to be done when all the different systems within *X* are decommissioned. So this had the affect of sending a transmission back to the software company saying \"*hey, you don't have to worry about keeping all those reports anymore either*\".\n\nThe *good* news is that the monitoring of the applications from a technical perspective was not fully impacted. The *bad* news is that some other monitoring work was totally undone, and all of the documentation on how their environment worked and the key findings they paid for was destroyed irrevocably, as there was not a database backup that could be used (the one available was not recent enough for legal/audit to consider it acceptable from a SOX perspective). The documents themselves were flat files that could be saved to desktop, but that only did you good if you saved copies of the flat files in a reliable place instead of just clicking open.\n\n**Epilogue**: \n\nOffshore shielded each other. They were all working off of a single login ID in the admin application, so there was no way to identify who did it. The customer was livid of course and went for a pound of flesh under the threat of a lawsuit. The outsourcer agreed to increase the training for all of their resources. They also agreed to add 3 more people (nearly doubling the size of the relevant onsite team) to reduce their workload, so they could reactively address issues better and actually have the chance to breathe and work on some things *before* they broke.  \n\nThe estimated loss exceeded $500K - while some of the documents were \"point at time\" (*ABC* is broken, fix it by doing *XYZ*), others documented the complex logic on how custom code worked so it could be updated/changed consistently, and this was lost. Other work in setting the monitoring application back up also had a cost (resources/time). Going forward, the customer saved every report on a sharepoint as a secondary source and a folder on a network share with daily backups as a third source.\n\n**tl;dr**: Customer uses outsourcer, outsourcer gives rookie full admin rights on a key application, rookie deletes things in the application without knowing the impact, $500K+ of documentation lost irrevocably.",
        "created_utc": 1518799874,
        "upvote_ratio": ""
    },
    {
        "title": "Making a mountain out of a typo",
        "author": "syberghost",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xzc4i/making_a_mountain_out_of_a_typo/",
        "text": "USER opens a ticket stating \"L3 is down! We're dead in the water until you fix this, please make it your highest priority!\" and that's it, no other details.\nThat ticket queue goes to a handful of SA teams that collectively manage over 100K Linux/UNIX servers, and L3 is the largest test environment for most, so probably 20K servers to choose from across multiple data centers, not to mention we often get misdirected tickets for other SA teams (very large company with lots of large acquisitions, devops silos, etc), so without more information there's not much chance I'm narrowing this down without more information.\nIt's late afternoon on a Friday, but the ticket only came in 10 minutes ago, so I update it with a comment about 100K servers, then look the user (name isn't familiar) on IM.\nHe has been AFK 10 minutes, which means the moment he sent that ticket he either marked himself away manually, or locked his terminal manually. I hit him with \"yt?\" anyway, just in case, and then look up his manager; manager has been away for an hour.\nFortunately I recognize the manager's name and know he's with a project where I know who the test leads are, so I contact one who's online.\n\n&gt; me: any outages going on in L3? Maybe a server down or something?\n\n&gt; tl: nope, I'd know if there was something big, just the usual appdev issues.\n\n&gt; me: any of those that USER is supposed to be looking into?\n\n&gt; tl: actually yes, he's supposed to be looking into a problem on APPNAME.\n\nJackpot. I look up APPNAME and see it has a couple of L3 servers, so I log on and check them out. They look fine to me, but I notice that USER hasn't logged into either of them today, so I check the ssh logs.\n\nFailed login attempts for a nonexistent account with a name similar to his account. We have a winner. So I add an update to the ticket saying \"you're trying to log in as FOO, but your account name is actually BAR. Try again as BAR and you should be fine\" and I close the ticket.\n\nMonday I get an IM from USER.\n\n&gt; user: sorry i was afk, whats up\n\n&gt; me: Were you having trouble logging into SERVERS?\n\n&gt; user: yeah, did you fix that?\n\n&gt; me: did you get my email? I closed the ticket with notes about the problem.\n\n&gt; user: oh i don't read those what was the problem?\n\n&gt; me: you were trying to log in as FOO, your account name is BAR\n\n&gt; user: oh lol sorry, thanks i'll try that\n\nTime passes. syberghost works more tickets. Eventually Monday afternoon I get another IM.\n\n&gt; user: have you renamed my account yet?\n\n&gt; me: renamed what account?\n\n&gt; user: you said my account was BAR, have you renamed it to FOO yet?\n\n&gt; me: um, no, that's not something we do. BAR is the corporate standard, that's what your account has always been, you'll need to keep using that.\n\n&gt; user: oh ok, sorry again\n\nI logged into one of the SERVERS again at that point to check. His app had been down since Friday, and is still down. He logs in while I'm checking, and starts working on it.\n\nI logged off immediately so he wouldn't see me on the server if he found a problem.\n",
        "created_utc": 1518793942,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know how the world works",
        "author": "Thats_right_asshole",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xy62e/i_dont_know_how_the_world_works/",
        "text": "[removed]",
        "created_utc": 1518781023,
        "upvote_ratio": ""
    },
    {
        "title": "Super Important Critical Issue! as long as it requires no effort on my part.",
        "author": "zanfar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xwvmz/super_important_critical_issue_as_long_as_it/",
        "text": "**Backstory:** I'm the newbie network engineer learning the ins and outs of the network by feeding on small non-critical tickets. The company has a half-dozen groups whose products all require a different flavor of OS. Because of the disparate requirements, our (network) responsibility ends at the server hardware: the OS and anything it runs is **Not My Problem**. While on paper this seems very clear, in reality, the division of labor gets hazy somewhere around the NICs.\n\nNames and dates have been changed to protect the innocent.\n\n----\n\nI get an email from my boss; it's a forward from one of the other group's devop with a note from my boss:\n\n&gt; **$DevOp:** We do not have connectivity on eth1 of $RandomServer. The switchport is broken. Investigate and fix.\n\n&gt; **$Boss:** See what you can figure out, if it's a VLAN or shutdown issue, go ahead and fix it.\n\nCool beans, this is the kind of stuff I've been chomping at the bit to do. The very first thing I do is look up $RandomServer in inventory, and make sure I'm seeing traffic from the redundant connection--the MAC appears to have failed-over, so all is good. I then start to dig around, but before I can get very far, I get a phone call:\n\n&gt; **$devop:** [Ignoring my greeting] What's the status of $RandomServer?\n\n&gt; **$me:** I verified that your traffic has failed over to the other interface, so you shouldn't be in any immediate danger. Other than that, I can see that the primary port isn't connecting, but I'm still investigating.\n\n&gt; **$DevOp:** Well it needs to be fixed immediately.\n\n&gt; **$me:** Okay. I can assure you this has my priority until we get it figured out. Is this causing any downtime that I'm not aware of?\n\n&gt; **$DevOp:** Yes, we're stuck until we get that connection up; it needs to be fixed immediately.\n\n&gt; **$me:** Wow, I wasn't aware you guys had anything that was single-homed. I'll rope in a colleague and see if we can't get this expedited. I'll keep you in the loop via email.\n\n&gt; **$DevOp:** Whatever, just get it fixed.\n\nSo I grab my coworker who has a little more experience--and access--to the server side of things and we quickly rule out the network or the config. It looks like this is a bad DAC cable. Unfortunately, this server is in a data center four states away. In this situation, we can overnight parts and pay the datacenter techs to install it. This is a huge inconvenience for Reasons, and obviously a non-zero cost.\n\n**But Wait, There's More!** $OtherEngineers' family lives in the same city, so he stops by and takes care of any non-critical maintenance 3-4 times a year on his way out to birthdays or Christmas. He is, in fact, heading out there in 10 days for $Event. After speaking to him, he's happy to interrupt his vacation with a site visit.\n\nSo after conferring with $Boss, I call $DevOp:\n\n&gt; **$me:** Hey $devop, I just want to confirm that this is an emergency situation. We can get this fixed tomorrow, but it's gonna cost. However, if you can wait 10 days, $OtherEngineer will take care of it on his way to $Event. I can see your (one) MAC on the other interface, so as far as I can tell, this can wait a few days.\n\n&gt; **$DevOp:** Yes! I told you we can't do anything with that port down. It needs to get fixed ASAP.\n\n&gt; **$me:** Okay, I'll call your manager and get the approval.\n\nSo I call $DevOp's manager because I can't authorize that expense, and it will get billed to his department:\n\n&gt; **$me:** Hey $DevOpMgr, looks like we found the problem, we'll need to overnight and remote-hands the fix. It won't be cheap, so I just need to verify that you're okay with that expense. If you want to go through with it, it can probably be back up before noon tomorrow.\n\n*Note:* It is entirely **Not Our Fault** that they have any downtime. If they failed to make use of the redundant network connections we provide (in your choice of 5 flavors), that's on them. However, we like to be good neighbors so we're **On It**, so to speak.\n\n&gt; **$DevOpMgr:** Noon! We're going to be down for more than 24 hours! This is unacceptable, you need to fix it faster.\n\n&gt; **$me:** [Apology] [Explaination] [Laws of Physics] [Not Our Problem]. Like I said, I am sorry about the downtime, but this is absolutely the fastest we can fix it. We would be happy to work with you to prevent this in the future, but in the meantime, I need your authorization.\n\n&gt; **$DevOpMgr:** Fine! Get it done.\n\n&gt; **$me:** Thank you, I'll CC you on anything involving this issue, and try to keep you updated via email.\n\n&gt; **$DevOpMgr:** *humph* [click]\n\nIn the next 15 minutes, I get my coworker with the AmEx to buy and ship the cable, send the recording of $DevOpMgr with the expense report to finance, and submit a smart-hands ticket to the NOC. I also send a status update to $DevOp, $DevOpMgr, and $Boss, while thanking $OtherEngineer for the offer, but we're not going to interrupt his vacation after all.\n\nCue the next morning. I'm tracking the shipment every 10 minutes, and in a rare stroke of luck, it arrives before 10 AM. I'm on the phone with remote hands shortly walking them through the replacement. By 11:00, I can see the port come back up on the switch, and the MAC flips back to the primary port. All should be well in Narnia.\n\nAnother status email goes to everyone informing them of the fix, that we no longer see the problem on our end, and let us know if there are further problems. I also follow-up via phone, but $DevOp is out today (huh?) and $DevOpMgr isn't answering his phone. I leave voicemails, update $Boss, and head up to the third floor because today HR thinks that free ice cream will make us forget about the lack of organization and competitive pay in the company.\n\nI promptly forget about the issue completely.\n\n----\n\nA few days later, I'm reminded of the snafu when recapping the week's activities during our sometimes-weekly networks meeting. I suggest that maybe (maybe) we have just a little more input--or at least visibility--on how the network gets used. Failing to *use* a provided redundancy seems to be criminally negligent for a critical piece of infrastructure. $Boss agrees, and we hook up after the meeting to do some investigation. We discovered:\n\n* $RandomServer was part of a hardware refresh--new hardware meant to take over from some servers who are about to be decommissioned\n* Our group *is* responsible for providing that hardware in a working state--three months from now\n* We have a visit scheduled to that data center in 6 weeks to install that hardware, but $OtherEngineer, on a visit home two weeks ago, staged the hardware we had \"in stock\" so we didn't have to worry about shipping them.\n* $OtherEngineer, being a nice guy, told $DevOp that the servers were installed, but not verified if they wanted to get a head start on configuration\n\nSo, in short, I spent half a day along with several hours of my coworkers time chasing down an \"emergency issue\" on equipment that was not in production, was not promised in any working state, and had two scheduled maintenance windows before the go-live date.\n\nOh yeah, and the problem $DevOp had that he couldn't get working with only one interface? Bonding the two interfaces for redundancy.\n\n----\n\nEdit: ELI5 version [here](https://www.reddit.com/r/talesfromtechsupport/comments/7xwvmz/super_important_critical_issue_as_long_as_it/dud5d1u/)",
        "created_utc": 1518761918,
        "upvote_ratio": ""
    },
    {
        "title": "(old story) why a technician no longer uses the term \"smoke test\"",
        "author": "tomytronics",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xwqap/old_story_why_a_technician_no_longer_uses_the/",
        "text": "I read this in a magazine long ago, I can't remember the name of it but it happened in 80s when a technician was sent to service a company's mainframe. The magazine was printed in early 90s IIRC and typically covered electronics and industrial technology including the big computer systems that were still used by business.\n\nThere was some issues with hard drive, which was rather big physically and very heavy at the time, plus they ran on either 110v or 220v. After checking and verifying the issues were resolved, the technician thought he would help save time by reinstalling the hard drive on the rack backward so all the cables would be brought to the front, and no one would have to pull out and remove a 50-lbs hard drive for checking loose or broken cabling.\n\nAll looked good after he was done putting the system back together and said time for smoke test. Upon powering the system, there was a boom and lots of smoke. When he checked, the power cable to the hard drive had vaporized, leaving beads of melted metal. After checking around, he realized when he turned the hard drive around and put it back in, he pinched the power cable against the metal frame and shorted it out. 110v or 220v AC wires do not take kindly to getting pinched at all.\n\nAfter replacing the melted power cable, he put the hard drive back the \"right way\" in to avoid pinching the wires, the computer powered up and was fine. Lucky for him, and he had quit using the term smoke test after that scary test.\n\n(if anyone finds this story familiar and knows what magazine it came from, please LMK so this article can be credited properly)",
        "created_utc": 1518760022,
        "upvote_ratio": ""
    },
    {
        "title": "[old story] why a technician no longer uses the term \"smoke test\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xwojx/old_story_why_a_technician_no_longer_uses_the/",
        "text": "[removed]",
        "created_utc": 1518759412,
        "upvote_ratio": ""
    },
    {
        "title": "I guess I am the new admin for my crazy drunk neighbors?",
        "author": "adheisler11",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xwgj6/i_guess_i_am_the_new_admin_for_my_crazy_drunk/",
        "text": "[removed]",
        "created_utc": 1518756815,
        "upvote_ratio": ""
    },
    {
        "title": "ID-10-T ERROR encountered",
        "author": "TxTemplar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xwcj9/id10t_error_encountered/",
        "text": "Long time lurker, first time poster, so please forgive any mistakes. Also on mobile, so formatting might suck.\n\nSo I'm a hardware field tech for a global company. We have many different contracts, but one in particular that is the bane of my existence. \n\n$me: obvious\n$user: clueless user. Still uses hunt and peck when typing, and has a very skewed understanding of computers. I have personally coached him on various aspects of using these computers.\n\nSo I receive the ticket, and look it up in the system. The issue listed is no sound. I call $user and let him know I'm in route. Service contract states normal business hours, next business day, so anytime 8-5 is acceptable.\n\n$user: I was told by the service desk that you would be here first thing in the morning. Where are you?! It's 10:00.\n\n$me: $user, we have gone over this several times. The service desk is unable to make appointments, that is why we call when we are headed your way.\n\n$user: that is unacceptable! I should be able to get service whenever I want.\n\n$me: I know $user. That is why I am calling you now. I'm assuming it's okay to head your way?\n\n$user: yes, but you have to hurry. I have another appointment in an hour and a half.\n\nI arrive 30 minutes later. Factoring in traffic, this is a decent time. \n\n$user: oh my gosh! You have to hurry! My other appointment is in 10 minutes!\n\n$me:...\n\nSo I start diagnosing the problem. The setup he has allows his phone to dial through the PC. Once his sound quit working, his company sent him a whole bunch of replacement equipment, which he hooked up himself. The first thing that I noticed, was that the speakers were plugged into the back speaker port, and the headphones for his phone were plugged into the front speaker port. From previous experience, I know that this is incorrect. I unplug his headphones, and what do you know the computers sound starts working. Of course this disabled his headphones which was unacceptable, because who actually holds the phone, am I right?\n\nI start troubleshooting the phone setup, and I am thoroughly stumped. Everything is plugged in correctly (at this point), so I switch it out for some of the old equipment. Same issue. Then I remember that they bought the upgraded equipment, and it no longer runs off of DC power, but batteries instead. I open up the battery compartment, and lo and behold, the batteries were facing the wrong way. I swap them around and now the headphones work. Now I'm done! Nope, $user didn't list all of the issues in the ticket. He chooses now to tell me his fax line isn't working, and he can no longer email scanned documents. I choose to tackle the emails first.\n\n$me: $user, can you show me how you normally email the document?\n\n$user: yeah but it won't work. I tried it before you got here.\n\n$me: that's okay, try it anyway.\n\nHe scans the document, clicks on send as attachment, and the Outlook message pops up.\n\n$user: see! I have no contacts!\n\nI click the dropdown menu, and change the selection from \"Offline global contacts\" to \"$user@company.com local address book\". Contacts appear. I have him click on the \"To:\" box and start typing in an address, which of course Auto completes.\n\n$user: It's only working because you're here, and this is the first time I've been able to type in the box!\n\nI then start troubleshooting the fax line, and eventually verify that the phone jack that it plugs into is bad. \n\n$user: how long will it take you to fix that?\n\n$me: ... We are not allowed to fix those. You will have to call your service provider.\n\n$user: but how am I supposed to work without a fax machine? It will take the service provider way too long to get out here.\n\n$me: sorry but my best advice is to swap lines when you need to send a fax. That way you can have your phone on most of the time, and only take it down when a fax needs to go out.\n\n$user: but that is way too complicated for me to do, that's why I called you.\n\nAs I'm walking away, $me: You'll be fine $user. I better get going before your next appointment...",
        "created_utc": 1518755480,
        "upvote_ratio": ""
    },
    {
        "title": "Wait, which tool?",
        "author": "zupernam",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xv45s/wait_which_tool/",
        "text": "My dad told me this story recently, from his time at a large software development company.\n\nThe company's building was very large, and there were lots of network problems when trying to access servers. Due to location, \na request would have to go through a long chain of switches to reach them. So he used Perl to make a little script that would list every step a request took on its way to the server, and showed a simple visual representation of the speed of each step. This helped find the source of the problems, often just that one switch along the path was very busy at the time. After using his script for a while, he showed it to a few others to help them out. No big deal, right?\n\nOne day his boss talks to him and says \"Hey man, everybody's saying your tool is down. Could you fix it?\"\n\n\"Uhh, what tool?\" was his reply, thinking that something major might be broken. \n\n\"Your network thing, something broke it,\" the boss said.\n\n\"Oh, that? I just typed that up for myself a while ago,\" he said, relieved.\n\n\"Could you fix it? Everyone's been using it.\"\n\nEventually that tool was rewritten in C++ and packaged for company usage.",
        "created_utc": 1518742622,
        "upvote_ratio": ""
    },
    {
        "title": "It's just a little smoke, now and again.",
        "author": "Boofrick",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xusjo/its_just_a_little_smoke_now_and_again/",
        "text": "&gt;Client: We had lightning last night and my computer was smoking.\n\n&gt;Me: Did you unplug the computer?\n\n&gt;Client: No, it's working fine, just a little smoke now and again.\n\n&gt;Me: Shut it down right now, and unplug it!\n\n&gt;Client: Why?  It's working fine.\n\n&gt;Me: Please, just do it!\n\nHe did it, but I had to explain why.",
        "created_utc": 1518739623,
        "upvote_ratio": ""
    },
    {
        "title": "Client: -2 ISP: -1 Me: Tired of st*pid people.",
        "author": "Boofrick",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xufrl/client_2_isp_1_me_tired_of_stpid_people/",
        "text": "&gt;Client: Our Internet is not working.  Can you come right away?  \n\n&gt;Me: Sure, I'll be there in ten minutes.  \n\nI get to their house, and both husband and wife are upset.  I do the usual reboot the router thing.  Their computers say that they are on the Internet, but no webpages will load.  Same with my phone.  I follow all the network cables, then even go outside to check the Internet radio module.  All looks OK.  \n\n&gt;Me: I'm going to call your ISP to see if they can figure out what's wrong.  Can you find the latest bill from the ISP, so I know what your customer number is?  \n\n&gt;Wife: Husband, where is it?  \n\n&gt;Husband: We switched companies, and they didn't send us a bill.  \n\n&gt;Me: Did you call the the ISP to tell them this?\n\n&gt;Husband: No.\n\n&gt;Me: When was the last time you paid the bill?  \n\n&gt;Husband: They didn't send us a bill.  \n\n&gt;Me: Are you saying that you haven't paid them at all?\n\n&gt;Husband: They didn't send us a bill!!!  \n\n&gt;Me: Call the ISP right now and deal with it.  \n\nIt turns out that when they signed up with the new ISP, they told the new ISP to send the bills to the e-mail address they had with the old ISP (ie. client &lt;at&gt; oldISP.com).  That address was cancelled, of course.  The new ISP never bothered to phone the client when their e-mails to the client bounced, and they eventually disabled the Internet.  \n",
        "created_utc": 1518736309,
        "upvote_ratio": ""
    },
    {
        "title": "More construction client IT short stories",
        "author": "lesethx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xubxq/more_construction_client_it_short_stories/",
        "text": "[removed]",
        "created_utc": 1518735351,
        "upvote_ratio": ""
    },
    {
        "title": "Ich kann nicht installieren!",
        "author": "EOverM",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xtnmc/ich_kann_nicht_installieren/",
        "text": "[removed]",
        "created_utc": 1518729601,
        "upvote_ratio": ""
    },
    {
        "title": "\"Well it sounds like you should really send those slides soon, ma'am.\"",
        "author": "wittyname83",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xtevr/well_it_sounds_like_you_should_really_send_those/",
        "text": "Working on an email server over the weekend, I messed up one of the filter rules. I own that. My bad. And I fixed it early Monday morning as I was getting a deluge of emails to our service box asking what the hell was going wrong.\n\nCrisis averted, everything in quarantine was reviewed and released, people got their emails. Back to Reddit.\n\n*ping*\n\n&gt; Subj: URGENT! Slides 3 of 4 haven't gotten to users!! \n\n&gt; Body: We have confirmed that only one of the attachments on this email got to the following users: [UserA] [UserB]. This is urgent and they need the second attachment to be sent to them in the next 20 minutes!! Please push through ASAP!\n\nOh. That sounds serious. I look into the quarantine and sure enough, the email in question was already released in the morning. And it only had one attachment, not two. \n\n&gt;Subj: Re: Urgent!\n\n&gt;Body: Ma'am, Only one attachment was on the email you listed and requested to be released. Please email them the other attachment ASAP. Regards, IT\n\nUnfortunately I don't have an update other than she hasn't sent another email since she talked to me. Guess it wasn't that urgent (or someone else sent it, I dunno).",
        "created_utc": 1518727603,
        "upvote_ratio": ""
    },
    {
        "title": "Scanning ... what?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xta5l/scanning_what/",
        "text": "Client says that the printer will print, but suddenly will not scan.  I'm helping by remote control.  First I run a test print, then ...  \n\n&gt; Me: OK, now please put a paper on the scanner.  Preferably with something on it!  Ha ha!  \n\n&gt; Her: Um, let me find something.  \n\nThree minutes later.  \n\n&gt; Her: OK.  \n\n&gt; Me: Ready to scan?  \n\n&gt; Her: Yes.  \n\nI start the scan.  \n\n&gt; Me: Do you hear it scanning?  \n\n&gt; Her: Yes.  \n\n&gt; Me: That's good.  OK, well something is definitely wrong, the scan is blank.  \n\n&gt; Her: Um... I put a blank page on the scanner.  Should I put the test print on the scanner?  \n\n&gt; Me: Yes, please.  Face down.  \n\nScan works OK.  I have no idea why she couldn't scan.  \n\nEdit: She doesn't do the scanning.  Her husband does, but for some reason he always gets her to call me for help.  He wasn't available to talk to.",
        "created_utc": 1518726528,
        "upvote_ratio": ""
    },
    {
        "title": "Cellular WiFi hotspot Recursion",
        "author": "layer8err",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xsow9/cellular_wifi_hotspot_recursion/",
        "text": "[removed]",
        "created_utc": 1518721758,
        "upvote_ratio": ""
    },
    {
        "title": "Help! BSOD?",
        "author": "Twitch8605",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xsjmr/help_bsod/",
        "text": "**I had a fairly frantic call about a BSOD on an end users computer... it went as follows:**\n\n**$EndUser:** Can you look at my computer and see why it keeps 'blue screening'?\n\n**$TechSup:** Sure, let me remote in and see (User works remotely), I see nothing wrong.\n\n**$EndUser:** That's because it's not on the laptop dock, whenever I dock it, it goes blue.\n\n**$TechSup:** Ok, while I am remoted in, go ahead and dock it\n\n*(User docks Laptop)*\n\n**$EndUser:** See! See! It did it again!\n\n**$TechSup:** I am still seeing your desktop\n\n**$EndUser:** Well on the laptop it's fine, but the extra monitor is blue\n\n**$TechSup:** Your desktop background is blue, the 'blue' monitor is just displaying the wallpaper without any icons.\n\n**$EndUser:** So how do we fix it?\n\n**$TechSup:** ..............\n",
        "created_utc": 1518720570,
        "upvote_ratio": ""
    },
    {
        "title": "The SAN is down, and so is the installer",
        "author": "syberghost",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xrzif/the_san_is_down_and_so_is_the_installer/",
        "text": "I was inspired to recount this tale by  https://www.reddit.com/r/talesfromtechsupport/comments/7xruml/the_time_i_nearly_killed_myself/\n\nWe have a tremendous amount of SAN equipment from one of the largest players in the market, I'll call them Spumco. The other key player in this story is a field engineer from Spumco, I'll call REP.\n\nOne of the Spumco arrays dialed home because it had a battery going out. Spumco wanted to replace it. Our management wanted to make a gigantic production of this, summoning every affected application owner (this would have been hundreds of managers, most of whom would have wanted at least one technical lead from their team), scheduling for the middle of the night on a weekend, shutting down all applications, etc., but Spumco assured us that there are two batteries, the other one is completely nominal, the system only needs one battery to function, and it's all hot swappable.\n\nEverybody in IT was onboard with live replacement during the day, and we went to bat for Spumco, convincing multiple VPs. Finally the day came and REP walked into the data center, with a couple of our hardware folks in tow.\n\nThe battery was at the bottom of the array, and so REP sat down and, upon receiving the go, pulled gently on the handles.\n\nThe arc made a sound like a gunshot, taking the array out instantly. Later many parts would have to be replaced. The battery struck REP in the chest with enough force to knock him backwards into the rack behind him, and left him dazed for several minutes, but basically unhurt.\n\nMany parts were replaced, the array took many hours to recover almost all of the data (some transactions still in RAM were obviously lost), and for a very long time we lost the ability to schedule SAN hardware work of any kind (including hot swappable drive replacements) during business hours; which is a dicey proposition as we're a global megacorp doing business in literally every country and thus \"business hours\" are pretty much defined as \"between 00:00 and 23:59:59 on days with a Y in them\".\n",
        "created_utc": 1518716113,
        "upvote_ratio": ""
    },
    {
        "title": "See?! They're not there!!",
        "author": "Samanthah516",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xrvgv/see_theyre_not_there/",
        "text": "Hey everyone. Got another one for you guys today. \n\n$Me: well...me obviously lol \n$IU: Irritated user\n\n$Me: Thank you for calling IT! How can I help you?\n\n$IU: **Yes this is the 5th time calling today and i need help with this. I can't view any files on my share drive**\n\n$Me: I completely understand. May I remote in?\n\n$IU: **Sure go ahead.**\n\nI remote in and can get into the shared drive in question and can see files on the left side just fine. User then moves the cursor over to show the message \"The files cannot be previewed.\" Mind you I haven't selected a folder/file at all I've just opened the drive.\n\n$IU: **See?! The files aren't there!!**\n\n$Me:..........\n\nI show her that her files need to be clicked before they can be previewed. She then makes me stay on the phone for a few minutes so that she can view/open/print other files. She can but as I'm watching her she continues to say how much they're \"not there\"\n\n-sigh- users......\n\nTLDR: User says files aren't there, but doesn't click to view them first......\n",
        "created_utc": 1518715225,
        "upvote_ratio": ""
    },
    {
        "title": "The time I nearly killed myself",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xruml/the_time_i_nearly_killed_myself/",
        "text": "A few years ago, working desktop support, every desk had a riser module with network, phone and four plug sockets. These plugged into the wall, and acted as a 4 way split, so were fused with 13 Amp fuses.\n\nOne day, we get a call that a user's phone (VOIP with PoE) is still working but the PC has shut off, and won't go back on. Typically, this was the fuse in the riser. They weren't the best made pieces of kit, and used to blow occasionally.\n\nSo a colleague and I go to check. I draw the short straw, and crawl under the desks, tracing the power cable back to the wall. I switch it off at the plug (you can do that on UK plugs), and get back up to change the fuse.\n\nI whip my Leatherman (other multitools are available) off my belt, and unscrew the fuse holder. Sure enough, the fuse has blown - properly blown, leaving shards of metal and glass in the holder. So I dig the pliers of the Leatherman into the hole to fish out the broken fuse bits.\n\nI remember a huge bang. Then I woke up lying on the floor.\n\nLoads of people crowding round me, asking if I'm ok. I'm more concerned as to where my Leatherman's got to. That was a present from my wife, and I've worn it on my belt every day for 15 years. It was eventually found in the ceiling void, having punctured a hole in the polystyrene tile on its way up.\n\nTurns out my cable tracing was erroneous. I'd turned off the plugs for another desk, but it was someone who was away that day, so no-one complained.\n\nAfter that, our boss bought us a voltage tester.",
        "created_utc": 1518715044,
        "upvote_ratio": ""
    },
    {
        "title": "How to almost shut down an international corp.",
        "author": "Unterdosis",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xrmjb/how_to_almost_shut_down_an_international_corp/",
        "text": "This has happened quite some while ago, I think it's okay to post it here. All details have been changed as much as possible without hurting the storyline. However, if you recognize the company please remain silent forever.  \n  \nSo I was working at an international corporation. With international, I mean this company has over 50k employees and branches in 40 countries.  \n  \nOf course a company like this uses email. And of course a company this size has their own Exchange-Servers and specialized admins caring for them.  \n  \nSo far for the background. Now please have a seat, grab your popcorn and forgive me for sucking at reddit formatting, I'll try to make up with the actual content.  \n  \n  \nNarrator:  \n*Some generic IT office somewhere in western Europe. Our Hero, Unterdosis, has just finished some ticket when an email arrives that catches his attention.*  \n  \nUD: \"Hey Tom, what mailing list is $name?\"  \nTom: \"No idea. Why?\"  \nUD: \"I just got a weird email just saying 'test', and I got it because apparently I'm on this mailing list, which I've never heard of.\"  \nTom: \"Beats me. But it seems like someone is testing something, if you ask me.\"  \nUD: \"Yeah, thanks for the info, what would I do without you.\"  \n  \n*Our hero thinks about his options for a moment, then decides he will just reply to the original sender and find out what this is all about. So he types 'gotcha' or something along those lines. While doing so, he already hears the notification for new mail. He sends out his mail and checks his inbox.*  \n  \nUD: \"....oh. It seems like I wasn't the only one who got this test message. $SoAndSo just hit \"reply All\", obviously, and confirmed he got it.\"  \n  \n*The IT Team snickers in the background.*\n\nTom: \"Yeah, I just got the same email as you. And his reply as well. When will people finally learn not to hit 'reply all' when a mailing list is involved...\"  \nUD: \"Prolly the day they learn to read error messages.\"  \n  \n*Work commences, or at least the team tries to - however, suddenly everyones mailbox fills up with replies-to-all.*  \n  \nUD: \"Wow, people are stupid.\"  \nTom: \"Word. But look, this mailing list seems to be everyone in $our_country. Those are people from $Site1, there is $Site3, this guy I think works for corporate in $HQ_town...\"  \nUD: \"...and I just got a reply from China... hey, Tom... do you think...\"  \nTom: ( ⚆ _ ⚆ )  \n\nUD: \"...that this could be a mailing list containing the whole company?\"  \nTom: \"Uh.... oh.\"  \nKenny: \"Great, now the people are not only replying to the whole list to confirm they got the email, now the first ones are replying to all complaining they want to get off that list...\"  \nBig_IT_Boss: \"We should fire everyone immediately who complains about mailing list spam by replying to the whole list.\"  \n  \nAnd in the following hours, chaos ensued. Think about your users. What would you say, how many would hit 'reply all' - 10%, 30%, 50%?  \nWell, I don't know either. All I know is that even 1% for our company meant that about 7k messages got sent to 70k recipients. Even if it was only one user, the power of his simple email would be multiplied by the power of an angry, 70k recipients strong mailing list.  \n  \nPersonally, I received about 400 or 500 emails over the course of 2 hours or so. First, the time stamps were only a minute old or so. Then, it was 10 minutes. 15 minutes. 20 minutes.  \n  \nThis went until 3pm or so, when obviously someone pulled some plug somewhere. No more mails. Not even from the ticket system.  \n  \nIt took around 30 more minutes until email worked again. Slowly, but it worked, and we got no more replies to the test mail.  \n  \nRumor has it our Exchange-team had a new hire and told him or her to check this specific mailing list. Specifically, he or she should check permissions - even more specific, he or she should check if really only authorized persons would be allowed to write to this mailing list.  \n  \nWhat would Jesus do? Well, the new hire send an email containing \"test\" to this mailing list. And the rest... is history. At least in that companies IT-department now :)\n\n\n  \nAnd that's what it was.\n",
        "created_utc": 1518713243,
        "upvote_ratio": ""
    },
    {
        "title": "\"I can't find where to enter my Social Snack Number...\"",
        "author": "Onii_Trap",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xrasz/i_cant_find_where_to_enter_my_social_snack_number/",
        "text": "**TL;DR** - Long time reader, First Time poster - bear with me here as I describe my first tfts story. \n\n*I manage helpdesk and train new student workers at a college, on top of being part of multiple projects that include Workflow, etc.* \n\nHigher education is..***fun***, to say the least. \n\nOur Actors:\n\n**$Me** - Yours Truly\n\n**$Snack** - Student\n\n&gt;**Phone:** Ring ring, ring ring.\n\n\n**$Me:** ~~Getting off reddit~~ *Responding immediately to the call.*\n\n\n&gt;**$Me:** \"Hello College, how may we help you?\"\n\n\n&gt;**$Snack:** \"Yeah, I can't find the location to put my Social Snack Number in the &lt;REDACTED APPLICATION&gt;\n (This is word for word btw)\"\n\n\n&gt;**$Me:** *Freeze Frame, mute phone, chuckle, unmute.* \"Sorry sir, but could you repeat that?\"\n\n\n&gt;**$Snack:** \"Did you not hear me? My Social Snack Number!\" *Keep in mind, this guy sounded pretty out of it. I felt for him, as i've been a college student before.*\n\n\n&gt;**$Me:** \"Sir, I think you might mean a Social Security Number, not a Social Snack Number.\"\n\n\n*Light Pause, slight cough and chuckle - then a eruption of laughter*\n\n\n&gt;**$Snack:** \"Oh yeah, you're right. Where do I put that? Oh wait, I see it right here, in this &lt;SECTION&gt;! Thanks for your time.\"\n\n\n*Standard Goodbyes and such.*\n\n\nAll in all, I'd rather have calls like these rather than the calls from Angry M.O.M.s\n\n\n***EDIT: Clean-up Crew - Changed Social SNACK Number to Social Security Number.***\n",
        "created_utc": 1518710540,
        "upvote_ratio": ""
    },
    {
        "title": "Your software is Skynet",
        "author": "noizes",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xr87b/your_software_is_skynet/",
        "text": "[removed]",
        "created_utc": 1518709909,
        "upvote_ratio": ""
    },
    {
        "title": "Conning Our Kevin Into The Hard Work",
        "author": "SnArL817",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xr6u6/conning_our_kevin_into_the_hard_work/",
        "text": "So, purchasing needs us to gather a list of all of our RedHat hosts, the number of CPUs, and if they're virtual, the number of CPUs in the physical host. This is so that they can look at our license counts and determine if individual licenses are cheaper than a datacenter license for the physical hosts.  \n  \nWe have hundreds of VMs, and about 50 bare metal servers. None of this crap is documented. When the boss man asks for volunteers, NOBODY steps up. People are looking at me. The network admin helpfully says, \"Well, this can be divided up.\"  \n  \nTHAT GUY, my team's [Kevin](https://www.reddit.com/r/StoriesAboutKevin/), is able to do math. 50 is MUCH LESS than the hundreds of virtual servers we have.  I say, \"Well, if someone can do the physical hosts, I guess I can get all of the virtuals.\" Kevin then takes the bait. \"I'll get the physical servers.\"  \n  \nWe have a mere 3 days to get this data. I chill out and do nothing for the first day. Kevin is having to login to EACH server and find out how many CPUs it has. Yesterday, before I go home, I login to vCenter, and pull the complete list of VMs from the datacenter. Copy, paste, and run it through awk to format it, and now I have a CSV file. I sent it to my boss. Total time spent on my part, less than 5 minutes.  \n  \n  \nKevin is STILL logging into servers.",
        "created_utc": 1518709585,
        "upvote_ratio": ""
    },
    {
        "title": "Oh god, that's not the hole that goes in! Or The day I shut down an entire office",
        "author": "Ofmiceandusers",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xr6te/oh_god_thats_not_the_hole_that_goes_in_or_the_day/",
        "text": "&gt; **$Ofmiceandusers** - A Systems Engineer in charge of several physician clinics's network, workstations and everything associated with it. Also Me.\n\n\n&gt;&gt; **$OfficeBoss** - A CEO of a decent to do clinic that specializes in pain management and rehabilitation. A good grasp on English but not their first language. \n\n~~~~~~~~~~~~~~~~~~~~~~\n\nSo, in this particular tale, I was onsite trying to fix a dvr for the camera system at this particular location; it was suspected to be a DNS issue and was later resolved by rebuilding the IP infrastructure on a p2p system rather than using DNS. But, this will be pretty short compared to my last tales.\n\nDuring the middle of all of that, I was working on changing some things from one switch to another when I accidentally pulled the cable from the modem to the firewall instead due to a mismatched cord. \n\nImmediately, I could hear the office in an uproar as people called for my name. \n\n&gt; **$Officeboss:** *$Ofmiceandusers* heeelllp! Zee intahnets not working! You fiiix it? \n\nAs i'm already in the process of doing so, I gave her an honest answer when probed about what happened and she nodded, accidents happen. Now, I hooked everything back up just before the accident happened and had tried power cycling the modem, the firewall and everything. Nothing works and I'm freaking out since I've had no less than ten people to come ask me (in a two minute interval) when the internet's going to be back up. \n\nWhen I set the workstation I was using into the firewall and the modem at several points to check on internals, everything appeared normal.\n\nWhen nothing I tried worked, I had to hang my head in shame, call my boss and he walked me through the Exact. Same. Steps. I. Did. and what do you know? It worked. To this day, I will always hold it as a lesson in humility. The only thing I could ever think was I didn't powercycle long enough on something. ",
        "created_utc": 1518709581,
        "upvote_ratio": ""
    },
    {
        "title": "Principle of Least Privilege - The Tale of the Broken Terminal Server",
        "author": "iammandalore",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xr3bv/principle_of_least_privilege_the_tale_of_the/",
        "text": "This tale of woe is from my previous company, providing managed IT for small financial institutions.  Shortly after lunch I (level 2 helpdesk) fielded a call from a customer saying they were getting weird error messages on the terminal server and were unable to work.  I started getting a ticket entered and started the process of getting remoted in when I started hearing other techs taking similar calls from the same customer.  I let everyone know I was on it and took ownership.\n\nI got remoted into the TS and asked the person on the line to tell me more about what was going on.  They were getting weird error messages in their line-of-business software, which opened fine for me under my login.  I had them close the software and re-open it.  The response was a popup message saying Windows didn't know how to open the file, and asking the user what program they'd like to use to open it.\n\nWell that's... odd.  It works fine for me.  Other users are reporting the same message, but not just on the LoB software.  Outlook, IE, everything.  I'd seen similar problems caused by malware screwing up file associations, and looked into the registry for any trace of those problems.  I found nothing of the sort, and most malware shouldn't have been able to spread past an individual user profile anyway.  The problem was clearly with the registry, but it all looked fine at first glance.  I got an idea and created a new test user, logged into the TS, and had the same problems.  Did a quick check and found the source of the problem.  After scouring audit logs and talking to a couple people (including the customer's own internal IT guy) the problem became clear.\n\n-------------\n\nThe problem ended up being that Mr. Wanna-Be IT Guy must have recently heard about the principle of least privilege and decided to apply it, and failed spectacularly.  While it's a great principle to keep in mind and implement, perhaps removing read access from HKEY_CLASSES_ROOT and some other registry hives for all but domain admins isn't the best idea in the world.  As it turns out, there's important information in those hives, such as HOW TO OPEN FILES.  If Windows can't access the registry key that tells it how to open .exe files (or anything else for that matter), it just shrugs and asks the user.",
        "created_utc": 1518708710,
        "upvote_ratio": ""
    },
    {
        "title": "\"Thanks for your help that fixed it\"",
        "author": "Pixelplanet5",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xqim6/thanks_for_your_help_that_fixed_it/",
        "text": "So this happened just about right now and my first though was that this will be a good story for here so im obviously writing this in my working time.\n\nI was contacted by a user yesterday because of an issue with a software we use, first i explained the normal way to handle this kind of process and everything was fine for the user.\n\nan hour later i get an email that there is a problem and the IT already knows about this since months but \"didnt do anything\"\n\ni have to admit this is partially correct as i immediately remembered that there is a problem with a specific set of user permissions that blocks some functions, i know about this since half a year and escalated it but nothing was done so far.\n\nSo today i write an email explaining why this is happening and that i can manually change the user permissions back and forth whenever one of two functions is needed because removing the permission constraint also removes permissions that are required for everyday work.\n\nemail send out before lunch and right after lunch a two hour conference call that ended just now and right as i wanted to get into changing the authorizations i get an email.\n\n\"Thanks for your help that fixed it\"\n\ni didnt even do anything yet and now im scared to do the change because who knows what they have done to make it work.\n\nEDIT:\ni did some research and found out what happened.\n\nIt seems like i already did the permission change to fix the one problem in December which means nobody even tried it in the mean time and they also didn't notice yet that something else is broken now.\n\nill just play it cool and wait till they notice and fix the other problem again if they ever notice.",
        "created_utc": 1518703249,
        "upvote_ratio": ""
    },
    {
        "title": "So call a plumber maybe?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xqc9p/so_call_a_plumber_maybe/",
        "text": "[removed]",
        "created_utc": 1518701352,
        "upvote_ratio": ""
    },
    {
        "title": "Did you want some words on that?",
        "author": "klystron",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xosa3/did_you_want_some_words_on_that/",
        "text": "[removed]",
        "created_utc": 1518678356,
        "upvote_ratio": ""
    },
    {
        "title": "600KB free on HDD",
        "author": "Mafiameower",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xohec/600kb_free_on_hdd/",
        "text": "I work for myself on the side while going to school. Got a call from a client while eating lunch\n\n&gt;**$Mafia**: This is Mafia\n\n&gt;**$Cust**: Hello My computer keeps telling me I need more memory how much for you to install more RAM?\n\n&gt;**$Mafia**: Well lets check how much space you have left on your hard drive, navigate here and tell me how much free space you have please.\n\n&gt;**$Cust**: It says 600KB free out of 145GB.\n\n*Trying to keep from laughing cause I am amazed at how little he has left on his system...*\n\n&gt;**$Mafia**: Well I can come and look at your computer today and see what we can do about that for you.\n\n*Once I go to his house, I run TreeSize and see that he has over 90GB in Temp files. I used CCleaner and got rid of all of it and more, taught him how to use it as well so he could keep his computer clean of those files. His desktop was also littered with icons, maybe 5 spaces left. *\n\n&gt;**$Cust**: Hey while you're here, how do you delete a file?\n\nso I teach him how to make folders so he can organize his desktop, and how to delete unwanted files and move files into folders.\n\n",
        "created_utc": 1518674214,
        "upvote_ratio": ""
    },
    {
        "title": "Increase Youtube Video Views and Subscriber Fast",
        "author": "AANCreation",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xnc5j/increase_youtube_video_views_and_subscriber_fast/",
        "text": "[removed]",
        "created_utc": 1518661122,
        "upvote_ratio": ""
    },
    {
        "title": "Kevin thought he was my boss (X-post from r/StoriesAboutKevin)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xn190/kevin_thought_he_was_my_boss_xpost_from/",
        "text": "[removed]",
        "created_utc": 1518658021,
        "upvote_ratio": ""
    },
    {
        "title": "How to Use a Mouse 101",
        "author": "MotherofDingDongs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xlzy6/how_to_use_a_mouse_101/",
        "text": "I am a Salesforce admin for an insurance company. I deal with several insurance salesman that have trouble catching up to technology. Today, I got a phone call that made me laugh out loud. The agent told me Salesforce  was messed up, as they normally do. I asked him what the problem was. He said that when he tried clicking fields, a gray box popped up that said Copy, Cut, Paste, etc. I told him that it sounded like he was right clicking instead of left clicking. He admitted that it sounded likely, but wanted to keep me on the phone while he finished a few things, just in case it happened again. He was embarrassed, but overall I was just happy that I really didn’t have to do anything! \n\nAnother time, an agent was very frustrated with me and had copied my manager and several executives on an email to me because “Salesforce was broke” and if I couldn’t help him I needed to find someone that could. It turned out, he had clicked his num lock. He apologized but I couldn’t bring myself to respond. ",
        "created_utc": 1518648036,
        "upvote_ratio": ""
    },
    {
        "title": "My phone isn't working even though I'm speaking to you on it!",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xlyal/my_phone_isnt_working_even_though_im_speaking_to/",
        "text": "This ticket I recieved today involved a call back about someone's homephone not working properly. For those who don't know, I work as a tier 2 agent for an ISP. Immediately when calling this Irate Customer (IC) I knew it was going to be an adventure.\n\n\nIC: Hello?\n\n\nMe: *intro* I'm calling about the phone issue you've reported.\n\n\nIC: Oh yes! My phone is not working at all.\n\n\nMe: Oh, I'm sorry to hear that. If I may ask, how are you speaking to me right now?\n\n\nIC: On my phone.\n\n\nMe: ...\n\n\nIC: ...\n\n\nMe: But, if you're speaking to me on your home phone, that would mean the phone is working?\n\n\nIC: *loudly* But it's not!!!\n\n\nMe: Okay, so what is exactly is the issue with your phone?\n\n\nIC: *loudly* It's just not working!\n\n\nMe: IC, your phone is working because you're speaking to me on it right now. If it's a calling feature or something to do with your phone itself, I can assist you if you can be more specific. Could you be more specific?\n\n\nIC: This is ridiculous! How much more specific do I need to be?! My phone is not working!!\n\n\nMe: *facedesk* I apologize but I am unable to assist you because ~~you're a moron~~ I am unsure of what the issue is. \n\n\nIC: I told you the issue! My phone is not working!!! *string of profanity*\n\n\nMe: Your phone is working fine. Have a good day, IC and thank you for choosing ISP. *click*\n\n\nI have a headache.",
        "created_utc": 1518647640,
        "upvote_ratio": ""
    },
    {
        "title": "Tell Me How to Do My Job, you Racist!",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xlvhx/tell_me_how_to_do_my_job_you_racist/",
        "text": "[removed]",
        "created_utc": 1518646999,
        "upvote_ratio": ""
    },
    {
        "title": "Our Apprentice did a bad thing",
        "author": "TJBaldy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xl0bo/our_apprentice_did_a_bad_thing/",
        "text": "So this happened today. Relevant for the story - our company uses GSuite for Business (emails/distribution lists sit in a Google admin console). \n\n&amp;nbsp;\n\nWe showed our apprentice how to process a leaver recently. One of the steps is to remove all distribution lists from the user's account and make a note of them. We leave him to complete a very basic leavers request with barely any access. A few minutes later all we hear on the desk is \"oh ooh\". Everyone on the SD looks at him wondering what the hell he could have done...\n\n&amp;nbsp;\n\n....He deleted 280 company wide distribution lists instead of removing the user from 3 distribution lists. \n\n&amp;nbsp;\n\nI immediately contacted our 3rd party for Google support and long story short - they can't restore the Google groups (which they confirmed with Google themselves). So now the desk is left with working out which groups have been removed (from Google reports) and re-creating them all while manually adding the users back in. \n\n&amp;nbsp;\n\nThis is definitely the worst thing I've seen another IT professional do personally (albeit an apprentice). Tomorrow is going to be fun....",
        "created_utc": 1518639811,
        "upvote_ratio": ""
    },
    {
        "title": "I need specifics without giving any info and I'll kill you all.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7xklqg/i_need_specifics_without_giving_any_info_and_ill/",
        "text": "[removed]",
        "created_utc": 1518636608,
        "upvote_ratio": ""
    }
]