[
    {
        "title": "Where are you located ?",
        "author": "HeliosGreek84",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/543c6n/where_are_you_located/",
        "text": "Me: unfortunately sir we need to trouble shoot the issue before we can determine if we can send a replacement phone under warranty \n\nRacist : I bet you can't send me a replacement because you're overseas aren't you?\n\nMe: *internal sigh* no sir , we need to...\n\nRacist: you sound foreign, where are you located?\n\nMe : Phoenix,AZ\n\nRacist : I bet that is somewhere overseas\n\nMe:...........",
        "created_utc": 1474609971,
        "upvote_ratio": ""
    },
    {
        "title": "Calls you would like to be able to disconnect before they even begin (audience participation!)",
        "author": "TyrionsRedCoat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/542m37/calls_you_would_like_to_be_able_to_disconnect/",
        "text": "I'll start:\n\nIt's cold and flu season, and I am struggling to keep my voice functional. I'm using tea with honey, cough drops, and deep breathing exercises between calls. I say very pleasantly, \"Thank you for calling XYZ Corporation, this is TyrionsRedCoat. Please note, this call may be monitored for quality and training purposes. How can I help you today?\" \n\nand the next thing I hear is \"HAAARRRRGGHHHHMMMMP\" ... a LOUD, deep, phlegmy cough, right into the phone (and my ears).\n\nIn my dreams, I just go *click*\n\nBecause gross, rude people amirite?\n\nGo!",
        "created_utc": 1474597594,
        "upvote_ratio": ""
    },
    {
        "title": "voluntary time off",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5424di/voluntary_time_off/",
        "text": "[deleted]",
        "created_utc": 1474590363,
        "upvote_ratio": ""
    },
    {
        "title": "The Wells Fargo disaster",
        "author": "Alvarez09",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/541vo7/the_wells_fargo_disaster/",
        "text": "I know it didn't technically happen in a call center, but did happen in branches. Many in here work in a sales environment, and I wonder how prevalent stuff like this is not only at banks, but other industries.\n\nI do work sales for a bank, and what I see disturbs me both branch side and call center side. I consistently from the branch see revenue manipulation from upgraded accounts and debit card orders processed incorrectly to allow credit for a newly sold debit card.\n\nOn the call center side, I see a culture that is constantly promoting cross selling to everyone. To the bank, everyone needs a credit card. Everyone needs a loan, and we are supposed to tell the customer why. I, and many of my longer tenured teammates have managed to avoid scrutiny because most of us try to only offer solutions that fit a customer needs. \n\nFor example, someone calls and recently had a large amount of fraud on a debit card. I offer a credit card as a main spending source so as to allow a buffer between actual funds and possible card compromises. If I see multiple other credit cards, I offer a balance transfer or see if we have better rewards. I won't bully someone that doesn't use credit into it.\n\nLuckily, our direct management team is great and has shielded us from upper management...however, they can only do so much and there is constant pressure to sale more product...not only to keep your job, but to make incentive which is a huge portion of our paycheck (which thy keep making less and less btw).\n\nIn any case, I would hope what happened at WF would be an eye opener for corporations... Though they will do what they do, blame employees, and never consider the awful culture they created.",
        "created_utc": 1474586892,
        "upvote_ratio": ""
    },
    {
        "title": "I am not cut out for this job",
        "author": "PM_Yo_Pussy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/540sg8/i_am_not_cut_out_for_this_job/",
        "text": "Working in tech support for a wireless carrier basically means that I'm paid to argue with people. Argue about account credits, resetting phones, and trying to convince people that my company's over priced plans are better than other companies with lower cost plans. It's so draining.  I don't like conflict and that is all that my job is about. \n\nMy company says that customers will be happy if I give them bad news but I talk about the weather and etc at the beginning of the call. That's never been the case. Whether I've had a personable call or just a polite call people will react the same. Nice people will be nice; assholes will be assholes. \n\nI'm just so sick of arguing with customers and supervisors. ",
        "created_utc": 1474573170,
        "upvote_ratio": ""
    },
    {
        "title": "Short and sweet",
        "author": "TruckerTimmah",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/540fab/short_and_sweet/",
        "text": "CS: Product is not working, I called and troubleshot before, they told me to do X, it's not working anymore. \n\nME: I'm sorry to hear that, lets get your Product in for a tune-up. \n(Going over repair / replacement rates, options) \n\nCS: So you expect me to pay for a repair, I called when I was in warranty. This should be covered. \n\nME: Ma'am, that was 2 years ago. The last call you made was in 2014 telling us Product was working and all was well. \n\nCS: I don't care, you should stand behind Product. You can take your Product and shove it up your ass. \n\nME: I'm sorry, I don't think it'd fit. \n\nCS: *click*",
        "created_utc": 1474568932,
        "upvote_ratio": ""
    },
    {
        "title": "Yeah.. Well.. it's not working now [X-post from /r/talesfromtechsupport]",
        "author": "elsgard",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53zjka/yeah_well_its_not_working_now_xpost_from/",
        "text": "Edit: Yeah, I know. It's technically not tech support..\n\n$me = me, $cust= customer, $husband = customers husband\n\n\nSo this was a couple of years ago, when I worked at a subscription cancellation department for a telecom company, offering cell, landline, Internet and so forth. I basically revived calls from people who wanted to cancel their subscription, tried to convince them to stay and if that wasn't possible (never felt so hated), handle their cancellation. In my country, the old copper network is currently being replaced with fiber and cell towers. So those who still want to have a phone at home will eventually have to use either a IP telephone or a \"mobile home telephone\", basically a 4G router that you can connect your old landline phones to. \n\n\nHowever, all the telecom companies are trying to accelerate the process of converting customers by selling the \"mobile home telephone\" even though the copper wires haven't been removed yet. And the sales teams love getting some extra cash by selling it to someone who might not have a good enough reception to use it. \n\n\nHowever, I eventually get a call from a lady in her 50's, living on the country side. I immediately know what this call is going to be about. \n\n\n&gt;$cust: Hi, I like to cancel my subscription for my \"mobile home telephone\". \n\n&gt;$me: Okay, I see that you are bound for this subscription another 18 months. So I'm afraid that won't be possible.\n\n&gt;$cust: But the thing doesn't work! We have a really bad reception here. I want to reclaim it!\n\n&gt;$me: You had a months try-out period. And I see here in our logs that you called back a few days after you got the product and said that you were satisfied and wanted to convert to the new phone.\n\n&gt;$cust: Yeah.. Well.. it's not working now and I want to go back!\n\n&gt;$me: If you want I can connect you to tech support and maybe they can help you..\n\n&gt;$cust: NOO!! NO FUCKING TECH SUPPORT! I WANT MY OLD PHONE BACK!!!\n\n&gt;$me: I understand. Let me talk to my manager and see what we can do.\n\n\nI talk to my boss and he agrees to cancel the subscription. However, she will have to pay the fee for reconnecting her land line if she wants it back. (For some reason, under no circumstances we were allowed to do this for free..) So I got back to the customer.\n\n\n&gt;$me: Good news! Since you've had such a bad experience with our product, we can cancel your subscription now!\n\n&gt;$cust: Good. And I want my land line back.\n\n&gt;$me: Of course. However, it will take between 4-6 weeks for the technicians to you..\n\n&gt;$cust: SIX WEEKS?!!?! I WANT IT NOW!!!\n\n&gt;$me: Yes, i understand. But the technicians have a lot to do and..\n\n&gt;$cust: NOW!!\n\n&gt;$me: I'm sorry. There is nothing I can do to accelerate the process. And.. I'm afraid that in order to connect you to the network again.. You will have to pay a fee at 150$\n\n\nAt this point she is obviously outraged. In my defense, it's company policy and there is nothing I can do about it. And she accepted the terms and conditions.\n\n\n&gt;$me: I'm really sorry that it hasn't worked out for you. But you accepted the contract when you bought the product and in that contract it is clearly stated that it will take up to six weeks and cost you 150$ to reconnect your land line. And you even cut the try-out period short because you were satisfied.\n\n\nNow she puts her husband on the line. He seems to think that if he is calm and collected he will get what he wants.\n\n\n&gt;$me: Hi there, this is &lt;name and company&gt;.\n\n&gt;$husband: Mm..\n\n&gt;$me: ...What can I do for you?\n\n&gt;$husband: You are gonna reconnect our land line.\n\n&gt;$me: Yes, we will do that.\n\n&gt;$husband: And you are gonna do it now.\n\n&gt;$me: I'm sorry, that wont be possible.\n\n&gt;$husband: And you're gonna do it for free.\n\n&gt;$me: No as I said.. *click*\n\n\nAs I didn't get an official recorded contract where she agrees to terms of the cancellation, no cancellation was done. She calls back two or three times, one of the calls was of course directed to me. All of them followed the exact same pattern as the first. And she was always surprised and outraged when it came to the part with reconnecting her land line. She eventually ended up paying the 150$.\n\n\nEven though I don't really agree with the sales teams methods, I really hope she has learned to listen to the terms and conditions in the future.\n\nEdit: Spelling",
        "created_utc": 1474558666,
        "upvote_ratio": ""
    },
    {
        "title": "John loves vagina",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53yuph/john_loves_vagina/",
        "text": "[deleted]",
        "created_utc": 1474549716,
        "upvote_ratio": ""
    },
    {
        "title": "One from a while back",
        "author": "chewster1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53ykh2/one_from_a_while_back/",
        "text": "Working for a telco, had a guy call in complaining about the way his  phone number was being displayed in our companies 'view account' mobile app.\n\nIt was a toll free number for his business and showed up in the format XXXX 112 233\n\nHe  wanted it to be changed to the pattern XXXX 11 22 33 (grouping repeated numbers together) which is just a matter of semantics imo\n\nI said the way the app is setup its fixed to end users and tech support, we just don't have control to change the number pattern, but he is free to put the number on signwriting, business cards etc however he wants... its the same number. This enraged him.\n\nSo he started swearing, saying how stupid it was, how stupid I was and the company was etc... I reiterated my points. He said so WHO can change it put me through to them NOW. \n\nI said that technically our app developers might be able to change it, but this isnt something we would be looking into. (basically just a crap feature request)\n\nNow he wants my supervisor. I stood my ground and just flat out refused an escalation on the basis a complaint had no merit, but Ill flick an email and ask our app devs what they think...\n\nAfter about 5 more rounds of talking in circles I had to just say goodbye and end the call UGH",
        "created_utc": 1474545307,
        "upvote_ratio": ""
    },
    {
        "title": "Winter storms",
        "author": "Donkstin",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53ur1y/winter_storms/",
        "text": "This is another tale from roadside assistance that I will not forget. This call took place during this past Winter, and the caller was located in NYC during a huge storm.\n\nAs I came into work that day (being in Michigan we get bad snowstorms too) I was not surprised that we were getting slammed. The previous day we had been told that the states of New York and New Jersey declared emergencies and advised people to not leave their houses. Naturally people still call saying they are stuck in their driveway and want a winch out (yeah because the tow truck is going to drive through an unplowed road to help you get to the store) and we do not help if they are stuck in an unpaved driveway. Anyways.\n\nThe emergencies were technically over, people were allowed to drive around but I imagine it was still a mess in the roads. When areas like this are slammed with natural disasters (snowstorm, floods, etc) they are considered in a \"weather phase\" and depending on severity we may receive ETAs of 1-4 hours before they are helped. (the most severe weather phase is like 1- 3 days). Onto the caller.\n\nOlder gentlemen, brand new electric vehicle (not sure if I can say brand?), it broke down in the middle of Queens during this snowstorm. So I start my probing questions asking what happens when he tries to turn it on, any error messages, etc. The screen says \"ENGINE NOT AVAILABLE\". Wtf. I don't know anything about electric vehicles, we aren't technicians. So this guy is at an intersection in a snowstorm and can't move his vehicle. Great.\n\nI call a technician local to him to ask about that error message, the technician can't give me anymore information then it needs to be towed in to fix. I relay this information to the guy and he states he is trapped in the vehicle (the locks are electric and there is no electricity going to the doors). Now, I remembered something we were taught in training about these vehicles, there is a manual release under the seat and I try to instruct him where it is if he needs to leave the vehicle. He can't find it, and starts to panic. He has no heat and it is probably around 10 degrees outside.\n\nI know if I start calling tow companies several things are going to happen: 1) several hour wait time, 2) doesn't cover this area (they are real picky about coverage areas in big cities), 3) no answer/line disconnected. I start by calling 911 in his area, since we are required by policy for emergency situations. The 911 operators are also slammed and they said they would try to send someone over to check on him but no real guarantees. Great.\n\nI ask the guy if he has family nearby that might be able to assist since I won't get anything less then several hours. He states he doesn't have any family nearby and he was trying to go visit his wife in the hospital. I'm really starting to feel for this guy. Just a terrible situation.\n\nSo I start calling around for a tow, and I've been on this call for like 20 minutes already (our goal is about 10 minutes) and like I thought, line disconnected, no drivers available, don't cover that area, or like 6 hour wait time. I understand they are slammed too. Because it is NYC, I have about 40 Service Providers to call before I can escalate or google companies around him. I think about my 18th SP they give me a 45 min ETA, but want it on a credit card for like double the normal rate. I went against policy and asked a nearby TL for assistance to override it and pay by CC. I knew she would sympathetic and would help me, she's nice like that. But another TL was at her desk and was a b***h and didn't want the other TL to help since I had other providers to call and was given an ETA within acceptable range (6 hours because it is a snowstorm).\n\nWe finalize the CC and pay the SP, 45 minutes, awesome! I bring the man back on the phone to inform him of the good news and conversation is:\n\nMe: Thanks for holding again sir, I arranged XXXX Towing to come and get you, they will be there in 35-55 minutes. Again I apologize for this taking so long.\n\nOldMan: Glad to hear it, but I'm still cold and scared, is there any way you can call me back in 20minutes to make sure I am alive?\n\nI stuttered a moment.\n\nMe: Of course sir, if I can't call you back in 20 I will have another agent reach out to you, is there anything else I can do for you right now?\n\nOldMan: No donkstin, I think that will be all, thank you.\n\nI went to the TL for our escalation team to inform of the situation and the callback, he picked one of the agents to reach out to the customer in 15.\n\nNo other calls that day were like that for me. I did check up with the other agent later, she said someone who lived on that road came out to check on him. I don't know if the SP arrived in 45minutes anything else that happened. I really hope things got better for him. And I am glad I don't do roadside assistance anymore. It really is a stressful department to work in.",
        "created_utc": 1474483876,
        "upvote_ratio": ""
    },
    {
        "title": "John loves vagina.",
        "author": "ThatsAtroShus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53to1a/john_loves_vagina/",
        "text": "My sister works in a call center too. \nHer story. \nSister: is your email still... ahhh, JohnLovesVagina69?\nCaller: nah..... I mean, I still love vag.... I just don't use that email no more....\n😂😂",
        "created_utc": 1474471330,
        "upvote_ratio": ""
    },
    {
        "title": "...and I'm psychic now????",
        "author": "ThatsAtroShus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53tkdf/and_im_psychic_now/",
        "text": "I worked in a call Centre for credit cards in my bank. \nCaller: I sent some paperwork to you and I haven't heard anything since. Did you get it?\nMe: do you have an account ID I can view.\nCaller: no.  It's an application form, I don't use the internet for these things. \n(I get her name -do a search-there's nothing) \nMe: sorry ma'am I have nothing in that name. \nCaller: I sent it three weeks ago ! Why didn't you call me to let me know you didn't get it?\nMe: ma'am, who were you dealing with? \nCaller:no one I just got a form with my statement. \n(Penny drops for me here... and I close my eyes, take a breath and pinch the bridge of my nose)\nMe: ma'am, if we didn't know you were sending in the application, how would we know to call you If we didn't get it?\nCaller: well you SENT it to me didn't you???",
        "created_utc": 1474470143,
        "upvote_ratio": ""
    },
    {
        "title": "How to build a happier contact center",
        "author": "gurlnamedkill",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53t0gc/how_to_build_a_happier_contact_center/",
        "text": "I am a contact center Director that has recently been charged with making a call center that isn't your \"normal\" call center.  The goal is to make it more employee-centric, less \"big brother-ish\", and just generally a happy, fun place to work.  Now, I know this is not the norm, and in addition to asking my staff what they think would help create a better work environment, I thought I'd see if anyone here could share their ideas, personal experiences, or anything else that may be worth looking into.  So, what would make your job better?  How would you still ensure calls are answered without the pressure of adherence models?  How would you maintain high quality calls without call reviews?  Are there things you actually like about the traditional call center environment that you wouldn't want to get rid of/change?",
        "created_utc": 1474462890,
        "upvote_ratio": ""
    },
    {
        "title": "\"HALP! I'm hosting a conference late at night that I never told anybody about and surprisingly the building is closed!\" / \"are you stupid?\" [x-post from /r/callcentres]",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53shci/halp_im_hosting_a_conference_late_at_night_that_i/",
        "text": "As some of you will know, I work an out of hours service desk which provides general IT support to a few different businesses out of hours when their normal IT people have gone home. These businesses are often hundreds of miles away and my access to their internal systems is usually anywhere from extremely limited to none existent.\n\nThis is a gem of a call that I received and typical of the level of stupidity we have to deal with.\n\n**Me:** Service De--- [interupted]\n\n**Caller:** I can't get into &lt;building&gt; open the door!\n\n**Me:** I'm sorry, you're calling the IT emergency line, I can't open a door for you I'm based in &lt;miles away&gt;\n\n**Caller:** SO YOU CAN'T HELP ME! WHY CAN'T YOU HELP ME?\n\n**Me:** Ma'am this is an IT emergency line for reporting major system failure or general out of hours IT support, as I've said I'm not based on site so can't open a door for you. This was &lt;building&gt; correct?\n\n**Caller:** YES &lt;BUILDING&gt;!\n\n**Me:** Okay, well &lt;building&gt; closes at 9 pm, it's now 11:30 pm. That'll be why it's locked.\n\n**Caller:** BUT I'M HOSTING AN IMPORTANT CONFERENCE CALL IN &lt;MEETING ROOM&gt;!\n\n**Me:** Have you arranged this with management?\n\n**Caller:** NO!\n\n**Me:** We'll Ma'am if there's no prior arrangement with management &lt;building&gt; will have been locked down by security as normal as nobody knew you wanted to use &lt;meeting room in building&gt; out of hours.\n\n**Caller:** WHY WONT YOU JUST OPEN THE DOOR ARE YOU STUPID?\n\n**Me:** I'm not based on site as I've already said multiple times, I'm unable to physically open a door from &lt;miles away&gt; for you. You'll need to speak to your management team for further assistance as this isn't an IT issue and we currently have another caller waiting so I'm afraid I'll have to end this call.\n\n**Caller:** HOW DARE YOU! YOU'RE GOING TO HANG UP ON ME. ARE YOU STUPID? I'M REPORTING YOU TO &lt;someone I've never heard of&gt;\n\n**Me:** Okay Ma'am, as I've said, this isn't an IT emergency, you're absolutely free to speak to &lt;someone I've never heard of&gt; however I'm ending this call now as it's not IT related and we have other people in the queue who need assistance, goodbye.\n\n**Caller:** YOU FUC---\n\n**Me:** *click*\n\nFor those wondering; this particular business has not provided us with any escalation contacts for their security team, if it's not IT related, we're totally free to drop that call and move on - *especially* if we have other callers queuing.\n\n**P.S. Anyone who hasn't already, please check out and subscribe to /r/callcentres !**",
        "created_utc": 1474453251,
        "upvote_ratio": ""
    },
    {
        "title": "Humane Hearts in Computers",
        "author": "ozen87",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53rw4q/humane_hearts_in_computers/",
        "text": "One day, while working as a customer service rep for a hosting company, our company received an email from our corporate office that someone had left a voicemail. I listened to the voicemail itself and thought,\n\n&gt;hrm, okay, well that was really strange...\n\nI emailed our corporate team back letting them know that I was handling it. I worked to transcribe the voicemail and what the person was saying was absolutely asinine and incomprehensible. They were stating that our company was in cahoots with different banks to rule the world and that we murdeered(sic) people.\n\nI finally did some digging and had a virtual paper trail to uncover. I eventually found several tickets where his hosting with us had been canceled and then another where we sent him an email stating his content wasn't fit for our services and we terminated his account with us and banned him from signing up for any other accounts. The content they were hosting? They were deliberately hosting files that were used to phish for users information and spam end-users via email. You will find the email below, verbatim, sans personal information withheld denoted by [].\n\n&gt;\"You company is still not dealing with i opened a new account [domain] you gave me 4 c panels fore one domaine so i had two cancel because you could not fix it. Then you should give me a warning not two email and i only used you're email 7 days total and it was mostly two the Government complaint that the owner of you're Company JP Morgan Black Stone and warenburg caused 9-11\n\n&gt;You're response is not clear it does not say what on my Website is bad. If i could sue you in court you would not suspend my account people have zero rights.\n\n&gt;I emailed the Government that the People that own [webhost] a murdering people in all countries two put humane Hearts into computers\n\n&gt;I did not think E mail two the government is spam you notified me you did not like it and i agreed two Not email anyone ever agin from you're service.\"\n\nI showed this to a couple of co-workers who agreed that it was a good fit that this person was banned from using our services. Also, my boss told me to not reply to that email because doing so would just provoke this persons activity.",
        "created_utc": 1474439541,
        "upvote_ratio": ""
    },
    {
        "title": "That one time I accidently called a customer retarded",
        "author": "Ihatejellybeans1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53r2cu/that_one_time_i_accidently_called_a_customer/",
        "text": "What I meant to say:\n\"So, how long have you been retired?\"\n\nAfter working a 13 hour day it came out as:\n\"So, how long have you been retarded?\"\n\nCustomer didn't catch on but I was dying inside trying not to laugh and or cry. ",
        "created_utc": 1474425130,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why do you need my apartment number?\"",
        "author": "paging-dr-doctor",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53qvgd/why_do_you_need_my_apartment_number/",
        "text": "I started working at a call center in an OU for a carrier with an online retailer a few months ago. For the most part I just talk to driver's and people with dispatchers to help with deliveries (issues like being unable to access apartment complexes or being unable to locate addresses and whatnot). It really isn't too bad of a job aside from the occasional impatient driver.\nNow, the trouble typically comes when I talk to customers and agents. Most of them are cool and just want their packages, so will give me whatever info is needed. I had one charmer the other day that called when we couldn't locate his particular address. \nThis story starts with a transfer though. Sometimes retail agents from other OUs will have to contact my OU to communicate additional information for an order on behalf of the customer or to inquire about the carrier in general. I typically do not mind dispensing this information. However, I hold a special ire for agents who try to push for me to take a transfer that I can't take and I make very clear that I will not. This particular transfer was one of those.\n\nRetail Agent (RA): Hello, this is (insert name here) and I have a customer on the other line who wants to speak to the carrier.\n\nMe: Ok... can I have a tracking number so I can see what is going on?\n\n\nAfter the RA gave me the tracking number, she continued saying that the customer wanted to speak to the carrier. I saw that the customer had called earlier on that day and gave additional information for an order. We had needed an apartment number to deliver to, and such was added for a delivery reattempt, so we didn't need anything else. \n\nMe: Why exactly does he want to speak to the carrier?\n\nRA: He said that he was hung up on earlier on [status showed that call had dropped due to technical errors].\n\nMe: Well, it looks like that call dropped, which is unfortunate. However, unless he has any additional information for the order, I can't take that transfer. \n\nRA: But the customer asked.\n\nMe: I get that, but it's just going to be bouncing him around back and forth, and it's only going to make him more upset. Let him know that we have the information we need and that we will redeliver the package later today or tomorrow. \n\nRA: Ma'm, you need to take the transfer.\n\nAt this point, I'm getting agitated, as policy stated I did not take this kind of transfer.\n\nMe: I do not. Per policy, I do not take this kind of transfer and I will not take it.\n\nRA: Ma'm, my lead also said you needed to take the transfer.\n\n\nThis went on for a minute or two, arguing policy with each other. I really need to develop a better backbone, because I got tired of the RA yelling at me and I decided to just take the transfer to get her to leave me alone and so I could clarify some info with the customer.\n\nSo she transferred a rather disgruntled sounding gentleman over. After he passed security and I was able to get into his account, I began speaking about the matter at hand.\n\n\nMe: So I see here that the driver was having trouble finding your particular apartment, but I also see you called earlier and added your apartment number. Can I just confirm that that is the correct number?\n\nCx: That's stupid. It should already be on my shipping address.\n\n\nI double checked, and of course it isn't on the shipping address.\n\n\nMe: I checked and it does not appear that there is an apartment number on the shipping address for this order for some reason. But the apartment number was already added from an earlier call, so everything is ok now and you will receive the package today or tomorrow.\n\n\nCx: *getting angry* I don't understand why I need to give you my apartment number! I just click on it and it should come to me!\n\nMe: Oh, do you have packages go to a mail room or a leasing office?\n\nCx: No, I don't! It should just come to me at my door!\n\nMe: We can't really bring it directly to your door if we don't have your apartment number to go by. I can add that right now-\n\nCx: You are so stupid! I just clicked the address in my account! You shouldn't need my apartment number! It should already be on there!\n\nMe: Sir, I double checked-\n\n\nWhile I was saying this, he hung up on me in a huff.\nI ended up contact coaching that RA for bullying me into taking the transfer and had to take a break after that call.  Gave me a headache.",
        "created_utc": 1474422303,
        "upvote_ratio": ""
    },
    {
        "title": "Things you want to say to idiots.",
        "author": "Mr_Dusseldorf",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53quaf/things_you_want_to_say_to_idiots/",
        "text": "I'll start:\n\"Maybe if you paid your fucking bill on time your services wouldn't be cut off and NO I'm not giving you any credits just because you happen to be too irresponsible to avoid late fees!\"",
        "created_utc": 1474421832,
        "upvote_ratio": ""
    },
    {
        "title": "To my callers who fail the DPA checks.",
        "author": "Rhodoferax",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53qg0s/to_my_callers_who_fail_the_dpa_checks/",
        "text": "Yes, you got the questions wrong.\n\nNo, I can't ask you any more. No, the questions aren't unreasonable.\n\nYes, the Data Protection Act is British Law. It's there for your protection.\n\nNo, even if our company did break the law on this occasion, I'm not allowed to knowingly break another law to help you.\n\nNo, other laws do not override the DPA. Even if they did, you still have to prove you are who you say you are, which you haven't.\n\nI can totally help you, but I'm not allowed to.\n\nNo, I can't transfer you to someone who will help you, because the law means nobody is allowed to help you.\n\nNo, I can't get my TL on the call if you didn't answer the questions correctly.\n\nYes, I am doing my job.\n\nYes, we've always had these questions. If the last person you spoke to didn't ask them, they are the one who didn't do their job properly, not me.\n\nNo, throwing a hissy fit won't help.",
        "created_utc": 1474416140,
        "upvote_ratio": ""
    },
    {
        "title": "NASA tries to pull one over on us",
        "author": "ISellTelescopes",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53pzqn/nasa_tries_to_pull_one_over_on_us/",
        "text": "Just found this sub, love the stories. Have a few of my own to share, hope this one isn’t too long. \n\nA little background first, I work in the customer service/sales department of a telescope company, so it’s a little different than most call center jobs, but still, it’s customer service, so… yeah. Anyways, here’s an interesting story from a couple months ago that I figured you guys would enjoy. It’s pretty late in the day, so there’s not too many of us manning the phones. A call comes in, and it starts off like a pretty standard sales call, he’s interested in a telescope, has a lot of money to spend. He mentions something about working at a NASA research location that isn’t too far away from us, so it seems pretty obvious what he does. He asks for the best telescope we sell, so I point him to it, it’s a several thousand dollar item. It isn’t too unusual for us to occasionally get people from research facilities ordering from us using a corporate account, and not really caring about price. He seems interested, and we move forwards with the sale, me putting in his address info and all.  Then I go to put the telescope on the order, and the exchange goes like this:\n\nMe: Okay, so I’ve got X telescope on your order, that comes to $3500.\n\nNASA Guy: Cool, so is that one item?\n\nMe: I’m sorry?\n\nNASA Guy: Does it show up as one item on the invoice? I need it to be itemized. \n\nMe: Uh, well, it will be itemized, this will show up on the order invoice as “Model of telescope.”\n\nNASA Guy: Ah, now, that won’t work. This comes in several pieces, correct?\n\nMe: Well, yes, it’s much too large to ship assembled, it does come in a couple boxes. \n\nNASA Guy: Well, can you break it up for me then? I need to have each part invoiced, I can’t have the \nwhole thing as one price on the invoice. \n\nMe: That’s… not how the ordering system works, we don’t even have SKU’s for each separate part of the telescope.\n\nNASA Guy: You do realize I’m with NASA, and trying to order from you, correct? Please break the telescope’s price up for me, I need to have itemized costs. \n\nMe: I can’t do that. Why don’t I transfer you to my supervisor, he’ll be able to assist you with this.\n\nI transfer him through to the head technician, who is the only supervisor around at this point. He overheard the conversation and was ready for it. Sometimes people have odd requests when ordering through institutional channels, but this is weird, and the technician will tell him exactly what I did. It’s pretty slow, so I don’t get another call, and can hear one side of their conversation. \n\nTechnician: Hi there, I understand you wanted specific items to show up on the invoice?\n\nPause\n\nTechnician: I'm not able to place an order that way, why do you need it to read this way?\n\nPause\n\nTechnician: I see. I understand you are, and I apologize. \n\nPause\n\nTechnician: Thank you for your interest in our products. \n\n*Click*\n\nI walk over, and ask if he really just hung up on NASA. He laughs, because he did. It turns out that Mr. Researcher was trying to get past the $3000 limit on his corporate card by having different parts of the telescope show up for their component prices, and when we were not forthcoming, decided to repeatedly say “I’m with NASA, why not?” and laugh in a condescending manner. Even being from NASA, you’re still just a customer. No telescope for you. \n\nIf you guys are interested in more stories about \"interesting\" customers, I've got more. Working here is very nice, it's a small place and very relaxed, so there's not always major interesting drama, but customers provide that on their own. ",
        "created_utc": 1474409968,
        "upvote_ratio": ""
    },
    {
        "title": "Skills you possess that may or may not be considered useful",
        "author": "baby_pan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53o6sk/skills_you_possess_that_may_or_may_not_be/",
        "text": "Had an epiphany about this last night so here is mine:\n\nI have a uncanny ability for troubleshooting issues that have nothing to do with the stuff I am trained to help people with. \n\nExhibit A: 20+ minutes phone call trying to figure out why  drone manufacturer does not have app for customers device. Explained how app stores work (app maker submits the apps, they don't just appear out of thin air), and it probably didn't even cross their mind to make the app for your device, call them and ask them about it. \n\nExhibit B: 30+ minute call with lady trying to place an order with a wireless mouse that isn't really working. Made her change batteries twice, told her she really shouldn't use the mouse on her leg as that might be the problem, etc etc. She was really sweet though and in a retirement 'home'. End solution was me telling her to ask her friends if she can borrow one of theirs and that the  computer isn't as scary as it seems. \n\nBut seriously, i have some sort of freakish nature that commands me to help people as much as I can. I can't do that thing where I say oh I can't help you with that, robotic answer type of shit I have seen many others use.\n\n \nNot saying I'm awesome or anything, I'm just a weirdo who is too nice to nice people. ",
        "created_utc": 1474388716,
        "upvote_ratio": ""
    },
    {
        "title": "Sure , go a head a call back later",
        "author": "HeliosGreek84",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53m3ju/sure_go_a_head_a_call_back_later/",
        "text": "So it was less than 15 minutes on the end of the shift and the whole call center about to close, it's been a terrible day for my stats, so I got this customer (67) years old with a new iPhone, kept complaining how she doesn't know anything about tech , she was the one who order it , so I helped her through basics, emailed her links ( after checking that she had and email) now there's my supervisor breathing down my neck to wrap the call, I'm asking the customer if she needed any else ( I got most important things covered) and now she kept dragging on and on and how she can't hear well, I'm trying to get this over with and she hit me with ( I was on hold for a long time, so you should do too? Asked for my name and probably will complain... I don't know, it's just customers sometimes try to push you buttons",
        "created_utc": 1474352759,
        "upvote_ratio": ""
    },
    {
        "title": "Morons who can't stop interrupting.",
        "author": "Mr_Dusseldorf",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53ly3s/morons_who_cant_stop_interrupting/",
        "text": "I fucking hate idiotic customers who cut you off mid sentence. For example: \"It says here you had a 6 dollar late fee however....\" \"What that's bullshit! I shouldn't have to pay any late fees, you people give HORRIBLE CUSTOMER SERVICE\" \"...What I was saying sir was that you have ten dollar late fee and I was going to waive that for you\".\n\nEven when you try to help these morons, they're too simple minded to actually listen and instead like to fly into fits of rage.",
        "created_utc": 1474349831,
        "upvote_ratio": ""
    },
    {
        "title": "Sky seeks a Customer Sales Advisor to join their team in Newcastle, UK",
        "author": "MeganWellson",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53j3h2/sky_seeks_a_customer_sales_advisor_to_join_their/",
        "text": "[removed]",
        "created_utc": 1474310682,
        "upvote_ratio": ""
    },
    {
        "title": "I love my supervisors and QA people (not even kidding rn)",
        "author": "TyrionsRedCoat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53hwt7/i_love_my_supervisors_and_qa_people_not_even/",
        "text": "I've worked in call center hell at an insurance company where they evaluated you on whether you used certain scripted words and phrases (a black mark on your QA if you used the word \"no\" regardless of context which is just WTF), and gave you shit if you were *too* helpful because it drove up call times (more WTF, since I was preventing repeat calls). Just a bunch of short-sighted, bean-counting bullshit.\n\nMy new call center gig is nothing like that. It's retail, and there's no pressure to do anything but be one's charming self and adhere to policies and procedures with regard to confidentiality, processing of financials, return policy, etc. I get to speak with my own voice, and if they monitor a call that goes a little long and I haven't been talking about pro football or the weather, they just chalk it up to being human. It's pretty goddamn sweet.\n\nAlso, I have absolute discretion to terminate calls by abusive people. A QA dude who monitored me trying to talk down this insane woman who wanted me to apply a discount to a discount to a discount (sorry lady!) said I was under no obligation to allow someone to verbally abuse me. He said, \"That woman was never going to be satisfied or let you explain anything. It's perfectly fine to hang up on someone who is that irate. We're dealing in chinos and polo shirts, it's nothing to get that excited about.\"",
        "created_utc": 1474296752,
        "upvote_ratio": ""
    },
    {
        "title": "That call where the customer just won't stop screaming...",
        "author": "TyrionsRedCoat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53fx0z/that_call_where_the_customer_just_wont_stop/",
        "text": "... and all you can do is sit there and wait for him to start swearing so you can hang up.\n\nYep. I had that guy last night. First words out of his mouth were, \"I have called you people six or seven times already and everyone keeps hanging up on me!\" GEE, I WONDER WHY.\n\nOf course that's when I moved my hand to the phone, index finger hovering over the \"release\" / \"sweet relief\" button. \n\nOf course, I looked up his problem, he swore he had returned some merchandise that he had never bought (dude, we keep records) and was going to sue our Fortune 100 company into bankruptcy!\n\nThe disputed item? A pair of pants.\n\nFucking pants.\n\nThe happy thing was, it only took him three minutes to drop the f-bomb...\n\nRelease button I heart you so hard.\n\nFile note: Customer used abusive and profane language, call terminated.",
        "created_utc": 1474258339,
        "upvote_ratio": ""
    },
    {
        "title": "Whoever Cold Transferred the Irate Business Account Customer That Requested a Sup...",
        "author": "GlissandosNTrills",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53fqlw/whoever_cold_transferred_the_irate_business/",
        "text": "...You 'bout to get fired bruh. That was some bullshit. I just got my assed chewed out for twenty minutes over something I had absolutely no control over and didn't have the resources to fix because I'm in residential tech support. \n\nSeriously, fuck you for that. FUUUUUCK YOUUUUUU!\n\nHere endeth the rant.",
        "created_utc": 1474255424,
        "upvote_ratio": ""
    },
    {
        "title": "Lots o stories",
        "author": "Kara-El",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53duuq/lots_o_stories/",
        "text": "Just discovered this subreddit! Awesome as it brings back memories when I worked in a call center about 18 years ago for a Major Online Service Provider (y'all know which one...very popular back in the late 90's and early 2000's). I started off in tech support (solving connection problems with modems and such) and then got shuffled to accounts (signing people up) and then finally to Terms of Service (the \"police\" of the service).\n\nI have tons of stories as I worked there for almost 3 years.\n\nTech Story (i have many)\n\nguy calls in and says he can't connect, run through the known steps to fix and he stops saying he doesn't understand half the things i'm telling him to do on his computer (which was running windows 97...one of the easiest OS's to tech!). He tells me to hold on a quick min and he'll get his \"computer expert\" on the phone. I'm thinking, great, as we are graded on the length of the call and this was already running over 5 minutes (our goal was to solve your issue in less than 5 as you've probably been on hold anywhere from 10 to 20 minutes or more). So I wait a minute and then a tiny voice comes on. Its his son....who's five. I ask if the kid can read, other wise this wouldn't be able to happen. the kid says yeah and I walk him through the steps. In less than a minute, the kid has the computer connecting (I can hear the telltale modem handshake through the phone). the kid thanks me and hangs up.\n\nAccounts\n\nGuy got a new computer for christmas so on christmas day (yup, mandatory work day and one the days we had the highest call volume) he's trying to sign up to the service. Total computer noob and calls us to help him. I was able to get him signed up without the software and just told him to install it when he was ready. When it asked for his Id and password, just type in he ones I gave him and he'll be on in a heartbeat. He then asked me if he needed a modem to get on. I asked him if his computer had one installed and he said it didn't. I told him to contact his nearest computer store the next day for further help.\n\nTerms of Service\n\nthis one takes the cake. As a terms of service rep, we have the ability to literally KICK YOU OFF THE SERVICE FOR GOOD and then make it so that you couldn't sign up for new service by flagging your information in the system so you could not create a new account. Granted, there are ways around this, but if you start up with your stupid antics that got you kicked off in the first place, YOU ARE NOT HARD TO FIND.\n\nSo we deal with anyone who violates the terms of service (everything from threatening physical violence in a chat or private message to actual solicitations of sex of a minor). We get to see EVERYTHING that you did or said online.\n\nWorst one ever was when a mother called in to find out why she could not get online. She used the service for her work and had given subaccounts on her account to her kids. One of her kids, a boy who was not a teenager as his main chatrooms were catered to the college crowd got the account locked.....by soliciting a goddamn 12 year old girl for sex in a private message. It was reported to us and I had to sit there on the phone and explain to this mother why she was no longer able to use the service and then proceed to quote verbatim the conversation her son had with a 12 year old girl that was VERY graphic. She begged, pleaded, cried to get back online so she could retrieve her emails and various work related work. I had to apologize that once we get that serious of a violation, the account is not only deactivated, anything and everything associated is deleted save the logs we keep for any possible legal action. basically, all of her stuff was gone. \n\nI don't think anything we could have done would be comparable to whatever punishment she came up with for her son.\n\n\nI have more..if i can remember them all, i'll post them!\n\n",
        "created_utc": 1474228808,
        "upvote_ratio": ""
    },
    {
        "title": "My first obscene caller of the season.",
        "author": "TyrionsRedCoat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/53ac8x/my_first_obscene_caller_of_the_season/",
        "text": "Gross guy called because it's the only way he can get a woman to talk to him on a Saturday night. Pretends he can't read the catalog, doesn't know WTF he wants. Long pauses whenever I ask a question. Fucking torture. Next time I am going to pretend we have a bad connection and hang up. I feel like I need a shower rn. ",
        "created_utc": 1474164912,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Working Here To Help You, Asshat.",
        "author": "LookingForScaryStuff",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/539p1e/im_working_here_to_help_you_asshat/",
        "text": "I'm on my phone, sorry for any mistakes.\n\n\nI had a call about two weeks ago that I just remembered. I've only forgotten it because I tried pushing this guy's shitty attitude out from my mind. For this story we'll call him AH for Asshat/Asshole. This call was regarding a tow this guy needed for his truck. He had a light southern accent.\n\n*call pops up in my queue*\n\nMe: Thank you for calling *towing company*. How can I help you?\n\nAH: I need somebody to come out and tow my truck.\n\nMe: Alright sir, can I get some information?\n\nHow my call center works this account goes like this \n\n1.Get the callers info\n\n2.File it out\n\n3.Phone the On Call and get the caller patched through\n\nAH gives me his info and before I tell him I'm going to connect him he asks me a question.\n\nAH: Do you work there?\n\nMe: No sir I-\n\nAH: Then why did you take my info huh? If you don't work there then why are you answering calls for them? You should quit and find a job you can ACTUALLY do! *As he says this his tone changes to a \"I know better than you\" tone*\n\nI go quiet for a moment and soak up what this guy just told me.\n\nMe: Sir, I'm just the answering service. I can on-\n\nAH: *Still with the same attitude* If you don't work there then quit your job and find one you can actually do.\n\nMe: Sir. I am just the answering service.\n\nAH goes quiet for a moment.\n\nAH: So you don't work there?\n\nMe: *Internally screaming* No sir.\n\nAH: Ok, bye.\n\n*click*\n\nThis job makes me want to just stay at home and never be social.",
        "created_utc": 1474154412,
        "upvote_ratio": ""
    },
    {
        "title": "Wear and Tear",
        "author": "NefariousNeezy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/539fun/wear_and_tear/",
        "text": "FTP LTL Working Tech Support for POS POS Systems\n\nAgent: Why does your equipment always break? \n\nNow I admit that the technology isn't cutting edge, but these things are built like tanks. The only major inconvenience would be ease of use.\n\nI checked the agent's previous notes and true enough, equipment replacement every 3-4 weeks due to physical damage.\n\nMe: I see sir that on your previous notes that you have been having physical damages on the equipment, is that right?\n\nAgent: Yes. Why is that?\n\nI've noticed during the troubleshooting that the agent is using the equipment very roughly. I can hear him slapping the equipment together if he isn't able to put it back together. Dropping it without care when we turn it upside down to check for serial. Stuff like that\n\nMe: well, sir, TBH at this point, it comes down to agent usage. We have other locations that use the very same equipment for years and years only having minor problems. No damages.\n\nAgent: agent usage? So it's my fault?\n\nMe: (heh) not necessarily. (Heh) but like I said, it varies from agent to agent. Some are able to preserve their equipment by being careful, while one needs constant replacements due to being careless.\n\nAgent: ...do you have the ticket number for me?",
        "created_utc": 1474150593,
        "upvote_ratio": ""
    },
    {
        "title": "When life pro-tips fail.",
        "author": "Rhodoferax",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/539eak/when_life_protips_fail/",
        "text": "I got a call from an irate woman today. Her direct debit had been cancelled without her authorisation, which is a thing that sometimes happens. As a result, the telecommunications company I work on behalf of had not received a payment in several months. Her account had been completely ceased and she had over £150 in outstanding balance. This means she needs to pay up before we can even think about reconnecting her, and if we do, she will have to be treated as a new customer, so the installation would take two weeks. Hoo boy, that was a fun call.\n\nI won't go into details, because I don't want to come across like a bourgie mocking the working class. Still, a few highlights...\n\nThis woman somehow managed to put off calling us until the day before she went on holiday and left her autistic son with her parents, and apparently her son needs the Internet or he'll go insane.\n\nShe also claimed to have gotten an email promising her £60 credit. I check both the tickets and the KCIs, and there's nothing there. \"Are you calling me a liar?!\" \"No ma'am, it's just...\" This went on for a while; it's not implausible I wouldn't have seen the email in my system, because it can be hit and miss with what it records. However, this woman was in the state of anger where one absolutely refuses to listen. I eventually managed to tell her that she could get it sorted by going to one of the company's retail stores with proof of ID, but she wasn't having any of it.\n\nShe demanded to speak to a manager who, unlike me, would *totally* be able to get her reconnected there and then and would *definitely* be able to see the emails I couldn't. I call over my TL, who confirms everything I told her. He also points out that she has received several text messages about late payments (which are clearly visible in the KCIs), and even confirms that the number they were sent to is indeed the one the customer uses, which she confirms. After a few minutes of this, my TL asserts that no, there is nobody in the building who outranks him. He makes a few more protestations, and finally calls over a different TL (who, naturally, is of the same rank). This guy goes through the rigmarole all over again, but somehow manages to get the customer off the phone.\n\nBut here's the thing that I felt warrants sharing. As I'm trying to explain to the customer that we won't be able to provide service until two weeks after the outstanding balance is paid off, the customer gets even angrier and threatens to leave. Straight up says \"Well if you won't fix it, I'll have to take my business elsewhere!\" plus some stuff about being a loyal customer and posting on some forums. I say something to the effect of \"I'm sorry to hear that, but it's your choice.\" More arguing, and she comes out with \"Also, no it's not my job, it's not my choice! You're a customer service representative, you're supposed to fight to keep me!\"\n\nI can't be certain, but I'm pretty sure she read on the Internet that if you threaten to leave, the company will suddenly 'find' all sorts of discounts and special offers you qualify for. Yeah, no. I'm not in sales or retentions. Let those guys and gals try to keep people. I just accept that customers know what they want and give it to them without any annoying \"Please stay!\" efforts. She wasn't expecting to be treated like she knows what she wants, and was apparently perturbed when I was about to giver her what she asked.",
        "created_utc": 1474149942,
        "upvote_ratio": ""
    },
    {
        "title": "Seriously though, you were JUST on with your ISP.",
        "author": "dillhavarti",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/536kwp/seriously_though_you_were_just_on_with_your_isp/",
        "text": "Hi there! I'm a new poster here, and I can't tell you what a relief is is to find so many people who understand what it is to work with people over the phone.\n\nI work for a streaming service, and have done for almost exactly a year. The problems we deal with can be pretty trivial compared to, say, a new phone lost in the mail or credit card fraud. Even so, people still find a reason to raise a fuss, and Friday is a particularly unfortunate day to answer calls for survival.\n\nMy first call upon arriving to work this morning is from a woman we'll call Enid.\n\nMe: Thank you for calling [streaming service], my name is dillhavarti. What can I do to help?\n\nEnid: My internet service provider is doing some work in my neighbourhood today, and they told me that I can't access the internet until later this evening. I'm on my free trial, and I need you to add another day to my trial so I can get the full 30 days.\n\nMe: Okay, and you actually spoke with your internet service company?\n\nEnid: Yes, just before I called.\n\nMe: Well, this sort of thing is exactly what the free trial is for--to make sure everything is set up and ready to go before you actually have to start paying for it--\n\n(This, I admit, was bad phrasing on my part--I was a bit baffled at her request, especially considering we weren't the cause for the issue.)\n\nEnid: --No, you mean *IF I CHOOSE* to start paying for it.\n\nMe: ...Yyyyes. Precisely.\n\nEnid: I don't care about your reasoning for a free trial, I want my 30 days. Now you're either going to give it to me or you're going to lose a customer. What's your answer?\n\nMe (and at this point, I'm very, very irritated, and I don't put on a customer service barbie voice in the first place to keep from sounding robotic): The bottom line is that if we cause an issue which prevents you from streaming, our company takes measures to cover the problem. However, we aren't causing the issue. Your internet service provider is, which you heard from them directly. As it stands, my system has no way to add an additional day to your free trial and it would be unwarranted for me to anyway, so I won't be doing that for you.\n\nEnid (after a brief pause): ...Well I don't believe you. *click*\n\nI can only assume she called back immediately and got the same answer. I desperately hope she cancelled, and I have to wonder what kind of recompense she sought through her internet service provider.",
        "created_utc": 1474104456,
        "upvote_ratio": ""
    },
    {
        "title": "Didnt leave an impression on him, he left an impression on me",
        "author": "Fap-a-matic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/534vca/didnt_leave_an_impression_on_him_he_left_an/",
        "text": "Been a while since i posted and with all the news about exploding note 7s it remindeded me of this call. Title sucks but its the best i could come up with\n\nThis call takes place about 10 years ago, before smart phones, when flip phones still had key pads on them and the RAZR reigned supreme. It actually lasted close to an hour but ive parsed down a ton of the jibberish and back and forth\n\n.............................................................\n\nFap: Thanks for calling Dash cellular, my name is Fap how can i help you\n\nCust: You owe me compensation!!!\n\nFap: Ok, what for sir? was there a billing problem?\n\nCust: No you burnt my face?\n\nFap: Sorry? We burnt your face? \n\nCust: The fucking phone, it got so hot that it burnt the keypad into my face?\n\nFap: It caught on fire? and burnt your face?\n\nCust: No you fuckwit, i was talking to my girl with the phone between my face and pillow and fell asleep. When i woke up my face was hot and now i have a keypad burnt into my face.\n\nFap: Oh wow i am so sorry about that lets see what we can do here, what did your doctor say?\n\nCust: I aint seen no doctor yet, this just happened within the last 15min. Are you going to compensate me for this or do i need a lawyer\n\nFap: Im sorry sir, any issues with device defects would be the responsibility of the manufacturer, and are you sure its a burn and not just an impression from the keypad pressing on your face?\n\nCust: I know what a fucking burn looks like, and i didnt buy the phone from no manufacturer, i bought it from you.\n\nFap: Unfortunately we only offer discounts on the device in exchange for a contract term, we have no liability for the hardware itself. I do see you have insurance so you could contact the insurance company about a replacement.\n\nCust: I dont want a replacement, i want compensation for my burnt face\n\nFap: As i said, any defect would be the responsibility of the manufacturer, i can get you their number if you like\n\nCust: You are the worst fucking company, first you give me a shit phone with shit service then over charge me out the ass every month and now you burn my fucking face and wont even give me a dollar for it.\n\nFap: I can definitely understand your frustration but it is unfortunately directed at the wrong party, i would suggest getting to a doctor to see about the burn, documenting it and.....\n\nCust: I just looked in the mirror, you took so fucking long its already healed itself, go fuck yourself  * **click** *\n",
        "created_utc": 1474070354,
        "upvote_ratio": ""
    },
    {
        "title": "Two conversations from today",
        "author": "toysjoe",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/534rra/two_conversations_from_today/",
        "text": "**Me: [Company name] Elevators, toysjoe speaking.**\n\nCaller: I'm sorry what did you say?\n\nMe [slower and slightly louder]: [COM-PANY NAME] ELEVATORS TOYS-JOE SPEAKING.\n\nCaller: Oh so this is [washing machine company].\n\nMe: What? No!\n\nCaller: Sorry I must have the wrong number\n\nFIN\n\n**Me: [Company name] Elevators, toysjoe speaking.**\n\nCaller: Hi, is this [Company name] Elevators?\n\nMe: Yes.\n\nCaller: I'm calling the [city] office, right?\n\nMe: Yes.\n\nCaller: Do you speak English?\n\nMe: .....I do?\n\nCaller: Oh okay. [Continues conversation.]\n\nFIN",
        "created_utc": 1474068868,
        "upvote_ratio": ""
    },
    {
        "title": "Bank call center",
        "author": "Tvols86",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/534jp4/bank_call_center/",
        "text": "I am setting at my desk pondering where I went wrong in life. I went to school and got my graduate degree and got educated like I was \"suppose\" to. I have worked hard but I can only get shitty jobs. I realized my screw up when I realized that I was practically working for the NSA. It's pretty messed up when you can't give quality service to people. I come from retail and going above beyond to a reasonable degree was appreciated. Now, I have to help an Aboriginee reset there online banking password. God help me! I am so discouraged.",
        "created_utc": 1474065604,
        "upvote_ratio": ""
    },
    {
        "title": "IPhone 7 Release Today",
        "author": "WillamThunderAct",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/533ea2/iphone_7_release_today/",
        "text": "Godspeed to all of you out there that have to deal with this bullshit. I've been receiving calls for orders all. damn. day. I'm going home and getting drunk.",
        "created_utc": 1474051100,
        "upvote_ratio": ""
    },
    {
        "title": "Are you allowed to take breaks at work? or is it scheduled?",
        "author": "smocked_out",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/531wog/are_you_allowed_to_take_breaks_at_work_or_is_it/",
        "text": "Hi guys, \n\nI have been reading about your experiences over the last few weeks and I have to say, I'm shocked and saddened by some of what I have read. I would say that reading them has made me a lot more empathetic to call center agents so anytime I call, I make sure I am on my best behavior so thanks for that :)\n\nI hope this is not out of place and if it is please let me know, are agents allowed to take breaks voluntarily? I recommended a product to my friend that recommends breaks when one is fatigued but she said she didn't think it'll fly. I would like to know if that's the case with many centers?",
        "created_utc": 1474032847,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a survey i can fill out? Or could i speak with a supervisor?",
        "author": "Achiev",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52xljm/is_there_a_survey_i_can_fill_out_or_could_i_speak/",
        "text": "So, today was very unexpected. \n\nI work mainly for a Vision insurance company handling billing, sending out new cards, cancellations, etc. You guys know what i'm talking about. The works.\n\nI had this sweet old woman call in who just needed a new card sent out. So of course I obliged her. I get the card sent, ask her what else i can do for her, and go to send her on her way.\n\nOW: \"Oh, just one more thing sweetie. Is there going to be a survey at the end of the call?\"\n\nMe: \"Oh, no ma'am. We usually don't have surveys, i do apologize.\"\n\nOW: \"Oh that's fine. Could i speak with your supervisor? I just want to put in a good word for you. You did a great job and were very nice.\"\n\nCue me, happy as a clam because i just got an Accolade off a two minute call. Basically meaning, i get a certificate for doing a good job and a cool $40 to boot.\n\nSend her over to my supervisor, and she talks his ear off for five or ten minutes about how well i did.\n\nLiterally all i did was press the \"Send new cards\" button.",
        "created_utc": 1473964088,
        "upvote_ratio": ""
    },
    {
        "title": "\"You can stop apologizing. I know it's not your fault\" Then why are you shouting at me?",
        "author": "Imightforgetmyname",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52xg91/you_can_stop_apologizing_i_know_its_not_your/",
        "text": "Caller: Hello, i recently ordered a parcel and the address was wrong. But it was corrected now. But it has been two weeks now and the parcel is still not here.\n\nUsually we would reship the parcel in this case, but she did not mention that. \n\nWhile i am trying to find her in the system some people are screaming in a foreign language in the background. And the person phone starts screaming in that language, too. Without thinking about putting the phone far away enough for me not too fully hear her screaming in the phone.\n\nAnyways when i find her in the system, i saw the note my colleague left: Please refund the parcel. No reship as customer is going on holiday.\n\nAnd i tell the customer that.\n\nThe customer says: I did not go on holiday, i was here the whole time. This is really shitty.\n\nAnd she complains and i apologize and said i am sorry, but unfortunately i don't know why my colleague did not send out a new parcel, i can only send it out now.\n\nI apologize several times. \n\nCaller: If it does not come next week, i won't order anymore.\n\nMe: Ok, if you want to we can refund the parcel that is coming back and cancel your order. Or we can reship the parcel.\n\nAt one point she said \"You can stop apologizing. I know it's not your fault\". I don't remember when, but if you know that why are you angry at me then and screaming? I mean i did not say that, but she was getting loud, not just being unhappy.\n\nAnyways in the end i send it out again and she says if it does not come next week she won't order with us anymore.\nShe also said something like: \"....if you guys are not able to put in the address correct or do anything right\"\n\nMan, it is always so hard to remember everything the customer says, even though the story would make more sense then.\n\nAnyways, the thing is i don't believe the customer. I could believe that the wrong address was an error a colleague made, since you can misunderstand the street name easily on the phone.\n\nBut how the hell would someone misunderstand that someone is going on holiday. I think the customer probably did not listen, especially with her attitude.",
        "created_utc": 1473962330,
        "upvote_ratio": ""
    },
    {
        "title": "Selection of my favorite letters",
        "author": "itemri",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52wn1y/selection_of_my_favorite_letters/",
        "text": "For purely scientific purposes, I keep most of the physical letters that CXs mail to our office. I thought you guys might get a kick out of some of my favorites (includes an email and Facebook post): \n\n[Obama, can you imagine?](https://www.flickr.com/photos/52517533@N04/29072519254/in/dateposted-public/)\n\n[Saturday Weekend Pass](https://www.flickr.com/photos/52517533@N04/29072519194/in/dateposted-public/)\n\n[Eye twitch](https://www.flickr.com/photos/52517533@N04/29072519144/in/dateposted-public/)\n\n[Surprise me](https://www.flickr.com/photos/52517533@N04/29074285483/in/dateposted-public/)\n\n[\"\"](https://www.flickr.com/photos/52517533@N04/29074285453/in/dateposted-public/)\n\n[Sorry Toki](https://www.flickr.com/photos/52517533@N04/29074285393/in/dateposted-public/)\n\n[Good luck!](https://www.flickr.com/photos/52517533@N04/29074285183/in/dateposted-public/)",
        "created_utc": 1473952575,
        "upvote_ratio": ""
    },
    {
        "title": "\"Did you even go to high school?\"",
        "author": "MTjones",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52uii9/did_you_even_go_to_high_school/",
        "text": "I just found you wonderful collection of human beings, and everything I've read is beyond cathartic!\n\n\nI love everything I've read.\n\n\nSo much so, that I've got to share one of my more memorable experiences working with the general public, as it were.\n\n\nI was working at a call center, doing bill pay and tech support. I'd been exposed to swearing, threats and outright screaming during my time there, so I thought I could take on anything. \n\nThen I got a call from this lady. I'll be Me, she will be Rude Woman (RW).\n\n\nMe: It's a wonderful day here at **************. My name is MtJones, how can I help you?\n\n\nRW: Can you tell me if this new location of yours is open yet?\n\n\nMe: Certainly ma'am, can I please get the address from you?\"\n\n\nShe provides me with address, I verify it with her, I plug it into the store locator. Everything's five by five.\n\n\nExcept there is no store at the address given. No 'future location announced'. Nothing.\n\n\nThis is where things went south.\n\n\nMe: I apologize ma'am, I'm not pulling up a store at that address. Can I verify the address with you once more?\n\n\nRW: Are you mentally retarded?\n\n\nMe: (Almost letting the Good Guy tone slip from my voice) I'm sorry ma'am?\n\n\nRW: Are you completely stupid or something? I gave you the goddamned address, twice already.\"\n\n\nMe: Alright ma'am, I want to help you...\n\n\nRW: Did you even finish High School?\n\n\nMe: (Good Guy is just about gone) Ma'am, that is inconsequential to your call.\n\n\nRW: I'll bet you never made it into High School you retard!\n\n\nMe: Ma'am, would you like to speak to my supervisor?\n\n\nRW: Yes!\n\n\nI hated to do it to my supervisor, but if I stayed on the phone any longer with this shrew I would have lost my mind.\n\n\nSo I put this paragon of human virtue on hold and spoke to my supervisor, told her what the situation was and told her I needed a few minutes to get my Good Guy back.\n\n\nWhile collecting my thoughts I saw my super talking to my new bestie. She made eye contact with me and mouthed \"Oh my God!\"\n\n\nShe later told me that my lovely caller was one of the nastiest customers she had ever encountered.",
        "created_utc": 1473912712,
        "upvote_ratio": ""
    },
    {
        "title": "Things I hate",
        "author": "TheDrachen42",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52tf3s/things_i_hate/",
        "text": "Things I hate working on the phones, having done it for almost a decade:\n*When callers interrupt me to ask me to tell them the exact thing I was just trying to tell them.\n*When callers mess something up, sit on it for days, then call and want it fixed yesterday.\n*When you say \"So you want x\" and they say \"No, I want x.\"\n*When you are active listening by repeating their request to verify your understanding and the caller thinks you are an idiot because of it.\n*Middlemen who sell your product and therefore think they know everything.\n\nOkay, your turn. What kind of calls/callers do you hate?\n\n\n",
        "created_utc": 1473896141,
        "upvote_ratio": ""
    },
    {
        "title": "The only one that has made me truly uncomfortable",
        "author": "turquoisegiraffes",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52q335/the_only_one_that_has_made_me_truly_uncomfortable/",
        "text": "So yesterday, I got a call from an older man who was asking about something to do with his payment. There was a woman in the background giving him a verbal lashing, something about him touching everything and she can't find it, yadda yadda yadda.\n\nI ignores it up to this point because background conversation is fairly common. Until he popped this gem out:\n\n**\"I'm on the phone, SHUT THE FUCK UP!!!\"**\n\nAt this point, I'm startled by how loud, but not the language, whatever. Then he gives me another golden goose:\n\n**\"I'm so sorry, that was my mother, she is mentally retarded and becomes violent.\"** \n\nHe called his mother mentally ill in front of her. I was so uncomfortable the whole rest of the call, she was crying in the background. I went on break after that one.",
        "created_utc": 1473854081,
        "upvote_ratio": ""
    },
    {
        "title": "I am not your \"sweetheart\"",
        "author": "GreatDay4Hockey",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52puga/i_am_not_your_sweetheart/",
        "text": "Being a female, I cannot stand male callers who try to flirt when I answer the phone. I realize they may not have bad intentions, but I'm sorry, I will always find it gross. This is a workplace buddy. You want a dating service, call Match.com.\n\nThis is how I've been greeted on the phone during my tenure: \n\nMe: Thank you for calling company. This is GreatDay4Hockey, how can I help you? \n\nCustomer: \"How are you today, sweetheart?\" \n\nWhat I wish I could say: \"Tempted to hang up on you, pig.\" \n\nOn another occasion: \n\nMe: \"(Same greeting as above)\" \n\nCustomer: \"GreatDay4Hockey, are you as beautiful as you sound?\"\n\nMe: (ignoring his disgusting greeting) \"What can I help you with today?\" \n\nJust yet another reason to want out! ",
        "created_utc": 1473849420,
        "upvote_ratio": ""
    },
    {
        "title": "Just got of the phone and had to share.",
        "author": "thesparkleninjafairy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52prdy/just_got_of_the_phone_and_had_to_share/",
        "text": "So, I've worked in a call center for almost three years and I know how we grill into our newbies to stick to the script and 'personalize' the call *eyeroll*. I called up a courier company to register a pick up for my office and after asking my name this guy must have repeated it atleast twice per sentence. By the fifth time I was cracking up and was really tempted to correct him, to finish the call he apologized about 4 times and asked me to have a nice day twice. Ah to be new to the grind! ",
        "created_utc": 1473847525,
        "upvote_ratio": ""
    },
    {
        "title": "What do you mean I'm reponsible?!",
        "author": "ZAKTMT",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52p9z1/what_do_you_mean_im_reponsible/",
        "text": "I work for a credit union's call center as a banker and very often in the course of the week run into my fair share of hot messes. Now, most people are friendly and are usually satisfied with the service I bring and my success has gotten me accolades on the job in the short time I've been there (10 months) and have even earned a trophy for the sales portion, and recently received promotion to a job in loan processing, where instead of taking 100 calls per day, I would get 2 and deal with mostly title companies. Also, no Saturdays! \n\nSo the other day I got a phone call from a lady. I pull up her account it's got several restrictions on it, but I verify her using our procedures and inform her I have to do some digging. She was initially calling because she couldn't get into her online account. After doing some digging, calling other departments. She had a fraudulent check deposited into her account. I look at it, and it's from someone joint on her account's card. But the fraudulent check shut down her access to her account, her ability to spend her money, and even overdrafted the account because we pulled the funds(YAY!...). For all intents and purposes we'll refer to this lady as Irresponsible Lady or IL for short, and we'll refer to me as Z:\n\nZ: Okay miss, sorry for the wait, it turns out a fraudulent check was deposited into the account so there are restrictions on the online site access, as well as the ability to transact on the account.\n\nIL: No, no, nooooooo. I DIDN'T DEPOSIT ANY FRAUDULENT CHECKS, WHEN DID THIS HAPPEN?!?!?!!?\n \nZ: It happened on a few days ago, it was deposited into an ATM by the joint person on the account miss. \n\nIL: HOW COULD YOU LET THIS HAPPEN, THE JOINT IS IN JAIL!!!!\n\nZ: Well miss, if that is truly the case then you'll need to file a police report and the footage would need to be reviewed from the security cameras.\n\nIL: WHY ARE YOU DOING THIS TO ME!!! IT'S YOUR FAULT!!! IT WAS PROBABLY ONE OF HIS BUDDIES THAT DID IT! YOU TOOK MY MONEY!\n\nZ: I didn't do anything miss, the transaction occurred and since this individual had the card and PIN, they can do that kind of transaction on your account. If you didn't want this to happen with this joint, you should have removed the joint. You are responsible for that kind of transaction on the account for that reason.\n\nIL: I WANNA SPEAK TO YOUR SUPERVISOR!\n\nWell thankfully, my loss prevention department was more than willing to help me out. I waltzed over there to see the commotion. IL wouldn't let my coworker speak. My coworker snapped back, told her to be quiet and to let her finish. I eventually found out that this joint person actually showed up to the branch the day before the deposit. While I was initially sympathetic, this lady showed her true colors when we refused to redeposit the funds from the fraudulent check back into the account. Can't wait to get done with this position in a few weeks. I've got more stories if people are interested! ",
        "created_utc": 1473835798,
        "upvote_ratio": ""
    },
    {
        "title": "Calling into your Phone/Internet/TV company without any ID or account number...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52p8ja/calling_into_your_phoneinternettv_company_without/",
        "text": "[deleted]",
        "created_utc": 1473834918,
        "upvote_ratio": ""
    },
    {
        "title": "But I didn't do that transaction on Monday!",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52p462/but_i_didnt_do_that_transaction_on_monday/",
        "text": "Cx: I have a transaction at [fast food chain] showing on Monday that I didn't do.\n\nMe: Sorry for any confusion, but you did it on Friday night.  As it was after 6pm pacific, 7:44 to be exact, it posts to your account with Monday's date.\n\nCx: No I didn't.  I only bought Gas on Friday before driving to Bellingham.\n\nMe: Which crossing did you use?\n\nCx: Abbotsford\n\nMe: And at what time did you cross?\n\nCx: About 8pm\n\nMe: And what did you have to eat for dinner?\n\nCx: We stopped at [fast food chain] before crossing the border.\n\nMe: Well there you go.\n\nCx: But I never went to [fast food chain] on Monday.\n\nMe: That's why I advised you right from the beginning that you did on Friday.\n\n[Start broken record of \"I didn't do it on Monday\"]",
        "created_utc": 1473832397,
        "upvote_ratio": ""
    },
    {
        "title": "FOR THE LOVE OF ALL THAT IS HOLY, STOP CALLING FROM THE DEVICE THAT YOU ARE TRYING TO TROUBLESHOOT!",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52ou9a/for_the_love_of_all_that_is_holy_stop_calling/",
        "text": "",
        "created_utc": 1473827183,
        "upvote_ratio": ""
    },
    {
        "title": "i always wonder if he got away with it.",
        "author": "skippy51",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52nv4d/i_always_wonder_if_he_got_away_with_it/",
        "text": "i haven't answered the phones in 5+ years but some stories really stick with you, lol. since i worked in order support (thankfully not tech support) my favorites were always the kids. \n\nSuper professional kid calls, I'm guessing he's MAYBE 10. Gives all the right order and billing verification info, calmly asks if we can cancel the order in process. At this point he's doing better than 80% of the adults i speak to. its a $10k computer and its open so i can actually cancel it, and i do, immediately so it doesn't try to ship. \n\nHe's so relieved he drops the act, \"OMG i thought my mom was gonna kill me! Now I don't even have to tell her!\" poor kid. I don't want him to get grounded for building his dream computer and accidentally hitting the quick buy button (how i hate the quick buy button), but there's the little snag of the authorization sitting on his moms card. I coached him on how long the auth would stay visible depending on whether the card was debit or credit and requested an auth removal for him. \n\nTo this day, I still wonder if he confessed, let it ride and got away with it, or got royally reamed.",
        "created_utc": 1473812706,
        "upvote_ratio": ""
    },
    {
        "title": "Leaving one Call Center for another?",
        "author": "kittysue804",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52lyzt/leaving_one_call_center_for_another/",
        "text": "oK so, I've been working for a big bank for over a year now. At first in training I was excited, when I got in the floor I was terrified, my first 5 months were miserable, from 6 months to a year I was hopeful always thought I'd get to move up when I hit that mark, felt like there was light at the end of the tunnel. I had been given extra projects time off the phone to train new hires and lots of promises of promotions in my future. For a while I thought; good for me, I stuck with it even though It was hard and I cried in the bathroom and thought about crashing my own car, but I'm almost done. I was wrong, turns out the career path I planned on taking doesn't exist, my supervisors don't care if move up, and they've changed things a bit so no extra time off the phone. I've lost my hope, feel like I'm pretty close to being just another one \"out on medical leave for anxiety\" cause I'm totally miserable. \n\nSo here I am now, trying anything to get out, but there are very few options. For financial and personal reasons I have to work during regular business hours and I cannot afford a pay cut. ( I.E I have a kid if I didn't I'd be back in retail in a hot minute)\n\nI just had a phone interview with an insurance company. I know deep down its no better it's still a call center, I'll still spend my days giving bad news and getting shat on, but at least it would be a change. I'd get a couple weeks of training and being off the phone, probably less call volume sense it isn't only inbound. \n\nAnyone trade one person hell for another? Any advice? Insiders tip on the horses? Anyone want to trade their useful degree for my history degree?",
        "created_utc": 1473790425,
        "upvote_ratio": ""
    },
    {
        "title": "My bills are black &amp; white!",
        "author": "Joskarr",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52ldj4/my_bills_are_black_white/",
        "text": "Customer calls in complaining her bills aren't printing in colour anymore, they've changed to black and white.\n\nAdvised it could be an issue with the ink, a printer issue, or something within the print settings.\n\nHer response: \"I'll have you know, I used this printer last week and it was printing colour just fine, so fix it on your end!\"\n\n....4 minutes left on the clock. Get me out of here.",
        "created_utc": 1473784041,
        "upvote_ratio": ""
    },
    {
        "title": "I'm burned out and I need help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52jm04/im_burned_out_and_i_need_help/",
        "text": "[deleted]",
        "created_utc": 1473759343,
        "upvote_ratio": ""
    },
    {
        "title": "Last Call of the Day",
        "author": "baby_pan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52izvf/last_call_of_the_day/",
        "text": "You glance at the time and and say to yourself \"come on brain get it together, one more time and we are done for the day\". Your eyeballs try to protest as they burn inside their sockets, whining that the contacts are smothering them to death...\n\nToday I had a realization.. \n\nThe last call of the day is always the longest call of the day. \n\nIt's cool..I wanted to work an hour later than scheduled and get booted from the VPN for being connected for 12 hours, making me clock out even later because I have to log back into everything. \n\n*end rant*\n\nP. S. for the record I should state that I definitely enjoy working at home taking calls more than working at a physical store. :) ",
        "created_utc": 1473746274,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm supposed to have an account, but it doesn't exist.\"",
        "author": "Rhodoferax",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52hk60/im_supposed_to_have_an_account_but_it_doesnt_exist/",
        "text": "A lady calls me, complaining about a delay in getting her phone and broadband transferred from her previous supplier. She was due to go live tomorrow, but for some reason the broadband was pushed back a week. She's angry but doing an admirable job keeping it together while I raise tickets in a vague effort to get something done.\n\nShe also complains that she was supposed to get an online account to view her details, but that hasn't happened yet. I figure it's just a matter of passwords being different and offer to reset, but she tells me no, the account doesn't exist at all. That's strange, since I have her details in front of me, but in the time I've been here there has always been some sort of thing going on with the customer-facing system. I promise to get tech to look into it and we continue.\n\nMore (entirely justified) complaints about how we aren't sorting this out fast enough. I try to find out what's happened to her router, which should be there by now. As we're talking, she asks if there's any way to track it herself. I check, and sure enough, it requires the online account. Once again I try to verify that the error message was definitely that the account doesn't exist, and it isn't just a \"wrong username/password\" thing. Lady swears blindly that the browser told her the account isn't there, though she can't remember the exact wording.\n\nActually, would it help if she tried to log in again and told me exactly what it said? Yes, yes it would.\n\n\"It says 'Your login details are incorrect.'\"\n\nSon of a gun. This happens all the damn time. However the online accounts system is set up, it often doesn't have the same password set that the customer thinks it has, so we need to reset it. Once I know this, I simply reset the password and the lady can log in immediately.\n\nThis lady apparently needs the Internet to work from home. I really have to wonder how someone with a job like that can get a standard error message and leap to such a conclusion, rather than just thinking there was a miscommunication about passwords.",
        "created_utc": 1473725039,
        "upvote_ratio": ""
    },
    {
        "title": "Young Girl got her phone stolen",
        "author": "ManWithoutFearr",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52hdin/young_girl_got_her_phone_stolen/",
        "text": "So this young girl calls in saying that her phones been stolen. She's upset and wants my help.\n\nOf course I try and do the best for her. \n\nI first suggest that I will put a Stolen Bar on the phone and then Blacklist it. She's understanding and says thank you.\n\nShe then asked me if I was going to send out a replacement. I checked her account...no insurance at all.\n\nI say: \"I see that you have no form of insurance for your device so unfortunately I can't offer any form of replacement\"\n\nShe replies: \"see I think that I should get a replacement because (the good bit now) I DIDNT ASK FOR MY PHONE TO BE STOLEN\"\n\n\n\nI muted the call and just chuckled to myself because that was so damn retarded.",
        "created_utc": 1473722650,
        "upvote_ratio": ""
    },
    {
        "title": "The most exasperating rep...",
        "author": "orawnge",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52eirp/the_most_exasperating_rep/",
        "text": "I work as a Sr. Rep in a call center for a bank. The majority of my day consists of fielding questions from agents on the floor, and taking the occasional escalation. \n\nWe had a new hire class recently that, for the most part, was exceptional; the only problem is that one of the reps from said class is barely able to string together a coherent sentence and mistranslates everything the customer asks... an amazing example from today:\n\nExasperating Rep: \"Hey Orawnge, I have a customer on the line who I assume is calling because he's saying his account was transferred to OtherBank and he wants to know how to access it through online banking.\"\n\nMe: \"...he would need to call OtherBank for that information, but his username and password from us will still work with them.\"\n\nER: \"Ok but he has an account with us still and he's not able to see the balance in his online banking.\"\n\nMe: \"Uhh, ok, what's this person's SSN?\"\n\nER: \"XXX-XX-XXXX\"\n\nI pull up the customer's profile; profile is showing one account was transferred to OtherBank and one is still with us. I can view his account still with us via Online Banking, without a problem.\n\nMe: \"So is he getting Very Common Error message?\"\n\nER: \"No, he's checking it through the automated phone line.\"\n\nAUUUUUUGH.",
        "created_utc": 1473689687,
        "upvote_ratio": ""
    },
    {
        "title": "Best Friend Was Murdered. Unable to Give a Damn Today",
        "author": "GlissandosNTrills",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52aw1h/best_friend_was_murdered_unable_to_give_a_damn/",
        "text": "As the title suggests, tragedy has struck (friend was gunned down) and I'm finding it so difficult to not only cope with, but even more difficult to deal with these customers today. And of course, everyone is being an asshole today and I'm just...not here. \n\nAny pointers for just dealing? Because I think I'm on the verge of a meltdown and perhaps getting fired because I KNOW my empathy  statements sound forced af today. Also, no bereavement for friends that were murdered. They're not important enough, apparently. \n\nHelp??",
        "created_utc": 1473630355,
        "upvote_ratio": ""
    },
    {
        "title": "My customer couldn't find a flashlight",
        "author": "sparkle_bomb",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/52ag89/my_customer_couldnt_find_a_flashlight/",
        "text": "For a little background, I work for a major cell phone provider in the retention department.\n\nI was recently helping a customer who had purchased a few tablets but none of them were able to connect to data. He was nice enough but had been trying to figure out why they weren't working for an hour before he decided to call in and was a little frustrated. For the record, the entire call was on speaker phone, his phone was sitting on his desk.\n\nThe very first thing I had him do was verify the SIM card numbers.  In the process, he ended up dropping one behind his desk. He cursed, then muttered something about not having a flashlight nearby. I heard him pull something out of his desk drawer and then all the sudden, he started screaming \"AI! AI! AI! AI!\" and I heard a series of loud clacking noises and then the call dropped.\n\nI immediately called him back. He didn't answer the first time but did the second. I could his wife yelling at him in the background about being stupid. I asked him if he was alright and what happened. His response?\n\n\"Oh yeah, I'm fine. I used a taser as a flashlight. Don't use a taser as a flashlight.\"\n\nApparently it wasn't his first time tasing himself either, as his wife told me from another room. ",
        "created_utc": 1473625103,
        "upvote_ratio": ""
    },
    {
        "title": "Call Avoidance",
        "author": "sideshowblotto",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/527emh/call_avoidance/",
        "text": "We hear stories about dumb customers but what about them oxygen thieving agents? \n\nWe have 100% of all calls audio recorded. 20% are actually video captured as well so basically it's a movie.\n\nI look at a call that is *2* seconds long AND a video call.  Naturally im intrigued and all I see is the agent bringing his mouse over the red release button from the other side of the screen and hit the button (button highlights when you click it) call ends (naturally) \n\nWhy? Just Why? \n\nBlotto",
        "created_utc": 1473575972,
        "upvote_ratio": ""
    },
    {
        "title": "The horse trailer",
        "author": "Swordofmytriumph",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5243yn/the_horse_trailer/",
        "text": "I work in an emergency road service call center and this is the story of the woman I call the Trailer Lady. It happened a while ago when I was still new and wet behind the ears...\n\nMe: \"Thank you for calling ____, how can I help you today?\" \n\nTL: \"My horse trailer has a blown tire!\"\n\nMe: I sympathize and get her membership number and where she is located which happens to be the vet. Her horse is being looked at by the vet as we speak so even if I could snap my fingers and magic her trailer beter she is not going anywhere. Now, whenever we take a call for a trailer, even if the tire is only flat, we need to get info on height, length, how many axles it has, and so forth in case we end up needing to tow it (because people don't take care of their spare tires very well, esp with trailers). \n\nMe: \"What is the height of the trailer?\"\n\nTL: *suddenly screams at this point* \"I DON'T KNOW HOW TALL IS A HORSE TRAILER USUALLY?\" (the height varies widely)\n\nMe: \"Could you guesstimate?\"\n\nTL: *still screaming* \"I DON'T KNOW HOW TALL IT IS!!!!!\"\n\nMe: \"Please give me a guess.\"\n\nTL: \"I DON'T KNOW!\" \n\nMe: *cheerfully* \"Let me place you on a brief hold while I google the average height of a horse trailer.\"\n\nTL: \"TEN FEET! TEN FEET!\"\n\nMe: *still falsely cheerful* \"Thank you so much! What is the length?\"\n\nTL: \"I DONT KNOW, HOW LONG ARE THEY USUALLY?!!!\"\n\nMe: \"could you guess?\"\n\nTL: \"I DONT KNOW!\"\n\nME: *uses my googling voice* \"Ok....let me see....average...height...horse...tra---\"\n\nTL: \"15 FEET! 15 FEET!\"\n\nSuddenly the vet comes on the line and we finish call much better. ",
        "created_utc": 1473528260,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's an emergency!\"... but I'm not giving you any details! [x-post from /r/callcentres]",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/523utn/its_an_emergency_but_im_not_giving_you_any/",
        "text": "Sigh. Another day, another out of hours service desk call.\n\n**Me:** Service desk, how can I help?\n\n**Caller:** Yes. None of our WiFi passwords are working!\n\n**Me:** Okay, just today? for a few days?\n\n**Caller:** That's not important. Give me a new password!\n\n**Me:** Sir, I'm not on site nor am I in a position to generate a new password for you, I will however see what we can do through our escalation contact What's your username?\n\n**Caller:** That's irrelevant!\n\n **Me:** Sir it's not irrelevant, what's your username?\n\n**Caller:** You don't need to know that.\n\n **Me:** OK. Your name please?\n\n**Caller:** That's irrelevant! Give us new passwords!\n\n**Me:** How many people are effected and where are you?\n\n**Caller:** 3 and it doesn't matter where we are!\n\n**Me:** Sir, you've refused to give me any usernames, names or locations - how do you expect me to arrange new passwords?\n\n**Caller:** I don't know just do your job. There's 3 people here with no internet access IT'S AN EMERGENCY *click*\n\nI went right over and told our desk manager, he laughed, I laughed, the cleaning lady overheard and laughed. The guy never got his password reset.\n\n*P.S. Check out /r/callcentres for more of my posts and other call centre related complaints, rants and discussion.*",
        "created_utc": 1473524958,
        "upvote_ratio": ""
    },
    {
        "title": "I haven't met my stats in over two months. How do I get better?",
        "author": "doctorwize",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5238ve/i_havent_met_my_stats_in_over_two_months_how_do_i/",
        "text": "Can you provide tips on how to meet my stats? I work in the tech support department (tier 2) for a major cell phone carrier. \n\nMy big ones are NRS (basically what the customer feels about you). Rated 1-10.\n\nFCR (first call resolution) \"How many calls did you have to make before your issue was resolved?\" Goal is to shoot for 1. A 3 is bad.\n\nAce Resolve (tied into FCR).\n\nAHT (HATE this stat. Has to be less than 1040 seconds a call. After 15 minutes on a call we go into the red).\n\nSelf Service adoptions (How much they use applications and online resources so as to not call us).\n\n72 hour repeat (Did they call back within 72 hours).\n\nI've been listening to some tapes by Brian Tracy (sales guru) and that has helped with building rapport with customers (like using their name, thanking them for their business, etc). But if there are any under the radar tricks or hacks my fellow call center employees know of let me know. \n\nMy goal is to meet attainment going forward before I am finally set free when I find another job. ",
        "created_utc": 1473516556,
        "upvote_ratio": ""
    },
    {
        "title": "Are you too stupid to turn the page over?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/521x3m/are_you_too_stupid_to_turn_the_page_over/",
        "text": "[deleted]",
        "created_utc": 1473488946,
        "upvote_ratio": ""
    },
    {
        "title": "When it's literally not my problem",
        "author": "Cosmonautii",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/521jf9/when_its_literally_not_my_problem/",
        "text": "FTP, LTR. I work as an Internet help desk representative right now. Thursday I got a call from a woman who believed there was a problem with her router. According to her \"the internets not working\"\n\nOkay cool. Go through a couple of troubleshooting steps. She mentions I.E. stopped responding, so I ask her to use chrome. \"Oh yeah that's working.\" Sweet. That means my work is done. \"But it's a problem with the router. The computer is exactly the same as before\" uhhhhhh as soon as you can connect to the Internet that's where my ability to help you ends. Mentions there is a possibility the program got corrupted, she mentioned storms happening lately so I suggest that maybe it turned off wrong during a brown out or something. This literally is beyond my job description. Apparently this isn't good enough for her. \"How long have you been doing this?\" Well, I've been working on computers and doing troubleshooting like this for over 10 years now, and I was going to school for this. \"No, how long have you been with ______\" \n\nOh. Oh god please no. \"Two months\" \"yeah well it sounds like it. You don't know what you're talking about. I want to speak to a supervisor.\" Supervisor says to transfer her over to our premium tech support, which I had suggested right before she took my name and my employee number. I do, and she's like \"I thought I was holding for a supervisor\" \n\n\"Well, they know more than me. ~~not~~\" \"oh well I'll talk to them then.\" \n\nSeriously. Luckily my smoke break was right after that call and I calmed the fuck down but honestly I think I know more. Especially since I'm trained and have more experience than her and certifications in it. ",
        "created_utc": 1473481664,
        "upvote_ratio": ""
    },
    {
        "title": "When people are nice (and you expect them not to be)",
        "author": "Swordofmytriumph",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/520yt9/when_people_are_nice_and_you_expect_them_not_to_be/",
        "text": "I work in a membership based emergency road service call center. Occasionally (though not often), our members will not realize that they are *already* a member and sign up for a second membership. Their disorganization is not, of course, our fault, but when they find out the situation, they get really mad. I have come to expect a certain, shall we say, reaction from people when this happens. I discovered this situation with a member today. I braced myself for the inevitable and delivered the bad news.\n\nmember: \"Oh.\" *Wow this isn't what I was expecting.*\n\nI hurried to assure him that we could refund him for the second membership. \n\nHis response: \"Oh.\" *What do I say now? He's not getting mad, I have no idea what to say because they* always *get mad.* I felt that the rug of reality had been yanked from under me. I did not know how to function in a reality where people were nice about the mix up. \n\nIn the end, he decided to keep both memberships o_0\n\nI left that call still feeling vaguely confused because he hadn't done as I expected. \n\n\n",
        "created_utc": 1473472401,
        "upvote_ratio": ""
    },
    {
        "title": "\"But I don't use 911\"",
        "author": "misslocke",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/520pen/but_i_dont_use_911/",
        "text": "I work for a cell phone company that is geared towards senior citizens. A LOT of them view their bills so heavily that they go through each and every tax listing on their bill and try to dispute it  \n\nCustomer \"What is this 911 operator tax\"  \nME: \"That's the taxes in your area that go to your 911 operators in your area\"  \nC: \"But I don't *use* 911\"  \nWhat do you mean you don't **use** 911? You mean to tell me you won't call them in case of an emergency? Promise?  \nM: \"Well, its kind of like a school tax.. even though you're not going to school.. you're still paying taxes for children to go to school in your area\"  \n.... and cue the customer talking about how Mexicans are taking over the country and Obama is a muslim..\n",
        "created_utc": 1473468585,
        "upvote_ratio": ""
    },
    {
        "title": "But I don't use 911...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/520l8s/but_i_dont_use_911/",
        "text": "[deleted]",
        "created_utc": 1473466909,
        "upvote_ratio": ""
    },
    {
        "title": "It's Apple pre-order day.. can we take a moment for everybody dealing with this?",
        "author": "avarier",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51zie5/its_apple_preorder_day_can_we_take_a_moment_for/",
        "text": "Apple pre-orders started at midnight. Yes, I work for a cell phone call center... please say a prayer for those having to deal with this madness, it's insane.",
        "created_utc": 1473453121,
        "upvote_ratio": ""
    },
    {
        "title": "Upset caller i was not nice to",
        "author": "Imightforgetmyname",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51z3ju/upset_caller_i_was_not_nice_to/",
        "text": "Hello,\n\nThis is the third story i am posting now. I did not even think before that i would have one story to post at this point. \nToday i got the worst call i had so far. \nThis customer was just unbelievable. You might will notice that i was not staying always nice throughout the call either, but to be honest i did not care. \n\nWell, anyways on to the story:\n\nMe: Introduction Blablaba Can your confirm your full name and  address, please?\n\nCaller: *First* *name*\n\nMe: And your address?\n\nCaller: *Street*\n\nMe: And your postcode, maybe?\n\nCaller: *Postcode*\n\nWhen i say confirm your address and name why not just do it? I never confirmed her full details, even though i should have. This was already the first hint that the caller was not happy. Considering that she can't even answer a simple question, it is pretty hilarious that throughout the call she is upset because i don't answer her questions the way she wants me to.\n\nCaller: I have not received my parcel yet.\n\nMe: Yes, that could be because there was a strike in *place* and your parcel might have been affected. Unfortunately we can only resend the parcel if your parcel has not arrived by Monday. \n\nI think the caller said something about a colleague that did not tell her that information, not sure anymore and the caller was not very nice.\nOh yeah, she also said at some point in the call i am very competent (which sounded ironic) and she was also raising her voice several times, but i do not remember the exact order anymore. \n\nCaller: So have other people been affected by this, too?\n\nMe: Yes, others have also not received their parcel yet.\n\nCaller (in a impolite tone): Why don't you say so? Obviously it's because of the strike then\n\nWell, miss i am not a psychic. Excuse me, that i did not form my answer in a way you wanted to hear it. Like what the hell? When i said it could be because of the strike, i meant that it is most likely because of this, but i cannot confirm a 100 %.\n\nI tell the customer several times that we are sorry and we can only resend on Monday. I don't remember exactly what she said. But she kept on repeating herself being impolite and complaining for something which is not my fault. At one point i raised my voice.\n\nMe: YES, BUT WE CAN ONLY RESEND IT ON MONDAY, I CANNOT DO ANYTHING ABOUT THIS.\n\nThat was where i was not nice anymore. From what i wrote what the customer said so far, how i was might seem rude, but as i said, the customer was being impolite and rude but i don't remember everything she said anymore. It might be more understandable if i would. Oh yeah, she was also upset because she needed the products before she went on holiday. So what, what can i do?\n\nCaller: So i will have to call on Monday the fourth time then?\n\nMe: Yes, i am sorry, but we cannot resend it before Monday.\n\nCaller: So i will have to call on Monday the fourth time then?\n\nMe: Yes, i am sorry, but we cannot resend it before Monday.\n\nCaller: So i will have to call on Monday the fourth time then?\n\n*Oh*, *FFS*\n\nMe: Yes\n\nCaller: Just say so already\n\nMe: I just said that several times\n\nCaller: No, you did not\n\nOh, sorry, that i said yeah and then answered with a full sentence instead of just saying yeah. Are you a little child? I couldn't care less if you have to call a fourth time.\n\nCaller: And then something else\n\n*Oh* *no*, *here we go*\n\nCaller: I accidentally ordered the wrong product. Your colleague sent me a return label and said you will sent out the new product when i sent it back.\n\nMe: I am sorry, but your return label is not active yet. I can only resend it, when it is active.\n\nThe customer was getting impolite again don't remember exactly what she said. Anyways, at one point i realized she wants me to send out the product and to pay and just refund the other product when it comes back.\n\nCaller: Yes, that is what i mean. Your colleague did not get that either. Somehow you all don't seem to have this on your radar.\n\nThen again i don't remember what the customer said exactly, but it was impolite enough for me to raise my voice in the middle of the sentence again.\n\nMe: I have sent IT OUT NOW, OK?\n\nYeah and then we were done. Needless to say i did not wish her a nice day.\n\nFunnily enough, later that day, i was told my calls won't be scored (our departments just helps out with calls, it isn't our main job)\n\nAnd another funny thing, i went to track the parcel, because some affected parcels from the strike were suddenly traceable and yep, according to tracking it will arrive Saturday.\n\n...This is why we were told to resend it on Monday.\n\nIf i remember something which i forgot i will add it on here.",
        "created_utc": 1473448108,
        "upvote_ratio": ""
    },
    {
        "title": "\"Thats against the disabled peoples.. rules..?\"",
        "author": "Throwaway908732",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51ymyi/thats_against_the_disabled_peoples_rules/",
        "text": "[removed]",
        "created_utc": 1473442774,
        "upvote_ratio": ""
    },
    {
        "title": "I escaped!",
        "author": "ScrewEater",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51v1pw/i_escaped/",
        "text": "From inside sales to management, it was a call center in denial.  The office was a sprawling landscape of grey misery, still holding the remnants of the ill-fated and quickly outsourced customer service department before it.\n\nThe job was simple: 400 cold calls per day.  400 cold calls on a dialer system per day.  400 cold calls on a dialer system that only populated once the call began.  Research was discouraged.  Using a CRM was discouraged.  One call closes were the norm.  The position was touted as \"big time B2B sales,\" but the pay was peanuts and no one was fooled it was anything more than telemarketing to small businesses.\n\nTwo 15-minute breaks, one half hour lunch, and the oppressive feeling of constantly being watched.  Call counts and talk times and conversion rates were used as if we reps were account executives with territories and goals and well-defined leads.  But still, we were peddling a commodity, instructed to lie and argue and \"don't get off the phone until you get a deal or they hang up on you...then call them back.\"\n\nAnd I tolerated it.  I tolerated it and was promoted for it.  I liked the people.  It was the role that was insane.  \n\nThe last straw came in the form of myself and a handful of other top reps all being demoted and having our pay cut.  The rest of the department received a raise of their commission percentage.  Ours was lowered.\n\n\"Better leads,\" they said.\n\nThe sales board didn't reflect it.\n\nThat was the last straw.  \n\nThere is no greater satisfaction than landing a job that pays double, politely giving two weeks notice (integrity is important), and walking right out the door.\n\n\"There will always be a position should you choose to come back,\" they said.\n\n\"Okay,\" I responded, my mind on the future.\n\nThe end.\n\nGod, it was fucking satisfying.",
        "created_utc": 1473387064,
        "upvote_ratio": ""
    },
    {
        "title": "A real statement from a real person in a position of power",
        "author": "DavidLambent",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51s0yf/a_real_statement_from_a_real_person_in_a_position/",
        "text": "We have a 25+ year employee at our Call Center who is in a position called \"RTA.\"  Quite frankly, I don't know what that acronym means, nor do I really care to.  We have so many bullshit acronyms at this God awful company that I can't keep up with them.  More or less, her job is to sit and micromanage every single second of every employee's time, monitor their login/logout reports and scold them if they're away from their desk for more than a minute or two.  This is a real conversation that was just had between myself (a supervisor), the RTA and one of our lead counselors.\n\nRTA: \"Where is [Employee?]\"\n\n\nMe: \"Bathroom.  She just sent a message four minutes ago.\"\n\n\nRTA: \"She needs to take some Pepto and move it along because we've been holding calls all morning.\"\n\nThen she and the lead counselor proceeded to joke back and forth for several minutes about the need to play the Pepto Bismol jingle in the Call Center because of the frequency of bathroom breaks this morning and how ridiculous it was.\n\nShe then proceeded to walk over to this employees desk and wait until she returned from the bathroom so she could question her as to why she was away from her desk for so long.\n\nSmall side note: Today, I had to print out all fifteen of my agents' log in / log out reports from the last day they worked, highlight any instance where they were logged out of their phone for more than 5 minutes (other than break or lunch), meet with them individually and ask them why they were absent on each occasion and note it accordingly on the paper.\n\nI need to get the fuck out of here worse than ever.",
        "created_utc": 1473350568,
        "upvote_ratio": ""
    },
    {
        "title": "Tech support burnout",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51r80n/tech_support_burnout/",
        "text": "It's been super fun dumping all these stories but this is gonna be the last one for a little bit. This profile has been a throw-away account to dump 15+ years of call center stories, so I'll check it a couple of times more and then I'll leave it be until inspiration strikes again.\n\n---\n\nThis is the story of the call I burned out on.\n\nWorking tech support for cable Internet is tedious for a lot of reasons. People refuse to take your directions, when they call they're upset at least half the time, and when you get a porn addict or entitled stock broker calling they can be downright indignant that the service doesn't run 100% perfect 100% of the time.\n\nAnyway, you eventually get burned out on it. Between the stupid people, the angry people, and the rude people, it all just starts feeling trivial and beneath you. You eventually stop caring.\n\nThat's what I was going through right around when I had one guy who, after some painful troubleshooting amidst the constant complaining, we finally determined we'd need to send a line tech out to sort out what was going on.\n\nUnfortunately in his area we had an unusually high number of people down, and they hadn't declared it an official \"outage\" yet. This meant techs were booking at 2 weeks out.\n\nCx = customer Me = me\n\n**Cx**: Two weeks? That's unacceptable! You need to get someone out here today!\n\n**Me**: Two weeks is the earliest available. The technicians are just booked solid at the moment\n\n**Cx**: But I've got no Internet!\n\n**Me**: Yes that's what the technicians are busy doing: visiting people who don't have Internet and getting them online.\n\n**Cx**: Well can't you bump somebody?\n\n**Me**: No we can't do that.\n\n**Cx**: Why not?\n\n**Me**: Because then the next person could call and ask that you be bumped... and I'm guessing you really wouldn't like that.\n\n**Cx**: Well then you're just gonna have to bring someone in from the outside and send them over! Because I'm not waiting two weeks!\n\n**Me**: Oh you're not? \n\n(I confess, I laughed a little when he said this. Between his expectation that I'm just gonna go hire someone just for him and his insistence that he's not waiting it was... ya. I was done condescending to this nonsense.)\n\n**Cx**: No I am not waiting that long so you get someone out here right now this instant!\n\n**Me**: Well I mentioned this earlier but from what you're saying it sounds like I wasn't super clear with the way I said it, so I apologize for that, but we're completely booked for the next two weeks. What that means to you is that there physically isn't anyone that I can send out to you today, or tomorrow, or any day between now and two weeks from now. So, can I book you for the next available appointment on the 25th? (or whatever)\n\n**Cx**: No, absolutely not. I can't wait that long.\n\n**Me**: Oh I'm sorry. Well did you want to call us back when you're able to wait two weeks and then we can book it then?\n\n---\n\nYes, I admit, that was a horrible thing to say... but I'd just been QA'd and figured it would be a couple weeks before anybody bothered listening to me. Or maybe I hoped they would hear me and fire me. Anyway it never came back to me.\n\nCustomer loses his mind, obviously, finally gets around to asking for a supervisor. I call over to the help desk who were taking supervisor request calls at the time, let them know the situation, warm transfer him over.\n\nChecked his records to see when he was booked... yup. Two weeks.\n\nConsidered canceling it out of spite (it never occurs to customers when they're being rude that we can easily screw them over in hundreds of ways like this)... but... meh. Left it alone. Wasn't the worst I'd had even that week. He just stands out in my mind as the straw that broke the camel's back.\n\nLuckily for myself, the call center, and the world, I came to my senses and left that job soon after.",
        "created_utc": 1473340361,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're a company man.\"",
        "author": "SirGuido",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51nlvm/youre_a_company_man/",
        "text": "I took a call today that lasted 30 minutes.  The gist of the call was that the customer made a deposit to his account after the business cut off and didn't understand how those funds were not available for his debits.  We went around in circles as I explained it to him repeatedly.  Finally he said \"Ok I can see that you aren't going to budge, you're a company man.  Since you won't fix it I'll call back and get someone else to fix it.\"\n\nI said \"Sir, Its not that I'm a 'company man'.  Every bank has specific cut off times for transactions.  Deposits made after that time are not accounted for in processing items received before that time.  There's nothing wrong, that's the way it works.  If you want to call back to speak to someone, that's up to you.  Just be aware that no one can fix something that isn't incorrect.\"",
        "created_utc": 1473282739,
        "upvote_ratio": ""
    },
    {
        "title": "Just because you expect something doesn't mean it will happen",
        "author": "anewpiplup",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51lago/just_because_you_expect_something_doesnt_mean_it/",
        "text": "The security questions story reminded me of a story that I have.\n\nI work at a large insurance company in customer care.  I got a call to send insurance cards.  I was willing to wait on the phone to make sure the cards went through and then this happened.\n\n\"I don't have time to wait on the phone, can you call back to make sure I got the cards\" - customer\n\n\"I'm sorry, I cannot make outbound phone calls\" -me\n\n\"You have my number on file right?\" - customer\n\n\"I do, but I'm not allowed to call it\" - me\n\nThe customer hung up.\n\nOkay then.  If I sent it to the wrong email then that's not my fault and you have to wait in the hold line again :)",
        "created_utc": 1473255529,
        "upvote_ratio": ""
    },
    {
        "title": "Guy can't take the security questions",
        "author": "sweetandsalted",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51l0ji/guy_cant_take_the_security_questions/",
        "text": "Just in a cafe and overheard a guy at the table beside me ranting about how when he called his bank he was on hold for 30-40 minutes and then when he got through they were asking him security questions. Direct quote: \"So I've been on hold for 30-40 minutes and YOU CANT HELP ME\". \n\nBuddy they would have been able to help you after the security questions you incorrigible twatwaffle. It took all my self control to not get up and say that. He ranted a bit more about security questions being a thin, and then smugly said he just hung up.\n\nI don't understand how customers think they have 'won' by hanging up. They're just going to have to call back eventually... ",
        "created_utc": 1473251677,
        "upvote_ratio": ""
    },
    {
        "title": "AVIVA Selection für BLT AG sucht einen Fahrdienstleiter/innen 100% / Zugverkehrsleiter/innen 100% in Oberwil/Basel, Switzerland!",
        "author": "JannyFirman",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51jkum/aviva_selection_für_blt_ag_sucht_einen/",
        "text": "[removed]",
        "created_utc": 1473223581,
        "upvote_ratio": ""
    },
    {
        "title": "Chemicals in my brain",
        "author": "fatalvaux",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51jhtx/chemicals_in_my_brain/",
        "text": "Today I had an escalated call that was too good not to share. I had an agent come to me and say they had someone request to speak to a male supervisor. As the only supervisor on the floor, this guy was going to be stuck talking to me, a female. So I have the agent transfer the call and this guy says, \"I'm sorry, honey, it's nothing against you but there are chemicals in your brain that cause you not to think rationally. I need to speak to a man.\" I was almost speechless but I told the guy \"While I'm a lady, I promise to try my very best to help you.\" He wanted me to waive his installment fee and I literally can't do anything about it so when I denied his request he said \"See, I knew this would happen and you wasted both our time. Please have your supervisor, a MALE SUPERVISOR give me a call back tomorrow.\" He will be pretty disappointed when he gets a call back from my female manager! :)",
        "created_utc": 1473222289,
        "upvote_ratio": ""
    },
    {
        "title": "\"You´re too good so you can go one hour earlier\"",
        "author": "Souzy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51i72v/youre_too_good_so_you_can_go_one_hour_earlier/",
        "text": "Work in a market research call center. \n\nThey let me go one hour ealier today because my \"stats were too good\". \n\nWhat does that even mean? \n\nI mean, I could have worked one hour more and would get that hour paid. \n\nDoes anyone know what the hell that is supposed to mean? \n",
        "created_utc": 1473204769,
        "upvote_ratio": ""
    },
    {
        "title": "It's my fault this happened, but you should give me free stuff anyway because I said so!",
        "author": "expeditethisish",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51i2e1/its_my_fault_this_happened_but_you_should_give_me/",
        "text": "Hi again, back with another short but funny/ridiculous story that happened a few days ago. I actually didn't get this call myself, but my coworker did and told everyone.\n\nA woman called us because her puppy chewed up her brand new $200 leather boots and asked \"what we were going to do about\". My coworker told her that she was sorry, but since we weren't at fault, we'd be unable to offer a replacement pair. This woman goes OFF on her. According to the customer, \"it's our fault that this happened\" and demanded a free pair of shoes and a $50 gift card \"so we can keep her business\". Thankfully, she was transferred to a sup since she asked for one after cursing out my coworker, but we ended up doing 20% off her next order and sending her a $25 promo gift card \"for the inconvenience\". At least we didn't cave in to giving her another pair of shoes.\n\nI swear, I'll never understand people's sense of entitlement as long as I work here. It happens all the time too - people washing dry-clean only clothes and complaining that it got ruined in the washing machine, trying to repair leather products at home without consulting a leather specialist and ruining them, etc. At some point, you just have to tell people \"No\", but we hardly ever do :/",
        "created_utc": 1473203078,
        "upvote_ratio": ""
    },
    {
        "title": "tired of working with jerks",
        "author": "deuxexandra",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51hy48/tired_of_working_with_jerks/",
        "text": "Remember when being an asshole with no social skills meant that you were out the door instead of being promoted? I miss those days.....",
        "created_utc": 1473201597,
        "upvote_ratio": ""
    },
    {
        "title": "When ever I get a call from a dude from India, Sri Lanka etc that they say they are \"DOCTOR...\"",
        "author": "ManWithoutFearr",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51h5yy/when_ever_i_get_a_call_from_a_dude_from_india_sri/",
        "text": "\nAnyone else noticed? ",
        "created_utc": 1473192633,
        "upvote_ratio": ""
    },
    {
        "title": "\"You sound really happy to be there on a holiday.\"",
        "author": "bibeauty",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51gyv1/you_sound_really_happy_to_be_there_on_a_holiday/",
        "text": "No. I'm happy to be here because I get time in a half.\n\n\"Thank you for working on Labor Day.\"\n\nI wouldn't have to work on a holiday if you people stopped calling. Every single person said this. \n\nWe had a skeleton staff and a flash sale on our clothing. I was not happy to be there for that. Yesterday was really busy and scheduling didn't take into account for the flash sale. ",
        "created_utc": 1473190437,
        "upvote_ratio": ""
    },
    {
        "title": "You can't apply manufacturing standards to phonecalls",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51f3t9/you_cant_apply_manufacturing_standards_to/",
        "text": "I'll try to keep this rant short... actually here's the tl;dr: **Quality Assurance in call centers is generally a total fiasco**.\n\nThis isn't true of all call centers, but I've been a lot of them and it is definitely true of 90% of them.\n\nFor the most part this is what happens: a bunch of people who don't take calls or talk to customers sit around and come up with a bunch of random things that should happen on every single call.\n\nThey can be things like:\n\n* Scripted intro (this one makes sense)\n* Scripted sentence at the end of the call (100% awkward 100% of the time, just a freaking awful idea)\n* A specific number of times you offer options (which of course ignores the fact that going through a bunch of options makes sense only about 30% of the time)\n* Some random word salad structure (\"feel, felt, found\", etc...)\n* Phrases that would only make sense on a TV commercial (\"Have I delighted you today?\" No I'm serious I didn't make that up.)\n\nEtc etc etc...\n\nSo now that they've come up with their ingenious ideas, they start going out there to \"improve quality\".\n\nAnd how do they know that they've \"improved quality\"? By making sure people are saying these things every single time!\n\nNow, notice the step they skipped: they never checked to see if any of their bad ideas made customers happier or helped the program achieve its objectives. *That part is assumed and never, ever tested!*\n\nAnd god forbid they ever ask anyone who speaks to customers about any of this... no no no. They've come up with the plan. It's our job to follow it and not have any high-minded notions of knowing a damn thing about how to talk to people.\n\nThe assumption is that just like in ISO manufacturing standards, if you make a product exactly the same every single time, then that product is better.\n\nSo by that philosophy if we told our customers \"Hey, you sound like you smell awful!\" and we all said it on every single call every single time then the calls would be better, because consistency = quality!\n\nJust try telling this to a QA manager. Like talking to a brick wall.",
        "created_utc": 1473167288,
        "upvote_ratio": ""
    },
    {
        "title": "Old one I experienced but still kind of funny",
        "author": "Iconoficons",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51davt/old_one_i_experienced_but_still_kind_of_funny/",
        "text": "So I was working in a parts department for a big box store for their merchandise, (also for people who just need parts for appliances) I get this call from this guy who just got a used floor jack that's missing the handle.\n\nWe use schematics from the manufacturers to pull up the part listing but the only problem is here is this manufacturer puts the model number on the handle itself.\n\nSo I do everything to help the guy who has gone on an expletive laced tirade for about twenty minutes when the OM comes over and tells the guy to never treat one of his agents that way that the whole thing was recorded and being monitored in real time.\n\nKind of felt awesome to see a a use S pos get put in his place.\n\nI would've typed out the full text of the conversation but it was years ago and is pointless, I figure you guys get it though.",
        "created_utc": 1473132750,
        "upvote_ratio": ""
    },
    {
        "title": "Back seat drivers",
        "author": "phiphioception",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51bhwi/back_seat_drivers/",
        "text": "The post about controlling husbands reminded me of a call I had the other day. I asked my caller how to spell his name and as he was speaking, someone else in the background started shouting the letters like they were helping him. Helping this guy spell his own name. Which he was not having trouble with at all. \n\nPlease tell me your stories of \"back seat drivers\" where someone in the background tried to join the conversation by yelling and interrupting.",
        "created_utc": 1473108533,
        "upvote_ratio": ""
    },
    {
        "title": "\"Are you stupid\" - Another delightful customer [X-post from /r/callcentres]",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51bhm6/are_you_stupid_another_delightful_customer_xpost/",
        "text": "As some of you may know, I work an out of hours desk covering multiple other businesses. When a caller reaches us they first hear a message that they've reached the out of hours desk.\n\n**Me:** Service desk how can I help?\n\n**Caller:** Yes. I'd like to know if &lt;building&gt; is open today?\n\n**Me:** Sure, can you just clarify is that &lt;building&gt; at &lt;location 1&gt;?\n\n**Caller:** No it's &lt;location 2&gt; [sarcastically] Are you stupid?\n\n**Me:** Excuse me? Sir, this is the out of hours desk, I'm not on site, I'm just trying to clarify the correct building so I can give you the right information.\n\n**Caller:** Well then transfer me to someone on site, wouldn't that be more appropriate? \n\n**Me:** Unfortunately I can't do that sir but I have looked up the opening times and----\n\n**Caller:** TRANSFER ME TO SOMEONE ON SITE!\n\n**Me:** Sir I won't be able to do that, however the opening times are---\n\n**Caller:** WHY can't I speak to someone on site? I don't want to speak to you!\n\n**Me:** Sir, it's 2:30 am at the weekend. There's nobody on site, hence your call was routed to me and hence \"out of hours service\".\n\n**Caller:** This is unacceptable! I'm heading down to &lt;building&gt; right now to make a complaint about you *click*\n\nWat? Oh and &lt;building&gt; was closed all weekend. Good luck making that complaint, you twatwaffle.",
        "created_utc": 1473108439,
        "upvote_ratio": ""
    },
    {
        "title": "Calls that start off with \"I am on autopay and don't read my bill\"",
        "author": "sideshowblotto",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51b8mu/calls_that_start_off_with_i_am_on_autopay_and/",
        "text": "This will be a short one to start off with...  \n\nCall starts with thus statement than ALWAYS goes sideways... \n\nLast week floor walking agent asks for guidance... \n\nSubject line first out of agents mouth... \n\nCustomer states they never had phone on their account and states they want the year of \"unauthorized\" phone service credited. \n\n1. Terms and conditions state 30 day dispute... Ill do a 30 day credit (usually) no questions asked. 31 or more?  Nope\n2. If a tech came out they explained the phone to the person.  (response is usually I didn't know) \n3. If a tech didn't come out (i.e. They have to go through a validation process authorizing the order.  No validation the phone cancels out) \n\nWe value you so much that we send a bill every month to make sure there isn't any shenanigans... \nOn these calls 1 out of 100 say that they ebill. \n\nI can relate to supervisor Ken because I won't budge from those rules and back the agents up. \n\nHow often do you catch stuff like that? \n\nFirst story, bear with me as I am sending it from my phone.. \n\nBlotto",
        "created_utc": 1473105527,
        "upvote_ratio": ""
    },
    {
        "title": "The controlling husband",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51b42i/the_controlling_husband/",
        "text": "My wife was working another all-woman campaign doing something unique: pantyhose.\n\nIt was a subscription pantyhose service of some kind. They were just calling up existing customers and saying: \"Hey, you good to renew your order? Great!\"\n\nNice, easy, pleasant day's work actually, and they were encouraged to keep the conversations light and friendly which meant some genuine smiles. 95% of the customers were women who were happy to hear from us. The other 5% were men who said they wore them either because \"uh... helps... get in and out of SCUBA gear... ya...\" or would just say \"I love the way they make my legs look!\"\n\nLOL, anyway... the only tough calls were when husbands got a bit nosy. Actual transcript:\n\n---\n\nHello?\n\n* Hi, is Martha there?\n\n* This is George.\n\n* Hi George! Is Martha there?\n\n* I'm her husband.\n\n* That's great! Do you think I could talk to Martha?\n\n* What's this about!?\n\n* It's about pantyhose George. Do you want to talk about pantyhose?\n\n* ... I'll get Martha.\n\n* Great idea George!\n\n---\n\nGuys, your wives can handle things. Let them.\n\n**Edit**: I had it as \"wall-woman\" and didn't notice for hours. I'm tired. Going to bed.",
        "created_utc": 1473103976,
        "upvote_ratio": ""
    },
    {
        "title": "Introduction",
        "author": "sideshowblotto",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51b1w1/introduction/",
        "text": "I just found this subreddit and thought I would say hello.  I love the stories here and will post some of my own here soon. \n\nEDIT wanted to make sure my proper account posted.  I have worked for a call center now (same one) for over several years now and for some reason I enjoy it.  I have been an agent, team lead, supervisor and trainer, did work with wfm as well as interviews, I work for a company that handles inbound calls for a telecommunications company that provides internet telephone and cable services. I look forward to sharing my stories with all of you. \n\nBlotto",
        "created_utc": 1473103268,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, i can totally influence how quick your parcel gets delivered...",
        "author": "Imightforgetmyname",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51ak5w/yes_i_can_totally_influence_how_quick_your_parcel/",
        "text": "Hello guys,\n\nToday i had this customer who was a bit upset, not the worst kind of upset, but just not happy. It's not a big story, but i thought i will share it anyways.\n\nSo, this customer calls up and asks where her parcel is. So i see that this parcel went out on the first september. Now, today is the fifth....\n\nUsually we give 2-5 working days for a parcel. We do not count saturdays as working days, so it's been 2,3 working days since it was sent out. I told her our usual delivery time, i did not tell her that we don't count saturdays as working days, in the end even then it was not even 5 working days.\n\nHer reasoning was that it usually is always this quick and she does not understand why it takes so long this time. According to the track and trace it was also on the way.\n\nI told her several times, or at least i tried, that it says it is on the way and what our usual delivery time is.\n\nAt one point she said \"If this happens again...\" i was thinking she will say something like i won't order anymore, but she did not.\n\nI think she said, but i'm not exactly sure anymore \"...i want you to do something about it\", but what she said does not matter.\n\nEven if it happens again, there is nothing we can do. Especially since the delivery company was not even taking too long, they just weren't as quick as usual. Well, whatever, i tried to tell her several times how it is, but she only repeated herself.",
        "created_utc": 1473097180,
        "upvote_ratio": ""
    },
    {
        "title": "25 minutes of shouting and literally screaming from a customer..",
        "author": "Twopints1977",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51a225/25_minutes_of_shouting_and_literally_screaming/",
        "text": "... while I sit here reading reddit and calmly explaining, every few minutes, whenever I can get a word in, that what she is asking for is impossible and repeating company policy. Ah the joy of the escalated complaints line.",
        "created_utc": 1473091198,
        "upvote_ratio": ""
    },
    {
        "title": "I Want To Speak To A Man",
        "author": "CallCenterConfession",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/51923z/i_want_to_speak_to_a_man/",
        "text": "This one happened to my wife. When a tech support program opened up all of us guys jumped for it, which ended up creating the odd situation of everybody working the cable TV customer service lines being women.\n\nSo this guy calls up swearing and angry and won't even tell anyone what he's calling about, just that he wants to speak to a manager.\n\n\"If there's an issue with your service I can certainly...\"\n\n\"No goddammit you need to put a manager on this line right now!\"\n\n\"Okay you can speak with...\"\n\n\"And he's gotta be a man!\"\n\n\"What?\"\n\n\"No women, it's gotta be a male manager.\"\n\n\"Well my supervisor's a woman and she's the only one available...\"\n\n-- *click* --\n\nAnd then he'd call back and try again.\n\nAnd again.\n\nAnd again. Every time hollering and demanding a man get put on the line.\n\nEventually...\n\n\"Well sir the only manager I can have you speak with is a woman, that's what's available.\"\n\n\"Oh... okay fine. Fine.\"\n\n\"Jenn\" comes by, hears what's been going on, takes the headset...\n\n\"Hello my name is Jennifer, supervisor with XYZ Cable, how can I help you today?\"\n\n\"I... I just...\" and at this point he loses all his fight, starts getting weepy, \"I just want them to put Dukes of Hazard back on the air!\"\n\n\"You... what?\"\n\n\"They canceled Dukes of Hazard! That show...\" and now he's forcing the words through sobs, \"I miss Daisy Duke! God dammit... please bring Dukes of Hazard back!\"\n\nWhen I first heard this I assumed my wife was kidding until I heard it from others who'd spoken to the guy that day and overheard the actual final call. Yeah. This happened.\n\nHe just wanted a man on the line because he didn't want to cry in front of a woman.\n\nDied laughing.\n\n-- ***Okay if you thought that was funny and that's good enough for you don't want some guy's sentimental musings stop reading right here.***\n\n***-- Seriously the rest of this is sentimental... okay you've been warned.***\n\nIt's been a lot of years since and I'm a bit older now and you wanna know something? I kinda get it.\n\nI mean not the \"cry in front of a woman\" thing that makes no sense, women are cool with it when a man cries I don't see the problem there, better than crying in front of your buddies and making them feel awkward...\n\nBut I get his sentimentality. Sometimes I'll hear a song, like [The Outfield's \"Your Love\"](https://youtu.be/xF9J06CAXm8), and it's not even the song itself... I'm reconnected to being a kid in the 80s with jeans that always ended up with holes in the knees, sun beating down on me, and a summer that never seemed like it was gonna end ahead of me... some things make me feel like all my problems are gone and all is right with the world.\n\nThis guy was a Dukes of Hazard fan. Nerd culture is a thing, and not just for sci fi. We get attached.\n\nI'm just glad they finally got around to releasing the series on DVD for the guy. I imagine of him somewhere out there in the southern US, sitting in his Lazy Boy, opening a can of beer, and watching his Dukes of Hazard DVD, one episode a day, and feeling like all is right with the world. Makes me smile.\n\nBet he cried when someone gave him those DVDs for Christmas. :)\n\n**Edit*: punctuation",
        "created_utc": 1473076214,
        "upvote_ratio": ""
    },
    {
        "title": "The last guy I talked to. . .",
        "author": "nntndo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/518h7z/the_last_guy_i_talked_to/",
        "text": "So, had a caller the other day. . . \n\n\nM: Thanks for calling online banking, my name is pinecone, how can I make you miserable today?\n\nC: HI MY NAME IS HELGA AND I AM TRYING TO PRINT OUT MY STATEMENT\n\nM: Sure thing. Can I have your member number please?\n\nC: No, I don't have that with me.\n\nM: Your account number? \n\nC: No, I don't have that.\n\nM: Ok, Helga, may I have your last name? \n\nC: Yes.\n\nM:. . . OK, what is your last name? \n\nThis goes on for a bit. . . I'm sure you've been there. Anyway, she fails verification, but I feel I can show her how to do this without verifying her. \n\nM: Ok, click where it says account, and then go to E-Statement.\n\nC: How do I, \"Go to E-Statement\"? It's not doing anything.\n\nM: Do you see the word \"E Statement?\" It should be highlighted in blue. Click on that, and it will take you to a page that you can print out. \n\nC: Well, it's not. \n\nI'm baffled at this point. This is the simplest of calls, and she is saying the hyperlink doesn't exist. I found out she is using a supported browser on a laptop, and I'm just bamboozled. I even verified she is on the right page but after about 3 seconds. . .\n\n\"Alright, let's go back to the home page. It seems like we're not where we need to be at the moment.\"\n\n\"OK, I am going to get a pizza. I thought this would take 2 seconds. I'll call back.\"\n-click-\n\n15 minutes later, I found out she wasn't kidding, she was chewing pizza on the phone when she called in. \n\n\"Hello, thanks for calling online banking, my name is pinecone, what do you want?\"\n\n\"Yeah, this last guy I talked to, I want you to fill out a complaint for me before we get started.\"\n\n\". . . Ok. What happened?\"\n\n\"He told me that E-Statements aren't available to print anymore, that they can only be viewed and that I would have to take a physical screenshot and print it off from a word document. I know this isn't true, because I did this last month.\" \n\n\"OK, I will file a complaint about him. I am sorry that you had this issue. Is there anything else?\"\n\n\"Yes, he asked me what my password and username was. Is that protocol?\" \n\nI looked at the logs on her account, sure enough, I was the last person she talked to. \n\n\"No, it isn't. I will fill out a complaint and we'll have a look at that. You may want to consider changing your password if you gave it to him. We will do a thorough investigation.\"\n\n-she goes on a rant here about how she didn't give the jackass any information and how she can't believe that the company would hire someone like this -\n\n-repeat verification steps, failed -\n\n-repeat process for finding E-Statements, word for word.\n\nC: \"OK, I found it, how do I print out this month's statement only?\"\n\nM: Well, you can print out the entire statement when the month is over. The only option you have at this point is the last 15 days.\n\nC: I only want the month of September on here. (This was on Friday, keep in mind)\n\nM: Ok, you can always save your statement in a document and take out what information you don't want.\n\n-customer goes on a rant about how I'm too lazy to do my job and she will close her account on Monday. My response that the bank will be closed on labor day causes her to hang up- \n\nSo. . . How do you think QA will handle this? ",
        "created_utc": 1473063592,
        "upvote_ratio": ""
    },
    {
        "title": "Witnessed a comically sexist exchange",
        "author": "Iconoficons",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/517y35/witnessed_a_comically_sexist_exchange/",
        "text": "Background, I help with training and there's this goofy kid in Nike sandals with socks the female OM approaches.\n\nOM: why are you out of dress code?\n\nGK: what do you mean?\n\nOM: you're wearing sandals.\n\nGK: oh so are you and most of the other women here so I thought it was okay.\n\nOM: it's not for the guys go home and change. *promptly runs off*\n\nHe and I kind of just looked at each other like *did that really just get said?*\n\nI kind of chuckled because you could tell by the look on her face she really didn't know what to say...",
        "created_utc": 1473052766,
        "upvote_ratio": ""
    },
    {
        "title": "A Fake Accent Plus A Few Calls",
        "author": "LookingForScaryStuff",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/517de2/a_fake_accent_plus_a_few_calls/",
        "text": "Typing this on a phone. Sorry if there are any formatting issues or any mistakes in general.\n\n\nThe call center I work at schedules auditions for anyone who is willing to call. People hear a radio commercial and hear the number and call my call center. However, this sets me and everyone else I work with on call for pranksters who feel like it's funny to waste our time. \n\nLet me relay a call that I had two nights ago.\n\n*call pops up into my queue*\n\nMe: Hello! This is *my name* and thank you for calling. Can I get you scheduled?\n\nCaller: Yes? Hello?\n\n(This caller had a thick African accent. I get calls here and there with people who have think foreign accents. Thing is, they have trouble communicating with me when I give them simple information. So when I hear a think accent, I get comfy and expect a ten or more minute call.)\n\nMe: Yes, can you hear me sir?\n\nCaller: Yes! I have a few, uh, questions regarding the audition.\n\n(The only info I have are when the audition is, what time it is, and the name of the building where it's happening. That's all I know.)\n\nMe: Alright, what would you like you know?\n\n(I go over the date and time and the buildings name.)\n\nCaller: Ok but do you have address?\n\nMe: No, unfortunately I don't have that.\n\nCaller: Why not? You work there?\n\n(I don't actually work at the audition office so I have to explain what I do.)\n\nMe: I'm part of the scheduling department. All I can do is schedule you or your children for the audition.\n\n(Caller ignores what I said.)\n\nCaller: Is there going to be food there?\n\n(I already told him all I know. I have no fucking idea if food is going to be served there.)\n\nMe: I wouldn't know that.\n\nCaller: Oh......Ok I heard there will be a famous actor there. Do you know who it is?\n\nMe: *Internally* No dipshit, I just told you everything I know. *What I actually said* I wouldn't know that either sir. I'm just the scheduling department.\n\nCaller: WHY ARE YOU BEING RUDE TO ME!?\n\n(By now I don't give a fuck about this call or this guy calling. I ask if he wants to get scheduled.)\n\nCaller: NO I JUST WANT MY QUESTIONS ANSWERED!!\n\nMe: Sir can you hold for a moment?\n\nCaller: Ok.\n\nI turn around in my chair and see that my supervisor and my co-worker are staring at me. I tell my Sup about the call and she tells me to transfer it to her. I do and the call she takes is for a girl. \n\n\nI was talking to a man. With a thick African accent.\n\nThe same number calls back. It's some teenage boy that sounds about 15-17.\n\nMe: Hello! This is *my name* and thank you for calling. Can I get you scheduled?\n\nCaller: Hey, yeah, I'm trying to get my little sister scheduled.\n\nMe: Ok but I need your pare-\n\nCaller: Hold on, my cousin has a few questions about the audition.\n\nMe: Ok? \n\n(I hear fumbling and giggling. By then I knew it was some punk kids calling.)\n\nCaller: HELLO!? IS THIS *my name*? WHY YOU HANG UP ON MY!? WHY ARE YOU SO RUDE!?\n\nI mute my mic and tell my Sup about it. She tells me that if they continue to harass then the police will be called.\n\nCaller: HELLO? HELLO?\n\nMe: If you continue to call this number we will call the police. *click*\n\nNever got a call back from that number.\n\n\n",
        "created_utc": 1473043384,
        "upvote_ratio": ""
    },
    {
        "title": "Some tales from when I worked in a call center",
        "author": "soyuz177",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/517cy5/some_tales_from_when_i_worked_in_a_call_center/",
        "text": "I know that everyone submits these stories here and some of these might just be repeats. But I figured I would share some of my stories from when I worked in a call center for Obamacare from October 2015 to March 2016. \n\nCall #1\n\nBy this time I had been on the phones for at least a month, maybe a couple more. I got a call from a lady who said that she needed my help right away. At this point on the phones I was still the caring representative instead of a disillusioned one (you know what I mean) so I immediately took down her number.\n\nTurns out she was calling about her healthcare coverage start date. A quick check in the notes revealed that the previous rep told her that it could be backdated to January 1st after talking to a SME. But when the escalation was put in (not as in talking to a supervisor, just to move the date back to January) it was denied. The guy in charge (nice guy, I saw him on the floor and he told me when I made a mistake nicely) said that she was notified via mail that she needed to enroll in November for open enrollment making this impossible.\n\nBecause of this inconsistency I called up a SME to confirm. He immediately wanted to know who told the caller that. I was then told she had to file an appeal in order to have it backdated (which basically means we're giving you a \"solution\" so you'll go away).\n\nI informed the caller of this and she was shocked, I could hear it in her voice. Not surprisingly, she wanted to a speak to a supervisor (which was a SME as well). I tried to get her one but a different SME said that was impossible, we were doing interviews for a new company and he didn't have the time with people off the phones. He did confirm that she couldn't have it backdated. \n\nAgain, I went back to her, explained she needed to file an appeal. She was upset and it turned out she had doctor's bills (and from how upset she was they probably weren't cheap). I had to be a little repetitive to get her to understand and she said: \"You sound like a robot, don't you have any compassion for people?\"\n\nI told her that I didn't like this anymore than she did and she hung up.\n\nOf course, the real interesting part of this story is the previous rep. I didn't know who she was at first but I spoke to the girl next to me and something was always wrong about the account after she took the call. For example, she didn't put in someone's husband's income so she could put them on Medicaid (NOT Medicare, this is free insurance for those who have a low income. I was on Medicaid for a little bit when I was laid off). This was a different caller and she was excited about having insurance (from what it sounded like she didn't have insurance before) until I informed her that she qualified to pay after I put in her husband's income and she decided to go without.\n\nCall #2\n\nThis call was similar to the last, only instead of an upset customer she was more irate. She wanted her coverage date moved FORWARD to April 1st but it was March 31st. Since she had a month's worth of coverage she owed and she claimed she couldn't pay that.\n\nShe wanted to speak to a supervisor but I wasn't allowed to do that as they were in training for the new company that was coming in. I told her this and she said that she would call back get a supervisor.\n\nCustomer: And I'm going to tell them how unhelpful you are.\n\nMe: And you can tell them it's my last day too! \n\nAnd that's when I hung up.\n\nOverall, my co-workers were great and I've got some on my contacts list in my phone.\n\nBut like in the movie Clerks, \"this job would be great if it wasn't for the fucking customers.\"\n",
        "created_utc": 1473043191,
        "upvote_ratio": ""
    }
]