[
    {
        "title": "1.6% tip",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qkvhu/16_tip/",
        "text": "Took a $950 order last week, we scheduled extra people, people came in early to help out, prepped extra for the order and for the weekend rush. Made it and delivered it on time, plates and napkins added.\n\n$15. To be split 5 ways.",
        "created_utc": 1485564078,
        "upvote_ratio": ""
    },
    {
        "title": "My job is getting ridiculous",
        "author": "justinistheory",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qktjn/my_job_is_getting_ridiculous/",
        "text": "Just the other day a guy called in sick four hours before his shift. He couldn't find anyone to cover it so they told him he'd get a write up if he didn't have a doctor's note. He offered to just power through it, but they wouldn't let him work since he was sick. Awesome.\n\nI only have Monday and Wednesday in my availability because I work elsewhere and live a fairly busy life. My wife and I managed to get the same weekend off so we decided to take a short trip out of town. Turns out that weekend is Superbowl Sunday and they decided to schedule me. I told them I'd be out of town because I don't work Sundays and had no reason to think I'd be scheduled outside of my availability. They told me if I don't show up, it's a no call no show even though I already told them I couldn't be there that day. Great.\n\nNew policy is throw away pizzas that are mistakes or ones the customer never picks up because they don't want to pay us to eat free food. But we can buy food and eat it when it's not busy. Okay.\n\nNewest thing is they want all the drivers to cross train on other stations so they can help with pizzas when it's busy. Which is great in theory. But not so great when you're getting paid $2.50 an hour. Whether you're on the road or in the store. \n\nJust frustrated. That's all.",
        "created_utc": 1485563420,
        "upvote_ratio": ""
    },
    {
        "title": "I'm into car modding. Will a pizza place hire me if I drive a heavily modified car?",
        "author": "Goodguyscumbag",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qkhfb/im_into_car_modding_will_a_pizza_place_hire_me_if/",
        "text": "I have a 2015 Ford Mustang. It's completely murdered out and has subs where the back seat is supposed to be.\n\nWould any of this stop me from getting hired?\n",
        "created_utc": 1485559471,
        "upvote_ratio": ""
    },
    {
        "title": "I ran away from my customer",
        "author": "rooph4",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qjtu1/i_ran_away_from_my_customer/",
        "text": "Okay so this is my first post ever so please forgive any bad grammer... \nI deliver Chinese food in a small college town. First off I'm a 25 year old woman so I get a lot of surprised looks whenever people open their door. \n\nSo one night I get a call for delivery, whenever you call the store, your phone number pops up with the address  (if you have ordered before) so I ask \n'123 whatever st'? And he's says 'nah nah I'm not there I'm here' \n\nThe new address he gave me was for an apartment complex that has 3 different addresses  (yes it's very complicated) one address has single letters, one has double letters and the last just has numbers. So red flag #1 he gave me the address for double letters but an apartment number with just numbers. \nPeople get confused sometimes so I didn't correct him. \n\nRed flag #2  I ask what he wants and he says 'yea ugh I want 10 eggrolls' and really quick says 'can you break a hundred?' And since my managers don't want me to say no... I said yes. \n\nOkay so I arrive at the address and I'm knocking on the door... I've knocked 3 different times, with a few minutes apart, with no answer. So I walk back to my car and call the customer -no answer- called 2 more times -no answer- so I leave.  As I'm driving away the customer calls me\n'Hello' \n'Where did you go?'\n'Well I knocked several times and called you but no one answered so I left.\n'Well I'm here I'm here come back' \nVery annoyed at this point I turn around and go back. \nOkay so I'm back at this dudes door... I knock -no answer-  the second time lm literally kicking his door as hard as I can (I had already wasted 30 min on this guy so I was pissed off) -no answer- I called ONE MORE TIME -no answer- \n\nSo as I'm hanging up and about to walk away I notice a man walk up behind me. He was wearing all black with a beanie pulled down above his eyes and a bandana around his nose and mouth and had his hands in his pockets. The only thing visible was his eyes. \n\nI instantly get bad vibes. \nHe's literally just standing there looking at me.\nSo I nope tf out of there\n\nI start walking away and as soon as I get around the corner I start running to my car. \nSo he starts running after. As soon as he gets to my car I'm already in it and pulling away. \n\nThe customer doesn't call back wondering where his food was and I'm ready to go gun shopping. ",
        "created_utc": 1485552470,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from an 80s Pizza Guy, VI, being the 6th episode reached.",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qh15q/tales_from_an_80s_pizza_guy_vi_being_the_6th/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when. Here are my Tales from the Pizza Guy.\n\n(still Martinez)\n\nThe worst part of being a store manager is the scheduling (at least it was for me). The restaurant industry is difficult because of all the turnover, and I think pizza delivery is at least as bad as the average, probably worse. I broke my hand once in frustration when a couple of drivers called in sick unexpectedly. I had arranged things so I could get off early that day and get back home -- my friend and I had organized a bachelor party for another friend of ours. We were actually hosting the party (we lived in a live-work warehouse space in Emeryville and had a lot of room) and had carefully picked out a performer appropriate for a bachelor party. “Fifi” was due to arrive about 7:00, and at 5:00 I was short drivers. After the second driver called in sick and I couldn’t get anyone else to come in, I slammed my hand on the schedule board as hard as I could. I think at that point one of the day drivers took pity on me at that point and agreed to stay for a double shift -- thanks, Mike. My hand hurt for years after that.\n\nA good friend of mine drove for me at this store. One night we were closing together, and I had just finished prepping the bank deposit and went out the back door to take out the trash. While I was out there I saw a guy with a very big firecracker. He warned me, then set it off and there was a huge BOOM. I nodded to him, and then went back in the store -- to see my friend standing by the door with the pizza fork in his hand -- terrified. He thought I’d been shot and they were coming in to rob the store. He said was thinking to himself, “Well, ADeweyan’s dead, so what do I do now?”\n\nThe store was near a Middle School, and lots of kids would walk by on their way home after school. I had to have a talk with one of the dayshift drivers because he would stand in the door and leer at the (very) young Middle School girls as they were walking home. In his defense, he was only 18 and the girls were dressing provocatively, but still...\n\nThis is also the period when one of the assistant managers of another store was fired for inappropriate conduct. Apparently he and one of his phone girls were having sex in the walk-in -- there had been a promise about a raise…. Assistant managers didn’t have the power to give raises. He was fired, but I think she continued working at a different store.\n\nOne of the drivers banged up her car when a bee flew through the window. When she noticed the bee, she quickly pulled over and jumped out -- forgetting to set the brake. The car (an old Volvo) rolled down the hill and hit a tree near the VA Hospital in town. We had a lot of fun with that one. This driver was the area supervisor’s wife -- and had managed one of the other stores. She took over for me at this store when I went back to school.\n\nAnother driver I remember from this store was an older gentleman (I think he was 50, which was ancient to me then). He was Mormon, and had a very large family in Sacramento (about an hour away -- longer at rush hour). His job was in the East Bay, however, and he stayed in a rented room during the week and only went home on weekends. He took the job delivering pizza because he needed the extra money to support his family. Any manager will tell you that older employees like this are like gold. They are serious and professional and get the job done without a lot of fuss.\n\nOne of the phone girls at the store was a pretty blonde who was dating the manager of one of the other stores. She was a good employee for the most part, but she could be a little whiny. And I always knew when she was trying to manipulate me. She would normally stand very close when you spoke to her, but when she wanted something, she would move so close that her breasts would touch my chest. I would take a step back, and she would move forward. It seemed so transparent and natural to her that I’m not even sure she knew she was doing it. Didn’t Seinfeld do an episode about “close-talkers?”\n\nThis is the store where I always billed my crew meetings as “Crew Meeting and Donut Fest,” you’d be surprised how far a box of donuts can go to help morale in a store.\n\nWe tried an intensive promotion that year. We identified a two-block area and door-hung the houses weekly, tracking their orders. Each week, any house that hadn’t ordered got a larger coupon. It started with one dollar off, then two, and so on. At the end, after we had given the remaining houses coupons for a free small pizza, we would call them and ask why they hadn’t yet ordered. The call I remember was a young man at a house with a large family. He said money was very tight, and that with eight people to feed, a small pizza wasn’t worth the trouble. That was eye opening for me.\n\nAt one point a young couple (well, young for me now -- they were old to me then) came through. They were in the process of building and opening a new Domino’s in a nearby town and needed work until it was ready to open. They were very professional and knowledgable. I think they had worked their way up in corporate stores. I remember them taking me aside just before they left, telling me that they respected me and wanted to warn me about the franchise owner. What he was doing wasn’t right (I think it had to do with both salary and bonus being tied to profit margin and store performance). I pretty much knew what was up, and I was on my way back to school at that point anyway, so I didn’t make any waves -- not that there would have been much I could do anyway.\n\nMartinez is the store where I had my saddest delivery experience (one I’ve relayed previously on this sub). I delivered to a house that was in a remote part of the city. My memory is of the house being at the end of a thickly tree-lined street, the only house at the end of a block (it may have just been a long driveway). There weren’t many places like that in town, and the house was very distinctive. I get to the door and it’s a father and his two young daughters. They are laughing and excited about a pizza, and he’s cheerful and enjoying his kids. Just a week or two later a photo in the paper catches my eye. It’s the house I had delivered to. The father had taped up the doors and windows and turned on the gas stove without lighting it. He killed himself and his perfect little daughters. I don’t remember the whole story, I think his wife had died recently and it was too much for him to handle. I have tried to go back and locate the article but haven’t been successful. It must have been ‘86, but I don’t remember what paper it was.\n\nI left the Martinez store in the Fall of 1986 when I started at UC Berkeley. I had taken two years off from school, working full time at Domino’s pretty much the whole time.\n\nNext stop, Berkeley &amp; El Cerrito...",
        "created_utc": 1485522950,
        "upvote_ratio": ""
    },
    {
        "title": "As I am not a muppet vampire I'm going to decline.",
        "author": "TheVoicesSayHi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qgcp3/as_i_am_not_a_muppet_vampire_im_going_to_decline/",
        "text": "This happened a week or two ago now when it was dipping below freezing in NC\n\nSo  I was on delivery and it's mostly just misting at that point but it's about 39 degrees out and I pull up and get to the guy's uncovered porch\n\n\"Hey there sir, how're you tonight?\"\n\n*grunt*\n\n\"...that's just $13.83 tonight sir\"\n\nSo he hands me a twenty and a bag full of pennies.\n\n\"Can I just get a ten back?\"\n\n\"....\" I just look at him \"what's this?\"\n\n\"$3.83 sorry it's all I had hyuck\"\n\n\"Well this is a twenty\"\n\nSo I gave him his baggie back, gave him $6 and said have a blessed night and I left. Sorry dude, I'm not counting out three hundred pennies, I'm not taking them without counting and more to the point when you announce at the start I'm not getting a tip you can just fuck off",
        "created_utc": 1485511590,
        "upvote_ratio": ""
    },
    {
        "title": "It's not the dollar amount, it's the principle of the matter.",
        "author": "joshuabeebe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qfwbh/its_not_the_dollar_amount_its_the_principle_of/",
        "text": "Earlier, I had a woman come into the store asking for change. Her body language was off, just acting like she was nervous. We're not supposed to give out change but there is a laundromat really close so I figured it would take a few seconds.\n\nShe asked for two dollars in quarters and handed me a bunch of assorted change. I put the quarters on the counter while I counted the change. She snatched them and rushed out the door. She gave me $1.50. I loudly said, \"not today!\" and rushed after her.\n\nshe tried to pretend like she didn't see me. I knocked on her car window and told her she was short. She had plenty of change in her car, but suddenly she acts like she can't count. She hands me 2-3 coins at a time (mostly pennies) and asks \"How much is that?\" after each group of coins. It took 6 minutes to get 50 cents, and I got every penny I was owed. \n\nIf she had simply asked for some quarters, I would have given her some from my car. Hard times fall on everyone. Just be honest and don't try to screw me over at work.",
        "created_utc": 1485502626,
        "upvote_ratio": ""
    },
    {
        "title": "How bad is it to tip in quarters?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qdaea/how_bad_is_it_to_tip_in_quarters/",
        "text": "Not sure if this is allowed here. If not, my apologies! I read your stories a lot and find them entertaining. \n \nI have change. How annoying is that? I could give a $5 bill. Otherwise...quarters. ",
        "created_utc": 1485469359,
        "upvote_ratio": ""
    },
    {
        "title": "Tales of an 80s Pizza Guy V: This time it's personal",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5qaf9p/tales_of_an_80s_pizza_guy_v_this_time_its_personal/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when. Here are my Tales from the Pizza Guy.\n\nMartinez\n\nAfter about 6-months managing the Walnut Creek store, it was time for me to move over to a new store they were opening.\n\nIt was exciting managing the opening of a brand new store. Because we were starting from scratch, it was relatively easy to increase earnings every week and I ended up winning a national award for consecutive record weeks that year (I think it was 11 weeks). That year I think the National Conference was held in Phoenix. I learned a lot about wealthy people at that conference. Basically I learned that it doesn’t take a genius to make a lot of money. The wealthy store owners mostly just sat around in the pool all day getting drunk and leering at women. I remember running around the resort playing Lazertag with one of the other managers.\n\nWe had a big grand opening event with a contest to win a new bicycle. The deal was you would buy a slice, and if your plate had a star on the bottom, you won the bike. There were a couple of girls (probably 12 or 13) who really wanted that bike. They bought several slices and each time said something about hoping it was the winning plate. This was not random at all. The area supervisor was in charge, and he eventually decided it was time for someone to win the bike. I told the supervisor we should give it to them, but he said that he didn’t want his picture in the paper with them -- they weren’t cute. He ended up giving it to a pretty young woman who just wanted a slice of pizza. She even said she already had a bike. But, it’s true, he had his picture in the paper with the pretty young woman. I felt terrible about that -- and it also illustrates one of the ways attractive people can have advantages in life they may never realize.\n\nBo was a miserable driver. He’s one of the few people I have a clear memory of firing, partly because it was satisfying and was a long time coming, but also because he was so upset and begged me not to fire him. Bo would be out on a delivery for 45 minutes and not even think about calling the store for help. He would call the customer several times (from payphones -- this is long before cell phones) and STILL not be able to find the address. Bo was also kind of annoying, and he persistently hit on the female employees even after being asked to stop (by them and me). It was that last one that put me over the edge. I figured we could train and help him to do better on deliveries, but when I realized he wouldn’t stop annoying the other employees he had to go.\n\nI don’t remember actually firing many people. Usually if someone wasn’t doing well, they weren’t happy and left on their own pretty quickly. Apart from Bo, I probably only fired maybe three or four people.\n\nI loved making pizzas (still do actually -- I make pizza for my family a couple times a month). I wasn’t the fastest in the area, but I was one of the most consistent (and I certainly wasn’t the slowest). The Martinez store was on one of the main avenues leading out of their waterfront downtown. They would have fireworks on the waterfront on the 4th of July, and for about an hour afterwards there would be a solid line of cars inching along outside the store. One of the owners knew about this, so he had us make 50 small pepperoni pizzas, and sent drivers out to sell pizzas directly to the people stuck in the traffic. It actually worked out pretty well. I think we sold every one of those pizzas. And I got to slap out and sauce 50 small pizzas without stopping -- that was really fun.\n\nI wonder whether actually making pizzas has changed much over the years. At these stores, they used a large spoon to spread sauce -- one of those giant spoons you see at a cafeteria. You would plop the sauce down in the middle, then move it out on one side using the spook like a windshield wiper. Then you would rotate the dough and do the other side. At Santa Barbara, we used a ladle -- and I was fairly vocal about thinking that was much more efficient -- you just spiraled the sauce out from the middle without having to turn the dough. Eventually the supervisor brought in a “spoodle” -- a cross between a spoon and a ladle. The two owners and a couple of other managers came to the store so I could show them how to use it (no one here had ever used a ladle). I remember the first time I used this. Several people were watching, and it took me a few seconds to get going. I plopped the sauce down, then spread it around a bit, getting the feel for the spoodle -- in those two seconds, one of the other managers started saying something like “that’s ridiculous...” but before she could finish I spiraled the sauce out and the it was done. She shut up at that point and pretty soon all the stores were using spoodles.\n\nWe had another driver who I always figured had to have been someone’s sex slave, a “kept man.” He was mid twenties, very buff and good looking, but was not especially bright and knew little about how to get along in the world. He didn’t have a car, so he drove the store truck on deliveries. His first week there he was on a delivery when he ran out of gas -- he claimed that he didn’t know you had to put gas in a car. And then one day he disappeared. He had driven the store truck home, but didn’t come in for his next shift, didn’t call -- nothing. We were worried about him, and I imagine we called the police after he’d missed a few days’ work. The area supervisor eventually found him. I think he saw the truck parked out in front of one of the guy’s friend’s apartment. The supervisor didn’t have a key to the truck with him, so he opened the hood and took the distributor cap. When finally confronted the guy didn’t realize he’d done anything wrong. He had just needed a break and decided to take some time off. He was surprised when we fired him.\n\nWe had a customer who ordered once a week or so for several weeks -- and reported a problem every time. We had sent him several free pizzas. The pizza was wrong (though it matched what was on the order slip), it had arrived cold, it had a foreign object in it, and so on. Finally he calls one night and wants to order three of four pizzas for a party. I got on the line and told him we could not deliver to him. We went back and forth for some time. I simply stated that for whatever reason there was always a problem with his order, and we could not continue sending him free pizzas. He gets irate, accuses me of calling him a liar, and then hangs up. A few days later I get a notice that I am being sued for libel. His claim was that I falsely called him a liar in public. When I contacted him and told him we were just on the phone, he said he couldn’t know how many people were in the store listening at that time. I don’t quite remember, but I think he was asking for $10K - $20K in damages. I had this hanging over my head for several weeks before he dropped the suit. It was my night off and the assistant manager called and said this guy had come by, told her he was dropping the suit and left me a bottle of champagne. I was disgusted by the whole thing and told her to take the champagne herself.\n\nOver the months we rang up a bunch of bad checks, and several from one guy. We tried calling and even stopping by his house to collect, but he refused to pay up. The supervisor noticed the guy had expensive wheels on his car and said he “knew a guy.” The next time I asked the supervisor about it, he said it had been taken care of. He wouldn’t say anything more than that, but I’ll bet the guy came out one morning to find his car up on blocks.\n\nTo be continued...",
        "created_utc": 1485440929,
        "upvote_ratio": ""
    },
    {
        "title": "Don't be a jerk",
        "author": "SilkScreenSiren",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q9k57/dont_be_a_jerk/",
        "text": "One night I get a delivery to the local bar. It's usually nice to go there because drunk people offer to buy you drinks and/or tip really well because they're drunk and jovial. But this guy.\n\nHe was acting normally at first, he greeted me and signed his receipt, but as I turned to leave, he mumbled something. So I said , \"Excuse me?\" because it was kinda loud and I thought I forgot Parmesan or something.\n\n\"I hope you enjoyed raping me!\" He yelled.\n\nI was taken aback. I don't know this guy. I didn't even take his order. He goes off on some rant about us charging him $40 for pizza and it's robbery and he's not tipping me because we charged him so much. So I just leave, and one of his friends (or maybe just a sympathetic stranger at the bar) slips me $2 as I slink out. These are the things I should have told him, but I clammed up:\n\n1) That's a completely inappropriate thing to say to someone you know, much less a damn stranger.\n2) If you wanted to stick it to the man or whatever, you shouldn't have bought the pizza. The pizza chain got their money when you paid for it, and they don't give a good Goddamn whether you tip me or not, and because you proved you'd buy their product no matter how expensive, they're not gonna lower the price.\n3) You got two specialty pizzas. They cost $15, and it's $2.75 for a delivery fee. None of that's my fault, it's just how much is costs. If you want cheap pizza, get whatever promotion is running even if it's not exactly what you want. Use a coupon. Or better yet, buy a frozen pizza for $7 and bake your own dinner.\n4) I didn't take your order or set the prices for the food. I'm the lowest on the company food chain, Idk why you think I can even do anything about it? I did my job, which was to bring it to you. Don't be a dick.\n\n",
        "created_utc": 1485427717,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to a school on lockdown today",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q80zw/delivered_to_a_school_on_lockdown_today/",
        "text": "(Apologies in advance so spelling/syntax since I'm on mobile) TL;DR at the bottom.\n\nSo it had been a pretty slow day as far as deliveries went and I got a cash delivery to an address I immediately recognized as a high school with the instructions \"we're in the gymnasium\" so I'm thinking it's some kid who's at a sporting event or something. I bag everything up and prepare to drive out and wait in the school office for like half an hour for some kid who probably won't tip or even mind thier manners as is the norm with high school deliveries. As I'm driving up the street I notice that a lot of cars are already parked on the street and that all the side streets are blocked off. I think maybe there's some sort of big tournament or something today and they don't want parents swarming the homes nearby for parking. As I keep driving since there's A LOT of blocked off roads I notice that one of the roads is blocked off by a couple of traffic patrol cars and a house further down that road is surrounded by  police cruisers with their lights on. \n\nI finally find some parking at a park a couple blocks away from the school and walk on over to the front office. As I pass the school fences kids are screaming out to me like I was the only sign of food they'd seen in days. I smile and wave to them for lack of a better response and then out of nowhere all the shouting kids are downed out by a police chopper. I finally make it over to outside of the front office and some very displeased looking school administrators greet me and explain that the school is on a complete lockdown as ordered by the police. One of them offers to take the pizzas off my hands and come back with the receipt but I can't do that as its a cash order. I call the boss and tell her about the lockdown and we come to the decision that I should just hang out and see if it ends soon since there's been no other orders since I left. I ask around the admins and they barely know anything so I start texting the kids I'm supposed to deliver to telling them that I can't get in the school because of the lockdown.  As this is happening a parent who works at the police station a down over uses his badge to get through the lockdown and pull out his kids. The other parents lose thier shit after seeing this.\n\nThe kid texts me again with a selfie of herself and her friends saying \"we're gonna die please feed us\" and then asks if I can slip the pies through the bars. I ask the admins if this is okay and they reply with a big fat no. At this point I realize that my presence might start some sort of riot if I say any longer as the parents are now trying to bid on my pizzas and the kids and attempting (and succedding) to jump the fence. I call in to cancel the order, text this girl back explaining that I simply can't get to her unless I want to get taken down by cops and proctor, and make my way back to my car. I ended up giving a couple of slices to some poor mom who looked like she was about to pass out and as I was getting back into my car and sneaking a slice myself kids starting streaming out of the school. The all clear was given minutes after I cancelled the the order.\n\nWhen I got back I saw in the group chat that one of the insiders had been driving by and took a picture of me and put the text \"when there's a lockdown at school and you might die but pizza is life\" on it. We all had a laugh at my efforts to get the pizza delivered\n\nTL;DR I became an in-store meme",
        "created_utc": 1485401494,
        "upvote_ratio": ""
    },
    {
        "title": "If there's a Pizza with no sticker for it that just came out of the oven don't fucking eat it!!!",
        "author": "KingEC",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q6sv5/if_theres_a_pizza_with_no_sticker_for_it_that/",
        "text": "Wasted 20 mins for one pizza l needed for my delivery because someone ate a piece",
        "created_utc": 1485387416,
        "upvote_ratio": ""
    },
    {
        "title": "Was I Scamming The Pizza Hut Call Center?",
        "author": "loetz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q4k3g/was_i_scamming_the_pizza_hut_call_center/",
        "text": "A little over 15 years ago, a friend of mine told me that I could get a student discount from Pizza Hut. I used to call the call center to place the order, and every time I talked with them I had to explain what the discount was. Sometimes it took a lot of convincing for them to give it to me. After a year or two, I started to realize that nobody outside of my friend had ever heard of the discount. I can't remember how much it was, but it was something insane like 40% off.\n\nIs there a chance that he had just dreamt it up and we were scamming them? I can remember some calls where I got really insistent with the person on the other end. I remember them saying things like, \"I have no idea what discounts your local Pizza Hut offers. The call center is over an hour away!\" In the end, they always gave me the deal. \n\nEDIT: *Dear Jesus up in heaven. Please forgive me for my transgressions. Reddit has spoken and I have sinned. I admit my guilt. I did something bad. Please forgive me for my trespasses. Hail Mary, full of grace.*",
        "created_utc": 1485365750,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from an 80s Pizza Guy, Episode IV",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q3cg1/tales_from_an_80s_pizza_guy_episode_iv/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when. Here are my Tales from the Pizza Guy.\n\n(Still Walnut Creek)\n\nI'm not sure about timing of all these stories, so some of them happened while I was a driver, some while I was an assistant manager, and some while I was the GM (or \"Store Manager,\" as we called them).\n\nOne night someone stole a pizza off the top of a driver’s car in the parking lot (he’d left it up there to run in and get the sodas he’d forgotten). We quickly remade the pizza and got it in the oven before calling the customer to tell them that the pizza might be a little late. They were surprised to get the call -- their pizza had just been delivered. The thieves delivered the pizza and kept the money (plus a $5 tip, the customer said). I wasn’t even mad....\n\nWe had hired this guy who was very good looking, but had an attitude. All he wanted to do in life was to become a professional gambler. His attitude was that he had been hired to deliver pizza, and he wasn’t going to do anything else. We’d ask him to answer phones, make pizza, or sweep the floor, and he would often just stand there waiting for a run. I don’t think he lasted very long, but he lasted longer than he probably would have because whenever we asked him to do something and he would resist doing it one of the female drivers who really liked him would do it for him because she wanted to keep him around. She admitted this after he eventually was fired.\n\nThen there was the driver who chewed tobacco. He always had a cup in his hand from the 7-11 next door -- and he’d periodically just squirt some of his tobacco saliva into it. You’d be talking to him about something and he’d just bring the cup to his mouth and “squirt” as if that was remotely socially acceptable. He left his cup sitting somewhere when he left for the day and someone would have to pick that thing up and throw it away.\n\nDuring this time I had won some sort of bonus (probably the store’s first $10K week -- but I’m not sure). The prize was a trip for two to Hawaii to stay in the owner’s condo on Maui. I didn’t have a girlfriend at the time, but I considered taking one of our female drivers, Wendy. We weren’t romantically involved, but we were friends. Instead, I got them to give me cash and I bought a scooter. I remember strapping a hotbox on the back of the scooter to take pizzas to a booth we had at a (very crowded) local event. The scooter served me well when I went back to school too -- parking around Cal is crazy. I eventually sold it and bought a motorcycle.\n\nOne day we got an application from someone who, to put it delicately, had overpowering body odor. It was so strong that days later I had to trash his application -- the application itself was making the office stink.\n\nI’m sure this isn’t unusual, but we had a customer who called to order the same thing just about every day at lunch time. It got to the point where he would call and just say “hey,” and we’d say “got it,” and hang up -- and 15 minutes later he’d get his small pepperoni pizza and coke.\n\nI’ll never forget “Cinnamon” a young woman we hired who could totally pull off that name. She was gorgeous. It was with Cinnamon that I realized the corrupting influence of money. All the guys were fighting over who would get to train Cinnamon -- not because she was so attractive, but because they knew they would get great tips when she was with them on her training runs.\n\nOne day a driver showed up in a car with a busted muffler -- I think his usual car was in the shop or something. You could hear the thing for blocks. He took a run a few blocks away, and we could hear the entire delivery -- all the way to the address, the stop while he delivered the pizza, the start up and the whole return trip. I think we let him stay inside and I went out on delivery after that (I sure as hell didn’t let him drive my car).\n\nThe local electric utility needed to do some repairs on the line near our little strip mall, and told us we would not have power for two or three hours one weekday evening. They scheduled the work for after the business hours of most of our neighbors, but of course, it was our dinner rush. With the power off, our phone lines would work so we could receive calls, but our phone system itself would not work -- the phones wouldn’t ring and we couldn’t dial out or switch lines. The supervisor had me stand at the counter in that store for two and a half hours, picking up the phone every minute or so, and telling the customer we were temporarily closed if there happened to be someone on the other end of the line.\n\nOf the stores I worked at this one had the most car culture. Joe, the store manager who walked out after being held up twice in a week, drove an early-70s muscle car that he loved, but he wasn’t as crazy about his car as Jeff. Jeff was one of our top drivers despite having a mild disability and walking with a pronounced limp. He had a tricked-out Toyota Celica, and was always talking about what he had done and was going to do to the car. I remember he took me out to some backroads one afternoon to show me what his car could do. This sort of thing is contagious, and I started tweaking my car (despite the fact that I was saving money to go back to school). I installed high-end struts in my RX-7, and placed an order for wheels and tires to the tune of about $1,200 from one of the ads in the back of Road and Track magazine. The fact that I was saving money for school, and the fact that the wheels and tires I had were just fine got to me and I canceled that order not long after placing it.\n\nA customer called one night to report that there was a hair in their pizza. Of course we apologized profusely and promised to send out a new pizza right away. About the time the pizza comes out of the oven, they call back -- it’s OK, they say, we just didn’t eat that piece. But the pizza is made, so we tell them we’ll bring it out anyway. I make the delivery and they give me the piece with the “hair” in it. There was a piece of cat fur laying on top of the pizza. There was no way that came from our store. At least they had the decency to feel bad and try to cancel the request.\n\nOne more story from this store… This was a while after one of the 49ers’ trips to the Super Bowl, and the area supervisor had gotten a deal on commemorative glass bottles of coke. We had a stack of probably twenty or thirty flats of these bottles, I’m guessing 12 bottles to a flat. They were just stacked against a wall in the back of the store -- at least they were until someone clipped the stack while going around the corner. At least half the flats fell and probably a dozen or so bottles shattered on the floor. I’m pretty sure we didn’t get any more drinks in glass bottles after that. On the plus side, once we got things cleaned up, the floor looked really good (this is not a recommended cleaning technique, however).\n\nI remember the incident with the glass bottles of coke happening in December 1985 and I think it was the next March that I moved on to the next store, Martinez.\n\nto be continued...",
        "created_utc": 1485353285,
        "upvote_ratio": ""
    },
    {
        "title": "So this was a first...",
        "author": "PunkyShoeStore",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5q1i2m/so_this_was_a_first/",
        "text": "I delivered to a guy getting arrested. Well, I didn't complete the delivery actually.\n\nSo a guy calls in and wants to place an order for delivery. I ask for his phone number. He starts to give it to me, but then stops halfway through and tells me he'll call back. This sent up a red flag since we've had two drivers robbed in the last two months.\n\nHe calls back about five minutes later, is acting like a total asshole on the phone. He gives me a number that's not in our system. I put in his address and tell him delivery time is over an hour at the moment. He gets pissed and is trying to get free wings with his two meats pizzas. I tell him sorry, but no.\n\nSo this was going to be my last delivery of the night and I already knew no tip from the guy's attitude on the phone. I figured just get it over with since I'm the only driver left.\n\nI pull onto his street which is part rock, part asphalt, part dirt. The street is actually part of a loop with some other roads that run between the loop. It's kind of out in the country and the streets are narrow and falling apart with huge potholes. You get the idea.\n\nAnd since this street sucks so bad, the residents obviously choose not to have any lights on and no numbers on mailboxes. GPS always screws up on this road, so I have to use my wits.\n\nI'm driving around this area trying to find the place when suddenyl I go around a curve and there are two cop cars, lights going, blocking the road. They've got a guy in handcuffs in front of one of the cars. I didn't have a car topper, so I put on the interior light. I ask the cops if there's a way around. They're trying to tell me to turn around and I yell out that I'm looking for 1680. The guy in handcuffs asks if I'm the pizza man. I say yeas and he goes, \"Aw, damn man!\"\n\nSo they try to point me to the right house, which is about three houses up from where this is taking place. I was able to actually squeeze past one of the cruisers, but when I get to the house they pointed out, it doesn't match. I go up the road and come back down, but this address simply doesn't exist. Then I realize that the houses are only on one side of the road, and they're all odd numbers, so this place wouldn't exist anyway.\n\nI pull back down and the cops tell me the guy said to just take them back because the people at the house wouldn't be able to pay for them.\n\nNow, I'm wondering if I had been five minutes earlier, would ol' buddy try to flag me down and rob me? That's exactly what happened in the other two cases. Guy comes walking along, flags you down, asks if you're looking for whatever address, says it's his order, then when you're out of the car, he robs you. Given this, I wouldn't have gotten out of the car or even stopped if this did happen, and I do carry protection, but still. Kinda' spooky.\n\nStay safe out there everyone.",
        "created_utc": 1485322602,
        "upvote_ratio": ""
    },
    {
        "title": "Can I deliver with a dui on my record?",
        "author": "WantsToDeliverPizza",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pzak7/can_i_deliver_with_a_dui_on_my_record/",
        "text": "Hello everybody. \n\nRecently I have been interested in taking up a delivery driver job although I have had two duis in the past 5 years(the most recent one being just over 3 years ago). Both of the duis are for having active THC metabolites in my blood, even though I was actually sober at the time of my arrest(I also had a medical marijuana card, too).\n\nI was looking to apply at a Papa John's that is in my area (Scottsdale, Arizona).  On the application there is a question asking if I have been convicted of any crimes in the past 7 years.  I know I shouldn't omit the information, but at the same time I don't want them to see that on my application and automatically turn me down. \n\nI haven't been convicted of any felonies, but I don't know if my dui convictions(misdemeanors) will automatically disqualify me for a driver position.\n\nShould I list my duis and hope it doesn't disqualify me, or should I leave it out and tell them in person? I really want this job but I'm afraid the past is going to keep me from getting any delivery driver jobs. \n\nIs there anyone out there with similar circumstances that can give me some input or advice?  I appreciate any help I can get that.\n\nI'd also like to note that I'd be willing to work at any Pizza place, papa John's is just the closest place in my area that is hiring. \n\nSorry for the long and probably poorly formatted post. \nThank you so much for any help you can provide",
        "created_utc": 1485296859,
        "upvote_ratio": ""
    },
    {
        "title": "Stop paying in change!",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pykcw/stop_paying_in_change/",
        "text": "We are not the United Bank of Pizza. If you don't have your change in rolls, I think it's extremely unfair to hand one of my drivers  $10 in ones and $15 in quarters and dimes. They don't have room in their cars for your change. If you're taking the money from your kids' piggy bank to pay for a fun pizza night, at least take the money to the bank and get bills for it! This doesn't even apply only to children, either. I've had guys come in pissed because they delivered to a 4 million dollar home and got paid in change. IN CHANGE! Do these people pay in change everywhere? Do they pay their mortgages with empty water jugs full of nickels? When we cash out a driver, we don't have a magic coinstar machine that counts up their change, which means, if you pay in change, you're taking money out of their hands at the end of the day. ",
        "created_utc": 1485289865,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone here item deductions for delivery/driving expenses or just use the standard deduction?",
        "author": "heresmyusername123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5py69m/does_anyone_here_item_deductions_for/",
        "text": "I know I'm getting ahead of myself here since taxes aren't for another couple months or so but I'm just curious how everyone here handles this? I have MileIQ (at the recommendation of a fellow driver) so my miles are tracked pretty well but at the same time I'm starting to think that it's just easier to use the standard deduction than having to itemize things.",
        "created_utc": 1485286232,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from an 80s Pizza Guy, part the third",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pvxdg/tales_from_an_80s_pizza_guy_part_the_third/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when. Here are my Tales from the Pizza Guy.\n\nWalnut Creek\n\nWhile delivering in Santa Barbara, I realized I wanted to change schools, so I began the process of transferring to UC Berkeley. I also realized I had not been able to save up enough money to get back to school that Fall, so I decided to take a year or two off. I moved back to the San Francisco Bay Area and lived with my mom and younger brother in the small house she was renting. I tried to find a different job for a while but I ended up driving for Domino’s again. I didn’t stay a driver for long, however. The area supervisor asked me to move inside, so I became an Assistant Manager (a huge drop in pay anyone will tell you -- but I was on track to be a Store Manager -- I guess the term for that on this sub is “GM”).\n\nI worked as Assistant Manager under a couple different Store Managers -- this franchisee was opening new stores every year and was promoting from within, so there was a lot of movement in management. I finally became manager of that store a month or two later. One week the crew in the store was held up at gun-point. The manager was in the store at the time and was shaken up, but OK. One week later, a driver was having a party and I had asked the manager to cover my shift. He agreed -- and had a gun held to his head again that night. I stopped by the store after the party and he handed me the keys and walked out. I never saw him again. The store was (actually still is) across from a gas station, and the police placed an undercover officer in the booth of the gas station for a few weeks after that, but we weren’t robbed again.\n\nBrett was one of our drivers and a character that is hard to forget. He once told me “I could be smart like you if I didn’t do so many drugs.” This is before cell phones, so store managers had pagers. We had a code, 411 meant you should call when convenient, 511 was call back ASAP, 911 was stop what you’re doing and call (666 meant there had been an injury -- fortunately I never saw a “666”). One day I get a 911 page from the store. When I call, it was Brett, off-duty, who sent the page. He asks me if he can borrow $50 from the store, saying “I need $50 today or I WILL go to jail.” I told him that I couldn’t let him borrow from the store, but I’ll personally loan it to him, and to just leave an IOU in the till. When I get to the store later that evening I find an IOU in the till for $80. He’d first written “$50” and signed it, but then wrote “+$30 Thanks!” under that. I actually know Brett’s last name because he never paid me back and I still have the IOU somewhere.\n\nThere was a phone girl at this store named Stacey. She was very young (I think 14 or 15), but she was smart. She was smart and beautiful, but had a horrible home life from what I gathered (even having excema on her arms from stress). You just want to wrap someone like that in your arms and take them away from everything. As manager I always liked to give the women more responsibility -- I felt that too often they were looked over by the men in charge. Stacey was too young to open on her own, but there was another phone girl who was a little older, and I told them they could open the store together. It worked out well, and one day I came in and the two of them were giggling about something. I asked what it was, and Stacey told me that the other girl (I’ve forgotten her name) would always take off her top when prepping the sauce -- she didn’t want to get sauce on her uniform shirt or bra. Let’s just say my mind wandered on that one for a while.\n\nI think Stacey sensed the paternal feelings I had for her. She told me more than once that I would make a great dad.\n\nThis store had been around for a while and was a little grimy. The area supervisor decided we would have an all-hands-on-deck clean-up party. We would close early one night, and clean the whole store. “All hands on deck” meant that even managers and staff from the franchisee’s other stores would be there (I think he had six or eight stores at this point). As incentive, the supervisor decided we would have a keg in the walk-in. Here is a lesson for everyone. If you want to use beer as an incentive, be sure that it is very clear that the beer doesn’t come out until the job is done. I think the store actually looked worse after the great clean-up party fiasco. On the plus-side, a walk-in refrigerator is a great place for a keg!\n\nOne of my most awkward moment at Domino’s happened at this store. We had needed to call back an order to check on something and discovered the phone number was incorrect. There wasn’t much we could do until the customer called 40 minutes later. Apart from getting the information for the order, we learned that the phone number on the slip had two numbers reversed. I joked to the driver who had taken the order “have you been dyslexic for long?” An hour or so later he pulled me aside and said “I am, you know.” I must have looked confused because he repeated it, “I’m dyslexic.” I think I said something like “Oh, I’m sorry,” and then made sure he double-checked his orders.\n\nOne evening this guy called the store four or five times asking for “Rochelle.” It was pretty clear what had happened, but he wouldn’t take “no” for an answer and grew increasingly hostile. I wonder if “Rochelle” was even her real name. I figure she was a somewhat regular customer since she had our number memorized enough to give it to guys who were pestering her.\n\nTo be continued...",
        "created_utc": 1485262233,
        "upvote_ratio": ""
    },
    {
        "title": "If one more customer...",
        "author": "mostlyhighthoughts",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pus6z/if_one_more_customer/",
        "text": "Writes out a tip on their credit card receipt that is literal pennies. Keep them to yourself. \n\nI've taken several deliveries where customers will take the time to write out $0.06 on the tip line just so their total rounds nicely. \n\nThese are the types of people that natural selection must weed out. \n\n",
        "created_utc": 1485241409,
        "upvote_ratio": ""
    },
    {
        "title": "Cus i'm a freaking lazy whore",
        "author": "CadcTV",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ptzws/cus_im_a_freaking_lazy_whore/",
        "text": "so, today, i delivered to a lower end appartment complex we deliver to.\n\ni get off my car, i knock on the door.\n\nthis black chick opens the door and immediately says in a singing voice, with extended arms and cash in hand.. and i quote.. \"oh my god, you saved my life, cus i'm a freaking lazy whore, and did not want to walk outside.\"\n\nthis caught me so out of the blue, i had no words to respond to that other than.. \" umm.. ok.\"\n\nseriously though, on the special scale, this one is pretty high up there, in the near 4 years of working as a driver at pizzahut...",
        "created_utc": 1485230158,
        "upvote_ratio": ""
    },
    {
        "title": "Called 911 on a guy today.",
        "author": "goots95",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5poqr4/called_911_on_a_guy_today/",
        "text": "Here's a fun story from tonight. Names have been redacted. Note that my manager is a woman, but Insider and I are both men.\n\nSo a guy calls asking for a delivery at about 12:30. Manager answers, and gets his name and address. Another phone starts ringing, so she puts the first phone on hold. Insider picks up the first phone, and starts talking to the guy. The guy is adamant about talking to Manager.\n\nManager finishes the second phone call, and takes the first phone from Insider. She continues taking his order, until a few moments later when she says, \"My name is Manager, don't call me baby or honey.\"\n\nThe guy asks what kind of drinks we have, to which she replies, \"Coke products.\" He asks again, and probably two more times after that. Each time, Manager names a bunch of Coke products.\n\nShe finally gets through the phone call, and hangs up.\n\nNot a minute later, the phone rings. This time, Insider answers and says, \"Sir, please don't raise your voice at me. She is busy, and can't come to the phone.\" He hangs up.\n\nA minute or so later, he calls again.\n\nThis time I answer.\n\n\"No, you put that fucking bitch on the phone. Hear me, fucking pussy? Put the bitch on the phone.\"\n\n\"Sir, she's not coming to the phone,\" I said while he was still talking.\n\n\"No fuck you, put that bitch on the phone.\"\n\n\"Actually man, I just told you she's not coming to the phone. We are not going to serve you tonight because you are harassing us.\"\n\nTo which he replies, \"No, No, NOOOOOO! FUCK YOU MOTHERFUCKERS. I FUCKING AAAAAAEEEAAEAEAAAAAHHHH.\"\n\nYes, at this point, he is literally just screaming into the phone.\n\nObviously, I hang up.\n\nHe calls again. Manager picks up the phone and says, \"We called the police, they're on their way to your house. I hope you feel better tomorrow.\" \n\nAll the while, this guy is just screaming into the phone.\n\nManager hangs up.\n\nHe calls again.\n\nI pick up the phone, hold it a few inches from my ear to hear him screaming, and hang up.\n\nI try the non-emergency number, but no dice.\n\nSo I dial 911.\n\nDispatcher answers and asks what city I'm in. I tell her, \"College Town. This isn't an emergency, but I couldn't reach the non-emergency number.\"\n\nI tell her about our new friend. I give the dispatcher the guy's address, apartment number, first name, and phone number. She asks how many times he has called. 10-12, including 2 while I was on the phone with 911.\n\nShe tells me that they will send an officer to his apartment.\n\nHe calls once more. We pick up the phone and immediately hang up.\n\nLike three hours later, a College Town officer comes in to the store.\n\nWe give him our story, and he takes down our names and the store phone number. He gets a case and reference number for us, and leaves.\n\nIn the three years I've been working there, I've never been involved with anything as crazy as this. What a weird night.\n\nBut when I got home I downloaded Roller Coaster Tycoon on my phone.\n\nTL;DR: Guy calls and yells at us. We hang up. He keeps calling. We call police.",
        "created_utc": 1485178705,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from an 80s Pizza Guy part 2",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pom3e/tales_from_an_80s_pizza_guy_part_2/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when. Here are my Tales from the Pizza Guy.\n\n(still Santa Barbara)\n\nThis Domino’s was a franchise store run by a really nice guy, Evan. I only ever worked at franchise stores. Also, though this was the era of “30-minutes or free,” I never worked at a store with that offer, for us a late pizza was just $3 off.\n\nI remember one new guy coming in for training. He was immense. We did not have a shirt large enough to fit him, so he had brought a shirt he had that looked something like a Domino’s uniform, and for some reason Evan OK’d that until we could get a new shirt ordered. I got to be the one to train him. While driving around, he told me that one of the ways he makes money is to go to stores where they have items stacked up for sale -- he loved to see stacked-up things for sale at a grocery or convenience store. He would pull the stacks over onto himself and then sue the store and get them to settle with a nice payout. He ended up taking a few runs and then disappearing with his bank. He hadn’t dropped any money and ended up with probably about $70.\n\nI worked into the Fall (I didn’t have enough money saved to go back to school yet), and I remember one very dark and stormy night. We had no Domino’s rain gear, so Evan allowed us to wear our own. My rain gear was a full-length French-military surplus trench coat and an Indiana Jones Stetson. I delivered pizza that night looking like I was delivering to Rick’s in Casa Blanca.\n\nThe dayshift crew would wash all the uniform shirts and pants (some of the drivers left their pants) at a nearby laundromat every day. One day they went to grab the uniforms from the drier and the clothes were gone. Someone had stolen a load of Domino’s uniforms. Who knows what they did with them. I figure it was just a prank -- but my pants were in the stolen load. In the end it was OK, though. I had to wear another driver’s pants that night and when I complained that they didn’t fit very well, the very cute manager on duty told me that was because I had a better butt than the other driver. It was all good after that. I wish I remembered her name.\n\nMy crush at the store was Caroline (with a long “i”) -- she was what we called back then “Phone Girls” (I don’t know what they’re called now) -- too young to drive or manage, she answered phones and made pizzas. This was before the “Goth” movement, and I think her style was what we called “Mod” back then. Of course, I was working too much to even think about dating anyone (plus, she was 16). What’s frustrating is that I remember so few last names. I would love to look some of these people up, but in an era before social media, email and cell phones (let alone smart phones), unless I wrote down someone’s info, they were gone as soon as I left the store.\n\nPhone Girls weren’t always girls -- we had Phone Guys too. There was a young guy at the store who idolized Madonna (this is 1984). It became clear that more than idolizing her, he wanted to BE Madonna. I think the world, while far from perfect, is a lot better for people like him today than it was then. There were never any issues at the store that I knew of, but I knew he was having a hard time. He was often tearful at work. I hope everything worked out for him.\n\nI’ll never forget late one Friday or Saturday night. It was around 2:00 in the morning and Evan was having a beer in the back after we had finished closing. I shared with him the difficult time I was going through and he told me that while what I was doing was really hard, someday I would look back on it very fondly. He was exactly right. He was probably the nicest guy I worked with in my time at Domino’s. After I left, I came back to visit a few times over the next year or two. Eventually Evan sold his store. When the google became a thing, I searched his name -- he had a chicken farm (ranch?) in Ohio.\n",
        "created_utc": 1485177215,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone recommend a reasonable priced dash cam?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pn8x2/can_anyone_recommend_a_reasonable_priced_dash_cam/",
        "text": "Since my last post things have greatly improved. I made 286 just in tips these last 3 days. However I'm noticing having my car topper on makes me clear cut target for road ragers. I'm getting brake checked as soon as change lanes and I've even had people ride my ass after going around them as if I bruised their fragile ego. \n\nI'm looking to spend no more than $100 and I'm looking for 1080p video.",
        "created_utc": 1485157701,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sorry you guys... [Story - Fuckup]",
        "author": "Shinynipple",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pmcmi/im_sorry_you_guys_story_fuckup/",
        "text": "I just ordered a pizza from dominoes and I'm at my my dad's house. I was stoned for the first time in like a week and was too lazy to check the apartment number outisde the door for the delivery address. So i litereally google \"where am i\" and it gives my my current \"address\". It was the wrong number apartment. So originally i was planning to  chill outside and vape and play super mario on my phone so the knocking of the door wouldn't wake people up. Well partway through mario I have a feeling that google was wrong and i looked at the number next to me and notice it's the wrong one. So, I whip out my cellular device to ring the ol' dominoes and inform them of my massive fuckup. Well before I have a chance to do that, I see the motherfucker pull up into the parking lot, all slick like. This skinny alirn trevor gets out and walks down the sidewalk to somebody's door. I want to yell for the dude but there's some other dude with a dog and its almost midnight. So I approach the fuck and can't get to. Him in time to say \"YO IT'S THE WRONG CRIB NIGGA\" so i get behind this dude and I'm like \"excuse me i actually ordered that but put the wrong address in my phone\". I feel like a fuck head tard monkey. Dumbass sandwich, jafeel? So the owner that apartment opens up and i think its an old lady and the pizza man, upon receiving delivery enlightenment by your humble narrator, informs this poor lady that he is indeed the pizza guy and \"this guy put the wrong address in his phone, sorry to disturb you\" and i can tell this dude thinks. Im a fucking dumbass, with reason. So i like apologize and ask how he is and he like grunts at me and i awkwardly fill out the receipt with a nice tip and signature and apologize again and im like have a good night and the cuck walks away. I carry my pizza through the brisk air and quesiton myself verbally \"what kind of dumbass does that\". It is then I see the dog walking person once more whom just heard what I dropped. I feel one last ting of shame, much like that final side-scoop of the hiding icecream in the container to top off my fuckup. And that, kids, is how I met your mother.",
        "created_utc": 1485146628,
        "upvote_ratio": ""
    },
    {
        "title": "Southern California Drivers, STAY SAFE OUT THERE",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pl2rq/southern_california_drivers_stay_safe_out_there/",
        "text": "The rain has been going nuts since early this morning and a lot of roads are flooding. We aren't exactly known for being the most adept drivers in the rain and the combination of bad weather + football today mean we've got a ton of runs to do. Remember it's a lot better to show up late to your orders than it is to not show up at all because you hydroplaned off the road or couldn't avoid someone else who was.",
        "created_utc": 1485132642,
        "upvote_ratio": ""
    },
    {
        "title": "Greg Proops Delivery tales from the 70's",
        "author": "tropicofpracer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pje6d/greg_proops_delivery_tales_from_the_70s/",
        "text": "[Hilarity](https://www.youtube.com/watch?v=xUM-JkInIlg)",
        "created_utc": 1485116789,
        "upvote_ratio": ""
    },
    {
        "title": "Shout out to the drivers who work in a Pizza place with all of their friends.",
        "author": "thehairybastard",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5piwkv/shout_out_to_the_drivers_who_work_in_a_pizza/",
        "text": "I've been a driver for two years now. \n\nWhen I started, two of my friends that I've been hanging out with since high school worked at the pizza place too.\n\nNow, one of my friends works in the kitchen, two work behind the counter, and three of my friends are also drivers. Everyone else that works there that I wasn't friends with before, I am now friends with.\nIt hardly feels like work when you're hanging out with your friends all day. \n\nOne of my friends has been making a card game based on the pizza place for the last four months, walking around taking pictures of everyone and different things in the store.\nIt has ended up being one of the funniest fucking things I've ever seen. \nIt is legitimately fun to play, and it is just highlights the ridiculousness that on a slow night, I get paid to sit around and play a card game based on my job with my friends.",
        "created_utc": 1485112393,
        "upvote_ratio": ""
    },
    {
        "title": "If you're in GA or SC, be careful tonight.",
        "author": "rednoise",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5piqvw/if_youre_in_ga_or_sc_be_careful_tonight/",
        "text": "The SPC/NWS is predicting a bad day with the possibility of major tornadoes.",
        "created_utc": 1485110949,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm calling the sheriff's office on your ass!\"",
        "author": "RCBurnout11",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pi4vq/im_calling_the_sheriffs_office_on_your_ass/",
        "text": "Work last night was pretty wack. \n\n\nAfter being fortunate enough to have a really successful dinner rush ($80-90 in tips on 15 deliveries thanks to a couple of catering orders), my night took an unexpected turn as things were winding down. \n\n\nI came back from my last double and grabbed the last delivery sitting in the window, which was going to the extreme southwestern corner of our area. I check the receipt to make sure I have everything and see a pre-tip of $0.29. Hey, I've had a great day, one lousy delivery is no big deal. \n\n\nSo I'm just jamming out to my music on the 15 minute drive to this guy's house not too worried about anything. When I get to his house, I quickly get his signature, give him his food, and get slapped in the face with an \"I appreciate it\" before continuing on my way, reminding myself \"hey, it's just one asshole, don't let him ruin your day.\" Telling myself this is evidently where I fucked myself.\n\n\nI'm not even out of this dude's neighborhood yet when I see someone ahead of me in dark clothes walk into the middle of the street with their arms waving. I come to a gradual stop about 30 feet behind this guy and he starts walking over to my driver side door. My first concern is that I'm about to be assaulted, so I lock my doors and crack my window before being met with the most intense fury I've seen in another human being.\n\n\n\"DO YOU KNOW WHAT THE SPEED LIMIT IS HERE??\" shouts the livid 60 year old white man standing two feet away from me. \n\n\n\"It's 25,\" I reply calmly with a blank expression on my face. \n\n\n\"THEN FUCKING DO IT!\" \n\n\n\"Yes sir.\" I give a little nod and then proceed to drive off.\n\n\nWhen I get back to the store, two of the insiders are in the corner giggling. When I see this, I can't help but start snickering as well. I walk back to the driver station and as I'm putting the bag back, my manager walks up to me. \n\n\n\"You got a call about me, didn't you?\" \n\n\n\"I sure did. This guy said, and I quote, that he was going to 'call the sheriff's office on your ass' but I was able to talk him down.\"\n\n\n\"I'm not in trouble, am I?\"\n\n\n\"Hell no you aren't. This fool thought you were driving a Volkswagen, so I knew at that point his concerns weren't legitimate. But holy hell, I've never heard someone so pissed in my life. How fast were you going?\"\n\n\n\"I'm pretty sure I was doing 28, but it couldn't have been more than 30.\"\n\n\n\"He said you were doing 50. I didn't believe it for a second.\"\n\n\n\"If I was doing 50, he'd be in the hospital right now.\"\n\n\n**TL;DR: An old white guy ran in front of me on a delivery and accused me of speeding before calling the store, threatening to call the sheriff's office, and mistaking my Subaru for a Volkswagen**",
        "created_utc": 1485105197,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from an 80's Pizza Guy",
        "author": "ADeweyan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ph6d3/tales_from_an_80s_pizza_guy/",
        "text": "Though I last delivered a pizza in 1989, this is probably my favorite sub. I like hearing from the people still in the trenches and thought some of them might like to hear my stories from way-back-when.\n\nWhen I wrote them down, it came out to about 13 pages -- so I'm not going to post them all, and only a bit at a time. We'll see how it goes.\n\nSanta Barbara\n\nAt the end of my sophomore year at UCSB, my father went bankrupt, my parents divorced, and my family fell apart. I found myself completely on my own without money or a job. I first got a full-time job at an auto-parts warehouse, and then added a job delivering pizza for the Domino’s Pizza on Milpas Avenue. That was a crazy six months of 100-hour work weeks and not a lot of sleep. Our store closed at 12 on Weekdays (1 on Fri, Sat), and my warehouse job started at 6:00. More than once I hid on a shelf behind some boxes and took a short nap after a closing shift and getting up at 5AM. I remember the feeling of power and confidence that came when I paid my first rent and set of bills fully on my own. That was a real switch from the week before when I literally had gone through the cushions in the couch to find enough change to get some food.\n\nThis Domino’s was a franchise store run by a really nice guy, Evan (Evan sold the store a few years after I left, and the last I heard he had a chicken farm in Ohio). I only ever worked at franchise stores. Also, though this was the era of “30-minutes or free,” I never worked at a store with that offer, for us a late pizza was just $3 off.\n\nThere was a driver named Ted who fell in love with a Scandinavian rower who was there for the Olympics (this is the Summer of the Olympics in LA, and crew events took place in Santa Barbara). He saved his money and left the store to great fanfare at the end of the Summer to go stay with her for a few months, maybe forever. But then he was back two weeks later. He had stopped over for a couple of days in Las Vegas to try to increase his money but ended up losing it all and no longer had enough for his trip. I had to hand it to him, as embarrassing as that had to be, he came back with his head held high, making jokes about his misfortune along with everybody else.\n\nThere was an Assistant Manager named \"Dave,\" who was great fun and would doodle derpy characters on everything -- order sheets, check-out paperwork, daily reports. There was also a driver named “Joy,” who was very downbeat -- the word that fits her best is “sad-sack.” Think of the Sadness character from Inside Out. She lacked energy and sort of just moped around. Dave would always write her name with quotation marks on the daily reports:\n\nTom\nTed\n“Joy”\nMarcus\n\nI loved that.\n\nThis was the store where I saw a guy running away after stealing a pizza. I was coming back to the store and saw a young guy running as fast as he could with a pizza box under his arm. Yes, he had the large pizza box, was holding it vertically, and was pumping his arms as hard as he could. I guess he had to be pretty hungry to be stealing a pizza in the first place, so he probably didn’t mind eating the pile of mush he was left with.\n\nI had my share of odd deliveries, of course. There was the raucous High School party in one of the hotels by the waterfront. It was easy to figure out where the pizza was going because a guy was peeing over the balcony. When I got to the room, the guy who answered the door was not wearing pants, and had two girls in bikini’s hanging on his arms and giggling. There was the Indian family I delivered to where a child answered the door (she was probably six or seven) and took care of the entire transaction with complete competence and grace while the adults in the room looked on smiling. There was the party I delivered to that was outside of the delivery area, (but, heh, what’s an extra mile for a 10-pizza order). This was a large, beautiful house in Montecito, and the driveway was packed with expensive cars. I go in and the crowd is dancing to Bruce Springsteen (Born in the USA was huge that Summer), and they proceeded to stiff me on a 10-pie order, outside of the delivery area, while dancing to the champion of the working class.\n\nto be continued...",
        "created_utc": 1485095350,
        "upvote_ratio": ""
    },
    {
        "title": "Scam fail, followed by scam success.",
        "author": "HelloYesThisIsDuck",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pgvr5/scam_fail_followed_by_scam_success/",
        "text": "The \"scam fail\" post reminded me of this story from my pizza store days.\n\nI was working at a Domino's in Canada, and one day, these three young men came in, all wanting one small pizza (~$14), each wanting to pay with a $50 USD bill. I took a look at them, had doubts, called the manager over, and he declined to accept those as payment. Once they left, he told me I did the right thing by callng him over, and that the bills were fake.\n\nFew minutes go by, and he says \"I'll go to the sandwich shop next door, make sure they don't use those fake bills to buy subs.\"\n\nAlas, too late. Poor kid next door sold them three six inches, and gave them back roughly $150 CAD in change. He was devastated.",
        "created_utc": 1485091381,
        "upvote_ratio": ""
    },
    {
        "title": "Drunken Saturdays",
        "author": "NotebookScribbles",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pg3l2/drunken_saturdays/",
        "text": "More drunk people than usual called tonight...\n\nOf course we had the usual \"let me go ask everyone at this fucking party what they want to order while you're on the phone. It'll just take a minute.\" I just lay my head on the counter and pretend I can't see the line of other people I need to help...\n\nOne person didn't know the address they were at. They said they could tell the driver how to get there, because it's just \"3 or 4 or 6 blocks away from [gas station].\" Yeah no.\n\nTwo people gave us the wrong apartment number. My driver managed to find one by knocking on other doors. She said they were fucked up bad. The other order came back to the store and was eventually cancelled after we couldn't get ahold of them and they never called back.\n\nOne person who couldn't read his card number because he was so drunk. But then he remembered that he had cash, but he only had a $50... for a $38 order. He ended up telling my driver to keep the change. Also that she was pretty.\n\nAnother guy told me his life story over the phone. He kept calling me sweetheart. The scariest thing is, he picked up his order. As soon as he rolled down his window (we have a drive thru), I thought I was going to get buzzed from the fumes rolling off him. He drove away too fast for me to get the license plate, unfortunately.\n\nAnother pickup (thankfully they walked from the hotel) told my server that she was sexy... in front of his girlfriend. We could hear her yelling at him all the way back to the hotel.\n\nMy favorite was the customer that was over-the-rainbow excited that we were still taking deliveries (it was 9pm, we don't close until 11:30). Super excited about everything. \"Do you have large pizzas?\" \"Yes.\" \"OH MY GOD I LOVE YOU. Can I get pepperoni on it?\" \"You sure can.\" \"YOU'RE THE BEST, THANK YOU SOOO MUCH!\" I was trying so hard to keep it together. I got off the phone and I laughed so hard.",
        "created_utc": 1485075743,
        "upvote_ratio": ""
    },
    {
        "title": "Prank internet orders... really people?",
        "author": "Dat_Feral_Drood",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pg1hv/prank_internet_orders_really_people/",
        "text": "This goes back to 2 weeks ago, these guys order an XL pizza to the outskirts of our delivery zone an hour before close. The Pizza is  so far off the walls with a salad and like 9 packets of dressing. Pizza had no cheese, no sauce, and like extra anchovies. It warrented a call.  Guy says he lives at said address and that he didnt order food that his friends are playing a prank. \n\n\n25 minutes late same address appears and a DIFFERENT phone number this time.  Call the new number said they were the first number guys brother and they are hungry.  Queue calling other guy back and proceeds to decline everything and to not send things out.  Done and done.  Both orders cancelled. \n\n\nCome to tonight they order AGAIN 2 weeks later! Luckily for me I was managing that night they attempted the first time! Well I go and lookup the other guys number from the first time they placed the order 2 weeks ago and they guy sighs and thanks me for giving him a heads up and doesn't want anything sent out. \n\nTL:DR stop wasting my time with your stupid \"think its funny\" shit.  You're wasting my time pushing other PAYING customers orders back and the cops now have your number. ",
        "created_utc": 1485074482,
        "upvote_ratio": ""
    },
    {
        "title": "Wish me luck!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pdedo/wish_me_luck/",
        "text": "[deleted]",
        "created_utc": 1485038248,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else get nervous on late night, cash order runs ?",
        "author": "jrjake",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pd5t2/does_anyone_else_get_nervous_on_late_night_cash/",
        "text": "My shifts are usually late night due to the fact that I have classes in the morning. So alot of the time I close and am working as the lone driver. Most of the runs I go on are no problem, however every once in a while I will get a delivery around 11 or 12 and it will be cash. I always feel a little knot in my stomach on these runs lol. Anyone else feel this way ?",
        "created_utc": 1485035614,
        "upvote_ratio": ""
    },
    {
        "title": "Scam fail",
        "author": "ChipBlackwood",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5pcpat/scam_fail/",
        "text": "Gentleman walks into the store at the same time I get back from a delivery and I clock back in to the store and go to help the customer. I tell him the total ($14.02) he hands me $20.02. I start getting his $6 change together and he asks for a couple marinaras thrown in. I tell him it'll add $1.08 after tax for two and ask if he would like me to take it out of his change.\n\"Naw, I'll go get it when we're done here.\"\nAt this point I laugh, because I see what's going on and hand him his food, and he walks out. Then I go to get the marinaras to take to the front counter and look out to his car and he gives me a smirk and flips me off and drives away. I shrug put the marinaras back and have a laugh with my manager.",
        "created_utc": 1485030659,
        "upvote_ratio": ""
    },
    {
        "title": "What happens when 90% of your regulars are Stiffs",
        "author": "Chittlings",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5p8ltu/what_happens_when_90_of_your_regulars_are_stiffs/",
        "text": "I went to pick up my check today and my GM asked me to work tonight. I said no because I have to go to work at 8 am tomorrow. She takes this opportunity to complain about how me and 3 other drivers work at  a certain manufacturing plant .\n\n**GM: I dont see what so great about it.. They pay minimum wage!** \n\n\nI do not understand how someone who managed this store in this area so  long and still can't figure out the reason why your drivers pick up second jobs and slowly \"disappear\".\n\n90% of the people in the area do not tip. The drivers are left to complete over the 10 % that DO tip and this lead to tension between drivers.\n\nThey pick up second jobs to pay for maintenance on the car and eventually quit because its not worth it.\n\n When I get paid 7.25 at least I am not tear up my car in the process.",
        "created_utc": 1484970126,
        "upvote_ratio": ""
    },
    {
        "title": "Am I on the shit list?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5p7e5r/am_i_on_the_shit_list/",
        "text": "[deleted]",
        "created_utc": 1484954777,
        "upvote_ratio": ""
    },
    {
        "title": "Finding customers address is hard at night",
        "author": "sirjj9050",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5p6kgq/finding_customers_address_is_hard_at_night/",
        "text": "Is there a app or something that shows the addresses of the street your on? I have a Garmin 57LM Nuvi but when it comes to showing you which house to deliver to it fails. \n\nI just started delivering Tuesday and the job is okay and except for I can't stand when most of the houses don't have a address anywhere, or anywhere visible like when they don't turn on a porch light. \n\nI have a flash light, but I don't want to shine the light on their house, I rather shine it at their mailbox close to the drive way. \n\nI'm black so you can't be shining flashlights at people houses without expecting to possibly get the police called, or get shot, especially when you don't dress in uniform or have a sign on top of your car saying you're a pizza delivery driver lol. ",
        "created_utc": 1484945975,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza guy tipped $700",
        "author": "bmidontcare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ooeik/pizza_guy_tipped_700/",
        "text": "[removed]",
        "created_utc": 1484731135,
        "upvote_ratio": ""
    },
    {
        "title": "Abortion is murder in any country!!!",
        "author": "jrjake",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5oo4nh/abortion_is_murder_in_any_country/",
        "text": "Okay, so I just recently started delivering pizzas for my local pie shop. A month on the job and I have already had some weird encounters and met some interesting characters. However this particular run takes the cake.\n   I was on my first run of the day, it was pouring outside and I was expecting to get this pizza to its destination ASAP. I pull up to the house, outside in the driveway sat a older style pickup truck maybe a 93 Chevy. As I get out and make my way to the door I notice this truck was littered with bumper stickers and super radical phrases, \"abortion is murder and the mother should be hung\" \"abortion is murder in any country\". Along the side of the truck is graphic pictures of aborted fetuses and some more text I don't remember. The owner of the truck was an older black women who looked normal enough. Still weird though.\n\nP.s she didn't tip",
        "created_utc": 1484726217,
        "upvote_ratio": ""
    },
    {
        "title": "Customers: either they lie, or are stupid.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5omztd/customers_either_they_lie_or_are_stupid/",
        "text": "[deleted]",
        "created_utc": 1484710453,
        "upvote_ratio": ""
    },
    {
        "title": "\"No peppers, they said?\"",
        "author": "techparadox",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5okc48/no_peppers_they_said/",
        "text": "Former delivery driver from many years ago here. I ran deliveries for a smaller chain here in the Midwest during my college years, and while I don't have any tales of delivering \"extra sausage\" to a lonely wife or walking in on people *in flagrante delicto*, I do have a few that were interesting events. This is one of them:\n\nIt had been a slow night, winding down towards closing time, and besides the one waitress that was working the dining room there was only myself, my college roommate (we'll call him Liam), and the shop manager (we'll call her Kay) in house. Liam was working the make table, Kay was on the ovens and front, and I was floating between doing dishes, shoving a broom around, and taking phone orders, when I wasn't out on a run.\n\nA delivery order came in for one of our deluxe pizzas, but with no \"hot peppers\" on it. That wasn't uncommon, because not everyone likes chopped-up pepperoncini on their pizza. I forget who took the order, but I stood around up front and shot the bull with the other two while watching it being made. The order was made as requested, and within fifteen minutes I was out the door with it.\n\nThe drop wasn't that far away, so within ten minutes I was walking back in the front door of the shop, to see Kay on the phone, with an exasperated look on her face. As she dropped the receiver back in the cradle and jabbed the printout button, I asked her what was up.\n\n\"That was the people you just ran the delivery to. They're claiming there's hot peppers on the pizza,\" Kay said\n\nI replied that they were full of it, especially given that she and I had both watched Liam make the pizza.\n\n\"I know, I know,\" she replied. \"But we have to do a re-make, or they'll call corporate and throw a fit.\" Since we were part of the chain, nobody wanted to have to deal with corporate, so a re-make they got. It sucked, but that was a fact of our lives.\n\nAt this point, Liam already had a crust out and was smearing the sauce on it. We continued to discuss how the customer was just angling for a free pizza, and that people like that were trash. By this point, Liam was at the veggies stage of toppings, and he piped up.\n\n\"Hey, they said they didn't want any peppers ON the pizza, right?\" Kay and I both answered in the affirmative. At hearing this, Liam gets a huge grin on his face, grabs a double-handful of the ground-up peppers, and proceeds to squeeze the juice all over the top of the pizza.\n\nKay and I both crack up laughing as he finished up the rest. The pizza cooked up with no problems, and I delivered it. The guy who answered the door at the house had a huge grin on his face, thinking they had scammed a free pizza. When he asked me if the pie had any peppers on it, I simply smiled back and said, \"No, sir. I can guarantee there are no peppers ON that pizza.\"\n\n**tl;dr:** Don't screw with the people who make your food. Want a good deterrent? Go watch the movie *[Waiting...](https://www.youtube.com/watch?v=RvVdIg-sTo4)*",
        "created_utc": 1484683318,
        "upvote_ratio": ""
    },
    {
        "title": "I think I'm done with delivery",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5oh8o1/i_think_im_done_with_delivery/",
        "text": "So yesterday I was driving back from a delivery, I was hoping to make money so I could have a down payment of sorts to replace my serpentine belt on my VW\n\nAs I hit a stop sign smoke billowed from the front and through the vents, and as I was pulling it over, my power steering died fast.\n\nSo now my car is stuck on the side of the road and this is the 4th major fix on my car in less than a year.\n\nBig thanks to /u/Decimalcoder45 for picking me up and bringing me back to the store after and driving me home ",
        "created_utc": 1484647048,
        "upvote_ratio": ""
    },
    {
        "title": "is tipping rare now for chains?",
        "author": "monkeyman80",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ofhwg/is_tipping_rare_now_for_chains/",
        "text": "paid for an order online. i know a delivery fee isn't to the driver, and you better get paid for getting my fat ass pizza to my couch. \n\ndelivery guy just wanted me to sign the slip and wanted to get to the next one. i had to hold him up to give him a cash tip. he was pleasantly surprised but.. have things changed? ",
        "created_utc": 1484621715,
        "upvote_ratio": ""
    },
    {
        "title": "Should I feel guilty?",
        "author": "BulkyBear",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5oetbf/should_i_feel_guilty/",
        "text": "Just ordered one of those big dinner boxes from PH. Ordered alfredo meatball, came as marinara meatball. Called them up, made sure I was polite and the phone guy said 'What do you want me to do about it?'\n\nWas eventually put on with customer service, and they sent me the right pizza, just got here.\n\nI do feel kinda guilty though, because I used the rest of my cash to pay for the original pizza, and had none to tip the fixed one guy. Feel bad since he was very nice, and had to come down to send a pizza that wasn't his mistake. Did make sure to thank him.",
        "created_utc": 1484614190,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone gone through a remodel?",
        "author": "Hawkman1701",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5obuly/anyone_gone_through_a_remodel/",
        "text": "I'm the GM of  major chain and we'll be doing a huge remodel at the end of the month. Estimate of being closed 2 to 3 weeks, employees traded to other stores while that happens. Anyone been part of these with anything to advise upon? My store's at least 50 years old, I've been part for just under 20. Nervous.",
        "created_utc": 1484585292,
        "upvote_ratio": ""
    },
    {
        "title": "BringMeThat App",
        "author": "PizzaGopher",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5oabgf/bringmethat_app/",
        "text": "I work at a local pizza shop/restaurant, and recently we've been getting calls by people from an app called BringMeThat. They spoof the customer's phone number, pretend to be them, and pay with a credit card.They charge something like 4.50 for this service.\n\nThing is people think that we signed up for this or that its our app because Google leads them to it. And BringMeThat isn't up front with us that they're calling us in lieu of the customer. I've even had a duplicate order come in because someone double clicked the order button.\n\nThe problems start when you get there and they say \"I ordered from an app.\" Well, we don't even have a website to order from, much less an app. The problem intensified when we started using a mobile card reader. Now when we tell the person calling from BringMeThat they can slide the card when we get there, they just say \"OK\" and still charge the customers card. So I get to the customer's house and they say \"I already paid on your app.\"\n\nI actually had some toothless lady demanding her \"property\" and threatening to call the cops because she can show me where they charged her for the food. I just explained that hey, they didn't even get your order right, you don't want it. (It was missing a pizza.)\n\nBut I feel bad for the lady that paid for her food and charged her order, I have to tell her she never paid us, got charged extra, and now has to pay me too. And call BringMeThat to get her money back.\n\nAnd yes, we called BringMeThat and told them to stop, but they haven't yet.\n",
        "created_utc": 1484565247,
        "upvote_ratio": ""
    },
    {
        "title": "I'm 99% sure my manager is not paying me nor my coworkers properly (Warning: angry, bad writing and very long).",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5o8zx2/im_99_sure_my_manager_is_not_paying_me_nor_my/",
        "text": "[deleted]",
        "created_utc": 1484544006,
        "upvote_ratio": ""
    },
    {
        "title": "New pizza job next to zero hours",
        "author": "BadDrvrsofSac",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5o8tc3/new_pizza_job_next_to_zero_hours/",
        "text": "Hey all, so new pizza job but there's a problem. \n\nI was scheduled to work (3) three hour shifts this last week. This week I only have one three hour shift, making me wonder if they over hired new workers and I might be getting cut. \n\nIs there anyone else here who has encountered this before? I'm going to be following up with an application for the big three pizza chains in a different city. \n\nIt just seems weird they said they want to hire me and then give me barely any hours. ",
        "created_utc": 1484541645,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do you have any coupons that you could use for my order?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5o0ekp/do_you_have_any_coupons_that_you_could_use_for_my/",
        "text": "[deleted]",
        "created_utc": 1484434629,
        "upvote_ratio": ""
    },
    {
        "title": "Request: creative name and delivery instruction combinations.",
        "author": "joshuabeebe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5o0c9a/request_creative_name_and_delivery_instruction/",
        "text": "So I work for Marcos. Maybe 2 or 3 times a month I ordered delivery from the store I work at on my day off. To get a laugh out of my co-workers I change my name and delivery instructions each time. One time I changed my name to Buffalo Bill and the delivery instructions to \"put the lotion in the basket.\" I've also put my name is Optimus Prime and the delivery instructions to \"Autobots, roll out!\" What are some good name and delivery instruction combinations that you guys can think of?",
        "created_utc": 1484433920,
        "upvote_ratio": ""
    },
    {
        "title": "\"But I always get this here\"",
        "author": "SirCollin",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nwara/but_i_always_get_this_here/",
        "text": "I work at Marcos and a customer called the other night and was trying to order something that never existed and claimed that she always ordered it.\n\nMe:\"Thank you for calling Marco's, can I have your phone number \n?\"\n\nCustomer: \"*Gives phone number* can I order a thin crust Big Square with pepperoni, mushrooms, and onions?\n\nM: \"Sorry ma'am, we don't have a big square in thin, only small through large.\n\nC: But I've gotten it before, I want one with pepperoni, mushrooms, and onions.\n\nM: \"I'm sorry you couldn't have, our thin dough is pre-made and doesn't come as a big square. It's not possible you got one here.\n\nC: \"I've ordered them before, you're the one in (city) over on (road). I've ordered here for a long time.\"\n\nAt this point, I asked my manager as he had been here much longer than I, if we have ever made a thin big square. He tells me no and I relay this to the woman on the phone.\n\n\nShe keeps telling me that she has ordered one before and I asked her if she was confusing the thin crust as the underside of the pizza as I've had this happen when I worked at Big Pappa's.\n\n\nC: \"I don't understand you, I just want a thin big square with pepperoni, onions, and mushrooms. \"\n\n\nAt this point I was done arguing with this lady about a non-existent pizza and gave the phone to my manager who had been working there for something like 10 years. Only for her to argue with him about the same thing. They were on the phone for a few more minutes until she must have given up and not ordered.",
        "created_utc": 1484378903,
        "upvote_ratio": ""
    },
    {
        "title": "1 closing driver?",
        "author": "PunkyShoeStore",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nw5ip/1_closing_driver/",
        "text": "Alright, so I started back delivering at the beginning of December at PJs. Within about a week and a half, the GM was fired and replaced. The GM who brought me on had been there for about six years.\n\nSo, the way things worked was that we'd have a ton of drivers, and by the end of the night, there were two drivers left. Sometimes, we had a third stick around late if things got hectic.\n\nI like the new GM a lot, but he's very focused on numbers and getting the store turned around because apparently the old GM was way over on labor, food costs, etc. So he's implemented a policy (and this may be corporate policy to begin with) where we have a late driver who is scheduled to leave about an hour to two hours before close, and then a closing driver who, obviously, works until close.\n\nIn theory, this works, but so far, in practice, it hasn't. By this, I mean that, when I've been the late driver, like tonight, I still ended up staying until close and then beyond. The other night when I was the closing driver, I didn't even get finished with deliveries until over an hour after we closed.\n\nNow, to be fair, part of this is due to the shift managers not helping with cleaning throughout the night. Under the new system, I have actually walked out the door, as the closing driver, at my scheduled time, but this was because the GM was in there busting his ass along with myself and the late driver. Then again, the other night, two hours before close, it was dead and I actually got everything done an hour before close and then literally did nothing for an hour.\n\nSo, I'm wondering: do you guys have a single closing driver? If so, what's been your experience? I just can't see how this is sustainable because the late driver seems to end up staying anyway on busy nights.",
        "created_utc": 1484376417,
        "upvote_ratio": ""
    },
    {
        "title": "Blowing Up Customers Phone?",
        "author": "ChristPanda",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nv9vh/blowing_up_customers_phone/",
        "text": "Could you guys tell me your etiquette on how to call a customer, ecspecially one that puts in the notes, \"Call [Phone Number] when arrive?\" \n\nI usually call, if no answer wait about 2 minutes, then start blowin their shit up (call center ppl mostly.)\n\nGot a complaint today that I feel justified in but would love yall's thoughts.\n\n\n Thanks, and may mother Tip be with you.",
        "created_utc": 1484364019,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hey, here's your tip!\"",
        "author": "shellythelast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nsqnl/hey_heres_your_tip/",
        "text": "Three days ago I was tasked with bringing a delivery up to a dorm at the local college. I wasn't expecting much from it, since college students (especially in the Freshmen dorm, which was where I was going) tend to be even more broke than I am, and the trip's never worth it. But boy did they prove me wrong.\n\nI get there and my customer comes to the door with her roommate in tow. Roommate takes the pizza, and the total comes out to $13 and some change. The customer gives me $15, and immediately holds her hand out for her change. She makes a point, after I hand her the dollar and go fishing for her coins, to say \"the coins *too*\" with a smirk on her face like she'd caught me trying to trick her.\n\nI'd been having a bad night, and despite my best efforts I suppose I wasn't entirely able to keep my ire off my face, but I hand the change over and bid them good night. Then the roommate calls back to me.\n\n\"Hey, Domino's, here's your tip!\"\n\nI look back and she's handed the pizza off to the customer and is unzipping her sweater. She flashes me her chest and is laughing at me.\n\nI look her in the eye when she's stopped giggling and say \"Ma'am, to be honest, I'd rather have the dollar.\"\n\nShe takes exception to that. She immediately yanks up her zip so roughly that she winds up smacking herself in the face and knocking into the customer, sending the pizza to the floor.\n\nI dunno, but I think that laugh actually *was* worth the trip.",
        "created_utc": 1484336206,
        "upvote_ratio": ""
    },
    {
        "title": "\"Nah that's definitely not my pizza\"",
        "author": "SgtEcho",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nshdv/nah_thats_definitely_not_my_pizza/",
        "text": "It's a busy Sunday night, our drivers are taking constant deliveries, maybe 3 or 4 at a time each for a couple of hours. It's raining and people don't want to drive or cook. It's also worth noting that we don't have a computer system, we're not a chain. Our store is the only one and has remained almost the same since the 70s-80s. Old fashioned you might call it. \n\nAnyways, we get a call for a pick up, large pepperoni, whatever. No address or payment information is shared or written down on the ticket, so that must mean both parties have acknowledged that it is the customers responsibility to come by and pick it up.... Right? \n\nWe get a call from a guy asking where his pizza is, as he's been waiting for some two and a half hours for it to be delivered to 123 XXX Street. We check all of our tickets and can find no delivery for that address and that's what we tell him. \n\n10 minutes or so go by, it's a pick up order with the same name and similar pizza. Not unusual, the guy had a pretty common name. At this point the large pepperoni had been sitting for at least 2 or more hours. The guy exaggerated on the phone. What can you expect? \n\nMan walks in, says who his pick up is for. Oh, looks like we have two orders by that name. It wouldn't happen to be the one that's been sitting for two hours, right? \n\n\"Nah bro that's not my pizza, I just ordered\". Okay, seems a little fishy. But then he goes on to explain that he wanted his pizza delivered and how we fucked up and made a communication error. Uh, what? Even if there was one, we're not mind readers. We can't deliver to your house without an address, and the fact that you just two timed us has made your complaint null and void. What is with people, honestly?\n\nTL;DR: Man thinks he orders pizza for delivery. Waits 2 and a half hours. Orders another pizza and denies old one is his so he can have the fresh one",
        "created_utc": 1484333694,
        "upvote_ratio": ""
    },
    {
        "title": "\"Where is my son's change!?\"",
        "author": "TruthThruAcoustics",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nrdjz/where_is_my_sons_change/",
        "text": "Quick one.\n\nThis happened the other day but I was reminded of it this morning and got mildly annoyed all over.\n\nIt's a routine delivery. House seems to be in decent shape with a solid sized order so I'm expecting a decent tip. Kid opens door (FUCK), \"Hi there! That'll be $27.32 please.\" \n\nThe kid hands me: $20 bill, 1 - $10, 5 - $1 and proceeds to turn around and walk back into the house.  Awesome! I'm happy for a $7+ tip.\n\n\"Thank you so much I really appreciate it!\" and I walk back to my car thinking i should stop getting bummed out when kids answer the door, maybe they have parents who actually- \"HEY!\"\n\n....\n\n\"Hey wait come back here!!\" an adult voice.\n\n*Shit. Did I forget the sauce? They always screw me on the sauce i knew it, i KNEW i should check behind those dumba-*\n\n\"Where's my son's change!? You didn't give him his change. He gave you $35\"\n\n\"Th..The change, sir?\" Genuinely confused, the kid hadn't asked for, hinted at, or waited for change. AND he gave me 5 singles, the universal assumption is once you're giving me singles you're expecting less than singles back if anything...\n\n\"Yeah, I want my change, all of it. I was going to tip you but no way now, you tried to take advantage of my son.\"\n\nI had two other deliveries to drop off so I REALLY didn't feel like explaining that I'm not a mindreader and have no way of knowing that he wanted me to hand that money right back to him.\n\n\"I'm sorry sir next time I'll ask how much he's paying with and how much is... well, just there? I guess?\"\n\nI saw the realization wash over his face that the whole situation was pretty silly.\n\nHe still didn't tip me.\n\n\n",
        "created_utc": 1484323062,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Tax Refund",
        "author": "ChromeDemonxXx",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nncq7/question_tax_refund/",
        "text": "I work for Pizza hut as a delivery driver, and make ~ 1500 a month, trying to get an estimate of what my tax refund will be like. What do your tax refunds usually look like?",
        "created_utc": 1484268748,
        "upvote_ratio": ""
    },
    {
        "title": "What if nobody answers?",
        "author": "nmoleo64reader",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nmkk5/what_if_nobody_answers/",
        "text": "If nobody answers the door, what happens? Do you get the pizza for free? Do you have to pay for it? Do you have to bring it back?",
        "created_utc": 1484260500,
        "upvote_ratio": ""
    },
    {
        "title": "Don't expect me to pay for your food.",
        "author": "iwasthewulrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5nk4mp/dont_expect_me_to_pay_for_your_food/",
        "text": "So this literally just happened to me, and has happened a few times. \nThis customer was £1 short for his order and he's like oh I'll give it to you next time. I explained to him that I have to pay for it because now I'm £1 short in my float. \nSo he's like \"I order all the time, I'll give it to you next time\" and shuts the door. \nLike whatever it's £1, not exactly breaking the bank but it's the principle. He thinks it's ok? \nI've been in the cold and rain (on a moped) for the past 6 hours and most likely for the next 4 hours, and then still expects me to chip in for his food. \n\nI'm quite kind natured so it wouldn't bother me too much, just the fact I'm expected to do it because he doesn't have the money. ",
        "created_utc": 1484236873,
        "upvote_ratio": ""
    },
    {
        "title": "Winter Weather Thread",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ngbhr/winter_weather_thread/",
        "text": "Although this thread my be delayed for some of our northern drivers, I figured a winter weather thread would be appropriate. Please share any tips, tricks or stories winter weather related here. Most importantly be safe out there!",
        "created_utc": 1484184117,
        "upvote_ratio": ""
    },
    {
        "title": "Ex PJ's Manager of 1y AMA",
        "author": "AnotherPhilosopher",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ng9vj/ex_pjs_manager_of_1y_ama/",
        "text": "I'm from an east coast corporate store. Assistant Manager for about a year. If the mods need proof I can see what I can do.\n\nI just quit a few days ago want to know anything about this fucked up company? Just ask.\n\nEdit: obviously 420 thought I should add that",
        "created_utc": 1484183610,
        "upvote_ratio": ""
    },
    {
        "title": "\"You can keep the change...Where's my dollar?\"",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5ndupz/you_can_keep_the_changewheres_my_dollar/",
        "text": "On mobile so apologies about formatting. So I took a delivery to a college student the other day. Just a sandwich and the total was $9.07. C is customer and M is me.\n\n    M: Hi, your total is $9.07.\n\n    C: Okay, here you go. ( *hands me $10.10* ) you can keep the change.\n\n    M: Thank you ( *hands customer sandwich* ) have a good night!\n\n    C: Where's my dollar?\n\n    M: I'm sorry?\n\n    C: My dollar.\n\n    M: Oh, I'm sorry. ( *hands her a dollar* )\n\n    C: Thank you!\n\nI was completely caught off guard because when people tell you to keep the change, they mean whatever is left over, not just the actual change, a whopping 3 cents. -_- Thankfully my next delivery tipped me 4 bucks.",
        "created_utc": 1484159381,
        "upvote_ratio": ""
    },
    {
        "title": "Customer's dad tried to screw him over",
        "author": "malren",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5na7xk/customers_dad_tried_to_screw_him_over/",
        "text": "Well that was an odd one. UberEats delivery. The app has a pin right on the listed address. I walk up to the door and an older guy answers. He acts like he has no idea why I'm there. I give him the customer's name. He says no one there by that name. I confirm the address. I show him the phone number and he says it's not anything he recognizes. I apologize and go back to my car and call. Customer says I'm at the right place, but he thought he could go get gas and come home before I made it.\n\nOK. That's dumb, but whatever. I explain what the old guy said and he begged me to wait. I said I'd wait 5 minutes. Then some younger guy came out of the house, told me the customer's name and apologized for his dad. Apparently the old man was mad at his son and decided to try to send me away as some kind of revenge.\n\nFamilies are weird.",
        "created_utc": 1484110754,
        "upvote_ratio": ""
    },
    {
        "title": "New to the job, tips, advice?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n7a3t/new_to_the_job_tips_advice/",
        "text": "[deleted]",
        "created_utc": 1484078452,
        "upvote_ratio": ""
    },
    {
        "title": "\"Nobody's here,\" says... some guy?",
        "author": "Corac42",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n582k/nobodys_here_says_some_guy/",
        "text": "A few days ago I had the most bewildering sequence of events occur to me, and I'm at a loss as to any explanation. \n\nShowed up at an apartment in the projects and knocked on the door, and a voice inside asked \"Who is it?\" I answer and hear nothing. For something like five to ten minutes I stand there in the cold, sometimes knocking, sometimes saying something, no response. I finally said \"Alright, I'm sorry, but I'm gonna have to leave now,\" and was just about to turn around and leave when a pickup truck pulled up. \n\nGuy got out of the passenger seat, the truck went on its way, and he walked up to the door. I said something like \"Oh, is this yours?\" \n\nI thought he answered with \"Yeah, just hold on,\" or something like that, but I may be mistaken. He unlocked the door and went inside. TV was on, lights were on. He popped back out and said \"Nobody's here.\" \n\n\"Oh, this isn't your place?\" \n\n\"No, but nobody's here.\" \n\n\"But somebody said 'who is it?'\" \n\n\"Must have gone out through the back, nobody's here. \"\n\nSo I took it back to the store. The pizza was better than whatever tip I might have gotten, so it wasn't really a loss, but I'm gonna be thinking about this for basically ever until I have an explanation in satisfied with. ",
        "created_utc": 1484057449,
        "upvote_ratio": ""
    },
    {
        "title": "Store manager doing some slimy shit with time sheets",
        "author": "ValenceLP",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n499t/store_manager_doing_some_slimy_shit_with_time/",
        "text": "Alright, so here's the deal y'all, my store manager has been fucking around with people's hours.\n\nI'm currently working at dominos as a driver and have been noticing some hours going missing. No big deal, I'll bring it up with my store manager. So I do, they pull up the time sheets. Well I notice that I have been clocked out by various assistant managers way more than I should have been and I'm missing a good amount of hours. \n\nSo I thought that that was the end of it, AM's clocking me out, I decided I'll have a talk with them and figure it out. End of story. But wait, there's more!\n\nI chat with the AM that had been clocking me out and he genuinely seemed shocked. I can spot a liar pretty damn well, so if he pulled the wool over my eyes, I'm impressed.\n\nThen I go and ask around my store with some trusted co-workers. Here's where it gets juicy. Apparently they have been losing hours too, and apparently the same thing happened back when another AM was causing problems with the store manager and then all of a sudden this AM started chopping hours and subsequently got fired. But the thing is that this wouldn't really do anything for an AM, BUT if my store manager meets some sort of quota for low labor costs for their employees, the store manager gets a raise. Also, the store manager has access to the usernames and passwords of the AM's.\nThis could make it terribly easy to cut people's hours and frame various other AM's for the issue.\n\nI wish I could bring this to my district manager but from extensive digging I have found that he has covered shit like this up for a while.\n\nAny advice on what the hell I should do would be great, I could definitely quit but I'm not going to leave my team in a situation like this.\n\nTl:dr my store manager is adjusting people's time sheets to reduce labor costs and framing assistant managers for it. Help",
        "created_utc": 1484042949,
        "upvote_ratio": ""
    },
    {
        "title": "Store manager doing some slimy shit",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n46m2/store_manager_doing_some_slimy_shit/",
        "text": "[deleted]",
        "created_utc": 1484041694,
        "upvote_ratio": ""
    },
    {
        "title": "Angry customer bitching at me through my personal phone",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n3tke/angry_customer_bitching_at_me_through_my_personal/",
        "text": "[deleted]",
        "created_utc": 1484035121,
        "upvote_ratio": ""
    },
    {
        "title": "I ordered at the last second, but how would you feel about this?",
        "author": "HewloTherexP",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n3sjm/i_ordered_at_the_last_second_but_how_would_you/",
        "text": "Hey!  \n  \nSo I was ordering Domino's last night and placed an order for 10 pizzas, a few garlic breads and a few drinks for delivery (it's like &lt;10 mins from the store) at 11pm on the dot (exactly when they close). Should I feel bad about doing this? I'm in Australia and tipped the guy $15, although most people in Australia don't even tip at all.  \n  \nEdit: I prepaid for the order and tipped in cash.",
        "created_utc": 1484034632,
        "upvote_ratio": ""
    },
    {
        "title": "\"I wanted it at 12:30 PM at night, STUPID!\"",
        "author": "MySuperLove",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n28jn/i_wanted_it_at_1230_pm_at_night_stupid/",
        "text": "So we had an online timed order for 12:30 PM.  I show up at 12:28, in the middle of the lunch rush. I knock on an apartment door, and the lady answers with \"ARE YOU FUCKING KIDDING ME?!\"  I apologize for being early, and she yells that I'm actually late, like \"12 fucking hours late.\"  I show her the 12:30 PM timed order tag on the box and she yells at me, \"Yeah, PM!!!  I ordered this for 12:30 PM AT NIGHT!\"  I tell her that 12:30 PM is after noon.  \"No it isn't!\"\n\nAt this point, I'm mad.  \"Well look at the time on your phone, what does it say?\" \n\n\"PM, what the fuck, when did they change that?!\"\n\nNever, it never changed. So I look at her and tell her it'll be $29.xx and she replies that she isn't going to pay. Without saying anything else, I turn around and walk away.  \"That's it?!\" she calls out after me.  I didn't reply.  I kept walking. And you know what?  I ate like 1/4 of her pizza.  \n\nI love how she never apologized but tried to blame the world for \"changing\" how time works on her.",
        "created_utc": 1484014917,
        "upvote_ratio": ""
    },
    {
        "title": "Help please! PJs people especially",
        "author": "TheVoicesSayHi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n23ap/help_please_pjs_people_especially/",
        "text": "I tried to make a throwaway but after about 20 tries I gave up.\n\nI'll try not to put too many details but I'm kinda freaking out right now.\n\nSo I got into work today and before I could clock in the GM pulled me in her office and said that on my ID there's been a bunch and I mean a bunch of voids where the people got their pizza and paid me.\n\nThis is where it gets particularly odd she said on one occasion there were 18 in one night and a couple others with zero trip time meaning voided while clocked out and me clocking out another run in 5 minutes.\n\nBut I didn't do anything like that, if I did how would I still owe the store like $200 every night? I don't even remember the last time I took 18 runs in one night because we're not a high volume store.\n\nI have a theory that after I pay the store and claim my tips and go to clean that the closing manager is voiding the orders and taking the money out but I don't know if there's a way to do that or prove it.\n\nCan any pjs managers or anything tell me if the system will show when the voids happened? I mean if they all always happen at 1am or something that's obviously while counting is happening \n\nI mean 18 in one day!? What shift leader in their right mind wouldn't notice that all of a single driver's runs got voided?\n\nAny help please if you can. I'm so scared I need my job and if I can't prove it at best I'm going to lose it but if they make me pay back whatever I allegedly stole I don't have money to pay I don't want to go to jail",
        "created_utc": 1484013279,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm in California!\"",
        "author": "LadySax",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n1npf/im_in_california/",
        "text": "I'm a manager at a local pizza chain in California. The other day I was working as the closing driver. The very first run after I clocked back in from my break was a double.  \nOne of the addresses isn't coming up on the computer, but my boss put the address through Google maps and told me it was on the corner of X Ave and Y Street. I put it through my Google maps to see exactly where and the address was coming up out of our delivery area. So, I called the woman who placed the order:\n\nMe: Hi, this is LadySax from PizzaChain. I'm just calling to confirm your address. Is it 123 X Ave?  \nWoman: No! 123 X STREET it's STREET.  \nMe (there's no X Street in City): Are you in City, California?  \nWoman: 123 X Street, City! 123 X, 123 X!  \nMe: So you're in City, California?  \nWoman: 123 X Street!  \n\nAnd then she hung up on me. I took the order out anyways. I drove to the corner of X Ave and Y Street and it's a 2300 block. I called my boss back at the store to let her know, then I called the woman again:  \n\nMe: Hi, this is LadySax at PizzaChain again. I'm having a hard time finding your address. Are you sure you're in City, California?  \nWoman: No! CITY P A, CITY, PENNSYLVANIA.  \nMe: I'm sorry it seems that you placed your order to the wrong location.  \nWoman: No I did not! 123 X Street City PA.  \nMe: Ma'am, I'm in California, not Pennsylvania.  \nWoman: Oh my God. So what are you going to do?  \nMe: I'll cancel your order when I get back to the store.  \nWoman: But my store is closed! It's 2am!  \nMe: I'm sorry ma'am, but I can't deliver to Pennsylvania.  \n\nShe hung up on me again, so I went about my double and went back to the store where my boss asked me how the trip to Pennsylvania was.  \nApparently the woman called the store telling them how she was in Pennsylvania and she wanted her food, and how she was going to starve because her store is closed, and (you guessed it) it's all my fault!",
        "created_utc": 1484008596,
        "upvote_ratio": ""
    },
    {
        "title": "Suspicious Situation/Activity - What Would You Guys Do?",
        "author": "officialxian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n0wah/suspicious_situationactivity_what_would_you_guys/",
        "text": "Last night I delivered to an apartment in a kinda crappy part of town, nothing new there. I come down the stairs and start walking back to my car and some guy is there.\n\nI was freaking out, he had a jacket on and one hand in a pocket as if hiding a gun like you'd see in the movies. \n\n\"I don't mean you any harm, I just want to ask you some questions about the person you just delivered to.\"\n\n*whew, not gonna die tonight*\n\nHe says that he is investigating something with (local PD) and needs some information. He asked me a ton of questions about her appearance and I just said I wasn't sure, but he was asking very specific things and was spot on with his descriptions..\n\nHe was very obviously not an officer, he was wearing street clothes and didn't offer any sort of identification. He said he was going up to knock on the door and to \"do whatever you have to for your job.\"\n\nI told him I was leaving and he went upstairs and knocked on the door. I got the hell out of dodge and parked on the next street up to call (local PD) to verify if shits legit. They didn't know of any investigation going on but they took my info and said they'd pass it along.\n\nI called the non-emergency line, but feel I probably should have called 911 because of how suspicious it was and if she was in immediate danger, the cops didn't seem to care on the non-emergency line. What would you guys have done?",
        "created_utc": 1484001106,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for something to carry on deliveries that is a flat surface",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5n0jfn/looking_for_something_to_carry_on_deliveries_that/",
        "text": "[deleted]",
        "created_utc": 1483997707,
        "upvote_ratio": ""
    },
    {
        "title": "Did I deliver to a kidnapper?",
        "author": "FeculentUtopia",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mxjpa/did_i_deliver_to_a_kidnapper/",
        "text": "As I'm going up to the condo,  it's quiet.  I knock,  and loud music starts blaring.  Did I come up during a break in the music?  Door opens,  and I can now hear it's a radio station,  hastily tuned to 70% static and 30% *Electric Avenue*.  It's loud enough we're nearly shouting over it.  Transaction complete,  door closes,  music goes off.  \n\nThe guy had to be covering sounds he didn't want me to hear,  but what? Could be totally innocent,  or he could be playing Wild Bill in his basement.  Doesn't help his case the place was ratty and he looked like the guy who says \"It's\"  at the start of *Monty Python's Flying Circus.*",
        "created_utc": 1483967229,
        "upvote_ratio": ""
    },
    {
        "title": "It's been real...got fired today.",
        "author": "Jay_Train",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mutnj/its_been_realgot_fired_today/",
        "text": "I literally talked to my boss last week regarding things I needed to improve. She told me I have improved everything except run times. Well, the problem with that is she's taking averages from last month to see my average run time. Last month we were super busy all month, we had four days of ice and a week of snow, so at least half the month ALL the run times were fucked. On top of that, she had to bitch out one of our managers because he's a lazy fuck and runs were going out at like twenty minutes instead of 10-14. Those minutes ALSO skew the average run times. In any case she said I was doing great.\n\nI come in today and she immediately takes me to the office, tells me I have all these customer care cases that all involve me. I asked to see them, and of course magically she was having trouble finding them. Said my run times are awful, I'm always late (like I said, she literally told me a week ago that I was great on everything), that this isn't her choice but HER boss said I had to be let go. I just saw him yesterday. He was in the store for half of my shift.  Told me great job getting your numbers back up. Didn't fire me then, while he was there. Must have been to busy praising my better times.\n\nLast night was the first night of \"now we only get to take singles ONLY, no matter what.\" I made less than minimum wage last night. I texted my boss and told her this wasn't going to fly, and that I'm gonna have to find a second job so my schedule might change. And today I get fired for all that. \n\nI'm filing for unemployment tomorrow and calling corporate, I want to see these customer care cases that cost us so much money, because I work full time pretty much every night, and I don't recall ANY care cases coming through for at least a month, and I have the highest driver rating on the customer satisfaction deal. By far. \n\nRules at this fucking shit show change EVERY TWO WEEKS. The owners have a bunch of other stores in a metro area. They have small, metro area delivery areas. We are their only store not in that metro area, and on top of that it's a college town. A SMALL college town. The owners change shit at the end of EVERY semester because they can't figure out why sales are down and it must be our fault. Literally half the town leaves during school breaks. They lost their fucking mind last summer. He had 50 percent of the sales we usually have, all summer, because not only did half the town leave, but a lot of other people go on vacation and whatnot and literally EVERYWHERE has less sales. This \"only taking singles\" deal was their idea to get better run times, but as I stated earlier, HE RUN TIMES ARE FINE. THEY AVERAGED ALL DAYS AND INCLUDED THE HOLIDAYS AND ICE DAYS AND SNOW DAYS. NO SHIT OUR TIMES ARE WORSE THIS MONTH.\n\nI just think my boss got mad I wouldn't be closing any more and fired me before I could even start getting less hours. Like I said, I'm gonna see if I can't get copies of all these customer care reports, because I'd like to be able to prove they don't exist, and at least let them know I know they're lying, plus it might help with unemployment.  Sorry about the wall of text, I'm just extremely confused and pissed off.",
        "created_utc": 1483926576,
        "upvote_ratio": ""
    },
    {
        "title": "When your boss decides to stay open in a snow storm",
        "author": "LaughNgamez",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mttx3/when_your_boss_decides_to_stay_open_in_a_snow/",
        "text": "http://i.imgur.com/BqM1pT7.jpg\n\nGood luck to everyone dealing with bad weather!",
        "created_utc": 1483916064,
        "upvote_ratio": ""
    },
    {
        "title": "Biggest pet peeves on the road?",
        "author": "seewicked27",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mpq9t/biggest_pet_peeves_on_the_road/",
        "text": "I'll start: \n\nPhantom stop signs, not using turn signals, going too slow in the left lane.",
        "created_utc": 1483860068,
        "upvote_ratio": ""
    },
    {
        "title": "Exact change.",
        "author": "Ogichidaawi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mpgda/exact_change/",
        "text": "I wanted to start a conversation on exact change.  Providing or receiving.  I just had a ridiculous moment so I wanted to hear some other stories.   Ready go pizza cult. ",
        "created_utc": 1483855423,
        "upvote_ratio": ""
    },
    {
        "title": "Snow",
        "author": "Alamoa20",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mp56g/snow/",
        "text": "You called and I picked up.\n\nThe storm was raging outside, but I'm not a complete chump.\n\nCan I get a delivery?\n\nYou don't ask if we're actually delivering? Can't you feel the snow storm? You're not the least bit shivery?\n\nSure, what's the address?\n\n3 miles into the next town, no biggie, no stress.\n\nI pack up your pies, drink and wings.\n\nI make sure I forget nothing, and I use my jacket to cover your things.\n\nI'm wearing my cap, the car is running and my fingers are about to drop.\n\nI just cleaned the windshield, windows and mirrors, but this storm just will not relent, shall not stop.\n\nI start to drive, slowly enough so as to not die\n\nBut fast enough to get you your pie.\n\nEvery time I make a turn, I say my prayers.\n\nAll I can see are the sparkly pairs.\n\nOf cars coming and going, \n\nThrough this storm, with rage blowing\n\nYou have a nice house, a rich car and decorations\n\nFor this disappointment, I had no preparation. \n\nThe door opens and you refuse to step outside.\n\nObviously, you don't think the weather justifies.\n\nBut here I am. Braving the wind, blindness and cold.\n\nHere you go, sir, the pie and wings you may hold.\n\nAs I take out my clipboard and pen for you to sign.\n\nThank you, I hope you and your family enjoy your dine.\n\nYou slam your door shut, I couldn't tell what's coming...\n\nMy head suddenly feels cold, bitter and numbing.\n\nIt's okay, I mumbled. 'Tis worth it for the tip\n\n$2\n\n\n",
        "created_utc": 1483850923,
        "upvote_ratio": ""
    },
    {
        "title": "A story of two crotchety old men",
        "author": "DracoAzuleAA",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mot2r/a_story_of_two_crotchety_old_men/",
        "text": "Today, I probably took the best nursing home delivery I've ever taken.  \n\nSo I'm walking down the hallway trying to find the customers room.  And they have a food cart sitting on one side of the hallway.\n\nThere's this old dude in a wheelchair coming down the other side of the hallway.  So I politely and patiently wait for him to go by.  He stops and he's like \"Hey pizza man!\" I smile and say hi.  He goes on talking about pizza.  I'm being polite and listening.  Smile and nod, etc.  Keep in mind, however, the hallway is completely blocked now.\n\nThis other dude in a wheelchair comes up behind him and he goes \"MOVE!\"\n\nDude in front looks back and goes \"You shut the hell up!\"\n\nDude behind him starts mocking him.  Dude in front goes \"I'm gonna knock the hell out of you!\" \n\nAnd it just erupts into absolute chaos right in front of me.  Nurses come running, I push the cart out of my way and just start walking.",
        "created_utc": 1483846397,
        "upvote_ratio": ""
    },
    {
        "title": "Dear customers: Please stop saying this...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mnkxm/dear_customers_please_stop_saying_this/",
        "text": "[deleted]",
        "created_utc": 1483831557,
        "upvote_ratio": ""
    },
    {
        "title": "Pickup or Delivery",
        "author": "angrycoast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mjcu0/pickup_or_delivery/",
        "text": "I have always answered the phone saying the place I work and pickup or delivery. Well it has been stirring the pot quite a bit at work and the managers are always like you really should be saying \"thank you for calling blah blah, How can I help you.\" I think the people ordering the pizza and me taking the call want to just get the order completed as fast as possible so I just cut to the point, nope not my mangers. They're even getting on us now about a loyalty program, that we should be offering but no delivery driver has really started yet because time is money for us and we need to get back to the shop and deliver as many pies as possible without having to give a sales pitch at every door. \n\nSo today, I answered the phone and the owner heard me say the \ndreaded pick up or delivery. He asked me what my name was and one of my managers told me I can't say that anymore. The whole reason why it kind of irks me is that I don't feel like I'm being rude, I'm just being real and I think most people can appreciate that. They don't want to hear a sales pitch and most likely the best way to help them is get them their food on time and the way they want it.\n\nI told you guys this so hopefully a few of you can agree and I can restore my faith in humanity!",
        "created_utc": 1483774607,
        "upvote_ratio": ""
    },
    {
        "title": "Promised delivery position when another driver leaves. Should I get it in writing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mhusr/promised_delivery_position_when_another_driver/",
        "text": "[deleted]",
        "created_utc": 1483754832,
        "upvote_ratio": ""
    },
    {
        "title": "Papa Johns - I guess I got hired?",
        "author": "ahhhyepz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mha5o/papa_johns_i_guess_i_got_hired/",
        "text": "Hello, \n\nI applied for delivery driver at papa johns (previously worked at dominos for 1.5 years) and went in to fill out paperwork on monday.. they ran my background check/MVR and he told me he'd call back either that monday/tuesday to let me know...\n\nanyways I called back tuesday (around 2pm) and the GM said he forgot to call me and that I passed. he said he was just waiting on a uniform and he'd call me back, again....\n\nanyways that was tuesday and I find it a little hard to believe it's taking this long to find a uniform, but i'm not sure..\n\nshould I be looking for other jobs or should I give it a couple more days??",
        "created_utc": 1483748261,
        "upvote_ratio": ""
    },
    {
        "title": "NYC reporter looking for your craziest stories",
        "author": "KMAwrites",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mg7g4/nyc_reporter_looking_for_your_craziest_stories/",
        "text": "[removed]",
        "created_utc": 1483736933,
        "upvote_ratio": ""
    },
    {
        "title": "What, if any, weapon(s) do you carry with you on deliveries for self defense?",
        "author": "plo1357",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mflu1/what_if_any_weapons_do_you_carry_with_you_on/",
        "text": "As a young, not at all buff driver, I tend to sometimes feel unsafe at night in certain places, if not most places. Obviously I'm probably going to be a young guy with food and money, so as far as easy targets go, delivery drivers are ones you can order. Ironically, the closest I've ever gotten to using the knife I keep in my pocket was in a relatively high-income neighborhood, when an extremely drunk guy tried to convince me he paid over the phone with a card, even though I had no receipt. Long story short, he ended up throwing his cash change on his porch and slamming his screen door yelling \"asshole\" as if I couldn't hear him. I pocket the porch money and got the hell out of dodge. Anyway, what, if any, weapons or methods of self defense do you have as delivery drivers? ",
        "created_utc": 1483730978,
        "upvote_ratio": ""
    },
    {
        "title": "One of our rivals had really bad pizza...",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5merlz/one_of_our_rivals_had_really_bad_pizza/",
        "text": "[This strip](http://www.thewebcomicfactory.com/comic/tales-of-pizza-how-a-boss-saves-money/) is based on one of the rival pizza places.  I mean, the place I worked for was pretty bad.  The cook stirred the sauce with his arm, the boss never threw out pizza and I'm pretty sure they never stored food properly.  But our rival was just gross.  I know, because I made the mistake of getting a pizza there because I thought ours was so bad.  One bite and I wanted my money back.  Fortunately it was only a couple of slices, so I just threw it away.\n\nSo any horror stories about bad pizza?",
        "created_utc": 1483722890,
        "upvote_ratio": ""
    },
    {
        "title": "Weird incident and some questions",
        "author": "Sherwoodblountjr",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mejjq/weird_incident_and_some_questions/",
        "text": "So, I'm not a pizza guy myself, but I do have an eternal weakness for Dominos (don't judge me). Last night, I put in an order for carryout, as the store is literally around the corner from my apartment. As I approach, I see two kids inside (late teens, probably), talking to the counter guy through the glass. I don't really think anything of it until I walk inside and realize they are having a screaming argument.\n\nSo, I'm standing inside this tiny box of a Dominos, and these two kids are standing at the counter screaming through the glass (the opening part is shut and locked), and the entire staff is behind the counter. I can't really get too much about what's happening, but it seems like the kid is talking about how they took his money.\n\nI walk outside because I figure it's going to be a while before I get my pizza, and I don't want to be in the middle of whatever happens. Debate what to do next, when a cop car pulls up. This should be interesting.\n\nSo I hang around, watching, assuming the cops are just going to yell at the kids and tell them to fuck off and/or arrest them, but it seems like the two kids were the ones that called the cops, which raises my eyebrow. As the kids are talking, the side door opens (the one the delivery drivers use) and a handful of the staff comes out to talk to cops as well.\n\n\nSo, listening to them it seems like the kid's story is: we ordered a pizza and he took my money and then didn't give it to us (which seems like fucking bullshit). A guy I later figure out is the delivery driver says he went to the apartment to deliver, they gave him one dollar, and when he went to take the pizza back they punched him in the face. I assume he then went back to Dominos and the kids followed him?\n\nThe weird part was, the cops basically just rolled their eyes and did nothing. The end of it was \"OK, so give him back his dollar and if he wants to make it a civil matter he can.\" So the delivery guy, just fed up at that point, hands him a buck, and the kids storm off, muttering all kinds of bullshit. The kid's buddy was taking video on his phone the whole time, surely to put on youtube later.\n\nThe questions I have are:\n\n* The delivery guy said that the address was \"always a problem,\" and this type of thing happens often, so why aren't they blacklisted?\n\n* At one point when delivery guy and kid are arguing with cops the kid pulls out this giant wad of cash and is like \"Why would I not pay you when I've got all this fucking money?\" My retort would be that teenagers are pieces of shit and do crap like that because they think it's funny, but who knows.\n\n* Also, if the driver actually got punched in the face, why would he not insist that the kid be arrested/want to press charges? I mean, he seemed fine, so I guess it's probably more trouble than it's worth, and I assume he doesn't want corporate to know because they'll probably just fire his ass without seeing what happened.\n\nThanks for all the great stories and pizzas, guys. Keep 'em coming!\n",
        "created_utc": 1483720691,
        "upvote_ratio": ""
    },
    {
        "title": "Bill",
        "author": "SillyVillager",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5me7g7/bill/",
        "text": "So I work for a Round Table in California. It's a smallish suburban town which means lots of tips with not a lot of crime or crazy people. Bill however is...different. \n\nBill is by far my favorite customer to deliver to, always tips $10 no matter how small the order, very kind, and respectful, porch light on and he seems to have this telepathic connection to the road in front of his house, because he is always in his doorway waiting for me. Sounds like the dream customer except that bill answers the door holding a rifle, every time, and doesn't put it away while you interact with him. \n\nI have no idea why he does this, he doesn't live in a bad part of town or anything, but he never points it at anything other than the ground and keeps his fingers far away from the trigger, so I leave him be. \n\nNow the thing about our store is, we go through drivers quickly. Myself and 1 other person are the 2 senior drivers there. And most of the new drivers are fresh out of high school suburban kids who's only experience with a gun involves Call of Duty. So naturally we send new drivers to Bill regularly and pretend to not know who he is. This usually ends up with them either calling the store asking what they should do, or coming back and quitting. Well last night the new driver surprised us by calling the police and then driving back to his house with 2 other orders in his car. \n\nThis naturally was a major fucking headache for everyone as we had to not only remake 3 orders, but we now are missing 3 hot bags. The franchise owner, after we explained what was going on, decides that we will no longer be delivering to Bill, and when I take Bill his remade order I have to inform him of this. Bill took it like a champ, tipped me $20 which was the strangest response I've ever had to telling someone they are blacklisted and we had a good laugh about \"kids these days\" Goodbye Bill I will miss delivering to you so much.",
        "created_utc": 1483717226,
        "upvote_ratio": ""
    },
    {
        "title": "Stuck Here Until You Die",
        "author": "AverageSandwich",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mc2j3/stuck_here_until_you_die/",
        "text": "Inspired by the \"Quick! Grab a weapon\" post which had some great replies and I will definitely be taking to my store.\n\nA similar game me and my co-workers play is \"You're stuck in Pizza Hut until you die, how do you kill yourself?\" \n\nMy personal favorite reply was to wrap a shirt around your hand, soak it in water and punch the fuse box. \n\nWhat do you got?\n",
        "created_utc": 1483684094,
        "upvote_ratio": ""
    },
    {
        "title": "What advice would you, a driver, give to the customers?",
        "author": "chilledgoats",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5mamth/what_advice_would_you_a_driver_give_to_the/",
        "text": "Mine is: Have your porch light on if you've got delivery coming. ",
        "created_utc": 1483666563,
        "upvote_ratio": ""
    },
    {
        "title": "About to accept a job at Marcos pizza for delivery, but...",
        "author": "kyrdo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5m9zmr/about_to_accept_a_job_at_marcos_pizza_for/",
        "text": "There's a catch. They pay a flat $8.10/HR for their drivers, but provide no per delivery reimbursement. So it's just $8.10 + tips. Do you think in the long run that will end up working out? I'm not sure if that's better or worse than the split wage that most other places around here do. What do you guys think?",
        "created_utc": 1483659407,
        "upvote_ratio": ""
    },
    {
        "title": "About to accept a job at Marcos pizza for delivery, but...",
        "author": "kyrdo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5m9zms/about_to_accept_a_job_at_marcos_pizza_for/",
        "text": "There's a catch. They pay a flat $8.10/HR for their drivers, but provide no per delivery reimbursement. So it's just $8.10 + tips. Do you think in the long run that will end up working out? I'm not sure if that's better or worse than the split wage that most other places around here do. What do you guys think?",
        "created_utc": 1483659407,
        "upvote_ratio": ""
    },
    {
        "title": "Quick, your store is being robbed! What do you grab as a weapon?",
        "author": "theplaneflyingasian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5m9kfr/quick_your_store_is_being_robbed_what_do_you_grab/",
        "text": "My coworkers and I get bored and often entertain this thought. If your store was being robbed and you had to fight back, what would you use? I always say I would go for some large pans and throw them like frisbees, one of those in the dome would definitely put you out. Haha. Maybe throw the cutter like an axe? What would you use and how would you use it? ",
        "created_utc": 1483655165,
        "upvote_ratio": ""
    },
    {
        "title": "It's going to get down to 4 degrees tonight, answer your fucking door",
        "author": "caeliter",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5m3qpr/its_going_to_get_down_to_4_degrees_tonight_answer/",
        "text": "Sorry, i can't actually yell at my customers and I needed to vent. Seriously it's frustrating normally but at these temperatures health concerns are a thing.\n\nWhy do people order then not stay where they can hear the door?",
        "created_utc": 1483584272,
        "upvote_ratio": ""
    },
    {
        "title": "What should I say in my write up statement?",
        "author": "goots95",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/5m12kl/what_should_i_say_in_my_write_up_statement/",
        "text": "First time ever written up. I was late. Not salty or anything, just want to write something funny on the paperwork",
        "created_utc": 1483557026,
        "upvote_ratio": ""
    }
]