[
    {
        "title": "Publicly addressed printers are weird",
        "author": "pugsofwrath",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ais27/publicly_addressed_printers_are_weird/",
        "text": "Characters :\n\n$Me - university  student in network security and tech support for friends\n\n$Friend1 - one of my friends having trouble with the campus-wide printing software\n\n$Friend2 - other friend trying to help $Friend1 but does not have tech experience\n\nContext:\n\nMy university has two campuses, each of which have separate networks of printers. To allow students to print form their own devices they use a piece of software but reuqres one installation for campus 1 and another installation for campus 2. The software requires that, when printing, the user select the name of the campus to print to. The pages are the  available on campus-wide printing terminals that work with a swipe of your I'D.\n\nAdditionally, this university was assigned many IPv4 addresses and thus has publicly addressable printers for whatever reason. This university uses, for anonymity 123.123.123.123.\n\nThe story: \n\n$Friend1 gives me a call one night about issues she's having installing the campus printer software. Knowing that the installation can be a but tricky for not as technical users, I assume that something went wrong with the installation or the $Friend1 installed software for the other campus.\n\nI meet up with $Friend1 and they tell me that they have already reinstalled it a few times. Just to be sure, I re-download it and re-install it just to be sure and they tell me that's exactly as they installed it. So I have $Friend1 try to print the document and see in the \"print to\" filed $Friend1 has selected 123.124.123.135.\n\n$Me - Why are you printing to this UP address?\n\n$Friend1 - Friend2 told me to print here. They said it works for them.\n\nI instruct $Friend1 to select the correct campus from the \"print to\" field and don't think much of it until later. \n\nAt the time, I did not know that my university used 123.123.123.123 addresses or that the printers are publicly addressed. I find this out layer that day during one of my classes and find that the address $Friend1 was printing to was the address of the university website and must of been of a printer. \n\nI still don't know how $Friend2 got hold of that address and I don't think I'll ever know.\n",
        "created_utc": 1523115062,
        "upvote_ratio": ""
    },
    {
        "title": "Tech Support Danger Zone",
        "author": "ajblue98",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8aiqem/tech_support_danger_zone/",
        "text": "[removed]",
        "created_utc": 1523114636,
        "upvote_ratio": ""
    },
    {
        "title": "The inkernetz is not working!",
        "author": "Trimplis",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ahfra/the_inkernetz_is_not_working/",
        "text": "[removed]",
        "created_utc": 1523100019,
        "upvote_ratio": ""
    },
    {
        "title": "Letters are not letters",
        "author": "Enania",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8agiwy/letters_are_not_letters/",
        "text": "Hello tfts, \n\nAnother little student-IT story. \n\n\nA Student comes in a little annoyed, and says he can not for whatever reason log in to the computers on campus. My university uses an online system and the same username and password combination for the Workstations. He assures me over and over that he is indeed putting in the right password and it works fine back at home on his PC. \n\n\nSo I go over the usuals, see if he's blocked, let him try on my work-pc, try to get him logged in on the Onlinesystem... Nothing, the gates are closed. \n\n\nWe both get a little frustrated, and I'm pretty close to just resetting his password. Until he shows me again on his phone, that he just can login fine and there is nothing wrong with his account, its just the damn PCs.\n\n\nThat's the moment I realized, and I should have known... \n\n\nHe's using a QWERTY*) Layout. \n\n\nI refrain from hitting my head on my desk and tell him he should pay close attention to what he was typing. And the day is saved, nobody wanted to see my manager, angels sing and I can proceed to sip my now-cold coffee. \n\n\n*) Workstations - including my PC - use QWERTZ\n\n",
        "created_utc": 1523085305,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t undermine me",
        "author": "nik_drake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ager1/dont_undermine_me/",
        "text": "I work technical escalations for an ISP...\n\n&gt;Me: This is nik.  How may I assist.\n\n&gt;Cst: What would it cost to fix the piece that holds my cable in?  My service is working just the piece holding it in broke.\n\nAn account is automatically on my screen.  Customer only installed our services about two weeks prior.\n\n&gt;Me: Well if a cable is broken it is easy enough to go to a store like *$bigboxyellowsmileyface* or *$yellowpricetagplace* and get a new one.\n\n&gt;Cst: But it is just the piece that holds it to the wall, not the cable.\n\n&gt;Me: Yes, the best thing to do is replace the cable.  We could also supply one for you.\n\n*inauble comment in background*\n\n&gt;Cst: But the cable is stappled to the wall.  I can’t just remove it.  The tech stappled it there.\n\nI pause in my thoughts here.  We only stapple the cables to a location if it is the only way to safely install a cable, a customer is a pain and insists on it, or the tech is an idiot.  I start to prep myself to explain that any mistakes with the installation we could get someone out to remedy.  A stappled cable could have been damaged by us or have other issues. In that split second I hear another inaudible comment.\n\n&gt;Cst: You are undermining my argument. \n\nOver the next 4 minutes I listen to the customer berate someone else in the room about how they don’t pay rent or ever do the laundry.  I sit there staring at my monitor and scratching my head.  I didn’t even know what the other person said.  Customer finally seems to be back in the conversation with me again.\n\n&gt;Me:  Well if there is something wrong with a cable w...\n\n&gt;Cst:  It’s not the cable.  My service is working fine.  It’s the piece that keeps it on the wall.  We moved a bed and broke it.\n\nMy head is now on my desk.  Every statement that I was carefully wording about how we would get a tech back out to double check and correct any issues with the install and cabling were gone.  The customer just admitted that she damaged the cable.\n\n&gt;Me:  That is part of the cable. It will be $x for us to fix it.\n\n&gt;Cst:  Thank you.  That is all I wanted to know.\n\n&gt;Me: Do you want to schedule someone?\n\n&gt;Cst: No,I just wanted to know the cost.\n\n&gt;Me:  Alright, well have a good day.\n\nTL:DR- Customer spends time berating someone else about undermining her argment with her ISP only to undermine her own argument immediately after.",
        "created_utc": 1523083619,
        "upvote_ratio": ""
    },
    {
        "title": "Moral is choose your next I.T. job wisely.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8afmw8/moral_is_choose_your_next_it_job_wisely/",
        "text": "[removed]",
        "created_utc": 1523073625,
        "upvote_ratio": ""
    },
    {
        "title": "Two drives, one cable",
        "author": "curtludwig",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ae0q1/two_drives_one_cable/",
        "text": "Back in days gone by people editing video had big SCSI drive arrays, those arrays unsurprisingly connected to computers with SCSI cables. To move a cable the computer needed to be shut off first.  \n\n\nEnter customer Betty who had two drive arrays but only one cable. This had been going on for a long time but somehow she couldn't remember it for more than about 2 days. Every couple days Betty would call in with some variation of:  \n\n&gt;Betty: My media is offline  \n&gt;Me: shut down your computer, disconnect the cable from whichever array you're connected to now, move it to the other one and power back up.  \nInterminable wait later  \n&gt;Betty: Oh, there it is.  \n\nThis continued for a number of months until I'd finally had enough, I told Betty in no uncertain terms that she was cut off from support until she got another cable, that no, cables were not too expensive (she was running a business) and no, I had no sympathy that she didn't have anywhere she could buy one locally, the internet could easily supply a new cable. I bid her good day and hung up.\n\nI sat seething for a minute and finally had to walk around the building a couple times to calm down. After the first lap I realized I'd made a major mistake and would probably lose my job for this. I made another lap and then headed back to my desk to pack up my things.  \nI'd gotten my desk more or less cleaned (throwing out trash prior to packing) when my boss called me into his office:\n&gt;Boss: So whats up?  \n&gt;Me: Oh you know, the usual.  \n\n\nI was not giving him the satisfaction of ratting myself out.\n\n&gt;Boss: Betty called, she said you yelled at her.  \n&gt;Me: Yeah, I might have done that.  \n&gt;Boss: She asked me to give you the rest of the day off with pay. She said you finally made her realize she'd been silly all this time and she promised to order a new cable right away.  \n\n\nI got the rest of the day off and true to her promise Betty got a new cable and was a model customer from then on...",
        "created_utc": 1523056751,
        "upvote_ratio": ""
    },
    {
        "title": "I don't have [peripheral], I have [inbuilt component that performs the same function]!",
        "author": "miscreancy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8acixo/i_dont_have_peripheral_i_have_inbuilt_component/",
        "text": "Following my [previous post](https://www.reddit.com/r/talesfromtechsupport/comments/89yn0x/what_do_you_mean_i_have_to_do_it_myself/), here's another story regarding my time working for $GiantSupermarketChain on their helpdesk. While tangentially involving peripherals, this one's more about users and the lengths we go to just to get into their machines to diagnose them.\n\n\nOur cast of characters:\n\n**$Miscreancy** - dashing ne'er-do-well, new to tech support (a month in at this point if I recall) and increasingly alarmed by the cluelessness of users, but still green enough to persist in trying to explain things. Working for $Office helpdesk team assisting office-based users.\n\n**$GoldenGirl** - a somewhat clueless and genuinely lovely lady, who was trying to work beyond her technical acuity (estimated at -10).\n\n\n*Fielding calls from users is a bit hit and miss. Particularly in your early days you get a lot of calls which are not only interesting (first time you're seeing that issue, after all) but which also help you learn how better to assist next time. In a few months you can learn enough to take the time you need to diagnose down from 10 minutes to 30 seconds, because you start to recognise things early.*\n\n*On the other hand, you also get the calls from people who genuinely call the Internet 'The Google' and despite having to work with computers in pretty much any job role, have never tried to learn anything about them and how they work. It can be annoying for the people manning the phones, but they're largely harmless (until they try to organise their System32 folder by dragging corresponding file types into matching folders... but that's another story). Our tale begins after $GoldenGirl calls, and gets through to me...*\n\n\n&gt;$Me: Hello, you're through to $GiantSupermarketChain IT, $Office team - how can I help?\n\n&gt;$GoldenGirl [hereafter GG]: Hello! I'm having some problems with this file in $CustomSoftwarePackage\n\n&gt;$Me: Okay, well let's see what we can do to help. Probably the best thing to do is for me to remote into your machine and have a look - is that alright?\n\n&gt;$GG: Yes, fine. Do I need to do anything?\n\n&gt;$Me: On your laptop, can you click on the Windows icon, and then go to...\n\n&gt;$GG: Okay, I've clicked on that.\n\n&gt;$Me: Okay, now we have a program installed on your machine that you can use to give us all the information we need to get in - can you scroll down with your mouse-\n\n&gt;$GG: I don't have a mouse!\n\n&gt;$Me: (confused) But you said you clicked on it...\n\n&gt;$GG: I don't have a mouse! I have a trackpad!\n\n&gt;$Me: (beginning to realise how much of an uphill slog this is going to be) Okay, using your trackpad...\n\n\nSeveral minutes pass, and after patiently explaining what she needed to do to open this program in several different ways (literally click on an icon within the Start menu), she has it open, has given me her hostname, and I'm in.\n\n\n&gt;$Me: Okay, GG, I'm in your computer now. So why don't you go ahead and show me what you were trying to do in $CustomSoftwarePackage and we'll go from there.\n\n&gt;$GG: So, I got into the program and was trying to save the file down as a $NotValidForSoftwarePackage type and it just wasn't letting me do it. I could type it in but it wasn't working.\n\n\nNow I started to have an inkling of what was going on here, because I could see that she actually had File Explorer open and seemed to have done something both predictable and absolutely guaranteed not to work. But first...\n\n\n&gt;$Me: Okay, GG, I think I might know what's up here. You see, $FileType doesn't work with $CustomSoftwarePackage, so you would need to save it as $CustomFileType and then if you really needed to get it changed, you could run it through a program named $Converter which would do it for you - but we'd need to know why you needed it changed really before we could look at giving you access to $Converter.\n\n&gt;$GG: Well it's just that at home I use $CommonProgram to look at things and I'd rather email it to myself and then access it using that on my home computer\n\n\nAh. Okay. Well that's not happening, and I'll give her the rundown on why we don't let employees export sensitive corporate data in common file formats onto their home machines in just a minute. But first, just to answer my suspicions.\n\n\n&gt;$Me: Okay, so that's the why. And can I ask, how were you trying to save it down as file type?\n\n&gt;$GG: Well someone showed me the other day that if you click on this option [clicks on the view option to show file extensions in File Explorer] then you can rename it and change the ending to any file type you need, so I thought that would work! But now it's not working in $CustomSoftwarePackage OR $CommonProgram - my computer has broken it!\n\n&gt;$Me: The thing is, GG, that actually what you're doing is TELLING your computer it's $CommonFileType, but in reality it's still a $CustomSoftwarePackage file. It's a bit like hanging someone a page in Russian but telling them it's written in Italian - they can try and translate it but it's going to come out nonsense and they won't be able to read it. Now if I do this... [changes file extension back to the correct type] the file should work just fine.\n\n\nLo and behold, the program association kicks in as I double-click the file and $CustomSoftwarePackage opens it perfectly.\n\n\nI did walk her through the security measures around why we didn't allow these sorts of files to be transmitted to home computers and explained our information security policy to her so she had a better idea of what she was and wasn't allowed to do. She was a genuinely lovely woman who was just trying to do something without really understanding it. But the moment from the call that stuck with me was still the one about how she didn't have a mouse, she had a trackpad. Bless.\n\n\ntl;dr: Clueless lady thinks changing the file extension converts the file to that type. Amusing comment about not having a mouse, she had a trackpad.\n\nEdit: formatting",
        "created_utc": 1523044225,
        "upvote_ratio": ""
    },
    {
        "title": "Users with issues: Part 2",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8acgj3/users_with_issues_part_2/",
        "text": "I wrote about a faculty member in a [post](https://www.reddit.com/r/talesfromtechsupport/comments/7sxyzn/some_users_will_always_have_an_issue/) a couple of months ago who always seems to have an issue. Here is the follow-up to it:\n\nRe-imaging their Mac took away their admin rights, as we're in the middle of moving our Macs from workgroup to our domain. This is causing a fuss with multiple faculty members, so our director proposed a form where they request admin rights, and he will determine what type of access they need (there's multiple ways to approach this: allowing users to install an approved list of software themselves, or granting them temporary admin rights for a set amount of time). That form is still in the works, but it's not soon enough for this faculty member ($FM) (this will come into play later).\n\nThis all started when $FM called me one day about not being able to login to his system. We get his password reset, he can login, all is good. Until one day he calls me again (at this point I've practically become his personal IT assistant, which I would normally discourage but he's buddy-buddy with my supervisor from when she was a tech, and I would just get chastised for not helping him right away).\n\n&gt;$FM: I can't get into my system.\n\n&gt;$Me: I'm sorry to hear that, can I remote onto your system and see what's happening? (Normally I'd give a longer spiel over troubleshooting but considering how long I've worked with him, he's either tried all of that already or he would consider it a waste of his time).\n\nI remote on and find that he is logged in, but is seeing a screen asking for his password. I click cancel and it keeps popping up. I suspect the worst and confirm it's a keychain issue. I should have seen this coming when resetting his password did not prompt him to update his keychain after logging in (For those unfamiliar with Apple's Keychain, it stores passwords for you securely. If you change your account password and do not change that keychain password, it can cause a lot of problems with system passwords, such as mail. I will get into this more in a minute).\n\n&gt;$Me: We need to go into keychain and update the password.\n\n&gt;$FM: How did this happen? Everything was working last week after I changed my password and this week it's not working.\n\n&gt;$Me: When you change your account password, it's supposed to prompt you to update your keychain password. If you know your old account password, you can \"Update Keychain Password.\" If you don't know it, we need to \"Create New Keychain.\" Sometimes it doesn't prompt and you need to go in manually and change it, and that's what happened here.\n\n(I'm reading this verbatim from documentation, written by a Mac expert who is now gone). So I created a new keychain, and anything that prompted for his password, accepted his new one. Except for Mac Mail. No matter what, I could not get any of his email accounts to take his passwords.\n\n&gt;$FM: See, nothing works and I can't do my work now. I've been having problems ever since you guys moved me to your new system for security purposes and took my admin rights away. I've been relying on my personal laptop, this thing is 5 years old and I have no problems with it. This is ridiculous, I'm going to $CIO.\n\n&gt;$Me: I'm sorry about all the problems you've been having. I'm going to work to find a resolution for you so that you can work without interruption. Can we have you login to our Web Portal to verify there's not an account issue?\n\n*He logs into the portal just fine*\n\n&gt;$FM: There, it's verified. Can you escalate it now?\n\n&gt;$Me: Of course, I'll call you as soon as I have more information.\n\nSo I speak with a person whose worked more with email to poke him for information. He recommended removing/re-adding the accounts, which did work. But of course he had something to say before I tried fixing it for him.\n\n&gt;$FM: So I'm waiting for the form for admin rights from your director, I'd like to wait until I get those first and then work on this issue.\n\n&gt;$Me: That has nothing to do with your current issue of being unable to send in Mac Mail. Even if they do approve you for admin rights, you may get more flexibility to do more troubleshooting, but what I need to try does not require rights in the first place.\n\nAfterwards, $Director came to me and asked what was needed to get him up and running. I explained that he already was, and how his password change caused all of his problems in the first place, not anything we did.",
        "created_utc": 1523043729,
        "upvote_ratio": ""
    },
    {
        "title": "Lets willingly violate security policy for convenience, whats the worst that could happen. The FTC. That is what can happen.",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8acfog/lets_willingly_violate_security_policy_for/",
        "text": "Just like last time, all events were true. The spacing, timing, and event orders were changed, rearranged for epic retelling. \n\nSo the next day my task was to simply determine which devices were connected, and where these devices were connected from, and if we had a history with these devices. \n\nSo some of the comments yesterday were geting things a little wrong. When I talked about disappearing loans, these were mortgage loans not yet written. People were stealing potential loans from *our company* with all of the work already done.\n\nIf you apply for a mortgage loan using a mortgage company, never go through bank use a mortgage company, you will hear the term \"locking in your rate.\" This is because the rates change daily. Sometimes you can lock in your rate and it will go down the next day. Sometimes it will go up the next day. \n\nWhat this lady was doing, was hiring and firing people based on things they did not control. She would hire people, treat them like her best friend, take em out to lunch/dinner, get to know them well, and treat them like they are all stars. When someone was unable to lock in a rate in X time, she would let them go. She would do it for people who had no control over it either. If a customer forgot to include X W2 or Y pay stubb, you know the things banks want, then the loans would not get locked in in time. Fired. This created a large number of pissed off former employees. She was a high producer who went through assistants about as fast as I go through sparklets bottles. You get the picture. \n\nThese pissed off users would call up those people who had locked in and would give them a better rate, even though it was locked in, and steal all of the info from our loan software to create a paper loan. They would then submit the loan for the sweet sweet commission on a freelance loan. Which is very significant. \n\nAt this point nothing was shocking me. I would research a user, find out the extent of what they did, and document it while disabling access. After the tenth one where this happened, I get a call within 5 minutes transferred to me. \n\n&gt; $PU = Panicked user  \n&gt; $me = Gul Dukat\n\n&gt; $PU - (read all of this person's replies in a very panicked voice.) This is *name of the account he is logged into.* What just happened? I just lost all access.  \n&gt; $me - OK I need to connect with you to see what is going on.  Please head to *it support site* and click on remote support.  \n\n*Connects with remote session*\n\n&gt; $PU - So what do you think it is?  \n&gt;  $me - Oh I have a good idea. Going to check a few things.  \n&gt; $PU - Please hurry it up. I have a client literally at the bank with me.  \n&gt; $Me - wont take long.  \n\nI go through and grab the PC name and check its history in our system. Bingo. \n\n&gt; $Me - So *actual name* long time no talk.  \n&gt; $PU - Who? This is *fake name.*   \n&gt; $ME - No *fake name* knows she is not allowed to work right now. You have been abusing privileged access to our system to steal potential customers.  \n&gt; $PU - Yo man she gave me the password. Legally I am golden.  \n&gt; $Me - If I leave 30k in cash in my unlocked car in full view of the public, it is still stealing if you take it. I have to forward this to legal. I am sorry.  \n&gt; $PU - Wait yo. We dont have to do that. We can work something out.  \n*click*\n\nI pulled the call record and forwarded a copy to Legal, HR, and Infosec. The rest of my day was like this. All in all we learned the vast majority were people who simply never removed the access. There were only a few... offenders in the group. Seventeen cell phones were remote wiped, 6 laptops were voluntarily submitted to us so we could confirm nothing nefarious was afoot, and 3 people were arrested. (by the end of the week) Several more were informed by legal that things were happening.™\n\nThis was when the gut check came. The company learned that when you report breaches due to your own incompetence to the police, the FTC comes knocking. \n\nThis started the interviews which , thankfully, i did not have to take part in. Which kicked off the audits, which unfortunately, I was vital to the documentation of. \n\nTo be concluded. ",
        "created_utc": 1523043550,
        "upvote_ratio": ""
    },
    {
        "title": "One-Time Passwords only like the IT guy.",
        "author": "fokeiro",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8aceq5/onetime_passwords_only_like_the_it_guy/",
        "text": "More than a funny this is a weird story. Im the IT Manager (solely IT person so basically i manage...myself.....but whatever ....yeah i know...:sigh) for a law firm. We have our VPN for management and some remote users. This happened during 2 days:\n\n$ME: IT Guy\n\n$USER: of course user\n\n&gt;$USER : Hi im tryign to login remotly but the one-time password keep saying is an invalid password.\n\n&gt;$ME : Ok are you typing it or copy/paste ?\n\n&gt;$USER : tried both and nothing\n\n&gt;$ME: ok let me log into your machine and see if we can connect. \n\nWhile im connected asked to request the password and type it for me. Same issue ....\n\n&gt;$ME: is your Caps off ? is your NumLock on ?  yes and yes\n\n&gt;$USER: yes ill text you the next password so you can try it\n\nWe request a new password, she forward me the text message, i type it in and bam im in.....normal right?\n\n&gt;$ME: *\"crickets\"*  works fine for me, well you on for tonight bring me the laptopt tomorrow and we can try it from the office.\n\nNext day: \n\nLaptop no caps on, numlock on, English layout, no damage keys etc etc \n\n&gt;$ME: Ok lets try this (i keep thinking to myself, user is typing it wrong)\n\nWe recieve the OTP, user types it in.....invalid password......\n\n&gt;$ME: Hold on let me try \n\nRequest new one i type it in and im in. i Do this around 3 - 4 times connected all the time\n\n&gt;$USER: *criquets*\n\n&gt;$ME: ok lets type this.....slowwwwwwly\n\nWe requested a couple of OTPs, recieve the OTPs, user types it in.....invalid password......Now it start feeling like either the VPN is messing with us or her fingers are.\n\n&gt;$ME: *criquets*\n\n&gt;$USER: *criquets*\n\n&gt;$ME: more *criquets*\n\n&gt;$ME: Ok one last try for me\n\nguess what happened ??\n\n",
        "created_utc": 1523043317,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't Believe You, Even Though You Are the Expert",
        "author": "gorramgomer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8abwvi/i_dont_believe_you_even_though_you_are_the_expert/",
        "text": "tl;dr - PhD apparently got her degree as a CrackerJack prize.\n\n\n============\n\n\nWe are an institution, with a name in the pattern of $UnitedStatesAmerica, and while our domain is $United, most staff and customers use the VERBAL shorthand of $USA.  Note, the domain $USA points to a wholly different organization, but in a related field.\n\n\n$PHD is new to our organization, and attempting to complete the on-boarding process.  She was set up for this a month ago, and is still unable to complete it.\n\n\nOnboarding consists of going to the $HR_Vendor website, and logging in with $username and $random_password.  For simplicities sake, after onboarding is complete, and their $United account is created, we enable Single Sign-On, and their username is now $username@$United.\n\n\n$PHD has been working with both me and $HR_Rep for a week now, and she cannot seem to understand that her username is not $username@$USA, but rather $username@$United.  No matter how we try to explain otherwise, she insists on emailing myself and $HR_Rep using the $USA domain, and then calls us up to complain that her email is still not working because of bounce-back messages.  \n\n\nHer supervisor sent in a ticket last night, saying that everytime she tried to email $PHD, she was getting an error that $PHD@$USA was not a valid recipient.\n\n\nThe reason?  $PHD had somehow gotten into Office365 and set forwarding up so that all her $United email was being forwarded to a non-existent $PHD@$USA email address.\n\n\nI can only assume the pain will end when I die.\n",
        "created_utc": 1523039459,
        "upvote_ratio": ""
    },
    {
        "title": "Mr Owl, how many working days are there in April 2017?",
        "author": "thuumgoesthedynamite",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8abc62/mr_owl_how_many_working_days_are_there_in_april/",
        "text": "[removed]",
        "created_utc": 1523035127,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes, IT is at fault.",
        "author": "dongholio",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8aaztz/sometimes_it_is_at_fault/",
        "text": "Years ago, I worked for a small company (by small, I mean it had about 6 engineers / machine shop workers, 1 dedicated IT guy, and the owners).  The IT guy was doing this part time, as he was going to school.  He had no certificates, no experience, and basically was hired on because he knew the owners and they thought he was an IT wizard simply because he knew a few command lines and understood how to plug in Plug A into Port A.  He was clearly in over his head, and between the job and his school work, he always seemed to be on the verge of snapping from stress.\n\nOne of the machinists apparently got a better offer, so the IT guy went through the motions of deactivating his log on, taking his company badge, and making sure the company laptop / devices were all turned in.  And this is where it got interesting:\n\n&gt;IT:  \"Sir, you have to turn in your cell phone.\"  \n&gt;Guy:  \"It's my cell phone.\"  \n&gt;IT:  \"Sir, our records show that the cell phone was issued to you and we've been paying the monthly fees.\"  \n&gt;Guy:  \"I was never issued a company phone, I've just been using my personal phone for company purposes.  Owner and I agreed that he would pay my phone bill since I saved him the hassle of getting another line.\"\n\nNote:  This was in early 2000s, when cell phones still had plans by the minute, you had to sign a year contract, texting and voicemail was extra, and adding a new line wasn't as simple as going online to a website and managing your account.  Anyways, back to the story.\n\n&gt;IT:  \"I'm sorry sir, I can't let you leave without turning over your phone.\"  \n&gt;Guy:  \"You can do what you want, I'm out.  Call the Owner if you want.\"  \n\nLong story short, IT guy and Machinist nearly got into a fistfight (which would have been hilariously one sided, as the Machinist had about 200 lbs of muscle and the IT guy was built like a particularly skinny broomstick), Owners (rightly) sided with the Machinist, and IT guy was let go to \"focus on his studies\", albeit with a good reference.\n\nTwist:  I was the IT guy.  Sometimes, I still cringe at the memories of my own stupidity.",
        "created_utc": 1523032541,
        "upvote_ratio": ""
    },
    {
        "title": "\"Our esteemed help desk\"",
        "author": "trekinist",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8aagu4/our_esteemed_help_desk/",
        "text": "[removed]",
        "created_utc": 1523028791,
        "upvote_ratio": ""
    },
    {
        "title": "Production web server+contract devs=fun thanksgiving",
        "author": "scriptingnarwhal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8aa6oj/production_web_servercontract_devsfun_thanksgiving/",
        "text": "Since you guys seemed to like my last post, I would like to post the story. This is the story of when I decided I needed to leave. \nLittle back story. \nLast November at the beginning of the month. I was told that I had to give everyone local admin permissions on their computer and it was to be enabled within the hour. After great protest I said that since we had 2000 users I would need to touch every machine to do that. I was told that wouldn't due and they would bring an outside contractor in to do that. The contractor adjusted our tech GPO and gave everyone domain admin credentials. (I didn't find this out until later) \nStory. \nCome thanksgiving week. I was told to give a bunch of contract devs access to all production servers. Again after protest I had to do it. I was told it had to be unlimited admin access. I gave them the access and forwarded info. Thanksgiving eve I get a call on the way home saying they can't access the web sever. But the server is still processing info for the oil software we use. This was important software. I try to log in and it says it lost its trust relationship. So I say quick fix let me email for the adminpassword from IT manager. Hmmm he doesn't have it. That's strange I have an email saying he has all passwords. Anyways I work all day Friday disconnecting drives and re mounting them until I can reset the password (probably not the most efficient)  until it's fixed. I get a call as I am packing for aws reinvent, that we cannot go. And that I have to be in CIO office first thing Monday. \nFast forward to Monday \nI go see CIO and sit down. And I start to get yelled at for 3 hours on why it is my fault for this. Mind you in event viewer and esntry we see the contractor renamed the server and put in work group. I wasnt allowed to talk and i was told that i was lying. So I get yelled at all morning  And than go to lunch. When I get back I get called again to get yelled at for leaving for lunch. And that I have to come back down for which proceeded to get yelled at until I was done for the day. Later that night I get home and start working on my resume. I plan to stay for the holiday season. Come Jan 3 the dev did it again and I got yelled at for 2 hours. So I wrote my resignation up, made sure the next guy found my documentation and left. I never looked back. Now I'm sitting on the 18th floor with a great view of the city. \n\nHappiness. \n\nTl&amp;Dr\nEveryone was domain admin\n\nDevs renamed server twice \n\nLost my Vegas trip\n\nYelled at for eating. \n\nLeft and was instantly better",
        "created_utc": 1523026758,
        "upvote_ratio": ""
    },
    {
        "title": "\"I need a laptop to run VR\"",
        "author": "Rhazior",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a9u30/i_need_a_laptop_to_run_vr/",
        "text": "[removed]",
        "created_utc": 1523024077,
        "upvote_ratio": ""
    },
    {
        "title": "We need it removed please ... please .. o well",
        "author": "gertvanjoe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a9a59/we_need_it_removed_please_please_o_well/",
        "text": "So my father has a business renovating spaces. Our local day-hospital had always been on the top floor of at that stage (early 90) our only building higher than 3 floors (they sat on top level floor 5 and this is important since they had access to the rooftop and renting out a spot to a local bank which used it for their comms link. ) \n\nThey however moved out and a design house moved in. As you can guess a hospital setting does not really work well for offices so in comes my father. I had a ball as they left all the network cabling (coax, yup the 90's) in the dry-walls but that's not part of the story\n\nTucked away in a corner of the now giant open space sat a server cabinet labelled \"BANK\" with some contact details. The plans my father had did not play nicely with the location of the server so like any decent human, he calls them and ask to come to the party so they can work something out. And again 3 days later... and again the next Monday and again.... \"we will get back to you\". \n\nSo he tells the contact person at the design house, getting a \"deal with it\" in reply. By now that machine has been sitting there for 2 weeks in the open so I can only imagine how long my father had been calling about it, and as far as I could tell had no ups or anything ( the building likely had emergency supply since ... hospital). \n\nWhat do we do? We remove it ourselves. What did myself (young kid) know about servers back then ... nothing. ~~Shut it down~~yank out the power and whatever running from it so some crewmen could carry it to a finished spot. \n\nNot half an hour later two Bank labelled persons come bursting in there and seeing what happened, demanded we move it back. \n\nFather refused, giving them all the references of calls he had logged, basically telling them to F off and come back with a crew to reroute their cabling to the new occupants \"server room\". BANK was down for two days while their crew rerouted the cabling ...\n\nThinking back now he could probably have faced legal repercussions, but one can only ask so many times. ",
        "created_utc": 1523019497,
        "upvote_ratio": ""
    },
    {
        "title": "Boss not in office = Murphies Law",
        "author": "navojski",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a8yni/boss_not_in_office_murphies_law/",
        "text": "First time poster, will try to make post as readable as humanely possible,  \n\nshort context:\n-1st IT job as Customer Support specialist (full stack) in a small (around 50ppl) software development firm with numerous clients.\n-3 of us in office, myself ($me), colleague - peer ($colleague) both of us working 3 months only, and our lead ($lead) guy \n-$lead holds numerous responsibilities, developing projects other development departments shitted, support, head admin network and system, publishing\n-$lead is a pretty cool guy, has a lot of \"pull\" within the company, straight forward, has our backs and shares a lot of knowledge, so I do my most to do my job properly. $colleague just came back from a 1 month sick leave\n\n  \nFast forward this Thursday, $lead takes a day off before holidays, leaving me and $colleague who is fairly bad under preassure to run the department.  \nMost days are fine, some more chaotic than the rest, but of course the one day he doesn't come in all hell breaks loose.\n\n  \nFrom the morning, during the monitoring which is a usual process I'm having a \"party\" having 4 business critical apps not working.\n$colleague is out of ideas since he just came back and not suituated to them not working\nI'm having to address those issues and do regular monitoring, to put it into context, we require VPN for that part of it, and luck has it we only had 1 vpn account available this morning.\nFix them all with about 20min downtime, which is okay for the issue of that size.\nThinking \"phew, we're okay....for now\"\n\nGo to lunch break, come back to this:\n&gt;$colleague : \"hey $Xclient called a few mins ago\"  \n\n\n&gt;$me : \"what did she say?\"\n\n\n&gt;$colleague : \"something about \"horrible app that others shitted and our lead is pushing it through somehow\" not working\"\n\n\n &gt;$me : \"ugh, what exactly, there are numerous problems with it, didn't you write it down?\"\n\n\n &gt;$colleague: \"not all of it, i'm not familiar with it so it was hard to grasp the context\"\n\n\n &gt;$me : \"ugh (hoping its not urgent) , inform the lead and hope he knows whats up (who is on his day off but is available for stuff out of our responsibility, which this app is)\n\nAn hour passes, we get another call from the $Xclient, this time I answer\n &gt;$xclient :\"hello $me, maybe I was not clear the last time i called and spoke with your colleague, this is super urgent, i need the app operational in order to finish this today (oh shit)\n\n\n&gt;$me im my most  calm voice : \"I've just came in the office and was not fully briefed, I see you have not sent an official mail, could you be kind and walk me through with what exactly is the issue?\"\n\n\n &gt;$xclient : sighs and with agressive tone \"goodbye $me\" slams the phone\n\nBit shocked, that was quite rude but I understand it's from the stress she's receiving so I shake it off and get back to work\n\n30min pass, CEO writes to me via chat to call $xclient and see what she wants, bit suprised, explain to him we already spoke to her twice and that she slammed the phone on us.\nI call $xclient, she explains to me that the invoices she is working on need to be finished today and our app helps with that a lot.\n\nShit is hitting the fan at this point, with $colleague not having a clue what to do and mumbling around nervously\n\nCall $lead up, now I'm on the phone, i'm basically at this point his \"Gestapo\" proxy, walking around the company, with him telling him which of the developers (that built the app in the 1st place) to \"grab\" and bring to our office (he has that sort of power)\n\nI grab a medior and senior developer, much to my amusement they're almost clueless with ideas, they ignore most of my ideas (i've worked on the app with $lead numerous times). \nSpoiler alert, fix ends up being within the logic I proposed in the 1st place.\n\nEnd up staying 2 hrs overtime on a day before holiday to fix this issue, since our $lead is the point of emergency, he wouldve gotten blasted with calls during holiday if it was not resolved.\n\nEnd up getting reported by $xclient, her saying she was unable to reach us for 1 hr via phone, pure bullshit which I had to explain to my $lead, luckily, I've proven to him before when I made fuck ups that I admit to them so he took my side.\n\nTLDR\n\nThe moment the personal in charge leaves, shit hits the fan, i'm not getting payed enough for this kind of stuff.\n\nP.S. Sorry for the format\n",
        "created_utc": 1523016481,
        "upvote_ratio": ""
    },
    {
        "title": "You can't really blame me for that.",
        "author": "dankynanky",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a8ybu/you_cant_really_blame_me_for_that/",
        "text": "LTL, FTP and all that nonsense. Prepare for formatting errors all over the shop. This is not a short one. \n\n$N = Me, the one and only.\n$C = Client\n$M = Client's manager\n\nSo it has been over a year since all culprits ($C and $M) have left the company, so I think it time to share this golden apple with the group. \n\nIt is 12:01pm on a Monday, and the phone system stops working. Customer calls are flooding in to an auto-attendant and are getting \"we're closed\". What kind of business closes during their expected peak time?  \n\nA little context. We'd changed phone providers and some staff obviously preferred the old system. Nevertheless this was a recurring issue I was investigating. \n\nThis is how the conversation goes down:\n\n**$M**: The phone system has stopped working again. There must be some configuration for why it goes down the same time, every day. Get it together and fix this thing.\n\n\n**$N**: $M I have been looking into this for a while now, and it's just odd that seemingly every time $C goes on lunch, the phone system does into a \"Do Not Disturb Mode\", I believe we're manually triggering this.\n\nSo then I hit up the provider of the phone and ask them to do traces to see if the \"DND\" function has been enabled - it had been. I report back to $M and ask him to speak to $C and confirm. Nope. $C swears that they are not putting the phone system into DND. \n\nIt is make or break time. Either $C or $N is about to die. It's EoM and 12:00am. Clockwork, phones go down. I get a good earful from $M about how I am incompetent, and how I need to learn what I am doing. Frustrated I get in contact with the third party and (very) abruptly tell them that within their software, I want the DnD function completely disabled. I then, tell $M that if I see the system in a DND mode again, the blames on $C. \n\n**$M**: I have had very stern conversations with $C and have been advised that there is no way they're turning DND on. I told them if I see it again they're going to be fired.\n\n\n**$N**: Good, because at this stage it looks as though $C is simply lying to you. I've scheduled a monitor, and I am over-viewing the call routes now.\n\nSo my lunch break was spent going through the call flow diagrams (Oh, Visio how you've improved) and fault it; why on Earth does the calls not overflow to Night-Mode and have it round-robin? It's almost like there is another factor involved. \n\n**$N**: $M, I had a look at the call logs and there seems to be a slight issue; when DND is enabled it is meant to round-robin to all in this hunt group for 45 seconds.\n\n\n**$M**: Don't worry $N, since my talk with $C I noticed today phones worked fine. Problem is fixed.\n\n\nLow and behold, 25 minutes later I get a call and say the phones are down. It's 12:25pm.\n\n\n**$N**: Where is $C?\n\n\n**$M**: I think $C just went to lunch, why?\n\n\n**$N**: Because as soon as $C goes to lunch, the phones stop working. This is ridiculous. I am not sure what they are doing, but it's causing some issue with the system.\n\n\nSo the next day comes around. Last straw, if I don't get this fixed I may as well kiss my job goodbye. I decide to be sneaky, and \"work\" on the PC behind $C. It's 12:00pm and here we go.\n\n\n**$C**: Going on lunch break $M (presses button on desk phone)\n\n\nThe phones die. I rush to the desk and look at the button \"Divert to Mob\". Why the f**k can a receptionist divert work calls to a mobile!? I call up the phone company on the spot.\n\n\n**$N**: What the hell does this pre-programmed button do?\n\n\n(Phone Company checks): It appears to divert a portable phone.\n\n\n**$N**: What's the routing on that look like?\n\n\n(Phone Company checks): It goes to EXT. 1243 and if it fails, diverts back to the main number.\n\n\nI process this. I call the number it diverts to explicitly. It's off. Enraged, I track a spare phone down, register this number, and call again - welcome, it works. \n\n\n**$N**: Why was this not detailed in the report for call flows?\n\n\n(Phone Company): This phone has been off for 2+ months and we assumed not in use. It simply was missed.\n\n\nI track the phone down. It's in $M desk. Apparently, he's never seen it or knew what it was for.\n\n\n**$N to $C**: Why do you press this button when you go on Lunch?\n\n\n**$C**: It puts the calls into DND mode so that they overflow to the next set of phones to be answered.\n\n\n**$N**: Do you know where they go?\n\n\n**$C**: Yeah, to the spare phone in $M draw. It's off because I don't want it to disturb me on my lunch break.\n\n\n**$N**: So what you're telling me is you're aware you've put the phone system into DND even though you said you didn't, you're aware where it diverts to, you know there is an issue when you turn on DND, and you've not thought to tell me?\n\n\nRight now I am fuming. I have spent 2 weeks being chewed out by 3 managers. I've spent hours upon hours studying documentation and having arguments with the phone company, all because $C didn't want to tell the truth. But wait, there is more.\n\n\n**$M**: So $N you're telling me you implement this system and you do not know how it works? Why the hell did it take 3 weeks to find this?\n\n\n**$N**: Believe it or not $M, I actually take care of alot more departments than just yours, and have serious issues to fix. I have spent upwards of 30 hours on this ticket, and have diagnosed everything within documented procedures to try and find this.\n\n\n&gt; You know what that got me?\n\n\n**$M**: Who is to blame for it?\n\n\n**$C**: You can't really blame me for that.\n\nI'm done. Managers not monitoring their staff, system documentation that's not even correct and I am suppose to be a mind-reading all powerful L2 technician. You sure got me. \n\n**Edit**\n\n\n* This was a long time ago and I was *fresh* into the role. I know there could have been things I could have done better, and now I've got more experience I've noted my mistakes;\n\n\n* $C wasn't directly fired, but moved into a position that was to become obsolete. \n\n\n* User stated $N, $M and $C were not as intuitive and easy to read; I'll fix that in any future post(s) I do.\n\n\n* Phone company reporting has been requested to be monitored and reviewed monthly now due to this incident.\n",
        "created_utc": 1523016383,
        "upvote_ratio": ""
    },
    {
        "title": "\"Thats not how any of this works.\"",
        "author": "TheITCustodian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a5om8/thats_not_how_any_of_this_works/",
        "text": "I managed the User Support operations for a small college, including the Help Desk and our walk-in Service Center.  Our network admin was a guy named $Red (clearly, not his name) who was one of the most frustrating employees I've ever had the \"pleasure\" (/s) to work with or manage. ([Although I didn't have to manage him long](https://www.reddit.com/r/talesfromtechsupport/comments/89u529/sometimes_its_not_the_lusers_its_your_own_guys/?ref=share&amp;ref_source=link)) \n\nHe was one of the most entitled employees I'd ever come across. He felt that his sole existence at the college was so that his kids could get a free education. Doing his assigned job was entirely an ancillary benefit to the college after giving his kids an education. Oh yeah, and providing him a weekly paycheck.  (While he complained, constantly, about how overworked and underpaid he was) \n\n$Red's knowledge of IT systems and network administration was really superficial, at best. Example: At an IT training event $Red proudly regaled the presenter with his tales of (supposed) network derring-do, including how he had \"gotten rid of all those complicated VLANs and flattened the network\" (made the network one big subnet). I looked around the table at the other IT pros from other colleges and universities around our region, who sat agape at his lack of know-how. \"But.. what about multicast traffic? Everything is on the same broadcast domain?\" the presenter asks. $Red waved his hand dismissively (probably because he didn't know what multicast traffic or broadcast domains even were) \"Oh, thats not a problem at all.\"\n\nIn any event, one morning I'm over in the Student Help Desk area, chatting with my lead desktop support tech ($LeadTech) and one of the $StudentTechs. The phone rings and I grab it.\n\n&gt;$Me: \"$MidwestCollege HelpDesk, TheITCustodian speaking, can I help you?\"\n\n&gt;$LUser: \"Yeah, I'm getting this message that says 'Duplicate IP address found on the network'. Is that a problem?\"\n\n&gt;$Me: \"Hmm, thats odd. Did it give the address?\"\n\n$LUser rattles off an IP in the DHCP range.\n\n&gt;$Me: \"OK, try this. Save what you're working on and reboot your PC. If the message continues, call us back, ok?\"\n\nAs I'm getting off the phone with that $LUser, each one of the help desk lines starts lighting up. $LeadTech and the $StudentTech start answering calls. All the same thing: \"Duplicate IP address detected on the network.\"  The help desk ticket system starts getting emails with screenshots, too. We're busy answering calls for about 10 minutes and by now its clear this isn't a rando client issue. It has to be something with the DHCP server.\n\n&gt;$Me: \"Guys, it looks like DHCP lost its mind. I'm betting that if they just release/renew, they'll get a clean IP and be fine, but its going to take awhile. Best bet, just keep answering these and tell folks to reboot. I'm going over to the NOC to see $Red. I bet he made a change to something.\"\n\nI ran out of the Help Desk and down to the NOC in the basement (its always in the basement).  I open the door to $Red's office and he's sitting there, placidly staring at his laptop screen.\n\n&gt;$Me: \"$Red, did you just make a change or something to the network?\"\n\nI see his expression change just slightly.\n\n&gt;$Red: \"No. Why?\"\n\n&gt;$Me: \"Well, Jesus, the damn Help Desk phone tree is lighting up like Christmas. People are getting duplicate IP addresses all over campus. Is there something up with DHCP?\"\n\n&gt;$Red: \"No. Not that I know of.\"\n\nI already know that he's **completely** bullshitting me. This was his *modus operandi*: he'd go in to some aspect of the system (DNS, the firewall, something on a server, etc) and make a change to something where he had only superficial familiarity, but he had some inkling or mistaken impression that it had some bearing on what he thought he was \"fixing.\"  That change would have a campus-wide impact on the users, and then he'd act like \"Nope, not me. No changes here. Didn't do it. Nuh uh.  Sorry. Look someplace else. Nothing to see here, move along.\" \n\nWhen pressed with some exploratory questions, the real story would eventually emerge that he'd made a completely undocumented and uncoordinated change to something major without a peep to anybody.  Something that would play absolute hob with the client systems or user's ability to access things. He would have no earthly idea that this change would have affected those pesky users or their parasitic systems. Even worse, sometimes he wouldn't have bothered to keep track of the 5-6 things he tweaked on, so he had no idea what he had to do to roll back. \n\nAt the same time, he'd also say things like \"Well, that sounds like a client problem, so let the Help Desk handle it. Not my issue.\"\n\nIt got so bad that after 3-4 of these occurrances where I realized the $ITVP wouldn't hold him accountable for his undocumented, middle-of-the-day updates to production systems that I created a cause code in the ticketing system called \"Administrator Induced.\" I instructed my team to use that cause code whenever it was something he changed and caused a meltdown. Since he refused to use the ticketing system, and the $ITVP wouldn't hold his feet to the fire on using it, I also told my team to be completely brutal in their ticket notes when they used that cause code. Eventually, someone would be reading these entries and they would paint a picture of his (in)competence.\n\nSo getting back to the DHCP thing, I changed my question to $Red a little.\n\n&gt;$Me: \"$Red, Have you made any *changes* to the DHCP server today?\" \n\nNow his expression changes again.\n\n&gt;$Red: \"Well, uh. I opened up the address schema a little, so I went in and deleted all the leases so that all the computers would get new addresses.\"\n\n&gt;$Me: \"You did WHAT?\"\n\n(For those not up on the intricacies of DHCP: Dynamic Host Configuration Protocol [aka DHCP] is how a network device gets an \"automatic address\" from the network. The DHCP Server keeps track of what devices have a \"lease\" on a specific network IP address and for how long. When a computer hits about the half way point in that \"lease,\" it starts to ask the DHCP server whether or not it can get a new address lease. The server may hand out a different IP address from its pool of addresses, or keep the client at the same address and extend its lease, etc. But that \"ask for a new lease\" process is predicated on a time to the end of the client's current lease. Meaning it is client-driven, in that the client *asks* for a lease, the server doesn't tell the client \"hey, you need a new lease.\" So $Red deleting the lease table in the DHCP server basically causes the server to no longer know what addresses are assigned to what devices, and it started to hand out \"new\" address that might already be in use by an existing device. Hence the \"duplicate IP address\" message on computers all over campus)\n\nAny network administrator that's been doing the job longer than about 6 months and is no longer a \"junior\" administrator should have a basic grasp (as I just explained) of how DHCP servers work.  \n\n&gt;$Red: \"Well, uh, I thought that doing that would force all the PCs to get new addresses.\"\n\n&gt;$Me: \"Thats not how that works. Thats not how *any* of this works.\"\n\nI turned on my heel and walked out of the NOC, back to the help desk to let them know and to create a ticket to log all the work against.\n\n**Problem:** \"Users are receiving 'duplicate IP address' messages.\"\n\n**Notes:** \"$NetworkAdministrator deleted all entries in the DHCP lease table, wrongly assuming this would force all devices to obtain new addresses.\"\n\n**Cause Code:** \"Administrator Induced\"\n\n**Resolution:** \"Users are being advised to reboot PCs to obtain a new IP address lease. Recommend replacing faulty $NetworkAdministrator with a new model that has appropriate training and experience.\"\n\nTL;DR: \"Supposedly 'experienced' $NetworkAdministrator deletes contents of DHCP lease table, expecting it to force devices to get new addresses. Which is not how it works.\"\n\n[Edit: minor formatting for readability]",
        "created_utc": 1522979563,
        "upvote_ratio": ""
    },
    {
        "title": "I am not a professional, but I'm pretty sure that's wrong",
        "author": "shoutmeetvoid",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a5m3e/i_am_not_a_professional_but_im_pretty_sure_thats/",
        "text": "Short post, on mobile, etc etc.\n\nI am not actually Tech Support, as I don't work for a company. I am my family's tech support, though, and have said \"have you tried turning it off and back on again\" more times than I'd like to think about. Still, I have not experienced anywhere near the amount of frustration as the rest of the poor souls on this thread.\n\nIn this story, I owed my 70 y/o aunt a favor, and she essentially rented me out to a friend of hers to set up an amazon Alexa.\n\nI should tell you, I know as much about Alexa as I do about rocket surgery: jack nothing. So I was sat in this strange woman's living room, instructions spread around me, watching YouTube videos on how to set it up, and this lady keeps offering me juice and fig newtons - not a bad thing, but I'd like to get this done and get on with my saturday. \n\nI am the type of person who reads all the instructions before even plugging something in, so I have a plan. I plug in the device, grab this woman's laptop, and get it set up. \nNot so bad, I think. She was a bit batty, but I got the job done and went home.\n\nThe next day, I get a call from my aunt: the Alexa isn't working anymore. So, I go back to this lady's house and she's furious, insisting that I've ruined her brand new device and I need to buy her a new one. I was honestly a bit scared at first, because like I said, not a professional. What if I did somehow brick her Alexa? So I go to the device and look it over (no external damage, still plugged in, nothing seems to be physically wrong with it) then ask her what's been happening with it. \n\nNormal use all yesterday, then today it won't connect to the internet. I'm very relieved. Could be a modem/router issue or just the WiFi going haywire. Thank heck. \nThen, this conversation happens:\n\nMe: so where's your modem and router? I need to check if they're working.\n\nLady: *blank look* Why?\n\nMe: Because if they're not working properly, Alexa can't connect to the internet and to Amazon. \n\nLady, dead serious: That's what Alexa's for. \n\nMe: Yeah, Alexa's meant to connect to Amazon, but-\n\nLady: NO ALEXA IS THE INTERNET. \n\nThis devolved into an argument I can't hope to paraphrase and still keep this sfw.  \nThe long and short of it is that she threw out her router and modem because she thought Alexa WAS a modem/router and also answered questions about your amazon orders. \nI just left. I know I should have stayed and helped her fish them out of the garbage bin and reconnect them, but I had zero hecks left to give, and she'd really been truly nasty to me during the argument, and I was done.\n\nI don't know if she ever got it reconnected and set up again.\n\nMy aunt still owes me a drink...\n\nEdit: I keep getting \"this is why you never volunteer for this\" and yes, I know that now. This event was my learning experience. \n\nEdit 2: Attempted to fix formatting to make the conversation bit easier to read. Hope it worked. Still on mobile.",
        "created_utc": 1522978986,
        "upvote_ratio": ""
    },
    {
        "title": "There is no password!",
        "author": "Cryptic-Panther",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a4h3o/there_is_no_password/",
        "text": "I've posted a few horror stories here before, I work as a level 1 tech support for a large Manufacturing company, and today i had to hold my tongue.\n\nOn a call regarding a hyperlink not opening correctly (application error) but this is where it gets good.\n\nU= User / M= Me the usual.\n\nU- I also have an issue with Microsoft Projects it missing from my computer.\n\n(I'm remoted in to her desktop, it is a Citrix desktop with a standard setup for all employees) and Projects had to be added as per the users request, but knowing this user i know she would have this access, so i open the utility folder and there it is, and i open the app.\n\nM- Ok so Projects is here and working, you just lost the shortcut... (she cut me off)\n\nU- No it doesn't work, let me show you. (she takes control and opens a network share and tries to open a Project file, we are greeted with a password prompt to edit or continue for read only)\nthere is no password on this, it doesn't work.\n\nM- (i'm trying not to make an unprofessional comment) Well the file is password protected, and you can open it in read only.\n\nU- No there is no password on this file, it's a shared file and i need to edit it.\n\nM- I understand, but someone put a password on this file, it may have been in error but there is now a password on it.\n\nU- There is no password, i need to edit this file.\n\nM- Well can you have someone else try the file to see if they get the prompt for password, because the file opens in read only (I tested this and it opened fine in read only)\n\nU- Well there is no password, and there is no one right here to ask.\n\nShe moved on from this issue back to her original one and didn't want to do anymore trouble shooting, she wanted a ticket sent to next level (onsite support)\n\nI always wonder why people call the Help Desk, but Don't want help.",
        "created_utc": 1522969383,
        "upvote_ratio": ""
    },
    {
        "title": "Still not sure what's wrong",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a3jgm/still_not_sure_whats_wrong/",
        "text": "[removed]",
        "created_utc": 1522962353,
        "upvote_ratio": ""
    },
    {
        "title": "'I'll check it later to see if Shrek shows up.'",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a3hzd/ill_check_it_later_to_see_if_shrek_shows_up/",
        "text": "[removed]",
        "created_utc": 1522962060,
        "upvote_ratio": ""
    },
    {
        "title": "Sound doesn't work",
        "author": "Floofyboy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a346c/sound_doesnt_work/",
        "text": "$me = me\n$user = user\n\n$me Hello how can I help you?\n\n\n$user my sound doesn't work when using Skype\n\n\n$me ok first let's test your sound elsewhere. Is it working?\n\n\n$user my sound actually never worked anywhere. Its not working either right now.\n\n\n$me hmm ok what device are you using? Speakers? Headphones?\n\n\n$user I don't have any device to hear the sound\n\n\n$me ...\n\n\n$user ...\n\n\n$me You will need the proper hardware to listen to sound.",
        "created_utc": 1522959330,
        "upvote_ratio": ""
    },
    {
        "title": "HP tech support is a joke",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a2cyp/hp_tech_support_is_a_joke/",
        "text": "[removed]",
        "created_utc": 1522953973,
        "upvote_ratio": ""
    },
    {
        "title": "I demand you return this coffee-covered laptop for a free warranty repair! We won't pay! \"If you insist...\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a26zq/i_demand_you_return_this_coffeecovered_laptop_for/",
        "text": "[removed]",
        "created_utc": 1522952813,
        "upvote_ratio": ""
    },
    {
        "title": "Internet Explorer is not supported",
        "author": "Devianex",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a24ik/internet_explorer_is_not_supported/",
        "text": "There's a very nice Client Services girl who occasionally shares an office with our tech support team. This means that she has a direct channel to our local team and manager, whereas we're usually supporting teams on the east coast or in Europe/South America. I mention this because today's conversation most assuredly would have gone differently had she not been here in person.\n\nCS girl: \"Can I test something in IE on one of your PCs? I have a Mac so I don't have it on my machine.\"\n\nMe, TS guy: \"Sure, but we don't support IE so there's really not any point testing anything.\"\n\nCS: \"I just need to see if we can figure out why branding is working for this one client that uses IE, but not for another client.\"\n\nTS: \"Well, it doesn't actually matter because they shouldn't be using IE anyway as we don't support it anymore.\"\n\nCS: \"Gotcha. It's just that the behavior is different between two of my clients.\"\n\nTS: \"Right, but even if we identify an issue, the developers aren't going to devote resources to fixing unexpected behaviors on unsupported software.\"\n\nTS manager: \"We'll look into it for you.\"\n\n**How it should have gone**\n\nCS: IE\n\nTS: No",
        "created_utc": 1522952352,
        "upvote_ratio": ""
    },
    {
        "title": "Hey lets willingly violate security policies because we think we are special and earned it. The final nail in the lax security coffin. Part 1",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a21u6/hey_lets_willingly_violate_security_policies/",
        "text": "So this happened about a year or so ago. The lawsuits finally were settled so I am able to write about it now. Once again timing, spacing, and conversations are embellished for dramatic effect. I do this to make my stories enjoyable. Otherwise they would be boring af. \n\nA high earner at our company had one of her underlings call into it support with an issue. She was sending on behalf of, instead of sending as user for delegated access. \n \nThe tech was told simply that inside citrix it sends on behalf of but outside it sends as...\n\nTook the tech a little bit to put 2 and 2 together but he got to 4 in the end. The reason why it was working outside citrix was because the underling was logging into the high performers account, instead of adding the second mailbox. \n\nHe dug a little deeper and discovered that all of her underlings were logging into her accounts everywhere. Not just outlook. So he wrote up a ticket and passed it along to me after being told that NO they would not change their ways. \n\nI picked it up and the first thing I did was run a lockout report. This was just so I could gauge how many devices were logging into her account. 42 (actual unembellished number)\n\nNow picture it in your head. Your direct supervisor, the ones who actually do work, picking up the ticket and constantly moving as they check this tool or that tool. Then they just freeze. That was me that day. \"Fourty two devices? Holy sh.... Ok.\" \n\nI call up the lady on the phone. \n\n&gt; $me = Commander William Adama  \n&gt; $UU = Uppity user. Or Tammy 2\n\n&gt; $me - Hello this is $me with IT. I was calling about a situation I had been made aware of. Several people log into your account for the purposes of work correct?  \n&gt; $UU - Yes that is right. Because of our high volume we need to be able to quickly respond as me for all situations. This has come up before and I must say that I have fought hard to get this permission and will not let it go.  \n&gt; $Me - I need to know how many devices are currently logged into your credentials at this moment. It is a matter of extreme urgency.  \n&gt; $UU - Christ really? Hold one. \n\n*Intermission*\n\n&gt; $UU - 12 devices. 5 PCs including mine. Everyone's phones including mine, an Ipad I own, and the reception PC in the front foyer.  \n&gt; $ME - Only 12 devices? I am reading 37 devices at this current moment. Earlier it was at 42.  \n&gt; $UU - That is just not possible. The only ones who have my password are the current employees. I have you guys change it every time we get a new one or let one go.  \n&gt; $Me - How do we change it? Walk me through the entire process.  \n&gt; $UU - I call you guys and have you set it back to what it was before.  \n\n*Long pause.*\n\n&gt; $UU - Hello?  \n&gt; $ME - Do you not see the issue here? Do you not see what you have done?  \n&gt; $UU - What do you mean?  \n&gt; $ME - I have your tickets pulled up here in the system. You have submitted several requests to us about disappearing loans in your system. You have directly asked us before if people could be stealing your loans. And right now you tell me you never change your password. You call in and tell us what you would like it changed to. Do you not see why this is happening?  \n&gt; $UU - When you change the password in our system it makes you put it back into all of the devices so it cant be that.  \n&gt; $Me - First off no it does not. Second off, even if it did all they would have to do is put the same freaking password back in anyways.  \n&gt; $UU - Oh...  \n&gt; $Me - Yeah your branch is down. I am locking all of your accounts for now and we have to get infosec involed. I am sorry but it is out of my hands.  \n\nI get up from my desk, which was at the old building, and I walk into my boss's office who was in a meeting with the EVP of IT, the CIO, and the accounts team supervisor. \n\n\"Oh good. You are all here.\"\n\nThis was how I interrupted their meeting to relay the information. In the movies, no one ever really truly captures the look of horror that slowly creeps into the faces of those who come upon the realization of terrible news. \n\nUnlike before in my past stories, this was not a security loophole, this was not a breach through intrusive means, this was merely a self important uppity user who thought they were above the law, so to speak, because they were a high performer.  Thankfully they were from a branch that was only 2 miles away, so we were able to head this one off at the pass in terms of limiting their ability to gripe to the correct people to get their accounts turned back on. \n\nThis day was a bad day for me in the terms of management. And a worse day in terms of paperwork. I never had to fill out legal forms before... \n\nTo be continued tomorrow. ",
        "created_utc": 1522951821,
        "upvote_ratio": ""
    },
    {
        "title": "Need to allow a user to sign into a Server? Just replace allow domain users with their account!",
        "author": "Amsd6969",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a1y8e/need_to_allow_a_user_to_sign_into_a_server_just/",
        "text": "Got a fun one for you guys\n\n**tl;dr - I'm surrounded by idiots.**\n\nBackstory:\n\nSo someone in our AR department got caught browsing facebook repeatedly, and instead of being reprimanded, the head of the department gave a list of websites to the CIO to block. The knee jerk reaction to doing it quickly was to block it at the DNS level by redirecting those domain names to 127.0.0.1. Because of our network topology, every one of our sites now have all of these sites blocked. \nEvery one of us underlings had a huge problem with this. The first problem we saw was the lack of reprimanding, the second being AR making this an IT problem &amp; not a managerial problem, and the third was that it was being blocked by DNS. \n\nToday: \n\nOne of my co-workers was trying to band aid the last issue by making it only apply to one dns server and having that department use that server for the time being. So he asked for access to that server, which happens to be an 03 server. \n\nOur boss goes and unknowingly changes the domain default policy - apparently in 03, there is no local security policy under administrative tools, only a domain one. He didn't know/realize this, &amp; put my co-workers user account under the equivalent of the GPO under computer &gt; policy &gt; windows &gt; security settings &gt; local policies &gt; user rights assignment -&gt; allow log on locally. For those of you unaware, here's that GPO's explanation. \n&gt;Log on locally\n&gt;\n&gt;Determines which users can log on to the computer. \n\n&gt;Important\n\n&gt;Modifying this setting may affect compatibility with clients, services, and applications. For &gt;compatibility information about this setting, see Allow log on locally ?(http://go.microsoft.com/fwlink/?LinkId=24268 ) at the Microsoft website. \n\n&gt;Default: \n\n&gt;• On workstations and servers: Administrators, Backup Operators, Power Users, Users, and Guest.\n\n&gt;• On domain controllers: Account Operators, Administrators, Backup Operators, and Print Operators.\n\nWhat followed was over a hundred tickets submitted one hour later, all within 10 minutes of each other. Each person saying the same thing - that they were not allowed to log into the computer because their computer said that logon method was not allowed. It took me about 30 minutes to track down what the hell happened and how to fix it, and thankfully I was able to get it reversed and all our computers to execute a gpupdate/reboot so that users could login, but jesus this has been one big fucking mess. \n\nSo anyways, how's your thursday going guys?",
        "created_utc": 1522951166,
        "upvote_ratio": ""
    },
    {
        "title": "Imagine you are looking at a clock...",
        "author": "CRYSTALBALLR",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a1iyo/imagine_you_are_looking_at_a_clock/",
        "text": "Setting: It's 2009, my first job out of college, doing Level 1 tech support for a small VoIP start up. My employer ($company) provides call center software which has a lot of reporting features because if there is anything call center managers love more than every agent on a call, it's metrics. $company has option in contract to allow customers to resell product, but that does not include supporting the customers’ customer. \n\nWe get a call from one of our long-time big customers. We work with their main point of contact ($poc) almost daily, great rapport, very helpful and respectful business relationship revolving around a buggy, but functional system. \n\nWe get a call from $poc and he explains that he needs our help to fix a report that is broken. We do our work and find that the report is working as designed. The report shows the amount of time a given agent was on the phone for a given time frame. The report shows this value in two different formats: one is HH:mm (Talk Time: 6:30) and the other is in decimal format (Talk Time: 6.50). I explain to $poc that likely their client is seeing two different numbers but isn’t aware that they are showing the same value: six and a half hours.\n\n$poc says ah, that makes sense. Agrees he should have seen that, thanks us for our help and moves on.\n\nAbout 20 minutes later $poc calls again, starts apologizing for asking us for this, but due to a language barrier ($poc’s first language is not english) he is having trouble explaining the report to the $poc’s customer ($wow). As a show of good faith **(red flag)** I offer to help. I’m still pretty wet behind the ears and figure this will be an easy explanation. I was maybe even eager to help.\n\n$poc conferences in me and $wow. \n\n$wow is not rude, but a little terse. \n\nWe confirm we are looking at the same report and I ask $wow to walk me through what they see as a discrepancy in the report. $wow does and makes a big show of saying that\n&gt;six fifty is not the same as six thirty.\n\nI explain that one area of the report is in hour hour: minute minute format, and another section of the report is in decimal format, or hour dot fraction of an hour.\n$wow indicated that she didn’t see the difference and that the report must be broken because it didn’t work like this before. \n\n    Note: It has always worked this way.\n\nMe, with as much anti-condescension in my voice as I can muster I walk $wow through fractions and how they represent parts of a whole. I then point out that when representing a value of time, we can use two different ways to represent the same value. In our example we have 6:30 and 6.50. Now these both mean the same thing - ‘six hours and thirty minutes’ or ‘six and a half hours’. \n&gt;Me: $wow, are you still with me? \n\n&gt;$wow: No, you lost me. \n\n&gt;Me: Ah, ok. How about this...\n\n*I steel my resolve and go in for another round.*\n\n&gt;Me: Imagine you are looking at a clock, It is 12:30. Where are the hands on the clock pointing? \n\n&gt;$wow: One is at the top the other is at the bottom.\n\n&gt;Me: Right, ok, so how far has the minute hand traveled from 0? Half the way, a quarter of the way, the whole way? \n\n&gt;$wow: ....uh, half? \n\n&gt;Me: Right. So how many minutes are in that half? \n\n&gt;$wow *(confidently)* 30.\n\n&gt;Me: Right! Excellent, so you get it - 30 minutes is equivalent to half an hour.\n\n&gt;$wow: But then why does the report say “six fifty” in one spot and “six thirty” in another? \n\n&gt;Me: The one that says “six fifty” has a decimal, also known as a dot or period, in between the numbers. That means it is a fraction of a whole hour, not a number of minutes. In this case that is *point 5 hours which is thirty minutes*. The one that says “six thirty” is in hour hour minute minute format with a colon, some people call it a semicolon, in the middle. This indicates a time value in hours and minutes. The minutes part goes from 0 to 59. Do you see what I mean now? \n&gt;$wow: … &lt;pause for about 10 seconds&gt; … &lt;sigh&gt; Ok, this doesn’t make any sense to me and I have no idea what you are talking about. Clearly you think I am an idiot. (yes they actually said this) My neighbor is a math professor, I am going to go home and ask him about this and &lt;emphasizes&gt; *WILL* call you back.\nMe: I’m sorry I couldn’t *click*\n\n$wow hung up on us at that point.\n$poc thanked me profusely for my attempt to handle $wow and confirmed that I explained the concept in terms that a child could understand.\nNever heard back from $wow but I wonder what her neighbor thought of them after that conversation...\n",
        "created_utc": 1522948224,
        "upvote_ratio": ""
    },
    {
        "title": "\"Welcome. You have paperclip!\"",
        "author": "adlaiking",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a1ikf/welcome_you_have_paperclip/",
        "text": "LTR,FTP. Every now and then I try to come up with a story from my days working the computer help desk as an undergrad but there really isn't anything that stands out. Then, last week, I got an urgent text from my parents...which leads to the following epic tale.\n\nI should mention that my parents are very bright and wonderful people and I love them...but they were well into adulthood when personal computing became a thing. \n\nAnyway - the message implored me to give them a call ASAP. The issue: trying to email a Word document to someone. It perhaps sounds trivial, but my parents' grasp of the computer interface is shaky. The difference between being navigating a file system or navigating a web page is too subtle. As you will see, *where* documents are located is a particular challenge.\n\n**Cast:**\n\n**$Me - me.**\n\n**$PP - ParentProcess, my parent.**\n\nSo - the specific issue: \n\n**$PP**: I am trying to send a Word document to someone who I have been helping with revisions. The last one I sent out was apparently the wrong version. I thought it was in Downloads but it's not. Also, it is trying to be sent with iCloud and I don't have my password and I want to send it with my AOL account* instead. \n\nFor a moment, I worry that the document is actually saved on iCloud, and we're going to have to do password recovery on top of everything else. But fortunately, and the document is saved locally on their Mac. Very much so, in fact, as we'll see in a moment. \n\nThis is good news, because not being able to see what the parent in question is doing is one of the most challenging things in providing them help. Happily, I have a Mac as well, and so I get it in front of me, and then - once more, into the breach. \n\n**$Me** OK - do you have the document open in Word?\n\n**$PP** Yes. \n\n**$Me** Okay. In the top right corner of the screen, do you see a black apple icon?   \n\n**$PP** Yes.\n\n**$Me** And just to be sure, what is the word to the right of that?\n\n**$PP** \"Word.\"\n\nOkay, we're in business. \n\n**$Me** Next to that it should say File. Click that, and then about halfway down it should say \"Save as...\" Click on that. \n\n**$PP** Okay.\n\n**$Me** Okay. Now, on the left-hand side of the screen is a list of places - click on 'Desktop.'\n\n**$PP** Okay. Oh, I see something here that may be the file I want. Is that it?\n\nHere's where I make my first error. I should just say \"No,\" and keep going the safe route. But instead, I take the question at face value, which ends up adding a good 10-15 minutes to the whole thing.\n\n**$Me** We can check. In the bottom right, click \"Cancel.\" \n\n**$PP** Ok.\n\n**$Me** Now we're going to do the same thing again. File, Save As...\n\n**$PP** Ok. \n\n**$Me** *Now before you click on anything*, look at the top of the window that appeared. What does it say in the middle? \n\n**$PP** \"Downloads.\"\n\nUh-huh. Well, that's part of the mystery unraveled, I suppose. Not sure how that stray one managed to find its way onto the Desktop, though. \n\n**$Me** Okay. Now directly under that, you should see the name of the document, and then a place that says *Tags*. And then right under *that*, there should be a column header that says \"Name.\"\n\n**$PP** Next to \"Tags\" is blank.\n\n**$Me** ...right. So, *under* that, it should say \"Name.\" \n\n**$PP** No, it's white, and then I see a bunch of files.\n\nThis part takes longer than it should due to my second mistake...it's only after a stray comment, I realize my mistake...\n\n**$PP** There's also a dark gray box with four smaller boxes in it. \n\nAh. My fault - I had assumed list view was the default for Word dialogs...although, again, if I could *see* the screen...I had actually close to asking my parent to FaceTime so they can point their phone at the screen but at this point I'm assuming we're close to being done.\n\n**$Me** Okay - click the box just to the right of it - the one with four horizontal lines that are all parallel to each other.\n\n**$PP** The one with the lines? \n\n**$Me** Yes. \n\n**$PP** It kind of looks like text on a page?\n\n**$Me** ...sure. \n\n**$PP** Okay. I clicked it.\n\nWith some doing, I step her through sorting by \"Date Modified.\" \n\n**$Me** Now, the top file should say today's date under \"Date Modified.\" And you should...\n\n**$PP** Actually, it says it's from 1980. \n\nUm...hm. They've had their Mac for at *most*, 7 years. But...not going down that rabbit hole. I hear a click from the other end of the line, and have a moment of panic \n\n**$Me** Okay, that's fine, so if you just click again on -- \n\n**$PP** Oh, but as I'm moving down, it's going up. It's just upside down.\n\nI wouldn't have thought to refer to it this way, but I get the intended meaning.\n\n**$Me** ...right. So the file you want is probably all the way at the bottom.\n\n*dramatic pause.*\n\n**$PP** Yes, this looks like the right one. So I can just attach this to my email?\n\nDear God, I hope so. Although I'm not sure I would use the word \"just.\" \n\n**$Me** Yes...let's go to (inward shudder) AOL. And you can create an email.\n\n**$PP** Compose?\n\nBelieve it or not, I *do not* use AOL for email, so I'm flying a bit blind here. \n\n**$Me** Yeah, that should be it. \n\n**$PP** Okay.\n\n**$Me** And then you should have a way to attach a file...\n\n**$PP** I have a paperclip.\n\nMaybe I can borrow it and jab it in my eye...\n\n**$Me** Okay, click on it, and then we're going to attach the Word document.\n\nLather, rinse, repeat - navigate to Downloads, sort by Date, find the document. We're about 20 minutes in at this point.\n\n**$Me** And that should do it...just add the email address, and you're good to go.\n\n**$PP** Thank you. Why do they make this so hard? I mean, I would never have been able to figure out all these things on my own...\n\nI know from experience that responding to comments like this leads to nothing good. I let it slide.\n\n**$Me** ...anyway, happy to help, and -- \n\n**$PP** Oh, just one more thing. Is there a way to make sure this file is the right one?\n\n*Execute: InwardScream.exe*\n\n*Execute: WhyGodWhy.exe*\n\n**$Me** Isn't this the file you wanted?\n\n**$PP** It looks like it could be. But I'm not sure. \n\n*Execute: LargeSigh.exe*\n\n**$Me** ...okay. \n\nDecision tree time - I can have her email it to herself, but then step her through the whole email process again, along with downloading the file, finding it, and opening it; or...\n\n**$Me** So...in the very bottom left corner of the screen, all the way down, is a box with a blue and white smiley face. Can you click that?\n\n**$PP** All the way down? \n\n**$Me** Yes, that's what I meant when I said...yes. All the way down.\n\n**$PP** It's kind of a square?\n\nI am tempted to ask how many blue and white smiley faces there are to choose from. But I don't. I am calm. I am patient. Everything is fine. \n\nWe go to the Downloads folder once again, step-by-step, sort by Date, (\"It's still upside down...\") again.\n\n**$PP** Okay, there's a problem. The last file says it's from 1996.\n\nWhat is going on with this Downloads folder? Has my parent been downloading AbandonWare games or something?\n\n**$Me** Try scrolling down some more.\n\n**$PP** Okay. Oh, yes, it keeps going...\n\nIt sure does...and we, eventually, verified that the Word document was, in fact, the correct version, and managed to get it sent off. All told, attaching a Word document to an email and sending it took just over half an hour. Piece of cake.\n\nMy parent was quite grateful, however, and even offered to name their next child after me. I told them I'd settle for them naming their first-born after me instead.\n\n***\n\n&gt; '* Yes, I know. I have confirmed that they are not paying for AOL, at least. This is the email address they started using in the 90's. It's...I try not to think about it. ",
        "created_utc": 1522948150,
        "upvote_ratio": ""
    },
    {
        "title": "Testing, does not equal fraud.",
        "author": "domestic_omnom",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a1hd6/testing_does_not_equal_fraud/",
        "text": "Background information: I work for a software development company that specializes in process management for a certain niche industry. My position is kind of weird in the fact that I'm not only T1 support for our in house developed software, I'm also t2-3 for the document management system that we are resellers of. When we get new clients or a new product install, its usually on me to test everything. At first I used my own name and information(minus ssn) so I could easily find myself and delete it all before the clients started using the product/s. This story is why that's an insanely stupid idea....\n\nI was on the phone with a client when my cell rings, I ignore it and continue on with my call. After I checked my phone I had a missed call and a text message. The text read to the effect of *Hi, Domestic, this is $caseWorker from $group. There is a problem with your documentation can you call me at 555-555-5555x555\" I recognized the number as the actual main line of $group. I give $caseWorker a call thinking there was a software issue. \n\n$caseWorker: Hi $domnom, thanks for calling me back. I'm going through your file and you are missing a lot of documentation for $employmentProgram. Could you possibly come in and redo some of your paperwork?\n\n$domnom: Umm $caseWorker.. I'm with $myCompany. We are the ones who maintain $employmentProgram. If I'm in there at all its because I used my name as a test. I'm not an actual member of $group.\n\nat this instant her entire tone changed. She went from super bubbly and nice, to just as bubbly but snarky.\n\n$caseWorker: If you are not a member, can you tell me how you got in our system? I see applications for $service, $otherService, $stillOtherService! Why, and how are you applying for our benefits and services!\n\n$domnom: $caseWorker. I'm the contractor who set up your program. I used my information as a test, I normally delete my testing, but in this instance I seemed to have not. Give me one second...\n\nknowing the domain name of $group, and $caseWorkers name I could pretty much guess her email address and sent her an email from work address. I hear the ding and ask if she got an email from me.\n\n$caseWorker: I have no idea who that company is. That doesn't prove anything.\n\n$domnom: Its the same name at the top of the help section in $employmentProgram..\n\n$caseWorker: *WHATEVER*\n\nshe whatever'ed me, and hung up. I told my boss about what happened and he gave me the go ahead and to delete my information from their systems. A few days later....\n\nIts a slow morning, so I'm hard at work Facebooking and Redditing when I get an email from $group's manager $groupMan saying their system is missing a lot of information on clients. I'm responding to the email as my cell rings. You guessed it. It was $groups main line.\n\n$groupMan: Hi this is $groupMan from $group. I apologize Mr. Omnon, but our system is a little messed up right now and we've lost your applications. When you get a chance I will need you to come back in again. I'll give you priority for the inconvenience.  \n\n*silent prayer to $deity*\n\n$domnom: $groupMan.. I'm with $mycompany. You just emailed me about the missing data. My information is gone because I removed it as I'm not -\n\nI was immediately cut off.\n\n$groupMan: WHAT DO YOU MEAN YOU DELETED IT HOW COULD YOU EVEN DO THAT!\n\n$domnom: I am the contractor for your software.... I am not a $group member. You just emailed the support contact for $employmentProgram. Please check the name of that contact. \n\nOur software doesn't have me specifically as a support person. It has the generic support@company email. However she emailed me directly. Her software would have had me as Domestic Omnom while my email is domnom@company\n\nIn the ensuing silence I replied to her email.\n\nEmail: Good Morning $groupMan, I'm speaking with you on the phone right now. To verify, is it only my information thats missing?\n\n$groupMan via phone: You are the contractor... So are saying the applications were just to check... she trailed off so I didn't interrupt her thought process.\n\n$groupMan: You understand why this is a concern for us correct? We regularly get audited and we have to account for all dollars spent. The only positive thing I got from $caseWorker is that all the payments you received were for a 0 dollar amount.\n\nMost of their funding comes from federal programs. So yeah it makes sense they get audited a lot. \n\nThis point in the conversation was just going over how I used my own name and info as a test, usually delete them, totally my slip up, ect. The tone changed and we did a remote session so I could answer a few questions for her and go over some things. We also do process consulting for these niche groups we deal with. She thanked me and apologized for the misunderstanding. Maybe a week later I received an email from support. It was the legal department of $group. Saying they found no evidence of fraud, or attempted fraud and will not be pursuing charges against me specifically. My coworkers, boss, and company VP are all on that distribution list. That was a fun conversation...\n",
        "created_utc": 1522947918,
        "upvote_ratio": ""
    },
    {
        "title": "Never pays to be outside The Family",
        "author": "porksteaks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a0jjj/never_pays_to_be_outside_the_family/",
        "text": "I am the IT jack-of-all-trades for a family-owned business services firm that, among other things, puts on events for clients. And by family-owned, I mean all executives come from two families. I have been with the company for about 12 years and was hired right out of college.\n\n\nBasically, my role is if someone else in the company thinks it might have to do with computers or \"The Google\", I get called. I am a one-man IT department though the company refuses to grant me an official IT title. Not a big deal; most people in the company make up their titles anyway. I run our servers, do company and client websites, and remote into the PCs of anyone who needs help.\n\n\nDays before a big ticketed event, I get a memo from a coworker (who is reasonably tech-savvy and sometimes works with our databases, but is not considered an IT worker) that the upcoming event is gone from the company’s central database system!  Despite being out sick that day, I call in and conference the coworker and her supervisor, who happens to be a member of one of the two executive families. While on the conference call I see that other events are missing from the system as well.  I advise that the best procedure will be to restore from a recent hourly backup, but this will require some minimal downtime to complete.  Supervisor says no, work some different \"computer magic\".  I let coworker and her supervisor debate while I patiently wait on the line, and then advise again that the simplest process to get back up and running is to do a restore from backup which I can initiate right away with her authorization.  Supervisor says no, we’ll just retype the missing info, and ends the call.  She explicitly states not to modify or do anything; she will handle it.  I am out sick, so I go back to bed.\n\n\nAbout an hour later, phone rings. It’s coworker’s supervisor and she wants the backup restoration done ASAP. Turns out in the meantime she’s sent out an all-staff memo about there being an extended downtime, no one can log in and use our CRM until further notice, we can’t take any more ticket orders for the upcoming event, even the registration portal for the event has had to be turned off, etc. I log in to our cloud based server control panel, pick a backup from before the events went missing, and start the restoration process. Once it’s unzipped into the appropriate directory, I quickly rename the database to ‘database.bak’, rename the restored backup to ‘database’, and restart the web app front end.  We’re back up and running in minutes, with all the lost data restored.\n\n\nExcept that three hours later, coworker’s supervisor hasn’t given the go-ahead for any staff to go back in the system.  The public is complaining that they can’t register for our event and a different board member says that it will remain down until the next day “as a precaution”.  Despite my fixing the issue quickly, we still have arbitrary downtime so the board can save face that it was really a big, huge, catastrophic failure and their actions were warranted.\n\n\nDuring the evening I hear from one of the highest ranking people in the company who has been briefed and is extremely disappointed in the lack of professionalism I showed by requiring so much time to restore the system, and by being sick on a day when I was needed.  It cements in his mind the inadequacy of our IT solution and that we must have redundant full time contractors available at the drop of a hat.  I remind him that everything under my control took mere minutes to resolve, even though I was supposedly out sick.  I am also now interacting with him after hours.  What’s this about not being available at the drop of a hat?\n\n\nCurious about how this happened to one of my systems, which I take pride in and have high standards for, I commence a full analysis of our system logs.  The missing events were each explicitly deleted in our software, and the logs reveal that each deletion operation was performed from an internal IP address. Then I cross-check against our Active Directory which is used for all company authentication in order to match the time stamps and find the user.  Turns out the user who deleted the events from the core system is a friend of the supervisor I have been working with all day, recently hired to be one of her special assistants in working on a new company service.   First thing the next morning, I send an email with these findings to said supervisor as well as the high ranking family member, anticipating that I will be fully vindicated and the matter will be addressed with the recently-hired assistant.\n\n\nInstead, I receive a terse reply that I must cease and desist from any further log investigation, because the matter is closed and the board has already decided what their actions will be.\n\n\nWithin an hour, I learn that I am being removed from IT tasks and administration/ownership of my systems is being turned over to a team of highly-paid external consultants (considerably more than my pay level). The “very serious matter” has been resolved and the company is ready to move on. I am warned to not look back and “we all must move on”. My job description has been rewritten into a reduced role, having nothing further to do with IT work, but instead as an assistant to one of the highest ranking people in the company. In effect, with over 10 years experience, I suddenly am at the level of a paid intern.\n\n\nMoral of the story:  never expose someone who's friends of The Family.",
        "created_utc": 1522941312,
        "upvote_ratio": ""
    },
    {
        "title": "My monitor stopped working!",
        "author": "green__bottle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8a02uf/my_monitor_stopped_working/",
        "text": "Short time lurker first time poster. Always loved the stores on here so here goes one I had from a couple minutes ago.  \n\nPlayers in the story: $me and $user\n\n$user has two monitors and one day one of them stopped working, so I trouble shot for a while and determined that it was only the cable that had gone bad. Put in a new cable and everything was golden.  \n\nA couple weeks go by and I get into work this morning and $user comes into my office and says her monitor is not working again and since we had just replaced the cable it must be the monitor.  \n\nTaking her at here word I go down into the basement where we have a bunch of monitors. ( most every ones monitors have been replaced with nicer 4k monitors, only a few still have the old ones )  \n\nI retrieve it and head back to her office. She is not there with me but I begin to see whats going on. I notice no light on around the power button. I push the power button on the 'broken' monitor and wallah! It springs back to life. I sit there for a few seconds just acting like I was doing something and she walks in and thanks me and I leave.  \n\nDidn't tell her that the monitor was just off but she seemed to believe I can remove a monitor from a mount and attach a new one in about 45 seconds so I just left it at that.\n",
        "created_utc": 1522937968,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from the BabyBell: simAlity Goes Greyhat.",
        "author": "simAlity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89zsej/tales_from_the_babybell_simality_goes_greyhat/",
        "text": "[removed]",
        "created_utc": 1522935777,
        "upvote_ratio": ""
    },
    {
        "title": "Accept &lt;---&gt; Reject",
        "author": "somedingus123",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89yqa3/accept_reject/",
        "text": "Okay so I don't do actual tech support but I was giving tech support to my mom when I found it so $me is me and $mom is my mom working for @company\n\n$mom: this site won't work can you fix it.\n\n$me: *walking over* what's wrong?\n\n$mom: it won't load properly.\n\n$me: *looking at screen* flash player isn't allowed, just go to the top left and change it to allow.\n\nProblem solved but a couple minutes later I had to go right back because of another problem.\n\n$mom: this isn't working do I need to do that thing again.\n\n$me: what isn't working?\n\n$mom: I can't accept the terms of service.\n\nAfter clicking accept countless times I finally was about to give up when:\n\n$me: try clicking reject\n\n$mom:what?\n\n$me:just try it\n\nShe clicked REJECT and it CONTINUED but clicking Accept went back.",
        "created_utc": 1522926067,
        "upvote_ratio": ""
    },
    {
        "title": "What do you mean I have to do it myself?",
        "author": "miscreancy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89yn0x/what_do_you_mean_i_have_to_do_it_myself/",
        "text": "A tale from my very early days working for $GiantSupermarketChain on their helpdesk - first post, so be gentle\n\nYour cast of characters:\n\n**$Miscreancy**: A dashing ne'er-do-well, new to working in tech support and tech generally\n\n**$LadyMacbeth**: a customer working for $GiantSupermarketChainBank, who expected us to jump to her every command\n\n\nThe tale begins!\n\n\n*So this was in my first few weeks manning the help desk for $GiantSupermarketChain - we were first line support for all IT issues that didn't relate to POS. My team ($Office) handled office-based colleagues, as opposed to the $Stores team that handled - you guessed it - colleagues based in store (those were the worst kind of calls). We also had responsibility for handling all calls related to $GiantSupermarketChainBank, whose colleagues were convinced they were the most important people we would ever speak to in our day, regardless of grade.*\n\n\nThe call goes a little something like this:\n\n**$Miscreancy**: Good afternoon, you're through to $Miscreancy on the $Office team, how can I help?\n\n**$LadyMacbeth**: Hello, it's my last day here with $GiantSupermarketChainBank. I thought I'd be nice to the person coming through and order them a new keyboard and mouse as I'm now leaving and I'll be taking them with me.\n\n\n**$Miscreancy**: (in head) so she must have provided her own... right?\n\n\n**$Miscreancy**: (out loud) okay, so you'll need to fill in the equipment request form to request any equipment, we're a helpdesk here for technical issues. Just to confirm you've been using a mouse and keyboard from home this whole time?\n\n**$LadyMacbeth**: No, but this keyboard and mouse were bought for me by the company as I have $CommonWristProblem, so I can take them with me when I go.\n\n**$Miscreancy**: I'm sorry, it sounds to me like those are company property that have been provided for you to enable you to do your job without any health impact; as such they should be returned to $Hardware team when you leave so they can be provided to any other colleague at $Site who has or develops $CommonWristProblem. Has a member of $Hardware team told you you can take these with you when you go?\n\n**$LadyMacbeth**: No, but my manager has and he outranks any member of $Hardware team! They're mine and I'm taking them!\n\n**$Miscreancy**: I'm afraid your manager doesn't have the authority to hand resources that belong to another team to a member of his team; it would have been $Hardware's budget that paid for this equipment and all IT equipment is under their jurisdiction.\n\n\n(By this point I am already IMing $Hardware's manager on that site to let them know someone is about to walk out with what sounds like expensive peripherals)\n\n\n**$LadyMacbeth**: But we outrank them! We're $GiantSupermarketChainBank, our calls and issues are a priority.\n\n**$Miscreancy**: We treat you the same as we do callers from $GiantSupermarketChain, actually. And this isn't an issue for my team to handle. You've called me to try and order equipment, which you need to submit via a form, and have since informed me that you are planning to walk out with specialist equipment that's been provided to you. All calls to our desk are recorded and I have informed $Hardware team of this as well. Can I suggest you talk to them regarding this as I believe you need to hand that equipment back?\n\n**$LadyMacbeth**: I'm walking out the door in a minute, I don't have time to fill in a form.\n\n**$Miscreancy**: (trying to get this through to her) Well as you need to leave the equipment anyway, if you give me your desk number I can just give that to $Hardware and they'll swap it over for a standard set of peripherals for the new colleague coming in, as that doesn't involve ordering anything in theory we can skip the form that way.\n\n**$LadyMacbeth**: But I'm not leaving them, they're mine!\n\n\nBy this point I am ready to drive up to $Site myself and deal with her... except it would take 6 hours.\n\n\n**$Miscreancy**: I have to inform you having spoken to $Hardware's manager over IM, we're in agreement that this equipment is company property and you don't have authorisation to take it off site. Please visit $Hardware team in $Site and hand the equipment back prior to leaving.\n\n**$LadyMacbeth**: No, they're mine! HONESTLY your team is absolutely useless, I don't know why I bothered calling, you don't know anything.\n\n[$LadyMacbeth hangs up]\n\n\nI think nothing of this at the time, but the next week we get a feedback email from $Hardware's manager:\n\nIn addition we'd like to thank $Miscreancy for identifying a potential theft situation last week - we had to stop the colleague at the exit and reclaim the peripherals she was trying to take. Those cost around £250 out of our budget and frequently go missing when people leave, so we always appreciate the chance to stop them being taken. This colleague's manager has also been informed of our policy around hardware and future losses from his team will be charged from his budget.\n\nThe moral of the story: just because the company has provided it for you, doesn't make it yours.\n\ntl;dr: Woman tried to leave the company and take custom expensive peripherals, was told they were company property, tried to do it anyway.\n\nEdit: formatting",
        "created_utc": 1522924925,
        "upvote_ratio": ""
    },
    {
        "title": "Me: Are you using a thin client?",
        "author": "Sutarmekeg",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89yc3y/me_are_you_using_a_thin_client/",
        "text": "[removed]",
        "created_utc": 1522921241,
        "upvote_ratio": ""
    },
    {
        "title": "Being stuck between 1st and 3rd line sucks sometimes",
        "author": "wishitwereirony",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89xrub/being_stuck_between_1st_and_3rd_line_sucks/",
        "text": "Customer reports \"runtime error\" while using one of our web applications.\nThe actual error is obfuscated because of security reasons. Could be a great variety of things.\nMy 3rd line colleagues have access to the webservers, so I suggested that, with the user's username and timestamp, we should be able to check the eventlogs for the actual non-obfuscated error, which should be quite cut and dry. With an actual error code, the reason for the error (and subsequent solution) should be a matter of minutes.\n\nBut no, my 3rd line colleagues simply reject my request and demand I \"test\" the error further. Use all possible browser combo's. Change settings. Test from different pc's.\n\nThis.Is.a.serverside.error.\n\nAllright, guess I'll just piss away half the morning while actual work keeps piling up (since there's no one else to take it off my hands) ¯\\\\\\_(ツ)_/¯\n\nJust don't expect me to stay after 17.00 to mop up the rising mountain of cases because you make me spend my time on useless shit... or y'know, actually give us access to those webservers so we can solve the issue ourselves? That would probably be too straightforward, I guess...\n\nEDIT:\nManaged to replicate the error (by pure chance). Immediately contacted 3rd line (as instructed by them, should I come across the error \"live\"), providing all details and asking for more information.\n\nThe reply? \"Please continue testing locally\".\n\n\nWhy even pay me a wage if what I'm doing apparently doesn't matter - at all? I mean, I can just tell the customer to fuck off and stop bothering me I guess, which would come down to the same thing.\n\nI don't understand modern business. This type of issue has followed me throughout my employment everywhere. Big companies, small ones... \n\nAh well, maybe 15 years (tops) left before advanced AI's take over all troubleshooting jobs. I'm not smart enough to be a developer so I better just get used to this shit until I eventually get canned. ",
        "created_utc": 1522913630,
        "upvote_ratio": ""
    },
    {
        "title": "Get my Toshiba Satellite with Vista working.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89x7qq/get_my_toshiba_satellite_with_vista_working/",
        "text": "[removed]",
        "created_utc": 1522907001,
        "upvote_ratio": ""
    },
    {
        "title": "ALL OF GERMANY IS DOWN!!",
        "author": "WoogTX",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89vh5r/all_of_germany_is_down/",
        "text": "LTL FTP\n\nMy company had recently opened locations in Germany and also added a help desk company in that area to help out with level 1 support.  Of course this started as a nightmare because tickets would get escalated to my group with zero information and/or very little troubleshooting being done.  After a few months they got better and the ticket escalations slowed until one night we got this.\n\nPriority 1 ticket comes in with a short description of \"All of Germany is down\".  Further notes explain that no one can connect to our systems but that's about it.  UGH!  The nightmare of little info is back. \n When a priority one tickets are created in my company it basically emails an alert to the whole world because the shit just hit the fan.  \n\nI call the site and after getting passed around to a few different people I finally get someone that can speak English. After a few minutes of talking them through a few things sure enough that site doesn't have external network access.  I ask them about other sites near them having the same issue.  They ask other employees in German and tell me they have no idea if other sites are down.\n\nI contacted networking and they traced it back to a broken fiber line down the street.\n\ntl;dr; One site equals all of country internet being down",
        "created_utc": 1522890788,
        "upvote_ratio": ""
    },
    {
        "title": "Never a Good Time",
        "author": "iamdleerious",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89uqv1/never_a_good_time/",
        "text": "[removed]",
        "created_utc": 1522884794,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes its not the $LUsers, its your own guys",
        "author": "TheITCustodian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89u529/sometimes_its_not_the_lusers_its_your_own_guys/",
        "text": "At one point in my \"long and storied IT career\" (Iceman: \"*cough*bull$#!t*\"), I managed an IT environment where our $NetworkAdministrator would frequently make idle offhand threats about \"changing all the passwords and walking out the door.\"\n\nBefore I became the IT Director, we had a \"$ITVP\" (this organization did not *need* a $ITVP). $NetworkAdministrator would make these cracks during meetings with the VP.  The $ITVP wasn't a terribly strong or decisive leader, and she would say to me later \"the next time he says that...\" and then *never* follow thru on it. (at the time the $NetworkAdministrator and I were peer-level employees in the IT department).\n\nIt got to the point where he would do that in a meeting, and I would type up a quick \"memorandum for record\" for $HRManager, as $NetworkAdministrator was saying it, something like \"On X date, $NetworkAdministrator threatened to change all the key administrative passwords on the network for the purposes of disabling the business.\"  I had to do this at *least* 2-3 times, and I think that was after he'd said that in a meeting at least twice previously (and I finally realized $ITVP was incapable of holding him accountable for his actions). \n\nUnknown to him, I had created a secondary global admin account in the domain that would have allowed us into AD in the event he attempted to kill the main Administrator accounts.\n\nAbout 4 months later, our outfit got new leadership ($President, $SeniorVP) and the ineffective $ITVP was pushed out the door. I was installed as the new IT Director over the whole department with $NetworkAdministrator reporting to me. This pissed $NetworkAdministrator off to no end because he felt *he* should have been put in charge. (He couldn't lead a pack of hungry dogs to meat, and had zero awareness of this fact, so that right there was a good reason to keep him as far away from any real leadership/managerial role as possible)\n\nDue to the leadership shakeup, I now reported to the new $SeniorVP.  On the first day we met I outlined all the personnel issues in the IT department, including $NetworkAdministrator's random threats to \"change the network passwords and walk out the door\" with the previous VP and my efforts to document his behavior with $HRManager.\n\n$SeniorVP, who'd come from a higher ed tech startup, leaned toward me and said \"TheITCustodian, the next time he says that, call $HRManager and me. Immediately. He will not be employed 10 minutes later. I am *deadly* serious about this.\"\n\nSo, of course, $NetworkAdministrator tried to pull the same BS bullying behavior he had with the $ITVP with me. He'd get all blustery with me in meetings, trying to act like he was running the department and encouraging other employees to \"ignore TheITCustodian\" because he was pissed he wasn't in charge. Finally one day about 3 or 4 weeks after I took over, I had a sense that in our weekly IT meeting his usual idle threat was going to pop out.  The whole group did, I suspect.\n\nAt one point, I was suggesting we do something different with managers requesting network access, you know, like tracking requests in our ticket system. $NetworkAdministrator didn't want to be bothered to login to the ticket system or actually document *anything*, so his \"arms crossed, breathing heavily\" demeanor told me I was on to something.\n\n&gt;$NetworkAdministrator: \"I could just change all the passwords, you know, walk out the door, watch this whole place go down in flames.\"\n\n&gt;$Me: \"$NetworkAdministrator, you know you shouldn't say things like that.\"\n\n&gt;$NetworkAdministrator: \"I'll do it someday. You watch.\"\n\n&gt;$Me: (sitting up in my chair, I could see the other members of the department  were eyeing me carefully) \"$NetworkAdministrator, are you saying you would *intentionally* disable our IT systems for your own gain?\"\n\n&gt;$NetworkAdministrator: \"You know what I would do!\"\n\nWe continued on with the meeting, and while one of our other managers was reporting on his area, I whipped out another memorandum for record, emailed it to $HRDirector &amp; $SeniorVP, and then texted the VP: \"He did it again. Check UR inbox.\"\n\nInside of a minute, $SeniorVP texts back \"Where R U?\" \n\nI told him what building and room we were in. \n\n\"Stay there. 5 minutes. Can U change admin PW from where UR?\"\n\n4 1/2 minutes later, $HRdirector and $SeniorVP showed up at the door. They asked to see $NetworkAdministrator. As soon as I saw them at the door, I remoted into the Global Catalog server and changed the domain admin password and disabled $NetworkAdministrator's account. They were in the hall about 30 seconds, $SeniorVP waves me outside the room. \n\n&gt;$SeniorVP: \"TheITCustodian, I want you to disable $NetworkAdministrator's account and change all the administrative passwords.\"\n\n$NetworkAdministrator face turns beet red.\n\n&gt;$NetworkAdministrator: \"But, but..\"\n\n&gt;$SeniorVP: (To $NetworkAdministrator) \"As of right now, your employment is terminated. $HRManager will escort you out. Your personal items will be mailed to you.\"\n\nI got to walk back into the meeting and tell the rest of the team that $NetworkAdministrator would no longer be joining us.  As I recall, there was applause.",
        "created_utc": 1522880145,
        "upvote_ratio": ""
    },
    {
        "title": "You just reset it or How a user broke me in 30 minutes.",
        "author": "ThrowAlert1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89u4vi/you_just_reset_it_or_how_a_user_broke_me_in_30/",
        "text": "While technically I am on the Field team, this tale comes from when I was manning the ~~Help~~ Hell Desk where the users walked past.\n\n\nUser wants to reset their password because somehow they’ve forgotten their password even though we just reset it yesterday.\n\n\nSo I say okay we’ll you’re enrolled in pw self service, lets send you through that process. We go through it she answers questions but the first warning sign should have been “How do you scroll down?”\n\n\n“What do you mean?” I ask. She’s on a spare loaner we have at the desk. It was working fine just a minute ago.\n\nShe turns it around,   \n\n&gt;“How do I make it go down?”  \n\nShe didn’t know how to select the next text field.  \n\nI moved the mouse and clicked.  \n\n&gt;“Oh How did you do that?”  \n\n&gt;“I used the mouse and clicked.”  \n\n&gt;“Oh well you know how it is, I’m just not good at computers.”  \n\nLord, have mercy.  \n\n\nSo finally we reset her password, get her phone set up, wifi, emails the whole nine yards.  \n\nBut Throw where does the title come in?  \n\nDon’t worry, I’m getting to it.  \n\n\nShe then says she needs her other password reset to a different system. Let’s call that second system, $Service and the first system $Simple\n\n$Service’s system is different, their username and passwords are not created by us. Its created by a different team and the username **can** be different. \n\nUser… Did not understand that. I don’t know whether it is from age or just sheer stubbornness.\n&gt;“So my username on $Service is $Simple username.”\n\n&gt;“It can be, do you know what it is?” \n\n&gt;“No. Isnt it $Simple username?”\n\n&gt;“It might be, but let’s see if it is, do you know your password?”\n\n&gt;“No.”\n\nSpoiler, it wasnt the same.\n\nThis then lead to a 5 minute excursion into how to create a password within the constraints of $System with the instructions right in front of you. For example, if the password requirements is that it must use one of the following “!@$%^&amp;*()”\n\nSo naturally she kept creating a password with # in it and it kept rejecting it.\n\n&gt;“Why wont it take my password?”\n\n&gt;“You keep using the # symbol.”\n\n&gt;“No, I’m using the $.”\n\nLady, I can physically see you hit the 3 key while Shift is held down. But okay. Whatever.\n\n&gt;“Why don’t you just write down the password and let me type it in.”\n\n&gt;“Okay!”\n\nSo we get her $Service password reset.\n\nI write down the website, username.\n&gt;“So I use $Service username,”\n\n&gt; “No use the $Simple username,”\n\n&gt; “Which is &lt;$Service Username&gt;”\n\n&gt; “No its &lt;$Simple Username&gt;&gt;”\n\n&gt; “Oh okay so I use $Service URL as my username?”\n\nTo spare you, after what feels like forever, I finally get through to her that $Service uses $Service username and password and $Simple uses $Simple username and password.\n\nSo we get to her $Simple Email.\n\nI ask her to log in.\n\nWrong user or password.\n\n*No…*\n\nI ask her to use the one she just changed to not 10 minutes ago on $Simple self service.\n\nShe insists that she did. \n\n\nWrong user or password.\n\n\n*No.*\n\nI double check that it’s the right name. It is.\n\n\n\nWrong user or password.\n\n\n**Wrong user or password.**\n\n\n*NO!*\n\nIn the span of 15 minutes somehow, somehow this lady managed to forget the password she JUST CHANGED. \n\nBut it doesn’t end there, dear readers, it never ends there.\n\nSo we go back into $Simple Self Service. \n\nI ask her to answer the security questions.\n\nShe goes \n\n&gt;“Oh I don’t remember the answers to it.”\n\nFor context, there are total of 4 questions that we set up. It chooses two at random. \n\nIt just so happened that the first time around it gave her two questions that she remembered the answer to.\nNow it gave her two questions she doesn’t remember, we try again, she remembers one of them but not the other, again, same verse as the second, again, this time she says well I remember this question was on top but why is it on the bottom now and how can I answer the question since when I type it goes into the top box.\n\nI looked over her shoulder as I felt a thousand dead switches stare set in.\n\n&gt;”Why don’t I just make you a password.”\n\nLog into ADUC. Reset Password. DogWoof*420. Logged into her email with that password. Worked just fine. Changed her Wifi credentials. Again. Changed the Exchange credentials on that phone. Again.\n\nI was defeated. This woman forgot her password within 15 minutes of changing it. Did not understand and probably still doesn’t understand that two different websites require two different sets of passwords and usernames. And had consumed at least an additional 15 minutes for a total of a half hour of my life I will never get back.\n\nLord, have mercy and strike me down; I wish not to suffer these fools any longer.\n",
        "created_utc": 1522880112,
        "upvote_ratio": ""
    },
    {
        "title": "Wifi VS concrete... FIGHT!",
        "author": "DefNotBlitzMain",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89ttxr/wifi_vs_concrete_fight/",
        "text": "I work for an ISP in an internet support call center. \n\nPosting from phone, forgive my formatting. \n\nPosting this because it's so extreme that I wish I were exaggerating. \n\n&amp;nbsp;\n\nguy calls in, wants me to bridge his modem/router so he can hook up his new router. \n\nAfter a little bit of talking while I remote into his modem, he tells me that he's been having issues with our wifi because it can't get a good signal outside the room it's in. \n\nEven if you somehow didn't read the title, you should know by now what his walls are made of... \n\n&amp;nbsp;\n\nAfter a little bit of \"directed talking\" (read: me interrogating him), I understood that his ENTIRE house is made of reinforced concrete.\n\nIt's also littered with mirrors.\n\nIt's also a 5,000 sqft house with a single floor. He's placing the router at one end of the house... \n\nI advised him that he'd have a hard time covering his house with a single router.\n\n\"nah, the guys at best buy said it covers everything from the room it's in to the detached garage. Yours just sucks. Are you done bridging the modem yet?\"\n\n\n...\n\n\n\n\"yes. I'm done. Is there anything else I can help you with today?\" \n\n\"nope, gonna go try this puppy out!\" \n\nIt was really hard to not wish him good luck. \n\n&amp;nbsp;\n\nTL;DR guy's house is a no wifi zone. someone sold him a router and told him it'll work. It won't. ",
        "created_utc": 1522878144,
        "upvote_ratio": ""
    },
    {
        "title": "The Database, the User and the Journal",
        "author": "Knuckx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89tq57/the_database_the_user_and_the_journal/",
        "text": "**Preface**\n\nI am a software developer for a \"SaaS\"/\"Cloud\" company, in the financial sector. The software in question is very old, as software goes (early mainframe era), and was converted in the early 2000s to a newer language and database (which I will call $DB, as it's quite obscure and I have no intention of breaking Rule 1) that runs on x86 (and later x64) PC.\n\n**Cast**\n\n* $CSM - The customer service manager, for all intents and purposes my boss.\n* $Dir - A director of the company, actually my boss. Can actually program, though not in our usual language or $DB.\n* $Usr - A member of staff on the new accounts side of the company, been around many years more than me, and has never seemed to particularly like me.\n* $Cst - A very large and well known (household name) company, who have been a customer since the mainframe era. Important enough that they have their own seperate database entirely.\n\n*****\n\nShortly after lunch $CSM accosts me walking back to my desk, looking rather concerned. He informs me that $Cst has been on the phone, wondering what has happened to their data as it's \"all messed up\"; they suspect a bug. Upon reaching my desk, I start our internal client software in debug mode, and proceed to examine the database - and sure enough, it's a mess. It almost looks as if a tax year end has been processed without any preperation - and it's nowhere near tax year end.\n\nI inform the concerned looking $CSM of what appears to have been done, and that recovery from a backup may be the easiest route back to sanity, and they departs to inform $Cst. Shortly, $Dir appears to hang my desk down, having caught wind of the issue, and I show them the database structures that show the most obvious signs of a tax year end. They agree with my diagnosis, and we start throwing out guesses as to how it has happened. I decide to have a quick search through the log files, and discover a manual invocation of the tax year end program with no user information. $Dir immediately instructs me to find out who did it, whilst they wander round and politely question all those who could possibly trigger a program manually.\n\nI force $DB to switch to a new journal, and then run the convert-binary-to-kinda-human-readable tool on the journals before, during, and after the erroneous program run, print them out and grab a highlighter. Whilst neck deep in reams of very terse, unfriendly journal file, I have two visitors - one is $Dir, informing me that nobody has owned up, including $Usr; the other is $CSM, who is looking even more concerned than previously, and says that $Cst is livid, and wants to know who is to blame.\n\n20 minutes of journal parsing later, I have my culprit. The program may have been invoked without a user context, but $DB journals the AD credentials that were presented at session startup, and it journals what session every single change was made by - it's $Usr, and they were the *only person with a session on $Cst's database* when the erroneous program ran. I place the highlightery evidence on $Dir's desk without a word, and leave.\n\n$Usr is summoned to $Dir's office. $CSM is in attendance. Repeated denials of what is in black and white are heard. Questions are asked as to if $Usr has divulged their password, or left their PC unlocked - more denials are heard. $Usr assures $Dir and $CSM that if they had done it by accident, they would have told someone immediately. Questions are asked as to what a member of new accounts staff was doing in the database of one of the oldest accounts in the company - even more denials are heard. A formal warning is given, as a database restores from backup and replays several gigabytes of journals to return to 5 seconds prior to the start of $Usr's session.\n\n**Epilog**\n\n$Usr succeeded in putting two and two together (the mess of highlighter probably gave me away), and asked me why I had accused them. I replied that I had not accused them, I merely provided management with the relevant logs from the database - I never spoke or wrote their name. I then pointed out that we had audit methods far beyond what a normal user could access, and that manually running a program without a user context is not a simple accident. At this $Usr turned around and silently stalked off.\n\n$Cst never did find out who did it. $CSM calmed them down, and by the time their next in person meeting came around, they seemed to have totally forgotten about it; perfectly happy, and being very free with the product samples.\n\nThe manual program invoke window was patched within the week to require a valid user context, and to display it in big red text above the continue prompt.\n\nI have only had to read one $DB journal file by hand since.",
        "created_utc": 1522877476,
        "upvote_ratio": ""
    },
    {
        "title": "How not to handle production outages - a lesson by the head of dev",
        "author": "gargravarr2112",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89tfk2/how_not_to_handle_production_outages_a_lesson_by/",
        "text": "So I just got home to find a reply to a comment I made about the last place I worked at, and it got me thinking I should post some of the particulars WHY I no longer work there. This is a perfect example.\n\n**Background**: I had worked at the company for ~3 years at this point, coming up fast on a 4th. I started as a SQL dev, but moved into a newly-formed DevOps team (that was hopelessly mismanaged). I have some sysadmin experience, but mostly on Linux. When it comes to web hosting, I know more than average about Apache, but that's about where my knowledge ends. The company's platform was ASP.Net hosted on IIS, using the ARR component as a 'poor man's load balancer'. I have never touched ARR, and have only heard bad things about it. HAProxy was being employed more and more to take over, but more of production still used ARR. DevOps reported directly to the Head of Development, who has a real reputation as a megalomaniac with far too much influence in the company.\n\nCharacters:  \n$me  \n$HoD - head of development, a highly-strung, my-way-or-the-highway sort of guy  \n$ITGuy - easy-going sysadmin, extremely knowledgeable with Windows, a good friend\n\n**Scenario**:\n\n$HoD had plans for me to learn ARR and IIS as part of building out the company's next-generation web farm (a kind of running joke, really - said farm had been on the cards since before I joined and had no real progress to show for it). I wasn't much looking forward to it, but I knew the SQL backend of the product pretty thoroughly. I had precious little dealing with the ASP.Net front-end (could never get my head around MVC...) other than its build requirements from running the Jenkins cluster.\n\nDevOps sits in the same office as IT, but separate from Dev, in another office in the same complex. One morning, $HoD calls me over.\n\n&gt;$HoD: \"Okay $me, time to learn some ARR.\"  \n&gt;$me: &lt;to 127.0.0.1&gt; *inner grumbling*\n\nHe leads me over to $ITGuy's workstation, who pulls up an RDP session to one of our webservers.\n\n&gt;$HoD: \"okay, so we have a major outage currently affecting $VeryBigClient1, $VeryBigClient2, $VeryBigClient3... in fact, about a quarter of the web farm. The ARR rules are sending incoming traffic to the wrong server. I need you to help me fix it.\"  \n&gt;$me: &lt;to 127.0.0.1&gt; \"HOLY SH!T THAT AIN'T THE FIRE ALARM I HEAR, THAT'S A [Big F*cking Whistle](https://en.wikipedia.org/wiki/Chrysler_Air-raid_Siren)!!\"\n\nWithout further comment, he sits down at $ITGuy's desk, who moves a safe distance away. He's got the ARR master admin console open, controlling traffic routing for the entire company. He opens up the production ARR rules. They're a convoluted mess of XML. I have never seen them before.\n\n$HoD begins making changes. Thank Christ he doesn't ask for my input, but the fact that I'm now an accessory here, and that he's basically performing brain surgery on our **production** platform *during business hours*, I can't help but nervously crack jokes with $ITGuy about $HoD bringing the company down completely. $ITGuy laughs. $HoD says nothing.\n\nPlease note: to mere peons like me, changing anything directly in production is a crucifiable offense (seriously - misconduct gets thrown around). Even read-only peeking is frowned upon. These rules, however, do not extend to the front-end developers.\n\nAfter about half an hour of trial and error, $HoD finally gets traffic flowing to the right place. Our reporting tools show no other outages. $HoD checks a number of other production clients and their sites work as expected. He gives $ITGuy his desk back, declaring the outage resolved.\n\nAfter a much-needed tea break, $HoD pulls me to one side.\n\n&gt;$HoD: \"I really, *really* did not appreciate your jokes about me bringing the company down - that was an actual possibility!\"  \n&gt;$me: &lt;flabberghasted&gt; \"You were hacking the frikkin' **production** ARR rules and wanted me to help you? What was I supposed to do? I've never seen the damned things before! I have no idea how they work! Why didn't you get someone *who actually knows ARR* to help?!\"  \n&gt;$HoD: \"I wanted you looking over my shoulder for silly syntax checks.\"\n\nThe conversation went nowhere from there. I get the distinct impression, looking back, that $HoD had pegged me as a fall guy in case he did screw up and route traffic into the bit bucket. The issue never came up again, nor was I ever given anything ARR-related ever again.\n\nIt goes without saying - the ARR rules were not in the slightest version-controlled, and all front-end developers had admin access to the web servers. They could, and very frequently did, change IIS or ARR settings randomly without telling anyone or documenting them. And yes, regularly on a Friday. IT had an on-call rota. Development did not. IT had next to no hope to diagnose a site outage ~~if~~ when a developer made changes and then headed off to the local pub with his team.\n\nAfter this, the first thing I did was pull $ITGuy aside and show him how to check the XML into SVN so we at least had a known good state to fall back on. As best I know, he checks as many config files as he can into it now.\n\nThis story pretty much summarises the attitude of the company. Front-line devs got star treatment and special privileges, and were absolutely not accountable for their actions. I have no memory of anyone getting fired for any of the fairly frequent production screw-ups. (The more observant of you will notice I mentioned that all front-end devs had production access, but $HoD used an admin RDP session logged in under $ITGuy's name. Tell me that ain't suspicious.) Meanwhile, the back-end SQL team I was on team, with very strict testing and code-promotion practises, had to fire two people who made serious mistakes.\n\nThere was no fixing the attitude or getting around it. Hopefully that answers why I left such a toxic place.",
        "created_utc": 1522875462,
        "upvote_ratio": ""
    },
    {
        "title": "E-mail Down!",
        "author": "scriptingnarwhal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89sw9k/email_down/",
        "text": "First post here, sorry if unorganized or incoherent. \n\nA long time ago last year, I was a network engineer for a mortgage company. I was the only engineer. One fruitful day i arrived at work early and sat at my desk. i started getting emails from several people saying they were getting NDR's. 9 times out of 10 it is a user sending out marketing materials who was blocked by the recipient. after 4 of them in a short time i was starting to get nervous. Everyone was due to come in and I needed to look at it more closely. I had the users send me the NDR and i read it very carefully. all it said was SPF errors. i was concerned and by this time i had 100 new tickets, thank you web portal. I ran several domain checks and it said we had 2 to many spf records. Now i know i didn't add anything because I spent time fixing it months before hand. I went to the Infrastructure Manager. He looked at me and just told me to fix it. so i logged into our DNS and located the records and sure enough there was 3 records. So i copied the info and deleted them, and voila like magic everything was OK after a short period. \n\nFast forward 3 hours and i get a call to the CIO's office. I grab my write up on the issue and head down. I gave it to here knowing i di d nothing wrong. He told me marketing called and was mad that i removed their SPF records. Turns out the Infrastructure manager gave them the password to DNS. He wanted me to restore it. i said i would but they would have to give me time to flatten it. i was told that was unacceptable and to put it back the way that it was. I said ok, but just to let you know email will probably go back down. He told me no that i can not let that happen. I said than i will go flatten the SPF. And the Infrastructure Manager stood up and said NO I WILL DO IT and stormed off. \n\nfast forward 30 minutes he comes to me and says your right flatten it. So i flattened it and i got called back down to the CIO and yelled at for almost an hour because i didn't know marketing had the password and i didn't know how to fix the issue the right way and fast enough. \n ",
        "created_utc": 1522871918,
        "upvote_ratio": ""
    },
    {
        "title": "\"Skype quality poor, fix it\"",
        "author": "TechieYoda",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89sohq/skype_quality_poor_fix_it/",
        "text": "Reading another TFTS tale reminded of this gem.\n\nFor reference, at the time I worked IT for the C suite of a large company. I would regularly visit CEO's office and his 4+ admins.\n\nEven though at this company we had enterprise video conference tools like Zoom and Skype for Business, the CEO had a preference for plain old Skype since it had been 'successful in the past.'\n\n^Side ^note: ^before ^my ^arrival, ^the ^first ^use ^case ^of ^non-Skype ^failed ^miserably...\n\nThat is until one day when he's in his private conference room and has a bad call.\n\nAs standard practice, prior to any video conference, our team would test with the end user or their admin without fail to ensure the system was 100% and address any issues, if needed.\n\nCEO emails CIO with subject \"Skype quality poor, fix it\". No additional details. Thankfully, we already knew which call it had been. As usual, we had tested the day before with the user and it had worked beautifully.\n\nCEO had another Skype call with the same user in a few weeks time so we started troubleshooting...\n\nTest call 1: primary office and another local office. No issues\n\nTest call 2: primary office and an office on the East Coast - issue on East Coast, which was addressed. Follow up test: no issues.\n\nTest call 3: primary office and an office close to $user's location. No issues.\n\nAt this point we're thinking *we have no issues, must be other end* and report so to CIO. CIO passes this info to CEO, and also asked us to retest with end user a day before their meeting, as usual, and report back.\n\nTest call 4, day before the call: test is perfect, no issues.\n\nTest call 5, day of call: another test just an hour before actual call was perfect, no issues.\n\nTwo hours later: email from CEO \"Skype still not working\"\n\nCEO is looking to take someone's head off at this point...\nand the CIO made it clear that it would not be his head.\n\nQue testing to save my as...calls with local and another office were perfect so we deem the issue must be on $user's end.\n\nThen it dawns on me to email the other end's admin:\n&gt; Hi $admin,\n\n&gt; $CEO indicated poor quality during their call again yesterday. We had tested the meeting and everything was perfect. Was there by chance any change in the setup before the call?\n\n&gt; Thanks,\n\n&gt;TechieYoda\n\nEmail reply from admin:\n\n&gt; Hi TechieYoda\n\n&gt; No, $enduser just took his laptop to $restaurant/cafe for the call as usual.\n\n&gt; Best,\n\n&gt; $admin\n\n**Eureka!**\n\n&gt; $CIO\n\n&gt; Based on our testing, and user input, we have identified the culprit of the poor quality calls: $restaurant/cafe's wifi network. Per $admin's note below, $user has a tendency to video conference from $restaurant/cafe instead of their office. \n\n&gt; Best,\n\n&gt; TechieYoda\n\ntl/dr: got blamed for poor Skype quality when other party was using public wifi.",
        "created_utc": 1522870470,
        "upvote_ratio": ""
    },
    {
        "title": "\"I want my music to open with iTunes instead of The Google\"",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89s9fi/i_want_my_music_to_open_with_itunes_instead_of/",
        "text": "Tech: Thank you for calling XYZ Help Desk, this is Tech...  \n...  \nHow can I help you?\n\nUser: Umm, Hi.  Yeah, so...I want to listen to music with my iTunes instead of the default app that's being used.\n\nTech: Sure, I can help you with that, let's get a remote session and get that changed for you.  \n*Change default music player to iTunes*  \nOk, please test that out\n\n*User proceeds to open Google Chrome, browse to YouTube, and play a music video*  \nUser: You didn't fix the problem at all.  It's still playing in The Google.  I want it to open in iTunes.\n\nTech: This is YouTube, it's a website...\n\nUser: Are you listening to me?  I don't want it to play in The Google.  I want it playing in iTunes.  My home computer opens these in iTunes, why can't you make my work computer like that one?  This is why Macs are better than PC's, God!\n\nTech: How can I help you?\n\nUser: Obviously, you can't.  Can I talk to a manager or something?  \n*transfer call to manager*",
        "created_utc": 1522867383,
        "upvote_ratio": ""
    },
    {
        "title": "You had me at blood and semen",
        "author": "I_Have_A_Chode",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89rqka/you_had_me_at_blood_and_semen/",
        "text": "[removed]",
        "created_utc": 1522864002,
        "upvote_ratio": ""
    },
    {
        "title": "Issue Tracking at its Finest",
        "author": "synticing",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89rc9o/issue_tracking_at_its_finest/",
        "text": "Let me start off by saying I'm only as experienced in tech support as one would expect someone with a degree in a different area of technology would be. Meaning I have some google skills and a desire to bash my head against a keyboard when a call \"accidentally\" gets routed my way.\n\nI work for a large corporation that provides technology solutions (read as early 90's software) to financial institutions. I was hired on as a full-stack developer to help modernize my team's application, but from time to time I am asked to help out with tickets. This story just happened an hour ago.\n\n\n\n**Players**\n\n\n\n$IBS = ~~Gastrointestinal stress inducer~~ Company\n\n$ME = Synticing, keyboard cat with opposable thumbs\n\n$PO = Product Owner (technically three levels of management above me, but treats me as her direct report)\n\n$CW = Coworker (former mainframer turned Java dev and also the triager of tickets)\n\n$BA^(1) = The business analyst you wish you had\n\n$BA^(2) = New BA, sits directly behind me\n\n\n\n**The Story**\n\n\n\n$ME: *Working on a project enhancement*\n\n$BA^(2): Hey $ME, can you come take a look at this?\n\n$ME: Sure. *saunders over to the cubicle behind me*\n\n$BA^(2): I just got a call from a client... It looks like every once in a while when switching between accounts the account number field and the account type field get blanked out. *proceeds to show me in production* The weird thing is though... it doesn't happen every time.\n\n$ME: *hits F12 on her keyboard* Here, try it now, I betcha the javascript is erroring somewhere.\n\n$BA^(2): *repeats until the issue occurs* Oh! Looks like you're right!\n\n$ME: Take a screenshot of the F12 console and include it in the ticket.\n\n\n\n**A little later on...**\n\n\n\n$CW: Hey $ME, did you have $BA^(2) create a ticket for this issue?\n\n$ME: Yup, I worked with her to get the details down and figure out that it was a timing issue between a js being loaded and called. Why?\n\n$CW: Well I just heard from $PO that if we can't get to a ticket right away we shouldn't be creating one?\n\n$ME &amp; $BA^(1): W... W... What?\n\n$CW: Yea, $PO doesn't want those low priority tickets to become stale so she wants us to keep them in an excel spreadsheet until we're ready to work on them.\n\n$ME: I hate green frogs.\n\n\n\nFor context green frogs is a code word for our company that my coworkers and I have had to use when saying anything perceived as criticism towards the company. This happened after our app team was forced to take a survey on our company satisfaction and the results \"reflected really poorly on our team\". $PO then decided to make talking negatively about the the company/team was a reprimand-able offense.\n\nEDITED: A word",
        "created_utc": 1522861437,
        "upvote_ratio": ""
    },
    {
        "title": "You got me. (User: 0, tech support: 1)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89r8uv/you_got_me_user_0_tech_support_1/",
        "text": "[removed]",
        "created_utc": 1522860832,
        "upvote_ratio": ""
    },
    {
        "title": "\"I keep getting blue screens.\"",
        "author": "Dixie_Flatlin3",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89r16p/i_keep_getting_blue_screens/",
        "text": "[removed]",
        "created_utc": 1522859410,
        "upvote_ratio": ""
    },
    {
        "title": "Enter the FQDN here",
        "author": "MakeBacon_NotWar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89qhdl/enter_the_fqdn_here/",
        "text": "LTL FTP yada-yada  \n\nPremise: I'm a vendor assisting customer server team with some errors they are seeing with our product. Was an easy fix - cert had expired and they needed to upload the new one. Now it was time to make sure the new cert stuck.  \n\nI will be $Bacon, hopeless admin will be $HA.  \n\n$Bacon: Okay, now I'm going to need you to open up a browser and navigate to the FQDN of the server  \n\n*I send him an example URL in chat, since I don't know their FQDN...https://yourFQDNhere:port/cfg*  \n*$HA opens up IE and copy pastes https://yourFQDNhere:port/cfg and hits enter*  \n\n$Bacon: Uh...I'm going to need you to put the actual server FQDN in there, with the actual port  \n$HA: Oh! okay.  \n\n*$HA opens cmd prompt, types in \"hostname\", copies the hostname and pastes it into the address bar*   \n\n$Bacon: We're going to need the rest of the FQDN in there.  \n$HA: oh, like the domain? That goes in front right?  \n\n*$HA starts typing domain.com.hostname*  \n\n$Bacon: here, just copy paste this   \n\n*I type the FQDN in chat, now that i know what it is*  \n\nMan...",
        "created_utc": 1522855919,
        "upvote_ratio": ""
    },
    {
        "title": "Did you try to swap the cables?",
        "author": "danythegoddess",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89pv8j/did_you_try_to_swap_the_cables/",
        "text": "[removed]",
        "created_utc": 1522851608,
        "upvote_ratio": ""
    },
    {
        "title": "The joys of purchase orders",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89p1qt/the_joys_of_purchase_orders/",
        "text": "[removed]",
        "created_utc": 1522845268,
        "upvote_ratio": ""
    },
    {
        "title": "Help I can't read my system anymore",
        "author": "hrkrx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89on3t/help_i_cant_read_my_system_anymore/",
        "text": "[removed]",
        "created_utc": 1522841533,
        "upvote_ratio": ""
    },
    {
        "title": "Do you provide crows or peacocks?",
        "author": "InKnowTech",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89ob4d/do_you_provide_crows_or_peacocks/",
        "text": "[removed]",
        "created_utc": 1522837958,
        "upvote_ratio": ""
    },
    {
        "title": "Your tantrum will not help you.",
        "author": "ITSupportZombie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89nhw9/your_tantrum_will_not_help_you/",
        "text": "At my previous job, I worked customer support for a corporate headquarters.  Many of my users were extremely entitled and felt the need to abuse everyone they perceive to be beneath them.  In this case, there was a crazy old lady ($COL) who liked to play dumb to get others to do her job whenever possible.  As many of you know that anything IT related is black magic and wizardry.  In this case I had frequent issues for even the most simple of things (like forgetting where the send button is on outlook when we upgraded to office 2013), she was always hostile and abusive even when asking for a favor.  This time was no different.\n\nOn this day around 2pm, $COL walks into my office and demands that I decrypt some files and put them in her shared folder before I go home.  I politely tell her that I am booked out for the rest of the day and that I have previously shown her how to unpack a file in 7zip.  She immediately starts shouting about how unhelpful I am and how lazy my whole department is.  I once again remind her that this falls outside my scope and is part of her duties.\n\nShe angrily storms out of my office, once again repeating her demand that she better have this by close of business that day.\n\nI put the disks with the data on them aside and continue working on the projects that are an actual part of my job and if not done, could cause many users to not be able to work.  Within minutes, I have pushed her tantrum out of my mind.\n\nA few hours later, I am working after hours on a call with a vendor to resolve an issue with a piece of hardware that is malfunctioning.\n\nThrough my door comes an enraged $COL hurling accusations and demands in her usual style, insulting my quality of work, ability to do my job and my beard.  I calmly tell her that I am on a call with a vendor and will work on her disks midday the next day when I have the time blocked out.  $COL isn’t having it.  Her rage devolves into an unintelligible foot stomping, arms waving tantrum you would normally expect to see a child in a grocery store have when they are told they can’t have any candy.  \n\nI ignore her and go back to my call.  Fixing this is kind of a big deal.\n\nThe tantrum continues for a good 7-8 more minutes until my patience finally gives way.\n\nI stand up from my desk, point to the door and tell her to get out of my office if she ever wants my assistance again.  To my surprise, she shuts up and walks out.  I should have known this was too easy.\n\nAfter she left, she walked into my boss’ office and proceeds to scream and shout at him.  He is on a very important conference call too and she would not leave his office.  He (I am told) got up and shut his door in her face.\n\nHearing her shouting down the hall, I assumed that this was the thing that would get me fired.\n\nNote:  My boss at the time hated me.  He was looking for an opportunity to fire me, but couldn’t find something good enough because the users in this building loved me and I was hired by his boss (the CIO) from when I worked for him previously.  I was loyal to getting my job done the best I possibly could and did not play office politics, especially did not play them the way $boss wanted.\n\nAfter I get off my call, I pack up to leave for the day when $boss walks in.  He asks, with a tone of disbelief, what happened.  I told him in very professional terms what had happened.  $boss then tells me what he did and was glad I was in the right on this.  I am shocked that for the first time ever, he is taking my side.  I take this as my que to leave, I am nearly at the 12 hour mark for my day.\n\nThe next morning I have an angry email from $COL’s bosses boss ($COLBB) detailing $COL’s version of the story.  I proceed to $COLBB’s office to have this conversation face to face.  I explain the events and prior history to her in great detail, including my personal notes from each incident.  $COLBB asks for and I provided copies of my notes.  I am then politely, but firmly, dismissed.\n\nA few days later I am told that she not only has to submit a ticket for all work (which I have 3 business days to resolve), but she is not allowed to contact my office directly and any personal interactions between her and my office must have a senior person there to be a witness.\n",
        "created_utc": 1522828231,
        "upvote_ratio": ""
    },
    {
        "title": "Moist Mobile",
        "author": "greyjackal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89mjqs/moist_mobile/",
        "text": "Although I have worked in IT for 25 years, this is a secondhand tale from someone who works for a mobile (cell) phone handset company.\n\n\"Hi, this is $RotormolaRep, how may I help you?\"\n\n\"Hi, this is $Customer, I dropped my phone into the toilet and now it's not working.  I know it's out of warranty but I can't afford to replace it, is there anything you can suggest?\"\n\n\"I understand, sir.  I can recommend putting it in some rice for a couple of days and see if that dries it out enough to make it work again.\"\n\n\"Great...I'll try that.\"\n&lt;click&gt;\n\n2 days later....\n\n\"Hi, I spoke to you about a water dunked phone a couple of days ago?\"\n\n\"Oh yes, I remember, how did it work out?\"  (customer took down the name of the agent and insisted on talking to him)\n\n\"Well, ok, but the battery has started swelling.\"\n\n\"...\"\n\n\"I mean, the rice is on the boil but...\"",
        "created_utc": 1522817929,
        "upvote_ratio": ""
    },
    {
        "title": "Which one is my network?",
        "author": "Ludovician42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89mdzp/which_one_is_my_network/",
        "text": "Hi, all.\n\necho $ltlftp\n\nJust a brief one here. I'm quite new to tech support, in my first IT job that I've had for less than 6 months. I'm still occasionally baffled by things users do but I'm sure that will resolve itself with time and sweet mind-numbing booze.\n\nOne of the first calls I received after the easter break was a new staff member who had been issued with a laptop for work. She was panicking about not being able to log into Citrix, and so begins the usual troubleshooting. What message is she getting? Could not connect to Citrix server.\n\nOk, so fairly basic problem. No internet connection. We have a standard SSID our users connect to with their own credentials at any of our locations, so I guide her to the list of networks and ask her to select that. At this point she begins to read out every SSID in the list in its entirety, and while I appreciate the thorough approach, none of them matched what I expected to find.\n\nIt was at this point I wised up to the fact she was working remotely, and she informed me she was working from home. No matter, I ask her to select her home network from the list. As you may expect from the title, she has no idea which one this is and wants me to tell her. I clearly have no knowledge of her home network at all, but being a nice rookie to the field I continued helping her instead of telling her to contact her ISP. As her personal PC was on a wired connection and she had no other wireless devices and no idea what her SSID or security key were, I managed to guide her to the box her home router came in, which contained a nice handy fridge magnet with said information on it. Please note that the process of walking her through each step of this took a total of around 22 minutes.\n\nIn conclusion, not a terribly interesting story but I did feel like I needed a short break afterwards to collect my thoughts and the tattered remains of my soul.",
        "created_utc": 1522816459,
        "upvote_ratio": ""
    },
    {
        "title": "\"We've tried everything we can to troubleshoot and need to dispatch a technician.\" \"Is it plugged in?\" \"Yes.\" \"Are you suuuuuure?\"",
        "author": "O7Knight7O",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89mcpi/weve_tried_everything_we_can_to_troubleshoot_and/",
        "text": "[removed]",
        "created_utc": 1522816147,
        "upvote_ratio": ""
    },
    {
        "title": "Kitten in the PC",
        "author": "GrimReapersWolf",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89ltxx/kitten_in_the_pc/",
        "text": "Short one today, but it made several of us laugh!\n\nCustomer sends in a ticket that says \"Weird noise coming from PC. It sounds like there is a kitten in there!\" It was, to say the least, the best ticket we have seen in a long while, so I went down to the customer's desk and discussed the issue with her. She described the noise and I figure either a dying fan or HDD as the PC she is using is old. I open it up real quick at her desk and take a look but don't find any glaring issues with it. I let her know that it's up to her, but that we would be glad to replace the PC and try to solve the \"kitten\" sound. While the PC boots up, she says \"Do you hear it?!\" and sure enough I can hear a faint whining noise coming from the PC. She says it's been going on for a few weeks but she just put in the ticket after she figured out that we don't have cats wandering around the office. Great customer with a great sense of humor! :D\n\nNeedless to say, she is getting a new PC tomorrow and will have to say goodbye to the kitten in her PC!",
        "created_utc": 1522811817,
        "upvote_ratio": ""
    },
    {
        "title": "Tesla coil power when?",
        "author": "blahbob00",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89liq4/tesla_coil_power_when/",
        "text": "Hello, Tier 1 support here. \n\nI got a call today where a new work at home user finally got her docking station for her laptop\n\n$Yb -&gt; Me\n\n$U -&gt; User\n\n&gt;$U: Hi I just got my docking station but neither of my monitors will work.  \n$Yb: Ok, can you check the connectors to make sure they're fully plugged in?  \n$U: Why would they need to be plugged in? Doesnt the dock make everything wireless?\n\nOk\n\n&gt;$Yb: Uh, You'll still need to plug the cables into the dock in order for it to work, we don't support wireless monitors.  \n$U: Ug, fine \n\n*Few minutes of rustling noises while user connects cables*\n\n&gt;$U: They're still blank.  \n$Yb: Are they plugged in to the power source?  \n$U: You mean I need those too?\n\nI love my job",
        "created_utc": 1522809388,
        "upvote_ratio": ""
    },
    {
        "title": "Rocky the Raccoon, or How I Learned To Stop Worrying And Love Bureaucracy.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89l1hz/rocky_the_raccoon_or_how_i_learned_to_stop/",
        "text": "[deleted]",
        "created_utc": 1522805889,
        "upvote_ratio": ""
    },
    {
        "title": "Let's cc in the boss - that'll get IT off their lazy ass...",
        "author": "White_Noise_83",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89k8kc/lets_cc_in_the_boss_thatll_get_it_off_their_lazy/",
        "text": "Long time IT manager, first time post...  \n\nYesterday I received an email from a staff member (cc their manager) saying that the email address for one our shared mailboxes is not working any longer.  It was accompanied by the NDR.   \nYesterday was a busy day for me, so when I saw it, I knew what the issue was straight away - they were using address.email@domain.com instead of the long standing email.address@domain.com - but I couldn't do anything at the time because I was working on more important things.  And I thought to myself \"they'll figure it out\".\n\nAnyhow - I received a follow-up email this morning which this time had the company director cc'd into the email.  It went on to say that I hadn't responded yet and that it was of paramount importance that the issue be resolved as soon as possible because they were providing this email address to clients and receiving feedback that the client couldn't send emails to the company.\n\nIt hadn't even been 24hrs and the user had made zero effort themselves.  But whatever, I logged onto Exchange Online, added the incorrect email address as another alias to the shared mailbox and took a screenshot.  I clicked Reply All to the latest email and gently explained her error and also informed her that I've added the incorrect email address to the mailbox so it would now work and that if the same mistake was made in future, those emails would also deliver.  I pasted in my screenshot of the mailbox addresses clearly showing the primary email address and the newly added alias.\n\n10 minutes later I received the standard \"I had been told that was the email address\" but this time there was no cc's.\n\n***tl;dr***:  someone complained about a \"fault\" and cc'd their boss to then be told (keeping the boss in the cc) that it was user error\n\n.\n\n**edit - thanks for all of the support reddit (2k7 karma on one post is 4x the karma I had to start with) - I hope you had a chuckle!  For all those naysayers thinking I was lazy or harsh - I'm usually very selective in my reply-all's and often remove certain people from the chain to protect them from the stupidity or reputation damage, but this user's lack of effort, impatience and entitlement just called for some egg on the face.  \nI could pretty much start a sub just for all of the CC stories I have working as an IT Manager in a law firm.",
        "created_utc": 1522800315,
        "upvote_ratio": ""
    },
    {
        "title": "Tit pics and the Cumulonimbus backup solution",
        "author": "geoguy89",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89k4gg/tit_pics_and_the_cumulonimbus_backup_solution/",
        "text": "[removed]",
        "created_utc": 1522799540,
        "upvote_ratio": ""
    },
    {
        "title": "We can't throw out any USB device.",
        "author": "Kanaric",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89jtgb/we_cant_throw_out_any_usb_device/",
        "text": "[removed]",
        "created_utc": 1522797526,
        "upvote_ratio": ""
    },
    {
        "title": "And it only took 3 years to fix it!",
        "author": "Protoss_Pylon",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89jsz2/and_it_only_took_3_years_to_fix_it/",
        "text": "I work for a medium/small company whose main office is in Japan. The head of our company (the \"President\") makes nightly phone calls to the Brass over in Japan using a very high quality, reliable, secure, communications and data transferal program: skype. One day, before I started working there, the President approached our CIO and informed him that his phone call the night before was not the highest quality and that it needed to be fixed! The Brass didn't change anything on their end, apparently, and our CIO informed them that no changes had been made to our network either, but he would investigate the cause. A few years later the problem was still not resolved, and I was hired. \n\nI thought this would be good opportunity to show them what I was made of so I tried to fix it. I called the ISP to ask about our QoS policy: nothing interesting. I infected my own laptop with skype and skype'd my boss from my house to test our internet connection: dead end. I literally skyped the Brass's IT guy to see it for myself: it was indeed lossy. I concluded finally that the problem was on their end, as our CIO had suspected earlier, however, the Brass believed that their internet was superior and the problem *had* to be ours. Even their IT guy accused us of changing something and not remembering what we changed. /*sigh*\n\nThe deadlock lasted for almost a year more: we thought it was their problem, and they thought we were morons. Our President, desperate, even had us install a new webcam in case our inferior web cam was causing the poor video. It wasn't. We remained entrapped in \"no, you!\" until I revamped our company's wifi and the President started talking to the Brass about how much he liked his new wifi. Interestingly, the Brass also happened to have wifi, which they installed nigh on three years ago! Hmmmm... Now this really got our CIO's gears turning (grinding even) and the following email left our default gateway that hour:\n\n&gt; RE: Skype problems    \n&gt; Dear IT guy-san,     \n&gt; How is your Skype computer connecting to the internet?     \n&gt; Does it use wifi?!?!    \n&gt; Sincerely,     \n&gt; CIO    \n\nLegend has it that the next day's skype call looked better than ever. ",
        "created_utc": 1522797430,
        "upvote_ratio": ""
    },
    {
        "title": "The Random Project",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89j2b8/the_random_project/",
        "text": "[removed]",
        "created_utc": 1522792191,
        "upvote_ratio": ""
    },
    {
        "title": "24/7 Help Desk is unavailable",
        "author": "taladraco",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89hp2u/247_help_desk_is_unavailable/",
        "text": "(LTL, FTP, hope the formatting is fine)\n\nI work in an IT call center that is 24/7. I started as level 1 IT support but eventually moved into client management. I wear many hats now, one of which includes dealing with caller and client complaints. I'm also hourly, so no one is allowed to call me once I clock out. There's others who handle things when I go home. \n\nThis particular morning, I sat down at my desk and opened my email to find two emails, one from my boss, and the other from my boss's boss (BB). I also see that there was a missed call from BB.\n\nThe email was in response to a pretty livid customer who had been unable to reach our 24/7 phone number. It went something like this:\n\n**Customer:** I thought this was a 24/7 Help desk!  I couldn't reach anyone! It said the phone number XXX-XXX-XXXX was unavailable! This is ridiculous! If you advertise 24/7, you should be 24/7!\n\nNow this is a pretty legitimate complaint and the customer was from one of our big clients, but the problem was that this customer sent an email to the wrong person in our company. So the email, while sent at noon, was missed until later that evening, after I had left for the day. It eventually escalated to BB, who first tried to call me, then sent an email asking someone to test the line. \n\nMy boss also didn't see the email until this morning so he went ahead and tested the line before I got in to work. He said there was nothing wrong with the line but he would investigate. This is where I came in. Read through the full chain and noted that the user had written down the correct phone number.  The rest of this is by email. \n\n**Me:** (to boss) I checked our reporting and don't see any calls coming in during that time frame, so ill reach out to the telephony team to see if they can see any issues. \n\n**Boss:** Okay, let the client know that we're investigating. \n\nI decide to wait to speak to the client because I at least like to have a little information before doing so. I submit a ticket to telecom and ask politely if they can check for any issues for the day.\n\nThey respond pretty quickly and let me know there were no issues found. Okay, so now I suspect I know what happened, but since customer wrote down the number correctly in his email, I have to at least give him the benefit of the doubt. So I reach out to the client.\n\n**Me:** Hello, client. Got an email from one of your users about not being able reach our helpline. Have you received any other reports from users?\n\n**Client:** First I've heard. Checked with coworker and she helped *Customer*. Apparently he got the area code wrong the first time and completely got the whole number wrong the second time.\n\n**Me:** (thinking, \"as I expected\") All right,  thanks!\n\n\n\ntl;dr: customer dialed our number wrong twice and immediately sent an angry email complaining about it that escalates past me",
        "created_utc": 1522784560,
        "upvote_ratio": ""
    },
    {
        "title": "I'd call it a successful interview.. for us.",
        "author": "Slightlyevolved",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89hp0q/id_call_it_a_successful_interview_for_us/",
        "text": "[removed]",
        "created_utc": 1522784551,
        "upvote_ratio": ""
    },
    {
        "title": "The Change Button",
        "author": "falschgold",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89gp5f/the_change_button/",
        "text": "\n$FG - me, admin, freelancer, mainly small business clients but the odd semi-private customer\n\n$PHD - the odd sem-private customer, she is a PhD in something or the other soft science. She is the person that just shouldn't be allowed near anything powered by electricity.\n\nCall from $PHD\n\n$FG: Yes?\n\n$PHD: I cannot print anymore.\n\n$FG: Go on..\n\n$PHD: Until recently I could print, now it saves everything.\n\nMy Sherlock Holmes like deduction skills tell me, that we are talking email attachments and that they are saved as PDFs. I know that every further questioning will lead to a 2-minute monologue and tell her, that I now will remote into her PC and that she should close all sensitive documents, a sentence she didn't understand a word of.\n\n$FG: Ok, I can see your PC, please show me the problem.\n\n$PHD starts Chrome, painstakingly slowly opens her webmail, find's a very specific email from two weeks ago by scrolling through multiple pages, opens it, locates the attachment and downloads it. It's a PDF as everyone might have guessed now. She opens it, the internal PDF viewer opens, she presses the print symbol and the printing preview pops up.\n\n$PHD: See. No \"Print\" button, it changed to a \"Save\" button.\n\nThis is a PhD, a scientist. \n\nThe nice thing about this client is that I am in no way financially dependent on her, it's a favor for her husband, who is a nice guy and a proper business client of mine and having his wife is punishment enough. So I start\n\n$FG: Ok, what do you see?\n\n$PHD: A \"Save\" button.\n\n$FG: Below?\n\n$PHD: Save as PDF\n\n$FG: Below?\n\n$PHD: A button labeled \"Change\".\n\n$FG: And the button labeled \"Print\" changed to \"Save\" recently, you say?\n\n$PHD: *..one minute of complains and how can this happen and she didn't do anything and that she just can't understand..*\n\n$FG: ..making tea..\n\n$FG: Ok, so the button labeled \"Print\" changed to \"Save\" and we would like to change that back, right?\n\n$PHD: ..a lot of words..\n\n$FG: ..throws away the teabag, getting sugar, stirring slowly..\n\n$FG: So, again, you want to change back from Save to Print again and, according to your expertise as a PhD, a *scientist*, give me a theory, what could the button labeled \"Change..\" in this particular case possible do? Your opinion, no pressure..\n\n$PHD: I don't know, what would it do?\n\n$FG: What is it labeled again?\n\n$PHD: \"Change..\"\n\n$FG: So..?\n\n$PHD: Clicks.. \n\n..silence..\n\n$PHD: Thank you so much, but can you possibly tell me how this happened?\n\n$FG: Sorry, call on the other line, have a successful day!\n\n",
        "created_utc": 1522779066,
        "upvote_ratio": ""
    },
    {
        "title": "Bureaucracy is Like Thor's Hammer -",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89fit1/bureaucracy_is_like_thors_hammer/",
        "text": "You always want to be on the swinging end, not the receiving end.\n\nThe ticket came in \"Cannot Install *CrucialSystemPackage*\", high priority, from our Middleware team.  This can either be a good thing or a bad thing; for the most part, they know their job very well; however, they sometimes don't know *my* job.\n\nFrom the ticket description: \"I'm trying to run yum update *DefinitelyASystemPackage* and I'm getting these errors.  You guys need to set up yum correctly.\"  This team has sudo access, so they can update the parts of the system they own, but this isn't one of those parts.  The error message also indicates they're trying to get this package from some random mirror on the internet, rather than one of the local repositories on the intranet.\n\nI contact the submitter via chat.  It's the beginning of my day, but the end of his.  That might explain the attitude I got from him.  \"Do this; I'm in a hurry; your system is broken; it shouldn't be set up like that\".\n\nI always try to figure out what the user is trying to do, and why; what he wants is often distantly related.\n\nWhen I get to the root of the problem, he's misunderstood an error message from the web server, and thinks he should update my OS component.  Being a user, he doesn't believe me, and is fixated on his solution.\n\nI google his error message, cut and paste the solution in the chat, and ask him if he has tried that.  He said he had not, but would so I would get on with fixing my system.  Behold, the fix took 60 seconds, and worked.\n\nThen my day got much, much sweeter.\n\nMe:  \"This is a production system, has the outage been resolved?\"\n\nThem:  \"Oh, there was no outage, I just didn't like that error message.  It wouldn't ever cause an outage\".\n\nMe:  \"And you didn't try this fix in dev or test first?\"\n\nThem:  \"Well, no, I just heard about it\".\n\nMe:  \"Policy requires that you submit a change request and get it approved before changing production systems, unless you're responding to an outage.  And a change would probably require that you test the fix on a test system first\".\n\nThem:  \"Oh, we never do that\".\n\n**Boom**   Email to my boss, his boss, and their bosses, \"I am concerned about a failure to follow procedures...\"  For ~~evilness~~ completeness, I cc'd the director of the group that owns the change process *bwahahaha*.\n\nMe:   \"Hmm, you probably ought to.  I'm surprised you could run the yum command, usually sudo is locked down to only the things you need to do as root\".\n\nThem:  \"Yeah, we do *cleverloophole*\"\n\n**BoomBoom**\n\nEmail to ~~Spanish Inquisition~~  Security Incidents, \"Potential Security Breech - is this allowed?\"  Odds are, if they need that access, they'll have to update a web form and sudo will be fixed.  But they get to explain why they didn't do that in the first place.  And if they don't need that access, someone will explain to their boss that they shouldn't be doing that.  Heheh, nobody expects the security incidents team.\n\n\nEdit: Clarified who said what.",
        "created_utc": 1522772483,
        "upvote_ratio": ""
    },
    {
        "title": "If it needs power...",
        "author": "Angelin01",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89dbwj/if_it_needs_power/",
        "text": "LTL, FTS. Here's a quickie, fresh out of the oven:\n\nI'm an intern in a government building, working on the support side. Let's just say the rules here are: no rules.\n\n*phone rings*\n&gt; $me: Good morning, tech support speaking.  \n&gt; $caller: Hello, do you guys have a 3 way adapter? We need to power this thing but are out of sockets!  \n&gt; $me: Uhm... I don't believe we have any adapters, I'll check.  \n\nSo I get suspicious. When we set up computers, they are ready to go and powered, connected to the network, etc. Why would she need a 3 way splitter?\n&gt; $me: Sorry, no adapters... What do you need it for? Is it urgent?  \n&gt; $caller: Well, it's because we need to power this fridge here, otherwise these foods will rot, and TI should have adapters!  \n&gt; $me: Sorry, we can't help you... You should try calling the storeroom folks.  \n&gt; $caller: Ok thx bye! *hangs up*  \n\nAfter I stare into the air for 2 seconds, I tell this story to my coworkers. Many laughs were had. We got back to work, this was low level for our users anyway.\n\n^^^^Maybe ^^^^some ^^^^other ^^^^time ^^^^I'll ^^^^share ^^^^the ^^^^story ^^^^about ^^^^the ^^^^\"incorrectly ^^^^programmed ^^^^keyboard\"",
        "created_utc": 1522759397,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, my user is locked",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/89d6vk/hello_my_user_is_locked/",
        "text": "[removed]",
        "created_utc": 1522758393,
        "upvote_ratio": ""
    },
    {
        "title": "Headphoning it in",
        "author": "DreadPirateLink",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/896sts/headphoning_it_in/",
        "text": "Some of my users work remotely. \nSome of my users are video editors. \nOne of my users has need of a new iMac currently. \n\nA few weeks back, we had a snow storm on the east coast of the US.\nOne of my editors (let's call her Julia) who lives several hours away and works remotely is working on a top priority trailer. With her computer on the fritz, Julia needs to remote in to one of our more powerful machines for the day to get it done. I make the executive decision around 7am that I should drive into the office to get Julia set up. I create a Logmein account and jump in the car.\n\nThe roads aren't too bad yet, so it doesn't take long. I get into the office and get the Logmein set up and start the transfer of the video files onto the proper machine.  \n\nI head back home (the roads are getting a bit icy, but not quite too bad). After a quick stop for some McD's, I make it home safe and sound. \n\nAfter a few hours of getting templates and fonts copied over and some other work, Julia starts up Logmein to get some video edits in, only...there's no sound. Go into System Settings to check audio output only to find that the headphones are plugged in. I spend a solid hour and a half looking up how to swap the output on High Sierra away from the headphones while they are plugged in, including looking up Soundflower and other digital audio routing software. \n\nNo dice. We opted to work on other projects and finish the audio on the video edit first thing in the morning.\n\nOnly about 3 hours wasted!\n\nLPT: If you are planning to work remotely on a High Sierra Mac and need the audio output, unplug your headphones. \n\n\n\n",
        "created_utc": 1522715444,
        "upvote_ratio": ""
    },
    {
        "title": "The one where I'm the idiot...",
        "author": "iofthejackal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/894f42/the_one_where_im_the_idiot/",
        "text": "Sigh, here comes one of those stories that I can't blame on a user - I was the idiot. It happens...    \n\nI'm a solo admin at a government agency - that thankfully outsources some of our support &amp; infrastructure work to an external agency. Allows me to take days off and still have backup, and gives me somebody to call to help with the heavy lifts...    \n\nAnyway, long story short - we were nearing the end of a physical to virtual transition on a server that was used to host video for our local PD. The previous physical server had two NIC's - one that connected to the internal network, and one that the squads used to offload video wirelessly.    \n\nWe'd managed to get everything swapped over &amp; running on the new VM with new (upgraded) wireless hardware, and had been able to upload a couple test videos with no issues (other than the port list from the manufacturer being hilariously outdated &amp; inadequate). Considered it a win, unplugged the old network and powered down the old server.    \n\nCame back the next day - to find that videos failed to upload over wireless half the time. After a LONG day of troubleshooting, swearing and general asshattery - discovered my mistake. I'd unplugged the old wifi AP from the switch, but hadn't  unplugged its POE injector. So it was still happily broadcasting away and offering addresses to the cars that just happened to grab it instead of the upgraded AP - where they then connected and talked to nothing.    \n\nWhoops.    ",
        "created_utc": 1522699228,
        "upvote_ratio": ""
    },
    {
        "title": "Monosylables and Their Expanded Meanings",
        "author": "SpecificallyGeneral",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8949xx/monosylables_and_their_expanded_meanings/",
        "text": "But first, some context. \n\nI was in thrall to a fellow who loved the idea of refilled and remanufactured ink and toner cartridges. He loved the obvious cost savings, and could not be made receptive to the reports of clogged print heads and toner explosions.\n\nWhen I was the FNG I acquired the dusty mantle of The Printer Guy and had not been able to divest myself of it, despite having passed along most of the other trappings of the FNG to the next worthies that passed through my care. I can only imagine that this lead to some mistaken idea that I maintained this duty out of desire, rather than delegation.\n\nManager and I had gone through a number of cycles of \n\n* cheap ink = less spending up front\n* cheap = causing problems\n* problems = more spending\n* certified ink = less spending overall\n* cutting budgets = less up front costs\n\nI'm sure this is familiar.\n\n-----\nExpansion of monosylables is in parentheses. \n\n&gt; Manager (Mgr): Hey, SG! You know that toner we buy for doing cheque runs? \n\nSpecificallyGeneral (SG): Yup. (I am aware, and slightly suspicious) \n\n&gt; Mgr: It's got this special chemical in it that the banks test to see if they've been tampered with.\n\nSG: Yup. (This is true - it blurs and stains the cheque to bring it to the attention of bankers.)\n\n&gt; Mgr: Well, I got this $Beard brand, last time, and a bunch of the cheques failed validation! \n\nSG: Huh. (You do love that $Beard brand, despite its ongoing efforts to destroy every medium-class printer we have)\n\n&gt; Mgr: Did you know that the stuff we were buying previously is certified by the banks?! \n\nSG: Yup. (I'm even reasonably certain that I pointed that out, in the misty past) \n\n&gt; Mgr: Do you know how much a fifty percent failed cheque run costs? \n\nSG: Hmm... \n\n&gt; Mgr: More than we saved in getting this cheap, not working, cheque ink! \n\nSG: *tsk* (MICR toner) \n\n&gt; Mgr: So I'm just going to get this branded stuff! \n\nSG: Good. (Good!) \n\nI realized, later, I watched an entire cycle happen in the space of a few minutes, and a man who was proud of finding a solution to a problem that they, themselves, caused. \n\nSG: Yup. (Time to update the ol' resume) ",
        "created_utc": 1522698685,
        "upvote_ratio": ""
    },
    {
        "title": "Slinky Time: Server is hang (Do Over)",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8945q4/slinky_time_server_is_hang_do_over/",
        "text": "*This Post was Removed because I submitted 2 posts in one day.  Here's the do over.*\n\nOn dark days, I remember a coworker's advice: \"Users are like Slinkys. They serve no useful purpose, but it's fun to give them a little push off the top stair\".\n\ntl;dr - File System 100% Full is not caused by a hung NFS Mount on a different file system\n\n&gt; I have a few candidates for the Slinky treatment. To set the stage, one of the metrics we're graded on is \"Reopened Tickets\". Our target is pretty low, say 1 in 100. Some tickets don't count, which we refer to as the \"user is an idiot\" loophole: user reopens ticket to ask for something complete different, more information, or say \"Thanks!\". Because managers watch the metric and discuss it weekly, when the ticket is complete, we ask the user if the ticket can be closed and try to head off any problems. 4 times this month, I've had a ticket reopened. In the previous 12 months, I had 1 ticket reopened: \"Thanks! This Really Fixed it!\".\n\nI grab the next incident in the queue. It's medium priority - 3 day turn around time.\n\nThe entire text of the ticket was \"Server is hang unable to do anything\" and two hostnames. That's usually a clue that the user will not be a joy to work with. User is a \"Service Owner\", which means they are responsible for the box and application, and have minor mojo over the box.\n\nI ssh into the first server. I notice 1900+ processes. Check a few things, and discover it's half of an active-active pair and I cannot ssh into the other half. Being awesome (but not humble), I quickly find that there is a hung NFS mount. On the working box, processes are backing up trying to access it. For some reason, running a traceroute to the NAS clears the problem, and the processes start completing.  Problems that go away by themselves come back by themselves, but for now, my work is done.\n\nI jump through the necessary hoops, and get the console for the other box. In our systems, this requires giving the secret handshake to get the console, and sacrificing a goat to get the actual root password for the box. The user had sudo privilege to reboot the box, and the shutdown process had hung trying to unmount the NAS. Power cycle the box and it's back.\n\nBoth systems appear normal after reboot. IM the user and ask him to check things out. He says it looks good, and allows me to close the ticket.\n\nThe next day, the user reopened the ticket. With a completely different problem - out of space on an application file system. The update to the ticket even included the error message, a df showing the problem, and the text \"Problem happen again\".\n\nUser was advised to clean up his own file system. An separate email to the user advised him that \"NFS server not responding\" was not the same thing as \"No Space Left on Device\", and reminding him a new ticket is required for each incident. For good measure, I cc'd his boss and my boss. My boss responded that if we had further problems with the user, she'd reach out to his boss and suggest retraining.\n\n\nYou may also enjoy [Slinky Time: Password Reset](https://www.reddit.com/r/talesfromtechsupport/comments/88avzf/slinky_time_password_reset/)",
        "created_utc": 1522698245,
        "upvote_ratio": ""
    },
    {
        "title": "End User deletes $5,000 and asks us to pay up",
        "author": "DatIzzy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/891bop/end_user_deletes_5000_and_asks_us_to_pay_up/",
        "text": "**Inciting Incident**\n\n*December, 20XX. Client is having an error message on their registers, caused by a corrupt file. This is solved by deleting a specific file, one that, by chance, stores offline credit card transactions! Since this is actual sales, it's important that a copy of this file be made in advance, just in case there are sales to replay. Due to timezone difference, time constraints, and the end-user not wanting to do a phone call, a brief back-and-forth discussion happens, ending thusly:*\n\n\n&gt;$DatIzzy: \"Hey, so I know you're having $Issue again. I've emailed you the instructions on how to do this, though I'm sure you're familiar with all the other times we've done this. Please remember to copy that file onto a flash drive! Those are important sales information, and will be lost if a copy isn't made.\"  \n&gt;$Aurelia: \"There's nothing in the file anyway. I'll just delete it.\"  \n&gt;$DatIzzy: \"I'll need a copy of the file regardless, for record purposes.\"\n\n*March, 20XX+1. Sitting in a small meeting room, $DatIzzy is leaning back. His internship was almost up, and he had to deliver the unpleasant news that $HospitalChain was canceling their support contract with us. $BigCompany was still going to offer other services, but they effectively used us to test out the system that they insisted on, that was never deployed before them and no one deployed after. The thing was undocumented, unique, and not even the $DeploymentGuys had a solid idea of how to troubleshoot.*\n\n*Which meant this was fun...*\n\n&gt;$Coworker: \"Right. So, I've got a ticket for $Hospital. They're having some credit card reconciliation problems...\"  \n&gt;$Manager: \"Well, maybe $DatIzzy should look at it...\"  \n&gt;$DatIzzy: \"Coworker actually knows there stuff here. What I can say is that their POS' haven't sent out the sales. They've been having some trouble in the past with them, but they've stopped contacting us. What site is it, and when?\"  \n&gt;$Coworker: \"$SpecificLocation, back from December, and they say they're missing $5,000.\"\n\n-------------\n\n**Context**\n\nI work at $BigCompany, offering support for Point of Sales (POS) devices. We also end up supporting peripherals (scanners, scales, receipt printers, etc.) as well as related websites. However, I've managed to wiggle into credit card reconciliation, which makes me feel like a low-risk Sherlock Holmes. Back then, it's because there was a sort of a thrill to the chase, so-to-speak. Now... well, now it's because I can diagnose most issues at a glance, and be insufferable about it.\n\nThis is a tale from my early career in IT, around the 6-month mark. I still wore dress shirts, though had dropped the tie. I had dress shoes. I worked hard to get here, and I was gunning to be brought on full-time!\n\n**The Cast**\n\n$Me: $DatIzzy. Yours truly.  \n$AU: $Aurelia, manager at two properties for $HospitalChain. Since they both had the same issue, they're just getting lumped together here.  \n$MA: $Manager. Nice guy. Didn't entirely understand what I was doing, but knew to trust the people that were actually doing the jobs.\n\n-------------\n\n**The Issue**\n\nMissing funds are a serious matter, but my group isn't responsible for making sure the field properly reconciles. At least, not anymore. Back at the time of the story, it was my job to reconcile for them as part of the troubleshooting process. At the time it was only about three month's worth of information, for two properties. The information collection process is, well, slow. First, I need to go to $ReportingWebsite to find out what the registers actually recorded day-by-day. Then, I need to go into $Program to see what was actually sent out. Finally, I need to go to $SettleWebsite to see what actually got sent to their bank. Between those three, I can manage to find some trends. If $Program has more or less money than $ReportingWebsite, then there was an issue with the registers for instance. If $ReportingWebsite and $Program are the same but $SettleWebsite is off, then either transactions were rejected (if short) or there might be duplicated transactions (if over). $ReportingWebsite takes the longest, due to some clunky UI, website instability, and that, to make sure I don't need to pull this information again, I save a copy of every day for each location. Needless to say, it took me most of the workweek to get this done, because, of course, I still have other issues to work on...\n\nLo and behold, they're missing... less than $5k, but close enough that I can excuse it being a shorthand. And I can pinpoint days as well. The problem with the high-level view, of course, is that it's high-level: I can pinpoint when the issues are, but not what the exact issue is for each day! So I dig in. This takes me about another day.\n\nIt's a full week after I've looked up all this information. I've got hundreds of reports saved, some text documents and others PDF's. I've got my spreadsheet looking... well, passable. I call $Aurelia.\n\n&gt;$Me: \"Hi, this is $Me from $BigCompany. I'm calling in recards to $Ticket?\"  \n&gt;$AU: \"Oh, thank god! I've been waiting! So, you're going to write us a check, right?\"  \n&gt;$Me: \"We need to find out why the funds haven't transferred, first. Now, I can see that there are a number of offline transactions...\"  \n&gt;$AU: \"Our transactions are always online. We wouldn't take any offline!\"  \n*This is not an uncommon reaction. The term \"offline transaction\" does conjure up a certain scenario, but the truth of the matter is that it's a shorthand term. In reality, a transaction is taken in an offline state when the registers are offline, the credit card reader is offline, or when there are sufficient delays in communication.*  \n&gt;$Me: \"As we've discussed before, your network isn't really up to snuff. Have you contacted $LocalIT to investigate the matter?\"  \n&gt;$AU: \"They said everything's fine! No problems. So, when can we expect the money?\"  \n&gt;$Me: \"Right, so there's a large number of offline transactions that make up almost the entirety of the loss. These don't seem to have been replayed...\"  \n&gt;$AU: *She sighs in annoyance, the sound of someone begrudgingly going with the flow to say \"I told you so\" later.* \"Fine. What do you need me to do?\"\n\n*A call is scheduled during their slow time, which, coincidentally, is when my day is almost over due to the timezone difference. Still, I'm more than happy to provide this service. Some extra effort getting this missing money will be a boon! I wasn't even thinking of what would happen if the sales got declined or, worse, if transactions actually made it through...*\n\n&gt;$Me: \"ALright, now I just need you to follow $Step1, $Step2...\"  \n&gt;$AU: \"I've already done it. It's not there.\"  \n&gt;$Me: \"Not there? Huh, that's wei- Steps? Oooh, right, I provided you those steps!\"  \n&gt;$AU: \"Oh, you did?\" *Her voice, for once, warms up, as if appreciative.* \"Yeah, these worked great! Really helped us resolve our issue, since you guys took too long, and weren't fixing it anyway.\"  \n&gt;$Me: \"What other issues? Did you open tickets? Did you ever send in the copies of those files?\"  \n&gt;$AU: \"Oh, no, you guys always took so long. And they were always empty! So we just started deleting the files every day.\"  \n&gt;$Me: \"I... you... What?\" *Smoke comes out of $DatIzzy's ears. This would ruin his chance at a job! A good job! Not in a kitchen! A desk, and air conditioning, and a livable wage he could move out on!* \"We... we need to look at all of the registers. Period.\"  \n&gt;$AU: \"But this one-\"  \n&gt;$Me: \"Every. Single. Register.\"\n\n*Each property only had a couple of POS' each, so it was quick per site, with the major delay being the drive between the two. As it turns out, $Aurelia had indeed just been deleting the files. Now, that wasn't the end of the world, because instead of using compact flash memory and a modified version of an older windows like the rest of our POS', theirs had Windows 7 and an HDD. This meant that deleted items actually went to the Recycling Bin...*\n\n&gt;$Me: \"So, is anything in there?\"  \n&gt;$AU: \"No! I didn't want those files corrupting anything else on my register!\"\n\n*Knowing this was a situation of one person's word against another's, $DatIzzy considered himself to be up a well-known creek without a paddle. The only way to get in front of this potential storm was to fess up, throwing myself at $Manager's mercy.*\n\n&gt;$Me: \"Right. So, they were having $Problem, but they started to get impatient. I sent them written instructions on how to fix it, and gave them the $Warning. Instead of opening up new tickets, they handled it themselves. It also seems that they cleared their Recycling Bin, and since those files are deleted it means the only record has been wiped, so they can't recover their sales.\"  \n&gt;$MA: \"And they admitted this?\"  \n&gt;$Me: \"Er... yes, actually. I don't have it in writing, but-\"  \n*My manager calls $Aurelia up immediately. It runs through the same sort of conversation flow: we need our check, this is your fault, you need to rectify this...*  \n&gt;$MA: \"So, $DatIzzy told me that you deleted those files and didn't send them to us. Is that correct?\"  \n&gt;$AU: \"Yes.\"  \n&gt;$MA: \"$DatIzzy also told me you didn't open tickets for those times. Is that correct?\"  \n&gt;$AU: *She's getting increasingly annoyed, wanting nothing to do with silly things like confirming details.* \"Yes!\"  \n&gt;$MA: \"And you didn't send those files into us to check them?\"  \n&gt;$AU: \"For the last time, **YES!**\"  \n&gt;$MA: \"Alright. So, we're going to close this ticket because we can't help you. You deleted those sales without informing us of the problem or letting us confirm, so we're afraid this is your responsibility.\"  \n*At this point, I was waved off as my manager's manager was brought into the fold, and a liaison, and I got to walk away only slightly less worried than I had been.*\n\n--------------\n\n**The Aftermath**\n\n$Aurelia and $HospitalChain did continue to pester us to write them a check. The latter does make sense -- it was a $BigCompany employee that was the cause of them not getting their sales, although, to be honest, I'm not sure if they were given the full rundown or not. From $Aurelia's standpoint, I like to imagine that she was on the hook for it all. She kept opening tickets up in an attempt to get something done, but we simply referenced $Ticket and closed it out, stating that a decision had been made. It's bad enough that $BigCompany wasn't going to get its cut of those sales, but to write out a check for the missing funds on top of that would've still been worse.\n\nI was ultimately brought on full-time as well. I don't know if this incident had anything to do with it. Honestly, I'd like to think that it was my hard work that brought me on. Though, this even did teach me a couple of important lessons at the end of my internship:  \n1) An end-user armed with knowledge isn't always better.  \n2) Keep everything documented.\n\n-------------\n\nTL;DR: Read the title.",
        "created_utc": 1522688601,
        "upvote_ratio": ""
    },
    {
        "title": "It's a Mutiny!",
        "author": "Voxmanns",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/890men/its_a_mutiny/",
        "text": "[removed]",
        "created_utc": 1522686307,
        "upvote_ratio": ""
    },
    {
        "title": "The yellow box that wouldn't go away",
        "author": "LAMBKING",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88zqo6/the_yellow_box_that_wouldnt_go_away/",
        "text": "I got to thinking over the weekend (which I generally don't advise) what other story from my past might make a good TFTS story. I've come up with one. It isn't as epic as my last and this lady was an angel compared to the last one, but I think you all will enjoy it.\n\n**The Parties Involved**\n\n**Paralegal** - A paralegal that worked in the legal dept. of News People. I’ve talked with her before. She isn’t a techie, but she knows her way around a computer and can identify various parts with little help.\n\n**LK** - Me, the sometimes hero, as always.\n\n**The Setting**\n\n*Nearly lunch time. Summer. Hot and humid outside. Just another glorious day in the corp.*\n\n&gt;**LK** - Tech services, this is LK. May I have your name?\n\n&gt;**Paralegal** - This is Paralegal, I have a yellow box on my monitor that won’t go away. I stepped away for a couple of minutes and when I came back, it was there. I was able to log back in, but I can’t see anything behind it. It wasn't there at all before.\n\n&gt;**LK** - A yellow box? Can you click on it, or move it around? Does it say anything? Is it in one specific program or window?\n\n&gt;**Paralegal** - No. It’s in the dead center of my screen. My mouse disappears behind it. I can’t click on it or move it. It doesn’t say anything. It’s just there and it won’t go away. I have to get *legal document* to my lawyer before lunch, and there is a yellow box blocking everything.\n\n&gt;**LK** - How big is it? Can you see through it, like it was tint on the screen, or is it opaque? Can I remote into your machine?\n\n*When it comes to legal and accounting, the question of logging in was so they could start closing out confidential things while we started the process to remote in. They still have to approve it on their end and can kick us out anytime. Most lawyers didn’t actually care, it was their assistants and paralegals who would freak if we started logging in while they had so much as their email on the screen. I’ve seen who we were suing, who was suing us and knew the salary and bonuses of 5 different execs. It’s my ethics and honor that keep me from saying anything….but, you know. To each his own and all that jazz.*\n\n&gt;**Paralegal** - Yes, everything is closed. You can remote in now. It’s about 2 or 3 inches per side. Just a square, yellow box. It is sort of see through, but not really. I mean, I can see that it is lit up a little, but I can’t see anything behind it. Now that I look, I can barely see the mouse moving behind it, but I have to really squint to see it.\n\n*I remote in, there is no box. There’s nothing but a few icons and the desktop.*\n\n&gt;**LK** - I don’t see a yellow box.\n\n&gt;**Paralegal** - It’s right in the center. I’m not crazy. Here, I’ll put the mouse on it.\n\n&gt;**LK** - Nope. I got nothing. Maybe the cable to your monitor is loose. Can you try moving it around? Let me know if the box changes color or goes away.\n\n&gt;**Paralegal** - No. I jiggled both of the ones in the monitor and nothing happened. They appear to be attached pretty well. Can you just come to my desk and look at it?\n\n&gt;**LK** - Odd. I can, but you’re in Tower and I am in HQ 3 blocks away, it’ll take me a few minutes to get there. Can you take a picture of it with your phone and send it to me? *I really don’t want to walk over there b/c it is summer and the humidity is probably around 9 million by now*\n\n&gt;**Paralegal** - I can do that. Where should I send it?\n\n&gt;**LK** - Awesome! Send it to LK's Corporate email Address.\n\n*I wait patiently for the picture to come in. It does and I immediately know exactly what that yellow box is. Some of you might know by now too.*\n\n&gt;**LK** - Paralegal. I know what the box is. It’s a sticky note.\n\n&gt;**Paralegal** - Oh. My. God. I need coffee. Who puts a blank sticky note on a monitor in the middle of the day? LK, when you tell your co-workers about this, don’t be too hard on me.\n\n&gt;**LK** - I won’t.\n\n*We laughed a bit and hung up. Then I promptly told everyone what just happened. I left out her name so that I didn’t shame her. Of course, anyone who wanted could have just done a ticket search.*\n\n**TL;DR** - Post-It notes. They're not just for disabling mice.\n\n**EDIT:** I made up a fake name for my old company, and used the initials of that fake name as a fake domain for a fake email. Turns out that happens to be an actual domain for a very real law firm in SE Asia. What are the chances?",
        "created_utc": 1522679609,
        "upvote_ratio": ""
    },
    {
        "title": "The Sound of Servers",
        "author": "rusty0123",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88vk8e/the_sound_of_servers/",
        "text": "I have not posted here in a long while because, frankly, there are only so many post-worthy TFTS. Last night, a conversation about loud noises reminded me of this little gem featuring our favorite guy, $CTG. \n\n**For reference and timeline**       \n[Smoking Printer](https://www.reddit.com/r/talesfromtechsupport/comments/5vw4kq/smoking_gunerrrrprinter/)        \n[The Dell Game](https://www.reddit.com/r/talesfromtechsupport/comments/5v78m1/the_dell_game/)       \n--*Current Story*--        \n[A couple of shorts and The Blowup](https://www.reddit.com/r/talesfromtechsupport/comments/653vc7/how_to_apply_updates/)      \n[Farm Animals, aka The End](https://www.reddit.com/r/talesfromthejob/comments/5vzb17/farm_animals/)\n\n**Cast of Characters**     \n$CTG: Crazy Tech Guy       \n$Me: yep, me, the helpdesk leader      \n$Boss: my boss       \n$OSHA: OSHA guy\n\nAround this time I am in charge of our merry band of helpdesk techs. I've also been charged with crafting a yearly budget for hardware, which resulted in The Dell Game. During all this, I've been working on a couple of other things. \n\nOne was to get all our department in close proximity so that we can at least talk to each other. Something that may not matter in other departments, but is *very* helpful when you're doing tech support. \n\nBeing the red-headed stepchild that IT always is, we didn't have an assigned area of the building. Instead, we all worked in a cubicle farm used for admin assistants, interns, and temp personnel. Our cubicles were assigned on a first come, first serve basis. Whatever cubicle happened to be empty the day you started work, that's where you sat. Forever. \n\nI worked behind the scenes to get us all concentrated in one area. When a nearby cubicle came up empty, I'd get some admin person to let me change one of the techs seating assignment.  \n\nSo now we are all in one spot. We can share tools, set up some shared storage space, set up a software library, etc. All that good stuff.\n\n$CTG **hated** this. Before this he could hide in his cube. No one around him understood his job, so he couldn't be caught slacking. Now that all the people around did exactly the same job, his incompetence was glaringly evident. As was every time he disappeared for hours. \n\nTaking advantage of The Dell Game satisfaction of my boss, I lobbied for a couple of real, professional work stations. Made for IT. With KVMs and power strips. All the perks. \n\nI got it! Yeah!!\n\nThe only IT designated space we had was the server room. It was decided that was where the workstations were to be placed. Mostly because it was behind locked doors, so security. \n\nThis wasn't a problem. The server room was large by most standards. Think the size of a large living room. It had 3-4 server racks, a desk for doing log entries, and lots of empty space. \n\nWork stations are set up and we now had the capacity to work on 7-8 computers at a time. Plus no more tools and computer parts spread out in our cubicles. Everyone was pleased. \n\nExcept $CTG. Because now, not only was he absorbing passive disapproval for goofing off in his cubicle, getting noticed each time he disappeared, but other techs could look over his shoulder and offer advice when he actually decided to work. This could NOT happen! \n\n&gt;$Boss: You need to find out how noisy the server room is.        \n&gt;$Me: Ummm...it has servers. There's some computer noise, but it's a big room, and there's not that many servers.       \n&gt;$Boss: Contact our OSHA guy and find out what acceptable noise levels are. See if he's ever measured noise levels in that room. Find out if putting the new workstations in that room has increased the noise level.    \n\nI call the OSHA guy. He laughs at me. Noise levels have never been measured in that room. It's not necessary. You can tell by listening that the noise levels are no where near where safety levels need to be considered. \n\nBack to $Boss. \n\n&gt;$Me: OSHA guy says there's no need to measure noise levels in that room.       \n&gt;$Boss: We have to do it anyway. $CTG has filed a Worker's Comp claim. He says the noise levels have permanently damaged his hearing. He can no longer work in that room, so he can no longer do tasks at those workstations. \n\nBack to OSHA guy.    \n\n&gt;$OSHA: That is a complete waste of my time.       \n&gt;$Me: It has to be done.      \n&gt;$OSHA: Okay, you can borrow my equipment. I'll give you a quick training.      \n&gt;$Me: Fine. I guess.      \n\nWhich means that $OSHA taught me to use some cool tools. I spent a couple of hours learning how to use them, and I ended up with some minor certificate that says I know how to operate them. (Which also means that in the future I spent some time with the $OSHA guy helping out. Not bad. Not bad at all. I love learning new shit.) \n\nWhile this is happening, $CTG is back to slacking off. He refuses to enter the server room. He doesn't have access to tools, so he's basically only clearing paper jams and resetting passwords. He's shoving off any serious work to other techs. \n\nBack to the Boss. \n\n&gt;$Me: I measured the noise levels in the server room. Not anywhere close to concern. $CTG should be clear to go back to work. Here are the reports.          \n&gt;$Boss: Okay, I'll pass them on to HR.      \n\n......\n\n&gt;$Boss: $CTG has refused to return to the server room. He says it's not the noise level. It's the continuous exposure over time. Are there any OSHA limitations on that?       \n&gt;$Me: I'll check with $OSHA.     \n\n.......\n\n&gt;$OSHA: Are you fucking kidding me???        \n&gt;$Me: Nope.        \n&gt;$OSHA: (*sigh*) Okay. For that, you need to take readings every xx hours over xxx days. Plot them on a graph. Look for peaks and valleys. Use these algorithms to determine average noise levels. And use these charts to see if the noise levels go out of bounds at any point. \n\nSo now, I am randomly measuring noise levels at different times and recording them on a sheet. If I remember correctly, I had to do this for a couple of weeks. \n\nMeanwhile $CTG is slacking off....still refusing to enter the server room. \n\nI get all the testing done. Do the charts. Everything looks good. Turn it over to $Boss.     \n\nA few days later...\n\n&gt;$Boss: All the noise levels are fine. Worker's Comp has dismissed the claim.    \n&gt;$Me: So $CTG has to work in the server room again?     \n&gt;$Boss: Yes and no. He's now saying that no matter what the legal levels are, the noise in the server room interferes with his ability to work. The noise gives him headaches and earaches. He doesn't want to work in there.      \n&gt;$Me: (*hopefully*) Does that mean we can lay him off now?      \n&gt;$Boss: No.      \n&gt;$Me: Well...shit.       \n&gt;$Boss: Can we move some of the equipment around so that he can use part of it?       \n&gt;$Me: We could, but that would interfere with everyone's ability to do their jobs.       \n......         \n&gt;$Me: Since this is a comfort thing now, and not a legal thing, can we simply give him ear protectors?      \n&gt;$Boss: Go ask $OSHA if that's acceptable.      \n\n.....\n\n&gt;$OSHA: Yes, you can do that. I keep ear plugs in stock, but not ear protectors. You want some?     \n&gt;$Me: Can you keep us supplied?     \n&gt;$OSHA: Sure. I have these nice little boxes that are mounted outside any area that might need ear plugs. I'll just add one outside the door to the server room.       \n\nThe next day a box of ear plugs appear mounted to the wall beside the server room. \n\nYou would think that would be the end of it, right? But $CTG has to have one last try....\n\n$CTG still tries to pawn his work off to another tech, since he can't go in the server room. The tech tells him to use the ear plugs and do his own work. \n\n&gt;$CTG: I can't use those generic ear plugs. They hurt my ears. I need specially designed ones that will work for my super-special ears.      \n&gt;$Me: Oh, yeah? That's too bad. When do you think you can get those?     \n&gt;$CTG: Me??? The company needs to buy them for me. They are necessary for my job.      \n&gt;$Me: We've supplied you with perfectly acceptable, accredited ear plugs that everyone in the company uses. You are more than welcome to supply your own. Until then, use what's here.       \n&gt;$CTG: But they hurt my ears!     \n&gt;$Me: That sounds like a personal problem to me. I'd recommend you see your doctor.  \n\n\nThe ear plugs stayed mounted on the server room door. No one used them. $CTG went back to the server room. \n\n\n\n\n \n\n\n\n\n",
        "created_utc": 1522630715,
        "upvote_ratio": ""
    },
    {
        "title": "He couldn't have picked a more perfect time to walk in.",
        "author": "roguekiller23231",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88v0o3/he_couldnt_have_picked_a_more_perfect_time_to/",
        "text": "[removed]",
        "created_utc": 1522625685,
        "upvote_ratio": ""
    },
    {
        "title": "\"Oh, its not mine, so I didn't touch it.\"",
        "author": "TheN00bBuilder",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88uz8o/oh_its_not_mine_so_i_didnt_touch_it/",
        "text": "Got a real bad story. I was told to go out to a satellite office that's a good 30 minutes from the main office, to install !RemoteSoftware and a few !OldWashedUpCameraCompany security cams so we can see if they are really working. So I arrive, and the office is an absolute mess; all in disarray, conference room has all sorts of paper/documents strewn across it, dusty, smelly, a mess. And to think people from the public pass by and go inside it to do something very expensive nearly every day.  \n\nI cleaned up a little (it was OK'd and I got paid for it) and got to installing the cameras. One slight problem, no one knew the wireless password. I go to a back office where they have an overkill !Webtools router set up for the whole office, set up by a non-IT person. The person hadn't been there for 4 months due to an accident and was planning to come back sometime soon. Lots of dust on everything, and I see a !OverpricedAIO computer sitting wide open with some windows on it for failed updates and dead KB/mouse batteries, with its screen on. Here's how the conversation went with me and the person who mostly works at that office.\n\n&gt;**Me;** So the router is behind the PC? And have you touched the PC recently?\n\n&gt;**Person;** Should be there (it was indeed) and no, I haven't touched that PC. \n\n&gt;**Me;** How long has that PC been on then?\n\n&gt;**Person;** About 4 months.\n\n&gt;**Me;** *getting visibly angry* And you haven't shut it off? It has been running all this time?\n\n&gt;**Person;** Yes, and yes.\n\n&gt;**Me;** *now pretty angry* And you didn't bother to shut it off?\n\n&gt;**Person;** Nope, its not mine, so I didn't touch it.\n\n&gt;**Me;** *about ready to explode* You DO know, by doing that, you have cost the company about $200, right? If something stays up on a PC for a long time, it burns into the screen and will stay there forever.\n\n&gt;**Person;** Oh, I didn't know. Oops. (literally what they said, \"oops\" and all.)\n\n&gt;**Me;** *getting gradually redder and more angry* I can take it from here. Thanks.\n\nTurns out, yep. Screen burn was really bad, I could make out most of the text in the windows that were left up. And later I find out that it doesn't cost just $200, but $500 for a replacement panel alone.\n\nKill me.",
        "created_utc": 1522625246,
        "upvote_ratio": ""
    },
    {
        "title": "Why did you do that...",
        "author": "hotlavatube",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88twly/why_did_you_do_that/",
        "text": "[removed]",
        "created_utc": 1522615826,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do u know what Minecraft is?\"",
        "author": "blulitangel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88tppa/do_u_know_what_minecraft_is/",
        "text": "TL;DR: Yes, I know how to play minecraft. \n\nSo first off, I hope I qualify as tech support. I do a tiny bit of support at my day job when the normal support is overwhelmed, but I'm not full time or anything. In fact, this story didn't even happen at my job.\n  \n  \nA little bit of background...\nA number of years back when Windows 10 and UWP first came out, I wrote a small flipbook-style app to get familiar with the platform. I listed it for $0.99 and, between normal installs and too many free promotions, managed to make about $100 off of &gt;1,000 installs. And then it sat as I moved on to other things. Fast-forward a few years to just about a half-year ago now and I decided it was time to update the thing. The old version was very outdated, and I'd learned enough about the platform that I felt I could make the update worth my time. So I did. I also made the app free. And people seemed to like the update. Until a week ago.\n  \n  \nThere's an issue I've been seeing crop up which causes the app to crash. As far as I can tell, it's a problem with how Windows handles files, and I haven't yet found a workaround. It's not a really frequent issue, but frequent enough to be worrying. And I finally got hit for it by a bad review. Fair enough.\n  \n  \n$Frodo = reviewer\n  \n  \n$Frodo's review (not sic): \"I was drawing and making a picture of a Xbox 360 and fighting and it blew up and the guy flew into space saying FUUUUUUUUU and then the app crashed and my drawing was lost fix your bull\\*\\*\\*\\* blulitangel!!!\"\n  \n  \nOk, I can get that it's frustrating to lose your work. However, this read an awful lot like other fake reviews I've seen. I can't really say what exactly about it sounds fake, you just learn to tell, I guess. No matter, I've made a habit of responding to any review under 5 stars, offering support if needed or asking for any suggestions that could make it 5 stars for the user. So I responded: \"Hi $Frodo, so sorry to hear about the crash! It's frustrating when work is lost like that! If you send an email to me@email.com, I'll do my best to help see if the files are recoverable.\" The thing is that if the user saved the project at any point, the files should still be on disk and recovering them not a problem.\n  \n  \nI didn't expect a reply. I've never, in the years I've been responding to reviews, gotten a reply. But this time I did. I was sound asleep when, in the middle of the night, I got two emails:\n  \n  \n$Frodo: \"It's alright! 😊❤😆\"\n  \n$Frodo: \"Whats ur phone number btw? i know your email but not ur phone number.\"\n  \n  \nWhen I woke up and saw the emails I wasn't quite sure what to think or what to reply. I thought about it for a while and finally decided to just press ahead with trying to recover $Frodo's files.\n  \n  \n$blulitangel: \"Hi $Frodo, &lt;Explained the issue and that the files may be recoverable if he'd saved the project at all.&gt; Unfortunately I'm not comfortable handing out my phone number, as I'm sure you can understand.\"\n  \n  \n$Frodo: Subject: \"??\", Body: \"Do u no what Minecraft is?\"\n  \n$Frodo: Subject: \"???\", Body: \"What's your YouTube channel??????????????\"\n  \n$Frodo: Subject: \"I never saved I was working on my drawing.\", Attachment: A selfie of what I'd say is a 7-10 year old boy sitting in what looks like a car.\n  \n  \nBy now I'm getting a little.... concerned. I decided to just ignore the first two emails and try to wrap up the conversation.\n  \n  \n$blulitangel: \"Unfortunately if you did not save the project then the files were never written to the disk. I apologize for the headache! I'm doing my best to figure out a workaround for the crash.\"\n  \n  \n$Frodo: \"💞💞💞💞💞💞\"\n  \n  \nNeedless to say, I did not respond to that. I'm hoping that's the end of the conversation, but somehow I'm not quite sure it is.\n  \n  \nI don't mind saying I'm now just a little leery of encouraging people to contact me...",
        "created_utc": 1522614159,
        "upvote_ratio": ""
    },
    {
        "title": "I'm disabled",
        "author": "MangKanorLord",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88rkvp/im_disabled/",
        "text": "[removed]",
        "created_utc": 1522596699,
        "upvote_ratio": ""
    },
    {
        "title": "The exchange server is down...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88rdpl/the_exchange_server_is_down/",
        "text": "[removed]",
        "created_utc": 1522594960,
        "upvote_ratio": ""
    },
    {
        "title": "Extra Help",
        "author": "bronzephoenix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88prbv/extra_help/",
        "text": "This tale takes place many years ago back when I was doing contract work and got job to help with pc refresh. The job started off easy enough with each of us being paired up with another temp given list of users, shown location of new dell pc’s we were to install and told to document old pc and new one we installed. So we start off meeting our first client , back up their data, delete the operating system &amp; all data, pack up old pc , install the new pc , install their data, drop off off pc to storage then onto the next user. Everything seem to be running smoothly until we all get call to stop what we doing just after lunch and immediately report to help desk. We then get asked who did user “bob” . Later I find out that one of other temps had gone to where bob was located deleted the data and operating system before someone said that not “bob “ pc he sits in desk next to it. Now did they do logical thing call help desk for emergency recovery, nope they left computer as is without operating system and started on “bob” pc finished his computer then went off to next person. User comes back from lunch and goes off on help desk for having no pc or data they were working on. For some reason they weren’t onsite for 2nd day ",
        "created_utc": 1522575838,
        "upvote_ratio": ""
    },
    {
        "title": "\"I just received an email that there is an outage. Does that mean there's actually an outage?\"",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88n8i2/i_just_received_an_email_that_there_is_an_outage/",
        "text": "I haven't posted here in quite awhile. Life happens. What happened tonight was so stupid that it must be posted. For those who don't know, I work as a tier 2 rep for an ISP.\n\n\nEssentially, there was a fairly small outage which took down a couple offices. It was escalated and I sent an email to everyone in our company:\n\n\n&gt; Hello, there is an active investigation regarding a small outage at *Office 1* and *Office 2*, please do not submit tickets for these offices. \n\n\nI then receive the following reply from Moron:\n\n\n&gt; Hi, u/devdevo1919. I just saw your email about an outage at *Office 1* and *Office 2*. Does that mean there's actually an outage?\n\n\n*facedesk*\n\n\n&gt;Hi Moron. There is an outage, yes.\n\n\nInternally: No, I just wanted to advise everyone of an outage because I get fun out of it. I find it entertaining. I'm sure our customers do too.",
        "created_utc": 1522545065,
        "upvote_ratio": ""
    },
    {
        "title": "The beeping never stops!",
        "author": "storyb00k",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88l47e/the_beeping_never_stops/",
        "text": "[removed]",
        "created_utc": 1522525341,
        "upvote_ratio": ""
    },
    {
        "title": "From the Dark Screen (or when a User isn't worth the effort)",
        "author": "mf9769",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88ite3/from_the_dark_screen_or_when_a_user_isnt_worth/",
        "text": "Story from my current job, main IT at a medical facility. This one comes to me secondhand, from one of our $crappyEHR vendors' trainers/helldesk techs, regarding his attempt to show one of our physicians how to use $crappyEHR. We were switching over from paper charting to EHR at the time.\n\nCharacters:\n\n$trainer - our luckless hero, assigned by his company to remotely train doctors in EHR use. He was not ready. Great guy and the only one at $crappyEHR that knows what he's doing. \n\n$doc - one of our physicians. He'd been working there before they decided to switch to an EHR. An older guy (though not too old...late 50s at the time). Has a Russian accent. Brilliant diagnostician, but is totally computer illiterate, and, what's worse, has absolutely no interest in learning how to use one.\n\n\n\n$doc needed a lot of help getting the remote connection started. In retrospect, this should have been a warning to $trainer. \n\n$trainer - Hello Doctor, my name is $trainer. We'll be learning to use $crappyEHR. \n\n$doc - mhm. uhuh.\n\n$trainer proceeds to spend an hour showing the $doc how to use $crappyEHR. Every 5 minutes, $doc would say \"mhm\".\n\nThe time finally comes for $doc to do his own test case, so $trainer asks if he's ready. \n\n$doc - No. Can you show it to me again?\n\n$trainer - Sure. What part?\n\n$doc - From the dark screen.\n\n$trainer - (Not believing what he just heard) I'm sorry, you broke up a bit there. Can you repeat that?\n\n$doc - Well, from the dark screen. You know: the. dark. screen. How do you turn it on?\n\n$trainer - hold on doctor. \n\n$trainer proceeded to call my at-the-time boss, and they decided that training $doc wasn't worth the effort, proceeding to allow him to dictate his notes into a medical transcription system (no...not Nuance Dragon. That would have confused $doc even more, because it involved clicking or telling the computer to move on to the next section. There's an actual person who listens to the recorded dictations, transcribes them and then uploads them into the EHR).\n\nSome users...well, they're just not worth turning into users in the first place.\n",
        "created_utc": 1522505026,
        "upvote_ratio": ""
    },
    {
        "title": "Asking for help and being rude: DENIED",
        "author": "Scumbag_Lemon",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88iffm/asking_for_help_and_being_rude_denied/",
        "text": "[removed]",
        "created_utc": 1522500760,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sure this email will find its way on its own...",
        "author": "4Elephants",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88hnk3/im_sure_this_email_will_find_its_way_on_its_own/",
        "text": "Hi there,\n\nSo I work for a small company in databases/applications ; let's call my company \"Oignon Inc\" for now on.\n\nI once had an old customer calling me to discuss what went wrong on his application.\n\nWe had a long talk, as he was not really a computer person ; as he seemed to have a long list of things to change in his application, I just told him to send me an email with the list of things to change. He has been our customer for quite a while, so I assumed that he had my email address.\n\n2 days later, the guy phones again. He doesn't understand that I didn't replied. I tell him that I never got his email.\n\nTurns out he didn't knew my name, just my first name (Vincent). So this guy just sent his email to :\n\n\"vincent.?@oignoninc.com\", and believed that the mail would eventually get to me.\n\nEdit : formating",
        "created_utc": 1522489473,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want to see your bathroom",
        "author": "IAmManMan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/88dh7q/i_dont_want_to_see_your_bathroom/",
        "text": "LTR, FTP, mobile format etc.\n\nI work second line software support. I'll avoid saying what exactly our software does but if I told you next week is our busiest week of the year you may get an idea.\n\nRecently our industry had a small change made to our process which required us to issue a hotfix for the software in order for people to keep using it. It's fairly idiot proof, you download a zip file from the website, inside is an exe. Double click, done. \n\nIt's been up for a few weeks and there's been no big issues with it. Couple of people needed guidance on where the download could be found but that's it.\n\nBut yesterday a first line tech came to me with an issue is never heard before. \n\n1L - First liner\nM - Me\n\n1L: \"Hey ManMan, I have a customer on the line who has a problem with the hotfix. When they open it instead of the hotfix they get 40 pictures of bathroom tiles and bathroom floor plans. No I'm not joking\"\n\nM: \"... sorry, say that again?\"\n\n1L: \"Bathroom pictures. Instead of the hotfix\"\n\nM: \"They have the right link?\"\n\n1L: \"I've watched them on Teamviewer. They've downloaded it like 3 times. Every time the same.\"\n\nM: \"I have to see this\"\n\nOur first line is pretty good when it comes to the software and the industry but are sometimes not that technical. I trust, but I verify. To save time I wheel round to 1L's desk and watch the process myself.\n\nIt's normal, the link is right. The file downloads and then instead of an exe I do indeed see 40 pictures of mostly black and white chequered bathroom tile and some floorplans.\n\nThere is a moment of panic that spreads between myself and a small group of 2nd liners who had overheard the issue and gathered.\n\nM: \"Can someone check the hotfix download please?\"\n\nThis hotfix is pretty much mandatory. We have thousands of clients and most have downloaded it in the last few weeks but there are plenty of stragglers. If someone had messed up the file and put their bathroom plans up instead the exposure would be massive and embarrassing for the company.\n\nFrom the 2nd line bank I can hear people calling out \"works for me!\" and managers calling the hosting team.\n\nRight as they get someone on the line I spot something in the bottom of the chrome window. The downloaded zip file, but the logo seems wrong. It's not a 7zip or zip icon. It's red and different.\n\nI pull up the file associations in control panel and there it is. Zip files are associated with a random photo gallery style program that looks close enough to a file explorer menu that none of us noticed on first glance, so distracted we were by the tile.\n\nTurns out this image editor was failing to open the hotfix and instead showing a window with all of the recently opened files in it. The poor customer didn't know her colleague had been planning a bathroom redesign on her pc.\n\nI set the association back to file explorer and all became right with the world. Nearby a manager said \"nevermind\" and hung up the phone.\n\nTwo banks of desks breathed a sigh of relief.\n\nTLDR: Customer thinks a vital hotfix has been replaced by bathroom pics. The service desk stops breathing until we find out it's just the digital equivalent of trying to eat soup with a fork.\n\n",
        "created_utc": 1522441803,
        "upvote_ratio": ""
    }
]