[
    {
        "title": "The Municipality: Part 4 - The Second Corner of the House of Troubles",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zz8dfw/the_municipality_part_4_the_second_corner_of_the/",
        "text": "Hello everyone! Here is the next story from my job at the municipality.  In this one, I get to deal with a bunch of engineers and inform them about how they are not geographers.  All of this is from the best of my memory along with some personal records, and a lot that comes from rumors, gossip, and other people.  However some things are relatively recent, so any inaccuracies are entirely on me.  Also, I don't give permission for anyone else to use this.\n\nTL/DR: The drive!  The power!  The skills!  The motivation!  The power, again!  The fortitude!  The strive!  The ideals!  The list of attributes!\n\nFor some context, I am not in IT; rather, I'm a GIS (Geographic Information Systems) professional. This particular world is quite small, so I will do what I can to properly anonymize my tale. However, for reference, all these stories take place at my job at a municipality in the American South. Here is my Dramatis Personae for this part:\n\n* **$Me**: Masterful erudite.  Also me.\n* **$OldCM**: The old city manager.  She was pretty awesome and did a lot of good, but had to navigate through the miasma of \"good-ole-boy-ism\" pervasive at the time.\n* **$BigBoss**: The boss of the division I work at.  Very chill, easy-going, but likes things to work.\n* **$EngCo**: Contracted civil engineering company.  Did very good engineering work.  Did terrible GIS work.\n* **$CADGuy**: The AutoCAD manager at $EngCo.  An absolute whiz at AutoCAD but not great at GIS products.  Very nice guy, I liked him quite a bit.\n* **$SurveyEngineer**: The engineer in charge of the surveying teams.  Enthusiastic, boisterous, and not the smartest.\n* **$BigEngineer**: Primary engineer working on our contract.  Cocky, overconfident, and pretentious.  Thought he knew everything about GIS.  We'll see how that pans out &gt;:D\n\nSo I have read countless stories from you all about having to deal with folks in the highest echelons of professions that require a great deal of education and expertise.  Generally speaking, your interactions come in one of two flavors; either the professional is very nice and easy to get along with; or they are the most entitled sort of diva imaginable that cannot be wrong in *anything*.  There never seems to be anything in between.  I tend to group the worst offenders into the \"Four Corners of the House of Troubles\" - namely, Doctors, Engineers, Lawyers, and Professors.  Unfortunately for me, I've had the pleasure of working with each of them.  Some of my interactions have been very positive.  Most, however, have not.  Today we'll talk about the second corner - namely, Engineers.\n\nFor whatever reason, most engineers I have dealt with (mostly civil engineers) are extremely dismissive of GIS.  They don't hold the software in high regard and seem to view us GIS professionals with disdain (particularly the engineers from smaller firms).  More to the point, in numerous situations, these civil engineers seem to think that they know vastly more about geographic science than they actually do.  I really don't understand why this is.  Every one of my peers that I have spoken to (in my line of work) have reported the same types of interactions.  I've read some articles online to try and figure out why this is; one of the most compelling arguments I found was that many engineers view GIS software as sort of the \"little brother\" to AutoCAD - which is the \"*real*\" suite to be used for digital representation.  After all, it can be pretty difficult to draw minute detail in ArcGIS, and engineers can't really use \"drawings\" in GIS that are within a tolerance of +/- 2 ft, can they?  Furthermore, engineers are the ones trained to use *real* math and science in their work.  And engineering is by far the more prestigious field of study.  Anything else is substantiatively pedestrian.\n\n**Ahem**.\n\nMy feelings aside, let's talk about this, shall we?  Engineers that regard GIS software as an \"imprecise drafting program\" are committing the original sin - they are using the program for a purpose which it wasn't designed.  Like trying to trim your beard with a lightsaber.  You can do it, but you have to be extremely skilled to do so, and don't come complaining to me that you cut your head off.  When looking at something on a scale equal to the whole United States, +/- 2 ft is a literally insignificant rounding error - and distance is always relative to start with.  Civil engineers *really* don't like me saying that.  They also don't understand database management or attribute association.  A flattened PDF with a picture of an Excel table is not a \"database.\"  And if I get one more as-built from a developer that states it is on the \"Mean Sea Level Datum,\" I'm going to have an aneurism.\n\n/endrant\n\nOur story begins about 25 years ago.  Back in those halcyon days, the municipality was rife with agreements that were predicated \"on a handshake.\"  *Just some good ole boys, never meanin' no harm...*  In this situation, an \"understanding\" was reached with a local engineering company, **$EngCo**.  This company would become our \"firm of record\", meaning they would get first pick on any of our engineering projects and in some cases we would simply provide work to them directly without competitive bidding at all.  I think the original point was to just have some consistency in what we were receiving from our developers.  After all, having a private company doing all our work with no competition and no accountability has never proven troublesome to anybody else, right?  I think you can all see where this is going...\n\nLet me just point out that, despite the setup here, there are actually a lot of folks to like at **$EngCo**.   \n They honestly do have a lot of very intelligent, educated people working for them.  And the company is made up of many local citizens of the municipality - folks that, by and large, want to make sure things work out alright for their home.  The problems have only arisen when the company attempts to reach out and take on work that is outside their expertise.  And unfortunately, they view GIS as within their wheelhouse.  It is resoundingly *NOT*. surprisedpikachu.png\n\nThe first example occurred about 15 years ago.  At that time, the city had inherited a private utility system.  **$BigBoss** had just been hired and wanted to make sure that we had good locational information since the private company's records were atrocious (after all, we took them over because they couldn't pay their bills).  With this in mind, he set up an RFP (Request For Proposal) for a locating project and then sent it out for competitive bids.  **$EngCo** sent him a one-page summary of what they would do; clearly, they didn't give it much thought since they figured they'd get the bid as a matter of course.  Numerous other companies sent in bids as well, though, and each was substantially more detailed than **$EngCo**'s.  Several even came on-site and showed **$BigBoss** what they could do!  **$BigBoss** was particularly impressed with one of the outside companies.  They were able to do some excellent GIS work and for a lower cost than **$EngCo**!  So he recommended that the city go with this company instead.\n\nHOLY CRAP, the sh!tshow that ensued.  One of the primary engineers from **$EngCo**, a blustery guy we'll call **$BigEngineer**, showed up at the city council meeting where this was being decided and tore **$BigBoss** a new one.  He called **$BigBoss** every name under the sun, told the council that there was no reason why their company should have been passed up for this, and that this was unacceptable considering their relationship.  **$BigBoss** genuinely thought he was going to lose his job.  Eventually, though, the director of utilities at the time (**$BigBoss**'s boss), who was just as big of an a$$hole as **$BigEngineer**, told the council that he trusted **$BigBoss**'s decision and that was that.  The city eventually went with the external company instead of **$EngCo**.  Clearly, the city's council meetings back then had far less discussion and far more urine-spraying and chest-pounding than meetings today.  There are still stains on the floor.\n\nAnyways, you can see how this sort of soured the relationship between **$EngCo** and the municipality generally (and **$BigBoss** specifically).  However, it would take a few years for something of this magnitude to raise its head again.\n\nAbout five years later, the municipality decided to do a major refurbishment to the utility lines in the oldest section of the city.  This was an enormous project - probably the largest in our history (to point out, the cost of the project was like five times the city's annual budget!)  As could be assumed, **$EngCo** got the contract to design and build everything.\n\nTwo years into the project, **$BigBoss** had a discussion with **$OldCM**.  **$BigBoss** wanted to make sure that we could get good GIS data from this massive project - if we could get it on the front end while the assets were being put into the ground, that would save us an ungodly amount of work in the future.  **$OldCM** agreed, so she went to **$EngCo** to try and get this set up.  Let me say that **$OldCM** did a tremendous amount of good for our city in weeding out the corruption and inefficiencies that had been piling up for decades.  Yet despite this, she still tended towards certain \"gentleman's agreements\" whenever there was no other clear way.  Her discussion with **$EngCo** fell into that category.\n\n**$OldCM** spoke with **$EngCo** and they created an amendment to the standing contract.  The amendment stated that the city would pay **$EngCo** several hundred thousand dollars to collect GIS information about the new assets being put in.  There was a severe lack of understanding as to what was being requested by both parties when this happened, however.  **$EngCo** didn't really understand what \"GIS information\" really meant.  And at the time, the city didn't have any professional GIS capability either, so **$OldCM** didn't know what to ask for.  Seriously, I read the \"scope of work\" years later; the only statement that brought up GIS at all read as this:\n\n&gt;&lt;$EngCo&gt; will provide GIS data for all &lt;asset&gt; locations to be used by the Utilities Department.\n\nThat was it.  No indication of attribute data that would need to be collected, no information on schemas or who it would go to, nothing even on the file format that it had to be provided in.  Managers tossing buzzwords.  Nothing else.  Ugh.  And because this was, basically, a \"gentleman's agreement\", **$OldCM** wrote the addendum herself and signed it without needing to get the council or anyone else involved.  *Seems legit*.  **$BigBoss** didn't even know the details about it until years later when I unearthed it while investigating everything.\n\nAnyways, I was hired by the municipality during the latter stages of this refurbishment project.  As things were wrapping up, **$BigBoss** tasked me with making certain that all the appropriate GIS data had been collected; the engineering firm wanted to confirm that all the punch list items were completed so they could say that the project was finished (and get paid, of course).  So I got started looking into everything.  Holy sh!t, y'all.  If this would have been a quest, it would have had a skull on the level requirement.  \n\n*I donned my fedora and ventured forth into the filing cabinets from another age.*\n\nThe first thing I did was ask to see where the directive was for the GIS aspects of the project.  Nobody knew where the signed agreement was.  I started looking for it but it would take months before I was able to finally locate it.\n\nIn the meantime, it was my understanding that \"GIS data\" by its very nature included attribute information with the features so provided.  So I reached out to **$EngCo** with a fairly simplistic schema - a list of fields that I thought they'd be able to easily provide using the information already collected.  Simple stuff like the diameter of the pipes, what they were made out of, what types of valves were in place, so on.  I only asked for about 3-5 fields for each type of feature, and only asked for about 5 features.  When I got on the phone with the staff at **$EngCo**, the response was as follows:\n\n&gt;**$BigEngineer**: Sure!  Let me write up a scope of work and get you a quote, and we'll get right on that.\n\nWait a minute - wasn't this covered under the scope of work we already had?  If wasn't, why not?  I immediately told **$BigEngineer** to hold it because I wanted to get to the bottom of this.  If the company wasn't providing information like what I asked for, what exactly were they giving us?  As can be assumed, **$BigEngineer** didn't know.\n\nSo while I waited for more information to try and find the original scope of work, I set about attempting to decipher what exactly it was that **$EngCo** was doing.  My next detour took me to the teams out in the field performing the surveys on all the new infrastructure going into the ground.  One of the city's field crew members invited me to head out and speak with them.  The teams were headed by an obnoxiously loud guy we'll call **$SurveyEngineer**.  When I arrived in the field with them, they had a GPS survey system set up and were fiddling with it.  Our very first conversation went something like this:\n\n&gt;**$SurveyEngineer**: Alright!  Here's how we've been getting positions for everything in this entire project! Watch out cuz *we're gonna blow your mind*! (I don't remember his exact words, but this guy actually said something like that - I was already in a bad mood about all this and it just pushed me over the edge.  Also, WTF?)  \n&gt;  \n&gt;**$Me**: (completely nonplussed) Yeah, I know how a GNSS (Global Navigation Satellite System) unit works.  I'm not really worried about that.  What I am far more concerned about is the attribute information are you collecting.  \n&gt;  \n&gt;**$SurveyEngineer**: (deflated) Oh.  \n&gt;  \n&gt;**$Me**: Are you collecting anything about the assets when you put them in the ground?  Size?  Manufacturer?  Model?  Anything else?  \n&gt;  \n&gt;**$SurveyEngineer**: Uh... we get the coordinates and then send them on.  \n&gt;  \n&gt;**$Me**: I'll take that as no, then.  Where are you sending the locations?  Is it going to an enterprise server?  ArcGIS Online?  Something else?  \n&gt;  \n&gt;**$SurveyEngineer**: Um... no, it all goes to $CADGuy, I think.  \n&gt;  \n&gt;**$Me**: (incredulous) Wait, this is being sent to AutoCAD?  You can't be serious.  Who is handling your GIS intake and asset management?  \n&gt;  \n&gt;**$SurveyEngineer**: Uh... I don't know what that means.  \n&gt;  \n&gt;**$Me**: Do you have any professional GIS expertise at your company at all?  \n&gt;  \n&gt;**$SurveyEngineer**: Um... we have $CADGuy.  \n&gt;  \n&gt;**$Me**: (swearing under my breath) You've got to be kidding me.  Well thanks for your time.  That tells me all I need to know.\n\nYes folks.  We were paying hundreds of thousands of dollars to **$EngCo** for GIS services - *and this company did not have a single GIS professional on staff*. \\*facepalm\\*\n\nEventually, after going through rabbit hole after rabbit hole, I managed to find the original GIS addendum to the project.  As I mentioned above, this was the first time **$BigBoss** had ever seen the details.  By all accounts, it looked like there were basically no requirements laid upon **$EngCo** whatsoever in the data they provided to us.  They could give us almost anything they wanted and we'd have to accept it as fulfilling what we'd paid for.\n\nAfter dozens of phone calls and pouring over all sorts of documentation, I was eventually able to provide a definitive answer for the rest of the city on what **$EngCo** was doing regarding all this.  It had become clear to me by this time that the company had no comprehension of what GIS actually was.  They had conflated the terms \"GIS\" (*Geographic Information Systems*) with \"GPS\" (*Global Positioning System*) in the original agreement, and thought that all we wanted was very accurate locational data.  The worst part about this was that we actually required coordinate information any time someone submitted records to us - in essence, we had been paying them the better part of a million dollars *for data they were supposed to give us anyway*!  Jesus.  I worked extensively with **$CADGuy** to try and get the output information in a way that I could use easily.  **$CADGuy** was awesome, and he really did all he could to help, but he was not a GIS professional.  He didn't even have the software he needed to convert things.  All he could get me were AutoCAD .dwgs and an Excel spreadsheet of the asset tags with coordinates.  The AutoCAD data didn't have the tags associated with any of the geometries, so it was essentially useless.  Eventually, when the leadership of the city came to me and asked if **$EngCo** had fulfilled what they were supposed to do with this GIS data, I had to report that yes, they had, simply because we'd never told them what to fscking do in the first place!!!\n\nWe paid close to ten times my yearly salary for an Excel file with three columns.  So that was fun.  **$BigBoss** was not pleased.  I was not either.\n\nA short time later, I pitched a GIS support services contract to **$BigBoss** and the leadership of the city.  If you'll recall, I was originally hired to help the city establish a GIS architecture.  Bringing in the utilities assets was a huge part of that.  Having some additional professional help could bring us closer to that goal.  I'd met some reps from a GIS firm at a conference the previous year; we'd been working with them on a time-and-effort basis and I wanted to solidify everything into a full-time contract.  Due to the way the contract was structured, it was more of a \"*hire who can do the work*\" than a \"*get the lowest bidder*\" type of thing, thus I had a little more freedom in who I could choose.  As soon as **$EngCo** got wind of it, though, they demanded a meeting with me.\n\nA few days later, I had an ornery **$BigEngineer**, a tired-looking **$CADGuy**, and a couple of other engineers from **$EngCo** in my office.  I think they may have been wary to be too pushy with me - there had already been a lot of acrimony between the company and the city by this point and it was only growing (major cost overruns during the utility refurbishment project as well as past backdoor dealings).  However, it was also clear that **$BigEngineer** wanted to show that my GIS work was something that **$EngCo** clearly *could* and *should* do.  He started off by saying that they had a lot of experience with our system (completely true), that they had finally gotten with the times and had \"ArcMap\" (which was already on its last update and slated for EOL), and that they could provide us with any GIS services we needed (not true).  Y'all, I could have just said \"Thanks, we'll let you know if we decide anything\" and just waved them out of my office.  But I know what is required to do good GIS work.  I take pride in what I do.  This guy - and this company - could not produce the kind of quality work that would have been acceptable to me.  And if I didn't stop this now, we would keep getting these pitches in the future until, at some point, somebody would make a bad decision and hire them for this kind of stuff once more.\n\nAfter **$BigEngineer** said that they could provide us with anything else we needed, I looked at him and shook my head.\n\n&gt;**$Me**: I'm sorry.  I hate to point this out, but I have to disagree.\n\nThe first person to react was **$CADGuy** \\- his eyes shot open and his face slowly pulled up into a smirk, probably the first time I'd ever seen him truly liven up.  I am certain he's had to deal with more than one ridiculous request from his bosses and liked seeing someone turn it around on them.  **$BigEngineer**'s face, however, turned into a mask of shock, the image you'd expect a petulant man-child that has not been told \"no\" enough in his life to have.  For a moment, he didn't respond, then turned red and accusingly blurted out something to the effect of \"What are you talking about?\"\n\nSo I *informed* him &gt;:)\n\nI brought up all the issues we'd had with the previous project.  I brought up that they had no professional GIS staff or support of any kind.  I brought up that AutoCAD is not GIS, and trying to shoehorn CAD personnel, procedures, and information into a GIS framework is a terrible idea and clearly did not work (**$CADGuy** quietly smiled at that).  I brought up that they were trying to tout an old GIS software suite that was scheduled to be retired as being \"*up with the times*.\"  I brought up that they had conflated GIS and GPS in the past, as evidenced by the people that had crafted the project addendum.  I also said that those same people seem not to have understood basic concepts about GIS such as schemas, data type requirements, or projections.  **$BigEngineer** started off trying to counter each point, but as I kept going his mouth started to hang.  It was clear that he didn't understand most of what I was saying.  And I didn't give him much time to interject.  I can be passionate when I want to be, particularly when it is something that I think is important.\n\nAt the end of it, I remember (mostly) what I said:\n\n&gt;**$Me**: This isn't an issue of dedication or effort or anything like that.  You all have plenty of that.  This is an issue of lack of depth in this field.  In fact, there is so little depth here that I don't think you are able to fully appreciate it (something like that, I paraphrased Dunning-Krueger on this guy - he didn't get it).  If you take meaningful change on this - contract with a professional GIS firm, hire GIS personnel, become an Esri partner, something similar - then I might reconsider my position.  Until that happens, I'm sorry, we're going to have to go with other options for our GIS services.\n\n**$CADGuy** gave me a wry look and seemed to half-nod, as if to say \"*Yep, that's about right*.\"  All the other people in the office turned to **$BigEngineer**.  Some of them had half-smiles on their faces too.  **$BigEngineer** was still staring at me, sort of fishmouthed.  He didn't say anything for a while.  His face was hard to read.  I didn't know what was going on in his head.  Was he so pissed off that he couldn't think of anything to say?  Was he still processing all the stuff I'd said to him earlier?  Was he just so shellshocked to have someone tell him that he didn't know anything about a subject that he couldn't speak?  No idea.  In my mind, though, it seemed to me that the look itself was enraged confusion.  It was glorious.\n\nIn that moment, though, I actually felt a twang of fear - would calling the company out like this threaten my job?  After all, **$BigBoss** thought he'd nearly gotten fired for tangling with this same guy years ago.  But then I realized that everything I'd said was actually true (and I had the evidence to back it up), I'd never been unprofessional and outright insulted them, and they were on the city's sh!tlist anyways.\n\nA very awkward silence ensued, after which I said \"I think we're done here.  Thank you for stopping by.\"  After some perfunctory goodbyes, they all filed out of my office.\n\n**$EngCo** hasn't bothered the municipality about anything GIS-related since.  I was able to go with the company we'd been working with previously, and we've gotten a ton of good work out of them.  The whole concept of \"firm of record\" went away shortly after this as well.  The new administration of the city was tired of having all these backdoor deals in place.  They went on a spree to redefine or renegotiate every existing contract for the whole municipality.  **$EngCo** has had to compete against a number of other engineering companies for standing work ever since, and they've lost several bids.  And obviously, we haven't paid them for any further GIS work whatsoever.\n\nI've seen **$BigEngineer** at numerous local industry events since all this.  He has avoided me each time.  No big loss there.  And I will always have the image of his confused face gloriously seared into the back of my memory for the rest of eternity :D\n\n&amp;#x200B;\n\nThanks for reading, everybody! I'll have another story up as soon as I can! And here are some of my other stories on TFTS, if you're interested:\n\n* **The Municipality Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/zvn6e9/the_municipality_part_1_the_plotter/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/zwwnwe/the_municipality_part_2_the_database/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/zxt8di/the_municipality_part_3_trois_nouvelles_nouvelles/)\n* **The Agency Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/sh5m55/the_agency_part_1_the_chaos_begins/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/si0d1y/the_agency_part_2_the_reign_of_badmike/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/sivnc3/the_agency_part_3_the_lawyer/) [Part 4](https://www.reddit.com/r/talesfromtechsupport/comments/sjs025/the_agency_part_4_an_avalanche_of_accountability/) [Part 5](https://www.reddit.com/r/talesfromtechsupport/comments/sknt9k/the_agency_part_5_dont_let_the_door_hit_you/) [Part 6](https://www.reddit.com/r/talesfromtechsupport/comments/sljw99/the_agency_part_6_the_ballad_of_the_bosses/) [Part 7](https://www.reddit.com/r/talesfromtechsupport/comments/smeb69/the_agency_part_7_farewell_adieu_auf_wiedersehen/) [Part 8](https://www.reddit.com/r/talesfromtechsupport/comments/sna2uh/the_agency_part_8_epilogue/)\n* **A Symphony of Fail** [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/rmasuq/a_symphony_of_fail_part_1/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/rnmk82/a_symphony_of_fail_part_2/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/robtwl/a_symphony_of_fail_part_3_finale/)",
        "created_utc": 1672426648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacement hell",
        "author": "wilsy53",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zys21l/replacement_hell/",
        "text": "[removed]",
        "created_utc": 1672377948,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Municipality: Part 3 - Trois Nouvelles Nouvelles",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zxt8di/the_municipality_part_3_trois_nouvelles_nouvelles/",
        "text": "[removed]",
        "created_utc": 1672281453,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between working at a traditional business vs working with people who should know what they are doing",
        "author": "questioner2344",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zxn7jh/what_is_the_difference_between_working_at_a/",
        "text": "[removed]",
        "created_utc": 1672266725,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is her world and we are all just living in it.",
        "author": "MajesticMango56",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zxha6x/this_is_her_world_and_we_are_all_just_living_in_it/",
        "text": "[removed]",
        "created_utc": 1672252858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multi mode is better than Single mode fiber, because Multiple options are good, duh!",
        "author": "lincolnjkc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zxb8c9/multi_mode_is_better_than_single_mode_fiber/",
        "text": "I'm an odd duck (aren't we all) -- where in any given day/project I might be designing/implementing/supporting installed AV/automation, mid-scale broadcast/streaming, or almost anything IT except end user compute... And one of my favorite things is translate between the groups. \n\nAnother thing I've learned in 17 years of doing this full time is most IT people have no real clue about anything AV/broadcst-y but will usually admit it, AV people don't get broadcast (but usually aren't that dangerous) and really don't get IT (but will do some really stupid things if you don't watch them carefully), and full-time broadcast people scare me because they're going to get the show on the air regardless of how many things need to be gaff taped together in unholy ways... It may only work for an hour but it's going to work or that hour, damn it. And woe be to anything (or anyone) who gets in their way.  \n\nAnyway, currently working on a new construction project with a total budget in the neighborhood of US$200m with a lot of AV and a fair proportion of installed broadcast infrastructure. This is a client who has standardized on single mode fiber; I think last I counted they were using 4 strands of MM, *in total, across their HQ campus* for one odd legacy thing ...broadcast gear de facto wants SMF. We specified only SMF for broadcast ties; the RCDD for the data/telecom side specified only SMF for all of the in-building and cross-campus fiber interconnects (nothing like having a ~400-strand ring available for your needs...) \n\nGet on a call that had far too many people on it -- general contractor, AV integrator/installer's team, me, the client's construction rep, the client's CIO, etc. etc., etc. and the AV integrator's engineer on the call makes the declaration that it's \"strange\" that we're using \"antiquated\" fiber. When queried for more information, he expressed dismay that there was only single mode in the building and none of the \"better\" multi mode. The General Contractor queried for more information\n\n&gt; **Questionable engineer**: Well, of course, single mode comes from the old days where you could only use fiber for a single purpose. On the other hand if you used multimode you can use the same fiber for multiple things so you need _less fiber_ when you use multimode. \n\n\nmy concentration is broken by a private Teams message from the CIO wondering if he's hallucinating or if this guy is for real. If it's a hallucination we're both experiencing it... My camera gets turned off to protect the innocent. \n\n&gt; **Questionable engineer**: So we'd strongly recommend that you redesign to eliminate the single mode and use multimode; you could probably use half as many strands as are currently planned...\n\nMy desk now has a dent in it from the amount of head banging and thrashing I'm doing. Has he conflated DWDM/CWDM with physical fiber types? (Can you even do CWDM on multimode? I've only seen/done it on SMF... and I don't really want to find out).\n\nSomeone I don't recognize asks \"would that affect anything?\"\n\n&gt; **Questionable engineer**: Not at all except for cutting the number of fibers you need!\n\nI check to make sure I'm muted before screaming into the void...because you know, transmission distances over MMF and SMF are so *identical* ^(Sarcasm: MMF is usable generally around 2000 feet/600 meters; SMF can be measured in KM)... \n\nI see the CIO has unmuted himself...\n\n&gt; **CIO**: Thank you for the suggestion. We would strongly prefer to stick with our standard. \n\n... and he has re-muted. I have calmed myself down to be coherent ...\n\n&gt; **Me**: Yes; multimode has some significant limitations for our needs and most of the products on the broadcast side only support single mode fiber. Please pay careful attention to the requirements in the specification as far as cable types and infrastructure are concerned. \n\n&gt; **Questionable engineer**: If you insist, but it's really a shame to be putting such an old technology in this new building. \n\n&gt; **General Contractor**: I think the owner's preference is clear here. Please proceed as directed. \n/sigh.",
        "created_utc": 1672238516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name for the phenomenon whereby users who cant login so something must be wrong with the system, magically can when you are watching them type their password?",
        "author": "Dependent_Price_1306",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zx1i1f/is_there_a_name_for_the_phenomenon_whereby_users/",
        "text": "",
        "created_utc": 1672205698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need more space???",
        "author": "Dependent_Price_1306",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zwwygn/need_more_space/",
        "text": "[removed]",
        "created_utc": 1672192255,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Municipality: Part 2 - The Database",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zwwnwe/the_municipality_part_2_the_database/",
        "text": "Hello everyone! Here is the next story from my job at the municipality.  In this one, we'll deal with our terrible database management software developer.  All of this is from the best of my memory along with some personal records, and a lot that comes from rumors, gossip, and other people.  However some things are relatively recent, so any inaccuracies are entirely on me.  Also, I don't give permission for anyone else to use this.\n\nTL/DR: Administer the collar of obedience!\n\nFor some context, I am not in IT; rather, I'm a GIS (Geographic Information Systems) professional. This particular world is quite small, so I will do what I can to properly anonymize my tale. However, for reference, all these stories take place at my job at a municipality in the American South. Here is my Dramatis Personae for this part:\n\n* **$Me**: Masterful erudite.  Also me.\n* **$BillingDir**: The Director of Billing.  Very ambitious, a local fixture in my city, and has a few issues, but I'm actually pretty good friends with her.\n* **$OldCM**: The old city manager.  She was pretty awesome and did a lot of good, but had to navigate through the miasma of \"good-ole-boy-ism\" pervasive at the time.\n* **$StupidWorks**: The administrative database software that my municipality uses.  Extremely basic and often quite terrible.\n* **$LowestBidder**: The software development company that created $StupidWorks.  Filled to the brim with salespeople that oversell and developers that don't know what they're doing.\n* **$LadyRep**: Sales representative from $LowestBidder.  She didn't know what she was talking about most of the time.\n* **$LeadDev**: Lead software developer for a project we wanted.  Kind of an a$$hole.\n\nAs we begin, I think it's pertinent to give some background for this story.  Many local governments in the United States have begun using administrative management software that allows them to better handle day-to-day operations.  These suites are some of the core elements behind the \"Smart Cities\" initiative.  They allow all aspects of the city to be digitized and managed through a relational database management system (RDBMS).  When an ornery resident comes into the office in nothing but a shower cap and towel yelling that she \"can't wash her a$$,\" this software allow the traumatized billing staff look up her account info without having to wade through ream after ream of dead trees (true story).  It also allows incidents to be related to one another, such as the opening of a police investigation about a sudden loss of funds in a particular department's budget and an HR ticket regarding \"irregularities in pay\" for a certain staff member (also true story).  When managed well, these software programs are a game changer for local government, letting things be run quicker and more effectively, with fewer staff, with better documentation and more transparency to the public.  Many suites are very well-designed; I would consider CityWorks to be among them.\n\nUnfortunately for us, our administrative database software was designed by **$LowestBidder**.\n\n**$OldCM** was the agent of change for all this.  Around 2013, she felt that it was now time to move the city's operations forward from the procedures that had been in place since the 1980s.  We needed to venture forth into the digital age and commit our records and operations to these new-fangled \"com-puters\".  She pitched her ideas to the City Council.  They were quite enthusiastic about it.  They were less enthusiastic about the price, and in true political fashion, were only willing to spend a fraction of the amount requested.  As a result, our bid for this new system went to the cheapest option.\n\n*You get what you pay for.*\n\n**$StupidWorks** was then purchased and implemented at the city.  On the whole, it is actually built around a reasonably-reliable database engine.  It just has problems with everything else.  Like a Corvette with an immaculately-maintained engine - and that also has four flat tires, a rusting chassis, spider-line fractures on all the windows, and a dead mouse somewhere inside it.  Let me give you some examples:\n\n* Support for the thing is atrocious.  We've had dozens of \"emergency patches\" to fix problems implemented by regular updates.  I can't tell you the number of emails I've gotten saying \"Please log out of **$StupidWorks** so we can fix something.\"  I don't believe we've ever transitioned to a new fiscal year without problems.\n* The core servers have gone down multiple times - thank God that **$GreaterIT** has a really awesome backup solution in place for us.  Probably a quarter of his already-stretched time and effort is spent supporting this software alone.\n* I don't know what the f\\*ck is up with the database designers.  Trying to add tangential BS is incredibly easy - if I went tomorrow and asked \"Could you add a flag field indicating whether there are pink flamingos on a property's yard\" the designers would have it done in an hour.  But core functionality?  *NOPE*.  I've been requested that they add in City/State/ZIP location fields ever since I started.  They still haven't done it, and continually push back when I ask.\n* Their project managers are some of the most incompetent morons I've ever seen.  We had a particular part of their suite that our staff was testing to see if it worked correctly.  They loaded test data into that system.  **$LowestBidder** *knew* that this was test data.  The report needed from this process was extremely important and had legal implications for the city - *hence the testing*.  One day, the project managers in charge of this process just decided to publish this report - using the test data when they did so!  They didn't ask anyone, they weren't given a directive, and they didn't check to see what was in the database.  The only way our staff even found out was because a user sent an email saying \"Thanks for getting me the report!\"  We had to backtrack everything, make sure that people didn't use the report, and quickly derive the correct data for this d@mned thing!  This put us in a world of trouble.  **$LowestBidder**, if any of you know who I am and are reading this, the city will probably drop your software specifically because of this incident &gt;:(\n\nGrrr.\n\nAnyways, once I was brought on board, **$LowestBidder** started doing a fantastic job - of cultivating my piss-poor perception of them and their product.  I've already told you about them consistently ignoring my pleas for added core functionality.  Something else hit a little closer to home.  I could tell right from the get-go that **$StupidWorks** had not been created as a geographically-enabled database system.  To give some perspective, I mentioned above that most local governments are moving towards software suites like this to manage their operations.  What I didn't mention is that almost all of those suites utilize GIS as the backend - GIS can be used as a relational database management system, and by enabling geographic positioning you are able to manage things not just through attributes but through location as well.  When I first arrived at the municipality, I actually didn't even realize there were suites like this without a geographic component! \n\n**$StupidWorks**, unfortunately, has no GIS-based back-end at all.  There are fields available for coordinates within many records of the database, but they are \"optional.\"  Within the interface, there are often buttons that say \"Open Map\" associated with particular entries.  When you click one, it opens to a Google Maps API; if there are coordinates programmed into the system, it will zoom down on them, but in most instances there is no data so it just opens to a general map of the city (or focuses on city hall).  Astonishingly useful.  I spoke to one of the reps and asked her how to fix this.  Remember how I said above that the company was rife with salespeople that oversell?  I asked if I could link database entries in **$StupidWorks** with some of the assets I'd uploaded into ArcGIS Online.  Our conversation went something like this:\n\n&gt;**$LadyRep**: Sure!  That would be easy to do.  We absolutely can do that.  \n&gt;  \n&gt;**$Me**: Ok, well our GIS assets are only shared internally.  You have to log in to access them.  How does this system actually access AGOL then?  Will I need to set up a generic account, or can the users log in individually?  And would those credentials have to be hardcoded?  Do I need to to have Enterprise and manage a REST service instead?  \n&gt;  \n&gt;**$LadyRep**: Well, I'm not really certain how it would work, our tech people would have to work out all the details, but I know we can do it!  \n&gt;  \n&gt;**$Me**: Wait a minute.  You just told me that you \"absolutely\" could do this - yet you have no idea how it would actually happen?  \n&gt;  \n&gt;**$LadyRep**: Well...  \n&gt;  \n&gt;**$Me**: ...Have you ever seen an Esri integration with your product?  \n&gt;  \n&gt;**$LadyRep**: ...  \n&gt;  \n&gt;**$Me** (wry look): Yep, that sounds about right.\n\nAs you can imagine, I put absolutely zero stock in what she said to me.  The company has repeated this countless times in the intervening years and I still refuse to believe it.\n\nAnyways, let's get to the crux of the matter.  A few years after I started at the municipality, **$BillingDir** approached me about a project that she had requested of **$LowestBidder**.  She wanted them to add and populate a field showing the Tax Map Numbers for all of the customer accounts we had in our system, and amazingly **$LowestBidder** had said they could do this!  Just to point out, a Tax Map Number is like the unique identifier for a piece of land (usually called a \"parcel\", another term is \"Parcel Identifier\").  Having that number is basically a guarantee that you can locate the property that it is associated with.  **$BillingDir** was overjoyed since we could use this Tax Map Number as a proxy to try and identify the actual locations of all our customers.  She wanted me to help out with the logistics of this and to get an updated parcels dataset to the developers.\n\nI was initially quite surprised about this and happy to hear it.  If the development company could populate this data for all our accounts, it would save me a tremendous amount of hassle trying to locate things in the future.  After all, the entries in the database did not have a City, State, and ZIP Code associated with their street address locations, and this made it virtually impossible to geocode things accurately.  I had been resigned to doing this manually in the future.  Knowing how much work it would be to do this by hand, I assumed that such a project would take a long time and cost us a lot of money.  So I asked - when was the completion date on this and how much were we paying for it?\n\n**$BillingDir** proudly responded that they could have the work done in a month and that it would cost &lt;X&gt; amount (which, while many thousands of dollars, still did not seem nearly high enough).\n\nAlarm bells immediately went off in my head.  I knew that populating these Tax Map Numbers would be a predominantly manual process, and while the amount quoted was still very high, it was less than the total number of customer accounts that I knew we had.  Something was off.  I asked **$BillingDir** if this was actually the amount quoted to populate this data or if it was for something else.  **$BillingDir** shook her head, adamant that this represented the amount to populate those fields.  I asked her if I could see the scope of work.\n\nWe went over to her office to review the project.  After looking at the documents, what I could see was that **$LowestBidder** was agreeing to add a Tax Map Number *FIELD* to each of our customer accounts, and that they were going to add in a new flat file within the database system to hold information on parcels (using the Tax Map Number as the keyfield), but there was nothing in there that actually said they were going to populate this new field for us.  I made **$BillingDir** aware of this.  She got frosty with me:\n\n&gt;**$BillingDir**: The reps assured me that with this project, we would have Tax Map Numbers for all of our accounts!  \n&gt;  \n&gt;**$Me**: Yes, but I don't think that means what you think it means.  I think all they were promising is that they'd add a new field that would be tied to the parcels data I'd provide to you, and we (the city) would have to actually fill out all this information for the individual accounts over time.  \n&gt;  \n&gt;**$BillingDir** (angrily): Well that is not the way the reps explained this to me.  You should be on my next call with them so that we can clear all of this up.\n\nI agreed to that.  I reviewed the information that **$BillingDir** had from the software company just to make sure what I had said was right, and it appeared to be.  I reached out to **$LowestBidder** before the call to get some clarification, but they refused to tell me anything definitive over email.  I also spoke with **$BillingDir** about the implications here, as well - if what I said was right, then the development company was requesting that we spend thousands on what was, essentially, a trivial amount of work, something that I could do in ArcGIS Online in like an hour or so.  She assured me that the original explanation was correct and that everything would be cleared up on the call.\n\nA few weeks later, we had the call.  It was **$Me**, **$BillingDir**, **$LadyRep**, **$LeadDev**, and a few others.  **$LadyRep** went on for a little while about what the project was, what it would provide us, what they would do, and then asked for any questions.  I went straight in for the kill:\n\n&gt;**$Me**: Yes, I have only one real question.  It was $BillingDir's understanding that this project would populate Tax Map Number information for all of our accounts.  Does the amount you quoted us include that data entry or does it not?  \n&gt;  \n&gt;**$LadyRep**: Well, the project will allow each account to be associated with a Tax Map Number, and those numbers will be tied to the data within an internal table that you provide us.  So yes, each account will have Tax Map information.  \n&gt;  \n&gt;**$Me**: That's not what I asked.  Will you be populating these fields for us, or will you not?  \n&gt;  \n&gt;**$LadyRep** (hesitantly): ...I'm not really sure, $LeadDev, could you shed some light on this?  \n&gt;  \n&gt;**$LeadDev** (in an impatient and irritated voice): No, we will not be doing your data entry for you.  This will be to set up the architecture only.  All other work is to be handled by your agency.  \n&gt;  \n&gt;**$Me** (looking over to $BillingDir, who is sitting listening with her jaw agape): I wanted to confirm that.  So you're saying you will not be populating this field for us?  \n&gt;  \n&gt;**$LeadDev** (very shortly): No.  \n&gt;  \n&gt;**$Me**: That's all I wanted to know.\n\nThat pretty much sealed the deal.  I spoke to **$BillingDir** later, who was quite upset that **$LowestBidder** had misrepresented/lied to her about this project as they had.  I asked her if she really wanted to move forward with this, to which she answered \"No.\"  She actually said something very different but I have Bowdlerized it to this :)  A couple of weeks later, an email came in from the developers asking if we wanted to move forward with the project.  After speaking once more with **$BillingDir**, she asked me if I would be willing to do the honors.\n\nWith a grin like the Cheshire Cat, I said \"Yes, ma'am.\"\n\n&gt;Dear **$LowestBidder**;  \n&gt;  \n&gt;After reviewing everything with all interested stakeholders here at &lt;municipality&gt;, we do not feel that any further work on this project would be in the best interests of the city.  Please terminate this project at your earliest convenience.  Thank you.  \n&gt;  \n&gt;\\- **$Me**\n\nAnd that's how I saved my municipality many thousands of dollars on a useless addition to our admin database (which I wound up creating within our AGOL organization a few weeks later anyways).  You get what you pay for, after all - and in this case, I'm glad we paid for (and received) *absolutely nothing*! :D\n\n \n\nThanks for reading, folks!  I'll have another story up tomorrow!  And here are some of my other stories on TFTS, if you're interested:\n\n* **The Municipality Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/zvn6e9/the_municipality_part_1_the_plotter/)\n* **The Agency Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/sh5m55/the_agency_part_1_the_chaos_begins/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/si0d1y/the_agency_part_2_the_reign_of_badmike/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/sivnc3/the_agency_part_3_the_lawyer/) [Part 4](https://www.reddit.com/r/talesfromtechsupport/comments/sjs025/the_agency_part_4_an_avalanche_of_accountability/) [Part 5](https://www.reddit.com/r/talesfromtechsupport/comments/sknt9k/the_agency_part_5_dont_let_the_door_hit_you/) [Part 6](https://www.reddit.com/r/talesfromtechsupport/comments/sljw99/the_agency_part_6_the_ballad_of_the_bosses/) [Part 7](https://www.reddit.com/r/talesfromtechsupport/comments/smeb69/the_agency_part_7_farewell_adieu_auf_wiedersehen/) [Part 8](https://www.reddit.com/r/talesfromtechsupport/comments/sna2uh/the_agency_part_8_epilogue/)\n* **A Symphony of Fail** [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/rmasuq/a_symphony_of_fail_part_1/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/rnmk82/a_symphony_of_fail_part_2/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/robtwl/a_symphony_of_fail_part_3_finale/)",
        "created_utc": 1672191426,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I feel when I get second guessed",
        "author": "USXWWriter",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zwsfog/how_i_feel_when_i_get_second_guessed/",
        "text": "[removed]",
        "created_utc": 1672180553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Game Stuttering With A MSI GeForce RTX 3060 Ti",
        "author": "Dr_KnowName",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zvwh78/game_stuttering_with_a_msi_geforce_rtx_3060_ti/",
        "text": "[removed]",
        "created_utc": 1672087639,
        "upvote_ratio": 0.99
    },
    {
        "title": "The Quest for Security, and the Stalling Vendor",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zvuxpk/the_quest_for_security_and_the_stalling_vendor/",
        "text": "I am again inspired by Mr\\_Cartographer, who's most recent post gave me a small flashback.\n\nYears ago I worked at a public University as a sysadmin and general tech support person.  Our department had been trying to set up our own student computer lab for a while, but budget and space requirements had forced postponements over and over.  Finally we managed to nail down enough funds to pay for the remodeling of some office space into a computer lab and to furnish the new lab with desks and computers.  \n\nWe weren't too far into the planning process when the problem of student access came up.  University policy was to secure most buildings from 7PM to 7AM, Monday through Friday, plus weekends.  This meant a person needed a physical key to enter, which would problematic to say the least.  We allowed graduate students to get keys if they needed access to assist with research, but it required them to pay a deposit and several levels of faculty approval using various forms, which was a total pain.   Students were supposed to turn in keys when they left to get their deposit back, but often they skipped this step so the number of \"missing keys\" grew over time.   Providing access for our entire student group would require hundreds of keys, instead of the 10-15 we managed for grad students.\n\nI talked to a co worker in another building about how they managed student access and he told me that his department had to have their entire building re-keyed by the University locksmiths a couple of years prior due to the high number of lost keys, and it had cost $50,000.   It was clear we needed a key card system as a solution.\n\nI asked around and found there were a couple of departments using standalone systems since up to this point there was no University standard for key cards, departments had just decided to find a solution and bought one.  One of the departments had a scalable solution, if we bought the same system we could piggy back off their server, which would remove our need to admin another service, we'd just have to update the database for our users, which was fairly easy.\n\nMy co-sysadmin, J, and I called the vendor and one of the sales force was out to see us within days.  We walked our building showing which doors would need to accessed, what groups we needed managed, which server needed to host our users, and basically we found our project was pretty small from the vendor's point of view.  They were used to doing entire buildings or groups of buildings, so our situation was no problem.\n\nWe got a quote for the entire project within another couple of days and went through the hoops of getting a purchase order.  We were really on fire to get this going as it was the final step in setting up our new student computer lab.  The University purchasing folks mailed the PO to the vendor, and I faxed over a copy (yes this was Quite A While Ago).  The sales guy confirmed they got the PO and I asked when the work could be scheduled. \n\nAt this point I discovered I made a pretty big mistake.   I should have included a \"work to completed by some\\_date\".  The sales guy informed me that scheduling was under control of the company owner, David.  OK, can I talk to David?  He's out of office, we'll take a message.  I left a message and heard nothing for next few days.  I called again, David was not in the office, would I like to leave to a message?  This went on for a couple of weeks, with everyone getting more and more pissed off.  The remodeling work was done on our lab and we were getting furniture installed.  The computers had been delivered and we were almost ready to go live.\n\nMy coworker J suggested we cancel the PO with David's company and go back to square one.  I wasn't sure how this worked so I checked with Purchasing and they said this was pretty easy.  I really didn't want to start over but J and I checked with the folks involved on our end and they agreed that while it would be a pain, it was okay with them to cancel.\n\nSo, J called David's company, no still not in, so J just left a message that if we didn't get a date for the project to be completed by EOB the PO would be cancelled.   \n\nJ's phone rang about 10 minutes later.  David was on the line, apologizing, \"things were busy\", he didn't realize we were in a hurry, blah, blah, blah.   All the BS that folks hand out when they're being phone as hell.  He told us the work could be done the following week, his main installation guy would be in touch, so sorry, here's my cell phone number so you can call me directly. \n\nA team of installation techs showed up the following week had everything done in three days.  We had some further issues since we found out our University ID cards were not compatible with the card readers on the new system so we had to buy our own cards, but it turned out to be pretty cheap.\n\nWe had other departments come to us for advice about adding this service over the next couple of years and you can bet we told them to make sure they got a completion date as part of the sales agreement.",
        "created_utc": 1672083513,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Municipality: Part 1 - The Plotter",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zvn6e9/the_municipality_part_1_the_plotter/",
        "text": "Hello y'all!  Sorry for the long delay - it has been a very busy past year!  I was asked to keep providing more stories, so here are several from my job at the municipality.  Hopefully these will fall a little closer to the IT and tech support side of things.  This first one regards the plotter \\*shudder\\*.  I hope that you all enjoy!  All of this is from the best of my memory along with some personal records, and a lot that comes from rumors, gossip, and other people.  However some things are relatively recent, so any inaccuracies are entirely on me.  Also, I don't give permission for anyone else to use this.\n\nTL/DR: Honor.  Valor.  Buttor.\n\nFor some context, I am not in IT; rather, I'm a GIS (Geographic Information Systems) professional. This particular world is quite small, so I will do what I can to properly anonymize my tale. However, for reference, all these stories take place at my job at a municipality in the American South. Here is my Dramatis Personae for this part:\n\n* **$Me**: Masterful erudite.  Also me.\n* **$LesserIT/$GreaterIT**: One of the IT guys, eventually becomes the IT Director. Good guy, horribly overworked, I try to do all I can to make his life a little easier.\n* **$ElderIT**: The old IT Director.  Originally brought in as a contractor, had a pretty laissez-faire approach to the work.\n* **$OldCM**: The old city manager.  She was pretty awesome and did a lot of good, but had to navigate through the miasma of \"good-ole-boy-ism\" pervasive at the time.\n* **$BigBoss**: The boss of the division I work at.  Very chill, easy-going, but likes things to work.\n* **$LazyCo**: The piece of crap company where we purchased our first plotter and that \"maintained\" it afterwards.\n* **$SmarmyIT**: Annoying IT tech consistently dispatched by $LazyCo to \"fix\" our problems.  I did not like him, if you can't tell.\n\nEnough stalling.  To the tale!\n\nFor those of you that don't know, a plotter is a massive printer that is used to print out poster-sized documents.  It can be used to print maps, engineering drawings, images, advertisements and notifications, movie posters, and enormous copies of buttcheeks sent over from the scanner.  I've used plotters throughout the entirety of my career in GIS.  After all, even though we are in the digital age of dynamic webmaps, people still need their giant poster-sized prints showing them just exactly where the restrooms are in the food court.\n\nI am... not fond of plotters.  To me, they are finicky, take a long time to warm up, require specialized care and resources, don't work half the time (and won't tell you why they won't work), and so on.  I have spent hours upon hours fiddling with these infernal machines trying to get them to operate.\n\nA relevant passage from the Book of Oatmeal goes as follows:\n\n&gt;And lo, the Gods of IT looked down upon the milling throngs of tech support and didst proclaim, \"Thy job is not hard enough.\"  And, in their mirth, they unleashed upon the world the *PRINTER*, to confound humankind to the end of its days.\n\nOur story begins many years before I was hired at the municipality.  One fine morning about eight years ago, **$OldCM** awoke and declared that she needed a very nice plotter/scanner combo for the city.  There were a couple of reasons for this, but the main one was simply because we had no large-scale printing capacity in-house at the time.  If anything big needed to be printed, we had to reach out to a company named **$LazyCo** so they could do it (which usually took forever, btw).  Rather than move through this sort of middleman (and to prevent the ungodly lag time), **$OldCM** wanted us to have this capability onsite.  In addition, she also wanted us to be able to scan the thousands and thousands of veritable Dead Sea Scroll-like maps and documents that were stuffed in every available closet in city hall.  So, once getting to the office, she summoned **$BigBoss**, told him about her idea, and said \"You get to buy this.\"  **$BigBoss** wasn't particularly thrilled at that.  But seeing as how he had the biggest budget at the municipality, it made sense.\n\n**$BigBoss** is nothing close to technology-savvy, so his first instinct was to reach out to our existing provider for some options.  **$LazyCo** apparently didn't want to lose some of our sweet, sugary, saccarine-laden business, so once contacted they informed us that they could \"*provide us with everything we needed*.\"  They'd be able to sell us a combo system and would even have an annual maintenance package for us.  Sounds pretty cool, right?\n\n*Lol*.  Let's get started, shall we?\n\nThe system that **$LazyCo** sold to us was about six years old when we purchased it.  They sold it to us for about twice what it should have cost - their price conflated that of a brand-new plotter system with one that was relatively old (but still in support).  **$BigBoss** was furious when, years later, I discovered this and pointed it out to him.  Anyways, the leadership at the municipality didn't have a whole lot of expertise in these matters, so they just tossed it up as a cost of doing business and paid for everything.  The system came with a maintenance contract as well that we'd have to pay for three years - after that, we'd have to renew it (and keep paying, of course).\n\nSpeaking of expertise, let's talk about the IT setup at the municipality at the time.  During those halcyon days, **$ElderIT** was in charge of everything IT-related.  **$LesserIT** was on-staff but he wasn't really an IT professional.  He worked in an another department and just happened to know more than the average bear regarding tech.  **$ElderIT** was the one actually in charge of our entire IT architecture, but he wasn't even a full-time employee.  He was a contractor.  He only worked two days per week here in the office.  Depending on whether he felt like it or not, he'd just not show up.  He'd take epic trips all across the world for months at a time.  Let this situation sink in, folks.  We basically had a flippant part-timer doing all the IT work for the entirety of the municipality with a little ad-hoc help here and there.  This was the situation for our entire municipality, with its tens of thousands of residents and customers.  This was not in the before-times when computers were shiny mystical objects that weren't a requirement for every desk.  This was in 2014, eight years ago.  Jesus.\n\nAnyways, as can be assumed, **$ElderIT**'s approach to the job was extremely cavalier.  I remember that he was a nice enough guy and he had a decent grasp on most things, but it was also clear that he was just riding along until he could retire.  He had remarkably few f\\*cks to give.  He wasn't big on learning or implementing new stuff, either.  And the fact that he was a contractor made him pretty loose with his responsibilities.  The situation we'd found ourselves in was no different.  When **$ElderIT** returned to work after being gone for some time and was told that **$OldCM** had purchased a plotter, his direct response was as follows:\n\n&gt;**$ElderIT**: I didn't buy that thing.  You didn't ask for my input, so I won't support it.\n\nThat was it, end of story.  **$ElderIT** made it very clear that since we had purchased a maintenance contract with **$LazyCo**, we should contact them for all plotter-related issues, not him.  He would not be doing any work on this plotter whatsoever.  And while a lot of this makes sense (how many of you have had a department buy something without your knowledge and then demand you support it?), the city was in a pretty big bind here.  **$ElderIT** hadn't been available any time they wanted to talk about purchasing the plotter to begin with, after all.  Most often, he was gone for weeks and \"out of contact.\"  He also refused to be available for most of the setup required, as well - y'know, things like getting the plotter connected to the network and making sure that users across the enterprise could see it through the print server.  **$LesserIT** had to be the one to do every bit of this since the actual IT support for the city couldn't be a$$ed.  Seriously, **$ElderIT**'s attitude throughout all of this could not have dripped more of entitlement.\n\nAnyways, back to the plotter.  The municipality had ordered this new devilry and absolutely everything about it was a clusterf\\*ck from the very beginning.  We were given a delivery date (like four months after we ordered it, **$LazyCo** took their sweet time).  **$BigBoss** and his crew waited patiently on the prescribed date for it to arrive.  They waited... and waited... *and waited*.  During the course of the day, nobody knew where the plotter was.  We probably had delivery tracking but no one knew how to use it.  At the end of the day, a bedraggled deliveryman stumbled into city hall.  He said that he'd tried to call (spoiler alert: he didn't) but couldn't reach anyone.  On the way over, he'd gotten into a serious accident.  Our new plotter was now a twisted pile of scrap on the streets of the nearby capital city.  Sounds about right.\n\nThe municipality then waited another four months for a replacement to be ordered and shipped.  **$LazyCo** never bothered to inform the city when it would arrive, so one day it just showed up out of the blue when nobody was expecting it.  Few people were even in the office, and **$ElderIT** was on a month-long visit to Brazil.  Literally the only person that had understanding of what to do in this situation was **$LesserIT**.  He was completely blindsided.  He made his way up to city hall to help connect this monster of a machine.  *And what a monster it proved to be*.\n\nThe system was designed in two parts - a stand-alone plotter and a separate scanner.  However, the software and drivers would not operate unless both devices were turned on and active.  Apparently this was so that people \"wouldn't just use one part and not the other.\"  And if something happened to make one part inoperable?  Well, the whole system would go down.  Say the plotter ran out of magenta ink and could no longer print.  Sorry, the scanner is now disabled, because the printer needs to be operable as well.  What happens if the scanner goes to sleep?  Sorry, the printer is now disabled - because the scanner needs to be operable too!  Ugh.\n\nIt was so much worse.  The system was controlled by a passthrough tower that was connected to the city's network.  This thing was literally ancient - it had a *PENTIUM* sticker on the front!  Remember - 2014!  WTF!  I have a picture, I'll post it in the comments :)  When **$LesserIT** protested this archaic hardware being placed on the network, he was told by **$LazyCo**'s reps that \"It's ok, it's just controlling the plotter and scanner, it doesn't need performance!\"  The system drivers could not work in anything newer than Windows 7.  The machine had a touch-screen monitor for \"nuanced control\" - the input delay was so bad that you'd have to wait up to a minute or longer before it would register that you even touched the d@mned thing!\n\nThis was the status of the monstrosity delivered to my municipality on that day.  For many long years, that's what they had to work with.  The system was rarely used for anything beyond scans of documents, and even then most of them had to be rescanned (because the scanner didn't have guiderails to hold the paper straight).  In the intervening time, most people that knew anything about the plotter either retired, left, or forgot.  The end of our service agreement came and went.  **$LazyCo** never reached back out to us to renew it.  When I arrived at the city, this mess had been gathering dust for almost a year.\n\nEnter **$Me**.  Almost four years after the plotter/scanner combo was purchased, I accepted the job as the GIS Analyst for the municipality.  One of my first tasks (given to me by **$BigBoss**) was to get this machine functional again and get the maintenance contract renewed.  I had literally no experience with this sort of thing (always inspires confidence, doesn't it?)  However, I tried my best.  I reached out to **$LazyCo** to see if they would give us a new contract.  They said they would, all that was needed was for them to send a tech out to check the machine to make sure it worked.  It took them *a year and half* to send someone.  In the meantime, they had us resume payments once again on the same terms as the old contract we'd had in the past.  They started sending us invoices shortly thereafter.  I was still very new to this when it started, so I didn't realize that we could have just refused because there wasn't an active contract in place.  But I did my best to make sure that everything got paid - which was almost f\\*cking impossible.  **$LazyCo** got *everything* wrong.  They would send invoices by mail to the wrong people.  They misspelled my name and **$BigBoss**'s name.  I would ask them to send me the invoices directly, they'd promise that they would do so over the phone, and the next invoices would invariably be sent to the wrong person!  Some invoices were sent by mail, others by email, others by fax.  Some went to completely different departments at the city.  Some they just forgot to send!  Seriously, for over a year, I would have random people come up to me with a letter from these morons saying \"Is this for you?\"\n\nEventually, they did send someone to check on the machine we had.  Alas, we must now introduce **$SmarmyIT**.  The very first thing he told me as he walked in and looked at the plotter was \"Oh, we don't support that anymore.\"  *WHAT!?!*  These idiots knew exactly what model of machine we had - they knew this before even sending a tech!  I had told them multiple times.  From what **$SmarmyIT** said, they'd stopped supporting this model a year beforehand - *and we'd been paying them for a maintenance contract on it ever since!!!*\n\nI was very upset during **$SmarmyIT**'s site visit.  I'm certain that his attitude didn't help things.  I kept asking questions about the operation of the machine, and he was very dismissive of each one.  Things like how to put guiderails on the sides of the scanner.  \"You don't need guiderails, you kin jest rotate the image!\"  That doesn't restore the parts of the image we lost, jacka$$, and the result looks janky as f\\*ck!  I also asked about the issues with how long it was taking to print from the server, which we'd eventually find out was due to the ancient passthrough machine dying.  \"Oh its jest an old system, give'r a minute and she'll be fine!\"  Imagine everything he said in the most annoying, nasal, highland-Southern accent you can think of, and that was this guy.\n\nThe biggest vote of confidence towards the company came at the end of the site visit, though.  As he was packing up to leave, **$SmarmyIT** popped up with this gem, \"Y'know, this system's gettin' pretty old.  Y'all will be needin' to update it soon, so whenever you're ready, jest reach out to us agin!\"  I remember just shaking my head.  *Yeah, I'll do that /s*.  In the meantime, they promised that they could still service the plotter for a few more years on a time-and-effort basis.\n\nUgh.\n\nAs can be imagined, this technological abortion continued to deteriorate.  Remember how I said that **$ElderIT** couldn't be f\\*cked to do anything about this system?  Well, he decided to go ahead and update the passthrough machine to Windows 10 - because of, y'know, EOL on Windows 7 - without telling anybody or testing anything.  Somehow, the drivers and software on the machine continued to work.  But there were major issues now.  The processing speed slowed to an absolute crawl.  If I attempted to send any documents to print that were bigger than about 1 MB, the spooler would spin up to about 2 GB, hang, and then the computer would crash.  We attempted to install the drivers and software on other spare machines here at city hall, and each one patently refused to work.  The only system where things seemed to work was this ancient relic.  Eventually, the passthrough stopped responding to the network at all - print documents seemed to be getting lost on the way, and none of our scans were saving to the network.  You all would likely know what was going on better than me.  From what I could see, however, it looked to be a progressive failure of the controlling machine.\n\nI called **$SmarmyIT** for a service call after that.  We opened up the passthrough to find that the thermal paste had almost entirely deteriorated between the heat sink and the CPU.  The system also only had 2 Gb of DDR2 RAM in it.  **$SmarmyIT** put two more memory sticks in it from his truck.  I asked if we could get a new passthrough machine instead of this memorial to the heydays of Alanis Morisette.  **$SmarmyIT** assured me, \"Sure!  I got one back at the office.  We'll git it to ya soon as we kin!\"\n\nYeah, they never got us a new machine.\n\nIncredibly, things kept getting worse and worse.  I began to petition my bosses for a replacement for this d@mnable thing.  By this point, parts were becoming an issue.  We couldn't order new ink or cartridges from the company anymore; everything had to come through second-hand suppliers.  If anything broke, we had issues finding replacements.  **$ElderIT** had thankfully retired by this point, leaving a newly-minted **$GreaterIT** in charge, but even he didn't know how to fix all the issues that would crop up from time to time.\n\nWe had one major breakdown occur during this period as well.  I needed new rolls of paper and requested them from one of our admin staff.  The person that ordered our supplies didn't really know what to order, so he bought paper where the central roll was actually too big for the axles we had in the plotter.  Unbeknownst to me, another coworker then loaded this paper into the device.  I never noticed because the plotter seemed to work fine this way for quite some time.  However, towards the end of the month, I noticed a bunch of skipped lines on one of the maps I printed.  Since this was a pretty nasty problem, I called **$SmarmyIT** to come out and look at it.\n\nHe looked at the roll and said we had the wrong size of paper loaded into it.  I told him that it had been working fine up till that point.  He then proceeded to pull out a roll adjuster (a little mechanism that can increase the size of an axle so that paper with a different sized central roll can be fitted to it) and said that we needed some of these.  I'd never seen one or used one until that point, and I pointed that out to him.  He then proceeded with this gem, \"Now that's whut I like t'call USER ERROR!\"  Seriously, *f\\*ck you guy*.\n\nEventually, though, this thing wound up being beyond its absolute last legs.  We had one working axle left.  The touchscreen monitor had died; we had an old flatscreen that I was using instead.  I'd gotten some roll adjusters and purchased a decent supply of ink, but I didn't know how long this would last.  The passthrough machine was slowly dying.  I'd requested a replacement plotter system in the city budget for the previous three years; it had been struck each time.  After all, what we had was still working, right? \\*facepalm\\*  In the meantime, the only way I could get the d@mn thing to work was to copy documents I wanted to print to a flash drive, load them on the passthrough machine, and print from there.  Similarly, I would copy scans from the passthrough onto that flash drive and then take them back to my desk to load to the network.  \n\nThe stage was set for a breakdown from which there could be no return.\n\nThat breakdown happened at the beginning of this year.  I was printing some things for **$BigBoss** and noticed a bunch of blurred lines on the prints.  I thought it was just an ink issue, so I replaced some of the cartridges and reprinted; everything seemed to work.  On the very next print, an error popped up.  After investigating everything thoroughly and doing all the troubleshooting that I could, it appeared to be a print head problem.  We needed to replace the heads.  I still wasn't entirely sure of everything, so I submitted a request to **$LazyCo** once more to send **$SmarmyIT** out to look at the thing.  He came out and confirmed that the heads were dead.  He quoted us a price of about $1,500 for the replacements; I looked everything up online and saw that I could get them for about $700.\n\nBut I was done with this piece of sh!t.\n\nI spoke to **$BigBoss** and asked - did we really want to keep throwing money at this thing?  The past several years, we'd wasted thousands on a useless maintenance contract, spent additional thousands on time-and-effort calls, and spent a premium on printing supplies and repair parts from second-hand suppliers.  Did we really want to spend close to a thousand dollars just to get this thing limping along for a few more months until the next breakdown?  Where do we cut our losses?\n\n**$BigBoss** agreed with me.  There's a reason I've always liked working for him :)  Out with the old, in with the new!\n\n**$BigBoss** got confirmation that we could purchase a new plotter/scanner combo with funds leftover in the present year's budget.  After all, my request for next year was cut.  But it seems that once each year's annual budget is passed by the council, nobody gives two sh!ts how it actually gets spent.  Seems legit.  Since we had some funds leftover this year (thanks for being frugal, **$BigBoss**!), we could get a piece of equipment that we really needed without the City Council telling us that we didn't really need it.  *Lol*.\n\nSo I immediately reached out to start getting quotes.  I got several from a number of sources - none of which were **$LazyCo**, of course.  Our normal printer supplier got in touch with us and offered us a great deal on a new system.  I was thoroughly impressed.  To put it in perspective, this brand-new system that they were willing to sell us was about $3,000 *cheaper* than what we'd purchased in 2014!  When I did the call with their reps and explained all the issues I'd had with **$LazyCo**, they openly laughed on the phone.  We decided to go with them.  They apologized to me that, due to supply difficulties, it might take up to six weeks to ship everything to us.  I told them if they managed to get the system here within the year I would be happy.  It arrived in *four* weeks, not six :)  It wasn't an entirely painless setup, but it was far better than anything I'd ever dealt with from **$LazyCo**.  We had the new plotter/scanner set up a week after it arrived.  Its been working ever since.  I've printed dozens of maps on it since it's been installed.  They look great.  The scanner actually has guiderails!  By every conceivable metric, this system exceeds the one **$LazyCo** pissed out on us.\n\nAnd on that note, what about **$LazyCo**?\n\nWithin a week of us reaching out for quotes, they must have gotten wind that we were looking for a new system.  I got a call from **$SmarmyIT** to \"check up on us.\"  He asked if we were trying to replace our system, to which I answered, truthfully, that yes we were.  He then got all defensive and asked why I hadn't called them.  I stayed cordial on the phone, but after I heard him say for the third time that \"*they could supply us with everything we'd need*\", I got a little irritated.  I rebutted with the following:\n\n&gt;**$Me**: You all sold us an old system for an inflated price, had us pay a maintenance contract on a device that you didn't support, have been consistently late on every service call I've made to you, never got us a new passthrough machine I requested of you multiple times, and did not once heed the instructions I sent to you regarding our invoices.  What am I supposed to say about all this?\n\nThe proverbial mic drop if there ever was one.  **$SmarmyIT** stammered a little bit and tried to deflect some of what I said (oh, that was the office staff, not my crew!)  Eventually, I just told him that we weren't interested and thanked him for the call.  He said to keep us in mind.  I said I would /s.  A few days later, his boss called me.  She tried a hard sales pitch to me for a new combo.  The cost was 50% higher than what we'd already purchased.  I listened to all of it, and at the end said this:\n\n&gt;**$Me**: Thank you.  We're not interested.  Take care!\n\n*And then I hung up the f\\*cking phone on her*.  It was glorious.  She didn't call back :D\n\nThat's the last time I've heard from them.  In the meantime, it's nice to have a plotter that we don't have to fight every time we want to us it.  Maybe, just maybe, this device isn't the demonspawn that all the others have been.  Maybe, just maybe, there is hope for this plotter after all :)\n\n&amp;#x200B;\n\nThanks for reading, folks!  Here are some of my other stories on TFTS, if you're interested:\n\n* **The Agency Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/sh5m55/the_agency_part_1_the_chaos_begins/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/si0d1y/the_agency_part_2_the_reign_of_badmike/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/sivnc3/the_agency_part_3_the_lawyer/) [Part 4](https://www.reddit.com/r/talesfromtechsupport/comments/sjs025/the_agency_part_4_an_avalanche_of_accountability/) [Part 5](https://www.reddit.com/r/talesfromtechsupport/comments/sknt9k/the_agency_part_5_dont_let_the_door_hit_you/) [Part 6](https://www.reddit.com/r/talesfromtechsupport/comments/sljw99/the_agency_part_6_the_ballad_of_the_bosses/) [Part 7](https://www.reddit.com/r/talesfromtechsupport/comments/smeb69/the_agency_part_7_farewell_adieu_auf_wiedersehen/) [Part 8](https://www.reddit.com/r/talesfromtechsupport/comments/sna2uh/the_agency_part_8_epilogue/)\n* **A Symphony of Fail** [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/rmasuq/a_symphony_of_fail_part_1/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/rnmk82/a_symphony_of_fail_part_2/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/robtwl/a_symphony_of_fail_part_3_finale/)",
        "created_utc": 1672061468,
        "upvote_ratio": 1.0
    },
    {
        "title": "On Customer Demand Food Delivery App Development : All You Need To Know",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zvi4zy/on_customer_demand_food_delivery_app_development/",
        "text": "[removed]",
        "created_utc": 1672040987,
        "upvote_ratio": 1.0
    },
    {
        "title": "An old hat, check your cables people!",
        "author": "TheRisingSun56",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zuuj80/an_old_hat_check_your_cables_people/",
        "text": "Been lurking even back when I was doing this job a few years ago figure I should contribute my own dumb story, here goes.\n\nI'd been fighting back and for a month's on an old legacy computer we had hooked up to our Public Health hearing test booth, every time we replaced the damn thing the system would refuse to talk to the booths and we were back a square one using the legacy that at most had another year left to chug on the HD.\n\nMy Public Health team's been back and forth with the higher level folks because once it goes past department specific its out of our wheelhouse and they've been angling to have that computer replaced for the better part of two years.\n\nFinally they get back to us with the software from the higher office that is more than a dozen versions more up to date then the legacy one that were chugging along with (Unsurprisingly the version we were using was pre-network update and pre-zone security network architecture, our network security team hated working with us) I install the new PC for the third time and get port-security to stop panicking then run the software on the hearing booth.\n\nDoesn't detect the Booth... Bugger.\n\nSpend an hour with the Public Health Tech who dabbles on the side with PC gaming  with me, no dice I have to rip the setup up again and back in with the Legacy computer while he reports back to the higher level folks.\n\nThis goes on for about two days until finally he tells me he's got the IT department for the software and hardware on the line with him. Having planned around this and we reinstall computer again and take another crack at it. The Rep is a patient women and even she's getting confused on why the thing isn't talking to the booth, until it hits her to ask us to check the cable.\n\nI check the PC side while the Tech chases it from the Booth, eventually we meet in the middle and lo and behold there's a switch built into the cable hidden behind the desk panel, he didn't know about it and I didn't know about it but his supervisor as we later discover knew about it and toggled it off without telling us, which also explained why we didn't run into this problem with the legacy computer.\n\nThoroughly baffled and embarrassed I switch the thing on and we run the test, the Tech puts on the headset and he gets a tone, it lives! \n\nI can feel the Rep's disappointment/befuddlement and my cheeks are warm as I hand off to the Tech for calibration. I head back upstairs and wait for him to message me later letting me know I can close the ticket out, got roasted by my co-workers for that one for a month when our CIO saw my write up about the situation.\n\nAlways check your cables people!",
        "created_utc": 1671959232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with game crashes and not responding + D3D device hung errors",
        "author": "XNeonixX",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zuj37s/help_with_game_crashes_and_not_responding_d3d/",
        "text": "[removed]",
        "created_utc": 1671916871,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Least I could do...",
        "author": "describt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zuiu9a/the_least_i_could_do/",
        "text": "Inspired by another redditor who accomplished far more than I did...\n\nDecades ago I was working in IT for a graduate school. 1 of the requirements for the students was to purchase a laptop for use in classes, so we were expected to get them on our network and help when they had software related issues.\n\nImmediately after graduation 1 of the foreign students came in with her newborn. When I heard her name, I must have done a double take, because I have the world's worst poker face. An email had gone out a few days before that her husband had just died in a traffic accident.\n\nBecause it was a hardware problem there wasn't a lot I could do for her, but I felt bad for her situation. I looked up the warranty info, and the laptop had been purchased second hand after a company had leased it. After a little negotiation I was able to get the remainder of the warranty transferred to her and get her hardware problem covered.\n\nBecause of the language barrier, I don't know if she fully understood but it was enough that I knew what it meant. I just wish I'd been able to do more.",
        "created_utc": 1671916120,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Christmas Eve Non-emergency issue",
        "author": "KindaAwkwardITGuy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zucawn/the_christmas_eve_nonemergency_issue/",
        "text": " How to get ticked down on your IT department's priority 101:\n\nSend an email the day before Christmas eve with an issue directly to your tier 2 support rep. Then when they respond with instructions on how to change the setting to fix your issue, wait until Christmas Eve and essentially demand a remote session asap, for said non-emergency issue, saying you don't \"think\" it will work because one of your coworkers had it resolved via remote session.\n\nContrary to popular opinion, we don't wave magic wands. We change settings if that's what the issue calls for. And being familiar with that specific setting, after seeing the same issue several times, it's how I fix that particular problem every time thus far. Including that person's coworker.\n\nJust had to vent after dealing with this one this morning.\n\nAnyway, have a good holiday season everyone!",
        "created_utc": 1671896552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an older customer cry",
        "author": "boyinblack13x",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zubuux/i_made_an_older_customer_cry/",
        "text": "Awhile back ago; I was working at mobile shop and this older guy came in and says to me; \n\n\"I know I'm not your customer, but I was wondering if you could help me with my iPhone. The guys that sold it to me said they don't do the set up, another store wouldn't help me because I didn't buy it from them and I just noticed your store as I was leaving. Is there a way to get my photos back? I had iCloud back up turned on but when I signed in, none of my photos are on here.\"\n\nI ask to see his phone and look at iCloud settings and see it is signed in and all the toggles are turned on.. Then I check the Photos settings and notice the photo stream option was turned off so switched it on and seen that over 300 photos started to sync to his new iPhone. Then I hand him back his phone and said I think I solved your problem. He looked at me in shock that it only took less than a minute and he looks at his photos and he started to cry. He then proceeded to tell me he lost his old iPhone and he thought he lost his photos of his son and grandson who just weeks before died in a crash.",
        "created_utc": 1671895161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas Eve Commiseration post",
        "author": "Zelgoot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zua9lf/christmas_eve_commiseration_post/",
        "text": "[removed]",
        "created_utc": 1671890000,
        "upvote_ratio": 1.0
    },
    {
        "title": "The $250 patch cord",
        "author": "rob-entre",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zu1t64/the_250_patch_cord/",
        "text": "Some years ago, my company started providing support to a local manufacturing plant. Their network closet was a mess - 12 homemade patch cables using riser cable for a switch that was 6 from the patch panel. The wiring was inconsistent, and a few didnt follow the 568B standard. \n\nThe week following the repair, we received a call about a time clock on the production floor not connecting to the network. We explained that we reterminated a few jacks because they needed repair, so replace the patch cable from the wall to the time clock with one that wed left. He insisted hed already tried that and demanded that we come fix it.  At $125/hr, I drove an hour to their office, installed a $1.25 patch cord, verified the time clock was online, and drove the return trip.  Most expensive patch cord Ive ever installed.",
        "created_utc": 1671856604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laptop Issue - Fish Smell",
        "author": "Tsene",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zsy4r0/laptop_issue_fish_smell/",
        "text": "We got one of the weirdest ticket ever today. Actually the weirdest ever!\n\n**The text is intact from the ticket:**\n\n*\"When using my laptop there is an unusual smell, a bit like rotting fish. Last week I was on leave. The week before I noticed a smell in my home  office which is the small bedroom in my house.*\n\n*I cleaned the room  thinking something had got in there and died, like a mouse, but there  was nothing. The smell went away last week when the room was used as a  bedroom. Yesterday after a little while of turning the laptop back on  the smell was back.*\n\n*I have now switched off the laptop and removed it  from the room, reverting to using my own laptop and there is  no smell.*  \n*What do you suggest?\"*\n\nTo be continued as the user is on holidays of course...",
        "created_utc": 1671746433,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's up with recent graduates having horrible computer skills?",
        "author": "ninarose25",
        "url": "/r/Accounting/comments/zqugbm/whats_up_with_recent_graduates_having_horrible/",
        "text": "",
        "created_utc": 1671677881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Maomao21022562_7656",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2soq/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Kmiller716_4030",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2rjr/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "nicodw1_2356",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2q5o/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Ness_Graphics_8382",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2o41/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "pinoweb3_6236",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2nbv/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Oghitdaweed214_3060",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2l5m/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "BorislavBogdan7_6692",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2j0e/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Classic_Craig_3449",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs2idu/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "0xBlade_eth_5180",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs26om/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671659613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "GuttaStudios_4920",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs24x6/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671659539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "CKS78_4797",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zs22qu/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671659441,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The new laptop isn't in my office\"",
        "author": "SmirkingWraith",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zrhkmy/the_new_laptop_isnt_in_my_office/",
        "text": "Over the weekend I was asked to build a new laptop for someone's assistant. Nice and simple, had it ready to go Friday afternoon so dropped it to their office. The assistant's boss was there so handed it to them in its bag and watched them put it down next to their desk.\n\nMonday rolls around and the new assistant comes asking for their laptop, I relay the above to them and am informed that they just came from there, their boss thinks she moved it to their other workspace. I think I speak for everyone here when I say that we all know the laptop is exactly where I saw it put Friday. But no, I need to check the other places first. God forbid I make them feel stupid by using my eyes to check the place they say it isn't.\n\nWe do a walking tour of the places the laptop potentially is and find nothing, so I walk them back to their office practicing surprised responses in my head. \"Oh look there it is,\" I remark as we enter. The boss looks over, pretends not to notice me grabbing it from the floor just next to their desk. No thank you, but that's mostly due to shame preventing them making eye contact.\n\nAll in a day's work.",
        "created_utc": 1671622169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mail merge saves a week of work",
        "author": "tuxcomputers",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zr1cvw/mail_merge_saves_a_week_of_work/",
        "text": "The Australian Army decided in 1995 to formalise and centralise desktop computer support. I did my computer course in 1996 and started at the new helpdesk in Sydney. We had 3 teams of 2 people, one answering phones doing first and second level support, the other two did site visits.\n\nOne visit we were on a site for a ticket, it was an Army Reserve unit. They have skeleton staff of 3 people one of which is a civilian that doesn't he admin work. We get there for the problem and she asks if we can wait a few minutes for her to finish the task she is on.\n\nNo problems we just stand back. I then noticed she has WordPro open (best word processor ever) and she is switching back and forth copying and pasting from one file to another, prints, copy/paste/print over and over.\n\nCurious I step forward and ask about her task. She has one file with all the names and addresses and one with the letter she needs to send out to the reserves.\n\nI suggested using the mail merge feature. We spend the next half hour converting the letter to a mail merge template and massaging the source file. The fantastic thing with WordPro is when you do the mail merge it leaves the template alone, unlike stupid dumbarse MS Word.\n\nShe was so grateful, we helped turned her week long task into 3 clicks. She was a very quick learner and she sent a heartfelt thank you to our manager that we took the time to teach her how to mail merge and that she had created multiple other letters from that lesson.\n\nShe was just completely unaware that the feature existed and since there was no internet she had no way to know it existed.\n\nI can't even remember what the original ticket was for but we fixed that too, it was probably a printer issue.",
        "created_utc": 1671574330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deleting your data (folder)",
        "author": "AnDanDan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqz6fp/deleting_your_data_folder/",
        "text": "Short and sweet. You know the players already.\n\n$user - Please help recover my files, I was deleting before I leave (note, user is retiring Friday)\n\n$me - You'll have to check Recycling Bin, we dont make backups of PCs\n\n$user - Please do for me, I dont know where it is.\n\nSo I remote in, nothing that they're looking for in the recycling bin. Too big, must have just been trashed. So I go seeing what I can salvage. My Docs produces an error. Pictures. Videos. All the same.\n\n$me - Where did you keep your files?\n\n$user - C drive\n\n$me - As in, directly on the C drive? In a folder?\n\n$user - In Users\n\n$me - Ah, ok so in yo-\n\nThe gears stop turning as I get into C:\\Users and dont see C:\\Users\\$Dumbass because they had deleted their entire user folder. It's all gone.\n\nThankfully, only 3 more days until this hell user is gone.",
        "created_utc": 1671569183,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Omg thank you, you've changed my life\"",
        "author": "unchainedzulu33",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqx5eb/omg_thank_you_youve_changed_my_life/",
        "text": "I work at a place where our main business takes place online using 3rd party software. \n\nThis year I moved to a different department that offers our 600-strong staff, support for that platform.\n\nDuring a phone call, where support has been requested, caller drops a comment \"you know how chrome only does one thing at a time?\"\n\nMe: I'm sorry, what?\n\nCaller: it only does one thing at a time. So to put a link in i have to close this down, then search in Google for a link to copy it to a word document, and then log back in and get to where I was so I can copy and paste into [platform]. \n\nMe: ah. Let me show you a new tab option in Google. Just click this little +\n\nI won't bore you with the details and length of time it took to walk through this. Suffice to say I changed their life!",
        "created_utc": 1671564293,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which the security cameras were TOO observant",
        "author": "NoRecommendation8630",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqv2ij/in_which_the_security_cameras_were_too_observant/",
        "text": "[removed]",
        "created_utc": 1671559336,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which the security system was TOO secure.",
        "author": "NoRecommendation8630",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqtsy4/in_which_the_security_system_was_too_secure/",
        "text": "[removed]",
        "created_utc": 1671556291,
        "upvote_ratio": 1.0
    },
    {
        "title": "that is ALL of the internet",
        "author": "elder_techpriest",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqqdzo/that_is_all_of_the_internet/",
        "text": "[removed]",
        "created_utc": 1671547728,
        "upvote_ratio": 0.99
    },
    {
        "title": "ALL of the internet",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1671539163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Corporate Buy-Outta Here",
        "author": "GT3Red",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zqmmr1/corporate_buyoutta_here/",
        "text": "This is actually a by-proxy story, but it's still a good one that some people could learn lessons from, but due to their megalomania they won't.\n\nMy friend worked at a company that does those Chip and Pin payment terminals. They're part of everything (except my hairdressers. Get with the times, Nick!) now, but back in ~2010 they were an optional, somewhat advanced, way of paying for crap from China or cholesterol in a box.\n\nThe company was still run by the guy who founded it, and despite the sales team being able to pull too much crap that left the accounts team picking up the many dropped balls until something o'clock that's not before midnight most month-ends, it was a good company. IT in particular had their gears oiled and were an effective team who were on top of maintenance and did a mostly good job of seeing problems coming and keeping a very low downtime score.\n\nThings were going so well that Mr Founder decided it was time for something new. He had achieved his goals. He'd set up a company from the ground that was now turning out a good profit, and all that was left to do was grow it, which didn't really appeal to the kind of person who lives off the battle from the ground level. He sought a buyer for the company and found one in an American company. Naturally he got a pile of cash, and a contract as tall as the cash.\n\nAnd while Mr Founder took a holiday, drank Pina Coladas and worked out what he would tinker with next, the new owners turned the company to shit. You know, the usual. Cutting perks and contingency, demanding magic increases in productivity. I could elaborate, but we all know that tale, and it allows me to jump to the good part.\n\n6 months into the new ownership, with people thoroughly questioning why they were still there (and some were not) the IT team were still mostly intact aside from a few redundancies. Then one Monday, one-by-one, seven of the nine IT staff walked into the bosses office to hand in their resignation. All on the same day.\n\nYou see, that big contact that Mr Founder signed specifically prevented him from recruiting any staff from the company for 6 months. Today was 6 months. And while they had been making trouble, he had been making plans. He had his new idea, his new company, and now he had his old team.",
        "created_utc": 1671537775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Utah with a Sad Face",
        "author": "bazjack",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zq7jpc/utah_with_a_sad_face/",
        "text": "[removed]",
        "created_utc": 1671493286,
        "upvote_ratio": 1.0
    },
    {
        "title": "You really called us about this?",
        "author": "verticalQ",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zq6eud/you_really_called_us_about_this/",
        "text": "[removed]",
        "created_utc": 1671490661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dis gonna be good.",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zpyasi/dis_gonna_be_good/",
        "text": "I support a DevSecOps group, but my \"official\" role is supporting the infrastructure they (and many other groups) use.  Still, time is money, so if they IM a quick request I try to knock it out as soon as practical.\n\nMonday morning rolls around.  I get in for their 8:00 daily standup.  Halfway through, I get an IM request for a simple config change.  The 8:00 mtg ends, and I got a handful of items I need to gather for my 10 AM weekly status with my \"home\" group.  Still, at 9:15 I made the config change they asked for.  Right before 10, they IM, \"We really need this!\".  I told them I gave them X at 9:15, which they asked for, but maybe they needed X', and I would get to it as soon as my meeting ended.  At 11, I changed to X' and asked them to check.\n\nAt 11:15 I head out to my blood donation appointment (*humblebrag* 6-gallon anniversary since taking this job 6 1/2 years ago *humblebrag*).  I get back to \"Now the error message is Y!  This doesn't work!\".  I figure out, you asked for the ability to GET an object, but you really need the ability to EDIT the object and make the quick fix.  (It's also important to note there are a dozen people in their org that have the rights to make this change.).\n\nThen I check my email and find out that at 10:30, they emailed my boss, their boss, and their boss's boss \"We're not getting any support!  This has held us up for a week!\"  I've built up enough credibility that their boss messages me, and got the true story.  I replied with timelines :-)\n\nKarma is a bitch.  Today is my last day of the year.  The rest of my group works in different time zones.  Like 6 and 12 hours ahead of them.  If they have a quick request, they need to use the official process.  They can submit a ticket.  For routine config changes, the turnaround time is 4 days although we usually hit 1-2.  Unless they submit it in a two-hour window in the morning, it'll be at least 8-12 hours before anyone even looks at it.",
        "created_utc": 1671472102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broken Power Supply becomes Salvage Storage Drive and a vindictive lesson in file management best practices",
        "author": "LukeCH2015",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zpwu6t/broken_power_supply_becomes_salvage_storage_drive/",
        "text": "User opened a ticket this weekend reporting that her laptop power supply wasnt working. \n\nWe see tickets like this often, and frequently the problem is actually something else. \n\nSo the user visits our office and we inspect her laptop and power supply. A piece of the power supply adapter had broken off and was stuck inside the laptop. I begin mentally preparing my plan to migrate her to a new laptop.\n\nDo you have all your work saved on your network shared drive? \n\n-awkward silence-\n\nThe user then proceeded into an asinine explanation about why she, an employee of this organization for more than 5 years didnt save large amounts of her work on our shared network drives with ongoing redundant backup protocols and instead saved everything to her local desktop.\n\nI want to start screaming.\n\nBy now, based on my line of questioning and my delivery, she knows shes in a major problem of her own creation. \n\nWe issue her a loaner laptop, and send her on her way, telling her that well salvage the files on her old drive and transfer them to her shared drive folder. \n\nOne of our team members who has more patience with hardware issues spent 30mins prying the laptop panels apart to clear out the power supply port.\n\nI am currently babysitting the laptop while we salvage 20GB worth of her data onto a flash drive.  At the moment it might be done in 3 hours.\n\nThis user has entered the platinum tier of our wall of shame.",
        "created_utc": 1671468890,
        "upvote_ratio": 1.0
    },
    {
        "title": "The bitlocker key needs to be entered into the computer.",
        "author": "givemeabreak432",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zpvbwj/the_bitlocker_key_needs_to_be_entered_into_the/",
        "text": "I just had a relatively normal Monday call - user forgot her AD password over the weekend, and has ended up bitlocking the computer.\n\nThe first problem: user admitted to me to writing down her password. It's a Monday morning and not a huge deal, but I made it clear to the user that writing down her password is against company policy. She will have to change her password.\n\nThe next wrench is she ended up locking her computer from entering her AD password incorrectly too many times. How she did this with the password written down is beyond me.\n\nI verified the computer name and the recovery key ID, then slowly provided her with the recovery password. Then I asked her to hit the \"unlock\" button.\n\nShe responded with \"it's not doing anything\". \n\nMy first thought was that she must have entered it incorrectly. So I asked her if the screen says \"bitlock password incorrect\".\n\n\"Oh, I was supposed to enter that number? I just wrote it down.\"\n\n...lady. Did you think I was just giving you my favorite 48 digit number for fun? Did I not literally just tell you not to write down passwords? What did you think this number was for?\n\nAnyway, that was my first call of the week. Great way to start.",
        "created_utc": 1671465493,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which I learned that sales =/= IT",
        "author": "NoRecommendation8630",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zpur2m/in_which_i_learned_that_sales_it/",
        "text": "My last tale received a great positive response here so I thought I'd regale you all with another war story from my role as the entire IT department for a company that does everything but IT.  Last time we met Rose and recalled the PC upgrade that deleted a whole bank (!) and today we'll be meeting Rose's boss.  Rose's boss... what to say of the man... picture a Cadillac Escalade with all the chrome, cutting you off in traffic with golf bags in the back and no blinker.  This guy is the man driving it.  Naturally, he's the resident expert on all things and IT is certainly not out of his wheelhouse.  He could do my job, but he doesn't want to.  I exist as a matter of convenience, not necessity.\n\nCast:\n\n$Me - NoRecommendation8630 himself, in the flesh. Certified IT adventurer.\n\n$John - Rose's boss.  We'll call him John because he looks like a John.  The quintessential salesman, he'd look right at home cigar-in-mouth standing outside a used car lot in 1962.  Think mid-50's, rotund, bald, perpetually single, and with a level of entitledness that would disgust King Midas himself.  Son of the original owners of the company and the manager of the Sales Department.  Struggles to inflate his own tires and is often confused by overcomplicated pens, but also fully convinced that if he can't do a thing it's because the thing is stupid and doesn't need to be done.\n\nThe Event:\n\nThis takes place during the human malware outbreak of 2020, smack dab in the middle of the mass panic and sudden shift to remote work.  Before closing the sales and accounting departments of our office (operations continued to run as some of the services this company provides fell under the umbrella of essential work per the US government) we purchased a laptop for every employee.  I took one, created an Admin account and a limited User account, set up some quick troubleshooting tools (read: TeamViewer), imaged the drive and deployed it to all of them (yay sameness), tagged them into inventory and issued one to everyone that would be working from home along with a VoIP phone and a goodie bag of cables and miscellany.  Yes, even John.  But you see, John being John and all, the same laptop as everyone else simply... wouldn't do.  No, John took it upon himself to re-enter the office the next day (of course it was a Saturday) and retrieve the desktop computer from his office complete with all 4 monitors and, shockingly, all of the cables.  So it's Saturday evening and I'm lazing about on the sofa with my fiance, right about to click Play on the next mindless Netflix binge when my phone rings.\n\n$John - Hey $Me, lemme ask you a question. (This is how John ALWAYS starts conversations when he's unhappy about something so I brace myself.)\n\n$Me - Hey $John, you know it's Saturday evening, right?  I'm kind of preoccupied here.\n\n$John - This'll just take a second, bud, and it's an emergency.  This computer is a piece of \\[expletive deleted\\].  It's lit up but there's no screen.\n\n$Me - (with all of the sarcasm $John deserves but maybe a touch too much for diplomacy) Wow $John that really does suck, I'll be happy to help you on Monday morning.\n\n$John - Now listen here $Me, you're going to help me because I \\[expletive deleted\\] pay you to help me.  So anyway, I plugged in the power and the screen... cable... thing but nothing works!\n\n$Me - (now oscillating between rage and confusion) The... screen cable?  This is a laptop, $John.  There is no screen cable.  Are you trying to use this with a TV or something?\n\n$John - Oh, no, I don't use \\[expletive deleted\\] little toys like those, I need a REAL computer.  So I went and got mine.  And all the screens! (very proud of himself indeed.)\n\n$Me - (face in palm, knowing full well I have to make this work or I'll never be able to rescue a shred of my Saturday evening) Great.  Lovely.  Okay.  Because I can't see what you're seeing let's start from the beginning.  You should have 5 power cables, they're all the same and it doesn't matter what each goes to.  First connect each of them to a power strip.  Then t-\n\n$John - (bowling me over, like he does) I. Know. How. To. Plug. Things. In.  Fix the COMPUTER!\n\n$Me - $John, we have to start at the beginning.  Remember the printer incident?  (That is a tale I will share another day, but John did remember the printer incident and my point was made.)\n\n$John - Fine $Me, 5 power cables, plugged into a power strip.  Other ends plugged into 4 monitors and the computer tower.  Power strip is on. (Good on him for checking this!  I was, and still am, thoroughly shocked at his uncharacteristic attention to detail here.)\n\n$Me - Wonderful!  Now you brought your mouse and keyboard, and the little nub is plugged into the tower?\n\n$John - Yeah I've got those, but I also know they have nothing to do with the screens so if you're about done wasting my \\[expletive deleted\\] Saturday night with this...\n\n$Me - $John, it's my Saturday night too, so I only want to go through this ONCE.  We. Are. Going. To. Check. EVERYTHING.  Now, the HDMI cables.  There should be four of-\n\n$John - (bowling me over, like he does) I told you the screen cables were plugged in!  All the cable holes are full on the screens like they're \\[expletive deleted\\] supposed to be.\n\n$Me - (brain gears spinning... spinning...) All... the holes, er, ports?  Those monitors each have two HDMI ports, each one should only have one cable connected to it.\n\n$John - No, they all connect.  Top left to top right, top right to bottom right, bottom right, to bottom left, bottom le-\n\n$Me - (interrupting this time) You... connected the monitors to eachother?  Why would you connect the monitors to eachother?\n\n$John - How the \\[expletive deleted\\] else will they talk to eachother and share the picture?  You're the \"IT guy\" here dude, you know how screens work!\n\nSomehow, dear reader, I contained my expletives long enough to walk John through connecting the HDMI cables to the computer, and got the computer going.  Then contained my expletives long enough still to open Display Settings and organize the screens.  But I will admit to losing my temper an hour and a half into this \"just a second\" call, during the configuration of his VoIP phone.  Now these phones are stupid easy to set up.  Ethernet from the router into the phone and from the phone to the computer.  Would you believe that the ports on the phone are labeled Internet and Computer?  Apparently that... is not clear enough for some people.  I.e. John.  We resorted to FaceTime wherein there was quite a bit of \"no, stop, stop, plug that cable into the top one.  The TOP ONE.  John, pick the phone back up and unplug that cable from the bottom port.  It goes in the \\[expletive deleted\\] TOP ONE!\"  But would you believe that he's REALLY good at sales?\n\nMeanwhile, the fiance was absolutely in tears laughing.  My exasperated face, phone in hand and all, was our Christmas card that year. \n\nTL;DR Sales manager is too good for a laptop but can't properly connect HDMI cables to a desktop PC.  VoIP phones are apparently future alien technology.",
        "created_utc": 1671464155,
        "upvote_ratio": 1.0
    },
    {
        "title": "The secrets of Angels who become sex dolls to Jejus and God for Eternal Life",
        "author": "_Please_believe__me_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zovzpc/the_secrets_of_angels_who_become_sex_dolls_to/",
        "text": "[removed]",
        "created_utc": 1671360724,
        "upvote_ratio": 1.0
    },
    {
        "title": "No internet????",
        "author": "Sudden_Pitch_8620",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zovyij/no_internet/",
        "text": "[removed]",
        "created_utc": 1671360597,
        "upvote_ratio": 1.0
    },
    {
        "title": "this is a test",
        "author": "martinpangyl_5923",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zoiqpw/this_is_a_test/",
        "text": "[removed]",
        "created_utc": 1671317567,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 Best Work From Home Jobs! (Netflix Tagger, Amazon Product Tester ect.)",
        "author": "yj9717_8662",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zohwu4/6_best_work_from_home_jobs_netflix_tagger_amazon/",
        "text": "[removed]",
        "created_utc": 1671315434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Restart Problems",
        "author": "Hoo-Tee-Who",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zohjxc/restart_problems/",
        "text": "I will do my best to keep this as short &amp; sweet as possible. My PC keeps randomly restarting. This problem occurred right after I upgraded my BIOS and RAM. Since first incurring this problem, I have tried every tutorial under the Sun trying to fix it.\nI've wiped all the storage drives numerous times.\nI flashed back to an older BIOS update. I've wiped all the drives numerous times, through various trouble shooting methods.\nI've individually disconnected, connected each storage drive trying to isolate a possible corrupted drive partition.\nI've tweaked the RAM settings in BIOS numerous times (in following tutorials). I've even wiped, and re-downloaded Windows 10 &amp;11. Nothing solves the restart issue. I've used numerous Admin Command Prompt trouble shoot options. I even paid a technician to come to my house and work on it. Nothing has helped. I'm afraid if I keep trouble shooting without fixing the problem I'm going to damage my hardware (if I haven't already).\nThe restart times happen totally randomly, but most of the time it happens during a down load when in Windows. The windows startup repair tool also doesn't work. I'm totally lost. My hardware specs are as follows:\nCPU: Ryzen 9 5900x\nGPU: RTX 3070\nMB: ASUS X570 Plus WIFI (BIOS version\n3603\nRAM: Corsair Vengeance Pro SL RGB (16\nGBx 2 for 32 GB DDR4)\nPS: 800w\n\nRAM: Corsair Vengeance Pro SL RGB (16\nGBx 2 for 32 GB DDR4)\nPS: 800v\nStorage: WD BLACK 4 TB HDD, WD GREEN\n500 GB SSD, Samsung 970 Evo and Samsung 970 Plus\nOS: Currently a fresh Windows 10\nThank you for your time and support. I greatly appreciate any help. I've tried darn near everything and I have made no progress",
        "created_utc": 1671314525,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 Best Work From Home Jobs! (Netflix Tagger, Amazon Product Tester ect.)",
        "author": "karabaw_nft_1385",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zohaa3/6_best_work_from_home_jobs_netflix_tagger_amazon/",
        "text": "[removed]",
        "created_utc": 1671313842,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 Best Work From Home Jobs! (Netflix Tagger, Amazon Product Tester ect.)",
        "author": "san__NFT_6991",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zogrjx/6_best_work_from_home_jobs_netflix_tagger_amazon/",
        "text": "[removed]",
        "created_utc": 1671312520,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 Best Work From Home Jobs! (Netflix Tagger, Amazon Product Tester ect.)",
        "author": "AiPokemon_NFTs_4523",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zof9v5/6_best_work_from_home_jobs_netflix_tagger_amazon/",
        "text": "[removed]",
        "created_utc": 1671308673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Artificial Intelligence Making Banks Smarter?",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zo57ml/is_artificial_intelligence_making_banks_smarter/",
        "text": "[removed]",
        "created_utc": 1671279770,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's Christmas!",
        "author": "Hattix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/znnfr2/its_christmas/",
        "text": "[removed]",
        "created_utc": 1671220490,
        "upvote_ratio": 1.0
    },
    {
        "title": "A mouse...Literally",
        "author": "Pr0xy255",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/znn92x/a_mouseliterally/",
        "text": "So this is really short, but my friend works in tech support for some computer company (That will go unnamed) and she just told me this story.  \n\n\nSo sometime today she was assiting people with their computers, and eventually got a call from an older woman. While i dont exactly know the details of this call, the woman did end up asking why her mouse couldn't connect to her computer so she couldn't use the 3D floor plan that she had installed, and that *her mouse squeaks*.  \n\n\nMy friend was bewildered at this and asked her if she was using an actual living mouse.  \n\n\nOne thing lead to another and this older woman, bless her heart, was attempting to use *her grandsons pet mouse* to use her computer.  \n And for some reason i find this really wholesome in some blissfully silly way? Like, imagine this grandma going to her grandson and asking if she could borrow his pet mouse and then attempts to plug it into the pc and use it. Poor thing was probably confused.",
        "created_utc": 1671219991,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boss was taking advantage of a paranoid person",
        "author": "kirbz61",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/znhv29/my_boss_was_taking_advantage_of_a_paranoid_person/",
        "text": "[removed]",
        "created_utc": 1671206020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just remembered this little gem",
        "author": "dont_drink_and_2FA",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zmwtpn/just_remembered_this_little_gem/",
        "text": "So I was working for a router, repeater, smart home shit manufacturer some years ago. Was 2nd lvl so I only occasionally had to take calls. Mostly (your below bob) customers were ez to deal with. \n\nI had someone call me asking me how to connect some wifi and smart home devices to their router, and after the troubleshooting on our side there would be nothing I could do beyond it but ask them to get in touch with \\[device manufacturer\\]. \n\nThat one particular customer though kept kind of buggy me until she said \"but you're IT! you should know how to deal with all these devices!\", to which I replied \"Yes that's why I'm keeping away from most of it\" You could hear her being flabbergasted through the phone.  \n\n\nUsed it ever since, works pretty fine.",
        "created_utc": 1671140167,
        "upvote_ratio": 1.0
    },
    {
        "title": "laptop repair on 4hrs of sleep shenanigans",
        "author": "Kaaawooo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zmvdf1/laptop_repair_on_4hrs_of_sleep_shenanigans/",
        "text": "Context: I'm IT support in a school with 1-1 Chromebooks for all students.\n\nA student comes to me and says their chromebook doesn't charge in 1 of the 2 USB-C ports. I test it, and sure enough, it doesn't charge on one side but does on the other. I tell him I'll have it fixed by lunch time and give him a loaner.\n\nI see something in the port and try to blow it out with canned air. Doesn't work. I open the chromebook up. This model has a motherboard on the right and a daughter board on the left, each with soldered on USB-c. Since the daughter board is the dead one, I figure I'll just take a daughter board from a donor and swap it. Replaced daughter board and it still doesn't charge on that side. Just for kicks I check the other side, and to my horror, that side now doesn't charge either! Did I brick the motherboard while taking it apart?\n\nI now take both the motherboard out and replace it with a donor motherboard that I know works. But again, it doesn't charge.... Ok...\n\nI plug the charger into my phone. No charge. But this is the exact same charger I just used a few minutes ago to verify the motherboard USB-c port was working! I unplug the charger from the power strip, plug it back in, and now it charges my phone. Phew! \n\nWell, while I have the original daughter board out of the machine, I take my tweezers and dig some crud out of the usb-c port. Probably should have done that before taking the thing apart in the first place.\n\nPut it back together with the original motherboard and daughterboard, and everything works great! The student should be back anytime now to pick up his Chromebook.",
        "created_utc": 1671136609,
        "upvote_ratio": 1.0
    },
    {
        "title": "laptop repair on 4hrs of sleep shenanigans",
        "author": "Kaaawooo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zmv32t/laptop_repair_on_4hrs_of_sleep_shenanigans/",
        "text": "",
        "created_utc": 1671135895,
        "upvote_ratio": 1.0
    },
    {
        "title": "If it fits in memory, it's not big data.",
        "author": "FinalDevice",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zmu0qc/if_it_fits_in_memory_its_not_big_data/",
        "text": "This might stretch the definition of tech support. I was supporting and enabling a large company's migration from on-premises datacenters to cloud hosting.\n\nAt some point I was in charge of migrating data from an old mainframe system into *the cloud*. By \"in charge\" I mean, another team designed a migration that would require an army of servers, complicated clustering logic, and a ton of code. It didn't work, and thus became my problem.\n\nThe original team had used all kinds of fancy tools and design patterns to manage this big data. Many servers talked to a caching server. A backup of a database was exported to a csv file, with the intention of loading that into a dedicated cache server. The actual data to be migrated was exported to two other csv files, each containing nearly a terabyte of data. No, we couldn't just stream through the file one row at a time. It had to be grouped, chunked by certain values, and and and and and.\n\nI remembered a snarky line I'd found online somewhere: If it fits in memory, it's not big data. Huh. What's the biggest EC2 instance I can reserve in AWS? \n\nSolution: I loaded up a 128-core server that had 2TB of memory. Loaded the entire contents of the database backup into memory. Took one of the ~1TB CSV files containing the data to be migrated, and loaded it all in memory as well. Spun through all the data, streaming it into the new system.\n\nThat stupid server cost something like $300/day to rent, but it was actually cheaper than the entire fleet of hardware that we were supposed to use - and I only needed it temporarily, while the migration was running. Turns out it's a hell of a lot easier to migrate data to a new system when you can just load it all in memory and figure it out from there.\n\nBonus: `top` has a bug. You know how it displays CPU utilization on a per-core basis? So if you have 2 cores, the max usage is 200%. If you have 4 cores, the max is 400%. If you have 128 cores, the max is ... 9999%. It can't display more than 4 digits.",
        "created_utc": 1671133263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Built for Speed",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zmnd25/built_for_speed/",
        "text": "Back to the late 2000s for another shop story. \n\nI personally have always been a bit of a storage nerd. CPUs and graphics cards performance I couldn't care less for if it does the job, but for whatever reason disks, SSDs, RAID, VHDs, MPIO, SANs.. it touches me right in my autism. It makes me do the Reeves/Mortimer thigh rubs. I don't know why but I love it.\n\n&amp;#x200B;\n\nA customer from the university wants a quote for a computer with some specific requests. No problem, all our builds are done by us. If we can order the parts we'll build it. Impressive spec, maxed out RAM, required space for a scientific capture card of some sort, and a RAID card. Cool! Sure we can do that.\n\n&amp;#x200B;\n\nCustomer: \"And 8x 1TB hard drives in RAID 0\"\n\nMe, paraphrased: \n\n\"You know the rules  \nYou all know the game  \nTry to do what's right  \nAnd I swear I can't complain  \nIf I die tonight\"\n\nCustomer: \"We know the risks of RAID 0 yes, that's on us no problem\"\n\nMe: \"OK! Which OS do you want installed? XP..?\"\n\nCustomer: \"XP 32bit, XP 64bit, Vista 32bit, Vista 64bit, and SuSe Linux x64\"\n\nMe: \"....I\"\n\nCustomer: \"We're not certain about compatibility with the hardware and software we need so we'll just try all of them\"\n\nMe: \"The 32bit OS versions won't see above 3.5GB of your RAM\"\n\nCustomer: \"That's a nice to have, not essential. What matters is the disks can capture an enormous amount of data in a very short space of time. By enormous we mean for the timescale. The actual amount of data produced isn't that big a deal, it's how quickly\"\n\nMe, wiping drool off my chin: \"I see. we'll need to charge for each license of Windows and installation charge for each OS\"\n\nCustomer: \"Our budget is ???? so we'll check over the quote once we have it\" \n\nI forget how much it was, it was four figures. MyBoss does the quote and it comes in way under.\n\nCustomer: \"Any chance we can get a laptop to manage it with the remainder then? But it won't get approved if we call it that though, so..\"\n\nMyBoss: \"I'll put it down as *essential management hardware*\"\n\n&amp;#x200B;\n\nThe parts are ordered. I get to build it. It teaches me many things like the 32bit XP MBR 2TB limit.\n\nMe: \"F\\*\\*\\*, it can't be done!\"\n\nI look around in the RAID controller options and discover I can create partitions of RAID sets, making the disks look to the OS as independent 2TB disks, as opposed to the all or nothing approach of early motherboard SATA RAID I was familiar with.\n\nMe: \"EUREKA!!!\" -KA-KA-KA\n\nI install the first OS and partition the rest of the drives for the remainder. Then I come across the message about multiboot on GPT disks. Ovavu, but no problem I go back to the RAID controller and create further 2TB slices. What are the scores George Dawes? I'm able to get all 5 OSes on and booting.\n\nObvs, I want to do a disk benchmark. 1GB/s! It doesn't occur to me until later that was probably the limit of the test software, and the actual speed was possibly slightly higher and wouldn't cut off at such a nice round number.\n\nWe also discover not all RAID cards that need cooling come with any. BEEEEEEEEEP, BEEEEEEEEEP at 100C. We throw in some cooling fans as a freebie, considering how much they're spending.\n\nThe build is complete. I'm happy. Customer is happy. I don't think we hear from them again so no issues. And no, there was no failed disks lost data complaint.\n\n&amp;#x200B;\n\nEranu.",
        "created_utc": 1671116974,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's all about knowing how to talk to your audience",
        "author": "smohk1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zm5g9b/its_all_about_knowing_how_to_talk_to_your_audience/",
        "text": "[removed]",
        "created_utc": 1671059874,
        "upvote_ratio": 1.0
    },
    {
        "title": "PC black screen and all fans go full speed",
        "author": "ZestyPoundCake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zm1tx8/pc_black_screen_and_all_fans_go_full_speed/",
        "text": "Motherboard- MSI MPG B550 GAMING EDGE WIFI\n\nProcessor AMD Ryzen 7 5800X\n\nRAM  G.SKILL Ripjaws V 16x2\n\nOS Windows 10\n\nGraphics card MSI GeForce RTX 3080 GAMING X TRIO 10G\n\nPower  CORSAIR RM850 - 80 PLUS Gold, Full Modular\n\ni bought the PC as a prebuilt from IBUYPOWER during quarantine (i would've built one myself but this was the only way to get a 3080 at near msrp)\n\nI've had it about a 1.5 years working fine when all of a sudden i was playing a old modded like crazy game (Stalker)  and the screen goes black and i hear all of the fans go full speed but i can still hear game audio. discord also still works i was talking with friends while the screen was black, also it is ALL the fans going full speed.\n\nI've also had this crash on two other games (Darktide and Ghost recon wild lands)\n\nthe crashes usually happening within 30-40 minutes of playing the game and seem to be happening randomly.\n\ni have ran stress tests separately on the CPU and GPU for an hour and no problem's occurred during them (Maybe i should try more?). i have also updated my bios and reset my Windows Drive and updated drivers.\n\nafter testing the ram with windows and it coming back good, i tried moving around the ram and running on one stick at a time. this seemed to help my problem as it stopped the black screen on Darktide and Ghost recon but not on Stalker. one of the sticks seemed to cause more crashes\n\n&amp;#x200B;\n\nso i thought i solved it and ordered new ram and installed that and nope still crashing on Stalker with two brand new sticks installed (all other games i haven't had the problem)\n\n&amp;#x200B;\n\nI'm kinda stuck at this point. I'm thinking motherboard or some weird software issue but i wanted some second opinions on here before i start basically rebuilding this PC and dropping more money\n\n&amp;#x200B;\n\ni may be missing out on some of the troubleshooting i did but that's the bulk of it. any suggestions would be welcomed",
        "created_utc": 1671051014,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which I deleted an entire bank",
        "author": "NoRecommendation8630",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zlzjn7/in_which_i_deleted_an_entire_bank/",
        "text": "[removed]",
        "created_utc": 1671045231,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Why are my emails getting kicked back?\"",
        "author": "Souta95",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zlyiwq/why_are_my_emails_getting_kicked_back/",
        "text": "Just had this call come in a few minutes ago and wanted to share it.\n\n\\*Phone rings\\* Maintenance department director on the CID\n\nMe: IT department, how can I help?\n\nDirector: Hi, I want to know why whenever I try to send an email to &lt;person at company&gt; the email is getting kicked back.\n\nMe: What does the kickback email say the reason is?\n\nDirector: Ummm... Something about not found, I think. I deleted the emails.\n\nMe: Can I remote in and take a look in your email for clues?\n\nDirector: Sure.\n\nMe: \\*starts initiating a remote support session\\*\n\nDirector: I think the most recent one I sent went though.  I didn't get a kickback.\n\nMe: Oh?\n\nDirector: I was on the phone with &lt;person from company&gt; and they said their email address was firstname.lanstname@company.com and I didn't have the dot.\n\nMe: (connected in at this point) Can I still take a look to make certain?\n\nDirector: Sure\n\nMe: \\*searches for items sent to this company\\* Which one of these emails are ones that got kicked back?\n\nDirector: All of the ones from earlier today except for the newest one\n\nMe: OK, lets start at the first one from today.... \\*checks the email\\* you said their email address was \"firstname.lanstname@company.com\" right?\n\nDirector: Yeah\n\nMe: Ok, so this first email was sent to \"firstnamelastname@company.c\"\n\nDirector: Yeah, I forgot to finish typing that one. I remember doing that, what about the next one?\n\nMe: The next one was sent to \"firstnamelastname@company.com\"\n\nDirector: That explains that...and the others?\n\nMe: Then you sent it to \"firstname.lastname@misspelledcompany.com\", then you did \"firstnamelastname@company.com\" two more times before the one that didn't get kicked back.\n\nDirector: I see.... Thank you, I should be all set now.\n\nMe: No problem. If anything else comes up, just let us.... \\*director hangs up\\* ...know...",
        "created_utc": 1671042722,
        "upvote_ratio": 1.0
    },
    {
        "title": "I failed a security/social engineering test and feel like a complete idiot",
        "author": "Mad_Season_1994",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zly1ul/i_failed_a_securitysocial_engineering_test_and/",
        "text": "[removed]",
        "created_utc": 1671041609,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Wrong Screwdriver",
        "author": "throwaway34587613",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zlwcg0/the_wrong_screwdriver/",
        "text": "TLDR: Equipment fails because wrong screwdriver was used\n\n&amp;#x200B;\n\nI was sitting at my desk early on a Friday afternoon when my phone rang. \n\nIt was Kevin.  \n\nThis wasn't going to go well.\n\nKevin: \"I'm assembling the units for \\[Customer\\] and one of the boards failed the testing\"\n\nMe: \"Swap out the bad board with another one.  I'll look at the bad board later\"\n\nKevin: \"I can't.  It won't come out\"\n\nMe: \"What?  Don't touch anything.  I'll be right there\"\n\n&amp;#x200B;\n\nI worked at a small company.  Everybody had extra duties in addition to their official jobs. \n\nThe head engineer was also the network admin and handled all support for network issues.\n\nThe head programmer was also the sysadmin and was tech support for the servers.\n\nIn addition to my official duties, I was also tech support for all issues related to assembly and testing of our product.\n\nThe extra tasks kept interfering with our \"real\" jobs, so more help was needed.\n\nEnter Kevin.\n\nKevin was hired directly by the CEO, bypassing all of the \"unnecessary\" hiring procedures, such as verifying that he was competent.\n\nAs far as the CEO was concerned, Kevin was some kind of Golden Child Who Could Do No Wrong. \n\nDespite all evidence to the contrary.\n\n&amp;#x200B;\n\nOur company sold a specialized \\[Expensive Product\\] - each unit cost far more than my annual salary.\n\nIt consisted of a main chassis into which multiple accessory boards could be installed.\n\nThe boards locked securely into place, but as extra insurance against them vibrating loose during shipping, each board was also held in place with four tiny screws.\n\nFor \\[Reasons\\] we used Pozidrive screws.  \n\nPozidrive screws have a \"plus sign\" recess that looks very much like the more common (in the US) Phillips screwheads, except the slots are parallel instead of tapered.  \n\nA Phillips screwdriver will not fit correctly, and trying to use one will likely damage either the screwhead or the screwdriver.\n\n&amp;#x200B;\n\nThe assembly manual had very clear instructions to only use Pozidrive screwdrivers, that the screws must be tightened only by hand, and they must only be tightened until fingertip snug.\n\nEach assembly workbench had a copy of the manual.\n\nA laminated, full-page, bright-yellow-highlighted warning to only use Pozidrive screwdrivers when installing the boards was mounted at each bench in a location that would be impossible to miss.\n\nTwo of the correct Pozidrive screwdrivers were attached to each assembly bench with anti-static tethers, so it would be impossible for the correct screwdriver to be out-of-reach when assembling a unit.\n\nAlso, there was /nothing/ in the entire lab that used Phillips screws, so every Phillips screwdriver was removed from the lab, so it would be impossible to accidentally grab the wrong screwdriver.\n\nWe made sure that every multi-bit driver set in the lab contained the correct Pozidrive bits, and all of the Phillips bits were removed.\n\nAll powered screwdrivers were banished from the lab.\n\nClearly, it would take a very special talent to make a mistake with this part of the assembly.\n\n&amp;#x200B;\n\nKevin apparently had that talent.\n\nI entered the lab to see Kevin struggling to remove one of the screws from the bad board, using a Phillips screwdriver.\n\nThe screwhead was completely stripped out, with nothing left for the driver to grip.\n\nNot just this one, but all four screws on this board.  And all four screws on each of the other two boards in this chassis.  And on all three boards in each of the other two units in the order.\n\n&amp;#x200B;\n\nKevin had used a powered screwdriver with a removable Phillips bit to install all of the screws.  \n\nInstead of stopping when they were snug, he kept on grinding away until the screwheads were completely drilled out.\n\nAll 36 of them. \n\n&amp;#x200B;\n\nWhere did the Phillips screwdriver come from?\n\nKevin explained that he noticed that there were no Phillips screwdrivers in the lab, so he went to the hardware store and bought a new set for each bench.\n\nHe also picked up a bunch of replaceable Phillips bits because they somehow seemed to be missing from all of the sets.\n\nAnd he brought his own powered driver from home so his hands wouldn't get tired.\n\n&amp;#x200B;\n\nI had to use a tiny chisel to cut a slot into what little metal was left of each screwhead, so that I could get a grip on it with a tiny flathead screwdriver.\n\nAfter removing the \"bad\" board I was able to diagnose the problem.\n\nThe board was fine.\n\nMetal filings from the destroyed screws had fallen inside and were shorting some connections together\n\n&amp;#x200B;\n\nAftermath:\n\nI kicked Kevin out of the assembly lab and spent the rest of the day removing all of the boards, cleaning out the metal shavings, and then correctly re-installing them.\n\nThey all passed their tests.  \n\nBy the time I was finished, we had missed the last shipping pick-up time for the day, so the units had to be shipped out on the following Monday.\n\nThe CEO blamed me for the delay, because it was apparently my fault, not Kevin's, that the units were not ready on time.",
        "created_utc": 1671037613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join Souvenir's Waitlist",
        "author": "KingJosh1234",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zlcgsi/join_souvenirs_waitlist/",
        "text": "[removed]",
        "created_utc": 1670978690,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the best on-hold music you've heard?",
        "author": "spellmanking",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zl9uc0/whats_the_best_onhold_music_youve_heard/",
        "text": "[removed]",
        "created_utc": 1670972249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Information is Overrated",
        "author": "TheRubiksDude",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zl6jpc/information_is_overrated/",
        "text": "For some reason the helpdesk and desktop support team where I work think information is overrated. My team is two levels above the helpdesk, and we mostly handle escalations from desktop support. 95% of the time tickets have been touched by both the helpdesk and desktop before showing up in our queue. \n\nAnd yet, quite often we get tickets lacking in information. \n\nFor example, a ticket that arrived in our queue earlier today. \n\n&gt;Title: Website access needed\n\n&gt;Description: Users PC is not connecting to the\n\n(Yes, its incomplete)\n\n&gt;Notes:\n\n&gt;Helpdesk Tech: User needs website added to trusted sites list. Trusted site list is grayed out and I cannot change it. Escalating to Desktop Support. \n\n&gt;Desktop Tech: User needs a site added to trusted sites list. Reassigning. \n\nAnd thats it. The site isnt listed. Or even the error. To be fair the desktop team cant modify the trusted sites list, that is something my team does. But this place seems to think adding a website to the trusted site list will fix any website error when its almost never the solution. \n\nI sent the ticket back to the helpdesk. \n\n&gt;Needs more information. What website is the user trying to access? What error or message appears when accessing?\n\nAbout an hour later I checked on the ticket and see that more information was added.\n\n&gt;User cannot access shared drive X:\\Folder\\Folder.\n\nSigh.",
        "created_utc": 1670964629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Green Button",
        "author": "GrouchyAd8315",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zkpuw1/big_green_button/",
        "text": "[removed]",
        "created_utc": 1670917036,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I understand this better than you, person I contacted for help\"",
        "author": "its_ya_girl420",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zjwina/i_understand_this_better_than_you_person_i/",
        "text": "[removed]",
        "created_utc": 1670845005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call me in at 8:00 am on my day off? Be prepared for me to rock up in tight spandex",
        "author": "CptUnderpants-",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zjd9as/call_me_in_at_800_am_on_my_day_off_be_prepared/",
        "text": "[removed]",
        "created_utc": 1670799094,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Pc Still Sleeping",
        "author": "PerroLosco",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zimpuv/new_pc_still_sleeping/",
        "text": "[removed]",
        "created_utc": 1670752780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with crashing pc",
        "author": "AppaTheCarry",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/ziiwyd/help_with_crashing_pc/",
        "text": " Got my computer in like April and whenever I play some games like GTA V, apex legends, or overwatch the game randomly crashes in the middle of the games. I tried checking benchmarks while I play and nothing seems out of the ordinary from what I searched up. I am pretty sure its something with my graphics card but I dont know. Ive tried updating everything and other stuff you can find on the internet but it still crashes. This has been happening for a while on bigger games, I didn't really mind cause I played easier games to run when I first got it, butover timee I started playing more of the games listed above and it randomly crashes after like 10-30 minutes. I have already tried DDU and installing and updating and all that, I need something probably more in depth.\n\nSpecs:\n\nCPU: Intel Core i5-11400F 2.6 GHz 6-core \n\nGPU: MSI Radeon RX 6600 XT 8 GB \n\nMotherboard: MSI MPG Z490 \n\nRam: Teamgroup T-force Delta 2 x 8 GB DDR4-3600 \n\nMemory: WD 1 TB M.2-2280 SSD \n\nPower Supply: EVGA SUPERNOVA 650 GA W 80+ \n\nRan with two monitors, 24\" in 1080p with 144Hz and 21.5\" in 1080p with 75 Hz",
        "created_utc": 1670741774,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Our heater broke our power strip\"",
        "author": "go_hyuck_yourself",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zi26uw/our_heater_broke_our_power_strip/",
        "text": "Hello, long-time prowler, first-time poster. This happened today, and I had to share the stupidity.\n\nCall comes in, \"Hey, we had our heater plugged into a power strip, and now our light (connected to the power strip) doesn't turn on!\" After some discussion, I'm told a backup battery in the same location is also saying it doesn't have power.\n\nI went into their office to discover the power configuration. First off, the power strip is totally fried. I give them the \"you can't plug a heater into a power strip\" spiel and dug further. Plugged into the power strip (other than the heater) were three things:\n\n1. A neon light\n2. A water cooler\n3. A backup battery\n\nThe backup battery said it had no power even though it was connected to the power strip. I checked what was connected to the backup. There was only one thing plugged in. An ONT. (Wall port for ethernet on a PON). I checked what was plugged into the ONT. One ethernet cable.\n\nAfter some more digging, I discovered two more battery backups and a non-managed switch, A dumb switch if you will; all connected and powered on.\n\nI start at the outlet to trace the power. There is a battery backup connected to the outlet. Only one thing is plugged into the backup. It's another battery backup! And connected to that battery backup... is the dumb switch! \n\nThere's nothing nearby that would require ethernet, so I traced the two cables that were being switched to and discovered that neither were being used!\n\nFfs. Whoever set this up needs a stern talking to and a better understanding of power management \n\n\nTl;Dr: \nWall outlet -&gt; Power strip -&gt; UPS -&gt; ONT -&gt; Switch + Wall outlet -&gt; UPS -&gt; UPS -&gt; Switch -&gt; Nothing = Funny and dumb",
        "created_utc": 1670703091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renovate Customer Experiences With AI Chatbots",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zhqt99/renovate_customer_experiences_with_ai_chatbots/",
        "text": "[removed]",
        "created_utc": 1670673445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beer Cooled Hard Drive Recovery",
        "author": "OregonSunshine00",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zhbd90/beer_cooled_hard_drive_recovery/",
        "text": "Way back in the day before I built my own server/NAS boxes I purchased an Apple Aiport Pro Router with 1TB Mechanical Hard Drive installed. It handled nightly backups for the business and some music storage. After years in use the business upgraded to a new router and changed the backup procedures to cloud based. As such I was tasked with recovering the data on the drive and transferring it to the new machine/cloud. Easy, right ? You'd think so except every time I tried to start recovery on the drive I could feel it overheat to ridicoulous levels, then it would inevitably crash out and die. And the whatever transfers were currently going through were lost or corrupted. Shitty. I couldn't get the drive out the router, I couldn't fix the hard drives overheating, but I could perhaps attack the cooling. So, to recover the data I purchased a 6 pack of PBR tallboys and set them on top of the router, ice cold, and started the recovery going in increments of about 1/10th of the drive. The beer kept the drive cool enough to recover the 1/10th chunks without crashing, and by the time it was finished all the data had been recovered and moved online. Moral of the story....  ????",
        "created_utc": 1670626269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backup? Yeah we implemented it after an near fatal dataloss...",
        "author": "MAD_ROB",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zhaecj/backup_yeah_we_implemented_it_after_an_near_fatal/",
        "text": "hello again. I have a little update to an old story from 2 yrs ago (see here) [https://www.reddit.com/r/talesfromtechsupport/comments/hlm5t8/backup\\_we\\_have\\_a\\_backup/](https://www.reddit.com/r/talesfromtechsupport/comments/hlm5t8/backup_we_have_a_backup/)\n\nTL/DR of the old post: cf-card with important data died, data could be restored, customer implemented and verified a backup-solution.\n\n&amp;#x200B;\n\nNow to 3 weeks ago. \n\nI get a call, and have an deja vu. The robot cell is still running, and the cf-card died... again! I am very happy - call your IT-Guy, he implemented an backup-solution the last time that happened. You wouldnt read this when the backup was restored easily. He implemented it, he verified it... and then changed his backup-solution 1 year later, and didnt change it for this machine. So we dont have a backup for \\~1year. I did the same spiel as last time, wrote an hefty bill, everyone except the IT-Guy was happy. Machine is running happily ever after... Backup? Not updated ... yet?!  \n\n\nTL\\\\DR: You only have an backup when you can restore it",
        "created_utc": 1670624023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay no attention to what you just read.",
        "author": "dave999dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zh8twn/pay_no_attention_to_what_you_just_read/",
        "text": "This happened to my boss last month.\n\n1. A company wide email goes out which includes links to highlights from a recent \"state of the company\" all hands meeting.\n2. Our COO replies with an email that suggests that the material at the links should be made more private, or perhaps redacted, as they are super confidential. Reading it made me wonder if he meant to hit only reply and NOT reply all. But really, it wasn't that bad, just teensy bit awkward. \n3. He did mean to only reply to one person. Sending it company wide was an accident. Reply All strikes again! (Or rather a company wide DL way down the list, so he couldn't see it unless he expanded the distribution).  Once it was understood what had happened, my boss was called. She was directed to recall his email post haste.\n4. She did manage to recall it she thinks from most of the folks on the west coast. Although it took a couple hours of frantic activity. Even so, she couldn't recall it from probably at least 1/3 the company. They'd already read it (like me).\n5. My boss relays this to me as an explanation why she had to push back a meeting with me.\n6. During our meeting the COO sends out an explanatory email which includes his original inadvertent email. He says yes, it was an accident, how we shouldn't read too much into it, and describes his reasoning behind sending it in the first place.\n7. My boss says tonight is a wine night.\n\nIf our story had ended here, at the first email, I'm convinced most people would have read it and shrugged. But now the sequence of events has prompted idle chatter. I'm disappointed that there was no third email asking people to ignore the first two.",
        "created_utc": 1670620215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did this happen to you back in 2000 as well?",
        "author": "derjanni",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zgxipi/did_this_happen_to_you_back_in_2000_as_well/",
        "text": "[removed]",
        "created_utc": 1670592908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine the worst way to organize files. You're wrong.",
        "author": "literal_trahs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zgrcvi/imagine_the_worst_way_to_organize_files_youre/",
        "text": "[removed]",
        "created_utc": 1670574557,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"How much money would it take to convert the entire base from 110V to 220V\"",
        "author": "redditadmindumb87",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zgob3i/how_much_money_would_it_take_to_convert_the/",
        "text": "I was in this meeting\n\nA US Military base in Europe was built using 110V as its planned power source. I believe this was done because at the time the base was only supposed to be in use for several years. A big challenge with this is a lot of equipment (like printers/routers/etc/etc/etc) had 220V plugs and even if it was dual voltage you needed power adaptors etc.\n\nAnd this bugged the commander he felt it presented a less clean look, and posed operational challenges.\n\nSo he asked \"how much money would it take to convert the entire base from 110V to 220V\" and the guy in charge of the base power grid said \"Well...alot\" and the commander goes \"I want to know how much\" to which the guy in charge of the power grid for the base said \"just the amount of man hours that we'd have to dedicate to come up with a proper quote, would be in the tens of thousands of dollars\" and the commander goes \"Well just get me a quote\"\n\nSo the meeting ends, the guy is bitching about his new task and I'm no electrican but I go to him \"Why do you even need to inspect everything to get a quote?\" and he goes \"To see what can be reused\" and I go \"And how much of the current grid could be reused?\" he goes \"very little\" I go \"So why not look up what the grid cost the first time around, and double the price\" he goes \"but...that was like 10 years ago\" and I said \"Hence why I said double the price\" he goes \"What if he says yes\" I go \"how much do you think it would be?\" he goes \"Honestly...at least $100 million\" and I said \"You know he doesn't have the budget to do that\" he goes \"True\"\n\nNext meeting comes around\n\nCommander goes \"And how much?\" and the guy goes \"$150 million\" and the commander goes \"$150 million to switch from 110v to 220V?\" and he goes \"Yes\" and the commander goes \"Why?\" to which he said \"Cause you gotta change everything\"",
        "created_utc": 1670564688,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"We should have back up hardware at remote locations\" \"No its too expensive\"",
        "author": "redditadmindumb87",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zgmmzj/we_should_have_back_up_hardware_at_remote/",
        "text": "Going over some plans with senior management awhile ago I pointed out how our larger locations all had back up hardware that way if a computer goes down we have a computer on site, that is already imaged that all the employee needs to do is log in/update the software and can be back up and running in a matter of hours instead of days or weeks.\n\nI got told \"no that's too expensive\"\n\nKeep in mind this is a company that over 500 million dollars in revenue, I'm talking about purchasing 7~ laptops at a cost of about $900 a unit so $6,300 and putting them in a closet in those remote locations. Those remote locations on average generate around $3-$5 million a year in revenue. So we are talking about $21 million to $35 million in revenue I'm suggesting we have a plan B to keep alive.\n\nWell last week one remote location employee laptop got coffee spilled on it and its DOA we just had to overnight a new laptop to him, he'll probably be done for 2-3 days. Another employee at another remote location laptop simply broke (we don't have it back yet) and we are also having to do the same.\n\nBoth those location employees are currently unable to work, and yea. Had we implemented my plan...those locations would still be operational.",
        "created_utc": 1670559628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back on the help desk, Part 2",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zgjcrd/back_on_the_help_desk_part_2/",
        "text": "This is a multipart story. [Part 1 is here](https://www.reddit.com/r/talesfromtechsupport/comments/z7jatb/back_on_the_help_desk/)  \n  \nI'm reading the pentest report I've got to defend in an hour or so. It's pretty well done. There are two  High findings that will give me something to talk about:  \n  \n**HIGH- No separation between Test and Production environments**  \n  \n**Details**: Testers were able to obtain production information from the provided Test accounts. Specifically, the testers were able to find their own Personally Identifying Information using only their access provided.  \n  \n**HIGH- Authentication Bypass**  \n  \n**Details**: Testers were able to bypass authentication to the Account Initialization script and create their own test credentials.  \n  \nAnd to twist the knife, there's a devastating backslap hidden somewhere in the 'process improvement' section, where the testers point out that GreyGoo was so disorganized that they didn't actually give the testers credentials until the second week of the penetration test. These testers did their heaviest lifting coming in from the cold. Gnarly.    \n  \nIf I were a more throrough consultant, I'd verify that I've got the necessary SharePoint access and whatever else I need while people are still around for the day. Because I'm a skilled consultant, I'm looking for a quiet place to participate in this call.  \n  \nUnfortunately, the help desk bullpen too noisy for me to run a call. I catch the attention of a painfully thin woman wearing a headset.   \n  \nMe:\"Hi there. I'm LawTechie. How do I reserve a conference room for a call?\"  \n  \nShe points at her headset and shrugs her shoulders.   \n  \nWoman:\"You need a conference room for call? Invite it to the call in Outlook\"  \n  \nWonderful. All the conference rooms are named after big cities. I have no idea if Berlin is within walking distance or in another building. Normally, I'd take the call from the comfort of the rental car, but I thought I'd be clever to take the bike. I do remember a few benches out front of the building. It's a nice day. What the hell.  \n  \nI've got a commanding view of the parking lot from my picnic bench. Decent wi-fi. All I need to be really comfortable outside would be a plate of bitterballen or wings and a pint of beer.   \n   \nThe call starts. According to the invite, about ten people have been invited. I'm guessing a company as big as GreyGoo has the culture where managers and subject matter experts get defensively invited to meetings. We'll wait for them like tramps waiting for Godot for the first five minutes anyway.  \n  \nCast of characters:  \n  \nNigel, the Product Lead of some data management component of Grey Goo. He's got the English accent of someone who left the UK and never looked back, but realizes their accent makes them classy, even if they're from Leeds. He's unhappy that the pentest report isn't full of glowing praise.  \n  \nKweisi, or Casey or something like that. They're calling from the bottom of the Fort Mc Henry tunnel or the loudest server room I've heard over the phone. I'm guessing by the noise, they're responsible for infrastructure.    \n  \nKelly. She's a project manager trying to keep to a deadline long past. She's like a newscaster at a second tier SoCal TV station cheerfully describing a bloody home invasion or schoolbus wreck.    \n  \nSally, a penetration tester from one of the other consulting firms Hoovering out cash from Grey Goo. If I remember correctly, she's listed as a junior on the pentest report. I'm guessing everyone more senior either moved on to greener pastures or just didn't care enough to show up.  \n  \nAnd some random 603 area code dial-in who hasn't introduced themselves.   \n  \nOnce consensus is obtained that nobody more important, we get started.  \n  \nNigel starts with an opening salvo:  \n  \nNigel:\"We've read the report. We have some concerns that these are issues in our test environment and not the customer facing environment. In that light, we'd like the 'High' findings changed to information or at least 'low'  \n  \nme:\"I don't want to speak for Sally, but the ability of an attacker to start with no credentials at all and end up with elevated rights in production concerns me.\"  \n  \nNigel:\"But the issues were with the _test_ environment.\"  \n  \nThis guy is doing his best Oxford don. I feel that I should have a handful of his robe in my hand to demand his attention next, like placing a stack of quarters on a bar pool table.   \n \nMe:\"Imagine you've got a warehouse where you store things of value. There's a customer entrance and an employee entrance. At both entrances, you have to be identified and determined if you're allowed to be there. At the customer entrance, they actually make sure that you're allowed in. At the employee entrance, they trust you when you say who you are and if you're allowed to be there.  \n  \nOnce you're in, you're **in  the same building**, despite what the sign over the door said. \"    \n  \nNigel's thinking.   \n  \n(603):\"Wharble Garble risk committee\"  \n  \nOh, great. (603)'s GRC.  \n  \nCasey:\"It hasn't gone to the risk committee yet. We need to finalize the report before we can refer it to them\"  \n  \nNigel:\"Exactly. We've put a hold on remediation planning until we can get these findings downgraded to Medium. Then we'll let you finalize the report.\"  \n  \nMe:\"In the grand scheme, what's the difference between a High and a Medium? You have a shorter time period to remediate Highs, right?\"  \n  \nKelly:\"That's correct. 30 days versus 90 for a Medium\"  \n  \nI quickly look back to the cover page on the report.   \n  \nThis test was completed almost seven months ago.  \n  \nMe:\"So you've been fighting this impact rating longer than the remediation window for either, is that correct\"  \n  \nNigel:\"We just don't believe these findings are worthy of the alarm that Sally's team raised\"  \n  \nMe:\"Because as you see it, the vulnerability was in a test environment\"  \n  \nNigel:\"Exactly\"  \n  \nMe:\"And because of this delay, you expect to remediate this around the time you're due for another pentest\"  \n  \nSally:\"I think we're starting a new one by the end of the year. We'd consider this out of scope\"  \n  \nKelly:\"Fine. Let's table this discussion for next week's call\"  \n  \nPleasantries are exchanged and I feel the need to just sit at this picnic table and breathe.  \n  \nI look up to notice a gleaming white SUV stopped in front of the motorcycle corrals. I watch as a man leans out of the driver's seat and views the six feet between my motorcycle and the old BMW bike.   \n  \nSatisfied with something, he gets back in his SUV and proceeds to pull his SUV into the space between the two bikes.   \n  \nStupidity is afoot. I slam my laptop lid closed and jog over, waving and failing to get this guy's attention.  \n  \n\n  \nWhile my Ducati and the /7 are both European motorcycles, they're different. A BMW /7 is a solid, well engineered motorcycle for serious motorcyclists. It's not fast or agile, but every angle it's hefty and durable. I'd imagine when small town banks commissioned new branches in the '70s, they'd task architects to make their buildings look as solid as a /7. My Ducati Scrambler is about as solid as a BMX bicycle. Ducati design fetishizes light weight and agility and in pursuit, feel flimsy. A common joke is that the bolts and screws holding them together are actually made out of dried Parmesan. However, one part on both bikes is deliberately made heavy and solid. To reduce vibration, motorcycle handlebars have solid steel weights at the end. The bar end weight is probably the least meringue-like part of the whole machine.\n  \nAnd SUV guy just scraped a few feet of his Range Rover's front fender and driver's side door down my bar end weight. I don't think he'll be able to open the door without knocking over my bike. I notice the man is wearing earpods and is engrossed in conversation.   \n  \nHe rolls down the window and mutters something at me. I think I recognize the voice.  \n  \nMe:\"Nigel?\"  \n  \nTo be continued.",
        "created_utc": 1670550551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes of course, I submitted a ticket because it works properly!",
        "author": "LucidWindspark",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zga1h5/yes_of_course_i_submitted_a_ticket_because_it/",
        "text": "I have the unfortunate responsibility of submitting tickets to our ERP that describes themselves as EPIC. They consistently reply with 'knowledge articles' that are only applicable to a version we don't have. And that's if they even translated my ticket correctly before forming a reply. \n\n\nFirst thing this morning on a unit quantity issue, I left a detailed ticket explaining every troubleshooting step I had exhausted up to that point. Usually when this issue happens, I have a Rebuild module that will clean up any mismatched data in the database. This screen has two outputs:\n\n1. A message along the lines of:\n\n**Rebuild completed, no issues remain.**\n\nWhich essentially means it didn't actually find a problem. \n\n2. Actual results that need to be rebuilt. Rebuild is performed when you SAVE the results. \n\n\nToday, I get message 1 no matter what I do. I spend about 2 hours troubleshooting to no avail before putting in this ticket. The first response comes in about 5 minutes later, asking me to try the rebuild module I detailed trying already. I play along and send them screenshots of message 1, with the caption 'This module is not capable of finding the problem\". They then hit me with this gem:\n\n\"It is a confirmation that no issues remain, does it still show bad quantities?\"\n\nNope. It's all fixed and working properly, I just submitted a ticket because I felt like it. Doesn't everyone!?\n\nMore rage than tale, but I figured I'd share this in both subs.",
        "created_utc": 1670530290,
        "upvote_ratio": 1.0
    },
    {
        "title": "My daily pipeline nightmare",
        "author": "Dani5h87",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zfpswr/my_daily_pipeline_nightmare/",
        "text": "I do reporting and automation for an irresponsibly large company.  Unbeknownst to me, I started my role about a month before they began a number of system and platform migrations. Most of the normal tools I would use are currently being certified and are completely unavailable until late 2023.  So lo and behold, I get to be Dr. Process McGyver for the foreseeable future.\n\nBefore I showed up, all of our reports were being done in Excel by hand, every day. Sheet by sheet, cell by cell, it took a team of four around 50 combined hours a week to produce. Ive got it down to about 20-30 minutes, but the pipeline looks like the love child between M.C. Escher and Picasso.  Here goes:\n\nIngredients\n\n-\tOne system of record. Our central application\n-\tIBM COGNOS. ALL CAPS. \n-\tFour SharePoints\n-\tExcel/Power Query - The Tool.  Brings all my data sources into one file. My beautiful little mutant. \n-\tMS Access\n-\tTableau\n-\tThe rapidly evaporating patience of a controls manager.\n-\tOne disastrously disorganized shared drive. \n\nThe Pipeline (Mostly in Order)\n\n-\tCOGNOS runs my scheduled queries and then emails me two daily files with our data from the main application. \n-\tSave these files to SharePoint #1.\n-\tOpen The Tool (Excel book using PQ) and refresh all 14 goddamn queries, importing both data files now cleaned and organized as well as data from a list on SharePoint #2.  This is a 10 minute refresh. \n-\tClear errors and merge a bunch of shit which always is broken because of the SharePoint list where people constantly fat finger the IDs or somebody adds a new indexed column. Yay. \n-\tSave a copy of the now refreshed tool locally and then to SP #1, SP #3, and a shared drive. \n-\tOpen Access, import various sheets from the tool, and then query to append and update that data to SP #4. Spicy. \n-\tReboot laptop and open Tableau. \n-\tRefresh data from local tool file because our driver certification for the Tableau to SharePoint connector wont be done until late 2023.\n-\tPublish Tableau dashboard to server. (Im very proud of this dash. It looks great, surprisingly performs great, and contains every KPI these groups demanded)\n-\tScreen snip static elements from dashboard to paste in email to senior leadership because they dont like clicking the dash link. \n-\tScream.  \n-\tEmail like 6 different copies of the tool because everyone wants specific sheets and shit and cant be bothered to use slicers or go to one of the three SharePoints its housed on. \n-\tSacrifice a goat in the hopes that the monthly updates to our application dont break all the queries.\n-\tRead the latest developer newsletter and realize that I definitely murdered an animal in vain because they added 36 new dynamic fields to the application and removed 52 old fields bringing us to a total of 1,836 columns.\n\n\n\nWhat sucks is that it works. They get accurate reports every day, just the way they want them, in a fraction of the time. \nWhat they dont seem to understand is that Im putting the data into a chokehold and then beating it into submission.  Thanks for coming to my TED talk.",
        "created_utc": 1670476287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apple is not a tech company, it's a cult.",
        "author": "Raptorthrust",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zfn7md/apple_is_not_a_tech_company_its_a_cult/",
        "text": "[removed]",
        "created_utc": 1670469194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jeffrey Jeffrey Jeffrey...",
        "author": "absinthangler",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zfgp61/jeffrey_jeffrey_jeffrey/",
        "text": "[removed]",
        "created_utc": 1670453149,
        "upvote_ratio": 1.0
    },
    {
        "title": "When a user won't respond, but another user tells you to help them",
        "author": "Another_Basic_NPC",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zfeag9/when_a_user_wont_respond_but_another_user_tells/",
        "text": "So this happened a few hours ago, and I'm sure some of you might be able to relate. \n\nThe day is getting near the end, and I get a message about a program not working from a user. I ask them for some more information \"do you mind explaining the issue please\" and get an error message about server access being denied. \n\nHuh. \n\nSo I continue to message the user a few questions like \"What are you trying to access on the server, is the program installed on your computer etc.\" I'd say 5 questions in total. Sure enough, my last questions goes on read, and 50 minutes later a ticket is submitted with \"URGENT\" in the title. At the same time, user 2 messages me directly.\n\n\"Hi x, do you mind helping user 1 with his program? It isn't working\"\n\n\"Hi user 2, I tried reaching user 1, but he isn't responding. Do you mind telling him to respond to my message?\"\n\n\"Can you just go talk to him?\" (He works in the building, but was not available at his desk)\n\n\"Proceed to tell the user I need my questions answered in order to help, and if he can answer those I'd be happy to help. User 1 didn't come see me, call or anything, just a teams message.\n\nNo response. Great.\n\nUser 2 later approaches me, telling me I need to go talk to him, and I ask if he can come see me or let me know through messages what I need to help. With a little back and fourth it seems like neither will budge on giving me anything more, so I pass a note to my manager and he got in touch and helped him.  \n\nIt's the same as going to a doctor and not saying where the pain is. \"Why won't you help\" lol.",
        "created_utc": 1670448115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spent my own money to troubleshoot a customer issue",
        "author": "anh86",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zfbtvp/spent_my_own_money_to_troubleshoot_a_customer/",
        "text": "I worked in support for a software company which made products for non-profit organizations to manage giving, keep donor databases, easily create web presences to support this type of activity, etc.\n\nOne of our products could quickly build and publish a simple donation web page. I get a support call that donations aren't going through. This was a pretty easy product to support, it was mostly rock solid and there were only a couple things that could go wrong with it. I get on a screenshare with him so I can see where it's failing out. The page loads fine and he's filling in the form. We get to the point where he has to enter the credit card number and he insists he must blank out the screen to type that in and click submit. He will re-engage the share as soon as the form is submitted. When he comes back, sure enough, we have a failure message. So I put him on hold, there's only a few things that can really go wrong but everything checks out perfectly. We go back on the screenshare and try again for good measure, he blanks it out in the same spot and I come back to the failure message as before. \n\nAt this point, I'm at a loss for what could be wrong so I tell him to hang on a second while I navigate to their donation page and attempt one myself. I'm able to donate as little as $1.00 so I do that, enter my info, and use my own credit card since it was all I had on hand. It works. So now I tell him everything looks great on the backend, it works in my test, it must be something wrong with his own card or how he's entering information in the time I am blocked out of his screenshare. Somehow me saying this instantly makes him realize what he was doing wrong and he tries something else on his end which now works.\n\nWith all being well (nothing was ever broken), I say that I'm glad the issue was resolved and please can you refund my $1.00. The $1.00 is never refunded (I believe he just forgot and nothing nefarious occurred over a single dollar) but still twice per year I receive donation appeal letters for a small non-profit orchestra house which is 800 miles from my home. At this point they've spent far more than $1.00 (probably several dollars) sending mail to be which will never get a response.",
        "created_utc": 1670443085,
        "upvote_ratio": 1.0
    },
    {
        "title": "The importance of spelling",
        "author": "Professional-Yak4361",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zf5jyo/the_importance_of_spelling/",
        "text": "Last month, a customer called tech support because of a printer problem or something (unimportant). I asked for her Teamviewer ID and password.\n\n**Her, super fast:** \"ID *\\*inaudible\\**, password *\\*inaudible\\**.\"  \n**Me:** \"Sorry, I was not ready, could you repeat please, more slowly ?\"  \n**Her, sounding annoyed:** \"1052639462, password 523-*\\*inaudible\\**...\"  \n**Me:** \"Sorry madam, could you please repeat your password? With examples of names for the letters?\"  \n**Her, sounding** ***really*** **annoyed and repeating veeery slowly**: \"5... 2... 3... Peter... Frank... 1.\"\n\nSo I typed in *523pf1*. Password invalid\n\n**Me:** \"Can I confirm the password with you, madam? 5, 2, 3, Paul, Fabian, 1?\"  \n**Her:** \"Yes.\"\n\n*523pf1*. Password invalid. I knew I typed it right, but couldn't figure out the issue.\n\n**Me:** \"Sorry madam, can you repeat the password one last time?\"  \n**Her, swearing, then loudly:** \"Number 5, number 2, number 3, P for Peter, F for Frank, O for One!\"\n\nIt took me a few seconds to realise: of all the names or words beginning with an O, she chose \"One\". Confusing af. I typed in *523pfo:* password valid. I solved her problem, hung up and screamed my frustration out.",
        "created_utc": 1670430371,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know",
        "author": "Retro-Digital-",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zf1hwa/i_dont_know/",
        "text": "So I get calls like this a lot. My coworkers and I dub them the I dont knows\n\nI dont care if you are someone is technologically illiterate. I get it- we all havent grown up with technology and arent intuitive with it.\n\nBut if youre just going to sit there and go I dont know to every single question I have when you say the computers not working. I dont know how to help you. \n\nRecent Interaction I had with a user:\n\nMe: Hello, thank you for calling the help desk, this is Retro, how can I assist you?\n\nUser: Hi I cant sign in.\n\nMe: Okay, no worries, should be an easy fix. What are you trying to sign into?\n\nUser: I dont know.\n\nMe: Are you trying to sign into a application, or a website?\n\nUser: I dont know. \n\nMe: Are you on the desktop of your computer or on the sign in page to login?\n\nUser: I dont know.\n\nMe: uhmcan you describe to me what you see on your screen? \n\nUser: yeah, its blue.\n\nMe: Does it have words on it?\n\nUser: errrh uhm- I dont know.\n\nMe: is there a window open?\n\nUser: I do not know.\n\nMy face is like this :| at this point Im irritated cuz this person has just chosen to shut their brain off and its pissing me off cuz its wasting my time since I cant help them.\n\nMe: what is it that youre trying to do on the computer?\n\nUser: I dont know Im a new hire the company just told me I need to do some stuff online.\n\nMe: okay- well Im going to place a ticket for you and have someone come out in person to assist.\n\nUser: okay but how long is that going to take because Ive been trying to do this for a while. \n\nMe: do what?\n\nUser: Use the computer to finish my onboarding.\n\nMe: and what were the instructions you were given?\n\nUser: I dont know.\n\nMe: well sir unfortunately in that case I dont know how to assist you since Im not entirely sure what your issue is.\n\nUser: what do you mean? I cant sign in! Isnt this the number for It support? \n\nMe: yes it is but I dont know what it is youre trying to sign into.\n\nUser: the computer!\n\nMe: okay then, so do you see a login screen in front of you that says username and password?\n\nUser is silent for a long time and doesnt answer; I can hear him moving and shuffling some things. Finally he just hangs up.",
        "created_utc": 1670420722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notice to all IT Staff, pants/bottoms must be worn when working remotely",
        "author": "Dunnachius",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zf07e3/notice_to_all_it_staff_pantsbottoms_must_be_worn/",
        "text": "About a month ago they finally started letting more people work remotely at stupidco. Not all positions are eligible. IT has been given hybrid work options. \n\n\nApparently its the in thing to do and someone decided that it makes the company/institution more marketable for new hires. Its been a huge change in the way we operate and I think its because they realized they could cancel the multimillion dollar office move and possibly save some money.\n\n\nThis memo came into our department today. Were also down one intern and the boss just says that the intern is no longer with us which for a min wage student intern is code for he dun somethin stupid, no one quits an internship that they are working for college credits.\n\nThe new policy allows half the IT staff on remote in any given shift to handle remote/ing on to computers for low level stuff. But we CAN get pulled in to work if needed.\n\nWe fairly rotate through who gets remote but not everyone takes the opportunity, as some just dont like working remotely. Also interns generally wont be allowed to until they get the nod that they dont need babysat anymore. \n\n\nI dont have the whole story here but Im reading between the lines. I know working remotely is an excuse for pajamas but dang\n\n\nMake sure your at least mostly presentable before you take the post-it off your camera.\n\nI mean Im in jeans and a t-shirt when working remotely. \n\n\nI so want to hear the story about what this idiot did to force this new rule into existence.\n\n\nOn a side note the IT department is now shipping laptops to new hires who live over X00 miles from the office.",
        "created_utc": 1670416912,
        "upvote_ratio": 1.0
    },
    {
        "title": "The good old lovetap",
        "author": "Awkward_Ad75",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zey71z/the_good_old_lovetap/",
        "text": "  \n\nPls ignore any typos and formating.   \nThis story is second-hand from a buddy of mine.  \nPropaply not the best way to tell that story either cause on a train rn but decided to post it anyways.   \nNames changed for privacy reasons.\n\nRon = My buddy the tech-support-guy\n\nIT1 = SBS-Programmer 1 (Lazy/Stupid)\n\nITR = IT-repair-guy\n\nSo lets start it here:\n\nRon was in a meeting with IT1 when suddenly IT1 lifted up his Laptop a few centimeters oft he table and just dropped it back on the table and continued as if nothing happened after a few seconds of silence Ron asked what the hell was that? IT1 well sometimes the wifi-reciver stops working and giving it a little love tap usually fixes it and he never bothered to fix cause *It wasnt worth the time*. (insert Ron facepalming into an other dimension) Ron still a bit shocked told IT1 to go downstairs with him after the meeting to ITRs workshop. One walk downstairs 8 Screws and a short talk later and IT1 had a new wifi-reciver. Well and guess what, a few months later same thing again at a meeting. When Ron went to investigate how the hell wifi-recivers kept breaking he found out that IT1 just throws his bag with the laptop onto the backseat of his car cause well why not? Hard talking from the boss didnt help either,(after 2 more times Boss had enough). Well lets just say IT1 is free to hire now.\n\nMy grandma uses to say: I there might be some stuff growing in my garden that can cure death if i mix it right but there aint a thing there that can cure stupid.",
        "created_utc": 1670410334,
        "upvote_ratio": 1.0
    }
]