[
    {
        "title": "New driver question",
        "author": "kyscco24",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rfxdr/new_driver_question/",
        "text": "[removed]",
        "created_utc": 1529111108,
        "upvote_ratio": ""
    },
    {
        "title": "Damn truck drivers",
        "author": "KBsnipes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8renho/damn_truck_drivers/",
        "text": "The town I️ deliver in has two big truck stops right across the street from each other. The other day I️ was delivering  to one. The receipt said to call him when close and when I️ do this guy tells me he has a camo truck head and that  “you’ve never seen anything like it.” When I️ pull up he is outside his truck and come to my window. He tells me he needs to get money from the gas station across the street, so reluctantly I️ let him in so I️ could get paid and leave. \n\nDude seemed pretty cool so I️ wasn’t really worried. When taking a turn he thought I️ was going to drift and then started telling me about Senator McCains wife was a pro at drifting and kept going on. But half way to the gas station( like a minute later) he tells me I️ already got the money man, I️ just need beer and wasn’t tryna walk all the way over here. Overall didn’t really care, dude gave be like $8 tip and overall it was only like a 15 minute delivery there and back. But definitely the weirdest delivery I’ve ever taken. ",
        "created_utc": 1529099080,
        "upvote_ratio": ""
    },
    {
        "title": "Just got a job as a driver any tips?",
        "author": "DrakusMusic",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rcdl4/just_got_a_job_as_a_driver_any_tips/",
        "text": "",
        "created_utc": 1529080854,
        "upvote_ratio": ""
    },
    {
        "title": "The one time I almost got attacked by a pit bull.",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8r8ehh/the_one_time_i_almost_got_attacked_by_a_pit_bull/",
        "text": "So I was delivering one night and I had to a bit far from the store. I go to a not so great area and call them to come out. No answer. So I was like fuck, I’ll just go see if I can find them. I walk up to their house and this area has lots of houses with multiple units living in one house. I couldn’t really find a door so I walk to the side and I open a little gate. I smell a huge scent of weed hit me and I’m like the fuck? I look and there’s a blue light and a weed farm being grown. \n\nSuddenly these eyes glow in the dark and a pit bull starts charging me and barking ferociously at me. I start to run out and couldn’t get the gate closed behind me. The pit bull is still barking and chasing me as I try calming it down and saying it’s ok it’s ok! I was seconds away from throwing the pizza on the ground. Finally it calms down and backs off. I’m shaking at this point and go back to my car absolutely horrified. Finally call the guy again a few more times and he comes outside. He goes “dude you left my gate open...” I was fucking pissed.",
        "created_utc": 1529038921,
        "upvote_ratio": ""
    },
    {
        "title": "Ashamed for my school’s tip on Friday",
        "author": "Artteachernc",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8r6qk9/ashamed_for_my_schools_tip_on_friday/",
        "text": "So as 2 of my family members are Pizza Guys, I stepped out of my classroom on Friday when I smelled pizza to see what was going on. Guy was delivering a LOT of pizzas to the front office. First grade teacher was counting out cash to him. After he left I offered to help and asked nonchalantly, “so how much did you tip?” And she was like, “Oh 20%! $5!” I cleared my throat and asked how much the bill was. She said it was $200. I told her that 5 was not 20% of 200, and she laughed uncomfortably saying there was only 5 left over from what they collected from the kids.\n\nI shook my head and said they should factor in a proper tip, and then figure out how much each kid owes. (Or she should have paid the tip out of her own pocket.)\n\nCouldn’t wait to get home to share that with my family.\n\nSummary: teacher thinks 5 is 20% of 200",
        "created_utc": 1529021798,
        "upvote_ratio": ""
    },
    {
        "title": "Just started my first delivery shift today, a a $100 tip on my first delivery!",
        "author": "GodHatesFaps",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8r5dj6/just_started_my_first_delivery_shift_today_a_a/",
        "text": "Hey guys! I just picked up my first real job (I’m a student), and started my first shift today. To my luck, the first order I got was a $500 order of pizza to an event! I unloaded all 25 pizzas, drinks, wings, plates/forks/napkins and got a $100 tip! The next two places I delivered to were a two other big ($150) orders to conferences which I got a $30 tip for each. This job is fucking awesome. Can’t believe I made so much on my first ever shift. Goodluck guys!",
        "created_utc": 1529010143,
        "upvote_ratio": ""
    },
    {
        "title": "My car broke down, I'm very much not a car guy, can anyone give me advice on finding a new delivery vehicle?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8r3ol8/my_car_broke_down_im_very_much_not_a_car_guy_can/",
        "text": "Hey all,\n\nI deliver full time in the Los Angeles area.  The transmission went on the car I was using and the cost to replace it is worth more than the car.  So, I'm looking for a new fulltime vehicle.  \n\nI'm not much of a car guy, but I do know that delivery drives cars into the dirt, so I'm looking to pick something up that's easy to maintain, it's about my only requirement.  \n\nWhat cars do you all drive and what would you recommended?  Or maybe I should take this as some divine message that I need to get out of the pizza game, lol.  ",
        "created_utc": 1528997013,
        "upvote_ratio": ""
    },
    {
        "title": "Hug from cute little girl because I delivered her pizza",
        "author": "clarkkent1521",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8r2wns/hug_from_cute_little_girl_because_i_delivered_her/",
        "text": "It was a 7 mile delivery, order was $37.36, gave me a $2.64 tip. Gave the dad the food of 4 boxes. His hands were full so he asked his 3 year old daughter who was with him to close the door. He walks away and I stay to make sure she can close the door. But she runs out to me and yells in her little squeaking voice, \"I don't forget to hug you!,\" hugs me, then runs back inside, closes the door and screams \"pizza!\". That made up for the small $2.64 tip. ",
        "created_utc": 1528991397,
        "upvote_ratio": ""
    },
    {
        "title": "How are your shifts?",
        "author": "dlaw555",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qy2rb/how_are_your_shifts/",
        "text": "I’m curious, what do you guys bring home, how many deliveries do you take, and what’s your pay rate? \n\nI’ve moved from my old company to Dominos and so far my first 3 days I’ve left with $100+ but the most I ever made at other store was around 80 with lots of 30 or 40 nights ",
        "created_utc": 1528941443,
        "upvote_ratio": ""
    },
    {
        "title": "Extra sausage?",
        "author": "JadesterZ",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qtd5e/extra_sausage/",
        "text": "Im kind of in shock and my coworkers wouldn't have believed me if it weren't for the pictures, but I just ran a delivery to a Girl's Gone Wild video shoot! \n\nIt was a huge house with a giant pool with a 20 ft waterfall. I couldn't believe it was happening at the time and only managed to take a couple of pics (not sure if rules allow me to post any? They're all sfw if that matters)\n\nThey tipped REALLY well and we're all super nice. The guy running it was a little creepy though.\nHas anything like this happened to anyone else?? It was like straight out of a cheesy porno lmao",
        "created_utc": 1528904139,
        "upvote_ratio": ""
    },
    {
        "title": "i have never tipped ama",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qp3dd/i_have_never_tipped_ama/",
        "text": "[removed]",
        "created_utc": 1528858912,
        "upvote_ratio": ""
    },
    {
        "title": "Deep male voice and tips",
        "author": "8Fractals",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qo6aw/deep_male_voice_and_tips/",
        "text": "I have a very deep voice but when I greet customers I make sure to use a higher voice because I want to appear likeable. I read that a deep voice can sound intimidating to other men so I tend to not use it on them but I definitely use it with female customers. I wanna know if other drivers here have a deep voice as well ands if so does it help you in getting tips?",
        "created_utc": 1528850347,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for music to listen to white I work",
        "author": "poopinWhileIBrowze",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qg09n/looking_for_music_to_listen_to_white_i_work/",
        "text": "As the title says, I'm looking for new music to listen to while I work. I enjoy listening to whole albums at a time or specific Spotify playlists. I listen to podcasts too, but I'm specifically looking for music. I like all types of music (lots of rap lately) \nThanks!",
        "created_utc": 1528776745,
        "upvote_ratio": ""
    },
    {
        "title": "The moronic customer and his carpet f-bombing",
        "author": "SkylineFTW97",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qf0m3/the_moronic_customer_and_his_carpet_fbombing/",
        "text": "Disclaimer: This was typed on mobile, so expect the connotations that carries.\n\nThis one just happened last night at around 10:30. I've delivered here 2 or 3 times before, and this is the only noteworthy one, so I didn't expect anything from this guy.\n\nI get there and the order is about $21. The guy (who I should mention was in his underwear the whole time) decides to change it to credit the second I get there. At first, no big deal. It's annoying, but doable. Turns out, the guy has almost no reception and blames my manager for not being able to hear him clearly.\n\nHe quickly devolves into just absent mindedly calling him retarded and whatnot, all while almost compulsively saying \"Fucking\"between every number as he recites his card number. This quickly makes him near unintelligible over the phone, so I called the store from my phone since I had a good reception.\n\nHe has to repeat his card info multiple times before he gets it right, mostly due to the ever increasing use of the various iterations of the word \"Fuck\" he used in place of the card info. And somewhere in there, he mentioned that he manages a store of some sort, making me feel deeply sorry for his unfortunate underlings. Shockingly, he gave me a $4 tip and outright admitted he knows he's being an asshole for no reason. I don't know what logic he used to justify that one. ",
        "created_utc": 1528767617,
        "upvote_ratio": ""
    },
    {
        "title": "Need bud. Thinking about ordering from a pizza place and asking the driver.",
        "author": "soggyramen",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8qe95c/need_bud_thinking_about_ordering_from_a_pizza/",
        "text": "[removed]",
        "created_utc": 1528760910,
        "upvote_ratio": ""
    },
    {
        "title": "Crosspost from r/MaliciousCompliance - You want me to fold boxes? Oh I'll fold boxes.",
        "author": "LordBowler423",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8q2349/you_want_me_to_fold_boxes_oh_ill_fold_boxes/",
        "text": "",
        "created_utc": 1528732862,
        "upvote_ratio": ""
    },
    {
        "title": "What are the craziest business days you guys have ever worked in pizza?",
        "author": "Soronir",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q7nnt/what_are_the_craziest_business_days_you_guys_have/",
        "text": "I've got two stories. First, do you guys remember that fight a while back, Mayweather vs Mcgregor? We weren't ready for that night at all. Weren't staffed for it. Constant stream of big orders for parties watching the fight. Zero downtime, store is a mess, and we're open until midnight. It's ALMOST over, 11:56 PM, and some guy sends this Web Order through. More than $300 worth of pizza 4 minutes before close. If they'd tried to call it in we'd have ignored the phone we were that done with it. He didn't just order regular large pizzas, he ordered the giant-sized catering deep dish and catering breads. Took a long time to make that shit, I wasn't able to deliver it until a little after 1AM. By the time I was done cleaning the store and clocking out it was a little after 3AM. I've not heard of anyone being there so late at night before.\n\n\n\nSecond story occurred on the last Feb 29th on leap year. My chain had a special deal, get a large pizza and get the second one for 29 cents. They advertised it quite successfully. We were getting so many orders that all the stores in our franchise were running out of dough, sauce and cheese. Nobody had enough stocked or prepped to last the day. Our store held out the longest, and as the other stores ran out of shit and stopped taking orders, we started getting their business. People from well outside of our delivery range were coming in and placing orders. Hours before close we ran out of shit and had to stop taking orders too. The phones kept ringing off the hook and it was getting maddening so somebody went to whatever circuit box it is in the back of the store and unplugged the line. Well, they forgot to plug it back in. I opened the next day, was there for a couple of hours, and man it was so slow. Nobody is calling! All we've gotten is a few Web Orders and a couple of walk-ins. By the time we remembered the fucking phones were down and checked the call logs on the computer we could see that we'd been getting blown up with hundreds of calls, a lot of people calling over and over and over.",
        "created_utc": 1528702220,
        "upvote_ratio": ""
    },
    {
        "title": "Just Bring the Batteries",
        "author": "Undeadstab",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q7fg2/just_bring_the_batteries/",
        "text": "Tonight I had a strange request. It was during our late night preclose rush. I had this ticket that said “Just bring the batteries” for the delivery request. I am scratching my head at this point? What could that mean. As I’m inspecting the order I see under cooking requests it reads “6 aa batteries”  \n\nLol no fucking way am I buying batteries for a customer. \n\nThey ended up being a few girls, they wanted the pizza and didn’t really care about the batteries. I was worried they’d send me back or throw a fit lol.  Probably  a drunk desperate dude in the house needing batteries for god knows what. ",
        "created_utc": 1528699447,
        "upvote_ratio": ""
    },
    {
        "title": "Ordering 3 minutes before close with the excuse “don’t worry I have a great tip!”",
        "author": "Blvckhokage",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q70kb/ordering_3_minutes_before_close_with_the_excuse/",
        "text": "Then you say okay yeah sure why not if it gives me another 10 bucks or so. They usually order anywhere from 30-40 bucks worth of food and say “I really appreciate it. Here’s the cash, have a goodnight. Ah his total was 38.87 and I got two tens a five and fifteen singles. Anybody else experience this?",
        "created_utc": 1528694594,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers: How has delivering been on your cars?",
        "author": "clarkkent1521",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q3362/drivers_how_has_delivering_been_on_your_cars/",
        "text": "The extra miles, stop and go driving, turning the engine on and off dozens of times a day... How has all of this been on your car? Battery? Starter? Tires? Brakes? Overall? ",
        "created_utc": 1528658027,
        "upvote_ratio": ""
    },
    {
        "title": "The subway 7” special (extra sauce)",
        "author": "notmythrowawayatall_",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q1d48/the_subway_7_special_extra_sauce/",
        "text": "\n[background] \nI work at a delivery place on a college campus, lobby is open till 1am and we deliver till 4am. Usually get a party/bar rush at around 11-12ish. We deal with good amount of pretty drunken shenanigans. Mostly freshmen for juuling in the lobby while they wait for their food. But what I saw last night easily takes the cake. \n\n[the event] \nAround 11:30 I get back from a run and I really need to piss and I sort my shit out, let the kitchen know and head to the bathroom. I burst through the door and there they are. Some guy  has his girl bent over the sink thrusting away with one hand on her hip while the other hand has a firm grasp on a subway sandwich. He sees me in the mirror we make eye contact and he takes a bite and nods at me. I just shut the door and go to my manager and say “yeah theres a guy fucking a girl in the bathroom”. He goes in and stops them and tells them they have to wait outside for their food to be ready. \n\nI went back into the bathroom to check for “residue” didn’t find any but the bathroom did smell like a fuckhole and there was lettuce fucking everywhere. Fuck that guy,  fuck subway, and fuck their lettuce. \n\n[Clarification] I do not work at a subway the subway is located nearby. Kids sometimes bring it in and eat that in their lobby while their friends order. ",
        "created_utc": 1528643133,
        "upvote_ratio": ""
    },
    {
        "title": "Don't go in. You'll get accosted (assaulted)",
        "author": "Bobobaggins6666",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8q00wp/dont_go_in_youll_get_accosted_assaulted/",
        "text": "So this is just a story of my worst delivery that ended with me calling the cops (something I wouldn't do normally as a libertarian lol). I take this delivery for two 8 piece wing orders. This is basically the minimum for a delivery. Of course it's in the worst area of our delivery area  (I lived there at the time, heard the gunshots in my house). I get there and the girl promptly urges me to come inside which I do. Obvious dumb idea. I see then that there are quite a few ratchet ladies in there and they precede to argue and scream at each other about who is going to pay for their (less than 15 dollars) wings. That then say that they only want one of the 8 pieces. I say no, that's below delivery minimum, you can't do that. Then comes more screaming and cursing. I start to feel threatened and try to leave and as I put my hand through the door they slam my arm in the door and put their weights on it. At this point I lost my cool and screamed some profanities and managed to wrestle my arm out of the door. I walked out and one of them punched me in the back of my head  (didn't hirt, fucker couldn't even throw a good sucker punch) and another threw a lit cig that hit me in the neck \"I hope you catch on fire\". I called the police, something I would normally never do.  Not a single call back from the cop that gave me his card\n Don't really care cuz there's more important shit going on all the time.just pissed me off. Don't go into places if you feel uncomfortable ",
        "created_utc": 1528627209,
        "upvote_ratio": ""
    },
    {
        "title": "How do I handle inconsistently cooked pizza?",
        "author": "KCBassCadet",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8px6b7/how_do_i_handle_inconsistently_cooked_pizza/",
        "text": "On Dominos website, you can indicate \"well done\".  I would say not even 1 out of 5 times is there any change to how the pizza is cooked and I typically just eat a barely\\-cooked pizza rather than make a fuss. But I'm kinda getting sick of it.\n\nWhat's the right way of handling this without dicking\\-over the driver?   Should I type in the driver instruction field \"please make sure pizza is well done\"?  Or???",
        "created_utc": 1528590403,
        "upvote_ratio": ""
    },
    {
        "title": "Huge big stoner teddy bear",
        "author": "peterunwingeorgewall",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pul08/huge_big_stoner_teddy_bear/",
        "text": "I do pizza delivery as my second job.\nI live in Australia. And, well, I work here too. 40 year old male. Just giving context.\n\nSo this happened last year some time.\n\nI get a delivery for a place I haven't been to before. I get there, and knock on the door. A huge hairy bearded mother fucker opened the door. I could smell the pot smoke as soon as he opened the door. (Which is not at all unusual.) When he saw that I had pizza, the grin that spread across his face, well, it was infectious.\n\n\"Guys. Pizzas here.\" he called.\n\nHe took the pizzas. He paid. He then asked if I had any menus.\n\"Sorry man. But if I'm coming back past this way I'll drop one in.\"\n\n\"No stress dude. All good.\"\n\nI don't end up going past there that night.\nBut the following week I get a delivery on the same road.\nSo I make sure to grab a menu.\nI call in there on my way back to the shop and knock on the door.\n\nAfter a moment the door opens a crack and he peers out.\n\"Ahh, I delivered pizza here last week and I have a menu.\"\n\nThat grin again.\n\nHe opened the door and called \"Hey guys. It's the guy who delivered our pizzas last week. And he's got a menu.\"\nAs far as he was concerned, I was the greatest guy in the world.\nHe said if I ever needed any weed to let him know.\n\nA couple of hours later I was delivering to another place and the instructions were to go to the shed out the back. I knock on the shed door and open it. There's some guys sitting around a table playing poker including my new friend.\n\n\"HEY.\" he says. \"It's my pizza dude.\" He then gets up and gives me a huge hug. I had no choice. I had to hug him back. And it was good.\nHe then proceeds to tell the rest of the guys how awesome I was for remembering to bring him a menu.\nThey just smiled and nodded as if they were thinking \"Man. He's so fucking stoned.\"\n\nAnyway. That made my night.\nI've delivered to him a few other times. And he is always cool and friendly. \n\nI've got other stories that I'll share over time.",
        "created_utc": 1528567229,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong addresses and asshole customers (aka, I had a bad night and need to vent)",
        "author": "PhunkyPhazon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pqcug/wrong_addresses_and_asshole_customers_aka_i_had_a/",
        "text": "I considered making this two separate topics, as tonight gave me two different stories worth talking about. But I'm in the mood to just vent, so here we go.\n\n**Story #1**: this one doubles as a PSA for customers: **please please PLEASE double check your address and information before placing an order**. Earlier I took a fairly standard delivery, just a couple pizzas and maybe a side of cheese bread or whatever. A bit on the farther end of our delivery area, but nothing too bad. I pull up to the house, and immediately I can hear multiple small dogs yipping at my presence. I go up and ring the doorbell, the dogs go into hysterics. But no one shows up. I ring it again. And again. I know the doorbell is working fine, since I can hear it going off. Finally I open the outer screen\\-door to knock. Still nothing.\n\nUnfortunately I'm not in the habit of bringing my phone to the door (I usually place it in the cupholder and leave it there for GPS purposes), so with a sigh I go back and grab it. I call the customer's number. Several rings, then voicemail. I try again. Same thing. After a third attempt, I've given up. I call the store and tell them the customer isn't answering the door and I can't contact them, so I drive away (in hindsight I know probably should have left the customer a message, I was a bit frustrated at the time and didn't know what I'd say).\n\nI'm about halfway back to the store when the customer finally calls me back. I explain what happened, she apologizes and says she meant to leave a delivery remark to please knock loudly, because they're upstairs and can't normally hear the doorbell there (Side note: this is a massive peeve of mine. If you ordered pizza and are expecting company at any second, why are you hanging around somewhere where you KNOW you can't hear the front door?). I get off the phone and head on back, and I'm already feeling like something is off. If they couldn't hear the doorbell or the knocking, fine. But there's no way they wouldn't have heard the dogs going crazy, right?\n\nWell I get back and, wouldn't you know it, they're still not answering. After another phone call it turns out, OOPS, this is her parent's address. She actually lives *in an entirely different city.* All of this trouble and a good 40 minutes on the road amounts to nothing but a complete waste of my time.\n\n**Story #2:** This other customer just made me feel super uncomfortable, and was the sort of person I half\\-wish had given me an excuse to call the cops. He comes to the door and first spends a good 30 seconds or so chastising his dog (this almost never leaves a good first impression imo). He finally steps outside, with his little boy (maybe 4 years old) following behind him. He hands me the cash and I read off the order to make sure it's accurate. A pizza, chicken wings, and an order of donut holes. \n\nWhen I repeat the latter, he suddenly blurts: \"WHO THE HELL ORDERED THE GOD DAMN DONUT HOLES!?\" He's looking at me as if he's expecting an answer; of course I'm a little taken aback and say nothing. At first I thought he was trying to tell me he didn't order them, but then he goes \"Was it my stupid wife?\" At a bit of a loss, I just look at the customer's name on the box and repeat it. Then he goes \"It's okay, you can say it. Say it was my stupid wife.\" He's laughing like this is just a joke, like I should just agree with him and call his wife stupid. Let me remind you: HIS SMALL SON IS RIGHT THERE, AND THE GUY KNOWS IT.\n\nI don't really remember what I said after this, probably just a fake laugh as I handed him the order. Then I tried to act casual as possible while I got the fuck out of there.\n\nThank fuck I don't see this kind of customer often, because he was very much the sort of person I would have \\*loved\\* to have been openly hostile with if I hadn't been on the job. Probably wouldn't have been the smart move, but people like him really make me feel sick. I can just imagine him going back inside afterward and immediately rounding on his wife for daring to order something he hadn't permitted.\n\nAt least he gave a decent tip, I guess?\n\ntl,dr: One customer led me on a wild goose chase for a long time, and another was just a straight\\-up asshole that put me in an uncomfortable situation.",
        "created_utc": 1528517897,
        "upvote_ratio": ""
    },
    {
        "title": "Well that was unexpected",
        "author": "Ninja_rooster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pqbdv/well_that_was_unexpected/",
        "text": "Walk up to an apartment. Music playing inside. Knock. Hear some commotion inside. Door opens. Make eye contac-AH okay wasn’t expecting female wearing a towel and undies. Avert eyes to avoid being creep. They land on her girlfriend on the couch behind her, who is similarly dressed, minus towel. Re-avert eyes. Yep it’s just awkward now, here’s your pizza, and receipt. May I also suggest requesting a non married individual for your next delivery. Thanks. \n\n\nEven got a $2 tip! \n\nTL;DR: walked in on lesbian session. So how’s your night going?",
        "created_utc": 1528517423,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering in college towns?",
        "author": "lifeunexisted",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pptdy/delivering_in_college_towns/",
        "text": "I'm going to be moving to a college town and I was wondering what it like delivering there? I've heard college kids don't tip well and that I probably won't make any money there.\n\nI'm on mobile so sorry for the formatting.",
        "created_utc": 1528512105,
        "upvote_ratio": ""
    },
    {
        "title": "So we are supposed to be safe and vigilant, but now Dominos has my girlfriend delivering to a van in a Best Buy parking lot with Hot Spots?",
        "author": "shizzlefonizzle",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pn3zo/so_we_are_supposed_to_be_safe_and_vigilant_but/",
        "text": "For context, I've mostly been a driver off and on for many, many, many years. I remember when we were told that if it didn't feel right and our gut told us something was wrong to walk away. Now they have us delivering to weird seedy places, and half the time to weird seedy people?\n\nI've moved more to management than driving, but this Hot Spot thing is a bad idea imho. I feel at some point someone is going to get murdered, robbed, beaten, or all three and it's going to stop.\n\nMy girlfriend just delivered to a creepy rape van in a Best Buy parking lot to a guy who looked like he came straight out of deliverance who was hitting on her. How is that safe? Especially for females?\n\nThe official Dominos answer is that the order has to be online and prepaid, so that makes it safe. I don't see the correlation. Plenty of people have killed using online services that could trace them, and credit card info is easily stolen these days. I know I am talking about rare instances, but this to me just makes no common sense.\n",
        "created_utc": 1528488390,
        "upvote_ratio": ""
    },
    {
        "title": "MiniMansion Assholes",
        "author": "howtrulyodd",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8plyxy/minimansion_assholes/",
        "text": "HeadsUp: Postingonmyphoneokaynohatepleasethankyou\n\n\nSo, I delivered for a pizza company named after as famous jazz singer, a game you play with dotted blocks, you get my drift. I had the misfortune of being employed in a rich area. Tl;dr they're all assholes who will not tip just don't work in these areas.\n\n\nI was working a Friday midday to evening shift and I get a HUGE order for $120 worth of pizza. I'm thinking, \"Sweet! I should have at least another $10 in my pocket! Maybe more!\" I'm excited. I get this stack of pizzas the same height as me (I'm 5') and load it in my suv quickly, put in the address in my phone and... nothing. Google isn't showing me a clear house as a destination, but it's in a neighborhood as I just assume the default image is a glitch or something. This address sends me all the way to the North side of the city. I get to where the map set a marker and it's an empty corner lot; I think it can't be right so I drive around looking at the house numbers. Lo and behold I don't find the number, of course. I call my boss and tell him that this address literally doesn't exist. He calls the customer then calls me back and tells me they put in the wrong address. I'm frustrated because this new address is on the very South side of the city, but I put it in and be on my way, dodging traffic and making it there quickly. It brings me to a cul-de-sac of actual minimansions. These are absolutely enormous houses, Lambos in the driveways and everything. I find the house, pull up in their circle driveway to the front and start getting this giant stack of pizzas out. The lady that greets me is a cunt of course, watching me carry the thing and then get it all out for her as I hand it to her husband in three parts. The entire time I'm smiling and trying to make light conversation, compliment the house, apologize for the slightly longer wait but reassure they were still very hot despite the wrong address, etc. I pick up my bag and look at her, give her the clipboard to sign, and then she turns away and goes into the house and promptly slams the door in my face.\n\n\nI was pissed off because I actually lost money delivering to these people. I basically paid to deliver to these douchebags. I was heavily thinking about doing donuts in their yard before taking off and deeply regret not doing so.\n\n\nNeedless to say, I quit shortly after due to literally never getting tips, and only getting paid $3.85/hr, and made it clear why I was quitting. I still get annoyed thinking about it, honestly. I will always deter anyone from delivering for them.",
        "created_utc": 1528480075,
        "upvote_ratio": ""
    },
    {
        "title": "Who's fault was it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pg5vn/whos_fault_was_it/",
        "text": "[deleted]",
        "created_utc": 1528424018,
        "upvote_ratio": ""
    },
    {
        "title": "She knew did wrong.",
        "author": "bosspugs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pfvpg/she_knew_did_wrong/",
        "text": "Was bringing a delivery to an apartment complex today when some other tenant yelled \"I'll take that!\"\n\nI must've noticeably grimaced (and kind of swung the soda forward about to throw it)\n\nThen she puts her head down and said \"... i know\" and walked off.",
        "created_utc": 1528421451,
        "upvote_ratio": ""
    },
    {
        "title": "Conflicted on how much to tip.",
        "author": "networkedquokka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pfp6q/conflicted_on_how_much_to_tip/",
        "text": "[removed]",
        "created_utc": 1528419859,
        "upvote_ratio": ""
    },
    {
        "title": "Should I work for Domino's doing Delivery or Panera doing Delivery?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pbzld/should_i_work_for_dominos_doing_delivery_or/",
        "text": "I just need to know which is better and which can make more money.  I am leaning towards Domino's because I don't think many people order Panera's delivery, also their uniform is hideous.",
        "created_utc": 1528390880,
        "upvote_ratio": ""
    },
    {
        "title": "Alright, anything I should know?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pacql/alright_anything_i_should_know/",
        "text": "[deleted]",
        "created_utc": 1528378555,
        "upvote_ratio": ""
    },
    {
        "title": "Cross-post - man arrested for mixing rat poison into cheese at pizza place",
        "author": "mtmsla",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8pa7ps/crosspost_man_arrested_for_mixing_rat_poison_into/",
        "text": "[https://www.reddit.com/r/news/comments/8p5cpf/man\\_arrested\\_for\\_mixing\\_rat\\_poison\\_into\\_cheese\\_at/](https://www.reddit.com/r/news/comments/8p5cpf/man_arrested_for_mixing_rat_poison_into_cheese_at/)",
        "created_utc": 1528377351,
        "upvote_ratio": ""
    },
    {
        "title": "We don’t have thin crust right now.",
        "author": "Axtwyt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p8p4z/we_dont_have_thin_crust_right_now/",
        "text": "So, here’s some context:\n\nThe pizza place where I work has three kinds of crust for pizza; regular, thin, and thick. Today, we ran out of thin crusts for our largest pizza size. If anyone called in an order, we could not give them a large thin pizza.\n\nCut to 11:40 tonight. Me and my closing manager are working through our cleaning tasks before the store closes at midnight. The phone rings. We dread it. Everyone hates the phone calls right before closing.\n\nI pick up the phone and get started with the order. Guy asks me what specials we have. I give him a few options we have all the time, and he asks for (you guessed it!) a large thin pizza. I inform the guy that we don’t currently have any large thin crusts at the moment.\n\nHe goes silent for a second before responding with exactly what I told him. I tell him he can get regular or thick in large or thin crust in the medium size. He repeats that we don’t have thin crust as he apparently walks away from the phone. I stay on the line with him for a minute, telling my manager what’s going on. After a minute of silence from his end, I say hello to check if he’s still there. The call ends. He doesn’t call back.\n\nThat was the last phone call of the night.",
        "created_utc": 1528360817,
        "upvote_ratio": ""
    },
    {
        "title": "Do driver who have the logo on the too of their cars wave to each other?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p8h7b/do_driver_who_have_the_logo_on_the_too_of_their/",
        "text": "[deleted]",
        "created_utc": 1528357901,
        "upvote_ratio": ""
    },
    {
        "title": "[RANT] Duties as the delivery driver",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p8a1d/rant_duties_as_the_delivery_driver/",
        "text": "[deleted]",
        "created_utc": 1528355590,
        "upvote_ratio": ""
    },
    {
        "title": "Going into people's houses.",
        "author": "Bobobaggins6666",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p84dz/going_into_peoples_houses/",
        "text": "I assume no pizza delivery peeps just walk into customers houses as soon as they open the door. But I get people that almost seem offended when I dont. They'll open the door and walk away and I'll just stand there and say \"would you like me to bring this in for you?\" Which I have no problem with if I feel 100% safe. But even if I'm bringing you pizza doesn't make me not a stranger so I feel i need the verbal confirmation. ",
        "created_utc": 1528353848,
        "upvote_ratio": ""
    },
    {
        "title": "I snapped today",
        "author": "alibryan915",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p6lkd/i_snapped_today/",
        "text": "I like this board, its helped me realize that we all deal with the same things. Today I took an order to a park, where some people where celebrating the last day of school. So, I pull up to the park and there's all these middle schoolers there and theres two groups, one by the eating area and one by the swings. So the kids by the swings start yelling at me and saying its their pizza and bring it to them. Then they start cursing at me to bring it to them and insulting me. I know its not for them, I bring it to the eating area. I go to get the sodas out of my car, and these kids start walking up to my car and cursing at me and insulting me. I just snapped and cursed them out. I was more pissed that they got me angry in front of customers. So they leave and I apologize to the customers, and they weren't even angry. This isn't my worst delivery , but its one the worst.",
        "created_utc": 1528337963,
        "upvote_ratio": ""
    },
    {
        "title": "legendary pizza shops",
        "author": "jeromes_dream",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p67cx/legendary_pizza_shops/",
        "text": "There’s a pizza shop in my town that’s open for 4 hours a day, 4 days a week, only has pizza on the menu in one size, has no dine in or delivery, only pick up. I find this totally unbelievable but then you taste the pizza and you understand.\n\nDo you guys have any strange pizza shops?",
        "created_utc": 1528334362,
        "upvote_ratio": ""
    },
    {
        "title": "Flat tire.....but it's my spare.",
        "author": "solitario195",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8p5vd5/flat_tirebut_its_my_spare/",
        "text": "Not much of a story, got a flat tire yesterday only to have my spare go at the start of a triple today. Anyone want to talk while I wait for the tow truck.",
        "created_utc": 1528331369,
        "upvote_ratio": ""
    },
    {
        "title": "Have a good evening!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8oww7u/have_a_good_evening/",
        "text": "[deleted]",
        "created_utc": 1528251436,
        "upvote_ratio": ""
    },
    {
        "title": "Ordered a pizza to a party last night",
        "author": "jlore82",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8osd30/ordered_a_pizza_to_a_party_last_night/",
        "text": "So last night, my friend had a party and being drunk he decided to order pizza for everyone there. Since it was around 1 in the morning only one place was open, and even though the pizza isn’t great, it was free for everyone and everyone was drunk so we didn’t really care.  \n\nFast forward to the pizza arriving and I make sure that if my friend isn’t tipping well, I will because I too deliver pizzas and know the annoying feeling of getting no tip or very little tip for a far. I go to get my wallet while my friend gets the door and I walk back to the front and my friend is asking the guy “Hey, want a shot?” It sounded like a drunken joke but before i could process what was going on, the delivery guy took a big swig of Titos straight from the bottle and proceeded to say “Thanks man, I’ve been waiting to do a shot with a customer, I have a flask in my car!” My friend then says “ If you hit this shot, I will give you the rest of the bottle!” To which the delivery guy promptly takes the ball, takes a shot and misses. He was out of there in two seconds after he missed the shot and drove off into the night. \n\n This isn’t a personal story from me delivering, but as both a customer and delivery driver, I still cannot believe what I saw last night. ",
        "created_utc": 1528217199,
        "upvote_ratio": ""
    },
    {
        "title": "What is the dumbest thing a coworker has done to get fired?",
        "author": "North_Polian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8oot90/what_is_the_dumbest_thing_a_coworker_has_done_to/",
        "text": "Was bartending at my shop tonight. The bartender is also the MoD for the shift. Had a guest call and say that one of our drivers stole a pack of cigarettes off of her front porch. The dumbass even left the pizza bag on her front porch. She said that she had a security camera video footage of him taking them and was willing to email it to the store. I told her not to worry and that I would take care of it. I offered her a store credit for the cigarettes, which she declined. She wasn’t worried about the money, just the principle of the whole situation. When the driver got back to the store I met him at his car. He had two packs of cigarettes. The brand he usually smokes and another pack that was the brand that the lady said was stolen. The driver denied stealing the cigarettes saying that the second pack was his wife’s, who also uses his car. I would have been willing to maybe let it slide if he had been honest with me. I would have had him go back and get the pizza bag, return the cigarettes and apologize. Once he lied to me, remember she had video footage, I was done. Sent him home and told him that he had to talk to my GM before coming back. I called and talked to the GM and he said that the driver wouldn’t be back. I had to take the rest of the deliveries and go and pick up the bag he left. The lady was really cool about the whole thing. I apologize again and she said that it wasn’t my fault, some people are just that way. Best part of the entire thing was that me and my two inside closers had to do all of the drivers dishes and closing cleaning. Both of my insiders were ok with it because they both hated the driver anyways. We probably got done sooner without him there. Oh well, I’m drinking a beer now and have tomorrow off. ",
        "created_utc": 1528182602,
        "upvote_ratio": ""
    },
    {
        "title": "Some faith restored",
        "author": "ButterflyAssassin900",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8omvv8/some_faith_restored/",
        "text": "Just thought I would share this nice little story that just happened but I work with the big Papa and recently in my area, we have started doing apartment nights where one manager will take a hand full of pizzas to the designated apartment complex, set up a tent and sell the pizzas/garlic knots between 5-7pm. Now, I like in Phoenix so at this time of year, coming out here is absolute hell because of the endless flies and the heat. I had just sold 2 pizzas to a lady that asked if I had anything to drink. I said I had just run out but I'll be fine for the next hour. She absolutely insisted on getting me some new cold water from the gas station and I caved. She came back 15 minutes with an entire gallon of cold water and a Gatorade too. After all the people I've worked with, I just can't believe some people would go so out of their way to be so kind. But seriously, thank you so much you wonderful woman.",
        "created_utc": 1528162539,
        "upvote_ratio": ""
    },
    {
        "title": "Preachy Engineer guy",
        "author": "JonathanWarner",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8olajk/preachy_engineer_guy/",
        "text": "\nSo basically the guy opens the door and started with asking me if I was in school.  Here's the abbreviated version, he went on for like 10 minutes.\n\n\"You go to university X?\"\n\nYes I do\n\n\"What are you studying?\"\n\nDouble majoring in Psychology and Marketing\n\n\"Oh that's useless you should switch to engineering, University X has a great engineering program.\"\n\nI'm graduating soon with these degrees so I can become a data analyst for Specific Marketing Research company.\n\n\"Oh anyone can do that, marketing is just a fancy word for sales, you should switch majors, I'm 61 years old and believe me if you're good at math you should be an engineer\"\n\nNo that's not what I would be doing at all, I would be working in SPSS and setting up dashboards for clients to interact with.\n\nNo offense sir, but the Marketing Research is in high demand and it's quite lucrative. I could work for any number of companies, doing something I'm passionate about and trained to do. Engineering simply isn't in the plan for me.\n\n\"Well you're wasting your time, I'm telling you an engineering degree is what bullshit statistic % of CEO's have\"\n\nOf course, have a great day sir.\n\n\"Listen I've just given you the best advice you'll ever get! Engineering is blah blah blah\"\n\nWhat is up with people like this? Like I appreciate his \"concern\" if you could call it that but really does he just gatekeep engineering with everyone he talks to? \n\n\nHopefully my meager income in the wrong profession will afford me to tip 8% someday /s\n\n\n\n\n\n",
        "created_utc": 1528149031,
        "upvote_ratio": ""
    },
    {
        "title": "A strange man.",
        "author": "Kiddie_Cannon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ojqew/a_strange_man/",
        "text": "I was at the front of dominos store manning the phones and touch screens. I get a call from this man with this strange name. I dont fully remember his name but it was along the line of \"Slappy S..\" something. When I heard him talk he had this corny, raspy voice. So I took his order and throughout the call he kept telling at someone. Thank god he didn't ask for delivery I didnt want to lose one of my friends to this man. After a while the man came in, I could smell him from the moment he walked in and it smelled like a rotting corpse. I thought this man had walked out of a morgue. He was a small skinny man of African descent. His arms were slight deformed and he had a hearing aid. His hair was unkempt and was in patches on his head. We gave him his pizza and told him he didnt pay but he kept saying that he did when he obviously didnt. The man kept getting more and more furious I was scared because I thought he would jump over the counter and bite me and give me some sort of disease. Everyone else was afraid even the assistant manager. He pulled out a cigarette when it said no smoking but we didnt want to tell him otherwise. Shortly after he payed and left with his pizza.\n\n\nPossibly the scariest customer I took an order for at dominos.",
        "created_utc": 1528137647,
        "upvote_ratio": ""
    },
    {
        "title": "Toll Roads",
        "author": "nertnertchurity",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8oevcr/toll_roads/",
        "text": "Just say no.",
        "created_utc": 1528090088,
        "upvote_ratio": ""
    },
    {
        "title": "TIFU by muttering a Rocket League reference and now my whole store needs to take a racial discrimination course.",
        "author": "Ah-Um",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ods0u/tifu_by_muttering_a_rocket_league_reference_and/",
        "text": "So what happened was I delivered a pizza to a Native American guy. He didn't tip me, and after he closed the door and I'm walking away, I muttered to myself \"Savage! Savage! Savage! Chat disabled for three seconds.\" Apparently he had a window open or something and heard me say it. He reported me after I left for calling him a racial slur. I feel horrible about the whole thing, but my coworkers find it hilarious.",
        "created_utc": 1528078813,
        "upvote_ratio": ""
    },
    {
        "title": "What is the craziest/most interesting request you’ve got on a receipt ?",
        "author": "croissantzzz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8obf2g/what_is_the_craziestmost_interesting_request/",
        "text": "Last night someone told me to honk my horn when I got outside their home? ",
        "created_utc": 1528057641,
        "upvote_ratio": ""
    },
    {
        "title": "A nice car and an empty head",
        "author": "DarkMatterBurrito",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o7sfi/a_nice_car_and_an_empty_head/",
        "text": "Last night this combination reared its head when we ran out of hot bags on a night with heavy rains, which always makes for an extremely busy few hours. Dude decides to use 5 hot bags \\(when we need every last one of them elsewhere\\) to take several orders to a local indoor bounce park instead of utilizing the several large steel frame cases that hold ten each. Why? Because he always puts hot bags into his trunk because he's like 19 and drives an Audi A4. Since the large holders would have to go in his backseat, he opted to screw over everyone else for the sake of his car. I had to wait until he returned to take my orders. And yes, I understand that we do need to get more bags for a better buffer. He is also one of those guys that just stands around like he has no idea what to do; won't answer phones, anything. I can't decide if it's laziness or willful ignorance, but that's a tangent.\n\nAnyone have drivers like this at their shop?",
        "created_utc": 1528022910,
        "upvote_ratio": ""
    },
    {
        "title": "Hello pizza delivery driver",
        "author": "nertnertchurity",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o72pj/hello_pizza_delivery_driver/",
        "text": "I too am a pizza delivery driver, for hizza put. Going on 3 months, probably the best job I've ever had. I want to talk about what yall do when you get off at the end of the night. Sometimes it's 11, sometimes it's 12. Tonight it was past 2am. I get off, go home, or wherever I am crashing...drink beer, smoke cigarettes, and listen to whatever is on NPR. What do yall do?",
        "created_utc": 1528011413,
        "upvote_ratio": ""
    },
    {
        "title": "Fake Addresses",
        "author": "Ninja_rooster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o6th6/fake_addresses/",
        "text": "Alright guys, quick story.  \n\nSo the other night I take a run. Actually it was early evening, but that’s not really relevant. I take a delivery to an apartment complex that usually has shitty tips, but is safe otherwise.  \n\nI arrive at the building, climb the stairs, and knock on the appropriate door. Dude starts waving at me from inside, wildly gesturing. Finically he gets up, while on the phone, and leans to his window.  \n\n*thick European accent*  \n“I did not order” \nMe: “Is this Building ABC, number 123?” \nEA: “Yes but I not order. Maybe neighbors”  \n\nHuh, whatever, weird. I call the number, no answer. Knock on the door next to it, in case maybe it was actually the neighbors. No answer. Damn... I turn around and start to head back to my car, giving the number one last try. SUCCESS. \n\nSketchAssDude: “uhh hello...” \nMe: “Hey! This is Ninjarooster with Dominoms pizza, could you reconfirm your address?” \nSAD: “Uhhhhh yeah it’s Building ABC, number 123”. \nMe: “okay, I was just at that address and they turned me away...” \nSAD“Oh uh... okay um.. oh I’m actually out by your car! Yeah uh just meet me by you car.”  \nMe: “okay man, see you there” \n*Me internally* fuckimgettingjumped.jpg    \n\nI walk to my car, scanning all surroundings the entire time. Dude is heading over from an entirely different building.  \nSAD: “uh sorry yeah man I actually live over in uhh.. *points to building XYZ*. I just moved to the area. Kinda hard figuring stuff out ya know..” \n Me: “yeah no worries man, haveagoodnight..” \n\nDidn’t get mugged, dude was alone, but for fuuucks sake.\n\nWtf.jpg \n\n\nEDIT: Sorry, posted on mobile and formatting took a dump on itself. ",
        "created_utc": 1528007613,
        "upvote_ratio": ""
    },
    {
        "title": "I committed a cardinal sin.",
        "author": "ChristPanda",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o4q1v/i_committed_a_cardinal_sin/",
        "text": "Love those \"is that for me\" or \"I'll take that from you\" jokes 100 times a day as we all do?\nWell today I delivered to a mattress store and joked that I couldn't work there, I'd always be falling asleep. The look in the guys eyes instantly let me know what I had done. I feel so empty inside.",
        "created_utc": 1527984163,
        "upvote_ratio": ""
    },
    {
        "title": "Wanna learn how to get around a new city?",
        "author": "Driddle07",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o4e67/wanna_learn_how_to_get_around_a_new_city/",
        "text": "Just become a pizza delivery driver. I moved to a new town about 8 months ago and for 6 of it I was a delivery driver. I enjoyed it quite a bit and man did I learn how to get around. The ins and outs plus some short cuts, it's the second time in my life I've become a delivery driver to learn how to get around. It's a great life hack and the job can be a lot of fun.",
        "created_utc": 1527980986,
        "upvote_ratio": ""
    },
    {
        "title": "Had to pay out at the end of shift, advice?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o33u8/had_to_pay_out_at_the_end_of_shift_advice/",
        "text": "[deleted]",
        "created_utc": 1527969049,
        "upvote_ratio": ""
    },
    {
        "title": "That moment you know you delivered to the wrong place before you check..",
        "author": "Prosciutto_Papi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8o1lx6/that_moment_you_know_you_delivered_to_the_wrong/",
        "text": "I swear everyone gets the same look on their face when they didn't order lol",
        "created_utc": 1527956017,
        "upvote_ratio": ""
    },
    {
        "title": "Ex Pizza delivery driver horror story",
        "author": "walkerdog999",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nxkqc/ex_pizza_delivery_driver_horror_story/",
        "text": "Obligatory first time poster, long time lurker.\n\nI delivered pizza my freshman year of college at a local dominos on the weekend to earn some extra cash and never had any major disasters or mess ups until this day..\nI was delivering to a neighborhood that I was familiar with, upper middle class, suburban, white picket fences, that sort of thing. It was a fairly large delivery, about 4 or 5 pizzas. Pepperoni if my memory serves me right. I take the pizzas out of my car in the large hot bag and take them to the door. all is normal, I take them out of the bag to prepare to hand them to the large middle aged white woman who answered the door. She appeared to have been having a small birthday party for her children, with decorations and birthday presents visible from the doorway. She asks if I'll bring the pizzas in and set them on the counter, normally I try not to go in people's homes, but she seemed nice and I figured what could go wrong. I walk inside and make it to the kitchen with a stack of pizza boxes obstructing my vision of what is around me. I go to place the boxes on the counter and hear something crash to the ground.. My heart dropped.. I set the pizzas down and see what I have done. She had a lit candle on the counter and I have knocked it off the counter, broken the glass, and spilled hot wax all over this poor women's kitchen floor and counter. I immediately start profusely apologize and offer to clean up the mess I have caused. She politely declined my offer, barely even glancing over the mess I have caused and the smile never left her face. She insists that she will clean it up and that it's no big deal. I finally get to the point of our transaction where she signs for the pizzas. Of course I felt terrible and was in no way expecting a tip at this point. She signs the receipt and I leave before I cause any more stress to this woman's day. I get in the car and check the receipt to see she had given me a 15 dollar tip. I was elated but slightly guilty.\n\nWith all the stories off awful tippers and people who stiff habitually I thought I would share a story gone wrong but with a happy ending, at least for the pizza man.",
        "created_utc": 1527906501,
        "upvote_ratio": ""
    },
    {
        "title": "I was reminded of this by the post that made it to the front page about \"cutting a pizza all weird\"",
        "author": "sixohsicks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nxhy2/i_was_reminded_of_this_by_the_post_that_made_it/",
        "text": "About 9 years ago...I worked at a small crappy chain that was cheap and common in big ten college towns. I don't believe many or any of them exist any more. \nWe had an online order come through the fax. Under special requests, the customer asked that the pizza be cut into a pentagram. As you can imagine, this called for a group huddle. \nWe made two templates one 12 and one 14 inch.\nWe opted to send a practice crust through.  After going over it, We had to upgrade them to a 14 inch free of charge to make it work.  Circle around the crust and a very careful star in the middle.  On the inside of the box we wrote Hail Satan. \n\nI didn't always like that job, but I was there a year. It was my first post-college job, and after that year I think the world would be a better and kinder place if everyone had to spend at least a year in a service job.",
        "created_utc": 1527905692,
        "upvote_ratio": ""
    },
    {
        "title": "How competitive are the drivers at your store?",
        "author": "ghost-of-john-galt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nvfpw/how_competitive_are_the_drivers_at_your_store/",
        "text": "At my store we have a pretty solid honor system with the drivers. First in, first out. The driver roster is God and must be obeyed. So the quicker you make runs, the more drives you can take. The unknowing customers love it, the steady \"wow, you guys are fast.\" They don't know it's fueled by pride and greed. The occasional calls from old people telling the managers that our drivers are insane. The managers apologizing but not sorry. We deliver to the highway patrol, the jail, and the police station. We have a certain level of immunity from the law that enables us to become pizza torpedoes.\n\nThe fastest drivers have job security. Does this sound familiar?",
        "created_utc": 1527886895,
        "upvote_ratio": ""
    },
    {
        "title": "Highest amount of separate deliveries you've taken in 1 run?",
        "author": "Kheid15",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nugqh/highest_amount_of_separate_deliveries_youve_taken/",
        "text": "Having them all on time is a bonus too",
        "created_utc": 1527879319,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers: Does the computer show past tipping history in the computer when prioritizing orders or is it all via word of mouth?",
        "author": "ghalta",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ntg6w/drivers_does_the_computer_show_past_tipping/",
        "text": "I ordered Dominos last night, and I know their store is pretty far away (we're in their service range but has to be near the limit).  We got the pizza very fast though, so I think he came right to us.  I didn't add the tip online, but when the driver showed I put a $1 tip on the credit card receipt and then handed it back along with $5 in cash.  I think for a $16 order that was a good tip, and he certainly thanked me for tipping in cash.  \n  \nWhen he goes back and enters receipts, I'm sure he'll enter the $1 tip, and whether he should enter the other $5 is none of my business and off topic for this discussion.  That said, if he only puts in the $1 tip, will other drivers see that when I order again and think I'm a bad tipper?  Did I hurt myself by tipping that way?  I don't order that often (maybe once every 6-8 weeks) so I don't think the drivers will learn who I am or anything, so it would only be what's stored in the computer that matters.  Thanks.",
        "created_utc": 1527871777,
        "upvote_ratio": ""
    },
    {
        "title": "How do companies get around the $0.545 IRS reimbursement rate for mileage?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nq0gf/how_do_companies_get_around_the_0545_irs/",
        "text": "[deleted]",
        "created_utc": 1527837676,
        "upvote_ratio": ""
    },
    {
        "title": "\"You shouldve labeled it more clearly!\"",
        "author": "zmm336",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8noivl/you_shouldve_labeled_it_more_clearly/",
        "text": "TL;DR at the bottom\n\nSo, I had a man come in the other day to pick up some food. He'd ordered a few kitchen items, pastas and salads, as well as something from the oven area. So the way that our pizzeria is set up, kitchen orders are placed right behind the registers, freshly made to order pies are on top of the oven a few feet back, and pre\\-made specialty slices/calzones/etc that just need to be reheated are placed in Another separate oven section. So basically, gathering someone's order can be somewhat of a scavenger hunt.\n\nFriday nights are our busiest night. One of my coworkers rang the man up, got him his kitchen orders, and sent him on his way. About an hour later, we get a call back, saying that we had forgotten to give him his pepperoni roll. Okay, no problem sir, we're so sorry, we'll make you a fresh one to come pick up. It happens a lot, we get busy and currently have a lot of semi\\-new people working. \n\nThe man's wife comes in about a half hour later. She's chatting with one of my coworkers and telling them about the rough day she's had and how she was disappointed about the pepperoni roll not being there when they got home because we're normally very efficient and reliable. She was understandably frustrated to have to come back, but otherwise relatively kind about it. So my coworker gives her her freshly made pepperoni roll \\(usually we just give people reheated ones made earlier in the day\\), and she happily leaves.\n\nThirty minutes later, the phone rings. \"Thank you for calling Pizza Hell, this is An Underpaid Worker speaking, how can i help you?\" It's the man's wife.\n\n\"Hi, yes, so I just went to go pick up a pepperoni roll, which they forgot to give us the first time my husband came to pick up, and they gave us the wrong order.\" At this point my heart sinks because honestly my pizzeria makes a lot of mistakes and I'm used to having to deal with the angry customer aftermath. But before I could apologize, she continued.\n\n\"Yeah, we were supposed to get a pepperoni roll, this is my ten year old son's DINNER, and instead they gave us some kind of STROMBOLI. I have to say, I'm really disappointed in you guys right now. There was SAUSAGE in it, we wanted a PEPPERONI roll!!\" \n\nAt this point I finally cut her off. \"Well, ma'am, it's a pepperoni AND sausage roll.\" Silence on the line for a few seconds.\n\n\"There's supposed to be sausage in it?\" Yes, ma'am. \n\n\"Well we didn't know that! It doesn't say that! You guys should have told us that when we ordered it, or labeled it more clearly!!\" \n\n\"Ma'am, it does say in our menu that it has sausage in it.\" I can hear rustling on the other line and the woman telling her husband to check the menu because \"it definitely doesn't say there's sausage in it.\" I patiently wait, as I look over at our showcase that very explicitly states \"Pepperoni *and sausage* roll.\" Yes, in italics. \n\nFinally, I hear a muffled, \"Oh... it does say that.\" And suddenly this lady who minutes earlier had been happy to chew my ear off about us giving her the wrong food and her son's dinner being ruined seemed to be in a rush to end the conversation. \"...Okay. We looked at the menu and you're right.... it does say that at the very bottom. Goodbye.\" And she quickly hung up.\n\nTL;DR: Lady gets mad at us for giving her what she ordered. Realizes we didn't do anything wrong and gets embarrassed.",
        "created_utc": 1527821954,
        "upvote_ratio": ""
    },
    {
        "title": "Slug",
        "author": "Chahles88",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8noaen/slug/",
        "text": "\nI worked in a restaurant in high school. We shared a parking lot with a pizza place. My buddy delivered pizzas there for about 3 years.  Snow storms usually meant a busy night for the delivery guys, and they were all willing to do it because people were *generally* pretty cognizant of the effort it took to get your ‘91 civic to their house in a snow storm and their tips reflected that.\n\nExcept one guy. They called him Slug. \n\nSlug was about 7 feet tall. Not fat, not skinny, just picture a 7 foot tall guy with a Dad bod. This will be important later. During the summer, he would sit on a recliner on his front porch and chain smoke cigarettes and drink a case of Busch Light while yelling at the neighborhood kids. He’s known to get into shouting matches with neighbors/passers by on a regular basis.\n\nAround 8PM every Friday night he would order a pizza. Large cheese, every time. Slug had exact change  for his pizza, always. This really pissed my buddy off because every Friday at 5:30  Slug’s routine was to go into the gas station up the street and break a $20 on a pack of cigarettes, which was like 5 and change back then. Pizza was  $11.50. He KNEW that Slug had at least $14 cash was on him every Friday night, and just didn’t tip. No big deal though, he would always get his pizza last in the delivery run and he just had to hand it to him on the porch.\n\nNow winter was a different story.\n\nDuring winter, Slug moves his recliner inside, but to the back of the house. This is so he can smoke out the open side window and toss his cans in the garbage can on the side of his house. \n\nHe can also get his pizza delivered right through the window. Doesn’t even need to get up. \n\nSo, during snow storms, this means whoever delivers to Slug’s house has to slog around the side of the house in a foot of snow to hand Slug his pizza. For exact change.\n\nThe delivery guys hated this. Some of them would refuse to walk in the snow, and this would result in a stand-off. Slug would just sit there and yell “front door’s broke, gotta come round the side!” When they all knew damn well the door worked fine. If they left he would call and complain and the owner would send them back.\n\nI’m working a cold Friday night and as I’m taking trash out  I run into my buddy on his way out for a delivery. He’s got a half full pizza bag with one sitting on top. Slug’s. It’ll be at least 45 minutes in the cold civic before Slug gets that pizza. He’s chuckling knowing that he just needs to push Slug a little farther in order to get him to order somewhere else. My buddy returns an hour later with his pants/shoes all wet from walking in Slug’s yard. His boss comes running out and tells him a customer called in and said his pizza was ice cold and he wanted a new one. So now my buddy has to re-deliver a pizza to Slug, AND refund his money, because Slug was hungry at 8 and it’s now 9:30 and he ain’t payin. \n\nSo my buddy, in his infinite wisdom and frustration, delivers the piping hot pizza and decides to empty his center console of change in order to refund Slug. Five singles and $6.50 in quarters nickels and dimes piled onto the box and passed through the window. Apparently the change fell all over the floor. \n\nSlug calls the pizzeria again mad as hell. My buddy gets a stern talking to, but the boss thought it was more funny than anything. He knew Slug was a pain in the ass. Slug’s next pizza would be free as well.\n\nOne Saturday night, we were out at a party. My buddy has a few drinks and goes on an angry Slug rant. At least one other guy was there who’s delivered to Slug’s house.  Eventually, they convince a small group of guys it would be a good idea to go egg Slug’s house. I went along for the ride. Someone’s younger brother drove. The pizza guys bought eggs at the same gas station that Slug gets his cigs from. \n\nThree of them, two pizza boys and one friend are all lined up on the sidewalk, they take aim and....fire. \n\nThat’s when we remembered that our friend was going to college to pitch for a division II school. He put an egg right through Slug’s shitty front window. They throw the entire dozen and are back pedaling to the car with me and the driver waiting. That’s when we see Slug. Its 2AM, apparently Slug was still awake in his recliner. He heard the crash, and he HURDLED himself out the window and into the snow. We could see this from the car around the side of the house, but our buddies in front couldn’t see. Slug is much faster than anyone could have thought. By the time they realize Slug is chasing them, he’s already full stride, wearing just boxers, a T-shirt, an open bathrobe, and boots. There’s snow flying everywhere as he’s hauling ass around the side of his house. they have no chance getting to the car, So they scatter. \n\nWe pull away, hoping he’s too distracted to get a license plate. We ended up picking our friends up the next block over. They all hopped a fence and evaded Slug as he screamed obscenities. My friends were fully satisfied that they had gotten back at Slug for the years of torture, but he nearly caught them.",
        "created_utc": 1527819717,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone deliver in SoCal? Do Cali Mexicans tip?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nkcu6/anyone_deliver_in_socal_do_cali_mexicans_tip/",
        "text": "[deleted]",
        "created_utc": 1527788094,
        "upvote_ratio": ""
    },
    {
        "title": "Might have gotten a driver fired for taking a snooze in the driveway.",
        "author": "kakka_rot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8nhoa4/might_have_gotten_a_driver_fired_for_taking_a/",
        "text": "This story takes place about a year ago, I remembered it the other day and wanted to share here to gather opinions on if my friends and I are assholes or not.\n\nTo set the scene, my friend lives at the end of a very private, secluded driveway surrounded by trees. On a typical afternoon we had a guy come by to deliver a couple of pizzas. He might have seemed a little out of it, but nothing incredibly noticeable - just your typical stoner type teenage pizza boy. The transaction goes fine, and we take the pizza inside. \n\nIn about the time it takes to eat three slices and digest, my buddy decides to take a step out side for a cigarette, to find the guy taking a nap in his delivery car in our driveway. We kind of let him sleep for a minute while deciding what to do, until my other friend got annoyed and decided to call the place and let them know what their driver was up to.\n\nApparently the call went something along the lines of:\n\n*Friend: Hey just wanted to let you guys know, your guy is taking a nap in our driveway.*\n\n*Phone person: Shut the front door! He has been taking forever on his deliveries lately!*\n\nA few minutes later he drives off, and that's the end of the story. We never knew what happened to the guy, and honestly I do not know how to feel. If he was on his break I could care less if he used our driveway to take a quick snooze, but from the sounds of things that was not the case.\n\nIdk, what do you guys think?",
        "created_utc": 1527766358,
        "upvote_ratio": ""
    },
    {
        "title": "Posted this over in r/funny because apparently we can't post images here",
        "author": "Platinum_Junkie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ngny3/posted_this_over_in_rfunny_because_apparently_we/",
        "text": "[removed]",
        "created_utc": 1527754005,
        "upvote_ratio": ""
    },
    {
        "title": "A customer surprised me big time (in a good way)",
        "author": "HaveSomeFood",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ng9hr/a_customer_surprised_me_big_time_in_a_good_way/",
        "text": "I recently joined this subreddit and thought I’d share a nice story of an experience I had during this last winter. So I was delivering on a Friday night. It was really busy because it was extra cold that day (~20-25 Fahrenheit). I work at a major chain and we deliver to a bunch of different neighborhoods. Some good, and some not so good. For example I deliver to North Chicago and some places are not the best there. But this night I was having a string of bad luck deliveries. I was on about my 4th stiff in a row and I was pretty upset because it’s freezing out and I’m working hard and not making any money. So I get a delivery to a house in a average neighborhood. It was a cash order for $28.xx and I walk up to the door. 2 younger girls (around 12) answer the door in their pajamas and I tell them their total. They hand me $30 then I tell them thank you and have a nice day. I go back to my car disappointed again on the low tip but I thought they might’ve saved up for this night and didn’t have any extra to tip (sleepover maybe?) so I am happy with the little tip I did get. As I’m sitting in my car getting myself buckled in, i turn around to grab something and I see one of the girls running towards my car. I’m thinking I forgot something? Their order is messed up? But no. I rolled down my window to see what was up and she said “here you go!” And handed me $3. I was kinda set back by it and I smiled big and said “Thank you!!” She said no problem and ran back to her house. I couldn’t believe it. It was freezing out and she ran out barefoot to give me an extra tip on top of what they already did. That turned my night completely around and to this day, I’m still amazed on how nice some customers can be. Thank you if you are one! Just though I’d share as my first post(: there are more to come if people want more haha",
        "created_utc": 1527749001,
        "upvote_ratio": ""
    },
    {
        "title": "Mildly awkward situation regarding hiring/applications...advice pls",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ncc65/mildly_awkward_situation_regarding/",
        "text": "[deleted]",
        "created_utc": 1527715013,
        "upvote_ratio": ""
    },
    {
        "title": "Marco's mileage changes, decreases pay",
        "author": "ThestralTransport",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n9cjb/marcos_mileage_changes_decreases_pay/",
        "text": "I'm generally a lurker, but I had to share with someone other than my husband, who's advice is \"you need to just quit\". Apologies for the incoming wall of text. \n\nI've been working for this company forever. I've worked every position and I've stuck around because I truly enjoy delivering; I love my regulars, sitting in my car, and the general hustle of the store. The money/hours help too. We can avoid day care and pay the bills with me being part time. \n\nFirst it started with our hourly wage. Drivers were paid 7.25/hr, 2$ per delivery. Under minimum wage hourly, but it balanced out. Customers paid $2.5 for delivery. \n\nThen they switched it up. Drivers now make minimum ($8.15) inside the store, 4$ while out, still 2$ per run. As someone who works the hot shifts (Th-Sat night and Sun 10-6), I spend more than half my time out of the store. Customers still pay $2.5 for delivery. \n\nAs of last week, a few corporate stores have instituted MOTUS. They are doing a 4 week research period, where they pay us $0.38 per mile at the end of our shift, and then reimburse us the difference between paid mileage and the 2$/delivery the following week. This is fine for the 4 week period, I save all my cash anyway, so I add the reimbursement when I get it.\n\nUsing the new MOTUS mileage pay, I am consistently short $40-50/week. GUYS, that's 200$ a month, almost what my family of 3 spends on groceries. Not to mention they can't even calculate it properly, my first week they shorted me $5.67. Thankfully I keep handwritten record in addition to keeping my checkout/mileage paid slips. I'll find out tomorrow if they calculated week 2 correctly. \n\nAfter the 4 week research period, for current drivers ONLY, \"to minimize financial impact\" we will be given a \"calculated stipend\" in addition to the $0.38 per mile. Any drivers hired after April 30th will only get the MOTUS calculated mileage. Customers now pay $3 per delivery. Most of our deliveries take place within 1-1.5 miles of the store. \n\nI feel like this company is headed downhill, trying to pay peanuts to drivers and management alike. They recently switched ALL management to hourly, figured out how much overtime GMs actually worked, and had all the regrets. It took about 3 months for them to  switch GMs back to salary so they don't have to pay out for the 60+ hours some of these people put in.\n\nI don't know the point of this post really. To let any potential new drivers know how much they're missing out on compared to \"veteran\" drivers? To find out if anybody using MOTUS likes it or finds it benefits them? To find a company with better pay structure? Is this kind of reimbursement typical?\n\nEdited to remove a couple personal details. Someone found me out! \n \n\n\n\n\n",
        "created_utc": 1527693092,
        "upvote_ratio": ""
    },
    {
        "title": "Ever have those days where you just...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n7fyz/ever_have_those_days_where_you_just/",
        "text": "[deleted]",
        "created_utc": 1527675504,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for the free pizza!",
        "author": "Anycae",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n3vy6/thanks_for_the_free_pizza/",
        "text": "I’m not a pizza guy/gal... but I’ve been scrolling through this sub and remembered something that happened to me a long time ago. It’s a short un-climatic story but I’ll always remember it. Sorry for formatting I’m on mobile.    \n    \nI was working a long shift as a cashier at a convenience store in a busy area. It was a slow night close to closing time. In walks a pizza gal from papa johns holding a pizza. My other cashier and I confirmed with her that we did not order a pizza, but the store across the street probably did! People get our two stores mixed up all day every day. Pizza gal just stands there, looks at the receipt and is adamant that the pizza is for us. We confirm once more we didn’t order pizza.     \n    \nPizza gal then gives a little shrug, places the pizza on the counter, says, “Free pizza for you guys then!”, turns around and walks out.  It was a small buffalo chicken pizza (the 1st time I’d ever had one) and I swear it was the best pizza I’ve ever had in my life. I’ll always remember that night and the free pizza mix up.     \n    \nYou guys are absolutely amazing! It blows my mind the kinds of people &amp; deliveries you put up with. Thank you for all that you do for us.  Life truly wouldn’t be the same without pizza and those of you whom provide that service. ❤️ 🍕 ✌🏽 ",
        "created_utc": 1527637481,
        "upvote_ratio": ""
    },
    {
        "title": "Got a free pizza because of early delivery?",
        "author": "LakanicaN7",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n3j81/got_a_free_pizza_because_of_early_delivery/",
        "text": "So, a couple of weeks ago, I ordered a pizza and wings from Pizza Hut. I requested it be delivered ASAP and the estimate was 45-60 minutes, which was totally fine. Delivery came in about 25-30 minutes, awesome! Tipped the driver, thanked her, enjoyed my food. No complaints.\n\nThis is where it gets odd. A few days later, I received an email from Pizza Hut apologizing for \"letting me down\" and delivering the food \"too early\" and they gave me a code for a free large pizza. A couple of days later, they sent me another email, essentially begging me to let them \"make this right\" and included the coupon code again.\n\nIs this normal? I didn't complain in any way, shape, or form. Would anyone at the location get in trouble in any way related to this? If they did, is there anything I can do?",
        "created_utc": 1527634445,
        "upvote_ratio": ""
    },
    {
        "title": "Dominos....What happens if an employee forgets to charge you?",
        "author": "MulticulturalHound",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n2kl3/dominoswhat_happens_if_an_employee_forgets_to/",
        "text": "Hey Guys,\n\nI got a large pizza (the 7.99 deal or w/e) from Dominos for carry out. I ordered through the app with (what I thought was) pay-in-app, and went in and picked up the pizza and walked out. Just reached my house and I realized I never actually got charged for it. Double checked the app and I guess I accidentally selected Pay In Store, but the employee I got the pizza from just gave it to me and walked away without mentioning any charge (I then said thanks and just walked out of the store like it was normal). \n\nI'm just wondering how it works in this situation? Does Dominos eat up the cost? Are the employees of the store going to get screwed because of it (they never actually told me to pay or anything. The guy just gave me my Pizza and walked away). Haven't gotten a call or anything from the dominos store but lol if the employees get screwed I'll probably drive back and pay. Thanks guys. ",
        "created_utc": 1527626935,
        "upvote_ratio": ""
    },
    {
        "title": "I screwed up and I need to vent.",
        "author": "Menelaus4456",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8n0to2/i_screwed_up_and_i_need_to_vent/",
        "text": "Alright, so I made a mistake yesterday and it's a doozy.\n\nPart One: \n\nI'm waiting on a delivery that's coming out of the oven. My manager tells me that I'm getting a $7 dollar tip on it. \n\n \"Really?\"\n\n \"Yeah, she told me over the phone. \" \n\nThat's pretty sweet, I'm thinking. Delivery comes out and I take it.\n\n Part Two:\n\nArrive at the address, complete the transaction. It was a credit card order, so as I get back in my car I take a glance at the Merchant Copy of the receipt. I would've been happy with $5 as a tip, but guess what? They ended up tipping $15! \n\nFeeling pretty elated, I drive back to the store.\n\nPart 3:\n\nI'm cashing out for the end of my shift. I get to the aforementioned order and double check the tip. Here's where I go full retard.\n\nIt's not a fifteen, it's a + 5.00. Does my retarded brain recognize this? Nope.  I go through this thought process:\n\n \"Is that a... It could be. But it kind of looks like an accidental pen nick across the \"1\" . (There were some other pen marks on the receipt) . Who writes a \"+\" in front of the tip anyway? And she said she'd tip seven, so why would she go lower? \" \n\nInstead of asking for a secondary opinion, I go ahead and enter the tip on the computer as $15.\n\nWhen my manager comes over to finish the cashing out process, she double checks the tip as well. Yep, it's a plus. Of course it is. My manager tells me she'll deal with it if the lady calls. \n\nThe lesson I took away from this is that in a moment of uncertainty, it's better to swallow your pride and ask for a second opinion than to risk making a big mistake. Big mistake as in basically stealing from a friendly customer.\n\nTLDR: I enter the wrong amount for a tip on a credit card transaction, $10 more than it actually was.\n\nEdit: Thanks for the comments and advice guys. She hasn't called back yet which makes me feel even worse, but at this point there's really nothing I can do.",
        "created_utc": 1527614064,
        "upvote_ratio": ""
    },
    {
        "title": "A friendly reminder about tipping discussion.",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mx478/a_friendly_reminder_about_tipping_discussion/",
        "text": "There have been quite a few post recently that involve the discussion of tipping. We just wanted to put a quick notice that all conversation should be civil and discussed appropriately. If you feel as though someone is being uncivil to you, or another user, please report it or message the mods. We don't always catch these things at first, and getting help from the community can help us weed out those only intending to start arguments faster, so we can have a better community. Thank you!",
        "created_utc": 1527577662,
        "upvote_ratio": ""
    },
    {
        "title": "Should I report her?",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8muun4/should_i_report_her/",
        "text": "This morning I get a call from this older lady who claims she walked in our store last night, ordered two extra large pizzas, and when she got home, the toppings were wrong! She wants me to remake the order and have it ready for 1pm for her husband to pick up.\n\nNow, I remember this lady from a while ago because the last time I spoke with her, she had also received an incorrect order and wanted a free remake.\n\nIf she had ordered last night, she would have spent $43 on two pizzas that were made incorrectly, and she wants me to believe that she wouldn’t call the store last night for a remake?\n\nSo I call my manager, who was working from 5-close last night if he remembers making two extra large pizzas for carryout. He says he doesn’t. Not that that necessarily means she’s lying, but we’re a small store and with the large pizza special going on last night, I feel like he’d remember making two extra large pizzas.\n\nSo I call her back and ask if she still has the pizza boxes from last night because they would have the order number on it so I can verify she actually ordered.\n\n“No, sorry, the garbage man already took them away.”\n\nUm. Yesterday was Sunday. Today is Memorial Monday. There’s no way they could have already been taken.\n\n“Well, I’ll be sure to bring a receipt!!” And she hangs up.\n\nAlso, I remember stocking up 4 XL boxes yesterday before supper rush, and there were still 4 this morning when she called, and I know my coworkers last night aren’t the type to stock up boxes, let alone XL ones.\n\nSuffice it to say, nobody showed up and I have her name, phone number, and last known address under that phone number.\n\nShould I report her to the police?",
        "created_utc": 1527554576,
        "upvote_ratio": ""
    },
    {
        "title": "I know this will be downvoted but I never, EVER tip.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mtl1k/i_know_this_will_be_downvoted_but_i_never_ever_tip/",
        "text": "[removed]",
        "created_utc": 1527543241,
        "upvote_ratio": ""
    },
    {
        "title": "My Friend’s Last Pizza Delivery",
        "author": "daddyperron",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8msi7x/my_friends_last_pizza_delivery/",
        "text": "A good friend of mine let’s call him Dan delivers pizza for a local chain. He delivered for about a year and like what he did. When he got the address for one of his deliveries he knew exactly where he was going. He delivered to the same customer about once a week. Same order, same guy, like clockwork. Dan gets to the door and rings the doorbell. From inside Dan hears the customers dog start barking and scratching at the door. He hears the customer push the dog away as he opens up the door. Same conversation between Dan and the customer, but the dog kept running around a little more rambunctious than usual. The customer turns around to try to calm the dog down but the dog runs away. The dog was so rowdy that he ran into the coffee table, which then knocked the customers loaded handgun off the table. The gun misfires and the bullet hits Dan in the calf. Dan goes down and the customer immediately springs into action. The customer is an ex-Marine so he was ready for this kind of thing. He patched Dan up and called an ambulance for him. Dan made a full recovery but he never delivered another pizza again. ",
        "created_utc": 1527534304,
        "upvote_ratio": ""
    },
    {
        "title": "My pizza was never delivered",
        "author": "Theingloriousak2",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mo5tj/my_pizza_was_never_delivered/",
        "text": "So around 10:15pm today I order Dominoes online, the location is only\nTwo miles away but their lobby closed at 10 and they only take delivery orders. I ordered just one medium pizza and a soft drink. I see the status online update to pizza being made, pizza out to delivery, and pizza delivered. But, the pizza was not delivered. I give it 5 minutes it's around 11:15.  I call the manager and they say my address and apologize, they say it's out for delivery. 15 minutes later still nothing and now they won't answer my call. They close at 12, so basically I gave ~30 for nothing.\n\nI've never had this happen, unfortunately I paid by card online. What can I do here? How can this store rob customers like this?",
        "created_utc": 1527490710,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of when our power went out and the computers took over an hour to boot back up.",
        "author": "idwthis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mmdyl/the_tale_of_when_our_power_went_out_and_the/",
        "text": "This is long, I'll put my TL:DR here for ya guys: Computers wouldn't boot up, MIC wasn't the best at customer service, so I stepped in and made things all better for people who showed up to get their food and/or order. \n\nSo, maybe some of you have read a few of my tales before from when I worked as  a manager  at PJ's. I'm now over in the other pizza hell that best rhymes with slut or butt. \n\nI'm supposed to be a manager here as well, but according to my boss, they want copies of paperwork for a  misdemeanor fine I had to pay last year (that in itself could be a whole nother post but isn't really pizza related aside from being at the Slut.), and they're corporate thing. I've put that off and just got a second job at the \"fastest\" sub delivery place instead. \n\nAnyhoo, tonight, it's raining. Bad. It's been raining here for the last 3 god damn weeks. We are all close to building our own arks, it's so bad. And at 5:30ish tonight, the power went out  but did come right back on. But everything had to reboot, and the office computer controls all the other computers or some such shit (I dunno. If I decide I really want to stick this one out maybe I'll find out later). \n\nCustomers came in right when it happened, they understood, shit has to reboot. They wait a bit. The power goes out *again,* so the process starts all over. A couple ladies come in, they have cash, and I happen to have their orders with receipts, so okay, pay cash, we can still open the drawer with a key to make change, we'll write down names and all that jazz to straighten it out once systems are back up. \n\nTwo people who were waiting see this, and ask if they go grab cash, if they can do the same instead of waiting. Sure! Np, I say. The MIC is off trying to call our GM, and trying to get the office computer back up to get all the other ones up. \n\nMIC did come over to open up the drawer, and for the life of him couldn't figure out how to make change without using a calculator, so I taught him. One lady had an order of like $12.74, she handed us a $20, so I said for her change, you count out the change from her total back up to whatever bill a customer hands you. So that becomes one penny =75 cents, add a quarter, that's 13 dollars. Add 2 dollars, that fifteen, and then a 5 makes twenty! Ta da! Easy peasy. After that he just let me handle it all. \n\nOne of the people who went to grab cash and watched me try to teach MIC how to make change on their own tipped me two bucks. Then a little old man gave me five bucks for making him a personal pan pizza.  Hahaha \n\nAnother older gent came in, said he was picking up, we didn't have his order. Another younger guy came in, only had card, said he couldn't get cash, I waited as long as it took me to make the older guys pizza, and then I have them both their food for free. \n\nMostly because fuck it. Mostly because sometimes, a business has to be nice. And they were nice, annoyed, but they never once cussed and cursed or yelled or what have you. So I liked that, and I know the MIC, he is just so young, and has no idea sometimes you have to be nice to the nice customers. Plus he was busy, and since I was the only employee with any sort of actual managerial and customer service experience, I took the liberty and used my discretion. \n\nAfter an hour and 20 minutes or so, shit came back up, finally. \n\nWhen I left for the night, I asked if we made any money from the actual properly rung up carryout, because my store is weird and says only managers can do register, and we have to share tips between whoever is a cook that night with them. \n\nIt came out to some funky  number,  15 by 4 equals 4.33 pretty much. MIC just handed me a five and said \"because I like you\" haha I told him it should be because I made sure no one threw a hissy fit about you ignoring them!  ",
        "created_utc": 1527470911,
        "upvote_ratio": ""
    },
    {
        "title": "\"I appreciate you\"",
        "author": "FeculentUtopia",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mkbj3/i_appreciate_you/",
        "text": "Then he tipped me five bucks.  Honest and for real!",
        "created_utc": 1527451348,
        "upvote_ratio": ""
    },
    {
        "title": "I got you next time!",
        "author": "Chilibody",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mjwff/i_got_you_next_time/",
        "text": "I don't understand why people think that this is in anyway believable or acceptable when trying to excuse yourself from tipping delivery people. \n\nI just had a customer who works in the guest service industry tell me that unfortunately today she didn't have a tip for me. As if I've ever delivered to her before or will likely ever deliver to her again. If you're a shitty human being, own it, and stop trying to fabricate something that makes you feel less guilty. It's simply not believable. \n\nAnother time I had to guy tell me that he'd \"hook me up\" next time I delivered to him. Well, I remembered that remark when I delivered to him again months later, and he proceeded to stiff me again. I told him that if he doesn't have enough money to pay for the entirety of the service of delivery, he should consider picking up his food and using his gas instead. \n\nGranted, by the tone of my post and my personal experience, it can be inferred that promises of future tips always end in disappointment (assuming you're foolish enough to believe them), but there is one exception I found in my 6 years of doing this.\n\nThere's a woman who lives in Section 8 housing who orders from us a lot. Most of the time she's answers the door still in her work uniform, so I gathered that she works at a hotel nearby. There are times she tips, and times she doesn't, but she will always tell you honestly that she simply doesn't have the money that week, or tells you she's giving you extra cash she set aside for her order. To me, her honesty makes delivering to her a pleasure because I can at least respect her. When she is able to tip, it means a little bit more than a couple bucks thrown my way by a dude with a Porche sitting in his garage. ",
        "created_utc": 1527447645,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of snacks/drinks do you take on you while driving?",
        "author": "croissantzzz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mfo52/what_kind_of_snacksdrinks_do_you_take_on_you/",
        "text": "I *try* to keep it healthy and have granola and water in the car to keep me from diving into the pizza. What about you guys?  ",
        "created_utc": 1527396329,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers: what is the average amount of deliveries you make per hour (particularly peak hours)",
        "author": "clarkkent1521",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mbsvv/drivers_what_is_the_average_amount_of_deliveries/",
        "text": "I've heard anywhere between 1.5 and 6. ",
        "created_utc": 1527357107,
        "upvote_ratio": ""
    },
    {
        "title": "Pro tip: if your car seats dip put a drink carrier upside down to keep pizzas leveled",
        "author": "Prosciutto_Papi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mbbzl/pro_tip_if_your_car_seats_dip_put_a_drink_carrier/",
        "text": "I double up and put 2 down ",
        "created_utc": 1527352880,
        "upvote_ratio": ""
    },
    {
        "title": "I just started, made a small mistake during my second ever delivery",
        "author": "petenick96",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mb8nb/i_just_started_made_a_small_mistake_during_my/",
        "text": "It was a credit card order, and despite doing CC orders on ride-alongs I was a little nervous. I hand the customer the pen, she signs the slip, and then she starts to hand the pen back.\n\nI tried to take the pen, receipt, AND the pizza back.\n\nOnce I figured out what was happening I relinquished her pizza to her. I just had to laugh it off, and I haven't done it again.\n\nThe next night I had a customer try to hand her pizza to me herself, so I guess it all balances out.\n\nBONUS: I try to say \"Enjoy!\" as I walk away. Twice so far a customer has responded \"You too!\"",
        "created_utc": 1527351999,
        "upvote_ratio": ""
    },
    {
        "title": "Perks of being the Pizza guy...does this happen a lot?",
        "author": "sprogies",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8mapjo/perks_of_being_the_pizza_guydoes_this_happen_a_lot/",
        "text": "On my way to my shift i got pulled over for talking on the phone while driving down main st. Was a foolish move on my part. The cop asks for my license (which is expired and havent renewed) and as i hand it to him he asks where im headed. I told him i was working for the local pizza spot and he handed me back my liscense and told me to have a good afternoon. woo! ",
        "created_utc": 1527347020,
        "upvote_ratio": ""
    },
    {
        "title": "That smelly smell.. that smells.. smelly.",
        "author": "WhiteBandit97",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m95em/that_smelly_smell_that_smells_smelly/",
        "text": "Do any of you **hardcore** pizza delivery veterans have any tips for keeping the smell of pizza in your car to a minimum? ",
        "created_utc": 1527328098,
        "upvote_ratio": ""
    },
    {
        "title": "If your door bell is broken...",
        "author": "bosspugs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m5qle/if_your_door_bell_is_broken/",
        "text": "PLEASE UNLOCK THE SCREEN DOOR",
        "created_utc": 1527287755,
        "upvote_ratio": ""
    },
    {
        "title": "No, we don't carry 2 liters in our car, its summer... in Texas.",
        "author": "jbutexan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m4ydy/no_we_dont_carry_2_liters_in_our_car_its_summer/",
        "text": "So this happened a few years ago when I was a delivery driver. Once in the middle of July in Texas, I took a delivery to this one house in the middle of the day. \n\nI go to the door and hear nothing but shouting. \"Oh boy, It's going to be one of those houses.\" I ring the doorbell and a middle aged man opens the door in nothing but his boxers, and behind him is his father, who most likely has dementia, just shouting at the top of his lungs. No words, just kind of shouting noises. The man doesn't even mention the fact he is answering the door in his underwear, just casually starts talking. I can barely hear him over his father shouting in the background. \n\nI eventually get the transaction to take place and as I'm taking the money he asks me if I have any 2 liters. I say yes and tell him what we have back at the store he says, \"cool then I'll take a 2L of Coke.\"  I then tell him you have to call the store and do a separate transaction and I'll bring them back. Again all the while this is happening, his father is shouting at the top of his lungs.\n\nHe is clearly angry at this and demands to know why we don't always carry 2L in our car. I then give him a Texas 101 lesson about how the hot sun makes our cars hot and anything in our car really hot. He grumbles some more, tips me a quarter and shuts the door in my face.  ",
        "created_utc": 1527280822,
        "upvote_ratio": ""
    },
    {
        "title": "Should I tip 20%? What’s the minimum I should tip on smaller orders?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m4ayp/should_i_tip_20_whats_the_minimum_i_should_tip_on/",
        "text": "[deleted]",
        "created_utc": 1527275356,
        "upvote_ratio": ""
    },
    {
        "title": "The Customer Imposes",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m3zui/the_customer_imposes/",
        "text": "When I was a driver, I had several customer ask me to do things for them, other than bring them a pizza.  Like this: [Taking out the trash](http://www.thewebcomicfactory.com/comic/tales-of-pizza-the-imposer/).  And they never offered any extra money, they just kind of thought of me as their servant-of-the-moment.",
        "created_utc": 1527272858,
        "upvote_ratio": ""
    },
    {
        "title": "If you don't mind sharing. Whats your hourly rate?",
        "author": "Prosciutto_Papi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m3dxq/if_you_dont_mind_sharing_whats_your_hourly_rate/",
        "text": "Mine was 6 an hour, but I got a raise to 8 an hour",
        "created_utc": 1527268088,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza guys and gals of the UK; a question about tipping",
        "author": "thetoastmonster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m30li/pizza_guys_and_gals_of_the_uk_a_question_about/",
        "text": "I'm ordering pizza tonight.  I usually give the delivery person £2 as a tip.  They never expect it and are always surprised when I offer it.  How do you feel about tips?\n\nTonight I only have tip money in small change.  Would you rather have no tip, or a tip made up of lots of coins?",
        "created_utc": 1527265180,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys ever get out of work on time?",
        "author": "djsjr",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m24dq/do_you_guys_ever_get_out_of_work_on_time/",
        "text": "Every single day, I'm forced to stay past my scheduled time. Just wondering if anyone else from other pizza places have the same problem.\n\nAlso to you guys who moved on from delivering, what job did you get? Thanks guys.",
        "created_utc": 1527258098,
        "upvote_ratio": ""
    },
    {
        "title": "i'm a delivery driver... at a place that now ALSO uses Waitr, UberEats, DoorDash",
        "author": "MapplethorpeGrey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8m1va3/im_a_delivery_driver_at_a_place_that_now_also/",
        "text": "i've been working here for 4 years. and not just delivery driving, i do everything in the front except serve. I leave on deliveries and then come back and clean and expedite food and bus and all that shit. i clean and close the place down with only one other person. \n\nfirst it started with Waitr. i was annoyed, but i just accepted that the owner was trying to get in on the online shoppers, so whatever. then ubereats, which pissed me off. and then DoorDash.\n\nwhen we found out he was doing doordash we were like wtf, we asked him about it and he stupidly acted like he didn't know. \n\nyou have to send them your info and set up an account with them and you don't know? -.-\n\ni want a new job, every delivery is so insulting and im making less money. fml.",
        "created_utc": 1527256008,
        "upvote_ratio": ""
    }
]