[
    {
        "title": "Welcome To Charlotte Wednesday! Visiting, recently moved here, or going to move here? Tell us and ask away.",
        "author": "Suzyq6usp",
        "url": "https://www.reddit.com/r/Charlotte/comments/87pz1f/welcome_to_charlotte_wednesday_visiting_recently/",
        "text": "",
        "created_utc": 1522226918,
        "upvote_ratio": ""
    },
    {
        "title": "Supervisor: the manual is too long",
        "author": "miladyelle",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/86nxpx/supervisor_the_manual_is_too_long/",
        "text": "Trainer for a desk job with tons of technical components. (Well, I was. I got promoted.) You can’t walk off the street and do the job. You have to have specialized training, that I created.\n\nThe phone rings. It’s the day shift supervisor for the department I used to train for. \n\n“96 pages?!!!!” She screeches. “That’s way too long! There’s no way to condense that?!!” \n\nStill. Screeching. \n\nAnd like a fucking moron, I start to explain.\n\n“But 96 pages?! No wonder people keep leaving!”\n\nHere is where I see red and I somehow manage to get off the phone without losing my shit. \n\nAnd y’all get to hear what I wanted to say:\n\nNo, you dumb bint. There’s no way to shorten it. This is a niche field, with programs no one has heard of outside the industry, used in a way no one outside the department would know. It can’t be shortened. \n\nFirst of all, this is the first time you’ve ever looked at the training manual for your department? It’s been completed for TWO FUCKING YEARS. The time for giving me feedback on the thing ended TWO YEARS AGO. But this explains a lot. Like why you were useless when reporting we had hired a dud. Why you kept making excuses that they were neeeeeeeeeew. \n\nSecond of all, my manual is emphatically NOT why we have high turnover. Fuck you. My manual lowered turnover, shortened drastically training time, decreased errors, and got you a more knowledgeable workforce. Turnover is still higher than goal because the pay is shit, and you’re an unprofessional, tantrum-prone, favorites-playing, petty-ass BITCH. \n\nI didn’t even have to update it. I did it because I’m the only technical writer in the company, and it needed updating. Her department’s training is far superior to any other in the company. \n\nUngrateful cow.\n\nGuess I’ll be taking my manager’s advice to simply dump the bullshit in my replacements’ lap, and focus on my new duties. I wanted to make sure the transition went smoothly, I really did. ",
        "created_utc": 1521837521,
        "upvote_ratio": ""
    },
    {
        "title": "I'm an ATM technician and was having a good day until I got to this machine.",
        "author": "TreborVu",
        "url": "https://i.redd.it/bsimxzde9nm01.jpg",
        "text": "",
        "created_utc": 1521432154,
        "upvote_ratio": ""
    },
    {
        "title": "Coming across as DOPY at work! :(",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/852zon/coming_across_as_dopy_at_work/",
        "text": "[deleted]",
        "created_utc": 1521283220,
        "upvote_ratio": ""
    },
    {
        "title": "DO YOU UNDERSTAND ME????",
        "author": "singinangielala",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/851sur/do_you_understand_me/",
        "text": "I work in clinical research collecting samples from patients with cancer to donate for studies. I do not know why, but everyone from the research team (PhD or MD) assumes I'm an idiot. However, I've made the program run soooooo much smoother and I've been able to more than double our rate of collection. \n\nI usually let comments by the researchers roll off because there's no point in trying to correct them anymore. They're stubborn, greedy, and selfish. However, the one thing that annoys me THE MOST is that they keep asking for samples that either I can't get or the patient in question REFUSES to give. I CAN'T DO ANYTHING ABOUT THAT. PEOPLE HAVE A RIGHT TO THEIR OWN BODY. When I explain that not everyone wants to get more biopsies or someone is sick of giving blood samples for research, they look at me like I'm an idiot. They tell me to go and explain to the patient that research is SOOOOO IMPORTANT (OMFG THIS SAMPLE IS GOING TO CURE ALL CANCER AND SAVE THE ENTIRE WORLD FROM PAIN AND SUFFERING). Each time I respond with the same sentiment that PATIENTS CAN OPT OUT OF THE STUDY AT ANY GIVEN POINT AND IT IS NOT YOUR DECISION TO MAKE. THIS IS A REAL PERSON WITH REAL EMOTIONS WHO IS DEALING WITH A HORRIBLE HORRIBLE DISEASE SO SHUT UP. ALSO I HAVE GIVEN YOU OVER 300 SAMPLES SO USE THOSE. I've gotten into SO MANY ARGUMENTS about this in the last two months that I'm on the verge of quitting.\n\nI think it's ridiculous because they have PhD's, but can't understand basic rules or ethics. They've already dealt with two ethics violations and they're seriously working their way up to a third.",
        "created_utc": 1521264412,
        "upvote_ratio": ""
    },
    {
        "title": "I thought I was just getting my tupperware stolen, but is someone actually messing with me?",
        "author": "sweetgums",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/84neyk/i_thought_i_was_just_getting_my_tupperware_stolen/",
        "text": "So about a month and a half ago one of my tupperware got stolen. We have a cleaning lady at the office who also does the dishes, and typically everyone leave their tupperwares to be washed by her once they're done eating, and then pick them up at the end of the day from a space on the cafeteria counter were all cleaned tupperwares are left.\n\nOne day mine was missing at the end of the day. I asked the cleaning lady and the receptionist girl (who's in charge of the cafeteria restocking so she was the 'figure of authority' there) about it the next day, and even left a note on the wall next to the clean tupperwares counter for about a week but it never turned up. Although the note I had written had gotten vandalized (\"Help! My mom is gonna scold me for losing it!!\" they wrote on it), I chose to think that someone had just mistaken it for theirs, and that the vandalized note was a just a prank, so I took down the note and went on with my life.\n\nLast week however, yet another tupperware of mine got stolen. At this point I became suspicious; this was the second time this happened in a span of less than two months, and now I was wondering if this had never been an accident at all, moreso because the one that went missing this time around had a design (red lid, rectangular and made of glass) that the majority of the others in the office didn't (almost all the others are made from plastic), at least not one I had ever seen in the two years I had worked there, so how could it have been mistaken for another one?\n\nBecause the tupperware that got stolen was part of a two-set where both of them are identical, I took a picture of the one that got left at home so I could show it the next day to the cleaning lady, the receptionist, and this time my boss to let them know of what had happened, and what the lost one looked like.\n\n(One thing of note is that while these two tupperware are identical, one of them had gotten a tear on the lid, while the other one remained unbroken. The one that had gotten \"lost\" was the tearless one (T) while the one that remained at home had the tear in it (BT), and the picture I had taken was evidence of that. This fact is important later on).\n\nSo the next day I tell everyone I had planned of what happened, cleaning lady and receptionist girl are concerned since this is the second time it happened (cleaning lady said she left it in the counter with the others) and my boss just tells me that it was probably an accident and it'll hopefully turn up again. I once again leave up a note in the wall next to the counter (this one wasn't vandalized), and hope for the best.\n\nMonday morning of this week I pack up my lunch in (BT) and head to the office at around 7:30 am. I'm the first to arrive, I put my food away and notice that (T) is still missing from the counter, so I just go to my cubicle and start my day.\n\nAt around 10:00 am I head to the cafeteria for a glass of water, and lo and behold, (T) was in the counter! It was right underneath my note, so surely it was being returned to me. As I approach to pick it up however, I notice that (T)'s lid has a tear on it, on the exact same place where (BT) has one. For a weird moment I think, \"did someone actually took (BT) out of the fridge and threw away my food just to put this here?\", but when I go to check the fridge I notice that (BT) is indeed still there, food and all. So (T) was returned to me after all, did it get a tear as well while it was \"missing\"? But as I go in to retrieve (BT) from the fridge and I hold it on my hands, I realize that (BT)'s lid was completely smooth now.\n\nThey had changed the lids.\n\nI was honestly stunned at this. I knew for a FACT because of the picture I took that the tupperware I had left on the fridge was the one WITH the tear on it (BT), and that the one that had gotten lost was the one WITHOUT the tear (T). And yet, when (T) turns up, it has a tear on the lid, and the one in the fridge (BT) is suddenly tearless? What the hell?? The only possible explanation here is that whoever returned (T) changed the lids with (BT) on the fridge, but why on earth would they do that??? I can only think of this being a way to mess with me, since this is such a little thing to do that it just sounds crazy to try to explain t someone, something easily dismissed as \"oh you're just remembering wrong, why would someone do this?\", and if I couple that with the fact that my note about my very first tupperware that \"went missing\" was vandalized, seemingly to mock me...\n\nI told everyone who knew of the situation that the tupperware was returned, but didn't mention the lid switching. Honestly, I don't know if I should, cause it's a little unnerving to me that someone would go to these lengths to... what, exactly? I don't know, all I know is that I'm not leaving my tupperware unattended anymore, but I just don't know what to make of this incident. Is this a one-time thing? Or something that's gonna keep escalating as time goes on?\n\nI hope it's the former.\n\nTL;DR: One of my tupperware that was part of two-set got stolen at the office. On the day that I brought to the office the one that had remained at home, the lost one turned up but it had its lids switched with the one I brought in for seemingly no reason other than to mess with me.",
        "created_utc": 1521128579,
        "upvote_ratio": ""
    },
    {
        "title": "Video store at Netflix Inception",
        "author": "TamarackRaised",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/83bsnc/video_store_at_netflix_inception/",
        "text": "SO,\n\nI managed a video store during their downfall. The company decided to close my store. When they did, they offered me another position as a part time clerk at another location. I declined and that was all that was said about my employment.\n\nFlash forward a month, and we close the store and I turn in my keys, but have heard nothing at all about \"termination\" or \"record of employment\" so I roll with it.\n\nTwo weeks later I think I get my last cheque in the mail. Two weeks after that I get, what I am now sure is, my last cheque. Then 6 weeks after my last shift I get a third cheque....\n\nNow I'm not one to accrue debts, so I call payroll, give my employee ID and store number and ask if anything is wrong. She tells me no. I ask if these calls are recorded, to which she says yes, and get her employee number.\n\nFlash forward again to 4 months later when I get a letter asking for all the wages to be returned.\n\nI call my district manager, ask what the letter is about. Am told \"YOU KNOW WHAT ITS ABOUT!\" I ask if \"I was ever terminated officially\" \"I'LL CALL YOU BACK!\"\n\nFlash forward just once more to 11 years later, as I type this. No call back.\n",
        "created_utc": 1520643878,
        "upvote_ratio": ""
    },
    {
        "title": "The cut throat world of tea rooms",
        "author": "Khdurkin",
        "url": "https://i.redd.it/yt75ot7cask01.jpg",
        "text": "",
        "created_utc": 1520621311,
        "upvote_ratio": ""
    },
    {
        "title": "Another person that doesn't understand copyright at a copy and print center!",
        "author": "Reanimations",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/82sivo/another_person_that_doesnt_understand_copyright/",
        "text": "Hello! I work at a copy and print center at a certain nationwide store chain, where we copy, print, fax, scan, etc. I post here often since I recently found this subreddit, so that might sound familiar.\n\nAt my job, we get people that come in to get party invitations printed and cut (we offer cutting services too). This is a rough area we have to deal with, because 1 out of 5 of these invitations that we receive either online or over the counter have some sort of copyrighted material on them, and we have a very strict copyright policy, so we have to explain why we can't print or reproduce their item and turn these people away, which usually doesn't end well.\n\nA lady came in yesterday to get some sort of party invitations printed. My co-worker opened the file on the work PC, and there was Mickey Mouse and Minnie Mouse plastered in plain sight in the middle of the invitation. Noticing this, my co-worker showed the lady the invitation on the screen and said, \"We cannot print this because there's Disney characters on the invitation, which is considered copyrighted material.\"\n\nThe lady made that angry face customers usually make when they're upset, and said with a sharp and loud tone, \"WHAT?! I just had these printed at that other store not too long ago!\" My co-worker said, \"Well, I'm sorry, but I cannot print these. It's against company policy. These are easily recognizable Disney characters.\" She basically repeated what she said about three times. My co-worker called the manager over, and she went off on her tantrum on him. My manager said, \"I understand that the other store printed these before, but we are not supposed to print these under any circumstance. It is copyright. I'm sorry, ma'am.\" Eventually, the lady called out, \"Well, if you aren't gonna help me, then I'm gonna go to that other store!\" and stormed out.\n\nAfter this whole fiasco, my co-worker, who gets anxiety easily, was alittle upset. My manager went up to him and said, \"Copying copyrighted material is against policy. You were completely right, and I'm glad you did the right thing.\"\n\nYou'd be surprised how often this happens. It happens maybe once or twice a week: Customer brings in copyrighted materal; We explain why we can't reproduce it; Customer gets upset.\n\nI don't think it'll ever stop lol.",
        "created_utc": 1520462073,
        "upvote_ratio": ""
    },
    {
        "title": "Old dude brings in yet another strange thing to the department I work at",
        "author": "Reanimations",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/82bdce/old_dude_brings_in_yet_another_strange_thing_to/",
        "text": "Hello! I work at a copy and print department at a certain nationwide store, where people bring us stuff to get copied, faxed, laminated, etc. \n\nThere's this one customer that comes in that literally no one likes. He came in yesterday to get something enlarged. Pretty typical stuff, but what he wanted enlarged was pretty odd. He wanted an article about \"why girls in the 1960s are more pretty than girls in the modern age\" enlarged to fit an 8.5 by 11 sheet of paper. \n\nI brought it back there to try and enlarge it. I did, and text got cut off on the right side, so I tried different settings. I held the messed up page in my hand and I started reading some of it out of morbid curiosity. The first paragraph talked about how they were prettier back then because \"junk food wasn't easily accessible back then.\"\n\nThis old dude always brings in the weirdest stuff. A co-worker said that he brought in a picture of a famous celebrity that had dreads. He said he wanted a copy of it to send to his son to show him how he shouldn't do his hair, cause \"That preppy bullsh*t looks ridiculous.\"\n\nIdk why he still goes into public if he's so hateful and miserable.\n\n---\n\n[Fun Fact: It's the same guy from this story.](https://www.reddit.com/r/talesfromthejob/comments/7yaduk/guy_accidentally_chooses_to_get_cash_back_refuses/)",
        "created_utc": 1520300846,
        "upvote_ratio": ""
    },
    {
        "title": "New job with cute neighbors",
        "author": "MadamMim13",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8282g5/new_job_with_cute_neighbors/",
        "text": "Today is my first day filling in for someone at Tinytown City Office. The job itself is super easy, at least as the substitute. The office is part of a building which also houses the senior center. That gives you an idea of how small the town is.\n\n\nIt's lunchtime so there are several senior citizens here despite the biting wind and waist-deep slushy snow. Many of them were here when I got here, just playing cards and enjoying each other. There's even a guy who sounds exactly like the nasally voice Jim Carrey used in a scene for Horton Hears a Who.\n\n\nThe cook has been hard at work all morning but everybody knows they can't dig in just yet. One of the gentlemen leads everyone in the Johnny Appleseed prayer song. Then the conversation resumes, this time accompanied by the sound of utensils clinking against their plates \n\n\nSorry if this is too long for such a little story but it warmed my heart and I hope it brings a smile to your face",
        "created_utc": 1520274362,
        "upvote_ratio": ""
    },
    {
        "title": "Real note from our store manager",
        "author": "Tigeryuki",
        "url": "https://i.redd.it/ytsygxqrbtj01.jpg",
        "text": "",
        "created_utc": 1520198069,
        "upvote_ratio": ""
    },
    {
        "title": "Rules that aren’t listed on rule signs",
        "author": "scottd90",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/81v37q/rules_that_arent_listed_on_rule_signs/",
        "text": "I work at the most magical place on earth so we have lots of rules for safety and where I work people go swim. \n\nSo we have rules for pools and slides and I always LOVE when you get those guests that you try to enforce a rule to and they say “show me where it says that x isn’t allowed”",
        "created_utc": 1520132197,
        "upvote_ratio": ""
    },
    {
        "title": "When someone cancels their policy and this is the reason they give. There are no other notes on the policy either so we really don't know why.",
        "author": "peanutbutterpandapuf",
        "url": "https://i.redd.it/p8a7q1k47dj01.png",
        "text": "",
        "created_utc": 1520002813,
        "upvote_ratio": ""
    },
    {
        "title": "Tale of a Clown: Clown vs. Metal Detector",
        "author": "ITWolf",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/81azhw/tale_of_a_clown_clown_vs_metal_detector/",
        "text": "*… or, I swear I’m not a suspicious looking person!*\n\n&amp;nbsp;\n\nIn college, I worked as a clown.  Yes, full costume/makeup.  During summers while I was at home, I worked for a company that handled all the payments and scheduling.  They hired out clowns (and bouncy houses) for birthday parties, company picnics and the occasional promotional event.\n\n&amp;nbsp;\n\nOne day, I was scheduled for a company/family event that was held at the local $SomeGovernmentBranch headquarters.  I don’t remember who the event was for, but there were kids and I was hired for entertainment.\n\nThis was a summer or two after 9/11, and, being a government facility, security was heightened.  No problem, I think…\n\nComing into the facility, the guards by the metal detector looked alert, but amused.  They were expecting a clown.  They wave me over to the metal detector and x-ray machine and explain to enter, I need to log in, and go through the machine.  No problem, I think…\n\nI log in, put my bag through the metal detector, and empty my pockets of the obvious metal: keys, wallet with change, my name badge that’s pinned on, and a couple magic tricks with metal bits.  I figure the rest doesn’t have metal, so it shouldn’t be a problem.  I step through the metal detector.\n\n&amp;nbsp;\n\n**BEEP!  BEEP!  BEEP!**\n\n&amp;nbsp;\n\nOops.  I step back through (beep!) and take a minute or two to really empty my pockets.  I have lots of pockets.\n\n\nJuggling balls… Sponge Balls… Handkerchiefs… deck of cards… a few magic gimmicks… Nothing metal, but it fills up a tray, and my pockets are empty.  One of the amused guards inspects the contents as I step through the metal detector, again.\n\n&amp;nbsp;\n\n**BEEP!  BEEP!  BEEP!**\n\n&amp;nbsp;\n\nI’m confused this time.  I know my pockets are empty.  The guard comes over with a wand and waves it over me.\n\nAs it reaches one of my pockets: *beep! beep! beep!*\n\nI put my hand in my pocket and feel a bit of metal… on the back of my hand.  It’s a safety pin holding on an oversized, plastic button.  They’re just decorative bits on the costume.  If I didn’t have my white makeup on, it would have been obvious I was blushing from embarrassment.\n\nI show the guard and offer to remove the buttons (I had four of them, total).  He finishes waving the wand over me (beeping at each button) and waves me on.\n\nI take a few minutes to fill my pockets back up.  I pick up my bag and head towards the courtyard they are holding the event in.",
        "created_utc": 1519957352,
        "upvote_ratio": ""
    },
    {
        "title": "Boss degenerate fuck",
        "author": "wendunder",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/80rqu3/boss_degenerate_fuck/",
        "text": "Man, I got this job at a family company. Only the father is left and appointed two girls manager. One works the science part and the other the customer part. \n\nMan, the gal running the customer part makes $26 bucks an hour. She comes in drunk around 1030, if at all. Sometimes she might show up sober, but will leave for a meeting and then come back drunk. I called her on it because I was furious but she denied it and proceeded to smell like mouthwash every day for several weeks. \n\nThis shit is nuts too. There is mostly out door labor work and she manage to only work outside when it's roughly sunny and 68 degrees or therabouts.\n\nShe texted me (blocked her) but now the young staffers with lists of things to do all day. And I mean like 6 to 12 texts a day. Even at home at night. Especially in the morning when she's hungover and you have to do her work for her. \n\nI know this sounds egregious like I'm some asshole but I assure you it's just this bonkers. \n\nShe's got a work laptop and is supposed to be in meetings all the time. So after being there a year I put a tracker on her laptop. \n\nMan, she just watched amazon movies all day long on the thing. Billed for hours she wasn't working. Even this last week one of the staffers found her actually at work but her lights off in her office and it was locked. He went in there to do something and looked around and FOUND her laying in the corner of the room hidden, and playing on her phone.\n \nThe science manager, I and all the other employees for the most part get along. I quit speaking to the retail manager at all and everyone talks shit. I've attempted to talk to the owner twice but he just doesn't want to hear it. \n\nI finally sent an email to him saying that although I'm angry that she obviously needs some help with drinking because it's going to hurt her and her family. He didn't believe me. I would submit the computer tracking info but I'm afraid I'd get in trouble for that. \n\nMy main thing about this is that in a world where people, myself included, think fairness exist. This horseshit happens.  \n\nLiterally drunk woman rarely comes to work, bills hours for watching movies \"working from home\", pawns shit off to all the other employees, sleeps on the job and lies to everyone. Lastly, she doesn't make a schedule or plan what anyone is supposed to do. So on that end it's good because we get to direct our own day. Just hate that someone gets almost twice my wage to be a fuck with. ",
        "created_utc": 1519778361,
        "upvote_ratio": ""
    },
    {
        "title": "This note and greeting card was passed around my office... Are they cheerfully asking us to resign? I didn't know losing the card was a fireable offense.",
        "author": "hotdogcolors",
        "url": "https://i.redd.it/put2n2sbqsh01.jpg",
        "text": "",
        "created_utc": 1519319297,
        "upvote_ratio": ""
    },
    {
        "title": "Guy hands me phone to help him email something. Girl breaks up with him as I hold the phone",
        "author": "Reanimations",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7yakmq/guy_hands_me_phone_to_help_him_email_something/",
        "text": "**TL-DR:** I was helping a gloomy-looking customer email something from his phone, and a chat bubble containing a girl's head pops up, and it says \"I'm sorry. I don't think it's working out between us.\" \n\n-------------------\n\n**Full Story**\n\n-------------------\n\nIt was another normal night at the Copy and Print center at Office Depot. I was closing that night, and usually, nights aren't very busy at all, so I was just doing some print jobs in the back. I see a dude walking up through the line, and I noticed that he kinda looked upset. I didn't think much of it, walk over, and say \"How may I help you?\" I see him texting someone on his phone, then he said, \"Oh. Yeah. I need to get something printed off my phone. Can you help me email it?\" This is normal for me, so I reply, \"Absolutely. Can I see your phone?\" He hands it over with the PDF pulled up, and I start doing what I usually do: hit the share button, hit GMail/Yahoo Mail/Default Mail App/etc, then type in the email address.\n\nI hit the share button, and I saw a chat bubble in the corner with a girl's selfie on it. I didn't think much of it cause I didn't care. After the Share options roll up from the bottom of the screen, I see the chat bubble pop out a message. It read, \"I'm sorry. I don't think it's working out between us.\" I kinda froze cause I didn't know what to do. He saw the message and hastily swiped it away, saying, \"Oh. Sorry about that.\"\n\nI email the file, open it up on the PC, and print it out. When I go to the printer to fetch his printed papers, I just kept thinking about what happened. I was thinking, \"Well damn. No wonder the guy is upset. Him and his girlfriend were having troubles, and then I just witnessed his girlfriend break up with him.\" After that, the guy didn't say much, and was hastily texting the girl. After I checked him out and told him, \"Have a good night,\" he left with his head down.\n\nPoor guy.",
        "created_utc": 1518912236,
        "upvote_ratio": ""
    },
    {
        "title": "Guy accidentally chooses to get cash back. Refuses to take his own money",
        "author": "Reanimations",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7yaduk/guy_accidentally_chooses_to_get_cash_back_refuses/",
        "text": "**TL-DR:** The guy accidentally chose to get $20 cash back. I try to stop him, but he thinks he didn't do it and refuses to listen to me. Transaction completes and I hand him cash back, and he starts a scene in front of the store and refuses to take his own money, even after manager comes over and says we can't do anything about it.\n\n----------------\n\n**Full Story**\n\n----------------\n\nIt was another normal day at the copy and print department I work at, and I see that one customer walked in. He's a tall guy and an older dude, and the long-time employees usually sigh when they catch sight of him. He's a s**t starter, usually catching an attitude with anyone he communicates with. Long before he caused the scene, he was butting into me and another customer who we're trying to make business cards. The customer asks how his day is going, and he starts this whole thing about why \"How's your day going?\" is a rude question. I forgot what he said cause he talks so fast. \n\nAfter he talks to different people about weird stuff, I get to checking him out and getting him on his way. I ring his prints up and he inserts his card. After violently telling the tiny card reader he wanted his receipt printed, he puts his card in. Then, we get to the cash back screen. I watched him pick up the touchscreen pen, and hit \"$20\" violently. He then goes and hits \"None\" about five times violently. I stop him from entering his pin and ask \"Did you want $20 cashback or no cashback? I think you hit $20 by accident.\" He gave me a look and said \"I didn't hit no cash back. I hit none. You saw me.\" Then proceeded to go on about how cash back is a fraud (which is BS, but okay. Whatever. I'll listen to him. I don't have a choice), and somehow gets on the topic about how things like chicken at supermarkets is not real chicken. After that whole speech, I checked my monitor, and sure enough, it said \"Cashback selected for $20.00.\" After he enters his pin, I then tell him that it says he selected $20 Cashback. He was like, \"Boy. I already told you No. I hit none on the screen.\" The transaction finalizes, and I pull out $20 from the register, cause he asked for $20 cashback. I hand him the receipt, and he saw the $20 bill, and asked, \"What's this?\" I told him his cashback.\n\nAnd this is when the s**t hits the fan.\n\nHe stood up straight and raised his tone at me, saying \"I said No cashback! Why you handing me this damn money?!\" I stay calm and tell him, \"I can try to refund it, okay? Let me see the receipt.\" I call over from some help, and my fellow associate said, \"Yeah. Idk how to refund cashbacks. You should ask the manager.\" I call the manager over, and she told him, \"Yeah. I don't think we can refund cashbacks.\" He then says, \"Well, I won't take it. I didn't ask for no cashback. I have enough money in my wallet. See?\" He then pulls out his wallet and opens the money pouch to show us, for some reason. My manager then calls the help desk at the Office Depot headquarters in Florida, and they said that they cannot refund cashbacks. \n\nKeep in mind what a cashback is. It basically pulls money out from your bank, and turns it into cash that you get as change from the register. It's a courtesy, and does not lower your wealth at all. So the way that the guy would refuse to take it is ridiculous, because he could go deposit it into his bank, and he would be back into normalcy like he never did a cashback.\n\nMy manager tried to void the transaction, but found out that it wouldn't refund the cashback. It would only refund what he paid for, which was the prints, and he STILL refused to take the cashback. After causing a scene in front of a line of about 3 people, calling my manager and I liars a couple times, he eventually gave up and stormed out with his own money.\n\nSo, basically, the guy was refusing to take his own money. That's literally the whole situation. It was a minor mistake that he overblew into making us look like we were refusing to help him. We literally couldn't help him, cause a cashback is not made to be a refundable item. It's a courtesy, through and through.\n\nIt was nice to get this off my chest, cause it made me so upset.\n\nEDIT: More details that I left out\n\nEDIT 2: I heard from a co-worker yesterday that the old dude came back the very next day and started another scene about the same thing. I was completely stunned. ",
        "created_utc": 1518910329,
        "upvote_ratio": ""
    },
    {
        "title": "Ride phone caller",
        "author": "thatgirl21",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7xt42r/ride_phone_caller/",
        "text": "First time posting in this sub!\n\nI hold a special title/ position for my company. I am technically a security officer, but I probably have one of the cushiest posts ever- I'm a reception guard. Which means, I sit in a newly remodeled reception lobby to answer phones and check visitors into the building. I'm a third party contractor who is posted at a manufacturing facility, that also houses the executive suites for this inter-national company. There are more than 500 employees at my site including the factory workers (who don't have phone extensions) and the executives (most of whom I don't see on a daily basis)- and there is a separate employee entrance, so I'm not positive who is on site on a particular day. That said, here's my story from today...\n\n\nI'll be Me, and he will be A for attitude.\n\n*Phone rings*\n\n&gt;Me \"Good afternoon, _____ division. How may I direct your call?\"\n\n&gt;A \"Can I speak to Lisa* in h and r?”\n\n&gt;Me \"Okay hold one moment.\"\n\n*Phone rings again not 2 minutes later*\n\n&gt;A \"She didn’t answer, can I talk to someone else in h and r that will answer their phone?”\n\n&gt;Me \"Okay I’ll try Dan* for you, hold one moment.\"\n\n*Phone rings AGAIN 2 minutes later.* \n\n&gt;A “Hi he went to voicemail too, can I talk to someone who will actually answer their phone? Lisa was supposed to handle something for me last week, but she hasn’t called me back and I’ve left her voicemails all this week.” \n\n&gt;Me \"They are the only two in HR that are here today.\"\n\n&gt;A ”Well, are you sure Lisa is there today?” \n\n&gt;ME \"I’ve actually not seen her today, but I know Dan is here.\"\n\n&gt;A “Well, no one is answering their phone and I need to speak to someone. What do I have to do to?”\n\n&gt;ME \"I can’t tell if people are at their desks, let me try Ron* for you. Hold one moment.\" (mind you, \"Ron\" is the HR VP for all of America) \n\n*Calls AGAIN 2 minutes later.*\n\n&gt;A “He didn’t answer either. What do I have to do? I need to speak to someone in h and r” ^(**he keeps saying h AND r and it’s killing me!**)\n\n&gt;Me \"Those are the only three people in HR and I don't know who is at their desk or will answer their phones.\"\n\n&gt;A “Well what do I do? Can you just help me, or do I have to come there?”\n\n&gt;ME \"I can’t help you, I’m just in reception.\"\n\n&gt;A “Just get me someone that can help me.” (getting more aggro by the second).\n\n&gt;Me \"There’s not much more I can do for you, they're the only ones in HR.\"\n\n&gt;A “Is there someone else in that office? Like, near them that I can talk to?”\n\n&gt;Me \"No, they have their own wing.\" (now I'm getting more irritated)\n\n&gt;A “Wow, then I guess I have to come down there. No one answers their phone, you guys sure have your stuff together. Goodbye.”\n\n*Then I hang up.*\n\nI understand you’re frustrated that no one has answered, but I can’t help you. Don’t give me attitude because I’m not telepathic or have x-ray vision to see if someone in HR will answer their phone.\n\n^(* names have been changed)\n\n**EDIT:** Title supposed to say RUDE, not ride *facepalm*",
        "created_utc": 1518725160,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy crazy ladies...",
        "author": "DoubleD_Dabs",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7wket8/crazy_crazy_ladies/",
        "text": "Ultra long, (and very technical), retelling ahead. What follows is the ending to my worst professional experience ever, occurring in 2017. \n\nEnjoy:\n\nContext of this post: Management has had a tumultuous month with *employee*.  She officially put in her actual notice (in writing) --day, November --, 2017 so hopefully this won't continue to escalate.  That said, I unfortunately believe it will.  She's on the schedule in \"location\" through December -- which means I'll have 4 more interactions with her and I honestly have no clue what the outcome of that will be.  My experience with *employee* and the issues that have come up in the past between her and other co-workers is that *employee* tends to overthink interactions and situations.  She often rewrites what happened, and is able to convince herself of intentions, thoughts, and actions from the other party that just weren't there.  I'm providing this as my personal account of events to the best of my recollection.  Obviously if nothing comes of this, you are free to disregard. \n\n\n-------------------------------------------------------------\n\n\n*Employee*: Timeline of Events \n\n\nOctober -- - *Employee* was a no-call/no-show.  *Manager* made contact with her approximately 45 minutes after her shift had started.  She showed up but was visibly distraught over a rash that had broken out on her palm and so she was given the day off - after *Manager* informed her that due to policy, *employee* would be on a final warning for the next 30 days.  That week, *employee* made it clear to multiple team members that she felt *Manager* was cold and it was cruel of her to not care about her medical condition more.\n\n\nOctober -- - *employee* was still very upset about being on a final warning and *Manager's* approach to putting her on warning.  And was very frightened she was getting axed immediately.  I tried to reason with her that although it's our policy, the management team has discernment and takes extenuating circumstances into account.  I reminded *employee* that we've never had an issue with her attendance before and to not let it get to her head.  I felt, at the time, that I'd gotten through to her and she was no longer actively afraid of immediate termination.\n\n\nNovember -- - *employee* was an hour late (traffic was bad), but was in communication.\n\n\nNovember -- - *employee* was a no-call/no-show for an hour.  She had apparently called in on time (before the store opened), but reached out to the store phone number (that she knows is put on \"Do Not Disturb\" each evening as she's the one responsible for taking it off \"Do Not Disturb\" each morning at 9:00 a.m., when we open.)  I believe at 45 minutes late she actually reached out to *Manager's* cell phone.  She was understandably shaken due to having been involved in a minor traffic incident, sliding her car off the road in the snow.  She was given the rest of the day off. \n\n\nNovember -- - When I spoke with her about it the next day she acted confused as to why it counted as a no-call/no-show, as in her mind she'd left a voicemail on the store phone.  I reminded her that it went straight to vm, and that in orientation I was very clear that the policy stated that actual contact had to be made with the manager on duty. I asked her directly why she hadn't reached out to *Manager's* cell phone initially.  She told me she didn't have *Manager's* number.  Even though she had reached out to *Manager* multiple times before and also managed to find it again 45 minutes after she left the vm on the \"Do Not Disturb\" phone that was straight to vm. She stood by her assertion that it being considered a no-call/no-show was unfair and undeserved.\n\n\n*employee*  informed *Manager* that this isn't going to work out for her long term due to the commute.  She wrote her desire to leave in a *group communication app* message and sent it to myself, *co-worker*, and *co-worker* (our reception team).  I verified with *employee* in person that her intention was to leave.  She informed me that she will not leave us hanging but whenever we can get someone in and trained, she'll be done.  I had a conversation with her to reassure her that if she wants to work something out with us, I'm sure there's an option somewhere.  I informed her that from my perspective, the first time being late and then *Manager's* approach to putting her on warning just threw her off.  It sent her into a tail spin mentally where she worked up the issue so large in her head that she started creating the very thing she was scared of - being late.  I let her know that if she was only quitting out of fear of being fired, that we should discuss other options first.  She seemed resolute and continued to inform the team that this isn't the right fit for her long term.\n\n\nNovember -- - (this seems like it is off-topic, but it factors in later) *other employee on same team as ultra cray lady* let me know that she's afraid to ask for a raise.  I tried to give her a little coaching but she got aggressive in her body language and repeated twice that \"Other places are starting to look really good\".  I am already worried that we're needing to train a replacement for *ultra cray lady / employee* so I reached out to \"GM\" to request that he initiate a conversation with *2nd place cray /other employee* to hopefully avoid another reception team member needing to be replaced.  According to \"GM\", the meeting was productive.\n\n\nNovember -- - I came in around 10 and heard the *ultra cray lady / employee* in office with *GM* loudly exclaiming that she was very confused as to why all the employees kept coming up to ask her when she was leaving.  She stated that she never put in her notice.  And that if anyone interpreted it as such, they were misunderstanding her.  I inserted myself into the conversation at this point as I was someone who had actually been in communication with her about this and could speak to the inconsistencies in her newest version of events.  After speaking with her and *GM* at length, she was willing to concede that she understood why people thought she was leaving, but that she was, in fact, staying.  In it for the long haul! Going so far as to even tentatively work out a schedule change that would have her switching some of her weekday shifts for weekend ones in order to mitigate the traffic challenges she faced on the commute.  She told me that her and *2nd place cray /other employee* are getting along and that they want to do a *industry* appreciation night out together as a team.  I agreed, we set tentative plans for December --.  I am relieved that the problem seems to have worked itself out.\n\n\nLater in the day (here's where that seemingly off topic bit with *2nd place cray / other employee* merges in with the issues with *ultra cray lady / employee*) I was made aware that *2nd place cray /other employee* spent the weekend telling many employees that I humiliated her extremely due to the impromptu meeting she had with *GM* on Friday.  I'm assuming she made the correct assumption that the meeting with *GM* was a direct response to the interaction that her and I had earlier that same afternoon.  I made plans with *GM* to have a meeting with her.  And I reached out to her via \"group communication app\"  to apologize for the way she had interpreted my actions.  She never responded.  Professionally I am disappointed and frustrated that my reputation for being approachable and solution oriented may be called into question based on the things *2nd place cray /other employee* is telling people.  Personally I am emotionally spent.  It feels like I can't ever do the right thing for my team; each action I take just ends up upsetting everyone.  I started to realize that I'm getting far too involved.  I did some research and discovered that my management style mimics the characteristics of \"Reactive Management\".  I realized that I've gotten too emotionally invested and needed to back off in order to maintain professionalism in the work place.  I decided at that moment that the last thing I want to be doing with my free time away from work is \"working\" on making my team 💞like💞 each other; I just want them to be professional and be competent in their positions.  And so considering that we had only just made the plans three hours prior for the \"industry\" appreciation night in December, I reached out to the team to let them know that I was unfortunately not going to be able to make it after all.\n\n\nNovember -- - *ultra cray lady / employee* did not like that I was not going. She tried repeatedly that day to change my mind.  At one point she approached me saying \"I'm sorry I did something that makes you not want to hang out with me\".  I was firm in my decision but I made it very clear it had nothing to do with her.\n\n\nNovember -- - After having not succeeded in convincing me the day prior, she tried a fresh approach and came in to talk to *GM* about the necessity of me being at the \"industry\" night with them.  *GM* approached me about it and I let him know where I was at with everything.  I can remain professional with people in the workplace even if I'm not hanging out with them outside of it.  And I personally don't appreciate having my decisions being disrespected.  I am allowed to make decisions about my personal life independently of other's preferences.\n\n\nRight before midnight (*ultra cray lady / employee*)  sent a message to the reception team in *group communication app* that said \"I do appreciate you all!  But peace out for now and appreciate any future LOVE\" and 15 minutes later sent a weird email to *GM* and myself.\n\n\nNovember -- - I woke up to a missed call at approximately 7:30 a.m. and an email apologizing for the one she had sent in the middle of the night.  I called her back and left a voicemail and she never responded.  I addressed the topics in the email she had sent in the middle of the night via email but never got a response.  She came in on her day off to present *Manager* with a written two week notice.\n\n\nNovember -- - I had not seen or heard from *ultra cray lady / employee* directly since the strange messages and when I came in to the store, she wasn't engaging with me at all, which is uncharacteristic.  I waited an hour or two - and then I asked what day was her last day. She said she didn't know.  Through the course of our brief conversation regarding her leaving, I had shared that hearing it second hand had hurt a little because I had thought we were on friendly terms with open communication.  She turned on me real quick, accusing me of ignoring her call (when really I was just sleeping because we work different shifts and she's at the store much earlier than me).  I tried to remind her of that and highlight that I had called back as soon as I saw the missed call.  I even had left a voicemail but had not heard back from her. She just launched into how we're not friends, we're just co-workers, because I never hang out with her outside of work.  She shared that she felt I abandoned her at the first hint of *2nd place cray / other employee* being difficult with me (news flash: my relationship with *2nd place cray / other employee* has always been fraught with hostility) and she's had to put up with it for months so that makes me weak and unfair for expecting her to deal with something I refuse to.  And other things that I can't quite keep track of because I wasn't expecting such vitriol.  My impression by the end of talking to her, was that had I just gone to the \"industry\" event she would have been as happy as a clam and everything would have been fine.  Which in my opinion is ludicrous.  My job description does not maintain that I must have friendships with my coworkers outside of the workplace.\n\n\nNovember -- - I said hi when I came into the store.  I did not engage with *ultra cray lady / employee* on anything not work related.  I had to ask her about my tips that were missing which I know frazzled her.  But I made it clear that I wasn't upset, just trying to track them down.  Other than that I didn't really interact with her.  I kept my distance.  I thought everything was fine but after she left I was told she was complaining about all the looks and whispers and wanted to talk to HR.\n\n\nLuckily she left. She stayed through the last day of her notice and then disappeared... I'm still reveling in the lack of her existence. By the way, *2nd place cray / other employee* ended up also leaving as well.\n\nThe nightmare of restaffing our front desk has nothing on these 2 ladies!",
        "created_utc": 1518252975,
        "upvote_ratio": ""
    },
    {
        "title": "Asking for help...",
        "author": "dacracot",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7w7n30/asking_for_help/",
        "text": "So I new to a software development team, not new to software development (I've got 30 years of experience), but I'm working with a four member group that I've never worked with before.\n\nThey have an established application of about 500kloc and a user base of around two dozen.  So I'm being worked into the development cycle and have been given a new feature to code using a language I'm familiar with, but I am not familiar with the framework used.\n\nSo, we have a regularly scheduled team meeting each Wednesday where I first thought would be a good place to ask questions.  Turns out the since November when I joined, only one of these meetings have occurred.  Early on, they were cancelled, but now just ignored.\n\nSo I've started emailing requesting help with mostly the framework details that I can't reverse engineer on my own from this completely undocumented, uncommented code base.  But these are ignored as well.\n\nMy next attempt at getting help is to just show up at the other team members door and ask in person, but my couple attempts at that to date, I never managed to get them out of their office to come look at my code.\n\nWhat to do?",
        "created_utc": 1518120048,
        "upvote_ratio": ""
    },
    {
        "title": "What this? We no order this!",
        "author": "2much2confess",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7vw8zt/what_this_we_no_order_this/",
        "text": "TL;DR at the bottom\n\n\nA few years ago, while I had just finished school and was waiting for my college classes to start, I was working for a company that tried to inform people about some services the government offers. They'd send out employees who asked every household whether they'd like information on these services and if they'd say yes, the company would collect all flyers, etc. about the service the customer would like to learn about, put them in an envelope and deliver it to them by hand.\n\nI was doing these deliveries, which esentially is the work of any courier who delivers packages. It was really important that we delivered the envelopes to the exact person who ordered it (due to some marketing stuff about personal interaction), so if the person wasn't home or didn't answer the door, we'd have to take the envelope back to the office and try again the next day. \n\n\nThis particular day was pretty good. Almost all of the people remembered that they ordered the information (it was completely free for them, because it was government-funded), nobody yelled at me for not throwing it into their mailbox, no creepy guy asked me to come in and have coffee with him (yeah, that happened. I was a 17 y/o girl and it freaked me out) and they were overall pretty nice. I then came to an apartment complex, wanting to deliver an envelope to a man with a foreign sounding last name (note that I'm from Europe, so my native language isn't english). This was nothing unusual working in a big city, so I rang, smiled at the older man who opened the door and said my usual line:\n\nMe: 'Hi! My name's anon, I'm from company xyz and I'm bringing the ordered information flyers. Are you Mr. last name?'\n\nHim: ??? *starts talking in foreign language*\n\nMe: (in english) 'Sorry, I don't understand you. Do you speak english by any chance?'\n\nHe continued talking in the foreign language.\n\nMe: (getting desperate and thinking of any language I had ever learned in school) 'Vous parlez francais? Habla espanol?' \n\nStill no reaction, so I show him the envelope with the name on it and look at him. I now talk slowly and say 'Did you order this?'\n\nHe's turning around and yelling into the apartment. A girl, about my age appears, who speaks my native language. Not great, but good enough to be understandable.\n\nGirl: 'What up?'\n\nMe: 'Someone in your apartment ordered these flyers about [government service].'\n\nOlder woman appears in the door, probably the mother. She starts yelling in foreign language, while the girl tries to explain to her father what's happening. The man starts throwing up his hands and get louder. He's yelling into the apartment again. 2 more girls appear behin him. They are now all talking to each other really loudly, while I'm still standing at the door. It's been over 5 minutes now, maybe even 10.\n\nGirl: 'Yes, is our name, but dad not order this. What this?'\n\nI'm starting to sweat now as it's freezing outside and I'm wearing like 4 jackets and a scarf, but obviously these clothes are too warm in the heat of the building. So I'm trying to explain the service to her and that someone ordered the information, while the rest of the family is still yelling at each other.\n\nAfter another 2 - 3 minutes another door in the apartment opened and I saw a young man, probably in his early twenties, asking what was wrong. He's loudly greeted by 5 of his family members, while I hold up the envelope and give it another try.\n\nMe: 'I'm from company xyz and I'm bringing the ordered flyers. Was ist you who ordered them by any chance?'\nGuy: (with a big smile and perfectly fluent in my native language) 'Yeah, thanks so much! Sorry for the hassle with my family.'\n\nMe: 'No problem. Bye!'\n\nAll of them are staring at him, a moment of silence.\n\n\nHe then closed the door, and while I was standing there dumbfounded I could hear the confused talking/yelling again. Wow. Didn't know getting informational flyers about governmental services could get that exciting.\n\n\nJust to make this clear: They weren't unpleasant at all and they weren't yelling angrily. They were just talking really loudly, probably because they tried to be louder than the TV. I just had to think of this incident when I was reading through all of these 'Talesfrom' subreddits and thought you might like the story.\n\n\n\nTL;DR: It took me more than 10 minutes to hand over an envelope because nobody knew who ordered it.\n\n\nEdit: Formatting.",
        "created_utc": 1518011962,
        "upvote_ratio": ""
    },
    {
        "title": "ICR TouchPoint Epos Software",
        "author": "MarciaDavisonza",
        "url": "https://betterprice.org.uk/icr-touchpoint-epos-software",
        "text": "",
        "created_utc": 1517981668,
        "upvote_ratio": ""
    },
    {
        "title": "Female customer openly looking at porn",
        "author": "Phantom_Viper",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7uyq32/female_customer_openly_looking_at_porn/",
        "text": "Just got a new job working as a cashier for a valet company at a hotel/club and finished my 4th shift tonight. It is in a very active partying part of town and I have already had a few strange encounters and drunken upset customers but this has to be the strangest so far. About 7pm a woman approaches my booth to pay for her parking and to get her car pulled around. She hands me her ticket and I tell her the price, as she goes to dig in her purse for money she sets her phone down on the counter. I set her keys aside so a co-worker will pull up her car and when I turn back around she is still getting cash from her purse and I glance at her phone and see what looks to be a page on PornHub I think(think I saw PornHub logo. Was definitly porn though but I didn't want her to notice I had noticed so I looked away but it just seemed so strange to me. This is a very public area and you'd think someone going that would at least face there phone down or turn off the screen. I guess it is well within the realm of possiblites for this location but I have just never seen someone so shamelessly browsing porn in public(not that I have even see a shameful person watching porn in public but still, you get the point).\nI mean last weekend late at night some lady approached talking to her friend about how she was suppose to have sex that night but she had a bad date and after I asked her how her night had been she told me directly how it had been. For some reason though the lady openly browsing porn is just so much stranger to me.\nWell sorry for droning on, thanks for reading. :)\n\nTL;DR Lady came to pay for her parking and had porn open on her phone that she had set on the counter as she was looking for money to pay.",
        "created_utc": 1517655594,
        "upvote_ratio": ""
    },
    {
        "title": "I just worked 33 hours straight today.",
        "author": "markis_com_au",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7u0opq/i_just_worked_33_hours_straight_today/",
        "text": "To get a mail out done for a new client. I've just woken up from a 4 hour nap, drinking a beer and about to head back to bed.  Hopefully I can get a full 8 hours sleep in before tomorrow.",
        "created_utc": 1517315528,
        "upvote_ratio": ""
    },
    {
        "title": "Dog Food Taste Tester",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=1F_BiUcbOKg",
        "text": "[deleted]",
        "created_utc": 1517309936,
        "upvote_ratio": ""
    },
    {
        "title": "Just put in my two weeks.",
        "author": "WalrusBelch",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7tbtw7/just_put_in_my_two_weeks/",
        "text": "I had a meeting today with my boss, whom I almost never see because I work the grave shift. She talked about moving the schedule around so that people could learn all aspects of the job (its a small business). And everything went well, we caught up, came up with some ideas and I left thinking I'd be getting some more stuff to do during the very boring night shift.\n\nSo I came in to work tonight after the meeting and I went upstairs to the office/breakroom area. And I'll admit it, I snooped a little. I just glanced over to see if there was anything on my boss's desk referencing the meeting we had earlier. I saw that she was writing notes so I figured I could see what info she deemed important enough to write down.\n\nRight in the middle of her desk was a \"mock up\" work schedule. Another employee had written on the side of it some stuff that basically said, \"here's what the schedule would look like if [my name here] was gone.\"\n\nOk, so this was printed 3 days ago, when she had initially tried to schedule the meeting before it getting put off until today. \nShe was totally gonna fire me! But instead, she actually communicated with me and decided she wanted me to learn more about the job and blah blah blah.\n\nI no longer feel like I have job security here, and the incredibly poor communication has been a nightmare to work with. Seriously, she only communicates by text, and never responds. So I Just put in my two weeks. My resignation is right next to her \"mock\" schedule. \n\nAt least she won't need the two weeks to find my replacement since the schedule is already there lol. \n\nShe could have at least put it somewhere less obvious! I mean she had a fellow employee make it so I can just imagine she was like.. \"hey, so I'm thinking about firing [me], could you figure that out for me?\" \n\nFuck that.. at least be honest with me, let me know what the hell is going on before you decide to plan ahead without me. I also thought it was weird that she wanted her assistant person present during our meeting, but I assume it was so that she could have a witness for the firing or whatever. \n\nI've been thinking about leaving for a while anyway, so I guess I'll just take this as an opportunity. \n\nLESSON: communication solely through text is dehumanizing and a terrible way to run a business. \n\n.\n.\n\ntldr: had a meeting w/boss that went well, but later found a mock up schedule that proved she wanted to fire me at that meeting. So I put my resignation next to the pre-made schedule. ",
        "created_utc": 1517046233,
        "upvote_ratio": ""
    },
    {
        "title": "Whenever I quote something on a Friday, I always include the number '69' in the total price somewhere.",
        "author": "Mr_A",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7t9d8b/whenever_i_quote_something_on_a_friday_i_always/",
        "text": "Our quoting system is pretty arbitrary, mostly because everything we do is custom. And because of that I can play around with the value amount of pretty much anything we sell down to 0.001 of the value of it. For example an install might take 60 minutes, but it also might take 59.999 minutes. By fucking around with these numbers I like to spit out a value for an item that contains the number 69 somewhere.\n\nDepending on what the job is I might quote something at 10am which costs $569.25 and something at 11am which costs $9,258.69.\n\nSometimes it winds up that the customer has to pay a little bit more on Fridays but other quotes cost the company some money just for my little end-of-week giggle.",
        "created_utc": 1517016650,
        "upvote_ratio": ""
    },
    {
        "title": "We were told to stop working on that....",
        "author": "XIGRIMxREAPERIX",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7t5j37/we_were_told_to_stop_working_on_that/",
        "text": "So I've been working on a project to supply another team with software and any hardware information so they could get this software running in \"The Cloud.\" \n\nI spent the last week harassing suppliers for licenses. Volunteering various coworkers to help me test the software under different conditions. Finally got all the information I needed and forwarded it along. I got a nice response from the other groups manager. \"Your boss told us that this project is no longer going forward.\"   \n\nWell fuck that would have been nice to know. Wasted a shit load of time, used up some favors, and now look like a fucking idiot. Thanks boss man!",
        "created_utc": 1516983164,
        "upvote_ratio": ""
    },
    {
        "title": "One of those jobs...",
        "author": "[deleted]",
        "url": "https://entropicrealm.wordpress.com/2018/01/13/test/",
        "text": "",
        "created_utc": 1516618790,
        "upvote_ratio": ""
    },
    {
        "title": "30 minutes is too short for a beak.",
        "author": "BigBadBob133113",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7rgb7o/30_minutes_is_too_short_for_a_beak/",
        "text": "TL:DR at bottom, ltl,ftp, on mobile, yada yada yada...\n\n\nSo, we all have that one co-worker who just seems oblivious to some things. Mine is my line partner. I work for a LARGE multinational product manufacturer as a technician team lead over three lines and six people. This role comes with quite a bit more responsibility than the other line technician roles, but with a pay increase to match. It does NOT come with commiserate authority. Members of my team can respond to my requests with a firm “f*!k off,” and there's nothing I can do about it. \r\n\r\nMy leadership style, I like to think, is to lead from the front. I don't ask anything of my team that I won't do myself. As long as they do their jobs, and don't bring management down on me for what they are/’t doing, I won't call them out on small things. Play on your phone a bit? No problem. Take long breaks? Go ahead. As long as your line runs good product at rate, and you are on the line for all planned work, go ahead, be my guest. Just don't give management anything to talk to me about. We all have a line partner to work this out with, me included as I am expected to run the line as part of my job. We help each other, beak each other, and cover for each other. \r\n\r\nIf you noticed, I have an of number of team members, including myself. One of my lines only has one technician, without a line partner. I am the only other person on my team qualified to operate this line. This means, that aside from working my designated line with my partner, I also have to act as partner to the other technician and cover their beaks, help with any problems they have. Other line operator paid can, and often do, alternate ling breaks. Hour on, hour off type breaks. Again, I doing care as long as your lunge is running well, and you are three for your work when needed. We don't have a very physically demanding job. Well, my line partner doesn't seem to understand that we can't really take hour long breaks anymore, otherwise we will miss some of our breaks, which they then complain about. During our 12 Hour shifts, we should get five beaks, one every two hours. Since I have to break two people, if everyone takes hour long beaks we will only get four breaks at most. So, we should all take slightly shorter beaks, half hour even. We will all get all or beaks. But no, he insists on taking hour breaks. So the other operator decides to take hour breaks. Now I only get really short breaks unless I want to getting bitched  at. \r\n\r\nSo, I guess, rant over. \r\n\r\nTL:DR line partner used to working as a pair can't seem to get working as a two man group, refuses to change ways, causing missed breaks and complaining. Because 30 minute breaks are too short...\r\n",
        "created_utc": 1516341375,
        "upvote_ratio": ""
    },
    {
        "title": "I hate wasting people's time/I'm an idiot",
        "author": "blumhagen",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7q2dgc/i_hate_wasting_peoples_timeim_an_idiot/",
        "text": "So the other day I delivered some supplies for one of our customers to a house, with instruction to put it in the garage as it would be unlocked. Man door was locked, &amp; there was no handle on the garage door &amp; it had a power opener so I figured it wouldn't open by hand from the outside. Called my customer, he then has to call the home owner to come &amp; let me in, but when he arrives he just opens the main garage door by pushing it up &amp; it opens. Man did I feel dumb.\n\n",
        "created_utc": 1515817642,
        "upvote_ratio": ""
    },
    {
        "title": "'Urgent: I need a simple discount set up in the next hour'",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7q0vvh/urgent_i_need_a_simple_discount_set_up_in_the/",
        "text": "[deleted]",
        "created_utc": 1515801696,
        "upvote_ratio": ""
    },
    {
        "title": "My bad experience with Amazon",
        "author": "DeviloFFLex",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7pr137/my_bad_experience_with_amazon/",
        "text": "So before I get into the negative part of this discussion I'll say that Amazon in my area offers decent pay/hours, and the benefits start on your first day.\n\nWe had a decent selection of food in our lunch area, water coolers were located next to every staircase. We had arcade machines, and free Powerade in the break rooms. Management also takes proper body mechanics very seriously, which I appreciated.\n\nThat's about the only good thing I can say though.\n\nI'm a runner, and I'm not one to shy away from being on my feet 10 hours a day. I can honestly say that I didn't have the same issue others have had with being tired or sore. The issues I had with Amazon were entirely with management.\n\nFrom what I've noticed, Amazon has an extremely high turn over. For every one person that quits, Amazon will hire twenty more. It's not about building a quality worker, and breaking down barriers. It's about getting through each day by the skin of your teeth. If you don't succeed, there is no try again...in the words of a little green creature man, do or do not, there is no try.\n\nI was stuck as a picker which wasn't even my assigned department. I was given only one day of training, and told by countless people that if my rate wasn't 100% that I would be fired. I was always proactive about the issues I was having, and all of my comments or concerns fell on deaf ears. When my manager finally decided that I needed to be reeducate, they had someone follow me around for about an hour. That was the extent of the help I was able to receive. The training is very poor, and most of the time the ambassadors act like working for Amazon is a joke. This is not a great way to make new hires feel confident in the job they're just beginning. Our ambassador was actually half asleep through most of our training and gave our group advice on ways to skip out on our jobs.\n\n\nFrom the day that I started as a picker I spent a good 90% of my time stuck on fracs, picking from large item bins, and having to run 15 or 20 isles to get from one item to the next. Management had mentioned during stand ups that they realized the issues with the pick paths and would divide up the fracs path so everyone had to work it. This was not true. The same week I worked fracs the entirety of my shifts, all five of them...the full 50 hours.\n\nOur facility is over capacity, and bin presentation is nonexistent. The people who put the items in the bins would rather stand and talk in large groups, and just shove the items in the bins when they do work. This makes it impossible for pickers to pick one item every twenty seconds. Sometimes you find yourself standing in front of the bin with an arm full of items looking for that one thing you need. Sometimes you find the item buried in the bottom, and other times you spend two or three minutes in the bin only to realize the item isn't there.\n\nMy managers had no real advice for me on how to deal with sorting through the bins other than \"know what you're looking for before you get to your next bin, and this will help you manage your time better\".\n\nThat's right! Amazon's solution to finding a needle in a haystack is telling employees to know what a needle looks like, and to ignore the hay.\n\nAmazon is not a company you work for if you're looking for long term job security. You're not a person. You're a machine, and you will be treated like one. If you do not perform to the level they've set for you, then regardless of the reasons or the issues you might be facing, you will be fired. It was my experience that a lot of their employees spend their days looking over their shoulders wondering if this day would be their last, and management would not shy away from constantly reminding their workers of all the ways they could lose their jobs(negative upt, quality dings, low rate).\n\nIt really just put a bad taste in my mouth, because coming from a background in various GM positions, I understand the importance or moral in the workplace. Happy employees equal productive employees. There's no better way to kill a persons desire to strive and work hard than making that individual hate what he does, or by threatening him with his job when he struggles to meet your expectations.\n\n\n\n\n\n",
        "created_utc": 1515702545,
        "upvote_ratio": ""
    },
    {
        "title": "Question the owner of the restaurant asked me",
        "author": "Tlhrock89",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7p064j/question_the_owner_of_the_restaurant_asked_me/",
        "text": "I am an American born in New York State. I am of Pakistani heritage. When the manager(after offering me a job) took me to meet the owner in his office, the owner asked, “are you allowed to work in America?” I was offended but is there anything I can do about this? Any advice or opinions appreciated \n",
        "created_utc": 1515433343,
        "upvote_ratio": ""
    },
    {
        "title": "How to deal with this manipulative lazy ass co-worker",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7oyj02/how_to_deal_with_this_manipulative_lazy_ass/",
        "text": "[deleted]",
        "created_utc": 1515418464,
        "upvote_ratio": ""
    },
    {
        "title": "I now solicit.",
        "author": "palaverhound",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7oug72/i_now_solicit/",
        "text": "Legally mind you; and I must admit that I never thought my life was headed down this road. And I love it. I started as an artist, and have used various side jobs since to fuel what I really want to do with my life, but also to augment in where I’m weak. I was never taught marketing.\nIn a nut shell I sell solar. The company I work for however, is actually really cool, because not only are they non profit from solar installations, ( our money comes from roofs.) but they actually train and work with firefighters to teach them how to do quick switch turn offs. So because of all that I don’t actually mind knocking on doors, and trying to get people to sign up for our program. \n\nI understand and know there is a lot of disdain for door to door salesman. I’ve seen the writings. And I’ve done my best to not only try to avoid doing those things, but to also make the experience enjoyable. I wanna have fun. I don’t want the attitude. Tell me to nicely leave, I will. Hell, I even have the ability to put you on a no soliciting list if you’re really nice.\n\nYou can tell a lot from someone’s personality by how they treat strangers. They’re not always inherent flaws that makes someone mean, sometimes it’s just a couple of small incidents that automatically leave them flustered at the door before you even begin talking. Sometimes it’s all an act anyway. Regardless I’ve reached a level in my social awareness to usually know the difference. Something else invaluable this job has quickly taught me. \n\nThere’s a couple of pretty regular occurrences that happen when I work; and despite the fact that I know I’m being “shrugged” I can’t help but laugh.\n\nNot Answering Doors. \n1. There’s four cars in the driveway, and kids running around inside.\n2. Dog comes to the door barking. If an owner is nearby, the dog will look to the human, who is usually standing to the side of the door.\n3. Move to a different window, and peek through the blinds. It’s usually a window in the front of the house.\n4. Upon knocking turns off all the lights.\n\nThese people make me laugh, because at the very least, if you can’t say something nice, then don’t say it, right? ",
        "created_utc": 1515369337,
        "upvote_ratio": ""
    },
    {
        "title": "Writing a critical email to a previous manager",
        "author": "FortressEvo2070",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7oo2za/writing_a_critical_email_to_a_previous_manager/",
        "text": "I wanted to get folks opinion on this matter, as I may just be angry and irrationally reacting to a situation.\n\nI will try to be brief..  \n\nI worked at a large corporation for a few years, and left because I felt the environment was toxic and did not promote growth.  In fact my manager stifled growth, was incredibly passive aggressive and would shame his employees.  Things hit a boiling point on the team, and I was the third person to quit from my team in 1 month.  After me 2 more left and 2 were fired.  Yesterday one of my former colleagues was fired for seemingly unreasonable reasons.  I do not know the specifics, but when I worked with this former colleague they were competent and someone I could trust.  I am pissed off because I feel like my former manager has no business being in a position where he can fire or hire people.  He is potentially damaging people's careers and is blatantly lying to potential candidates, telling them that this is a job where you will grow and learn.  \n\nWhile I was at the job I spoke up, and I gave a scathing but factual exit interview, nothing ever changed.  Even after the 5th person quit within 5 months, nothing has changed.  After my former colleague was fired yesterday, I started drafting up a letter to send to my former manager, his bosses (director and VP), and his peers (other managers), and HR.  I doubt this will do anything, but I wanted to give my opinion on the matter, backed up by factual events, and refraining from negative language or name calling.  The letter is detailing on why I quit, and why I think everyone else felt the need to leave.  \n\nIt may be too little too late, but it did take some time after I quit to clear my mind and reflect on years I spent at the job.\n\nDoes anyone think this is a waste of time or something worth doing?\n\n",
        "created_utc": 1515294067,
        "upvote_ratio": ""
    },
    {
        "title": "The Clog",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7obfhl/the_clog/",
        "text": "**Repost from r/talesfromyourserver.**\n\n\nI was reading a story on here that reminded me of another one of my diner days when I was a dishwasher at a diner a couple of years ago.\n\n\nIt was a very slow day and I was doing prep work in the back kitchen because we had no customers and there was **nothing** else we could do. Finally, these two gargantuans; (they were huge) a husband and wife come in and order about half the menu. I didn't know two people could eat so much food. They finish eating and the husband goes to the bathroom for an uncomfortable amount of time. He comes out, they pay and leave. All quiet again.\n\n\nThe waitresses had started cleaning the bathrooms and went into the men's room. I was washing lettuce with cold water and chatting with one of my bosses when I heard what could only be described as a squealing pig. I threw the head of lettuce back into the bowl and we both run out to see what on earth the problem was. We got toward the men's room when the smell of sulfur mixed with rotting flesh hit me. The husband had clogged the toilet. The waitresses refused to unclog it. I refused to unclog it. My bosses couldn't do it. Both my bosses look at me and say: \n\n\n\"We will give you the rest of the day off as well as tomorrow with pay if you unclog the toilet.\"\n\n\nAt first, I didn't think they were serious and I kind of chuckled at it. They told me it wasn't a joke and they were serious. So, I grab the ~~hazmat suit~~ plunger and head in.\n\n\nI swear, this dude must've shit boulders. It was hard as a rock. It took me 15 minutes to unclog the toilet because my eyes were watering so much from holding back from vomiting. Eventually, I got it unclogged and flushed the toilet. I was full of sweat. My boss shook my hand, thanked me and told me to go home and take today and tomorrow off. I spent those days showering.\n\n\nThis was when I liked working there. It started declining a few months after, which is a story for another day.  ",
        "created_utc": 1515161551,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know who called you.",
        "author": "easthighwildcatfan1",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7o6h2x/i_dont_know_who_called_you/",
        "text": "I'm a receptionist for a smallish office (like 20-25 of us), and like a lot of businesses, when someone makes an outgoing call, the call is made with our main number and not their extension. A lot of people call back without listening to their voicemail, but most people are reasonable once i talk to them, but not this lady. \n\nMe: Thank you for calling [office]\n this is [my name], how can i help you? \n\nHer: Yea, i just got a call from you.\n\nMe: Okay, do you know who in our office called you, so I can connect you with them?\n\nHer: No, what did you call me about? \n\nMe: I personally didn't call you, but it was probably someone in our office. Do you know if they left you a voicemail? \n\nHer: I don't know, i just saw a missed call so i called you back, now would you just connect me to who called me? I don't even know what your business is. \n\nMe: Okay, well we do blank and blank. Are you going through either of these processes right now? If so I can look up your information in our system to see who is working on your file, and I can see if they or their assistant called you. \n\nHer: Yes. But I don't feel comfortable giving you my information if you're not handling my file, so if you could transfer me to who is that would be great. \n\nMe: I can totally understand you concern of privacy, but I can't actually figure out who called you if I don't have any information about you. I will probably only need your first and last name to look you up in our system. \n\nHer: Fine. My name is Jane Do. \n\nMe: Thank you! Just give me one moment.  \nMe: Okay, it looks like John Smith is working on you file, just give me one moment to see if he is available. \n\nHer: Oh, John, I know him. Just put me through. \n\nMe: *while internally screaming out of frustration* Great, one moment please.\n\n",
        "created_utc": 1515104909,
        "upvote_ratio": ""
    },
    {
        "title": "Did you know sometimes kids lie?",
        "author": "Qwerky_Name_Pun",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7nrrt9/did_you_know_sometimes_kids_lie/",
        "text": "I work at a local laser tag arena that becomes \"adults only\" (16+) at 9PM. We have a fairly large arcade and I was working the ticket counter when they called 9 o'clock, so of course I get a mad rush of kids wanting to redeem their tickets for candy, toys, etc. I probably had around 20 kids berating me all at the same time for what they wanted so I call out \"Who knows what they would like\" so I'm not standing around doing nothing waiting for one kid to decide. \nOne girl, probably around 13, asks if I can check her ticket balance (its all a card based system no physical tickets). It takes about 10 seconds so I say sure and kindly let her know. She then presides to ask me my least favorite question \"What can I get for that?\" I internally sigh as everything is clearly marked and say \"Why don't you look around and I'll come back to you.\" Or at least that's what I and my coworker heard me say.\nI start helping another kid and don't even notice her leave until a large black lady comes over shoving through multiple kids and starts yelling at me. (C: Customer M: Me)\n\nC: Is your job to give kids what they want or to be smart?\nM: Excuse me?\nC: You heard me. You can't be goin around here telling *my* niece stuff like that.\nM: I'm not sure what you're referring to? Did I do something while in the arena? (Everyone just kind of does what needs to be done, tickets, snack bar, and I had just gotten out of a session of tag)\nC: They're not paying you to be smart. Telling my niece to \"Look with her eyes\"\n\nAt this point I see what is happening and being tired and still having a bunch of kids around me I just go with it.\n\nM: I'm sorry, whatever I said was not meant to offend. I'm currently trying to deal with multiple children and am currently under a lot of stress. (I open my arms referring to the throng of kids. \nC: I understand that but you can't come bringing your personal life into work and take it out on customers. I work in the mental hospital. You think I would still have a job if I came in yelling and being smart with my patients?\n\nAt this point I had no clue what to say but I didn't have to as she quickly left in a huff. A little shaken I go back to helping kids around me.\n\nTL/DR: Some kid misheard me and her aunt came back to yell at me about it. ",
        "created_utc": 1514948807,
        "upvote_ratio": ""
    },
    {
        "title": "What's your extension?",
        "author": "Enoch_Root19",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7njx9o/whats_your_extension/",
        "text": "I was working first level IT support for a mining company.  I didnt care for the job. It was a mess and I had no idea what I was doing.  I wasnt a big fan of the guy next to me.  Always telling pointless stories about himself.  Never stopped talking.  I would tune him out while he talked to me, even though we sat literally next to each other.  That sets the stage.\n\nWe spent the whole day on the phone talkng to people in the field.  And even though we had worked together for months, he had never actually called me.  I can't recall why he asked for my number.  But he did.  Without skipping a beat I rattled off extension x9911.  You see where this is going.\n\nWithout thinking he then dials it.  What happens, of course, is that he gets an outside line and then dials 911.  And reaches an emergency operator.  He has some explaining to do but smooths it out.  I laugh hysterically.  ",
        "created_utc": 1514864880,
        "upvote_ratio": ""
    },
    {
        "title": "We don't have cats...",
        "author": "Rynneer",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7mhp49/we_dont_have_cats/",
        "text": "I often volunteer at my local wildlife rehabilitation center, so I've seen some interesting stuff. (Ever had a possum haul her way onto your head? I have. It hurt.) Anyway, this story actually has to do with some people, not animals. I typically work in the lobby, changing our permanent residents' water, cleaning enclosures, feeding, etc. People usually walk in with a box with some sort of critter in it, and I direct them to the front desk where our staff can take a look. So one day, while I'm cleaning, these two ladies walk in. I shall be Me, and the lady who spoke shall be Lady.\n\nMe: Hi, do you need any help?\n\nLady: Yes, we'd like to get a cat.\n\nMe: *blinks* I'm sorry?\n\nLady: We'd like to buy a cat.\n\nMe: ...This is a wildlife rehab center... we don't have cats... Maybe the front desk can tell you where the nearest animal shelter is?\n\nLady: Oh, okay. Never mind. *exit cat ladies*\n\nI have no idea where these ladies got the idea that a *wildlife* rehab center has *domestic* cats... We *rarely* take in domestic animals. I've only seen a kitten actually make it past the desk once.",
        "created_utc": 1514407875,
        "upvote_ratio": ""
    },
    {
        "title": "Christmas Eve morning and the fight that broke out at work.",
        "author": "Sapphira45",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7m62vt/christmas_eve_morning_and_the_fight_that_broke/",
        "text": "I work in the kitchen of the biggest hospital in my area and was scheduled to work all day on Christmas Eve starting at 6am. For the first part of the day from 6am until 2:30 p.m. our supervisor was a young lady named E and on the line was B, C, K and a few other morning employees. This story revolves around E, B, C another girl named F. \n\nF came into work at 7 and had accidentally forgotten her work badge at home. Usually when this happens, the person who forgets their badge lets a supervisor know so they can fill out a sheet for a missed swipe in to make sure they get credit for working that day. F told E about her badge as soon as she was in uniform and on the floor. Theoretically, all E had to do was let F fill out a sheet and no worries, right? Wrong.\n\nE is the kind of supervisor that everyone dreads working with. While she doesn't exhibit abusive behavior the way I've read in other stories, she lacks the social and organizational skills and common sense to effectively manage a team of tray passers and assemblers. She has issues with maintaining personal space. gets emotional and \"touchy feely\", micromanages and makes many poor decisions in general that do more to mess things up than help. When F told E that she didn't have a badge to clock in with or get into certain areas of the hospital to deliver patient trays, E for some reason had a mild freak out about how trays were going to be delivered on time. Other than not being able to get to certain units, it's really not that big of a deal to deliver carts without a badge because there are enough people who can take carts to those other areas if one person isn't able to. Rather than just letting F run trays to the areas that she was able to get to and then have her pack silverware in between carts, F decided to pull B, one of the tray assemblers, off of the line to run carts and stick F on the line to assemble trays. Problem solved, right? Wrong.\n\nF is a very new hire and up until that moment had never worked on the tray assembly line, already causing an issue. In addition to pulling B, one of the fastest and most accurate assemblers off of the line to deliver carts, E also had to pull another girl named A off of her position on the line to \"train\" F for about 20 minutes while still expecting her to do her job. B and C went off on E knowing that this would mess up the flow of things and an all out argument started between B, C and E. I went on a delivery run as things got heated.\n\nNow, I mention that E has problems with understanding or at least respecting personal space. I came back to the kitchen about 15 minutes later to grab the next cart and when I got there, B and E were arguing. Not only had E undoubtedly said something to B that only escalated the situation and made her more angry, B kept telling E to give her space and cool down. E followed B around the kitchen staying no further than two or three feet away from her, trying to touch her on the shoulder and get all close and touchy feely with her. At this time, B was also trying to leave with a cart of trays that were about to be due and B looked like she might haul off and smack E at any second if E didn't get out of her face and let her do her job. Meanwhile, F felt so guilty over the whole situation that she ran into the break room after getting so upset she started crying. I left with the next cart and tried to stay out of the kitchen as much as possible for the rest of the time that E was supervising, which was easy to do because her decision to make things more complicated than they had to be put the kitchen at least a half an hour behind on trays being delivered to patients. E is incompetent, micromanaging, irritating and all of us wonder whose idea it was to make her a supervisor.",
        "created_utc": 1514267497,
        "upvote_ratio": ""
    },
    {
        "title": "asked for the day off due to my grandma passing away, didnt get it and got scheduled more.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7lekgy/asked_for_the_day_off_due_to_my_grandma_passing/",
        "text": "[deleted]",
        "created_utc": 1513911195,
        "upvote_ratio": ""
    },
    {
        "title": "A Busy Saturday",
        "author": "Scarlett_Webb",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7kmp2f/a_busy_saturday/",
        "text": "I worked for a major storage company for 15 years. I have a great many stories, this is one of them.\n\nI managed a medium-sized property, so there was only one person (me) scheduled at a time. I was in charge of lock check, cleaning property and units, cleaning restroom, restocking packing supplies, leasing of new units, answering calls, and debt collection. And yet, somehow, management still wanted us to be in the office available to customers for the entire day.\n\nIt was a pretty Saturday morning, looked to be an easy day, and I was looking forward to my weekend (Sunday/Monday). I had walked the hallways and driven the golf cart for the outside check, so I was ready to start my office work.\n\nA tenant who rented on the back of the property came in and told me that there was mercury spilled along the back driveway. I hadn't seen it when I did my check, so I immediately headed back there to see what was going on.\n\nSure enough, there were beads of mercury all along the center crevice of the driveway (driveways were shallow V's for drainage). I checked and found more mercury at the base of a door, obviously where it came from. (It turned out a tenant had broken a very large, antique thermometer.)\n\nI immediately went back to the office and called my district manager. No answer, left a message. (This was a Saturday, so no real surprise.) Tried again, no answer. Called the regional manager, no answer, left a message. I tried calling a few numbers at corporate, but absolutely no one wanted to answer their phone that day.\n\nPlease keep in mind that this was somewhere around 2011. I had a crappy flip phone, and we did not have internet access in the office. \n\nI did what I thought needed to be done: I called the non-emergency number for the fire department. The next thing I know I have a huge ladder truck pulling in with lights and sirens going, and firefighters in full gear piling into my office. I led the men to the back of the property and showed them the mercury. They called in their HAZMAT team. Now a giant HAZMAT truck comes screaming down the street and onto the property. I am frantically trying to get in touch with my district manager, to no avail. \n\nThe HAZMAT group, with the help of the firefighters, blocks off the back of the property. They told me that I needed to call a company and have them come clean up the mercury. I don't have that kind of authority (and no way to look that type of thing up, no Google). So I kept calling for my DM, my RM, anyone who knew anything. \n\nThe weather was turning stormy, and they told me that it had to be cleaned up before the rain started, or else. Then another vehicle pulled in. Someone had called the EPA.\n\nI am threatened with huge fines if it starts raining and this mercury hasn't been cleaned up yet. I am now calling district managers for other districts, even other cities, trying to find ANYONE who can help me.\n\nI finally got a call from our divisional vice president (one of the messages I left). I explained to him what was going on. He looked up a company on his computer, and was able to give them his personal credit card ($thousands$) to come out right then and clean up the mercury.\n\nIt was 10 minutes until closing as the EPA, the HAZMAT group, and the firefighters finally started trickling away. My office phone rang, and it was my district manager.\n\nHe said: \"You called?\"\n\nI explained what had happened, from beginning to end.\n\nHe said: \"You should have called me first! I would have told you to wash it down the drain.\"",
        "created_utc": 1513618281,
        "upvote_ratio": ""
    },
    {
        "title": "Using the hyper-friendly customer service voice for evil",
        "author": "blindjo",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7j0cms/using_the_hyperfriendly_customer_service_voice/",
        "text": "Without getting into too much detail about my job, i help out the students at my university. Last week, they scheduled me to \"float\" in an area (basically just walk around and direct students, answer questions etc.). The day was going by pretty smoothly until this *one* student came up to me. \n\nFull discloser- i'm partially blind (juvenile MD, about 20/400 acuity) and i use a white cane. I don't \"look blind,\" in the stereotypical stevie wonder-ish way and this confuses a lot of people. Most people dont realize that there's not just sight and complete blindness. \n\nAnyway, this student waltzed up to me with an obvious attitude and just goes \"um, i thought you were supposed to be blind. I just saw you looking at someone,\" probably expecting to \"catch\" me for faking or some stupid bullshit like that. I normally don't mind questions, but this kid sounded kinda dickish\n\nSo what do i do? I muster up my best over-the-top nice customer service voice and proceed to explain to this dude in full detail how retinas work. You could tell that the guy felt awkward but i just kept going in as creepily friendly of a voice as i could. He tried to end the conversation by mentioning that he wears contacts and that his vision is correctable.  I grinned at him and said \"you know, you could go blind at any point in your life!\" And gave him a thumbs up. It was great. \n\nTLDR- someone being rude at your work? Be creepily nice. ",
        "created_utc": 1512972260,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to Interview Retail Managers/Supervisors Re: Diversity Policies",
        "author": "retailmgmtresearch",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7ip2tw/looking_to_interview_retail_managerssupervisors/",
        "text": "***Please note: Salaried and hourly managers/supervisors (store manager, assistant store manager, department manager, shift manager, or other similarly titled supervisory position) are invited to participate and share your experience and insights.***\n\nI am a doctoral candidate looking to interview managers and supervisors currently working at larger chain retail stores (e.g., Target, Walmart, Best Buy, Home Depot, etc.) for my dissertation research on retail management. To be clear, my interest is not in any proprietary or confidential information about your company.\n \nRetail management/supervision has its own specific and often unappreciated challenges. In addition to product- and sales-related responsibilities, managers and supervisors have to deal with interpersonal issues, ensuring workplace cohesion, and diffusing workplace conflicts before they turn into more serious HR issues.\n \nI am interested in hearing from managers and supervisors about how they handle their supervisory responsibilities in the face on an increasingly diverse workforce. Retail managers and supervisors undoubtedly differ in how they understand and handle issues of \"diversity,\" and there are many opinions about diversity's role and value in the workplace.\n\nThere has not been much academic research investigating this important aspect of the role of retail managers and supervisors, and you would be helping to fill a gap in our knowledge about management in general and in retail work in particular.\n \nThe interview would take about 45 minutes, which can be done in person (if you are in the Chicagoland area), via FaceTime/Skype/etc., or over the phone. This is university-approved research, so confidentiality regarding your participation as a research subject is assured.\n \nIf you would like to provide your thoughts and insights, please send me a message. I will send you a research information and informed consent document about the study. Likewise, I can provide you with my university email address, and you can contact me apart from Reddit. Thanks in advance for your help!",
        "created_utc": 1512850404,
        "upvote_ratio": ""
    },
    {
        "title": "Water Damage Restoration Service Flood Cleanup Remediation Repair Boca Chica FL - YouTube",
        "author": "princeboysel0",
        "url": "https://www.youtube.com/watch?v=EXn4BuptPwE&amp;list=PLpM88fEBl4DcSjpAFK5EB7EhuUadeoLMi",
        "text": "",
        "created_utc": 1512689452,
        "upvote_ratio": ""
    },
    {
        "title": "Your name is wrong.",
        "author": "SomeUnregPunk",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7i91fe/your_name_is_wrong/",
        "text": "I'm working at a job that contracts it's employees to other companies to do work. Those companies requires online teaching courses to be done. I got to check up on it every month to make sure I'm up to date. That's not a big deal especially since I can do this at home or on a smart phone at work. The problem is that sometimes things go awry because of ego. \n\nSo my first name is clearly Asian and my last name is found world wide as both first and last names. Do you see where I'm going? I get constant reminders from my bosses to get my training complete when I know it's done. Then I got to deal with the following conversation. \n\n*Boss:* You got to complete your training today or tomorrow.    \nme: It's done.   \n*Boss:* I got the list, you got a lot here that's not done.    \nme: Give me a second, I'll log in and show you.   \n*Boss:* Let me take a picture of that. I'll message those pricks and get this resolved.     \n\nHe messages them with the a picture of his online list and my screen and gets a message back saying my old account is invalid because my login should be firstname.lastname    \n\nHe messages them saying, \"You're wrong. You should have his driver's license and work id on record. Inspect them again.\"   \n\nHe then gets a call from them.    \n\n**X Company tech:** His login should be his firstname.lastname. So he should use the name ZZZ as his first name and AAA as his last name.     \n*Boss:* His last name is ZZZ. His first name is AAA.     \n**X Company tech:** That is not what we have on record.   \n*Boss:* Can you see his driver's license and work id in your record?    \n**X Company tech:** Yes and I'm right.   \n*Boss:* Can you take out your driver's license and compare it to your record and to what I'm trying to tell you?   \n**X Company tech:** Done and I'm still right.   \n*Boss:* What's your name?    \n**X Company tech:** Why?    \n*Boss:* So when I call Josey, I can tell her exactly who is causing me trouble.     \n**X Company tech:** You don't have to do that, I can get her on the line.   \nJosey: Hey Boss, what's the problem?  \n*Boss:* Can you see my employee's driver's license and work id? And can you tell me what you think his last name and first name is?   \nJosey: His last name is ZZZ. His first name is AAA. What's the problem?   \n*Boss:* Your guy has two accounts active for my employee. The one where is login is AAA.ZZZ has all the training complete. But the one where the login is ZZZ.AAA has no training complete. My lists links the wrong account. I need the account AAA.ZZZ.   \nJosey: I thought we fixed this last month.   \n*Boss:* So did I. I would really like to not go through this every month.   \n**X Company tech:** But his first name is ZZZ not AAA.  \nJosey: I'm sorry Boss, I see the problem now. I'll get this fixed. Your guy won't need to redo his training. It may take a few days for your list to update though.   \n*Boss:* Thanks for the help. \n\nI'm betting next month Boss is just going to call Josey first. ",
        "created_utc": 1512675572,
        "upvote_ratio": ""
    },
    {
        "title": "Agen Poker dan Agen Bola spesialis Bandar Bola Terpercaya",
        "author": "dorieupright2",
        "url": "http://www.afb-365.com",
        "text": "",
        "created_utc": 1512202844,
        "upvote_ratio": ""
    },
    {
        "title": "BEST SLAP EVER!!! 😁",
        "author": "venomrider9007",
        "url": "https://youtu.be/Uxbioref-IA",
        "text": "",
        "created_utc": 1512112702,
        "upvote_ratio": ""
    },
    {
        "title": "Knowing when to leave your company.",
        "author": "canadadryistheshit",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7f5zcf/knowing_when_to_leave_your_company/",
        "text": "Hi guys,\n\n\nThis was originally for /r/talesfromtechsupport but I was pulled out of my normal SA/techsupport role to be a QA on a project, so I feel as if it fits on /r/talesfromthejob. Essentially my clients were $CEO and $Customer and I was ensuring the information stated in tickets were clear enough for $developers.\n\nThis is a mix of IT and project management. I hope most of you benefit from this story as it shows you the **wrong** way to run a business and the signs of when to say adios to a company when things are just not right.\n\n\n**Tl;dr at bottom**\n\n\nTerms you need to know:\n**$CEO:** CEO of my company\n\n\n**$Supervisor:** CEO now lives in California, Supervisor is the company's receptionist/accountant. Knows nothing of IT.\n\n\n**Smartsheets** - Excel on crack for project-management but not as good as MSProject.\n\n\n**osTicket** - A helpdesk ticket system but can be utilized for projects for bug reports.\n\n\n**SA** - System Admin: Different for a lot of companies but they are the go to guy in small companies for IT needs\n\n\n**QA** - Quality Assurance: Software testing in terms of an IT world.\n\n\n**Stakeholder** - \"an individual, group, or organization, who may affect, be affected by, or perceive itself to be affected by a decision, activity, or outcome of a project\" -- for a company \n\n\nI've been filling this SA (System Admin) slot at a small company for 3 years now and it has given me a good grasp on not only being an SA but other disciplines of IT. It has been for the most part very educational but I find that this small company is unethical in terms of business operations and $CEO does not treat his employees with much respect.\n\n------------------------------------------------------\n\n**SA/Techsupport Frustration:**\n\nEverything I've taken from the sysadmin subreddit, my education in school and personal research has been finding the best way to deploy IT projects and automate them. However, $CEO has always viewed IT in my opinion as a cost rather an investment. $CEO always wanted me to work around best practices and of course at no cost. Which, can be ok for the most part, just more work on my end to reach the end goals of redundancy and better workflow in terms of IT. The big issue here is $CEO doesn't listen. I have 3 years worth of emails to prove it, it always has to be his way. I'm not saying I'm the master or know better than $CEO. I've just done a ton of research, present it, nope, $CEO says it must be done with $0 dollars. It's incredibly frustrating and not having a Senior SA or anyone else with IT/SA/basic computer knowledge to back me up.\n\n$CEO lacks respect for internal employees as well. Just overall does not treat all of us with politeness and lacks etiquette. \n\n------------------------------------------------------------------------\n\n**Unethical Business Practice:**\n\n$CEO thought it was a good idea to have me jump on a \"project\" to do some QA testing. It's a order/sales software for some welding company. Figured, \"ok this will probably be easy.\" Issues were tracked via Smartsheets. I went through and found that there were minimal explanations to some issues and updated them, replicated them in the program etc... However, some of the problems were fixed already. Also, some of the problems that were labeled as \"fixed\" were not working.\n\n\nI suggested to $Supervisor that we move from Smartsheets to osTicket because the Smartsheet wasn't updated to reflect newest version of the program- It was not accurate and not dependable. So I asked about the process of how these issues get to the developers. \n\n\n$Supervisor explains~\n\n\n**$Customer** and **$companyIworkfor** record issues into smartsheet, attach documents to smartsheet, see if it's enough information for $developers. Why can't the developers just look at it? Come to find out we contracted this job out to **$devcompany** in India and they have their own ticket tracking system. We were just middlemen. Strange, I thought we had our own developers. I asked $Supervisor why we can't hold a meeting with all the stakeholders of the project (devs, us, customer). \n\n\n&gt; **$Supervisor:** \"It's too risky.\"\n\n&gt; At this point I'm going \"wtf....\" and ask why. \n\n&gt; **$Supervisor:** \"they don't know we contracted it out.\" \n\n&gt; I asked who the project-manager is for this project\n\n&gt; **$Supervisor:** \"They quit 2 years ago.\"\n\n&gt; $Me: \"Wtf....\"\n\n\nAlso, this project has been running for 2 years and $CEO already accepted a payment from the $Customer. I pushed and pushed and pushed for osTicket (it's free for fuck sakes) just so it makes it easier on my end to do QA and for everyone to submit issues and $CEO still says no. Other employees including $Supervisor agrees that the process needs to change.\n\n\n&gt; **$Me:** \"I'm not working on this project, I am sorry.\"\n\n&gt; **$Supervisor:** \"That is perfectly ok, we understand.\"\n\n\n**$Supervisor** is a sweetheart and knew this was all new to me. However, I could have filled in the job with the right tools. That's only 50% of the way though. The other 50% that gets to me is how **$companyIworkfor** is hiding this from the customer, took 30 grand from them and the project is just now trying to be rushed to get done. I just smell shady business right there and I would feel awkward working on the project further.\n\n\nIt was kind of shocking and even more awkward telling someone \"no\" for the first time. I follow a strict but informal, \"System Admin's Code of Ethics.\" In my opinion this line was violated by my organization and I would just violate it further by withholding the fact that we are not developing this software from the customer: \n\n\n\n*\"I will lead by example, maintaining a high ethical standard and degree of professionalism in the performance of all my duties. I will support colleagues and co-workers in following this code of ethics.\"* \n\n\n\nSmall business world from what I have seen revolves around trusting partner companies and having really good relationships with your customers. That being said, having a good trust between clients and **$companyIworkfor** is probably one of the most important things. How could I possibly live up to this standard and be a professional when **$CEO** decides to not tell **$CustomerCompany** what is really going on and been upfront from the beginning? How could I possibly learn what the right way is when **$CEO** violates basic business ethics, cuts corners and runs off with 30k in the pocket when the project isn't done yet? Most importantly, I don't want to ruin my reputation in-case if word did happen to get out and here I am listed as a stakeholder and be \"guilty by association.\" I wanted to protect my career in this case. \n\nSo you know what /r/talesfromthejob? Fuck it. I'm leaving this company. **$CEO** never listens to any of the employees, **$CEO** wants his way, **$CEO** pulling shady stuff like this for a quick buck and doesn't care that a project hasn't been finished for two years. I know when I leave this company, they aren't going to hire a new SA. They can't afford it. They also can't afford someone not filling new IT project requests that need my assistance.  So I hope **$CEO** falls hard and fast. **$CEO** has it coming for themselves after disrespect towards employees and **$Customer**.\n\nI am not returning to this company on Monday as I will be returning my keys to the building via envelope and removing my account from the domain. Not giving a two weeks, just a letter with my keyring.\n\n\n**Tl;dr:** **$CEO is a butthole to employees. $CEO withholds from $Customer that $companyIworkfor is not actually developing the software and $devsfromIndia are. Project has ran for 2 years when it's a simple order/sales program, $CEO already accepted $30k payment for job, job still not done. Project manager quit 2 years ago. They were kind of pushing me into a project managing role but me not that kind of orc.**",
        "created_utc": 1511509903,
        "upvote_ratio": ""
    },
    {
        "title": "PSK Creative: Virginia Full Service Storytelling Marketing Agency",
        "author": "raphaelakoerwit",
        "url": "https://pskcreative.com/",
        "text": "",
        "created_utc": 1511497321,
        "upvote_ratio": ""
    },
    {
        "title": "The FCC doesn't want you distracted at work. So they want to limit your internet.",
        "author": "killstructo",
        "url": "https://www.battleforthenet.com/",
        "text": "",
        "created_utc": 1511317636,
        "upvote_ratio": ""
    },
    {
        "title": "\"You make the decisions? I'm leaving\"",
        "author": "jamiegandolf",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7df9te/you_make_the_decisions_im_leaving/",
        "text": "I guess I get to make a second thread in a row on here. This week has been truly hectic here at work and I feel like it's only going to get worse.\n\nEarlier in the week, one of my employees rushed to my office and was banging on my door. He has a strong Spanish accent so it can be difficult to hear him at times.\n\n&gt;There's a strong smell of gas outside on the patio! You need to call the gas company immediately!!!\n\nI rushed out of my office and went to the patio. There was some smell of gas in the air but not as strong as he made it out to be. Nevertheless, this calls for a call to the gas company to report it.\n\nThere's an emergency line to call when you smell gas and they send out a technician fairly quickly. He arrived on the scene shortly after the call and began to perform his tests.\n\nAbout an hour later, he comes back and tells me he's detected a small leak on our end. He doesn't tell us where it is or any specific details, just that it is on our end and we're responsible for fixing it. He gives us 48 hours before they come back and shut off our gas if it's not fixed.\n\nSo I call a couple places and get some guys to hopefully come out before the 48 hours and do an estimate. Only one company agreed to come out and do the estimate.\n\nMeanwhile, the employee who alerted me to the smell, he is sort of the nightwatch and also handy man and he calls one of the close friends of the company who has some experience with stuff like this. The guy comes out and he's into Micky Mousing jobs. If you're unfamiliar with that, that's when someone basically takes duct tape and uses it to fix a leaky pipe or uses a wrench as a weight to keep something from springing upwards. Basically, making temporary repairs and hoping they are permanent. All the while, I had no idea, but he actually charges the company for these repairs even though he is considered a close friend. I had no idea he charged until later.\n\nSo anyway, he and I *were* on pretty good terms for years. We both love pickup trucks, etc. and always have a short conversation when we see each other.\n\nBut he comes and he says he doesn't have his proper gas detecting gear. He lost it somewhere, but he has this one. He holds up a plastic wand that looks like it came from the local discount store. He takes this plastic wand and waves it over various gas pipes around the building. I'm following him and using my iPhone as a flashlight in tight spaces.\n\nHe finishes and says he can't find any leaks anywhere. I tell him that the gas company says they detected a leak somewhere and they are only giving us 48 hours before they shut everything off...so...there has to be a leak somewhere and we have no choice but to fix it. Otherwise, we go without hot water and other essentials.\n\nHe doesn't really give me other options to work with, he's adamant that there is no leak. Alright, that's fine. I'll go with the licensed professionals who are coming out soon.\n\nThey come out and they do their thing. They say they'll come out tomorrow and do the real pressure test and quote me a price for this inspection. It's a bit pricey, but we have no choice at this point so I authorize them to go ahead and do it.\n\nThey come back the next day and the friend from earlier is in the parking lot. I have the check in hand for the estimate and kinda sorta walking towards the guys. The friend gives me decent advice to not pay them until they've done the work they promised us to do. Fair and sound advice that I hadn't thought about.\n\nI meet with the guys and one of the licensed professionals asks me, \"Do you know that guy out there with the truck?\"\n\nI reply\n\n&gt;Yeah, he kinda works for me.\n\n&gt;LP (licensed professional): Oh, okay. I just don't want to step on any toes around here.\n\n&gt;Me: No, you're fine.\n\nSo they do their pressure test on the various valves we have around. Meanwhile, the friend comes around and starts being a bit pushy with the professionals.\n\n&gt;Friend: You guys say there's a leak but I didn't get that from my observation.\n\n&gt;LP: Well, we used these pressure testers and we found some leaks.\n\n&gt;Friend: I don't see why you guys need to do anything, I'm already here.\n\n&gt;LP: Well, you didn't call us out so...\n\nAt this point, I'm getting really uncomfortable being in the middle of this so I tell them I have a lot of work to catch up on. Which wasn't a lie.\n\nLater, the Licensed Professional approaches me and asks me\n\n&gt;LP: So...are you in charge in making this decision or is he or someone else?\n\n&gt;Me: Yeah, I'm the one who makes the final decisions. He's...he's a friend of the company. Sort of like a contractor we work with from time to time.\n\n&gt;LP: Oh, okay, I gotcha. He wants to do some of his own tests, is that okay?\n\n&gt;Me: Yeah, you know what, just for the sake of peace, let him do his tests.\n\n&gt;LP: Alright, will do.\n\nThe friend wanted to do some \"tests\" on the pipes using soapy water. Basically, if you think there's a leak in a pipe, you can take soap and water and put it on the pipe and if there is a leak, bubbles will form on that area that the soap was on, telling you there is a leak somewhere in the pipe. This usually is done with inner tubes of tires on bikes and cars and I've done it myself many times, but never for a gas line. But then again, who am I? I've never done work on gas lines. Meanwhile, the licensed professionals have gauges that they are using on the pipes to determine whether there is a leak in the pipes or not.\n\nThe LP goes to finish up some paperwork so we can get this started and I go back to my office.\n\nAs I'm sitting at my desk, I hear the friend in the hallway yelling\n\n&gt;WHERE'S JAMIE AT? I WANT TO SPEAK WITH HIM.\n\nI go to open my door and he's already grabbing on the knob and twisting it as I'm turning the knob as well. I open it and he gets super close.\n\n&gt;Friend: Hey, this guy (pointing at LP in the background) is saying that you said that *you're* making the decisions around here. Is that true?\n\nI'm admittedly nervous because I'm not really a confrontational person, but I get the courage\n\n&gt;Me: Yeah, I did tell him that.\n\n&gt;Friend: If that's the case, then I'm leaving.\n\n&gt;Me: Oh, okay. That's fine.\n\nHe storms down the hallway in a fit of rage and leaves our building.\n\nI had to apologize to the other guys because he was getting a bit confrontational about everything.\n\nIn the end, I ultimately made the decision I felt was best for the company. I got the utility telling me there's a leak somewhere and I can't argue with them and tell them there isn't. And even if I do, they have the authority to just shut it off because their word overrides mine and they have the experience to prove they know what they're talking about, I don't and neither does the friend. Secondly, I got these guys out here who do this stuff for a living. They are licensed to do this. The friend is not. In addition to that, these guys have the tools necessary for this job while the friend wants to use some cheap tool he got at the local discount store to detect for leaks (not to mention only leaks that are on the outside of walls, not even on the inside of walls) and he wants to use soapy water. And not even all that, but there is a leak somewhere and he is arguing with not only me but two other independent entities who are also saying that there is a leak somewhere. Furthermore, both are saying that the leaks are minor and small so there's validity to what these guys are saying.\n\nThe friend went and complained to *everybody* he could about me. In the end, it seemed most people agreed with him to his face but later told me that I made the right decision. I don't need the validity, but it'll help me sleep better tonight.",
        "created_utc": 1510864385,
        "upvote_ratio": ""
    },
    {
        "title": "It came from your account, not mine",
        "author": "jamiegandolf",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7cozbr/it_came_from_your_account_not_mine/",
        "text": "I walked into the office a little earlier than I normally do. There's a problem with the fax machine and I needed to step in to do some stuff that should have already been in place. So, naturally, I'm a bit tired and still waking up.\n\nI'm about to go to the back part of the building when I'm cornered by one of our employees. My assistant and another employee are there as well. \"Lady\" will be the employee who cornered me, \"Assistant\" will be my assistant, and \"OE\" will be the other employee.\n\nLady takes a step forward to me while taking something from her pocket. She gets close enough to my face that we could kiss without moving and she takes an envelope from her pocket\n\n&gt;Lady: I got something for you.\n\n&gt;Me: Okay, let's see.\n\nIt's one of those smaller envelopes you get from the bank when they let you know that a check has bounced. She opens it up and holds it out but won't let anyone hold it.\n\n&gt;Lady: See there, there's a charge for $750, which is about how much my check is, and $35 for an overdraft fee. That's my paycheck and it bounced from *your* account.\n\n&gt;Me: That can't be. Our account is full of money and there shouldn't be any bounced checks.\n\n&gt;Lady: Well there is and here you go.\n\nShe says as she shows me the envelope again.\n\n&gt;Me: Uh, I think this is something else. This is saying that you have a check that didn't clear that came from your account and they are charging you $35 because of that.\n\nThe other employee and my assistant agree.\n\n&gt;Lady: I get that. This is the check that bounced from your account.\n\n&gt;Me: No. This is a check that YOU made from your account and it did not clear so they are charging you $35.\n\n&gt;Lady: Well I don't know what else it could be except my check from you guys.\n\n&gt;Assistant and OE: This is a check that YOU wrote and it bounced from YOUR account.\n\n&gt;Lady: But I don't write checks.\n\nI do an internal eye roll. My assistant tries to hold the envelope but Lady won't let it go. Finally she does and my assistant takes a closer look at it.\n\n&gt;Assistant: This says that this happened on November 3, but payday isn't until November 10, so this is not your check.\n\n&gt;Lady: Let me see that.\n\nShe stands there, holding the envelope and moving it closer to her face and farther to check it out more closely.\n\n&gt;Lady: Oh! I know what this is.\n\nShe says as she walks away.\n\nEdit: changed \"check\" to \"envelope\" near the end. I was getting confused, myself. It's been a long morning.",
        "created_utc": 1510596736,
        "upvote_ratio": ""
    },
    {
        "title": "Weird anime fan story from a comic book and apperal store manager.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7clj9r/weird_anime_fan_story_from_a_comic_book_and/",
        "text": "[deleted]",
        "created_utc": 1510557664,
        "upvote_ratio": ""
    },
    {
        "title": "You can experiment on any technology you want for the last half of every Friday.",
        "author": "dacracot",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7c43lr/you_can_experiment_on_any_technology_you_want_for/",
        "text": "On the surface, this sounds like a benefit.  \"You mean I can try that new library that does XYZ during work hours?  Wow, thanks boss.\"  But think about it... What is really being said here is... Stick to the program.  Don't experiment and get your work done.  Experimentation is not approved and you are not to spend time on it until it is approved.  Innovation will not be tolerated.",
        "created_utc": 1510348984,
        "upvote_ratio": ""
    },
    {
        "title": "Messing with a cold-call salesperson",
        "author": "Scarlett_Webb",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7c2s2i/messing_with_a_coldcall_salesperson/",
        "text": "I've worked for a small sub-contractor for about five years now. I am the office manager. I do absolutely everything here. And I am THE GATEKEEPER.\n\nA few years ago (before he died) the owner, at age 95, would still come in to work. About all he would do is open the mail, check how his stocks were doing, and then leave for the day.\n\nOne Friday I received a salesperson cold-call, and I so love coming up with ways to mess with them. CC=Her, Me=Me\n\nHer: Is the owner in?\n\nMe: I'm sorry, he's already left for the day. He's usually here between 12:30-1 p.m. But I will warn you, he's completely deaf (true).\n\nHer: Alright. Would it be better if I called back Monday?\n\nMe: Ma'am, I don't think he's going to regain his hearing by Monday...",
        "created_utc": 1510336954,
        "upvote_ratio": ""
    },
    {
        "title": "Rant about my boss.",
        "author": "electraheart_x",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7b665k/rant_about_my_boss/",
        "text": "[removed]",
        "created_utc": 1509985211,
        "upvote_ratio": ""
    },
    {
        "title": "I got fired for doing my job – William Vinci Tran – Medium",
        "author": "willeatalot",
        "url": "https://medium.com/@the_vinci/i-got-fired-for-doing-my-job-ace1dea98c3",
        "text": "",
        "created_utc": 1509755210,
        "upvote_ratio": ""
    },
    {
        "title": "Study of Personality, Emotions, and Work Behaviour",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7act5n/study_of_personality_emotions_and_work_behaviour/",
        "text": "[removed]",
        "created_utc": 1509641376,
        "upvote_ratio": ""
    },
    {
        "title": "Jerking off at work WTF",
        "author": "yodawasevil",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7a4xki/jerking_off_at_work_wtf/",
        "text": "Ok, so maybe this is also a TIL. But I'm sitting there trying to take a dump. Which is bad enough, but hey I think I'm sick. Some times you gotta do what you gotta do.\n\nI hear from the stall next to me, on a phone \"So, are you tired of being Singl-\" ad before the guy obviously cuts it off.\n\nI'm like, ok that's awkward, not really thinking. Then a tiny bit later I hear what is *very obviously* jerking off. We all do it (not at work) so it's a very easy to recognize sound. Then of course the guy moans.\n\nWHAT. THE. FUCK!!! People do this at work?",
        "created_utc": 1509555795,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for the help boss",
        "author": "Papenhausen",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/79qzlf/thanks_for_the_help_boss/",
        "text": "I used to work in a factory that assembles electrical cables and wire fixtures. For anonymity, let’s call it Wirecorpp.The production floor manager was a huge pain and always getting in the way. Theres one instance that’s forever stuck in my mind.\n\nI was given a job that required 1000 flat ribbon cables to be cut. Flat ribbon cables, for those not familiar, are cables were each wire is side by side. Instead of al wrapped up in a round cable, like an extension cord, they are aligned flat next to each other, like something you’d find in a computer. \n\nA special requirement of this cable was that, per customer specifications, we had to peel away two wires from the flat cable we were issued. There was no machine for this, so while the cable cutting machine was cutting the cable, you would have to stop the machine every 10-15 pieces to peel the spare wires back. The manager, very unfamiliar with the process, saw this, yelled at me for doing it that way, and attempted to find a faster way. He ended up tying the end of the spare wires to were the cable spool was. The following conversation occurred. I will be ME, production manager will be PM:\nMe: Sir, that won’t work. The extra wires are gonna get pulled in. I’m gonna have to...\nPM:It’s gonna work. Trust me. Just move back.Its gonna work. I’ve been working here 20 years(hasn’t worked on the production floor for the past ten). Just get back.\n*He starts the machine, works for about three, then sucks up the spare wires, jamming the machine*\nPM: Why did you let that happen? \nMe: Sir, you told me to get away, I did warn you that this would happen.\nPM: You should have stopped the machine! Now I have to go bother the technician! Your costing the company money.*walks away*\n\nThe technician came and I explained what happened. He laughed and said “ Typical PM.”\n\ntl;dr: boss tries to find a faster way for me to do my job. Fucks up the machine. Blames me. Thanks for the help boss.",
        "created_utc": 1509399876,
        "upvote_ratio": ""
    },
    {
        "title": "Overheard at my work today",
        "author": "SpaceOctopus94",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/78rut9/overheard_at_my_work_today/",
        "text": "To set up the location I work at a library on a community college campus. \n\n1. \"No, I do not want a woman helping me. Woman are for breeding purposes only. See? It says so in this book from class.\" \n\n2. \"Hi my dad thinks you're pretty can he get your number?\" Said by a little boy to about 6 women before we had to ask him and his father to leave. They are repeat offenders. \n\n3. A regular crazy person talking loudly to herself \"We come from good people. Dont tell her her mom is in hell.\" \n\n4. \"Do you have a computer lab that is a little less...'ethnically diverse'?\"\n\n5. \"Gurrlll today he said my bootyhole taste like dark chocolate...gurlll.\" \n\n6. \"How many kids do you have? One? Why not more?\" \n",
        "created_utc": 1508976200,
        "upvote_ratio": ""
    },
    {
        "title": "Hearing stuff like this 40 times a day makes being a server a slow painful death each shift",
        "author": "FlipGrizzly",
        "url": "https://youtu.be/H2xKRy-i20I",
        "text": "",
        "created_utc": 1508647920,
        "upvote_ratio": ""
    },
    {
        "title": "Madness at the annual meeting",
        "author": "iamonlyoneman",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/77odms/madness_at_the_annual_meeting/",
        "text": "I'm not sure where to put this tale, but it happened at work for the guy who told me the story (works as a representative for an HOA management company) so here it is.  \n\nAt a certain local Home Owners Association's annual business meeting, in a neighborhood that's upscale with moderately-rich homeowners:\n\n* The roads are privately maintained and need a few million dollars of maintenance\n* Annual dues were $500\n* The HOA Board of Directors proposed a $200 increase to $700/year to save up to pay for the roads\n* The proposed increase was voted down by the membership\n* Directors mention that this requires the dues to go to $100/year because of the way their agreement is written\n* Cheers from the membership\n* Director mentions this will not cover the neighborhood's bills\n* Membership votes to keep $500\n* Someone calls from the floor to remove a board member for proposing the increase to $700\n* The board member is removed by a popular vote\n* Someone else at the meeting realizes this is a thing that can be done, and proposes removing all the board members\n* All the board board members are removed by popular vote\n* There was a motion to adjourn the meeting immediately afterward\n* The meeting was adjourned by popular vote\n\n...\n\nSo now there is no board of directors, which means there is nobody to approve monthly expenditures to get bills paid, and there is still not enough money being set aside to repair the roads.  ",
        "created_utc": 1508527213,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy lady on a quest for answers breaks into my office building",
        "author": "fadcat",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/77mba0/crazy_lady_on_a_quest_for_answers_breaks_into_my/",
        "text": "Disclaimer: I originally posted this in a different sub but it was removed and pointed out to me that this story would be a better fit over here...\n\n---\n\nThis happened a few months ago at my workplace.\n\nI was at my desk, minding my own business, when suddenly the door bell rings. Our receptionist is on a holiday, and my other coworkers are out having a smoke so I assume they forgot their badge. Our main building doors are completely made of glass, so I can see this middle-aged lady, pushing random doorbells (from all the other offices in our building) and my coworkers standing right next to her, talking and smoking &amp; basically ignoring her. I'm a bit confused by this image but I then guessed she must be an employee of one of the other companies in the building. So I open the door and this is what goes down:\n\n&gt; Lady: (angrily) \"Do you live here?!\"\n\n&gt; Me: (???) \"Uh, no, I work here. This is an office building.\"\n\n&gt; Lady: (pointing at my coworkers) \"These people are constantly smoking and throwing their cigarettes in front of my apartment block! I live next door and no one in my building smokes! You need to tell them not to leave their filthy cigarettes on the floor!'\n\nI'm a bit perplexed by this exchange, also because it is such a strange request and she is talking English to me (not an official language in my country) with a heavy British accent and this is a huge building that employs many people so why she deems me the responsible one, no idea. But I just decide to humor her and I address my coworkers standing 2ft away:\n\n&gt; Me: (in our language) \"Hey guys, don't throw your cigarette butts on the floor ok?\"\n\n&gt; Coworker: (laughing) \"But we aren't throwing anything on the floor, this lady just came out of nowhere and started cussing us out and we just stopped responding after a while. She's also clearly drunk.\"\n\n&gt; Lady: \"I don't understand your language, this is rude! You should not throw your cigarette butts on the floor!\"\n\n&gt; Me: \"M'am, they promised they wouldn't throw their cigarette butts on the floor. I don't know who is throwing them in front of your building, maybe you can contact your landlord or building manager or something?\"\n\nIt is at this point that my coworkers have finished their smoke and are coming inside, I simply close the door on her since she doesn't seem to be taking in any of the information I'm giving her and I follow my coworkers inside our office that is on the ground floor. \n\nWe thought that would be the end of it, but 10 minutes later we hear someone knocking on our office door. Some other co-worker who walks by the door opens up and suddenly crazy lady barges into our office, shouting and demanding to speak to our boss. She had simply waited for someone else to enter the building and followed us to our office. But now she is an unauthorised person who broke into an office building where she has no business being, and certainly since the rising prevalence of terrorist attacks in Europe we don't take that shit lightly. So after one of my tall, more scary-looking co-workers calmly asked her to leave twice and she kept resisting \"DON'T TOUCH ME YOU CANNOT TOUCH ME I DEMAND TO SEE YOUR BOSS\") I just took it upon myself to call the police. Eventually my coworker does manage to convince her to \"have a conversation outside\", but as soon as she steps out he simply closes the door behind her and waves her goodbye from behind the glass door. She kept standing there for a while but didn't hang around long enough for the cops to show up. They tell us to call again if she keeps harassing us, but we haven't seen her since.\n\nTL;DR: crazy lady wants someone to hang for discarded cigarette butts, can't find a scapegoat so decides to get drunk and break into an office building",
        "created_utc": 1508508629,
        "upvote_ratio": ""
    },
    {
        "title": "Stepping Down from my Position. (Story)",
        "author": "OhNoThatDude",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/77l6i5/stepping_down_from_my_position_story/",
        "text": "So the reason why I'm stepping down. I'm a Mentor in a Warehouse. The guy that is in \"Charge\" or \"Leads\" the Mentor Program we will call Bob. Bob came up to me, and told me that the other Mentor on my shift is going on vacation for 2 weeks. Thats fine.  Not when I have to also take care of his Mentees. They don't want to have another Mentor to come in to cover for the guy that's going on vacation. So I will have to take care of 20 Mentees for 2 weeks. Thats more than half the Warehouse. \n\nAnother reason: I left early one night when we had absolutely nothing to do. I was asked if I wanted to leave. I said yes, and they let me leave. Bob come up to me the next day tearing me a new one about leaving. I told him that I understand, but other Mentors have left early as well and need to be talked to. He laughed and walked away. Ever since then, if I walk wrong way in the warehouse I get chewed out by him. Other things have happened that I don't want to get into for personal reasons. \n\nFAST FORWARD TO TONIGHT\n\nEarlier tonight I told my Operations Manager that I might be stepping down . I've decided to tell my \"Boss\" (Head of the Mentor Program) that I'm stepping down. Effective Immediately! I'm going to tell him this in about 3 hours. Wish me luck on this...  adventure. I will be nice and respectful. If he tries to pull any shit though, I'm going to call him out on it. Thanks for reading my Story/Rant.",
        "created_utc": 1508494393,
        "upvote_ratio": ""
    },
    {
        "title": "YouTube",
        "author": "armandaffhedeen",
        "url": "http://www.youtube.com/watch?v=UOPp-N58L8k",
        "text": "",
        "created_utc": 1508327782,
        "upvote_ratio": ""
    },
    {
        "title": "Worked in IT for 10 years",
        "author": "abuthemagician",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/76wm7w/worked_in_it_for_10_years/",
        "text": "I worked in the banking industry for 10 years at one place (2004-2014) as a Systems Admin doing everything but database work. For about 6 of those years most of the supervisors and the CEO had worked there since the 60s so it had that old school banking atmosphere with an honest to God top shelf bar in the board room, and a hospitality room (that also included a top shelf bar and old guys who knew how to make real drinks for you) at the company party to get drunk before getting drunk.\n\nAnyway two of my favorite people were the CEO, and a little old lady who was the Member Service Supervisor. \n\nThe little old lady was a hoot. Once a month I would have to go to her office to re-train her on how email worked, and to clear out the 10,000 emails she didn't get to that month. She would make it through maybe 10 a day. And if you were lucky to be one of those 10, you got a hand written Post-It note on your keyboard for your reply.\n\nShe also liked to hit you if you were sarcastic or she thought you were funny. I learned that 75+ year old women can hit really hard.\n\nThe best was the CEO who had been used to having a secretary write his letters and such for years. Here are a few badly formatted stories, we will call him SJO:\n\n1. Since we were located near a hospital we NEVER lost power. Until one day it happened. As my boss and I are frantically shutting down servers (IT is always underfunded for battery backup) he manages to get word to me via another poor soul and he says it's critical. I quickly head to his office where he is sitting in the dark behind his laptop. He proceeds to ask me why the internet was down. I stood dumbfounded for a minute then said the obvious thing \"The power is out.\" He stares at me blankly then says \"But my laptop still works.\" I then had to explain it had a battery in it. From the day he got the laptop to the day he retired, that laptop never left his desk.\n\n2. He loved to page people using the phone system (so much we had to install a paging system when we moved to Shoretel IP phones) and would constantly do so. I was once in the process of programming our new Shoretel system when I get a page. Then another and another. I apologize to the vendor trying to train me and head down to his office. Inside I find half the BOD and him continuously clicking with his mouse. He looks up and says \"Oh it's good you're here. I can't get this webpage to load.\" Then clicks reload a bunch more times. I come around and look and he had bookmarked a page inside his personal investment site and wasn't logged in so it wouldn't load. Took a 20 minute discussion to get him to understand why it didn't work.\n\n3. Was helping a teller with a printer issue when I over heard him asking another teller how to play chess. She replied \"I don't know. Why don't you Google it?\" He mumbled something and headed to his office. Moments later over the intercom he pages me to his office. When I get there he asked me how to \"Google\" something.\n\n4. Another time I get paged and give him a call back. He tells me he doesn't like the way his network cable runs to his laptop and wants me to move it right away. Looking for an excuse not to be at my desk I go down immediately with what I need to fix it. When I show up to his office he has his daughter visiting and tells me I didn't need to rush.\n\nOverall it was really awesome to work there for the first 8 years. Then lots of management changed and the whole vibe changed. I had the best boss and mentor I've ever had the chance to work with, and meet lots of really genuine people while there. I got paid to take apart an electric stapler, dump out (aka take home) previously mentioned top shelf board room bar, unload a very large battery backup with 15 12v30ah batteries off a truck with no lift gate (\"We thought you had a loading dock\") and many more fun and exciting things.",
        "created_utc": 1508219843,
        "upvote_ratio": ""
    },
    {
        "title": "The hazmat incident",
        "author": "uncommonmetalhead",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/76tn3z/the_hazmat_incident/",
        "text": "I once worked in a one story call center for a government agency. The call center was an old Kmart that the government had purchased and remodeled. We had a mail-room. Being a government agency, we received questionable items in the mail from time to time. The anthrax attacks were still fresh on all our minds.\n\nOne day, near the end of the day shift, we received a notice that everyone stay put when 5 0'clock comes. This was not unheard of as we often had to work a bit after the end of the shift to finish our calls. As I go about my business, there is commotion near the front of the building. I turn around, as my desk was facing the opposite end of the building, and see the security guard in a panic. He is frantic, pushing his way past management who, have seen something the rest of us haven't, gathered near the entrance. He shouts, \"EVERYONE GET THE FUCK OUT!\". As soon as he shouts this, people in [hazmat suits](http://i.dailymail.co.uk/i/pix/2016/03/11/22/3219E0D400000578-3488388-image-a-93_1457733865496.jpg) walk into the building.  I end the call I was on and begin to move toward the exit. A row of people in hazmat suits, some carrying weapons, others briefcases, make their way to the back of the call center. Toward the mail-room. My coworkers and I exit the building. Free to go home? Nope. Told to stay put, we cannot leave, go to our cars or go back into the building for any personal affects.\n\nUnbeknownst to us, there was now an invisible perimeter around the building and parking lot. I am not sure what the security guard was thinking, but more than a few of us spied him get into his car. He steps on the gas, heading toward one of the exits, when a pair of unmarked cars appear, blocking his way. He turns the vehicle around and attempts the exit on the opposite side of the parking lot. Same result.\n\nHerded in like cattle awaiting slaughter, told nothing, we stand there for three hours. I don't know the specific name for this operation, but a [decontamination tent](https://www.eugene-or.gov/ImageRepository/Document?documentID=22867) is set up at the front of the building. There is a huge vehicle staged at the entrance. We see the hazmat team go in and out of the building. Some of my co-workers, management and those in the mail room, are escorted into the tent.\n\nWe are eventually told that there was reason to suspect delivery of a questionable powder to our mail-room. There was concern that the contents may have made its way through our ventilation system. It hadn't, thank goodness. The hazmat team was called in from a nearby military base to comb through the building. All in all, would do again, especially to hear the security guard freak out and attempt a daring escape. ",
        "created_utc": 1508188053,
        "upvote_ratio": ""
    },
    {
        "title": "Accused of stealing a teenager's gold chain",
        "author": "adelgirl",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/76oody/accused_of_stealing_a_teenagers_gold_chain/",
        "text": "Over the Summer I worked at an arcade near my house. It's the original location of a small chain. This arcade not only has arcade games, it also has mini golf, go-karts, and laser tag.\n\nOne time I was working, I was scheduled for the late laser tag shift. My duties included scheduling people's games, showing the players the rules, basic maintenance on vests and guns (like changing batteries, making sure the guns could shoot, and writing up vests and leaving them for the actual maintenance),supervising their games, and helping out in the actual arcade when there are no laser tag customers.\n\nThis specific day was incredibly slow, so I was behind the arcade's prize counter trying to help out in any way I could, while still keeping an eye on laser tag for customers. I noticed we needed a couple more stuffed animals and quickly ran into the back room, which is literally right behind to the prize counter, and grabbed a couple. I was in there for less than a minute. As I am coming out of the room someone tells me that some customers walked into one of the doors to laser tag.\n\nThere are two doors that lead to laser tag, one has a sign that says \"Do not enter\" and the other says \"wait for attendant\". I go into the one of the room, no one is there, I then enter the other room where I see a family of about 5, 4 teenagers and 1 mother. I tell them \"hey, I'm sorry but you cannot be in here without an attendant. If you come out with me and can set up a session for you now, but just so you know in the future you cannot enter here without an attendant.\" The woman starts telling me they didn't see anyone, and saw the door and thought someone might be behind the door, the door clearly labeled to not enter. Keep in mind, they had probably waited for less than a minute before entering the door. I looked at her and said, \"there is a sign that says do not enter\". She then tried to argue with me about the sign not being visible (It 100% is, you literally have to look at the sign when opening the door.)\n\nFinally I am able to talk them into leaving the room so I can actually take their tickets. I start their session and nothing much happens. When they leave I start to clean up a little, and hear a knock at the door. I go to the door and see one of the teenagers. He says that he lost his 2 gold chains. I tell him I will go look for them, and for him to wait out there (In hindsight, I should have told him to look with me, so the second part of this story wouldn't happen, but I had not thought about that until a couple hours later). \n\nI turn on the arena lights and look around, but am only able to find one of the chains and a safety pin, which they had used to clip the chains to their pants. I go back out to give them to the kid, by which time the mom was with him. She asks to go look, so I accompany her. We both look around for a little, and in the back of my mind I'm thinking maybe it got stuck somewhere that the arena lights cannot reach, but I can't go grab a flashlight since I cannot leave her there by herself. She keeps asking me where I found the first one, and I keep showing her exactly where it was. She then accuses me of stealing the second one, because they were clipped (with a tiny bent clip) together and the only way they were not found together was if I had taken one of them. \n\nI kept trying to assure her that I did not take it, but she would not listen to her. Finally, I tell her that I can get a missing item report and she can fill it out, and that if we find the item we will call her.\n\nRight after that I go back into laser tag with a flashlight and start walking around. I find it in less than 5 mins, stuck in-between 2 barrels at the opposite end of the arena. I grabbed it and see that the woman is still in the arcade. I walked right up to her, and gave her the gold chain. She was speechless, and felt so bad about accusing me of stealing from her teenage child that she gave me $5.",
        "created_utc": 1508135154,
        "upvote_ratio": ""
    },
    {
        "title": "Using email is hard.",
        "author": "hairlessmonster",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/767727/using_email_is_hard/",
        "text": "I work in a very small office, and had just replied to one our clients emails when my boss walked in. She asked if anything was going on, and I told her I answered the clients question and it was taken care of. This is the conversation that followed.\n\nBoss: Monster, when you responded to @Clients email did you CC me?\n\nMe: I am almost positive I did, let me check. I remember hitting \"reply all\" and you started the email chain.\n\nBoss: Well I don't have it. You really need to include me in ALL emails to clients going forward.\n\nMe: I do include you in all emails, but its certainly possible I made a mistake.\n\nMe: Okay, I just checked and you definitely were included, but it looks like you sent the email from your @forwarded-to-main-account-email and not your @regular-email account so there might be a delay in when you get it because forwarded emails from other accounts dont update right away.. but I can manually do it for you.\n\nBoss: No thats okay, ill just hit refresh \n\nMe: You can try that, but I dont know that it will work. It only updates every so often, but I can do it for you in your email settings if you don't want to wait. \n\nBoss: No thats okay, refresh usually works for me\n\nMe:..........\n\nBoss: (30 seconds later) I dont think it sent properly. My email never works right. Can you resend it?\n\nMe: Sure, sorry about that (forwards email to her main account)\n\nBoss: No problem Monster. It happens. Just make sure in the future to include me on all the emails you send to clients. \n\nMe: ................................................................................. Will do.\n",
        "created_utc": 1507923428,
        "upvote_ratio": ""
    },
    {
        "title": "The depressing decline of my career...",
        "author": "pinky_narph",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/75yp0b/the_depressing_decline_of_my_career/",
        "text": "A chronology...\n\n**2014 Summer**\n\n* Five years the technical team lead for four developers embedded with a dozen users.\n* Sponsor discusses a promotion to lead all technical aspects of the department.\n* *Ranked in 30th percentile.*\n\n**2014 Fall**\n\n* Sponsor's funding collapses (no fault of his own).  Will be zero by year's end.\n* I find half time with another sponsor within our large company to migrate a system single handedly.\n\n**2015 Winter**\n\n* Asked to join a group I'd done work with previously full time and take it.\n* Work was completely misrepresented.  Now doing marketing work rather than technical.\n\n**2015 Summer**\n\n* *Ranked in 40th percentile.*\n* Interview with new sponsor for team lead position with seven developers.\n* Sponsor was previously in my position and still coding.\n\n**2015 Fall**\n\n* Sponsor continuously makes me rewrite code for style (not functionality) issues.\n* Sponsor directs my developers without consulting or telling me.\n\n**2016 Spring**\n\n* Once again, found new sponsor with project matching my skill set.\n* Once again, project was misrepresented and I'm pushing an off the shelf solution to users that don't want it.\n\n**2016 Summer**\n\n* *Ranked in 50th percentile.*\n* Apply for a job within my organization run by my sponsor's peer.  They have a common boss.\n* That common boss tells my sponsor I've applied.\n* My sponsor offers me a choice of two open positions within her sponsorship and pulls my application.\n* I take the least of evil positions as a developer.\n\nI'm in my fifties and seven years from retirement.  I've completely lost my motivation to even do the assignments that I'm given.  My career has been shattered by no fault of my own.  I'm just going through the motions trying to stay out of trouble.\n",
        "created_utc": 1507830637,
        "upvote_ratio": ""
    },
    {
        "title": "Royally lazy and rude coworker",
        "author": "agarc9489",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/75m6c6/royally_lazy_and_rude_coworker/",
        "text": "Hey guys, thanks for taking the time to read. Nothing too crazy, just some venting from something that happened earlier today. \n\nI work at a car dealership as a receptionist. The job isn't too bad, but there are some extremely lazy people who want to get paid to sit around and screw around on their phones all day, just like one finance manager I work with. We will call him Frank. \n\nSo Frank is notorious for never EVER answering his phone, or calling customers back. He's even recently put his extension on \"Do Not Disturb\", which shows his line as busy. If we try to send calls to his extension, it will automatically go to voicemail. Many, many customers call and complain that it's impossible to get ahold of Frank. I take a handful of messages for him every day when I shouldn't have to. \n\nAnyway, this afternoon was extremely busy at work. I'm talking to a customer at my desk, answering some questions she has. I then see Frank calling my extension, but I am in the middle of helping this customer, so I decide to let it go to voicemail. Frank then proceeds to call my extension 3 more times, back to back. I apologize to the customer and decide to pick up the phone because I can't stand to hear it ring any longer. \n\nMe: \"Yes?\"\n\nFrank: \"Uh yeah, what are you doing? I've been trying to call you for a few minutes now!\"\n\nMe: *internally screaming* \"YES. I heard. However, l'm with a customer right now.\" And with that I hang up. \n\nLater on in the day, I heard from another coworker that he was pissed I didn't answer my phone right away. Funny, coming from the jerk who never answers his. Some people. \n",
        "created_utc": 1507689463,
        "upvote_ratio": ""
    },
    {
        "title": "That time I was being too flirty",
        "author": "irememberthepotatoho",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/74xx4t/that_time_i_was_being_too_flirty/",
        "text": "Hello tales from the job.  I work for a storage company and I have some tales built up from almost 9 years of service.  \n\nSorry for formatting I am on mobile. \n\n\nI few years ago I had a customer who my coworker caught  inside with his storage unit with the door down.  \n\nCustomer is “Romeo” (not his real name). \n\nCoworker is CW.  \n\nCW told him very nicely that he cannot be in his unit with the door down and left him alone. \n\nRomeo comes running into the office and starts yelling that my CW is singling him out because he’s racist, and doesn’t respect him. \n\nI calmly repeated what my CW told him he needs to leave his door open when he is here.  \n\nRomeo suddenly points his finger at me and says. “Don’t you flirt with me!  I have a virgin princess! Don’t look at me, and don’t talk to me.”  \n\nI repeated what I said, and he flipped out telling me that he wasn’t interested in me and that I needed to stop... my coworker jumped in and told him to leave the office.  \n\nCW looks at me. “Damn irememberthepotatoho you need to cut out that flirty behavior of yours.” \n\nWe both laugh at that. \n\nA few days pass and Romeos girlfriend walks in and tells me that her boyfriend means well and that I should not worry about what he says.  She said that my CW is racist and wanted to lodge a complaint.  I told her that I will speak with my CW.  She asked for the bathroom key and left. An hour passed by and I needed to get the key back for my other customers.  I knocked on the bathroom door and no answer so I go to their unit and they were both sitting and talking.  \n\nThey said that my cleaning lady took all the soap and toilet paper out of the bathroom and that’s why they couldn’t use it.  I told them that I would fix that, took the bathroom key and inspected the bathroom and found it fully stocked. \n\nRomeo comes running into the office.  “How dare you flirt with me right on front of my princess!”\n\nMe: ??? I just wanted the bathroom key back... \n\nRomeo starts ranting about how I should never approach them like they did something wrong, and that I need to stop my flirtation with him.  \n\nI just stare at him until he leaves. \n\nWe ended up terminating their contract for trespassing after hours, and you know... to stop me from being so dang flirty with him.  ",
        "created_utc": 1507414952,
        "upvote_ratio": ""
    },
    {
        "title": "Please listen to your gardener",
        "author": "smilespeace",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/74wv3z/please_listen_to_your_gardener/",
        "text": "So this happened a couple years ago. At the time, I'm an apprentice gardener with a property mainenance company, doing contract work on a big waterfront townhouse community. Twice weekly my supervisor and I would go there for routine landscape mainenance (yard work, hedge trimming, arbory).\n\nNow for the tale- there is a guy at this waterfront complex who's been bugging us for a couple weeks about pruning a few feet from the top of a magnolia tree thats directly between his patio and the ocean. Every time he asked, my supervisor said the same thing; \"We can't prune this magnolia for you- it's not the kind of tree that will respond well to a heavy pruning.\"\n\nThis guy had obviously been stewing on the unfair hand he had been dealt. He clearly didn't buy anything my supervisor had told him, and he had is heart set on improving his view. So when my supervisor and I arrive for work one day, he comes outside, threatening to do the pruning himself if we don't do it for him.\n\nNow my supervisor has lost patience. He lays it out for this guy: \"I can't prune the magnolia. Heavy pruning will hurt the tree, ruin the shape of the canopy, and quite possibly trigger a vigorous response of new growth. If YOU decide to prune this tree, the property council may decide to bill you for damage.\" The guy just grumbles and walks away without another word.\n\nFast forward to our next visit to the property- whattya know, the magnolia has about 1/3rd chopped right from the top. It's ruined- a beautiful, mature tree suddenly looks like someone flew through it while juggling chainsaws. We notify the propery council, but they do nothing to reprimand this guy. Now for sweet, yet frustrating, karma: fast forward again to the spring of next year, when the magniolias strart sending out new growth. This guys tree has EXPLODED with ugly, flimsy, unhealthy branches, all reaching straight up, back into his view, taller than before! *just like my supervisor had warned*. Justice was served. Yet now, the council has since requested that we remove these long ugly branches every year. So this guy literaly just shot himself in the foot, and the bullet ricochets into my foot.\n\nTLDR; Guy wants us to prune a tree thats in his waterfront view, we tell him pruning will make things worse, he prunes it himself, ruins the tree and ends up with even less of a view. Now I have to trim that tree every year, when it was perfect the way it used to be.",
        "created_utc": 1507403979,
        "upvote_ratio": ""
    },
    {
        "title": "I can hear you in the background...",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/74jhfj/i_can_hear_you_in_the_background/",
        "text": "I work as a tier 2 tech support agent for a large ISP in Canada. I am basically their mentor and I cover 3 centres. For example, the frontline agents have a question they aren't sure of, or there are no supervisors on the floor and a customer is very irate and adamant about a supervisor, they call me. \n\nSo, today, I was taking a call assisting someone that was confused about one of our newer products when I hear this from in the background:\n\n**\"OH MY F###### GOD! I AM SO PI##ED OFF ABOUT HAVING TO WORK ALL THIS F###### OVERTIME!\"**\n\nI quickly and calmly ask the agent who or what was that and was informed this person does this a lot. I sent a lovely email along with a time stamp to that centres' management team along with a timestamp of the call. They listened to it and he was written up right away.\n\nSeriously, you're in a call center with people around you speaking to other representitives and customers. Show some professionalism.\n",
        "created_utc": 1507242472,
        "upvote_ratio": ""
    },
    {
        "title": "Hands on with a maggot pile...",
        "author": "Tensevictory",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/74j9aw/hands_on_with_a_maggot_pile/",
        "text": "First time posting and all that hoopla. Apologies in advance for formatting (I suck at correcting my own writing) This is a long one I guess so strap in!\n\n        Towards the end of summer I had finally landed a part time job at the local zoo that I had been trying to apply for all summer a few years ago. I sign up for janitorial service which pretty much only require previous knowledge of how to use a broom. First day goes swell. I'm positioned for the largest and only indoor restaurant there so it got pretty busy around midday but was thankfully air conditioned. I was extremely worried something would go wrong as I can be quick to panicking. Everything goes fine for a first day though.\n        \n          However, it was the SECOND day that I should've been wary of. About an hour before closing I notice that the trash cans, seven in total, were brimming with garbage. I look over to my coworkers who had been sitting in the corner on their phones pretty much the whole time, not that I usually minded since I enjoyed working alone. \n        \n          I gather some trash bags and manage to lug all seven out back. I'm sure most places do it like this but how our system worked is that the garbage bags all get thrown into these huge grey bins on wheels. Once those were full a cleaner has to drag their poor excuse for wheels across a long gravel road, usually me, through a automatic gate and down to the bottom of a large hill where the dumpsters sat. Pretty standard job and one I did often, especially on the last haul for the day. \n         \n          Normally we use two but as I filled one grey bin up the other was being inspected by a fellow co-worker. He had been assigned to clean that one out and was currently in the middle of planning how to attack it. A manager walks by and sees him having trouble. She also see me unloading trash and calls me over to help with clean it. This would be a pretty easy job under normal circumstances. These weren't normal circumstances however. These bins had somehow accumulated so much trash and food waste that they created a practically water proof barrier at the bottom of these things. This shit was caked on pretty hard and we didn't have many ideas of how to get it off. \n        \n          My coworker's first idea was to use a hose, imminent regret incoming, and had me tip the bin upwards and slip a bag on the bottom hitting the ground. To our initial surprise the garbage peeled off pretty well from the bag. To our more disgusted surprise was that not only was there a layer of food waste beneath the regular trash, there was a teeming swarm of maggots creating yet a third layer underneath. Now normally I don't smell much at all unless it's REALLY powerful but the stench of maggots and food waste  made me implode my facial features in disgust and cause my coworker to barf in some nearby bushes. The food waste proves harder to get off the bottom of the barrel so my fellow worker and I use a broomstick without the head, forever designated as the maggot staff or the shit stick afterwards, and had me scrape the maggots and food waste into the bag while he kept spraying with the hose a good distance away. (Keep in mind the maggot water is splashing onto me from that range and although maggots didn't gross me out it was enough to make me gag)\n         \n          Finally, after what seemed like ages, we manage to scoop up as much of the food waste and maggots into this now living mass of trash in a very wet trash bag. Seemingly the end of the miserable task my coworker goes inside to wash up and get ready to clock out, at this point it was thirty minutes from closing. I pack up the bag with the rest of the garbage bags in the newly cleaned bin and trudge across the gravel road to the gate, all the while leaking maggot water out the bottom. I pass the gate and make my way down the hill and too the dumpsters.\n      \n          To kill time, especially near the end of the day, I like to take my time with throwing out the trash as I enjoyed the peace and quiet. Each bag goes with with a resounding slam and finally I have one bag left. Heavier than the other I realize this is the bag full of food waste and maggots. I give a powerful wind up to the toss without realizing that a hole had formed in the bottom of the bag when we filled it with water. Mid way through the swing the bottom gives out and the maggots go flying everywhere. The splatter looked like something out of an episode of Dexter but made entirely of moldy Hot Dogs, ground up buns and patties, and a god forsaken amount of writhing maggots thrown into the mix. \n      \n          As this was my first job and on top of it my second day I nearly shit myself and immediately go into a panic. I shout, cuss (in a thankfully empty parking lot), throw my shit stick, and slam my hat into the ground. I pace back and forth pondering what to do. I lacked any spare gloves and had tried to scoop up the mess with the bag to no avail. By this time the whole place is closed and I have no idea what to do. I decide against my better wishes to run away like hell and call upon my manager for help. Despite my anxiety over getting punished he was really cool about it but his suggestion was a little less than what I was hoping for. All he said was to get a broom, not a dust pan mind you but I didn't think of it at the time from panicking, and to just clean it up. I doubted it would work but I did as told and surprise surprise brooms are little effective against goo and maggots on dirt. It wasn't until another janitor for the parking lots found me forty five minutes after we close sitting there.\n      \n       They offered to help because they had gloves but couldn't as I got help from the one parking lot at the zoo who hates maggots with a passion. She had to call in ANOTHER guy who had gloves and then together we were able to clean up the maggot shit. I never spoke of it again with my manager but the co worker I helped out appreciated that I didn't call him for help. Needless to say it made for a tiring and climatic end to my second day on the job. Nothin ever came close to that again and I enjoyed my time there.",
        "created_utc": 1507240290,
        "upvote_ratio": ""
    },
    {
        "title": "Today a grown man at work yelled at me for insulting his stuffed animal",
        "author": "HotDonna93",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/73vr2r/today_a_grown_man_at_work_yelled_at_me_for/",
        "text": "Working temporary job as a photographer.  Got it because I was in a ridiculously tight bind and needed a job to not be homeless.  The job is actually super corporate to the point that it's whack.  \n\nToday I was at a school taking portraits when a teacher came in with a stuffed-animal pig wanting to take a picture of his class mascot.  \n\nHe got insulted because I referred to his stuffed animal as an \"it\" and not a him.  He gave me the name as \"Pigassus McBacon\" and I had to take a picture with that name printed into the computer.  I did it with a straight face as not to insult the client, but the photographer with me who was also new was trying her hardest not to burst out laughing during the whole thing because this man got serious about a stuffed animal\n\nEdit:  Here is the very professional picture I took of his stuffed animal https://imgur.com/a/N5C54",
        "created_utc": 1506978546,
        "upvote_ratio": ""
    },
    {
        "title": "Witgoedservice Zoetermeer ☎ 070-7620370 Gecertificeerd en snel!",
        "author": "RosaFillmoreby3",
        "url": "https://www.123wasmachinereparatie.nl/witgoedservice-zoetermeer/",
        "text": "",
        "created_utc": 1506950972,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate greed",
        "author": "Oldlazyfuck",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/72jxrn/corporate_greed/",
        "text": "So the billion dollar corporation I work at is going to charge to use the gym they built into the new warehouse. Funny how they never mentioned that when they were describing all the \"perks\" the warehouse was going to have. Especially with hourly workers raise's cut to help pay for the warehouse. Murica",
        "created_utc": 1506428164,
        "upvote_ratio": ""
    },
    {
        "title": "Stop trying to call me in on my Rest Days!! (Rant)",
        "author": "Trishata96",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/72f8y5/stop_trying_to_call_me_in_on_my_rest_days_rant/",
        "text": "Right, I work Night Shifts (12am to 8:30am) in a Delivery Depot as an Agency Worker and I really really want to strangle my POC (Point of Contact).\n\nThis woman seems to think I am her go to solution if we are a few heads short, as recently I have been waking up in the morning after rest nights to find the several missed calls from her, no voicemails. Annoyingly she seems to call just before shift stars or after shift has started, at which point I am in bed...with my phone on silent and I've usually had alcohol. I think she pesters me mostly because she knows I have a car and can get here pretty quickly. But hasn't said anything about these calls.\n\nAnd now? She's taken the fucking cake. A mere 2 hours after finishing work and starting what is meant to be 2 rest days in a row. I get a text stating I am in work tonight. Confused, I text back stating I am meant to be on rest tonight (I check the rota before I leave cause she has a rep for changing it and forgetting to tell us) and ask did she text me by mistake?\n\nAn hour later I finally get a reply, well 3 repiles.\n\n\"Sorry you are in tonight\"\n\n\"We need you hun.\" &lt;--- Don't fucking try to sweet talk me\n\n\"Rota changed\" &lt;---- AKA. Oh no. You've realised I am trying to get you in on a rest day, let's fuck with the rota, so you have to come in.\n\nThis just pisses me off! It's rare I get 2 rest days in a row and I had made plans to get shit that needs to be done, DONE! This makes me miss my manager at the charity shop I volunteered at, never demanded that I come in, instead would call and politely ask if I could cover so and so. And I'd agree to, since 1) she asked politely 2) wouldn't get miffed if had to turn her down 3) would be properly grateful. POC on the other hand? Demands.\n\nAt least when she was on holiday and had someone covering for her, that guy wouldn't just change it. He'd either text/call you at a reasonable time or approach you during work hours and ask nicely \"Is it possible for you to do this day? So and so can't do that shift/since we're shorthanded.\"\n\nAs such I sent back a text, making it very clear I have commitments to see to that I can not back out of. Most likely gonna get shit when I am next in, but I'm already dusting off the CV, this along with the fact I cannot access my payslips has made me consider finding somewhere else with a more solid rota and with more capable POC",
        "created_utc": 1506371392,
        "upvote_ratio": ""
    },
    {
        "title": "Physical vs fiscal",
        "author": "nuliajuk",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/72el6x/physical_vs_fiscal/",
        "text": "I'm in records management training and the presenter keeps saying physical instead of fiscal. It's highly amusing. I really want to correct him though!",
        "created_utc": 1506365668,
        "upvote_ratio": ""
    },
    {
        "title": "Patient attempted to sexually assault a nurse then was punished with child abuse afterwards.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/724acc/patient_attempted_to_sexually_assault_a_nurse/",
        "text": "[deleted]",
        "created_utc": 1506247864,
        "upvote_ratio": ""
    },
    {
        "title": "I hate Friday afternoons",
        "author": "starggg",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/7217lu/i_hate_friday_afternoons/",
        "text": "I am a social worker and I work at a substance abuse treatment center as an intake person. My job (or part of it, anyway) is basically to assess clients who come in for treatment, determine the most appropriate level of care for them (inpatient, outpatient, etc), and then call their insurance company to get treatment authorized. Fun fact about substance abuse treatment: Even if your insurance company says that you have benefits for treatment, they won't necessarily pay for your treatment unless you \"qualify.\" The purpose of a prior authorization (required by the vast majority of insurances) is so that your treatment center staff can convince the insurance company that you need that level of care right now.\n\nSo moving on. My treatment center only admits clients with insurance on weekdays during business hours, because that's when the vast majority of insurance companies are open. If you admit a client to inpatient and you aren't able to call for prior authorization right then (and get an answer back on the same day as you called), then you run the risk that the insurance company will not authorize and the client will have to be discharged (unless they want to pay out-of-pocket, but that's pretty expensive and most people don't want to do that). So since we aren't able to call for authorization on weekends or after business hours, with most insurance companies being closed, we don't admit to inpatient during those times.\n\nYesterday, Friday, we were pretty swamped in the afternoon and already had two inpatient admissions (assessment, etc) in the works. Then my admissions coordinator calls at 1:50pm and says that she's bringing in another inpatient admission and he'll be there in 20 minutes. Especially on Fridays, we normally don't do admissions after 2pm, because like I said earlier, insurance companies tend to close after 4:30pm and the assessment/admission process takes 2+ hours to complete. So I'm thinking, this guy will be here by 2:10pm and it will hopefully all work out and go smoothly, fingers crossed. And I wait. And wait. And wait. At 2:50pm, my admissions coordinator calls back and says that the admission's car had broken down, but he's on his way now. What. How am supposed to fit a 2+ hour process into less than 1.5 hours? Not to mention that the people at BCBS (this guy's insurance company) tend to leave early on Fridays. \n\nSo the guy gets there as I'm talking on phone with my admissions coordinator (arguing, really). It's like 2:55pm. I warn him that there may be nothing I can do, since it's so late. He says fine. Thank goodness, he's a former client, so we can skip some parts of the assessment (the stuff that won't have changed, like family history of mental health issues/substance abuse, etc.). So I speed through the assessment and call the insurance to get the authorization. The gods are smiling on me and I get a real live case manager on the phone (often I get a voicemail and they have to call me back, which they might not do on a Friday afternoon, since they might have left already). The case manager seems to be wanting to get out of the office too, since it's 3:30pm-ish at this point, so he speeds through his questions and gives me the auth! It's a miracle! The family and client are super relieved when I tell them, and I'm finished with the whole process in less than an hour. A personal record, I think! And that was my Friday afternoon, haha.",
        "created_utc": 1506203737,
        "upvote_ratio": ""
    },
    {
        "title": "Amazon.com: Tactical First Aid Kit for ACTIVE SHOOTER CRISIS, Military Design, SWAT-Tourniquet, Isr",
        "author": "phylysyuenjxv",
        "url": "https://www.amazon.com/SHOOTER-Tactical-Military-Survival-Everything/dp/B06W55X3KL",
        "text": "",
        "created_utc": 1505869769,
        "upvote_ratio": ""
    },
    {
        "title": "Caught between a pushy pregnant lady and my manager",
        "author": "TheMerryMasquerade",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/710ihk/caught_between_a_pushy_pregnant_lady_and_my/",
        "text": "TL:DR at bottom.\n\nThis was back when I was working as a receptionist for a small satellite location of a well-known tax service. It was a *very* small location - one storefront in a strip mall; basically the front desk (where I was) with a row of chairs in front with a table offering coffee/water as the reception area, just behind that a long hallway with a single row of cubicles, leading to a small back break/file room with our only bathroom. This back room wasn't generally a public area, but we allowed customers to use the bathroom on request. My manager, in the first cubicle of the line (directly behind the reception desk) was also the highest qualified person in the office - she was the only one that knew how to handle the rare *really* complicated stuff. \n\nWe had this one client who was about 8 months pregnant and very scatterbrained - she had to keep making new appointments because she kept coming in without all the documents we needed (despite being given a list every single time). Unfortunately, she was apparently also an exceptionally complicated case and could only meet with the manager. The very busy, usually totally-booked-up manager.\n\nEventually this pregnant lady was leaving from maybe her 3rd appointment - a new copy of the list we'd sent her home with every single time (and would remind her about before she came in) in her possession. Protocol would be for me to schedule her a new appointment to come in with her completed documents, but she was clearly in a Mood and refused to make a new appointment, saying she'd call when she decided to come back. I reminded her that the manager would not have an open appointment for the next 2 days and it was best to reserve her time slot now, but the lady was having none of it and stormed out.\n\nLater that same day, pregnant lady storms back in, triumphantly announcing that she has all her paperwork *this* time. I explain that, unfortunately, Manager is all booked up for the rest of the day and tomorrow, but will be happy to schedule an appointment for a time after that. Pregnant lady gets huffy and asks if there is any way she can be squeezed in today (right now). I try to decline again but she won't take \"no\" for an answer, so I paste on my best Customer Service Smile and say I'll check. (Sometimes we would let stubborn people do this - if they ignored multiple warnings, we'd let them wait until they got frustrated and get them to make an appointment on their way out like we offered in the first place.)\n\nI walked around to the first cubicle (my manager's) to find it empty, so I went back to the break/file room to tell my manager the situation, who was pulling some files and told me there was no squeezing Pregnant Lady in but to let her wait if she won't listen. \n\nNow, as I said, the office is very small, so you can see all the way down the hall from reception - it is very clear whether you pop into a cubicle along the way or turn the corner around the back. Pregnant Lady saw me go around back to confirm with my manager and knew where the bathroom was because she'd been there before. After about 5 minutes of waiting, Pregnant Lady asks to use the facilities. She's far enough along that no one in their right mind would deny her bathroom access, so I let her go.\n\nTurns out my manager wasn't just pulling files, but had decided to go on her lunch break. After a few more minutes I realize Pregnant Lady hasn't come back from the bathroom. I head to the back and around the corner to find her badgering Manager, who is trying (very patiently) to explain that there is no way they can have another meeting today. Then Pregnant Lady has the utter gall to say: \"You're not seeing anyone *right now* though!\" This, as my manager is standing by the break room table, lunch spread out in front of her, fork in her hand.\n\nWe eventually got Pregnant Lady to make a new appointment and leave, but my boss did demand an explanation as to why the lady was even allowed into the back in that situation. (She accepted my reasoning, but it was still a terrifying conversation.)\n\n**TL:DR** - Pregnant lady storms out without making a new appointment; returns same day expecting to be seen despite the busy schedule. When refused, asks to use the bathroom (and is allowed because she's so heavily pregnant), really using the opportunity to get access to the break room to harass the manager, who gets angry at me (receptionist) for failing my gate-keeping duties.",
        "created_utc": 1505794022,
        "upvote_ratio": ""
    },
    {
        "title": "RE/MAX Energy Property Management Oklahoma City",
        "author": "vaclavsturteva",
        "url": "http://www.energypmokc.com/",
        "text": "",
        "created_utc": 1505699652,
        "upvote_ratio": ""
    },
    {
        "title": "Annoying coworkers",
        "author": "DellaMbaacha",
        "url": "https://youtu.be/q4x1R_q4ot0",
        "text": "",
        "created_utc": 1505174863,
        "upvote_ratio": ""
    },
    {
        "title": "I'm in the process of going through a potential internal move from London to New York. This is my potential future boss. So the New Yorker stereotypes are true, huh?",
        "author": "[deleted]",
        "url": "https://i.redd.it/4d95cxhqx2kz.png",
        "text": "[deleted]",
        "created_utc": 1504623937,
        "upvote_ratio": ""
    },
    {
        "title": "This is what happens when you follow corporate policy purely because it's there, without applying critical thinking. Or, my boss wants to fire someone over a bottle of Windex.",
        "author": "Fleegle2212",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6xmmt2/this_is_what_happens_when_you_follow_corporate/",
        "text": "So a few months ago, I needed some quick cash for Reasons, so I got a night job as a janitor.  It's easy work, the pay's good, and it doesn't conflict with my day job.\n\nMy new employer has a dumb rule.  Employees are not allowed to buy any supplies, tools, or equipment, for ANY reason.  Every single purchase of literally everything has to go through the corporation's purchasing department.  Doesn't matter whether it's a $xx,xxx server or a $4 bottle of Windex, you have to requisition it, and they order it.\n\nActually I lied.  YOU don't requisition it.  You have to report to your manager that you need something, and the manager has to requisition it.  I asked why all the red tape and got some BS answer about liability.  I've long since learned not to question authority if I get paid the same either way.  So I went about my business.\n\nTalking of Windex, I used up all the Windex after a few weeks.  So I asked my manager for more.\n\nThe next week, it hadn't come in.  So I reminded him about it.  He said he forgot to fill out the requisition, but he'd do it as soon as he could.\n\nThe week after, still no Windex.  I reminded him again.  I got a lecture about how he's a busy man and he doesn't have time to just drop everything and requisition a $4 bottle of window cleaner.  I offered to go to the store and buy it myself, because fuck, it's just $4.\n\nHe looks me dead in the eye and asks if I'm trying to get fired.\n\nI ALMOST got into an argument with him about how ridiculous it is that he won't order it and won't let me buy it even if I pay for it myself AND I can't do my job without it but I still get paid, but then I remember that I still get paid.  So I say something like, \"No sir, I'm sure we can wait a little longer.\"\n\nAnd everything is fine for a bit, but eventually the mirrors and windows start to get dirty, and people started complaining that I suck at cleaning windows.  I tried to clean them with regular water, but that didn't really improve things.\n\nSo I got an idea.\n\nAn awful idea.\n\nI had a wonderful awful idea.\n\nI went to the store and bought a bottle of Windex, I put it in the lunch box I bring every night, and I oh so casually walked in to work that night.\n\nAnd after a couple of hours, all the glass in the facility had never been so clean.\n\nBut I had to make it look like I hadn't directly disobeyed company policy AND my boss, so when I ran into my boss later, I said, \"hey, thanks for ordering the Windex.  I appreciate it.\"\n\nHis reaction was along the lines of what I would expect if I'd said, \"hey, thanks for ordering the hardcore porn magazines for me to read instead of doing my job.  I appreciate it.\"  But my plan worked.  It wasn't me he was angry with.  It was whoever had the audacity to bring a bottle of Windex into the facility.  He demanded to know who it was.\n\n\"Geez, I got no idea,\" I said, sounding confused.  \"I thought it was you.  But I guess it could have been anyone.  People have been complaining that I haven't been keeping the windows clean. \"\n\nAnd my boss decided to make it his mission to find out who.\n\nWhen I left, he was in the security office with two other managers reviewing security tapes to try to figure out how the Windex got into the facility.  Suddenly not only he but two other managers plus a security officer have the time to just drop everything for a $4 bottle of window cleaner.  I decided not to point out that irony.\n\nThey haven't taken my Windex away though.  I declare the plan a success.",
        "created_utc": 1504365914,
        "upvote_ratio": ""
    },
    {
        "title": "ow a small action can change the whole company's spirit II",
        "author": "talesofnyanko",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6xe9wh/ow_a_small_action_can_change_the_whole_companys/",
        "text": "Let me tell you a story about our lovely coworker in our warehouse. He got hired as a substitute for the team leader. But he didn't get the official title. Otherwise they would have to pay him more. \nSo over the next few years he did such a great job, all workers in the warehouse did like him more. He was much more friendly always had an open ear. And he didn't get mad or offended when it was a little bit hectic. It went that far, that even our ceo went to him directly if something needed to be done. \nSo after half a year he went to our HR department and asked for a promotion or even the team leader’s job. Because he did the job already better than the real team leader. And heck he did a lot more and better work. So HR Department did also see this. But they still said no, the will not downgrade the other guy and they don't have any other job titles to give him. (Remark: we have a co-team leader position for a good friend of hers)\nHe told them, alright but he would also like them to know; that he would love to further education himself to help the company grow. And they should reconsider this. \nSo a week later, they had a meeting again, they also talked to the team leader, that he has to improve himself but they don't take the position from him. \nTo our coworker, they told him the same again. Also if he wants to further educate himself he can do that but he would have to share his knowledge at a different company. He should do less and if other people went directly to him with a problem he should ignore them and direct them to the team leader.\nBut they will give him a raise. He can tell how much he wants. So he told them; not much, 100 more? (Remark: for our country that’s not much, and we are all underpaid in our company)\nOur HR was; huuu a 100, yeah we can't do that. You get 50 more. \nAnd that was the end of all this. \nI don't know if he is searching for a different job. I just know, that he told me, that it's hard to find something, also because he can't write all his experience in his CV. On paper he is just a regular warehouse employee.\n\nTune in next time for the story of my friend who had to cancel his Wedding photoshoot. Because or CEO forgot to register his holiday…..\n",
        "created_utc": 1504269896,
        "upvote_ratio": ""
    },
    {
        "title": "45 minutes of explaining.",
        "author": "Burn2theGround",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6vk32x/45_minutes_of_explaining/",
        "text": "This happened a few years ago so I'm a little sketchy on the details.\n\nI work as a gardener, me and my co-worker generally work for old ladies and the like, people who can't take care of their own gardens anymore.\n\nOne day we arrived at *Old Mans* house, normally the first thing we do is check to see if anything special needs doing before we start our usual routine. This is where the speech began.\n\n* It started with how my Co-worker (who lives less than a mile away from this guy) has more sand in the soil around his house.\n* This leads to an extended section about land ownership, about how the guy who used to own the field behind my co-workers place, didn't actually own it because of Mineral rights or something. (Someone else owns the field now, so it didn't really matter anyway)\n* After learning about the ownership of the field, we were reminded of how it was hit by a bomb in WW2 (I've seen the crater, it's cool)\n* Then we were back to the soil quality again, and most importantly, the point of this exchange.\n\nHe wanted us to dig a deeper trench to plant his beans in, the one we dug the week before was too shallow apparently.\n\nWhy couldn't you just tell us that?",
        "created_utc": 1503505386,
        "upvote_ratio": ""
    },
    {
        "title": "Is this a legit insubordination case?",
        "author": "ckingadv",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/6vh68y/is_this_a_legit_insubordination_case/",
        "text": "An employee within our team was supposed to go on leave yesterday and there was a task that he needed to accomplish on the same day. He informed us a week prior asking for someone to cover for him. I talked to him personally and asked what was needed to be done. I already know since I was the one who taught him how to do it but just making sure if there are things that he wanted done that I didn't know of. We agreed on me taking over for him. It turned out that he didn't need his leave anymore and he was going to report to work. When our manager sent me a text reminding us to go there and attend to the task, I replied that I shouldn't go anymore since the employee would be there. The task was going to be done on a different site and the intent of my refusal to go there is to save time, effort, and money because after that I am still expected to go back to my original site. I told him that everything that needs to be done is something the employee has successfully accomplished before. I also asked the employee if he is confident to still do it on his own and if he needed me there, he answered that he's ok and can manage alone. The manager insisted that I still go there for support and when I asked him what support specifically, he told me that I should know. I did not go as I told him in my messages because I couldn't see the point of me going there just to watch over the other employee and when he saw me in the office, he told me that it's insubordination. My intent was to save resource (I have a lot of paperwork that is needed to be looked after in my site) and not to plainly refuse the manager's instruction. Had I gone there, I would've spent more money going to and from different sites while sacrificing hours that could have been spent doing my main work. Your thoughts?",
        "created_utc": 1503469841,
        "upvote_ratio": ""
    },
    {
        "title": "al3ab - Best Online G9games - G9g Flash Games",
        "author": "maryjanegierlac",
        "url": "https://www.g9games.com/al3ab/",
        "text": "",
        "created_utc": 1503381075,
        "upvote_ratio": ""
    },
    {
        "title": "garden hose",
        "author": "rebeckasachsegz",
        "url": "https://www.amazon.com/50ft-Expandable-Garden-Hose-Expanding/dp/B07358GL2S",
        "text": "",
        "created_utc": 1503213727,
        "upvote_ratio": ""
    }
]