[
    {
        "title": "\"I may be a child molester...I'm a lawyer\"",
        "author": "BlickNation",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ph5td/i_may_be_a_child_molesterim_a_lawyer/",
        "text": "So, I work at a call center for a large university hospital system. My team of 12 handles calls for primary care, dermatology, ENT, and a weight loss program. I had called this patient because he was being referred for weight loss by another clinic. Patient is P and I'm Me.\n\nMe: Hello, may I speak with P?\n\nP: Yes, this is he, who am I speaking with?\n\nMe: My name is blicknation, I'm calling from the Weight Loss clinic; we were calling because we had received a referral from Dr. X's office to have you seen here in our clinic. Do you have time to set up an appointment?\n\nP: Sure! What do you have? \n\n(verification ensues)\n\nMe: Ok, so I see that our first available appointment is going to be October, 2-\n\nP: October?!?! GOOOOD-DAAAMN. I'm dying out here! What do they expect? For me to die out here in the streets? Jes-\n\nMe: Sir, if we make an appointment, I will be more than happy to place you on a wait list and we can work you in sooner with any cancellations that become available.\n\nP: (immediately brought back down to a calmer level) Yeah, ok, that  will be fine. \n\nMe: Ok sir, so I have you set with Dr. WeightLoss for October 23rd, and we have you on our wait list so that if any cancellations come up, we'll be sure to give you a call. \n\nP: Ok, and what was your name again? \n\nMe: Blicknation\n\nP: Ok, and can I have your last name and badge number?\n\nMe: Haha, well, I don't have a badge number, and I only feel comfortable giving you the initial of my last name.\n\nP: Oh yeah, I know, I may be a child molester and would be stalking you.\n\nMe: *really creeped out* Heh, well, I'm an adult, so I don't know if that would really apply.\n\nP: Oh, well, I'm a lawyer, so I molest adults too.\n\nMe: Oh yeah, but only for money, right? \n\nAnd we wrap up the call with everything being alright, but that was easily one of the strangest calls I've had. I get some angry, unreasonable people from time to time, but this was something entirely different. Since finding this sub, I promised my gf I would stop boring her with my stories of crazy callers and just share them here. \n",
        "created_utc": 1500999068,
        "upvote_ratio": ""
    },
    {
        "title": "Snake ruins sale.",
        "author": "jarvis52",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6pgx42/snake_ruins_sale/",
        "text": "First, I worked as a \"contractor\" for this cable company. We supplied incoming call center support for the company. I have many many stories, so please tell me if I shall continue.\n\nMe: Thank you for calling POS Cable Company, this is Jarvis52 how many I help you?\n\nCust: Yes, hi. I um..I need help with my internet and phone services.\n\nMe: I'd be happy to assist you with your. (Customer cuts me off)\n\nCust: yeah, well I'm in a hurry. If there's a snake coming out of my phone outlet how can I get rid of it?\n\nMe: umm, sir..how did? \n\nWife of Cust in background: JUST CUT HIS HEAD OFF\n\nCust: but I don't want to hit the phone, it took me 45mins to get through\n\nWife: DO IT! CUT HIS HEAD!\n\nCust: (Audible Slam bang..dead silence)\n\n-I checked the account later, he called back to pay his bill and upgrade his internet and phone service for international calling. Lost out on a good sale because of a snake.",
        "created_utc": 1500997001,
        "upvote_ratio": ""
    },
    {
        "title": "I need roadside assistance. Where is the car? None of your business!",
        "author": "thehated1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6pe9cs/i_need_roadside_assistance_where_is_the_car_none/",
        "text": "Sorry if my formatting sucks, mobile.\n\nI work at a call center for roadside assistance of a certain insurance company. The other day my colleague had this call:. \n\n\nPatient Colleague(PE): Name insurance, roadside assistance my name is colleague how may I help?  \n\nInsane lady(IL): yeah I need a tow truck. \n\nThey go through verification, licence plate, etc.  \n\nPE: Okay, where is the vehicle right now? \n\nIL: I don't have to tell you that! Just send the tow!  \n\nPE: Where do we send the tow truck to. \n\nIL(screams): why do you need to know that, last time was the same s**t you people with your questions, I do not have to tell you that just send the tow truck now!  \n\nPE: Ma'am how do I know where to send the tow truck if you don't tell me where the car is?  \n\nIL:(still screaming) I'm going to report you. I'm not going to tell you that. Send the tow truck now.  \n\n\nThis went on for a while until the woman was so irate she hanged up on my colleague.\nI have no idea how she thought we could send help not knowing where to.\nIt's like if I ask a friend to pick me up and refuse to tell them from where.",
        "created_utc": 1500962129,
        "upvote_ratio": ""
    },
    {
        "title": "Nothing personal, just my instruction",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6pe221/nothing_personal_just_my_instruction/",
        "text": "Scheduling isn't always as easy as \"I want the next appointment with Dr. Whatshisface.\" I have rules I have to abide by. The clinic can choose to make exceptions but I cannot. One such rule is that I can't appoint a new patient with a doctor that isn't taking new patients. Sometimes doctors will mark exceptions (sometimes the provider will only take new patients in a certain age range or they'll only take patients who have a family member they already see) but if no exceptions are marked, I can't make that call. Only the clinic can. \n\nMe: Thank you for calling the medical center, how can so help you? \n\nPatient's mother: Yeah I need you to tell Dr. ABC that I dropped off some paperwork for my two kids for her to sign. The front desk lady and I had words and I don't trust her to tell Dr. ABC about the paperwork. \n\nMe: Sure, I'll send a message. Can I get their first and last names and dates of birth?\n\nPM: [verifies info for both charts]. I also need to schedule my grandson for a well child check to see Dr. ABC too. [verifies his chart]\n\nMe: I'd be happy to look into that. It looks like he just had a well child appointment with her today?\n\nPM: we scheduled one but forgot until after I took the paperwork in and the front desk lady told me afterwards. \n\nMe: Unfortunately because he's a new patient and Dr. ABC isn't taking new patients now, I'm not able to get him an appointment with her. I do have other providers I can schedule him with though. \n\nPM: No! Is this because of the argument the front desk lady and I had this morning? We already talked to Dr. ABC and she said she'd take him on as a patient! Y'all are being racist! \n\nMe: Ma'am I'm not at the clinic and I have no idea what happened between you and the front desk. I have to go by my scheduling instructions though and from my instructions, she's not accepting new patients unless they're newborns. Your grandchild is 4 so I can't schedule him to see her. If you'd like, I'll send a message to the clinic though and have them call you back to schedule with her if that is the case.\n\nPM: Y'all are so racist! You're not understanding me. Get me an appointment with Dr. ABC right now!\n\nMe: I'm sorry ma'am but that's not my call. I believe you that Dr. ABC said she'd make an exception to see him but I don't have the permission to schedule this appointment right now. I can only follow the instructions I've been given. \n\nPM: Do your instructions tell you to be racist too? I bet the front desk lady told you to do this. \n\nMe: It has nothing to do with race or the front desk lady. As I said, I'm not at the clinic and have no idea what happened at the clinic. All I can do is send a message and have them give you a call back. \n\nPM: fine but y'all still racist. \n\n*click*",
        "created_utc": 1500959266,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, let me cancel your adult son's policy without his conscent.",
        "author": "fancytrashpanda",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6pdg58/sure_let_me_cancel_your_adult_sons_policy_without/",
        "text": "Me : Thank you for calling health insurance company, my name is fancytrashpanda, how can I help you?\n\nCrazy lady: I need to cancel my son's policy.\n\nAccording to the member info, I can see that her son is in his 40s. Company policy is that only the subscriber of the plan can request cancellation unless specific legal documents are on file. We do not have those documents on file.\n\nMe: I will be happy to assist with that, but I will have to speak to your son to get consent to cancel. Is he available?\n\nCL: He can't talk right now. He just had surgery and he's on too much medicine to talk. I don't see why it matters anyways, I pay the premiums and i want to cancel.\n\nMe: Unfortunately I can't cancel the plan without the subscriber's consent. He can call back and talk to us when he's able or you can send in a letter signed by him requesting cancellation.\n\nCL: That's not good enough. I want this canceled today.\n\nMe: If he's able to verify his information and tell me that he would like to cancel his coverage, then I can process cancellation today, otherwise, I'm not allowed to cancel the plan.\n\nCL: Hold on a second. (To someone else: Here, it's the insurance company, tell her you want to cancel your plan.)\n\nMan: I want to cancel my plan. ( his speech was extremely slurred).\n\nMe: Ok sir, I just need you to confirm three pieces of information. May I have your name?\n\nMan: gives name\n\nMe: And what is your date of birth?\n\nMan: gives date of birth without year.\n\nMe: I'm so sorry sir, but I need your full date of birth, month, day, and year.\n\nMan: gives date of birth\n\nMe: Ok. And may I have your member ID number?\n\nMan: I don't know.\n\nMe: What about your social security number?\n\nMan:  12\n\nMe: Ok sir, may I speak with your mother again?\n\nCL: Can you cancel now? \n\nMe: No ma'am, he wasn't able to verify the three pieces of information needed to verify his identity.\n\nCL: But I verified it and he said to cancel. This is stupid. I don't see why you just can't cancel the plan.\n\nMe: I'm sorry, but there is nothing more I can do for you at the moment.\n\nCL: IF YOU DON'T CANCEL THE PLAN RIGHT NOW I'M GONNA REPORT YOU FOR BEING UNCOOPERATIVE.\n\nMe: If you would like to speak to my supervisor, I'll be happy to get her, but as I said before, there is nothing else I can do with out your son verifying his identity and giving consent. \n\nAt this point she hung up on me. I couldn't figure out why she wanted to cancel his insurance when he'd just had surgery. ",
        "created_utc": 1500951566,
        "upvote_ratio": ""
    },
    {
        "title": "I am not an elections person, you are refusing to help me so I'm going to hang up",
        "author": "hunter15991",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6p3vjh/i_am_not_an_elections_person_you_are_refusing_to/",
        "text": "Was browsing a different talesfrom subreddit when it occurred I should share a few of my stories. I worked a few months in an outgoing call center during the 2016 elections and racked up several interesting stories. This one took place about three weeks before Election Day - and yes, I was surprised as well as to how well it fit the \"I am not a computer person\" meme, except outbound.\n\nThe state party (Dem.) had consolidated all campaigns under one banner, so instead of only asking if the candidate was voting for Clinton or Trump, we also mentioned that there were smaller races with party-endorsed candidates. If the caller was interested enough, we were to guide them through the local aspects of their ballot (city council, water board, community college board of directors, etc.), and our dialing system would help us out by showing the districts said voter was a member of.\n\nThis call (which I remember posting to Reddit in the fall, but can't find it now) started off relatively normal. Voter was a clear support for presidential/Senate. Offered to walk her through the local ballot. For her the local ballot was relatively simple - state legislators (who had their parties already listed) and the Water Board (officially the Central Arizona Water Conservation District Board) - an elected panel that managed water usage, Colorado River sustainability, etc. for middle and southern Arizona.\n\n_____________________________________________________________________________\n\nMe: Alright m'am, your local ballot seems relatively simple, just legislators - they've got their party next to them already - and the Water Board. Do you have something to write with next to you, so that you can write down the names of the three Democrats on the ballot?\n\nVoter: Oh yes, sure, got the sticky. Water Board? Never heard of that.\n\nMe: Yeah, given the climate here we've got an elected council to help manage water supplies in case of drought. It's labeled CAWCD on your ballot, next to (other position). The Party is trying to get three candidates onto the board. Are you ready to take down their names?\n\nVoter: Sure thing.\n\nMe: First one is Alexandra Arboleda - that's A-R-B-O-L-E-D-A.\n\nVoter: Alexandra Arboleda, got it.\n\nMe: Next one is going to be Jim Holway - that's H-O-L...\n\nVoter (interrupting): Now, are these the candidates that are talking about \"dark money\" legislation?\n\nMe: No m'am, that's the Corporation Commission, which is at the top of your ballot. Do you want me to talk about them instead?\n\n(Our state has a [Corporation Commission](https://en.wikipedia.org/wiki/Arizona_Corporation_Commission), which is a kind of statewide regulatory body. The Democratic candidates for that commission had recently been pushing campaign finance reform policy - anti \"dark money\" - in newspaper op-eds, interviews, etc.)\n\nThe call rapidly deteriorated from here.\n\nVoter: I just moved from Ohio and I'm so confused about all these news positions! I want some help knowing who the Democrats will run for them!\n\nMe: Sure thing m'am, do you want to talk about the people fighting dark money, or the people managing water?\n\nVoter: I ALREADY TOLD YOU THAT I DON'T UNDERSTAND THE ELECTIONS HERE. YOU'RE NOT HELPING ME AND ARE BEING VERY RUDE, SO I AM GOING TO HANG UP NOW. BYE!\n\nTrue to her word, she hung up. I was stunned at how fast things went south, and so was my boss (when I filled him in on the other half of the call). She was from another town, so I did not get the pleasure of canvassing her (door knocking).\n\nHave more stories if anyone's interested. Also did some calls into Louisiana (their Senate election was in December), and that was even weirder.",
        "created_utc": 1500844009,
        "upvote_ratio": ""
    },
    {
        "title": "Yeah I'm sure you know all about HIPAA",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6oxut9/yeah_im_sure_you_know_all_about_hipaa/",
        "text": "I work for a medical center so I'm obligated to follow HIPAA. For the sake of brevity, I'm going to assume that most people know that the basics of HIPAA require me to verify that the patient I'm speaking to is who I'm speaking to by verifying information. My contact center's policy is name and date of birth at minimum. \n\nMe: Thank you for called by the medical center. How can I help you?\n\nPatient: Yeah I have a sleep study coming up and I have some questions about what to bring. \n\nMe: I'd be happy to help. First let me get your first and last name. \n\nPatient: I have my medical record number. It's 1234567\n\nMe: Thank you. Can I get your first and last name and date of birth?\n\nPatient: I don't appreciate having to verify myself! You have all the information you need. \n\nMe: I'm sorry sir but I do need to be able to verify you to see your chart so yes I will need that information from you. \n\nPatient: You don't need that! I just want to ask questions!\n\nMe: Sir, by federal law I will need to verify you before I can patch you through to the clinic. \n\nPatient: What federal law?\n\nMe: HIPAA. \n\nPatient: I know more about HIPAA then you and I say you don't! \n\nMe: Sir I'm not going to argue. I can't access your chart without the information I asked for. \n\nPatient: Get me your supervisor now! \n\n(A short while later)\n\nMe: Hey sup, I've got a fun one for you. Guy doesn't want to verify HIPAA and wants a sup. He only gave me his medical record number. \n\nSupervisor: Really? -.- what's the number?\n\nMe: 1234567\n\nSupervisor: Oh good lord, this guy again? Send him over. \n",
        "created_utc": 1500762460,
        "upvote_ratio": ""
    },
    {
        "title": "The Robot Game",
        "author": "NCHippy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6owgbl/the_robot_game/",
        "text": "[removed]",
        "created_utc": 1500746991,
        "upvote_ratio": ""
    },
    {
        "title": "Always check the call display",
        "author": "Urashk",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6oo789/always_check_the_call_display/",
        "text": "First call of the day. First call for the centre. 7:01AM EST.\n\nQuick background: I work for Canadian telecommunications giant (\"Blue\") as a L2 tech agent. Roaming customers come through to my queue directly, as do customers with data-only cellular devices. Customers with cell phones have to filter through Care/Tech/L1.\n\nCast:\n\n\n$Me: your plucky protagonist\n\n$BM: Mr Roaming Business Man\n\n\n&lt;BEEP&gt;\n\n\n&gt; $Me: &lt;Generic opening spiel, including the words \"TECHNICAL SUPPORT\"&gt;\n\n&gt; $BM: Hey. I just spent 5 days in Japan, and I got billed for the roaming service I specifically requested, and signed up for.\n\n&lt;Insert standard cellular account verification procedure. You know the one. Sigh.&gt;\n\n&gt; $Me: So you have questions about what your package provides you?\n\n&gt; $BM: No. \n\nO_o\n\n&gt; $BM: I didn't use my phone, I'm not using my phone, and I don't want to be billed for these daily packages.\n\n&gt; $Me: OK, no problems. We can set up a block on your line that completely blocks your roaming service, and will make sure no more roaming charges occur. Does that fit what you need?\n\n&gt; $BM: Perfect.\n\n&gt; $Me: Do you want US roaming blocked as well, or just all other international locations?\n\n&gt; $BM: Block everything. On all my lines.\n\n&gt; $Me: Absolutely. If you need the block removed, it will require a call back to us.\n\n&gt; $BM: I understand. Have I been billed for any daily packages?\n\n&gt; $Me: I'd be happy to check, once I finish adding the block.\n\n\nClickety-click, click, click. (Mouse)\n\nClick. (phone)\n\nRuh-roh.\n\nCheck call display. Guess what number the customer WAS using while roaming? Have a cookie.\n\nOK. Complete the requested operation on all lines on the account. Fully notate the account. Have a peek at the unbilled charges for my own curiosity. $10 per day for the 5 days mentioned. Sigh. I guess Billing is going to get a call once $BM is no longer roaming.\n\n\nTL;DR: Block the phone I'm calling from. Why you disconnect me?",
        "created_utc": 1500646875,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Jul 21",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6om3jc/free_talk_friday_jul_21/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1500617177,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you, whoever were you!",
        "author": "kat_oo7",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6okwat/thank_you_whoever_were_you/",
        "text": "I do not work in a call center but I want to say thank you to whoever took my call at the big red cell carrier this afternoon. \n\nI sent an alliterative text to my new husband 3 days ago regarding a sweet wedding gift from my coworkers. Today I received a well worded reply with the entire text in quotation marks and the statement that it had made him laugh. Well, I love my husband but his replies are one word and not always spelled well and he forgets punctuation. My alarm bells went off instantly. I waited awhile and texted my husband after lunch, stating that he was more wordy than usual. He was confused, needless to say. Once I was home from work, I double checked with him and his phone and no he hadn't sent the text. \n\nI called Big Red Carrier's customer service line and someone in their call center was very sweet and made me feel immensely better. He changed my husband's number and waived the fee. I don't remember his name and I wasn't given an exit interview so I came here in the off-chance he might see this. I was thrown off and definitely scared by this strange situation but his calmness and kindness made me feel better. So whoever you are, thanks for helping me out. You made a scary situation much less so.",
        "created_utc": 1500601570,
        "upvote_ratio": ""
    },
    {
        "title": "My favourite part of a call.",
        "author": "guylianrabbit",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ojs85/my_favourite_part_of_a_call/",
        "text": "No matter where we are in the world of call centres. We will all have experienced this. And it truely is my favourite thing that happens when we have a call. \n\nWhat is it i hear you cry? Is it when we get a customer who is polite and curtious all the way through? Is it the one who calls back to say they want your manager to know how amazing you are? \nNope... its when you've just shattered all their hopes and dreams by following policy and procedure and they think they have hung up, and then go on to slag you off not realising you can hear.\n\n\nI had this very thing this evening. I'm there. The lines are dead. My will to live slowly declining with the boredom when I had a lady come through on the phone. I wont bore you with details but long story short i work in central reservations for a hotel chain. We do all their bookings but some things we cant book. It needs to be done via the hotel. Its very rare you come through to us and we cant help you in some way. This lady came through on the phones half an hour before our lines close for the evening\n\nMe: oh! Im sorry but this is something that has to be dealt with directly through the hotel and unfortunately the people your needing has gone home for the evening \n\n\nFL: but... i want it sorting now cant you do it? \n\n\n\nMe: no im sorry. I dont have access to the diary your needing. So your not passed around trying to get through to the right line i will give you their direct number now and if you want to ring first thing in the morning someone will be able to help you then\n\n\n\nFL: FINE!! but i think this is stupid. You should be able to help me! I want it booking for tomorrow! \n\n\nMe: im sorry for the inconvience. The number you need is 01234 567890. If you press option 1 that will take you directly through\n\nFL: thanks! Bye!! (FL thinks shes hung up on me and to someone in the background) fucking bitch. Whats the fucking point in that line if they cant help me\n\n\nMe: we are here because we deal with.... \n\n\nFL: shit (hears shuffling and eventually a dead line) \n\n\nI shouldnt have spoilt my own fun and listened in for a little longer but i couldnt resist",
        "created_utc": 1500589612,
        "upvote_ratio": ""
    },
    {
        "title": "Created OLB Today Yet Can't Long In",
        "author": "fantasyandromance",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6oddlo/created_olb_today_yet_cant_long_in/",
        "text": "Woman calls in trying to help out a friend who can't speak English. Managed to get the customer verified and have her give permission to speak to her friend. \n\nStarts going on about how our website is obviously having service issues because she helped her friend create an OLB account today for her savings account yet after logging out she can't log back in. I ask her to verify the user id. She does so correctly. Password isn't showing revoked and she insists she knows it. So I ask her to delete her browser settings. She whines that she can't do that because she has multiple windows open and doesn't want to close that. Well Miss, if you're putting in the correct info you should be able to log in unless there's an issue with your browser. Asks us to reset her password.\n\nDo to recent fraud our bank has made it a policy to run Experian authentication if the person does not have a debit card to do a self reset. I have to bring an interpreter on the line so I can authenticate customer again. The friend tells me our customer speaks Chinese Mandarin so I bring a Mandarin interpreter on the line. Mandarin interpreter is having a hard time understanding the customer. The interpreter then informs me the customer actually speaks Cantonese. We get transferred to a Cantonese interpret so I can get the customer Experian authenticated.\n\n Afterwards her friends jumps back on the phone to bitch and complain before I even finish giving the temp password that she tries to tell me how she tried the self reset and it wasn't working. Mind you this customer cannot do the self reset because they don't have a debit card. I explain this to her but she still insists on mentioning again how it wouldn't let her self reset.  Finally I again attempt to give her the new password and tell her exactly how she should be putting in her user id and password. Suddenly she realizes she was missing a number when entering the user id she helped create that same day that she had earlier in the call verified correctly! Half an hour wasted because she didn't correctly write down the user id she create for her non English speaking friend.",
        "created_utc": 1500517638,
        "upvote_ratio": ""
    },
    {
        "title": "From the customer side",
        "author": "Fiddlestix22",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6o5wqj/from_the_customer_side/",
        "text": "In this one, I'm the customer. My bank had notified me on Saturday that there looked to be some fraudulent activity on my card. Sure enough, there's a $1 charge I don't recognize from a state on the other side of the country from my own. So I ring up their fraud department. The guy I speak to seems decent enough and once we confirm the fraud charges, he tells me he'll close my card entirely and I can go to a branch to get a temp in the meantime while I'm waiting for the new card. \n\nI thought all was well until three more $1 charges come through from the same source as the first. They're all immediately reversed but at that point I was a little peeves because I was told the card was closed. So I called back the fraud department. \n\nBank: Thank you for calling Bank. How can I help you? \n\nMe: Yes [explains context above]. \n\nBank: Oh that's not good! Yes those charges shouldn't be going through at all if the card is closed. Let me just check the notes from the last rep here. \n\n(At this point he takes on The Tone, you know the one) \n\nBank: I am so sorry. The last rep did notate your account that it was closed but never did so. I apologize that you had to waste your time. I'll be closing this myself and sending this over to my supervisor to coach this rep. \n\n(Translation: I know this guy and he's a fuck up and now I'm cleaning up his mess. Please don't yell at me.) \n\nIn the end, my card is now closed and the second guy was pleasant enough. I just kinda gave that knowing smile because I'm sure we've all had that call before. ",
        "created_utc": 1500434998,
        "upvote_ratio": ""
    },
    {
        "title": "First call of the day. *sigh*",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6o5ai6/first_call_of_the_day_sigh/",
        "text": "[removed]",
        "created_utc": 1500427707,
        "upvote_ratio": ""
    },
    {
        "title": "Accidentally gave one of you a 1-star rating.",
        "author": "keethantom",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6o4i7k/accidentally_gave_one_of_you_a_1star_rating/",
        "text": "I called in to change my flight, and you provided impeccable service, but during the exit survey, I accidentally tapped 1 for \"Extremely Dissatisfied\" as I moved my finger across the touch screen to tap 5 and say that I was \"Extremely Satisfied\". \n\nI'm so sorry, and if I could, I would fix it. ",
        "created_utc": 1500419317,
        "upvote_ratio": ""
    },
    {
        "title": "I Helped Someone And Feel Horrible",
        "author": "thedraconicone",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6o4een/i_helped_someone_and_feel_horrible/",
        "text": "Hello TFCC. Obligatory LTR:FTP. Also advance apologies for any formatting or spelling errors as I'm posting from my mobile.    \n   \nA little personal background: I'm no stranger to working at call centres. I have been a fellow headset jockey on and off since 2006 and have done customer service, dispatching, retention, collections, and tech support. I also hold several certificates in crisis intervention (not to claim I am a expert by any means).    \n   \nToday's story is actually not so much about a customer but our management. \n\nC: I'm hoping someone will listen to me. My wife passed and this (product) should have been cancelled. It was taken out in my name while I was in the hospital. I had a stoke. She passes away recently too. I spoke to a manager and they said they would help but never called (the call back black hole...).\nMe: I'm sorry for your loss, that's hard to deal with. I'm going to help -    \nC: Have you ever felt completely helpless in a situation.... (I was shocked by the question  so I was silent a moment before he continued) I do. I want to wheel myself off my balcony and end it.    \nMe: (Internally going oh-shit, trying to flag the only manager on the floor who is actively ignoring me, and particularly dislikes me. Feeling is mutual). Well I don't want to hurt yourself. Are you somewhere safe now? \n   \n[He confirms. We authenticate and I'm trying to make small talk. He's talking about his wife. I'm trying to be a sympathic human being. I'm using mute trying to interrupt said managers side conversation. She is still ignoring but I know she has seen my attempts. I ask a coworker not on a call to \"untether\" and walk up. Basically tells her u/thedraconicone needs you to tap in and right now. I can see her being all huffy. I miss part of what my elderly friend was saying except the tail end.\n       \nC: I should roll myself out right out that door and off the edge. Then I wont hurt or have to deal with this.   \n   \nBy this time, said manager is chirping at my other ear about how I'm not controlling g the car and how he won't do anything. This point I am actively ignoring her. I ask him straight out if he is planning to do any harm to himself. He says no, and launches into how he recently got out of the hospital...for self harm indications. I'm not happy or satisfied at this point. I now have this manager demanding I keep it business only, put him on hold, do my research and get rid of him. I resign myself and do that even though I feel like a shit lord doing it. \nEnd of the call comes (the issue actually was simple enough and partially handled).   \n   \nCustomer thanks me profusely for listening to him cry. Just for being there in his bad moment. Manager in eye line, pushing me with hand motions to hurry up. Off the phone she basically says to me \"we never really take it seriously. Then asked me in a condescending way if I needed a few moments.    \n   \nI just sort of glared and said no (should have but I wasn't giving her any satisfaction to report my offline time to the higher ups). \n   \nI'm sorry if this too much of a rant but I honestly felt like human trash after it all. ",
        "created_utc": 1500418218,
        "upvote_ratio": ""
    },
    {
        "title": "If we do not price match we must be a Monopoly.",
        "author": "CableSalesGuy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6o2fu7/if_we_do_not_price_match_we_must_be_a_monopoly/",
        "text": "I work for sales at a smaller cable company that does not service areas where the bigger guys are at like Comcast/TW/Etc.  We do not have the ability to offer some of the free deals with HBO/Starz/Cin/Show which when setting up new people and they ask for that they get mad we do not offer it.  But I have never gotten asked to price match someone before because well in this field that does not happen at all.  \n\nThis lady today was demanding we price match what Comcast does for HBO. (Yes we are a few dollars more than Comcast on HBO). When I told her we do not price match other providers she started screaming that all companies price match competitors. I replied, yes that is true but Comcast isn't our competitor we do not provide service side by side with Comcast.  She started going off more about monopoly this monopoly that.  After she calmed down I explained why, told her it costs our company at minimum $3 a foot to run a cable. If we are going to spend millions as a small company to run new lines are we going to run them in an area where there is zero service with a chance of a near 100% acquisition rate on customers or are we going to run them side by side with Comcast and have maybe a 50% acquisition rate at best.  She actually calmed down and understood why! In the end I was able to get her setup with our service with HBO and surprisingly was cheaper overall than Comcast because we do not have added fees to our service like Comcast.",
        "created_utc": 1500400239,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for insulting me",
        "author": "Lawadnorder",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nyobn/thanks_for_insulting_me/",
        "text": "I deal with a huge variety of people, and attempt to get them to pay their bill. Usually someone getting angry doesn't bug me, it may throw me off a bit, but I'm not gonna let it get to me. This gentlemen though, pissed me off so bad that I needed 10 minutes and 2 cigarettes to truly move past it. \n\nMe: *recorded greeting*\n\nCX: My name is Douche McDoucherson. \n\nMe: Alright sir, and do you have your pin? \n\nCX: No I do not. \n\nMe: acct number? \n\nCX: Nope. \n\nMe: I can send your pho- well it looks like you're ineligible for that, so all I can tell you is that you have a balance of X and a minimum due of X. \n\nCX: all I'm trying to do is let you know I mailed in a check for 250 dollars.\n\nMe: Okay sir, I can definitely make sure that's noted on the account. \n\nCx: Okay good. \n\nMe: So did you mail the check in today? \n\nCx: what did you just say? \n\nMe: Uh, I asked if you mailed in the check today? \n\nCx: that's very insulting \n\nWtf, how? Are you high? \n\nMe: I'm sorry sir, I'm just trying to make sure I have it marked down properly, I didn't mean any offense. \n\nCX: you should ask, what day did I send it in, that's how polite people ask. \n\nMe: sir, I marked it down, I didn't mean any offense, I-\n\nCX: well I took offense, and now I have to figure out your intelligence because clearly you're not that bright.\n\nReally dude? Because I asked if you mailed that in today? Like I ask everyone else who does that? Who don't throw tantrums? \n\nMe: Sir, you can insult me all you want-\n\nCx: that's how the world works, you insult someone they insult you back.\n\nMe: Sir, it wasn't meant to be insulting . It was just making sure I had accurate-\n\nCx: see how it feels to be insulted? \n\nI wonder how it feels to be your family when you're clearly insulted by everything and talking to you is a fucking chore. \n\nMe: Sir, I didn't insult you. I asked a question. Either way, would you rather go back to what you're doing or waste both our time? \n\nCx: and while I'm here, the store doesn't need no pin or account number, why do you? \n\nMe: because we want to verify that it's you we're talking to, and that someone doesn't steal your identity, we can't verify with ID like they can. \n\nCx: they never ask for ID \n\nThen they should be fired or you're in there so much they know you as the asshole who comes in to complain about everything. \n\nMe: Sir, it's part of my job. I'm sorry that doesn't work for you. \n\nCx: whatever. Thanks for insulting me.\n\nI don't know what pissed me off so bad with this guy. He didn't say anything that actually was insulting. He just wasted my time, and made everything harder on a call that should have been about 2 minutes max (7 minute call). Just fucking ridiculous.",
        "created_utc": 1500354251,
        "upvote_ratio": ""
    },
    {
        "title": "Your hand isn't that special",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nxj3u/your_hand_isnt_that_special/",
        "text": "Me: Thank you for calling the medical center. How can I help you? \n\nPatient: Yeah I need an appointment as soon as possible with the hand clinic. \n\nMe: I can certainly look into that for you. [verifies HIPAA and pulls up a chart and sees no referral] I see you don't have a referral. What were we wanting to be seen about? \n\nPatient: I have a dog bite to my hand. \n\nMe: Usually that's something a primary care doctor can see you for and they can generally see you much sooner than a specialist. Would you like me to look into that?\n\nPatient: No! I need a hand specialist! Just schedule me. I already saw my PCP. \n\nMe: one moment please while I check my instructions. \n\n(This particular clinic has different providers that can see different issues so my scheduling instructions go by symptoms/diagnosis and they need to be in the list otherwise I can't schedule and instead do a self referral so the clinic can look at it and see if it's something they can treat. Because a dog bite is a symptom they don't see patient's fit in most cases, it's not on my list) \n\nMe: Thank you for holding. I don't have instructions to schedule you so I'll need to do a self referral for you and the clinic will give you a call as soon as they can schedule you. \n\nPatient: How king dies that take?\n\nMe: it depends on how busy they are. It can take up to a week but a couple days is the usual timeframe. \n\nPatient: Uh no. I need an appointment NOW! You clearly don't understand. This is an INJURY. \n\nMe: yes ma'am I understand but I don't have a way to schedule you because this is usually something a primary care doctor will see you for and send a medical referral for if necessary. So I need to leave the scheduling for this particular case up to the clinic. \n\nPatient: Unacceptable! I have a bump on my knuckle that needs to be seen asap! \n\nMe: Let me take one more look and see what I can find. \n\n[at this point we have the bump so I have a more concrete symptom, lol and behold, this one has scheduling instructions. First appointment isn't until next month though. \n\nMe: Thank you for holding. I took another look and I do have instructions now. My soonest appointment is august 14th at 2pm. \n\nPatient: Uh no. Did you not hear me? I have an INJURY! It needs to be seen sooner than that!\n\nMe: ma'am I understand that but these are the appointments I have at this clinic. \n\nPatient: Are you trying to tell me they won't make an exception for an acute injury?\n\nMe: I'm telling you there are no appointments right now besides these. Your other option is to go to your primary care provider and ask for a referral. If they do that, you may be seen sooner based on that but as of right now, this is what we have. \n\n*click*",
        "created_utc": 1500340554,
        "upvote_ratio": ""
    },
    {
        "title": "\"Supervisor. Now.\"",
        "author": "CrakAndJaxter",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nx3d7/supervisor_now/",
        "text": "\"Thank you for calling -\"\n\n\"SUPERVISOR. NOW.\"\n\n\"Sir, I'm sorry but I'll need some information first. What's going on?\"\n\n\"I JUST SPOKE WITH _____ AND HE SAID HE IS HAVING A SUPERVISOR CALL ME BACK. IS THAT SET UP YET?\"\n\n\"No sir, you disconnected before he could get his supervisor. I'm happy to help if you just fill me in on what's -\"\n\n\"OH MY GOD YOU FUCKING PEOPLE!!\" *he hangs up the phone\n\nA few days later, I get an email from a manager in another state saying that we dropped the client's phone privileges, and thanked everyone for being professional. I checked the guy's profile from that day, and he called in almost 30 times just cursing people out as soon as they answered.",
        "created_utc": 1500335861,
        "upvote_ratio": ""
    },
    {
        "title": "\"That woman ruins my life every day.\"",
        "author": "TheRealChatseh",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nwymb/that_woman_ruins_my_life_every_day/",
        "text": "I work for a third party processor for insurance companies and deal almost exclusively with pharmacies. Usually the worst I have to deal with is a pissy hang up or a pharmacy tech passing the phone off to an irate member because both the tech and the member think I actually work for the insurance company. The most colorful call I've had was with a pharmacist I'm going to call Barry (Not his  actual name).\n\n&amp;nbsp;\n\n\nMe: Thank you for calling (Large PBM), my name is TheRealChatseh. May I have your name and title, please?\n\n&amp;nbsp;\n\nBarry: *sigh* Barry, pharmacist.\n\n&amp;nbsp;\n\n(I already know it's going to be bad because he's sighing at question one.)\n\n&amp;nbsp;\n\nMe: Thank you. May I have the member's ID, please?\n\n&amp;nbsp;\n\nBarry: I don't *have* that. Is a name and birthday good, enough? \n\n&amp;nbsp;\n\nMe: I understand you're calling for processing information. I'd be more than happy to assist. May I have the spelling of the member's last name...\"\n\n&amp;nbsp;\n\nI get the member pulled up with the name and birthday.\n\n&amp;nbsp;\n\nMe: May I have the rx number and date of fill OR the name of the medication you will be processing?\n\n&amp;nbsp;\n\n(I always tack on that last bit to head off impatient pharmacists. It never works.) \n\n&amp;nbsp;\n\n\nBarry: I don't have a rx number, sweetheart. I haven't processed and because I don't *have* the processing information. \n\n&amp;nbsp;\n\nMe: Okay,  may I have the name of the medication you will be processing?\n\n&amp;nbsp;\n\nBarry: Esomeprazole 10mg\n\n&amp;nbsp;\n\nMe: Thank you. May I have you verify the member's full address in order to release the member's ID?\n\n&amp;nbsp;\n\n\nBarry: 1010 Main St. Springfield, Virginia, 80566 (this is a fake address for this story but all he got right was the state).\n\n&amp;nbsp;\n\nMe: I apologize, sir, but that address does not match the address I have on file for the member. It looks like it isn't a physical address that we have for the member.\"\n\n&amp;nbsp;\n\n\nBarry: Ugh. Hold on, let me ask him. (Back and forth between him and the member). Is it P.O. Box 394 Kitten Way, Richmond WV, 71234?\n\n&amp;nbsp;\n\nMe: I apologize, that doesn't match the address I have for the member. Does he remember the address that he signed up with?\n\n\n&amp;nbsp;\n\nBarry: Let me ask (more back and forth), P.O. Box 2567 Regina Ave. Cretin, Virginia. 80912?\n\n&amp;nbsp;\n\n\n(This is usually the point of no return where I try to give them alternative solutions.) \n\n&amp;nbsp;\n\nMe: I apologize, sir, that doesn't match the address I have on file for the member. The member can always contact their member services and update their address. I have their number if you'd like to take it down for the member. \n\n&amp;nbsp;\n\nBarry: I've given you my name and title and the patient's name and date of birth. Why won't you give me the ID?\n\n&amp;nbsp;\n\nMe: I apologize sir but I need to verify the address before I can release the ID.\n\n&amp;nbsp;\n\nBarry: I've given you the correct name and date of birth. I'm pretty sure I've given you the correct city (nope), state (yes) and zip code (nope) and you won't give me the ID. You're standing in the way of a little boy's healthcare. You know that, right? Why can't you give me the ID with all of that?\n\n\n&amp;nbsp;\n\nMe: I apologize, sir,  but due to federal HIPAA laws, I need to correct, full address in order to release this information. Would y--\n\n&amp;nbsp;\n\nBarry: Geez Louise, federal HIPAA laws? Do you know the history of the federal HIPAA laws, sweetheart?\n\n&amp;nbsp;\n\nMe: *sighs* No, sir, I apologize, I do not.\n\n&amp;nbsp;\n\nBarry: Well, I'll tell you, sweetheart, and feel free to look it up later, the federal HIPAA laws were introduced by a woman who was nearly our president and signed into law by her husband. Do you know who that woman is?\n\n&amp;nbsp;\n\nMe: Hillary Clinton.\n\n&amp;nbsp;\n\nBarry: That's right. Hillary Rodham Clinton. And let me tell you something, I was practicing healthcare for 20 years before those HIPAA laws were passed and we never had any problems. \n\n&amp;nbsp;\n\nMe: Sir, I don---\n\n&amp;nbsp;\n\nBarry: Hillary Clinton. I swear that woman ruins my life everyday. \n\n&amp;nbsp;\n\nMe: Sir, I don't want to disc--\n\n&amp;nbsp;\n\nBarry: Is this call over then?\n\n&amp;nbsp;\n\nMe: Would you like the number for mem--\n\n&amp;nbsp;\n\nBarry: No, sweetheart,  I wouldn't. \n\n&amp;nbsp; \n\nMe: Okay, well, thank you for calling ( Large PBM), have a great --\n\n\nHe hung up. I looked up HIPAA laws later and his bullshit history lesson wasn't even accurate!",
        "created_utc": 1500334481,
        "upvote_ratio": ""
    },
    {
        "title": "Gave a customer a heart attack",
        "author": "drunkenstatus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nw736/gave_a_customer_a_heart_attack/",
        "text": "If I say much more than this then it's going to be obvious the company I work for but we deal with loans and I work in house. Any figures are made up for illustrative purposes. \n\nHad a nice chat with a customer (C) today. We had got her details updated and exchanged pleasantries. \n\nC: Can you tell me my balance please?\n\nM: Of course I can. Valid until the 31st it's £28,100.67 outstanding. \n\nC: *shocked* What?!\n\nM: Oh, sorry about that I meant £2,816.70. \n\nC: Thank god, I almost had a heart attack. \n\nM: Again, I really do apologise. Apart from getting you a defibrillator, can I help with anything else?\n\nThankfully the customer laughs, thanks me and goes on her merry way. \n\nCan happen to anyone, right? If only our system put in the comma!",
        "created_utc": 1500326887,
        "upvote_ratio": ""
    },
    {
        "title": "But Whyyyyyyy Thooooooo",
        "author": "glaciersmelting",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nw0l3/but_whyyyyyyy_thooooooo/",
        "text": "I work in a call center for an insurance company; we do long and short term disability, life insurance and medical leaves.  I service medical leaves only.  Whenever someone requests a leave there is paperwork that has to be filled out by their doctor (or the doctor of the family member they're caring for) and returned.  One thing we can do for people is send a copy directly to their doctor through fax.  Customers can view all letters we send out including what is faxed to their doctor online in their account.  So, here's the call:\n\nCaller: \"Yeah, um, ya'll sent papers to my doctor but ya'll call him Robbie or something like that; his name Stephen but it say Robbie or something\"\n\n(internal response: oh crap, the system messed something up again)\n\nMe: Ok, I can check on that and get it corrected for you.\n\n-pulls up file, looks at letter, puts phone on mute and laughs-\n\nMe: Ma'am, that's the title \"Rabbi\"\n\nCaller: But whyyyyyy thoooooo?\n\n(internal response: because it's a Jewish hospital and he's a Rabbi)\n\nMe: That is his title, Rabbi &lt;name removed&gt;\n\nCaller: But whyyyy thooooo?\n\nMe: ... how I about I change it for you to say \"Dr.\"\n\nCaller: Ok\n&lt;click&gt;\n\n-eye roll-",
        "created_utc": 1500325236,
        "upvote_ratio": ""
    },
    {
        "title": "How am I supposed to talk to someone?",
        "author": "GhanimaAt",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nv00a/how_am_i_supposed_to_talk_to_someone/",
        "text": "For a bit of context, my entire life I have been sure that Webchat is a safe haven in the customer support world of call centres. You have a lot more freedom to express your negative emotions and to poke fun at customers. I work for an energy supplier, and customers like this are the one black spot in a lovely world of written interaction.\n\n \n\nCustomer=C, Me=M\n\n \n\nC: . I need a Quote on my new flat for electricity. But I want to discuss telephonically and not through texting like this\n\nM: Hi C, thank you for contacting &lt;company&gt; Webchat.\n\nM: Ok, please contact &lt;moving home dept&gt; on xxxxxxxx - Their opening times are &lt;blah&gt;\n\nM: If we supply the property already, they'll be able to help.\n\nM: If we don't supply the property, you can contact &lt;new customer dept&gt; their number is xxxxxxxx\n\nC:  The automated voice is asking for an account number and I do NOT have an account yet so how can I speak to someone ????\n\n\nClearly, she did not get the memo on how if she's a new customer, she needs to contact us on the new customer number... I always like the multiple questions marks as well. My reading comprehension skill is too terrible to understand when a question is being asked.\n\n\nM: Please wait on the line and you will be passed to a person.\n\nM: It will ask for an account number 3 times, and then it will continue without it.\n\n\nThis takes a about one minute over the phone - one minute where she doesn't need to click anything. She's calling the wrong number, but hey, if that's what she wants, who am I to argue?\n\n\nC: I'm not prepared to wait three times, get someone to call me please\n\n\nI'm sorry ma'am, I'm not a switchboard operator.\n\n\nM: I'm sorry C, as an online agent I can't get other departments to call you. Please simply hold the line and you it will progress further. If you are new to &lt;company&gt; and we don't supply the property, please call &lt;other dept&gt; on xxxxxxxx and they'll help you.\n\nC: How come your website does not provide new customer telephone number details???\n\nM: I'm sorry C, we do provide phone numbers if you click on help -&gt; contact us online.\n\nM: We also provide Webchat help, and we're always happy to guide customers to apply online.\n\nC: I've wasted enough time just to get a phone number. Not a good start as a new customer. Thank you\n\n'Customer' disconnected ('Concluded by End-user').\n\n \n\nThis happens so bloody often - if you need help, customers, click on HELP. If you don't want to use Webchat, just don't use it! If you're a new customer, use the bloody new customer number!",
        "created_utc": 1500316207,
        "upvote_ratio": ""
    },
    {
        "title": "When you have had a long week and will believe that a customer is capable of anything",
        "author": "PantsPartyPirate",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nlgrx/when_you_have_had_a_long_week_and_will_believe/",
        "text": "It was a long week. We had a couple of people get angry at us for \"stealing their money\" because they sent it to a random account that has nothing to do with us, 1 guy leave us a horrific review because their order was delayed at customs and now USPS has redirected their package somewhere (and this is of course our fault entirely), so I have been feeling a bit drained this week.\n\nWe have been trying to get photo evidence from a guy for a couple of weeks now because there was an issue with their package when it was delivered, and failing. He then told me that the package was buried somewhere and that he would need to find it. When he had hung up, I turned to my coworker in shock and asked why the hell anyone would bury it in the garden. It took a few moments for them to convince me that it was metaphorically buried.\n\nI felt pretty stupid for imagining the guy going out of his way to dig a hole in the garden, put his package in there, then cover it back up. At least it gave everyone else a good laugh :)",
        "created_utc": 1500198819,
        "upvote_ratio": ""
    },
    {
        "title": "\"I would have waited if I had known!\"",
        "author": "hawkpreaker29",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nkbo3/i_would_have_waited_if_i_had_known/",
        "text": "I was working as a seasonal employee at a call center for a retail store one summer, and while there were many calls that I couldn't believe I had even taken, this one was simply not one I could quite wrap my head around.....\n\nMe: Thank you for calling (store), how can I help you this morning? \n\nCustomer: Yes, hi. I purchased two bras in store about ten days ago, and I was told that you weren't giving out extra points during your sale so I bought them then. But now I have an email saying that I can get ten points for every dollar. Can I apply that to my order? \n\nMe: Ma'am I am sorry but unfortunately I cannot apply those rewards. We had not planned on giving out extra points but we had some unexpected issues with our website and ordering systems so we gave the extra points out to customers who experienced issues while trying to place their orders.\n\nCustomer: Right, but I'm a cardholder. And had I known the extra points were going to be given I wouldn't have brighten the bras. I really didn't need them, but I figured if the points were going to be the same I would just buy them then. \n\nMe: I understand that, however we didn't know we would be giving out extra points. \n\nCustomer: Can I just return them and repurchase them for the points? \n\nMe: I'm sorry but no, the extra points offer was only good until yesterday. \n\nCustomer: You can just go in and manually add my points. You've done it before. \n\nMe: I don't know who you spoke with before, but I am unable to access any part of your rewards account. That is all automated through our credit team- \n\nCustomer: I want to speak to your supervisor. I spend thousands of dollars with your company and you can just give me the extra points. \n\nMe: Okay ma'am, give me just a moment and I will get a supervisor on the line. \n\n*Calls to supervisor line \n\nSupervisor: How can I help you? \n\nMe: Yeah I have a lady on the phone demanding the ten points deal from an order placed ten days ago. \n\nSup: No, I'm sorry we can't do that. \n\nMe: I know. She won't listen to me though. She demanded to speak to my supervisor. \n\nSup: Okay, transfer her over but there isn't anything I can do about it. \n\nMe: Sounds good, let me get her on the line. \n\n*Conferences call \n\nMe: Okay ma'am, I have a supervisor on the line, she will be more than willing to assist you further. \n\nCustomer: Thank you, and you have been very helpful. \n\n*I disconnect out of conference. \n\n*10 minutes later the supervisor messages me* \n\nSup: There is ten minutes of my life I won't ever get back.....\n\n\nAnd that is the reason we all wanted to die while on the clock. ",
        "created_utc": 1500177935,
        "upvote_ratio": ""
    },
    {
        "title": "Please let me know when it's my turn to talk ...",
        "author": "robmerrill92",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nj50w/please_let_me_know_when_its_my_turn_to_talk/",
        "text": "First, a little background on myself. I've been in customer service for 8 years, 5 in retail with 4 as a manager, and 3 of those years in a call center. Right now I am a phone rep for a well known company and am doing pretty damn well for myself there. Also, just a heads up, I stink at writing. \n\nAnyways. Today I had one of the worst customers I've ever had to deal with. Patience was required the entire time and more than I've ever needed it before. Long story short, this customer was wanting me to look into a situation that he had been transferred around the company for over the past few hours. Okay, I get it, you're frustrated with that and I totally understand. Let ME do MY best to help you and avoid another transfer. His situation required a lot of digging and probing questions so I could understand what exactly it was he needed help with. \n\nThis guy was incredibly rude, interrupting every chance he got - foul language, arrogance, all that crap. I stayed calm the entire time and finally got to the point where being nice wasn't working. In a very stern but professional voice, I finally told him that I will stop talking and \"tell me when it is my turn to talk, and I'll be more than happy to help you, but if you don't let me finish my sentences and ask you about the situation then this call will go absolutely nowhere. So again, pleAse let me know when it's my turn.\" Throughout the call I genuinely empathized with him, letting him know that I'd be upset to about the situation and the fact that he'd been transferred all over, but talking over me isn't going to accomplish a single thing. \n\nAfter that, he of course began to say how he hadn't been interrupting and that I had been the one interrupting, which may have seemed that way considering every time I had the chance to jump in, he would interrupt.\n\nAnyways, the call was more under control afterwards. I would go silent the moment he interrupted me, I'd let him rant, and then he'd ask \"are you there!?\".  I would respond with \"yes sir, I'm just letting you finish and waiting for you to tell when I can continue\". I think using this strategy makes it seem that you are giving the customer control when really I'M now the one in control. We finally got his issue figured out and he actually ended with a \"have a good day\". Not a sarcastic one, but what seemed to be a genuine goodbye, if not a little embarrassed the way he conducted himself throughout the call. \n\nAnyone use this strategy before? Thoughts?",
        "created_utc": 1500162181,
        "upvote_ratio": ""
    },
    {
        "title": "Pull my account up with my phone number!",
        "author": "ahatfield23",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6niuib/pull_my_account_up_with_my_phone_number/",
        "text": "Me: thank you for calling Bank. my name is Lucy and who love the pleasure of speaking with?\n\nCustomer: yeah my name is customer and I'd like to know why my debit card declined? \n\nMe: okay. I'm sorry to hear about that happening and I'd be happy to see what happened to your debit card. Now in order to access your account may I have either your Social account number or card number? \n\nCustomer: yeah my phone number is xxxxxxxxxx.\n\nMe: oh sir in order to pull up your account I would need either your Social account number or card number. \n\nCustomer: that's not true . I always call in and they always pull my account up with my phone number.\n\nIt's not possible to pull up in a customer's account with just their phone number so I already knew he was lying.\n\nMe: I'm sorry sir but it's not possible to pull up your account with just your phone number.\n\nCustomer: I don't mean to be an ass but yes it is.Go ahead and go ask someone how to do it. \n\nI go ahead and make a call to my supervisor just to double-check and even he said there is no possible way to do that.\n\nMe:  okay so sir I did go ahead and check with my supervisor and there is no possible way to pull up your account with just your phone number. So in order to access your account I need either your Social account number or card number.\n\nCustomer: again I don't mean to be an ass but I'm not giving you any information but my phone number. I know my other information but I'm not giving it to you. Just for the principle of it because I know you can pull my account up without that information. \n\nMe: well sir since I can't pull your account up is there anything else I can assist with today?\n\nCustomer: yeah get me to a supervisor.\n\nMe: *transfer*\n\nWhat a moron. ",
        "created_utc": 1500158585,
        "upvote_ratio": ""
    },
    {
        "title": "Oh the joys of system outages....",
        "author": "ahatfield23",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nirkp/oh_the_joys_of_system_outages/",
        "text": "Me: Thank you for calling Bank. My name is Lucy.  And who do I have the pleasure of speaking with today?\n\nCustomer: (customer name)\n\nMe: Thank you for that and Miss customer I would like to let you know that we are experiencing a system outage today so I'm not able to access your account but I would be happy to answer any general questions you may have.\n\nCustomer: yes I'd like to know which checks have cleared my account.\n\nMe: -_- okay unfortunately our systems are down right now so I'm not able to see your account but if you have any general questions I would be happy to answer them.\n\nCustomer: I didn't ask you for  general information! I asked you what check cleared my account!\n\nMe: I cannot see what checks cleared your account because our systems are down right now. If you call back in a few hours they should be back up.\n\nCustomer: (long pause)\n\nMe: Hello? \n\nCustomer: why can't you just tell me what checks my account?!\n\nMe: ........So since I can't see what checks cleared your account is there anything else I can assist with today?\n\nCustomer: *click*\n\nThis woman has the listening skills of a potato. ",
        "created_utc": 1500157591,
        "upvote_ratio": ""
    },
    {
        "title": "\"Brock! My name is Brock Lesnah!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ni534/brock_my_name_is_brock_lesnah/",
        "text": "[removed]",
        "created_utc": 1500150460,
        "upvote_ratio": ""
    },
    {
        "title": "I'm giving your grandmother EarGasms every day.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nhu2b/im_giving_your_grandmother_eargasms_every_day/",
        "text": "[deleted]",
        "created_utc": 1500147052,
        "upvote_ratio": ""
    },
    {
        "title": "Share your worst incompetent management related stories here.",
        "author": "DarkLord84",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ndzgu/share_your_worst_incompetent_management_related/",
        "text": "So here's mine - I work for a government department in finance, but I spent the first two years in the call centre. When I first started this job, it wasn't actually too bad as we had a good team with lots of people on the phones so the work load was very even and spread out.\n\nThen the shit really hit the fan. Towards the end of 2015 and the beginning of 2016, six people left their roles for various reasons. Some moved to different roles in the organization and some resigned altogether. Because the call centre in the government department I worked in is such a diverse job it takes a long time to train staff and get them totally up to speed with who does what and how to handle the systems they use and deal with the callers. But for whatever reason, new staff were not even hired until March 2016 and weren't trained enough to use the phones by themselves until May 2016, so we ended up being severely short staffed for about six months.\n\nBut the taking too long to hire people was just the beginning of it. Our department has taken on contracts to handle calls from other call centers as well as its own. On one particular morning in February 2016 the customer services manager (my boss' boss) comes in to our morning meeting with an \"exciting announcement\" - \"Great news guys, we've got the contract for this other department! We will be taking all of their after hours calls and during the day when they have meetings! Isn't that great?\"\n\nDuring this time period we were not only severely short staffed but in the middle of a housing crisis, a building consent boom and a property boom all at the same time so we were seriously under pressure with work to the point we were having to call people from other areas to help us with the sheer volume of calls coming in each day. And the customer services manager thinks this is the perfect time to bring on another contract for more calls. All I could think to myself was \"we are seriously under the gun here and we don't even have enough staff to cover our own calls, and you're bringing on a whole other contract for even more calls?! Are you f%#%ing KIDDING ME?\"\n\nThis went exactly as I expected it would. Turns out this other organization we were now taking their after hours calls and day calls while they had meetings for had a 2 hour meeting at least once a fortnight, usually more than that. Their call centre was just as busy as ours so every time they had their meetings their calls would come flooding in and we had to take them, not to mention learn all of their systems while trying to take our own calls at the same time with less than half the staff that we needed. One day I ended up answering 40 phone calls in one hour.\n\nOf course our service level (which is measured on how fast we answer calls and how many hang ups we get before calls are answered) suffered very badly during this time. We were supposed to hit 85% per day but some days it dropped as low as 4%. Management decided they weren't happy with how low the service level was dropping and that we might not hit our yearly targets so they introduced a brilliant scheme - to log people back in to the phone queue who had logged themselves out to do follow up work.\n\nIn this call centre follow up work was essential and you had to be able to take yourself out of the queue at times especially if you had a dog attack or a major water leak and you had to phone a contractor to go and visit the site immediately. Many times I would be finishing a call, putting myself on time out and about to phone someone I needed to phone only to have another totally unrelated call thrown down my throat because I had been logged back in and forced to deal with another situation and unable to finish the one I was working on by phoning a contractor because my genius manager decided they didn't like me being off the queue and logged me back in. I spoke with my manager and got my head bitten off about it and many other staff shared their anger and frustration get it kept happening.\n\nI ended up having to take two weeks stress leave later in the year and was at last able to secure a new position out of the call centre at the beginning of this year but for the last two months I was so angry and disgruntled I started intentionally slacking off as I was just so pissed off about how badly everything was constantly handled and how we were all treated.\n\nTL:DR - useless management brings in a whole other contract for taking even more calls when we don't have enough staff to answer our own calls and log us back into the queue if we take time out off the queue to do follow up work such as phone contractors.\n\nSo those are mine. What are yours?\n\n\n\n\n",
        "created_utc": 1500091725,
        "upvote_ratio": ""
    },
    {
        "title": "We'll be sure to give you a heads up before your doctor suddenly dies next time",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6nddyb/well_be_sure_to_give_you_a_heads_up_before_your/",
        "text": "Not my story but that if a coworker that I got the scoop on later. \n\nA doctor with a local family practice that wasn't associated with my medical center suddenly passed away a couple weeks ago. We weren't told any specifics but the guy had appointments scheduled for the day of his death so it clearly wasn't expected. He was the sole practitioner at his practice so when he passed, the clinic was forced to close its doors. Subsequently, they started calling all his patients letting them know of his passing and made arrangements with my medical center to give those patients our phone number and gave us access to those patient's medical records. C will be my coworker and AL will be angry lady. \n\nC: Thank you for calling the medical center. How can I help you? \n\nAL: I demand to know the meaning of this! I got a call from Dr. X's clinic telling me they cancelled my appointment and closed the clinic and told me to call you to find a new doctor! I've had that appointment for weeks! Why would they just close the clinic like that and cancel my appointment? \n\nC: I'm so sorry AL, Dr. X's practice closed because he passed away unexpectedly. I can certainly help you find a new doctor for your appointment though. \n\nAL: Oh...well that's still not an excuse! They shouldn't have cancelled my appointment like that!",
        "created_utc": 1500083604,
        "upvote_ratio": ""
    },
    {
        "title": "Oh that's my son's name!",
        "author": "No_This_Is_Cat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n8j98/oh_thats_my_sons_name/",
        "text": "Me: /intro/\n\nLady: What was your name again?\n\nMe: No_This_is_Cat\n\nLady: Oh! That's my son's names! Haha!\n\nMe: (Matching tone) Haha, well I don't think I'm you son! Haha!\n\nLady: Ohh no no of course not haha he's not incredibly stupid like all of you.\n\nMe: ...\n\n(Bit later as well)\n\nLady: I worked in the military with men for 20 years. I know that you are all lazy and useless and won't do anything.\n\n\nBiiiitccchh please",
        "created_utc": 1500033146,
        "upvote_ratio": ""
    },
    {
        "title": "Lady called me a ni**er today.",
        "author": "jimjslip",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n7nwh/lady_called_me_a_nier_today/",
        "text": "Working in the call center for a bank now.  Lady on the phone, generally being a pain in the ass.  Asking questions and not liking my answers.  Finally, she says \"I'm just going to come into the office, I don't have to accept lies from some nigger.\"\n\nI've had my life threatened, my family's lives threatened, been called stupid.  I'm used to all that.  But this was a new one.\n\nShe hung up before I had the chance to tell her I'm white.  ",
        "created_utc": 1500019200,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Jul 14",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n78mk/free_talk_friday_jul_14/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1500012376,
        "upvote_ratio": ""
    },
    {
        "title": "Got a call from a national personality",
        "author": "Jeff68005",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n63yh/got_a_call_from_a_national_personality/",
        "text": "I had been working about ten hours and falling half asleep every few seconds, I get moved to a free sample queue. After a few calls, I get a call from a nationally known economist that I had seen on PBS.  I'm processing his order delighted to get to banter with him a bit and doze mid call for a few seconds, but also excited to get his call.  I processed his sample order.  Normally, I would get gassed up having talked to national personality, half doze again.",
        "created_utc": 1499996631,
        "upvote_ratio": ""
    },
    {
        "title": "I would like help logging into the webpage.",
        "author": "NCHippy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n54gp/i_would_like_help_logging_into_the_webpage/",
        "text": "    ME: Great! Are you at the website now?\n    Them: No.\n    ME: Ok, Open your browser and type in example.com\n    Them: I don't have a computer.\n    ME: Are you using a phone, tablet or other device?\n    Them: NO! I told you, I don't have a compter!\n    ME: Perhaps I misunderstood you, Are you going to use someone else's computer and just want me to tell you what to do?\n    Them: NO! I WANT TO LOG INTO THE WEBPAGE!\n    ME: :/\n    ME: Do you have access to a computer?\n    Them: NO! I WANT TO LOG INTO THE WEBPAGE!\n    \n    ...... This goes back and forth for 20 minutes with the caller refusing to hang up on me.\n    Super eventually rescues me and the line goes silent ......",
        "created_utc": 1499985610,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want you to have my information!!",
        "author": "Skay_4",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n4izb/i_dont_want_you_to_have_my_information/",
        "text": "I work for one of the 500 warranty companies that send direct mailers to pretty much everybody who buys a car. The other day I got the opportunity to work with a whole new level of ignorance.\n\nMe: thank you for calling this is Skay how can I help you?\n\nHim: I want you to take me off your list\n\nMe: okay no problem, what is the code number on the mailer?\n\nHim: I DONT WANT YOU TO HAVE MY CODE I JUST WANT OFF YOUR LIST\n\nMe: sir if you want off the list I need to put in the code number to pull up your file and remove you from the list\n\nHim: I DON'T WANT YOU TO HAVE ANY OF MY INFORMATION I WANT YOU TO TAKE ME OFF YOUR LIST.\n\nMe: Sir, all the information on the letter is obviously in our system. If you want off the list I need the c---\n\nHim:  FUCK YOU \n\n*click*\n\nAnd these type of calls happen more than I'd like to admit.",
        "created_utc": 1499979765,
        "upvote_ratio": ""
    },
    {
        "title": "Everyone hates me apparently.",
        "author": "br4tty",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6n2bl7/everyone_hates_me_apparently/",
        "text": "So this just happened about 10 minutes ago. \n\nWe take calls for city services here. We're a small centre (only about 12 reps) so it's common practice for us to warn each other about crazies that are probably going to call back. This is exactly what happened this morning.\n\nCoworker gets a call, can't find the resident's info under the phone number he provided, he declared her to be \"fucking useless\" and she hangs up on him (yes we're allowed, yes it's amazing) as he starts berating her. This whole call lasted about 20 seconds.\n\nAbout 15 minutes later, I get him. I knew who it was as soon as he started to speak because he had the tone of an angry asshole. He says he has the phone number that is corrected from the one he gave a few minutes ago. I pull up the file, verify everything, ask what I can help him with.\n\n**Him:** Who was handling my case?\n\n**Me:** Sorry, which case? I see several cases in the system here.\n\n**Him:** The one from yesterday at &lt;address&gt; about the fucking water and why 10 tenants don't fucking have any!\n\n**Me:** .....ok. It was being handled by water/wastewater services, they (he cuts me off)\n\n**Him:** No shit! Who had their hands on my case? Who was it sent to dumbass?\n\n*Sidenote: When the name calling starts, the customer service tone goes out the window and while the words I say are polite and professional, people generally know exactly what I think of them.*\n\n**Me:** It was assigned to the dispatcher for that department. The notes here indicate that someone was dispatched and attended the address yesterday.\n\n**Him:** What is the dispatcher's name?\n\n**Me:** Gabriella. *(name changed to protect the innocent)*\n\n**Him:** I want her full name, extension and location of her office.\n\n**Me:** *(yeah right, like I'm pointing someone like this in anyone's direction)* Sorry sir, I'm not allowed to provide that information. I can transfer you to her and she can provide it if she would like, as well as look into the problem further if your tenants still have no water. *(he still hadn't actually clarified this, I just assumed)*\n\n**Him:** So what extension is that?\n\nAnd this is where we got stuck in a loop. Him demanding personal information about other staff, and me refusing to give it to him because I will not be responsible for some crazy stalker finding a new target.\n\n**Me:** Sir, will you allow me to transfer you to the dispatcher? We're going in circles here. \n\n**Him:** You know, this is complete fucking bullshit. You're so goddamned useless and THIS IS WHY EVERYONE IN THIS FUCKING CITY HATES YOU.\n\n**Me:** One moment please.\n\nI couldn't help it, I started laughing. I'm about 90% sure buddy heard me before I hit my transfer button. I was still laughing when dispatch picked up.\n\n**Dispatcher:** Good morning, water/wastewater.\n\n**Me:** Hi! I have a crazy person for you.\n\n**Dispatcher:** Oh god is it the guy from &lt;address&gt;??\n\n**Me:** Yep! He wants your full name, extension, office address, everything and he's pissed that I won't give it to him.\n\n**Dispatcher:** Sucks to be him because I'm not telling him either. Send him through.\n\nIf this guy had just called and said that he had called yesterday with this problem and they still didn't have water, this all could have been handled in about 5 minutes (as it turns out, one of the basement tenants had turned the main shut off inside the building off for fear that pipes would burst once the water was turned back on at the street). Instead he had to be a giant dick, ask vague questions that would actually get him further away from a solution and abuse at least 3 different people in the process. \n\nOne day I'm going to snap and ask why they think this kind of behavior is ok. I'm past offended and genuinely curious at this point.",
        "created_utc": 1499959758,
        "upvote_ratio": ""
    },
    {
        "title": "I hate customers",
        "author": "Lolozilla",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mzb5a/i_hate_customers/",
        "text": "I feel so emotionally drained from the customers i assist. Just tonight i had a woman call me about a clients account and she wanted to know why something was on there and i dont even know the situation yet im trying to gather all the info but she starts out with this is all YOUR fault and i want YOU to fix this right NOW. Bitch you are so fucking rude im just trying to help you and the first thing you do is tear my head off? First off dont take it oit on the first person you talk to thats just ridiculous. I check the account and none of the issues she explained exists on her account. I think she called up the wrong place honestly but still why do people think its ok to treat someone like they are gum under your shoe. Thats honestly how i feel working in customer service. People with how they treat me make me feel like i am not worth shit and that im this piece of shit that does not even deserve to breathe. Im so emotionally done i cant handle customer service anymore. I just dont understand how people can be so mean. I cry all the time when i come home and i always have horrible headaches. I just wish this was a better world and people were more loving because me personally i can never ever see myself doing this to someone else. I just cant. ",
        "created_utc": 1499919424,
        "upvote_ratio": ""
    },
    {
        "title": "After 7 months, I'm leaving the call center life behind!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6myc8u/after_7_months_im_leaving_the_call_center_life/",
        "text": "[removed]",
        "created_utc": 1499907979,
        "upvote_ratio": ""
    },
    {
        "title": "I need to tell my mom that I'm a dick",
        "author": "MurderSlinky",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mxq0v/i_need_to_tell_my_mom_that_im_a_dick/",
        "text": "I spent too many years working the night shift at an alarm monitoring company.  I have more stories than I could possibly share, but this one takes the cake.\n\nA bit of background: \"Alarm Monitoring Company\" had a standard greeting that we had to use for inbound calls.  Alarms come up on a computer monitor, at which point we make an outbound call.  I can't think of a single time when an inbound call could have been called an emergency.\n\n&lt;&lt;Phone rings&gt;&gt;\n\nME: Thank you for calling Alarm Monitoring Company, this is MurderSlinky.  How can I help you?\n\nDBAG: You know, when people are calling in, you probably shouldn't waste time with your introduction.  People who call in are probably in some sort of trouble, so starting with &lt;&lt;mocks my introduction&gt;&gt; is like, the worse thing you could do.\n\nI take a moment to let the irony of this soak in.\n\nME: How can I help you?\n\nDBAG: I just need to take my system offline while we run some tests.  You really shouldn't be wasting anyone's time when they call in, you know.\n\nME: Uh huh.  How long do you need the system offline for?\n\nDBAG: Just until 5.\n\n&lt;&lt;Rapid, expert typing ensues&gt;&gt;\n\nME: Alright, you're all set until 5.\n\nDBAG: Great.  And you know, about that introduction, you just really need to be more sensitive to people's time^and^blah^blah^blah\n\nI am not a doormat, even in a good mood.  Besides, my two week notice was already in, so fuck it.  I interrupt his idiotic spiel.\n\nME: Sir, I'm not interested in discussing this.  If there's nothing else I can help you with, I'm going to terminate this call.\n\nThere was a moment of silence.  I was expecting a click, then dial tone.  Not so lucky.\n\nDBAG:  You're a **dick**.  Tell your boss that you're a **dick**.  Tell your friends that you're a **dick**.  Tell your mom that you're a **dick**.  You're such a di-\n\nI hang up the phone.  There's only two people in the call center on the nightshift and I liked to park myself on the opposite end of the room.  It's hard for us to hear the other speak on the phone or otherwise, so I'm trying to type notes into the account and fire an IM off to the other operator when the phone rings again.  Coworker snatches up the phone with puma-like speed.  I could only hear her side of the conversation, but it's easy to imagine his.\n\nCW: Thank you for calling Alarm Monitoring Company, this is -\n\nCW: Ok, I -\n\nCW: I'm sorry tha-\n\nCW: Sir, I'm going to have to ask you to calm down.\n\nThen, she clearly hung up on him.  I stand up so we can talk over the cubicles.  She's pale, visibly shaken.  She was still relatively new and while she wasn't unusually sensitive, it takes a while to get used to the level of rage people throw at you on the night shift.  I gave her all the reassurance that I could (I genuinely suck at human interaction) and we both covered our asses by sending emails and writing notes.  The phone recording system was actually working at this time, so management was able to review both calls.  The next night, we both had emails thanking us for handling the situation and to let us know that DBAG had been dropped as a customer.  \n\nIn case you're wondering, I did tell my mother the story and made sure she knew I am a dick.  ",
        "created_utc": 1499901214,
        "upvote_ratio": ""
    },
    {
        "title": "We Don't Accept Your Insurance",
        "author": "Despite_Snow",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mvj8m/we_dont_accept_your_insurance/",
        "text": "I work in the call center at a local mental health facility. We are decently small and our call center is really just my coworker, myself, and my supervisor in an office in the back office answering the phones. My coworker went to lunch and it was just my supervisor and myself on the phones. I picked up the phone to an already frustrated woman (FW)\n\nMe: Mental Health Facility this is Despite_Snow, how may I direct your call?\n\nFW: I need to schedule an appointment with a psych doctor now! As soon as possible I need the appointment now!\n\nMe: Okay, I'll need to get you to [omitted] so she can set you up in our system. May I ask what insurance you are on?\n\nFW: I'm on Commercial Insurance, I need to be seen.\n\nMe: I'm sorry but unfortunately we don't accept that insurance as we are at capaci-\n\nFW: NO! I NEED TO BE SEEN NOW! I NEED THIS APPOINTMENT! \n\nMe: I'm sorry but we can't take you-\n\nFW: I HEARD YOU THE FIRST FUCKING TIME! CAN'T YOU JUST BILL ME AND NOT THE INSURANCE\n\nMe: That would be illegal. I have a list of other providers in the a-\n\nFW: WHY WONT YOU FUCKING HELP ME I NEED FUCKING HELP!\n\nMe: I apologize that we can't see you, but I can give you numbers to other\n\nAnd she hung up. I feel bad, this woman definitely sounded like she needed the help. If she would have taken a second to listen to me I could have helped her. ",
        "created_utc": 1499881006,
        "upvote_ratio": ""
    },
    {
        "title": "It Needs to be Fixed.",
        "author": "OnigiriChan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mv3zw/it_needs_to_be_fixed/",
        "text": "I've worked in tech support as a Help Desk technician for almost 7 years and have never gotten a call quite like the following:\n\n&amp;nbsp;\n\n$Me: Help Desk. How can I help you?\n\n$Caller: Hello. some mumbling and silence How much do you know about our secure file sharing program?\n\n$Me: Not much, to be honest. What's going on?\n\n$Caller: more mumbling and silence Well, I've found an issue with it.\n\n$Me: OK....\n\n&amp;nbsp;\n\nNow, at this point, I'm preparing to turn this call over to one of my coworkers since I still have very little knowledge of the system he's having issues with. But of course I have to gather the information first, right?\n\n&amp;nbsp;\n\n$Caller: It doesn't work with the new email addresses. \n\n$Me: confused I'm sorry?\n\n$Caller: It doesn't work with the new email addresses. It only works with the old (unusable) ones. \n\n&amp;nbsp;\n\nYeah...I'm lost. And not because I don't know what he's talking about.\n\n&amp;nbsp;\n\n$Me: OK...what's the exact issue you're having?\n\n$Caller: Well, when I log in under my new email address, I'm missing the option to send files. I don't have that problem when I log on using my old (unusable) email address.\n\n$Me: Oh! I see what the problem is. What you'll need to do is re-register your account with that email address. Then you'll have the option to send files again.\n\n$Caller: I already did that. I reset my password.\n\n$Me: I'm sorry sir, resetting your password isn't going to fix it. You'll need to re-register-,\n\n$Caller: I already have an account. That's why it told me to reset my password, because I already have an account. I set up a new account with my old (unusable) email address, and it works just fine.\n\n$Me: I understand, but the way it's set up, you have to re-register your account every few months, or else you won't be able to send-,\n\n$Caller: Where does it say that?\n\n$Me: I don't think it does, unfortunately.\n\n$Caller: So how am I supposed to know I'm supposed to do that? It works with my old (unusable) email address and not the new one.\n\n&amp;nbsp;\n\nGood point, to be fair. \n\n&amp;nbsp;\n\n$Me: I understand sir, but as I've instructed before, if you just re-register your account with your current email address, you'll have the option to send. That's why it's working with your old (unusable) email address. It's a new account. We just need to make a \"new\" account with your new email address.\n\n$Caller: I don't know how I'm supposed to know that. This must be why our company changed names. Because of a lack of communication.\n\n&amp;nbsp;\n\nI have NO idea how to respond to that, so I just don't for a second.\n\n&amp;nbsp;\n\n$Me: I understand your frustration, sir. But it will be back up and running for you once you re-register your account.\n\n$Caller: It needs to be fixed. That's why I called.\n\n$Me: I'm sorry?\n\n$Caller: It needs to be fixed. You need to make a trouble ticket and have it fixed.\n\n$Me: Um. OK...\n\n$Caller: OK. Thank you. Bye.\n\n$Me: ...Goodbye?\n\n&amp;nbsp;\n\nI'm still at a loss. He made a perfectly good point (I'm not going to deny him that), but who calls in just to...like...I already gave you the answer to the exact issue you're having, but that's not good enough?\n\n&amp;nbsp;\n\nI don't even know how to explain it. \n",
        "created_utc": 1499877296,
        "upvote_ratio": ""
    },
    {
        "title": "I hate online bill pay.",
        "author": "TiredUnicorn",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mrbff/i_hate_online_bill_pay/",
        "text": "It causes so many headaches, this is the case with multiple clients.\n\nPeople think they are being clever. They don't have to bother writing an actual check, and it's going to save them so much time. \n\nWRONG.\n\nHalf the time either the customer or their bank does not include an account number on the check. Since no payment statement accompanies these checks, it will be cashed but cannot be matched to the account, and the customer will not be credited.\n\nCustomer: I'm calling about a bill you sent me again. I already paid this. \n\nTired Unicorn: I show no payment on this account. What payment method did you use?\n\nC: I paid with a check.\n\nTC: K. When did you mail the check?\n\nC: I don't know\n\nT: yOu dOn't kNoW?\n\nC: I used my online bill pay. \n\nT: When did THEY mail the check?\n\nC: I don't know. \n\nT: Well then I don't know if it has had time to reach our bank. Did the payment clear your account?\n\nC: I don't know. (Noticing a pattern here?)\n\nT: Well we need to know if it even cleared your account before we can do anything. \n\nC: &lt;spends 5 minutes logging on to their bank's website to find out if payment cleared. About the same amount of time it would take to pay directly on our website&gt;\nOk, it cleared on 4/20. I have a confirmation number you can find it with.\n\nT:(pulling my Trump Card) I can't do anything with that. It's past the normal time frame for our bank to report that they received your check. We're going to have to open a payment investigation but in order to do that we will need to you send us a copy of the front and back of the cleared check from your bank.\n\nC: &lt;spends another 5 minutes (about as long as calling their bank would take) complaining that this is not their fault/problem/responsibility, says their bank will charge them for a copy, are we going to reimburse them?&gt;\n\nT:(unmoved) Sorry. We can't do anything further without it. \n\nAt this point 90% of them relent and agree to call their bank. The other 10% insist this isn't their fault and as far as they are concerned they have paid. \n\nT: K. Can I help you with anything else?\n\nC: No\n\nT: Have a good day. (Problem solved. For ME. I document their insolent refusal to cooperate and go about my day)",
        "created_utc": 1499829425,
        "upvote_ratio": ""
    },
    {
        "title": "It always surprised me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mqw6a/it_always_surprised_me/",
        "text": "[removed]",
        "created_utc": 1499824494,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy Secretary Loses Her Mind",
        "author": "linandlee",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mqoqg/crazy_secretary_loses_her_mind/",
        "text": "I work in the Accounts Receivable department for a smallish pest control company.  We don't have a web portal for payments so we have to personally call customers when their credit cards aren't working and  update them over the phone. It's unsecured and a pain but hey; it pays the bills while I'm in school.\n\nSo this lady has been behind on her payments for 2 months and our policy is generally lenient but at this point we are required to be a bit pushy. I'll be Me and CS will be Crazy Secretary. I call her cell phone.\n\nMe: Hello, this is linandlee from Company. Is Customer available?\n\nCS: She is not, can I take a message?\n\nMe: Yes, please. I'm calling regarding the month,day service. We have been trying to run the card for payment but it is coming back declined. Could you just ask her to call us back to update her information with us?\n\nCS: ...Excuse me?\n\nMe: She just needs to update her billing information with us. Could you have her call us back?\n\nCS: Why are you telling me her personal information?\n\nMe: Sorry m'am, she listed this as her personal number. I assumed you were an appropriate person to speak about this.\n\nCS: That is NOT how you leave a message. You leave a name and a number and THAT'S IT. She's in a meeting and has her calls forwarded to ME. WHAT IS YOUR NAME? WHO IS YOUR MANAGER? WHO IS THEIR MANAGER? WHO OWNS THIS COMPANY? WHERE ARE YOU LOCATED?\n\nMe: answers all of her questions and apologizes for the miscommunication\n\nCS: I am going to make sure you are reprimanded for this!\n\nMe: M'am I really am sorry but I had no way of knowing this. I'll make sure it never happens again.\n\n-10 minutes later-\n\nCS: No, you are a terrible company I'm going to-\n\nMe: -M'am, if you could just relay the message, that would be great. Goodbye. *click*\n\nI told my manager about it later and he laughed. \n\nFun fact: lady is still behind on her bill. And I make sure to be the one calling her every week.\n\n",
        "created_utc": 1499822153,
        "upvote_ratio": ""
    },
    {
        "title": "Why was this pmt made?!",
        "author": "Lawadnorder",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mqf6h/why_was_this_pmt_made/",
        "text": "So, they have me walking around, answering questions. I'm pretty happy about this, because I can help newer reps and create less work for us later. \n\nSomeone gets a call, and a pmt was made yesterday on her account. But she didn't schedule it. Well, shit, someone fucked up, and best we can do is do a pmt investigation. But, because her due date was 3 days ago the refund probably won't go through. Tell rep to apologize, explain that, and see if that will suffice. Go to help other rep. \n\nCome back, her account was overdrawn, are we going to reimburse her. Can't do it. Get a supervisor over, and she looks further into it. \n\nThis woman was on autopay. She did this to herself. Yeah, someone should have caught that before making the arrangement, but this lady is making my coworkers life hell because of her own error. Me and sup laugh about it, my coworker facepalmed, and I apologized for not seeing that sooner. \n\nIt was probably the best thing I've heard today. \n\nAlso, side note, my sup and sup that was brought in are pushing me to apply for a leadership role, and I'm pretty excited that they want me to do so. It feels good to be valued.",
        "created_utc": 1499819157,
        "upvote_ratio": ""
    },
    {
        "title": "A \"special\" employee",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mpdih/a_special_employee/",
        "text": "Me: Thank you for calling the medical center. How can I help you?\n\nNurse: Yes I'm a nurse at the medical center and I'd like to schedule an appointment for Dr. X and the Y clinic\n\nMe: Let's take a look into that for you. [verifies HIPAA] I don't see that you've ever seen Dr. X or been seen at the Y clinic. Are you a new patient? \n\nNurse: Yes I need to be seen as soon as possible. \n\nMe: Okay let pull up the schedule. I don't see you have a referral either so what were you wanting to be seen about? \n\nNurse: I'm at work right now and I'm not disclosing that. \n\nMe: Because I don't have a referral I would need to know why you'd like to be seen so I can confirm that Dr. X can see you. \n\nNurse: I can't! You'll just need to trust me. \n\nMe: I apologize but I need to follow my instructions so I can't schedule you without knowing what we're scheduling for. We're open till 7 so if you can call back at a better time, we can certainly schedule you later. \n\nNurse: No! I'm an employee and I need to be scheduled now! Transfer me to the clinic!\n\nTransferring to the clinic is generally against protocol but I got permission from my supervisor to do so after we had a laugh about this entitled nurse. \n\nClinic: Thank you for calling clinic Y. How can I help you?\n\nMe: Yes, this is UmbraCelestia from the contact center. I have an employee who wants to be scheduled with Dr. X at your clinic but I'm unable to schedule her because she won't disclose what she needs to be seen about. \n\nClinic: [looks at the chart] Uh yeah. Wow. I'll take the call but she's not getting scheduled. \n\nMe: ¯\\_(ツ)_/¯ yeah I didn't think so. Here she is. [transfer and click] ",
        "created_utc": 1499808529,
        "upvote_ratio": ""
    },
    {
        "title": "Lady refuses to pay anything less than what's in her bank account",
        "author": "Lawadnorder",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mk4sz/lady_refuses_to_pay_anything_less_than_whats_in/",
        "text": "I'm a pretty nice guy in general. If I can avoid making someone broke, I will, because my job is to secure service and payments, not force them to worry about their next meal. \n\nSo, our cx service team calls with a person who can't pay until August 1st. Great, an old person on social security whose going to throw a shit fit when I ask for pmt today. Have him transfer her over. \nCx is customer, m is me.\n\nM: Hi, I'm lawadnorder, can you verify your name? \n\nCx: yes it's [omitted]. \n\nM: Okay ma'am, so I understand you can't pay until August 1st, so let me... \n\nCx: no i need to pay today! I can't afford a late fee.[Long explanation about how bank lost $150 from her acct]\n\nM: Okay, how much can you pay?\n\nCx: I have 70 in my acct, but I know it won't cover the full thing. (She's now crying a little)\n\nM: well ma'am, let's see what we can do. \n\nSo I mute her and start considering everything. I can't make someone clear their account and have no money for most of a month. That's literally why people hate debt collectors, and I'm not really to concerned about my dollars per hour (I'm pretty damn good at my job, if I say so myself). So I come back on the line, and say we can do a pmt today. \n\nCx:Okay, you can use the card on file to pull the 70. \n\nM: ma'am, we only have to do 60, we can leave the rest for the 1st. \n\nCx: [more crying] but I can't afford to pay two bills at once (this is like a 82 dollar bill btw), and I just can't be late.\n\nM: ma'am, I can't take all your money. We can do 60, but I won't take more than that (never thought I'd say that in this job). \n\nAnd this lasted about 5 minutes. Her trying to pay all the money in her acct, me saying I can't do that to someone. Just back and forth trying not to hit the fuck it button. She just can't make herself pay less than everything she has.  Finally get into a discussion about donating plasma or work at a fair.. Finally process the pmt. \n\nM: [coming from verification and scripting stuff] and ma'am, what I'll do is make sure that any late fees are waived if you are late. That way you don't have to worry about that. \n\nCx: [once we started talking about plans of action, she calmed down considerably] thank you, so much. You have no idea what a relief it is that you'll do that\n\nM: it's really no problem ma'am, [launch into scripted ending, get interrupted so she can thank me again twice before disconnecting (I really don't like being thanked for being a decent person, so not trying to brag)].\n\nThis bill isn't due until the first of August. And this was a crisis for her. So, ma'am, I hope everything works out for you, wherever you are. You're the first person I tried to get a lower payment out of.",
        "created_utc": 1499749806,
        "upvote_ratio": ""
    },
    {
        "title": "Remind me to never again take \"one last call\"",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mjhyc/remind_me_to_never_again_take_one_last_call/",
        "text": "It's a tale as old as time. There's 1 minute left before you can officially clock out so you decide to chance it and take one last call instead of using a minute of your ACW. Is that call ever the sweet old lady who has a very simple request that takes exactly 3 minutes to grant so you can clock out and be on your merry way home in time? No, that \"one last call\" is always a raging asshole who keeps you there long after your shift ends moaning and complaining about shit that isn't your problem nor do you care but that doesn't stop this guy! In fact, it encourages him. This is one such story. This guy kept me 25 minutes after I should have been off. \n\nFor the sake of my typing fingers, anytime I say: patient proceeds to bitch and moan, picture something along the lines of \"omg I can't believe this! How is it that you can't get me in anytime sooner? This is ridiculous! I know it's not your fault but I'm going to bitch at you like it is even though you can't do anything about it!\"\n\nMe: Thank you for calling the medical center. How can I help you? \n\nPatient: Hi I'd like to schedule a few appointments. \n\nMe: -already regretting my decision- Sure let me get your chart pulled up. -verifies HIPAA- \n\nPatient: First I want an appointment with Dr. A at clinic 1.  I need to do a follow up. \n\nMe: So I have one appointment with Dr. A tomorrow at 3 if you'd like it. \n\nPatient: No I can't do that. What's the next one? \n\nMe: Well, this one tomorrow might have been someone's cancelled appointment because after that she's scheduled out until February. \n\nPatient: I know this clinic is usually schedule super far in advance but...-patient proceeds to bitch and moan- Can't you get me in with another doctor at that clinic?\n\nMe: (My unwavering instructions say to appoint with the established provider only) I'm afraid not. My instructions don't allow me to do that. I can send a message though to the clinic though and see if they can make an exception. \n\nPatient: -proceeds to bitch and moan- Fine! Let's make an appointment with Dr. B at Clinic 2 for another follow up. But let me guess? They're scheduled out at least a few months too like always! \n\nMe: -checking the schedule- Unfortunately they're a bit schedule out as well but I have two appointments in September if you'd like one. \n\nPatient: -proceeds to bitch and moan- \n\nMe: I'm sorry but that's all I have. Would you like one of those two appointments? \n\nPatient: Fine! Now I want to schedule an appointment with Dr. C at clinic 3! I should have a referral for this. \n\nMe: you mean the referral from 3 months ago? \n\nPatient: yeah sounds right. \n\nMe: Unfortunately this referral was closed a month ago because we called you and sent you a letter and never got a response. With this type of appointment, you need a fresh referral if you haven't been seen within 60 days of the referral being entered. At this time I can't schedule you but I can go ahead and send a message to the provider who sent the first referral to ask for a new one. \n\nPatient: -proceeds to bitch and moan- I want to file a complaint! \n\nMe: You can do that. The phone number to patient relations is 555-123-4567. \n\nPatient: Now I want to make an appointment with Dr. D at clinic 4 but I'm not disclosing what the appointment is about! \n\nMe: Fine please hold while I pull up his schedule. \n\n-2 minutes later- \n\nMe: I do have an appointment with Dr. D tomorrow at 4 if you'd like it. \n\nPatient: yeah give me that one and I just called patient relations from my home phone while you had me on hold. They didn't answer and told me to leave a voicemail -patient proceeds to bitch and moan- \n\nMe: I'm sorry sir but I really can't help you with that. That's a different department that takes those calls and it's very busy as it always is on a Monday so you'll need to leave a voicemail. \n\nPatient: -wastes a good 5 minutes of more time bitching and moaning about everything all over again- \n\n---\n\nBefore anyone decides to get in a tizzy, this guy knew and acknowledged that the first two clinics were always scheduled out and waited until a week before he was supposed to come in for his follow ups to actually schedule them and then proceeds to whine about us not having appointments instead of scheduling the next one on his way out the door from his last appointment like most sane people do. ",
        "created_utc": 1499741893,
        "upvote_ratio": ""
    },
    {
        "title": "Justice is served (for me)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6mi2qj/justice_is_served_for_me/",
        "text": "[deleted]",
        "created_utc": 1499726734,
        "upvote_ratio": ""
    },
    {
        "title": "Caller pretends to die during my call",
        "author": "antisarcastics",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6md7rw/caller_pretends_to_die_during_my_call/",
        "text": "A couple of years ago I worked for an info/complaints line for my state's public transport network. We helped people with information about buses, trains, ferries etc. and dealt with angry people too.\n\nOne time, a guy called up to say that he had just missed the 10.34 train to Sydney because he saw it leaving early  as he entered the station (at 10.32) and he wanted to lodge a complaint about this. I began to apologise in advance whilst I checked the schedule to find the train. It turns out that the caller was mistaken, and the train's scheduled time was actually 10.33, and so the train had closed its doors 20 seconds prior to departure and left on time, which is standard procedure.\n\nBasically I told the guy politely that his complaint could not be lodged (as it was invalid) and told him the next train was half an hour away. But he was still angry. He shouts that he's diabetic and he needs to get home because he hasn't brought any insulin with him and and asked me what my company was going to do about it. I tell him that the next train was at 11.03. He says 'But i might not even be alive by then!' I tell him that I don't know anything about diabetes but that if he is really concerned, he should hang up the phone and get a taxi or an ambulance or something. \n\nAfter a couple more minutes of ranting about the 'terrible train network', his speech seems to break up and his breathing becomes heavier. All of a sudden, I hear a massive 'clunk' as if the phone has been dropped on the ground and he's stopped talking. Working in a call centre had trained me to be rather cynical, but nonetheless I call out to him: 'Hello? Sir, are you still there? Hello, can you hear me?' Still, no response.\n\nAfter half a minute of nothing, I follow the standard company procedure when the line drops out, which is to say 'Terminating call due to a lack of response', and just as I click the 'disconnect' button, I hear a loud 'ahhhh fuck off maaaaaate'.\n\nHe literally feigned death over the phone to a stranger because of his own mistake reading a train timetable.\n\n",
        "created_utc": 1499675959,
        "upvote_ratio": ""
    },
    {
        "title": "IT call centre - 'I cannot press that button'.",
        "author": "WeeWillyHarris",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6m5via/it_call_centre_i_cannot_press_that_button/",
        "text": "I worked IT help-desk back in the early 2000-2001 but I remember this tale as if it was yesterday.\nA customer called to say he was reading an email and is clicking on 'No' and it wont go away. I asked what the email was and he couldn't tell me. He said he was on a webpage and keeps clicking 'No' and it wont go away! It was difficult to get more information out of him but he eventually told me he had two buttons on the screen a 'Yes' and 'No'. I asked if the same thing happens if he pressed yes, but he said he couldn't press it. \nSome 5 minutes pass trying to determine what he was having trouble with he eventually told me the webpage was asking if he had a small penis and presented only two options of yes or no.\nI put him on mute for a second while  laughed then reassured him it was ok to press yes just this one time.",
        "created_utc": 1499578648,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong number",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6m3c38/wrong_number/",
        "text": "To start with, this is my first Saturday shift and I'm stuck working Saturdays for quite awhile. I got 2 hours of sleep tonight and got cat called by some creep at the bus stop. I'm not fucking happy today but I'm doing my best to be patient but this guy is a special kind of stupid. First, this guy came in with a whisper saying he was calling for a particular primary care clinic and that's not who he was trying to reach. \n\nMe: Thank you for calling Medical Center. How can I help you?\n\nPatient: Yeah on the 4th a friend gave me a hug and I have infusions in my back so now my back is all messed up. I know I can't get in but can they put a scrip in for some pain meds? I'm a patient of Dr. Unfamiliar\n\nMe: Dr. Unfamiliar? Hmm let me look at your chart. [verifies HIPAA and pulls up chart and sees that patient's primary care provider is listed as Dr. Unfamiliar but I don't see the name anywhere on his chart which usually means it's an outside provider but he's also been seen at the pain clinic so I attempt to get clarification]\n\nMe: When you called in you called under the X clinic number. Were you trying to reach the pain clinic?\n\nPatient: No I'm trying to reach the clinic I'm calling now. I don't even go to the X clinic! Are you going to help me or not?\n\nMe: Sir I need to look at my instructions to help you and to do that I need to know which clinic you're calling for. Which clinic is Dr. Unfamiliar at? \n\nPatient: I told you! This clinic! Why aren't you listening?\n\nMe: Sir, like I said, you're calling the X clinic. I don't know which clinic \"this clinic\" is. \n\nPatient: Just help me! I'm in a lot of pain! This is bullshit!\n\nMe: Sir I'd love to help you but I can't help you without the answer to which clinic you're trying to see. \n\nPatient: Dr. Unfamiliar!\n\nMe: -sigh- Let me put you on hold and check some things. \n\nWhile he's on hold I google the doctor. Dr. Unfamiliar works for a clinic that is associated with the university we're associated with but is not one that I can do anything for as they have a whole separate system and software. Fortunately, my best friend Google also has the clinic's phone number. I generally won't transfer to these numbers because call quality goes way down when you go. \n\nMe: Thank you for holding. It looks like your doctor is at the Y clinic and that's one I don't have any way to send a message to. Would you like their phone number?\n\nPatient: just transfer me! You're so unhelpful!\n\nMe: I can do that if you'd like but I've been told sometimes patients can't hear the clinic after I've transferred. Would you prefer a transfer or the phone number?\n\nPatient: give me the damn number. \n\nMe: 555-123-4567\n\nPatient: that's the number I called! Are you kidding me!?!?\n\nMe: Sir the number you called was for the X clinic. You need the Y clinic and that's the number I have for them. \n\nPatient: No! I called THAT number! \n\nMe: Let me put you on hold and see if I can find any other number. \n \nPatient: -sarcasm- Yeah you've been soooo helpful! -muttering- stupid bitch\n\nAt this point I call the helpline. They tell me that the X clinic and the Y clinic are almost the same number but two numbers switched but to just cold transfer him to the Y clinic and let him be their problem. But fortunately he hung up before I could get back to him. Can't say I'm all that sad about it. ",
        "created_utc": 1499546499,
        "upvote_ratio": ""
    },
    {
        "title": "The call that made me realize how much I enjoy my job.",
        "author": "Falenstarr",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lyzwo/the_call_that_made_me_realize_how_much_i_enjoy_my/",
        "text": "I was going to comment this on a post from r/callcentres but realized it fit better here, and it turned into a whole post. as a heads up I am new to call centers in general and also new at posting, please forgive any formatting errors but any advice on how to make it better is appreciated. \n\nSo I work for my local communications provider (cable, internet, phone) as a tech support agent. Today I got this call about midway through my second shift (I work split, so 10-2pm and 6-10pm) it was a younger guy and once I get his name he starts on his whole angry spiel about how he's been calling all day and nothing has been fixed, he was supposed to get a call back after a few hours and didn't and now he was speaking to me. Naturally, to start de-escalating him I just let him ramble on for about 5 minutes until he gives me a chance to speak. Basically, the TL;DR of his problem was his ex was the account holder, he switched the account to his name (which for some reason means he had to set up a whole new account... my company is weird on that) and now he couldn't get his internet working with a walled garden error (basically the modem wasn't activated right) \n\nHe was upset that he had spoken to three other agents and no one was able to fix it to which I told him I would definitely take a look and get this resolved. As callers usually do \"I doubt it but we will see what happens\". while I'm trying to figure out whats wrong with his modem I'm listening to what he is saying and he is rambling about wanting to play PS4 on his day off and get him talking about games and such while I'm figuring out the error code (I've only been on the floor for about a week now haven't learned all the codes). I learn that the code basically means invalid MAC address and verify with him what it is, what he tells me is whats in the system but it's about 4 characters to long to be a MAC address. since his services were basically transferred to a new account and this only happened after that transfer I pulled up the prior account and pulled the MAC, apparently he has been giving the serial number to us...\n\nI asked him to watch his modem and tell me if it shuts off and turns back on. he freaks out saying \"I didn't know you could do that! you have all kinds of power man!\" (which was said in a happy tone surprisingly) As that's rebooting I check my logs and see no error codes (to which I mute my mic and do a little happy grunt). once it's finally online i have to pull my headset off for a second as my customer is screaming with joy that he is able to get online again talking about how he's spoken to 3 other agents and no one has been able to fix it and he spent twice as long on the phone with them as with me.\n\nHe starts saying \"You are awesome and I know these calls are recorded so Falenstarrs boss I've talked to 3 other people and no one has fixed this. Falenstarrs boss you need to give him a raise he is damn good at his job\" after a few more of those he tells me to make sure my sup listens to the call. after that I put in a \"Kudos\" ticket which basically is asking for sups or QA to listen to the call because a customer has complimented an agent and wants to give recognition, and then we say our goodbyes and disconnect.\n\nThis call has taught me 2 things today. 1) That even tho you deal with some angry upset people who make you hate your job, the few times you get calls like this will just make your whole week great. and 2) I work with some people who are less than bright who can't see simple mistakes like a MAC address being too long.  ",
        "created_utc": 1499487649,
        "upvote_ratio": ""
    },
    {
        "title": "Boyfriend caught cheating over the phone",
        "author": "JimmyJonCricket",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lyxxb/boyfriend_caught_cheating_over_the_phone/",
        "text": "I work customer support for a large bank in Canada and I got a rare call today. It lasted about 20 minutes. A woman in her late 20’s called in to ask about 4 transactions made today on her account that she has no recollection of. They were ranging between $50-100. I google search the websites in the description and 3 were those redirect websites for escort services and the 4th is for a book named \"How to build a better relationship\". I told her this and she replies \"My relationship is just fine I don’t know what that is.” We're both clueless so I started making a fraud claim so she can get her money returned. I ask her if she shares the card with anyone which she replies no. I went about 10 minutes into it before she said something along the lines of \"Wow my boyfriend’s cheating on me using my card.” That’s some pretty heavy shit, it took me off guard so I just said some typically awkward “Sorry to hear that” response. She continued to ask about the websites I found, finally she ends the call saying she now needs to go be the crazy girlfriend. \n\nI hope she gave him hell.",
        "created_utc": 1499486950,
        "upvote_ratio": ""
    },
    {
        "title": "SWEET RELEASE! (Or, How I Learned to Stop Worrying and Cuss Out a Caller)",
        "author": "WaulsTexLegion",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lwgkc/sweet_release_or_how_i_learned_to_stop_worrying/",
        "text": "Many moons ago, I worked for a call center that catered to several different clients, covering products ranging from public electric car chargers to small business phones to baby monitors.\n\nI worked there for 2 years, 1 week, and 1 day, and in that time, I was cross-trained into 7 different programs. One of these was a web sales support program, meaning that if someone had issues ordering a product from the website, I could help them order it over the phone.\n\nThe powers that be decided that coverage meant that as long as one person was on the phones, everything was fine. Because of this, my Saturday and Sunday evenings were usually incredibly busy with callers wanting to buy tchotchkes from the 6 or 7 web stores we supported.\n\n\n \n\n \nAll this setup is necessary, I promise.\n\nOne Saturday evening, around 8:30pm, I started getting back to back calls from people in regards to a certain domicile box office that shall remain nameless. Apparently, this company changed their planned show for the evening, and people wanted it fixed. The only number listed was our number that had no relation to programming. I kept getting calls saying to fix it, and people getting more and more pissed that I couldn't just push a button and make it work. Queue my blood pressure rising dramatically over the next half hour.\n\nThis was very stressful, and in the middle of repeatedly being belittled for not being able to magically make the TV work better, I received a call from a web store devoted to a certain classic rock band and all paraphernalia related to their long career. I'll be Neo, and the caller will be Stoned. Stoned sounded to be a male in his mid 40s, maybe early 50s.\n\n&gt; Neo: \"Thank you for calling the *insert rock band name here* webstore. My name is Neo, how can I help you?\"\n\n&gt; Stoned: \"Yeeeaaah, man, I just ordered like 3 albums for digital download, and I used my debit card. I'd like to listen to them tonight, but it's not offering me a download link.\"\n\n&gt; Neo: \"If you made the purchase tonight, the payment won't clear until Monday, and the link will become available then. That's because we can't exactly return a download.\"\n\n&gt; Stoned: \"Aw, man, if that's the case, I want to cancel my order.\"\n\n*Internally: CRAP. The cancellation dept. doesn't work on weekends. This is going to be fun!*\n\n&gt; Neo: \"Sir, I'm sorry, but the cancellation department is only open Monday through Friday, 8am to 7pm EST. I can put in the request, but you'll likely get the download link before the cancellation department will be able to process you cancellation.\"\n\n&gt; Stoned: \"Then I want my download link.\"\n\n&gt; Neo: \"Until payment processes, I can't give you the download link.\"\n\n&gt; Stoned: \"Then I want to cancel.\"\n\nTo spare my fingers, just re-read the last 4 quotes for 8-10 minutes. He really did keep repeating things back to me just to try and get a different answer. After 8-10 minutes, I finally got irate enough to snap.\n\n&gt; Neo: \"...\" I actually DON'T REMEMBER WHAT ALL I SAID AT THIS POINT. I was so angry that I'm pretty sure they were words. I spent 2 minutes screaming at this caller at the top of my lungs. I do recall near the end of my 2 minute rant, I did say 'dumb@$$ deadhead motherf*#$er'.\n\nAfter my epic rant, I fell into my chair exhausted. I figured I had just mashed the angry customer screaming back button about as hard as I could for the last two minutes. Instead, the line was dead for about 30 seconds. I was just about to hang up when I heard Stoned say:\n\n&gt; \"Dude, you either need to hit the bong or get laid. Jeezus man! No job should have you that stressed.\"\n\n&gt; Neo: \"What?\"\n\n&gt; Stoned: \"Yeah man, as much as you're carrying around on your shoulders, you won't make it to 40. Damn, are you okay? 'Cause, I don't want to get off the phone and then be reading about how you threw yourself off a bridge tomorrow. I can't imagine working in a situation like that.\"\n\n&gt; Neo: \"I've got to pay the bills, and this job did that.\"\n\n&gt;Stoned: \"Did? What do you mean did? I don't think -\" At this point, his wife walked in. \"Hey babe! Guess what?! This guy at the call center just cussed me out and it was f*$@ing EPIC!\"\n\nHe spent the next 12 minutes talking to me, just making sure I was okay. I even tried to check if there was anything else I could do, and he said not to sweat it, it'll wait, which made me wonder why he couldn't have had that thought 2 minutes into the call.\n\nAfter placating him and us having a good laugh together, we agreed to disconnect the call. About that time, he said something else.\n\n&gt; Stoned: \"Tell you what, if anyone tries to get you in trouble over this call, have 'em call me, and I'll tell them to F*$K themselves!\"\n\nAs a result of this call, I got fired the following Wednesday, and it was the happiest I had been in the 2 years, 1 week, and 1 day that I had worked that job.\n\nTL;DR: Customer is stoned and thinks that repeating the same two things over and over again will get the response he wants. I snap. Customer accepts that I can't do anything to help him.",
        "created_utc": 1499459465,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Jul 7",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lrskf/free_talk_friday_jul_7/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1499407576,
        "upvote_ratio": ""
    },
    {
        "title": "I will complain about you",
        "author": "Feralmoon87",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ljm0u/i_will_complain_about_you/",
        "text": "Hi everyone, first time poster so forgive me if there's any formatting issues. Just discovered this thread, thought I'd share a story.   \n\nI'll be F, the crazy lady will be CL and my colleague would be V.  \n\n(Cue Phone ringing)\nI pick up the phone and do the usual greeting  \n\nF: &gt; Hi this is (insert company name), this is F speaking, how can I help you today?\"  \n\nCL: &gt; F... ok F, i know your name now, if you don't do this for me, i will write in and complain about you.  \n\nNow i was obviously shocked, the client at this point had not introduced herself, nor given me an account number, but her first sentence to me was to say she would complain about me.  \n\nF: &gt; uhh ok maam, who is this on the line can I have your account number?  \n\nCL: &gt; I told your colleague V to do something for me, and he didn't do it, so if you don't do it, I wll write in and complain about both of you  \n\nF:&gt; ok maam, V is on leave today, he has not discussed your case with me, can I please have your account number so I can see what I can do for you?  \n\nCL gives account number, which i then use to pull up her details on my screen  \n\nF:&gt; ok maam, I am looking at your account now, how can I assist you  \n\nCL:&gt; what do you mean you don't know, I already told you, I told your colleague V to do it for me, and since he didn't, I'm going to write in and complain about him.  \n\nF:&gt; Maam, as I mentioned, V has not discussed you case with me, and he is on leave today. Why don't you tell me again what it is you wish to be done, and I will assist you with it.  \n\nCL:&gt; I told him to transfer the funds from my account back to my bank account after the transaction was done, and he didnt do it! so now i want to complain about him!  \n\nF:&gt; ok maam, your transaction just cleared today, I can help you do the transfer now, although please note the bank will have to process the transfer first, so it will likely only appear in your account tomorrow morning. How much would you like to transfer?  \n\nCL:&gt; I don't know...  \n\nF:&gt; excuse me?  \n\nCL:&gt; I don't know. I told V to transfer the funds from the sale that I did, I don't remember how much that was.  \n\nF:&gt; uhh ok, I see a total of 75 dollars ( yes all this was over a tiny transaction of 75 dollars) in the account, how much of that do you want me to transfer over?  \n\nCL:&gt; I don't know  \n\nF:&gt; Excuse me?  \n\nCL:&gt; I told you , I don't know! I told V to do the transfer immediately after the transaction, so how should I know how much that was?  \n\nF:&gt; Uhh ok, how about I just transfer the full 75 dollars over?  \n\nCL:&gt; ok do that  \n\nSo i proceeded to initiate the transfer, reminded her again about the 1 day processing time for the bank and asked if there was anything else. Thankfully there wasn't so I ended the call.  \n\nGuess what? The next day, a complain still came from her naming me and V. Luckily our phones are recorded and it didn't amount to any issue. but that conversation was really one of the highlights of stupid conversations for me over the course of that job.\n",
        "created_utc": 1499317320,
        "upvote_ratio": ""
    },
    {
        "title": "Wood - Now for Ducts!",
        "author": "bookphoenix",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lge2k/wood_now_for_ducts/",
        "text": "I take calls for a home warranty company. One of our service providers used wood to fix the ductwork. The technician who found it said, \"I'm not sure how much you know about air conditioners, but this is improper.\" Yeah, I have a thinking brain in my head. I may not have an HVAC license, but I know enough to know that ain't right!",
        "created_utc": 1499283490,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't you find her?!",
        "author": "musikluver13",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lftxo/why_cant_you_find_her/",
        "text": "I work as a switchboard operator at a hospital. My line receives calls for two hospitals in the area, but our network oversees several locations, as well as a handful of affiliates. Today I received a call from somebody looking for an employee. The conversation was mildly frustrating:\n\nMe: Thank you for calling, how may I direct your call?\nCustomer: I am looking for Deb in finance.\nM: Do you happen to know her last name? \nC: No, she's in finance.\nM: I don't see a Deb or Debra in that department but let me see if I can connect you with somebody else that can help you.\nC: HER NAME IS DEB AND SHE IS IN FINANCE, WHY IS THIS SO HARD?!\nM: Well, we have over a thousand employees in our network and probably 75 Deb/Debra's. Without a last name, I'm having a hard time tracking down the specific person you are looking for. I can certainly connect you with our finance department and maybe they'll have an easier time tracking her down for you.\nC: Why can't YOU find her?\nM: Please hold. \n\nI transferred her to finance and haven't heard back so hopefully they tracked down Deb for her! I swear there is not a Deb that works in finance that I know of. Oh well! ",
        "created_utc": 1499278520,
        "upvote_ratio": ""
    },
    {
        "title": "Customer wants to send via non existent bank, then gets mad when I tell her",
        "author": "escanor_hype",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lc8ob/customer_wants_to_send_via_non_existent_bank_then/",
        "text": "I work for a wire transfer call center services and I had a call from someone who wanted to send money to a certain state that didn't have the bank she told me to, it so happens that the bank she wanted to use operates in a network, which means that no matter the city, as long as her beneficiary collects at the bank of the same name he/she will be able to do so with no problem, I offered to select a different bank or to choose another city with the same bank while explaining how the network stuff worked, she kept insisting that this bank existed on the city she named but the system didn't show it, so at the end she got pretty pissed and said to just cancel the transfer, then I answer \"Alright, I'll cancel the transfer then, anything else I can help you with?\" Then she answers \"NO! YOU CANT HELP ME AT ALL!\" and hung up while I was in the middle of saying goodbye.",
        "created_utc": 1499234754,
        "upvote_ratio": ""
    },
    {
        "title": "Cross-post from TFTFD",
        "author": "youneedhowmanytowels",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lbc2d/crosspost_from_tftfd/",
        "text": "Disclaimer: I had originally [posted this on](https://www.reddit.com/r/TalesFromTheFrontDesk/comments/6laa5n/update_to_i_can_talk_to_you_however_the_fuck_i/)  /r/TalesFromTheFrontDesk and /u/writeandknow suggested I post it here! It's a 2-part story so if you haven't read the 1st one the link is provided below. Otherwise enjoy!\n\nSo on Saturday I received a very unpleasant phone call. For those of you who didn't get to read it [here's the link](https://www.reddit.com/r/TalesFromTheFrontDesk/comments/6kl5it/i_can_talk_to_you_however_the_fuck_i_want/)\n\nShortly after I received the call, I got a call from guest assistance (or so I thought). I didn't include it in the original story since it didn't seem too relevant until I spoke to my FOM about it. \n\nWhen I picked up the first thing they asked me was \n\"I'm calling from guest assistance and I just wanna make sure that the guest won't be charged a cancellation fee.\"\n\n\"What guest?\"\n\nNow, if any of you have ever dealt with guest assistance we know that they are very professional and would never forget to mention a guest's name. Normally their introduction would go more like, \"Hi my name is XXX from guest assistance. I'm calling because we have a guest under XXX and they just want to know if they will be charged a cancellation fee for their reservation tonight?\" \n\nI instantly got suspicious but I didn't want to go into sarcastic mode or anything like that in case it actually was guest assistance. \n\nThey finally tell me the name of the guest and I let them know about the situation and that they are no longer welcome at the hotel due to inappropriate behavior and attempting to break our policy. The \"agent\" then interrupts me and says that the guest told her that I was not letting her speak and that if I would've given her a chance to explain that she was going to tell me that she was going to stop by and give her credit card. \n\nThis also made me suspicious because guest assistance agents don't normally speak like this and the tone in her voice made it should like she already knew whose side she was on and it was the guests'. \n\nI explained that the guest was the one being rude and disrespectful and if she would've just told me that from the beginning all would've been fine but unfortunately her reservation will remained cancelled and she is still unwelcome at my property. Then she just reconfirmed that there would be no cancellation fee and ended the call. \n\nThis is when things got interesting. Any of you who know guest assistance at Milton also know that they open a file up for any incident regarding a guest. After explaining the situation to my FOM I also tell her that the person who called just didn't sit right with me and I wanted her to check if she had received anything. When she looks at her inbox there was absolutely NO file from them. Which means that this girl had one of her friends call and pretend to be fricking guest assistance. Like wtf. ",
        "created_utc": 1499222031,
        "upvote_ratio": ""
    },
    {
        "title": "Cross post- Update to: \"I can talk to you however the F*** I want!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lb9dk/cross_post_update_to_i_can_talk_to_you_however/",
        "text": "[removed]",
        "created_utc": 1499220987,
        "upvote_ratio": ""
    },
    {
        "title": "Cross post- Update to: \"I can talk to you however the FUCK I want!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6lb7p1/cross_post_update_to_i_can_talk_to_you_however/",
        "text": "[removed]",
        "created_utc": 1499220380,
        "upvote_ratio": ""
    },
    {
        "title": "He's not the president, he's a football player!",
        "author": "ayannauriel",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6l7si4/hes_not_the_president_hes_a_football_player/",
        "text": " So I am working today, phones are off for the holiday but I'm on email duty all day. We use a very popular ex-football player as a spokesperson for our products, he was our team's QB and he's well loved in my state. Most people will say \"cool\" or give us their opinion on his NFL days, but today I got the strangest comment ever:\n\n\"An (company name) ad recently came through my Twitter feed promoting  (retired QB) and therefore I will not support your product.  Unfortunately in this political environment this is a political statement and you have chosen to support a president who routinely disparages anyone other than Vladmir Putin. I will make certain my friends know your stance. Next time pick a non-political spokesperson. \"\n\nI'm sorry ma'am, he's a football player. Not the president, but thanks for your opinion. ",
        "created_utc": 1499182985,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, yell at me because of stuff that isn't my fault",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6l15f6/sure_yell_at_me_because_of_stuff_that_isnt_my/",
        "text": "Little bit of context here. In order for a provider to keep prescribing medication they need to see the patient at least once a year. All the clinics do send their patients letters ahead of time if they hadn't seen them in a year letting them know this and to please call to make an appointment if they need a renewal for their medication. Not sure what this guy's deal was but he clearly failed to do that so by law, they couldn't renew the medication until he'd been seen. \n\nMe: Thank you for calling Medical Center. How can I help you?\n\nPatient: Yeah, my rheumatologist took me off my medication, Generica and I couldn't get an an appointment until August and meanwhile they won't give me my medication. I need it! I need an appointment with my primary care doctor to get on that today! This is unacceptable to just take away my medication! \n\nMe: I'm sorry for the frustration. I'd be happy to take a look and see who can see you today. I see that your doctor is Dr. XYZ and the suchandsuch clinic, correct?\n\nPatient: Yeah but he's been on vacation so I've been seeing Dr. ABC at that clinic instead. But Dr. XYZ has been my doctor for 10 years. \n\nMe: I'll take a look at both schedules and see what we have. Can I place you on a brief hold while I pull up the schedule?\n\nPatient: [goes on a long winded rant about how we're just awful for taking away his meds and unacceptable and other excuses as to why he didn't pay attention to the letter that was sent to him months ago and boring irrelevant details] \n\nMe: Yes I understand. I'll take a look and see if we can get you in today. Can I put you on hold?\n\nPatient: Fine! \n\nAt this point I pull up his usual doctor's schedule and see an appointment that's 20 minutes from now. I also pull up the schedule for the doctor he'd been seeing in his PCP's absence and see she has a couple of later appointments and decide to offer both\n\nMe: Thank you for holding. I don't know if you can get in this soon or not but I do have an appointment with Dr. XYZ in 20 minutes or I have later appointments with Dr. ABC of that won't work. \n\nPatient: 20 minutes?!? Are you stupid? Why would you think I can be there in 20 minutes?!?\n\nMe: Sir please don't speak to me that way. I'm trying to help you. I don't know how far you live from the clinic and you stated that your preference was Dr. XYZ so I gave you that option but as o stated I have other appointments with Dr. ABC if that won't work. \n\nPatient: [goes on another long winded rant about how stupid I am for offering an appointment for only 20 minutes from now] \n\nMe: Sir do you want to see Dr. ABC or not today? She has an appointment an hour from now if you want to be seen then. \n\nPatient: Fine but you people are useless! \n\nMe: I have you appointed for today at 10am with Dr. ABC. Is there anything else I can help with before I transfer you to hear the prerecorded disclosures?\n\nPatient: Prerecorded disclosures? You mean to tell me my appointment is in an hour and you want to waste 20 minutes of my time listening to disclosures?!?? (This is a lie, the disclosures take like 5 minutes tops) \n\nMe: I'm obligated to transfer you but you're more than welcome to hang up if you don't want to hear them. [At this point I transfer him without another word because I'm sick of his shit.] \n",
        "created_utc": 1499101440,
        "upvote_ratio": ""
    },
    {
        "title": "A conversation with a salty lady",
        "author": "elixirdreams",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6krfdp/a_conversation_with_a_salty_lady/",
        "text": "Hi TFCC!\n\nI work for a law firm's cc. My department handles customer service, we let people know if we can help. We're not allowed to give a reason if we can't but we do provide a few resources to help them out. Some people understand, others don't.\n\nToday I talked to Salty Lady, and she didn't take rejection very well.\n\nSL: Why can't you help me?\nMe: I'm sorry ma'am, I'm not at the liberty to offer that information, but I can provide you this resource that could help.\nSL: So you can't help me just cause you can't help me?\nMe: Unfortunately so.\nSL: Well you know what? You can kiss my ass, how about that? Whore!\n-click-\n\nI thought it was hilarious what she said, just got upset by not being able to hang up on her myself since she beat me to it.",
        "created_utc": 1498968631,
        "upvote_ratio": ""
    },
    {
        "title": "Top stories from June",
        "author": "Fiddlestix22",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kpqok/top_stories_from_june/",
        "text": "The top story in June belongs to... u/writeandknow with [\"You want me to help evict you underage son? Fine, let me get you arrested in the process.\"](https://www.reddit.com/r/talesfromcallcenters/comments/6fej28/you_want_me_to_help_evict_your_underage_son_fine/?st=J4LTMJXI&amp;sh=a6bc4e37)\n\nOther honorable mentions include: \n\n2. u/writeandknow for [\"I demand you pay my husband's speeding ticket!\"](https://www.reddit.com/r/talesfromcallcenters/comments/6js0ag/i_demand_you_pay_my_husbands_speeding_ticket/?st=J4LTOSW9&amp;sh=92c26b90)\n\n3. u/eatoutmore for [\"I want to speak to the president of the company... Oh so he doesn't have time for his customers????\"](https://www.reddit.com/r/talesfromcallcenters/comments/6g1ij4/i_want_to_speak_to_the_president_of_the_company/?st=J4LTRNSG&amp;sh=20d39da7)\n\n4. u/kitjen for [Not enough Joseph](https://www.reddit.com/r/talesfromcallcenters/comments/6eugkj/not_enough_joseph/?st=J4LTTD5W&amp;sh=a38562ff)\n\n5. u/MondoMunchy for [\"That's no excuse! You need to call this customer!\"](https://www.reddit.com/r/talesfromcallcenters/comments/6iemgi/thats_no_excuse_you_need_to_call_this_customer/?st=J4LTVBO1&amp;sh=59d0e431)\n\nThat you for your contributions!\n",
        "created_utc": 1498946290,
        "upvote_ratio": ""
    },
    {
        "title": "How many of your calls were used for training purposes? Just a high guy that wants to know",
        "author": "Hard_Hatrick",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6klulr/how_many_of_your_calls_were_used_for_training/",
        "text": "[removed]",
        "created_utc": 1498895823,
        "upvote_ratio": ""
    },
    {
        "title": "Let me just wave my magic wand and make appointments exist for you",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kkio9/let_me_just_wave_my_magic_wand_and_make/",
        "text": "Context: a lady calls in to schedule an appointment with her primary care doctor. This particular clinic happens to be pretty scheduled out just now. There literally aren't any appointments for brand new patients for months and established patients are scheduled out quite a ways too. Luckily, we have a clinic not too far away that has sooner appointments and there's a walk in urgent care so it's not like we don't have options. \n\nMe: Thank you for calling medical facility. This is UmbraCelestia. How can I help you? \n\nPatient: Yes I need an appointment with Dr. XYZ at the South clinic. My hand is hurting. \n\nMe: did you injure it?\n\nPatient: no it's just kinda sore. \n\nMe: okay let me take a look at the schedule. (Pops the information into the system) It looks like Dr. XYZ doesn't have any appointments until August 4th. Would you like me to check other providers to see if someone else could see you sooner?\n\nPatient: Well why do I have a primary care doctor if I can't see her?!? \n\nMe: I completely understand your frustration but this is what I have. You can certainly wait to see Dr. XYZ if you wish but she has no sooner appointments at this time. Would you like me to check the other providers?\n\nMe: No!\n\nMe: I can also check another clinic if you'd like. Our Slightly North Clinic isn't as scheduled out. \n\nPatient: That's ridiculous! I want to see my doctor next week!\n\nMe: I'm sorry but the appointments simply don't exist right now. If you'd like I can put you on the wait list and the clinic will call you if something becomes available?\n\nPatient: That's not good enough!\n\nMe: Well I'm sorry but your only other option is to go to the walk in urgent care clinic or go to another provider. \n\nPatient: Just get me an appointment for next week with Dr. XYZ! How hard is it just to write my name on the schedule?\n\nMe: Ma'am, with all due respect, that's not how this works. I can't give you an appointment I don't have. \n\nPatient: Supervisor!!!!!!\n\nI speak to a supervisor. Tell her everything I offered and of course we both have a good laugh that this lady wants us to make an appointment out of thin air for her hand owie. She tells me she knows it won't do any good but offer to send a message to the clinic and if she doesn't want that then she'll take the call. \n\nMe: Thank you for holding. Unfortunately there's nothing my supervisor can do about this either. I can send a message to the clinic for you to give you a call back and see if there's anything they can do but I can't make any promises that they can. \n\nPatient: Do that and I want to file a complaint! I should be able to see Dr. XYZ anytime I damn well please! She's MY primary care doctor! \n\nMe: I'll file a complaint with patient relations for you and ask them to call you as well. \n\n*click*\n",
        "created_utc": 1498875924,
        "upvote_ratio": ""
    },
    {
        "title": "An odd thing happen to me.",
        "author": "hartrl",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kjnx3/an_odd_thing_happen_to_me/",
        "text": "This was about a month ago.  I been meaning to post it on here. I had came back from lunch.  I set down and put my head set on and I had not auto in yet.  I see my phone out of the corner of my eye change.  I'm now not in any aux state.  I thinking maybe I'm late getting back from lunch and they are now able to log us out.  I hit my head set button and try logging back in.  It give me the sound of trying to dial out a wrong number.  I'm getting more confused. I hit auto in.  I'm auto in.  I'm still confused but I go with it.  Everyone else is getting phone call. I'm not. Suddenly my phone rings, it didn't beep it ringing out loud for everyone to hear. \n\nCoworker \" Answer it\" I hesitated and hit line one. My caller ID had a company abbreviations with Ford at the end. \n\nMe \" Thank you.......  My name hartrl.  How may I assist you\"\n\nCaller \"I would like to pay my car payment.\" Now I'm really confused.\n\nMe \" Sir I think you might have the wrong phone number this is [insert company name].\"\n\nCaller \" Oh uh I must have miss dial the number.\" He hangs up.  \nI set the waiting to see what happen next.  My phone ring with the same caller ID. \n\nI do my open as usual. \n\nCaller \"I need to pay my car payment\".\n\nMe \"I apologize but I think there something up with the system you have been my second call of some one needing to making their car payment and this is [insert company].\n\nCaller \"I called the number in my phone that I had stored for years.\"\n\nMe \"I apologize but I'd try calling back in a few minutes\" ended call.  \n\nI hit the head set but nothing. In pick the phone up and put it back on the receiver nothing, I'm still auto in.  I unplug everything from my phone and plug it all back in resetting my phone. Still I'm auto in... My manager is not around.  I'm clue less of that too do. I don't want to change spots.  So I find a working phone and switch it out. I told my manager he like you are not suppose to do that.  He see I'm on the tracker so he goes with it.  He yells from 5 cubicle away.  I can't hear him.  So I put my self in break and get up. I finally hear what he telling me.  I look over the phone is auto in.  I show my manager this and he proceeds to try to log the phone out but nothing it is still auto in. He unplugs it and leaves it there. \n\nI still don't have a clue what happen or why that  phone did that. \n",
        "created_utc": 1498865615,
        "upvote_ratio": ""
    },
    {
        "title": "Phonetic failure",
        "author": "slushtastic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kh194/phonetic_failure/",
        "text": "The one that sticks with me from working at [deleted] is when I was double checking the spelling of a customer's name. We hadn't been trained in the phonetic alphabet that I remember and I blanked on Q and said \"Q for ... quim?\". Luckily they didn't seem to know what the hell a quim was. I don't even know why I know the word, I had not been reading Victorian erotica just prior or anything.",
        "created_utc": 1498840344,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Jun 30",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ke5dv/free_talk_friday_jun_30/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1498802783,
        "upvote_ratio": ""
    },
    {
        "title": "A sweet surprise during my shift",
        "author": "SeeStolenVideos",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6ke1lb/a_sweet_surprise_during_my_shift/",
        "text": "On one of my first shifts where I currently work (a market research firm; we survey people over the phone) we were surveying the other side of Canada. It was a fairly average shift, and then I called this one lady. She picked up, and she sounded like she might have a cold, or was sick - it sounded like her nose was really stuffed up, and I'm fairly sure I heard her blow her nose once or twice. We went about the survey as usual, and then at one point I asked her if she had a cold. She told me \"No, I've been crying.\" My heart sunk for her. \"Aw, I'm sorry to hear that! Well, maybe we can talk about that a little bit afterwards.\" We continued through the interview, and then we made it to the demographics questions. There I found out her name was Julia, and she was about my age, maybe a year older or younger. As we finished the survey, I went off script a little bit.\n\n\"That's all the questions I have for you today, thank you so much! It was a pleasure talking to you, but if I can take a minute to talk about it, I don't know what you were upset about earlier, but everything's going to be alright. You're strong enough to get past this and get through this, and everything's going to be alright in the end.\"\n\nShe paused for moment, then said \"Thank you so much. I really needed that.\" At one point either before or after that, she joked about giving me her phone number, and although it was clear she was joking, and it would've been unprofessional to accept it, and she lived across the country, I seriously almost considered it for a second.\n\nAfter talking for about a minute, I said goodbye, and that I hoped she'd feel better. Her response just before I hung up was \"Goodnight, handsome.\" I blushed a little bit, I thought that was just the sweetest thing. That definitely made my night. I really like to imagine that one day the two of us will meet again.  ",
        "created_utc": 1498801184,
        "upvote_ratio": ""
    },
    {
        "title": "You handle their what?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kco21/you_handle_their_what/",
        "text": "[deleted]",
        "created_utc": 1498784063,
        "upvote_ratio": ""
    },
    {
        "title": "Goodbye from /u/TheDroolinFool",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kbplv/goodbye_from_uthedroolinfool/",
        "text": "[deleted]",
        "created_utc": 1498773690,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do you speak Spanish?\"",
        "author": "hende530",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6kbkdn/do_you_speak_spanish/",
        "text": "Hello! STL, FTP, I just saw a story on here that reminded of this one so I thought I'd share.\n\nI used to work at a lawyer referral service as an English/Spanish operator. I wouldn't know if the caller was a Spanish-speaker until I answered the call and they actually spoke to me so I'd answer all calls in English, then if they asked if I speak Spanish I'd switch. I had one such call from a Spanish-speaking gentleman, who'll be SS, and I'll be Me.\n\n**Me:** Lawyer referral, what county are you in? (this was a statewide service)\n\n**SS:** ...Do you speak Spanish?\n\nI tell him in Spanish that I do and the rest of the call is in Spanish. Per policy, I ask him where he is located and what kind of attorney he needs. He has an accent that I'm not particularly familiar with but starts explaining his situation and about 1.5 minutes into the conversation he says a sentence that I don't catch. All dialogue is in Spanish.\n\n**Me:** I'm sorry I didn't catch what you just said.\n\n**SS:** Do you speak Spanish?\n\n**Me:** Yes, I speak Spanish I just didn't hear what you said.\n\n**SS:** *Repeats himself, but says a word I don't understand.*\n\n**Me:** I'm sorry I'm not sure what that word means.\n\n**SS:** You don't know what [word] means?\n\n**Me:** No, sir.\n\n**SS:** Well then you don't speak Spanish.\n\n**Me:** (STILL in Spanish) Well then I guess I can't help you. *click*\n\nI had never gotten so angry at a caller so quick. Maybe I was having a bad day, who knows.\n\n\nEDIT: Formatting",
        "created_utc": 1498772310,
        "upvote_ratio": ""
    },
    {
        "title": "I guess I made him feel stupid",
        "author": "melodyann3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6k3sw8/i_guess_i_made_him_feel_stupid/",
        "text": "Hi again TFCC!\n\nAs I posted yesterday (I think), I always get this one customer who, despite me answering the call in Spanish asks me if I speak Spanish (ugh). I hate that so much.\n\nToday, I received a call transfer which was tagged in English so I answer as such. The guy just says \"I'm just waiting for someone in Spanish.\"\nMe (in Spanish): I speak Spanish, how can I help you?\nGuy (in Spanish): do you speak Spanish?\n-.-\nMe (in Spanish): but I AM speaking to you in Spanish \nGuy: ooookaaaayyyy???\nThis whole conversation is in Spanish so I can stop saying in Spanish lol\nMe: how can I help you?\nGuy: uhhh\nMe: how can I help you today?\nGuy: uhh\nMe: is there a problem?\nGuy: THERES NO PROBLEM\n-click-\n\nI guess maybe I couldn't hide my tone this time.",
        "created_utc": 1498685688,
        "upvote_ratio": ""
    },
    {
        "title": "Wait, what's your name?",
        "author": "bmmrn2018",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6k3nly/wait_whats_your_name/",
        "text": "I think this is my favorite story from when my husband Greg and I worked at the same call center. He worked across the building from me so I would stop by to say hi on my way to breaks, etc. He sat in a cubicle on the other side of a guy named Mark. \n\nWe were all three talking for a few minutes then Mark got an incoming call. Standard greeting:\n\n\"Thanks for calling XYZ, this is Mark. How may I help you?\"\n\nA few seconds later Greg got a call. Must have caught him off guard, and he had just heard Mark answer his phone so what came out was:\n\n\"Thanks for calling XYZ, this is Mark...I MEAN, GREG!\" \n\nCustomer: \"Wait...is it Mark or Greg???\"\n\nI just about died laughing and had to walk away before I snorted. His face was beet red. ",
        "created_utc": 1498684348,
        "upvote_ratio": ""
    },
    {
        "title": "DNC",
        "author": "MonochroMayhem",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6k0z2s/dnc/",
        "text": "[removed]",
        "created_utc": 1498660925,
        "upvote_ratio": ""
    },
    {
        "title": "\"I could buy you!\" Can't take working at a call center any longer.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jxif7/i_could_buy_you_cant_take_working_at_a_call/",
        "text": "[deleted]",
        "created_utc": 1498614963,
        "upvote_ratio": ""
    },
    {
        "title": "Pay my 6 cent late fee that is my fault!",
        "author": "Finlanderboy",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jxgdj/pay_my_6_cent_late_fee_that_is_my_fault/",
        "text": "Ok, so when I was working bill pay support I got an interesting call.\n\nMe:Thank you for...\n\nCaller:(interrupting)  My water bill was late and you guarantee  bills are paid on time or you pay the fee.\n\nMe:Well let me look up your account and I will help you as best I can.\n\n*We verify and such and I look over his account*\n\nMe:  Well you water bill was due on XXXXX and you sent the payment out the day after that.  Our guarantee says..\n\nCaller: I have been a customer of (his bank) for X years, and you want to tell me I do not know how your system works!\n\nMe:  Well we can call the water company and see if they will waive it for you.\n\n*Call the water company verify with them, they say no, but the late fee is only 6 cents.*\n\nCaller: I am sorry but it is the principle of the thing.  I do not pay fees or taxes.  You do not get anywhere is this country if you pay what everyone else does.\n\n*I look over his account out of curiosity.  I see he spends $1,200 a month on crystal therapy for his dog.  I now have no sympathy for the guy and upset by him*\n\nMe:  Well if I submit a request to refund this it will be denied because it show you sent the payment after the due date.\n\nCaller: That is unacceptable. Get me someone that will refund me fee that is your systems fault.\n\n*we politely go back and forth a few more times.  I call my supervisor over and tell him.  My supervisor decides to override all of our normal procedures and refund the guy.  He explains my time fighting with him and the time he will call back to fight us is not worth 6 cents.  I warm my supe this creates a dangerous precedence, but he shrugs it off*\n\nMe: Well Mr. X.  I contacted my supervisor and he told me he will personally work you refund and reimburse you.\n\nCaller:  It always goes that way, thank you.",
        "created_utc": 1498614359,
        "upvote_ratio": ""
    },
    {
        "title": "Down with the system",
        "author": "UmbraCelestia",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jw6rr/down_with_the_system/",
        "text": "Me: Thank you for calling Medical Center. This is UmbraCelestia. How can I help you?\n\nPatient: yeah I have a referral for dermatology and want to schedule. \n\nMe: Sure, let me look into that for you. [verifies HIPAA and pulls up the referral to see it was just put in maybe a couple hours ago and was nowhere near ready to schedule] It looks like this is still in medical review. They'll give you a call though when they're ready to schedule. Usually it takes about a week. \n\nPatient: The healthcare system sucks. \n\nMe: K :| anything else I can help you with?\n\nPatient: Nope *click* ",
        "created_utc": 1498601462,
        "upvote_ratio": ""
    },
    {
        "title": "\"NOT PLAY EMAIL!\"",
        "author": "Mango123456",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jvbgx/not_play_email/",
        "text": "When I picked up this call, the customer spoke a single word.\n\n\"Martha.\"\n\nI patiently waited a moment, saying and doing nothing.  He had not said the magic word.  And his voice was positively dripping with entitlement.\n\n\"Please,\" he added sheepishly after another moment.  \"Can I make possible for me please - ah, good morning - to talk please to Martha.\"\n\nI am trying to train them.  It is not working.\n\n\"Martha is not here today,\" I stated, while standing up and throwing a CAT6 cable over our shared cubicle wall at Martha to make her turn around, and putting my finger to my lips to tell her not to talk while I was on the phone.  I had a suspicion it was in her best interests to not be here today.\n\n\"Listen please carefully to me,\" spoke the customer.  \"This is Doctor Jenkins.  I like you kindly to convey a message from you to Martha,\" *[his voice dropped to a whisper]* \"not by voicemail, *and not by email*.  Just person-to-*perrrson*.\"  (He emphasized the second \"perrrson\".)  \"Can you do that?\"\n\nI did not answer right away, which caused him to state, \"You can do that!\"  I was not stunned.  Rather, I was typing what he had said as fast as possible.  I had a suspicion this call would be entertaining.\n\n\"Yeah!\" I said, *[my voice dropped to a whisper]* \"I'll meet her out behind the old warehouse on route 256 at two A.M.\"\n\nThere was another moment of silence, which gave me time to finish typing.\n\n\"Very well,\" Doctor Jenkins said, ostensibly deciding not to ask questions.  I wonder if he ever showed up behind some old warehouse on route 256 out of curiosity.\n\n\"I have asked Martha to find for me this...this...this...\" *[his voice dropped to a whisper again]* \"*informations*.  And, oh!\"  *[He whimpered a little bit.]*  \"I have found out that she is trying to find this *informations* for me by...by...by... *email*.\"\n\nHe positively spat out the last word.  I gave him some time to sweep it up off the floor while I finished typing.\n\n\"Oh?\" I said.\n\n\"Does not work.  DOES NOT WORK,\" stated Doctor Jenkins.  \"DOES NOT WORK!  Martha did not help me.  She could not help me, not with *email*.  I need very much her contact persons with this *informations* individually and ask for this *informations*.  And ask for this *informations*,\" he repeated, for clarification.  \"And then,\" he continued, \"she is to inform me about this...this...this...*informations*.  That's the fastest efficient way this can be handled.  I ask her contact me with this *informations*.\"\n\nHe italicized \"informations\" so much it was practically SIDEWAYS.\n\nDoctor Jenkins was not done.  \"I have a desparate need Martha will not simply *play with email*.  A desparate need.  She will just phone people, okay, okay, and talk to them personally, okay?  If and only if I can for the benefit of all the people to have this *informations*.  Without playing email!\"\n\nI couldn't help myself.\n\n\"I'm frightfully curious,\" said I.  \"Why can't I email Martha?\"\n\nDoctor Jenkins positively exploded.  \"BECAUSE I DON'T PLAY EMAIL,\" he screamed into the phone.  \"I NOT IN FRONT OF COMPUTER TO DECODE EMAIL!  I AM ON THE MOVE!  MOVING!  I DON'T HAVE COMPUTER IN *POCKET!*  SO IT WORKS BEST IF YOU SPEAK TO HER, PERSON-TO-PERSON, AND CONVEY THE MESSAGE!  THEN, YOU HAVE A *FEELING* IF SHE ON THE RIGHT TRACK AND DOING THAT.\"  He quieted down somewhat and decided to educate me.  \"You know, computer is robot.  It is better to express things than to leave the robot to talk.\"  He worked himself up into a frenzy again.  \"Not email!  Not email!  *Not play email!*  **NOT PLAY EMAIL!**  ***NOT PLAY EMAIL!***\" *[click]*\n\nI did not follow his logic, but since he had hung up, I could not ask for further clarification.\n\n\"So,\" I said to Martha, \"Someone calling himself Doctor Jenkins called and wanted me to tell you not to find the information out by email, and not to email him with it.\"\n\nMartha's response: \"F--k that.  I'm not talking to him.  I'm emailing him back and he'll just have to **deal**.\"\n\n\"What information did he want anyway?\" I asked, frightfully curious.\n\n\"Panini recipe,\" she called out over her shoulder as she walked off for her coffee break, leaving me no less curious.\n\nSeveral hours later, the same customer left a message on our voicemail, claiming his name was Professor Kevorkian.",
        "created_utc": 1498593570,
        "upvote_ratio": ""
    },
    {
        "title": "Someone in Spanish please?",
        "author": "melodyann3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jto5n/someone_in_spanish_please/",
        "text": "Hello TFCC! This is a very short one but it REALLY pisses me off because of how often it happens.\nIn my CC I handle the English and Spanish queue, and pretty much EVERY DAY I get this ONE Spanish call, and of course I greet them in Spanish and they say \"Can I speak to someone in Spanish please?\"\nReally?\nREALLY\nAre you really just waiting for a chance to speak so much that you can't even tell what language I'm speaking???!\nI don't know if they can tell I'm annoyed by the tone when I say \"I am speaking Spanish to you.\"",
        "created_utc": 1498579517,
        "upvote_ratio": ""
    },
    {
        "title": "A caller who needed some special assistance",
        "author": "TiredUnicorn",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jtnq6/a_caller_who_needed_some_special_assistance/",
        "text": "I don't remember if I've told this story here already but here goes.\n\nMaybe 12 years ago I was working as a supervisor at a call center. I had several floorwalkers/coaches, whatever you want to call them. Basically their job was to answer questions and take escalated calls.\n\nWe were all pretty much burned out and didn't much give a shit anymore. One of my coaches came over laughing to tell me about a call he had taken.\n\nIt was an escalated call and apparently the caller was a real asshole. He was not satisfied with the answer he got and wanted to further escalate the call to HIS supervisor.\n\n\"Yes sir. We actually do have a special department to handle callers like you. Let me get you transfered to the DT Department.\"\n\n\"DT Department?! What the hell is the DT Department?!\"\n\n\"Dial Tone.\"\n\nClick.",
        "created_utc": 1498579403,
        "upvote_ratio": ""
    },
    {
        "title": "Lazy Supervisor",
        "author": "Astralwisdom",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6js87h/lazy_supervisor/",
        "text": "I work as a dispatcher at a certain call center. Around 8 hours ago at the start of my shift I get a call that needs to go to the on call person. Simple enough usually. This time however, not so much. I was just able to clear the call 15 minutes ago. \n\nThis is the type of dispatch where you ring the on call person, wait a certain amount of time, try again, then move on to their supervisor. \n\nWell of course on call doesn't answer their phone or call us back. \n\nSo I ring the supervisor up and she says to me \"I can't take these calls, you will have to keep calling (on call person)\" \n\nMe: \"Okay! You got it, no problem!\" \n\nAnd that's what I did. I called the on call person every so often for literally my entire shift. After the first hour of this I was fully aware this on call was never going to answer or call back but what was I supposed to do? Ignore a direct order from a supervisor? I think not! \n\n35 calls to each of the three contact numbers and 8 hours later we get another call for the account! \n\nI decided to drop the previous order at this point and just start dispatch over again with this new call. Of course the on call doesn't answer and I ring the supervisor again. \n\nMe: \"Hey there, sorry to bother you again but we were never able to reach (on call person) for that call at 11:30p last night and we just got a new call so I wanted to let you know since you had instructed me to only keep calling (on call person).\"\n\nSupervisor: \"OH! I didn't think you wouldn't be able to reach her all night! This is not good! Let me see what I can do and I'll call you right back.\" \n\nNot 5 minutes later a different on call had called to clear both of the waiting calls. \n\nWell, sucks to suck, not my problem. I was just doing what I was told! Why did you not do that 8 hours ago when I first told you about the call? \n\nMalicious compliance is a bitch. Next time, do your job and get your workers shit together. \n\nThat's my tale, thanks for reading! ",
        "created_utc": 1498565296,
        "upvote_ratio": ""
    },
    {
        "title": "\"I demand you pay my husband's speeding ticket!\"",
        "author": "writeandknow",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6js0ag/i_demand_you_pay_my_husbands_speeding_ticket/",
        "text": "(*Back when I worked for a referral service, I got this gem. We referred people in poverty to resources: food pantries and the like. Some people called in with questions we had no resources for. Most were fine with it. Key phrase: Most.*)\n\nGuy: \"Hi, yeah, I got a speeding ticket and I was wondering if any agencies helped pay them off?\"\n\nMe: \"Unfortunately none do at this time. Is there anything else I can help you with?\"\n\nGuy: \"Nope, I'm fine. Thanks!\"\n\n(*It would've all been fine if not for his wife calling back two hours later. Since it was a weekend and I was the only one working I got her.*)\n\nWoman: \"Hi, I was wondering if there were any resources that would pay my husband's speeding ticket?\"\n\nMe *connecting the two calls mentally* \"Unfortunately no. You could always try and call some local churches to see if they would help but we currently have no resources on hand to deal with that.\"\n\nWoman: \"Well, why don't you?\"\n\nMe: \"I don't actually have control over what resources go into the database. We don't have any; that's all I know. Can I help you with anything else?\"\n\nWoman: \"Yeah! You can pay my husband's speeding ticket.\"\n\nMe: \"???\" \n\nWoman: \"I DEMAND you pay my husband's speeding ticket OUT OF YOUR OWN POCKET--\"\n\nMe: \"If you continue yelling I will be forced to terminate this call. We are a free informational resource. We provide information on resources that are available. I do not have any resources available to help with this.\"\n\nWoman: \"That's not what I said. I want YOU to pay THE TICKET out of YOUR pocket.\" \n\nMe: \"No. It is your husband's ticket and not mine. It is not my responsibility, and I am not obligated to pay it in any way--\"\n\nWoman: *Swearing*\n\nMe: *Click* \n\n(*She called back and complained to a supervisor later that week, but I'd already emailed my supervisor about what happened, so my supervisor told nicely told her she wasn't entitled to have anyone pay off her speeding ticket, and to stop calling. I guess she had tried calling back several more times.*)",
        "created_utc": 1498562474,
        "upvote_ratio": ""
    },
    {
        "title": "Compliment to end the day: good feels in a sea of BS",
        "author": "DrEmilSchaufhausen",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jqnfz/compliment_to_end_the_day_good_feels_in_a_sea_of/",
        "text": "I work one of 6 call centers of a major electric utility. Most days are calls wanting to set up new service, payment arrangements, report outages, and the like. \n\nToday I had screamed at a customer for the first time in my newbie 4 month history (\"You're denying me my right to speak to a supervisor!\" \"No! If you would stop yelling I said the supervisor will tell you the same thing I just did, but here ya go!\"). Followed by a pissed off farmer wondering \"why in the hell y'all are calling me while I'm working on my tractor?! Y'all sumsabitches better not be shuttin me off again!\"\n\nLast call of the day: guy starts off making sure he doesn't have an old balance so he can start service at a house he used to rent out but now he's moving into because he's getting out of assisted living after getting hit by a car. I usually roll my eyes and yadda through old debts and sob stories, but this guy was genuinely pleasant. No old debt, can start you today with a new deposit since it's been a few years since he's had service with us while he's been in the assisted living facility post-accident with a disability (checked his details: he's only early 50s. Told me the story, was heart breaking)\n\nReal chatty guy while I'm filling out the open order, but in a nice way. Stops me at the beginning *You said your name is Jenny? I have to ask,  just cuz you never know... You're not Jenny McCarthy?\"\n\nMe: *cringe smiling, eww seriously* \"No sir. Nor am I Jenny Gump, or 867-5309 Jenny\" (I've heard it all)\n\nCust: \"Haha... well I figured. But it's so nice that you answered right away and you're not a machine. You're very pleasant to talk to\"\n\nI could tell he needed someone to talk to since being in basically an old folks home just because of his injuries. He was a cool guy, so ATT be damned,  I'll give him my last 18 minutes. But I couldn't help myself with the smart ass comeback...\n\nMe: \"Not a machine? That's what you think! Beep boop bop!\" *giggle*\n\nHe cracked up and I spent 18 minutes on an open order that normally should take 4-5, but like I said, talk time be damned, I'll chat with this guy for my last call over squeezing another in. Plus my wrap/idle time was already bomb today so I could afford it. He told me about his semi-pro bowling career back in the day, his insane Rain Man-like trivia knowledge, I told him he should go kill it at a bar trivia night. All in all, I ended up wanting to have a beer with this guy and he left a compliment for my supervisor. \n\nI wish customer satisfaction feedback mattered more than it does. Lower talk time can't produce good rapport like this. But you all know that.\n",
        "created_utc": 1498541000,
        "upvote_ratio": ""
    },
    {
        "title": "Discontinued Service",
        "author": "WhitestHispanic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6joo9h/discontinued_service/",
        "text": "[removed]",
        "created_utc": 1498517984,
        "upvote_ratio": ""
    },
    {
        "title": "No supervisor for you!",
        "author": "TiredUnicorn",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jncn8/no_supervisor_for_you/",
        "text": "Guy calls in ranting and raving about holding 30 minutes and demands a supervisor almost right away. Typically, he does not need a supervisor; his problem is one I could fix, probably in 2 minutes max.\n\nMy supervisor won't take calls directly, as he manages things other than the call center and has better things to do. He will never pick up the phone and always allows the call to roll to voicemail.\n\nI mute the phone and conference Mr. Stupidyhead into the voicemail. A few rings later, I am delighted to hear \"THE VOICEMAIL BOX YOU ARE TRYING TO REACH IS FULL\"\n\nThe caller let out a scream of anguish, followed by a stream of curses, and slammed down the phone.\n\nOh well, it should only take another 30 minutes to get back through.",
        "created_utc": 1498505334,
        "upvote_ratio": ""
    },
    {
        "title": "Impatience Doesn't Pay",
        "author": "WaulsTexLegion",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jlj4t/impatience_doesnt_pay/",
        "text": "Good morning, TFCC.\n\nI used to work for a big Medicare Part D insurance provider during the 2012 open enrollment period. For those of you who don't know, Medicare has an open enrollment period that at the time of this tale was October 15 to December 7. During that timeframe, there was no such thing as downtime on the phones. It was back to back calls, all day, every day.\n\nOh, and because of call volume coming in, hold times of 2-3 hours were normal. As a result, callers were somewhat grumpy. Geriatric and angry aren't a pretty mix. So, on to our story.\n\nI receive the whisper stating that this customer is calling to enroll into our program. It's usually a fairly easy, albeit slow process. I'll be Me, he'll be CC.\n\nMe: \"Thank you for calling $BigHugeInsuranceCompany, my name is $WaulsTexLegion, how can I help you today?\n\nCC: (*in a continuous rant*) \"I'VE BEEN HOLDING FOR 3 AND A HALF HOURS! WHY CAN'T YOU TAKE CARE OF YOUR CUSTOMERS?! I'M SO PISSED OFF RIGHT NOW I WANT TO PUNCH SOMETHING! WHY AREN'T YOU SAYING ANYTHING?! ANSWER ME! C'MON, SAY SOMETHING! I JUST WANTED TO ENROLL, BUT IF YOU WON'T HELP ME, FINE, I'M HANGING UP!\" *click*\n\nI couldn't help it. I started laughing. It was just so stupidly crazily weird. I still get a chuckle thinking about how he must have felt after he realized that he had wasted that hold just to have to do it again.",
        "created_utc": 1498488549,
        "upvote_ratio": ""
    },
    {
        "title": "While he was fucking that Chinese whore!",
        "author": "Lawadnorder",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jhrzx/while_he_was_fucking_that_chinese_whore/",
        "text": "Some people just want to pay their bill, others want to get free service, and some people are this weird combination where they're considerate enough to let us know the bill isn't being paid for whatever reason. \n\nI get this call, and I've heard some funny shit. I've heard some ridiculous shit. I've heard sad shit. This was the first in all three categories. M is me, and WE will be elderly woman, keep in mind, she's quite angry. \n\nM: Thank you for calling [Company] my name is lawadnorder, may i have your first and last name please? \n\nEW: this is Elderly Woman wife of Cheating Spouse. \n\nM: I don't see your name on the bill ma-\n\nEW: No, because my husband doesn't have a [company] phone! I didn't give it to him! \n\nM: oka- \n\nEW: He must've gotten it in March when he was off FUCKING THAT CHINESE WHORE!\n\nY'all, I was stunned. This woman was easily 55+. She had an upper class way of talking. And she went full sailor on me. \n\nM- Alright ma'am, so-\n\nEW- I'm going to shred this bill, and I just wanted to let you know. \n\nM: Ma'am, you should probably let Cheating Spouse have the bill So he can pay.\n\nEW: Why? He doesn't have any money! I pay everything! Maybe if he'd apologized three months ago, I wouldn't ruin his credit!\n\nM: okay ma'am, just so you're aware, the collections process will continue-\n\nEW: I don't give a damn! It's not my credit, and he can suffer! [MFW](https://goo.gl/images/pJnDxc)\n\nM: okay ma'am, thank you for calling [company], have a great day.\n\nEW: You do the same (totally calm now by the by).\n\nGo into not ready and laugh maniacally. I can't stop. Laugh my ass out to the smoking area. Finally get done laughing. I can't explain why this situation hit me so hard. Was it because she was going to let a 64 dollar bill ruin his credit? Was it her inability to see that it would affect her? Was it just because of her phrasing? I don't know. Because it's honestly sad that their marriage is like that. But it was, and still is to me, hilarious.",
        "created_utc": 1498436586,
        "upvote_ratio": ""
    },
    {
        "title": "Don't text&amp;call",
        "author": "Chiefson_McChief",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/6jf720/dont_textcall/",
        "text": "So, I was working in a call center until last year as a student job, we did credit card processing. One of the cards we did customer service for was branded by a well-known German automotive club and was mainly used by longtime members of that club. As it is with those clubs, most members were older gentlemen that made a point of being polite (or whatever they thought that meant) and liked to do a bit of smalltalk during the call. Our guidelines for call times and such weren't very strict, so I usually could chat with them a bit and still meet the requirements.\n\nWell, one time one of them went on a monologue about his last holiday (or something along that lines) and I wasn't really paying attention because I was looking at my phone to read a message my friend sent me (yeah, I know). I answered the text, muttered some filler words to the guy during his speech and then wanted to finish up the call because the lines were filling and other callers were starting to wait. \n\nSo, with my mind appearently still in phone-mode, what did the ~70 y/o gentleman hear from his credit card company after he inquired about his credit limit and talked about how he wanted to go on holiday with it?\n\n\"Okay, cool bro!\"\n\nWell, a German version of that, obviously, but translated quite closely.\nYeah, he hung up quickly after that.",
        "created_utc": 1498407970,
        "upvote_ratio": ""
    }
]