[
    {
        "title": "The Ultimate List Of 6 Most Worst Programming Languages",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ielxw/the_ultimate_list_of_6_most_worst_programming/",
        "text": "[removed]",
        "created_utc": 1674375080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monkey Business: A Tale from the IT Trenches",
        "author": "newsgooseoffical",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10i38en/monkey_business_a_tale_from_the_it_trenches/",
        "text": "As a contractor for a major company, I thought I had seen it all when it comes to technical troubleshooting. But that all changed when I found a live monkey hidden in a customer's desk cabinet.\n\nI had been sent to a remote office to fix a routine printer issue and upon arrival, I was greeted by a seemingly normal but a little strange lady who had the printer issue. But as I began my diagnostic checks, I heard a strange rustling and scratching coming from one of the cabinets in her desk. I checked to see if the lady was watching me and opened the cabinet to investigate and was met with the shocking sight of a live monkey staring back at me.\n\nI was stunned, i quickly wrapped up what I was doing and reported it to the supervisor. After the supervisor and I went to confront her the lady was defensive and insisted it was just a toy, but it wasn't helping her case that there was noise coming from her cabinet.\n\nAfter an investigation, it was confirmed that the lady had indeed been keeping an actual living breathing monkey in her desk cabinet and she was terminated from her job. As for the monkey, I have no idea what happened to it hopefully it went to a good home.\n\n It's just another reminder of how wild and unpredictable the world of IT can be. I've been trained to deal with all kinds of technical issues, but sometimes the issues I encounter are just plain weird and unexpected. But it's all in a day's work, and I'm just glad I  could help resolve the situation, even if it was a bit of a monkey business.",
        "created_utc": 1674339219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Faulty touchscreen, 30k to replace",
        "author": "Twpak",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ht5xc/faulty_touchscreen_30k_to_replace/",
        "text": "[removed]",
        "created_utc": 1674313351,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the moments that reminded me why I love my job",
        "author": "nohobbiesoridentity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10heggk/one_of_the_moments_that_reminded_me_why_i_love_my/",
        "text": "So I get handed a laptop by this furious exec this morning and he's freaking out that his laptop's locked up again. We usually have a system in place for tech issues, but when an exec wants something, they just bypass it cuz of their 'RHIP' (rank has its privileges). So I start troubleshooting and find out the issue is just bad RAM. I replace it and give it back to the exec. But he's like 'I'm not taking it unless you're 100% sure everything's fixed.' I'm thinking 'I wanna punch this guy' but I just ask him what other issues he's having and write it down. He goes on and on about a bunch of stuff that's just 'run ccleaner' to me. So I take it back to my desk and clean out all the useless programs and data. Then I find a hidden folder that's 12GB and from 2014. It's just a bunch of pictures. We're supposed to delete personal pictures, but no one does that and I decide to move it to his desktop under a folder called 'Old Pics'. I give it back to him and he thanks me.\n\nAn hour later, he and his wife come over to my desk. She's crying and he's happy. I'm thinking 'oh shit, what did I do now?' But then she tells me that the pictures I found were thought to be lost. They lost all the pictures in a house fire. The whole IT department is looking at their screens with puffy eyes. My boss comes out and personally thanks me and even sends out a company-wide email with the CEO mentioning me by name and talking about excellence. I had to turn off my skype cuz of all the congratulations. My boss even let me take my lunch early because it was hard to work with all the messages.",
        "created_utc": 1674262369,
        "upvote_ratio": 1.0
    },
    {
        "title": "GIGABYTE G5 KC HELP",
        "author": "Joni_macarroni",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10he2wy/gigabyte_g5_kc_help/",
        "text": "My GIGABYTE G5 KC recently shutdown while i was playing. When i pressed the power button it turned on the green LED on the front but nothing happened. The next day i tried again and it turned on and displayed the message:\n\n\"CMOS Message\n\nA first boot or NVRAM reset condition has been detected. (If you continue to see this message, consult the system user's guide for more information.)\n\nPress Enter(OK)\" \n\nSince then it has been working and dying repeatedly sometimes after playing for hours, sometimes after just a few minutes. I tried unplugging the CMOS battery for a day and tried flashing the bios to the latest version but it still keeps suddently shutting down. Maybe i need a new CMOS battery? Any suggestions?",
        "created_utc": 1674261318,
        "upvote_ratio": 1.0
    },
    {
        "title": "HR asked me to do what now?",
        "author": "cubic_thought",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10h8pxk/hr_asked_me_to_do_what_now/",
        "text": "A long time ago in the land of pre-COVID, I was the lead developer for our employee review system and one day during review time I get an email from one of the HR people that went something like this:\n\n&gt; Could you please go into the review database and change &lt;employee A&gt;'s review notes where they say \"... &lt;supervisor B&gt; assaulted me ...\" to \"... there was an altercation with &lt;supervisor B&gt;...\" Or is there a way for HR to edit a review?\n\nI was just stunned. They had to have known that there was no way within the system to change what someone said in a review, that was something we made clear when designing it! HR could unlock a finished review and allow an employee or supervisor to go back and edit their own words, but there was no way for anyone to change another person's words. It would be an insane liability for that to be possible. Sure I could have accessed the database (though not the database logs), but what could have possessed them to think this was a request I'd actually follow? I spent a minute validating that the email was real before calling my boss in to look at it.\n\nAfter expressing our mutual disbelief that they would actually ask that, I asked if we should talk to the head of HR about this or someone higher. He decided on higher, so he has me forward the email to the CIO while he calls him on speaker. One short phone call and very not-happy CIO later, I'm told the issue will be \"taken care of\" and never heard of it again. Sorry I don't have a satisfying ending, I didn't know anyone involved personally, but everyone was still listed as a current employee in the system and the review notes remained unchanged when I checked back a couple months later.",
        "created_utc": 1674250138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Printer battery failure",
        "author": "CroMignonMan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10h2jxr/printer_battery_failure/",
        "text": "My dad had an 18-year old color laser printer that had gained quite a bit of personality. He had given up on the color option, but could still print black and white. He called me after he changed the toner because the printer kept jamming.\n\nI went over to take a look. I cleared the jams that kept occurring as I tested it - they were hitting right at the fuser.\n\nAfter a few such tests my dad then said \"I dropped a spare flashlight battery into it when I was changing the toner - could that be the problem?\"\n\nAha! But, knowing my dad, I asked \"Were you able to get the battery out?\"\n\n\"Yeah, it's right here.\" \n\nHmmm, \"Well that should be OK, then.\"\n\nI resumed testing, pulling various major components out to check for obvious issues. Then, after one such test, we smelled burning. That was worrisome. I unplugged the printer.\n\nSince the fuser is the likeliest source of burning I poked at it further and finally forced the rollers into a full rotation (I was being gentle before then.) Out popped a small cylinder of soft foam, with burn marks on it.\n\nPuzzled I showed it to my dad and asked if he had knocked any rollers or other printer parts loose when he had replaced the toner.\n\n\"No, no, that's not from the printer, that's the thing I keep the spare flashlight battery in. The battery was in it when I dropped it.\"\n\nWith the 'thing' removed the printer no longer jammed or smelled of burning, but it no longer printed clearly across the entire page, there were gaps. \n\nDad bought a new printer.",
        "created_utc": 1674235167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laptop help needed",
        "author": "Fit-Elk-3239",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10h13a5/laptop_help_needed/",
        "text": "[removed]",
        "created_utc": 1674231712,
        "upvote_ratio": 1.0
    },
    {
        "title": "The CEO",
        "author": "Hattix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ggitq/the_ceo/",
        "text": "Our story begins with an IT contractor. His company was responsible for the email system of a well known UK business, which had just closed all its operations and moved them to Singapore shortly before declaring support for Brexit. This was a minor topic of discussion at the time, most mainstream media unanimous in its support for this character and his views.\n\n&amp;#x200B;\n\nAnyway, this happened not long before the CEO and founder of the client company fired all his British staff in favour of Thailand. The CEO of this company, a very well known person, was AGHAST that his out of office message was only sent once to each recipient. This CEO prided himself on his tech-industry smarts and his ability as a negotiator, he liked to say he was always thinking far, far ahead and he understood how things work better than anyone else did.\n\n&amp;#x200B;\n\nHe called the support line and cursed his way up the chain until he reached our man, the main systems owner for the entire platform. Our man explained, or tried to, that it was working as intended, and the reasons why it was working like this, but our man was \"just a small person\" and \"anyone with vision would know all messages need a response\". Mr. CEO, winner of multiple innovation awards, reached our CTO.\n\n&amp;#x200B;\n\nOur CTO sent Mr. CEO a waiver to sign, which stated he was solely liable for any consequences, that he reads and understands the potential effects, which were listed. Our man protested, saying \"This cannot be what he really wants\", but the CTO said \"and it is what he has asked for. You will learn, in time, that you cannot say no to these people. They know best, until they learn otherwise. What you can do, is help them learn otherwise.\"\n\n&amp;#x200B;\n\nMr. CEO had, of course, won. This was his latest example of understanding better than everyone else. This was in late October.\n\n&amp;#x200B;\n\nDecember 28th. Mr. CEO calls our CTO's emergency line, at home, screaming down the phone. Why is email broken? Why won't it sync? Why does he have fifty thousand messages? Why can't he find any mail he was expecting from important people?\n\n&amp;#x200B;\n\nMr. CEO was a member of a very exclusive club of business leaders and politicians, where the business leaders would agree which politician did what and for whom that year, the meetings where they would smoke £500 cigars and drink £200 shots of thirty year Scotch.\n\n&amp;#x200B;\n\nThis group had a mailing list, a basic majordomo based service. It had been like that for years and years, because business leaders generally do not have any technical ability whatsoever. \n\n&amp;#x200B;\n\nEmails were sent to the majordomo bot, which would replicate them to all members. In this way, membership was centrally managed and nobody got everyone else's email addresses. The exchange went a bit like this:\n\n&amp;#x200B;\n\nMr. Corporate Bigwig &gt; Majordomo: Merry Christmas all!\n\n&amp;#x200B;\n\nMajordomo &gt; All: Mr. Corporate Bigwig says \"Merry Christmas all!\"\n\n&amp;#x200B;\n\nMr. CEO &gt; Majordomo: Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\n\n&amp;#x200B;\n\nMajordomo &gt; All: Mr. CEO says \"Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\"\n\n&amp;#x200B;\n\nMr. CEO &gt; Majordomo: Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\n\n&amp;#x200B;\n\nMajordomo &gt; All: Mr. CEO says \"Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\"\n\n&amp;#x200B;\n\nMr. CEO &gt; Majordomo: Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\n\n&amp;#x200B;\n\nMajordomo &gt; All: Mr. CEO says \"Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\"\n\n&amp;#x200B;\n\nMr. CEO &gt; Majordomo: Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\n\n&amp;#x200B;\n\nMajordomo &gt; All: Mr. CEO says \"Hey, thanks for your mail, but I'm out of the office right now. I'll respond when I get back.\"\n\n&amp;#x200B;\n\nThis loop repeated and repeated until mailboxes hit their capacity limit and/or Mr. CEO was blacklisted.\n\n&amp;#x200B;\n\nMr. CEO was not the only one who had 50,000 emails pending: Many members of the UKIP party, half the Conservative party, an ex-Australian US media baron, Russian oligarchs lots of business leaders and CEOs.\n\n&amp;#x200B;\n\nMr. CEO was the laughing stock of them all.\n\n&amp;#x200B;\n\nAnd Mr. CEO would \"end us as a business\" and \"sue us out of existence\". He went above our CTO to our CEO and founder, who promised him \"a solution within the hour\".\n\n&amp;#x200B;\n\nThat solution came in the form of a copy of the waiver Mr. CEO signed, which included \"I understand I have been warned of the possibility of a mail loop, which may cause my own mailbox and the mailboxes of others to become unavailable, and I accept all responsibility for this eventuality.\"\n\n&amp;#x200B;\n\nAlso included was a bill for the damage he had done to our systems and reputation, as well as a quote for reversing Mr. CEO's damage \"to the best of our ability\". The quote was PUNITIVELY high, seven figures, which included - as a line item, no less - \"1x Agreement not to prosecute Mr. CEO for damages under the Computer Misuse Act\"\n\n&amp;#x200B;\n\nThat quarter's results were unusually good.",
        "created_utc": 1674170412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Printing the wrong format",
        "author": "Slystaler",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10gedvv/printing_the_wrong_format/",
        "text": "So this is not mine but my coworkers story, who had to deal with it. Sorry for my English, as it is not my first language.\n\nWe are both working inhouse IT and normally don't deal that much with printers. But sometimes we get called because there are config problems (caused by users) or usage problems.\n\nHe get's called the other day, because the printer is printing in a weird format. The guy, who is calling, normally handles a lot himself, when it comes to minor problems, but this time it seems to be a not so common one.\n\nMy coworker gets to the printer and checks the format setting first and sees it is set to \"D5\". He checks every setting that could work and A4 (the format it should be) is nowhere to be found. He checks everything on the printer and resets some settings, but nothing changes.\n\nAt last he opens the container where the blank paper is stored. (He was not checking it before, as he had been given a page of the right format with the wrong print.) He checks and sees there are 2 stacks of A4 paper and the slider, that determents the format is set to D5... And you guessed it: after removing one stack and setting up the slider correctly, the printer worked again correctly.",
        "created_utc": 1674164978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tale of the missing hard drive",
        "author": "aellis1988",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10gcbf7/tale_of_the_missing_hard_drive/",
        "text": "First post so be gentle, plus I'm on mobile so apologies for the editing.\n\nI'm not in IT I work with large (3mx2m) printers, but as part of the job I usually have to deal with customers IT/network/storage issues too. The usual it connects to the printer so it's your realm.\n\nCue me, lovable printer tech, updating a customer who has a printer on a trampoline of a floor from their old windows 7 32bit spinning disc to w10 64bit on an SSD and upgraded ram.\n\nThe mechanical install goes as planned, dodging the exposed 240v plug and plugging in the SSD on a removable hot plug type sledge (push a button and it pops out). All standard kit we order from the factory, used it loads of times, all is good.\n\nI booted the new windows, sorted out the bios boot order, typical second hard drive install. I go about my other non computer upgrades on site for the next day and a half.\n\nThen low and behold the other day we get panicked tickets from the customer, the computers down and hasn't worked for days blah blah blah. In the industry that usually means they've been down an hour.\nI'm currently in another country, so I pass it onto my colleague who goes through some strange fault finding and is insistent on the ram being the issue, same with my manager and another colleague, I had only upgraded them from 4gb ddr3 1600 to 16gb. I find it strange that this would cause an issue days after I've left but I have to believe them as I'm not seeing it with my eyes.\n\nThe next day I'm on a video call with the operator, and ask them to turn on the PC. No SSD seen, it only sees the old HDD. Strange. Unplug the SSD and replug, it comes up first time.\n\nRight, issue found, the sled wasn't giving a good enough contact, most likely it was shaking loose from their floor.\n\nI talked the operator through removing the PC front the machine and plugging the SSD direct rather than through the sled, with a bit of double sided tape we got the SSD secure and working flawlessly.\n\nTwo fingers up to my boss and a free pint on the cards for me.",
        "created_utc": 1674160206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whiteboard Blues 3",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10g6mlk/whiteboard_blues_3/",
        "text": "Back to the college for another story. I tried to keep good relationships with the teachers having been a trainer once myself, and knowing the feeling of being the one standing in front of a room of eyes all facing forwards on you. I like to think this is one of the times it paid off.\n\n&amp;#x200B;\n\nAfter a long and troubled back and forth with the supplier I managed to get an amzing deal. We had several of the older model IWBs that responded to touch, which we got upgraded free of charge to the \"laser\" type ones with invisible beams crisscrossing the surface of the board. I trained the teachers receiving these on how they worked. \"It's like those films where you have to somersault and backflip through a laserbeam corridor to steal the crown jewels, but backward. The beams detect where your pen or finger are and match it to the action you're performing\"\n\n\"Do not rest anything like IWB pens on the bottom of the board, you'll throw it off\" - yes we got tickets, yes they got reminded.\n\n&amp;#x200B;\n\nTeachers, much like Garth from Wayne's World, fear change. Some would also be very positive and willing to test updates and new features given the time and opportunity to do so, very enthusiastically. But change, change is chaos. Change is the rending of garments and gnashing of teeth. Here be dragons, abandon all hope. Not even the most technically literate and progressive amongst them would have accepted the suggestion they walk into a room of teenagers with an unknown. I learned to say there would be time for training at the beginning of a sentence or I would be interrupted half way through it. \n\nAs well as the new hardware, the staff would need to be introduced to the required software update. And for their confidence make sure samples of existing teaching materials \"just work\". Cue much trepidation and reassurances. \n\nMe: \"If you really have a problem with them we'll just stick the old dodgy one back on the wall\"\n\nThat this comes as a relief to some of the teachers I hope underscores just how painful they found disruption.\n\n&amp;#x200B;\n\nDuring some college holiday downtime, one of our more change-sensitive teachers met the Installation Tech sent to fit them. She'd also been victim to the existing IWB's worst tempraments, she hated them. I can't express enough the stress for a teacher of a fault mid lesson. When I had them myself I had the knowledge to fix it and my delegates were IT professionals, some would even let out a cheer and we'd have a laugh about it as I sorted it out while ploughing on. For more traditional subjects and thirty odd 16 year old students, a fault is a crisis. There was only one thing worse to this Teacher. Change.\n\nInstallation Tech's job is to unbox goods, drill holes, mount equipment and naff off home. His skills for this I couldn't question. It's just a good job he wasn't in sales or support.\n\n&amp;#x200B;\n\nTeacher: \"So how does this all work then?\"\n\nInstall Tech: \"Just like the old one really but with laser beams\"\n\nInstall Tech waves his hand vaguely at the board. He picks up one of the IWB pens from it's tray and mimes writing. But he's not finished the setup, the projector isn't aligned. His hand flapping spawns an entirely unhelpful squiggle across the board and wall behind it. My short time as a trainer taught me a few things and internally I'm screaming. Demonstrations should be meaningful, relevant. They should not leave questions unanswered or create new ones. There needs to be confidence in the educator, from student and teacher alike.\n\nInstall Tech: \"See? Just like that\"\n\n&amp;#x200B;\n\nTeacher's hands start to visibly shake as she raises them to her temples. I scrape the C in GCSE Drama off the bottom of my academic barrel. I very much deserved that C. I do not mean that with pride. I step deliberately in between them to look directly at Teacher, turning my back fully to Install Tech.\n\nMe: \"Teacher! As you can see we're still finishing up here. Why don't we clear up and I'll make sure it's all ready to go, and then we can set aside some time for a session together to make sure you are completely happy with it, is that ok?\"\n\nTeacher isn't fooled at all. My powers of diplomacy are nothing before this woman, with decades of experience with the schemes and evasions of teenagers. She smiles, a wry grin that reminds me of my grandmother, puts a hand on my shoulder and with great exaggeration thanks me. She knows exactly what I'm up to.\n\nI keep my word, the rest of the rooms are complete and their teachers shown the basics haven't changed. No wheels reinvented. Some even delight at the new features of the software. Job's a gud'n.",
        "created_utc": 1674147101,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am famous for my time travel abilities.",
        "author": "WantDebianThanks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10fjb2m/i_am_famous_for_my_time_travel_abilities/",
        "text": "It was August, as I am sure all three dimensional creatures with an understanding of the subjective experience of linear time would agree. I had started with the company in March. I know because I was there when it happened. \n\nAt $Truck, as a part of the \"10-30 years of technical debt\" we had many staff who were running Windows 7 and quite a few were running 32 bit OS'es. As you can imagine, this made many people very upset.\n\nOne staff member had the right combination of importance, frustration, and \"knowing who to complain to\" to get bumped up the priority list. One PC image later, and a new computer is waiting for her before she gets in.\n\nThere was an issue with the keyboard's responsiveness though. While I was trying to make my escape (wanting to get new batteries) she talked about how weird it was that she was having this issue because the batteries were from last month and I had setup the keyboard only in October. \n\nI let her finish talking about how my apparent time travel abilities before getting her a wired keyboard",
        "created_utc": 1674078373,
        "upvote_ratio": 0.97
    },
    {
        "title": "The Bridge at Angry River #11",
        "author": "Nik_2213",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10f6hnx/the_bridge_at_angry_river_11/",
        "text": "previous: [https://www.reddit.com/r/HFY/comments/10ed0wo/the\\_bridge\\_at\\_angry\\_river\\_10/](https://www.reddit.com/r/HFY/comments/10ed0wo/the_bridge_at_angry_river_10/)\n\n== The Bridge at Angry River #11\n\nAfter a long breath, Staff Two Gennes husked, \"A 'Convention Alliance' ? There were whispers, nothing more, that they came from beyond Sylvan space, forced the Others' sudden retreat to core systems...\"\n\n\"Staff,\" I replied formally, \"Unless it is a bluff, and these three 'Light Cruisers' are bigger than our Battle-ships--\"\n\n\"It would still be L-14s and repeaters against militia armed with BoRat spears and crude muzzle-loaders...\" He nodded at my expression. \"Several Imperial 'Liberations' met such. Official accounts dismiss the slaughter as suppression of local banditry...\"\n\nOur sad eyes met. Yes, today, the studded club was certainly in the other hand...\n\nAgain, the comm-units chimed in unison, this time with the usual ring. \"Attention all Imperial forces on Kaaal-2: I am Staff Five, Gento, at North Port, now highest ranking in the Kaaal system. After conferring with Staff, Line and Eng, here and at South Port, I have determined that our situation is lost.\n\n\"The terms and conditions of our surrender are generous, much better than Imperials would offer--\"\n\n\"No ! No !!\" Shrieks from the back of the convoy cut across our comm-units. Silhouetted against the sunset, the Agent scrambled into the trailing Gevvy, screaming, \"Cowards ! Traitors ! Death before dishonour !!\"\n\nHe grabbed for the roll-bar's pintle-mount repeater. He worked the handle to charge it. He looked set to mow down Lines and Engs who'd stood from their road-side ditches, rake those still sheltering.\n\nCRACK !\n\nHe flew backwards off the intact Gevvy, dark blood spraying from his snout and his body-armour's joints.\n\nThe Line Four stared that way for a while, then turned, studied the loom of the ridge beyond the pale bridge. After a while, he walked towards us. Staff Two Gennes stood unsteadily, looking like a falsely accused citizen reprieved at the last moment. After a shaky breath, the Line Four said, \"Staff, our tactical position is untenable. I must recommend we surrender on terms.\"\n\n\"Logical, Line. Carry on.\"\n\n\"Staff !\" After a surprised nod, the Four turned to me, added, \"Three, you described that weapon as delivering 'one-shot hard-kills beyond expected range'. I will use this wording in my report, and credit you with the excellent assessment.\"\n\n\"Thank you, Four !\"\n\n\"Ancestors !!\" His snout twitched. \"As a young Line, I was rated 'Long Gun', now a rare speciality. Yet, at my best, I would have struggled to make that timely shot. It took the Agent like a Zinkle from the shell, spared us further loss...\"",
        "created_utc": 1674045745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes Sir",
        "author": "TigwithIT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ewsxm/yes_sir/",
        "text": "Typical project for hospitality. We have a few meetings with engineers, managers, and project managers. You have the go getter trying to make it happen or act like he is project manager, the IT guy just keeping things straight, and then the maintenance guy who is the real work horse doing it all. We ordered some wireless equipment and items for the rooms. \n\nEngineer A: So with the wireless we highly recommend a ceiling mount or not directly behind the TV since it could cause interference.\n\nEngineer B: Yea no problem we can just offset it to the right.\n\nManager A: Ok that sounds good.\n\nProject manager: Ok but do we REALLY have to put it on the ceiling or off to the side.\n\nEngineers: Yes.\n\nSo two more meetings later explaining that because they are using the wireless for VOIP phones, interference could really cause some irritating calls like static, in and outs, and other oddities. Finally we are on the same page. Today management and ownership did their walk through.\n\nMaintenance guy: Hey man just to give you a heads up the hanchos are in town you may have to move the access points, i know they need to be to the side so the phones don't have issues, you might get a call.\n\nEngineer B: No worries let me just come over there and confirm with them.\n\nI go on site. Talk with the GM and basically get a we really want it behind the TV or worst case ceiling. So i go to look at the situation which is a big nope. The PM walks in.\n\nProject Manager: Hey are you the guy who does some of this stuff. (he didn't recognize me)\n\nEngineer B: Yea i'm looking at what the GM wanted but in all the meetings with the engineers and everyone we specifically didn't want it behind the TV due to interference and it could cause issues.\n\nProject Manager: (he recognizes me) Hey Engineer B. Yea it looks like real shit though, the access point just sticks out at you and they don't want people messing with it.\n\nEngineer B: No worries it is just a screw anyways, but what about the interference and phones?\n\nProject Manager: Just put it behind the TV's it will be ok.\n\nEngineer B: Yes Sir, no worries it will be done.\n\nlater on a call....\n\nMaintenance guy: Yea man i know they really want to do this but you told us about the interference and we know what was said in the meetings.\n\nEngineer B: No worries man, they are more worried about how it looks, i'll do it how they want and if things go awry just come back and do what they want next. I can \"Yes Sir\" as long as they want to pay me and not listen\n\nNeedless to say their notes for the job now have the changed location of the access point per management. Meetings, meetings everywhere. But who listens in those?",
        "created_utc": 1674012796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scareware's attack was super-effective!",
        "author": "Soft-Questions",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10euvgl/scarewares_attack_was_supereffective/",
        "text": "[removed]",
        "created_utc": 1674007466,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm pretty sure the patient should not be doing the tech support.",
        "author": "Garetia",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10emuzi/im_pretty_sure_the_patient_should_not_be_doing/",
        "text": "[removed]",
        "created_utc": 1673988032,
        "upvote_ratio": 1.0
    },
    {
        "title": "It puts the wifi in the box",
        "author": "Baileythenerd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ei0jp/it_puts_the_wifi_in_the_box/",
        "text": "This is in fact, **not** a tale from my ongoing career in IT, but a small rant about my existence as my family's *personal* IT guy. \n\nI visited my dad to give him the new computer I built him- he now has the fastest email box in his neighborhood. (I definitely went overkill for him). \n\nWhile I was there my dad tasked me with helping him get his security cameras operating through the app on his phone so he can keep an eye on things while on a short trip. \n\nHowever, there are several problems-\n\n1. He has 2 DVRs\n\n2. They're a cheap off brand\n\n3. One of them is located in a **GIANT METAL SHIPPING CONTAINTER** that he's using as a garage at the moment. \n\nSo, for those of you who browse this sub for fun and don't do much IT- let me explain:\n\n**Wireless signals and big metal boxes are not friends**\n\nSo, we set about the herculean task of putting wifi where it don't want to be. \n\nWe ended up daisy chaining a couple mesh network nodes from his office to the wall adjacent to the shipping container\n\nTHEN we cut a hole in the shipping container, covered it with plastic and made a little shelf. We put the third node on the shelf so now it's repeating wifi INTO the container. \n\nAnd then we found out his DVR's wireless card is borked so I had to run a 50ft ethernet from the node to the DVR. \n\nSo now my dad has better wifi than me, and a better PC than me.",
        "created_utc": 1673976711,
        "upvote_ratio": 1.0
    },
    {
        "title": "When they swear they restarted it 3 times already",
        "author": "WinterSalary4288",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10eh80a/when_they_swear_they_restarted_it_3_times_already/",
        "text": "[removed]",
        "created_utc": 1673974824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pakistan Railway",
        "author": "CandleOld4049",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10edi60/pakistan_railway/",
        "text": "[removed]",
        "created_utc": 1673965487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boom ? Yes Rico Boom .",
        "author": "Awkward_Ad75",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10e8t2a/boom_yes_rico_boom/",
        "text": "  \n\n&amp;#x200B;\n\nPls ignore any typos and formatting. This story is second-hand from a buddy of mine.   \n Names changed for privacy reasons\n\n Ron = My buddy the tech-support-guy (works for company A)  \n Boss = Boss of Company A  \n QOwner = Quarry-Owner (good friend of Boss)  \n QEE = Quarry-Explosives-Expert  \n QSG = Quarry-Security-Guy  \n QIT = Quarry-IT-Guy \n\nCalm Morning in the IT-Office of Company A . Ron receives a call from Boss , usually not a good sign.   \n   \n \n\nBoss : *Hey Ron , Good News : QIT Just called they got some old Servers that need proper disposal as they have customer-data on them but got damaged beyond repair by a lightning-strike.* \n\nRon : S*o how is that Good News ? Those Rigs are dam heavy . How are we even supposed to get them into the office for disassembly?*  \n\nBoss : *So here comes the good news : QEE had the idea to blow them up and QOwner agreed as long as QSG agrees.*\n\nRon : *Ok so when are we going to do this ?* \n\nBoss : *We gonna drive* *out to the quarry after lunch.* \n\nRon : *Alright.*\n\n**3 Hours later at the Quarry**\n\nAfter a short talk they got to work throwing the Rigs from the Balcony of the office into the Quarry.   \n   \n \n\nQEE : *Alright Guys since QSG said we are only allowed to use 3KG of Dynamite I ve made the most of it that was possible so we got 6 Shaped-charges that should be enough for 3 servers so*  *one charge on top and one on bottom at the same time.*\n\nA few minutes of getting the Rigs and charges into place and everything is ready. They went Up to the safety-shack(or how ever u write that word) and blew the horn as per protocol to give warning for the following explosions .   \n \n\n***BOOM***\n\n***BOOM***\n\n***BOOM***\n\nOnly thing left of the Rigs where the Steelframes badly bent . A few pieces of Sheetmetal with hand-siced holes in them where also left .\n\nThat’s the story of how my Buddy got the chance to blow up some server-rigs. \n\nA little tip for life is : With enough explosives there is always a way. Even if there is a mountain in your path.",
        "created_utc": 1673950539,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's a good idea to back up your work.",
        "author": "scumotheliar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10e60yp/its_a_good_idea_to_back_up_your_work/",
        "text": "About 15 years ago maybe more we were tasked with switching a Government department to digital phones. These phones were extensions of a digital PABX in the capital city, they ran on something resembling ISDN. Any phone in any office in the whole state could ring another phone anywhere as if it was in the same room, all singing all dancing lots of bells and whistles, lots of buttons.\n\nWe were doing a couple of these offices a week in cities all over the place. Cablers would cable several offices over the weekend, then we would move in and mount the racks, unbox and label a stack of phones.  Then as waves of staff would head to the conference room for training on the new system we would move in and plug in and test each handset. This was all going well, but there was one woman that was too important to get out of her cubicle and go to training, she refused to move so we could set up her new phone, just continued hammering away at her keyboard. This continued until the end of the last day, she was the only one we hadn't cut over and she wouldn't move. I had a talk to the manager of the place and explained that if we didn't swap her over she would not have a phone as all the existing lines would be cancelled as soon as we finished, so he came out and told her she had to let us do the job, she was snakey as hell and didn't move, so I squeezed beside her and reached behind her computer to drop the phone cord down the back. Now at some time someone had replaced her computer and instead of firmly plugging the power in the plug was just sitting there, my guess is the computer bloke got the same treatment as we got and had to reach blindly around the back and do his best. As I reached around the back she still had whatever she had been hammering away at on the screen and as I just brushed the power plug I heard the unmistakeable sound of fans spinning down and a scream from her.\n\nBecause she had missed the training she had no idea how to use the phone so we copped a barrage of fault reports from her. She had to wait as it was obviously user error, the boss moved her to different desks but the faults went with her.  It took about three weeks before we were able to get back to her. I had to book a trainer especially for her.",
        "created_utc": 1673940233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online means it's using the Internet? What a country!",
        "author": "sweylyn1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10e1ve6/online_means_its_using_the_internet_what_a_country/",
        "text": "I'm not sure if this fits, but we'll see.\n\nThis is a very short one about my father using his 2 GB mobile data without him using anything that'd sue mobile data.\n\nDad: \"I received this SMS today that I had used up 80% of my mobile data, but I haven't used anything that uses mobile data.\"\n\nMe: \"And how am I supposed to know that? I'm not monitoring your  phone!\"\n\nDad: \"But I thought you'd know it.\"\n\nMe:  \"Again, HOW AM I SUPPOSED TO KNOW THAT?!\"\n\nDad: \"DON'T SHOUT AT ME! JUST TELL ME WHY I USED MORE THAN 80% OF MY DATA!\"\n\nMe: \"HOW AM I SUPPOSED TO KNOW THAT?! I HAVE NO IDEA WHAT YOU WERE DOING ON YOUR PHONE!\"\n\nDad: \"I was just reading the news and listening to the radio.\"\n\nMe, after checking his phone and finding an app named \"Online Rádió\": \"Which radio?\"\n\nDad, after opening the online radio app: \"This one.\"\n\nMe, confused: \"And you're asking me what used up 80% of your mobile data?\"\n\nDad: \"Yeah.\"\n\nMe, pointing at the online radio app: \"This.\"\n\nDad: \"But I thought it doesn't use the Internet.\"\n\nMe: \"Which part of \"Online\" do you not understand?\"\n\nDad: \"But-\"\n\nMe: \"The phone's built in FM Rádió app doesn't use the Internet. Use that.\"\n\nDad: \"But its reception is awful!\"\n\nMe: \"Either that or you will soon use up your mobile data.\"\n\nDad: \"Can't you do something about it?\"\n\nMe: \"I can uninstall the Online rádio app, so that you won't accidentally use it.\"\n\nDad: \"No, don't do that! I need it because the other one's reception is awful!\"\n\nMe: \"Then there's absolutely nothing I can do.\"\n\nI don't know how could he think that an app that's literally has \"online\" in its name wouldn't use the Internet. He speaks a little English and I can't imagine him not encountering the word in, at least one of, the articles.",
        "created_utc": 1673927019,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 4",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10dubfj/the_airport_part_4/",
        "text": " Alright another adventure during my time at the airport for you to relate to or enjoy.\n\nWhen I started at the airport all those years ago, we had a major initiative to virtualize like most places today. A few projects over a couple of years and we had a very solid, stable setup with a good backup and DR plan. We also had a very robust network on our campus where every switch had redundant connections to the cores or a redundant edge switch.\n\nWe had a common virtualization platform and they were nice enough to throw in some complementary VDI licenses with our regular subscription. So management thought it would be a good project to go virtual. I will point out that none of the executive level went on VDI, but it was good enough for all of my other cooworkers. In our case, 50 VDI licenses gave management a good *view* on the *horizon* to complete our virtualization efforts and it just so happened it would cover all of our desktops. So when we had to upgrade to Win 7, it was done through VDI.\n\nI hate VDI and it was a pain in the ass from the get go. The amount of tailoring, licensing, and upkeep on that product was nuts. At first I was kind of excited about it, but after a couple of months working with VDI, I ended up thinking it was junk. The trouble trying to software to work on it, get roaming profiles and/or folder redirection working and stable, and disconnects to stop was unreal. There were additional products to buy to further complicate or “better manage” your setup with stuff like application virtualization and other fancy stuff. It was a major money pit if you ask me, like my house. During the initial days of the project I dreamt I was a PCoIP packet that was getting dropped and I had to figure out why. Anyway, after several weeks of trial and error, I got the VDI environment performing pretty solidly. At least good enough to not rip it out and just buy desktops. More expertise gained to my already full brain.\n\nBefore I get hated on, I am not saying VDI doesn’t have its place in the world. I can see it for education, libraries, hospitals, and other large environments with a lot of repetitive builds. I just didn’t feel it was justified for our smaller workforce. We had a hugely complex environment, but the internal network was nothing special. I didn’t feel further complicating our already complex setup was warranted, but I got overruled. This was just my experience with it and my own opinion.\n\nAt some point years into virtualization and a bit of time into VDI, I was having a problem with our backup system taking snapshots of the VMs. All of a sudden, it was taking a ridiculous amount of time to snapshot something that should’ve taken seconds. The snapshot delay caused weird latency issues that it was starting to make VMs unreachable for periods of time causing errors with other systems. I remember a few days before I became aware of this problem, I ended up having to defrag one of our DCs on New Years Day. I wasn’t on call, but defragging your PDC a couple of mimosas in when you are the only one who can is a challenge. Too bad I can’t put that on my resume as an example of performing under pressure.\n\nAfter the holiday, I did some research into the problem and I found the issue affected the building our hypervisor hosts were running and a patch had been released. I checked the release notes on the patch and didn't find any reasons for alarm so I went ahead and applied it to our hosts. After the patching was done, I took a backup of a VM and the issue seems to be resolved. I also test VDI connectivity and transferring VMs to different hosts without an issue. I rebuilt a couple of the VDI VMs in the pools and once again confirmed connectivity. Lessons in VDI had made me extra paranoid about it. Everything was looking good.\n\nA couple of hours later I get a call from operations about people getting disconnected from the virtual desktops on their zero clients. Sure enough, when I go to connect to the VDI environment from my fat client, it doesn’t work. Same result with a zero client.\n\nI give the VDI product support a call and am on the phone with them for hours and hours. I tell them the patch I applied and all that crap. I told them it didn’t list this as a known bug or anything like that. They are utterly useless. Several hours in, it was past my bedtime and I already missed dinner with my family again because of this stupid product. At this point, I told the product support engineer I was just going to upgrade the VDI environment and hope for the best. So I just hung up on the guy and got to work. \n\nSeveral hours later, the VDI environment is upgraded to a newer version and the pools are rebuilt with the updated parent builds. I think by this time, we are a few minutes into the next work day. I was able to connect to a virtual desktop via the fat client and I am very happy about this. I was about to go home when I realized I didn’t test connectivity out on a zero client. Sure enough, the zero client connection doesn’t work.\n\nAfter some additional research, I realize all 45 of our zero clients need to be flashed with new firmware to support the new version of the VDI environment. At the time, I didn’t have the management tool to update all of the zero clients because it was one more thing to maintain. Luckily I had all of the zero clients on their own network segment so I can easy to identify them with a ping sweep.\n\nFast forward a few more hours, I have all of the zero clients flashed with the new firmware and confirm them to be working once again. So luckily by this time, I was able to go home and take a short nap before it was time to get up and help the wife with the kids for the morning. I didn’t go to work the next day except for a few calls I had to take, but by this time in my career at the airport, this type of thing happening to me wasn’t uncommon so I had a routine down. Basically I fought to stay up the rest of the day, with coffee as my ally, until the early evening after dinner and then I would pass out for the night.",
        "created_utc": 1673907566,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want my old computer",
        "author": "flashG2009",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10du2gd/i_want_my_old_computer/",
        "text": "So I used to work at an office supply / electronics  store doing computer repairs. Basically, set up new computers for customers, diagnose and advise for shipout for part replacement (we were not supposed to replace parts in store)or backup, and reinstall windows.\n\nOne day after an electrical storm, a customer comes in saying that lightning hits the power pole outside his house, blowing the transformer and cooking all the electronics in the house. The electrical company said they would replace everything, just send them the receipt. \n\nThe customer has an old refurbished computer he purchased from us a number of years earlier,  we get it on the bench to see if it's just the power supply or not. No, it's also the main bord. We contacted the customer and recommended a new computer.  No, He wants us to send it out to have the main board replaced.\n\nSo we ship it out\n\n Now company policy is like for like replacement only.  Are repair depo calles and said they can't source the bord  anywhere.  They recommend a new computer to the customer.  No, he wants it repaired, so they sent the main board out to be repaired.  No luck. It's too fried to be repaired.\n\nThe computer is shipped back to the store. The customer picked up the computer screening at us how usless we are. He ended up going to a big box store that sold computers and purchased  a new computer from them and had to set it up himself. I dont know if he was able to get the data of the old hard drive at the end od the day.",
        "created_utc": 1673907034,
        "upvote_ratio": 1.0
    },
    {
        "title": "We've been HACKED!",
        "author": "CanisZero",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10dptgj/weve_been_hacked/",
        "text": "[removed]",
        "created_utc": 1673899349,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Frankenprinter (don't trust the accountants)",
        "author": "LampeterRanger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10dpf9e/the_frankenprinter_dont_trust_the_accountants/",
        "text": "This is not a continuation of Bob's story. Bob is still a mystery, but thanks to whoever posted the St Augustine suggestion as that seems to have done more good than anything else we've tried. No this is the Frankenprinter. \n\nI work in a college printshop, with the high performance printers, where we handle all the big jobs, anything that needs lots of finishing, and anything staff are too lazy to handle themselves. In addition, there are smaller  instruments of evil (Office MFPs) for each department. Maintenance for those is mostly ITs job, they handle software, networking and stuff like that. We in Repro get a call before they call in the outside printer engineers because we're trained to do some hardware fixes.Staff are trusted to change toners and paper themselves. Thus story is how I learned that may be too much rope for them. \n\nOne particular problem  keeps getting bounced from IT. It's user $Mick and he is either the laziest or most inept person on the planet. Toner run out? Ring IT and ask them to change it. IT says its a Repro issue because Repro has the toners? Call Repro and ask them to come down and change it. Naturally we refuse, as though we supply the toners staff have previously complained we've mucked up their settings when we change them. it's their bed, they can lie in it. \n $Mick doesn't like this and insists we come out. \n\nWe let this go on for a while since Mick's colleagues usually sort the problem. Then Friday 13th happens. I'm alone in my office on Fridays. Yes me, an apprentice, is left alone for a day a week. My day started to be ruined when our paper delivery failed to arrive. We run out of paper to give to staff and i put a note up. I leave for lunch, and lock my office. Relevant aside, if we have a lot of printing for the same person, I'll put it in a paper box, which is clearly marked with the staff members name and department. \n\nI return to find two things, a paper box missing (no big, I guess someone picked it up using next door's spare key), and an urgent message from IT \"You gotta see this! It's a you problem, bye.\" (paraphrased). The reference was $Mick's department office.\n\nThis poor printer. It had red lights all over it, and was making a funny noise. I open it up, noting the lack of any error numbers, just \"call service rep\". This is not normal. I open the toner bay. I find a toner for a completely different printer stuck in there and they are not interchangeable. it's made a mess of the whole bay, but somehow it is dispensing toner. I clean up what I can, make a note of the shattered plastic, and prepare to call the engineers for a conversation that will cost me dignity and the college 5 grand. But I knew there must be more seeing as it had been reported to IT that it was printing two jobs on one page, which us downright weird. I open the scanner unit, to find a massive gouge taken out of the glass plate. unsure of how that happened I log that too. That doesn't solve the two sets issue. \n\nUnless, a horrible thought occurred, they weren't using new paper. No I thought, they can't be that stupid. I open up the paper cassette and what I find was worse than I could have imagined. One, the rollers are not the ones they should be. evidently, the accountants have reached a level of confidence where they are now replacing parts themselves. which would be great, if it was the right brand(or even size). Two, they are using paper which they've nicked from my office. Paper that has already been printed. Surely they must have noticed? Evidently not. Their stolen paper worked fine, up until they reached the stapled sheets. Which has gummed the machine right up. I give up after twenty minutes of trying to pick stapled paper out of the inner workings, as they'd made it surprisingly far. \n\nI replace the rollers, and the \"waste toner unit\" (bodged water bottle), so they're two less things for the engineer to cry about. My final job is to gather the serial code and fault code(s) for the engineer. Serial code was easy enough, but fault code, good lord did the printer have a sense of humour. Instead of displaying an error code, it displayed the name of the last user to send a job, and therefore, its murderer. $Mick the Accountant. \n\nToday we had the reckoning. Engineer was here for five hours. We were honest, told him the full story. He was honest, told us we were screwed. He did what he could, then arranged for a pickup for Frankenprinter. The accountants have voided the lease and it'll cost about 5 grand to get a new printer. Guess we will respond to change toner jobs from now on.",
        "created_utc": 1673898458,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Son! There's no Internet again!\"",
        "author": "sweylyn1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10d1ovg/son_theres_no_internet_again/",
        "text": "I'm not working in the IT field, but I have two IT degrees (not University/college) and, as such, I'm the family's IT guy.\n\nWe used to have a sh*tty home gateway from our ISP and it always dropped connection to my old laptop that I gave my father to use after buying a better one (I regret doing so, but that's another story) and then asked for the password to connect to it again. It happened so often that I created a **plain text file** on the desktop, named \"Wi-Fi password\" with nothing but the WiFi password in it.\n\nI showed my father slowly, clearly explaining the whats and hows, that when the laptop disconnects again, he should open \"Wi-Fi password.txt\", that's right in the middle of the desktop, copy the text, and then paste it into the password field, then click on \"Connect\" and he's done. He was annoyed when I asked him if he understood it for the fifth time.\n\n*\\*the next day\\**\n\nDad: \"Son! There's no Internet again!\"\n\nMe: \"Just do as I showed you yesterday!\"\n\nDad: \"I didn't understand any of it! Come here and fix this effin' piece of cr@p!\"\n\nMe: *sigh* \"Just open the  \"WiFi Password\" file that's on your desktop, copy the password, paste it into the password field and click on the \"Connect\" button!\"\n\nDad: \"The what file from where?\"\n\nMe: \"The \"WiFi Password\" file on your desktop!\"\n\nDad: \"There's no WiFi password written anywhere here! COME HERE AND FIX IT!\"\n\nMe: \"Alright...\"\n\nI went there, opened the \"WiFi Password\" file from the desktop where I left it, copied the damn password, pasted it into the password field, clicked on \"connect\" and presto, there's Internet again!\n\nMy father is in his 60s and is one of the most technologically illiterate person I know. But his age is not the issue here, as he told himself that he did indeed understand what he would need to do the next time the connection was lost.\n\nI was a student with no money and my parents refused to buy a cheapo WiFi router, so I gave up and just disabled the WiFi password. I tried hiding the SSID, but one phone just refused to connect automatically, so that wasn't a good solution either. I ended up white listing all three phones and both laptops until the ISP decided to replace the home gateways and cable boxes.\n\nEverything's working fine, network wise, since then. The darn cable boxes have their own set of issues, but that's not TFTS.",
        "created_utc": 1673833674,
        "upvote_ratio": 1.0
    },
    {
        "title": "One-use password",
        "author": "MasterGeekMX",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10cxk28/oneuse_password/",
        "text": "I'm not an employee in an IT department, but a computer sciences student, so as tradition I'm the de facto IT guy for the family.\n\nMy uncle asks me to help him setup an account for a famous chain of office stuff store because they have some headphones on sale in the online store.\n\nI go to his place and sat on his computer. we proceed to fill the fields, and he enter the password incorrectly in one of the two fields, so the system rejects it.\n\nHe asks what happened and I say \"you need to enter the password twice to avoid having a mistyped password and then locking yourself out\".\n\nWith a hopeless voice and a sigh he says \"now I need to invent a whole new password?\"\n\nMy uncle believed that when a password was rejected when creating an account that password was forever banned for use anywhere.",
        "created_utc": 1673823033,
        "upvote_ratio": 1.0
    },
    {
        "title": "One more phone call",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10cv1nl/one_more_phone_call/",
        "text": "This is a sequel to my story about discovering my company was paying for unused phone lines.\n\nHere's the link to that story if you haven't read it and wish to:\n\n[https://www.reddit.com/r/talesfromtechsupport/comments/108h5sd/it\\_took\\_a\\_single\\_phone\\_call/](https://www.reddit.com/r/talesfromtechsupport/comments/108h5sd/it_took_a_single_phone_call/)\n\nAnyway, time went on and our corporate leadership decided to relocate all our administration and accounting functions to an office in the Midwest.  Most of programming work was spun off to another company leaving the fancy new office space empty, but we still had a lease.  A short time later the lease was up on our \"old\" space and my group was instructed to move to the \"new\" space, even though it was very inconvenient for our service techs.  My boss was told that if he could get someone to take over the lease, we could then move to someplace that made sense.\n\nAnyway, we moved in and again I started looking at things like our phone and utility bills and had the number of phone lines reduced like I had in the previous space.  I also noticed was that we were getting a gas bill.  We had not been billed for gas at our previous location, but this was a different setting so I figured it was just part of the deal.  Plus our accounting folks had been located in this building and so it must be okay.\n\nOne day I happened to enter the office through a side entrance and noted that I passed a massive gas meter.  Probably 4-5 feet tall.  It got me thinking about how many gas meters there were for the building so I walked around and could only find one.  I called the gas company and confirmed that there was only a single gas meter for the entire building.  \n\nI fired off an email to our accounting folks telling them that we were paying for 100% of the building's gas, even though we occupied about 1/6th of the total space.  Maybe that was part of our deal with the landlord, I had no idea.  I included the phone number and name of the person I had talked to and went back to my actual work.\n\nA day or two later I got an email from our accounting manager, Jerry.  Jerry told me he had talked to someone else at the gas company, who had told him there were multiple gas meters and we were only paying for our office space, and everything was correct.  I emailed back and just said that I had walked around the exterior of the building and there was **\\*ONE\\*** gas meter.  Full stop.\n\nI didn't hear anything for a while but then got a phone call from a lady who worked in our accounting group.  She had followed up and it turned out my company had been paying for the entire building's gas since we first moved in.  We had never occupied more than a third of the building.   She needed to confirm my findings as she was working out a deal with the landlord to credit us with the overpayment.  Gas was supposed to be shared on a pro rata basis among the tenants.  \n\nIt turned out we got $50,000 credited toward our rent, and if anyone thinks I got anything beside a reputation as a troublemaker, I've a a bridge in Brooklyn to sell you.",
        "created_utc": 1673816985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cyber Security VS Software Engineering: Tug of War!",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10chpge/cyber_security_vs_software_engineering_tug_of_war/",
        "text": "[removed]",
        "created_utc": 1673782560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep an eye out for a root cause",
        "author": "tuxcomputers",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10c4lpx/keep_an_eye_out_for_a_root_cause/",
        "text": "Being the new guy that only just got their access to the massive system I was assigned some routine issues.\n\nThere is System A that does up a quote, it then sends the ID over to System B. System B generates the required documents as a PDF and stores them. System A then has a process to pull those documents email them to the client.\n\nSometimes the documents are not generated fast enough and system A spits the dummy. Agents raise a ticket with the ID number, pretty easy to fix, I open the admin page, find it and ask system A to try again.\n\nNope, same error, error 403, forbidden, weird. I start poking around where I could in both systems. No clue what I am doing but I'm giving it a red hot crack. Did not find anything that would help, fine, will deal with the next ticket and come back to it later. This ticket has the same error, hmm...odd but maybe that is a common error, meh, leave that one too and try a third ticket, same error. This sets off my spidey senses that something deeper is going on.\n\nI then noticed that the third ticket was for the same business area as the second, so I go back to the first ticket, yep same area. I then used the search facility to find 32 different instances of the same error for the same business unit.\n\nI start asking questions of the more experienced members. As I am doing so I dig deeper. This error has been happening since since the 22nd December. This business unit raises dozens of these documents a day and there are only 32 of these broken ones, so I know it is not completely borked. Beside that fact this would have been at least a P2 on the 22nd.\n\nLooking at it further I noticed that it is only when there is an amended document. Documents before that date and not amended are fine. Documents raised after and amended are also fine. It is only when the documents were raised before and amended after that have the issue.\n\nI let the other team members know what I have found, turns out there was a change on the 22nd to the temple configuration. They had tested the change but not this use case. I was told to put what I found in the ticket and send it over to the Dev team that is responsible for the template configuration.\n\nEveryone in my team with the same error for the same business unit was told to make mine the parent. All up there were only about 15 tickets, some agents don't raise a ticket when the process breaks because there is another process where every broken document is resubmitted and they eventually get sent out without the agent having to do anything.\n\nAlways keep an eye out for a root cause.",
        "created_utc": 1673740259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pc crashing while gaming due to realtek drivers???",
        "author": "Impressive-Tea-8178",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10c2eaf/pc_crashing_while_gaming_due_to_realtek_drivers/",
        "text": "[removed]",
        "created_utc": 1673735044,
        "upvote_ratio": 1.0
    },
    {
        "title": "While reading this, you may have questions. That means you were paying attention.",
        "author": "WantDebianThanks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10bsyzd/while_reading_this_you_may_have_questions_that/",
        "text": "[removed]",
        "created_utc": 1673714752,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do now?",
        "author": "Starfury_42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10b8dvx/what_do_i_do_now/",
        "text": "I do helpdesk and get the unimaginable joy of dealing not only with staff but external callers as well. We have a patient portal I have to take calls for and some callers are *special.*  I sent a password reset email for the patient portal and it says click \"here\" to reset the password.  He does that part then I get:\n\n\"It says enter new password.  What do I do here?\"\n\nI died a little inside at that moment.  I understand that some people are not technical but this goes just a little beyond that.  It wasn't the end of the call either.  \n\nYou create a new password.  \nI don't have one...can you create one for me?\n\nNo, no I can't.  I inform the caller he needs to create one, which he does - amazingly enough he doesn't tell me what it is.  The system logs him in after this and the conversation continues.\n\nYour PW is reset and you're signed in.    \nHow do I download the app?  \nYou go to the app store on your iPhone and search for \"app\"  \nHow do I do that?  I don't have the App Store on my phone.\n\nI'm thinking \"Yes, yes you do\" but keep this to myself as I die a little more inside.  After 10 min I manage to get him to the app store where he's able to search the app.  He reads the title and I'm telling him that he has the correct one and needs to tap on \"Get\" to install it unless it's already installed and then he'd tap \"open.\"   Then a blessing from above happened: The MD office calls.  He says \"I have to go\" and hangs up.  I close my ticket taking a deep relaxing breath (or five) before getting ready for the next call.",
        "created_utc": 1673650898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I didn't know people could function in society and be this dumb.",
        "author": "Wy3Naut",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10b28pj/i_didnt_know_people_could_function_in_society_and/",
        "text": "So, I've been working IT for the last 5 years. I talked my way in without any certs or experience beyond 10 years retail and being with the company for 2 years at that point and hating my job at the time. (Telemarketing basically)  \n\n\nThe pandemic has just hit, and a lot of people are working from home. Being in the south, a lot of managers are upset that their employees that can work from home are and they're having to host meetings remote. \n\nI get a call right around lunch time and the issue is that the user's webcam isn't working. I remote into the computer immediately because the majority of our users are stubborn and willing to do the bare minimum and want us to do everything for them. (I'm fine with this; last position was WAY worse.)\n\nI'm looking at a zoom meeting window with a black box where the video feed should be. \"Sir, is there anything covering the lens?\" \n\n\"No.\" and he goes on about how IT ruins everything just when he's used to it. \n\n\"Alright, let me look around a bit and see if I can fix this.\" \n\nSo, I go into the Zoom Meeting Settings and the computer sees the webcam, I turn it off and back on and it is still just a black box. The user's name is just disappearing when I turn on the webcam. After that, I close the program and reopen it. Still no changes. \n\nI then go into device manager and disable and attempt to update the driver. Says that I have the latest drivers. Still no changes. \n\nDownload the HP Image Assistant and run it. There are a massive number of needed updates but nothing for the webcam.  I put that off because the user is very upset that he's missing his mandatory meeting that requires he has his webcam on. \n\nI'm hitting roadblock after roadblock and I'm getting frustrated with this political ranting. \n\nI don't know what's going on. Everything looks good but we're just getting this black box on the video feed. \n\nFINALLY, I ask him, \"Can you please take your fingernail and see if there's something covering the lens maybe?\" \n\nHe responds with a \"Fine!\"\n\nI hear him lean in his chair over the phone, pick something up and the SOB opens the lid to his laptop, the black box turning into a video of an idiot, and he says, NO there's nothing on the lens and closes it again. \n\nIt was closed on an HP Slide Dock on his desk. \n\nI muted my microphone and scream in frustration. \n\nBarely holding it together I inform him, \"Sir, the lid has to be open for your webcam to work.\"\n\n\"Oh, they just said it had to be on.\" \n\nHe opens the laptop lid and then proceeds to complain that it's not showing him in the image.\n\n\"Sir, it has to be pointed at you.\" \n\nI wished him a good day and disconnected. I can't imagine being that stupid. I call my manager because I'm legit concerned that this person is around heavy/dangerous equipment and I'm told to let it go. \n\n6 months later, I'm having to provision his accounts because he's been promoted to parts supervisor. \n\nIt's been about two years since this happened and I've yet to see his termination paperwork come through but whenever someone apologizes to me about being too needy I always use this as the example of the worst and tell them never to hesitate to call the IT Help Desk because I would rather help them than ever speak to that person again. \n\nI don't give the user's name or position. I only tell them, \"You're not bad at all, you've done more than what many would do.\"",
        "created_utc": 1673635918,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Are you aware of my rates, heretic?\"",
        "author": "WantDebianThanks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10aw0ks/are_you_aware_of_my_rates_heretic/",
        "text": "&gt; The Heretic: My computer won't turn on. Can you come over?\n\nI examine my personal communicator\n\n&gt; [Enginseer](https://warhammer40k.fandom.com/wiki/Enginseer) WDT: I'm at work\n\n&gt; Enginseer WDT: Are you aware of my rates, heretic?\n\n&gt; The Heretic: No?\n\n&gt; Enginseer WDT: Three times of my pay rate ($22) and I do the work. Or you get me dinner and I tell you how, but in a really condescending tone.\n\n&gt; The Heretic: There's a German place down the street from me I've wanted to try.\n\nI arrive at his housing unit and examine the poor computer. The signs a botched surgery are apparent in the still open patient. \n\n&gt; The Heretic: I wanted to clean it out, so I removed everything, blew it out with a can of air and put everything back, I made sure to put that CPU gel on it, but it won't turn on. \n\nI direct the heretic to (from both ends) remove and reinstall the power cable and the motherboard cables while I examine the wounded patient. \n\nThe stand, closing my eyes and raising my hands in reverence to the Omnissiah before reciting the Litany of Ignition \n\n&gt; The soul of the Machine God surrounds thee.\n\n&gt; The power of the Machine God invests thee.\n\n&gt; The hate of the Machine God drives thee.\n\n&gt; The Machine God endows thee with life.\n\n&gt; Live!\n\nThe Heretic looks confused at me. \n\n&gt; Enginseer WDT: Now fool heretic, remove the RAM, rotate it 180*, and reseat it!\n\nPraise the Omnissiah, the patient made a full recovery and is now being used to slay the enemies of the empire (by pwning newbs)",
        "created_utc": 1673620489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inadvertent backup success story",
        "author": "big_aussie_mike",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10aneh5/inadvertent_backup_success_story/",
        "text": "A few years ago I ran an IT company in a small town. Pretty much a one stop shop for business IT and security.\n\nOne of the services I offered was automated offsite backups over the internet. It was just an app that ran on a desktop or server and define one or more folders to replicate to my server with versions kept as per the requirements of the client.\n\nMy server was also backed up to tape with dailys rotated through two weeks and monthlys kept for 12 months. \n\nA fairly robust setup that never failed.\n\nIf a customer cancelled the service their data would be removed from the server but it would remain on the tapes until they cycled through. This was in the contract.\n\nSo that's the setup, here's the story...\n\nI had a customer who was an accountant who looked after quite a few charities amongst many business clients.\n\nOne day I get an email requesting to cancel the backup service. No biggie, I rang them and confirmed the request. They were a bit cagey on the reasons and their plans ongoing but that just usually means they had someone who could do it cheaper.\n\nSo I canned the service and removed their data.\n\n3 days later their office explodes and burns to the ground.\n\nBeing a small town, people know people and I hear pretty quickly that the fire is being investigated as arson and rumours swirl of dodgy practices.\n\nI get a visit from the detectives the next day and I tell them all about the backups and how they were cancelled and the data deleted but a copy still exists on tape.\n\nAfter a bit of legal wrangling I retrieve the data and hand it to the detectives and do a statement.\n\nSkipping over a few steps... The accountant was charged and convicted of ripping off multiple charities to the tune of $400,000.\n\nThey thought they had covered their tracks with the fire and cancelling the backups but forgot about the tapes. Because of that data the detectives were able to build a very strong case.",
        "created_utc": 1673591320,
        "upvote_ratio": 1.0
    },
    {
        "title": "The haunted printer",
        "author": "pockypimp",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10aergb/the_haunted_printer/",
        "text": "[u/LampeterRanger's story of the printer that as allergic to paper](https://old.reddit.com/r/talesfromtechsupport/comments/108nmld/the_epic_of_bob_the_printer_whos_allergic_to_paper/) reminded me of a fight with a machine I had.]\n\nAbout a year before I left my last job we got a new MFP (Multi-Function Printer) to replace an older machine that was no longer on lease.\n\nBrand new machine arrives, new model to the company.  It gets installed and everything works... for a few months.  Then suddenly print jobs and copy jobs suddenly make the machine reboot.  The people who used the machine called it in, tech couldn't find any issues and left.  This happened for a couple of months before someone reached out to me.\n\nI contact support, get the tech out and he can't figure out what's going on.  I contact our sales rep who forwards it up to their tech group and a 2nd level tech is assigned.  I've worked with the 2nd level tech before and he's good, he's helped find solutions for us in the past.  I'm positive he can fix the issue.\n\nHe arrives and takes a look, he's mystified by the issue.  I let him know I've tried updated printer drivers already.  He updates the printer firmware, we run a test print from a user and it works.  He's satisfied and he leaves.  But sure enough the next day I hear that it still rebooted overnight whey they were trying to print stuff.\n\nI email the tech, let him know what happened.  He comes the next day with a replacement board.  He swaps it out, we test print and it reboots on the first try.  Now he's concerned, there's no errors, no fault codes, just the system reboots.\n\nOver the next month he replaces the other two boards in the system and the power controller board.  Each time it fails to resolve the issue.  We tried older and newer drivers, different printers, and computers on and off the local network.  I've been CC'ing our sales rep and his boss (our former sales rep) on the status of the issue.  One time after replacing the last board he could a user walked up to make a copy and it reset while scanning his document.\n\nAt this point he said that they're going to have to take this machine back to the warehouse to strip it down and figure out what's going on.  A different model machine is sent to us to use while they take our machine away.\n\nThe machine was gone for over 3 months due to part shortages.  I complained a bit about how long the machine had been gone and a replacement came, another brand new machine.  The 2nd level tech came out to install it because this was now his issue to resolve.  The new machine goes in and people begin printing with no issue.  He leaves but calls me back the next day to make sure everything is working and it finally was.\n\nWe never did hear what was wrong with the first machine.",
        "created_utc": 1673567039,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Unholy File",
        "author": "CooperFox71",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ae4zp/the_unholy_file/",
        "text": "First time posting. Please smite me if I've done something incorrectly.\n\nGot a ping from a user on MS Teams.\n\nUser: \"Hello, my OneDrive is not syncing.\"\n\nMe: \"Does the application say it's having trouble syncing, or are you missing files?\"\n\nUser: \"I don't know.\"\n\nMe: \"What I mean is, how do you know it's not syncing?\"\n\nUser: \"I don't know\"\n\nMe: \"....M'kay.... Let me rephrase that. What is the actual issue you're experiencing?\"\n\nUser: \"My OneDrive isn't syncing.\"\n\nMe: \"We've established this. What *in particular* about the OneDrive app is leading you to believe it isn't working?\"\n\nUser: \"It's not syncing\"\n\nMe (trying to remain calm): \"Okay, is it giving you any error messages?\"\n\nUser: \"Yes.\"\n\nMe: \"....what is the error message?\"\n\nUser: \"Not syncing.\"\n\nMe (starting to dig my nails into my desk): \"Okay, I'm going to remote to your PC and take a look.\"\n\nUser: \"I'm in a meeting right now, can you do it in the background?\"\n\nMe: \"No, I need to control your PC for a few minutes while I diagnose what the actual problem is.\"\n\nUser: \"Uhhh .. okay.\"\n\nI proceed to remote to his PC and discover he's mid-meeting, Zoom call open and everything, trying to upload a file to their group's shared OneDrive folder. I pull open the quick menu from the taskbar icon, which I see is showing the classic red 'X' indicating there's an issue. It shows an error.\n\n\"File cannot be synced. Invalid file name.\"\n\nBelow that, the culprit:\n\n666_-fndkfndirb3884_7'+$782;$\"+8#8@+2;2_8'66+#;(#+#+\"7'7'_8+#hshxudu;$(_7bsufuaoaj-$-$.docx (inaccurate recreation, but it started with 666 and was about this length and complexity)\n\nI inquire with the user as to what possessed him to name his file in such an unholy way.\n\nTurns out, he was asked during the meeting to share an image. He copy pasted the image into a Word file, saved it as (unholy filename) because he was in a rush and simply wailed frantically on his keyboard as his peers looked on in horror, and attempted to upload that file into their shared OneDrive. Apparently this is how images had been shared between the members of this group for some time.\n\nI showed him how to simply put the image file into the OneDrive folder. I watched from the safety of my remote session as he moved the original image into the folder. It uploaded successfully, the other members of the meeting warbled and screeched in satisfaction. The ritual is complete.\n\nI told him to simply delete the Word file. He declined.\n\nNote to self: \"Exorcise (User)'s laptop tomorrow.\"",
        "created_utc": 1673565526,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Want Wifi Signal Where?",
        "author": "paishocajun",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10aag8k/you_want_wifi_signal_where/",
        "text": "LTL, FTP, on desktop so rake me over the coals for any spelling/grammar. Short little story that I'm sure most of us have heard but might make y'all chuckle from my previous employer where I worked in a walk-up Desktop Support office.\n\nCustomer: hey, my wifi isn't working. I can't connect to \\[company wifi\\].\n\nMe: Mind if I see your computer? \\*tap tap tap\\* Connection looks good in here, where are you having problems at?\n\nCustomer: My house in \\[next town over\\]. Why isn't it working?\n\nMe: That's, uh, like 20 miles. Wifi doesn't work like that.\n\nCustomer: Well why not?\n\nMe: ... Physics. Now let's get your VPN working.\n\nI try to be diplomatic with my customer service but this guy was a mechanical engineer. Sometimes, the bluntest answer worked the best.",
        "created_utc": 1673556980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small nonprofit employee submits IT request for unicorn for birthday",
        "author": "LukeCH2015",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10a9suk/small_nonprofit_employee_submits_it_request_for/",
        "text": "Received a ticket 5 mins before closing yesterday.  A very short request for IT to assemble a quote for a specific kind of laptop (rhymes with Snapple) and a smartphone to go with it. There were no further details or info in the ticket. My kneejerk reaction was to go find this person and laugh dismissively in response in-person, but I restrained myself.\n\nThis is a very strange request, since we normally deploy laptops and desktops that are from Enterprise_BrandX or Enterprise_BrandY (which meet our needs just fine), we do not deploy any Snapple brand laptops or desktops at all, and we also don't issue smartphones of any kind to any staff.  We are also a (small, community level) healthcare organization, our network and resources are not optimized for Snapple hardware, and last but not least our budgets are not bottomless. \n\nI decided to just politely humor this patently ludicrous request and search the requested items on Shmoogle to see what the damage would be. It seems the current top-line Snapple laptops start around 3-4 times our normal average spend per unit recently. There is no technical nor material justification for us to purchase and deploy this device to this employee, or any other employee in this organization.\n\nI hop into the ticketing system and send back a curt but professional reply, requesting further detail about this inquiry, requesting the names of staff this equipment would be deployed to, their budgeting departments, the projects this equipment would be earmarked for. It's been roughly a whole day since then and I have gotten no response. I hope they take the hint.",
        "created_utc": 1673555424,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to access the wifi where? [SHORT]",
        "author": "paishocajun",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10a9rpp/you_want_to_access_the_wifi_where_short/",
        "text": "[removed]",
        "created_utc": 1673555353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are we using DOS database software?",
        "author": "quietvegas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10a8uey/why_are_we_using_dos_database_software/",
        "text": "[removed]",
        "created_utc": 1673553157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ignorance can find the solution.",
        "author": "freddyboomboom67",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10a4yle/ignorance_can_find_the_solution/",
        "text": "Like many, another post prompted this story. It started as a comment, but it grew enough I thought I'd make a separate post. On to the wall of text: \n\nBack in the early 2000's I was **the** field engineer for a tape backup library manufacturer of a Western State in the US. They still make tape libraries and tape drives.\n\nWe had a customer that is one of the largest processor manufacturers in the world.\n\nOne group at one of their campuses had four of our biggest tape libraries connected to some AIX hosts via fiber channel to SCSI bridges.\n\nWe had an escalation going on for over a year. Fiber channel packet capture boxes rented and connected between AIX fiber card and the bridges in the libraries. I was onsite every day copying the take from the packet captures to send back to \"Advanced Tech Support\".\n\nWhen idle, the link would reset and renegotiate about six times per second. When backups/restores were going on, everything worked fine. The multiple resets per second would eventually cause the fiber to SCSI bridge to randomly lock up within two to three weeks, requiring a manual reset with a paperclip.\n\nOur \"Advanced Tech Support\" engineer was running the show. IBM was involved. IBM involved the fiber channel card manufacturer.\n\nNobody could figure it out.\n\nThey knew it was something to do with FCP2 which is some sort of error correction (to my recollection).\n\nOne day, I'm poking through the configuration options on the fiber to SCSI bridge, and there's a setting to enable/disable FC Class 2, which is disabled by default. Is it related? I dunno, I are just a service guy. Turns out kind of: FC Class 2 is for TCP/IP over Fiber Channel (to my recollection, probably not quite correct).\n\nI approach one of the customer backup folks and tell them about the setting, admit ignorance, and suggest we try enabling it and see what happens. \n\nWe enable it on one bridge, and reboot it. When it comes up, the six times per second resets are gone. We run a test backup. It works. We run a restore of that backup, and it works. Hm.\n\nWe leave FC Class 2 enabled on that library for the weekend. Monday we checked, and the backups ran fine on that library. So we left it for a week, then for a month. And we no longer had any lock ups on that bridge. Woot!\n\nThen the backup engineer went to her boss with the story, and asked if we could roll it out to the rest of their libraries that were having this issue (only the ones connected to AIX hosts).\n\nHe let us do it, and in the next escalation meeting tore into the folks from my company about \"why didn't you suggest this a year ago?\", then the feces rolled downhill as our \"Advanced Tech Support Engineer\" tried to get me in trouble over \"making unapproved changes\" to the environment.\n\nIn the after action review conference call, the guy that was introduced as \"IBM's fiber channel expert\" asked me why I tried that setting, and I explained I was just trying it because FCP2 and FC Class 2 both started with FC and ended in 2, and I wanted to try SOMETHING instead of letting it do the same thing forever. He said \"good job\".\n\nExplanation of the issue, to my recollection, is that the driver for the fiber card expected an FC Class 1 link partner to also do FCP2 error correction. Since our bridge was talking FC Class1, but didn't do FCP2, the card kept resetting the link until the device on the other end (our bridge) WOULD negotiate that it did FCP2. Eventually the bridge would say \"I ain't talking to you no more. Neener!\" FCP2 error correction couldn't be used with FC Class 2, so if the card's link partner advertised both FC Class 1 AND FC Class 2, then it wouldn't demand FCP2, and it stopped resetting the link with our bridges.\n\nDuring this fiasco, our \"Advanced Tech Support Engineer\" would periodically tell me to make sure the bridges were configured properly. I had created a script that would capture every single setting in the bridges, including hidden ones we didn't have documented, so I would send him every setting on every bridge and ask \"here they are, how do you want them configured?\" He would never respond to that...",
        "created_utc": 1673543752,
        "upvote_ratio": 1.0
    },
    {
        "title": "That's one way to solve permissions issues I guess",
        "author": "ravencrowe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10a3u25/thats_one_way_to_solve_permissions_issues_i_guess/",
        "text": "I'm a web developer and I manage several websites for my clients, including helping them with the CMS configuration.\n\nThe client generally has admin accounts for the CMS, which naturally grants them full unrestricted access to all features. They requested that I create a new role for their content authors that restricts access so that they can't do things like accidentally publish the entire website.\n\nThe other day, client emails me saying that the role is missing access to view a few of the tabs the authors need to be able to use. I update the permissions and get back to them the next day.\n\nMe: I've updated the permissions on the role, your authors should be able to view those tabs now.\n\nClient: Oh that's okay we figured it out, we just needed to check the \"administrator\" checkbox on their account\n\nWell... that's one way to do it. Wonder how long it'll take before the user publishes the whole website",
        "created_utc": 1673541052,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stump the professionals in 3..2..1..",
        "author": "peach2play",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/109ecfd/how_to_stump_the_professionals_in_321/",
        "text": "TL;DR at the bottom\n\nIt's been a few. For those who don't, I'm a Storage Area Network Engineer with 22yrs of experience. I currently work with $Coworker, who is a long time coworker/friend. He's been doing this a little over 25yrs and, since we are in the same industry, we've worked on and off together since we met in the early 2000s.\n\n\nOddly enough, this environment, $MedCo, is* very well managed. Myself and $Coworker are the new kids. We've been there 2 years. Most of the people in Infrastructure have been there 5+ years and a lot of them are 10+ in. They are very good at what they do, know where all the bodies are, and know how to keep the lights on with some very sensitive equipment. \n\nOne of the most sensitive pieces of equipment, $FrankensteinsMonster, is a 6 Node Windows Dev cluster housing over 400+ disks and no idea how many instances. Microsoft doesn't allow more than 250 so there's a lot of duct tape and bailing wire holding this thing together. While it's not as sensitive as Prod, which can't even handle an sfp failure and will crash, it's still a huge pain, and gives me gray hair and nightmares. It stays up because the Windows team is incredibly good at what they do.\n\nOn to the story. \n\nCast of characters:\n$PluckySANEng == Me\n$Coworker == Friend/Colleague\n$WinEng == 5yr Veteran and first line of defense\n$SeniorWinEng == 16ur Veteran and knows everything about this cluster\n$SeniorArchitech == knows the whole environment and is scary smart\n$PureVendor == the storage vendor\n$MSEngineer == mostly useless Microsoft engineer who had the misfortune of picking up the case\n$FrankensteinsMonster == a 6 node SQL cluster held together by duct tape and bailing wire\n\nIt's 4pm on a Saturday, and I'm on call. It's very rare I, or anyone on the team, gets a call so I decided to attend a friend's bday party 2 hrs of mountain driving from my house. Of course, Merphy's kicks in. I get a page from $WinEng.\n\n$WinEng explains they were doing patching on $FrankensteinsMonster and, when they rebooted, some, that's right, some, of its disks didn't come back. Even though 99.9% of the time missing SAN disks are not a SAN issue, I still log in and check that the Pure can see all the nodes logged in, and no removals happened in our end. Nothing. So, I let them know everything is good on our side. \n\nIt is very odd they are only missing 42 disks out of 400+\nSo, $WinEng pages out $SeniorWinEng. $SeniorWinEng suggests we check the other, smaller SQL clusters. Low and behold, they're missing some disks too. Now we're all scratching our heads. I call $Coworker to see if he's heard of anything like this as he has more sysadd experience than I do. He, too, scratches his head. At about 9:30, Sev 1 tickets to both Pure and Microsoft go out. $PureVendor calls back immediately. $MSEngineer took 5 hours. Logs are taken and sent out, while $WinEng and $SeniorWinEng try all kinds of machinations to get these disks back. \n\nWe rolled back the patches without luck. We removed disks, rebooted and reassigned them, no luck. A  lot of other things were tried, then, at about 1am, $SeniorWinEng noticed something odd. The HBA (like a NIC) software, which handles the connections from the fabric, or fiber channel network, could see the disks but MS couldn't. Now we're really confused, but maybe there's something wrong with the multipathing software which allows the server to see and use all it's redundant paths to the fabric. Uninstall, reinstall, no change. At 2am, I suggested we make a copy (snap) of the disk, break the snap, and assign the new volume. Maybe something was wrong in the identifier. Hey look, that works. Windows can now see that disk. Now we really have no idea what's going on, but we have a fix. We don't want to apply it to everything yet. What of those go offline for some reason too and we lose the cluster after we bring up instances?\n\nVendors also come back with no info. $MSEngineeris adamant that it's not an MS problem and we shouldn't keep him on the phone anymore. $PureVendor was much more helpful, and started his escalation process. At 4am we decided to call it, reconvene at 10 and get some sleep. Luckily the MS team was still in their upgrade window so we didn't have to wake the world..yet.\n\nRemember that 2hr drive I had to get home? There was no way I could get some sleep and make it home by 10. I got up at 8, called $Coworker, who is EST (I'm MST) and asked him to cover for me until I could get home.  During that time, he started looking through our db and other tools to see if he could find anything. I make it home and rejoin the call. 12hrs later, we've narrowed it down to something between the HBA and the multipathing software, but both vendors swear they found nothing. We give up for the day.\n\nMonday. Now the big bosses are involved. We have DevOps sitting on their fingers because this cluster isn't up. That costs money. About mid morning, $Coworker figures out the probable cause. We had migrated those disks from a different device using Pure's mirroring software. Then destroyed the mirror. Pure came back with, \"That's not what that mirror is for. It's for HA.\" Yeah sure, whatever.\n\nThen Pure received another case with the same issue. Then another, and another. 5 new cases in one day. They called in their dev team. 72hrs in total to discover they had a big in their code. A bug that persisted through 3 revisions.  Disks copied from one device to another using mirroring presented incorrect info to the multipathing software, causing a mismatch and a rejection.  Fix applied, all was well, everything back up. In total, it took 74 hours to resolve. \n\nNow, here's why I tell this story. We had some scary smart people on that call. I learned more about my equipment from $SeniorArchitech than I thought possible. All of us were stumped. No one, in our entire careers had ever, ever seen anything like it. While it was long hours, and lots of frustration, it was new. We all enjoyed the excitement of something new. Even with all the grief, it was one of the best, and most fun, calls I'd ever been on.\n\nTL;DR lots of scary smart people with lots of years in the business faces a genuinely new problem that none of us had seen in our careers. We proved the vendor had a bug in their code, and gave them a fix. Good times were had by all.",
        "created_utc": 1673467325,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Magic Mouse",
        "author": "Thejaybomb",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1098z5y/the_magic_mouse/",
        "text": "[removed]",
        "created_utc": 1673454764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well. Damn.",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1090hgs/well_damn/",
        "text": "Was reminded of this by a comment on yesterday's story. Another from the shop.\n\nI wasn't raised in any religion so forgive the terminology mistakes. This is the story of LadyVicar. Not that it matters to the story in any way except to reinforce how my own assumptions and stereotyping ass u me'd the situation, LV was in her 50s, slender and tall with graying hair and the top button done up cardigan wearing sort. She was Grams from Dawson's Creek but like, vertically narrower basically.\n\n&amp;#x200B;\n\nLV: \"Hello. I would like some help with my computer. I'm a vicar at the local church and need your advice about one of our PCs\"\n\nNormally this is the kind of detail I filter out. People tell me what's relevant to them, I parse it and ask what is relevant to me. Is it a home PC, is it for work/off domain, is it for work/domain joined? That's where I approach this kind of background. I don't need the bumf and fluff. But a church work computer? Ok that's new, and novel catches my attention.\n\nWe chat about it. What can we do? It's slow when you have several apps and web pages open? Extra memory should help with that, yes we have it in stock, no we shouldn't have any problems with assisting you.\n\n&amp;#x200B;\n\nLV: \"And I want to be able to play games on it\"\n\nMe: \"!?! ON THE..\" mumble mumble bite my lip \"..on this same PC? As the one that need the memory upgrade?\"\n\nLV: \"That's right\"\n\nMe: \"Have you tried any already? Which games?\"\n\n&amp;#x200B;\n\nAgain, normally I would ask this question for practical reasons to gauge what hardware you might need. I couldn't care less what your taste in games are. But obviously I want to know what games she's playing on the.. parish(?) PC after hours once she's done with her.. flock(?)?\n\nLadyVicar has, to paraphrase Stephen Colbert, stripped the highest purity silver from the PCBs, torn out the gold from the most overpriced HDMI cable connectors, removed the platinum from the largest capacity hard drive platters and melted them down in the fires of Mount Doom. She has mined the most tortured and pulverised carbon to hand grind and polish them down to the most exquisite diamond, to forge today the one ring to unlock the tippitty toppest ultra shiniest tier of technical support....!?!? \\*\n\nLadyVicar has made ***my day interesting***.\n\n&amp;#x200B;\n\nSadly I forget which game it was. Not Diablo II but it was definitely some form of elves and dwarves magic fantasy thing of that era. It would run but also far too slow.\n\nMe: \"Ok that's not too demanding these days, your PC probably has onboard graphics and even an entry level graphics card would run that. If you want to bring it down we can confirm all of that for you and install it while it's here\"\n\nLV: \"Is that something I could do myself?\"\n\n&amp;#x200B;\n\nMentally, I stop packing all the equipment and supplies I would need after having already decided I would have walked through the flames with this woman. Whaaaaaa...\n\nMe: \"...aaaeeeell I don't see why not. If you could still bring it here I can confirm what you need and show you where it would go. The graphics card would need drivers installing too\"\n\nLV: \"What's that?\"\n\nMe: \"Software to make it work\"\n\nLV: \"Well I installed the game, that shouldn't be any trouble\"\n\nMe: \"I love you and I wish you were my auntie\" - No not really. Not out loud.\n\n&amp;#x200B;\n\nThe next day. LV brings in her computer. I confirm there's no AGP card so sell her one, pointing out the slot, remove the PCI blanking plate, etc. The memory is notched so line it up with the slot, it only goes in one way around. Off she goes. I am absolutely in awe of LadyVicar. I shouldn't be. I shouldn't be so shocked and amazed by her. I should be appalled by my own narrowmindedness. I love LadyVicar.\n\n&amp;#x200B;\n\nThe next next day. LV rings.\n\nLV: \"I'm afraid to say I did as you said and now the computer won't turn on\"\n\nMe, dismayed: \"I'm very sorry to hear that. There could be a number of reasons why, could you bring it down again and I'll have a look?\"\n\nLV: \"Certainly, will be there shortly\"\n\n&amp;#x200B;\n\nBack she comes and I immediately set the machine on a bench. I open it up and eyeball it to start with.\n\nLadyVicar has, with her blessed slender hands, MASHED the additional RAM the wrong way round into the slot. I love LadyVicar. I want to invite LadyVicar for Christmas. I want to see her cosy by the fire and gift her warm new mittens. I love LadyVicar. I pop the inverted memory which spings out with a jolt. reseat the RAM, plug it all in and boot it and turn the monitor on the bench round for her to see.\n\nMe: \"All working! Sorry for the inconvenience there!\"\n\nLV: \"Oh what was wrong with it?\"\n\nI tell her the truth. Why lie? Why continue to underestimate her? She accepts the explanation matter of factly, no trace of defensiveness or \"I just did what you told me to\". I finish up with her and point out the need to connect her monitor to the VGA on the graphics card, not the one on the motherboard as I'd forgotten to mention it before. And off she goes on her merry way.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\* no I have absolutely no idea what I'm talking about. By all means correct me for the sake of enlightening us and interesting conversation but don't think for a second I have the first clue in metallurgy or geology. Briefest of googles there.",
        "created_utc": 1673428763,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Epic of Bob, the printer who's allergic to paper!",
        "author": "LampeterRanger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/108nmld/the_epic_of_bob_the_printer_whos_allergic_to_paper/",
        "text": "[removed]",
        "created_utc": 1673390843,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 3",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/108kojb/the_airport_part_3/",
        "text": " \n\nThis story is a prime example if anyone ever needed to justify a change control solution.\n\nWhen I first started at the airport, they were in the middle of constructing a new bag management/handling system (BMS or BHS). I think the project took almost 2 years to complete because of all the inner workings. Like everything in the airport, it had to be intertwined with something else. So the airport ended up owning the servers and PLCs that were the brains of the operation. And then there was an non-networked type of interface that passed data along to a certain bag checking federal entity. The bag system was an HA pair of servers only and a PLC running each bag belt. There were other components as well, but they aren’t important to this story.\n\nThe HA setup worked surprisingly well except every time we changed servers for maintenance or something, a certain federal bag checking entity would have to reboot their side of the interface in order for it to work..every…single…time. I do however remember one time the HA cluster did suffer a split-brain situation and that wasn’t fun to sort out, but I digress.\n\nThis started out one afternoon when I got a call from operations saying the BMS was down. The PLC controller was giving an error about a duplicate IP issue. We were standardized on one particular type of networking equipment exclusively that had recently released a version of code that resulted in the same IP duplicate error that took down the same system along with other systems. We found the bug after about an hour and implemented the bug fix on every switch and it went away. However yet here we are again in a deja vu situation several weeks later.\n\nI double check every single switch and port to make sure the bug fix is still implemented and it is. It took me hours to comb through all that stuff to confirm that still wasn’t an issue. So I am racking my brain trying to figure out what the hell is going on and why the PLCs are shooting this error. I am looking at the ARP tables on the core, clearing everything out, and anything else I can think of. It all looks good from what I can see. I shut down both of the main servers and all the damn devices on that network segment to complete a ping sweep and I am seeing nothing return as expected. I power all the devices back on one at a time to account for them all and it all checks out. At this point I am grasping at straws.  I am super perplexed because the last time the duplicate IP bug happened, it affected multiple systems we had. And in this situation, it was just the PLCs of BMS which was just weird.\n\nBy now the problem is catching the attention of the highest level of airport management and other federal entities. They are starting to come down to get a briefing and generally getting in the way by interrupting my thoughts. I am kind of starting to panic because I am really starting to run out of ideas as to what could be causing this duplicate IP issue that is killing the PLCs and therefore the whole shabang. Bags are piling up and the airport had to institute the manual backup plan by having the porters cart the bags back to the baggage area.\n\nMy boss sees I am struggling after a couple of hours of this and calls a team meeting. We all go through our entire day in in-depth detail as to what each of us did that day. Nothing too significant except one of my team members had hooked up a new switch in a newly constructed tenant building. The port the new switch got hooked up was not configured properly as a trunk port so it defaulted to an automated type of programming.\n\nI immediately shut that damn port down. I missed it earlier because I wasn’t looking for that type of programming and I didn’t know anything about bringing that new switch online. The other team members normally told me when a new switch was going to be coming online so I could make sure it was operating as expected. Anyway the BMS system comes back online almost immediately after reseating the NICs in the PLCs and everyone celebrates. I get the switch port programmed correctly and we bring the new switch online as well a couple of days later without any issues.\n\nTo this day I am not totally sure what caused the issue from a technical standpoint. I am not sure if it was some kind of looping issue with STP or a BPDU when the switch port defaulted its config. I figured if that were the case, we would be seeing other oddities around the network, but it was just the BMS system PLCs.",
        "created_utc": 1673384057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ah yes, can I login to my new laptop without a login?",
        "author": "LackingAce",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/108iy48/ah_yes_can_i_login_to_my_new_laptop_without_a/",
        "text": "Hi OP and co-worker,\n\nI received my company laptop today, but still don’t have a login (\"My boss\" suggested I let you both know that I have received the laptop).  I’m not sure of the process, but do I need to wait until I get my login credentials before the laptop can be used?  \n\nThanks,\nFinicial Manager\n\n--------------\n\nYes, this would be the case. You cannot login if you don’t have login credentials.\n \n\nYou will have to work with \"Boss\" on what those credentials will be, and what you will need to have access to.\n\nThanks,\nI.T.\n\n--------------\n\nThanks OP. That is what I thought but want to double check.  \"Boss\" has submitted a request for my login.\n\n\nThanks again,\nFinicial Manager",
        "created_utc": 1673380025,
        "upvote_ratio": 1.0
    },
    {
        "title": "We stan the shaved bear who runs the warehouse",
        "author": "WantDebianThanks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/108i7qx/we_stan_the_shaved_bear_who_runs_the_warehouse/",
        "text": "\"Hey,\" The chain smoking shaved bear who runs the warehouse calls as I walk by \"my computer is slow. Can you take a look if you've got the time?\" \n\nI sit down at his workstation and pull up task manager while he does something else. I see the uptime is three digits. \n\n\"OK,\" I tell him as he comes over \"I'll let you save your work, but you probably just need to restart your computer. You should do it every week, atleast, but daily is probably better.\"\n\n\"Shit,\" The Shaved Bear says \"the last guys told us not to. Oh, hold on.\"\n\n[That may be one of the least insane things about this company](https://www.reddit.com/r/talesfromtechsupport/comments/wjez32/thirty_year_old_erp_my_what_now), so I believe him.\n\nHe grabs his second in command and the service floor manager and asks me to show them how (\"just in case\"). I narrate clicking the start button, show them the power option, and repeat what I told The Shaved Bear.\n\n\"Hey!\" The Shaved Bear barks at the service floor manager who has gotten distracted by something shinny in the ceiling \"This is fucking important, pay attention! Sorry WDT, go ahead.\"\n\n\"Just have it restart when you go home for the night and you should be good.\"",
        "created_utc": 1673378268,
        "upvote_ratio": 1.0
    },
    {
        "title": "It took a single phone call",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/108h5sd/it_took_a_single_phone_call/",
        "text": "Inspired by MSPSDManager\n\nBack in the 80s I was a tech support supervisor for a company in Southern California.  I worked out of an office that housed not only my group but s team of programmers, plus our accounting, sales, and managerial staff.  \n\nWe had an office in a business park which we totally filled.  After a year or so we had to rent additional office space in another suite in the same park.  We kept this space for while until we could figure out a way to move everyone back into the main office.  \n\nThings were really booming so we started looking for more \"fancy\" office space that could house everyone.  Most of folks wanted to move to an area further from the main metro area to be closer to their homes.  My group wanted to stay in office we were in since it was closer to our customer base.\n\nEventually we found a new building that was under construction and we made a deal to lease an entire floor and the landlord gave us an great building allowance to customize the space.  Finally the day arrived and everyone except the support group moved out. \n\nA lot mail still got delivered to the \"old\" office, most of which we just bundled up and delivered to the \"new\" office.  Some bills that were for our space had be approved by us before we sent on to the accounting folks for payment.   I got the job of making sure things got forwarded and approved and this was when I discovered were getting multiple telephone bills. \n\nOne bill was for \"calling cards\" used by our remote techs so they could call us and customers no matter where they were.  Remember this is the days when \"long distance\" calls were expensive.  But I also found we were getting two different bills from our local phone company.   One of them was for our regular land lines, it was set up with multiple lines on a \"hunt group\" so multiple incoming calls could be handled.  No big deal but since we had way fewer people in the office now, we didn't need as many lines.   The other bill had some strange stuff listed I never seen before, they weren't normal phone numbers.  \n\nI called the phone company and gave them the information and after a bit I was told these were for leased phone circuits, the kind used for dedicated modem connections.   They stuff we used before the internet to connect computers to each other.   I got my contact to get me the two physical addresses and it turned out that this service was between our office and the \"temporary\" office space we had leased.  We had vacated that space months ago, but we were still paying for the service.  \n\nAnyway, I cancelled the data circuits and had the number of voice lines reduced, resulting in some savings, which my boss appreciated.  Just a little thing but I felt like someone should have caught it before me.",
        "created_utc": 1673375694,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.arfasoftech.com/blog/Best-Programming-Languages-For-Hacking-In-2023",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1089bj6/httpswwwarfasoftechcomblogbestprogramminglanguages/",
        "text": "[removed]",
        "created_utc": 1673355798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well.. damn..",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10899lq/well_damn/",
        "text": "[removed]",
        "created_utc": 1673355643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rude customer wants product service without of warranty. He threatens to shame the company through social media reviews with my name in them.",
        "author": "ArgyleDiamonds",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1087yjj/rude_customer_wants_product_service_without_of/",
        "text": "[removed]",
        "created_utc": 1673351483,
        "upvote_ratio": 1.0
    },
    {
        "title": "When Tech Support gets lazy",
        "author": "ericsmith98105",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1083nwv/when_tech_support_gets_lazy/",
        "text": "[removed]",
        "created_utc": 1673335431,
        "upvote_ratio": 1.0
    },
    {
        "title": "But how did you find it so quickly???",
        "author": "FlowersAndFlour",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/107w2o4/but_how_did_you_find_it_so_quickly/",
        "text": "Hi, everybody! LTL-FTP-ETC\n\nI don’t work in IT, exactly, but one of my job responsibilities is maintaining/managing a document database. Although most of them don’t get used much in day to day operations, these documents are Very Important, so obviously access is fairly restricted. \n\nIf someone needs to look at one (a fairly uncommon occurrence), they need to send [My Department] an email, and we’ll send them a PDF of the document. If you are not part of [My Department] or, very rarely and under very specific circumstances, [Related Department], you *do not get* the actual document. And you always, always, *always* need to send the request. We need to keep track of this stuff.\n\nOne day, I return from lunch to find a coworker pacing in the office. He brightens up as soon as he sees me.\n\n&gt;Coworker: Hi! I need to see a [document], so I sent you an email, but I didn’t get a response. So I came here to talk to you, and you weren’t here, so I figured I’d wait until you got back.\n\n&gt;Me: Okay… what [document] did you need to see?\n\n&gt;Coworker: Oh, it’s [relevant information that tells me where to look, but not what specific document he needs].\n\n&gt;Me: Alright, so what’s the [document identifier]?\n\nHe tells me the [document identifier], and I find what he’s looking for fairly quickly. He doesn’t want me to send a PDF, he just needs to look at it. I figure, what the heck, I’m right here, I can stop him from doing anything dumb, and not having to create and send the PDF is a little less work for me.\n\nHe gets the information he needs from the document, and then…\n\n&gt;Coworker: Thanks! But how did you find it so quickly? There’s so many documents!\n\n&gt;Me: Well, you told me it was [relevant information], so I knew it would be in this folder, which is in this drawer…\n\nYes, you read that right. *Drawer.* These are actual, physical documents, and the “database” is a *filing cabinet.* \n\n&gt;Coworker: So you don’t just shove them in wherever they fit? Cool, I didn’t know that! Well, thanks again!\n\nHe wanders away, happy as a clam, leaving me to wonder how he has a job when he struggles with the concept of “organized filing cabinet.” \n\n(For clarity purposes: I work at a used car dealership. I’m part of the titling department, and the documents are titles, which is why they have to be actual pieces of paper. The [relevant information] was the make, model, and year of the car, and the [document identifier] was the VIN. He just needed to know if it was a clean, salvage, or rebuilt title, which he could have found quite easily elsewhere, but...)",
        "created_utc": 1673312698,
        "upvote_ratio": 1.0
    },
    {
        "title": "TFW the program administrator wants you to add a local file location from their computer as a URL embedded on the website",
        "author": "barnfeline",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/107qc2l/tfw_the_program_administrator_wants_you_to_add_a/",
        "text": "[removed]",
        "created_utc": 1673299068,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Working\"",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/107jnga/working/",
        "text": "[removed]",
        "created_utc": 1673283962,
        "upvote_ratio": 1.0
    },
    {
        "title": "This was one of you guys, right?",
        "author": "JaschaE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1078v1o/this_was_one_of_you_guys_right/",
        "text": "[removed]",
        "created_utc": 1673252088,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"We have our file share organized like a bank vault\" (made of swiss cheese)",
        "author": "DasKapitalist",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1071s7p/we_have_our_file_share_organized_like_a_bank/",
        "text": "[removed]",
        "created_utc": 1673230581,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want to save money, you still have to cancel the service you pay for",
        "author": "MSPSDManager",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/106jd8i/if_you_want_to_save_money_you_still_have_to/",
        "text": "Short story here. Years and years ago, a client wanted to dump their dedicated fax line and go with an e-fax solution for a few reasons. One of those reasons was that they did the math and figured it would be cheaper to do so long term. At the time, I was not involved beyond supporting the solution after it was implemented.\n\nRoughly five years after the fact and being more tenured, the client asks if I would be willing to sit down with accounting to review some \"discrepancies\" with vendor payments. Turns out, they forgot to cancel the fax line. So for about five years, they were paying for the e-fax service and for a dedicated fax line that was no longer used. They launched a wider audit and found they were paying for a handful of services they had long stopped using. Aside from finally cancelling those services, nothing more came of it since there was some turn over of client staff that the client higher-ups blamed for those dropped balls.",
        "created_utc": 1673184790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here at our company we only sell obsolete systems 🤓",
        "author": "FrontKaleidoscope2",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1063jma/here_at_our_company_we_only_sell_obsolete_systems/",
        "text": "This is from the wonderful world of customer support for home security systems. This one goes to one of my coworkers.\n\nCo: is a colleague.  \nGoG: Grumpy old guy.\n\n&amp;#x200B;\n\nCo: \"Please tell me how I can help you. Thank you for calling Blah Blah Blah Security.\"\n\nGoG: Name, address, password are provided by GOG for verification purposes. \"Well, my system won't turn on or off and isn't accepting codes. I believe it began following the storm that passed through last night.\"\n\nCo: \"Did lightning strike your home or a nearby structure?\"\n\nGOG: \"Yes\"\n\nCo: \"Oh, I see. Given the system's age, it most likely required a surge. You're going to need an upgrade because we can't get replacement parts anymore. I can arrange for a salesperson to contact you.\"  \n\n\nThis is when the client becomes irate.\n\nGoG: \"WHY WOULD YOU SELL ME AN OBSOLETE SYSTEM?\"\n\nCo: In a hushed voice \"Well, Sir, it was brand-new in 1986.\"",
        "created_utc": 1673135194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal that the i3 1115G4 laptopo CPU temp hikes up to 80-100C while running heavy load benchmark?",
        "author": "Old_Catch_1257",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105y7f1/is_it_normal_that_the_i3_1115g4_laptopo_cpu_temp/",
        "text": "",
        "created_utc": 1673121850,
        "upvote_ratio": 1.0
    },
    {
        "title": "A laptop held hostage",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105wvti/a_laptop_held_hostage/",
        "text": "[removed]",
        "created_utc": 1673118568,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You mean it works outside my house?!\"",
        "author": "mattthepianoman",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105wjjj/you_mean_it_works_outside_my_house/",
        "text": "I used to live downstairs from an older fella who I'll call Mr Jones who was reasonably tech-savvy, but definitely in the category of knows enough to cause himself a lot of problems.\n\nWhen I moved into the flat I didn't have an internet connection, so I was tethering from my phone. When I was setting up the connection I did a WiFi scan to see what was broadcasting in the area and to see if any of there were any FON hotspots (cheaper at the time than cellular data), and I found an unsecured internet connection called \"Jones Belkin Router\". This was well into the late 2000s when even ISP provided routers were configured with at least WEP. I was able to connect to the network and see that he had a PC and a laptop with shared folders wide open on each, and a printer. There was basically no security on this network - even the router password was just the default. I disconnected, connected to my phone to check my emails and then logged off.\n\nAbout a week later I was getting home from work, unlocking the front door and I met Mr Jones for the first time as he came out of his front door. He introduced himself, I introduced myself and we had the usual new neighbour chat. I remembered the unsecured network and decided to ask him about it.\n\nMe: \"Sorry, I have to ask, is the Jones Belkin Router network yours? Only it's completely insecure.\"\n\nMr Jones: \"Oh, yes, that is mine, but how did you know about it?\"\n\nMe: \"Well, it's broadcasting its network name, and my laptop picked it up. It's wide open for anyone to connect to.\n\nMr Jones: \"But it's in my flat? How does it get into your flat?\"\n\nMe: \"I guess it can get through the walls? I can help you secure it if you like?\"\n\nThat began an arrangement with Mr Jones where I'd occasionally help him out with his computers. Job number 1 was to encrypt the WiFi network, and tighten up his network settings on his computers. Within a couple of hours I had everything as secure as a home network needed to be. Over the couple of years that I lived there I helped him out a few more times with bits and pieces, including a borked Windows 7 upgrade and the occasional unpicking of clusterfucks of his own making. He always paid me for my time, and he'd occasionally bring down the odd bottle of wine or some beers.",
        "created_utc": 1673117709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, I saved him a bunch of time, atleast.",
        "author": "WantDebianThanks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105tttm/well_i_saved_him_a_bunch_of_time_atleast/",
        "text": "\"Oh, are you the new IT guy?\" A strange man says as he pokes his head into my office.\n\n\"I've been here 8 months, but yes.\"\n\nWe make our introductions and he pulls out his laptop.\n\n\"Can I show you a process I have to do, and you tell me if there's a better way to do it?\"\n\n\"Sure.\"\n\n\"OK, so I pull up the ERP, and I run this series of commands. It gives me this output. Then I copy it into excel. Then I have to get it to work with Excel, then go through and break it out by branch, salesman, vendor, and part. Unfortunately, this is the only way I can get the outside parts guys their commissions. I have to do it every month, and it takes me atleast 8 hours to do.\"\n\n\"Uh, do you not know about reports.$truck.com? Cause I should be able to automate this almost completely.\"\n\nA look of existential horror and depression washes over him and begins muttering \"five years\" to himself. \n\nNow, [the ERP we were using in the 2020s was setup in the late 80s, so it was a green on black TTY](https://www.reddit.com/r/talesfromtechsupport/comments/wjez32/thirty_year_old_erp_my_what_now). The data he was getting was raw text he had to get to fit into excel and with no way in the program to change the data's organization from chronological. And in the five years he had been with the company as the head of the outside parts sales staff, no one had told him about the reporting subdomain where I could get his finished report made automatically as often as he wanted in any file format he chose. \n\nWe call the ERP vendor and walk their reporting expert through the process, she does the needful, he sees the finished product, asks for a few tweaks, and then he walks away as happy as a clam that just learned what an atom is.",
        "created_utc": 1673110940,
        "upvote_ratio": 1.0
    },
    {
        "title": "When does a CSA become tech support?",
        "author": "UrbanTruckie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105f3dy/when_does_a_csa_become_tech_support/",
        "text": "\nI worked in customer service as a customer service agent (csa) for two automobile manufacturer/retailers in my country.\n\nI was promoted at the first one and became a team leader with a full time equivalent staff of 17, which peaked at 22 including part timers. We were contractors running agents and team leaders and call centre manager on the client site.\n\nAny tech issues would be supported through csa’s loading tickets and team leaders following up if resolution seemed problematic.\n\nBeing in this environment you overhear things that don’t make any sense to a csa since they don’t know the tech side but you can figure it out by osmosis if you have enough issues with help desk to sort through over time.\n\n Im made redundant at the first auto retailer because we lose the re-compete for the contract. The new contract is won by an IT manufacturer that will set up the call centre off-site next to a regional university, to be staffed by all green staff to the work; customer service indeed!\n\nA few years later Im looking to get back in the field and Im aware some if the best agents we had at first auto retailer were working for another auto retailer in our city, so I make some enquiries and get a job as a csa.\n\nOne of the reasons I thought this would go well is because I surmised the culture to be good if these highly skilled agents were working there.\n\nOne of the positives of the environment is that the team leader at second auto retailer had been promoted to team leader from being an agent within the team.\n\nThis team leader must have made quite an impression on her one-up manager, given what happened to her.\n\nMy two-up manger (team leaders one-up) was an engineer. He had moved into the customer service line before I got there. Rumour has it as the reason he moved out of engineering\nwas due to his work as part of the engineering team that made an error\nwhich caused recalls for the company related to a genuine supplied accessory.\n\nAs you may have guessed this engineer had some ideas for the csa’s to follow that the team leader pushed back on. The engineer and his one-up manager then arranged to fire the team leader under the guise of redundancy, within the few years I had been there.\n\nOk - weird choice, if you don’t want to work with a subordinate and you want to throw money at it, its an affordable way to deal with it - not sure fair work would see it like that but I doubt she made waves. The engineer must be confident he can manage the team without a team leader.\n\nAny consultants out there that work for themselves, primarily because you don’t qualify for promotion within organisations because not speaking truth to power is impossible over time will, understand how I felt at our weekly team meetings with the engineer. \n\nWeek on week it became painfully obvious the engineer had a lot of information missing in how to run this team.\n\nThe engineer of course began to bring in new team members, that were experienced csa’s, without automotive industry experience. In fairness there were some very good staff that came on. One guy that started was having trouble with his warranty  system login. He was complaining  to the engineer that he could not navigate the warranty screens as he was required to do and was unable to support customer warranty questions as a result.\n\nThe engineer was unsure what the cause was and had reported the issue to help desk.\nOne similarity of the two automotive retailers was they both used a legacy warranty system with a black background and red/green font. I loved these things for their stability and could live without the graphical user interface.\n\nOne day I was a little miffed this co-worker’s warranty access was jacked up and wondered what I could do to assist, since the call queue was all general and he was going to keep getting warranty calls.\n\nI created a ticket with IT and said please change user Coworker’s IT access to the same as u/Urbantruckie’s access. \n\nBingo it was fixed. Mr engineer had not been smart enough to realise migrating from engineering to customer\nservice would mean different warranty access view and creating new csa accounts based off his warranty access was useless to the new agent in the customer service department.\n\nHmmm maybe Urban Truckie will be promoted to team leader or will he go the way of the last team leader?",
        "created_utc": 1673063853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't touch the button.",
        "author": "SergeantMargarine",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/105e793/dont_touch_the_button/",
        "text": "[removed]",
        "created_utc": 1673061193,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you mean by \"Where did I print this from?\"",
        "author": "BitchenBob",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1056ckk/what_do_you_mean_by_where_did_i_print_this_from/",
        "text": "This happened yesterday.\n\n&amp;#x200B;\n\nI got an email from the company lawyer with two contracts attached. Both customers are tax exempt. One contract includes a line that says \"Tax $0.00\" and the other does not. They ask why they are different. They do not want that line to appear when there is no tax.\n\n&amp;#x200B;\n\nI ask \"Where exactly did you print these from?\"\n\n&amp;#x200B;\n\nThey respond \"Access\".\n\n&amp;#x200B;\n\nI write back \"Where in Access? We have like 10,000 different screens in there.\"\n\n&amp;#x200B;\n\nThey respond with a screenshot with the print button circled and the comment \"What do you mean by where did I print it from?\"\n\n&amp;#x200B;\n\nI respond \"That's exactly what I meant. You responding with just Access is like me asking where you live and you say Earth.\"",
        "created_utc": 1673041123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vendor and client insist their postage meter just stopped working out of the blue, and it's our firewall's fault.",
        "author": "LawbstahRoll",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1055bfz/vendor_and_client_insist_their_postage_meter_just/",
        "text": "I'll try to make this short, but it's so infuriating.\n\nThe user calls up on an existing ticket that a colleague of mine had been working earlier in the day but he had to stop working due to being sick. She says the vendor is on-site and he's confirming that the postage meter can't call out and it has to be a firewall issue.\n\nI familiarize myself with the ticket and start digging in. Our documentation on the device says it's got a DHCP reservation ending in .166 and the device was set to static at some point in the past. I run a network scan and confirm, that device is not connected to the network. Nothing is at that IP, nothing that's connected has that device's MAC.\n\nI ask the vendor to confirm the hostname, IP, and MAC on the device to make sure I'm looking for the right one. He gives me a different hostname, different IP, and different MAC.\n\nMe: \"So this is a new postage meter, right?\"\n\nVendor: \"Nope, same one as always, it just stopped working and I think your firewall is blocking it. Not sure what you guys changed recently but whatever it was, it's blocking the meter from calling out.\"\n\nI tell the vendor that the MAC address that we have in our documentation, that we've had for a year, and that we confirmed with an IP scan on the server *yesterday*, is different than the one he just read off. I also remind him that MAC addresses don't change.\n\nVendor: \"Well maybe it didn't get a static, you know? So maybe DHCP changed it.\"\n\nMe: \"DHCP doesn't change MAC addresses. That's an address that's burned into the NIC on the device. The only way to change a MAC address is to swap out the NIC. I don't believe you did that so I'm left to assume this is a new device. The firewall policy was set up for the previous device's MAC and IP. That's why it's not working now.\"\n\nVendor: \"Why would I swap out the device, though? It's a perfectly good device! It's only a year old!\"\n\nMe: \"Sir, did you go on site with a new device?\"\n\nVendor: \"Well I brought one with me but I didn't have to use it because this one works.\"\n\nMe: \"Can you take that one out of the box and let me know if the MAC on it is \\[reads off old one's MAC address\\]\"\n\nVendor: \"Uh... well yeah. How'd you know that? It's not even plugged in!\"\n\n  \nI wanted to put my face through the phone and bite his nose off.",
        "created_utc": 1673038709,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 2",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/104wjb2/the_airport_part_2/",
        "text": " \n\nAlright another story from the airport. Quick background on this, the airport has paid wifi from a company. They blast the SSID out of every access point they have to make money off of it. It is free for a certain amount of time with ads unless you pay for it of course. It’s a pretty good deal in that the company actually provides wifi equipment to the airport, the airport manages it, and it is worth tens of thousands of dollars.\n\nOne day I got a ticket from a civil servant at the Air Traffic Control (ATC aka the FAA) tower saying they can’t connect to the paid wireless. The airport had equipment in the tower for some emergency phone stuff and cameras for the runways, taxiways, ramp, etc. However there was no wireless presence in the tower itself.\n\nI went to visit the ATC and this individual told me they hadn’t been able to connect to the paid wifi for the better part of a week and that’s it. The person precedes to tell me the FAA internet connection is too damn slow to really do anything. Last I talked with my FAA counterparts I knew the tower and the FAA admin building was running off a T1 line so that is REALLY slow. So the paid wifi was working and now it isn’t. And I tell the person I am perplexed how they were even using the paid wifi in the first place since the civil servant’s office is like 7 stories off the ground and the airport has no APs nearby.\n\nI left the tower totally confused and went back to the office to chat with my team. At the time, our team collectively knew the entire technological history of the airport. Trust me there’s a lot of stuff and I still get an occasional call even after years of not being there about how something was set up. After some debate and looking at coverage maps we figured out the FAA person was connecting to an external AP hanging off a building over 100-ish yards away. I went back to the area to scope it out and found the problem. I ended up back at the tower to see the FAA person and pointed them to look out their office window. I showed them where the connecting AP was located and the reason why the ATC person couldn’t use it was because there was a huge metal tail rudder of a private jet blocking it. The ATC person was pissed and I chuckled all the way back to my office.\n\nI will share some other stories including in the coming weeks including the paging system upgrade gone wrong, bag handling system outages, and more common use stories.",
        "created_utc": 1673017839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't Know My Own Strength",
        "author": "Agile_Guide_7050",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/104wcse/dont_know_my_own_strength/",
        "text": "I've been working in public libraries for 35+ years, 25+ in IT. I've seen some interesting things.\n\nThis happened yesterday. TL;DR at bottom.\n\nOn Tuesday one of my ancient rack-mounted UPS units indicated to me (loudly) that the batteries had failed, not unusual after several years since the last replacement. I ordered the new batch immediately, and they were shipped via ground, not surprising for something that ways about 45 pounds (20 kilos). What was surprising is that they arrived this morning, after being shipped from Pennsylvania to far north suburban Chicago.\n\nI took the box down to the server room, deep in the depths of the building, and opened up the UPS. Old batteries came out, easy-peasy. First set of new batteries went in, a little wrestling with the harness (as always) to make room for the second set, a little wrestling with the second harness so the door will close, no problem. Closed the door, done.\n\nWhenever I install new batteries into a UPS, I like to give it a test, to clear the battery warning and make sure all the wiring is correct. To do so, on this unit, you hold down the \"On\" button (the line button, as one of my co-workers called it, as opposed to the circle. She was pleased when I explained that that is really 0 and 1, and said that made much more sense). Simple, Straightforward, easy, right?\n\nI started to hold down the button, and it is pushed into the UPS with a cracking sound. In the process, my finger slipped and I accidentally hit the \"Off\" (0, circle) button, which pushed further into the unit. I can no longer push either button, they have disappeared inside. In addition, I have shut off power to all the network equipment in the building: switches, routers, firewall. Needless to say, my phone immediately starts ringing, because \"the Internet's down!\" Plus all the other notifications that pop up when the network fails. \"Yes, I'm aware that the Internet's down!\"\n\nI took the front bezel off the unit, and there's the PC board with the buttons and lights, dropped inside, still attached to the ribbon cable. I jabbed the now uncovered \"on\" button, and, thankfully, the unit powers up, and we are back in business. Unfortunately, the plastic of the bezel was so brittle from age that several of the clips that hold the PCB to the bezel are just gone, lost in the depths of the UPS.\n\nAfter some juggling with the short ribbon cable, PCB, lens, button cover, and bezel, I was able to put it back together using the unbroken clips (two of four) and some electrical tape. Unfortunately, in the process of reattaching the bezel, the plastic tabs holding the friction clips also shattered, leaving a long tab and a single screw as the only things holding the bezel to the unit. Still, it is working, and the bezel is reasonably well-attached.\n\nI am not too confident about the fix, but I got permission from my director to replace this unit and its partner, both of which were purchased in 2004 (before I started working here). Still, they've been good donkeys and deserve their retirement.\n\nTL;DR: Bezel shatters because of a button press.",
        "created_utc": 1673017395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Semi-annual maintenance weekend",
        "author": "jrcomputing",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/104w24v/semiannual_maintenance_weekend/",
        "text": "This one's super short, but I'm mildly amused and wanted to share.\n\nI just joined a high performance computing operations team at a university a couple months ago, and today we started our first maintenance cycle since I came onboard.  We announced a few times to users that this would be happening, added notifications to the server login MOTD, etc. that we'd be down all weekend, starting at 7am today.  Campus is still quite dead after the holidays, and students don't actually come back for another week, but staff resumed work on the 3rd.\n\nAt 8:34 am, we got a Slack message from one of our internal developers, who are generally much more keyed in than our standard users, asking why our stuff was inaccessible.  He beat the first campus user query by a full 28 minutes.  He has been appropriately shamed by his fellow devs, and has been handed the title of first user to ask why everything is down during our maintenance window by our team.\n\nWith that I wish TFTS a happy new year and much luck for anyone else doing maintenance.",
        "created_utc": 1673016662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test Fax Failure",
        "author": "VLDragon",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/104db18/test_fax_failure/",
        "text": "[removed]",
        "created_utc": 1672959964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back on the help desk, Part 3",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1049uc8/back_on_the_help_desk_part_3/",
        "text": "Part 1 is [here](https://www.reddit.com/r/talesfromtechsupport/comments/z7jatb/back_on_the_help_desk/)  \n  \nPart 2 is [here](https://www.reddit.com/r/talesfromtechsupport/comments/zgjcrd/back_on_the_help_desk_part_2/)  \n  \nI’m doing security consulting again, and a twit has decided to rub his shiny SUV up against my not-so-shiny motorcycle.  \n  \nI learn the following:  \n  \n1. That’s wasnt' Nigel.\n2. I’m not as funny as I’d like when I’m angry.\n  \nNot-Nigel yells at me while I try to drag my bike off the side of his SUV.  Insults get exchanged. Not-Nigel roars off and disappears from view.\n  \nI stomp my way back to the help desk pit and throw myself in my chair. I close my eyes and try to zone out for a minute.  \n  \nI’m interrupted by someone trying to get my attention without actually asking for it. Peering over the bullpen walls is a young man, clearly irritated by my idleness.  \n  \nme:”Yes?”  \n  \nIrritated man:”I’ve called you people multiple times about this. I still can’t print”  \n  \nI look around to make sure he’s not addressing someone behind me. Everyone else in this bullpen is busy. I’m about to make an excuse, then shrug my shoulders. What the hell?  \n  \nme:”Sure thing. Take me to your PC and we’ll see what’s going on”  \n  \nIrritated man walks me through the office building. Cubicle walls change from gray to dusty rose and back again on the way.  \n  \nIrritated man shows me a printer queue with a handful of documents, all failing to print. A bit of poking reveals that he’s trying to print to his printer at home. He’s angry about this and initially refuses to believe that this was the problem and insists that I print .pdfs, .doc and .ppt files to prove that the printer works.  \n  \nI even show him how to select his home printer when he’s, you know, home. He’s much less irritated now.   \n  \nI make my way back to the help desk bullpen and try to get back to my actual work. One of the other denizens of the bullpen makes eye contact with me. He’s a skinny young man wearing a corporate golf shirt. He introduces himself as Mark.  \n  \nMark:”Hi. I wanted to interface with you before the day ended”  \n  \nI can’t tell if Mark is trying to talk to me, have sex with me getting me to install a RJ-45 in my brainstem. I’m about to pay more attention to Mark, but my phone rings. It’s Howard, the recruiter who got me this job. This is likely important. I put a hand up to motion to Mark that I need to take this call.  \n  \nMe:”Hi Howard. How’s it going?”  \n  \nHoward:” Heeeyyy, LT. I don’t know how to say this, but what happened between you and Charles?”  \n  \nMe:”I don’t think I know a Charles”  \n  \nHoward:”You had some altercation in the parking lot with a VP. Said a scary biker type threatened him”  \n  \nOh, no.  \n  \nI can hear the blood rush in my ears. Mark’s still talking, oblivious to my phone conversation.  \n  \nI stand up and put my hand over my phone.  \n  \nMe:”Mark, I have to take this. I’ll be back to talk to you in a bit”  \n  \nI walk out to find somewhere quiet to talk with Howard. I pick the arched glass block ceiling’d central hall on the ground floor of this building. This must have been cooler than Hypercolor t-shirts and Z. Cavariccis when it was built. The teal and lemon paint scheme is an effective supporting cast.   \n  \nHoward pipes up:”So, Charles said you insulted him”  \n  \nMe:”Well, that sounds like me. What should I be doing?”  \n  \nHoward:”Is there work you can do elsewhere? Like in another state?”  \n  \nMe:”Huh. I do have some site audits as a part of this engagement. I’ll set them up and go on the road”  \n  \nHoward:”Excellent. I knew you’d have a solution. You’ll need to submit tickets to get time with the teams at the branch offices. Go through the travel agency for plane tickets and hotels”  \n  \nMe:”Mind if I drive rather than flying?”  \n  \nHoward:”I don’t care, as long as the work gets done”  \n  \nMe:”Great. Let the client know that I’ll be out of range of Charles in twenty minutes”  \n  \nHoward:”Awesome. By the way, did you call Charles a ‘no empire having jackass”  \n  \nMe:”That sounds like me. Scary biker type really doesn’t.”  \n  \nHoward laughs and hangs up.  \n  \nI walk back and start gathering my stuff. Mark’s there, still eager to interface.   \n  \nMe:”Hey, Mark. I need access to our ticketing system. Who do I ask?”  \n  \nMark:”I’ll take care of it and enroll you in everything you need”  \n  \nMe:”Thanks, so much, Mark. Great meeting you”  \n  \nFor some reason, Mark seems shocked at my packing up and running out the door to prevent any potential Charles issues. I throw on my jacket, helmet and ride to a local coffee shop to send tickets for my site visits.   \n  \nDespite an eventful day, I’m looking forward to riding home. I have a feeling I’m missing something obvious, but I can’t figure out what it is.",
        "created_utc": 1672952025,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't read for content. Could the problem you posted cause the problem I'm having?",
        "author": "DrHugh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1043g1k/i_cant_read_for_content_could_the_problem_you/",
        "text": "I'm involved in support for a $system which has thousands of users in our company. In order to request accounts, people use a separate $accessRequestApp. We can see which requests have all their approvals and are ready to be set-up in $system.\n\nUnfortunately, the folks who made $accessRequestApp had a bug we discovered late last year, where some approvals might be skipped. So we'd see a request in a \"ready to set-up\" state, but we'd also see that approvals were missing. We reported this, and it took some time for it to get fixed. We asked the folks behind $accessRequestApp if they could restart the affected requests, and they said no. The only thing we could do is reject them when they show up...and that's something we'll have to do by hand, as there is no batch processing in $accessRequestApp.\n\nWell, before scything my way through apparently-approved requests in $accessRequestApp, I sent out an announcement to all our users, telling them that we found a bug in $accessRequestApp, it was fixed, but we have to manually reject a number of requests because they weren't properly approved. If your request gets rejected by us, re-submit it. At the end of this announcement, was our standard \"here's how to reach us if you need support\" paragraph. I should note that chat requests are *not* a support avenue for us.\n\nNot five minutes later, I get a chat request from $user:\n\n**$user**: I saw your message about the bug in $system.  \n**ME:** Well, it was a bug in $accessRequestSystem, which processes requests for accounts for $system.  \n**$user:** Oh. Well, I'm having a problem opening a record in $system. Could that be caused by the bug you mentioned?  \n**$ME:** No. They are separate systems. You need to contact our helpline...\\[details omitted\\]  \n**$user:** Oh. OK. Sorry for the stupid question.",
        "created_utc": 1672936758,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Problematic Printer Photo Tray",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/103bqr0/the_problematic_printer_photo_tray/",
        "text": "A few months ago a ticket came in for our university president's office printer was prompting her to load photo paper, despite her never trying to print photos or needing the option. I scheduled a time to go to her office and look at it, to see the problem. Yep, the printer itself was prompting her despite trying to print normal documents. This is one of those inkjet printers she bought with her own company card, not something we provided. But since she is the President, we do have to provide a white-glove best effort support before telling her to buy a new one. First thing I try is re-installing the driver, which is really just removing/re-adding the printer in the settings but that doesn't fix anything. I messed with the paper tray tabs until the paper seemed to line up in there without extra space; I've seen that issue on laserjet printers that think it's trying to print a different size paper in there until that's fixed. I ran a few test prints without the message coming back, so I figured that fixed it.\n\nA little over a month later, another ticket comes in for the same issue and that there are multiple printers showing up and she wants that cleaned up. She has the same model printer at home, and this has never had the problem with asking for photo paper. So I clear out all the duplicates, and since I've already tried re-installing the driver the last time I decide to do the next logical thing: factory reset the printer entirely. I tell her I plan to do this, and she says to go ahead if that will fix it. After setting it back up and labeling it as her office printer, we do more test prints until we're sure the issue isn't coming back.\n\n[Somehow, the issue returned](https://pbs.twimg.com/media/FNbLXfSXsAUvuVz?format=jpg&amp;name=small). At this point I've already googled some to find others with the same issue on this particular model, but no resolution. I've already told my boss about the situation and she's given the okay to tell her to order a new printer if I've exhausted all of my options. I keep googling relentlessly as it's bothering me why her home printer acts fine and this one doesn't. Finally I come across a forum post of someone saying they removed the photo paper tray to solve this problem. I look up how to do it, and it doesn't look too complicated. I used to be the printer go-to guy in our department which is why I felt comfortable taking this on, so I've done my fair share of maintenance kits/fuser replacements, and other various parts.\n\nI go back to her office, and begin the process of taking the tray out. I'm very careful as I don't want to break anything I can't fix, and I was getting some resistance along the way. This isn't like a laserjet tray you just pull out, it's kind of nested with above the main paper tray in a way that's not easy to remove permanently. Finally I get this thing, and we do more test prints. After we're not seeing the message anymore, I explain what I did and that was hopefully the solution to this problem. She applauded me taking a mechanical approach to a technical issue, and being able to find a creative solution that worked. She kept the tray in a drawer in case it's ever needed for some reason. It's been a couple months since then and I can confidently say it hasn't come back.",
        "created_utc": 1672858779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting Mauled by the Crawls",
        "author": "bobarrgh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1038vw1/getting_mauled_by_the_crawls/",
        "text": "A number of years ago, I was the developer/administrator for a large, international website for a Fortune 100 company. As with many websites, a new website was in the works, so the old website had to be kept limping along until the shiny new one was ready for prime time. And by \"old\", I mean it: the original website had been launched 9 years before!\n\nDue to its age, we constantly ran into limitations, but the one that really hurt the most was that the server hardware was hopelessly out-of-date and was starting to fail. The physical hardware was co-located at an external provider, and it made logical sense to move the servers into the cloud. So we did so.\n\nWe worked through a couple of major issues, such as the one caused by a third-party vendor. This third-party vendor was owned/managed by a personal friend of the newly-hired client IT Director, and he insisted that this other company be involved in the planning and sizing stage. Unfortunately, they sized the database server for the website at 1/2 the size it should have been, and nobody caught it. Well, shame on us, but we got it resolved.\n\nWe got all the issues resolved and things were fine. Or so we thought.\n\nNear the end of the summer, things started happening. The site became bogged down and unresponsive. We had two servers that were load-balanced, but every now and then, one or the other of the servers would stop handling requests and would roll over and play dead. So we restarted the Application Pool and everything was great.\n\nUntil it happened again. And again. And again.\n\nMy life became a living nightmare that followed this schedule:\n\n1. Our European users would try to access the website in the morning. If there was a problem (and, sadly, there usually was), they would send me an email.\n2. Around 3:00 or 4:00 AM, I would get up to go to the bathroom (hey, I'm old, it happens!) and check my email. Dang, gotta pass this along to our DevOps guy. So, off it would go. (By the way, the client was not paying us for instantaneous 24-hour support, which is a little weird given that it was an international site with content in all the major European languages and also Chinese.)\n3. At 7:00 AM, I was at the bus stop waiting for my bus and I would check my email to see if the DevOps guy had gotten my email. Usually, he had not.\n4. At 8:00 AM, when I got into work, I would check my email again, and at 8:15 AM, I would call the DevOps guy and ask him to log in and restart the IIS App Pool. He would do it and I would notify the European team that everything was back up. By this time, the European team would have been unable to do their work for approximately 3-4 hours.\n5. (I would also renew my request to be given access to the servers so I could log in and do this from home, but upper management always rejected my request.)\n\nI was the sole programmer/support developer person on this website. Yes, I was the \"system administrator\", but I was not given physical access to the environments, so my system administration privileges were very limited.\n\nI wrote a program that I was allowed to put onto the web servers. These programs would ping themselves and try to access a given page. They were set up to do this every 5 minutes. If they did not receive a response, then they would go into a ping-every-15-seconds mode. If they did not get a response after the 4th ping, then they would automatically restart the IIS App Pool.\n\nThis reduced the downtime from 3-4 hours to approximately 6 minutes. Better, but why were the darn things dying so much?\n\nI was doing everything I could, including asking for any and all web logs and supporting files. The DevOps guy was sick and tired of handling my requests, but he dutifully zipped up the logs and sent them to me.\n\nOnce I started trying to analyze the files, I realized we had a problem. The log files would not fit into my editor's memory because they were way too big. Uh oh.\n\nI did some tricks and finally got into the files. What I found made my heart sink.\n\nThis poor little website that was sized to handle maybe 10,000 -- 20,000 visits per day was getting absolutely hammered by Baidu crawls. We were getting upwards of 7 million web requests each and every day on both servers.\n\nWhen I dug into it, I saw some really weird URLs. Let's pretend like the website was called \"foobar\\[dot\\]com\". I saw traffic for \"aaa.foobar\\[dot\\]com\", \"aab.foobar\\[dot\\]com\", \"aac.foobar\\[dot\\]com\", and so on, working its way from \"aaa\" to \"zzz\". Each of our hundreds of products across all the languages (more than 10 languages) were being requested, each going from \"aaa\" to \"zzz\". Over and over and over again.\n\nBased on the requestor's information, there were at least 10-20 different Baidu crawlers.\n\nWe finally talked to the client's marketing team in China and found out they had requested that our site be crawled by Baidu for the China market. However, they had not configured it correctly, and it was crawling all of the URLs on our site, even the ones in French, German, Spanish, Italian, and all the other languages. We finally got them to log into the Baidu dashboard to configure it correctly.\n\nWe also discovered that when the website had been set up years earlier, someone had put in a wildcard on the subdomain and had not limited it to just \"www\". Somehow, the Baidu crawlers were scanning every single combination of three-letter subdomains, from \"aaa\" to \"zzz\". There may have also been some numbers in there, as well, such as \"aa1\", \"aa2\"; I don't remember (I'm old, it happens).\n\nHowever, once we got Baidu configured correctly and removed the wildcard domain, everything started working again.\n\nAnd my hair had turned grayer than it had started out in the summer, and I had aged about a decade in three short months!",
        "created_utc": 1672852178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customer called saying their website was down.",
        "author": "nom_nom_nom_nom_lol",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10361tw/customer_called_saying_their_website_was_down/",
        "text": "[removed]",
        "created_utc": 1672845362,
        "upvote_ratio": 1.0
    },
    {
        "title": "The client from hell",
        "author": "Soft-Serve-7072",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10315ja/the_client_from_hell/",
        "text": "[removed]",
        "created_utc": 1672831114,
        "upvote_ratio": 1.0
    },
    {
        "title": "The unchanging security token",
        "author": "hughk",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/102y06q/the_unchanging_security_token/",
        "text": "I have used RSA SecureID tokens for different projects for over two decades now. I don't support them directly but we have to use them to login. You know where you enter the passkey from the token with a pin to login.\n\nI know some people transitioned to mobile based tokens but this is a bank and they like their traditions so we have the key fob things. These tokens are pretty bullet proof and I know of at least one colleague who put it through a washing machine (medium wash) and it continued. If they are within their expiration, they work fine. Even after their expiration, the display goes a bit faint, but they continue for ages.\n\nI received a brand new token with an EU symbol on it for accessing a special network from my regular one where SSO does not work. I couldn't properly activate the new token by setting the first passkey (displayed number).  Didn't work. Escalated to our token support people and I was asked to give two successive passkeys. This time I noticed that the number didn't change, and the bar on the left indicating the minute validity was expiring just stayed the same.\n\nOur tokens team is trying to rush a new one to me before the weekend when I am taking a short holiday but needing it in case I have to work remote.\n\nMoral of this story, anything can fail.",
        "created_utc": 1672820063,
        "upvote_ratio": 1.0
    },
    {
        "title": "A quick one",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/102fwan/a_quick_one/",
        "text": "Got a call from a user today that I work with a lot, claiming she was having issues with our software that connects to our main database; this stores staff/faculty/student credentials, grades, and some personal information like addresses. I wasn't busy at the moment and I figured once I actually saw the problem I would know if it was simple, or something that she should put in a ticket for to a different team. As I'm trying to remote on, I don't see her computer online. I walk her through getting the IP address off her Mac laptop so I can verify it's online.\n\n&gt;Me: If you go to System Preferences, then Network, tell me if you see something the Ethernet adapter.\n\n&gt;User: Yes, I see it.\n\n&gt;Me: Does it say connected?\n\n&gt;User: Yes.\n\n&gt;Me: What's the IP address on the right side of that screen?\n\n&gt;User: It says not connected\n\n*facepalm*\n\nI asked her to try switching the adapter into another port, no change. I asked her to restart and make sure the adapter stays plugged in. She then decides to say she heard from another department that their internet is out, and if I've heard anything about it affecting the rest of campus. This is the first I've heard, maybe it just happened and an email hasn't gone out yet. I ask her to restart anyway, just to see if that does fix it.\n\nWhile it's restarting she mentions that her department's phones are down too, and she's calling from her phone down. I facepalm again, and have to explain that her laptop gets ethernet from the phone. So if the phone is down, there's no active ethernet connection. Which would explain why she couldn't get into certain software, that only worked on ethernet and won't work even on wireless. I asked her to talk to her department and see if anyone has submitted a ticket, and if not make sure they do so that our networking team is aware.",
        "created_utc": 1672771607,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 1",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10299x4/the_airport_part_1/",
        "text": "  \n\nAlright like many of you, I have been inspired by Mr\\_Cartographer. I am also a fellow civil servant having worked for local government entities ranging from my state, local authorities, and municipalities over my career. This is a story from when I was working at an airport. I have generalized the names to remain somewhat more anonymous. I don’t give anyone permission to reuse this if that really even matters when you post something to reddit.\n\nA bit of background.\n\n1. Most of the airlines use a central company called Central Airline System’s monopoly for everything: boarding passes, marketplace, baggage, etc. When you fly and have to go up to the counter, odds are the agent is using some kind of interface that connects to the old ass mainframes hosted by Central Airline System’s monopoly. If Central Airline System’s monopoly or some part of Central Airline System’s monopoly goes down, so do the airlines. Central Airline System’s monopoly is the one ring that controls them all.\n\n2. Airlines use special printers and provide pectabs to the printers. Think of the pectabs basically as template files for your airline boarding passes, bag tags, etc. Central Airline System’s monopoly downloads the pectabs to these printers every time a connection is made to their systems\n\n3. The airport I was at is a Common Use (CU) Airport. The airport owns all of the physical hardware the airlines used. That includes printers, servers, routers, computers, monitors, kiosks, etc. The airlines own the software and there is a vendor that kind of interfaces between the airlines and the airports to assist with issues for the Common Use System itself.\n\nSound like a clusterfuck? You have no idea. I once asked a visiting implementation engineer about how he dealt with all the bullshit that came with being entangled between the airlines and airports. He basically told me “No one has died as a result of our systems”. That comment set the bar really high in my mind for that wonderful system. Kind of a gray area there assuming a pissed off passenger never annihilated an agent and I just haven’t heard about it yet. Hey there is a reason why most airports have security and cops on site. It isn’t just for terrorists.\n\nI worked on the CU system for years. I knew those systems better than most things and I could determine what the issue was most of the time whether it was the airport, airlines, or something in between. I still loathe that system to this day and have a ton of stories and lost time because of it.\n\nDo you remember when TSA Precheck came out? It was a big deal and I remember having to upgrade the firmware on hundreds of printers in order for the TSA Precheck pectab to work properly on the onsite printers. It took me weeks to get it done. So it went pretty smoothly except for one certain airline that could never get their TSA Precheck tickets to print. Their system would only ever print out normal boarding passes even if it was for TSA Precheck. It was a problem at my airport and a couple of other places including Heathrow (in London, UK for returning passengers). Safe to say, there were literally hundreds if not thousands of passengers that were pissed off because of this. I felt terrible for the ticketing agents and I had to answer tons of tickets for this not working with no resolution since I was powerless to fix it. It really bugged me that these folks were taking the brunt of berating from the airline's loyal customers.\n\nThis went on for close to a year. The airline was blaming the airports, common use vendors, hardware vendors, and vice versa. The main focus on fixing the problem was with the printer firmware. Well I can tell you that nothing ever amounted from that approach. The engineers for the printers were based in Europe so nothing ever really got done. Nothing was ever urgent in this particular country and I can’t say I blamed them. The citizens of this country get like 2 months or more of vacation a year and they use it. This is what I learned from talking with their US support engineer. It’s not an insult to Europe, it was just a reality in having to deal with certain problems related to the equipment. Nothing just got done quickly.\n\nThat approach never made much sense to me because I had pretty tight contacts with other CU airports and hardware vendors (CU was so bad to work with I reached out to others for help at times). I knew the type of printers we had were printing this airline’s TSA Pre-Check stuff without an issue at other airports. I expressed this over the months to the involved party's communications about this problem and nothing ever got done about it. Some lowly network guy from the airport didn’t know a thing about anything. It was always “We are waiting on the printer engineers to release new firmware.”\n\nI finally took a shot in the dark and reached out to a guy I knew at Central Airline System’s monopoly that focused on a different airline to ask him if he knew anyone that worked on the problematic airline’s side of things. Backchanneling is always a good skill to have. Anyway that dude asked two friends and those folks asked two friends and so on (think Wayne’). It just so happened that so many people were on the email chain that it hit the target spot on. One developer just said “Of course it doesn’t work because this airline ordered a restriction for the TSA Pre-Check pectab on your airport, Heathrow, and a few other airports”.\n\nI never knew or understood why this restriction was in existence, but it had to come from some high up executive/VP type of person. I found this out and reported it to my contacts at this airline. Well come to discover the person who had sole authority to lift the restriction was on vacation for like a month and no one could get ahold of them. The person just happened to check their email one day a couple of weeks later and immediately questioned why the restriction was ever in place and to lift it immediately. Once the restriction was lifted, I went out to have the airline’s ticket agents print a test boarding pass to check out at the TSA checkpoint and it passed. When I reported back to the ticketing agents, they gave me a round of applause.\n\nI have other stories from the airport I might share. This is just one of many.",
        "created_utc": 1672755302,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 1",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10296e6/the_airport_part_1/",
        "text": "[removed]",
        "created_utc": 1672755015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creating urgency",
        "author": "dk1988",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1028wxg/creating_urgency/",
        "text": "Hi! I've been in tech support for about 5 years and slowly transitioned to DevOps in the last three, but something that still lingers on, no matter what area, what project, what company, etc. Is the unnecessary creation of urgency when there is none.\n\nThe latest example of this happened last week. \n\nI maintain a kubernetes cluster for a small set of apps, including a blog. This blog (Wordpress) has a pipeline that pulls the data from a repo, nothing too fancy, but it works. The other day a dev claimed that when they push the new repo version they didn't see one of the Wordpress themes and that they had to install it manually\\* and that this \"DISRUPTS\" their whole process and that they need this to work flawlessly and that it used to work, and about 2 hours worth of talk about how THIS made their work impossible... \n\nEven if the pipeline didn't work, they only had to install the theme with a couple clicks, and it was solved. This didn't happen for 100 blogs, or a 100 sites, they don't even push more than two times a week, MAYBE 3! (The issue was that the theme was included on the gitignore file).\n\nI hate how some people create a false sense of urgency when there's none. It was a simple problem, with a simple solution, and I only took too long to solve it because I'm kinda dumb and didn't bother to check the gitignore file because \"who would be dumb enough to include the file that you want on gitignore?\".\n\nThat is all, sorry for the vent.",
        "created_utc": 1672754293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guide to MVP Development For Startups",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1026jtt/guide_to_mvp_development_for_startups/",
        "text": "[removed]",
        "created_utc": 1672747881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Digital Credentials: Enhanced Security Over Physical Non-Identity Objects",
        "author": "NancyAlves",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10217ig/digital_credentials_enhanced_security_over/",
        "text": "[removed]",
        "created_utc": 1672729897,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Municipality: Part 7 - Every New Beginning...",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/101v4rd/the_municipality_part_7_every_new_beginning/",
        "text": "Hello everyone!  Here is the last story from my most-recent job.  I think that pretty much sums it up, right there.  All of this is from the best of my memory along with some personal records, and a lot that comes from rumors, gossip, and other people.  However some things are relatively recent, so any inaccuracies are entirely on me.  Also, I don't give permission for anyone else to use this.\n\nTL/DR: ...comes from some other beginning's end.\n\nFor some context, I am not in IT; rather, I'm a GIS (Geographic Information Systems) professional. This particular world is quite small, so I will do what I can to properly anonymize my tale. However, for reference, all these stories take place at my job at a municipality in the American South. Here is my Dramatis Personae for this part:\n\n* **$Me**: Masterful erudite.  Also me.\n* **$GreaterIT**: IT Director. Good guy, horribly overworked, I try to do all I can to make his life a little easier.\n* **$LadyEngineer**: My direct superior.  Hired last year.  Very smart, excellent project manager, probably one of the best supervisors I've ever worked for.\n* **$BigBoss**: The boss of the division I work at.  Very chill, easy-going, but likes things to work.\n* **$TheClerk**: Clerk of the municipality.  She was awesome, became my best friend in the office.\n* **$NewCM**: New City Manager.  Hired on to assist primarily in the planning department.  Nice guy, very insightful.\n* **$AssCM**: Assistant City Manager.  Actually a very nice guy, but horribly cheap and doesn't think of technology as a core part of the enterprise.  Unfortunately the villain of many a tale.\n* **$LadyCM**: Actual City Manager.  Absolutely awesome, one of the best people I've ever worked for, but is insanely busy all the time.\n* **$Kate**: GIS Director for a different city in my state.  Awesome colleague, I knew her through some professional organizations.\n\nI think I informed you all that a few years ago, I started getting a lot of recognition for the things I was doing in GIS.  Everything started out pretty slow.  I began attending local events across my state, trying to get to know people and participate where I could.  I also put myself on a path to get accepted back into graduate school.  I'd never finished my graduate degree and I wanted to.  It took a long time, a lot of money, and a lot of effort, but eventually I got into an online program to work towards my masters.  After I'd been doing this for a little while, I reached out to my new colleagues and asked if it would be ok for me to give some presentations at their events.  Surprisingly, they were very open to this.  So I started doing so.  The first ones I gave were pretty basic, but eventually I started focusing on some of the successes I'd had with the leadership at my municipality - things like the GIS investments I'd managed to sell, illustrations on what GIS could do for the city, discussions on where costs had been saved and value generated, stuff like that.  \n\nA lot of what I talked about showcased the financial side of GIS.  Apparently, this is not a very common topic in the GIS field, though it is one that others find immensely interesting.  What I was doing started making waves - *good* waves, not bad ones.  All of a sudden, I found myself being asked to present at other events, even being approached by the organizers directly!  I started getting articles in publications, had an interview published in a book, and was even cited at conferences by other people.  Surprisingly (to me most of all), I was starting to make a name for myself in the discipline.  Granted, GIS is still a relatively tiny industry (compared to, say, IT and tech support), but what I was saying still gained some traction with a lot of people, even those that I didn't realize were listening in.  Sort of like the hype surrounding the annual baking contest at the county fair - not a world-shattering accomplishment, but an accomplishment nonetheless.  Enough to maybe get more than a participation ribbon - and possibly even knock old Madam Bodewell of her high horse for a year :D\n\nEventually, I *did* get more than a participation ribbon.  A *lot* more, in fact.  I wound up winning, well, an award.  It will remain unnamed, but it is one of the highest profile ones in the field.  I never even dreamed I'd be behind something like this - in fact, when I got the email telling me that we had won this, I actually thought it was spam!  I sent it off to our IT folks to see if it was legit.  I remember **$GreaterIT**'s response:\n\n&gt;**$GreaterIT**: Nope, this looks clean.  Congratulations!\n\nI still wasn't convinced, so I contacted a ton of other folks in the industry to make sure that this was actually real.  Every one said it was.  Holy sh!ts, y'all!  I believe my head literally exploded at the end of that day.  Not really, but still.  I took the award to the leadership of the city - they were so proud of what we had accomplished!  **$LadyCM** even gave me a raise on the spot :)\n\nAfter that, I truly felt that I had come into my own within this discipline.  As I mentioned in previous tales, I had originally wanted to pursue an entirely different career.  That other career was Urban Planning, actually.  Yet after working in government for all these years, what I had discovered was that planning consisted of little more than coming up with a bunch of ideas that nobody pays any attention to, having virtually no ability to implement, build, or create anything, and then getting yelled at by *LITERALLY EVERY PERSON INVOLVED*.  ***Fsck that***.  With GIS, I could create grand architectures and see them filled with data, I could craft apps and dashboards that were awesome, I could create maps that were genuinely beautiful, and I could see the smiles on other's faces as I introduced them to the possibilities offered by this magic we call \"*technology*.\"  So with everything that had happened over the past year, I realized that I didn't *want* to be a planner.  I liked GIS and I felt that I was good at it.  All of this had awakened a passion for this field.  That fire would not easily be put out.\n\nAnd so, I wanted to see GIS move forward here at the municipality.\n\nI got started devising a plan for how I would like to see GIS develop further at the city.  For the most part, I had managed to centralize all the GIS-related tasks under my existing position.  However, I wanted to formalize that relationship.  After all, probably 75% of my current responsibilities weren't in my original job description.  And I didn't want to be the \"GIS guy\" for the city anymore.  How many of you have had your \"responsibility creep\" start to spin out of control as the \"IT people\"?  Pretty sure all the demands to change light bulbs and fix doors get a little tiresome.  Anyways, I didn't want to have an undefined limit of responsibility anymore - I wanted the municipality to have an official GIS Department.  And I wanted to be the *GIS Manager* of that department :)\n\nAs the fiscal year came to a close, I began putting together everything to make my pitch.  I went to speak to the HR Director (who I was pretty good friends with) and asked her if I could get a copy of my original job description (so I could modify it into a GIS Manager role).  I also put together some concepts for what I'd like to see in a GIS Department for the city.  But my main task throughout all this was researching an appropriate salary for this new position.  I looked at other similar positions across the state and researched hiring bands for similar jobs I'd seen in the private sector.  I was also able to get information on the salaries for other managers here at the municipality (because, y'know, public sector and all).  Eventually I settled on a pay rate that I thought was fair.  It was about 10% less than what most of the other managers at the city in similar roles were making, but still was within the average of similar positions across the state.  But for me, it was about a 20-25% raise!  Just to say, I wanted anything that I pitched to be fair and reasonable.  After all, even though I wanted to advance myself, the city had been good to me and I wanted to keep working there.\n\nLiterally the first day of the new fiscal year, I went to speak to **$BigBoss** about all this.  I told him that I wanted to move GIS and my position forward here at the municipality.  He was very receptive to what I was saying.  Though he was also extremely busy, we scheduled a time to talk about it later.  I also sent him all the documents that I'd put together.  And then I waited, as you do.  After the inevitable cancellations and postponements and wedding showers and all of it, I finally got a chance to sit down at the table with everybody about three months later.\n\nAt that discussion, we had **$Me**, **$BigBoss**, and **$LadyEngineer** (who had just been hired).  I laid out directly what I was asking for - a new department and a promotion.  They seemed very enthusiastic - well, at least, as enthusiastic as you could be in the situation.  Can I get a show of hands of who gets excited to see Excel charts and PowerPoint slides?  Me neither.  Anyways, after making my case, they told me that what I had seemed very reasonable.  However, there was a process to follow.  I let them know that I figured it'd take until the next fiscal year (which, if you'll remember, was almost a year away).  Tacitly, I was letting them know that I was willing to wait a long time.  They seemed very appreciative of this.  The next step for me was to speak with the operational management of the city - which, in my case, meant I'd have to get things through **$AssCM**. \\*internal groan\\*\n\nI was a little hesitant about that, as you can imagine.  After all, I was well acquainted with all the issues that **$GreaterIT** had encountered when dealing with **$AssCM**.  However, *my* problems were not **$GreaterIT**'s problems.  I felt like I could at least make a decent pitch.  A few months later, we engineered a meeting with **$AssCM**.  I brought up everything that I wanted to do and submitted my request.  **$AssCM** actually seemed very interested!  He took my presentation materials and set them next to his computer, an explicit acknowledgement to me that he would genuinely review my proposal!  He told me that there might be some issues in getting an entirely new department stood up here, but a promotion sounded like a very real possibility.  *Having one of the city managers say that to me was one of the most amazing things I'd ever heard*.  I left that meeting on cloud nine.  Woohoo!!\n\nFrom here, I then intended to leave well enough alone.  I had gotten the wheels turning; it was now time to let them keep rolling until we either broke the land speed record or crashed into a tree.\n\nBut the odd thing about life is that it rarely abides by your timetable.  Even though I was content to wait almost a whole year for a decision, that wouldn't prevent people from trying to get into contact with me.  As soon as I started getting all that recognition in the industry, I began to have recruiters coming out of the woodwork with offers.  The first were of the standard idiocy you see flung about on LinkedIn:\n\n&gt;**$Recruiter**: We have an exciting new opportunity for you with a 12-month contract that *might* turn into a full time job with no benefits and less pay!  \n&gt;  \n&gt;**$Me**: Awesome!  I have an exciting new opportunity for you to gaze lovingly upon my middle finger, and sit and spin!\n\nYet as the months passed, these contacts gradually became much more serious.  I wound up having at least one major job offer tossed my way each month or so.  I considered a \"major\" offer to be one that either payed me more than I was currently making, or that offered me a supervisory position (or both).   \nIt was crazy!\n\nOne company very nearly stole me away.  Just after I'd given my pitch to **$BigBoss** and **$LadyEngineer**, the VP of an extremely prominent GIS firm contacted me and offered me a job *on the spot*.  The position hadn't even been posted up online yet!  I was blown away.  I'd get to travel throughout the Southeast and work from home when I wasn't out in the field.  The VP wasn't completely committal on the pay, but it looked like this could be upwards of six figures!  I told him that I needed to think about it and asked for some time.  I then spoke to a ton of my family and friends about it.  I called a colleague of mine named **$Kate** and asked her - she said for me to do what I felt was best, but that the job sounded like a great opportunity.  I also spoke to some of my friends at the city who I trusted very much, particularly **$TheClerk**.  **$TheClerk** also recommended that I do what I thought was best, though she did warn me about some of the aspects of having a traveling job.  She was always my sounding rod at the municipality, so I took her opinion very seriously.\n\nUltimately, I decided not to take this opportunity.  I was still going through graduate school, it was a private sector job where my state benefits wouldn't carry over, and numerous other things didn't line up right.  Moreover, I really was banking on getting this promotion at the city.  As such, I called the VP that Friday and declined the job.  He understood.  \n\nI then waved goodbye to highest-paying position that had ever considered me.  No, I'm not a fool.  Stop saying that.  \\*plugs ears\\* *lalalalalala...*\n\nI stayed the course for a while after that.  I was still waiting for some sort of decision or direction from the higher ups, but nothing came.  In the meantime, I managed to finish my masters degree.  I was *immensely* proud of that, so I asked **$LadyEngineer** if I could have some time off to head up to the commencement ceremony (since it was an online program and I never actually been to the campus!)  She was ok with that.  During that same discussion, I queried if she'd heard anything about the things I'd pitched several months before.  She shook her head, saying that they hadn't come to a decision.  She did say that it looked like they were willing to give me a promotion sometime soon, but setting up a new department would take some time and would probably be spread out over a couple of years.  I shrugged my shoulders and told her I understood.  I also thanked her for being honest with me - that was one of the many things I liked about **$LadyEngineer**.\n\nOnly a day or so later, I got a call out of the blue from **$Kate**.  It went like this:\n\n&gt;**$Kate**: Hey $Me!  Hope things are going well for you up at &lt;municipality&gt;!  \n&gt;  \n&gt;**$Me**: Hey $Kate!  Sure, things seem to be going good.  What's up?  \n&gt;  \n&gt;**$Kate**: Hey, I heard about this new GIS job posted at the $Facility and I think you would be a great fit for it!  \n&gt;  \n&gt;**$Me**: Huh... well, honestly $Kate, I'm pushing for a promotion here and I'm not really looking to move.  \n&gt;  \n&gt;**$Kate**: Well I already told them about you.  You should at least put in an application.  \n&gt;  \n&gt;**$Me**: (laughing) Are you serious, $Kate?  That sounds like you.  \n&gt;  \n&gt;**$Kate**: (snickering) Yep!\n\nI then looked up this job that **$Kate** had voluntold me to apply for.  It was at a place that I'll call the **$Facility**.  I'll keep the details vague, but suffice to say that this was one of the highest-profile industrial concerns in my *entire state*.  They were looking for a GIS Director to construct an architecture from the ground up - y'know, *exactly the same type of thing that I had already done at the municipality*.  Without question, I felt that I had every requirement they were asking for in the job description.  \n\nHowever, it was in a city that was about a two hour's drive away from where I was currently living.  Taking a position there would mean moving.  The city I'd be moving to was also one of the most expensive in the state, so I'd have to make sure that I was getting adequately compensated.  The base pay being offered was already a massive increase from what I was making, but I resolved to make sure to ask for more if they brought me in for an interview.  What did I have to lose?  If you're going to go, go all out.  So I filled out an application and submitted it.\n\nI wound up bringing this up to **$TheClerk** over lunch one day.  She asked me about the job and I told her as much as I knew.  She said that if I kept getting pitches like this, eventually someone was going to steal me away.  I laughed and responded that it was all really hinging on the decision for my promotion.  If the city was willing to give me what I was asking for, I would feel like they genuinely valued me.  And I liked working for the municipality anyways.  Someone would have to give me a really huge offer to steal me away after that.  **$TheClerk** said she understood.  After we got done talking, though, she looked a little down.  I asked her why - she laughed that all her friends at the city eventually found something new and left.  I gave her a hug and told her that even if I did leave, I'd still keep in touch.  And I meant it.\n\nA few more months passed.  I got ready to head up to the Midwest for my graduation ceremony.  The **$Facility** wasn't weighing very heavily on my mind - I was much more concerned with the immense amount of work I still had at the municipality as well as my preparations for the trip.  All of a sudden, one week before I was due to leave, I got an email from HR at the **$Facility**:\n\n&gt;**$HR**: Hello $Me!  We would like to bring you in for an interview for the GIS Director position at the $Facility.  Please indicate a time you are available within &lt;the week after next&gt; to meet with us.  Thank you!\n\n...**wut**?!?  Holy crap!  *I'd gotten an interview*!  Unfortunately, the only day I had available during the indicated week was my first day back after driving something like 800 miles.  I would need quite the necromancy - or caffeine - to be able to make it.  Pretty sure they're the same thing.  But nothing ventured, nothing gained, right?  I contacted the HR folks back and told them that I'd show up for the interview on the date in question.  The missiles were in the air!\n\nThe night before the interview, we rolled back into town around midnight.  Again, I had driven back to the Deep South from the Midwest in a single day.  We'd left at like 9 AM that morning.  I don't think the term \"*exhausted*\" does it justice.  Yet when I laid down to get some sleep, I found that I couldn't rest at all!  My mind was racing.  Seriously, I might have slept 30 minutes that whole night!  It wasn't nervousness about the interview - I've found that I'm pretty decent at presenting myself.  That... does not sound like the best choice of words.  Anyways, I couldn't get it out of my head.  I guess it was really what this job would mean for me and my family - new city, new career, new home, new everything.  It was a lot to contemplate.\n\nI had to be to the **$Facility** at 8:00 AM (and it was a 2-hour drive through hellacious morning-commute traffic), so I left the house at 5:00 AM to get there.  Along the way, I was chugging Coke Zeroes and pushing myself back in my seat just to stay awake.  Probably not the smartest thing I've ever done.   \nEventually, I made it to the **$Facility**'s headquarters building.  I was immensely nervous as I headed in; I remember looking at wrinkles on my shirt and some of the worn hems along the ankles of my pants and thinking that I looked a mess.  I didn't think I'd make a good impression in the interview.\n\nAs soon as I got in, the security guard whisked me off to a side conference room.  He told me that the Vice President of Engineering would be down to see me shortly.  I'm sure my eyes bulged at the mention of the person who'd be interviewing me.  I had a small manila folder of some sample GIS reports and documentation that I could use as examples, so I started going through them on the conference table.  About twenty minutes later, a sharply-dressed gentleman walked into the conference room.  He apologized to me, saying that he'd had to put out some sort of fire with the CEO and had been delayed.  I don't know if he saw, but I did a nervous swallow once I heard that - this was the big leagues here, no doubt.\n\nWe then did the interview.  He brought up all the things that they wanted to do with GIS at the **$Facility**.  Periodically, I'd show him a report that would illustrate something very close to the point he was talking about, or I would pull up an app on my phone and showcase a concept that was like something he'd mentioned.  I also found that he'd come from a public utilities background - this was great for me as I had been working in that field now for about five years.  Many of my examples were things he understood well.  \n\nOne thing I did point out was that this new city was significantly more expensive than where I was from.  As such, I wanted a higher rate of pay than the advertised minimum.  I asked for what I thought was a *stupid* amount of money - the rate was within the range for the job, just in the upper part of that range.  He seemed to take it in stride.  Anyways, we got done with the interview, I shook his hand, and then I left to head back home.  His expressions had been hard to read.  While I felt that I'd presented my material well, I didn't feel like I'd made a good impression.  Ultimately, I didn't think that I would be as good a candidate as someone else that had been more \"flashy\" or someone who hadn't asked for as much money.  Oh well.  You win some, you lose some.  At least I'd have a story to tell :)\n\nThe next day when I got into work, **$LadyEngineer** met me and asked me to come speak to her in her office.  I headed over; she was smiling and had a manila envelope on her desk.  It was my promotion!  Hooray! :D  As she gave the paperwork to me, however, she had a sort of apologetic expression on her face.  She said that while everyone had agreed on the job description I had put together, they hadn't agreed about the pay.  They had still given me a raise but it was less than half of what I had asked for.  **$LadyEngineer** told me that she had pushed very hard for the pay that I had requested, but in the end it was turned down.  I looked at the documents she had; my feelings were a little all over the place.  On the one hand, it had gotten the promotion I'd asked for and I had gotten a raise!  But it wasn't the pay that I had asked for.  I didn't want to seem entitled, but I thought that I'd requested something that was very fair to all involved.  I'd even turned down a huge job offer on the hope that my request here would have been met!  Still, I went ahead and signed it, telling **$LadyEngineer** that I would try to do the best job I could do.  She gave me a hug.\n\nLater on, I spoke to **$TheClerk** about it all.  To make y'all aware, **$TheClerk** is the Grey Eminence.  She knows literally *everything* behind the scenes at the city.  She knows all the dirty laundry and knows where *every one* of the bodies is buried.  Anyways, I told her that I'd gotten the promotion I wanted, but that I hadn't gotten the pay I'd asked for.  I was pretty down about that.  She then confided in me that she'd spoken to a number of folks about all this.  Turns out, **$LadyEngineer**, **$BigBoss**, and even the HR Director had advocated for me getting the pay rate I'd asked for!  Each one of them thought I was worth it.  They'd recommended this to the city manager in charge of everything - who was, in this case, **$AssCM**.  *Fsck*.  At the very last minute (literally the day before the promotion was given to me), **$AssCM** cut my raise in half.  The reason?  *He didn't feel that I should be making more money than the other managers here at the city who were actually in charge of people*.  \n\nWhat. The. Fsck, dude?!?  *That's* your reason?  Most of what I do is not managing people and never would be - it's administering an enterprise!  I would wager the DBAs out there would have some... *words*... if some pompous idiot showed up and said they weren't worth their pay because they \"weren't managing enough people.\"  I'd needed immense amounts of experience to be able to accomplish all this!  I had to have multiple degrees!  Basically, what **$TheClerk** was telling me was that **$AssCM** did not recognize that the technical talents I brought to the table were worth more than me being able to manage people.  Christ, it was so... *disheartening*.  And it wasn't like technical skill hadn't been a component of other employees' salaries.  **$GreaterIT** was making even more than what I was asking for, yet he had no employees at the time either.  I told **$TheClerk** that I'd specifically turned down other jobs because I was banking on getting the pay rate I wanted from here - *and now that was all for naught*.  I was very upset.  In many ways, I'd put myself in this place, naively trusting that this would work out the way I had planned.  It didn't make things hurt any less.\n\nFor the next two weeks, I wasn't as... *enthusiastic*, I suppose, as I could have been.  While I did change my email signature and LinkedIn status and all, I didn't bring any attention to the fact that I'd gotten a promotion.  Honestly, I was waiting to see if the **$Facility** would call me back.  If you'll recall, on my previous job hunting adventures, I'd had people contact me within a week with offers.  I guess I was spoiled from that.  However, after about two weeks had passed, I resigned myself that I probably wasn't getting the job at the **$Facility**.  Instead, I had gotten a promotion here at the municipality; it was time to own up to it and start pushing forward with what I wanted to do.  Don't look a gift horse in the mouth, as my grandma would say.  I started picking myself back up at work.  I ordered new business cards.  I started introducing myself with my new title at some of the local events.  Even if it wasn't everything I had wanted, it was still *something*.  And I resolved myself to try and make the best of it :)\n\nA month later, I was writing up my morning notes when I saw something pop up on my personal email on my phone.  Yep, you guessed it.  It was from the HR department at the **$Facility**:\n\n&gt;Dear **$Me**;  \n&gt;  \n&gt;I am pleased to offer you the position of GIS Director here at the **$Facility**!  Your starting salary will be &lt;stupid amount of money, exactly what I'd asked for&gt;.  In addition, we will provide you with a moving stipend to help ease the transition to &lt;new city&gt;.  Your first day will be &lt;day about a month and a half later&gt;.  Please contact me by this Friday with your decision.  We look forward to seeing you hear at the **$Facility**!  \n&gt;  \n&gt;\\- **$Facility HR Team**\n\nY'all... I leaned back in my chair and just looked at this email for a while.  What they had offered to me was *TWICE* my annual salary.  I would be a director.  I would be able to build the *entire GIS infrastructure* for the biggest industrial concern in my state.  After a while, I couldn't help but start grinning like an idiot.\n\nIt took me about an hour to get over my initial shock.  I then called my wife and told her what had happened.  She made lots of squeaky noises.  I printed the offer letter.  I didn't know exactly what I wanted to do at that moment, but I felt like I needed to at least talk about this with my immediate boss, **$LadyEngineer**.  I had come to genuinely trust and respect her.  I wanted to know what she thought.\n\nI went to her office and asked to speak to her for a few minutes.  I shut the door behind me as I did so.  Wordlessly, I put the offer letter on her desk.  She read it; after a few minutes, she looked back to me with a sad smile.  I'm sure I looked sort of nervous in return.  I told her that I had not reached out for this, someone had recommended me.  And I had not made a decision yet.  But I would have to make one soon.  She understood.  She asked me if I would be willing to speak with one of the city managers about it - we'd just hired a new one, **$NewCM**, and she wanted me to talk to him.  I said sure.  I also talked to her about what I'd heard from **$TheClerk** surrounding my promotion; she confirmed everything that had been said to me.  I just shook my head.  But I thanked her for being honest with me, and for being willing to stand up for me.  And I told her that she was probably the best boss I've ever had.\n\nThat night, I spoke to about a dozen of my friends and family members.  Every single one of them recommended that I take the new job.\n\nThe next day, I came in to speak to **$NewCM** first thing in the morning.  I didn't really know what he would try to say to me.  Would he try to make me a counter-offer?  Would he try to dissuade me at all, or simply say goodbye?  I didn't have a good read of him, to be honest - he had only been there a few days at that point.  I went into the meeting uncertain of what to expect.  But once we got to talking, **$NewCM**'s attitude was very friendly and forthcoming.  He said to me that he wasn't trying to talk me into or out of anything.  He just wanted to hear what I had to say.  He asked me what I enjoyed about the job here at the municipality, and so I told him.  He then asked me what I would be doing at the new job, and I went into all the things I could do there.  The opportunity it presented to me, the new vistas and challenges it offered.  I know I was excited when I spoke of it.  At the end, **$NewCM** smiled and said the following:\n\n&gt;**$NewCM**: By the way your face lit up when you talked about the new job, I think you have already made your decision.\n\n*Every new beginning comes from some other beginning's end.*\n\nAfter he said that, I... started to tear up.  I think it was at moment that I finally knew that I would be leaving.  And truth be told, I didn't *want* to leave.  The city had been good to me.  I had made so many lifelong friends here.  But I also knew that an opportunity like this would rarely come again.  We all have to take leaps in our lives, whether we feel comfortable about them or not.  I wanted to be the best GIS professional I could be, to reach the pinnacle of my career.  This job could take me there.  It didn't make the sadness go away, however.  Like when you leave all your friends after graduation.  You know from the moment you step through those doors that it will have to end someday, yet when that day comes, it still comes all too soon.\n\nI took a moment to compose myself and thanked **$NewCM** for speaking to me.  My mind was made up.  I would be leaving the municipality and joining the **$Facility**.  I told my wife that night; she was fully behind me.\n\nThe next morning, when I got into work, I started typing up my letter of resignation.  A few minutes after I started, one of the sewer managers, a super gruff, blunt, to-the-point guy that I'll call **$Gruff** came into my office.  Our conversation went like this:\n\n&gt;**$Gruff**: Hey $Me, I got a couple more sewer lines we need to GPS out in... hey, are you ok?  \n&gt;  \n&gt;**$Me**: (smiling weakly) Yeah, I'm fine.  \n&gt;  \n&gt;**$Gruff**: You don't look fine.  What's up?  \n&gt;  \n&gt;**$Me**: I'm resigning, man.  Sorry.  \n&gt;  \n&gt;**$Gruff**: You're fscking with me.  \n&gt;  \n&gt;**$Me**: Nope.  I'm typing up my letter of resignation right now.\n\nAt that, **$Gruff** *hung his head*.  I'd never seen any kind of emotion in him, ever.  It was actually kind of touching.  Like an Orc petting a kitten.  I told him that I would do my best to work through my notice and I wouldn't leave them in the lurch.  He nodded and thanked me for helping them out all these years.\n\nI then took my letter to **$LadyEngineer** and **$BigBoss**.  Both of them knew.  It wasn't a surprise.  We talked for about an hour, all kinds of things - what I'd be able to do at the new job, reminiscing about old times, stuff still left to do, hilarious stories of horrible contractors, that sort of thing.  In the end, I thanked them for everything and I gave them both hugs.  I told them that they had made my job here the most fulfilling I had ever had in my entire life.  I then went through city hall and told most of the rest of my friends and coworkers, including **$LadyCM** and **$NewCM**.  I didn't bother to tell **$AssCM**, though.  He was the reason I was leaving.  He could find out from someone else.\n\nAfter that, I got everything in order.  The **$Facility** had given me a month and a half before I'd need to start the new job, so I told the city that I'd work out almost a six week notice (seriously, I only took one day off between the old job and the new one).  There was so much that I still had left to do, and I resolved to try and take care of as much of it as I could.  *And d@mned if I did*!  I pushed out data updating products, a major internal webmap service, wrapped up two major projects that had been in the works for years.  I even managed to go through all of the utility customers' accounts and associate City, State, and ZIP fields for each address (something $StupidWorks had never been able to do, the idiots).  I didn't slack *at all*.  I even worked extra hours each night and came in on those few remaining weekends!  Just before I left, I rolled out a highly-successful story map and even presented it to the City Council during one of their meetings.  I intended to leave this position on a high note - *and I feel that I absolutely did* :)\n\nThere was a lot else, too, folks.  I had managed to accomplish so much here.  I meant it when I said this had been the most fulfilling job I'd ever had.  And I had started working for the municipality when my little girl was only 8 months old.  She was 5 now.  All she had ever known was that the municipality was \"*Daddy's Job*.\"  So many memories will be cherished from there.  **$GreaterIT** managed to surreptitiously flip me off every time he saw me before I left, with a little bastardly smile each time he did so :)  We had a nice going-away party for me, and I threw a party for my crews in the utilities department to thank them for the hard work and acceptance they'd shown me over these past many years.  \n\nMy last day was a Thursday.  I brought my little girl with me, just as I'd done at my last job.  I turned in the keys to my city vehicle.  I took all the pictures down in my office, deleted everything off my workstation, and put all my personal effects in my car.  I let my daughter go around city hall and say goodbye to everyone.  The last person she spoke to was **$TheClerk**.  My little girl gave her a big hug and told her that she loved her.  As we drove at the end of that day, we both waved goodbye to the city one final time.\n\nFour days later, I pulled into the staff parking lot of the **$Facility**.  I took a deep breath as I got out of my car.  The smell of salt was strong in the air, with the sound of gulls calling and light flickering off the ocean in front of me.  I could not contain my smile.  I remember hesitating at the entrance for a moment, but just a moment - and then I opened those doors to the next chapter in this wonderful, crazy thing we call life.\n\n:D\n\nAnd that, my friends, is that.  Thus ended my time at the municipality.  Thank you for reading, everybody, and I hope you all have enjoyed these stories.  I'm certain I will have more from the **$Facility** before long.  So until then, Happy New Years, and *don't forget to turn it off and on again* :)\n\nHere are my other stories on TFTS, if you're interested:\n\n* **The Municipality Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/zvn6e9/the_municipality_part_1_the_plotter/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/zwwnwe/the_municipality_part_2_the_database/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/zxt8di/the_municipality_part_3_trois_nouvelles_nouvelles/) [Part 4](https://www.reddit.com/r/talesfromtechsupport/comments/zz8dfw/the_municipality_part_4_the_second_corner_of_the/) [Part 5](https://www.reddit.com/r/talesfromtechsupport/comments/10038rk/the_municipality_part_5_tales_of_thatguy/) [Part 6](https://www.reddit.com/r/talesfromtechsupport/comments/100vvko/the_municipality_part_6_tales_from_greaterit/)\n* **The Agency Series**: [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/sh5m55/the_agency_part_1_the_chaos_begins/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/si0d1y/the_agency_part_2_the_reign_of_badmike/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/sivnc3/the_agency_part_3_the_lawyer/) [Part 4](https://www.reddit.com/r/talesfromtechsupport/comments/sjs025/the_agency_part_4_an_avalanche_of_accountability/) [Part 5](https://www.reddit.com/r/talesfromtechsupport/comments/sknt9k/the_agency_part_5_dont_let_the_door_hit_you/) [Part 6](https://www.reddit.com/r/talesfromtechsupport/comments/sljw99/the_agency_part_6_the_ballad_of_the_bosses/) [Part 7](https://www.reddit.com/r/talesfromtechsupport/comments/smeb69/the_agency_part_7_farewell_adieu_auf_wiedersehen/) [Part 8](https://www.reddit.com/r/talesfromtechsupport/comments/sna2uh/the_agency_part_8_epilogue/)\n* **A Symphony of Fail** [Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/rmasuq/a_symphony_of_fail_part_1/) [Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/rnmk82/a_symphony_of_fail_part_2/) [Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/robtwl/a_symphony_of_fail_part_3_finale/)",
        "created_utc": 1672711823,
        "upvote_ratio": 1.0
    },
    {
        "title": "We own what? Can we get a piece of that?",
        "author": "sunflowerseedeater",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/101t1tm/we_own_what_can_we_get_a_piece_of_that/",
        "text": "I thought I posted this awhile back but have searched and could not find it.  I just found a copy of what I drafted back then in a txt file, so here it is.\n\n\\--\n\nLong time / first time.\n\nI was hired on in the late 90s as a web page curator by the company webmaster. They left shortly thereafter and I took over their position. It was an exciting time to work as most everything IT related had a web component, so I was involved with most if not all major IT initiatives going on at the time. This has made me what I am today.\n\nIn the mid 2010's, towards the end of the company's wind down period (you may guess what Industry we were in), there was a question regarding the two class a subnets the company owned, as we owned them but weren't getting charged for them.  It turned out that they were registered prior to the formation of ARIN (I think I got that right.)  Anyways, long story short, the company owned more than a half million dollars worth of IP address space at the time which we weren't paying for, which was a nice chunk of change at the time, since someone registered them so early on.  It was eventually all transferred I assume to the parent companies.\n\nI hinted to management that the previous webmaster should have gotten a kickback from what they did before I joined the company, but I am certain the parent companies took all of that themselves.  I was gone by that time but I can say I never saw any of that kickback, and probably neither did my predecessor.\n\nHowever, that was a great time to work in the government internet sector for sure!  Fun times and a great experience...",
        "created_utc": 1672706392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Growing the Infrastructure,",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/101kfwo/growing_the_infrastructure/",
        "text": "I am inspired again by Mr\\_Cartographers tales of a public agency being dragged kicking and screaming into the modern IT world.\n\nMy experience was somewhat similar when I arrived at my new University sysadmin job in the summer of 2000.  The fellow who hired me had been having a terrible time filling the position, so he was really glad I was coming on board, and I, being recently laid off, was really glad *to be* coming on board.\n\nAnyway, my boss, **$J**, was very smart, very organized, but kind of young (late twenties), and a very good boss.  He was a wiz at technical stuff, but didn't have a lot of experience with things like budgets, and I'm not sure he had had to do much long range planning.  I was older and I had fair amount of management experience, but I was brand new to this shop so I had a pretty good learning curve ahead of me.\n\n**$J** had built a fantastic Linux shop.  He had created his own desktop imaging system which was really cool.  Boot a desktop off a floppy (yes, in 2000 we still did this), answer prompts about hostname, IP, GW, netmask, and walk away.  All machines, servers and desktops, used open source management software with everything from packages needed to configuration files handled.  Need a new DNS server?  Take machine X, add it to the \"DNS server\" class, Bob's your uncle.\n\nHe'd written a ton of documentation covering every aspect of the network, services, and desktop environment.   Documentation and automation was all managed with a version control system.  There were two backup systems, one to cover a fancy file server and another all the Linux servers.   It was very impressive and it ran super smoothly.\n\nDue to all the automation there was lots of time for us to work on more interesting stuff, very little firefighting.  If a server died, we grabbed a spare machine (usually some old desktop), re-imaged it, let the automation system transform it into what we needed, and that was that.\n\nWhat became clear after I had been there for a short time, was that **$J**  was planning on leaving.  He really wanted to move into a research role at a nearby institution.  He had hired me with the idea that I would take over from him, which was okay with me since if I did this I would be looking at a nice salary increase.\n\nOne of the things that **$J** had managed to do was implement a fairly complex group of services on a pretty tight budget.  Our server room had a total of **two** racks.  One was for patch panels with network switches shoehorned in, and the other held our fancy file server, plus a modem rack.  Again, this is 2000, we ran a PPP server since home broadband was pretty uncommon at this point.  The rest of room (it was kind of long and skinny), had tables running down both long walls.  Old desktop machines were clustered along the tables (or under the tables), with desktop UPS units, monitors, mice, and keyboards, with an occasional KVM switch here or there.  Not every \"server\" had a keyboard/monitor connection, sometimes we were unplugging from one server then plugging into another.\n\nOur network switches were a collection of different un-managed switches, one of which was 10BaseT, all connected to ancient 4U switch (which either 4 or 6 interfaces), which handled the uplink to our main campus network.  Which was 10Mbps.  There were a couple of media converters in the mix, I don't remember why.\n\n**$J** and I discussed how things worked, how did stuff get upgraded, and \"what is our budget?\".  **$J** just looked at me and said, \"We don't have one\".  Further discussion revealed when he needed something, he went to his boss, who went to the big boss, who grumbled and hand waved, and eventually someone asked the department accountant if we had any money, and after a lot of discussion and soul searching, some money *might* be forthcoming.\n\nOkay, we had between 400 and 500 users of various intensity at this time.  Almost twenty tenured faculty, all doing research, graduates students, undergraduates, the department staff (who relied on an NT domain we supported), plus various collaborators both on and off campus.  I was kind of shocked by all this, it seemed like an accident waiting to happen.  **$J** agreed, but the faculty, in general, did not want to spend money on infrastructure.  They wanted new laptops, or desktop machines for their Research Assistants, or some other shiny, new toy.  Not boring stuff that was hidden away in the \"server room\".  BTW, the server room had no fire suppression system or line conditioning, and the HVAC unit was installed so it shared the plenum return with the main building HVAC system.\n\n**$J** was a victim of his own success.  He had designed and built a system out of used desktop hardware and open source software, and it worked really well.  But it had NO defense in depth.   And no one wanted to give us more money since everything was working fine, right?  We'll talk about it next fiscal year.  The other factor, I think, was **$J**'s age.  He wasn't thirty yet and most of faculty considered him kind of an older student.  I occasionally overheard snarky comments from professors regarding **$J**, which was upsetting.  These folks didn't realize what an outstanding job he had done, mostly on his own, that provided them a highly adaptable, if somewhat fragile, toolbox.\n\nAnd finally **$J** got a job offer from the other institution, and the entire beautiful house of cards was now mine.\n\nOne of the first things I did was meet with our Department Administrator (**$DA**).   **$DA** was one of the most organized and generally awesome people I ever worked with.   She a million things to deal with but she was always super helpful to me.  Anyway, I met with her and laid out my concerns and suggested we plan for some hardware replacement on an ongoing basis.  She explained we didn't really have a line item in our budget for this, however, there was another idea.\n\n**$DA**  \"Could you use the student money?\"\n\n**$Me** \"What is the student money?  I've never heard of it\"\n\n**$DA**  \"Every course we teach has an extra charge added on over and above tuition\"\n\n**$Me** (confused) \"Why is that?\"\n\n**$DA**  \"Most of the Engineering courses have this.  Its to cover stuff like lab supplies and equipment.  Or special software that needs to be purchased or licensed.\"\n\n**$Me** \"So, computers, printers, paper?\"\n\n**$DA** \"As long as its for students\"\n\n**$Me** \"How much money do we have?\"\n\n**$DA**  \"Hum, actually we haven't been spending it recently, let me check\"  &lt;logs into University ERP system, or what passed for one in those days&gt;  \"Oh, there's $150,000\".\n\nI about fell out of my chair at this point.  We were just sitting on this money?  If I was a student I'd be up in arms, if I'm paying money for \"technology\", how's about you spend it on technology?\n\nIt turned out there were a couple of other possible sources of money.  The University would sometimes kick back money it skimmed from research grants (overhead) to the various Deans of the various schools and colleges.  And the Deans would generally kick that back to the various departments.  Our department also had been awarded a large grant for improving infrastructure a couple of years ago.  I had not heard of this.  Apparently the big boss, **$BB**, liked being able to brag about this grant so he refused to spend any of it!  Every year he asked the agency that had provided the grant for an extension, and so far they had approved an extension.  This was crazy.  Infrastructure was exactly our weakest link and we actually had a pile of money we WERE NOT touching.\n\nI emailed my boss to request a meeting.  He was super busy but we got together, I made my pitch about our fragile set up.  He agreed and basically said, \"put together a plan, get input from **$DA**, and our accountant, he'd take it to **$BB**.\n\nOver the next few weeks I was able to figure out what we actually spent on various stuff, what funding we generally received, and put together a proposal that we sequester certain amounts from various accounts and transfer this into a NEW account that was for upgrades/replacements/improvements.\n\nIt took a while to sell it to **$BB**, but he eventually gave in and I had my funding.\n\nI had already done an evaluation of our \"servers\", figuring out which ones were for the high jump.  I also decided we were going to switch from using desktop machines for servers and use rack mount machines.  We had limited floor space and the number of machines I was expected to host in the server room was growing monthly as faculty purchased research systems that needed to live somewhere.  So I bought a couple of racks, had my student employees clear one of the tables off by moving the various desktops to other temporary locations, and bought some nice rack mount boxes to replace them.  I bought a rack mount UPS as well and finally retired one group of tired old machines.\n\nThen I bought another rack, had my students clear another table, bought some more RM servers, and so on.  We just snowballed things from there.  And then **$DA** informed me that the agency that provided the infrastructure grant had refused **$BB**'s request for another extension.  We had a year to spend it, I think we had several hundred thousand more dollars suddenly.  **$BB** kind of \"pork barreled\" this out to some of the senior faculty, but I did get a pretty big chunk for, you know, actual infrastructure.   I think I upgraded the switch stack so that at least we had uniform hardware and we got rid of the ancient giant switch and replaced with something from the twenty first century.\n\nI couldn't do anything about the room itself.  As we added computers the heat load went up as well as the electrical load.  I had the campus electricians in to add more circuits (I had inherited a mess of power strips), and luckily the server room had its own panel with a high capacity so we could keep adding breakers.\n\nThe heat load was what finally killed my grand schemes.  We got to the point where in the summer months we could not maintain a proper working temperature.  I had to tell the faculty we couldn't host anymore machines in the server room, if they bought a \"research server\" it would have to housed in their lab space.  This wasn't addressed until we had a major crisis, recounted here:\n\n[https://www.reddit.com/r/talesfromtechsupport/comments/ojledi/how\\_much\\_support\\_do\\_you\\_need\\_the\\_cost\\_of\\_nines/](https://www.reddit.com/r/talesfromtechsupport/comments/ojledi/how_much_support_do_you_need_the_cost_of_nines/)\n\nAny, apologies if this is too long/boring/whatever, but time hangs heavy on a retired guy's hands.",
        "created_utc": 1672685935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your wifi turned on?",
        "author": "colexian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1011sv8/is_your_wifi_turned_on/",
        "text": "[removed]",
        "created_utc": 1672629417,
        "upvote_ratio": 1.0
    },
    {
        "title": "But I will get Electrocuted……...",
        "author": "Intelligent-Ad8967",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1009cuv/but_i_will_get_electrocuted/",
        "text": "Long Time Lurker First time Posting,\n\n**I currently work for a Media Solutions company that primarily deals with VDS panels, (basically, a TV that only displays assigned media content from our servers) and Media Players connected to Digital Displays in Movie Theaters and Bars.**\n\n**Earlier this year we had a Movie theater that was having issues with 3 of its Media Players connecting to the locations Network. After exhausting ALL Level 1 Troubleshooting over the phone with the location we decided to send out a Tech to perform on-site troubleshooting.**\n\n**Fast Forward to 2 days later Tech is on-site and calls into support for instructions/directions on what to do. (Yes, it was included in his work order, but READING has now become a lost art apparently.)**\n\n**The call is transferred to me by a T1 agent as T2 and above are the only agents that can deal with network issues with any location.**\n\n**The People in this called are as follows:**\n\n**Me: Obviously Me**\n\n**Tech: Tech on site**\n\n**TSE: Higher Support**\n\n**The call went as follows.**\n\nMe:” Thank you for calling Company I work at Tech support my name is Me how can I help you.”\n\nTech: “Yes, this is Tech at Job ID 1234567 calling in for further instructions on why I am here.”\n\n**Pulls up Ticket**\n\nMe: “Yes, This location seems to be having issues with 3 of their media players connecting to the Network.“\n\nTech: “How do you know? All their Displays are playing or displaying content and Movie Trailers/Posters.”\n\nMe: “We cannot access the Media players remotely and are showing they have been offline for 3 days now. Also, our Media players will still display content for 30 days even while they are offline but once that content schedule expires the Media player will default to a black screen or the company logo and the display will eventually power itself off due to inactivity.”\n\nTech: “Oh, do you know where the media players are located.”\n\nMe: “Yes, all of our media players are installed in the Network Room in the ISP network rack. Ask the Manager on Duty to take you to the Network Room.”\n\nTech: “The Manager said they don’t a network room.”\n\n**I am Now Thankful this isn’t a Video call because my facial expressions are a dead giveaway of my frustrated confusion.** \n\nMe: “What? Are you sure you are talking to the Manager and not the Box Office attendant?”\n\n**After a brief pause** \n\nTech: “Oh Hold on the Kid I was just talking to is going to get the GM.”\n\nMe: “Perfect…”\n\n**As you can tell this is already going downhill and I’ve only been on the phone for less than 5 mins. Sometimes, I wonder where my company finds some of the 1099 Techs to work some of our Jobs**.\n\nTech: “Ok I am in the Network Room, but there are 5 different racks in here with thousands of network cables running everywhere.”\n\nMe: “Is there a rack that has an SX Network label on the top?”\n\n**Long Pause………. And all I can hear is clicking like someone is sending a text message.**\n\nMe: “Hello are you still there”\n\nTech: “Oh Sorry my wife was texting me about our dinner plans”\n\n**Yes, he actually told me that and continued to finish his text message before answering my question.**\n\nMe: “Ok do you see a rack labeled SX Network?”\n\nTech: “Yes, it has 7 square boxes all with different labels”\n\nMe: “Do you see the following 3 Media players SX-1, SX-2, SX-3?”\n\nTech: “Yes, the SX-1 player the network cable is broken RJ45 clip and just hanging, and the SX-2, and SX-3 players do not have any network cables attached at all.”\n\nMe: “Ok, Let's see if we can Locate the SX-2 &amp; 3 players' Network Cable. Do you see any random unplugged Ethernet cables directly around the SX-2, and SX-3 players?” \n\n**I now start praying to the tech gods that the 2 network cables that are unplugged are the only 2 that are unplugged and that we are not facing a ball of cable spaghetti where we are going to have to figure out what cable goes where.**\n\nTech: “I found 2 network cables. They are the only 2 I see but, the Clips are also broken off the RJ45 end.”\n\nMe: “Perfect, looks like we are going to replace the 3 RJ45 ends and reconnect the cables to all 3 players.”\n\nTech: “OK I’m going to have to go find the GM again because I’m going to need to locate the breaker box to cut the power to the entire theater to replace those RJ45 ends.”\n\n**After a brief pause** \n\nMe: “WHAT????????” \n\n**Thinking I misheard what the tech just said.**\n\nTech: “I’m going to have to go find the GM because I’m going to need to locate the breaker box to cut the power to the entire theater to replace those RJ45 ends. I can’t cut the ends off of those cables with the power on or I will be electrocuted.”\n\n**At this point, I realize I had heard him correctly the first time and I am not crazy.**\n\nTech: “Hello.”\n\nMe: “Uhhhhhh…… Your chances of being electrocuted by cutting ethernet cables to replace the RJ45 ends are extremely Low. Ethernet cables are only 48 volts DC which is not a true electrocution hazard. The GM isn’t going to let you cut the power off to the whole theater while customers are currently watching movies. You can cut and replace the cable without cutting the power to the entire theater.”\n\nTech: “NO!!!!!  I will be electrocuted and I’m not dying so a Movie Theater can display digital menus and posters.”\n\nMe: “We are NOT asking the GM to cut the power to the entire theater to fix the RJ45 end. You can trace the Ethernet cable back to the modem or Hub and disconnect it from the other end and then there will be ZERO risk of electrocution while cutting the cable to repair it.\n\nTech: “NO, it’s not even worth fixing an old cable. Too much effort for questionable results. All 3 Cables will need to be replaced.”\n\n**Head meets desk**\n\nMe: “Do you have 3 20ft ethernet cables that can be used to replace the existing cables?”\n\nTech: “No”\n\nMe: “Ok so we will need to replace the RJ45 ends.”\n\nTech: “Yea I don’t feel safe doing that. You will need to send a new tech to replace the 3 cables cable because I’m not getting electrocuted replacing those ends.”\n\nMe: “If you unplug the cable at the other end there is ZERO risk of electrocution.”\n\nTech: “Yea I’m not doing that.”\n\n**At this point, I am ready to Yeet myself off a cliff. Thinking on the fly I remember a temporary fix I have used at home when I didn’t have a replacement RJ45 end. I needed to get these Players online to push updates for the weekend release of 3 Major movies even if it was just long enough to update the 3 players.**\n\nMe: “Do you by chance have 3 rubber bands?”\n\nTech: “Yeeeeaaaaaaa”\n\nMe: “OK can you take 1 rubber band and wrap it around the broken RJ45 ends on each cable and plug them back in to the Media Player?”\n\nTech: “Yea but I don’t see the Point”\n\nMe: “I just need to get these players online long enough to push the updates for 3 Major Movies opening this weekend, after that, I could care less if they stay online until I can send another Tech to replace the RJ45 ends.”\n\n**While I wait for the tech to attach the rubber bands to the broken RJ45 ends I send my Higher Support a Teams Message.**\n\nMe: “Soooooo the tech at Job 1234567 is refusing to replace the RJ45 ends on the ethernet cables because he will be Electrocuted. He does not have 3 20ft replacement cables and will only replace the RJ45 ends if he can cut the power off at the breaker to the entire theater.”\n\nTSE: “Am I having a stroke?”\n\nMe: “Nope Ha Ha.”\n\nTSE: “Did you tell him to unplug it from the other end and the chance he will be electrocuted goes to Zero.”\n\nMe: “I now think I am having a Stroke?.. You realize who you talking to right? Of course, I did and he refused and stated he would only replace the ends if he could cut the power to the entire theater. I am having him place rubber bands on the broken RJ45 ends a plug them back in and I will dispatch a Company Tech to replace the RJ45 Ends next week.”\n\nTSE: “Ahh the rubber band trick that should work until we can revisit. Also, M Code that tech and make Dispatch aware that this tech is to NEVER be assigned to any of our Jobs again.”\n\nMe: “Already Done!”\n\nTech: “OK all 3 Media players have the cables plugged back in”\n\nMe: “Ok get your sign-off sheet from the GM and email it to [company@iworkat.org](mailto:company@iworkat.org) and I will get you checked out and cleared from the site.\n\nTech: “OK”\n\n**While I was waiting for the tech's sign-off paperwork, I pulled up the location’s media players in Splashtop and all the players were online. I pushed the updates to the 3 players, and they started downloading. The tech sends in his sign-off sheet and I close out the work order making sure to notate in the Notes for Dispatch to NEVER assign this tech to any of My department’s jobs again.**\n\n**I open a new Dispatch ticket and make sure to notate to only Assign a Company Tech to this job.** \n\n**I happened to be off the day the tech was back at the location but they repaired the 3 broken RJ45 ends and the Network Issues were resolved.** \n\n**NO, they were NOT electrocuted and did NOT cut the Power to the entire theater to do so.**",
        "created_utc": 1672538506,
        "upvote_ratio": 1.0
    },
    {
        "title": "No need to pay for Internet, you’ve got \"The Physician's Wireless\"!",
        "author": "_my_home_account_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1006cku/no_need_to_pay_for_internet_youve_got_the/",
        "text": "I used to work at a hospital owned by a large for-profit hospital system in the ‘Local IT’ department.  ‘Corporate IT’ ran the network.  Local IT ran desktop support and were the hands of Corporate IT for anything they couldn’t do remotely.  But Local IT did not report to Corporate IT, we reported to the local hospital administration.  In theory, we were one happy family but there was a large disconnect between Corporate IT and Local IT.\n\nOur ‘leader’ of Local IT was IT Director ‘Brillo’.  Brillo was not a technical director by any definition.  He was strictly an administrative director.  However, Corporate IT would send him information as if he were a technical director.  Anything Brillo didn’t understand, he would simply ignore.  Anything that changed ‘without notice’, would be blamed on Corporate IT not caring.\n\nOne day Brillo received an email that he didn’t ignore.  Corporate IT was adding a new WiFi network for hospital employees to use on their personal devices with a slightly higher priority than the guest network.\n\nHowever, Brillo told administration and medical staff that this WiFi network was available everywhere.   Not just in the hospital buildings, but at home.  On the road.  On vacation!  No need to pay for Internet, you’ve got “The Physician’s Wireless”!  Brillo called it the ‘physician’s wireless’ so he could say that Corporate IT wanted it restricted to medical staff only, but he’ll do you a favor and have one of HIS guys hook everyone else up too, you know, because Local rules and Corporate drools.  Or something like that.\n\nOnce we explained to that WiFi doesn’t work like that, and that this wasn’t a cellular connection of any sort, he of course blamed Corporate IT for being ‘cheap’ and limiting the range.  We thought he might get in at least a little bit of hot water for his claims, but no.  In the end, we had to explain to everyone the limits of the WiFi, set everyone up that wanted it, and Brillo went back to ignoring Corporate IT emails.",
        "created_utc": 1672528771,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Municipality: Part 5 - Tales of $ThatGuy",
        "author": "Mr_Cartographer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10038rk/the_municipality_part_5_tales_of_thatguy/",
        "text": "[removed]",
        "created_utc": 1672519510,
        "upvote_ratio": 1.0
    },
    {
        "title": "so helpful",
        "author": "Wise_Improvement_284",
        "url": "/r/ofcoursethatsathing/comments/zzr5zs/so_helpful/",
        "text": "",
        "created_utc": 1672504938,
        "upvote_ratio": 1.0
    },
    {
        "title": "The dinosaur won't let me!",
        "author": "Texas_Technician",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zzmoly/the_dinosaur_wont_let_me/",
        "text": "Standing in the dining room with my future wife and other future   relatives.  My darling future niece (5 yo) said:\n\n\"Uncle T, can I play a game on your computer?\"\n\nI said, \"Sure\".\n\nA minute passes and my darling future niece loudly exclaims :\n\n\"the dinosaur won't let me! \"\n\nI catch the eyes of every adult around me and land on my future wife.\n\nThe future wife says, \"I know what she means\". And heads over to fix the problem. \n\nI hear beeping noises I've not heard before.  Still perplexed by wtf is going on I walk over to see my future wife playing a side scroll game with a dinosaur. \n\nAnd that's the story of how a seasoned IT guy learned about the Chrome browsers built in video game.  Used to entertain ppl when the internet is out.",
        "created_utc": 1672465327,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not in IT, but I'll fix a printer by knowing too much for my own good.",
        "author": "Jabberwocky918",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/zzci5y/im_not_in_it_but_ill_fix_a_printer_by_knowing_too/",
        "text": "Short and dumb like me.\n\nElectrical maintenance supervisor bought a new printer for 11×14 schematics because 8×11 honestly doesn't cut it. Originally, he had it in his office, but it was getting cluttered in there, and he wanted to move it out to a common area.\n\nPrinter rule #1: If the printer is happy, don't mess with it, don't touch it, and definitely don't move it.\n\nHe broke that rule twice - he wanted to move another, far more commonly used, printer to a different location to keep his new one closer to his office. *le sigh* So needy.\n\nSo, while waiting for IT to show up after a ticket was put in, we moved the printers around. The second printer at my suggestion was moved closer to other supervisors who used it more frequently than anyone else, and when IT showed up, that was the printer he decided to start working on first.\n\nHe connects to the network on a phone to view and change settings and starts trying to make adjustments. While he's doing that, I'm giving the electrical supervisor grief for having all this sillyness being done. \n\nThe IT guy is having trouble getting everything to work on the 8×11 printer, and I make the joke that he should just swap the cables in the patch panel. I say a joke, because while I figured that's why that patch panel exists, I have no idea what our IT team is allowed to do for corporate requirements, and I'm not about to get this guy in trouble.\n\nHe stops his work though and admits he never even thought about that. Swaps the cables around, and the 8×11 works again. Huzzah!\n\nThe 11×14 is still printing random gibberish at random times of the day, and I am not about to try anything with drivers and print servers. Nope.",
        "created_utc": 1672436805,
        "upvote_ratio": 1.0
    }
]