[
    {
        "title": "Tips for parking while doing downtown deliveries?",
        "author": "rman111z",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ybu0v/tips_for_parking_while_doing_downtown_deliveries/",
        "text": "I recently got a job doing deliveries at a downtown location and it's been going well. My only concern is the parking while doing deliveries. I do many deliveries to people living there and often, unless the building is good and has temporary delivery parking, the only parking is street metered or reserved parking. I'm wondering how you guys do this? My company doesn't have us use any car toppers or anything identifying us as delivery guys. So far I've just been parking in reserved spots because I'm assuming no one's gonna come and tow me in the few minutes (at most) I'm doing the delivery.",
        "created_utc": 1451166880,
        "upvote_ratio": ""
    },
    {
        "title": "Scheduling conflict",
        "author": "MoistWalrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ybh9b/scheduling_conflict/",
        "text": "Tuesday my step-dad let me know he was having a surprise party for my mom's 50th birthday on the 26th. So the next day I went by work and asked if I could get Saturday off, my GM said if I worked that night we would be square. So I proceeded to work a shift that seemed like Dante's day in Clerks, but it was worth it to be at mom's party. So today I went by work to confirm that everything was okay for me to take off. However when I did my manager told me I still had to come in, because they (I'm keeping gender neutral for anonymity) couldn't come in this morning and had to get one of the other drivers to fill in as opening manager. I protested saying that we had a deal and I was leaving town this afternoon. They tried to pressure me into coming in regardless, but I stood strong\n\nHow would any of you handled the situation?",
        "created_utc": 1451160464,
        "upvote_ratio": ""
    },
    {
        "title": "\"You too, sir\" [Coarse Language]",
        "author": "MattyMarshun",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y6f0m/you_too_sir_coarse_language/",
        "text": "Tl;Dr a customer told me to get fucked and I said \"you too, sir.\"\n\nWe had mailbox vouchers with our best deal, 3 pizzas, 2 drinks and 2 sides for $30. Easily the best deal anyone had at the time, but that was because it was an online ordering promo- it was incentive to sign up and make an account so you could keep getting these vouchers and order online all the time which saves in-store employee time etc etc. The point is, it's an online only voucher.\n\nI was a delivery guy but it was a slow night so I answered a call. The customer on the phone explains that he has a voucher and he tried ordering online but he's having computer problems so he asked if he could order over the phone. I tell him of course he can. He hasn't mentioned the online voucher at this stage. He asks for delivery and lists 3 pizzas he wants. I try to upsell (my managers were in the store at the time and they loved it when we tried to upsell) and he says \"doesn't it come with 2 garlic breads and 2 large drinks?\"\n\nSo it clicked that he's looking for the online deal but I asked just to make sure. He said \"yes, I told you I can't get online\" and I tell him I can't put the deal through on our system (I had tried earlier that night with a nicer customer) as it is a deal for our online customers only. Then he goes into a rant about not being able to get online and just wanting to order over the phone.\n\nWhen I finally can get a word in I apologise for the inconvenience and tell him I'll ask my manager what we can do. I went over to my manager who had actually been listening to my half the whole time anyway (he was looking for someone to nominate for the Manager In Training program) and he just tells me \"Nah, online only. The code won't work.\" I ask if he'd mind telling the customer that as a manager so the idiot would take a hint. My manager of course wanted to see how I'd handle it and tells me to carry on but he picked up the other line to listen in.\n\nI tell the customer that the store manager said the voucher won't work unless he uses it online but I offered to use the vouchers I had in store to bring the price down and he carries on with his rant. I tell him a final time that we can't use the voucher and he says \"alright, get fucked then!\" And in my politest customer service voice I reply \"you too, sir.\" And hung up.\n\nMy manager had a good laugh about it and told his 2ic who in turn had a good laugh. The guy called back later, manager was taking his order when he tried to same voucher again. He got a bit more verbal and my manager banned him from our store and blocked the number.",
        "created_utc": 1451046854,
        "upvote_ratio": ""
    },
    {
        "title": "How good did you do Christmas eve? My tips were abismal.",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y5pl1/how_good_did_you_do_christmas_eve_my_tips_were/",
        "text": "From 5-9 closer, I took 5 runs. Three out of five were no tips. I made $9 from 5-10 in tips. Tuesday was bad avg tip too, but tonight was much worse. The reason for my bad night? Most of the deliveries I went to were from areas and people that are notoriously bad tippers. Same story for Tuesday. \n\nI think my company should change their name to pizza hood. \n\nBecause the lazy, moves in one speed shift manager, that keeps requesting to be taken off each night she closes, we got out almost 2 hours after close again. \n\nWhy? Because she's lazy, talks and plays around too much, doesn't make other lazy employees work when it's slow, leaves most of the work to be done at the end of the night.\n\nAs a driver, I throw it in her face often that I will do all the physical closing work, including her work, and we will get out 2 hours after close, with sarcasm. \n\nShe's young, lazy, a drama queen that loves to argue and start shit with people, and must be treated like the delicate flower that she is. \n\nIf we could harness the power of her mouth and whining, we could get a lot more work done.\n\nI close 3x a week. She seems to want the easiest shifts. The other girl that is picking up more closing shifts, works much harder than she does, and only complains that it seems like she's getting the shaft from the other shifts because they don't want to close anymore. \n\nI like her because she is a hard worker and does many things to help get out quicker. I'm not lazy but I don't like it when the shift leaves everything for me to do and bitches and whines why it is taking so long to go home!",
        "created_utc": 1451023909,
        "upvote_ratio": ""
    },
    {
        "title": "well, that was awkward.",
        "author": "karlamorgan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y51rj/well_that_was_awkward/",
        "text": "this happened a few days ago. handed off the food to the customer, and gave a \"thanks for your order, have a good Christmas!\" while turning around to leave. i hear the guy sharply exhale and my immediate thought is, 'uh oh, i offended this guy'. so i turn around, and out of his mouth comes a dejected and forlorn, \"well, it won't be a good Christmas, my wife just died\".\n\nmy mouth agape like a trout, i sputtered out a \"oh my gosh, i'm so sorry! i....errr...\", he let out some mumbles as well, and with no idea what else to say, i uncomfortably and awkwardly walked back to my car. \n\nhave a good Christmas, /r/TalesFromThePizzaGuy!",
        "created_utc": 1451007633,
        "upvote_ratio": ""
    },
    {
        "title": "The Maury Show",
        "author": "beatuplunch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y410a/the_maury_show/",
        "text": "A few weeks ago I took a call from a customer that had placed an online delivery order asking if I could send a note along with her order.\nTurns out she was a producer from the Maury Show and their way of contacting guests they lost contact with/can't lock down is to send pizza to their last known address with a note asking the person to call the show runners. \nWe ended up cancelling the order when we realized the recipient had no idea it was coming and possibly didn't even live at the address we were given. \nAnyone else ever deal with something like this?",
        "created_utc": 1450986756,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for calling ___,",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y3mrx/thanks_for_calling/",
        "text": "Me: \"Would you please h-\"\n\nCustomer: \"Hi, yeah do you guys deliver?\"\n\nMe: \"Yeah, but would you mind h-\"\n\nCustomer: \"Awesome! I'd like a large cheese with extra sauce.\"\n\nMe: \"No problem miss, but we're a little busy can you just h-\"\n\nCustomer: \"Oh and I also want to pay with my card.\"\n\nMe: \"Please hold.\"\n\nGotta love when the customer refuses to hear what you're trying to tell them.",
        "created_utc": 1450979252,
        "upvote_ratio": ""
    },
    {
        "title": "A Christmas Poem for you guys.",
        "author": "sumpinlikedat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y2pbp/a_christmas_poem_for_you_guys/",
        "text": "'Twas the day before Christmas, and all through the town,\n\nSome folks wanted food so we couldn't sit down. \n\nTheir addresses hung by their doorways with care,\n\nIn hopes their delivery guy soon would be there. \n\nWhen out on the doorstep there was such a clatter, \n\nThey slunk (slowly) to the door to see what was the matter!\n\nThe delivery guy brought them the food oh so quick,\n\nBut no one on Earth wants to play like St Nick,\n\nSo the delivery guy goes home after another long day\n\nWith nothing but measly minimum pay. ",
        "created_utc": 1450957513,
        "upvote_ratio": ""
    },
    {
        "title": "Last night I decided that the customer isn't always right and refused to apologize. Chaos ensues. [UPDATE]",
        "author": "fuzzysocks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y2a6b/last_night_i_decided_that_the_customer_isnt/",
        "text": "Many of you are probably wondering how this is all unfolding.\n\n[Backstory here](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xr68s/last_night_i_decided_that_the_customer_isnt/)\n\nWell, as the guy said, he is actively trying to have me fired. He has contacted corporate through three emails and spoken to my boss. I wasn't able to reach my boss that night, but I did speak with my district manager. Not knowing the full story, my boss offered the guy a free pizza. When he rang the fake number provided for the order C answered the phone and my boss asked him how is he supposed to be able to help him as a valued customer if we have hundreds of dollars of food wasted because of this.\n\nC insisted that I looked up his phone number in our system and framed him with the fake order. My boss and I both know that it was the first time that phone number has ever been used because our system tracks the number or orders under every phone number. After their conversation ended, C called back in a panic asking if this is going to show up on his credit report or if he is going to have to talk to the police. He honestly didn't think through the fact that he used his cell number.\n\nIt gets more interesting too. My coworker googled his name and an article popped up about him. He is a transit worker in a popular, big bay area city in California. The article was about abuse of customers on behalf of Transit workers and listed him as the fourth most complained about worker, with 72 complaints in three years. They had an investigative journalist gather videos of him abusing customers. The article highlighted him cursing at customers, refusing to let someone pay an old lady's fare, and refusing to open the door for someone wanting to exit. \n\nHe used his work number to place the prank call. What would you guys do?\n\nEDIT: I decided to file a formal police report for theft for the amount of the Pizzas. I also included in the report that he wouldn't leave when asked, was racially harassing my employees and myself, and that as a supervisor I need to know that I have the support of the police in practicing our right to refuse service.\n\nI also emailed his employer.\n\nI'm not sure what is going to happen, but I feel like I did the right thing. Worst case scenario, he comes down and tries to physically harm me at work. Look for my story in the news just in case because this guy is relentless.",
        "created_utc": 1450944203,
        "upvote_ratio": ""
    },
    {
        "title": "You explain it to them- round 1&amp;2",
        "author": "IsaapEirias",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y23sm/you_explain_it_to_them_round_12/",
        "text": "With my bike delivery job I've become fairly accustomed to dealing with security, I'd need both hands and a foot to count the number of government buildings we deliver to on a regular basis. But for some reason our **wonderful**^^sorry ^^if ^^the ^^dripping ^^sarcasm ^^poisoned ^^you building that houses our state governor and House of representatives along with at least a dozen handfuls of other minor agencies ^^I ^^think ^^someone ^^was ^^making ^^a ^^statement ^^when ^^they ^^placed ^^the ^^State ^^board ^^of ^^Sanitation ^^office ^^between ^^the ^^Board ^^of ^^Chiropractors ^^and ^^the ^^Board ^^of ^^Law ^^Examiners does not have reasonable security for such a building. Their security consist of walking in telling the security guard where your going, having them scan your ID and being given a visitor pass with the only purpose of getting you past a turnstile. Up until recently this wasn't an issue, embarrassing considering even the Concealed Carry office a few blocks away had me go through a metal detector and scan my bag and coat through an x-ray machine. \n\nUntil earlier this month I ran a delivery on the 10th down to a Representatives aid (my guess is that they were actually ordering for their boss) I walk in and I see a wonderful sign posted stating that beginning on Dec 7th visitors will not be allowed to bring bags into the building (No that's not a typo my state government is so well organized that they inform you of building rule changes three days after they take effect) I know this sign was not there before that day as I had been in and out of it constantly the last few days. \n\n&gt;Guard: You can't take your bag up with you.\n\n&gt;Me: Okay, I wasn't aware of the policy. It's going to be a problem in the future since some of our orders can't really be carried in one hand while riding a bike, but can I leave my pack here with you this time and next time I leave it behind at the shop?\n\n&gt;Guard: No.\n\nI wasn't having a particularly good day, I was wet from rain, it wasn't far from freezing and I'd already had someone try to run me over today so my tolerance for people being unnecessarily stubborn was exceptionally low.\n\n&gt;Me: So if a lawyer comes in with his briefcase for a meeting upstairs he has to take it back outside?\n\n&gt;Guard: No that's for business. Your pack isn't for business.\n\n&gt;Me: Yeah actually it is, you try carrying a bag full of food and three drinks while riding a bike and tell me I don't need my pack for my job.\n\n&gt;Guard: You can just leave your pack outside with you bike I'm sure it will be fine\n\n&gt;Me: That's not going to happen. My pack has my emergency repair tools in it,and spare parts for the bike, and unlike the bike I can't lock it up. You can go ahead and call up to [representatives aid] and tell them that if they want their meal they can come down to the store because you wouldn't let me deliver it. If you can't do that much I'll call them and let them know myself.\n\n&gt;Guard: Well if it's that big a deal I guess this time around I can let you do it since you didn't know the rule but don't bring your bag again.\n\nI get back to the store explain to my manager what the happened and she says she'll deal with it and go ahead and keep taking my bag. Fast forward to today when I'm taking a deliver for the actual governor in and there is a new security guard I've never seen before at the desk and She won't let me take my bag in with me. Not only do I have to deal with the same issue as before but I'm actually in a crappier mood because not only did I just get stiffed on my last deliver all the way out to the county jail I had to take time out of the middle of my shift to go to the bike store and get a new rim because someone opened their car door in front of me and since bikes don't necessarily stop well on wet roads and I wasn't willing to veer in front of other cars that were moving I rammed into them and her car door mangling the hell out of my wheel. ^^I ^^swear ^^if ^^there ^^is ^^a ^^god ^^he ^^and ^^I ^^are ^^eventually ^^going ^^to ^^have ^^a ^^long ^^talk ^^about ^^days ^^like ^^this.\nI didn't bother with pausing to threaten or turning to leave. I called the number on the receipt directly from my cell which got me to the governors aid (GA) let's hear if for getting direct numbers when people want their food!\n\n&gt;GA: [state governor's name]'s office this is GA how can I help you?\n\n&gt;Me: Hi! this is Isa from [sandwich shop]! I have an order for your boss down in the lobby can you let him know he needs to come down and sign for it?\n\nMy voice sounded far more cheerful than it had any right to be, but again in my defense I was in a bad mood and I suddenly had a valid target for some pent up frustration.\n\n&gt;GA: Oh you can bring it up.\n\n&gt;Me: I'm sorry actually I can't the security guard on [side street] desk is refusing to let me in because I have my delivery bag with me.\n\n&gt;GA: Hold one moment please.\n\nI hear horrible hold muzak start playing and the security desk phone rings, the guard answers it and I hear a few very quiet comments about rules (I use a set of earphones so I can take call on my bike and still use both hands after answering so if there's sound coming from them I can't hear low volume stuff around me very well. Suddenly GA pops back on the line.\n\n&gt;GA: Go ahead and come up I think we have everything sorted out for you guys.\n\n&gt;Me: Thank you so much I'll be up there as soon as the elevators let me.\n\n(I refuse to climb 30 flights of stairs for any order unless there's a $1k tip waiting at the end.)\n\n&gt;Guard: Here's your pass I'm sorry I didn't realize you worked for a company on the list.\n\n&gt;Me: What list?\n\n&gt;Guard: Oh there's a list tapped up next to the computer of companies that can bring in bags for work related reasons.\n\n*cue stupidity induced aneurysm for me* I just stare at the woman for a second and then look down at my chest where the company name and logo is emblazoned  on my bike jersey and then at the food bag in my hand that has the same company name and logo on it.\n\n&gt;Me: yeah I can see how it's hard to tell who I work for.\n\n\nBy the time I got up to the Governors office he'd come out to check if I'd arrived and gone back to work on something but had apparently been told what happened and left a $10 tip- on a $6 order. As slow as today was for us that was sadly half my tips so I certainly appreciated the generosity even more than I normally would.",
        "created_utc": 1450939834,
        "upvote_ratio": ""
    },
    {
        "title": "Some questions about becoming a pizza delivery driver",
        "author": "Leonmonn",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y20gd/some_questions_about_becoming_a_pizza_delivery/",
        "text": "A friend of mine suggested looking into becoming a delivery driver after I became unemployed recently, some related experience I have is driving for Uber and some customer service experience. My time as an uber driver makes me feel like I'd have some of the skills needed to deliver pizza efficiently, knowing the geographic area, dealing with a wide range of personalities, and taking care of my vehicle during constant use. I almost exclusively drive nights as well which seems to be he highest grossing time to deliver at. \n\nFrom what I've researched so far you can make really good money doing this which seems to come in the form of cash tips, some say its good enough that people often find themselves becoming stuck in pizza delivery. I'm drawn to this as during mytime with uber I made very poor income, this is mainly due to the company implementing constant quarterly price cuts and creating a persona that it's not necessary to tip drivers even though many prefer it. I'm in Southern California and wonder what company would be best to drive for? Some said independents are better though you might make less due to lower volume. Generally most seems to say Dominoes or Papa Johns yield the highest tips, Dominoes because the pizza is cheaper and therefore people are more inclined to give a higher tip and papa johns because the pizza is more expensive and naturally yields a higher tip, it seems as though papa johns has a better working environment hohh that was from one threads opinion. Do most chains require you to help in the kitchen during downtime? I read it's possible to deliver only which is a much more relaxed gig, how many chains offer delivery only to drivers and is it worth the pay cut?\n\nHow much free pizza do you actually get? I'm currently trying to gain weight and would have no problem consuming as much pizza as I could stomach, anyone ever have concerns over their health for having numerous free pizza opportunities?\n\nSomething I couldn't find any information on is what happens if you have to deliver to an area that your not willing to go to? Due to personal reasons there is a neighborhood that I'd refuse to go to for safety reasons, can you simply inform your higher ups about this? Are you allowed to drive without the magnetic light sign on top if your vehicle? To me this can be a safety concern in a bad area as your simply advertising that you have food, money and a car. Is it true that most major chains don't allow their drivers to carry weapons of any kind? This seems prett ironic for how dangerous it can be to deliver in certain areas. I read a story of a driver killing a guy with his sidearm after an attempted robbery, he was fired due to the policy but would he have faced legal ramifications if it was self defense? I'd rather carry and be let to than possibly losing my life. This seems to follow the same idiocracy of not allowing parcel delivery personnel to carry even pepper spray when they face an almost certain fate of aggressive interactions with dogs. \n\nOverall I feel like this would be a good fit for me, I do value the higher earnings and think the later hours, driving, and customer interaction are something I have experience with and would be fine doing, is this the right job for me?",
        "created_utc": 1450937792,
        "upvote_ratio": ""
    },
    {
        "title": "why he wasn't able to play Fallout 4 (Plus a great tip)",
        "author": "izzyman111",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y0z2y/why_he_wasnt_able_to_play_fallout_4_plus_a_great/",
        "text": "(I forgot about this until today) So this happened about a month ago. November 10th to be exact, the day that FO4 came out. I got a order from a customer I had delivered to a few times before. Nothing special. \nNot a huge tipper, not a stiffer, just a normal tipper, but he was really nice so I liked him. So I got a order from him for a couple pizzas, not sure exactly how much but it doesn't really matter. \n\nAnyway I drive over to his house and walk up to his front door. I ring the doorbell and I here some shuffling of feet while I am standing there. \n\nA guy who is about mid 20's opens the door. I read him his order and he confirms it.  I then realize he has a copy of fallout 4 in his hand. \nMe: \"Oh you got the new fallout game?\"\nHim: \"Yeah but I haven't been able to play it\"\nMe: (trying to be nice but not rude) \"may I ask why not?\"\n\nHe just moves his body to the side to show me the inside. I see his wife/girlfriend watching a show. Keeping up the kardashians to be exact. \nHim: \"That's why\"\nMe: \"aw that stinks\"\nHim: \"and the worst part is now I know all of there names\"\nMe: (Chuckling) \"well that will be $19.00\"\nHim: (hands me a $20) \"Oh I got your tip for you, do you play Fallout?\"\nMe: (confused) \"yeah\"...)\nHim: (pulls out a nuka cola quantum) \"I got 2 from target, my wife didn't want one but I figured someone might want it\"\nMe: (super grateful) \"Wow? Really I have been looking for this all day, thanks\". \nHim: \"Do you have a tip for me?\"\nI was confused for a second then I saw the look on his face\nMe: \"Yeah, There is a bobble head when you first meet Preston Garvey on the desk near him\"\nHim: (Laughs) \"well thanks\"\n\nNuka cola quantum went for $50 on E bay at the time so probably one of the best tips ever. ",
        "created_utc": 1450917431,
        "upvote_ratio": ""
    },
    {
        "title": "Ever have a customer so nice you smile the whole ride back?",
        "author": "detachedmind",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y0akk/ever_have_a_customer_so_nice_you_smile_the_whole/",
        "text": "I don't know what it is, but I only have good stories at the place I work at, so I like to share them. Here are two quick ones ill remember for time to come.  \n\n1.) This one was about 2 months ago. Dark out I deliver to a house, 2 medium pizzas. Total $17.73 payed via CC. I ring and a kid answers (maybe 16?) Great, teens never tip. It's okay, having a good day. He signs, no tip.\" Have a good night, bro.\" As I turn to leave his mother comes to door and asks, \"did he leave you a tip?\" \nMe: \"haha no, but it's fine ma'am\"\nMom: \"No its not, be right back\"\nShe comes back seconds later, walks barefoot to me and gives me 5$. Not that it wasn't a decent tip, but it's the fact she cared that much to do that for me, that made me smile. \n\n2.) This one happened last friday. Taking a double that are both late because we are SLAMMED. I call customer and apologize for it being late and im on the way. She responds in a sweet tone that it's fine, that it's friday and she understands. Im instantly relieved knowing this will be a smooth delivery. The tone of voice is everything and u could tell this was a nice lady. Bring her 2 pizzas that equaled $17.73 again. I arrive, thank her for being so understanding about delivery time, she smiles and reassures me it's okay. She sees me shaking from cold and tells me she appreciates me bringing her pizza to her in this weather, tells me jokingly not to freeze and signs the slip. I look away as I always do, because I find it weird to peer at someone's tip (or lackof). She then tells me I can pull through her driveway and grass if need be so I don't have to reverse onto street. Her sweetness had me smiling all the way back to the store where I check the slip and see a 20$ tip on the $17 order. Great night :) plan on buying her an extra pizza when I get her again :)",
        "created_utc": 1450905638,
        "upvote_ratio": ""
    },
    {
        "title": "Hello to all! Happy festivities from your new mod team!",
        "author": "SpyroThBandicoot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3y031s/hello_to_all_happy_festivities_from_your_new_mod/",
        "text": "After many hours of discussion with both Supreme President Overlord Barack Obama and Dr. Johnathan \"John Cena\" Cena, /u/rdeluca has finally assembled a mod team of quite possibly the most qualified members of reddit. \n\n/u/haleykae, /u/PresidentPlate, /u/trmbnplyr1993, and I have been added to the mod list and are pretending to be very excited to help this community grow and make sure things run smoothly. \n\nWe just wanted to pop in and say hi.\n\nThe end of the year is coming up and things are probably getting busy at your stores. If you are a driver, like myself, remember to be safe, especially during New Years. If you're an inside worker, keep cranking out those orders and taking phone calls. You guys are awesome. If you're a customer, please be patient during the holidays. It's one of our busiest times of the year. \n\nThat's all I've got to say everyone. Have a great rest of 2015\n\nCheers, \n-/u/SpyroThBandicoot ",
        "created_utc": 1450902224,
        "upvote_ratio": ""
    },
    {
        "title": "One of the most consistent nights I've ever had.",
        "author": "SirTreeTreeington",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xzuna/one_of_the_most_consistent_nights_ive_ever_had/",
        "text": "As you all know tips can range wildly in a night from nothing to a surprise high tip. Well on the 18th I had a solid run and thought it was interesting to share. \n\n1. $18.51 - Credit \n        \n        5.00 - Tip\n\n2. $34.86 - Credit\n\n           0 - Tip \"they ordered twice and tipped on the second order\"\n\n3. $28.60  - Cash\n\n        6.40 - Tip\n\n4. $13.03 - Credit\n\n        5.00 - Tip\n\n5. $26.14 - Cash\n\n        5.00 - Tip\n\n6. $49.22 - Credit\n\n        5.00 - Tip\n\n7. $34.86 - Cash\n\n        10.00 - Tip\n\n8. $17.72 - Cash\n\n        5.00 - Tip\n\n9. $20.69 - Cash\n\n        5.00 - Tip\n\n10. $18.24 - Cash\n\n        5.00 - Tip\n\n11. $17.71 - Credit\n\n        5.00 - Tip\n\n12. $13.03 - Credit\n\n        5.00 - Tip\n\n13. $11.98 - Cash\n\n        3.02 - Tip (lowest of the night)\n\n14. $26.70 - Credit\n\n        5.00 - Tip\n\n15. $33.49 - Credit\n\n        5.00 - Tip\n\n16. $23.96 - Credit\n\n        5.00 - Tip",
        "created_utc": 1450898535,
        "upvote_ratio": ""
    },
    {
        "title": "So this guy hands me a $50 and says \"Merry Christmas! The rest is yours!\"",
        "author": "jennej_dtsab",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xzbot/so_this_guy_hands_me_a_50_and_says_merry/",
        "text": "His total was $49.69.",
        "created_utc": 1450890323,
        "upvote_ratio": ""
    },
    {
        "title": "Did you guys know there are pizza delivery/tip/mileage tracker apps?",
        "author": "EternalOptimist829",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xyf6o/did_you_guys_know_there_are_pizza/",
        "text": "I paid $3.00 for one just now and it's LEGIT.  Best two bucks I've spent in a long time, no joke.\n\nJust search whatever app store for tip tracker.  Delivery tracker didn't go so well, came up with a lot of pizza ordering apps.",
        "created_utc": 1450873069,
        "upvote_ratio": ""
    },
    {
        "title": "This guy.....",
        "author": "mnc3454",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xxx4v/this_guy/",
        "text": "https://www.youtube.com/watch?v=du0FEO7Qn3k",
        "created_utc": 1450859191,
        "upvote_ratio": ""
    },
    {
        "title": "I delivered for a factory Christmas feast",
        "author": "Swedged",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xxqjh/i_delivered_for_a_factory_christmas_feast/",
        "text": "I delivered to a factory today. The order was just under $1200. The tip was $250. Management automatically divided the tip evenly between everyone that helped with the order. Each of us got 33 dollars. Do you all agree with spreading the tip on big orders like this or nay? Personally, if management hadn't done this I would have done so myself.    ",
        "created_utc": 1450854373,
        "upvote_ratio": ""
    },
    {
        "title": "will I get the job",
        "author": "magicgoatrape",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xx4o9/will_i_get_the_job/",
        "text": "so basiccaly I had an interview with papa johns and dominos on the same day\n\nI get the job at papa johns, and two weeks later dominos calls me saying I got the job, I tell them I already got a job at papa johns right now sorry.\n\n\nI got fired from papa johns after a month for a somewhat stupid reason.\n\nI went into the dominos tonight and told them I am still intrested in a drivers positions, the assistant manager tells me he will tell the GM.\n\nWill the GM just ignore me?\n\nDo you think I will not get hired or hired?",
        "created_utc": 1450841854,
        "upvote_ratio": ""
    },
    {
        "title": "New job and loving it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xx0sn/new_job_and_loving_it/",
        "text": "[deleted]",
        "created_utc": 1450839831,
        "upvote_ratio": ""
    },
    {
        "title": "Yes that's how all our food is served",
        "author": "IsaapEirias",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xx0qg/yes_thats_how_all_our_food_is_served/",
        "text": "Cross-post from [/r/TalesFromYourServer](https://www.reddit.com/r/TalesFromYourServer/)\n\nI'm going to hope this is the best place to post this but this both annoyed me and made me a little happy so it's worth sharing.\n\nSome short background- My job is basically delivering sandwiches by bike. That's all our store makes, we don't do soup, or salad, just sandwiches, if you want you can get a bag of chips, a cookie, a drink, and a pickle with them. While a limited menu we try to make up for it with low prices and fast delivery- average time from placing an order to receiving it at the far end of our delivery range is about 5 minutes. And we always deliver- kinda like the post office *\"Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds\"*. The only days we take off are Thanksgiving, Christmas, and New Years. In exchange we make a relatively reasonable $7/hr+tips and an 3:30 hour shift usually nets me about $40 in tips.\n\nThis brings me to yesterday. I get sent out to a customer on the far end of our deliver range of roughly a mile (our store is located downtown so that 1 mile range covers a few hundred offices and a couple thousand people including our state House of Representative both State Political party HQ's, Police HQ, the state supreme court, the municipal court, the county court, and the city court). I went a little slower than usual do to the heavy downpour we had preferring to be a little behind rather than flattened by a car hydroplaning. Like usual I had called the customer in advance letting them know I was on my way and giving them an ETA of when I would arrive, this saves time for them and me as it means they can be waiting for me when I arrive (with so many buildings having security it's easier if we don't have to do the song and dance of removing metal objects). Store policy says if the tip is prepaid we can leave it with reception but I still prefer to hand it directly to them. \n\nThe customer is nowhere in sight, and nobody is at the reception desk. I check my phone, and while I had taken a bit longer than usual I was a bit ahead of what I expected (I took 6 minutes to get there the order had been placed 8 minutes ago) so I called the number on the receipt again and rang through to voice mail. I left a message letting them know I was in the lobby and waited a few more minutes- still no one, I ring the desk bell and nothing happens so I call again and leave a message letting them know I'm in the lobby stating the time and that if I don't hear from them in the next 5 minutes I will have to take the order back to the store (This is a corporate policy for obvious reasons they can't afford to have delivery people wasting time waiting for people.) As soon as I hang up the customer steps off the elevator. I hand them their food and they immediately start complaining about how long it took me to deliver it and demanding I give them the tip back. I smiled apologized if she felt there was a problem but that there was no way I could refund a tip that had been paid in advance as the only money I had on me was store property and had to be returned at end of day (not entirely true but I sure as hell was not going to give her back the a tip $2 on a $20 order for 3 subs+chips, a cookie and a can of coke out of my own pocket) but she was welcome to call the store and speak with a manager. I get back to the store and we're relatively slow so I hang out for a few minutes until the phone rings I answer and it's the customer.\n\n&gt;Me: Thank you for calling [sub shop] how can I help you today?\n\n&gt;Customer: I JUST ORDERED FROM YOU AND YOUR DRIVER WAS RUDE TO ME AND MY FOOD WAS COLD AND MY SODA WAS WARM. I DEMAND TO SPEAK TO YOUR BOSS RIGHT NOW!\n\nYep this is going to be fun, your going to lie to my boss about me and the food. I know the drink went out of the cooler and into the insulated pouch of my backpack 15 minutes is not enough time to warm it up. On top of that I'm having to hold the phone away from my year to preserve my already damaged hearing.\n\n&gt;Me: I'm sorry to hear that give me one moment and I'll get the next available manager for you.\n\nI set the phone down turn around and grab my manager as she is walking by. I love this woman dearly she's one of the best bosses I've ever had (counting the one from years ago that would pull me off phones in a call center for an hour a night on graveyard shift so we could use the company gym to beat the hell out of each other in sparing matches on the company dime- yes there is some questionable things about that but we also constantly replaced the people over him for embezzling thousands a year.) but I already feel sorry for her most days because half my coworkers are idiots and the last few weeks have resulted in constant staff cuts (If your going to smoke pot guys don't do it at work and for the love of god **DON'T SELL DRUGS OUT THE BACK DOOR OF YOUR WORK** and then act surprised when the cops get called on you, also don't swing at customers with box wrenches for the same reasons) I explain what's going on and my side of things and then hand the phone to her and go sit down outside and wait for the inevitable fallout. a few moments later she walks by and invites me for a smoke while she cools down from dealing with the woman.\n\nThe actual fall out? The customer got mad at her for refusing to refund the order, so she handed the call off to our district manager who was in store to help out with the staffing shortage, he in turn not only refused her a refund but after talking to the other delivery staff found out that she tends to pull stuff like this frequently and went down to her office in person to inform them that as long as she worked for them we wouldn't deliver there. I still went home early as a \"disciplinary action\" for taking to long on a delivery but I noticed that we hadn't had a delivery order for almost an hour at that point and several other people were sent home at the same time.",
        "created_utc": 1450839797,
        "upvote_ratio": ""
    },
    {
        "title": "I delivered pizza to a furry.",
        "author": "Dead_Battery",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xwm5h/i_delivered_pizza_to_a_furry/",
        "text": "I am a delivery drive for Domino's.This happened to me back in June.\n\nI work in a heavily sub urbanized location in southern California. Its just houses, strip malls, apartment complexes and freeways for miles in every direction.I was working on a Friday night and I got a delivery for one medium pizza, less than one mile away. I was going to deliver to a house and with out any traffic I can get to the house in less than 5 minutes. I was thinking \"Ok just one pizza who ever order it is too lazy or to tired to cook tonight.\".\n\nIt was an uneventful trip to the house. I rang the door bell and after a few seconds I was given quite the surprise. It was a large women wearing part of a green wolf fur suit. It wasn't a full body suit. It was just the head piece, hands, feet, and even a tail. The head piece was a light green while under the chin and neck were all white. The hand pieces were the same light green with white palms. The feet were the same light green. Taken back, I struggled a smile which was most likely a look of surprise and trying to be friendly. I told her that her total was $14.15(I think it was this amount I not entirely sure.).  She nodded and turned around, that's then I saw she had a tail about arms length tucked into the back of her pants. The tail was the same light green as the other pieces and the tip of the tail was white. When she turned back around she had a drawing with the money paper clipped to the drawing. The drawing was of pizza delivery guy with a pizza in one hand and the peace sign in the other. I thanked her for the drawing and handed her the pizza. As I started to leave she asked for a hug. I gave her one and I left.\n\nOn my way back to the store I was just really happy. Not because of the cash tip, the tip itself was nothing special just 3 or 4 dollars. I think I was happy because someone took the the time to make this drawing for me. I haven't delivered to that house since and none of the other drivers I work with have ever said anything about delivering to someone dressed in a wolf costume. I faintly remember where the house is, if I go back and looked for the house I might be able to find it. It was definitely the weirdest delivery I have ever been on, but it was a nice tip even if the tip wasn't too much cash. \n\nHere is the drawing if you are curious as to what it looks like.  http://imgur.com/scVt8am\n \nTL;DR: I delivered to pizza to a furry and she gave me this drawing. http://imgur.com/scVt8am",
        "created_utc": 1450832712,
        "upvote_ratio": ""
    },
    {
        "title": "I got \"robbed\" tonight",
        "author": "h1a4_c0wb0y",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xt3th/i_got_robbed_tonight/",
        "text": "I know it is that time of year, and I'm careful, having been robbed before, but tonight this guy got me. Picture, if you will, a rainy December night in Alabama. I head out with a single to an apartment complex a couple miles from the store. As I'm almost to the turn off, my phone rings. It was another driver letting me know the guy I'm delivering to was not in the apartment on the ticket and gave me the new number. Red flag number one. I find the building, park, and empty my pockets of valuables because I've got a funny feeling about this one. I walk up, knock, guy opens the door and  \n    Me - That'll be $19.05  \n    Guy - You got change?  \n    Me - For?  \n    Guy - Can I pay with a credit card?  \n    Me - You would've had to do that when you ordered  \n    Guy - Hold on. *Closes door*  \n    Guy - *Opens door* Let me check the food. (Red flag number two).  \n    Me - *Pulls out first sub, opens box, shows it to customer*  \n    Guy - Ok, what about the other one? *Snatches second sub from my bag*  \n    Me - Hold on  \n    Guy - *Grabs first box still in my hand and pulls until it is torn from my grip. Closes door and locks it*  \n    Me - HEY!!! DO I NEED TO CALL THE COPS!?!?  \nThen I hear the patio door sliding closed, and I get to the end of the building as he turns into the next breeze way. I make it back to my car and he is running up the front of the building. I yell at him again as he turns into the third breeze way. I get in my car, start driving away, and call the store. After explaining what happened to my manager, she starts laughing at how stupid he is and says she will mark his number as \"Do Not Deliver\" and void the order.   \n\n  \nI'm very happy he didn't try to hurt me and I'm pissed at my self for not noticing that the apartment was void of anything that would indicate someone lived there until he was out the back door and running away. The manager never called the cops.  \n  \n  \nTLDR; Guy had food delivered to an empty apartment he broke into so he could steal the food. And I'm glad I didn't end up dead.\n\nEDIT: Fixed a formatting error",
        "created_utc": 1450768176,
        "upvote_ratio": ""
    },
    {
        "title": "Yell \"I'm a pretty princess at the door\"",
        "author": "mulletnsteps",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xsm72/yell_im_a_pretty_princess_at_the_door/",
        "text": "I didn't and he got pissed and said I wouldn't get a tip. So I did it. $3 tip. What a jerk. Can you get 0 stars on the dominos nice leaderboard? I have a rating and no stars highlighted, pretty sure it was that douche.\n\nClose of the night edit: to top off the night, just had a guy place an internet order 2 minutes before closing. Took the delivery out to the address they had entered and it turns out they had the wrong address and meant to order at a different store. So I wasted 30 minutes after closing and we had to re-wash a bunch of stuff. What a crappy night. I wish I didn't need the money.",
        "created_utc": 1450758472,
        "upvote_ratio": ""
    },
    {
        "title": "Last night I decided that the customer isn't always right and refused to apologize. Chaos ensues.",
        "author": "fuzzysocks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xr68s/last_night_i_decided_that_the_customer_isnt/",
        "text": "* I am a supervisor at a west coast pizza place in the states. Last night was a typical busy night before the holidays. It was raining so we were getting a lot of delivery orders. One of the delivery customers, we will call him C, decided to call and complain about one of my drivers. * Me: Ansers phone Thank you for calling ______ this is____ how are you doing today?\n* C: Are you a supervisor?\n* Me: Yes Sir, how can I help you?\n* C: I'm going to lay out a situation and I want you to make the determination on how you would feel in my shoes.\n* Me:(Starting to feel a little concerned) Please share, Sir\n* C: A delivery driver walks up to my door and hands me the food and I pay him. I realize that I have exact change and ask for my bill back. He gives it back and takes the change and just leaves.\n* Me: He didn't say goodbye or thank you?\n* C: No, nothing.\n* Me: I am so sorry about that sir, I will talk to my drivers about that.\n* C: My only crime was being black and you should apologize for having racist employees.\n* Me: I can assure you sir that my drivers are probably just rushing because it is storming outside. His poor social skills aren't racially motivated. I will talk to my drivers.\n* C: It doesn't matter what the Mexican guy was motivated by, it matters how I felt and you need to apologize.\n* Me: I will not apologize for a serious and unfounded accusation on my driver's character, and furthermore I have no drivers that are Mexican.\n* C: He was brown or something.\n* Me: I have no idea who you are referring to. We have a white driver, a Filipino driver, and an Indian driver.\n* C: Indian, Filipino, Mexican, same difference. What matters is that I am Black and your Mexican driver treated me different and you need to apologize or I will have you fired.\n* Me: Sir, that is actually not the same difference and I am done talking with you about this. You can call tomorrow.\n* C: Apologize now!\n* Me: Hangs up\n* 20 Minutes later\n* C walks in\n* C: Are you fuzzysocks?\n* Me: yes\n* C: Look into my eyes and tell me you hung up on me.\n* Me: I hung up on you\n* C: All I want is an apology for your driver being racist and you need to do it now.\n* Me: My driver is not racist and I will not apologize. He was probably mad that you were going to give him a tip and then took it back after he waited outside in the rain for 10 minutes for you to answer the door. I will apologize for him not saying goodbye, but that is it.\n* C: Raises Voice This is terrible customer service and I am going to do everything in my power to get the owner to fire you.\n* Me: Do not yell at me. My employees are not obligated to admit to serious character flaws and if I get fired for that, then I don't care about this job.\n* C: I'm not yelling, this is my natural voice.\n* Me: But I feel that you are yelling.\n* C: But I'm not.\n* Me: But I thought we were talking about feelings, not facts.\n* C: I am recording you and have been recording you the whole time.\n* Me: I do not care. Please just leave. When someone hangs up that means they are refusing to serve you further. You need to leave.\n* C: I don't have to leave and if you call the police they won't be able to do anything because I can sue this place for racism.\n* Me: That isn't true. Leave.\nI asked him to leave several times and he refused to leave. The driver had just walked back in from a delivery and the guy approached him. C said, \"why didn't you say goodbye to me when you left my house.\" My driver said, \" I said, \"have a good one, man.\" C then approaches my counter again after shaking hands with my driver and apologizing for getting so mad.\n* C: You still haven't apologized\n* Me: Now we know for a fact that he actually did say something before leaving. What is there for me to apologize for?\n* C: Your racist employees.\n* Me: You are racist for saying that Filipino, Indian, and Mexican are all the same thing. My driver just said he did say bye and you shook his hand. This is ridiculous and you need to leave. NOW.\n* C: holds phone up This has all been recorded and you WILL be fired. leaves\n\nEDIT: There is a part II to the story. I wasn't going to share because my post was already long, but here it goes. \nAfter about an hour had passed we got a phone in for an exceptionally large order. Over $300 worth of food. It was a first time caller. Our policy is that if a first time caller orders a large amount of food that we have to call the number back and have the person verify that they ordered the food. We call back and sure enough a man answers and verifies the order. We make the huge order and joke about how it is probably C trying to get me fired by having excessive waste on my shift. The pick up time rolls around and nobody shows up. We call the number again and nobody picks up. The voicemail box is sure enough, C. Real mature, C. Real mature.\n\nI called the dispatcher back who I had informed of the incident, and she goes \"OMG guys, guess what that guy just did at ___ ____ pizza...\" (she had shared the madness with her coworkers at the station). She puts me on hold and regretfully informs me that there is nothing she can do for me since we can't prove it was actually him who phoned in the order. He used a different number than his original order so there is no way it could have been one of us setting him up. Our system tracks how many times a guest orders and it showed the prank order as a first order. Despite sharing this information, his name, and address, the dispatcher was unable to help me. ",
        "created_utc": 1450734252,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Box Christmas Tree",
        "author": "Ki11erPancakes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xqr24/pizza_box_christmas_tree/",
        "text": "So I made a Christmas tree. Out of pizza boxes. (I did this for one of our stores in our franchise)\n\n Ta-da!\n\nhttp://i.imgur.com/yAVJiQm.jpg\n\nEdit: anyone else have tales of overzealous decorating, Christmas games or competitions, or Christmas ridiculousness? ",
        "created_utc": 1450728112,
        "upvote_ratio": ""
    },
    {
        "title": "Everything that could go wrong, did.",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xqp7c/everything_that_could_go_wrong_did/",
        "text": "Our pizza place just recently got added to the list of restaurants for door dash, and ever since, it has completely screwed with our flow and a lot of things have gone wrong lately. Yesterday a whole litany of things just ruined our day.\n\n1.) Our fax machine and computer system overall is already pretty shit. So we were completely unprepared for how many people would order from us for door dash. We had over 20 door dash orders and the fax machine wasn't printing out these orders for us right away. It would sort of print up whenever it felt like it. As a result, a ton of door dash drivers had to wait for their orders for an extremely unnecessary amount of time (for that, I'm sorry. As a fellow driver, I completely understand the frustration) It was a mad house trying to work everything out when it definitely shouldn't be that difficult.\n\n2.) This is mainly our GM's fault, but I'll give him the benefit of the doubt because it's the holidays and none of us knew how much more business we'd be getting with door dash... We ran out of so much shit in one day. No pepperoni. No boxes. No Canadian bacon. No mushrooms. No more Mexican glass bottle sodas. A few of our signature salads were already out of stock by 4PM. Not enough dough. I'm probably missing some things here, but it was fucked. As a result, we had to call two drivers in early to run to other store locations and borrow stuff from them. Our store is in San Jose, I myself drove to a location in Blossom Hill, another driver went to Cupertino, and another run to the Campbell location. Running all over the place trying to stock up.\n\n3.) Even with drivers coming in early, deliveries were late because we were preoccupied with trying to stock up the place. \n\n4.) This is a pretty common occurrence that really isn't an issue often, but today it was. Right around the shift change between morning and evening crew, the cooks who arrive, and the cooks who are supposed to be leaving soon love to chat it up. Not usually a problem when we're slow, but yesterday was all kinds of fucked and even though we repeatedly asked for them to kick it into high gear and get working, I don't think they quite grasped the situation. We were busy as hell and cooks were lolly gagging talking to each other. There's two door dash people waiting in the lobby for their shit that hasn't even been made yet. \n\n5.) Just as I'm asking the cooks to please make my orders for the umpteenth time, the entire computer system crashes. We now have to manually write down orders, and everyone's information including credit card numbers, and keep all that info until our computers are working. Because the system crashed, I don't know where I'm going for my deliveries. All we could do was reboot the system and pray it worked. It didn't. We called our GM and he walked us through it on FaceTime. \n\nAll this stuff made us so backed up and completely screwed our day. I didn't close but I'm sure that was no picnic either. \n \nAll that aside, how is the door dash stuff working for everyone else?",
        "created_utc": 1450727363,
        "upvote_ratio": ""
    },
    {
        "title": "Ham and Pineapple VS Hawaiian",
        "author": "blatantly_lieing",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xplha/ham_and_pineapple_vs_hawaiian/",
        "text": "Reading through a trees post, someone claimed a ham and pineapple was cheaper than a Hawaiian because the latter is a \"speciality pizza\". Everyone got on the bandwagon calling us out on it, but I don't see this at my store. \n\nThat being said, we charge extra for edge pizzas which are just pizzas with no make ring used and supposedly slightly more cheese (which I don't see happen often)\n\nDo any of you charge more for the Hawaiian than a Ham and Pineapple, and if so what justifies it? (extra toppings whatever)",
        "created_utc": 1450711049,
        "upvote_ratio": ""
    },
    {
        "title": "Wingstreet tastes like shit",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xoljv/wingstreet_tastes_like_shit/",
        "text": "[removed]",
        "created_utc": 1450688279,
        "upvote_ratio": ""
    },
    {
        "title": "Coworker got in my face almost a week ago. Still pissed about it",
        "author": "dutchmasterkiller",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xoc40/coworker_got_in_my_face_almost_a_week_ago_still/",
        "text": "Last Tuesday this fellow \"supervisor\" in the loosest sense of the word since he does jack shit delegating and creeps everyone out trying to get his hole off girls ten years younger than he is, tried to take a close-by double while it was quiet. I told him not to. He continued packing them, acknowledging me but ignoring what I said; so I went to the computer, took the second order off his name and booked it out for myself. He started shouting at this point. I tell him to speak to the GM, it's too quiet to double when we have more drivers in store than orders. He's still going at it so I reaffirm myself, \"Speak to the GM. I have an order to take.\" \n\nDo the delivery, get back 5 minutes before this other guy gets back from his closer destination, and give the boss the heads up on what went down. Saying I told him to speak to you, he doesn't know the shop's routing policy and cannot/should not route orders for himself because he's been taking advantage for a while and still does no matter how many times I've complained to the AM who says he's spoken to you. \n\nSo I'm in the walk-in fridge and the guy comes in shouting the fuck at me, I tell him to back off but he persists so I drop some knowledge on him. \"Two ready orders half a mile from the shop, one in the oven, four drivers in store, another just pulled up in the car park, three to get made, you don't double when you have the people. Hasn't anyone spoken to you about that?\" He starts saying to me I can't tell him what to do, that we're equal in authority, blah, blah, bland. He's screaming this at me and getting worked up as anything while I just talk normally. I want to raise my voice to get my point across but I'm not an emotional firecracker that'll get worked up like that. I tell him to go speak to the boss for the umpteenth time, he finally fucks off. \n\nI'm in the back this time, a half hour later, he starts shouting at me again, the AM is there doing nothing about it while this guy moans and moans. It moves from the back door to almost the oven where the AM is doing a stock count- a good 5 or so metres. I'm basically ignoring the guy at this point, fending off insults while explaining to the AM what's been going on. The guy is clearly shouting and acting a fool in front of countless workers on three separate occasions, all very public because of his ridiculous temper.\n\nSo we go into the GM's office around 9 and he's chuffing his e-cig like mad. I'm talking 15 second inhales. He lets loose saying we have to get-on and that we can't argue in front of people because they'll think it's then okay to argue against us. I try to cut in but he doesn't let me interrupt. He sends the other guy out and immediately his tone changes and I get my words in. I explain to him that he should not route and he agrees with what I said but thought I should have gone about it another way (what, and just let him take the double? of course I'll stop him, I thought), I explained to him how I always kept my composure and he yelled back and acted defensively, I gave him examples of how he is not doing his job properly, cheats drivers and how he slacks off, I kept a lot back like how he has a penchant for smoking weed during his shift and on company premises which is a big 'no-no'. We spoke for over an hour total and in the end I was asked to go to him and start fresh. Basically he's been feeling for months as if I look down on him and speak to him like he's a moron. It really irks me that his insecurities made him lash out at me but it confirms that even he himself thinks he's a petty asshole. \n\nLater I go up to him and he starts arguing with me again, I end it with a big, fat whatever. I haven't spoken to him since even though I worked the past two days with him and had to finish up that shift with him. \nHe's still not doing the job I do, even though he was spoken to that Tuesday about it; I did all routing the past two days so he got single after single and couldn't screw people over; I delegated from the front as drivers walked in and did my own big jobs with on-and-off help from decent drivers between deliveries. But what to do TFTPG, what to do. I can't tip-toe around some diva but I doubt there'll be any firing. If he doesn't shape up I will start telling him what to do again whether he likes it or not. But seriously, screw that guy and the amount of energy and time I'm putting into being mad at him. What a slime ball. ",
        "created_utc": 1450681828,
        "upvote_ratio": ""
    },
    {
        "title": "Is it That Hard to Stay in Your House? Part 1.",
        "author": "ColaMonkey36",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xmjsv/is_it_that_hard_to_stay_in_your_house_part_1/",
        "text": "Hello TFTPG! I have the first of  two stories to share today. Both involve, as you may have gathered from the title, people who apparently can't sit for 30 minutes until a pizza arrives. \n\nStory 1: \n\nSome genius decides to go walk to his girlfriends house and unlike a sensible person who would wait until he returned home with her, this genius decides to order via the web on the walk down. I arrive at his house to talk to his rather unimpressed mother who tells me he would be a few more minutes (it's fine, not like it's a busy Sunday morning with the hungover Christmas masses waiting for their pizza or anything) \n\nI return to my car ( because this is Scotland and November - February just seems to be constant rain) and wait. He eventually shows up, gets a slap round the ear from his mother and pays me in exact change, but at least he was apologetic. ",
        "created_utc": 1450649353,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do I look like a predator?\"",
        "author": "LabialTreeHug",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xm0b2/do_i_look_like_a_predator/",
        "text": "Oh boy!\n\nI haven't called the cops on this job much (only once before upon spotting a drunk driver pull into our parking lot), but this guy just set off one uneasy feeling / alarm bell after another!\n\nSo, out on a double last night, about 2am, the first one being to a little side street off a main road. \n\nIt's the sort that's like a half-circle, dumping back onto the main road. Which in this case has no streetlights and a speed limit of 40 mph. \n\nI make the first delivery just fine, and as I pull back onto the main road, a man strolls out in front of my car, flagging me down. \n\nI pulled over, put on my hazards, locked the door, and rolled the window down an inch so we could hear each other. \n\nMe: \"Are you injured? I can call for an ambulance or a tow or something if you need, sir.\"\n\nHim: \"Please, I'm just tryna get home; my house is just a few blocks up there.\"\n\nM: \"Sorry, but no can do, man. I can call a cab or something for ya, but store policy prevents me giving lifts.\" \n\nH: \"I have no money; please, it's a human thing! Help a human, will you?\" \n\nM: \"Think of it this way: I'm a female, alone, at night, on an unlit road. Sorry man, but for my own safety, I won't.\" \n\nH: \"C'mon, do I **look** like a predator?\"\n\nNow, I should mention a couple things that were setting off those uneasy feelings: \n\n* No broken-down car or anything nearby to explain how he got stranded there\n\n* It's late December in MN, and while has has a jacket, he is not wearing it, leaving him in a thin button-up shirt. It is slung over one of his arms, hiding one of his hands from view.\n\n* If it's only a few blocks away, why not just fucking walk?\n\nM: \"Dude, there is no such thing as 'looks like' a predator. Good luck.\"\n\nAnd got the hell out of there. \n\nWent a few blocks away and called the cops; nice lady at dispatch said it did sound fishy and sent someone to check it out. \n\nHope he got help and didn't end up carjacking anyone, but god*damn* it was unnerving! \n\nedit: Yes, not stopping in the first place is the best prevention, but it was that or hit him; literally about to step **directly** in front of me. Figured someone willing to risked getting creamed must've been in a dire enough situation to at least hear them out and call an ambulance if needed. \n \n",
        "created_utc": 1450640756,
        "upvote_ratio": ""
    },
    {
        "title": "What's this shady fellow up to?",
        "author": "FeculentUtopia",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xk0tc/whats_this_shady_fellow_up_to/",
        "text": "Every day this week, this customer has called and placed a big order (today's was almost $300!), then opted to pay by credit.  Every time, the first card he gives us is declined, and he tells us he'll call back with another.  Fifteen minutes later, he's on the phone with another card, also declined.  The process repeats until he comes up with one that works.  What's this guy doing?  If he had cards of his own, he'd just switch to another right away, not take 20 minutes to get it.  Only thing I can think of is that he's going online to buy stolen CC numbers to try one at a time, and the process takes a few minutes.\n\nFollowup: Talked to the police, and got similar advice to a lot of what we got here.  Next time, we're writing down the CC numbers he tries, then reporting them to the police.",
        "created_utc": 1450595263,
        "upvote_ratio": ""
    },
    {
        "title": "Any other Papa Johns Drivers get a letter about somebody Suing the company in a Group?",
        "author": "KittyCatButt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xifvt/any_other_papa_johns_drivers_get_a_letter_about/",
        "text": "maybe \"suing\" isnt the right term, but i got a letter just now from the AMERICAN ARBITRATION ASSOSIATION about lost wages from Papa Johns between June 30, 2012 and September 23 2015.\n\nit basically says someone is \"suing\" Papa Johns, or rather a handful of thier chains: PJ UNITED INC, PJ CHEESE INC, PJ LOUISIANA INC, OHIO PIZZA DELIVERY INC, PJ CHIPPEWA LLC, AND PJ UTAH LLC. \n\nthe claim is they failed to fully reimburse DELIVERY DRIVERS for automotive expenses, which has reduced the wages paid by respondents to delivery drivers BELOW THE FEDERAL MINIMUM WAGE. the suit has been referred to \"arbitration\" before Arbitrator Jack Clarke in Birmingham, Alabama.\n\nin just a few minutes i can think of almost $2,000.00 worth of repairs i put into 2 cars during that time period which came straight out of my pocket, and im sure after a little while longer i will remember most of the rest. so of course im jumping in on this lawsuit, because thats what the letter is, to ask if anyone who worked there during that time if they want to join these lawyers at no expense unless we win. anybody else get this?\n\nsomeone aske me to make it clear for this particular lawsuit: YOU NEED TO READ THE LETTER AND FILL OUT THE FORM TO OPT IN, IF YOU IGNORE THIS PARTICULAR LETTER THEN YOU HAVE OPTED OUT. some people have told me they got a letter saying the opposite, so everyone should read theirs very carefully to make sure they do what they need to do.",
        "created_utc": 1450563256,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't fucking tell me that.\" / I got played. / Today was a good day",
        "author": "coinaday",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xg3u6/dont_fucking_tell_me_that_i_got_played_today_was/",
        "text": "Normal delivery to a nice hotel. I hadn't delivered to this one before, but hey, it's expensive, should be good, right?\n\nWander around a bit first as I usually do at a new place, started in like 160s and was going down all evens, get to the other side, find the right one, knock.\n\nKid opens the door. Parents are in the back. Greetings, amount, kid hands me a $50. \"Sorry, I only have $20 in change.\", don't accept it. Kid silently wanders back to adults. They fiddle around a bit. \"Okay, here's $30; keep the change\" Cool; done. Kid hands me two bills, $10 on top. Okay, give them the food and I'm on my way.\n\nBack at the store, I go to make my drop. Oh shit, I got a $5 and a $10. I'm a fucking idiot. GM is there. \"I need some advice.\" explain the situation, and \"well, try calling them back.\" okay...we'll see how that goes.\n\nFirst time, rings like 4-6 times, and I get a connection, but I can't really make out who it is and they hang up. I call back; 2nd ring:\n\nCustomer: *indistinct* (noise in the store; bad connection, frequent start)\n\nMe: \"Hi, I'm coin-a-day, from Pizza King. This was the number for my last delivery? [sic]\"\n\nCustomer: \"Yeah?\"\n\nMe: \"Well, I apologize, but it seems that in the confusion I got shorted $10...\"\n\nCustomer: \"Are you kidding me? Don't fucking tell me that!\"\n\n*click*\n\nOkay, that went well.\n\nI relay the conversation, verbatim on the important customer part, to GM.\n\nGM: Alright. *fixes the order with $10 discount*\n\nMe: *blinks*\n\nSo, I guess it worked out, but it pisses me off that I got played there. Annoyed me all night, which had already started with an ~exact change on a $21 order (technically like 14 cents over, complete with a \"keep the change\"; thanks buddy) ; ended with a wild goose chase (called out as such before I left; sure enough guys IF WE KNOW YOU TOOK THE ORDER WRONG AND THE CUSTOMER'S NOT ANSWERING THE PHONE, DON'T TELL ME BOTH TO \"NOT WASTE TOO MUCH TIME WITH IT\" *AND* TO STILL GO TRY TO DELIVER IT!\n\n...\n\napologies for shouting; sorta. Kinda need to get that off my chest after tonight. Tonight I felt like \"alright, I'm just going to get the shit end of the stick all night; fine then\". My motto for the end of the night was \"proving that even the worst night delivering pizzas is better than the best night at minimum wage flipping burgers\". I cashed out for a couple bucks lower than I did last night. Last night was slight over 3 hours. Tonight was about 7 hours. And I considered that good with the way my luck was running.\n\nI do rather enjoy gambling, and I like the scratchcard nature of deliveries: sometimes you win a bit, sometimes you win the minimum, sometimes you win a lot.\n\nBut before tonight, I'd never really considered the possibility of coming up short seriously.\n\nI had another close-call in that regard tonight as well, at least from my view of it: customer signed, I delivered, off I go. When I look at the receipt before depositing it, I see the customer wrote a total amount actually less than the printed order amount, after having written in some tip amount that would have correctly added up to exactly $10 more than the figure he actually wrote in the total.\n\nComplete with proper signature and all.\n\nAs I told the boss while cashing out and the screen flashed up the warning for taking a below-order-total amount after he'd automatically keyed in the clear total written by the customer: \"I think the guy was an idiot rather than a jerk.\" He remarked \"It's lucky he has someone who knows how to take care of it.\" and entered it for the +$10 amount logically implied. :-)\n\n---\n\nBut I still cashed out. And my effective hourly, between base wages in the paychecks and this cash, is still beating double minimum wage, so, it works.\n\nNext time though...I'm checking the damn cash and never trustin' nobody! I've already gotten it through my head that they don't touch the food until I get payment, cash or card(/cc-receipt)+signature as the case may be. I had been more conscious of checking after customers after I'd made a delivery one time where it ended up like $2 short, and I really chalked it up to the customer just having miscaculated rather trying to rip me off, and just was more cautious about counting the cash when there was a question.\n\nBut I so often get: \"here's $X\" and a wad of cash. I guess I really have to go to counting it out each time before I leave, at the very least.\n\nThe nice thing is, most customers pay in such a way that this isn't a problem. I get so many $20s where it's a reasonable tip about the order, and I'm fine. I had one where I was certain going out of the store that I was going to get stiffed. It was a $20 order *exactly*. I figured it had to be a customer who went out of their way to be able to pay exact with no tip. I pulled up; delivery instructions said to call a certain number when I arrived. Customer comes up:\n\n\"I think you're trying to call me.\"\n\nOh, that would make sense. Customer puts out cigarette.\n\n\"That'll be $20 please.\"\n\nCustomer hands me a $20 and a $5. Nice! :-)\n\nDeliveries like that really make my day. An easy and fast delivery. I was on a double at that point, theoretically. The wild goose chase lay beyond me yet on that run, but I'm quite glad I delivered to the real address on the way first. ;-)\n\nIt was actually close enough I'd wanted to do a walking delivery to it. But the bosses wanted to have wild goose chase run out, so I had to keep waiting to do that double, where as per a normal run, the vehicle is necessary. But I could've had that pizza out there sooner if we'd just done as the boss noted he could do: drop the order because the customer hasn't answered their phone after two calls (and we've heard that the address was entered wrong anyhow! No such address on that street; there's a reason it makes no goddamn sense to anyone looking at it who's delivered on that road!).\n\nOh well, it was still a fast delivery from the customer perspective. I just could have made it \"wait, really? I just put that order in like 20 minutes ago!\" or perhaps even a bit better. ;-)\n\nIf this is among my worst days delivering pizza, that's fine. I'll be a bit more careful in the future and keep consistently scoring well.\n\n[I got to say it was a good day](https://www.youtube.com/watch?v=8CPlF-IEkXQ)",
        "created_utc": 1450513860,
        "upvote_ratio": ""
    },
    {
        "title": "Is it common to see people being weird in the business?",
        "author": "ChurroChick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xfm24/is_it_common_to_see_people_being_weird_in_the/",
        "text": "I keep seeing things that say so and so customer wanted me to dance, sing etc. or people got real weird with their orders and shit and as the customer I can't believe it. It's just that, you know, I usually answer the door Friday nights wearing my oversized eeyore pajamas and ask the delivery guy if he's seen any good shows or movies lately. It's insane to me that delivery drivers see things like this",
        "created_utc": 1450501262,
        "upvote_ratio": ""
    },
    {
        "title": "If it's legal in your state, do you/would you carry a handgun? Today, I wish I did.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xfcmx/if_its_legal_in_your_state_do_youwould_you_carry/",
        "text": "[deleted]",
        "created_utc": 1450495743,
        "upvote_ratio": ""
    },
    {
        "title": "I live for nights like this.",
        "author": "TheDudeDasko",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xf6rt/i_live_for_nights_like_this/",
        "text": "Snow coming down heavy (Michigan), super shitty roads, cold, Christmas time = super busy, both carryout AND deliveries.\n\nAs a bonus, since it's Christmas time, I got a gift box of Russell Stover chocolates!\n\nWill edit later with final tip amount. Stay safe out there, my fellow pizza pie people.",
        "created_utc": 1450492542,
        "upvote_ratio": ""
    },
    {
        "title": "The star wars spoiler (spoiler free post)",
        "author": "Tekedi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xepq5/the_star_wars_spoiler_spoiler_free_post/",
        "text": "This is a short post, as I'm working now, but someone wrote, in the instructions, on the ticket for my next delivery a star wars spoiler that many people saw. I didn't, but this may turn out to be the worst day at work ever, if this happens. \n\n\nI will keep the thread updated. Good luck out there, be safe, and stay away from spoilers.",
        "created_utc": 1450483401,
        "upvote_ratio": ""
    },
    {
        "title": "The curse of being an attractive male delivery driver.",
        "author": "pizzadriver1-101",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xbmg3/the_curse_of_being_an_attractive_male_delivery/",
        "text": "[removed]",
        "created_utc": 1450426986,
        "upvote_ratio": ""
    },
    {
        "title": "What saving at Dominos for 12 months at moms house get you. (Mostly ideas)",
        "author": "Endlessmanager",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xat3x/what_saving_at_dominos_for_12_months_at_moms/",
        "text": "I've saved $18,000 at Dominos this year. I give my mom $200 a month for utilities and the rest of my expenses are on me. I would say I've spent about $5,000 on food, car, and living expenses this year. I'm not sure how I'm going to do it, but I'm looking to invest in a home soon.  As a way to pay off the mortgage quickly, I'll rent it out and pour my income into it for the next few years. I'll be 22 next week and I'm looking to have my house paid off by 25 simply by working 30 hours a week delivering pizza, with the caveat of living with my mom. Not really a tale, but maybe inspiration to some other drivers not sure what they're doing with their lives either.",
        "created_utc": 1450409158,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for moderators",
        "author": "rdeluca",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xakm0/looking_for_moderators/",
        "text": "Hey all,\n\nWe're getting a bit bigger and I've decided to look for moderators.\n\nIf you think you'd be a decent moderator just leave a message here and I'll scan your history, judge you, and forget completely for a while, come back and then grab four people I can probably trust.\n\nExperience is a plus, but not neccesary.\n\nThis is also an apology for making the mistake of adding Redditcoruum to the moderators list. I forgot how childish and argument baiting all his conversations became (even when he's right) and that's just not something I want from a moderator.\n\n\nAnyway, post away.\n\nEDIT: I'll be looking at applications and such Sunday, maybe Monday.\n",
        "created_utc": 1450404732,
        "upvote_ratio": ""
    },
    {
        "title": "Dealerships are dumb",
        "author": "Ki11erPancakes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3xa6pf/dealerships_are_dumb/",
        "text": "I'm sure we all remember this news story: https://www.youtube.com/watch?v=Zw2ZdKhYhj0\n\nMy story isn't as horrendous, but it does make you wonder why certain places like dealerships and other large events/companies are terrible to deliver to.\n\nI wasn't the one that answered the phone and took the order, but that this fat order that was for a dealership was up next. Apparently they were trying to haggle down the price, saying it was too much, too much. The total came to $150. For 8 pizzas, 24 wings, and 4 cookies. They weren't just a bunch of cheese and pepperoni pizzas, they all were fully loaded with toppings. If they wanted to save money, they should have ordered carryout and used the specials we had for that. You ordered delivery.\n\nSo I get there. No one has a clue of who's actually paying, and it was a clusterfuck of wandering around trying to find how this order is getting paid for. But I mean, they obviously knew that pizza was coming, they had a table and drinks set out for whatever meeting they were having on the second floor. So I help unload and set up the pizzas of course, I want to be helpful and earn my tip. As I head back to the main floor, I can hear from the cashier's desk the short argument:\n\n#1 - \"Ha! No, like 2 dollars\"\n\n#2 - \"Are you kidding? Give him at least $10!\"\n\nI round the corner with a fake smile on my face, because I knew they were talking about me, although I didn't like what I heard. The lady at the desk (who I'm assuming was #1) quietly and without saying anything wrote out the check and handed me a $5 tip, and I was on my way.\n\nIt's an easy $5, it wasn't too bad of a clusterfuck compared to other deliveries I've had, but seriously? \n\n\nThey were considering a $2 tip?\n\n\nEdit: words",
        "created_utc": 1450397844,
        "upvote_ratio": ""
    },
    {
        "title": "Does Anyone out there work for a Jets Pizza? If so I could really use your help/advise.",
        "author": "DeadEyeMcS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x9os6/does_anyone_out_there_work_for_a_jets_pizza_if_so/",
        "text": "My question is pertaining to your shirts. I was thinking about gift ideas for a friend of mine, and one of your shirts would be perfect. Jets is her go to food. Ordering from there is her Sunday ritual, and she brings the restaurant up in conversation almost daily. I have called a couple of local stores and asked if they sold them, but have yet to be successful. I was wondering if anyone out there had any idea how I could get a hold of one. I'd be willing to pay a fair amount. Do you think going in and speaking with a manager would work at all? \n\nUpdate: Thanks everyone for the great advise. I actually went to one of the stores and plead my case. They were on board. My friend is very small, and they only had extra larges in, but I purchased one anyways. Figured she could use it to sleep in or something. Can't wait to give it to her!",
        "created_utc": 1450389874,
        "upvote_ratio": ""
    },
    {
        "title": "How to be a faster line cook?",
        "author": "howlwolfy555",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x6l1k/how_to_be_a_faster_line_cook/",
        "text": "I started my first cooking Job ever and it's towards the end of week 3 and I almost have everything remembered and everyone says I'm doing good my only problem is I need to be faster...but how??? I can make 2 pizzas at once I donthink think iv ever been but 3 tickets behind while working alone (pulling dough and topping) I know one hand full of cheese for small 2 for big and 3 for large...how can I get myself to go any faster?? \n\nTl;DR Please give me any tips you have even if unrelated to speed. New pizza cook. Need help! :(",
        "created_utc": 1450332910,
        "upvote_ratio": ""
    },
    {
        "title": "The elevators &amp; elsewhere small-talk depository thread.",
        "author": "DeliveryforMrPink",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x6dlr/the_elevators_elsewhere_smalltalk_depository/",
        "text": "Over my illustrious 12-year pizza career, delivering in an upper-middle-class Midwestern suburb with thousands of office spaces/buildings, I've developed not only the typical service-industry-slave's distaste for humanity, but a seething annoyance, hatred even, for the inane, soul-crushing chatter I'm subjected to every... single... fucking... time I get in an elevator. Or to a company's lobby. Or some joker's porch. Or everywhere else this job takes me, really. \n\nSo, suspecting I'm not alone in this, here's a thread for commiseration on this subject.\n\n\nFirst, in a quote box, the absolute jewels we endure after the doors close and a cubicle drone's six brain cells scream to themselves, *Oh, a pizza guy. I've got the BEST JOKE for this guy!* \n\n\nNext we have my inner reaction, and what I fantasize I'll be saying on my last day in this job. \n\n\nFinally, the cheesedick bullshit that actually comes from my mouth in these situations, as I am but a weak, self-loathing man, who has bills to pay and thus a job to keep.\n\n\n\n&gt; Well gosh, if the elevator breaks down, at least we have something to eat!\n\n~~How about you eat some nice shit directly from my asshole, you fuck? If this elevator breaks down, no doubt more gems will be tumbling forth from your stupid face, and I doubt you'll survive the first hour.~~\n\n* Hahaha, yup, survival supplies!\n\n\n&gt; Hey, let's beat this guy up and steal these pizzas!\n&gt; Ok Steve, you hold him down and I'll take the bags!\n&gt; There's four of us and only one of him, I think we can take him!\n\n\n~~Please, please, please just try.~~\n\n\n* Hahaha! I wouldn't try, I'm trained in pizza-fu!\n* I don't want any trouble, guys. (works particularly well on mid-20's/early-30's oops-my-biceps-don't-fit-in-my-polo pretty-muscle fucks who took the one MMA class at their gym three years ago. Oftentimes they can't see past their egos to realize I'm joking)\n* My boss has authorized the use of lethal force in the safe delivery of these pies.\n\n\n&gt; Gosh, that smells SOOO GOOOD! How do you stand it all day?\n\n\n~~Your obnoxious amount of perfume smells SOOO BAD! How do you &amp; your cubiclemates stand it all day!?~~\n\n\n* Oh, that's just my cologne. (people FUCKING LOVE THIS LINE. LOOOVE IT.) Yup, drives the ladies wild. And the guys too.\n* Sure does, we put *extra smell* on this order!\n\n\n&gt; Got any extras in there?\n&gt; Got any free samples?\n\n\n~~Yup, sure do. These ten XL pies, two catering trays of salad, and six two-liters weren't heavy enough already, so I brought extras along just in case I ran into a jackass like you!~~\n\n\n* No, but I'm selling to the highest bidder!\n\n\n&gt; Oh good, you brought my food! I'll take that. They'll pay for it upstairs though!\n\n\n~~LOLOLOL~~\n\n\n* Nice try! Not falling for that again! \n\n\n&gt; Wow! Looks heavy!\n\n\n~~YA THINK? HIT YOUR FLOOR AND THE DOOR-CLOSE BUTTON YOU FUCK~~\n\n\n\n\n\nMore later. Contributions?",
        "created_utc": 1450328737,
        "upvote_ratio": ""
    },
    {
        "title": "Hi New People!",
        "author": "rdeluca",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x49qt/hi_new_people/",
        "text": "\nWhere'd all 10k of you new subscribers come from!? Not that I mind.\n\n[So there's a bunch of old tips and tricks here](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/1cslcp/just_applied_for_a_delivery_job_advice_for_a/c9l3ycm)\n\nannnnd.... have any questions or comments ask away.",
        "created_utc": 1450295428,
        "upvote_ratio": ""
    },
    {
        "title": "How any of you guys have dash cams?",
        "author": "Baxterftw",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x3qvh/how_any_of_you_guys_have_dash_cams/",
        "text": "Anyone ever record some crazy stuff in the hood or anything?",
        "created_utc": 1450288029,
        "upvote_ratio": ""
    },
    {
        "title": "All of my quarters :(",
        "author": "SpyroThBandicoot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x3jhp/all_of_my_quarters/",
        "text": "So last night, I get to work and see a delivery up on the board. 'Oh great it's *that guy*...' \n\nNow, I knew that I wasn't really getting a tip, but it's whatever. I don't really get pissy about tips unless I get stiffed on a $100 order. However, I forgot that this customer almost ALWAYS only has $20's on him. Since he's my first delivery of the day, I only had my initial $10 on me. His total was $22.92. In hindsight, I should've asked for an extra $10 because I knew this guy was gonna give me $40, but I just wanted to get the delivery out and get it over with. \n\nNow we proceed with the most drawn out delivery of my entire life. I was gone for 30 minutes on a delivery that was roughly 7 minutes away.\n\nI get to the house, knock on the door..... No answer. So I ring the doorbell..........30 seconds later, a confused looking old woman comes to the door. She didn't order anything, but the name and address on the ticket are correct. \"Oh it must have been my son who ordered. let me go get him.\"\n\n2 full minutes later, a disheveled man in a bathrobe comes to the door, looking like he just got out of a coma........ It's my customer. \"Oh sorry about that, I forgot I ordered pizza (15 minutes ago) and fell asleep. How much was it?\" \"The total is $22.92.\" \"Oh ok, do you mind coming in and setting the pizza down here on the table?\"\n\nNormally, I respectfully decline entering people's homes unless they are a regular and I've delivered to them before, but I've delivered to him more than a few times and I know he's not totally there, so yeah I set his pizza on the dining room table next to his front door.\n\n\"How much was the total again?\" \"$22.92, sir. About $23 if that's easier for you.\" \"Ok lemme grab my wallet.\"\n\nAfter a few minutes of him fumbling with his wallet and holding two $20's in his hand trying to struggle with the math, I ask \"Did you want to pay with $40? I'd owe you about $17 back. Unfortunately, I've only got $10 on me in cash, but I've got plenty of change in my car.\"\n\nHe thinks about it for another minute or so........... Sure that will work\n\nSo I run out to my car. Thankfully I keep my quarters separated from the smaller change. I had $7 in quarters........... Perfect, except now all my quarters are gone :( \n\nI guess it's time to sort thru my small change for when I buy a fountain drink from the gas station. \n\nI need to get rid of some pennies anyway :/",
        "created_utc": 1450285071,
        "upvote_ratio": ""
    },
    {
        "title": "/r/TalesFromThePizzaGuy hits 40K subscribers",
        "author": "TrendingBot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x3fbs/rtalesfromthepizzaguy_hits_40k_subscribers/",
        "text": "**/r/TalesFromThePizzaGuy metrics:**\n\nTotal Subscribers: 40,035\n\nSubreddit Rank: 1,125\n\nSubreddit Growth &amp; Milestones: http://redditmetrics.com/r/TalesFromThePizzaGuy",
        "created_utc": 1450283351,
        "upvote_ratio": ""
    },
    {
        "title": "Small pizza, 12 sides of ranch.",
        "author": "nutbastard",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x2k5j/small_pizza_12_sides_of_ranch/",
        "text": "Just kill yourself. Shitpost I know but I had to.",
        "created_utc": 1450267694,
        "upvote_ratio": ""
    },
    {
        "title": "Found a piece of plastic in my pizza... :S",
        "author": "emshlaf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x1y1w/found_a_piece_of_plastic_in_my_pizza_s/",
        "text": "Former pizza gal, now a customer. (Feels weird writing from the opposite perspective.)\n\nAnyway, I ordered Pizza Hut tonight and made it through about 2.5 slices of my pizza before I took a bite of something hard and clearly inedible. I pulled it out of my mouth and found a small piece of broken plastic.\n\nFucking. Gross.\n\nThey're closed now so I'm going to call tomorrow and complain, but like... should I insist on a refund? Should I not order from them anymore in case it happens again? (I'm hoping it was a freak accident - I worked in the pizza biz for years, and this never happened at one of the stores I worked at.)\n\nI am used to being on the other side of the counter so I hated when customers made unreasonable requests... but this seems like a pretty big deal. I could have swallowed it and choked. Advice?",
        "created_utc": 1450251189,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Delivery Guys of Reddit who actually received the\"wet benefit\", tell us your juicy stories!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x16wg/pizza_delivery_guys_of_reddit_who_actually/",
        "text": "[deleted]",
        "created_utc": 1450236654,
        "upvote_ratio": ""
    },
    {
        "title": "First day delivery guy",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x1250/first_day_delivery_guy/",
        "text": "[deleted]",
        "created_utc": 1450234449,
        "upvote_ratio": ""
    },
    {
        "title": "Creepy old guy hit on me via text after delivery...",
        "author": "JakesReich",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x0xxl/creepy_old_guy_hit_on_me_via_text_after_delivery/",
        "text": "The house I had to deliver to was behind another making it difficult to find. I had to call the customers cell phone in order to find the house. Once I arrived back at the pizzeria, I opened my phone to this uncomfortable text...\n\nhttp://i.imgur.com/uYFfHdI.jpg",
        "created_utc": 1450232566,
        "upvote_ratio": ""
    },
    {
        "title": "Guy I delivered to hit on me via text",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x0val/guy_i_delivered_to_hit_on_me_via_text/",
        "text": "[deleted]",
        "created_utc": 1450231363,
        "upvote_ratio": ""
    },
    {
        "title": "The thing with summer deliveries",
        "author": "BuckleyTenenbaum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3x0rgd/the_thing_with_summer_deliveries/",
        "text": "Those people that order a delivery. Go out to chill in their backyard swimming pool. They don't bring their phone. You arrive for said delivery. Ring doorbell. Wait 30 seconds. Knock. Repeat three times. Call phone number on ticket. No answer. Call a second time. No answer. Call a third time. No answer. ~10 minutes have passed since your arrival. Bang on door while ringing the doorbell repeatedly. Eventually customer answers door all cheery and excited for their pizza, still wet from getting out of the pool. Customer says \"Oh, I hope you haven't been waiting long. We were outside by the pool.\" Think to yourself *Why in the fuck would you do that when you are expecting a delivery? How the fuck were you going to know when I had arrived? Do you want cold pizza? We quote delivery times for a fucking reason!* But you simply smile it off and lie, \"meh I wasn't waiting that long.\"\n\n3 hours later you get a call from that delivery's phone number. Pick up, \"Hello?\" \n\n\"Yeah, I got like 4 calls in a row from this number a while ago...\"\n\nShit=lost.",
        "created_utc": 1450229692,
        "upvote_ratio": ""
    },
    {
        "title": "The Legend of Gary",
        "author": "optionaladoption",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wzu1k/the_legend_of_gary/",
        "text": "I was a manager of a pizza place in Kentucky for five years. Throughout that time, the store cycled through around 100 drivers and they each had their quirks, some good and some bad. From lazy to late, stoned to drunk. Guys and girls, blacks and whites. Sure they were all minimum wage drones risking their lives and their vehicles, but they all had a story. This story is about Gary. \nWe always started our new hires on Friday as a bit of a stress test. Busiest night of the week and usually a good tip night, and that's encouraging too. Also, new people don't get a uniform the first week in case they quit and keep the shirt, ya know? So 5 o'clock on this particular Friday, a scrawny dude around 5'6 with a streamlined well trimmed goatee and black slick backed hair walks in. Black denim jeans, cowboy boots and a shirt that was a confederate flag with COUNTRY BOY CAN STEAL YOUR GIRL across the front. I just assumed he was customer so I greeted him like everybody else, generic 'How can I help you?' 'Where can I spit at?', he replied. WTF? 'Um, outside I guess?' He steps back out the door and unloads a lip full of dip on the sidewalk and walks back in. Ok, take two. 'Hey buddy, what can I do for ya?' He couldn't have been 25 but he sounded like Tom Waits; 'I'm here to make a little jingle money, I reckon.' My first thought was that this dude is trying to bum so I said, 'Man, I don't got any cash' and with dead eyes he replied, 'Well let's make some.' WTF #2. 'I don't think I can help you man.'\n'GOD DAMMIT IM GARY AND IM HERE TO DELIVER SOME FUCKIN PIZZA'\n---I'll continue this in the comments\n",
        "created_utc": 1450215986,
        "upvote_ratio": ""
    },
    {
        "title": "Last week I paid for the pizza for a family that couldn't pay for their order. Then this happened... (x/post from /r/TIDTRT)",
        "author": "skeach101",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wyvn9/last_week_i_paid_for_the_pizza_for_a_family_that/",
        "text": "I work part time as a pizza delivery driver on the weekends. I'm not struggling to the point that I NEED to do it, but I have a 2 year old daughter that I send to a VERY expensive school ($1000+ a month...), so every little bit helps.\n\nLast Sunday, I had a Stuffed Crust Pizza order come in at 8:59PM (We close at 9PM) that takes at least 35 minutes JUST to cook. Usually this is annoying, but I was in a good mood, so I just sat in my car and listen to some podcast while I waited.\n\nWhen it was done, I noticed that the customer was paying cash and it was actually on the way home. It was only a $33 dollar order, so I decided I would just pay for out of pocket and then deliver it. That way I wouldn't have to come back to the store after I deliver it.\n\nWhen I get to the house, the customer comes to the door with a credit card in her hand. Suddenly, I realize we are going to have a problem. Since the store closed nearly an hour ago, I know that nobody is going to be there to answer the phones, so I can't charge her card over the phone. I explain this to her as I try to figure out what to do. Eventually, I decide to just give her the pizza and ask that she just bring the cash into the store tomorrow. I mean, I KNOW where she lives, so I figure I can trust her.\n\nThe next day, I stop in the shop to see if she dropped off the money. She didn't. I figured she just didn't get a chance yet. I didn't work until the following Friday, so I decided to just wait until then. Friday comes, and still nothing... (although honestly, I didn't even ask, as I actually forgot about it :P). The next day I worked was Sunday...exactly one week after I dropped the pizza off.\n\nThe owner came up to be with a red envelope. Inside it was a \"Thank You\" card and some cash.... a lot of cash.\n\nInside the card was a rather long note. I'm not going to post the entire thing, but the gist of it was that the customer was extremely grateful for me trusting her. Apparently that day she had her sister over, who is currently has cancer and is going through chemo. She is rarely hungry, but that day, she was actually craving OUR pizza. She says that she will never forget how trusting I was and that I really helped make her sister feel better.\n\nThe bill was $33. Inside the envelope was $104.\n\nToday, I did the right thing.",
        "created_utc": 1450203094,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Delivery Horror Stories and weird experiences. Ex-Driver here. Any stories you'd like to share as fellow drivers?",
        "author": "thatpizzaguy5150",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wumjl/looking_for_delivery_horror_stories_and_weird/",
        "text": "I know we have all read them and been entertained. The best one i have heard was actually a youtube narrator talking about a guy who was basically ambushed in the middle of a dark forest. IF you want me to tell i will. Also have some weird ones of my own. Anyone care to share? Lets hear them!",
        "created_utc": 1450134690,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't people turn their fucking porch lights on?",
        "author": "joojoobomb",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wui9b/why_dont_people_turn_their_fucking_porch_lights_on/",
        "text": "Writing this as I sit in my car outside the store waiting for a delivery in the pouring rain.\n\nI realize that the percentage of people who turn their lights on after it gets dark has to be less than 50%. I'd estimate closer to 35-40%.\n\nDo they think that it's Hawkeye delivering their pizza? That in the interest of getting their pizza sooner and having it still hot, it might be a good idea to let me see the house number?\n\nExtremely frustrating hunting for addresses at night in the pouring rain.",
        "created_utc": 1450133139,
        "upvote_ratio": ""
    },
    {
        "title": "First time I had a customer actually insult my intelligence",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wtmye/first_time_i_had_a_customer_actually_insult_my/",
        "text": "This may be a bit long so I apologize in advance.\n\nThis particular story starts around the middle of my shift, right during our dinner rush. Things are already hectic and we've been quoting customers about an hour and fifteen minutes for deliveries. \n\nI'm getting ready to make a delivery run with 4 orders and as I'm getting everyone's bags ready for their extras, I notice we were out of bleu cheese entirely. He wanted bleu cheese, ranch, and spicy sauce to go with his wings. \n\nWell shit, now I gotta call him and tell him that whoever took his order messed up and didn't tell him we were all out for the day.\n\nAt this point, his order is at about an hour, I still had about 15 minutes to make it there within the quoted time.\n\nI inform him we were out of bleu cheese, apologized and said I'd bring him some extra ranch with his order, and that I'd be leaving to his place shortly. I never said, \"I'd be there in 5 minutes\" or told him anything other than \"I'll be leaving shortly.\" \n\nHe's pretty audibly upset and just says \"Fine.\", then hangs up. \n\nI get all the things ready for my other orders and head out. His order was actually the very first of all the others, which were all around the same time. But his house was on the edge of our delivery zone and at about 6 or 7 at night on busy San Jose streets, it can sometimes take a while to get to some destinations. \n\nI arrive at his house about 10 minutes past the quoted time. But his house is an awkward house that's completely fenced off and it looks exactly like it's supposed to be the corner house of the street I just turned off of.\n\nI look ALL OVER for an address. But it's basically pitch black on this street and I don't see one, nor is there an entrance to the house that I'm pretty sure is the right address. \n\nScrew that, instead of trying to figure this out on my own and wasting even more time, I just call him again to have him help me.\n\nMe: \"Hi sir this is the PMH delivery driver I just wanted to let you know I'm waiting outside what I'm pretty sure is your address but I'm not certain and I'm not sure where to go.\" \n\nJackass: \"Yeah you're 30 minutes late.\" \n\nI wasn't 30 minutes late but I know better than to argue with a customer over that.\n\nMe: \"Well I apologize sir, but I'm here *now*, and having trouble finding your address, would you mind-\"\n\nJackass: \"Yeah I'm outside standing on the sidewalk. Is it still hot or what.\"\n\nI look around for him, I don't see shit, it's so damn dark on this particular street. But I answer his question,\n\nMe: \"Yes sir it's still warm I can feel it through the bag, we try to make sure the pizzas come out when the drivers are ready to take them. But I don't see you anywhere sir, let me just pull around and see if I can get a better look.\"\n\nAs I start to pull forward I hear yelling over the phone *and* outside, \n\nJackass: \"NO, NO, NO! WHERE ARE YOU GOING YOU STUPID MOTHERFUCKER, GET BACK HERE. THIS IS FUCKING BULL SHIT.\"\n\nMe: \"Uh... I'm sorry what was that sir?\"\n\nSilence. \n\nMe: \"Well anyways, let me turn around and get a better look here, I can't see anything.\"\n\nI turn around and he's basically hiding in the shadows, barely visible until I get about 40 feet of him.\n\nI get out and say,\n\nMe: \"Yeah, I couldn't see anything. Couldn't see an address, wasn't sure if I had the right house. That's why I called you.\"\n\nHe takes a laser pointer and points at the address on the wooden fence, placed in a random area, in small print, sure as shit, there it was. \n\nJackass: \"It's right there.\"\n\nMe: \"Right, well, it's extremely dark, I couldn't *see* that you had your address posted up there. Usually in those cases I'll look on the curb of the sidewalk for an address, but you don't even have that. Most customers illuminate their address or leave a light on when they know they have a delivery order. So *sorry* about that sir. Anyway, your total is $41.50.\"\n\nJackass: \"Whatever, let me see the food and we'll see if I'm taking this from you tonight.\"\n\nI pull out the boxes, and this fucker actually brought one of those laser pointer heat reader things out. He points it at the box, and apparently it reads 100 degrees. He opens up the box and points it at the pizza, apparently it reads like 120 or something. \n\nJackass: \"120, what the fuck is this?\" \n\nMe: \"Sorry sir, is that not satisfactory of a temperature for you?\"\n\nI could still see steam coming out of the box and felt how warm the pizza was. 99 out of 100 customers would accept this pizza with a smile.\n\nJackass: \"No. Hardly.\"\n\nMe: \"Alright, well you wanna go ahead and give PMH a call and let them know your order was unsatisfactory?\"\n\nJackass: \"You know what, I'll do that, this is un-fucking-believable. I'm not paying for this shit.\"\n\nMe: \"Cool.\"\n\nWe both walked our separate ways, I still delivered the other 3 orders without a single damn issue, and all were 5 dollar tips. \n\nAND I ate some of his pizza and wings he sent back. It was still delicious. \n\nThat was the first time I ever had a customer call me a \"stupid motherfucker\", and the first time witnessing a customer bring out a heat reader to ensure the temperature of their food was perfect.  ",
        "created_utc": 1450121528,
        "upvote_ratio": ""
    },
    {
        "title": "Always Tip; or the Story of How I Got a Job",
        "author": "InsertSatireHere",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wthom/always_tip_or_the_story_of_how_i_got_a_job/",
        "text": "I don't know when it started, but for years my de facto tip whenever I order pizza is always $5, if the order is more than 3 pizzas for a group I'll always get at least $10-15 from people by guilting my friends (read: \"I'm paying for your food so you're paying the tip or not eating.\") and that's just always been a thing. I didn't even really know about how much people get fucked over with tips, it's just always been something I've done.\n\nSo anyways, I've lived in the same place for just over a year now, almost always order from this local place, got to know a couple of the regular drivers, but usually nothing more than \"how's your route tonight?/Hope the rest of your shift goes fast!\" That is until last week. I was laid off recently and have been living off of savings, ordering a pizza a week and eating that for 4-5 days. Last Tuesday a regular guy asks me how I'm doing after handing me my weekly meal, and I don't know why but I break down. I tell him everything. Girlfriend leaving, Roommate ditching on rent, losing my job, family problems, etc. The guy is a complete bro, he sits there and listens to me for a good 10 minutes, then says \"hang on a sec.\" I stand there not sure what's happening as he steps away for a minute.\n\nAbout 5 minutes later he says \"your pizza tonight is on us, and if you're not doing anything tomorrow around noon come into the store, the manager wants to thank you for being such a loyal customer this past year.\" I start crying and hug the guy. Dude just saved me from going hungry as I can now afford two pizzas this week instead of one. Of course I go in the next day ready to thank the manager myself.\n\nLittle did I know what was about to happen. The store manager sits me down and begins by telling me all of the drivers love going to my house because of my consistent tipping and how polite and nice I am. Apparently my neighborhood is known for not having the most friendly people and there are even some blacklisted places just down the street. I never knew. Anyways he tells me that they are in need of some new drivers, and would I like to schedule an interview.\n\nHad my interview this morning, the SM called me about 30 minutes ago saying the Owner OK'd the hire and when can I start working. I just wanted to say thank you to the place that is saving me from being homeless and to always tip your drivers, you never know what'll happen.",
        "created_utc": 1450119502,
        "upvote_ratio": ""
    },
    {
        "title": "\"Boy, you're gonna give me that pizza.\"",
        "author": "VTwinVaper",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wted2/boy_youre_gonna_give_me_that_pizza/",
        "text": "Back in 2007 I worked in a call center.  They had just acquired a contract for a cell phone company, so their increased need for employees caused the hiring process to be a bit...lax.  A few months in, I found myself working in a bay (think large cubicle for multiple people) next to this guy named Jonathan.\n\nJonathan was a bit scruffy, in his mid to late thirties, and was a little...odd.  He always had an opinion on whatever you were talking about, and he always had a way of making conversations taken an uncomfortable turn.  I can't remember most of his conversations, but I'll never forget his highly-embellished story about when he delivered pizza.  In his own words:\n\n&gt;\"Being a pizza delivery guy is the most dangerous job you'll ever do.  When you deliver pizza, you have three things that people want: you have food, you have money, and you have a car.  I used to deliver pizza, and I would wear a chainmail shirt under my uniform in case someone tried to stab me.\n\n&gt;In my last year delivering pizza, I went to this guy's door in a shady neighborhood.  He opened the door with a shotgun in hand, and a look of murder in his eyes.  He cocked the shotgun and said, \"Boy, you're gonna give me that pizza.\"\n\n&gt;I took one look at him, pulled out my .38, and replied, \"Boy, you're gonna give me $19.95.\"\n\nThe project shut down sometime after that.  I don't know what happened to Jonathan, but sometimes I imagine him out there, pistol in hand, fighting the good fight.  Jonathan, wherever you are, I hope you wear your chainmail shirt with pride.  Sure, your story is almost certainly BS, but I'll never forget it after all these years.  And next time around, when you pull your pistol to encourage your customers to pay, don't forget to ask for a generous tip. You've earned it.",
        "created_utc": 1450118210,
        "upvote_ratio": ""
    },
    {
        "title": "Nice house no tip.",
        "author": "MHG_Brixby",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3ws2rd/nice_house_no_tip/",
        "text": "I'm recalling a time I delivered at the very end of our area, about 20 minutes, into a very nice 3 story 4 car garage house for a $50 order that resulted in exact change. The part I actually laughed at is that there was a literal pony in their yard.",
        "created_utc": 1450097272,
        "upvote_ratio": ""
    },
    {
        "title": "Drunk women 10 minutes before cloae \"Yeah I just called a minute ago and order a pizza? We don't drive so can you do me a favor and have the deliver driver pick us up cigarettes?\"",
        "author": "book-reading-hippie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wr4vl/drunk_women_10_minutes_before_cloae_yeah_i_just/",
        "text": "No mam we can't do that..\n\"Can you ask him\"\nNo mam\n\"Let me talk to him\"\nHe's mopping mam were trying to clean up for close \n\"*i* *can* *tell*\"",
        "created_utc": 1450074946,
        "upvote_ratio": ""
    },
    {
        "title": "The Porn Star and the Crazy Guy",
        "author": "catman007",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wqtqp/the_porn_star_and_the_crazy_guy/",
        "text": "So I worked as a pizza delivery driver (as a summer job) for a small-ish company in my hometown a few years back. I have countless stories just from that summer, but I have two that stick out more than any others. \n\n1.) The Porn Star. It's a delivery to an apartment complex, nothing out of the ordinary. However, it was one I hadn't been to yet and I had trouble finding the correct apartment number. I finally find the place, and upon my knocking on the door a lady who must have been 45 or so opens the door - she's wearing a red silk robe, and has a pretty large chest. I should mention she was only wearing this red silk robe, nothing else, save for heavy makeup. Behind her is a pretty ripped white dude, about 27 and shirtless, with this backwards white baseball cap. The lady was super nice and just a little flirty. The guy had put a camcorder on the kitchen table and was like \"Thanks for the pizza bro!\" I got tipped well, if nothing else. \n\n2.) Ah, the crazy guy. This story starts with the phone call - I didn't pick up anything unusual about him until I said \"bye\" to hang up the phone. I was about to hang up when he stopped me and said \"NO!! If you say 'bye' it means you'll never see me again, you have to say 'see you later!' Now say it!\" So I said it, hung up, and shortly after I was off with his food. Now, this guy lived on the rural outskirts, pretty far away. Not in a trailer, but in a camper that was sort of permanently on the side of the road in a field (he had made several orders in the past, and this wouldn't be the last time he ordered while I worked there). So I walk up to the door of his camper, and he's already sticking his head out yelling nonsense at some cows that were about 20ft away. I give him his pizza without incident, but he had this thing where he would switch from \"normal\" to \"crazy\" in a matter of seconds, and back again. When talking about the cows, he was kinda crazy. When paying for the pizza, he was normal. When I left and said \"bye\" (a mistake) he went crazy again. Not angry, but just...very unusual. To this day I say \"Later\" to people more than I tell them \"Bye\". ",
        "created_utc": 1450069141,
        "upvote_ratio": ""
    },
    {
        "title": "The Horrors of being a Female Delivery Driver",
        "author": "applehanover",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wqb8s/the_horrors_of_being_a_female_delivery_driver/",
        "text": "Hey, there.  I had no idea this sub was even a thing until earlier today, but I used to be a delivery driver for a relatively large pizza chain with stores in the west and northwest of the United States.  \nHere's one of my horror stories:\nI was driving a single large and a salad out to one of the bigger, scuzzier apartment complexes in town, towards the highway.  I hadn't delivered there before as I was new to the job at the time.  It had been a pretty normal evening.  Business at this chain was usually slow, because our town has lots of local pizza places that are much more popular.  \nAnyway, I'll set the scene. I'm driving out to this place.  I turn the last corner and park.  I look at the address on the ticket; it's the top floor.  Of course it is.  I climb the three flights of stairs and look for the number.  For some reason, I can't find it.  I figure I'm just skipping over the door without thinking about it and keep looking.\nI finally find the right door.  I couldn't see it before because the porch light was off and the numbers were tilted at a weird angle, like they were falling from the door.  Usually people who are expecting an order leave the light on, so that was a little weird.  I walk up to this dark apartment and knock on the door.\nI hear quick footsteps.  Not unusual; I'm often the highlight of the day, so people get excited.  I hear several locks click and unlatch on the other side of the door.  Now I'm starting to get a little weirded out.  Why does this guy have so many locks?\nThe door opens and reveals a surprisingly clean-cut dude.  He's freshly shaven, his short hair looks meticulously done up, and he's wearing a button-down.  He looks about thirty five. I quickly look past him into his apartment and see that it's mostly empty, save a table next to the kitchen counter.  On the table is a few wadded bills.\nThe man looks at me, gives a quick hello, and tells me that my money is on the table.\nHe stares at me.\nHe tells me again to go grab the money.\nI'm immediately worried.  One of the first rules of delivery is \"avoid going inside if at all possible.\"  I'm getting really, *really* creepy vibes from this situation, and clutch the pizza and salad.\n\"I'm not going in,\" I say as firmly as I can manage.\nThe guy looks flustered, like his plot to kidnap the pizza delivery person has failed miserably.\nJust to be sure he's not going to do anything fucky, I reach down for the pepper spray I keep on my waist (safety first).  The guy seems defeated and hands me the money, takes his pizza and salad and slams the door.  He didn't count the bills, so I ended up getting a pretty big tip.\n\nTLDR; narrowly escaped a weird pizza delivery kidnapper guy with surprisingly good hygiene habits.\n \nEdit: a letter\n\n\n",
        "created_utc": 1450060666,
        "upvote_ratio": ""
    },
    {
        "title": "Christmas carol story made me want to tell a similar story",
        "author": "McDuble",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wpvc3/christmas_carol_story_made_me_want_to_tell_a/",
        "text": "I worked for a national pizza chain, with online ordering, where you can also rate your driver and what not. ill leave it at that. worked for the company between a few stores through out college and until i found a real job 2 years after college. in total about 6 years. \n\nI had an online order last year that had instructions \"do chicken dance or no tip.\" now if it just said do chicken dance i wouldn't have cared. i would have laughed it off. the fact that it said \"or no tip\" is what pissed me off. at the time I had already graduated, and passed my fundamentals of engineering exam, so i would have already been a civil engineer but the job market was tough so i was doing what I had been doing for years that was decent money, but this got to me all the time constantly telling myself i am working this shit job that gets NO respect, less respect than any waiter or bartender, when i work rain and shine, in blizzards, or -20F degrees. but i liked being on the road so i put up with it. \n\nso i take this delivery and my plan is just to not mention it, be nice as usual and not bring it up. \n\nso i get to the door, typical hello how are you your total comes to blablabla. \n\nshe looks at me and says \"you didnt do what i asked you to!\"\n\nnow many of you might say my response was not professional but i tried to be as nice as i can while i was actually pretty offended, but i said while giving a slight curteous laugh: \"Ahh well I think i work pretty hard for my money already, i think my dignitity is more important.\" now i probably shouldn't have added the dignity part but screw that girl. i think she was in HS, but she could have passed for 20 years old too so i dunno. the neighborhood was more families so its hard to say. either way i wasn't a total jerk about it either, i sorta said it half jokingly. \n\nshe doesn't say anything back, as I am pulling the pizza and whatever else out of the hot bag. she hands me EXACT change, i take it and say \"thanks, have a nice night\" exact words.\n\ni get back to the store and see she rated me a 1 out of 5 stars online, and said i was rude to her. at that point i was pretty upset. i can fake put a smile on my face but the disrespect and than giving me a bad performance review (some managers actually take it serious and will question you about bad reviews if there are specific comments).\n\ni called her back, but she didnt answer so i left a message. i didnt yell or anything, but i told her something along the lines of \"hey this is mcduble from pizza place, i just saw your feedback online so i wanted to follow up about the review. it said i was rude to you, but i think on the contrary you were actually extremely rude. we work very hard, and get hot food to you within 20 minutes and that is what our service provides. you can order from us again, but don't EVER ask such a ridiculous request of our drivers. we arent CLOWNS for you to make dance for your entertainment. we deliver you food, and people appreciate the service and typically give the drivers a tip for that service. have a nice night.\" she never ordered again that i ever saw. \n\npeople in that town were pretty decent typically though. when i worked at a pizza place in duluth, mn it was the worst. many of the roads are steep like san francisco, but with harsh winters, sometimes a foot of snow or more in a day during blizzards that we would still deliver in. might add some of those memorable stories too. \n",
        "created_utc": 1450053678,
        "upvote_ratio": ""
    },
    {
        "title": "The most unexplainable thing you've seen on a delivery?",
        "author": "Gertful",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wprc2/the_most_unexplainable_thing_youve_seen_on_a/",
        "text": "It was a basic delivery in a subdivision near my high school. I was probably 50 yards from the house I was delivering to and there was an SUV driving in front of me. All of the sudden they stop in the middle of the street, and I'm a little weirded out, not sure what's going on. It's the middle of January, and about 40 degrees outside. A door opens, and a kid around my age (17 at the time) jumps out of the vehicle in nothing but underwear and runs across the road in to someone's backyard. I stare, not knowing what to make of it. The SUV keeps driving, and after a minute so do I. I finish the delivery and go back to the pizza place I work at. I still think about the mystery streaker from time to time. What's your story? ",
        "created_utc": 1450052050,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you, \"salad guy.\"",
        "author": "Generati0nY",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wpice/thank_you_salad_guy/",
        "text": "I just discovered this sub and it's cool to see a sub like this exists. I was a driver for about a year at a certain basketball school in New England. I'd just like to give a quick thanks to a student who would order a $11 salad (really good, trust me) and would tip $5 each time. \n\nHe was a shy kid and would always be there when I arrived. Tipped said thanks and went back upstairs. I made sure to bring him his salad everytime I was on the clock. Just figured I'd say thank you again. ",
        "created_utc": 1450048344,
        "upvote_ratio": ""
    },
    {
        "title": "The time I delivered pizza in a fire truck",
        "author": "ChrispySC",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wpg32/the_time_i_delivered_pizza_in_a_fire_truck/",
        "text": "For about two and a half years I worked as a pizza delivery guy so I have my fair share of horror stories to tell but this is by far my favorite pizza guy tale. \n\nThe boss was doing some promotion with the local Fire Department for a rather small municipality. If someone ordered pizza from that area and had proper fire safety equipment installed, such as a smoke detector, fire extinguisher, et cetera, then they would receive their order FREE!\n\nSo after about half an hour of these three firemen rather awkwardly waiting in our lobby we finally get a delivery to their municipality and it just so happened to be my run. I hop up in their fire truck with a huge grin on my face.\n\nThe firemen are super friendly; especially the fire chief. We pull up to this little house, remote and out of the way, neighboring houses nowhere to be seen. We're right outside the house and suddenly the fire chief blasts his sirens and turns on his lights. I start laughing, caught completely off guard by this. \n\nThe four of us hop out and the chief knocks on the door. Some scrawny kid dressed in baggy clothes, couldn't be older than 19, greets us looking as if he's about to shit his pants. The chief explains the situation and asks him if he's got any fire protection installed. No smoke detector, no fire extinguisher, nothing. \n\n\"Ah, well,\" the chief says, \"make sure you go and get those installed. We'll be coming back next week to check up.\"\n\nI give the kid his pizza and two bottles of Coke, which makes me believe that his friend was there but had completely booked it at the sound of sirens. \n\n\"Since it's free make sure you give the guy a big tip,\" says the awesome chief.\nThe kid, with shaking hands, pulls out 10 bucks from his wallet and hands it over to me. \n\nWe leave and hop in the truck, all of us laughing our asses off.",
        "created_utc": 1450047394,
        "upvote_ratio": ""
    },
    {
        "title": "i work at PJ's.... just ordered from dominos....",
        "author": "SauceMasterFlex",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3won3g/i_work_at_pjs_just_ordered_from_dominos/",
        "text": "i feel like im doing a dirty dirty thing....but i really wanted a bread bowl...gonna give the guy a fat tip though cause i had a great $300+ weekend.  I told the guy I deliver for PJ and gave him a 10$ tip... i feel good about myself today and i know how a good tip can change your day. ",
        "created_utc": 1450035895,
        "upvote_ratio": ""
    },
    {
        "title": "Smokin' Dat That Good Shit",
        "author": "DeliveryChick",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wmqxy/smokin_dat_that_good_shit/",
        "text": "So this happened several months ago, but I get reminded of it fairly regularly. I was delivering to this semi-sketchy apartment complex (the kind that rents out by the room, no the whole apartment) late at night. There was a skunk tottering around and it was obvious he recently sprayed somewhere. I avoided him and got the the apartment that ordered, optimistic for a tip since I didn't remember this particular person ordering before. After knocking on the door a middle-aged black dude opens up, takes a big whiff of the skunk smell and exclaims \"SOMEONE'S SMOKIN' DAT GOOD SHIT!\" I just started laughing and go, \"No dude, that's a skunk.\" He looked puzzled but still seemed determined to find out where the weed was. In the end I got a tip, and remember that story every time I smell a skunk. ",
        "created_utc": 1449999502,
        "upvote_ratio": ""
    },
    {
        "title": "\"Sing a christmas carol for a tip\"",
        "author": "pizzathrowaway7035",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wmis1/sing_a_christmas_carol_for_a_tip/",
        "text": "I've been a pizza delivery driver for several years, and today is the first day I legitimately feel ashamed of doing what I do.  This story may not seem to be a huge deal to some people, since it's probably more of me being socially inept when it comes to a big audience and being recorded and not being comfortable with my singing voice.  So I may be overreacting, but I can't shake this feeling of humiliation.  \n\nSince I was a kid, i've always been pretty shy.  Even amongst close friends i'm somewhat quiet.  And I am absolutely terrible speaking in front of large crowds.  I remember in highschool having nightmares for weeks about having to do an upcoming presentation, and I would be dreading doing it every day until the day of.  Not only that, but i'm a terrible singer, and I know it.  I don't even feel comfortable singing in front of friends and family.\n\n\n\nWhich brings me to the actual story. I had a delivery today with a note written in the 'special instructions' section that said \"Sing a christmas carol for a tip\".  I didn't really take it all that seriously, and figured they were just joking.  And if they weren't, I thought of a corny line to say while driving there to hopefully satisfy them if they were serious.  \n\nSo I show up and it's some kind of small party going on.  There's probably roughly 10-15 teenagers gathered around in the living room and the mom comes to the door and takes the pizzas (there were 6 larges) as I give her the receipt to sign.  \n\nShe then looks at me with a smile and goes \"So did they tell you?!?\n\nMe:  \"Haha, oh the note?  Yeah I saw that, but trust me, you don't want to hear me sing.\"\n\nHer:  \"Oh come on, you have to!\"  She then ushers me inside and closes the door behind me.  All of the people there are watching me and already have their phones out recording me.  I instantly get uncomfortable and want to leave as quickly as possible.  An audience is one thing, but being recorded my multiple people will instantly make me feel anxious.\n\nHer:  \"Well go on, sing!\"\n\nMe:  \"No really, i'm a terrible singer, i'm sure I will ruin your christmas!\"  (christmas is still several weeks away, I have no idea why they wanted a christmas carol so bad)\n\nHer:  \"OH COME ON.  *I'll make it worth your while*\"  She said as she waved a 20 and a 5 in front of me. \n\nI continued to insist on being a terrible singer and not being comfortable with it, but she kept pushing.  Eventually I decided to try my corny line and hoped it would satisy them.  \n\nSo I just said \"Okay, how about, rub-a-dub-dub I brought you some grub!\"  Which was corny as fuck and holy hell so cringey to say and made me feel infinitely more uncomfortable.  \n\nObviously no one laughed, and she went \"No, it has to be a *christmas carol*!\"\n\nI insisted more about not wanting to sing and was starting to get seriously pissed off and uncomfortable that she wasn't taking no for an answer, and she kept waving the money in front of my face to 'encourage' me, so finally I just said \"Look, i'm sorry but i'm not going to sing for money.\"\n\nShe looked at me incredulously for a second and went \"*Woooooooooowwwww*  It was only for fun you know.  Well, you're definitely not getting **this** then,\" She said as she pulled the 20 away and only gave me the 5 and the receipt she had signed.  \n\nI said thank you and quickly left, while I heard several comments behind me from everyone else like:\n\n\"Wow, is he serious?  What a dick\"\n\"Ugh, gross\"  (wtf this even means I have no idea.  disgusted she didn't hear a christmas carol i guess)\n\"Wow did he really have to make us feel so bad?\"\n\nSo yeah.  It's just being pressured to sing which I guess should just be fun, but I've never felt so used and humiliated while working here.  I legitimately feel ashamed to be working a minimum wage job now, and truly feel like i'm on the lowest rung of the ladder in society.  I was just a tool for their entertainment that they thought would jump at the chance to make a fool of myself for an extra 20 bucks.  I'm a pizza delivery driver, not a fucking performer. \n\n\nedit: first time getting gold on reddit and it's on a throwaway, haha.  Thanks though!\n\n**I really really appreciate all the kind words everyone.  It's awesome going from feeling humiliated last night to feeling proud of myself today.  Thank you all so much!**",
        "created_utc": 1449993482,
        "upvote_ratio": ""
    },
    {
        "title": "Closers and late employees when corporate orders a crack of dawn meeting.",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3whz9k/closers_and_late_employees_when_corporate_orders/",
        "text": "What is your opinion or excuses when they want you to come into a meeting about 4 hours after you finally get get sleep? There's a 930am meeting for wingstreet and fries 5 hours from now. I closed by myself. The only driver for the last 2 hours we were open. They expect us to show up at the Crack of dawn. Fuck that! I'm sleeping! They expect too much for minimum wage and very late night closings! This is coming from people that are used to getting up at 6am for work. What if they scheduled meetings 4 hours after their normal bedtime?\n\nFuck that! I'll take the write up if any for my sleep!",
        "created_utc": 1449913538,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a bane of your existence when you get a delivery to the hood, new customer, over $50 in food, and the card holder and card isn't there?!",
        "author": "whydoipoopsomuch",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3whxm3/is_it_a_bane_of_your_existence_when_you_get_a/",
        "text": "Question asked. I usually waste 20 to 30 minutes at those locations. You have to explicitly spell it out to those people that if the card isn't there, and the card owner isn't there, that we have to bring back the food, no matter how much of a fuss they act. I'm my area, we have lots of fraud, stolen cards, the card holder doesn't sign for it, asking to show pictures of the card, etc, etc... \n\nBottom line legally, if the card holder and the card isn't there, and we don't make an imprint of only the last 4 numbers on the card, there are a lot of loop holes that the card holder can claim to deny they authorized the payment. I've heard all the sob stories only to end up giving them free food and scam us.",
        "created_utc": 1449912487,
        "upvote_ratio": ""
    },
    {
        "title": "Dear Bitch,",
        "author": "Hippster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wheyn/dear_bitch/",
        "text": "You're driving 15 mph under the speed limit, 20 in a 35, on a decently busy road. You saw me drive up behind you and have to brake to come to your pace, then you saw as traffic started backing up behind you at almost 9pm when no one's on the roads. \n\nSo, I beep because, \"hey, why not, you're literally driving so slow that people are piling up behind you and you are not going any faster.\"\n\nStill nothing, I beep again, because now you've gone almost a full half mile going 15 under the speed limit causing traffic and you that people are clearly behind you.\n\nWe arrive at a red light, and what do you know? Door to the car that's going 15mph under flies open, and out steps Bitch we'll call her, I also do really think that Dumb Bitch also could work here, and she walks over to my driver window shouting at me for apparently following too close to her, which has been 100% her fault. lol\n\nSo, she's screaming at me on the other side of my window, and I'm just cautious because this person is already raging at me, for nothing I've personally done and they're also outside of my car window and pissed, I was worried she may hit my car.\n\nI personally didn't hear anything she said because my music was pretty turned up, but just in case I could hear anything she had said I had turned up the music a bit when she walked over to my car and was yelling. \n\nI just can't fathom why would you think, \"I'm going to get out of my car and rage at this person behind me because they beeped at me for something I did.\" \n\nSo of course, I was expecting the complaint to come in by the time I was back in the store because I was on my way to a delivery at the time, fully 100% expecting this Bitch to have called my store and complained about it by the time I made it back.\n\nNo, she hadn't called the store yet, but I was only a bit off, she called within 15 minutes and said \"I was so far up her ass that if she had needed to brake, that there would've been no way for me to not hit her\" lmao She is on the phone with my manager who is doing his job and dealing with the complaint, she says to him that she would sue him personally and the company if I hit her, and omfg I lost it, what is in your head, because it doesn't seem to be a brain.\n\nFor 1 thing, we're literally driving 20mph because of you Bitch, it would take literally 1 full minute to run into your bumper if you decided to brake.\n\nAnd for 2, we're literally driving fucking 20mph because of you Bitch, I can come to a stop behind you if you decide to brake, also seen when we came to a stop at a red light and you decided to jump out of your car because you have problems.\n\n\nTL;DR Bitches be crazy &amp; tripping",
        "created_utc": 1449900480,
        "upvote_ratio": ""
    },
    {
        "title": "Is it just me or are hospitals and nursing homes just the worst?",
        "author": "SyphiliticMonk",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wgtbk/is_it_just_me_or_are_hospitals_and_nursing_homes/",
        "text": "I'm not sure if it's just one of those unwritten rules of delivery I don't know about, but I swear I never get tips from nurses, like ever. Patients or old people at nursing homes have tipped me, but they're much rarer.\n\nNot only is it a pain in the ass just to figure out who ordered it, what floor they're on, where to meet them, etc. Then they take their time and the whole thing ends up taking like 5 minutes, and you don't even get a tip after all of it. \n\nAny other people that order from their place of business tend to tip well in my experience, whether it be people in offices, managers, blue collar workers, mechanics, etc. I just find it so unusual, like what is it about nurses that make them not want to tip delivery drivers? Let me know your experiences and if it's just me.",
        "created_utc": 1449889587,
        "upvote_ratio": ""
    },
    {
        "title": "Accidentally gave a 200% tip once",
        "author": "Wakesphere",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wdzd9/accidentally_gave_a_200_tip_once/",
        "text": "So, I guess I should preface this by saying I was the customer in this one. \n\nHappened a few weeks ago, me and a few friends were having a D&amp;D session, so I offer to order us a few pizzas (I had gotten a nice paying job recently after being unemployed for a long time, and I felt like doing something nice for them for a change)\nAnyway, we order 3 large pizzas, dude shows up after, I don't know, 30 mins or so. Proceeds to tell me that our total is 40 dollars or so (Cant remember the exact ammount)\n\nI know the guy somewhat, he's delivered to us before when we order, so I plan on giving him a nice tip. I hand him 3 bills, which I assumed were all 20's, and tell him to keep the change. \n\nI swear, his eyes lit up like a Christmas tree when he looked at the bills and he said something to the effect of \"Holy shit, are you serious? You guys are the fucking best! That's the biggest tip I've ever gotten!\"\n\nSo, smiling, he goes on his way, and me and my friends are talking about how its a shame that a ~$15 tip is the biggest he's ever gotten, since he's a nice guy and pretty reliable.\n\nWell, fast forward a few hours, and I get a call from the manager of the pizza place. She proceeds to tell me one of their drivers who delivered to us came to them asking what they should do, because I gave them more than I should have. Turns out I gave the guy two 20's and a 50, rather than three 20's, essentially giving him a $40+ tip. They asked if I wanted him to drive back to give me my money, as it must obviously have been a mistake, (Which of course it was), but the dude is always so friendly, and he was clearly super excited about the whole thing, so I said \"Nah, I meant to give him that much. He does a good job. We get him a lot when we order delivery.\"\n\nThe manager is kind of stunned, and offers us a few free pizzas for being so generous.  Every time we order now, they give us a discount, because they flagged something in the address I guess, and we always get the same delivery guy now, who I always give a good tip to (although never that much again, oops), and he usually stays to shoot the shit for a few minutes.\n\nTL:DR - I accidentally gave a delivery driver a 50 instead of a 20, and now we're kind of friends and their location loves us.\n\nEdit: Formatting was shit. Sorry. This is like my 3rd post on Reddit.",
        "created_utc": 1449848878,
        "upvote_ratio": ""
    },
    {
        "title": "Any delivery drivers from Australia here?",
        "author": "danielgibbons321",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wb383/any_delivery_drivers_from_australia_here/",
        "text": "Just curious to see how many people here are from Australia. From most of the stories I read on here, they seem like all from the U.S.A. I have also noticed that tipping seems to be like a mandatory thing that every customer must do, where I work in Australia, we just drive and dont expect anything and just hope that luck comes our way.",
        "created_utc": 1449796304,
        "upvote_ratio": ""
    },
    {
        "title": "I am easily amused by my own antics.",
        "author": "Torpid-O",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3wahhj/i_am_easily_amused_by_my_own_antics/",
        "text": "Last night I did this and it got a couple of laughs. As I was walking up to the door on a delivery, I saw through the windows that the guys inside were playing Fallout 4. So, when they answered the door, I said, \"Hello! Vaut-Tec calling!\"\n\nIt got a few laughs and we talked about Fallout 4 for a couple minutes. I just thought I would share.",
        "created_utc": 1449787822,
        "upvote_ratio": ""
    },
    {
        "title": "My White Whale",
        "author": "PT_C",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3w4xvm/my_white_whale/",
        "text": "This is the story of my most hated customer.\n\nThis woman calls us and orders a large pepperoni and sausage pizza. Fine, no worries. \n\nI make it, it obviously looks fucking delicious, our guy delivers it. All is right in the world.\n\nUntil this woman calls back...\n\nWoman: \"This pizza is way too greasy!! I want a new pizza!!\"\n\nMe: \"Well Ma'am, it's greasy because of the sausage and pepperoni. If I give you another pizza it'll come out the same way. Is that the only thing wrong with it?\"\n\nWoman: \"No it's cold!! I've gotten a pizza from you guys before and it wasn't like this!\"\n\n(To clarify, I know for a fact it wasn't cold. I put the pizza in the box, gave it to the driver, he was gone for 8 minutes, and he was back. This is a classic defensive maneuver when the customer doesn't get what they want.)\n\nMe (pissed): \"Well ma'am I can assure you the pizza wasn't cold, and if I remember correctly the last time you ordered you got a cheese pizza. Did you eat any of it?\"\n\nWoman: \"Yeah I ate 2 slices, I was starving!\"\n\nRecap. This woman orders a greasy pepperoni-sausage pizza that she wants replaced because it was, of all things, greasy. All after she ate 2 slices on top of it.\n\nMe: \"Well ma'am I can't really help you then. There's technically nothing wrong with the pizza other than you don't like the toppings you chose. If you hadn't eaten 2 slices, I might have been able to help you.\"\n\nWoman: *explosion of rage*\n\nMe: *I think I'm gonna make a sausage-roni pizza for dinner tonight*\n\nShe hangs up and I continue my night.\n\nThe next day my boss texts me, \"What the hell happened last night?\"\n\n*Shit, what did I forget to turn off.*\n\nTurns out this piece of shit took a picture of her \"greasy\" pizza (Boss: \"What the hell is she complaining for? That pizza looks amazing.\"), posted it on our Facebook page, and went on a rant about our shop. The cow even had her degenerate relatives share it.\n\nI have since deployed my little brother (who has multiple catfish accounts) to torment her on Facebook. I have signed her address up for every news letter I could find, including Jehovah's Witness, rehab centers, Scientology packets, etc.\n\nI cannot wait for this bitch to call back, which she most definitely will...they always do.  \n\n\n**Edit:** You're all a bunch of cry babies\n\n**Edit:** Seriously lighten up people",
        "created_utc": 1449700683,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Dad catches a big break",
        "author": "charlietakethetrench",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3w3wil/pizza_dad_catches_a_big_break/",
        "text": "I just saw this story in r/ottawa and thought you guys would dig it. I've never cross-posted before, so I hope I'm doing this ok. \nhttps://redd.it/3w2gic\n",
        "created_utc": 1449686845,
        "upvote_ratio": ""
    },
    {
        "title": "Any nicknames for bad customers?",
        "author": "SLemonSLime",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3w1uq2/any_nicknames_for_bad_customers/",
        "text": "There's this one guy we deliver to in a trailer park. He's been ordering several times a week (twice in a day is not unheard of), and a constant stiffer. We're excited on the days his dollar amount ends in something less than a 50 so we can \"almost\" get a dollar from the guy.\n\nMy co-worker actually delivered to him the other day, kinda new and didn't know any better so he gave the guy EXACT change for his order, down to the cent. The next guy who delivered to him, he threw a fit for not getting his coins for the rest of his change, to which his roommate behind him (the guy seems mentally off, we think the other guy is his brother or something and takes care of him) told him to just let it go. \"Bring the change next time\" was how he ended it.\n\nAnyway, long story short we call him Barf. Anyone else have nicknames for their regular stiffers?",
        "created_utc": 1449650009,
        "upvote_ratio": ""
    },
    {
        "title": "Keeping track of good tippers.......",
        "author": "johnnydonut",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3w0nvt/keeping_track_of_good_tippers/",
        "text": "I usually order pizza online from Domino's and I *always* tip 50%. I figure a 50% tip on on 13 dollar order is 6 or 7 bucks. 7 bucks ain't gonna make or break me and since I'm in the service industry, I know that a nice tip once and awhile can make your night. \n\n\nDoes Dominos (or any other of the large franchises) have a customer data base they use to keep track of that kind of stuff?\n\n\nThe reason I ask is that my pizza always gets here super fast and it's not always the same driver.",
        "created_utc": 1449627664,
        "upvote_ratio": ""
    },
    {
        "title": "What should I do?",
        "author": "Keeks_marone",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vzubp/what_should_i_do/",
        "text": "Ok so I applied at 3 diff pizza places near my house and the same day Chain#1 called me and I got a job at their store about 20 min from my house.  Ive been working at this store for 3 weeks now and got a call back from pizza chain#2 literally 2 minutes away from my house its ridiculously close. I want to work at that store but Ive only been at store#1 for a few weeks.  can I quit here and take #2 store job instead and it wont be like a bad mark or something?  sorry for format im on phone",
        "created_utc": 1449615481,
        "upvote_ratio": ""
    },
    {
        "title": "Dammit Boss....",
        "author": "Tru-Queer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vz3to/dammit_boss/",
        "text": "So my boss just texted me asking if I'd heard anything about me getting a $999,999 bonus, and I laughed and said yeah right, I wish. But then he asked if I had for real, and I was like, no, I'm pretty sure I'd have quit by now if I knew that was going to happen. So he tells me that the District Manager got an e-mail from payroll stating I was to receive $999,999 as a bonus.\n\nSo I felt stupid texting the district manager, but I had to ask because something like that is obviously really life changing, and of course, of course, ofcourseofcourseofcourse.... it was just a glitch in the system. lol\n\nThanks Boss for raising my hopes to the tune of $999,999, only to dash them across the rocks.\n\nI had to joke with the DM though, I told him, \"Just let the glitch happen, I'll split it with you 50/50, and we can both ditch our jobs like bats outta hell.\"",
        "created_utc": 1449605845,
        "upvote_ratio": ""
    },
    {
        "title": "Need advice for handling creepy customers",
        "author": "TripleBicepsBumber",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vxtps/need_advice_for_handling_creepy_customers/",
        "text": "I lurk, first time posting. On my phone, sorry for errors.\n\nI've been working at a pizza place for almost a year and a half. My first year there was spent as an insider. Even being a small young cute female I never felt threatened by anyone because all of my co workers are present and 99% of our customers are normal people who just want pizza, not my phone number.\n\nHowever, now that I'm a driving I keep finding myself in intensely uncomfortable to downright dangerous situations. Granted, I'm not working in the safest part of town but most people are decent. I've gotten inappropriate texts days after delivering from married customers. I only call because they won't answer the door, have a sneaky address, etc. I've had men invite me into their houses/hotel rooms, had a guy expose himself to me, and even had someone follow me to my car a few times.\n\nAre there any other female drivers out there who can relate? At what point do I draw the line and quit my job for the sake of safety? I love the guys I work with, the money (for me) is great, and we're like family.. but I don't want to have that fear in the back of my mind that someone is going to actually *do* something to me. Ugh.\n\nMy managers flag creepy customers to have male drivers exclusively take those deliveries, I block anyone who tries to text me back and don't use my phone to directly call customers (as of last week). What more can I do?\n\n\nEdit:\nThank you everyone for your input. After thinking it over and talking with my co workers about it I've decided to retain my original position as a hybrid driver. \n\nThe Google voice number is a good quick fix for me. As far as investing in pepper spray goes.. maybe I should. When it comes to fight or flight I generally fly like the wind but everyone here knows that's not a 100% guaranteed option. At the very least I'll get some and keep it in my glove box just in case I get a bad vibe off of some bystanders or my run. I think our company policy is to not carry weapons but I'm not sure if that applies to just knives and firearms. I'll ask management about it.\n\nAgain, thanks for replying. Buckle up drive safe everyone",
        "created_utc": 1449588746,
        "upvote_ratio": ""
    },
    {
        "title": "Choose-your-own-delivery: Late Night Pizza",
        "author": "coinaday",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vx7al/chooseyourowndelivery_late_night_pizza/",
        "text": "Hey, I thought you guys might enjoy this. I wrote up one of my favorite deliveries into a \"Choose-your-own-delivery', [play it here](https://www.reddit.com/r/pizzaboyadventures/comments/3tnm05/late_night_pizza/) ; there's also a less exciting [second story](https://www.reddit.com/r/pizzaboyadventures/comments/3uds65/1_glorious_drive/). Not the usual story write-up, but they're both very closely based on actual deliveries I've had, so I hope you enjoy it!",
        "created_utc": 1449577649,
        "upvote_ratio": ""
    },
    {
        "title": "One of those nights..sigh",
        "author": "nervous_manatee",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vx4t8/one_of_those_nightssigh/",
        "text": "So, here's sort of a breakdown of tonight's shitshow.  This may ring some bells with you guys, I'm sure nights like this aren't unheard of at all.  \n\nCar was having some issues, so I took it in and they gave me a laundry list of shit they said I should have done.  I'll probably get some of that done...eventually.  Sometimes I feel like I'm working just to pay for my car.\n\nGet to work late.  Its not too crazy but we're understaffed even tho we've hired several other people recently.  they can only work weekends/later in the week.  No big deal, more tips for me.  \n\nCustomers car catches fire in the parking lot.  Grab fire extinguisher and haul ass outside and begin spraying it down with foam.  Fire department comes and saves the day.  Parking lot reeks of burnt electrical wiring, water, and crisp autumn air.\n\nOne of our new drivers claims that he's heard gunshots 2wice now at a large apartment complex.  Refuses to take delivery there, so now we always have to take those deliveries for him.  Not sure if I believe him as I go there several times a night and never hear shit.  Its a toss up tip wise over there, many stiffs, but also an ok amount of people who do tip.  Not sure if he's just avoiding shit or he's serious about what happened.  Guess I'll just get \"shot at\" in his stead.  He'll probably end up with my order instead, and it'll probably be from a nicer area whenever this address comes up.\n\nLady orders food, its delivered.  Calls back and says its burnt.  How this is possible I don't know considering our oven is a conveyor belt and we didn't push the order back into the oven.  Anyway, driver takes remake to lady (who always stiffs).  She takes the food, says hold on and never comes back to give the money.  We blacklist her bitch ass.\n\nOther closing driver never shows up, other drivers sent home.  Have to clean front and back alone.  Get home at 4 am on a Monday.\n\nFML.  but hey, I made like 90 bucks so its all good right?\n\ntldr; car fire, thieving customer, shitty coworkers, late night, fml.",
        "created_utc": 1449576004,
        "upvote_ratio": ""
    },
    {
        "title": "The scams customers pull which they can technically get away with that irks the crap out of me.",
        "author": "ShoGunzalez",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vwmiz/the_scams_customers_pull_which_they_can/",
        "text": "BTW, if you do this, please stop, we hate it. \n\n\n\n\nCustomers place online carryout orders and get the carryout price then call the store \"oh can I get that delivered instead?\" we charge them the delivery fee, but they are still getting an insane deal. \n\n\n\nCustomer places two identical orders online minutes apart... they place the first one to earn enough points that allow them to get a free pizza, use the points to place the same order then they call the store and cancel the original order and keep the free'd out one. \n\n\n\nCustomer places a phone order for carryout, we call after 30 mins to see if they're coming, they then claim they ordered it for delivery AND because it's gone beyond our quoted delivery time, we remake it, send it out for free, the driver always get stiffed. \n\n\n\n\nCustomer orders over the phone for delivery, gives CC payment info then after the transaction has processed they ask for side items, it would force us to edit the order, add the items, void the original transaction and re-take the payment, 99% of the time people don't want to go through all that all over again especially during rush so they add the items manually for free. \n\n\n\n\nCustomers demanding a full refund or store credit because they did not receive the 1 extra dipping cup/side item which they paid for, I usually reject this one and tell them they can get a refund or credit for the missing item and nothing else, then they throw a fit. \n\n\n\n\nFemale customers calling in to complain and putting on the water works in efforts to get free food, as soon as they get what they want, the tears magically vanish the tone of voice goes right back to business-like, I cannot stand that type of manipulation. It's pure cold-hearted calculation.\n\n\n\nThe things people do for free food, it's just pizza. If you call my store and tell me that you're broke and hungry, and ask me nicely, guess what? you might get a deeply discounted pizza or even a free one. This one homeless dude would come like once a week and ask for anything to eat, I would give him some of the crew food or even make him a pepperoni if I felt like it. Morale of the story? Ask and you shall receive, or don't but karma's a bitch.",
        "created_utc": 1449562252,
        "upvote_ratio": ""
    },
    {
        "title": "I got my tip taken back too.",
        "author": "dinosaurscantyoyo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vurg1/i_got_my_tip_taken_back_too/",
        "text": "I used to be a waitress in our town's only pizza place. One day this couple came in to eat and I served very well because it was my first week as a waitress and I wanted to do a good job. The couple left $15, and it made my day because I work in a small town and $15 was a great chunk of what I would make that day. The couple leaves and I bus the table and when I get back I see my boss talking to the guy. His wife made him get $10 of the tip back. My boss speculated that she was jealous or something, because the man had said something mildly suggestive. It was upsetting to say the least.",
        "created_utc": 1449529943,
        "upvote_ratio": ""
    },
    {
        "title": "My largest tip ever.",
        "author": "pete40oz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vuij9/my_largest_tip_ever/",
        "text": "Long time lurker here. I love reading all you your stories and so I decided to finally contribute with one of mine. Backstory. I delivered pizza for about 2 years when my son was born. I had a 9-5 but really needed the extra cash at the time. \n\nI worked for Papa Johns and it was NBA finals of 2002. Lakers are playing and being in LA, we were busy as hell. I got a rather larger order for about 10 pizzas. My manager gave it to me in a rush and said to get there ASAP as we were behind. I take the order and see that the street is packed. Had to park around the corner. I walk up with 3 hot bags full of pies. Ring the bell and I can hear that the house was full of people watching the game. I believe it was the final game. \n\nThe door opens and I see the commotion. The guy who answered told me to hold on for the owner but started taking the pies from me as he can see I was struggling to hold them all up. He starts taking them off my hands. When he is done still no owner in site. So he decides to go ahead and pay me. The bill was around $105 and he is getting out his wallet. Then the owner walks up and sees his buddy about to pay me. He says that he has it and gives me 110. The numbers are a little vague since its been over 13 years but I remember the owner was giving me a $5 tip which isn't bad I guess. His buddy who waited and helped me with the pizzas told him \"No man. Let me get it.\" The owner said \"no man I already got it...\" \n\nBasically the friend didn't think the tip was enough and they literally had a 20-30 second argument about it right in front of me. Felt like forever as I just wanted to get paid and leave. Finally the owner gives me the $110. His friend gives me the $100 he already had out. Then tells me to leave. The owner says \"no! Wait..\" The friend tells him \"FUCK YOU\" the looks at me and says \"thanks man that's all you. leave!\" And slams the door. I hear them talking behind the door so I waited for about 15 seconds. The door didn't open so I left. $105 tip! As a struggling young new father, this was one of the highlights of that time in my life. \n\nI occasionally tip really well to anyone in the service industry. Sometimes just randomly. Just because I know how great it can make someone feel. Like the time my buddies and I had a a bachelor party and our pizza delivery guy showed up right when the *strippers* started their show...... But that's for the next tale. \n*spelling*",
        "created_utc": 1449526382,
        "upvote_ratio": ""
    },
    {
        "title": "the time a rich person gave me a huge tip and then took it back",
        "author": "jeromes_dream",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vss9q/the_time_a_rich_person_gave_me_a_huge_tip_and/",
        "text": "I was working for a local joint a few months back and I was going to this very rich section of the town, only about a ten minute drive away, they had ordered a sandwich and pizza and the total was 15$. \n\nI pull up to the house and, not only is it in one of the richest neighborhoods in town, but the house is absolutely massive, on a cliff, overlooking the water, with a huge courtyard and fountain. \n\nI drive into the courtyard knock on the extremely heavy wooden door and I make the transaction, I am given 2 $20's. At this point, I am ecstatic, this would be my biggest tip ever.\n\nI say thank you so much, the usual thing I say, regardless of the tip size, and I am about to walk away when she asks for one of the twenties back.\n\nI was gutted.",
        "created_utc": 1449502186,
        "upvote_ratio": ""
    },
    {
        "title": "As a customer, I thought I'd share a little story.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vr802/as_a_customer_i_thought_id_share_a_little_story/",
        "text": "[deleted]",
        "created_utc": 1449466166,
        "upvote_ratio": ""
    },
    {
        "title": "[Customer]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vr6nz/customer/",
        "text": "[deleted]",
        "created_utc": 1449465445,
        "upvote_ratio": ""
    },
    {
        "title": "My best tip ever!",
        "author": "DanielPowerNL",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/3vplxy/my_best_tip_ever/",
        "text": "http://i.imgur.com/8KO0Viz.jpg",
        "created_utc": 1449439501,
        "upvote_ratio": ""
    }
]