[
    {
        "title": "I am rewarded for messing up",
        "author": "Dnk710",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4trs2a/i_am_rewarded_for_messing_up/",
        "text": "I was flying from Raleigh to San Francisco yesterday and my flight was scheduled for 4:10 pm. Unfortunately, although I arrived 40 minutes before takeoff, I missed the 45 minute cut off time for checked bags. \n\nFortunately, the extremely helpful customer service rep for \"Together\" Airlines who was handling the checked baggage was able to get me on a nonstop flight to SF later that evening in a window seat. My original flight involved a layover and a middle seat. In addition, there was no one sitting next to me!",
        "created_utc": 1469029679,
        "upvote_ratio": ""
    },
    {
        "title": "Another interesting \"tip\"",
        "author": "Stringoffate3",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4tr6dv/another_interesting_tip/",
        "text": "[removed]",
        "created_utc": 1469022126,
        "upvote_ratio": ""
    },
    {
        "title": "I thought she was a child... still not sure she's actually an adult",
        "author": "asimplekitten",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4toaaz/i_thought_she_was_a_child_still_not_sure_shes/",
        "text": "I'm in need of work pants, but student loan payments, groceries, and other expenses deny me the ability to pay 70+ dollars for a single pair. Off to the store with a will that's fine!\n\nEverything's fine in the beginning. I go off to the dresses (I know, I know, I was only there for work pants!), pick *only* one out, and mosey my way on over to the skirts. Out of the corner of my eye I see what looks like a 12-13 year old brat stomping around and practically walking into people, obnoxiously singing to the music playing, and randomly yanking things off racks. Ok, so yet another parent is letting their child be a little sh\\*t. I work retail myself and simply tune it out. Go through the skirts, get to the pants, cry to the gods at the unfairness of how difficult it is to find professional looking clothing in my size, and finally find a few pairs I think might fit. There's a wait to get in a dressing room, and both are completely trashed. Whatever.\n\nVanity sizing and weird cuts mean I find only one pair that could actually work. The other pants are put on the surprisingly empty rack. I find another cute dress (I swear I was not looking!) and decide to look at the sweaters before I leave. I poke through a few and hear a commotion at the front of the store. Lo and behold, the 'child' is standing behind the counter because she \\*actually works there\\*. She's SCREAMING at the other two workers because 'somebody took her bag'! She is literally losing her sh\\*t at them. They sound exasperated as they say multiple times that nobody took it, it's either still there or she's already taken it home. She's still yelling at them until one of them sighs, pushes her aside to get into the counter area, and after a second or two of looking hands her friggin' bag to her.\n\nAt this point I'm seriously debating about hanging the clothes I have on the rack in front of me and walking out. It's super uncomfortable to be anywhere in the store with this going on (she continued blowing up at them for a few seconds after that), not to mention how unprofessional this whole thing was. She storms off, I look at a few other things. I put some clothing back and go to buy what's left in my hands.\n\nAaaaaaand she's back, checking out a customer. I cry to the gods again and walk around to the guy at a different register. I ask if he's open, he walks away. I'm getting really pissed now but shrug it off and hope the girl can keep her sh\\*t together long enough to complete my transaction. She finishes with the current customer, and is JUST shy of being rude to her. I walk up and set my stuff down. She completely ignores me. Um, ok? And continues ignoring me as she enters what I'm buying in the machine and jams the hangers onto empty racks behind her. Someone comes up and asks her a question, she turns and answers their questions without so much as a look at me, and finishes entering what I left. In the snottiest voice imaginable, I hear:\n\n&gt;Your total is xx.xx dollars\n\nIf I didn't really want the work pants and the other things I would have been out the door. Not another word is spoken throughout the transaction. She practically throws the receipt at me to make a grand total of her looking at me ONCE and I finally leave.\n\nNow, I work customer service. I absolutely understand retail can be a thankless job (the complaints I listen to!) and that life outside work takes it toll too, but there's still no reason to be such a cunt. Suck it up for the time you're there. Not sorry.",
        "created_utc": 1468972461,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not pregnant",
        "author": "noturmomma",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4tlld8/im_not_pregnant/",
        "text": "This is really not a good week for my family.   Thursday my oldest son had surgery, then Friday my youngest son broke his arm, and right now I'm in the emergency room waiting for the doctor to cast my ankle that I just broke.  My husband is seriously considering wrapping himself in bubble wrap.  \n\nAnyway, just a cute funny story.  When I checked into the emergency room they asked if I was pregnant.  I replied that I had a hysterectomy.  Then they wheel me in and I meet the nurse and doctor.  Right before the X-ray they ask me again if I am pregnant and to sign a release.  I once again state that I have a hysterectomy.  Then as I'm waiting the nurse brings a chair and asks me to pee in a cup so they can check to make sure I'm not pregnant so they can give me medication.  I do it and then once again tell her I had a hysterectomy.  Then the doctor came in and tells me that my pregnancy test was negative.  Really?  \n\nI replied \"I guess there won't be any miracles today.\"  He looked at me strange and asked why and I told him I had a hysterectomy.  He shook his head and ask \"why didn't you say something?  We wouldn't have needed to test you.\"   I just chuckled.  \n\nTl;dr: The nurses are convinced that I should birth the antichrist. \n\nEdit: fixed spelling ",
        "created_utc": 1468940885,
        "upvote_ratio": ""
    },
    {
        "title": "Birthday Party Shout-out",
        "author": "AXPendergast",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4th086/birthday_party_shoutout/",
        "text": "My #3 boy turned 18 over the weekend, and his birthday restaurant of choice was \"Hawkeye's Friend.\"  Now, on a Saturday night, we knew there would most likely be quite a wait for a party of 8, so we used their call-ahead service.  The manager assured us that, since we were giving them a heads up several hours early, that he'd make sure we had one waiting for us at 7. \n\nSo, we arrive at 645, and ask for the manager by name...and we find out he's left for the night.  IN speaking with the current manager, we find out that we were never put on the call ahead list as promised.  So we ranted and raved until we got our way...\n\nSorry, just kidding.  Of course we knew it wasn't this guy's fault.  He apologized, the hostess apologized (having the names of the two people we spoke with and the time of our conversation helped convince them we were telling the truth and not just trying to jump the line).  We were told they'd do what they could, and we headed outside to wait, which at this time was looking at an hour or more. \n\nNot 20 minutes later, the manager comes out to find us and escorts us to our table.  Our waitperson appeared instantly with 2 (TWO!) free appetizers and started taking drink orders.  The rest of the night was smooth as a baby's butt.  Refills appeared w/o asking; plates were cleared quickly; waitperson attentive, friendly, and funny; manager checked on us several times.  \n\nNow, we knew that one of the features of this restaurant is a free mini-dessert for one's birthday, which is why #3 asked to come here.  However, we were also presented with two more full-sized desserts for the rest of us to share - again, comped.  \n\nNow mind you - none of these free items were asked for or expected.  We were very surprised at their generosity, and said so to the waitperson several times.  After paying the bill (and yes...we tipped as if the freebies were part of the actual bill), I found and spoke with the manager regarding the evening.  His reply was illustrative of good customer service - we wanted to make sure you had a good evening, one good enough that you consider returning in the future.  \n\nSo, thanks, \"Hawkeye's Friend,\" for making my son's 18th birthday dinner a pleasant experience. ",
        "created_utc": 1468871061,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you magical mystery sanitation workers.",
        "author": "Call_me_Kelly",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4tgja1/thank_you_magical_mystery_sanitation_workers/",
        "text": "Today was trash day. I discovered a huge bag (completely emptied and cleaned our giant litterbox) of kitty litter had broken open, gotten rained on, and cemented itself to the bottom of my bin. \n\ni taped a very visible apology note with a five dollar bill (also visible, like impossible to miss) as I couldn't get it cleaned up before they came, it was seriously like cement and weighed a ton.\n\nnot only did they leave the note and money, they got all the litter out (no idea how).  ",
        "created_utc": 1468865293,
        "upvote_ratio": ""
    },
    {
        "title": "First attempt at blending and doing full face, CCW",
        "author": "[deleted]",
        "url": "https://imgur.com/a/ks1eO",
        "text": "[deleted]",
        "created_utc": 1468853639,
        "upvote_ratio": ""
    },
    {
        "title": "I will never ever buy an HP laptop again!",
        "author": "iamsatyajeet",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4tezh8/i_will_never_ever_buy_an_hp_laptop_again/",
        "text": "[removed]",
        "created_utc": 1468845402,
        "upvote_ratio": ""
    },
    {
        "title": "I should be their Theft Prevention person",
        "author": "paigenotcasey",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t7flk/i_should_be_their_theft_prevention_person/",
        "text": "My family and I have been going to the same grocery store for about 10 years, we know everyone who works there, and they know us. I even know some of their children. We're in there multiple times a week, even when after they moved buildings.\n\n\n\nSo we go there today, picking up maybe 25 items, nothing too insane. My mother and I are standing in line when I smell a delicious rotisserie chicken, and being nosy, I look to see what lucky person is having that for dinner. I see a man with the chicken in one hand, and a six pack in the other. He's taking the long way around, between the pharmacy and the registers, where there are no employees. And he's walking fast, looking around. The bathrooms are nowhere near, and who would take a chicken in the bathroom anyway? Nobody else is seeing this, and I can't be sure yet. I grab my mom's attention and point to him, just simply saying \"uhhh, mom, watch this guy.\" And sure enough, he walks past the break room and disappears at the exit. Like completely vanished.\n\n\n\nWe both instantly get the cashier's attention and say \"hey, pretty sure some guy just walked out without paying\". The manager is called over, we explain what we saw, they say it's sad but it happens a lot. The manager goes to check the cameras, but sadly we have cold food and have to leave. If I find out next time we go, I will update this, but I'm 99% he stole. I looked around and he wasn't in any line after we lost sight of him. \n\n\n\nIt just really makes me mad because he looked fairly well off, and stealing beer is clearly not to feed your family. There's no excuse.",
        "created_utc": 1468717385,
        "upvote_ratio": ""
    },
    {
        "title": "If you told me about it, I would've gotten to eat.",
        "author": "RoomTemperatureAF",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t5eqc/if_you_told_me_about_it_i_wouldve_gotten_to_eat/",
        "text": "Hello! Long time lurker, first time poster, y'all know the drill. Also my first post on reddit so please be gentle and feel free to help with grammar and formatting, I'm having a little bit of a hard time grasping it. This is a rant btw.\n\nSo a little bit of background, I work in a small grocery store and I usually do closing shifts (3pm to 9pm), so that means that I'm the only cashier from 6pm to 9pm. That also means that I have to take my break before 6.\n\nSo yesterday I get to work and all goes well, and decide that since I have a 30 minute break I'll take it at 5 and go to my favorite sandwich shop. I go get my cigarettes and debit card to pay for lunch and realize someone took my lighter. No sweat I'll run to the corner store to get one after getting my lunch.  So I get there and the girl is alone and two people are in line in front of me, so I tell myself that I'll just have to have a quick smoke after and I'll be fine. But then 10 minutes pass and my order still isn't taken, still, it's alright, I'm hungry but I'll keep the rest of my meal in the back of the store and eat when I have a few less clients. Another 5 minutes pass, the two people in front of me have paid and left, but the girl is no where to be seen. I'm getting a little bit anxious because I have 15 minutes left to my only break until I'm done working. Then a guy comes out (wtf they were two?? He must have been doing other things in the back or on a break, it's okay, I'm fine) and starts chatting with the guy behind me in line. Now I'm usually a very patient person but my precious break time is almost over and now I want to eat and catch a cigarette.   \n\nHe finally takes my order and I ask for bacon. He puts one strip on my sub and then goes quickly to the back, comes back and looks around until I stop him and tell him not to worry I'll take it without bacon. At this time almost 20 minutes have passed, I'm irritated and sort of angry because I have 10 minutes left to cool off and go get a new lighter and smoke. So he does my order quickly and then sends me to pay. I'm waiting at the register as he takes the two other orders behind me.   \n\nThe girl comes out of no where and tells me my total and I tell her that I'll be paying debit. She looks at me in horror and tells me that the debit card doesn't work and I'll have to go to an ATM. My eyes are twitching, I'm on the edge of tears (It's the hormones I swear) and I ain't got time for this. So I told her to forget it and left.  \n\nIf they told me that debit cards didn't work that day before I got my order, I would've gotten to go eat someplace else, I had a handful of chips for dinner that night.  And I just want to mention that I'm not mad at anyone, I'm mad at the situation, apart from them not warning me, nothing else was their fault, you don't have control over things like that sometimes when you work retail or fast food. Props to them for keeping their heads up in all of this and I will be apologizing to them for being a bitch (when I got off work yesterday their store was closed) and will continue eating there.\n\n",
        "created_utc": 1468688616,
        "upvote_ratio": ""
    },
    {
        "title": "Apple Pencil Cap disaster",
        "author": "dynsight",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t4s2z/apple_pencil_cap_disaster/",
        "text": "[removed]",
        "created_utc": 1468679676,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier hands me a handwritten receipt.",
        "author": "Hoax13",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t41w4/cashier_hands_me_a_handwritten_receipt/",
        "text": "During the days of VHS, I went to this rental place, let's call it Crockbuster. I was there to buy a poster for some movie that came out. While there I also got two videos that were on sale. Went to go pay and had an idea what I had to pay as I added it up in my head. Cashier told me how much and I couldn't figure out why I was so off. I payed and waited for the reciept to look at it. Didn't get one. I asked the cashier for a reciept and he told me I would have to wait as other customers were in line. I reminded him that I was also a customer that made a purchase and I needed a receipt for that purchase. He grabs a paper, tears off a piece and writes how much I payed and scribbles some barely legible letters and hands it to me. I was stunned for a few seconds but then asked for a printed reciept. He tried to give me the runaround so I called the manager. After telling my story, she printed the reciept and we saw the cashier charged me twice for the movies. I suspect he was trying to make extra cash.",
        "created_utc": 1468665353,
        "upvote_ratio": ""
    },
    {
        "title": "Are you having fun with my iPhone!?!?",
        "author": "operez1990",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t2yky/are_you_having_fun_with_my_iphone/",
        "text": "[removed]",
        "created_utc": 1468640976,
        "upvote_ratio": ""
    },
    {
        "title": "Give me a minute, please!",
        "author": "Leeanth",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t2xn4/give_me_a_minute_please/",
        "text": "Went to my local store today, where I shop almost daily. I was at the self-serve checkout and decided to put my grocery bag into my backpack BEFORE taking my ATM card and cashback from the register. Seconds later, literally, the self-serve assistant grabs my card out of the thingee and tells me off for leaving it there. \n\nThere was no queue for the register and I was almost done with the backpack. Give me a minute, please. I know I've left my effing card in there and that I haven't taken my cash yet...",
        "created_utc": 1468640509,
        "upvote_ratio": ""
    },
    {
        "title": "Lying sandwich maker",
        "author": "TheEthalea",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t2sej/lying_sandwich_maker/",
        "text": "I went to a place that lets you watch while they make your sandwiches. I asked for a bbq turkey on wheat bread with provolone toasted, double cheese, toasted. Spinach, onions, black olives, BBQ, ranch, and black pepper. \n\nI was in the drive thru since it was packed inside and I looked up to see him pulling my sandwich out of the toaster only to put my cheese on after the toasting happened. He put all my veggies on and the BBQ but no pepper and no ranch. \n\nHe brought it over to the window and I asked if he was sure my ranch was on there. He lied straight to my face and said it was on there. They were closing in 30 minutes but now I'm going to have to go back and talk to the manager. Who is actually my next door neighbor. \n\nI hate feeling this anger but I so rarely treat myself to any fast food or going out to eat and now I just feel like its been ruined. So frustrating. ",
        "created_utc": 1468637996,
        "upvote_ratio": ""
    },
    {
        "title": "This is more about my brother and me, but I thought this guy's reaction was pretty funny.",
        "author": "ChiliFlake",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4t0vjv/this_is_more_about_my_brother_and_me_but_i/",
        "text": "(there's a little bit of backstory here)\n\nSo my brother decides to have an electrician come to the house (our mom's house). Last time he took it upon himself to do this, it cost mom $150 to replace two outlets.  (he said he would pay her back, but hasn't, of course).\n\nAlso, last time, he told me when they'd be coming, I told him the time wasn't convenient, and to have them call to reschedule. That never happened, of course. (there are a lot of 'of courses' in this short tale). \n\nSo he told me yesterday they'd be coming today, I told him to cancel, he said he did. (this is not something my mom requested, needs, or desires. We have working electricity in every room, and while I know the circuit box is illegal (it's in a bathroom), that's something we'll deal with when mom either can afford to have central air put in, or we go to sell the house. I mean, we've lived with it for 30 years at this point.)\n\n\nSo of course they show up. I say (through the screen door) \"We cancelled the appointment, please leave\" as he's trying to open the door.\n\nHim: \"I'm just going to take a quick look\" (still opening the screen door)\n\nMe: \"Please leave\"\n\nHim: \"But..\"\n\nMe: \"Please leave\"\n\nHe takes a few steps and turns around to give me the stink eye. I give it back. He did this twice, It was actually pretty funny.\n\nI'd call his boss, except I know he's self-employed, probably some fly-by-night my brother found on craigslist.\n\nedit: I guess you had to be there, to see the stink eye he gave me, twice.\n\n\n",
        "created_utc": 1468610917,
        "upvote_ratio": ""
    },
    {
        "title": "Just a basic oil change service, and be sure to check the transmission fluid",
        "author": "Gaggamaggot",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4szzin/just_a_basic_oil_change_service_and_be_sure_to/",
        "text": "(re-submitted after redacting identifying information at mod's request)\n\nMy wife called for a ride home from work so I got in my elderly pickup, started it up, and noted a serious lack of enthusiasm on the part of the transmission in delivering power to the drive wheels. I called my wife back and told her to meet me at a place a block from her work that provides quick oil changes and other basic automotive service. I've taken my vehicles there in the past and have had excellent service; they're fast, the price is fair, and I don't have to do it (stuff like this is more difficult to do than it used to be.) Lately I have noted them starting to slack off on the \"excellent\" part, but I have that \"buy 6 get one free\" card with two stamps to go, and it's time for an oil change anyway, so that's where I go. I pull in and tell the mechanic I need a basic oil lube &amp; filter and be sure to check the transmission fluid, it's slipping but it was rebuilt by a good shop six or seven years ago so I'm sure fluid is all it needs.\n\nNow in past visits I would sit in the waiting room (think very under-rated doctor's office) and the mechanic in charge would call me into the bay to discuss my vehicle's particular needs on this visit; things like possible air filter change, radiator flush, tires, rear differential oil, shocks, etc. I'd tell them what I wanted done now and they'd go ahead and perform the work, then park it out front for me. But last time they skipped straight to the 'park it out front' part ~ no mechanic chat. Okay, maybe they're having a bad day (they were very busy). This time they did it again. And they are definitely not busy at all, maybe two vehicles lined up for service. Uh-uh. I asked the (young, barely out of high school) tech if he had checked the transmission fluid, he thought for a moment then informed me that it was just over the 'minimum' mark. So you need to add a bit of fluid, right? Okay, I'll check it again. He pulled the truck back into the bay and my wife &amp; I went back to the waiting room.\n\nI paid attention; he shut the truck engine off (?), it was quiet for three minutes, then he came back in to tell me it was fine and didn't need any fluid. \"No.\" I can show you he says, so we go out to the bay where another tech was pulling it out to the parking area. He hollered at the tech to stop then popped the hood. Tech #2 indicates that there's a bad leak in the seal between the transmission &amp; engine. Okay, why the hell didn't you bother to mention that to me during the oil change and check-out? Uhhhh... Yeah, because you're inept. Tech #2 shut off the engine (?) and Junior proceeded to check the stick. See? It's okay. I asked why he was bothering to check it with the engine off (it's supposed to be running to check the transmission, and off when checking the crankcase). He tells Tech #2 to start it, then re-checks it. Dry as a dad joke.\n\nI gave him a deadeye stare and he said uuhhh, want me to add some? \"Yes!\" A few minutes later we left, the transmission purring and pulling nicely. No Yelp review yet - I'm going in to speak to the shop manager tomorrow and explain why this loyal customer is planning on dropping them as my oil &amp; lube guys if they don't clean up their act.",
        "created_utc": 1468600513,
        "upvote_ratio": ""
    },
    {
        "title": "Still waiting",
        "author": "noturmomma",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4swlw1/still_waiting/",
        "text": "Hello everyone.  Today my poor baby had dental surgery and so the dentist said he had to stay home and relax.  The dentist also said he could eat whatever he wants.  My son decided he wanted a sandwich.  He was still extremely loopy from being put under that he was absolutely convinced that the only thing that would make life complete was a ham and cheese sandwich from a place that delivers 'fast'.  After spending ten minutes trying to convince my highly sedated child that after having four teeth pulled, four crowns, and four fillings eating a sandwich is not a great idea I caved figuring he will figure it out for himself.  (He has major anxiety attacks so it was impossible for the dentist to even look at his teeth and so we had to wait six months for our insurance to approve total sedation and get an operating room at the hospital for the surgery and the extracted teeth were all baby teeth).  \n\nAnyway, I order and about fifteen minutes later our food arrives.  Well, most of it.  His sandwich is there but my sandwich and chips are missing.  I call the store and they apologize and say they will send it right out.  My son managed to eat his sandwich and after forty minutes I called again. They explain that someone brought my sandwich out but no one answered the door.  I'm sitting on the couch next to my front door.  They then say they will try again.  I wait another twenty minutes and nothing.  So I call again.  \n\nOnce again they say no one answered.  I ask where they were delivering to and they tell me the school where I work.  Wth?  First it's six at night, second it's the middle of the summer, and third you just delivered to my home why the hell would you possibly deliver there?   So they apologize again and tell me they will send it again.  After waiting another twenty minutes I call and just tell them to refund my order.  They had the gall to ask if I could just pick it up since I wasn't answering the door.   They had taken it back to the school again.  Unbelievable. \n\nTl;dr;  Sandwich shop decided I should be working and won't bring me my damn sammich!",
        "created_utc": 1468543415,
        "upvote_ratio": ""
    },
    {
        "title": "Kwik oil change",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4swal5/kwik_oil_change/",
        "text": "[removed]",
        "created_utc": 1468539082,
        "upvote_ratio": ""
    },
    {
        "title": "Lamb Skewers",
        "author": "ChaosMind55",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4sv219/lamb_skewers/",
        "text": "I was at a food court ordering at a place that starts with O. I order a meal that came with skewers and I order Lamb. (Now before I continue this was close to lunch rush and there were two workers out at the moment.) \n\nThe first worker cashes me out and gives the order to her coworker. She goes makes the order, but I noticed the skewers didn't look like the lamb. \n\nFw: *walks over and sees the skewers* She wanted lamb, not chicken.\n\nSw: These are almost done the grilling, can't she just take them?\n\nMe: I would like to have the lamb. \n\nSw: Fine. *goes gets the right one* \n\nAround this time the lunch rush starts and another worker comes from the back. (I don't know if he was manager or something) I got my food with the right skewers and started to find a place to sit. \n\nWhen I looked back at the place, the second worker seems to have just disappeared. She left her coworkers alone while it was lunch rush. ",
        "created_utc": 1468523711,
        "upvote_ratio": ""
    },
    {
        "title": "MTC on significance of customer satisfaction to a business",
        "author": "michael_c_2442",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4shm7t/mtc_on_significance_of_customer_satisfaction_to_a/",
        "text": "[removed]",
        "created_utc": 1468337927,
        "upvote_ratio": ""
    },
    {
        "title": "Crooked Mechanics",
        "author": "free_willi",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4sfi83/crooked_mechanics/",
        "text": "I'm writing this cause I am totally po'ed. A few days ago we had a big storm leaving my driveway filled with small trees and debris. Got the trees out of the way and went about doing errands. Down the road my car starts making this noise. It gets louder n sounds like a wheel is going to fall off. Not good and it's a Sat afternoon with few open places to take the car.\n\nSo I go into the only place I can find. They're polite - clean garage. So I tell them what happened best I can and was thinking maybe I picked up a stick or something. Am told to wait n they'll take a look. They come back with no stick but it's my cv axles and it'll cost almost $500. So I tell them I'll think about it and go home.\n\nThe whole thing isn't feeling right. The car seemed fine til it was driven thru all that debris. So today I call someplace else for a second opinion. It turns out a branch damaged the plastic sheathing under the car and it was flapping in the wind. So remove 3 bolts - take it off - end of problem. \n\nSo for $500 I could have had new cv axles I didn't need and the same noise. Unless the first mechanics were sly enough to remove the sheathing too. I hate being taken for a dumb woman!!! I am not sure what I am going to do yet but am not going to just let em get by with this.\n\nEdit: UPDATE  I went back and confronted them and told them what was really wrong with my car. They stood there and continued to try to lie. So I will be leaving a big fat negative review on Yelp. They deserve that n more.",
        "created_utc": 1468302827,
        "upvote_ratio": ""
    },
    {
        "title": "GoDaddy is horrible...",
        "author": "DanTheMan827",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4sd7nm/godaddy_is_horrible/",
        "text": "[removed]",
        "created_utc": 1468270347,
        "upvote_ratio": ""
    },
    {
        "title": "Refund",
        "author": "Cindybraxton",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4sd4u7/refund/",
        "text": "[removed]",
        "created_utc": 1468269395,
        "upvote_ratio": ""
    },
    {
        "title": "Just a pizza shop of when i use to live downtown.",
        "author": "soggyballsack",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4sd3u3/just_a_pizza_shop_of_when_i_use_to_live_downtown/",
        "text": "Ordered there dozens of times.  Loved the pizza and the friendly staff. Then new staff starts coming in, apparently an overhaul had taken place. Its a mom and pop shop so i dont know too much about what goes on behind the curtains. Anyways, call to order for pickup. \n\n\"Hi, id like to order a super large pizza for pickup. \"\n\n\"Sure, let me take your order. \n\nShe takes order, all fine and dandy.\n\n\"Ok, once you get here and pay we can start making your pizza\".\n\n\"Uh, what? I want to just go pick it up. Not wait around\"\n\n\"Im sorry, we cant do that\".\n\nOk then, ill just order somewhere else, thank you.\"",
        "created_utc": 1468269071,
        "upvote_ratio": ""
    },
    {
        "title": "Comped beverage for a good deed",
        "author": "PausedFox",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4scvxu/comped_beverage_for_a_good_deed/",
        "text": "Some quasi-positivity.\n\n-\n\n|\n\n-\n\nDue to some unexpected circumstances, no one at my workplace was allowed to go into work today (building issues), so I decided to walk to a local store (getting some exercise + browsing, win).  It's a decent distance from home and it's pretty hot today.  \n\n-\n\n|\n\n-\n\nAfter some shopping I was heading home and in front of me was an older individual walking with a cane.  I won't go into depth, but they looked to be of really low SES. I would have assumed homeless, but I made a small quip about the sidewalk not being walker friendly (or rather, this one section has no good pedestrian sidewalk at all, so we were stuck on the side of the road) and got to talking to walking side by side chatting. From the conversation I did infer that they were not homeless, but still not well off.\n\n-\n\n|\n\n-\n\nBasically they had no transportation, lost their medication script and were walking to a doctors office that I knew was quite a distance away in the opposite direction I eventually had to go.\n\n-\n\n|\n\n-\n\nI offered to buy them a drink, because its really hot outside and I didn't want them to dehydrate.  They accepted.  We crossed the road into a food establishment and I told them to pick out any drink they wanted.  The cashier did a little back and forth glance between me and the other pedestrian, handed my money back to me and told me not to worry about it.\n\nAs someone who is a bit strapped for cash (who isn't though?) the little extra act of kindness was awesome on the part of the cashier :)",
        "created_utc": 1468266516,
        "upvote_ratio": ""
    },
    {
        "title": "Find REAL GIRL FOR SEX in your area with 100% guranteed result (check img description)",
        "author": "AvoidedMars",
        "url": "http://imgur.com/xrGBNEk",
        "text": "",
        "created_utc": 1468189190,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier Makes My Day",
        "author": "mason_5",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4s1qoj/cashier_makes_my_day/",
        "text": "I've browsed Reddit for a long time and have been a lurker for a while but I need to be able to share this story, this guy really lifted me up in the simplest way. \n\nSo recently my SO and I had a lot of trouble and things started going downhill really quickly, and they stopped talking to me and seeing me, despite my best efforts to try and work things out. I won't get into details because they're not important. Out of the blue they start talking to me again, and they ask me if I can meet them outside of a coffee shop nearby to talk. I said that was fine, and hesitantly went to meet. Right outside of the coffee shop, in broad daylight, we broke up. Now this was a long term relationship and it just felt absolutely crushing. I kept it together outside but when I got back to my car I was just losing it. When I settled down I realized the only thing I could do was try my best to be happy. So I figured, well, I'm going to go in and buy myself something to ease myself. So I walked in, got a drink out of the counter, and walked up to the cashier. The cashier's window, unbeknownst to me, had a clear view of everywhere that everything went down, something I noticed on my way out. I put my drink up on the counter and he straight up paid for me and said to me, \"You're great, man.\" I walked out of that place knowing that everything is going to be ok, and I feel that that's something worth sharing. If he ever reads this, all I can say is thank you for being there for a complete stranger.  ",
        "created_utc": 1468091342,
        "upvote_ratio": ""
    },
    {
        "title": "I just want a refund!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rymc0/i_just_want_a_refund/",
        "text": "[deleted]",
        "created_utc": 1468035875,
        "upvote_ratio": ""
    },
    {
        "title": "\"Sorry we closed your support ticket. You'll have to wait another 14 days\" [ON GOING]",
        "author": "carl0071",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rxs1u/sorry_we_closed_your_support_ticket_youll_have_to/",
        "text": "Ok, well this post will probably get buried but this is not about karma or asking for help. This is just for me to vent off at how pissed off I am with a Goliath of a supermarket here in the UK. I can't name the company because of this sub-reddits rules, but the name rhymes with RESCO.\n\nSo I bought a store-branded phone charger from this shop about 6 weeks ago. To cut a long story short, just over two weeks ago, I plugged the charger into my phone and my phone started smoking. Not just a little, but a lot. Like there was a smoke bomb inside there or something.\n\nImmediately, I pulled the charger out of my phone and threw the cable outside. The end that plugs into the phone was so hot I thought I had burned myself when I pulled it out.\n\nI checked my phone, and although it still works, it won't charge up because the USB port is melted. Thankfully, my fianceé has the same phone as me, so we use her phone to charge the batteries and just swap the batteries over every so often (I work from home and she is a student, so we both spend half our day at home)\n\nI'm a small business owner myself, and I am very sensible and level-headed about these sorts of things.\n\nI immediately contacted the supermarket via a private message on Twitter (not a post on their wall).\n\nI explained the situation and as expected, I was advised to return the cable to the store and they would fill out a form which would allow me to claim for the cost of a repair or a new phone from the store.\n\nI did exactly that, and I was told to check how much my phone would cost to repair. I contacted the local Samsung repair store, and they told me that they don't repair charging ports on these phones because it's more than 2 years old.\n\nI spoke to two other repair centers and they too wouldn't repair a charging port - they mostly just replace broken screens.\n\nSo I relay this back to the store manager, and his response was \"Oh well, we'll just have to replace the whole phone. How much is it?\"\n\nNow, I have a Samsung Galaxy Note 3 32GB, which sells for about £300 new on Amazon.\n\nHe then tells me \"Ah, ok. I can't authorize this as the store limit for customer claims is £250. I will have to pass this up to head office and they will contact you within 14 days\"\n\nOk... not exactly a speedy turnaround... but at least they have admitted liability and they want to put things right.\n\n14 days come and go...\n\nNothing.\n\nI phone them up and I'm told that it's not 14 days, but 14 *working* days... So I have to wait a few more days and then they will resolve the problem. In the mean time, I'm given two support ticket numbers. Why there is two, I don't know - and nor does the call center advisor.\n\nSo *working* day 14 comes and goes.\n\nStill, nothing.\n\nI phone them up again, providing both of the support ticket numbers and I am told...\n\n\"Oh... It looks like both of these have been closed, let me double check. *pause* Yep, both of these have been closed, but I can't see why.\"\n\nBy this time, I am becoming quite agitated at the whole situation, but I remain calm because the guy on the phone is only the \"messenger\".\n\nI ask him if he can re-open the support ticket and fast-track it, as I have already waited more than 14 days.\n\n\"Oh, we don't do that. You'll have to wait another 14 working days now\"\n\nAt this point I decide to end the call because otherwise I am going to explode verbally and I didn't want to subject somebody at the bottom the the pile to that when it isn't his fault.\n\nSo I decide to vent my frustrations in another PRIVATE message on twitter. So far, it's been 15 hours and I still haven't had a reply.\n\nThat's in comparison to the 12 minutes or so it took them to reply to my initial message.\n\n**RANT OVER.... FOR NOW**\n",
        "created_utc": 1468022796,
        "upvote_ratio": ""
    },
    {
        "title": "Mechanic's Revenge Sabotage!",
        "author": "robertr4836",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rwpjw/mechanics_revenge_sabotage/",
        "text": "So, a bit long but this is my go-to story for bad service sites.  I just wish the anonymizing rules didn't exist so I could name the place.\n\nI was driving on a Saturday when my car died.  Electrics went out, belts and battery are OK so the alternator died.  I call AAA and the driver recommends taking it back to his garage which is up the street from me.  Says they will call me with an estimate Monday morning.\n\nOn Sunday I decide to try to estimate the cost.  I walk to the (closed) garage and see that they charge $60/hr for labor.  It shouldn't take more than an hour for labor but I figure two to be safe.  I go across the street to an auto parts store.  They have one refurbished alternator for my car on the shelf for $100.  I just moved into an apartment and have no tools so I figure if the garage comes in under $300 I'll just pay them to do it.\n\nI get the call Monday from the owner and he tells me it will cost $550 to fix.\n\nMe:  (Sputters) REALLY!  I mean I was figuring one, maybe two hours labor tops!\n\nOwner:  Yes, I'm only carrying $100 for the labor but you have a Nissan and genuine new Nissan parts are expensive.\n\nMe:  Hey!  Great, I know where I can get a rebuilt alternator...can I give that to you and just have you do the labor to install it?\n\nHe is clearly pissed and regretting that he gave me a breakout on the labor but reluctantly agrees stressing that he could not warranty the part.\n\nGreat, I call the parts place and talk to Auto Parts Guy (APG) asking for the alternator...\n\nAPG:  Well, we have two in 'other town', I can have them ship one here for tomorrow.\n\nMe:  Really?  I was just in there yesterday and you had one on the shelf.\n\nAPG:  Yeah, we actually still have that but 'garage' across the street called this morning and put a hold on it, said they needed it for a job.\n\nMe:  Huh, interesting.  Well, I'm pretty sure 'garage' doesn't need that part anymore (genuine new Nissan parts my f-ing ass).\n\nAPG:  Well, OK.  Have owner call us and release the part and I can sell it to you.\n\nSo I walk down to the garage and get owner out...\n\nOwner: WHAT!?\n\nMe:  Yeah...I'm going to need you to call 'parts store' and tell them you don't need the used refurbished alternator before they'll sell it to me.\n\nI swear I think that guy was on the verge of decking me, he was already angry to begin with and when I let that statement drop his face turned purple and a vein in his forehead started throbbing.\n\nAfter about thirty seconds of him staring at me he stomps over to the phone, hits a speed dial and tells the person on the other end that he doesn't need the alternator anymore and walks away without a single word to me.\n\nI go buy the part and they install it.  Less than a week later I am stranded on the side of the rode again, this time the car overheated.  This time I have AAA tow it thirty miles back to my old town and my old mechanic.\n\nAfter looking under the car for less than a minute...\n\nMy Mech:  Did you have any work done on this car recently?\n\nMe:  Yeah, the alternator was replaced last week.\n\nMech:  Huh, well, whoever did the work accidentally bent a bracket so it was rubbing up against the belt.  Your water pumps fine, I already bent the bracket into place.  It'll just take me a few minutes to put a new belt on and you should be good to go.\n\nTLDR:  Mechanic tries to royally screw me over, gets caught red handed and sabotages my car in revenge.",
        "created_utc": 1468009035,
        "upvote_ratio": ""
    },
    {
        "title": "Popular Field Service Management Apps",
        "author": "PaddyDb",
        "url": "http://mydbsync.com/blogs/popular-field-service-management-apps/",
        "text": "",
        "created_utc": 1467989361,
        "upvote_ratio": ""
    },
    {
        "title": "First visit to the dentist in 12 years. Didn't go that well.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rmyn0/first_visit_to_the_dentist_in_12_years_didnt_go/",
        "text": "So, last week wast the first time I visited the dentist since I was 8. The reason for this is that past-me was even more of huge idiotic asshole than present-me is. When I was 8, I was scared of the dentist and just ran the hell away. Never looked back. I also never brushed my teeth unless I was forced to and/or had to go somewhere \"important\".\n\nThat is, until last week my teeth started to hurt. A lot. My father brought me to his dentist. He said she's nice and good looking. Unfortunately her mother was working with me. She was all around unfriendly (contrary to everyone else who worked there), seemingly did a bad job (I can't really judge that though, I'm not a dentist), and just generally didn't seem to like me.\n\nAfter she finished up, she told me she'd only keep treating me if I'd finally start brushing my teeth (this I can understand, even though I do brush them) and that I should wear gloves next time I go there, because she apparently feels like puking when looking at my fingernails. Yes, she said she feels like puking. To be clear, they're not dirty, just long. Frankly I'm just confused.\n\nCan she even do that? I mean, I'm assuming she can, and if she doesn't like me I'll go look for another dentist, but still. There's no need for that.",
        "created_utc": 1467869469,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier doesn't approve of my food choices",
        "author": "PausedFox",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rlozn/cashier_doesnt_approve_of_my_food_choices/",
        "text": "Super brief... First time I've ever written a complaint about grocery service.\n\nAt the register paying for groceries.  My cashier is complaining to the bagger about something for the good portion of the scanning process.  At some point she gets to a package of dolmades. She scans it, then picks it up, and reads the label closer with her nose scrunching up before letting out \"*Eww*, that is disgusting. Who would eat that?\" Tosses it over towards the bagger like it's got syphilis.\n\nI was too taken aback by her rudeness and too anti-conflict to address it at the time. ",
        "created_utc": 1467851375,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't eat beef!\"",
        "author": "AliceSora",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rh6ho/i_dont_eat_beef/",
        "text": "So earlier today my sister and I had been running errands when I got the munchies, so we pulled in a fast food joint and I went inside while another lady in black (LB) was just in front of me.\n\nWhen LB got to the register, the cashier gave the usual spiel and the first words LB spews out is:\n\n\"I don't eat beef!\"\n\nOn the inside I nearly died with laughter *what are you doing here then?* Not to mention she was a pretty heavy lady about 3 times my size and I'm not skinny either, I'm guessing she was lying for god knows what?!?\n\nLB keeps giving the cashier a hard time, making her list the specials out and putting her opinions about things every other sentence. It took a good 6-7 minutes just to finish her order and when her order finally came she demanded a water even after she had already ordered a soda.\n\nAs she turned around to leave she muttered \"I won't be coming here again\" in the snobbiest voice I thought was only possible from teenage rich mean girl movies.\n\n As I took my order I smiled and please and thanked them. As I got my order the employee said \"Have a good day sweetie!\"\n\nLol I'm sure she wanted to say something a little different to LB.  I can't tell you guys how much I really wanted to rage on that rude, entitled sleaze ball who treated those wonderful women like crap, shame on you LB!\n\nI really feel for employees that have to deal with that level of disrespect just in the course of 10 minutes. I'm so sorry ladies and I did send compliments about it on the survey site. \n\nI'll never understand the mindset of mean people.\n\n",
        "created_utc": 1467786440,
        "upvote_ratio": ""
    },
    {
        "title": "General food service issues",
        "author": "staticsnake",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rexwf/general_food_service_issues/",
        "text": "[removed]",
        "created_utc": 1467753333,
        "upvote_ratio": ""
    },
    {
        "title": "I just assumed...",
        "author": "DiggedAuger",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4rer9h/i_just_assumed/",
        "text": "When I got married, someone got us a very nice gift that wasn't on our registry.  Unfortunately, it was something we already had, so we decided to return it to the store for credit.  It had come from a chain department store where we did have a registry, so it made sense that we could just swing by the local store and use the credit toward something we didn't already have.\n\nWe (both in our 20s) walked up to the cashier's desk of the \"Home Goods\" section of the local store.  The cashier greets us, and we explain that we want to return the item.  We hand her the item and the gift receipt.  She scans everything and starts tapping away at her keyboard for a few minutes.  Eventually she looks up and smiles, \"Okay, you're all set!\"\n\nMe: So do we get a card with the credit on it or something?\nCashier:  Oh, you wanted store credit?  I just assumed you wanted it refunded to the credit card from the purchase!\n\n1. We didn't get the credit\n2. The refund now shows up on the gifter's card statement making it clear we were returning the gift we had thanked them for\n\nI have never in my life seen a more perfect example of the adage, \"Never ASSUME, because when you ASSUME, you make an ASS of U and ME.\"\n\nThe cashier fixed it when we explained, but I have to think it still showed up on the gifter's card statement.  I also wonder how the gift receipt didn't suggest to the cashier that maybe we weren't the ones who had originally purchased the item.\n\nTL;DR:  A bumbling cashier automatically refunds a returned gift to the original purchaser's card, without asking how we wanted to handle the return.",
        "created_utc": 1467751011,
        "upvote_ratio": ""
    },
    {
        "title": "Kobo Customer Service Hell",
        "author": "saskatoonauthor",
        "url": "http://sean-cummings.ca/2016/07/05/kobo-customer-service-hell/",
        "text": "",
        "created_utc": 1467721965,
        "upvote_ratio": ""
    },
    {
        "title": "How to Develop a Customer Loyalty Plan",
        "author": "SpireBI",
        "url": "http://spire.today/how-to-develop-customer-loyalty-plan/",
        "text": "",
        "created_utc": 1467717773,
        "upvote_ratio": ""
    },
    {
        "title": "One good self check experience.",
        "author": "tbisbell84",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4r5u15/one_good_self_check_experience/",
        "text": "First time posting in this sub. Also on mobile so excuse the bad formatting please.\n\nAs a now former cashier I hate using self check out. Especially after working at a register all day the last thing I want to do is ring up my own groceries/items myself. \n\nA couple of months ago I had just finished working a 3-11 closing shift at my local grocery store and I needed to buy groceries for myself. So I went to a certain retail store whose employees wear the blue polo/khaki pants combo since it is open 24 hours and it was the only store open that sold groceries. \n\nAfter piling my cart full of groceries I went up to the registers only to find out that the only registers open were self check. I had a full cart of groceries, had just finished working an 8 hour shift scanning other people's groceries standing in one spot the whole time, and then walked around this store filling my cart with groceries. \n\nI did not want to attempt to check out that many groceries on my own at 12:30 am. Fortunately the one employee at the self check registers was amazingly nice and checked out my groceries for me at her register while taking them out of the cart one at a time and then putting the bags into another cart. \n\nThat's the only time I've been to that particular store so late at night in the past 8 years and honestly besides the fact that the only register open was self check it was the best experience I've ever had there.",
        "created_utc": 1467611880,
        "upvote_ratio": ""
    },
    {
        "title": "T-Mobile Violate Protection Plan for iPad - Doesn't Care",
        "author": "AptitudeDude",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4r2dl8/tmobile_violate_protection_plan_for_ipad_doesnt/",
        "text": "[removed]",
        "created_utc": 1467558902,
        "upvote_ratio": ""
    },
    {
        "title": "Rude McDonalds staff at JFK airport, or am I expecting too much in customer service?",
        "author": "stonehallow",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4r0v6g/rude_mcdonalds_staff_at_jfk_airport_or_am_i/",
        "text": "[removed]",
        "created_utc": 1467525017,
        "upvote_ratio": ""
    },
    {
        "title": "He added the tip.",
        "author": "ChaosMind55",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qz6qf/he_added_the_tip/",
        "text": "I went to this Sushi restaurant and it was like a buffet. They charged 25 dollars per person and they give you an Ipad to order off and have as many items as you wanted. (If you didn't finish any of said items you order it will be added onto the bill) \n\nNow I and Boyfriend went there, it was our 3rd time going to the restaurant. We got in, order our drinks and then we order our food. We ate and then wanted our bill. I calculated how much the food was and how much of a tip to give. \n\nWhen I got the bill I noticed it was higher the bill had our drinks and the 25 each. (It should have been 54 dollars and it was 60 dollars)  There was no extra charge for the food. So I go to the cashier, she looks at it and says out loud. \"Taking off the tip\". I realise the waiter added on his tip onto our bill. I paid and put my extra change into the tip jar. \n\nI was annoyed that he did that, but was happy that the cashier took it off. \n\n\n\n",
        "created_utc": 1467495877,
        "upvote_ratio": ""
    },
    {
        "title": "I shit myself at date with my husband",
        "author": "izzythalizzy",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qz4oq/i_shit_myself_at_date_with_my_husband/",
        "text": "I am allergic to milk. This is highly relevant to this story. \n\nWe got to this 50's style restaurant. Everything is going fine and the meal is good. The service is great and I decide that I'm going to get the milkshake with a milk substitute. They were very \"we have substitutes for everything, so just ask.\" I start drinking the milkshake and think nothing off it. I just assumed that they actually made it with almond milk or coconut milk. We sit and talk for 15 minutes and then suddenly EVERYTHING is wrong. I am cramping like hell and start throwing up all over the table. And when I am trying to get myself together and stand up I shit myself. In front off at least 20 people. And then I throw up again. \nThe waitress starts screaming. Like screaming really loud while I run to the bathroom and my husband takes care off everything. Turns out the kitchen thought that they could just make a \"normal\" milkshake and I wouldn't notice. The manager keeps apologizing and is very professional. He keeps telling my husband that he will of course buy me new clothes. My husband was really calm under all of this while I kept shitting myself out in the toilet. \n\nWe got the meal for free and my husband went out and brought me some of his work clothes.",
        "created_utc": 1467495037,
        "upvote_ratio": ""
    },
    {
        "title": "No tip for you",
        "author": "downtide",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qy469/no_tip_for_you/",
        "text": "So today my SO and I went for lunch in a nice pub that we've been to before. Our previous experience has been that the food is excellent and the atmosphere pleasant.\n\nNot so today. Today it was busy, there appeared to be not enough staff to cope, and after an excruciating 45-minute wait our meals finally arrived. Everything on my plate was overcooked and barely edible, I only ate it because by this time I was so hungry and I feared that if I asked for it to be sent back it would be another hour before I actually got to eat.  My SO's meal was under-done.\n\nSo when we'd finished, the waitress asked if everything was okay with the meal, I said \"Actually no, I was very unhappy with it.\"\n\nAnd she *laughed*.\n\nSo I said, \"Actually I'm not joking, that was seriously bad.\"\n\nAnd she laughed again, and walked off.\n\nI could accept the overcooked food as being a one-off if they were unusually busy, but for a customer's concerns to be laughed at and dismissed as a joke is absolutely inexcusable.\n\nTo be fair, the manager was very apologetic and waived the full cost of our meal including the drinks, but never in my life, until today, have I thought \"I actually hope you get fired because you don't deserve to work in customer service.\"",
        "created_utc": 1467480217,
        "upvote_ratio": ""
    },
    {
        "title": "Company Trolls Customer for Faulty Drone",
        "author": "EnviroCop",
        "url": "https://www.youtube.com/watch?v=Ban_h9sCfwY&amp;t=0s",
        "text": "",
        "created_utc": 1467456251,
        "upvote_ratio": ""
    },
    {
        "title": "Extra Mile in Customer Service, Does it matter ?",
        "author": "11tristan11",
        "url": "http://blog.adjutas.com/index.php/2016/06/26/extra-mile-in-customer-service-does-it-matter/",
        "text": "",
        "created_utc": 1467442842,
        "upvote_ratio": ""
    },
    {
        "title": "My first time not tipping a server/waiter",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qutyd/my_first_time_not_tipping_a_serverwaiter/",
        "text": "[deleted]",
        "created_utc": 1467418067,
        "upvote_ratio": ""
    },
    {
        "title": "Lunch time bacon grease bath at restaurant",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qtvbu/lunch_time_bacon_grease_bath_at_restaurant/",
        "text": "[deleted]",
        "created_utc": 1467405103,
        "upvote_ratio": ""
    },
    {
        "title": "You are now chatting with Yjay.",
        "author": "mrsly",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qt0y5/you_are_now_chatting_with_yjay/",
        "text": "[removed]",
        "created_utc": 1467395176,
        "upvote_ratio": ""
    },
    {
        "title": "Ditzy teens get fired",
        "author": "luvburger",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qssqo/ditzy_teens_get_fired/",
        "text": "A burger chain in my state often prints out a receipt w/ \"take our survey, get a free burger\" instructions. I often get the \"lucky receipt\", hey free burger for five minutes of my time is ok by me. I also always go inside to order, I hate drive-thru with a passion.\n\nSo this one day, I get my lucky receipt, take a seat and await my order. Two new hires, ditzy high schoolers, were working that day. One on the cash, one dropping fries and calling orders out for pickup. Typical teens on their first job, I guess, they kept giggling at each other and fooling around, no biggie, until\n\nFry dropper / food server LITERALLY dropped a tray full of some other customer's food onto the floor, and she and her friend just bust out laughing about it...and picked up the (paper wrapped) burger off the floor, scooped up the fries, and put them back on the tray as if nothing had happened, and called the tray number. The customer did not see this happen, nor apparently did anyone else...but I did.\n\nAs this other customer walks up to get the (dropped) food, these two ditzy teens can hardly contain themselves from busting out laughing about it. As other customer passes me back to his table, I quietly catch his attention with, \"Sir, you need to ask for another order. Those girls dropped your food on the floor, and just picked it up and put it on that tray.\" He looked at me, puzzled, and said, \"Whaaaat??\" I repeated my self. He then literally hissed at me through gritted teeth: \"THANK you.\" Turned, walked back to the counter, slammed the tray down, and literally SCREAMED at these two ditzy cheerleader types, \"GET ME YOUR SUPERVISOR RIGHT NOW!\" Those girls turned even more white than the whitest bread behind the counter, then recovered and just started laughing out loud.\n\nManager comes out from the office, story is told, and the two little cheerleaders are immediately fired, and left in tears. Fucking ditzy cheerleader valley girl types. BYE BYE!!\n\nThe customer and I both got our meals free, and coupons for more free burgers later. And I also got my survey burger. :)",
        "created_utc": 1467392587,
        "upvote_ratio": ""
    },
    {
        "title": "Why you should always be nice to your waiter!",
        "author": "ashroyalviking",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qo4fb/why_you_should_always_be_nice_to_your_waiter/",
        "text": "Why should you be nice to your waiter? They'll be nice to you!\n\nI was at a sushi restaurant with my family and I was the only person who said \"please\" or \"thank you\" and I think the waiter really noticed. I wasn't full after my first plate of sushi so I asked for another one. It was completely free and came with extra sushi! My brother ordered a second plate also but his wasn't free and has less sushi on it than his first. After everyone is done, Mr Waiter gave me free ice cream cake! It was delicious and no one else got any. \n\nThat's why you should always be nice to your waiter! \n\nEdit: You should also be nice to your waiter because they are HUMAN beings",
        "created_utc": 1467322171,
        "upvote_ratio": ""
    },
    {
        "title": "Wrong Vampire",
        "author": "ChaosMind55",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qn8gv/wrong_vampire/",
        "text": "This story happens at least almost 3 years ago. \n\nI was in a bookstore looking for a book. I couldn't remember the name of it but I did remember the author. The computers that help you search for a book were taken, so I just went up to an employee and asked them. \n\n\"Hi, do you know where this book is? It's about a vampire and it....\" He then cut me off and said: \"Twilight is over there.\" Pointing to the young adult books. I then continued and said, \"Written by Darren Shan.\"\n\nHe turned a bit red and took me to the area, where I found my book. I thanked him even though he thought I wanted twilight at least he lead me to the book I wanted.",
        "created_utc": 1467311719,
        "upvote_ratio": ""
    },
    {
        "title": "A Tale of Two Companies: The Good and The Bad",
        "author": "sdh59",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qmseq/a_tale_of_two_companies_the_good_and_the_bad/",
        "text": "Cheers! \n\nI'm a long-time reader of this sub and I finally have a story! The two players in this story are Loud: a very popular audiobook company owned by the largest online shopping river in the world, and Whales Forgo: a popular red and yellow bank. \n\n**The Bad:** \n\nTwo weeks ago I noticed a charge from Loud on my Whales Forgo online checking statement. I combed through a few months of statements and noticed I had been charged $14.95 in both May and June for a subscription I did not have with Loud. \n\nI called Loud to try and sort things out. I explained to them that these two charges were not authorized by me and that I would like to cancel whatever subscription there was with my card number and I would like a refund. Loud then spent an hour (yes, an entire hour) pretty much repeating the same question over and over again: \"Can you give us the name associated with this account?\" I tried my name. I tried the pseudonym of my author account with river.com. Everything I tried was met with \"That's not the name on the account. Can you try a different name?\" \n\nI insisted that I had no idea whose account this was and therefore I had no idea the name or email, so the \"help\" agent prompted me for the names of anyone who could possibly have access to my card. Even though my parents live 800 miles away I gave their names. No dice. I gave my boyfriend's name. No dice. \n\nNo email, no name was working. According to the help agent she was unable to even get into the account unless I could verify the name on the account, so there was nothing she could do. Finally Loud told me I needed to call my bank to issue a chargeback because there was nothing they could do on their end.\n\n**The Good:**\n\nToday I called Whales Forgo to issue a chargeback. In less than 30 minutes I was off the phone with them having been issued a full credit for both months and with my debit card cancelled and a new one issued so that no further charges could be made.  \n\nIt was frustrating knowing that anyone who could get their hand on a card number could open an account with Loud and there is nothing the rightful owner of the card could do except get a new card and go through the hassle of updating everything in their life because Loud is unable to deal with fraud properly. Luckily, Whales Forgo was sympathetic and quickly resolved my issue the best way that they could. ",
        "created_utc": 1467306496,
        "upvote_ratio": ""
    },
    {
        "title": "Employee failed to scan two items I was returning",
        "author": "PrimePhotos",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qk93a/employee_failed_to_scan_two_items_i_was_returning/",
        "text": "**edit: I was able to get this resolved - Thank you everyone for your help!**\n\n**I called the store and asked to speak to the manager. Explained him the situation and he went to the back and confirmed that the employee did miss two items. Was able to initiate the refund process through the phone.**\n\nI wasn't sure where to vent about this but I just realized a pretty big mistake the cashier did earlier this morning. I'm hoping I can receive some advice. \n\nI just noticed on my return receipt that the cashier forgot to scan two out of the eight items I was returning. I am 110% confident that I went into the store with all eight items and that the cashier forgot to scan them. There is absolutely no chance I misplaced the two items. \n\nWhat should I do? Obviously I am going to call the store first thing tomorrow morning and I would rather go in but it's a 35 minute drive and I am busy until well after 9 PM tomorrow. \n\nThe original receipt lists the UPC code so I'm assuming the best course of action would be to call the store, ask to speak to the manager and explain to him or her what happened and provide them with the UPC codes of the items that should have been scanned. \n\nI really don't think that the cashier purposely did not scan them and it was an honest mistake. Has anyone experienced anything like this? Worst case scenario I am ready to dispute the charge with my bank - obviously this is probably out of their policy but I have a great relationship with my credit card company so hopefully I don't have to resort to using them. ",
        "created_utc": 1467267877,
        "upvote_ratio": ""
    },
    {
        "title": "ATT Tablet Lies (Customer Service)",
        "author": "Nyxtia",
        "url": "https://www.youtube.com/watch?v=Tyoiukina80",
        "text": "",
        "created_utc": 1467229061,
        "upvote_ratio": ""
    },
    {
        "title": "im an electrical contractor and I avoid residential work like the plague for this reason.",
        "author": "Traphouse_lord",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qfqgs/im_an_electrical_contractor_and_i_avoid/",
        "text": "[removed]",
        "created_utc": 1467209855,
        "upvote_ratio": ""
    },
    {
        "title": "Awesome cashier swiftly eludes a conspiracy theorist's bullshit",
        "author": "kokomocat",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4qfk2n/awesome_cashier_swiftly_eludes_a_conspiracy/",
        "text": "Hello y'all!!\n\nI kind of recent story about a badass cashier I thought I might share.\n\nI went to a store that sells containers to get some supplies for my husband's upcoming travel, and when we went to pay it was only one cashier and an older lady in front of us. My husband and I were just quiet waiting for our turn, but we couldn't help but hear the conversation the older woman was having with the cashier...\n\n**Cashier:** Ok, you're paying with a check? I'll need to see your driver's license, please\n\nShe handed the DL's to the cashier and he scanned it and he was pretty much done with the transaction, but the old lady took her sweet time and used it to organize her stuff and put her DL's away, among other things...\n\n**Lady:** Oh you scanned it!? Gosh, back in my day we didn't do that. That's why I don't pay with a credit card, because when you scan it they take *all* your information so the government can have it. It's so dangerous!\n\n**Cashier:** Oh yah, I feel you.\n\n**Lady:** Yes, I can't believe it! They take so much information from us, back in my day we had some privacy and now everything is so dangerous!\n\n**Cashier:** Mhm, I hear ya. \n\n**Lady:** I'm from those days when the milkmen used to deliver milk to houses, when times weren't as dangerous as they are today!\n\n**Cashier:** Mhm, me too, milk straight to our door, kids outside playing in the streets...\n\n**Lady:** Yes! I'm a teacher and it's unbelievable that kids nowadays just play inside on their computers, I cannot believe the parents let them do that, if they knew that the government takes information from those iPads and the computers...\n\n**Cashier:** Right? It's crazy! Anyway, you're all set, have a good one!\n\nAfter this woman was taking up time for nothing, we went to get our things scanned...\n\n**Cashier:** Do you have a membership with us?\n\n**Me:** Yup we do!\n\n**Cashier:** Alright, put your phone number on the screen please\n\n**Me:** Oh my! Are you guys going to steal my information for the government?\n\nThe cashier just bursted out laughing and he shared with us that she always does the same thing, that she's a \"known\" conspiracy theorist that always goes to the store and that he just plays along with it to get her going but that she's coo-coo. He was awesome and super patient, I would've lost it with her but instead he played it smart and just went along with her crap to get her out of there ASAP. ",
        "created_utc": 1467207613,
        "upvote_ratio": ""
    },
    {
        "title": "Employee leaves my family and I in a fast food restaurant alone with no other employees",
        "author": "jerseyse410",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4q9mvs/employee_leaves_my_family_and_i_in_a_fast_food/",
        "text": "I no longer work retail but I worked and managed retail long enough to understand that there are certain things that you do not do. This is a short story from dinner last night at a popular sandwich chain that used to have Jared as it's mascot.\n\nMy family and I walk in and queue up at the sandwich line to order. Associate is rummaging around underneath the cabinet's looking for something. \n\nAssociate: \"I'll be right with you in a moment\"\n\nI think no big deal, she's restocking food or ingredients, I'll wait. Well, she pops up and we place our order, takes a few minutes as she's talking to some guy at the corner by the register. We get our sandwiches and sit down to eat, guy leaves and we start our meal.\n\nA few minutes later, the associate comes by and I'm thinking it's to check on our food or something along those lines.\n\nAssociate: Do you have a lighter or matches or anything to light a cigarette?\n\nMe: No, sorry I don't smoke anymore.\n\nAssociate: Ugh, okay.\n\nMy wife and I looked at each other and went back to eating and the Associate calls someone on her cell phone to come bring her a lighter. A few minutes pass by and I'm guessing her roommate shows up with cigarettes sans lighter. \n\nAssociate: I told you, I needed a lighter! \n\nRoommate: We didn't have one, they are like 20 cents for matches, go buy some.\n\nAssociate: I can't afford 20 cents, I'm broke!\n\nRoommate: I'll go back to the house and check and see if we have anything.\n\nRoommate leaves and Associate leaves as well......There's no one else in the store, it's my wife and I with my 2 kids and we are now alone in the restaurant. No manager, no other employees, no one in the back, just leaves the store. The Associate is gone for about 10 minutes and comes back with her roommate.\n\nRoommate: I better get a sandwich out of this, I'm hangry! \n\nAssociate: Yeah, yeah I'll make you a sandwich, what kind you want?\n\nRoommate: The type with the turkey and mayo and lettuce.\n\nThe associate proceeds to make her roommate I'm guessing a free sandwich and then walks out the front door and smokes in the entryway to the restaurant. Now the whole time this is going on, I'm slowly getting irritated:\n\n1. Because I worked and managed retail and I cannot imagine anyone acting like this in front of customers.\n\n2. Because this girl was talking about her 1.5 year old earlier and I'm thinking that this lady has a kid and she's acting like this.\n\nMy wife told me not to say anything and just leave but yeah I think I'm done with that particular brand of sandwiches for a long while.",
        "created_utc": 1467123355,
        "upvote_ratio": ""
    },
    {
        "title": "4 Best Call Center Practices for Great Customer Experience",
        "author": "asiateloutsourcing",
        "url": "http://asiateloutsourcing.com/best-practices-of-call-center-services/?utm_source=Reddit&amp;utm_medium=Referral&amp;utm_campaign=23rd%20June%20-%20AT%20Best%20Call%20Center",
        "text": "",
        "created_utc": 1467019301,
        "upvote_ratio": ""
    },
    {
        "title": "Just your typical day in Hong Kong",
        "author": "YisouKou",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4q2bgs/just_your_typical_day_in_hong_kong/",
        "text": "Hi guys!\n\nI'm from Hong Kong, and what I'll describe below is very typical behavior here.\n\nThis past weekend I had to deal with a waiter who did his very best to ignore me whenever I tried to look for help.\n\n\n\nBasically, I called him over the first time and spoke English to him, which immediately produced a shocked and terrified expression, much akin to the fabled 'deer in the headlights' look. He quickly backed away from my table, without a single word uttered, neither in Cantonese nor English, then fled.\n\nI thought at first he might be attempting to fetch someone who could speak English, but he cast one last terrified look and then stuck to the other side of the restaurant, conveniently being just out of line of sight whenever I tried to call him over. (I speak Cantonese just fine).\n\nIn the end, I had to get my order through the Manager because I simply couldn't place my order at all!",
        "created_utc": 1467015655,
        "upvote_ratio": ""
    },
    {
        "title": "DoorDash Delivery",
        "author": "walkclothed",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pvw0p/doordash_delivery/",
        "text": "[removed]",
        "created_utc": 1466910788,
        "upvote_ratio": ""
    },
    {
        "title": "You should draw this",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pvrdm/you_should_draw_this/",
        "text": "[removed]",
        "created_utc": 1466908739,
        "upvote_ratio": ""
    },
    {
        "title": "Pissed Woman Misses",
        "author": "max81968",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4psuov/pissed_woman_misses/",
        "text": "Not my story, but my mom's. She went to (retail store) one day a few months back and she saw a family of 4 black people who were following her around. To make sure that her suspicion was correct, she moved into a few aisles where she didn't need to go. Sure enough, they were following her around. She goes along and the family accidentally hits her leg with their cart.\n\nMy mom's leg has lost its elasticity, and therefore  it easily bruises and it's over sensitive to touch (you could poke it and it would bruise) Knowing this, it would clearly hurt. Mom lets out a yelp and the parents approach her. The following conversation takes place:\n\n&gt;My Mom: \"What the hell! Why'd you run into me?\"\n\n&gt;Father: We were just trying to get something from here.\n\nThe mother approaches my mom and Mom goes down the aisle. The mother follows her. Keep in mind that my mother's by herself against a family of four in the aisle.\n\n&gt; My Mom: \"So, is there any reason you were following me for half an hour?\"\n\n&gt; Other Mother: *looks at Mom's purse* \"We weren't following you. Stop trying to make me look bad, you fucker!\"\n\n&gt; My Mom: \"Look bad? You're trying to rob me. Fuck you!\"\n\nAt this point, the overweight, fatass woman swings at my mom. Mom ducks, and the woman falls *facefirst* ***into the shelf.*** My mom gets a manager and the family is removed from the store.\n\nEDIT: Read the \"Forgotten Rule\" sticky and I took it as \"you can't name companies.\" To be safe, I removed the name.\n\nEDIT 2: So to avoid getting down voted you just say \"new poster\"? Because I am. Thanks guys.",
        "created_utc": 1466867176,
        "upvote_ratio": ""
    },
    {
        "title": "Another terrible bartender",
        "author": "DaddyBeanDaddyBean",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4psqve/another_terrible_bartender/",
        "text": "Inspired by [this tale.](https://www.reddit.com/r/TalesFromTheCustomer/comments/4oym32/the_worst_bartender_ever/)  In a college town, bartender Fred (names changed) was just a complete asshole to everyone, all the time.  My buddy Jay (who can be a world-class asshole himself, at times) went in one afternoon and got sweet revenge - petty, childish and stupid revenge, but sweet nonetheless, as those adjectives all described Fred as well.  Note the building was only about 20 feet wide, but probably 100 feet deep, and the bartop itself is very long, so Fred did a lot of walking in the following story.\n\nJay walked in, no other customers in the building. Fred was seated at the end of the long bar watching baseball.  Jay took a seat at the far end. Eventually Fred got up, came down and said \"What do you want?\" (He's a real charmer, our Freddie.)  Jay ordered a small pitcher of a beer whose only tap is at the other end by the TV. Fred pulled the pitcher, brought it down, and said\"$4.95\". Jay gave him a $5... Fred rang it in... and returned to his seat in front of the TV.  \n\nAfter a minute, Jay called down, \n&gt;Jay: \"Hey, Fred? Where's my change?\"  \n&gt;Fred:  \"It's only a f\\*cking nickel!\"  \n&gt;Jay: \"I know, but it's *my* f\\*cking nickel, so how about you bring me my change?\"  \n\nFred got up, got the nickel, stomped down to Jay, slammed it down on the bar.  \n\n&gt;Fred: \"There's your f\\*cking change, happy now?\"  And stomped back down to his seat again.  \n\nJay smiled and said thank you... then picked up his beer and moved to a seat at the near end of the bar to watch baseball.  \n\nEdit: link",
        "created_utc": 1466865517,
        "upvote_ratio": ""
    },
    {
        "title": "I think this qualifies.",
        "author": "Sknightx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pqrb3/i_think_this_qualifies/",
        "text": "[removed]",
        "created_utc": 1466824764,
        "upvote_ratio": ""
    },
    {
        "title": "I'll refund the order, just give me enough of your credit card details to go on a shopping spree...",
        "author": "Danceable_Bleats",
        "url": "http://imgur.com/LMyRf7B",
        "text": "",
        "created_utc": 1466789463,
        "upvote_ratio": ""
    },
    {
        "title": "Do you need that to pay for your handbag?",
        "author": "maypleleaf",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pmd4i/do_you_need_that_to_pay_for_your_handbag/",
        "text": "First time poster, on mobile, etc etc\n\nI'm not sure if this belongs here, but last night my boyfriend enlightened me to some events that happened last time we went out for breakfast and it's made me so angry that I need to vent to *someone*. \n\nThere's a little restaurant in the town we live in that is well known among students for their amazing breakfasts. For ~$7 you get a plate full of eggs, bacon/sausage, toast, house-made hash browns and unlimited coffee. \n\nEverything is great. The server is so kind and helpful and keeps our coffee filled to the top. The food itself is delicious; greasy but not too greasy and I didn't have to cook it myself so all the better. We left with full bellies and full hearts (maybe because of the bacon and sausage).\n\nWe are also sure to leave a tip for the great waitress we had. It was something like $7, the change I had in my wallet, but she was so good to us and as students we figured we could spare it. \n\nAs we're paying up front, a well-dressed middle aged couple walks in. I distinctly remember admiring the woman's outfit and especially her handbag (Michael Kors). They say to the server they'll take the seat we were in and head over before the waitress has had a chance to clean up after us.\n\nFast forward a few weeks, we went out for supper and my boyfriend this time tells the waitress \"oh and we left you a tip on the table\" before we leave. I inquire about it, and he tells me that when we went for breakfast, he watched as the middle aged woman swiped the tip off the table and into her handbag. He assumed I saw it too and just ignored it, so followed my lead.\n\nI've been simmering with anger since last night. How dare that woman feel entitled to the money we left? It's not like she provided us with great service. I hope she at least needed the money, but (and I don't mean to judge a book by its' cover) based on their outfits they didn't. Ugh. ",
        "created_utc": 1466767095,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza delivery order from awhile back.",
        "author": "strong9510",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4phd2j/pizza_delivery_order_from_awhile_back/",
        "text": "*Resubmitted because I used the company name\n*Edited because I am an idiot and missed a one...maybe I should take a class on this.\n\nI am not a huge fan of this particular pizza place, but they are close. This was a phone conversation I had with a young lady working there when I called to order some food.\n\nLady- \"Name\" pizza \n\nMe- What are your specials for medium pizza and chicken?\n\nL- 2 mediums for 5.99 each\n\nM- And the chicken?\n\nL- 5.99 also\n\nM- Okay I'd like a medium with pepperoni salami and \nbacon\n\nL- Okay, what kind of meat is salami?\n\nM- ...ummm salami.\n\nL- (yells into the background) what is salami?\n\nGuy- (muffled) It's right there\n\nM- Ok, I'd like an 8 piece chicken too with blue cheese and hot sauce.\n\nL- What kind do you want? BBQ?\n\nM- Do you have plain boneless?\n\nL- I dont know...\n\nM- I want the boneless wings with blue cheese and hot sauce.\n\nL- Ok that will be 25.97\n\nM- Why is it 25?\n\nL- I dont know. (again into the background) he wants to know why it is 25.\n\nGuy- (muffled)Put in the coupons\n\nL- Ok it is now 18.67\n\nM- Can you read it off to me? (Lady does)\n\nL- Now its 17.56\n\nM- Why does it keep going down?\n\nL- I didn't know I could keep adding coupons.\n\nIt came correct, surprisingly.",
        "created_utc": 1466696595,
        "upvote_ratio": ""
    },
    {
        "title": "Domino's Pizza order from awhile back",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4phb8b/dominos_pizza_order_from_awhile_back/",
        "text": "[removed]",
        "created_utc": 1466695983,
        "upvote_ratio": ""
    },
    {
        "title": "Why do you advertise it on sale in your flyer...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4ph3bu/why_do_you_advertise_it_on_sale_in_your_flyer/",
        "text": "[removed]",
        "created_utc": 1466693308,
        "upvote_ratio": ""
    },
    {
        "title": "6 Important Telesales Tips for Enhanced Telemarketing",
        "author": "asiateloutsourcing",
        "url": "http://asiateloutsourcing.com/6-tips-for-enhanced-telesales/?utm_source=Reddit&amp;utm_medium=Referral&amp;utm_campaign=23rd%20June%20-%20AT%20Telemarketing",
        "text": "",
        "created_utc": 1466673656,
        "upvote_ratio": ""
    },
    {
        "title": "No one could explain the company's policy.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pcw0x/no_one_could_explain_the_companys_policy/",
        "text": "[deleted]",
        "created_utc": 1466627829,
        "upvote_ratio": ""
    },
    {
        "title": "A pleasant doctor's visist",
        "author": "srw464",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4pcte8/a_pleasant_doctors_visist/",
        "text": "I'm not sure if this belongs here or not, as I was not a customer, but a patient.  If there's a better place for it, let me know.\n\nBackground: My mother had recently had chemotherapy for tongue cancer.  As such, our family's co-payment under our insurance was maxed out for the year, meaning any visits to the doctor were essentially 'free' (we were still paying her bills, but we'd maxed out the copays to the insurance company).\n\nThe Story:\nI was in school in another state, and was having bad headaches.  Being a bit of a hypochondriac, I decided to find a local doctor to see.  After much trial and error, I find one near my university to see me.  I have to take a day off class and get a ride to see him, so I'm already stressed out.\n\nVisit goes fine.  He wants to see me in a week to discuss blood test and heart monitor results (it turned into more than a headache visit), so I go back.\n\nFirst thing the receptionist says to me is that I'd need to pay a co-payment.  I explained to her that that would be billed through my insurance company, and that it would come back as me not needing to pay anything.  She says I need to pay.  I say no, that's not how this works.  I know that you're supposed to bill my insurance company and then they bill me if I have a co-payment.  At least, this is how it'd always worked for me before, and later my parents confirmed it.\n\nAfter going back and forth, I decide to just pay.  I pull out my credit card and she says 'Oh, we only accept checks or cash.'  And I just lost it.  I started crying, and had to leave to call my mom while she got the doctor.  When I came back, he called me into his office. \n\n&gt;Him: I understand you don't want to pay me.\n\nThis statement shocked me.  I never said I didn't want to pay.  At this point I'm still crying, and it's hard to talk through the gasps.\n\n&gt;Me: That's not what I said.  I just know that I have no co-payment, and I tried to explain that.\n\n&gt;Him: What do you want to be when you grow up?\n\n&gt;Me: Excuse me?\n\n&gt;Him: What do you want to do when you graduate college?\n\n&gt;Me: I want to be a teacher.\n\n&gt;Him: Well, are you aware that teachers do things differently?  Not all doctors do things the same.  You shouldn't assume things.\n\nAt this point I made a comment about how I was just there for the results, and he said well, that doesn't mean you don't have to pay.  Which I realize.\n\nHe says this in such a condescending tone that I feel horrible.  I'm crying more, and he says to meet him in the other room for my results.  I go there, and he calls in his nurses and asks which of them told me I didn't need to pay and/or made me cry.\n\nI can't speak.  He's trying to blame this on his nurses/receptionists, when he's the one who made me feel worthless.  I tell him that it was not their fault, that they did nothing wrong, but he won't buy it.  Eventually he says he understands if I don't want to come back again, and I say I won't be.\n\nHe gives me a bill for the visit and says 'If you don't pay me, I understand.  I have a lot of patients who do that.'  And he won't listen to my protests of 'No, I'm going to pay you, even though my insurance company already is.'  I send him a check a week later.\n\nOh, and the icing on the cake?  I had to go back for a refund check for the 40 dollars that they charged me that my insurance company (surprise!) said I did not owe them.  It was so hard not to tell the receptionists to pass along that the doctor shouldn't just 'assume' things.\n\ntldr: doctor humiliates me, charges me money that he has to refund.",
        "created_utc": 1466626980,
        "upvote_ratio": ""
    },
    {
        "title": "After 10 minutes at drive thru, thanks for the free penicillin Hamburger Royal. Too far down freeway to bitch personally.",
        "author": "catalinahb4",
        "url": "http://imgur.com/EoPE00z",
        "text": "",
        "created_utc": 1466577581,
        "upvote_ratio": ""
    },
    {
        "title": "The ups and downs of video game shopping",
        "author": "verdantarcher",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4p6zej/the_ups_and_downs_of_video_game_shopping/",
        "text": "Sorry this is so long, my tale required a bit more backstory than I bargained for! TL;DR at the end.\n\n**Backstory**\n\nI graduated from college recently, and have been eyeing the New Nintendo 3DS for a while, so I decided it would be nice to buy it as a nice little congratulations gift to me (especially now that I have a bit more free time). After a little bit of research, I settled on the Happy Home Designer Bundle, and purchased it from everybody's *favorite* game store.\n\nWhen it finally arrived, I carefully and reverently opened the box, ignoring my instincts to rip it open with childlike delight. Once I set up the console, I started looking through everything else that came in the box, and realized there was no game! A bit distraught, I searched through the console, and all the papers for a good hour, eventually coming to the conclusion that I must be crazy, or an idiot, for not being able to find it. At that point I turned to the internet to look up unboxing videos of the bundle, and lo and behold, the game code should have been right on top!\n\n**The Tale**\n\nI called customer service, and they said the only way to resolve my issue was for me to return the entire console to get a replacement. This was a little frustrating, but I understood that since the company doesn't know I'm a reputable person, this was the only way for them to know I wasn't lying. The customer service rep then asked for my email, which I gave, and said she'd be sending me a shipping label shortly.\n\nOne day, and no shipping label, later, I decided to try emailing customer service, explain my situation again, and ask for a shipping label. This time I received no response, so by the time I got off work I decided to try my luck at the physical store. I hike to the closest store, explain again to the guy at the register, and he immediately called his manager over to see how they could help. The heavens opened up as these two lovely gentlemen spent a good 30 minutes with me seeing what they could do to help. \n\nUnfortunately, they weren't able to get a replacement for me (corporate refused to send a replacement, and gave no reason why), but the guys at the store were very nice and helpful the entire time, and they didn't make me feel like I was being annoying. One of the guys even seemed to genuinely feel bad that the bundle didn't have everything in it, since he was a Nintendo fan too. Even though my experience with the company wasn't anywhere near great, I would definitely go to that store again because of those guys!\n\nTL;DR: Purchase didn't come with everything it was supposed to. Customer support wasn't very supportive, but the physical store staff was.",
        "created_utc": 1466543495,
        "upvote_ratio": ""
    },
    {
        "title": "For all the Ice in Antarctica, I could not get some in my water...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4p5awi/for_all_the_ice_in_antarctica_i_could_not_get/",
        "text": "[deleted]",
        "created_utc": 1466524533,
        "upvote_ratio": ""
    },
    {
        "title": "X-post /r/TalesFromRetail, Saving someone from a hassle",
        "author": "chchchicken15",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4p2t5y/xpost_rtalesfromretail_saving_someone_from_a/",
        "text": "I was at the grocery store with my mom and we were checking out and the guy who was ringing us out finished and told me the total. I swiped a gift card and then my mom tried to hand him a coupon after I swiped the gift card and it already was already processed, receipt printing and everyrhing. It was for $2 off or something. My mom was working on bagging up my few groceries. The guy looked at me kinda confused and worried that he was gonna have to return all that stuff and use the coupon to re-ring me out to get $2 off.\n\nI took the coupon from him and shoved it in my pocket and went \"Shhh. Don't tell.\" and looked toward my Mom. He just kinda shrugged and went okay and handed me my receipt. He then went to finish up bagging my groceries. While he was behind my mom our eyes met for a split second and he mouthed, 'THANKS FOR THE SAVE' I laughed and he laughed.\n\nYou shouldn't be a cranky customer to save 2 bucks.",
        "created_utc": 1466482579,
        "upvote_ratio": ""
    },
    {
        "title": "FLOUR.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4p1ggh/flour/",
        "text": "[deleted]",
        "created_utc": 1466462852,
        "upvote_ratio": ""
    },
    {
        "title": "Don't bother logging in to Ticketmaster for your free vouchers",
        "author": "[deleted]",
        "url": "http://mashable.com/2016/06/20/ticketmaster-free-vouchers-errors/#fXqZNGSfESqI",
        "text": "[deleted]",
        "created_utc": 1466458099,
        "upvote_ratio": ""
    },
    {
        "title": "The worst bartender ever",
        "author": "BandanaJoe",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4oym32/the_worst_bartender_ever/",
        "text": "This is the worst experience I have ever had anywhere. I honestly wish I was making this story up but this is the truth.\n\nMy friend invites me out to this music lounge to see his friends band in the of the venue. I arrive and pay the somewhat steep 8 dollar cover to go downstairs. Its a bit of a dive which is kind of refreshing from the uptight bars around I'm used to.\n\nI order a Sam Adams Octoberfest from the cash only bar. I was quickly poured a small plastic cup. I paid, left a tip, and took a few sips. This is where things started to take a turn for the worse.\n\nI could immediately tell something was wrong with the beer, either the lines were dirty or the keg had gone bad but it tasted terrible. I have had this beer many times before and I was pretty confident that I used to enjoy it. The friend who had invited me said, oh the drummer in the band also said they were bad, I'll get you a PBR, and comes back with one.\n\nThere are very few times in my life when I enjoyed the taste of Pabst more than the taste of a Sam Adams but this was one of them. I walk up to the bar to inform the bartender of the bad beer, and the exchange goes something like this:\n\nMe: Hey just wanted to let you know something is wrong with the Octoberfest.\n\nBartender: *immediately gets extremely defensive* There's nothing wrong with it I just had some.\n\nMe: There's something wrong with it, I'm not asking for my money back...\n\nBartender: ITS FINE!\n\nMe: Somethings wrong I'm not drinking it, just get rid of it\n\nBartender: Not My Problem! You get rid of it!\n\nBefore i toss the drink in his face, I leave the beer on the bar and turn around and walk away completely stunned that someone who supposedly works for tips would react this way, I honestly was trying to tell him about a problem and help out before more people order it and he completely shuts me down.\n\nBut that's not even the end of the story. Another friend shows up and before we think to warn her, she orders the same thing. Realizing right away that the beer is off she hands it to my friend who had invited me who takes a taste and makes a terrible face. They march up to the bar together. The bartender has the same reaction, defensive and dismissive, even pouring some for himself and taking a gulp \"see nothings wrong!\"\n\nLuckily a manager comes down and my friend complains to him, he says go upstairs and get some from the tap up there. So we do so, the bouncer...who probably had about 3 brain cells left... told us it was 6 dollars just to go to the other bar. We tried to explain but he just kept repeating 6 dollars. Eventually the manager who told us to head up waved us through and we went to the bar. We again plead our case, the bartender pours us 2 octoberfests and says 12 dollars completely ignoring everything we said. Luckly we still had a cup of the offensive liquid from downstairs and it only took one sip before he gave the beer to us no charge.\n\nNow I could have at least given a star back because despite our difficulties we did get the beer we originally ordered. However, the bartender from downstairs, who apparently hates money, flat out refused to serve my friend after the ordeal. We are relatively reasonable people and I think considering how terrible the service was here we kept our cool and were pretty amicable. Why are you in the service industry if you hate serving people?\n\nAfter talking to several other people, they all had similar experiences and ended up dumping the beer out in the bathroom because he refused to take them back. Anyway, after finishing our drinks we felt so uncomfortable staying we left, we felt really bad for the next band that had started playing because so many people had filed out...I'm sure in no small part to the friendly bartender.\n\nEdit: Formatting",
        "created_utc": 1466427805,
        "upvote_ratio": ""
    },
    {
        "title": "Self Serve",
        "author": "revdon",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4oxyag/self_serve/",
        "text": "This just happened to me (M) last night.\n\nI'm at the supermarket. I pick up a half-dozen items and get in line at the express checkout, which happens to be right next to the self service registers. The 'roper' (R) turns to me:\n\nR: Wouldn't you like to use the Self Service checkout?\n\nM: No thanks. Express is still faster. (If I'm paying the markup why would I do it myself)?\n\nR: Well... I could ring it up for you.\n\nM: ???\nThen why are there self serve registers?\n\nR: ...\n\n\n\n&gt; edit: I'm not sure why I'm getting downvoted for pointing out the hypocrisy of forcing Self Serve and then offering to bypass it.\n",
        "created_utc": 1466415801,
        "upvote_ratio": ""
    },
    {
        "title": "Ice Cream With a Side of Attitude.",
        "author": "toe689",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4ox0uc/ice_cream_with_a_side_of_attitude/",
        "text": "[removed]",
        "created_utc": 1466397786,
        "upvote_ratio": ""
    },
    {
        "title": "at the Purple Cow, Ice Cream With a Side of Attitude.",
        "author": "toe689",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4owzhr/at_the_purple_cow_ice_cream_with_a_side_of/",
        "text": "[removed]",
        "created_utc": 1466397161,
        "upvote_ratio": ""
    },
    {
        "title": "I guess it took over two hours to \"double-check\"",
        "author": "bananarabbit",
        "url": "https://i.reddituploads.com/14fb91f2cd394425bd925061a77eede5?fit=max&amp;h=1536&amp;w=1536&amp;s=229864f10a2baec73932cc9a81c3218e",
        "text": "",
        "created_utc": 1466396938,
        "upvote_ratio": ""
    },
    {
        "title": "Lady doesn't give up her seat",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4ougyx/lady_doesnt_give_up_her_seat/",
        "text": "[deleted]",
        "created_utc": 1466360696,
        "upvote_ratio": ""
    },
    {
        "title": "Excuse me, I am eating over here!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4ouc13/excuse_me_i_am_eating_over_here/",
        "text": "[deleted]",
        "created_utc": 1466358809,
        "upvote_ratio": ""
    },
    {
        "title": "I shouldn't have expected a boot store to carry something like that, I reckon.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4om1uf/i_shouldnt_have_expected_a_boot_store_to_carry/",
        "text": "[removed]",
        "created_utc": 1466206499,
        "upvote_ratio": ""
    },
    {
        "title": "Thought the pizza guy was going to kill me",
        "author": "superbob97",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4oljo6/thought_the_pizza_guy_was_going_to_kill_me/",
        "text": "I walked into the a popular pizza chain that shares a name with a math game. It was 10:50 meaning they were open for at least another hour. I walk in and the guy at the register screams at me \"What do you want!\" I ask for a small cheese pizza, and the guy starts slamming shit down and screaming. I understand his frustration I'm a server, if someone walks in late that probably means I have to stay later, so when I paid I left a tip, the cashier goes \"hey man he left you a tip\" and the guy goes \"I don't even fucking want it, tell him to keep it\" then looks at me and goes \"go to fucking bed its 11pm what are you even doing\" i told him I was getting a pizza for my girlfriend cause i thought id do something nice for her. He just scoffed, boxed the pizza up and threw it at me.\n\nFucking lazy ass people",
        "created_utc": 1466199487,
        "upvote_ratio": ""
    },
    {
        "title": "I was brave at a coffee shop.",
        "author": "itsaspoon",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4ofw1d/i_was_brave_at_a_coffee_shop/",
        "text": "So, I went to a coffee shop after therapy today. The barista made my drink really watered-down. This is my nightmare...having to ask for a new drink. I sat for about 5 minutes getting up the nerve to walk over and ask her to remake it. I went over exactly what to say, even exposing my own vulnerability in the situation by saying \"I'm sorry, I'm really nervous to ask this but could you please remake my drink?\"\n\n\n I waited until the inside lines were zero and the drive-thru wasn't as busy before I went up to the counter. When everything had slowed down, I went up ro the counter. I waited a minute for her to notice me because I did *not* have any extra courage to make myself noticed. The barista noticed me, came over amd without so much as a smile said \"Did I....leave something out?!\" in this tone that instantly made me regret my decision in coming up there. Her voice reeked of attitude and distain of my presence. I said what I had practiced, stuttering because her approach had popped out most of that courage I had built up. She swiped my cup from the counter and threw it in the trash as she sighed and turned around to start on my new drink. \n\n\nI stood there quiey, using some cbt skills in order not to cry, and when my drink was ready I went back to my seat. \n\nI felt small. I felt weak. I felt like the biggest bother and nuisance in the store. My drink was perfect, but it wasn't worth what I went through to get it. \n\nI had a book but I couldn't concentrate on it anymore and went out to my car, upset.  On the way out, I grabbed one of the business cards with the store manager's info on it. When I got out to the car, I composed myself again, as much as I could, and while sitting 30 feet outside the store, called the store manager. \n\nThe manager was out but I spoke to the next person in line, the shift manager. My voice shook as I spoke and my chest started squeezing all the air out of my lungs. I pushed the words out and told her what had just happened. \n\nIn the end, I got a free drink. But that's not what I was after. The shift manager listened and apologized for the barista's behavior. She promised to talk to her manager about it and said she would definitely have a talk with the barista.\n\n\nThat's what I wanted. I work in customer service and I know that not every customer is pleasant. Some are rude, some act entitled, and some are great. But every customer is different and deserves to have their own experience - not to be treated with the attitude of 3 or 4 customers previous. I understood that she was likely in a rush of customers and was feeling stressed. But that's why I purposely waited until the customers had slowed down. I wasn't trying to add to her stress or be picky. I just wanted to get my drink remade. \n\n\nI felt better after doing something rather than sitting with my emotional state. My remade drink tasted very good. I hope the barista can learn from this, when her managers talk to her, and understand that your attitude really does effect every single customer you come in contact with. ",
        "created_utc": 1466113872,
        "upvote_ratio": ""
    },
    {
        "title": "CUSTOMER BE AWARE! Think clearly before purchasing from Flamingo Flower &amp; Gifts (http://www.flamingofloral.com/) located in Markham, Ontario and their associated chains!",
        "author": "roseblythe1995",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4obuvm/customer_be_aware_think_clearly_before_purchasing/",
        "text": "[removed]",
        "created_utc": 1466055971,
        "upvote_ratio": ""
    },
    {
        "title": "Ordered mattress 3 weeks ago, still not even at the store from the warehouse - normal?",
        "author": "immadammi",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4oa7pl/ordered_mattress_3_weeks_ago_still_not_even_at/",
        "text": "I bought a mattress and frame from a local place and have been told when I bought it, when I called a week later, and when I called two weeks later (i.e. week 3) that it would be \"arriving from the warehouse\" within the week.  This was from a \"retirement sale,\" and though the business itself isn't closing, I've been wondering if I should cut my losses and just reverse the charges on my card. What's a normal timeframe for this kind of thing? ",
        "created_utc": 1466031274,
        "upvote_ratio": ""
    },
    {
        "title": "Boohoo's unsubscribe link in email doesn't work. Ask to be removed - am told they 'cannot remove me'.",
        "author": "LICK-A-DICK",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4o713l/boohoos_unsubscribe_link_in_email_doesnt_work_ask/",
        "text": "I was getting a bit over the constant emails from Boohoo. I love their clothes, but every second day is a bit too much for promotional emails for me. I attempted (like any logical person) to unsubscribe using the link at the bottom of the email. I've tried this over the course of a few days, but it links to a blank page.\n\nSo I emailed them politely requesting to be taken off, and received this email:\n\nDear xxxxx,\n\nThank you for your email.\n\nI have now unpublished your boohoo account for you as requested.\n\nIf you have any further queries please don't hesitate to contact me.\n\nKind Regards,\n\nHaseeb \nboohoo Customer Services\n\nOnly to receive YET ANOTHER promotional email today. I emailed them again, and also contacted them on Twitter. The smart alec on the other end told me 'I'm really sorry about this, there is a unsubscribe link at the bottom of the email that you will need to follow. Rachel x'\n\nI said 'My initial email pointed out that this link is not working. I know how to unsubscribe from an email, thanks!!!!!!'\n\nThey have then replied: 'I'm really sorry unfortunately we are not able to do this for you. Rachel x'\n\nSeriously?! I am not able to remove myself from the mailing list. One of the representatives working there confirmed they have removed me, but it didn't work. Now you're telling me that it's impossible? \n\nIs this legal? I've obviously added their email to my spam list, and although I really love Boohoo I am unfortunately never EVER buying anything from them again. Ridiculously poor customer service, right?",
        "created_utc": 1465993303,
        "upvote_ratio": ""
    },
    {
        "title": "My experience with Amazon. Only things that were edited were names and order numbers.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4o703j/my_experience_with_amazon_only_things_that_were/",
        "text": "[removed]",
        "created_utc": 1465992889,
        "upvote_ratio": ""
    },
    {
        "title": "But We Already Bought Them",
        "author": "SmokeFrosting",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4o6zxs/but_we_already_bought_them/",
        "text": "As some of you may know, The Conjuring 2 came out last Friday. Due to it being sold out on opening night, me and a few friends decided to go Monday night. A little background, the area that the theatre is located in is in a pretty trashy area, there's always a cop at the theatre. It's also important to know that one of my friends looks extremely young for his age (5'4\", and not a facial hair in sight). He's also the kindest guy ever and happens to be gay. I however am super quick to get angry. \n\nAnyways, this theatre has a huge problem with underage kids sneaking in to R rated movies, so they check IDs a bunch (a little annoying since I've been asked \"Red or white?\" at weddings since I was 16 but I understand.) It's about 10:30 as well and this is the last showing so all the workers have to be tired. As me and my friend were waiting for our other friend to finish buying a ticket, an underaged couple who had gotten past the front desk were faced with the level 2 boss, the manager. The people in the story are Me, my friend E, NNM the no nonsense manager, TW the theatre worker, UAG the underaged girl, and UAB the underage boy. \n\n*UAG and UAB walking to the entrance of the right wing of theaters*\n\nTW: Hey can I see your tickets?\n\nUAG: Um... We bought them online.\n\nTW: okay that's fine you can just show me the receipt on your phone that you should've shown the the person at the front. \n\nUAG (looking annoyed): ugh, okay, here. *thrusts her phone into TW's face*\n\nTW (after noticing it's TC2): okay I'll need to see your IDs please. \n\n*UAG and UAB start rummaging through their purse/wallet* \n\nUAG: ugh, I can't find it put the lady already checked us and we bought the tickets. \n\n*TW seems to sense this is going to be a problem, and glances over at NNM who had just got done checking Me and E's tickets/IDs*\n\n*NNM walks over, and TW explains what's up*\n\nNNM: I'm sorry guys but I'm going to have to see some ID, a lot of kids buy tickets online to get out of showing an ID. If someone at the front did really check your IDs we can walk up there right now and have them confirm. \n\nUAG: I don't understand what the problem is we have the tickets we're not sneaking in.\n\nUAB: Yea man and you're lettin' that (derogatory term for homosexuals) in and he's clearly underage why the fuck are you cardin' us? *pointing at E*\n\n*I'm about to punch this guy in the face but E sort of steps in front of me.*\n\nE: Even if you guys weren't underage you're clearly too immature to see this movie.\n\nNNM: Listen, now I don't care whether you two are underage or not, harassing out customers will not be tolerated, I'm going to have to escort the two of you out of the theatre. (To E) Please wait here a moment.\n\n*UAG continues to argue with NNM as he walks them to the door and returns a few minutes later*\n\nNNM: Hey I'm sorry about what that kid said, here are a few free movie passes for your trouble, again I'm sorry. \n\nA big shout out to NNM for shutting down what could have been a pretty nasty altercation, and to my friend for not losing his cool like I was about to do. \n\n\n\nEDIT: I'm understanding now how bad the lil Africa seems to be, but it's what the people who live there call it, and it's sandwiched between two neighborhoods also named for their predominate race. It's something the people who live their embrace, and something you could've gotten jumped for in school for disrespecting. Do I think it's right? No. Should I have just said \"it's a bad area.\"? Probably. ",
        "created_utc": 1465992807,
        "upvote_ratio": ""
    },
    {
        "title": "[Long] But We Already Bought Them",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4o6y1h/long_but_we_already_bought_them/",
        "text": "[deleted]",
        "created_utc": 1465991918,
        "upvote_ratio": ""
    },
    {
        "title": "Steakhouse Ruined My Bachelorette Party",
        "author": "greatbiglittlefish",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4o3dhn/steakhouse_ruined_my_bachelorette_party/",
        "text": "I will start this off by saying that the particular steakhouse I went to is normally very good and I have no problems with it. I think they just had a really really bad night.\n\nSo my bridesmaids and I had plans to go to this steakhouse for dinner and a drink plus we figured filling up on bread would help when we went to the bars afterward. On our way there, we call ahead and they tell us it'll be 5-10 minutes once we get there. Great! So we get there and they say 5-10 minutes. \n\nWe stood and waited and were glad that we called because clearly a local high school had just graduated and then we noticed that we were still waiting...and waiting...and it had been half an hour since we walked in the door. Finally we get seated and we'll admit we're a little miffed but it's no big deal because at least now we're seated and have some bread.\n\nSince this is a bachelorette party, I'm wearing a tshirt that says \"Bride\" across it with a button that said \"I said yes.\" This will become important a few times in this story.\n\nOur waiter comes to take our drink order and by the time he comes back with our drinks, we're ordering our food. Since we had planned on mostly drinking our drink with dinner we figured we would have only had a small portion of it before our food got to us. \n\nI should probably also mention that he took our order on a napkin and when I had asked for a specific option on one of my side dishes, he looked at me like I was stupid for asking (I only wanted one of the additions on it, not both. Which is why I wanted to clarify) and then proceeded to not write it down.\n\nSo we're chatting, drinking, etc. when we notice that a) it has been a really long time since our waiter has even stopped by our table and b) the table behind us (that got here after us) has already eaten their food and left. That's when we realize that we got our drinks 45 minutes ago and we still just have bread. \n\nRight about this time is when our waiter comes to the table and says, \"I am SO sorry. I forgot to put your order in until just now. I've just been so spacey today. Your salads will be out shortly.\" At this point, it's pushing 9 p.m. and we really wanted to be leaving right about now. But we're trying to keep calm, etc. (Also at this point we just drank down the rest of whatever we were drinking because it wasn't worth it to wait until the food came.)\n\n15 minutes later, the people that ordered salads get their salads. We thought it was a little odd that it took that long but again, trying to stay positive. \n\n20 minutes after that (a full 35 minutes after he told us he forgot to put our order in), we finally get our food. And get this: Everyone that ordered steak had it either under or over what they asked for, the side dish that I specifically asked that only one modification be on it had both, and on top of that, ALL of our food was cold.\n\nBy now it's roughly 9:40 and we really don't want to send our stuff back because we're afraid it'll never come back (plus we're super hungry) so we go ahead and eat it. \n\nAt this time, I had also texted my cousin who used to work at the same restaurant about what had happened. (More in a, \"Man, they've really let things go since you stopped working here\" kind of way.) He immediately tells me that we absolutely need to talk to a manager, that our wait time even the second time was not okay, etc.\n\nWe were going to ignore it originally but then he had also said that even if we weren't looking for a refund, the manager really needed to know that that happened. So one of us runs up to the hostess stand (our waiter is nowhere to be found and hasn't stopped by at all since our food came) and asks if a manager can stop by our table. We watched this hostess speak to a manager who looked right at us, shook her head, and walked away. \n\nAbout 10 minutes after that (we've finished eating and our waiter is STILL nowhere to be found) the manager tries to walk right by our table but we were like, \"Hey, we really need to talk to you.\" We calmly explained that we had been at her restaurant for about 2.5 hours at this point. She, very snottily, says, \"No you haven't, that's impossible.\" And we were like, \"No, seriously....\" So then we tell her what happened.\n\nWhile telling her this, my MOH says, \"We considered sending the food back but we clearly have somewhere to be.\" and pointed at my shirt. The manager then goes, \"Oh, are you celebrating something today?\" At this point we're kind of pissed and so the \"obvious statement is obvious\" comment was really not helping. She then says she'll take care of discounting the checks for us because what happened was indeed, unacceptable. Cool.\n\nShe came back and explained that she took 50% off of each of our bills and then handed us an appetizer coupon. We thanked her and she moved on. Again, we weren't looking for the discount/refund but we did appreciate it.\n\nSo we have our cards out on our receipts at the end of the table waiting for our waiter. And waiting....and waiting... By this point it's about 10. We actually had to ask a different waitress if she knew where our waiter was so we could pay and get out of there.\n\nFinally he comes by and says, \"Oh, are you looking to pay?\" (Nope, just showing you the different colors that debit cards can be). And then he spends the next 15 minutes trying to get all of our checks in there. \n\nBy the time we leave, it's pushing 10:30 and although we tried to go downtown to the bars, we were completely sober at this point, pissed as hell, and decided it was better to just go home.\n\nI am normally a big fan of this place and love their food but this experience was the worst I've ever had at any restaurant. ",
        "created_utc": 1465934785,
        "upvote_ratio": ""
    },
    {
        "title": "Difference Bewteen Inbound and Outbound Marketing",
        "author": "asiateloutsourcing",
        "url": "http://asiateloutsourcing.com/inbound-marketing-vs-outbound-marketing/?utm_source=Reddit&amp;utm_medium=Referral&amp;utm_campaign=14th%20June%20-%20AT%20Inbound%20Marketing",
        "text": "",
        "created_utc": 1465881131,
        "upvote_ratio": ""
    },
    {
        "title": "Hamburger Cheeseburger",
        "author": "dbfsjkshutup",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/4nyayt/hamburger_cheeseburger/",
        "text": "Hi all, someone from /r/TalesFromYourServer directed me over here, didn't see this sub at first but figured I'd post it here too, as its more applicable. Sorry for anyone who browses all the Talesof... subs, cuz you probably saw this already.\n\nHappened about 14 years ago when I was a little kid, but has been an inside joke with my mother and I ever since.\n\nWe're in a fast food hamburger joint off the interstate, is an elderly couple in front of us in line (we're inside, not drive-thru). Lady says \"I want a hamburger cheeseburger\". Guy politely asks if she wants one hamburger and one cheeseburger, or a cheeseburger. She insists; she wants her hamburger-cheeseburger.\n\nReally pointless to type out the 10 minute conversation that ensued, but around minute 5 she demanded a manager, whom she just repeated her request for a hamburgercheeseburger to. She began to get vehement, the manager was smacking the overhead menu screens pointing at the hamburger, then the cheeseburger, asking her calmly which one she wanted, or both. Eventually she ended up saying something about how n*****s couldn't even make a hamburger-cheeseburger (cashier/manager were both white).\n\nThis entire time her husband was standing there with a blank stare on his face, never said one thing, and to this day I don't know whether or not he was just a senile old fart or if he was some kind of Zen master who figured out how to tune out his delusional wife.\n\nTL;DR: Old lady demands hamburgercheeseburger at counter of fast food joint for 10 minutes, ends up calling white employees the N word.",
        "created_utc": 1465857883,
        "upvote_ratio": ""
    }
]