[
    {
        "title": "My password still doesn't work!",
        "author": "YoungDiscord",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ghox5/my_password_still_doesnt_work/",
        "text": "This just happened a few minutes ago, on a monday... 3 minutes into work at 7:00AM\n\n\n$ME: xxx tech support how may I help?\n\n\n$USER: Hi, my password doesn't work can you unlock it or something?\n\n\n$ME: Of course, no problem if you may just give me your name and surname so that I can find you in the system?\n\n\n$USE: Bob YYY\n\n\n$ME: (I search for bob YYY, find one result, I look in the system and according to the system the account is fine and isn't locked... maybe I got his name or surname wrong?) Excuse me I just wanted to confirm, your name is Bob YYY, is that correct? (I always ask because you never know, better safe than sorry for resetting the wrong account lol)\n\n\n$USER: Yes\n\n\n$ME: Ok well according to the system everything seems to be in order perhaps its a synchronization issue, may I suggest a password reset? and I just wanted to confirm again just to make sure, your name and surname is Bob YYY, is that correct?\n\n\n$USER: Yes, and sure, we can try the password reset\n\n\n$ME: Ok then I would like to request that you turn your computer off, while it is off I will reset the password (enter confidential way of how the user resets their password here) ok?\n\n\n$USER: Ok, the computer is off\n\n\n$ME: (Proceed to reset password and guide the user through the password reset) Is your password working now?\n\n\n$USER: No, my password still doesn't work\n\n\n$ME: (Clearly confused at this point what the hell is going on here, I check his account for a third time, everything is in order in the system) Hmmm... I just wanted to confirm (for a third time) your name is Bob YYY, is that correct?\n\n\n$USER: No, its Bob YYZ\n\n\nI asked the guy two times and he said it was bob YYY and now he says its YYZ of course only just after I reset the password for Bob YYY... guess who needs to make a phone call to an annoyed Bob YYY at 7 in the morning :/ to be fair though the guy was quite a pleasant and polite person, he just had a surname really similar to some other guy with the same name.",
        "created_utc": 1537162821,
        "upvote_ratio": ""
    },
    {
        "title": "The user who pissed me off the most",
        "author": "James29UK",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ghiis/the_user_who_pissed_me_off_the_most/",
        "text": "[removed]",
        "created_utc": 1537160788,
        "upvote_ratio": ""
    },
    {
        "title": "Security theater of the absurd...",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ghdjq/security_theater_of_the_absurd/",
        "text": "\nI had just started in the security practice of a consulting firm and they put me on delivering a penetration test against fnordco, a diversified company in the Fortune 200 range. They hadn't suffered a big breach, but a competitor had recently made the news and they didn't want the splatter.   \n  \nAs some kind of trial by fire, they make me the project manager, but don't give me access to useful documents or the team for a few days. My days are spent nudging people via chat and email for _anything_ that might help me get up to speed. Finding the internal directory useless (everybody is an engineer, from sales people to consultants to internal IT), I resort to LinkedIn to find the pen-testers at the firm. People who do respond refer me to people who don't. \nDay 3, I get a chat-channel invite and a marketing brochure describing our bespoke pentesting methodology.   \n  \nIt reads like someone sprayed superlatives into the list of Qualys (a popular vulnerability scanner) options. With the meaningless eyewash graphics and diagrams, it's a menu from an Applebee's in Burrough's Interzone. It's horrid, banal and familiar all at once. I don't know a lot, but I don't like what I've experienced so far.    \n  \nAbout ten minutes on the group chat with the team doing the test and I'm not feeling any better. I get the scope of IPs and applications we're testing and a brief description of the process. \n  \nThe project is almost done. I'm told the scope has already been given to the various pentesters, so I was going to do the writeup along with the 'read-out' or explanatory meeting with the people at fnordco.  \n  \nI get a bunch of spreadsheets from the testers. Something's wrong. These don't read like penetration test reports- there's no description of the actions the tester did to exploit the vulnerability or what they were able to access. Instead, there are entries describing _possible_ vulnerabilities.  \n  \nIt hits me- this is just vulnerability scanner output, not an actual pen test.  \n  \nI raise hell in the group chat and get referred to Rufus, the sales rep who sold this engagement:  \n  \nme:\"I don't understand what we're selling here. Every pentest I've worked on, we actually tried to see how far we could _penetrate_ their systems.\"  \n  \nRufus:\"We're not doing this here?\"  \n  \nme:\"No. We're scanning their surface and logging _potential_ vulnerabilities. We're not validating that the systems or apps are actually exploitable. We're not attempting to get shells.\"  \n  \nRufus:\"That's what we call a tiger team exercise or special pen-test. Fnordco didn't want that. Just do what the client wants.\"  \n  \nme:\"I see we're using special vocabulary. I'll adjust expectations. Thanks.\"  \n  \nI started writing up our findings, but decided to start looking around to see if I could find something to convince fnordco that they needed to take this seriously.  \n  \nThings definitely didn't get better, but they did get more interesting...\n  \n  \n  \n",
        "created_utc": 1537159298,
        "upvote_ratio": ""
    },
    {
        "title": "TFTS Top Tales - August 2018",
        "author": "MagicBigfoot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ggune/tfts_top_tales_august_2018/",
        "text": "Hi Everybody!\n\nHere's another month of Top Tales for you to enjoy - thanks to everyone for posting &amp; commenting!\n\n ~ magicB ~\n\n###TFTS TOP TALES - August 2018\n-----\n_8/1/18_ : [s] [Are you going to tell me what's wrong or not?](http://www.reddit.com/r/talesfromtechsupport/comments/93nwyn/please_clear_your_cache_and_cookies/) _by voidkitsune_  \n_8/2/18_ : [l] [There is some reason this is not working!](http://www.reddit.com/r/talesfromtechsupport/comments/940q71/only_bad_it_tells_people_to_restart_the_computer/) _by Lester_Ren_  \n_8/3/18_ : [s] [Sorry I was away a couple of days.](http://www.reddit.com/r/talesfromtechsupport/comments/948yna/wrong_account/) _by szarbesz_  \n_8/4/18_ : [l] [The device will not power on!](http://www.reddit.com/r/talesfromtechsupport/comments/94duii/kerplunk_thats_one_way_to_solve_a_issue/) _by petes90_  \n_8/5/18_ : [l] [Let me call an interpreter.](http://www.reddit.com/r/talesfromtechsupport/comments/94sub0/gaijin_attempts_japanese_tech_support/) _by evilninjaduckie_  \n_8/6/18_ : [s] [Did I have to call them?](http://www.reddit.com/r/talesfromtechsupport/comments/950dj9/why_the_wifi_doesnt_work/) _by Silentmuto_  \n_8/7/18_ : [s] [Do you think it could be my glasses?](http://www.reddit.com/r/talesfromtechsupport/comments/95guob/what_do_you_mean_my_glasses_are_important/) _by kokoroutasan_  \n_8/8/18_ : [s] [No, nothing happens when I click it...](http://www.reddit.com/r/talesfromtechsupport/comments/95l8oq/the_right_click_button_is_the_one_on_the_right/) _by smallboy99_  \n_8/9/18_ : [s] [That's just how the software works...](http://www.reddit.com/r/talesfromtechsupport/comments/95wim5/im_really_frustrated_with_how_much_admin_work_i/) _by pinky0926_  \n_8/10/18_ : [m] [Oh, that's not good.](http://www.reddit.com/r/talesfromtechsupport/comments/9674d2/a_helicopter_what/) _by sambeaux45_  \n_8/11/18_ : [l] [No, when I shake my desk.](http://www.reddit.com/r/talesfromtechsupport/comments/969vpf/computer_reboots_when_i_shake_my_desk/) _by ericbsmith42_  \n_8/12/18_ : [m] [How close are you to land?](http://www.reddit.com/r/talesfromtechsupport/comments/96pcgw/data_rates_may_apply/) _by sambeaux45_  \n_8/13/18_ : [s] [It's just not doing anything!](http://www.reddit.com/r/talesfromtechsupport/comments/96zm0m/but_this_register_is_critical/) _by xkaosphoenix_  \n_8/14/18_ : [s] [Why won't you just help me with this?](http://www.reddit.com/r/talesfromtechsupport/comments/978o7j/lady_i_promise_you_i_cant_help_you/) _by FerengiKnuckles_  \n_8/15/18_ : [l] [I don't need to know about those...](http://www.reddit.com/r/talesfromtechsupport/comments/97jtcf/its_cisco_it_just_works/) _by podgerama_  \n_8/16/18_ : [s] [Well I need the tabs for my shopping.](http://www.reddit.com/r/talesfromtechsupport/comments/97spzy/my_computer_takes_5_minutes_to_open_an_email_so_i/) _by RedAnon94_  \n_8/17/18_ : [s] [No, now I can't see any network.](http://www.reddit.com/r/talesfromtechsupport/comments/9836fx/my_hotel_wifi/) _by MattyJPitlith_  \n_8/18/18_ : [l] [Just help me fix this!](http://www.reddit.com/r/talesfromtechsupport/comments/9894vj/and_nothing_was_ever_resolved_the_end/) _by voidkitsune_  \n_8/19/18_ : [s] [Yes. I've tried that.](http://www.reddit.com/r/talesfromtechsupport/comments/98ombf/i_cant_print_all_my_pages_at_once/) _by OfficialPiAddict_  \n_8/20/18_ : [xl] [Sure thing I'll give you a call when it's done.](http://www.reddit.com/r/talesfromtechsupport/comments/98szf2/just_a_patch/) _by AeroXbird_  \n_8/21/18_ : [s] [We will be doing this work.](http://www.reddit.com/r/talesfromtechsupport/comments/9945fe/if_you_shoot_yourself_in_the_footwere_just_going/) _by pcx226_  \n_8/22/18_ : [m] [Hi, are the college emails private?](http://www.reddit.com/r/talesfromtechsupport/comments/99f4mu/yes_anyone_can_send_an_email_including_the_kid/) _by MysteryHisyory_  \n_8/23/18_ : [s] [Okay, I really need to get working on this.](http://www.reddit.com/r/talesfromtechsupport/comments/99q1el/urgent_rush_the_system_is_down/) _by ienjoydonuts_  \n_8/24/18_ : [s] [Then fix it, that's your job.](http://www.reddit.com/r/talesfromtechsupport/comments/99xlz3/i_dont_have_time_for_error_messages/) _by floydpretz_  \n_8/25/18_ : [m] [Who can we call to do that?](http://www.reddit.com/r/talesfromtechsupport/comments/9a4eaf/please_redirect_all_inquiries_to_yourself/) _by zanfar_  \n_8/26/18_ : [s] [What’s wrong with it?](http://www.reddit.com/r/talesfromtechsupport/comments/9ajuo1/support_in_dealing_with_management/) _by TerribleMystery_  \n_8/27/18_ : [l] [This has gone on for too long.](http://www.reddit.com/r/talesfromtechsupport/comments/9as6na/i_refuse_to_work_with_you_or_do_anything_you_say/) _by QuantumDrej_  \n_8/28/18_ : [s] [Can you keep the ticket open while I check?](http://www.reddit.com/r/talesfromtechsupport/comments/9b0jwu/if_i_wish_hard_enough_the_server_will_come_back/) _by syberghost_  \n_8/29/18_ : [s] [I need it replaced again!](http://www.reddit.com/r/talesfromtechsupport/comments/9b9j3d/yes_technology_needs_electricity_to_work/) _by Delynne1_  \n_8/30/18_ : [s] [Hold on a minute there son hold on a minute...](http://www.reddit.com/r/talesfromtechsupport/comments/9bjrns/unhappy_camper_a_true_story/) _by groovypho3nix_  \n_8/31/18_ : [l] [That’s ok, I don’t need that anymore.](http://www.reddit.com/r/talesfromtechsupport/comments/9bxkg5/how_the_fbi_destroyed_my_companys_computer/) _by YouSayToStay_  \n\n-----\n\nThe full set of [TFTS Top Tales by month](https://www.reddit.com/r/talesfromtechsupport/wiki/index#wiki_the_compleat_best_of_tfts) can be found in our wiki.\n\n\n_^(All stories and quotes are copyright their original authors.  No re-use without permission.)_\n",
        "created_utc": 1537154358,
        "upvote_ratio": ""
    },
    {
        "title": "My Iphone was grabbed and smashed during an assault- Any hope of recovery of video showing assailant?",
        "author": "BrokenIPhoneQuestion",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9gcgsr/my_iphone_was_grabbed_and_smashed_during_an/",
        "text": "[removed]",
        "created_utc": 1537119623,
        "upvote_ratio": ""
    },
    {
        "title": "\"I have a github account, how can I see my crypto address?\"",
        "author": "ICTman1076",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9gbx5v/i_have_a_github_account_how_can_i_see_my_crypto/",
        "text": "[removed]",
        "created_utc": 1537115586,
        "upvote_ratio": ""
    },
    {
        "title": "When a PC’s security blocks an installation and it’s our fault",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9gaife/when_a_pcs_security_blocks_an_installation_and/",
        "text": "[removed]",
        "created_utc": 1537104258,
        "upvote_ratio": ""
    },
    {
        "title": "Wait I need to save my icons!",
        "author": "blueblood724",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9g88c2/wait_i_need_to_save_my_icons/",
        "text": "Hello again and welcome to another tale of ~~user~~ tech incompetency!\n\nRecently I was \"promoted\" to asset management at $MSP which means I no longer have to deal with end users (Yay) but I'm responsible for all hardware repairs and computer issues with our agents. Normally, this shouldn't be a problem. You might say to yourself \"Well golly gee these people are tech support agents, they should be able to handle things themselves\", and that is where my dear reader, you would be wrong.\n\nMy desk provides technical assistance for $GovOrg and during the end of summer/beginning of fall we have a very high call volume and as such, we hire about 60 temps to help handle the case-load. Now while I have tons of stories to post about these \"techs\" there is on in particular that regularly gets on my last nerve. We will call her $temp. So without further ado...\n\n**$temp is having an issue with her monitor and it needs to be replaced so she sends me an email and after a very large gulp of my coffee I reply and let her know I will be right over.**\n\n*I walk over to her desk with replacement monitor in tow*\n\n&gt;$Me: Hey I'm here to replace your monitor.\n\n&gt;$Temp: Oh good! How do we transfer my stuff?\n\n&gt;$Me:..... I just replace the monitor.... What do you mean by transfer?\n\n&gt;Temp: You know, my buttons! I need them to work.\n\n*We go back and forth a couple times until I realize she thinks her icons and wallpaper are stored on the monitor somehow...*\n\n&gt;$Me: *trying to keep a straight face* Erm you don't need to worry about that. All of your data is stored on your computer, not your monitor.\n\n&gt;$Temp: So I won't lose my buttons?\n\n&gt;$Me: No, you won't lose your buttons...\n\nHey at least this is job security right?",
        "created_utc": 1537075480,
        "upvote_ratio": ""
    },
    {
        "title": "The old cliche...",
        "author": "gargravarr2112",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9g57rw/the_old_cliche/",
        "text": "Family support issue this time.\n\nMy grandmother lives alone, and my father, uncle and myself are all at least 2 hours from her due to job commitments (my dad is in another country), so she has no immediate family within easy reach. She's also scared of technology and only keeps in touch by phone. I visit every 2 weeks; my uncle, substantially less often.\n\nAbout a week after my last visit, I get a call from her, asking if I had phoned her - it turns out, her cordless phone has stopped working, and it takes her so long to get to her secondary wall-mounted phone that she misses the calls now. Okay, the cordless phone was a cheap one, several years old, maybe it has given up. I tell her I'll look at replacing it when I'm next here.\n\nFast forward to today, and after many worried text messages from my uncle and father about the inability to reach her (she's elderly, after all), I'm here and take a look at her phone. It's by her bed since it's the only place in the house where there's a phone AND power socket together. This would also happen to be where the router is (I convinced her to get an internet connection to Skype with my dad, but she won't have a tablet of her own, so it falls to me to bring a computer to do that). I look at the base station and the lights are dark. Can't be that simple, surely...?\n\nPull the plug out, push back firmly into the socket...\n\nBeeeeeeeep.\n\nPhone starts up and begins to charge.\n\nI mention the router because it then occurs to me - I was up here last weekend grabbing the little NAS I keep here for an offsite backup. In the process, it seems I must've nudged the power lead for the phone. Oops.\n\nTL;DR - I manage to cause several family members undue worry and stress due to slightly unplugging a cordless telephone base while tinkering with my own tech.",
        "created_utc": 1537047578,
        "upvote_ratio": ""
    },
    {
        "title": "On Data Recovery: Filenames Scroll By",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9g546n/on_data_recovery_filenames_scroll_by/",
        "text": "[removed]",
        "created_utc": 1537046724,
        "upvote_ratio": ""
    },
    {
        "title": "Cigaretter doesn't see clearly",
        "author": "EkriirkE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9g4oo0/cigaretter_doesnt_see_clearly/",
        "text": "Back when I was a TV repair tech (\"Field Service Engineer\") when CRT and projection was still king, one of my calls was \"tv dead\" on a rear-projection LCD set, 90% it's just the lamp so I make sure I have the right one in my van.  Note:  I did legit component-level diagnosis and repair right there in the home, so these calls are usually a good breather.  \n\nI roll into a mobile home community and park next to a double-wide.  A raspy old woman greets me and shows me the set.  She leaves to gab on the phone in the other room and her husband is there sitting on the couch wearing nothing but shorts and watching me.   \n\nI plop down in front of the set and go straight for the bulb, see it has popped and put in a new one while cleaning the lens &amp; mirror as well.  I fire it up and show it's working and get her signature for work - it's a warranty call so this is all free, and we don't get paid unless the customer acknowledges a fix.   \n\nShe stops and says \"The picture is blurry!\".  I explain that while she has a large screen TV (~60\"?) it is getting its signals from an antenna and is all standard definition, so it's stretching the low quality image to fill the screen showcasing how poor the images are.  She's not buying it and tells me to look at the other TV in the next room which has a perfect picture...  It's a ~13\" CRT.  I try again to explain how blowing up small pictures results in a large blurry picture but she's still not buying it and is insisting I broke something and wants me to fix it while proceeding to light up.   \n\nI say there is nothing I can do and she goes on a tirade so I threaten to take the working bulb back and leave then finish with \"Ma'am, I think all those cigarettes you've been smoking are clouding your vision.\"   \nAt this her husband who has been sitting there quietly the whole time lets out a belly laugh.  I get him to sign and go on my way.  \nI hear her dialling the phone and start bitching to a friend as I'm outside packing up.",
        "created_utc": 1537043277,
        "upvote_ratio": ""
    },
    {
        "title": "A Possible Light at the End of the Tunnel",
        "author": "Voxmanns",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fym0y/a_possible_light_at_the_end_of_the_tunnel/",
        "text": "I feel obligated to share this as I have shared various other gripes about being the Salesforce admin for my employer. This subreddit has kept me sane through it so I have to share as the story develops.\n\n&amp;#x200B;\n\nThe owner and I have always been at odds. Between early recalls, poor supervision, and general ego problems, it's just not great. Some other teammates have shared in my sentiments, particularly about his ego. This past week added a new one to the list: Micromanagement.  \n\n\nHe and I started a project to get Google Drive (which hosts all of our files) cleaned, organized, and integrated with Salesforce for easy access. I proposed the initiative, he essentially ignored it and after a couple weeks of persisting he said we'd do it together. He'd handle Google Drive and training docs, I'd handle Salesforce and automation. Sounds great! No toes to step on, specialties match accountability, awesome.\n\n&amp;#x200B;\n\nSo I thought.\n\n&amp;#x200B;\n\nIn order to safely set up automation between the two platforms I had to ensure that accounts (particularly account types) were set up properly. At the time, Sales had an issue with improperly marked accounts that we had to clean up. So, I got with the sales leader, cleaned them up, and sent the owner an update saying that the account types were set up, I had some reorganizing to do in the back end, new validation rules, and a mass update to reflect the changes. I told him I planned to do it over the weekend during off hours so that I can lock down the org and have time to fix and break and refix things as needed.\n\n&amp;#x200B;\n\nHis response, simplified, was this:\n\n&amp;#x200B;\n\nWe have 1 team member working in Salesforce so we can't lock it down. Period.\n\nHe wants to oversee the \"change sets\" and \"deployment\" but has a very, very elementary understanding of the system's functionality (forget about being a functional admin, let alone overseeing any involved admin task)\n\nHe wanted to be clear that the validation rule (only one?) validated the data correctly...He basically just defined validation rules as a reassured check for my task. Dumbed it down further than it needed by a lot.\n\nHe thinks a totally unrelated part of our backend (a specific temporary account I set up to organize unfiled records in a specific way) can now be deleted because his assumed use of it is no longer needed. Totally unaware that it's deeply integrated and keeps things organized as we continue to build out key functionality of the system.\n\n&amp;#x200B;\n\nWhat really got me was his note \"let me know how this affects your workflow and what we can do to get through it\". Not realizing this totally shatters the work flow I had laid out. By the way, we need this done ASAP. Our org is so far behind because adoption has been so slow because of his constant flexing of right to supervise and overrule amongst a team who has never used SF before.  \n\n\nBonus points  \n\n\nHe shot down an initiative this week (same week) because he felt there were far more cons to having an admin who he pays a half of value salary to build and maintain the org than buying another platform for project management (as in SF integrating not actually a part of SF)\n\nHe is guilty of what I can only describe as \"impulse platform buying\". We have over 10 different platforms company wide for communication, meeting, HR, it's horrible. We are a team of 12 people. We have more platforms than people!\n\nHe insists on maintaining accountability for Salesforce so that he can supervise and ensure that \"nothing breaks\" but he's not built a single flow, done a single Trail, and has no intention of even aiming for the admin certificate.\n\n&amp;#x200B;\n\n...However\n\n&amp;#x200B;\n\nMy manager, and another manager, call them the 2nd in command beneath the owners. They are starting to see the benefits of Salesforce, especially with a dedicated admin, and they agreed to start some conversation about getting me full accountability for it. That means that I would be able to manage the org as I should and essentially they don't care as long as it works. My boss is very sternly stating that this must be done for the sake of honesty (I am still labelled Assistant Account Executive which is a total lie. I spend less than 10% of my time assisting account execs.) and they are sick of all the inefficiencies and see that nothing is getting fixed fast enough because of these hinderances.\n\n&amp;#x200B;\n\nIt's taken me every bit of 2 years to build my case for this and the change seems to finally be coming. I've got my cert exam scheduled and have been passing FocusonForce and Trailhead material very consistently. It's all coming together. Or will crash and burn. Who knows! Regardless, big thank you for all the eye rolling, head-desk scarred IT people out there. Having this subreddit for venting and a good laugh has made the struggle a lot more bearable. You guys rock!",
        "created_utc": 1536983959,
        "upvote_ratio": ""
    },
    {
        "title": "[short one] you haven't had WHAT?",
        "author": "Note2scott",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fwnr8/short_one_you_havent_had_what/",
        "text": "[removed]",
        "created_utc": 1536965722,
        "upvote_ratio": ""
    },
    {
        "title": "The Enigmatic Prompt",
        "author": "ColdFury96",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fvvxw/the_enigmatic_prompt/",
        "text": "I work for a medium sized company with multiple locations across the country, and we recently refreshed our external facing employee portal for the first time in over a decade.  \n\nThis has caused some consternation.\n\n*We join this call in process.  A simple 'User can't get into site', where our hero has verified the identity of the caller and is resetting their password.*\n\n&gt;Me: Okay, the password has been changed to Generic09, with a capital G.  It'll ask you to put in a new password when you sign in.\n\n&gt;Caller: I'm already there?\n\n&gt;Me: Pardon?\n\n&gt;Caller: It's asking me for the new password.  I signed into it before I called you, and it just says \"New Password.\"\n\n&gt;Me: Oh... alright.  You probably need to start over since I reset your password, but you're already where we want you to be, what problem are you having?\n\n&gt;Caller: What do I put in?\n\n&gt;Me: .... A new password?\n\n&gt;Caller: Oooooh.",
        "created_utc": 1536959583,
        "upvote_ratio": ""
    },
    {
        "title": "Greens Support -- Where is the Click Key",
        "author": "GreenSwivel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fvl06/greens_support_where_is_the_click_key/",
        "text": "**Background**\n\nThis is my first time posting here, and this story actually happened the other day, however I will be going back to the beginning of when I worked here over time, as long as people want me to. This story, although no where near the best, is a good start to a particular reoccurring character dubbed $GreatListener. I am a B.S. in Computer Programming (sort of ComSci; however, no theory and all application based) and a B.S. in Information Technology in my third year.\n\n* $me -- At this point in my career I am Team Lead (Dubbed \"Expert\") for all online learning support as well as the College of Doctoral Studies learning support for the entire $university. Under me is everyone who supports classes online or CDS students, as well as 1900 of the 3400 campus volunteers.\n* $university -- A university in midwest United States that has been growing like crazy; about 90k students in total, 25k on ground and around 70k online. Provides those in my department a program known as **Zoom**, which is a screen sharing program that we give students an ID number and then we can see their screen and annotate over it.\n* $GreatListener -- The student we are on the phone with in todays tale. This student has quotes of things such as \"the correct answer is not always the best answer\", \"How do I turn off my computer?\" (which pairs nicely with the next),\"I'm head of IT training at (name removed) Hospital, I know what I'm doing\", \"I have 40 dogs I think I can handle the difference between left and right click\" (yet was always clicking right when telling to click left) and so on. We will get into all these tales later.\n* $Lara -- Good friend at work, who helped train me but I got promoted past ? Only person on team who has been with the team longer than me\n* $WM -- Wonderful Manager, a lady who is *totally* helpful and *totally* understands my job and *totally* appreciates the work we do.\n\n**Story**\n\nSitting down at my chair, knowing whats about to go down with $GreatListener as the next person I have to call in my list for today. It's been two months. A break, finally. But she's back. Oh no, she's back. *Oh no! She's back!!!* Let's just get this hour long session over with. Its a 100 level course for IT, so can't be that bad, right?\n\n&amp;#x200B;\n\n$**me** Hello is this $GreatListener?\n\n**$GreatListener** Oh thank you so much for calling so I have this assignment to d\n\n(cuts her off)\n\n**$me** Before we get into the course, can I verify the information that $university has on file\n\n\\-------\n\n(Under a law known as FERPA, I have to verify several pieces of information with the student every time I talk to them)\n\n\\-------\n\n**$GreatListener** Oh yeah, here you go, it's this this and that. Anyways, I need to set up a print server on my \\[Windows 2012\\] Server \\[VM\\]. How do I do that?\n\n**$me** I can definitely help with that, can you just open your VMWare Workstation?\n\n\\-----\n\nI then proceed to draw an arrow on their screen to the VMWare icon)\n\n\\------\n\n**$GreatListener** Oh yeah, sure.\n\n**$me** Oh, I see you only have one copy of VMWare Workstation inside of VMWare. Lets set up a second one. Click on the \"Add new Virtual Machine Button\", select the Windows ISO, and hit next. Oh, it needs your product key. Do you have that still?\n\n**$GreatListener** No, I don't. I never had one. I don't need one.\n\n**$me** You actually do need one, and used it when you set up your 2012 VM the first time. $university provides them for free through Microsoft Imagine. Can you pull that back up?\n\n**$GreatListener** I don't know what that is?\n\n**$me** Okay, go to your student portal, and click the link for the success center.\n\n\\------\n\nThe link, by the way, opens up a page with resources for all colleges in $university, and then I navigate them to a button that downloads a word document with a link to Microsoft imagine.\n\n\\-------\n\n**$me** Okay, and see that link there in the Word document? Go ahead and open it?\n\n**$GreatListener** I'm clicking it and it's not working\n\n**$me** See how when your mouse is over it, it says to press control and click to follow the link? Go ahead and do that?\n\n**$GreatListener** I see the control key but not the click key\n\n**$me** No, please left click with your mouse\n\n**$GreatListener** But it says +Click, that means to press a button.\n\n**$me** Please click with the left side of your mouse while holding control.\n\n**$GreatListener** No, it says Ctrl+Click.\n\n\\------\n\nWe go back and forth for five minutes\n\n\\------\n\n**$GreatListener** Ooooh! I know!! Mouse Click!!! Left or Right?\n\n**$me** Left\n\n**$GreatListener** I'm going to right. See if that works.\n\n\\---------\n\nI hit mute, and sit there on my phone for a few more minutes when $WM walks over.\n\n\\---------\n\n**$WM** Hey **$me**, are you on a session right now?**$me** Yes, I am. Why, you need something?\n\n**$WM** Yes actually, I heard your speech in the arena for 600 of your 1900 volunteers throughout the year was pretty short. Why didn't you personalize with them more?\n\n**$me** Oh, well their students just like me. I wouldn't care if I was them. They just have to volunteer less than 50 hours and get approximately 33% of their tuition in one scholarship. There was also free food once I let them go. They weren't going to listen anyways. I told them that they receive training their first day and they're good to go so to go get food.\n\n**$WM** But I asked you to personalize with them\n\n**$me** Oh, you did that when you took 10 minutes for your section. Like we discussed in between our sections, they don't care about that stuff and you already talked about it, and you thanked me for my opinion on them not caring them just wanting the volunteer hours towards their scholarship\n\n**$WM** Together we'll make a good presentation team! (Very condescendingly said)\n\n\\-------\n\n**$GreatListener** Hey, I think I got the link followed.\n\n**$me** Wonderful, know navigate to your purchases page by following my arrows and clicking on the spots. Okay, I see you downloaded several versions. A regular version and a data center version. Since our ISO is the regular version, lets use the product key for the regular version.\n\n**$GreatListener** No, I want to use the Data Center key, it's above the regular.\n\n**$me** Oh, well you can try that on your own time, but looking at the time it is the end of our session, so your next session later tonight will be able to help you from here. Thank you, and have a good day.",
        "created_utc": 1536957376,
        "upvote_ratio": ""
    },
    {
        "title": "My Wi-Fi doesn't work when I go to bed...",
        "author": "BaboonsBottom",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fuy0s/my_wifi_doesnt_work_when_i_go_to_bed/",
        "text": "Ok, so I'm a cable tech, ex-IT (the worst kind), but on occasion I get some really strange call outs that make me question how people manage to function or even breathe.\n\nThese were my first 3 visits for the day only a few days ago.\n\nFirst call out, set top box wasn't responding to the remote, hasn't for weeks, diagnosis: No batteries in remote.\n\nSecond call out, expected to fix a fault affecting everyone's set tops in the area despite being told 3 times by the call centre that we're still waiting on a fix and a tech cannot fix it... \"Maybe it's just my box?\".\n\nThird call out, the best one yet,\n\nCs \"My Wi-Fi keeps going off, it's done so ever since you guys installed it\"\n\nMe \"Ok, is that on all devices or just 1?\"\n\nCs \"I only have one, my iPad, you know I'm paying a lot for this service, I expect it to work all the time, the guy on the phone said the box [modem] could be faulty, he sees it all the time\"\n\nMe \"Did you notice what the lights on the modem are doing when the Wi-Fi goes off?\"\n\nCs \"No, how am I expected to know what they're doing?\"\n\nMe \"The modem is visible from your sofa, the lights would normally change colour if the device is experiencing a fault\"\n\nCs \"Yeah I can't see them from bed smart arse!\"\n\nMe \"Oh, so does the Wi-Fi only drop off when you go to bed?\" - Thinking Wi-Fi range issue\n\nCs \"Yes, I take my iPad off charge, switch everything off and go to bed, it [iPad] comes up saying cannot connect in my games\"\n\nMe \"You switch everything off? Including the modem?\"\n\nCs \"Yes, the Fire Brigade always told me to switch all the plugs off before bed\"\n\nMe \"Okay, so the modem needs to have power for you Wi-Fi to work...\"\n\nCs \"So I'm expected to leave it on just to play my game?\"\n\nMe \"Yes\"\n\nCs \"That's bloody ridiculous, if you can't fix it, you may as well just take it out, I'm going to go with someone else\"\n\nFollowing a conversation about the same problem would happen with any provider, I managed to settle her on the idea of the modem being on it's own socket so she could switch off everything but that and still play her iPad internet required jigsaw puzzle in bed. She still wasn't happy.\n\nPs. If the formatting is wack, I'm on mobile :)\nPps. This is my first submission, I hope it meets the rules and apologies if I've missed anything on the post (like flairs and such).",
        "created_utc": 1536952791,
        "upvote_ratio": ""
    },
    {
        "title": "Fastest ticket I've ever closed",
        "author": "jonahst10",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fuwoc/fastest_ticket_ive_ever_closed/",
        "text": "[removed]",
        "created_utc": 1536952539,
        "upvote_ratio": ""
    },
    {
        "title": "My first ISO Audit as an Auditor... Is this machine backed up? Oh yeah the tapes are right here... next to the machine",
        "author": "JustAnOldITGuy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fum9e/my_first_iso_audit_as_an_auditor_is_this_machine/",
        "text": "Over the years I got to participate in a number of initiatives. We got into the ISO Certification process some years back and at the end of the training you have to do an ISO audit. At this time I was still in the business but not in IT.\n\nI am auditing the processes in our color lab. We are in a big small town in that you generally know almost everyone or at least have some common friends or relatives with about everyone you work with. So we get along pretty well and are polite to each other. We go through the ISO audit and everything is in order. She has documented procedures and evidence that they are followed. \n\nBut as we are doing the audit one of the pieces of equipment sticks out to me. We have a Colorimeter attached to a PC Workstation. They are in the open in this lab and according to our discussion the records from this machine are where the value lies in this operation.\n\nI go through my audit protocol and this is outside of the protocol. I ask the lab technician (#LT) about how this machine is backed up.\n\n\\#LT - We use a tape backup.\n\n\\#ME - Where are they kept?\n\n\\#LT - Oh we keep them right here. (Pointing at a cabinet next to the PC)\n\n\\#ME - (looking up at a sprinkler head for our fire suppression system) So if we had a fire and this went off wouldn't the PC and all the tapes be damaged?\n\n\\#LT - I guess so.\n\n\\#ME - So if we didn't have these what would happen?\n\n\\#LT - We wouldn't be able to color match any of the parts we have made in the last ten years to support our spare sales. Is this an audit finding?\n\n\\#ME - Actually no, this is outside of the scope of our audit procedure. I do however strongly recommend that at a minimum we put backup copies of the tapes in another building at least. Also do you have the software and drive model for the tape machine?\n\n\\#LT - I think so let me look. (Opens drawer to cabinet full of tapes) Yes here it is.\n\n\\#ME - So basically all of our eggs are in this one basket then?\n\n\\#LT - Yes I see your point.\n\n\\#ME - OK I am going to talk to the audit supervisor and see what she says. Again this is not a finding and you are not in trouble but I think we should address this as a critical risk.\n\nSo I go back to the audit supervisor and go through my whole report. At the end we discuss this and she tells me that this is not currently part of the ISO standard but will be within the next year and thanks me for the catch.\n\nUnfortunately my boss who volunteered us as ISO auditors thought we were being trained as the Gestaopo. We had an incident on our loading dock and parts bypassed the inspection process into production. Quality Control caught them and brought them back but he wanted us to do a snap inspection to find where the process failed so he could get someone written up and possibly fired. When we explained to him this in not how ISO works he went ballistic. Called the ISO director who confirmed what we said. We were then ordered off of the ISO team. He ended up running the ISO director off and that ended my brief career as an ISO Auditor.",
        "created_utc": 1536950522,
        "upvote_ratio": ""
    },
    {
        "title": "I was told y'all might enjoy this Berry.",
        "author": "mekio_san",
        "url": "https://www.reddit.com/r/ProRevenge/comments/9fsqyh/do_you_know_what_chuck_barry_said_ever_night/",
        "text": "",
        "created_utc": 1536945263,
        "upvote_ratio": ""
    },
    {
        "title": "My email hasn't worked for a month",
        "author": "Xyrack",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ft3n7/my_email_hasnt_worked_for_a_month/",
        "text": "Just got a phone call that frustrated me.\n\n\nCaller - \"Hello, my email hasn't been working since mid August. I can get it on my phone but not on my computer\"\n\n\nAlright, you haven't had email access on your computer for a month and you are calling IT now... whatever that's your problem not mine. If it works on her phone then there probably isn't an issue with her account. If it's not the account then I would bet money she either is logging in incorrectly or is using the wrong password. \n\n\nM - \"Can you please tell me the company ID tag of your computer so I can remote in and assist you.\"\n\n\nC - \"Oh, I'm not on a computer and won't have access to one till 1pm\"\n\n\nWell I gotta say that not being at a computer is the leading cause of not being able to login to your email at a computer.\n\n",
        "created_utc": 1536939910,
        "upvote_ratio": ""
    },
    {
        "title": "So... About that server",
        "author": "EnigmaticAussie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ft0jc/so_about_that_server/",
        "text": "Happened today.\n\nA little shook about it actually.\n\nI run a small business IT support company. Generally the clients we encounter are transitioning from working on a sole laptop/desktop and into the server/multiple PC space.\n\nThe encounter I'm about to retail is about a client - $C, who we've had a few dealings with in the past, but only ever about their desktop machines. Never their... \\*server\\*.\n\nI might add here that $Client\\_company is a Wedding/Event Planner/Stylist, and all their previous work (from the last 10 years), including photos and advertising material is \\*\\*all\\*\\* stored on the \\*server\\*.\n\n&amp;#x200B;\n\nCue, yesterday, around close of business hours.\n\n\\*phone rings\\*\n\n$E - &lt;standard phone greeting&gt; How can I help?\n\n$C - Hi $E, I can't seem to access the files I have on my $server. It says I don't can't reach the shared drive.\n\n&lt;Snip&gt; standard procedure - have you turned it off and on again &lt;/snip&gt;\n\nNothing seems to work.\n\n$E - I'm closing up for the day, do you mind if I pop in tomorrow morning?\n\n$C - Sure thing, I'm in no rush.\n\n&amp;#x200B;\n\nFast Forward to when I arrive on site today, just before lunch, the prearranged time for meeting.\n\n$C - Hi! Great to see you. You know where to look, just let me know what you find.\n\n$E - Sure thing. Let me get to it.\n\nI sit down at $C's PC. I try to access the shared drive and confirm that it is inaccessible. Swivelling on the the comfy chair I notice that their \\*server\\* is on the floor... Under the desk... As is the monitor...\n\n\\*Ok. No problem... Just get down there and have a bo...\\*\n\n\\*\\*Oh shit.\\*\\* That's the BIOS screen.\n\n\\*Hmm\\*After restarting the machine and getting back into $Doors I notice that a few of the icons in the taskbar are missing, as well as the machine is running, in my opinion, a little sluggish. Also, the date is wrong... like 2005 wrong. I quickly ammend that, and scurry into the event viewer.\n\n3 Days ago the machine shut itself down. Between 5 and 3 days ago, countless \\`trying to access nonpaged pool\\` errors are found until the machine finally spit the dummy.I advise $C of what is happening and set about to make sure that their current data is still ok, and that it is now accessible from the desktop PC - all seems ok.\n\n&amp;#x200B;\n\nAs I'm leaving, I mention that I've a few \\*\\*hesitations\\*\\* about their current \\*server\\*. One of them being that it is running $Doors\\_Home\\_Premium\\_7. The other that there is no backup that I can see.\n\n$C - Oh, we used to have a backup.\n\n$E - What happened to it?\n\n$C - Well, our last premise got broken into and the backup drive was stolen and we never replaced it.\n\n$E - So... If this machine was to disappear in a poof of smoke would you be able to rebuild you business?\n\n$C - Uh... Well... Everything is on that machi... Oh.\n\n\\&gt;Cue dramatic music.\n\n&amp;#x200B;\n\ntl;dr: Client has been running a $door\\_home\\_premium\\_7 \\*server\\* for the last 8 years without a backup for the last 5. Machine is limping towards it's death. No backups are in place. Quotes are now in the pipeline.",
        "created_utc": 1536939337,
        "upvote_ratio": ""
    },
    {
        "title": "A senior's approach to technology",
        "author": "honeyfixit",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fs4c3/a_seniors_approach_to_technology/",
        "text": "[removed]",
        "created_utc": 1536932727,
        "upvote_ratio": ""
    },
    {
        "title": "Another day of family tech support",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9frtkb/another_day_of_family_tech_support/",
        "text": "[removed]",
        "created_utc": 1536930271,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure it's plugged in?",
        "author": "J3ll1ng",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fnshu/are_you_sure_its_plugged_in/",
        "text": "Yesterday evening I had a client bring me a laptop that was \"Dead\". They thought maybe the socket you plug the charger into was broken because the plug was really loose. A little while later I get the laptop to have a look and sure enough it won't power up. Plug in the charger and when I plugged it into the laptop sure enough it is a little loose but the charging light is lit up no matter how much I wiggle it so it has good connection. Laptop charges right up and powers up fine. \n\n&amp;#x200B;\n\nThe next day I explain to my client that there is nothing wrong with it and everything was working fine. I told her that when she plugs the charger into the surge strip to make sure the blue light on the charger comes on. I called around noon to check on the laptop and was told everything was working great. I mark it down to being either a switched off or unplugged power strip.\n\nAround 4:30 this afternoon the client calls me saying the laptop is dead again. I ask if the blue light is lit on the charger and if the charging light above where the power cord plugs in is lit on the laptop. I hear \"Yes... wait?...what?... oops!, Oh Shit, sorry! Love you honey, Bye. And I get hung up on. I call the client back and and am like WTF? Turns out they had the power cord plugged into the audio plug. \n\nAnd the love you honey comment? Yeah my client is also my wife she is usually smarter than this.",
        "created_utc": 1536888062,
        "upvote_ratio": ""
    },
    {
        "title": "In Dev land, noone can hear you scream...",
        "author": "HeadacheCentral",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fnpib/in_dev_land_noone_can_hear_you_scream/",
        "text": "Or : That time when the scream test **didn't** work\n\nPreface : I'm the head of IT for a medium business. My staff consists of exactly two people - me and one minion - to handle some 1200 staff and contractors spread around the world. I do pretty much everything except write code - they pay squirrels to do that.\n\nMy VMWare environment was getting - tight on resources. A plethora of recent requests for VM's for various purposes had left things in a mess, and I'd had enough of it.\n\nI decided to do some clean out. I **knew** exactly which guests were production - so I didn't touch those - but dev machines...oh, those Dev machines!\n\nHow do I know? We've got a pretty nifty naming scheme for VM guests. It's basically city-site-shortfunction-purpose\n\nSo a production machine might look like\n\nblah-headofc-adfs-p01\n\nWhich would tell me this server is located in Blah, at head office, and is the first ADFS server in the farm.\n\nDev servers are created with the extension \"d01\" or just \"dev\".\n\nSo I traipse merrily through the server farm most at risk of resource exhaustion, find some Dev servers I know are in use (current product, under active development), some I was pretty sure were in use (previous product, still in support), and some where I just went 'Whiskey. Tango. Foxtrot?\"\n\nSo I shutdown a few of the WTF servers for a [Scream test](https://www.urbandictionary.com/define.php?term=scream%20test) to see is I could get rid of them. Short term gain in resource availability - I got quite a bit of CPU and memory resources back on the farm, and all was right in the world.\n\nFast forward three weeks. I have heard not one scream along the lines of \"Headache, you useless mongrel, why is XXX app not working anymore?\", so I go ahead and prepare for physically deleting these machines.\n\nNow, I'm a paranoid old fella, so I made sure I backed up the machines completely before I deleted them from the VMware system. Rule number 1, right?\n\nFast forward **another** 4 weeks (7 weeks total from shutdown), and I get an email\n\n\"Hey Headache, $APP server is not responding anymore. Can you have a look at it?\"\n\nI've got **no** record of any such app. Never heard of it, never seen it.\n\nDo a little digging into DNS and other records, and find there *is* a CNAME for this app in the corporate DNS - pointing to an host record for an IP which doesn't exist.\n\nSomething about the hostname rings a bell...Hmmm, where have I seen this before?\n\nblah-headofc-randomname-d01\n\nIf you're following along, dear reader, and guessed that this was one of the servers I deleted - have a gold star.\n\nDig a bit more, and find out that $APP was written by a previously employed dev who was not only mostly useless, he was also somewhat of a hot dog - he'd requested this dev server for something completely else entirely, and just chucked this app onto it while he was at it - **and** then gone ahead and told corporate they could move it **into fscking production** from the dev server.\n\nWhat happened to the scream test, I hear you ask?\n\nTurns out this app is **only** used by maybe three people - and only once or twice every couple of months. They hadn't used it for the entire 7 weeks - so never noticed.\n\nLucky for me, I was able to restore the server **and** get the app moved onto a server which was actually flagged production and more suited for it - but only because of my belt and braces attitude to nuking servers from orbit.\n\nAnd that, boys and girls, is how I learned all Devs are bastards. :-)\n\nTL;DR Dev with a penchant for hot dogs moved uncooked wiener onto bun for sale, resulting in stomach aches for all concerned.",
        "created_utc": 1536887373,
        "upvote_ratio": ""
    },
    {
        "title": "\"This area is extremely dangerous! I'm going to report you!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fnkef/this_area_is_extremely_dangerous_im_going_to/",
        "text": "[deleted]",
        "created_utc": 1536886201,
        "upvote_ratio": ""
    },
    {
        "title": "Is it plugged in? Is it turned on?",
        "author": "waka_flocculonodular",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fn6uh/is_it_plugged_in_is_it_turned_on/",
        "text": "Happy Thursday. This just happened. I am in IT but also help the engineering infrastructure team with hardware stuff. (We’re a “small” company). \n\n`Dev 1` and `Dev 2` are on the infrastructure team.\n\n`Dev 1`: \n&gt;Hey, did we move any servers today? Servers 1, 2, 3, 4 are unreachable.  \n\n`Me`: \n&gt;Dude, 1 and 2 are placeholder IP addresses and aren’t attached to anything. 3 and 4 are in X server room. \n\n\n`Dev 1`: \n&gt;I’ll check them after this meeting, they’re powered on (lie), it’s most likely the network.  \n\n`Dev 2` (who is also the on-call): \n&gt;Hey, server 3 and server 4 lost network connection, we can’t even access IPMI. `Dev 1` is filing a ticket to [ticketing system].  \n\n`Me`: \n&gt;Did we take a physical look? (You’re the on-call, after all….) I’ll check now.\n\nWent down, and by golly, the power cords were _slightly_ jiggled loose from the PDU. \n\n`Me`: \n&gt;Guys, it was a power cord issue. \n\n`Dev 2`: \n&gt;Cool\n\nA simple check by the on-call person would have helped. C'mon y'all! \n",
        "created_utc": 1536883059,
        "upvote_ratio": ""
    },
    {
        "title": "Should've reported an issue",
        "author": "herites",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9flftj/shouldve_reported_an_issue/",
        "text": "[removed]",
        "created_utc": 1536869711,
        "upvote_ratio": ""
    },
    {
        "title": "Breaking the Silence",
        "author": "YouSayToStay",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fkm99/breaking_the_silence/",
        "text": "**WARNING**: I’m a blowhard so everything I write is long. TL;DR at the end!\n\nAnother story from my last gig, which had me doing all kinds of different tasks. As is the mantle of tech support, we were assigned “anything to do with electronics”. So came my responsibilities at our new “State of the Art” training facility. \n\nOur global organization flew people in from Europe, Australia, and all-over North America to make sure they have the knowledge on how to do their jobs, as well as trading “best practices” from site to site. Educators are paid for by the company and run different classes week to week. A chef is dedicated to the site to cook breakfast and lunch to make sure the “learners” don’t have to leave and miss any of the material. To say that the electronics running the classes failing would cost the company massive amounts of money is an understatement. \n\nThere are multiple classrooms that have “mirrored” equipment so if you know how to run one room, you can run them all. Everything has been configured/installed by a third party vendor in this dedicated property that opened less than a year ago. The vendor is contracted for support and (to their credit) is usually there same-day when I contact them for help outside of our capabilities (usually because something needs to be adjusted on their end). The kicker is that we start classes before they open for the day, so if it’s broken first thing in the morning it’s on me to fix it fast, or find a work-around.\n\nBecause of this, my morning ritual for days with classes was to start up each room, run all updates for the machines (including codecs in case an outside speaker decided to use something fancy) and get presentations loaded, all starting about an hour before classes began. I made sure to test everything because the lecturers held the fun combo of being incredibly picky as well as tech illiterate (minus a few exceptions) and generally things were easy enough. I got things situated more efficiently than my predecessor so I had a build-up of good will among the staff there.\n\nOur tale begins one fateful day when every classroom was booked. Generally, there was one or two left open for emergency, but some organizational events had caused some training needs to shift and we had a full house. Everything was going smoothly until I reached the final classroom. Everything booted up fine, updates ran smooth, but when I attempted to adjust the volume I got…silence. I verified the audio source was correct, made sure both the PC and the wall control were turned up, rebooted the A/V system, but still nothing.\n\nOff to the system rack I went to try a good ol’ fashioned hard reboot on the amplifier (powers the speakers and decides what sound goes to which speakers for any non-techs that may be reading). However, upon reaching the rack I see red on the front display and an error message I’m unfamiliar with. I hit up my best friend Google to find that the error means the unit (again, less than a year old) is toast. Can only be repaired by sending it back in to the manufacturer. And of course we don’t have “stand by” equipment because budgets and IT don’t mix.\n\nTime to throw a Hail Mary. With fingers and toes crossed I find the presenter and pray that there are no videos to their presentation. Of course, if that was the case this story wouldn’t exist, and their presentation was almost exclusively videos and interviews of top Executives and leaders throughout the company. Fantastic. Time to set up Plan B, which is a portable pair of Bose speakers (bookshelf-sized) that hook in via RCA-to-3.5mm audio cable. We generally use them when we have a travelling class, but they’re checked in with my inventory at the moment!\n\nI run and grab the tote with the speakers and begin setting them up…only to realize that whoever used them last lost the speaker wire that connects the two speakers together. Speaker wire is definitely not one of the things I keep around. I plug in the first speaker and verify it at least works (success!) and start to play the video. It’s pretty much silence…all of the audio is recorded in stereo and going to the other (disconnected) speaker. I try to go into the audio settings and change it to Mono, but everything is locked out and Mono isn’t an option. Fan-freaking-tastic. I already ran all updates so I know there isn’t anything to do there.\n\nAt this point I’m desperate to get everyone’s eyes off of me and I head back to my inventory room in search of ANYTHING that might work. I’m basically scanning the room, half looking for speaker wire to magically appear, half contemplating my impending doom (because even though this isn’t my fault, the blame has to fall somewhere) when I notice a pair of wire strippers on my bench next to a box of Ethernet cables. \n\nI look at my phone and see I have about 5 minutes before the class is about to start. I grab a 12 foot piece of Ethernet, cut the ends off, and strip back the casing on a few wires on both ends and sprint back to the classroom. I connect the now-stripped copper Ethernet wires into the speakers to connect them, say a little prayer, and test the video. Great success! By God Jim, we’ve done it! The audio plays, and loud enough to fill the room. I verify with the presenter that everything else is good to go and slip out of the room. \n\nThe department manager for the teaching side caught me outside of the classroom and commended me on some quick “Macgyver-ing” of the situation. I let them know we could use a roll of speaker wire for the portable speakers and that as soon as the AV company was open I’d schedule for them to come replace the amplifier. They stated that the Ethernet cable seemed to work well enough, and they’d rather keep that as a tribute to my hard work (AKA why spend the money if it's working well enough right now?). Even though I don’t work there anymore, I keep in touch with my friends who tell me that Ethernet cable is still in place.\n\n**TL;DR**: Training Facility's A/V system audio died before a presentation that was mostly video interviews. Backup speakers were missing parts: jury-rigged it with stripped back Ethernet cable.",
        "created_utc": 1536863944,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice on my schooling",
        "author": "Raditzfan9000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9figex/looking_for_advice_on_my_schooling/",
        "text": "[removed]",
        "created_utc": 1536848930,
        "upvote_ratio": ""
    },
    {
        "title": "A few quick and dirty ones!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fg4qn/a_few_quick_and_dirty_ones/",
        "text": "[removed]",
        "created_utc": 1536826110,
        "upvote_ratio": ""
    },
    {
        "title": "Obviously it wasn't obvious",
        "author": "Quango2009",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fg3e5/obviously_it_wasnt_obvious/",
        "text": "Couple of our telecom installation engineers were trying to install an Outlook Addin that integrated with a telephone system to demonstrate to customers.\n\nI had been resisting this as we don't really do support, especially for a third-party addin. They sent us install logs, which showed the error \"This software required MS Outlook 2007 or later\".\n\nI suggested that if it wasn't correctly detecting the Outlook version, they contact the supplier for support. We wouldn't use a version that old, it would pre-date our company formation.\n\nThe followed up by sending us helpful documents from the supplier; technical guides, installation steps etc. I'd put my foot down and said we are not going to assist them with this.\n\nJust received this email:\n\n&gt;When I downloaded “Skype for Business” I installed the local copy of Office / Outlook  \n&gt;  \n&gt;This is what the \\[xxx\\] program needed, a local copy.\n\nI'd thought it obvious that than an *Outlook Addin* needed *Outlook*. ",
        "created_utc": 1536825653,
        "upvote_ratio": ""
    },
    {
        "title": "The human is the weakest link",
        "author": "Certified_GSD",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9feryp/the_human_is_the_weakest_link/",
        "text": "An old tale from when I was taking a NetAcad class in high school. Most of it was stuff I already learned in my spare time; how to disassemble a computer, install a CPU, install an OS, crimp your own CAT5 cables, set up network sharing, what's the difference between a switch and a router, etc etc\n\n\n\nAnyway, one of my fellow groups were having trouble with their CD drive, not being able to boot into the Windows 7 installer. I, of course, being the helpful person I am decided to break away from my group temporarily since I already knew how to do this stuff.\n\n\n\nI checked their power connection and tried a different connector. No go. I tried a different SATA cable that I knew worked. No go. I thought maybe if I forced the BIOS to choose the CD drive as the primary boot device, it would work instead of smashing F12 and choosing from the boot menu. No go.\n\n\n\nI spent a good fifteen or twenty minutes methodically testing every avenue of error, when I finally decided that maybe the CD drive was dead and they should switch it out with another one. I took a paper clip and forced open the unpowered drive to take the installer disc out.\n\n\n*whirrrr*\n&gt;Umm, guys, there's no disc in here.\n\nOne of the guys apparently set it down at another nearby table and reached over for it\n&gt;Oh, yeah, this is the disc.\n\n\n\nHanding over a CD labeled \"WIN 7 PRO 64-BIT\"\n\n\n\nAnd I realized, I just became *that guy,* the same one who doesn't check to see if the computer is plugged in first before opening it up.",
        "created_utc": 1536811102,
        "upvote_ratio": ""
    },
    {
        "title": "What did you spill?",
        "author": "gamageeknerd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fdszm/what_did_you_spill/",
        "text": "Just had a customer come in with his laptop wrapped in a towel. We asked him why and he kept giving us these weird run around answers and kept insisting it didn’t matter. We finally convinced him that the difference in what he spilled on it could mean salvageable or total loss. We then had to hear this long many minute long explanation on why his laptop was now covered in lube. \n\nWhen asking him a bit more he eventually gives us the brand name and to my and several others surprise he basically spilled mineral oil all over his brand new laptop. After reassuring him his data would be fine it now became a job to mop up all the oil from inside the case and keep it as clean and lube free as possible. ",
        "created_utc": 1536802847,
        "upvote_ratio": ""
    },
    {
        "title": "TIFU by generating 700+ files",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/tifu/comments/9fcxkn/tifu_by_generating_700_files/",
        "text": "[deleted]",
        "created_utc": 1536801294,
        "upvote_ratio": ""
    },
    {
        "title": "Spider webs make good conductors.",
        "author": "RHBathtub",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fd3dn/spider_webs_make_good_conductors/",
        "text": "This is my first post on TFTS, so sorry if I make some mistakes.\n\nThis story happened about last year while I was doing work experience for a local service desk with a small field team. I was shadowing another tech when we were sent out to an old woman's home. She called asking for help since her computer had, and I quote:\n\n&gt; \"An infestation\"\n\nWe were unsure what she meant because we thought at first she was referring to viruses, but we were wrong. We arrived at her house and she showed us her computer, which she had left outside.\n\nNow, I don't know about other countries, but I work in the-land-down-under, so we have a reputation for spiders.\n\nWe counted about 20 when we tried turning it on and it shorted. This was because we saw multiple spiders running out from the computer, and a fire starting inside.\n\nAfter safely \"removing\" the spiders with spray, we reluctantly opened up the computer to find webs over multiple surfaces of the power supple and motherboard, which had electrocuted the arachnid infestation and saved us two cans of spray.\n\nAfterwards the computer was predictably ruined, we had to spend an entire 30 minute session explaining to the woman why computers did not like the outside, because she must have missed the memo about water and dust damage.\n\ntl;dr Don't hire spiders to do your soldering or you'll give a field tech a heart attack.\n\n",
        "created_utc": 1536796927,
        "upvote_ratio": ""
    },
    {
        "title": "\"You uh, you sound a little drunk.\"",
        "author": "squazify",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9fcf4p/you_uh_you_sound_a_little_drunk/",
        "text": "So background for this one, I worked at what is essentially help desk for senior citizens. People call in, I fix their shit however I can. I worked from home, so I had a bit of leeway. At the time the company was trying to starve my team out (We got paid per ticket) and so they were giving us minimal tickets.\n\n$ME: Me\n\n&amp;#x200B;\n\n$UX: Other guy\n\n&amp;#x200B;\n\nI was fresh into hour 9 of my shift and at this point it's a Thursday night. I decide to call a few friends and get them to come over and have a small kick back. Surprisingly I get 4 people over in the next few minutes so I decide to put on a pair of pants and begin my night. I look at the clock. 45 minutes of taking calls left. I've had two tickets today. That's $20. I decide, fuck it. I'm drinking early. I don't give a shit for $20 for 10 hours of being chained to my room. 6 or 8 shots later I get a phone call. Oh fuck it's work. Let's see what time it is. \\_10:58\\_ Fuck, two minutes before my shift is over.\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Hello, thank you for calling \\[redacted\\], how can I help you?\n\n&amp;#x200B;\n\n\\&gt;$UX: \"Hi, I'm having issues with my printer.\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Oh ok, what seems to be going on?\"\n\n&amp;#x200B;\n\n\\&gt;$UX: \"It isn't letting me print, it says the printer is offline.\"\n\n&amp;#x200B;\n\nPrinter. Shit, this can go one of two ways, but I have a good feeling on this one.\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Can I get you to uhhh turn off your printer please?\"\n\n&amp;#x200B;\n\n\\&gt;$UX: \"How do I do that?\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Eh, just unplug the thing.\" (This I learned was easier with clients at this company and I'm starting to feel the vodka, it's not worth troubleshooting.)\n\n\\&gt;$UX: \"Sure thing.\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Now plug it back in and turn it on.\"\n\n&amp;#x200B;\n\n\\&gt;$UX: \"Ok, I did that. You sound a little bit drunk by the way.\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Sigggghhhh. It's a speech impediment.\"\n\n&amp;#x200B;\n\n\\&gt;$UX: \"Oh my god, I'm so sorry, I didn-\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"It's fine I get it all the time. Now try printing. Does it work?\"\n\n&amp;#x200B;\n\n\\&gt;$UX: \"It works, so sorry I didn't mean to offend you.\"\n\n&amp;#x200B;\n\n\\&gt;$ME: \"You're fine sir, I get it all the time. Have a nice day.\" \\_Click\\_\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\&gt;$ME: \"Alright guys, who's ready for Wizard Staff?\"\n\n&amp;#x200B;",
        "created_utc": 1536791388,
        "upvote_ratio": ""
    },
    {
        "title": "The laying on of hands",
        "author": "wmassingham",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f9uo2/the_laying_on_of_hands/",
        "text": "There was another story today about the *aura* of tech support. Like how when you take your car to the mechanic and it stops making the noise, so too does a PC start behaving when a tech is looking at it.\n\nA few weeks ago, one of our other offices handed off a ticket to me, as the PC in question was booting to a black screen, no cursor or anything. It was now my job to go on-site and troubleshoot, as I was several hours closer.\n\nI arrive on site and take a look. It wasn't actually a black screen. Looking closely, I see the Windows 10 \"spinning dots\" screen that you see when it's decided to take the morning easy. Fair enough to the customer who called in; the sun was shining on the monitor, making it very hard to see.\n\nI start the usual stuff: hit some keys on the keyboard, try the three-finger salute, make sure num lock/caps lock turn on and off properly. I start to think maybe it decided to apply some updates, even though it wasn't their scheduled day to do that.\n\nLike I said, the sun was shining in, so I can't quite see if the HDD light is lit or blinking. I place my hand on the top of the chassis, partially to feel any activity from the drive, and partially to shade it from the sun.\n\nJust as I lay my hand upon it, the spinning dots vanish, and Windows presents the login screen.\n\nUser logs in, PC seems a bit slow, but it's probably just finishing something up in the background. I give it a minute, reboot, and it seems right enough. One more for that \"IT aura\".",
        "created_utc": 1536773628,
        "upvote_ratio": ""
    },
    {
        "title": "“We’ve never needed internet to use email!!”",
        "author": "KitsuneExistISwear",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f8xdd/weve_never_needed_internet_to_use_email/",
        "text": "So I work as a tech at a place that fixes computers and phones and also sells them used. It’s a pretty good gig but sometimes the customers can be a wild ride.\n\nOlder customers are hit or miss. Some come in having worked with computers since their inception and others come in not knowing anything about their own devices because someone else set it up for them. This customer falls into the latter category.\n\nAn old man, with cane and massive computer box in hand, comes to our door and I rush to open it for him. He’s very thankful and comes in and says he might have a virus. I tell him that’s something we can help with and pull the computer out and set it up on our intake bench. I ask him what the issue is (Me = Me, Older Gentleman = OG):\n\nOG: Well it has to do with my email. I’m getting duplicates of these just AWFUL messages that I never asked for! And my wife has to see them too!\n\nMe: Okay! Let’s take a closer look here!\n\nI open his email app and he tells me to navigate to his junk mail box. \n\nOG: See! Look there’s five or six of the same messages from the same sender. It’s so strange we’ve never had to deal with this before!\n\nMe: This is really just junk mail, sir. It’s also called spam because these companies get your email from somewhere and just spam you with messages over and over. It’s why you have a junk mail box so you don’t have to see it and can just dump it.\n\nOG: Oh that’s never been there. The virus must have created it!\n\nMe: No sir, I assure you that is an existing feature. These duplications may be a WiFi issue or an issue with your email provider.\n\nOG: What’s WiFi? We’ve never had that before! Is that part of the virus too?\n\nMe: No sir, I don’t think you have a virus. And you would have to have WiFi or internet in order to use your email.\n\nOG: No! I’ve never had to use internet before. We’ve never had to use internet for our email!”\n\nMe: If you’ve never used WiFi then you must have had a wired connection. Internet is essential to use your email.\n\nOG: No it is NOT! My son would have told me about it when he set it up!\n\nIt suddenly dawns on me that this is the source of our struggle. He doesn’t know anything about his device is set up other than the passwords he needs to use it.\n\nI then had to take the time to explain to his man what internet is and how it allows him to use email in as layman’s terms as possible so that he could be convinced that it wasn’t a virus. After he was reassured that junk mail is normal, adjusting his settings, and telling him that his WiFi will automatically connect when he gets home he was on his merry way and I was....so confused. How can you use a smartphone and a computer and not know what internet is?!?\n\nTL;DR : The internet is a virus.",
        "created_utc": 1536767298,
        "upvote_ratio": ""
    },
    {
        "title": "I broke it again so you have to fix it. For free.",
        "author": "sparfan1337",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f8vd7/i_broke_it_again_so_you_have_to_fix_it_for_free/",
        "text": "FTP here so apologies for formatting.\n\nA little context before the story, I work in a computer repair shop. We will work on just about any problem if it involves a computer, but if it involves replacing parts on a laptop we generally have to order the replacements. Also of note, we have a 30 day warranty on any work we do, though depending on the issue and the customer we may unofficially extend it past that for a couple weeks. We also make sure to inform the customer of the warranty and have a paper they sign agreeing to those terms.\n\n$me - myself\n\n$AC - angry customer\n\nAbout two months ago I replaced a charging port in $AC's laptop. The plastic securing it had broken off and replacements were ridiculously cheap so I informed her of this and ordered a new one, then eventually replaced it. All was well until last week.\n\n(phone rings)\n\n$me: $StoreName this is $me, how can I help you?\n\n$AC: Hi my name is $AC, you guys replaced my charging port like a month ago, and now it broke again. I can't plug in my charger.\n\nI look up her info, see it's been about two months since we did the repair.\n\n$me: Ok, could you describe what exactly happens when you try and plug in the charger?\n\n$AC: It's really loose and won't stay still.\n\n$me: Alrighty, well if you can stop in with the computer I can take a look at it and see what we can do about repairing it.\n\nIn my mind I'm thinking, there's no way it broke again. It probably just came loose or maybe I didn't tighten it down all the way. This call happened about a week ago, and as such had passed from my mind until today when $AC actually came in.\n\n(buzzer going off saying someone opened the door)\n\n$me: Hi, welcome to $StoreName, how can I help you?\n\n$AC: Yeah I called last week about my charging port being broken again, my name is $AC.\n\n$me: Sure, mind if I take a look at it real quick? (while pulling up her info, having now been two months since her service)\n\nI look over the laptop and sure enough I can see the charging port hanging loosely and what looks like a rough edge where it was snapped. This is all through the hole in the side.\n\n$me: Well it definitely looks like it was broken again, but these pieces don't break very often. Someone would have to be consistently ramming the charger into the port. I can take a look at it for no charge(we require a diagnostics fee for new services), but I will likely have to charge for labor as it is out of our service warranty and the damage does not appear to be natural.\n\n$AC: But it's only been 2 months! And this is the third time it's happened! (we only fixed it once.) You can't do it again?\n\n$me: I can check it in for no charge since I have to take it apart to see what exactly the damage is, but you are a month out of warranty so I will likely have to charge for for the repair.\n\n$AC: Well this is unacceptable, I shouldn't have to pay to have it fixed again. I'll be filing a dispute with the BBB. Whats your name?\n\n$me: My name is $me.\n\n$AC: -packs up laptop and huffs out of store-\n\n$me: Have a nice day! -with a smile of course-\n\n&amp;#x200B;\n\n**TL/DR I'm out of warranty but you should do it for free anyways.**\n\nEdit: added a word",
        "created_utc": 1536766912,
        "upvote_ratio": ""
    },
    {
        "title": "\"Kneel, peasant.\"",
        "author": "ebonythunder",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f8966/kneel_peasant/",
        "text": "This happened two days ago and I'm still livid. In almost 10 years of IT, I've NEVER had this happen and in the moment I had no idea how to react.\n\nA ticket came in titled, \"EMERGENCY, EMAIL IS DOWN\" and came from $CIO himself. Now, no one else had reported any email issues, and I could see that email was flowing by performing the highly complicated troubleshooting step of \"sending an email\". So I hurried down the hall as quick as I could to talk to him and get some more information so I could help this guy out.\n\nHe showed me the issue, and it was the standard, \"Outlook keeps asking me for my password, and I've entered it, but it just pops up again asking for the password.\" Ok, the guy's password has expired.\n\n&gt;\"Ok, I think I see the problem. May I sit down for a moment and resolve this issue for you?\"\n\nFolks. I've worked in IT for almost 10 years and I've heard just about every excuse and complaint in the book. If a user can lie about it or complain about it, I've most likely heard it before. Nothing, and I mean, NOTHING had prepared me for $CIO's response.\n\n&gt;\"No.\"\n\nAnd then he scooted over, rolling his wheeled deskchair roughly 4 feet to the right, so I could squat down in front of his computer and resolve the issue.\n\nI'm 6'4\", so I can't even reach the keyboard from a standing position. I had to squat in front of this guy's computer and handle the Outlook issue, all while he sat within arm's reach, watching.\n\nIt was the icing on the cake of an already shitty day, but at that moment I was completely dumbfounded and didn't know how to respond, so I just fixed the problem and left the office. Maybe I'm overthinking it, but, honestly, who the hell does that?  I'm still angry about it.",
        "created_utc": 1536762565,
        "upvote_ratio": ""
    },
    {
        "title": "The tech aura.",
        "author": "JFizDaWiz",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f85hp/the_tech_aura/",
        "text": "Me: thank you for calling [REDACTED] my name is JFizDaWiz may I have your first and last name?\n\nCustomer: *disgruntled voice* [first and last name]\n\nMe: thank you, in case we get disconnected what’s a number I can call you back on\n\nCustomer: *more disgruntled voice* [provides number]\n\nMe: thank you, and what email address can we use today?\n\nCustomer: I DONT HAVE ONE I HAVE (device) AND IT WONT CHARGE ANYMORE AND I JUST NEED IT FIXED!\n\nMe: ok no problem I can help getting that fixed for you today. So first can you...\n\nCustomer: oh. I’m sorry. Uhhh hold on......it looks like.....hey it’s charging and it turned on. Sorry about that but thank you it’s working now. \n\nMe: just like your car it works when you bring it to a garage. Take care. \n\nCustomer: you too. \n\nI love when I don’t have to do anything. ",
        "created_utc": 1536761817,
        "upvote_ratio": ""
    },
    {
        "title": "Urgent! Escalate! Panic!",
        "author": "JimmyReagan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f80sf/urgent_escalate_panic/",
        "text": "So the other day it was my turn to be the weekend \"on call\" guy for our support line. Company policy is that every department have one. My particular department provides support in Cognos, BI reporting software. There really isn't any scenario where there's a business critical failure that can't wait till Monday, it's even stipulated in their contract. Very occasionally someone will open a case with our department that is important but belongs with another group.\n\nSo I get a call around 5pm on Saturday from our call center, a case that's marked with the highest urgency possible and set to escalate to manager. Usually I'll reset the urgency if it's nothing...but the description made it sound like their entire system was down, which is actually a big issue.\n\n\nSo I excuse myself from my friends and make a call to the listed number. I reach a manager who tells me he's not at the office, but they're in the middle of a software upgrade so he figures one of his employees opened the case. Now he's asking me what the case says and what the problem is and blaming us for halting their business. I tell him he was the first call I made, if he gives me a number I can call someone actually at his business.\n\n\nNow I call the number the manager gave me. It's actually the number for one of our internal customer relationship liaisons who are on call always. Now he's asking me what's wrong and emailing my manager and telling me we need to get this fixed. I keep repeating I don't even known what the issue is yet! So now he's trying to find me someone to get ahold of.\n\n\nNext is our project manager for the upgrade...a grumpy guy who sounded like he was already halfway buzzed on his weekend...then the company's project manager that just went to voicemail...back to the CRL who is fully panicked...my boss texts me asking WTF is going on...and I still have no damn clue.\n\n\nFinally the first manager I called adds a note to the case with the number of the person that opened the case...along with more posturing and threats...so I call the number.\n\n\nThis fuckin guy...we'll call him FG.\n\n\nMe: &lt;company&gt; support, we got an urgent case about &lt;catastrophic failure&gt;, what can we help with?\n\n\nFG: Oh well the project manager said our reports wouldn't work during the upgrade, I just wanted someone to call on Monday to help me check that everything was working again. I didn't think you guys would even call!\n\n\nMe:....well you described a serious issue with your system, is everything OK? I can transfer you to our emergency support to get things running again.\n\n\nFG: oh no everything is fine with that. I'm using it right now!\n\n\nMe (screaming internally): you opened the case as urgent and escalated to management, are there any work-stoppage issues that need our attention?\n\n\nFG: oh I didn't know. I don't think I opened it as urgent. You guys can call me Monday I need to get back thanks! &lt;click&gt;\n\n\nJust to note...it takes multiple clicks and several confirmation messages to both mark as urgent and escalate a case...so he's full of shit. After picking up my jaw off the floor...I re-prioritize the case as \"low\" and CC everyone I called on an email explaining everything...that there is no issue, their system is fine...and someone \"accidentally\" prioritized the case...\n\n\nOn the plus side my boss paid me for the hour and a half of calls and nonsense...the manager at the business apologized...and that case mysteriously closed by Monday...\n\n\nTL;DR: All systems down, but not really so it can wait till Monday.",
        "created_utc": 1536760918,
        "upvote_ratio": ""
    },
    {
        "title": "Revenge of the true sysadmin !",
        "author": "Hemerald77",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f7u0d/revenge_of_the_true_sysadmin/",
        "text": "[removed]",
        "created_utc": 1536759548,
        "upvote_ratio": ""
    },
    {
        "title": "Domain trust is quite important",
        "author": "morpheuz1911",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f7pqo/domain_trust_is_quite_important/",
        "text": "Hi guys!  \n\n\nFirst post, so here we go.  \n\n\nSo I work for a IT-consultant company which sells IT as a service, which means we handle most of the customers  \noperations work. This being the case, they do have local IT staff(1:st line/1:st tier), so that we don't have to deal with  \ncompletely moronical questions and get some actual work done.  \nThe environment is of made up of M$ products, A$$ure and most things you'd expect from a deployment centered  \nenvironment.\n\nAlong with all this, we have an in-house developed web-based $portal, that offers simplified functionality in most of these  \nsystems for the local IT staff.  \nAs a \"Hail Mary\" type of solution, we sometimes remove computer objects to clear SCCM memberships, wrong HMAC addresses, so on and so forth, and re-create them, because we need to re-install them from scratch. But these are a big no-no when upgrading since the domain trust is lost. It's also possible to do this through $portal.\n\n&amp;#x200B;\n\nThe cast:  \n\n\n$Me: Yours truly\n\n$LIT: Belgian local IT, who I up until this point thought was quite knowledgeable.\n\nOnce upon a time, I checked out a ticket that had been filed by $LIT.  \nThe ticket read something along the lines of:  \n\n\n*I need urgent help! The OS upgrade installation won't start!*  \n*I even removed the computer and it still won't work!*\n\n.... You did what?\n\n*It's very important for our application tests that this machine*  \n*gets upgraded. I need help NOW!*  \n\n\nI quickly pull up a chat window with $LIT\n\n$Me: Tell me EXACTLY what you did.  \n$LIT: I did what we always do. The installation wouldn't work, so I removed it through $portal and re-created it.  \nSo it should work.  \n*\\*internally screaming\\* WHAT HAVE YOU DONE??!!!*\n\n$Me: No, it won't. You've effectively excluded the client from the domain, so now there's no way in hell that  \ncomputer can get the upgrade, because it lost it's domain trust. So it's barred from the network.  \n$LIT: But it HAS to work! We have to get this up and running ASAP.  \n$Me: Let me be perfectly clear. You haven't just stopped the upgrade. You can't do anything with this computer any longer. You can't log in. You can't upgrade. Nothing.  \n$LIT: That is unacceptable! We need this computer up and running and I just did what you usually do!  \n$Me: Yes, it's what I usually do when I'm doing a clean installation. Never when doing an upgrade.  \nIn short, this is your fault for doing it wrong and we can't fix it for you.  \n$LIT: I've had enough of these excuses, I'll call our manager about this.  \n\n\nAfter this, I gave my teamleader the heads up for this and explained.  \nHe replied with a facepalm and a deep sigh.  \n\n\nDon't know what happened with the client, but I didn't hear anything about it ever again.  \n\n\nTL;DR; Local IT destroys the domain link and tries to blame me.  \n",
        "created_utc": 1536758629,
        "upvote_ratio": ""
    },
    {
        "title": "The type of screw up that lawsuits are made of",
        "author": "Ghoste7",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f7l4h/the_type_of_screw_up_that_lawsuits_are_made_of/",
        "text": "  \n\nSo this started yesterday and we are still working to get it fixed.\n\ntl:dr is that a technician with our SAN vendor screwed up and now our SAN which hosts our entire virtual server farm has no cache.\n\nSo the players in today’s story are:\n\n$me – desktop support tech and junior sysadmin who originally found the problem\n\n$admin – server admin in charge of the data center. Works remotely from a different state\n\n$manager – Server admins boss and person who basically built the entire enterprise network and server system\n\n$SAN\\_tech# – several different SAN techs that we talked to. All of which had very thick accents.\n\nHere begins our ongoing tale of woe.\n\nSo I work at a small state university. Primarily I am a tier 2 technician but I also manage a lot of the more desktop focused server systems like SCCM and our VDI infrastructure. About 2:30 PM yesterday I get a call from the help desk saying that people are having a lot of issues with the VDI so I jump into action and start looking to see what’s up. I check all the basics, like are the servers running, have any of the services stopped, etc. after establishing that everything in the VDI environment seems to be as it should I call over to $admin and $manager so that we can start digging deeper. As we look we start to notice that a lot of our servers and management tools are running really sluggish. I finally see some alerts in our network monitor saying that most of my VDI servers are having long disk queues and higher than normal disk usage time. I mention this to $admin and $manager and tell them that if our storage is bottle-necking then that would account for the issues that I am seeing in the VDI. At this point they mention that they had a drive issue on the SAN earlier that day so we all turn our attention to the SAN.\n\nAt this point I should add that we pay a good amount of money to our SAN vendor for maintenance and that one of the things they are supposed to do is contact us if we have a drive fail. We have not heard anything from them. As $admin is looking at the SAN management console he sees that not one but two drives have failed and they are both SSDs used for caching. Ok, time for a call to support.\n\n$SAN\\_tech1: Thank you for calling $SANSupport how can I help you.\n\n$admin: yes we have two failed drives on our production SAN please help us.\n\n$SAN\\_tech1: ffasldkjfjrl;kj lrkjaljker alkjsdrl;jaslkdker lkajrsd;r lkj\n\n$admin: I’m sorry I couldn’t understand you could you say that again?\n\n$SAN\\_tech1: asldkfjasl;kdjf lakjds;fjalk;sdfj ;laksjdf asdjf ;lasdfj \n\n$admin: still couldn’t understand you. You have a very thick accent. Can you try one more time?\n\n$SAN\\_tech1: asdlfkj;lk;jasdlk;fj webex dot com lak;sdjf;lkasdjfla;sdkjf\n\n$admin: I am sorry I can’t understand you I am going to have to call back and get a different technician. \\*hangs up\\*\n\n\\*calls SAN support again\\*\n\n$SAN\\_tech2: Thank you for calling $SANSupport how can I help you.\n\n$admin: yes we have two failed drives on our production SAN please help us.\n\n$SAN\\_tech2: ok lets start a webex and I will take a look. \n\n(Dude was still hard to understand but not quite as bad as the last one)\n\n$Admin: ok \\*joins the webex\\*\n\n$SAN\\_tech2: ok I do see that you do have two drives that are showing as disconnected can you reseat them?\n\n\\*$manager goes to the datacenter and reseats the drives\\*\n\n$SAN\\_tech2: ok the drives are still not showing up. You should have spares can you replace these two drives since they seem to have failed.\n\n\\*$manager and $me dig through the storage room to find the drives and then replace them\\*\n\n$SAN\\_tech2: Ok I see the new drives showing up in the SAN. Now I just need to do a couple more things to finish up.\n\nAt this point an hour passes as we watch $SAN\\_tech2 do what seems to be very little as our cache drive pool still shows as being down.\n\n$admin: hey what up? Are you still there? Can we escalate this so that this gets fixed quickly. At least 90% of our environment runs on this device so it needs to be fixed fast.\n\n$SAN\\_tech2: yes I will get my supervisor involved. \n\nAfter about another 30 minutes $SAN\\_tech3 gets conferenced in.\n\n$SAN\\_tech3: Hello $SAN\\_tech2 tells me that you are having some issues with your cache drives.\n\n$admin: yes and we need this fixed as quickly as possible.\n\n$SAN\\_tech3: ok well it looks like what happened is that the replacement drives that you plugged in were added to the wrong disk pool so to fix this we are going to have to ship you a temporary SAN, migrate all your data to it, rebuild your existing SAN from scratch and then migrate the data back.\n\n$admin, $manager, and $me: WHAT!!!!!!!!!!!!!! YOU HAVE GOT TO BE JOKING!!!!!!!!!!!\n\n$SAN\\_tech3: we are sorry but it looks like when $SAN\\_tech2 was adding the drives to the pool he put them in the metadata pool and they can’t be removed from that pool without corrupting all data on the SAN.\n\nAfter arranging the details of what could be done with $SAN\\_tech3, $admin, $manager, and $me started shutting down non-critical systems and migrating critical systems to our DR site to reduce the load on our crippled SAN. They are overnighting us a couple new SSDs that we will switch our hotspares for to get some cache back onto our SAN until they can get us an engineer and a temporary SAN to actually fix the problem that they created. \n\nAs you can imagine coming in this morning after working until midnight to a still broken SAN and no word on the new drives is making today a fun day.  ",
        "created_utc": 1536757660,
        "upvote_ratio": ""
    },
    {
        "title": "My husband is cheating on me",
        "author": "simpson_hey",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f795o/my_husband_is_cheating_on_me/",
        "text": "[removed]",
        "created_utc": 1536754962,
        "upvote_ratio": ""
    },
    {
        "title": "ThinkPad HDD0 Error",
        "author": "famous1622",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f589m/thinkpad_hdd0_error/",
        "text": "Hello again TFTS! Long time no see, but I've gotten my hands more dirty in the world of tech since last time, so I should have plenty of stories to share with y'all this year.\n\nToday at school I had a weird story. My friend $Pete brought in an old ThinkPad tablety laptop which was giving a weird error involving the hard drive. $Pete isn't your average user, so he knows what's going on usually with simple hardware problems, but I'm usually the goto for anything out of the ordinary.\n\nSo I try some things.\n\nCan I boot into BIOS? Yes.\nCan I boot off the portable Linux drive I always carry? Yes.\n\nSo, things seem to be working, and we keep getting this HDD error. But just before I say the drives probably dead, I noticed a plastic tab coming out the side of the laptop. Turned off. Removed drive cover. Pushed in drive. Tested. Worked. Closed cover.\n\nOne and a half hours well spent.\n\nSorry that this story was a lot less interesting than my last one, maybe my job shadow this year could be just as exciting as last year's.",
        "created_utc": 1536732873,
        "upvote_ratio": ""
    },
    {
        "title": "Favorite ticket this year",
        "author": "TheLightingGuy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f50na/favorite_ticket_this_year/",
        "text": "[removed]",
        "created_utc": 1536730459,
        "upvote_ratio": ""
    },
    {
        "title": "The customer threatened to write a bad Google review!!",
        "author": "Cidjackaries",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f3zw5/the_customer_threatened_to_write_a_bad_google/",
        "text": "\nQuick background, I work at a large dealership, I am the IT manager (official title), the whole IT department (Yay me!), Inventory Manager and about 3 other titles. \n\n90% of my IT issues are resetting passwords or teaching people how to login into Windows 10 Pro. \n\nSo today, I am auditing our preowned inventory and I get a text message from one of the sales guys:\n\n\"The XM radio people will not give my customer the free three months that comes with the car.\"\n\nI respond, \" I have nothing to do with XM radio.\"\n\nI get back, \" Don't you have like a back door password or scrambler that you can put on her car to make it work?\"\n\nThen, his Manager comes in and asks the same flippin question. \n\nI respond that I have nothing to do with XM Radio. \n\nManager does that, \" but, but it is a car thing and a computer program.\" Line.\n\nAt this point I have wasted 30 minutes of my time, so I call my boss, the owner of the company and explain the sisuation.\n\nHis response, \" Tell the (Sales Manager) to get out of your office, quit being a baby and help the customer or HE will be finding a new job.\"\n\nMy boss always has my back.",
        "created_utc": 1536720700,
        "upvote_ratio": ""
    },
    {
        "title": "I found a goldmine in my friend's laptop!!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f2m29/i_found_a_goldmine_in_my_friends_laptop/",
        "text": "[removed]",
        "created_utc": 1536709491,
        "upvote_ratio": ""
    },
    {
        "title": "You want to plug it in where?",
        "author": "mattthepianoman",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f2ikk/you_want_to_plug_it_in_where/",
        "text": "I used to work at the consumer tech support desk of a large electronics retailer. Most of the time it was just simple things like Facebook password resets and decrapifying laptops and phones, but customers would often come up and ask us about what products they needed to do a particular thing.\n\nOne evening a guy comes up to the desk for help.\n\nCustomer: \"Hi man, I need one of those cables that goes into the vag\"\n\nMe: \"Sorry, pardon?\"\n\nCustomer: \"I need one of those cables that goes into the blue vag...on my laptop?\"\n\nMe: \"Sorry...what is it you're trying to do?\"\n\nCustomer: \"I need to connect my laptop's vag to my TV's vag, so I can watch the movies on my TV\"\n\nMe: \"Ohhhhh! You mean VGA!\"\n\nI pointed him to where he could get a cable and one of the sales staff took over. I went into the back room and got the giggles out of my system and then it was on with the rest of my shift.",
        "created_utc": 1536708733,
        "upvote_ratio": ""
    },
    {
        "title": "I'm having one of those days, guys...",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f1bvc/im_having_one_of_those_days_guys/",
        "text": "Tech: *Security alert received, per our KB send affected machine ID, IP address, and code from our security program to Security Team.  Create ticket, include all information, directly copied and pasted from a template prior to escalating the ticket*.  *Many of these types of alerts have been received in the past, and always escalated using this template over to the Security Team.*\n\n\\------------A few minutes later-------------\n\nSecurity Team chats to the Tech who escalated the ticket\n\nSecurity: We received your ticket 123456.  Which machine is this affecting?\n\nTech: It's in the ticket notes, and also it's Machine ABCDEF (copied and pasted). *Tech and Security Team member are both looking at the same ticket (ticketing software lists who's looking at it).*\n\nSecurity: OK, and what is the IP address of the machine?\n\nTech: *Copies and pastes the IP from the ticket to the chat*.\n\nSecurity: Can you repeat the IP address?\n\nTech: 123.456.789.012.  *confused, it's typed (copied and pasted), maybe it didn't send?  But then why are they asking me to repeat it?*  \n\nSecurity: OK, hold on a moment.  \n*A few minutes pass.*  \nWhat is the Machine ID?\n\nTech: *really confused...this is a chat that's occurring, with a written record literally on the screen.*  *Copy and paste, literally what's in the chat window a few lines up and send*.\n\nSecurity: OK, thank you.  Please pull the ticket back to your team.\n\nTech: And do what with it?\n\nSecurity: It's not a security team issue, please send it to the concern team.\n\nTech: Who's the concern team?\n\nSecurity: *(no response over 30 minutes)*",
        "created_utc": 1536699592,
        "upvote_ratio": ""
    },
    {
        "title": "How to deal with “My Computer Won’t Turn On!”",
        "author": "tekenology",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f0jwa/how_to_deal_with_my_computer_wont_turn_on/",
        "text": "I’ve been working in the IT field for years now and have heard different stories from numerous people that I have met throughout the times. One of the most entertaining goes something like this:\n\nH: Helpdesk Tech\nC: Client\n\nH: “IT Helpdesk, how may I help you?”\n\nC: “Hi, my computer is broken and won’t turn on”\n\nH: “Okay, are there any lights on your computer or on your monitor?”\n\nC: “No”\n\nH: “Alright. And if you press them to power them on, does that do anything?”\n\nC: “No”\n\nH: “... can you make sure the computer is plugged in?”\n\nC: *disgusted* “It’s not my job to make sure my computer is plugged in”\n\nH: “Well it’s not mine either so call XXX and have them fix it” *Click!*\n\n\nNote: This was posted for merely entertainment and was a story that someone told me about during my years in the industry.",
        "created_utc": 1536693967,
        "upvote_ratio": ""
    },
    {
        "title": "Kneel, peasant.",
        "author": "ebonythunder",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f0i8w/kneel_peasant/",
        "text": "[removed]",
        "created_utc": 1536693635,
        "upvote_ratio": ""
    },
    {
        "title": "I don't want your new (more powerful) laptop because it only comes with one charger",
        "author": "sham420710",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f09bd/i_dont_want_your_new_more_powerful_laptop_because/",
        "text": "[removed]",
        "created_utc": 1536691797,
        "upvote_ratio": ""
    },
    {
        "title": "\"There was a Windows update and now I can't log in to my computer anymore.\"",
        "author": "Thernhoghas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f053f/there_was_a_windows_update_and_now_i_cant_log_in/",
        "text": "I’m no professional, but together, my dad (internet-guy), my brother (hardware-guy) and I (software-guy) form the go-to tech-support team for the neighborhood and extended family.\n\nI read something earlier today that reminded me of this.\n\nA few days after the last(? I think) bigger Win10 update had rolled out to my computer, I got a call from my grandma at work in the early afternoon. \n\nAs soon as I greet her, she starts apologizing for calling me at work.\n\n&gt;$me: Grandma, if I didn't have time to talk, I wouldn't have picked up. What's wrong?\n\n&gt;$gran: Well, there was a Windows update and after rebooting my laptop to let it install, I can't log in to my computer anymore.\n\n&gt;$me: You can't log in? So it's booting, right? It's probably showing you the stuff about the updated license agreement, isn't it?\n\n&gt;$gran: Yes, yes exactly.\n\n&gt;$me: You should be able to just click through those, I can fix any settings later.\n\n&gt;$gran: That's the thing. I can't click anything. It's not responding.\n\n&gt;$me: Odd... Try not to worry too much about it, I'll come over after work and take a look.\n\nHours later and after a thourough greeting from her dog, I am sitting at her desk.\n\nWith a glass of ice-cold water standing between me and her laptop, I wait for the machine to boot up. After two minutes of waiting, I see the same screen my own computer had shown me a few days earlier.\n\nI grab her mouse and wiggle it a bit; cursor moves. I click on the 'agree' button. Nothing happens. I click around the screen for a bit when I see what is going on. \n\nA blue frame had appeared around the field with the license agreement text.\n\nI groan and get my phone out of my pocket.\n\n&gt;$me: Good news, grandma there's nothing wrong with your computer. I just need to google what I need to press to disable this narrator.\n\n&gt;$gran: Narrator? That explains why the computer was reading the text to me.\n\nFive minutes later, everything is as it should be, she is logged in to her computer and happy.\n\nThe rest of the two hours I was at her place was spent chatting about the various happenings in the extended family.\n\nTLDR: Grandma couldn't log into her computer, because a Windows update had turned the narrator on.\n\nEDIT: For some reason, during every previous encounter with the narrator, it was blocking interactions between the mouse and the actual UI/programs. I encountered this on at least four devices, two with upgraded Windows 10 and two with clean installs.\nUntil now, I just assumed it did that to be able to read the labels of buttons back to the user without them accidentally clicking an unwanted button.\n\nIt never had occurred to me the it isn't supposed to do that...\n\n",
        "created_utc": 1536690865,
        "upvote_ratio": ""
    },
    {
        "title": "His \"thunderbox\" isn't displaying",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9f04gx/his_thunderbox_isnt_displaying/",
        "text": "[removed]",
        "created_utc": 1536690741,
        "upvote_ratio": ""
    },
    {
        "title": "\"Please help me with this very, very, very high priority request.\"",
        "author": "sleepieeskimo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ezvxy/please_help_me_with_this_very_very_very_high/",
        "text": "This story is about a \"productivity manager\" at my workplace. Let's call him Larry.\n\nJUNE:\nLarry tells me about a \"very high priority report\" that he needs from me. We get this type of request a bunch so I sent him a form he needs to fill out, as well as instructions on how to complete the form.\n\nJULY:\nAfter no word for a month, Larry requests a meeting with me in July so I can teach him how to fill out this form. I meet with him for an hour and literally fill out a sample form for him to look at.\n\nI don't hear from Larry for the rest of the month, despite following up twice.\n\nAUGUST:\nLarry asks me about the status of the report. I tell him I haven't considered starting because I don't have his forms, so I LITERALLY DON'T KNOW WHAT HE WANTS.\n\nLarry claims I never sent him any forms. I reforward him the original email from June. I reattach the form and instructions.\n\nSEPTEMBER:\nLarry called me today asking if he could meet with me tomorrow so I could teach him how to fill out the form. He wants to meet as soon as possible because this is a \"very high priority report.\"\n\n...",
        "created_utc": 1536689065,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, anyone can send an email, including the kid you gave up for adoption 40 years ago (Update)",
        "author": "MysteryHisyory",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ezo90/yes_anyone_can_send_an_email_including_the_kid/",
        "text": "[removed]",
        "created_utc": 1536687550,
        "upvote_ratio": ""
    },
    {
        "title": "New Hire New Laptop Request Post Haste!",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ezbt2/new_hire_new_laptop_request_post_haste/",
        "text": "Tech: Thank you for calling XYZ Help Desk...you're calling to complain about an existing ticket?  What's the ticket number?\n\nUser: 987654\n\nTech: OK, for a new laptop request for a new hire...placed on August 31, 4:37PM, is this correct?\n\nUser: Yes, and the new hire started on September 3.  Do you see the problem?\n\nTech: There's nothing further in the notes, it's marked as closed, the laptop was received by the user.\n\nUser: They started on Monday the third.  They didn't get the laptop until last Friday.\n\nTech: There is a one week timeframe for a new laptop to be imaged out to a new employee.  The laptop was issued on Friday, September 7, at the end of the week timeframe\n\nUser: That's not good enough.  I submitted on the 31st and requested it for the 3rd.\n\nTech: It was submitted toward the end of the day on Friday...\n\nUser: It doesn't matter when it was submitted.  I specifically wrote in the ticket that it needed to be completed by the employee's start date of the 3rd.\n\nTech: How can I help you?  Is there a problem with the laptop now?\n\nUser: I just wanted to let you guys know that this was not taken care of properly.\n\nTech: I'll make a note of it in the ticket notes.  Was there anything else I can assist you with?\n\nUser: No.\n\n\\*click\\*",
        "created_utc": 1536685115,
        "upvote_ratio": ""
    },
    {
        "title": "No.1 Most Trusted Dissertation Writing Service in UK",
        "author": "PhDMarkWilson",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eyti8/no1_most_trusted_dissertation_writing_service_in/",
        "text": "[removed]",
        "created_utc": 1536681631,
        "upvote_ratio": ""
    },
    {
        "title": "Shipboard Computer Factory Reset?",
        "author": "captduxing",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9exysx/shipboard_computer_factory_reset/",
        "text": "[removed]",
        "created_utc": 1536675616,
        "upvote_ratio": ""
    },
    {
        "title": "The Ritual",
        "author": "HINDBRAIN",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ewxc0/the_ritual/",
        "text": "I'm a developer, and had a ton of issues starting yesterday: failures to connect sockets, new crashes, and quadruple the compilation times.\n\nA SFC scan reveals corrupted files, etc etc, but after fixing that the slowdowns remain. Everybody else in the office is flummoxed. Coworkers suggest RAM tests, intel processor test, driver updates, nothing helps.\n\nEventually I notice in the resource monitor that cpu maximum frequency is at 30%. Ah? And it seems that the event logs have some messages about the cpu been throttled. Oho?\n\nI check the power plan, the bios settings, nothing. Then I notice the computer has been completely quiet the whole time. After a gpu stress test, yep, fan is dead. \n\nDismantling the computer and blowing air at the fan doesn't help. Eventually, I just poke it dejectedly, accidentally cutting myself and leaving a bit of blood on the fan. One last test afterwards and... it runs! Cpu maximum frequency is now at 120%!\n\nAll it took to quadruple the computer's power was one drop of developer blood.",
        "created_utc": 1536667431,
        "upvote_ratio": ""
    },
    {
        "title": "Your PC repair broke my Xbox Live and other things",
        "author": "muzzsjm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ewohh/your_pc_repair_broke_my_xbox_live_and_other_things/",
        "text": "A recent XBOX story on here takes me back to a few years ago when I ran my lan gaming centre 2010 to early 2015. It's a long one but a good one... I hope.\n\nThis is a story that happened over a 2-3 week period and I even kept the scrap of paper as a memento so I can treasure the list of faults I apparently caused and I have the emails saved in my inbox too.\n\nNaturally I used to do PC, laptop, phone and tech repairs on the side for extra income in my lan centre. One of my regular customers who was kind of a friend by the time of this story, he had recommended me to his sisters boyfriends dad for a PC repair. This was around the end of 2010 so we're still in the days of mass Windows XP use and most machines are now dual core with quad core being top of the range so I expect an older machine to arrive.\n\nThe dad brought the PC down it turns out to be an older Intel Pentium 4 Packard Bell so around 4 to 5 years old. It wasn't booting just going to BSD nothing major turned out to be one of the ram modules, so I diagnosed there and then as dead simple swap out part would be there next day as I have no stock of ram at the moment. The guy reports the machine is running slow and things keep crashing so I suggest a system tweak too. I recommended another 512mb of ram to help with his apps and a clean up inside the case I'll give the case a nice clean to optimise temps and get rid of the dust and grime, which I'll do for free so only charging him for ram and tweak up.\n\nObviously being a techie I mentioned with Windows 7 on the horizon as being mainstream it might be time for a new PC or upgrade soon to support Windows 7. As he was on a tight budget he says he'd start saving up but he'll bare with the older PC a bit longer. I suggested I could source 2nd hand ram if he wanted to save money but could only offer him small warranty as it was used, he agreed as it was about £15 cheaper. I always make it clear if I use 2nd hand parts but a lot of people want to save money. \n\nHe was very happy and away we go I charged him for the ram, tweak up plus system updates and I leave it at that but do the case clean for free and he collects next day in the evening. PC now boots, runs a bit quicker is up to date with free anti virus and is nice and clean with fans less noisy as they are no longer caked in dust and grime I even replaced thermal paste on the cpu. Quick and easy repair so I thought couple of hours work nothing stressful.\n\nSo the next day I closed for Christmas Eve and return the 2nd of January. As I ran the place on my own and only had part time staff I always took a long Christmas as most of year I'd only get away with odd days or half days off as I opened 6 days a week. This was my first year of trading so felt having run the place and set it up I needed a longer Christmas holiday with family. Upon opening my lan centre I'm greeted by several angry voice mails left from his wife saying I had ripped them off and several moan and groan emails from the dad/him claiming since I had bodged his PC loads of things had stopped working. \n\nAs he was only 2 miles away from my shop I rang up and agreed to take a look at the PC for free I'll drive over once my part time helper gets in. I arrive and for some reason PC wouldn't turn on so I take it back to my shop free of charge and apologise but stress this wouldn't be a ram problem. Whilst there they moan about their internet being slow I run a speed test and suggest they ring their ISP and Google the number for BT as speed seems to be under 1mb per second they were on 8mb broadband according to their contract/letter. I ask about other problems and they explain I'll see them when I get the computer working.\n\nUpon inspection in my shop it turns out the fuse had gone in the power lead so I give them a new kettle lead free and deliver it back all good. I plug it in and make sure it's working they seem happy no more further problems. I normally have a kettle lead in the car so bit annoying but I consider my free call out good service and they are a friend of a friend. A week later he/dad returns to my shop with the PC demanding a full refund and that I undo any of the work I had done. I'm bit confused I ask why and he explains the PC kept turning off or crashing so his wife took it to the PC repair store further down the high street as I am closed on Mondays. The other computer shop have replaced the power supply and have done a few other bits. I explain then its nothing to do with the ram and more than likely age related or down to the fact they had let dust and grime gather in the psu which I had cleaned out previous. \n\nI explain to him/dad that the ram is fine and what I had done had in no way damaged his machine and that being a 4 year old computer parts can fail too. I tell him I gave him a free call out and most businesses close over Christmas and New Year and Monday is my day off after a busy weekend. They go on and on about how I kept them waiting and I was slow to reply which is why they decided to use the other repair place. A bit annoyed I kept my cool and explained I had done loads of repairs and they were the first complaint I had.\n\nGetting no where they decide to leave and swear they'll speak to trading standards and leave a bad Facebook review. The next day I check my lan centre inbox and the wife has sent me a massive list of things that have gone wrong since I touched their PC they need to be fixed in 7 days or they'll go to a small claims court to get money from me. Attached is an invoice they were going to charge me £70 + £10 petrol money as they had a power supply replaced and had been to another local PC retailer who had to fix the bodge job I had done \"apparently\". They wanted more money for lost earnings as the dad was unable to update his building company accounts and records several times because of me. \n\nI email back and ask them to come and visit my lan centre or give me a ring so we can discuss I really want to help and explain everything to them. I ask for a full list of things they assume I had broken or had gone wrong as a result of my work. I assure them I haven't caused issues but would happily assist.\n\nThe wife replies saying she no longer has time to waste standing in my lan centre for me to be rude to her and that she has worked in IT a few times over the years and knows that I had tampered with their computer and everything was a result of me breaking the computer and costing them money. I had touched things they asked me not to and I obviously didn't know as much as my website claimed. I leave it at that and decide to leave them to it no win situation. I talk to the guy who recommended me and he is happy I've done all I can and texts his sister.\n\nNext day I get a scrap of paper posted through the shop door looks like a 9 year old written it bad grammar and scribbled address and signature, and an email pops up in my inbox.\n\nList of things his wife sent me:\n\n1. Xbox Live not working won't connect anymore since computer repair in December\n2. Xbox games keep crashing since computer repair in December\n3. Internet speed is now very slow\n4. Company accounts spreadsheet takes ages to load and crashes a lot\n5. Computer is louder and now has a knocking sound\n6. Mouse speed is too fast\n7. Games no longer run on the computer\n8. Son/boyfriend cannot access email anymore\n9. There were now two hard drives in the computer\n10. CD/DVD drive is turned off and won't open\n11. I had wasted their time and conned them out of money for faulty parts I knew were going to break I should refund them and pay for any costs to fix the computer.\n\nSo I email back as they won't answer calls and suggest they ring BT as their ISP might be able to fix the slow speed and I'm pretty sure the Xbox not connecting is related to this. I ask her to send me a video of the computer showing the CD/DVD drive not working and to include audio of the noises and show me the problems with email and games. \n\nAn hour later I get back a video sent via MMS to my mobile. The first thing she shows is the CD/DVD drive being turned off. On the screen there is an empty tick box for System Restore/System Backup WTF WTF WTF I literally laughed out loud. Next she fires up Outlook and it's asking for sons password and giving the standard error. I explain about going onto webmail looking up Outlook settings and doing a password reset.\n\nOn we go to the game problem...the game they are trying to run is Battlefield Bad Company 2... on a Pentium 4 with old ATI card and 768mb RAM. Naturally it takes ages to load and must be running at about 5fps. She then shows me the second hard drive which turns out to be the Windows XP install partition. \n\nFrustrated but unsurprisingly I emailed back the above with a long list of answers firstly I explain to her that this tick box is nothing to do with the CD/DVD drive and include a link to an online website explaining what System Restore/System Backup was in Windows XP. I expect many of you have worked out that the other computer repair shop had forgotten to plug the CD/DVD drive in when they changed PSU and the noise the computer was making was cables not managed and touching the cpu and case fan fins every now and then. I tell her to go back to them and say the drive is not plugged in. I finally explain to her that the computer is not good enough to run the game and I had told her husband before christmas the computer was near the end of its life. She then rings me up swearing calling me stupid because they have been able to play games on the computer in the past. \n\nShe slams the phone down and I never hear from them again. Needless to say me and the friend who recommended me still laugh about this now... his sister split up with the nutjobs son shortly after. \n\nI love this story and tell everyone because I've never gotten over the fact she claimed to work in IT and had no idea what System Restore was. I took a while trying to figure out if they were stupid or trying to con extra work out of me but to this day I just don't know lol. It's the most bizarre IT support story I have and shows people are mentalists.\n\nThose wanting to know I ran my lan centre for just under 5 years had a great time I loved every minute even the 6 day weeks, long hours and all night gaming sessions. I didn't make lots of money but I had a enough money to live off and made great friends who I still mix with today. I'd love to do it again and I reckon in the E-Sports age would make a killing and a lot more money. I closed down because I went back into IT full time as a manager which has enabled me to get a 4 bed big house and saved my relationship with my partner of 10 years. I still do tech repairs on the side and haven't had anyone near as bad.\n",
        "created_utc": 1536665192,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't you just believe me?",
        "author": "BradlePhotos",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9evimz/why_dont_you_just_believe_me/",
        "text": "So, a little bit of back story:\n\nAt 2nd level (myself) we don't get access to unlock accounts because that's a 1st level thing according to the Global IT (which to be fair, it is, but giving us access would be nice, even to view if the accounts are locked, which we also don't get access to):\n\nA lady has just come to me because her iPhone was asking her to re-enter her domain password for the wireless (we do have access to unlock the wireless lockouts, she assumed the password thing with all the other apps was due to her wifi) however upon hitting cancel so I can grab the Mac address loads of different applications were also asking for her password which to us at 2nd level is an immediate \"this person's account is probably locked\".\n\n\"Hey, it appears your account may be locked\"\n\n\"No it's not, I signed into my laptop this morning\"\n\n\"Your laptop saves your profile so you can still sign in if your account is locked as you aren't connected to the network when you log in\"\n\n\"But I logged into my laptop\"\n\n\"Ok, that doesn't mean you're not locked out, look, if we try to sign into Citrix we'll see 100% if your account is locked okay?\"\n\n\"But I know it isn't, as I signed into my laptop!\"\n\n\"But you came to me with your iPhone asking you to re-enter the wifi password, email password, Skype for Business password and SSO renewal on the corporate apps, to us that is an immediate red flag to say it's locked out, please just humour me and try to sign in here\"\n\n\"Fine, but I won't be locked out as I am signed into my laptop\"\n\n***User account is locked***\n\n\"Oh I am locked out, I'll phone the help desk\"\n\n\"No problem, glad to help\"\n\nWhy can't you just trust the person you're going to for help? I'm not here to lie to you, I want you to go away as fast as possible so I can go back to Reddit to look at /r/Aww\n\n\nEdit: I missed a bracket ",
        "created_utc": 1536652144,
        "upvote_ratio": ""
    },
    {
        "title": "\"It doesn't work when I do it!\"",
        "author": "FlashDaggerX",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9esavm/it_doesnt_work_when_i_do_it/",
        "text": "***Sister*** \"FDX, commere!\"\n\n***Me*** \"What?\"\n\n***Sister*** \"I can't pull up Google Classroom! It's giving me an error!\"\n\n***Me*** *Proceeds to get up, frustrated, as he was programming and listening to sweet tunes* \"*Coming*...\"\n\n*Tries to pull up Google Classroom, with her school account. It brings up a login prompt for an email*\n\n***Sister*** \"See? It doesn't work! It usually asks for a password!\"\n\n***Me*** *Enters her email, and it asks for her password*\n\n***Sister*** \"How did you do that?\"\n\n***Me*** \"Show me what you do.\"\n\n***Sister*** *Proceeds to enter her email, and it pulls up a password prompt* \"It doesn't work when I do it!\"\n\n***Me*** \"So I have the magic finger?\"\n\n***Sister*** \"YES! Anyway, thanks for your help brother!\" *Yes, we refer to each-other as brother and sister 'cause we're weird.*\n\n***Me*** *Goes back to talking to computers and listening to sweet, sweet tunes.*",
        "created_utc": 1536622630,
        "upvote_ratio": ""
    },
    {
        "title": "My user voted to use wechat over slack",
        "author": "dear_lord_help_me",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9es17v/my_user_voted_to_use_wechat_over_slack/",
        "text": "[removed]",
        "created_utc": 1536620508,
        "upvote_ratio": ""
    },
    {
        "title": "The time I saved a performance of The Vagina Monologues",
        "author": "nagumi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ert0y/the_time_i_saved_a_performance_of_the_vagina/",
        "text": "[removed]",
        "created_utc": 1536618733,
        "upvote_ratio": ""
    },
    {
        "title": "“I’m going to need a ping and tracert from the switch”",
        "author": "Burnacct1234ju",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9erqek/im_going_to_need_a_ping_and_tracert_from_the/",
        "text": "[removed]",
        "created_utc": 1536618180,
        "upvote_ratio": ""
    },
    {
        "title": "No, you can’t put computer software on a tablet. Also, no you can’t return the tablet you bought a year ago.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9er63t/no_you_cant_put_computer_software_on_a_tablet/",
        "text": "[removed]",
        "created_utc": 1536614012,
        "upvote_ratio": ""
    },
    {
        "title": "Alone in the Server Room",
        "author": "flash1035",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eqeue/alone_in_the_server_room/",
        "text": "[removed]",
        "created_utc": 1536608846,
        "upvote_ratio": ""
    },
    {
        "title": "My users voted to use wechat over slack",
        "author": "dear_lord_help_me",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eqb56/my_users_voted_to_use_wechat_over_slack/",
        "text": "[removed]",
        "created_utc": 1536608150,
        "upvote_ratio": ""
    },
    {
        "title": "My users voted to use wechat over slack",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eq22h/my_users_voted_to_use_wechat_over_slack/",
        "text": "[removed]",
        "created_utc": 1536606396,
        "upvote_ratio": ""
    },
    {
        "title": "WoE: Water Over Ethernet",
        "author": "Werro_123",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9epxj4/woe_water_over_ethernet/",
        "text": "Sorry about any bad formatting/editing.  I'm writing this in the few minutes I have between work and class, and I'll edit it when I get back home.\n\nI crawled out of bed and back to the office after a weekend of constant pouring rain today, to find my boss and one of my co workers discussing an issue with our traffic camera network (I work for a small city in SE Ohio).  The network consists of a switch in the basement of City Hall connected to dumb switches in the attics of City Hall and the police station next door, which then have PtP wireless bridges connected to provide backhaul for the cameras.  \n\nbasement switch --&gt; attic switches --&gt; multiple branches into wireless equipment\n\nThe link between our camera switch in the basement and the city hall attic had mysteriously dropped down to 10mbps, and some of the cameras (which had been somewhat spotty recently), had become completely unreachable.  \n\nWe tested the cable between the switches to rule it out on the 10mbps issue, and it tested OK, so the next step was to swap out the switch for one of our spares.  I started to pull the cables, and then one of them poured out water when it was unplugged.  The cable in question went outside onto the roof, took a short aerial run to a streetlight pole, traveled down the pole into a underground conduit, followed the conduit for half a block, and then terminated at another switch in a traffic control box.  \n\nWe think that the rain over the past few weeks seeped into the traffic box, drained into the cable conduit, and then made its way into the cable through some fault in the jacket.  It followed the rip cord inside the cable up to our attic through capillary action, and dripped into the switch through the port it was plugged into.  This has probably been happening every time it rained for the past month or so, and then the heavy rain over the weekend finally broke the camel's back. The switch is badly water damaged with some ports dead, and some only working on 10mbps.  The PCB has corrosion following the leads back from the port this cable was plugged into.\n\nTL;DR: Water made it's way into a cable that ran through an underground conduit.  Through capillary action, that water ended up inside a switch in our attic.\n ",
        "created_utc": 1536605492,
        "upvote_ratio": ""
    },
    {
        "title": "My users voted to use wechat over slack.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9epvyr/my_users_voted_to_use_wechat_over_slack/",
        "text": "[removed]",
        "created_utc": 1536605204,
        "upvote_ratio": ""
    },
    {
        "title": "$Website is down",
        "author": "aricelle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9epuqc/website_is_down/",
        "text": "This happened this morning, $User called in to HelpDesk to report that $OtherCompany's website was down.  \n\nI told $user that all systems for that website are down - Website, Phones, Faxes, everything - they've been down since last Wednesday.  \n\n$User: But what about their phones.   \n\n$Me: Also down.  \n\n$User: Their fax?   \n\n$Me: Yes, also down.  \n\n$User: When will they be up?  \n\n$Me: I don't know, you'll probably get an email.  \n\n$User: But when will they be back up?  \n\n$Me: I don't know, you'll probably get an email.  \n\n$User: But when will they be back up?  \n\n$Me: I don't know, your supervisor will tell you.  \n\n$User: But when will they be back up?  \n\n5 min later....  \n\n$User: But what about their phones?  \n\n$Me: Yes, those are down too.  \n\n$User: For everyone?  \n\n$Me: Yes, for everyone  \n\n$User: So, I'll get an email?  \n\n(SUCCESS!) $Me: Yes, you'll get an email.  \n\n$User: Then I'll just wait for that email - but I really need it by today.  \n\n10 min later...  \n\nReceived an email from $User's Supervisor -- $User tells me that $Website is down, but we really need it up for her. Is it possible to make an exception in this case?  ",
        "created_utc": 1536604982,
        "upvote_ratio": ""
    },
    {
        "title": "Wifi and motorcycles",
        "author": "sambeaux45",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9epegp/wifi_and_motorcycles/",
        "text": "I don't generally have to deal with motorcycles. I'm not really a motorcycle guy anyway.\n\n&amp;#x200B;\n\nAll police vehicles are tracked by 911. Until now, tracking the motorcycles hasn't been feasible. Our first bike had the new AVL system installed. This system also provides an internet connection to the officer.\n\n&amp;#x200B;\n\nI got a ticket a week ago stating that the officer was having some issues with his wifi connection on his motorcycle. The officer said that he could not walk more than 10 feet from his bike without losing signal. I assumed the officer was exaggerating.\n\n&amp;#x200B;\n\nI was finally able to get with the officer today. The installer who mounted the wifi antenna chose to mount it inside the light bracket on the back of the bike... The wifi antenna is basically inside a chunk of steel C channel behind the bike. Because of where the antenna is mounted, the only way to get signal more than 10-12' away is to stand directly behind the bike and hold your laptop at more or less the same height as the light bar in the back.\n\n&amp;#x200B;\n\nI've been trying to figure out how to craft a diplomatic email to the installer...",
        "created_utc": 1536601903,
        "upvote_ratio": ""
    },
    {
        "title": "Help Me with My Son's XBox",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eowau/help_me_with_my_sons_xbox/",
        "text": "Tech: Thank you for calling XYZ Help Desk...*gather initial information*.  \nIs this a company issued XBox?  (*had to ask, we of course don't have any company issued game consoles*).\n\nUser: No, it's not.  But can't you help us?  My son just wants to play his NBA2k18 game and it's asking for a password.\n\nTech: We really don't support these devices, you can try your local Best Buy or Microsoft customer support for XBox.\n\nUser: Well, I already have you on the phone here, can't you just remote on and help us?\n\nTech: No, we can't remote onto your XBox.  You should consult with Microsoft for your login/account issues.\n\nUser: Well, we forgot which email we used, and we tried all the one's we could think of.\n\nTech: We can't help you with your XBox.\n\nUser: Can you at least tell us which email we used?\n\nTech: We don't have access to that information?\n\nUser: You reset my password a few weeks ago.  Maybe when you did that it changed on the XBox too?\n\nTech: We can't change your XBox's information.\n\nUser: Well, this wasn't a problem until you reset my password.\n\nTech: Your work account, right?\n\nUser: Yes, the password for my work account because I was locked out and it wasn't taking my password so you guys reset it.\n\nTech: That would be for your work account, not whatever account your XBox uses.\n\nUser: Well, what if the XBox is using my work acocunt?\n\nTech: It would be using your work account's address as its \"username.\"  It would have a separate password for you.  Please contact Microsoft support.\n\nUser: But I already have you on the phone.\n\nTech: We don't support XBox.\n\nUser: So I have to contact Microsoft?\n\nTech: Yes.\n\n\\*click\\*",
        "created_utc": 1536598384,
        "upvote_ratio": ""
    },
    {
        "title": "She used an hdmi cable to connect one monitor to the other monitor.",
        "author": "Sutarmekeg",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eoauh/she_used_an_hdmi_cable_to_connect_one_monitor_to/",
        "text": "[removed]",
        "created_utc": 1536594284,
        "upvote_ratio": ""
    },
    {
        "title": "The Day I Saved a Wedding Reception",
        "author": "TechKeeper",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9enp3f/the_day_i_saved_a_wedding_reception/",
        "text": "Hey everyone - STL, FTP, all that good stuff. I was just reminded of a story from a few years ago and thought it would be a good one for my first post. So, without further ado - here's a tale of how I once saved a wedding reception.\n\nMy wife's cousin got married a few years ago. They were trying to do the reception on the cheap, so they asked me to do a photo slideshow (I previously worked at a small local TV station, so I have a video editing background). As an additional cost-saving measure, the groom's dad was the Emcee/DJ for the wedding.\n\nMy part of the reception went without a hitch and I thought I was done for the night, so I had a few cocktails. Well, I was wrong.\n\nThe \"DJ\" equipment consisted of a rented board, a couple of speakers and a personal laptop. Fast forward past most of the important reception items (first dance, etc.) and people are dancing around, generally having a good time. All of a sudden, we're nearly deafened by scratchy, skipping-type noises coming out of the speakers.\n\nThe groom's father was hurriedly trying to get the issue resolved. He tried another song, which started fine, but then the same thing happened. This happened 3 or 4 times, the sense of helplessness on his face increasing each time. He had no idea what was going on or how to fix it.\n\nBefore I know it, I'm approached and asked to figure out what the issue is and get it fixed. I, of course, agree. Have you ever had hundreds of people staring at you waiting for you to miraculously fix an issue on equipment that you've never touched before? I have and I've never sobered up quicker in my life.\n\nThe first thing I notice is there's an external hard drive connected to the laptop (I bet you can see where this is going). I poked around a bit and figured out that the music that was skipping was all being played from the external hard drive. I tried power-cycling it, checking connectors, etc. which obviously didn't help. A little further digging and I confirmed my suspicion - the external drive was on it's way out at a most inopportune time.\n\nI was able to locate some music on the internal laptop drive and played songs from there to keep things flowing, then copied as much as I could from the external, until it completely died. Finally, I set up a new playlist to use only songs on the internal drive, so the groom's dad can take back over.\n\nIt was probably the most stress I've ever felt doing tech support, but I didn't pay for a drink the rest of the night!\n\nTLDR; Dad decides to DJ his son's wedding, stores most of the music on an external hard drive, which predictably dies during the reception. I save the day by setting music to play from the internal laptop drive and recovering any files I can from the external.",
        "created_utc": 1536590212,
        "upvote_ratio": ""
    },
    {
        "title": "Space Heaters and Computer Don't Mix!",
        "author": "SaintThor",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ejein/space_heaters_and_computer_dont_mix/",
        "text": "Forewarning, I don't work in IT. But what I did is essentially the job. \n\nMy gym is like a second home, but I am a complete nerd at home (and proud of it). The owners/desk lady's were complaining about their computer being slow for a while, and I knew they had an IT guy that came in every month (for security/accounts protection and Mait).\n\n&amp;#x200B;\n\nOne day, The receptionist was complaining for a good 30 minutes about it. And I finally snapped. I walked up, said I was taking a look and they could trust me (We were all on good terms, second family right?)  \n\n\nGOD KNOWS WHAT I FOUND. \n\n&amp;#x200B;\n\nAs soon as I got 3 feet from the comp area, I could smell it. The dark, dusty, burning of electronics. I was horrified. Seeing a space heater ON the tower, I asked how often she had it on.   \n\n\n\"I have it on all the time, the Gym is air conditioned and I get so cold...\"  \n\n\nKeep in mind, this is the owners daughter so I couldn't give a slap down, she also didn't know any better. \n\n&amp;#x200B;\n\nOnce I opened the case, I found 4 inches. I'm not kidding here, 4 INCHES of dust from bottom up. SOLID, packed in. The case side that I pulled off was BLACK around the CPU area. I have no idea how this CPU didn't melt down. It was burning the case itself... how didn't it burn the MB along with it!\n\n&amp;#x200B;\n\nI cleaned out the case, and told her to give me till the next day to get some stuff ready. I wrote down spec's of the units exc, went home and rounded up spare parts. A new/used MB, Ram, CPU exc. I had a small solid state I wasn't using so I snagged that too. \n\n&amp;#x200B;\n\nNext day, I rebuilt the comp for them, added a fan for proper flow and cloned the OS over. Gave them a proper talk down on general Mait/cleaning. They ended up firing their IT guy, unofficially hiring me. So I help them and do mait/setups exc. I get a free gym pass.\n\n&amp;#x200B;\n\nWin win! \n\n(Front desk lady is now keeping the heater behind her surrounded by files. Thank god)\n\nSorry for format, first post here/first post actually telling a story. ",
        "created_utc": 1536551354,
        "upvote_ratio": ""
    },
    {
        "title": "I wonder how many times i will get transferred? Wonder what changes in each transfer",
        "author": "fearlesskiller",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ei86v/i_wonder_how_many_times_i_will_get_transferred/",
        "text": "[removed]",
        "created_utc": 1536541284,
        "upvote_ratio": ""
    },
    {
        "title": "Photos &gt; Safety.",
        "author": "HappyDaCat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ei21g/photos_safety/",
        "text": "LTL, FTP, etc. I'm a programming student who lives their parents. As such, most tech support in the household falls to me. This happened earlier today:\n\n&amp;nbsp;\n\n\nMe: A risk-averse student.\n\nMom: My mother, taking photos for eBay.\n\nMom: \"Hey, check it out! My phone makes a gurgling noise when I set it down.\"\n\nMe: \"Huh, lemme see.\"\n\nMy mother set the phone down, and it obligingly made a soft noise that sounded like bubbling and hissing. Alarm bells immediately went off in my head: Phones aren't supposed to make that noise, and the most obvious suspect was the battery, which was bad news.\n\nMe: \"Mom, I need you to gently set the phone on the table.\"\n\nMom, setting the phone down: \"Why's that?\"\n\nMe, gingerly picking up the phone: \"There is a chance that there is a problem with the battery. Worst case scenario, it could explode and spray flames and toxic fumes all over the room. I need to take it outside, and then look up the problem.\"\n\nMom: \"What!? NO!? Give my my phone back, I'm taking *pictures*!\" At this point, she starts trying to wrestle the phone away from me, and I have to put myself between her and the phone.\n\nMe: \"No. I'm taking this outside.\"\n\nMom: \"Well then you had better take a picture of that before you go!\" She pointed at a folded t-shirt that she had been in the process of photographing.\n\nMe: \"No. What part of \"spewing flames and toxic gas\" did you not understand? I'm taking it outside until I can figure out what's wrong.\"\n\n&amp;nbsp;\n\nAfter the phone was safely relocated outside, we both set about researching the problem. It turned out not to have been a battery issue, but rather an issue with the camera. As the phone was set down, the table came closer and closer, causing the camera to attempt to re-focus on it, making a noise that sounded similar to what you might expect a battery to sound like before failing when you shifted it's orientation.\n\nStill, I don't understand why anyone, when told that the object they were holding could poison them and burn them at the same time, would respond by demanding to retain possession of said object.",
        "created_utc": 1536539809,
        "upvote_ratio": ""
    },
    {
        "title": "A re-order that went very down hill",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ee77v/a_reorder_that_went_very_down_hill/",
        "text": "[removed]",
        "created_utc": 1536510007,
        "upvote_ratio": ""
    },
    {
        "title": "The identical order from hell",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9edymh/the_identical_order_from_hell/",
        "text": "[removed]",
        "created_utc": 1536508298,
        "upvote_ratio": ""
    },
    {
        "title": "User eventually agrees",
        "author": "DanielCade",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9edaft/user_eventually_agrees/",
        "text": "[removed]",
        "created_utc": 1536502910,
        "upvote_ratio": ""
    },
    {
        "title": "Caps Lock",
        "author": "ohitsgroovy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ecb0z/caps_lock/",
        "text": "Right so I work an after school job down at a local accounting firm as 2ic for ict support, which means jack shit considering there’s 2 of us, and they recently decided to upgrade all their systems from Windows 8 to Windows 10, and they had it done in one night. Anyway, us down in ICT Support weren’t told at all, which is frustrating as hell but ya know it is what it is, we knew it was coming just not overnight.\n\nAnyway, here’s a nice little ticket I had waiting as soon as I walked in that afternoon.\n\n$me - me\n$mngr - Head of Tech Support\n$id8 - person in need of both tech support and mental support \n$smeg - the guy who runs the business, a bit of a dumbass\n\nNew Ticket #00479 - Help!\n\n$id8: Hey, my new computer is a bit slow and hard to use, any way you could come up and help\n\n$me: Heya, I’m gonna be a while, I can come up at about 5:30pm? Otherwise is there something I can do now for you, try to help over this? \n\n$id8: My password isn’t working\n\n*I think I should point out that the Windows server that everything is linked to is now upgraded to Azure, so this probably did happen*\n\n$me: Okay, which password is this for?\n\n$id8: The (custom OS that is absolutely shit), I can’t login to manage my documents, also excel isn’t working, I told $mngr and he couldn’t work it out\n\n*It’s hella odd for two different passwords to not work for two different applications*\n\n$me: Okay, can you please restart your computer, it may take a minute, just sounds like your device didn’t connect to the server properly.\n\n$id8: Okay I did that and nothing’s working. Can you come up and have a look.\n\nI go up to see him and $smeg is with him\n\n$smeg: All under control now thanks $me, turns out the Internet wasn’t plugged in properly\n$me: Um okay, if it works great, but that wasn’t the issue sorry sir\n$smeg: Yes it was, how would you know?\n$me: Nevermind you’re probably right (wanting to avoid arguments, even though our Support programme is run online and when the internet goes down in the building we party)\n*Next Day, it’s a Saturday so I’m working full day*\n\nNew Ticket #00480 - Internet is not working again\n\n$me: How can I help?\n\n$id8: Your new system is broken, the old computer never had this issue\n\n$me: Okay, I’ll come up to look at it\n\n$id8: I want $mngr to come\n\n$me: He’s at his kid’s rugby, he’s out till one\n\n$id8: Well you fix it then\n\n*FF 25 mins until I’ve finally decided to go up, $smeg’s there again*\n\n$smeg: You did this on purpose\n\n$me: Me?\n\n$smeg: Yes, you were scared of me outsmarting you\n\n$me: Nope, I promise you I haven’t been up here since yesterday, I’ve been unjamming that printer of yours\n\n$id8: Fix This now\n\n$me: *checks one thing I think must be the issue, go to web browser and start typing, shows exactly what I need to know* Okay $id8, your issue is the caps lock is left on, unlike your old keyboard this new one has no light, so you have to just check every so often.\n\n$smeg: then why didn’t that fix it yesterday\n\n$id8: because he set it up\n\n$me: because when you unplugged the network cable, you also unplugged the keyboard, it doesn’t remember the caps lock state\n\n$id8: well how do I know if I am in it\n\n$me: don’t click the key\n\n$id8: then how am I supposed to use capital letters\n\n\nFor those wondering he unplugged every cable to re-do the Internet.\n\nThey keyboards remember the state rather than the actual computer, meaning that when you restart it, things like numlock &amp; capslock stay on, however when the workstation isn’t sending power, like when the cable is unplugged, the keyboard forgets everything, including custom keybinds\n\nEdit: Spelling\nEdit 2: Huge ass typo",
        "created_utc": 1536492522,
        "upvote_ratio": ""
    },
    {
        "title": "The user who eventually agreed",
        "author": "DanielCade",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9ebihs/the_user_who_eventually_agreed/",
        "text": "[removed]",
        "created_utc": 1536481126,
        "upvote_ratio": ""
    },
    {
        "title": "VPN Upgrade",
        "author": "guntario2715",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9eb0tg/vpn_upgrade/",
        "text": "[removed]",
        "created_utc": 1536474543,
        "upvote_ratio": ""
    },
    {
        "title": "It's supported, until it's not, part two",
        "author": "CipherTheTerminator",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e8ub1/its_supported_until_its_not_part_two/",
        "text": "Part 1 is [here](https://www.reddit.com/r/talesfromtechsupport/comments/91tetu/its_supported_until_its_not/)\n\nI've been working with Dingus for two months solid on the SoftLimp cluster backups. We've gotten a total of two good backups at this point and every day is me praying the DBA idiots at the client - the same ones I had to walk through how to copy files from one server to another five times before the client told me to do it at our overnight billing rate for moving the DBs for testing - don't explode the server by adding the user Bobby Tables.\n\nWe've dropped trying to back up SQL backup files that we don't need anyway, and it magically worked for a week, getting daily backups that had completely working screen shots. Miracles!\n\nHowever, we're still on single-host-only backups, and that's not where we need to be. Because I've been in IT for more than five minutes, I decide that we'll wait until after the Labor Day weekend to cut back over to the same drive specifications - all but those SQL backups sourced at the cluster name to make the underlying architecture irrelevant.\n\nYea, dead on arrival. Pretty much as expected. Cut back to only the OS drive, same deal, errors out with nothing I can do from my end but report and see what the hidden logs say from the Dingus tech.\n\nNope. Dingus tech reports that \"The Dingus Windows Agent ... cannot back up mapped network drives, iSCSI targets, or removable drives.\" The KB he linked to was edited the same day as his reporting this, and I don't have a way to see if iSCSI targets were the edit on that KB.\n\nSo the Dingus backup system, which we checked with their engineering staff was fully supported in this server's configuration , is in fact incompatible **across all the points** we were looking to clarify, and got clarified, as being supported.\n\nIt's not like this is a sale rep lying to the client; the appliance is already in use for other backups with great success - all of which use ISCSI mount points and are now 'no longer supported'.\n\n&amp;#x200B;\n\nI'm in talks with another Vendor who made their name in VM-only backups and has moved to physical machine and cloud-based machine backups. They actually support CSVs and it's cluster-aware.",
        "created_utc": 1536451881,
        "upvote_ratio": ""
    },
    {
        "title": "When the equipment calls your bluff",
        "author": "zinge",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e6l5h/when_the_equipment_calls_your_bluff/",
        "text": "Feel free to remove if this isn't strictly tech support. u/Gambatte's \"maintainer shock\" story reminded me of some of the other mystic tools in our arsenal, like the tech support aura and threatening machines with violence.\n\n\nQuick preface: I used to do community tech support as a kid, and in addition to a few bucks I would normally get paid in gear. Most of the people I supported had garages or storage sheds with old desktops, laptops, speakers, receivers, etc that they had replaced but never gotten rid of. They would gladly let me take it off their hands. I built up a decent collection of mismatched but quality stereo equipment, some of which I still use to this day.\n\nThe sound setup for my personal desktop is a pair of bookshelf speakers that were the extra surrounds from a 7.1 system about 12 years ago, and a home theater receiver that is about 30 years old. Recently, the receiver started acting up. It turns on, starts playing for about a minute, and then a relay clicks and the sound cuts out but the display is still live. Internet searches say it might be the DC protection circuit. Tried the usual, unplug and reconnect all the cables, etc.\n\nSo I open up the case and find a service manual online. My soldering and multimeter skills are mediocre at best, but I want it to know I'm serious. I give the stereo an angry glare. No dice.\n\nNext step: back to the internet. I found a little class-D amplifier that has decent reviews. I'm really only using the receiver as a speaker amp, so I'm hoping I can replace it relatively cheaply. New amp shows up, and I plug it in and try it for a few hours. The old receiver watches this process from a table on the other side of the room. Unfortunately, the new amp buzzes a bit from the same source and the power output isn't quite up to par.\n\nJust for kicks I decide to plug the old receiver back in while I decide what to do next, in case it's learned it's lesson. Apparently, it has. It's been working great for a week straight now with no dropouts. Maybe it's warily eyeing it's younger brother, still sitting in a pile of packing peanuts, ready to jump in and take it's place...\n\n\nTL;DR - We may have adopted you first, but you can always be replaced by another kid if you don't behave.",
        "created_utc": 1536433319,
        "upvote_ratio": ""
    },
    {
        "title": "“I can’t get my drugs!”",
        "author": "Klopford",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e4wez/i_cant_get_my_drugs/",
        "text": "I work for a company that produces medical devices and supplies. In particular, I am a technical support specialist for one product: a computerized medicine cabinet used in hospitals so nurses don’t have to go all the way down to the pharmacy to retrieve medication for patients. This call happened today.\n\nMe: Thank you for calling $company, my name is Klopford, how can I help you?\n\nDoctor: This is Dr. Blah and I’m having a problem with $product.\n\nMe: *checks call detail screen* And this is at $hospital?\n\nDoctor: No I’m at $otherHospital today.\n\nMe: Ok and which station is having a problem?\n\nDoctor: *frustrated* I don’t know, all of them? Look it won’t let me log in! I can’t get my drugs! It keeps saying “invalid userID!”\n\nI look up the stations for the hospital and find they’re on our legacy system, which only has accounts for individual hospitals. The newer system can maintain accounts for all hospitals within a network.\n\nMe: Are you using your credentials from $hospital?\n\nDoctor: Yes.\n\nMe: Do you know for a fact that they set up the same credentials for you at $otherHospital?\n\nDoctor: ...No\n\nMe: You need to talk to the pharmacist then to set up an account for this hospital.\n\nDoctor: ...Ok. Thanks.\n\nI’m glad he listened because I’ve definitely had people argue with me on this before. We’re not allowed to modify user accounts anyway.",
        "created_utc": 1536419157,
        "upvote_ratio": ""
    },
    {
        "title": "\"My password isn't wrong, I'm typing it like I always do.\"",
        "author": "dewhashish",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e4thj/my_password_isnt_wrong_im_typing_it_like_i_always/",
        "text": "I received a call yesterday from a user that was having an issue logging into his mac. I unlocked his account and told him to try again.\n\nU: \"No, it's not working. The password field just keeps shaking.\"\n\nM: \"OK, I unlocked your account. Try again.\"\n\nU \"No, it's not working.\"\n\nM: \"You're typing it in wrong. The server showed me 2 wrong passwords.\"\n\nU: \"I'm not typing it wrong. It's the same one I've been using all day!\"\n\nHow dare I assume he's typing it wrong. Shame on me. I reset his password and he's able to log in. 5 minutes later, he comes down to my desk. \n\nU: \"I think the keyboard is the issue. It hasn't been working right since I cleaned it.\"\n\nM: \"What did you use, soap and water?\"\n\nU: \"Yes, in a wet paper towel.\"\n\nI had to stop myself from laughing in his face. I said \"No, you can't do that. Next time use a monitor wipe!\"\n\nI give him a new keyboard and he goes back to his desk.",
        "created_utc": 1536418271,
        "upvote_ratio": ""
    },
    {
        "title": "Encyclopædia Moronica: M is for Maintainer Shock",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e3sij/encyclopædia_moronica_m_is_for_maintainer_shock/",
        "text": "Once, long ago, when the graceful plesiosaur still arced playfully through the skies, I was but a young technician, full of unearned confidence; headstrong and cocksure - or was it the other way around?  \nRegardless, I had just started working at a new branch, for a new supervisor, when one of the pieces of equipment I was newly responsible for broke down. I checked *everything*, yet found nothing - there was no logical reason for the equipment to be misbehaving in this way. Out of good ideas - and bad ones, and all other ideas in between - I went to my supervisor for help.  \nHe smiled. He walked over to the equipment, opened it up and inspected it, verified that there was nothing actually wrong, and then turned it off and on again.\n\nAnd the damned thing worked perfectly.\n\n&gt; *Supervisor:* There - it was just maintainer shock.\n\n&gt; *Me:* Que?\n\n&gt; *Supervisor:* When a new maintainer takes over responsibility for the equipment, it knows - and it starts playing up. You just have to reassure it, smooth things over. Then it will come right, all on it's own.\n\n&gt; *Me:* Riiiiiiiiiiiiiiiight. Maintainer shock.\n\nIt probably didn't help that I was looking at him as if he had just told me he had joined the [Cult Mechanicus.](http://warhammer40k.wikia.com/wiki/Cult_Mechanicus)\n\n&gt; *Supervisor:* Do you have a better explanation for why it's working now?\n\n&gt; *Me:* Uhhh...  \nNo.  \nSo... Maintainer shock?\n\n&gt; *Supervisor:* Maintainer shock.\n\n---\n\nMuch much *much* more recently, I was working a site. While the exact functions are different, the equipment in question is analogous to a coffee vending machine, so for the purposes of the anonymity and plausible deniability, that's exactly what it shall be for the remainder of this story.  \nThe helpdesk had carried out a planned firmware upgrade overnight, and part of my role in this tragedy of errors was that of the final inspection - to check that piping hot java was being delivered correctly, quickly, and as paid for. Naturally, as this upgrade had been completed overnight, I had been scheduled to carry out the final testing at the completely reasonable hour of 4 A.M. - hours before the site opened, and long before any sane customer might wander over in search of a early morning caffeine hit.\n\nSo naturally, the machine was not working.  \nIt beeped constantly, and the display showed ERROR. I checked everything I could access, but I could not find the source of the beeping - it was behind a panel that I was not permitted to open; there was a whole separate department that had the required skills/permissions/training. So, like a good technician, I carried out the usual initial troubleshooting steps - I removed the coffee cup, checked the dispenser was clear of obstructions, replaced the cup, turned it off, checked all lights extinguished, then turned it back on.  \nStill beeping. Still ERROR.\n\nDefeated, I called the helpdesk, explained the situation, what troubleshooting I had already completed, and that I would need a technician from the other department. Naturally, the helpdesk insisted on completing their script, so at their prompting, I did everything again. Finally, I turned the machine back on, and once again I was greeted with BEEP BEEP BEEP.  \nWith T's dotted and I's crossed, the helpdesk finally escalated the call to a technician in the appropriate department.\n\nI put my head down, and carried on with my other assigned work. It would be hours yet before the sun came up, and I had much else to do before my work would be complete.\n\n---\n\nHours passed.\n\nThe sun came up.\n\nMore hours passed.\n\n---\n\nAs it turned out, the manager of the other department had decided that this particular morning was the best possible time to hold the monthly Occupational Safety and Health meeting. Having been present at several of these in the past, I am certain that he proceeded to read the complete content of the entire slideshow to the assembled technicians, despite each and every one of them having two working eyes and the ability to read and comprehend the English language.  \nI discovered this when the Other Technician (OT) arrived.\n\n&gt; *OT:* Heya G!\n\n&gt; *ME:* OT! I was wondering when someone was going to turn up.\n\n&gt; *OT:* I would have been here sooner, but Manager held a Safety Meeting...\n\n&gt; *ME:* Say no more, say no more.\n\n&gt; *OT:* So what's going on?\n\n&gt; *ME:* Hell if I know, man. It keeps beeping, and it shows ERROR on the display.\n\n&gt; *OT:* Huh. Have you tried a Total Sales Reset?\n\nI immediately thought that this must be some sort of technician-level procedure, or technique - sometimes there are buttons concealed under the panels that can be accessed by removing a specific screw... However, as I had very little exposure to this particular device, I had no idea if there was such a thing.  \nWell - when in doubt, ask.\n\n&gt; *ME:* How do you do that?\n\n&gt; *OT:* It's easy; I'll show you.\n\nWith that, he led the way to the wall switch - the very same wall switch I had already used on two separate occasions to turn the coffee machine off and then back on again.\n\n&gt; *ME:* If you're just going to turn it off and back on again, I've already done that.  \nTwice.\n\n&gt; *OT:* Well, then a third time can't hurt, can it?\n\nHe turned it off.  \nAnd we were greeted by the glorious sound of silence as the beeping stopped.\n\nHe turned it back on again.\n\nAnd the silence continued.\n\n&gt; *ME:* You have got to be kidding me...\n\nThe beeping had stopped. The display no longer showed ERROR.\n\n&gt; *ME:* I have a rule that I'm `very` tempted to break right now.\n\n&gt; *OT:* What's that?\n\n&gt; *ME*: That I do not swear while at a customer's site.\n\n&gt; *OT:* Ha!\n\n&gt; *ME:* Fffffff... Piece of... Goddamned maintainer shock!\n\n&gt; *OT:* What's \"maintainer shock\"?\n\nAnd I relayed to him the maintainer shock story from my days as a much younger technician.\n\n&gt; *OT:* Huh. Yeah, when you put it like that, maintainer shock sounds about right.\n\n&gt; *ME:* Maintainer shock.\n\n---\n\nIt has been nearly a month since the upgrade.  \nAt the time of writing, there have been a grand total of zero (0) issues with any of the coffee vending machines since I was last on site - I can only assume that the Machine Spirit was appeased...",
        "created_utc": 1536407709,
        "upvote_ratio": ""
    },
    {
        "title": "How many times have you been laid off from a tech support job due to being swallowed-up by a larger company.",
        "author": "CiscoDuck",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e2mc4/how_many_times_have_you_been_laid_off_from_a_tech/",
        "text": "[removed]",
        "created_utc": 1536392924,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from the Scottish-Sounding Antivirus Company No. 2: Hardware Bypassing Viruses and Other Fairy Tales",
        "author": "goretsky",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9e2kqi/tales_from_the_scottishsounding_antivirus_company/",
        "text": "[**NOTE:**  TftS-SAVC #1 is located [here](https://www.reddit.com/r/talesfromtechsupport/comments/7x8av3/tales_from_the_scottishsounding_anti_virus/).  AG]\n\n#Dramatis Personae\n`$Customer` - *the programmer at the other end of the phone line*  \n`$Me` - *as well, me, /u/goretsky*  \n`$TheBoss` - *the founder of the Scottish-Sounding Antivirus Company* (not present when this happened, but hey, he's `$TheBoss`)\n\n#Prelude\nI had now been working for `$TheBoss` for a couple of months now, so had become fairly well-versed in the routine sorts of calls that came in, and was more confident \nabout handling them.  And they usually didn't last that long; as the usual limit was the speed of the person at the other end needing to type in whatever I told them to disinfect their PC.    Because of this, I had become rather blasé about picking up the phone and answering calls.  Even if I should have first gone to the bathroom.\n\n#The Call\nThis actually happened while the `$TheBoss` wasn't home, so it was just me and a few of his wife's cats in the house.  I was sitting in front of `$TheBoss`'s BBS computer, reading and occasionally answering messages on their from customers, when the phone rang.  I went over to the kitchen table, picked it, and the conversation went something like this:\n\n`$Me`: \"Good morning, `$TheBoss` Associates.  How may I help you?\"  My bladder was starting to feel a little full, but I could certainly finish this one call, first.\n\n`$Customer`:  \"I have a computer virus that's bypassing the [write-protect tabs](https://en.wikipedia.org/wiki/File:Floppy_tabs_3x2.jpg) on my floppies and infecting the files on them.\"  \n\nNow, I knew enough about floppy diskettes and drives to know that write-protection on the floppies was **hardware-based**.  You put the sticker over the write-protect notch on a 5.25\" floppy diskette, or flipped the tab open on a 3.5\" diskette, and **nothing** could write to the diskette, because it was all based in hardware, and could not be bypassed in software.  In this particular case, the customer only had 5.25\" floppy drives, which used write-protect tab stickers to block the write-enable notch on the floppy, which blocked the infra-red LED/photo transistor used to check if the notch was present.\n\nI explained all this to `$Customer`.  He insisted that this virus was different, and that he was a programmer, and knew just as well as I that floppy diskette drives' write-protection was hardware-based, but this was still happening.  Ergo, he had a computer virus which could bypass hardware-based write-protection.  \n\n`$Me`: \"Okay, well let's test this.  Can you put a write-protected floppy diskette in with some uninfected files on them, do a directory to tell me their size (this was displayed in bytes under DOS), then run a couple and let me know if they increase in size?\"  \n\n`$Customer`:  Put's write-protected floppy diskette in.  Does directory.  Gives size of some files.  Runs a couple.  Reports size back.  The .COM file increased in size by about 1,800 bytes, the .EXE file by a little more.  It was the [Dark Avenger](https://home.mcafee.com/virusinfo/virusprofile.aspx?key=333) virus (also known as the Eddie virus), a file infector written by a prolific Bulgarian virus author.\n\n`$Me`: \"That's odd.\"  Starting to wonder if this virus author had somehow managed to figure out a way to bypass a hardware restriction while squirming uncomfortably due to the rising pressure on my bladder.\n\nFor the next forty-five minutes, I'm going back and forth with the customer performing every check I can think of (running MEM command to see if the virus has reduced the amount of conventional memory, cold-booting from original MS-DOS boot diskettes, etc.) and I think my bladder's about to explode.\n\nFinally, the `$Customer` drops this on me:  \"I can even put another piece of tape over the notch and it doesn't make any difference.\"\n\nWait a second, tape?  What the heck?\n\n`$Me`: \"You just mentioned tape.  What kind of tape are you using?\"  I'm thinking maybe something like electrical tape.\n\n`$Customer`:  \"Scotch tape.  From the dispenser at my desk.\"\n\nThe realization begins to dawn on me, and I maintain control and do not wet myself.\n\n[Scotch tape](https://en.wikipedia.org/wiki/Scotch_tape) as it's popular known in the U.S., and called [Sellotape](https://en.wikipedia.org/wiki/Sellotape) in the U.K., is transparent.  Apparently, it's not just transparent to visible light, but infra-red light as well.\n\nLike the infra-red LEDs used in floppy diskette drive write-protection mechanisms.\n\nThis customer has kept me on the phone for forty-give minutes trying to come up with every possible check I can think of, and I'm about to wet myself, and he's not write-protecting his floppies correctly.\n\n`$Me`: \"Do you have any of the actual floppy diskette write-protect tabs around somewhere?  Could you try using one of those in place of Scotch tape, and then let me know what happens?  Please, just humor me.\"\n\n`$Customer`:  \"Okay, but it won't make any difference.  \n\nPause.  \n\n`$Customer`:  \"Oh.  That fixed it.  I had been using Scotch tape since it was less expensive than buying sheets of write-protect tabs.\"\n\nI very quickly explain to the customer, since I'm about to explode, that the write-protect sensor in floppy diskette drives is infra-red, and that the Scotch tape is invisible to infra-red.  I thank him for calling, explain he needs to re-write protect all the floppies he used Scotch tape on because they are writeable, and hang up.  \n\nFinally, off to the bathroom for a well-deserved biobreak.\n\n#Moral of the story\nAgain, this is one of those situations which hammered into me that you cannot always take what a customer says at face-value.  Had I had the cluefulness to the ask the customer **how** they were write-protecting their floppy diskettes at the beginning of the call, I would have been able to go to the bathroom on considerable more comfort.\n\nOh, and for the record, I never came across another person who used transparent tape to write-protect their floppies.\n\nRegards,\n\nAryeh Goretsky",
        "created_utc": 1536392388,
        "upvote_ratio": ""
    },
    {
        "title": "Why I don't like remote work...and a splash of r/pettyrevenge",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9dz6mw/why_i_dont_like_remote_workand_a_splash_of/",
        "text": "[removed]",
        "created_utc": 1536359106,
        "upvote_ratio": ""
    },
    {
        "title": "TIL to read all release notes",
        "author": "ISeeNothingKNT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9dxmse/til_to_read_all_release_notes/",
        "text": "X-post from r/TIFU\n\nHappened yesterday not today and on mobile etc.\n\nI had planned an upgrade on one of our systems going from version A to version E and I checked the release notes for version E and spoke to support about this upgrade and was told there should be no issues with this upgrade so I planned it for yesterday and it shouldve been a easy 10 minute upgrade so I wasn't bothered that it was my Friday and sechduled it for 1, hoping to do it after lunch bit didn't get a chance to go to lunch first so I completed the upgrade and went to lunch.\n\nCome back from lunch and look at my different monitoring systems and my emails and noticed that I had a system screaming at me so I look into it and it seems to have lost all connection to it's storage which I have just upgraded, this was my oh fuck moment so I opened P1 cases with both the storage vendor and the systems vendor, this was the moment I also realised I wasn't going home on time that night.\n\nStorage vendor comes back saying from the logs you sent we can see no problems so we go into a support session and that's when they drop the bomb on me, in version B the default permissions changed from allow all to deny all. At which point I say a few more choice words and say I have to get onto the systems vendor to see about the best way of restoring the system.\n\nThe systems vendor told me that this was either going to be an easy fix or we're going to be here for the next couple of hours, my manager also choose this time to remind me that this system HAS to be back up by 7PM or I start burning through company money very quickly (SLA's etc etc) it was now 4PM, countdown started.\n\nMe and the systems vendor got down to it and did our best to restore services, I'm reminded of the countdown as more and more people leaving the office but we finally get the system rebuilt and data restored at which point I look round and see the office is empty which meant shit, it's passed 7PM so I sit back down defeated at which point I remembered the person working till 7 that day was working from home and he's still online, look at the time 18:30, thank fuck, my arse is saved.\n\nTL;DR Always check all release notes and don't make changes just before the weekend, unless you want to replan everything.",
        "created_utc": 1536348233,
        "upvote_ratio": ""
    },
    {
        "title": "Crunchy Keys are the new Sticky Keys",
        "author": "durkbonez",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/9dwlwu/crunchy_keys_are_the_new_sticky_keys/",
        "text": "[removed]",
        "created_utc": 1536341724,
        "upvote_ratio": ""
    }
]