[
    {
        "title": "Customer wants essentially a forever warranty",
        "author": "Darwi_Odrade_",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z50r0/customer_wants_essentially_a_forever_warranty/",
        "text": "I work at a large mobile phone carrier in tech support. I got a call from this guy a month or so ago, and he's pissed because the software update basically horked his tablet. This tablet was not purchased from us, he is not the original user, and it's 3 years old. Three strikes against us replacing the device under warranty. Of course I offer to troubleshoot but he says he already did a factory reset. OK, that's fine, nothing else I can do here then... But not according to this dude. He was convinced that because the software was a new update that the software should have a new warranty. I explained to him every which way I could think of that the warranty doesn't work that way - it's a 1 year manufacturers warranty and software falls under that one year of coverage. ANY device that gets a software update runs this risk. \n\nI can sort of see his point - it really sucks for a new update to crash an old device - but that's the risk we take every time software on any electronic device is updated. It's a small risk, but it's always there. Frustrating to be sure... But that's not our fault. He ended up wanting to talk to Google. I told him up front they won't be able to do much for you, but that's what he wanted. \n\nI spent a good 45 minutes explaining to this guy how a basic warranty works and he either refused to understand or refused to agree... It's so aggravating, refusing to accept the truth won't make it not true! ",
        "created_utc": 1489412430,
        "upvote_ratio": ""
    },
    {
        "title": "That's fo' hunnid dolla'!",
        "author": "lyingassplatypus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z3nm0/thats_fo_hunnid_dolla/",
        "text": "\"Thank you for calling, my name is lyingassplatypus, how may I assist you today?\" \n\n\"Shiiiet.\"\n\n\"*internally* Shit.\"\n\n\"What you say yo name was?\"\n\n\"Lyingassplatypus, sir.\"\n\n\"Ey, man. Ey. Listen. Yo bill got me fucked up, bruh. Y'all charging me FO' HUNNID FUCKIN DOLLA, yo girl at the office tellin' me my bill gon' be two fiddy. This damn bill can't be right.\"\n\n\"I'm sorry, sir, you've been routed here to tech support. Were you having any issues with your services or equipment? If it is strictly related to billing, I can get you over to the correct department to offer you a breakdown of the charges and assist you with any billing disputes. *internally* Please say yes, please say yes, please say yes.\"\n\n\"Naw, dawg. You mean you can't see my bill? I'm lookin' at my bill right now, and you KNOW yo girl fucked up, y'all better give me a credit or something fo' dis uh, dis inconvenience - dis a inconvenience, y'all can't just be doin' people like this, you better get me a supervisor or something, dawg, 'cause I'm not paying this bill. Y'all better give me some credit for dis inconvenience and some channels fo' free.\"\n\n\"Hm. Hang on just a moment, sir. Let me review your billing. I will advise that I'm not a specially trained billing agent, though I do have some access to your regular statements. I won't deny you a supervisor, though. I just have to build up a memo for why I'm requesting one, if that's alright.\"\n\n\"Aight.\"\n\n\"Hm. Sir, it looks like you're paying roughly $315 per month, and it includes all available services, including some upgrades and full channel subscriptions. These things seem to have a lot of discounts already attached to them. On the statement that you have on hand, you mentioned that you were being billed $400?\"\n\n\"Yeah, man. That's what I'm talking about right there. That's fo' hunnid dolla'!\"\n\n\"I'm sorry, sir. Do you mean the $315?\"\n\n\"Yeah, man!\"\n\n\"Maybe I'm missing something, sir? I don't see any extra charges that would get this close to $400.\"\n\n\"Okay, man, look: $315?\"\n\n\"Yes sir, that for sure I can see here.\"\n\n\"Add $85 to that. How much you get?\"\n\n\"$400, but that's rounding up almost a full $100 that aren't being charged.\"\n\n\"Look, *Lyingassplatypus*, you got my bill, you can see I'm being charged fo' hunnid dolla', let me speak wit yo supervisor, please.\"\n\n\"Of course, sir. I'll add in all of the data I've collected so far. My apologies for any confusion and inconvenience this has brought you. Obviously you are not satisfied with the pricing for your packaging. If there's anything we can do, yadda-yadda-yadda.\"\n\n\nSupe sent him to billing. ",
        "created_utc": 1489388333,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do you think my child should stay up late watching Disney Movies?\"",
        "author": "writeandknow",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z36b4/do_you_think_my_child_should_stay_up_late/",
        "text": "(I'm working on the 211 referral line, referring people in poverty to resources. A man called in who has called in previously to ask about parenting questions.)\n\nM: \"So I have a question.\"\n\nW: \"Yes, sir?\"\n\nM: \"My daughter's staying at a friend's house.... And she's watching a movie with her friend.\"\n\nW: *Pause* \"Yes, sir.\"\n\nM: \"And... I'm not sure if I should let her stay up and finish the movie.\"\n\nW: \"Sir?\"\n\nM: \"Well, school is tomorrow. And it's late. I'm not sure if I should let her stay up and finish the movie or not.\"\n\nW: \"Well, sir, how much longer would it be?\" (Not exactly our cup of tea, but what the hell. We're slow.) \n\nM: \"About two hours. Do you think I should let her stay up watching it with school tomorrow?\"\n\nW: \"I don't know, sir. You're the parent. You have the choice of whether you think you should let her stay up and watch it or not, and whether that would be a good idea or not.\"\n\nM: *When he speaks again it is as if a light bulb has gone off in his head.* \"Oh... I don't think she should watch the Disney movie and stay up that late.\"\n\nW: \"That is completely your choice, sir, not to let her stay up that late.\" (It was like 11:30 at that point, so I was on his side.) \n\nM: \"OK. It's my choice... I see. Thank you.\" *Click.*\n\nHe didn't call back. I had gotten the impression from speaking with him previously that he had recently divorced, and this arena was all new to him.",
        "created_utc": 1489380106,
        "upvote_ratio": ""
    },
    {
        "title": "\"You won't refer me to the food pantry that won't serve me because I'm not in their zip code! I'm going to sue!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z34g3/you_wont_refer_me_to_the_food_pantry_that_wont/",
        "text": "[deleted]",
        "created_utc": 1489379342,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hurting my talk time\"",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z2sru/hurting_my_talk_time/",
        "text": "So, this happened about a few days ago. The company I work for has many departments... billing, tech etc. I work in tech. I took a call for an agent saying he was missing channels. Easy enough! I look up the work order and this is the conversation that followed. D is me and B is bimbo. \n\nD: Okay, so I see the order here, what are the channel numbers?\n\nB: Uhhh, *gives them*\n\nD: Okay, lemme go check my tool.\n\nB: Alright.\n\nD: okay, so I am unable to take this call because it's another departments issue, they need to be called.\n\nB: Alright well, the order is complete and this really hurt my talk time so i'm dropping the customer here, have a good day! \n\n...you fucking bitch.\n\nD: *to customer* I am so sorry that happened, it'll just be a few seconds and we'll have those channels up. \n\nI called the department. It took 2 minutes to get it up and running. She wrote on the customer's account so I had her ID. I gave it to my supervisor and she got a warning. Karma served. Don't dump customers on me because you're too lazy to do your job.",
        "created_utc": 1489374767,
        "upvote_ratio": ""
    },
    {
        "title": "It's Not That Hard",
        "author": "bookphoenix",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z2gy1/its_not_that_hard/",
        "text": "Working in a call center for a home warranty, blah blah blah.I talked to technicians and explain to customers. I talk to customers and explain to technicians.\n\n&amp;nbsp;\n\nNow, there aren't a whole lot of rules we have for our technicians, but there's defintiely a few of them - most importantly perhaps that they have to actually *see* the thing the customer is complaining about in person with their eyes *before* they give us a report. You would think the reasons for this would be obvious. And yet, I got a call from a customer wanting to know how the technician could know which codes were needed before looking at her water heater.\n\n&amp;nbsp;\n\nGreat question! He can't. *facepalm forever*",
        "created_utc": 1489370499,
        "upvote_ratio": ""
    },
    {
        "title": "So you're not going to break policy?",
        "author": "teaordie",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z26kp/so_youre_not_going_to_break_policy/",
        "text": "I work for an institution that is currently in the news for employees allegedly going against policy, and even breaking the law just to get sales and meet goals. \n\nI get a call on Saturday from a girl who wants to open a tax free savings account (TFSA). We can open accounts in real time provided they are of legal age, a Canadian resident, and have sufficent ID on file. For ID we have two lists. List one is primary ID like drivers license, passport, nexus card, etc. List 2 is secondary such as birth certificate, social insurance number and provincial health card. To open an account You need one from list 1 or two from list 2. \n\nThis customer has one from list 2, and a *student card* on file. Student cards do not appear anywhere on the list of our approved ID. Thus she does not have sufficient ID for a live account opening. She has to go into a branch. This is where things get interesting. \n\nHer: What do you mean I can't open an account with you?\n\nMe: You don't have enough ID on file with us. You need to go in to the branch with photo id to open the account and have them update your profile. \n\nHer: But I just did this with my other savings last month. \n\nCue record scratch\n\nMe: one moment please - put her on hold\n\nI review her savings account, and sure enough, one of us opened an account two weeks ago over the phone. I check the journal, and nope, ID hasn't been changed since then. They did it with insufficient ID. Fire off email to her TM in case this escalates due to the media issue currently going on. Go back to the customer. \n\nMe: thank you for holding. I did confirm that the account you opened 2 weeks ago was done over the phone, but that account opening did not conform to our procedures and I will not be able to open another account for you today. \n\nHer: so you're not going to get me my TFSA today? \n\nMe: I'm very sorry, but no, I can't do it over the phone. \n\nHer: Why not? \n\nMe: You dont have enough ID on file for us to open an account live. It appears the previous agent made an oversight, but a tfsa is an account registered with the Canadian government and it would be a grave error to open it against policy .\n\nHer: so....I cant open the account with you? \n\nMe: No. \n\nHer: this is so stupid. The other girl did it. Why can't you just do it too?\n\nMe: As I said, you don't have ID on file, this account is registered with the government, so opening it up without id may not only be against policy but possibly also illegal. I'm not willing to take that risk. \n\nHer: whatever. I'll call back tomorrow. \n\nI saved her account information. I plan on checking on Tuesday when I'm back in to see if anyone did in fact open her a tfsa over the phone. ",
        "created_utc": 1489366876,
        "upvote_ratio": ""
    },
    {
        "title": "There are very few things I hate more than answering machines that make it sound like the person picked up.",
        "author": "bethlmnop",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z0mcg/there_are_very_few_things_i_hate_more_than/",
        "text": "I work for my college's call center, which means we call alums/parents of current students to update contact info, see how they're doing, get input on some of our summer programs, and ask for donations for our scholarship fund. We don't take calls, we just make them. There's nothing I hate more than those answering machines that go something like: \"Hey! .... hello? .... are you there? Hello? .... Haaaaa gotcha!! Leave a message!!\" I just sit there saying \"Hello?\" and frantically checking to see what came unplugged, only for a dumb joke. It's funny when you're in middle school, but you'd think adults would be a bit more professional, especially since most of our graduates are business owners or independent contractors. ",
        "created_utc": 1489349011,
        "upvote_ratio": ""
    },
    {
        "title": "You're Being Very Abusive to Me and My Business",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5z06fb/youre_being_very_abusive_to_me_and_my_business/",
        "text": "So, before I begin with the story, I'm going to state a little background info. This was posted in r/talesfromtechsupport. I have been doing this tech support job for a company for a little over 6 months and I honestly love it. We troubleshoot the company's internet, TV and phone service that it offers and we also dispatch out technicians if the issue cannot be resolved over the phone. One day I had this woman call in and she had a small business. This is how the call went. I will identify myself as D (for my username) and her as W.\nD: Hi, thank you for calling (company name) my name is D, how can I help you?\n\nW: my internet is not working. I need it for business purposes, can you help me?\n\nD: Sure... let's go take a look. I need your information to better help you.\n\nW: *gives it*\n\nD: Okay, so, have you tried turning it off and turning it back on?\n\nW: Yes.\n\nD: Hmmm, well I do see something going on, so I'm going to send out a tech.\n\nW: Okay, can you get someone out to me tonight?\n\nNow, here's the issue. She lived in a very rural area and techs go out to that area 2-3 times per week, she called on a Monday and the earliest available date was Thursday.\nD: I will see what I can do... *getting the appointment ready* So, the earliest date I have is Thursday.\n\nW: Are you kidding me? No, that's ridiculous. I am a business so I deserve a tech right now!\n \nD: I'm sorry, that's the earliest date I have.\n\nW: Well, can I speak to a supervisor?\n\nD: I can go check. *Supe refuses* There are no supes available right now.\n\nW: Well, I can't believe this. (Company) is so abusive and so are you. You're being very abusive to me and my business and I'm letting the whole world know. You're on Facebook Live buddy.\n\nD: Uh, what?\n\nW: So, listen everyone, this guy is being very abusive and I am losing money because he cannot get a tech out to me tonight. This is uncalled for and this is being sent to (escalation place)\\\n\nAt that point, I hung up because we are aloud to if they are being slanderous. But that is it!\n\n\n\n",
        "created_utc": 1489344187,
        "upvote_ratio": ""
    },
    {
        "title": "I KNOW HOW TO COPY AND PASTE!",
        "author": "guitargirlmolly",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yzqhu/i_know_how_to_copy_and_paste/",
        "text": "Background: I work for a mid-sized global payment processor. We have the option for end-users to reach out to us either by phone or email - this exchange took place over email, so if this is inappropriate for this subreddit let me know! \n\nI got an email from a customer regarding their license key not being accepted. They listed the license key in the email, and I noticed they had accidentally used an I instead of a 1. Common mistake, easily rectified by copy and pasting. So I wrote back an email something like: \n\n*Hi Customer,* \n\n*We recommend copying and pasting the license key to ensure accuracy - I see that the license key you included in your last email included XXIXX instead of XX1XX. I have included instructions for copy and pasting below for your convenience:* \n\n*[instructions]*\n\n*Feel free to reach out to us with any additional questions.*\n\nAnd I thought that would be the end of it. \n\nLucky me, I happened to also receive their response in my queue: \n\n\"I KNOW HOW TO COPY AND PASTE, AS WELL AS TO TRY DIFFERENT FONTS TO MAKE SURE THE CHARACTERS ARE THE SAME. HOW DARE YOU CONDESCEND TO ME. SEND ME A FUNCTIONING LICENSE KEY OR REFUND MY MONEY.\" \n\nI resent the email above, clarifying that I did not intend to condescend or assume anything about his intelligence, but that I'd noticed the key he provided was different than the one we sent after the order, so I concluded that copy and pasting would have solved the issue. \n\nHe never responded. But I noticed he called back a few days later and got his refund. \n\nSome people. ",
        "created_utc": 1489339273,
        "upvote_ratio": ""
    },
    {
        "title": "It's your fault I cheated!",
        "author": "Cosmicbody",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yzlms/its_your_fault_i_cheated/",
        "text": "Tldr: customer cheated on his wife, bought genital wart cream from us, neighbor called him bumpy, he got un-sympathetic me. \n\nMe: generic call answer \n\nCx: How could you do this! Your shitty packaging made everyone in the neighborhood know!!! \n\nMe: I'm so sorry about this sir, could you explain the problem? \n\nCx: My whole town knows I have genital warts now!!! My son saw the cream! I demand compensation! \n\nMe: Was there anything wrong with your product? Was the box opened in any way? \n\nCx: No! Listen! My son told my wife! The neighbor calls me bumpy now!!!! I had to explain to everyone! This is your fault! Your stupid product caused all of this! If I'd have known it'd be this much trouble to get the cream I wouldn't have cheated!!!!! \n\nMe: I'm sorry sir but if there's nothing wrong with the product then there's nothing I can help you with. \n\nCx: Listen you whore! \n\nMe: *cuts him off* If you use language like that again I'll have to disconnect. \n\nCx: Fuck- \n\nMe: *click*\n\nI got in no trouble for that, it was wonderful.",
        "created_utc": 1489337750,
        "upvote_ratio": ""
    },
    {
        "title": "Those customers that make the job a little bit better",
        "author": "GiveMeYourUpvotesPlz",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yzh4g/those_customers_that_make_the_job_a_little_bit/",
        "text": "Hey dudes, so I dealt with a very different kind of customer to the ones that most of us deal with on a daily basis. I was helping out doing some overtime at my centre as we were short staffed and was pretty frazzled due to the high numbers of calls coming in today. I was about to go home when I had one last call come in. My heart instantly dropped as I didn't want to deal with another call a minute before I'm meant to leave but it was a very pleasant experience.\n\nWe'll call this lady welsh woman or ww.\n\nMe: Service desk GiveMeYourUpvotesPlz speaking, can I take your full name please?\n\nWW: Hi G, it's **** ******.\n\nMe: How can I help ma'am?\n\nWW: Yeah I have a small problem, my reports for sales are not showing on my laptop.\n\n*Oh boy, this is something we don't support on our desk and only our head office can fix it. This woman was not going to like this from my experiences with other customers*\n\nMe: Oh I'm very sorry ma'am but we don't actually support the sales summary on our end but I'll go ahead and forward this call straight through to my colleague in head office so it can be actioned as quick as possible.\n\nww: Can I ask who I'm speaking to please?\n\nMe: *gulp* yes certainly you're speaking to ****.\n\n*Here comes the twist*\n\nWW: Do you know what ****, you're the nicest agent I've spoken to on your desk.\n\nMe: *D'aaaaaaw stop it you* \n\n\nJust goes to show that not every customer you speak to is a cock juggling thunder cunt and you get some rare gems like this lady who make the job that little bit easier :)",
        "created_utc": 1489336311,
        "upvote_ratio": ""
    },
    {
        "title": "\"Your CEO is stepping down. It'd be a shame if anything happened to her, wouldn't it?\"",
        "author": "writeandknow",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yzfne/your_ceo_is_stepping_down_itd_be_a_shame_if/",
        "text": "I worked at a food pantry hotline a few years ago for a year. One day a gentlemen was getting served by a popular food pantry, but moved out of the zip code area. A lot of our pantries raised funds locally so they were only able to serve local areas.\n\nWe had to reschedule him to a new pantry, after many phone calls. We got him into a pantry, but the pantry was closed. He called back the next day, furious. The food pantry had promised me they'd call everyone on the list to let them know about rescheduling.\n\nM: \"I was not informed that the food pantry was closed! I am upset!\" \n\nS: \"I understand, sir. I--\"\n\nM: \"No, you don't understand. I rode my bike a mile in the snow to get there.\"\n\nS: \"I do apologize for the inconvenience. I can attempt to reschedule you for another food pantry?\"\n\nM: \"I don't want to go another food pantry. I want to go to *that* food pantry.\"\n\nS: \"I'm sorry, they're only open on day and [day].\"\n\nM: \"If I don't get into that food pantry, I'm going to sue.\"\n\nS: \"Let me transfer you to my boss...\"\n\nM calls back later, gets another one of my reps. She is on the phone with him for a bit and comes over, looking stressed out after she finished the call. \n\nWorker: \"Yea, I just had this guy on the phone and it took me a minute to realize what happened, but I think he threatened our CEO.\"\n\nCoworker: \"What?\"\n\nWorker: \"Yea, I was on the phone with him and he said *I saw your Ceo on the news. It'd be a shame if something happened in the parking lot.*\"\n\nCoworker: *Goes to other boss, who goes to her boss*\n\nThis man had threatened to sue us several times previously. Due to his aggressive nature, we called the non-emergency number for police. They went to his house and gave him some tips about phone etiquette.  ",
        "created_utc": 1489335832,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm in prison\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yxx3m/im_in_prison/",
        "text": "Just found this sub is a thing, apologies for formatting issues etc because phoneposting.\n\n\nSo at the start of 2016 I started work at a large US- HQ'd financial services provider in the UK. I was tasked with being a debt collector on behalf of a UK-based client which generally specialised/targeted those with poorer credit ratings or those that were new to credit. For what it's worth, the system dials the numbers automatically so I have no idea who I am calling, nor the status of the account before answering the customer picks the phone up or goes to vm. \n\nI am about an hour into my shift, and I end up getting connected to an account that is about 6 months in arrears, indicating serious issues must be present. \n\nMe: Hello, I'm me from UKClient, can I confirm your name please?\n\nCustomer: YOU TOOK MONEY OUT OF MY ACCOUNT WITHOUT MY PERMISSION ...\n\nMe: *zones out until she stops for a second*\n\nMe: I'm really sorry to hear that, but I do need to take you through security t-\n\nCustomer: I'M IN PRISON RIGHT NOW AND I'M GONNA COME AFTER YOU AND KILL YOU ALL ...\n\nMe: *mutes call my end so I can still hear her while I'm trying to explain to a manager what's going on to see if they could help me*\n\nCustomer: ... FUCK YOU AARGH! **Hangs up**\n\nI then told my manager that she hung up so no help needed for that call. I noted on the account that she was abusive and allegedly in prison, and moved on. \n\n\nI only lasted 6 weeks on the floor, and this incident was about halfway during that stint. Had 4 weeks full time training before that though so that was nice enough. \n\n\nEdit: I still never worked out if she was lying to me or not. As per company policy one had to believe the customer unless written notes specified otherwise. ",
        "created_utc": 1489310292,
        "upvote_ratio": ""
    },
    {
        "title": "Customer Cussing",
        "author": "bookphoenix",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yxbhq/customer_cussing/",
        "text": "I work in a home warranty call center. I take calls from technicians, I explain them to customers. I take calls from customers, I ask questions from our technicians.    \n  \nToday, we will be featuring the following cast:    \nMe - The fearless heroine of the story      \nTech - The technician  \nCoworker - Coworker  \nCustomer - The customer   \n    \nThe following script may be *slightly* adapted for berevity, identity, etc etc.    \n  \nTechnician: Blah blah blah I did some plumbing work.  \nMe: *typing notes* Uh huh, uh huh.  \nTechnician: So the customer asked me to leave before the work was finished because I didn't know how to do X work.  \nMe: (mentally eye rolling, thinking I have a ~spechul snowflake~ customer I'm going to have to call) *typing notes* Uh huh, uh huh. Okay, we're almost done.  \nTechnician: Oh, and you should be aware, I called the customer an asshole on the phone.  \nMe: . . .   \n. . .   \n. . .  \n(headdesk headdesk headdesk)  \nWell, thank you for being honest, but I am going to have to send a note to the team in charge of the technicians.  \nTechnician: Okay, just wanted to be honest.  \n  \nI see a note on the job. The customer just called in. Oh, geez. I called coworker.  \n  \nMe: Sooo . . . what did Customer want?  \nCoworker: Oh, yeah. He was all complaining about how the technician cussed at him. It's already waiting for a supervisor call.  \n  \nGREAT. Fantastic. Call center rules say I *have* to call this dude. This is going to go SO WELL.  \n  \nMe: (Internal dread) *Ring ring, ring ring*  \nCustomer: Yes, hello?  \nMe: Hello, sir? I'm calling to talk to you about Technician -  \nCustomer: I'm a professional, I never cuss, I can't believe he cussed at me, rabble rabble rabble.  \nMe: Yes sir, of course sir, you're absolutely right sir.  \nCustomer: I have multiple properties blah blah blah.  \nMe: *Checks Customer profile - yeup, of course the technician couldn't just cuss at any of our customers, ohhh no. He had to cuss at a customer who has multiple properties with us. Peachy keen!* Yes, sir, well, I've sent a note to our technician group sir, they're going to look into it, you're still going to get a call form a supervisor, I apologize. And I'll transfer the call to someone else so we can get this finished.  \nCustomer: (Slightly mollifed) Well, that's better, then. I'll be expecting that call.  \n  \nAt least I got him calmed down pretty easily (all things considered), but my face was: -___-. We all THINK the words. But you can't SAY the words out loud to the customer! ",
        "created_utc": 1489297949,
        "upvote_ratio": ""
    },
    {
        "title": "Not my fault your tablet sucks.",
        "author": "unscrewthestars",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yx8jd/not_my_fault_your_tablet_sucks/",
        "text": "Some of our beds have a neat feature that requires wi-fi and a smart device or tablet to use. It's not mandatory, but it's a cool piece of tech.\n\nSo with that said, yesterday I got a call from a lady whose tablet would not connect to the tech, and she was flying into a rage. \"It's broken! We had one of your men out yesterday to fix it, and he could connect to it on his iPhone! Why won't it work on my tablet?\"\n\nSo that's my first clue that it's likely her tablet that's the problem. And I walk through all the troubleshooting I know how to do to try to fix it. I even get somebody who knows more than I do to help out. Meanwhile this woman is grumbling and laughing in unfunny, un-amused way while I have her wait, while I ask her to check things for me, and while I basically work my ass off.\n\nFinally, the verdict comes in from the tech support experts. Yep, it's her tablet. This woman bought a $7000 bed and a $50 tablet from Walmart. We looked it up and everything. It's so cheap that it has a shoddy Bluetooth connection that drops constantly.\n\nSo I explain the issue to her, phrased politely, and give her some advice. Since we don't do tech support for devices, just for our technology, we can't really tell her how to fix her tablet, but we do tell her that she might want to try googling some fixes, or to try a different device.\n\n\"Are you telling me I can't use my brand new tablet with this bed?\"\n\n\"Yes ma'am. I'm afraid so.\"\n\nPause.\n\n\"I want your manager. Now.\"\n\nOkay, because my manager is gonna be able to fix that...",
        "created_utc": 1489296567,
        "upvote_ratio": ""
    },
    {
        "title": "\"911 answers my phone calls first cause I'm a pastor\"",
        "author": "writeandknow",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yx6r8/911_answers_my_phone_calls_first_cause_im_a_pastor/",
        "text": "I just found this sub. I used to work at an agency that scheduled food pantry appointments. People could call up to three days in advance to schedule. One day a woman called in and got one of my reps. I was a supervisor. \n\nW: \"Your rep is telling me I couldn't get into the [food pantry I wanted] today because it's full.\"\n\nS: \"Yes ma'ma that's correct. Unfortunately you'll have to call back to reschedule if you want that specific pantry because it's full for the next two days.\"\n\nW: \"If you'd picked up your phone on time I'd have been able to get in today!\" (Nope. This food pantry was almost always booked.)\n\nS: \"I can-\"\n\nW: \"Y'all should be answering my phone call right away when it rings! I'm a pastor!\"\n\nS: \"I'm sorry?\" (We had separate lines for caseworkers but they couldn't schedule themselves over that line).\n\nW: \"Y'all should be answering my phone call first. I'm a pastor, and because I'm a pastor, I should get through first. 911 and [the ambulance service] answer my call first because I'm a pastor,  and so you should too.\"\n\nI turned to my rep, put her on mute, and responded, \"I can't even believe this lady.\"\n\nThen my coworker who was also a supervisor came in, and I got the great pleasure of transferring her call.\n\nShe didn't get her appointment.",
        "created_utc": 1489295787,
        "upvote_ratio": ""
    },
    {
        "title": "YOU TELL ME THIS....AFTER I GIVE YOU MY CREDIT CARD NUMBER???",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ywh8j/you_tell_me_thisafter_i_give_you_my_credit_card/",
        "text": "\nAirline guy, I got another story...\n\nSo when you work frontline the best calls are from passengers who know exactly what they want. Get them on, get them off, they know how everything works it's a win/win.\n\nSo naturally when a passenger wants to book a flight and they already have the flight numbers it means they already know the flight times and it makes less verbiage on the call for you. So a lady calls in, gives me the cities and dates and tells me the flight numbers. When I'm recapping the flights for her I give her the big once over so we are on the same page. \n\n&gt; M- so, just to confirm we have you leaving out of Seattle at 745am flight xx going to Honolulu via Los Angeles arriving at 10pm\n\n&gt; L- yes that's right\n\nThis is where I shoot myself in the foot. Because I notice that she has a long connection, HOWEVER everyone is different, I've come to learn that some ppl love short connections because they travel frequently and know how to book it in the airport...others prefer connections that are hours long, possibly to avoid a worse case scenario delay that might make them miss a connection. Either way I mention that \"you have a nice big connection to get some shopping or dinner in the airport\" which is where I fucked myself. I was trying to make her fully aware so there were no issues when she called back, but she completely throws it on me:\n\n&gt; L- wait a minute, how long is my connection?\n\nLike...didn't you give ME the flight numbers with the arrival and departure times?\n\n&gt; M- you provided me with a flight xxx and flight xxx correct? That departs at 745, you depart lax around 6pm.\n\n&gt; L- **GASP** Absolutely NOT. YOU TELL ME THIS AFTER I GIVE YOU MY CREDIT CARD? Absolutely not! This is not the flight I wanted this connection is all day!!!\n\n&gt; M- would you prefer a shorter connection? The flight that you gave me would get you in at that time how much earlier are we looking at here?\n\n&gt; L- WHY WOULDNT YOU TELL ME THIS INFORMATION ABOUT THE FLIGHT PRIOR TO TAKING MY CREDIT CARD? THIS HAS TO BE AGAINST SOME POLICY.\n\nRight. The policy where I assumed you fucking knew if you got into Los Angeles at 9am and you don't leave until 6pm...that would be you physically waiting through the airport...since you...gave me, the flight numbers...and I read the departure times back to you...\n\nSo of course, I price the new flight times and it's more than the original flight she wanted (lol get rekt m8)\n\n&gt; M- **tells her the new price**\n\n&gt; L- I need to speak with a supervisor about this, I've spent 45 minutes waiting on the phone for this, and now you tell me this is all my fault...unbelievable\n\n\n**switches songs on my iPod conveniently snuggled between my headset and one ear**",
        "created_utc": 1489285574,
        "upvote_ratio": ""
    },
    {
        "title": "BUT THERE WAS ONE SEAT AVAILABLE EARLIER TODAY!!!",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ywd9f/but_there_was_one_seat_available_earlier_today/",
        "text": "Airline guy...\n\n\nLady calls in, wants to book a flight for two from A to B. Evidently she saw there were seats available and called backed to book. There's no more seats now that she's calling back, I tell her unfortunately the flight she had her sights on is booked she may want to try something else at a different time.\n\n&gt; M-**breaks the news**\n\n&gt; L- \"but there was one seat available earlier today\"\n\nI really have a pet peeve about explaining availability to passengers. If there was a seat available when you checked, what compels a person to think that seat couldn't possibly be booked by someone else if they choose to make a decision at a later time? Why didn't you just put the reservation on a hold? Why didn't you buy it when you had the chance if you \"just saw it\" an hour ago??????????????????\n\n&gt; M- \"im sure that may have been the case, it does seem at this time those flights are all sold out\"\n\n&gt; L- \"no, there was ONE seat available just now what kind of scam are you running here\"\n\nI hate when customers take digs at my company. Time to be passive aggressive.\n\n&gt; M- \"ma'am, had there been a seat available as you say, are you not looking to book for two passengers?\"\n\n&gt; L- **hangs up**\n\n\n\nGood riddance. These 30 second calls are why my metrics are over 100% anyways. Plus they have Asian catering today in the cafeteria! *logs out break time*",
        "created_utc": 1489284098,
        "upvote_ratio": ""
    },
    {
        "title": "Employee of the month",
        "author": "Caminsky",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yw6zf/employee_of_the_month/",
        "text": "[removed]",
        "created_utc": 1489281754,
        "upvote_ratio": ""
    },
    {
        "title": "Suicide or tragic accident?",
        "author": "gematria17",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ysp6d/suicide_or_tragic_accident/",
        "text": "[removed]",
        "created_utc": 1489239749,
        "upvote_ratio": ""
    },
    {
        "title": "My TV is not working",
        "author": "SOMEMACHINESARESLOTS",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yscv2/my_tv_is_not_working/",
        "text": "So I work for a satellite tv provider for the middle East and about 7 yrs ago I worked in the call center, I get a call from a customer in saudi that goes as follows:\n\n\nMe: Thank you for calling (well known tv company) how may I help you.\n\nC: My TV is not working\n\nMe: not a problem, please give me your smart card number.\n\nThe customer then gives me the number after an ordeal to get it out of the set top box, he didn't realize that it had a card.\n\nMe: I can see that your subscription has expired, you would need to renew it to have it back on.\n\nC: How?\n\nMe: either pay in cash at your local dealer or give me your credit card details and I'll do it for you right away.\n\nC: okay, 1 minute\n\nThe guys puts the phone down and leaves me there for about 10 minutes all the while I can hear kids playing and/or crying in the background and a bunch of other noises like pots and pans crashing on the ground, it was crazy.\n\nWe're not allowed to hang up, no matter what.\n\nC: ALRIGHT, ehhhh, you can withdraw now.\n\nMe: excuse me sir?\n\nC: you can take the money now.\n\nMe: ahmm... ok, may you please give me your card number?\n\nC: I already gave it to you.\n\nMe: oh, really? I must have missed it!? Can you give to me again?\n\nC: what are you talking about?....it's inside, just take the money. \n\nMe: I'm sorry, I'm confused, inside where exactly?\n\nC: In the box, I put the card in the box.\n\nTL;DR: customer lost tv connection, called, told him he had to pay to renew, he put his credit card into the set top box like some kind of credit card machine asking me to collect.\n\nI'm on phone, sorry for formatting.",
        "created_utc": 1489233819,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're being told to lie to me [about federal law].\"",
        "author": "jitterbunny",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yrtgh/youre_being_told_to_lie_to_me_about_federal_law/",
        "text": "Hi again! I've posted here a few times, so sorry if any of y'all are sick of me, but I've got another story! :D Again, I apologize for being long-winded as usual. I try to cut the fat, guys, I do!\n\nI work in a 24/7 finances help center at a University. That's all we really need for this one.\n\nSo on Wednesday, a lady called in at about 5:30 (when all of our escalation offices are closed, hooray) claiming that a financial aid representative was supposed to get back to her about her FA refund, but didn't. Of course, the financial aid rep *had* indeed emailed her but the lady (Customer) cannot fathom that perhaps she missed it.\n\nAnyway, Customer apparently wanted her refund a week ago because \"how am I supposed to pay for my books?\" However, the semester starts on the 13th, and all students' aid is disbursed at the same time 10 days before classes begin. Yeah, it's kinda short, but it's been the process for a long time. \n\nNaturally, she was pissed, (it had been mailed that Monday, as refunds take some time to generate) and ranted at me, nonstop, for about 20 minutes going on and on about how we *should* have sent it a week ago (where the hell did she get that idea) and \"how am I gonna pay for my books? I need my books for class?\" over and over and over. \n\nOnce I can finally get a word in, I go ahead and let her know an email had been sent (\"Well I never got it\") and read that to her. It was a very polite email informing her that federal guidelines do not allow for funds to be disbursed until 10 days before the semester starts, and then the counselor recommended that she reach out to her instructors to let them know she wouldn't be able to get her books.\n\nSo the rant starts off again, she's demanding to know why it wasn't sent the week before, how nobody's helping her (she's been in touch with like 3 counselors who have given her extensive info) and how she's really disappointed with *insert University name here*\n\nHere's where it gets fun. I go ahead and remind her that this is a federal regulation that we follow and that this process will likely remain the same for all of her future semesters.\n\nC: \"There is no law.\"\n\nMe: \"Well, there is a federal--\"\n\nC: \"That is not a law. Don't you dare lie to me.\"\n\nMe: [a little baffled, made the mistake of hesitating for just a brief second and oh god there she goes]\n\nC: \"There is no federal law. I know a little bit about the law (fuck you lady and I don't?) and there is no such law.\"\n\nMe: \"Ma'am, I'm just wanting to let you know that this is a process that will continue, and it *is* due to that federal-\"\n\nC: \"Don't you lie to me. There is no law. They're telling you to tell me that. I know the law-\"\n\nMe, trying again: \"As do I, however-\"\n\nC: \"and there *is. no. LAW.* They've told you to tell me that, but I don't want to be lied to. There's no law. You might not know any better, just know what they told you (if I worked face to face customer service, my face in response to that would have gotten me fired) but I am telling you there is no law.\"\n\nMe: \"Okay, ma'am. I am not going to argue that anymore. However, the refund was sent on Monday to [address] and should be arriving soon.\"\n\nCustomer was silent for a good thirty seconds. I gave my customary \"Hello?\" \"Ma'am?\" For another 20 seconds before I went into my script:\n\nMe: \"Ma'am, unfortunately I am unable to hear you if you are speaking. If you have any further questions, I recommend that you connect with us during business hours so that we can have you speak with someone in student accounts who can give you more clarity--\"\n\nC: \"What good would that do? What good would that do? You tell me! What good would that do? Are they gonna get me my money? [in a voice clearly begging for pity] All I wanted was to get my books.\" Rinse and repeat.\n\nMe: \"Ma'am, quite frankly, it would not do any good other than to explain what I've told you today. I was offering that because I thought we had been disconnected, and was letting you know that if you needed further clarificaton-\"\n\nThe rest of the call went on, ranting for 10 minutes, then \"I shouldn't be fussing at you, I apologize\", followed by another 15 minutes of \"fussing\" at me, etc. etc.\n\nFinally, I reached a point where I just said, \"Ma'am, is there anything that I can help you with today?\" Because literally she wasn't even trying to get us to speed up the process or accomplish some impossible feat, she was just bitching.\n\nHer response was \"I just wanna buy my books\" And after 10 more mins of whining I let her know there was nothing we could do and managed to end the call. Thank. *God.*\n\nFinally, LET IT BE SAID that I *do* feel for these people, I do. This woman had genuine concerns unlike a lot of the entitled assholes that call in. It kind of sucks not getting your refund till a few days before classes, but we do have the policies and procedures posted on our website. They are given lots of opportunities to prepare for this, and while I expect frustration and irritation, and I did feel bad for this lady, the fact of the matter is life sucks sometimes and yelling at some girl over the phone who's just trying to buy her books too isn't helping anyone.\n",
        "created_utc": 1489222231,
        "upvote_ratio": ""
    },
    {
        "title": "I worked at a call center for all of two weeks",
        "author": "shelbae115",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yrh5z/i_worked_at_a_call_center_for_all_of_two_weeks/",
        "text": "I worked at a call center for all of two weeks, and in the time a customer with a strong Asian accent a coworker was helping was spelling something out and coming up with random words to associate with the letters and when she got to T she goes \"T for Taiwan\" in a super cute way and my coworker literally had to mute his headset so he could laugh his ass of. \n\nAnother time I got a call and got ranted at for about 10 minutes about how a pair of pants wasn't working for this guy even though he exchanged them like three times. He started yelling at me about half way through and cut me off as soon as I tried talking; eventually he finally stopped ranting and let me get a word in so I could let him know I had to transfer him to a different department because he was calling regarding an in-store issue and I only dealt with online orders. It was my 1st actual live call during my training. \n\nEdit: words",
        "created_utc": 1489215121,
        "upvote_ratio": ""
    },
    {
        "title": "\"THAT'S THE RIGHT ADDRESS, YOU JUST CAN'T READ!\"",
        "author": "pierogituxedo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yora3/thats_the_right_address_you_just_cant_read/",
        "text": "Hey guys, Pierogituxedo here. This happened just a little while ago. \n\nGentleman calls in to ask about his order. He placed the order through Paypal. Now normally, Paypal will populate whatever information you put in as a billing and shipping address automagically, but sometimes, as with most programs, there are errors. \n\nIn this scenario, I will be me and the gentlemen will be known as Sir Pay of Palington.\n\nMe: Hello, thank you for calling *****, my name is PierogiTuxedo, How may I help you!\n\nSPP: Hello there PierogiTuxedo, this is Sir Pay Palington. I was looking to check on an order.\n\nMe: Sure thing! Do you have your order number?\n\nSPP: Yes! It is ******. Thanks for looking into it.\n\nMe: No problem! Could you verify the billing address?\n\nSPP: Sure! It's 123 Anywhere Grove Ct. City, State 12345.\n\nMe: Unfortunately, that's not the  correct address...Do you hav-\n\nSPP: (Cutting me off) Thats the right address. Are you sure you have the right order?\n\nMe: (Checks order number) Yessir, this is the exact order you gave me, with your name on it.\n\nSPP: Ok, let me read it once more to you. -said a bit more harshly, and loudly.- It's 123 Anywhere Grove Ct. City, State 12345!!\n\nMe: Again sir, that is not the address on the ord-\n\nSPP: THAT'S THE RIGHT BILLING ADDRESS!  YOU MUST NOT BE READING IT CORRECTLY OR EVEN HAVE THE RIGHT ORDER!! I ALSO SAW THAT THE ORDER SAID IT WAS CANCELLED?! I USED PAYPAL AND PUT ALL MY INFORMATION IN CORRECTLY, AND YOU  AND YOUR COMPANY JUST DECIDED TO CANCEL THIS ORDER WITHOUT LETTING ME KNOW?! HOW DARE YOU?!!\n\nMe: Sir, The address you gave me is not the address that's on the order. This may have caused the order to cancel. I'm not completely sure as to why an email did not generate, and for that I apologize, If you'd like, we can-\n\nSPP: SO WHAT DO I DO NOW?!\n\nMe: Well, I would be more than happy to place the reorder for you with the correct address on it that you've given me. \n\nSPP: But the correct email address is in PayPal! That's why I use Paypal so I don't have to type it in!!\n\nMe: Sir, as I've said--\n\nSPP: You know what, I'll take my business elsewhere. Apparently you people can't read your own damn orders correctly! It makes me not want to do business with you all ever again! GET IT TOGETHER!!\n\n-click-\n\nAnd that was my first call of this Friday! Customer's always right, right? :D",
        "created_utc": 1489180255,
        "upvote_ratio": ""
    },
    {
        "title": "Why do all call centers on TV show a suit and tie?",
        "author": "RiverGambler",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yoctj/why_do_all_call_centers_on_tv_show_a_suit_and_tie/",
        "text": "[removed]",
        "created_utc": 1489176296,
        "upvote_ratio": ""
    },
    {
        "title": "The Customer is Always Right",
        "author": "lyingassplatypus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ymfj0/the_customer_is_always_right/",
        "text": "\"I'm getting so SICK of having to call you people. Why can't you just make things that work?\" \n\n\"What's going on, ma'am?\"\n\n*10 minute rant*\n\n\"So you're not getting a picture on your TV? Not even a message of some sort, a marquee box, or anything? Do you know if your TV is turned on?\"\n\n*hear the sound come on over the phone*\n\n\"I've got picture now.\"\n\n\"Ah. There we are. Seems the TV was simply not turned on.\"\n\n\"But I shouldn't have to do that.\"\n\n\"Turn on your TV?\"\n\n\"Don't be smart with me. I'll report you to your supervisor. I'm not shy about reporting smart-asses. This one time, *3 minute rant* So yes, I should not have to turn on the stupid TV to work with your stupid, overpriced services. Your installers said it would just work with the clicker.\"\n\n\"I'm sorry, ma'am. There are some very new and advanced TV's that will turn themselves on when they feel Cable boxes, DVD players, and what-have-you have been turned on. It doesn't seem like your TV supports that.\"\n\n\"THIS IS A BRAND NEW TV. I DON'T UNDERSTAND WHY I HAVE TO KEEP CALLING YOU BUNCH OF IDIOTS TO FIX IT TO WORK WITH YOUR STUPID CABLE.\"\n\n\"Ma'am, the TV was turned off. I'm sorry to say that has nothing to do with our equipment. There isn't much to be said about operating your own TV.\"\n\n*click*\n\nFailed CSAT.",
        "created_utc": 1489157261,
        "upvote_ratio": ""
    },
    {
        "title": "Listening would help.",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ykx04/listening_would_help/",
        "text": "Me: Tell me a recent direct deposit coming in to your account?\n\nCx: There have been none in the last month\n\nMe: So tell me any recent transaction on your account.\n\nCx: I had a direct deposit for $XXX.xx from [Employer] yesterday.",
        "created_utc": 1489132826,
        "upvote_ratio": ""
    },
    {
        "title": "No sir, that's not what I advised",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ykwu6/no_sir_thats_not_what_i_advised/",
        "text": "Me: Please go to www.[canadianbankname].com.  On the right side where it says \"Easyweb Online Banking\" click Login.  Your username is your card number and your password is what I just gave you.\n\nCx: So to recap I go to www.[americanbank].com and click register?\n\nMe: No sir, that's not what I advised.  [Gives directions again]\n\nCx: www.[americanbank].com\n\nMe: www.[canadianbankname].com",
        "created_utc": 1489132752,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Mar 10",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ykhzk/free_talk_friday_mar_10/",
        "text": "Welcome to Free Talk Friday! We are suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentres as you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1489125834,
        "upvote_ratio": ""
    },
    {
        "title": "\"I lost a leg for you in Vietnam! Give me my discount!!\"",
        "author": "pierogituxedo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yg4bu/i_lost_a_leg_for_you_in_vietnam_give_me_my/",
        "text": "Hi friends, Pierogituxedo here with another story for the book!\n\nThis happened a few weeks ago. \n\nI work for a company who does a lot of work for veterans outside of giving discounts. We build homes, support wounded warrior initiatives, employ countless newly minted civilians, etc.\n\nOne day, I had a nice man who called in asking about our military discount policy. Our policy is very clear: We DO offer a military discount in our stores with valid military ID or DD214. This discount is ONLY available in stores on IN-STORE merchandise.\n\nIn the online department, where I work, we have no real way of verifying military service and are not to give the discount under any circumstance, due to the rampant surge in \"Stolen Valor.\"\n\nI was speaking with the nice veteran, who I'll call GrandpaVet, because during the conversation, he told me all about his grandchildren and how much fun they'll have with the product he was getting. (It was a really cool swing set, slide combo!)\n\nMe: OK GrandpaVet, I got you all set here, Lemme just get your credit card and we'll have your grandkids running and playing in no time!\n\nGV: (Chuckling) Oh thank you, Pierogi, My kiddos are gonna love this thing. Hey, one more question. I'm a vietnam vet, and disabled, and a senior. (chuckles) Usually when I go to the store, I get a military discount. Can you apply that for me?\n\nMe: Ah! Thank you so much for your service, GrandpaVet!\n\nGV: Thank you for yours! Helping me get this and all!\n\nMe: Well, I can't honor the military discount on an online purchase due to the fact that our policy only allows for the discount to be applied in the store on store purchases. I can--\n\nGV: Hang on now, If I go into the store after I purchase this and show them my ID, can they apply it there?\n\nMe: No sir, because it would still be an online purchase. It only extends to sto--\n\nGV: OK, I got ya. How about if I go into the store to make the purchase there? Will they give me my discount then?\n\nI could feel him getting a little tense...The happy grandpa I had been talking to was slowly going away.\n\nMe: No sir, It's only for in-store-\n\nGV: Now I've been mighty nice throughout this whole ordeal ordering this product from you, Pierogi, and I like you a whole lot, but there's gotta be a way to apply this discount. I'm on a fixed income and can't spend too much money on extra things like this.\n\nMe: I totally understand GV, trust me I do, but my company poli-\n\nGV: I lost a leg for you and your company in Vietnam! All that Agent Orange is still in my lungs! You give me that discount or you get me a manager, simple as that!\n\nWith that, I stopped and stated:\n\nMe: Alright, let me get you a manager sir, It's been my pleasure to serve you. One moment.\n\nI transferred to my manager, a former Navy Commander with 23 years of service.\n\nEDIT: Asked Manager how it went. Customer did not get discount, and ended up hanging up on the manager.",
        "created_utc": 1489077849,
        "upvote_ratio": ""
    },
    {
        "title": "Which position?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ydmue/which_position/",
        "text": "[removed]",
        "created_utc": 1489042431,
        "upvote_ratio": ""
    },
    {
        "title": "What makes you quit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5yaj6v/what_makes_you_quit/",
        "text": "[removed]",
        "created_utc": 1489006253,
        "upvote_ratio": ""
    },
    {
        "title": "Regulars",
        "author": "allie-rva",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y8gtd/regulars/",
        "text": "My call center is small enough that we get regulars and we all know these people. Maybe one or two are okay but mostly they are horrrrribbbbllee. If you are the unfortunate one to get the call, we always say hi extra loudly to let others know our sad situation \"Oh, HI, SO-AND-SO, what can I help you with, TODAY?\"\n\nThe mean ones, ok I can tolerate them. The dirty ones, that's part of my specialized function. (I have to handle \"undesirables\"). But I hate the high maintenance ones soooo much. Calling every week, sometimes every day and asking us to do this and that, creating extra work. Sometimes having multiple agents doing the same task simultaneously, unknowingly. \n\nSometimes, you just wanna....disconnect. But you know. That could never happen...",
        "created_utc": 1488986428,
        "upvote_ratio": ""
    },
    {
        "title": "WHY ARE YOU MAKING ME GO AROUND THE WORLD JUST TO GET HOME?",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y6xkv/why_are_you_making_me_go_around_the_world_just_to/",
        "text": "Airline guy...\n\nSo...because there are hundreds of airports scattered across the world, the International Air Transport Association has designated a 3 letter code to organize every airport on earth. Some are pretty obvious like JFK - NYC (John F Kennedy) some only make sense if you know the airport history like CDG - Paris (Charles de Gaulle Airport, named after the president of France) and some just have nothing to do with the airport code all together like GGG (East Texas Regional Airport)\n\n&amp;nbsp;\n\n(Also, there are a lot of places on earth that have the same cities, and sometimes those cities have airports in both places like Springfield Kentucky, Springfield Illinois &amp; Springfield Ohio or Portland Maine &amp; Portland Oregon, fun fact)\n\n&amp;nbsp;\n\nSo, lucky for the passenger when they are typing out in a search bar on a booking site it will list all the cities, states and countries so there is no confusion. Unless youre an idiot of course: Me-M Guy-G\n\n&gt; M- Hello this is ExteriorPain how can I assist with your existing reservation?\n\n&gt; G- YEAH! MY TICKET HAS ME GOING TO THE WRONG PLACE\n\n&gt; M- ~~here we go~~ No problem! Can I have your airline confirmation? *pulls up flight*\n\n**Guy has ATL (atlanta, GA) - CLT (charlotte, NC) - DCA (washington, DC)**\n\n&gt; M- Ok sir, I have your flights pulled up, you were saying you didnt intend to book a flight from Atlanta Georgia to Washington Reagan in DC?\n\n&gt; G- YEAH I DID! WHY ARE YOU MAKING ME GO ALL THE WAY TO **CHICAGO** THEN BACK TO DC?\n\n&gt; M- *ice breaker laugh* No sir! We actually have you connecting through Charlotte North Carolina.\n\n&gt; G- YEAH THATS WHAT I ASKED FOR WHY IS IT SHOWING CHICAGO ON THE WEBSITE?\n\n&gt; M- Sorry about that one, I have no idea what you may be looking at, however for your flight you are indeed connecting through Charlotte.\n\n&gt; G- WELL THATS NOT WHAT IM LOOKIN AT RIGHT NOW. IM GOING ALL AROUND THE WORLD JUST TO GET HOME.\n\n&gt; M- Sir, what is the code of the airport that you are reading?\n\n&gt; G- WHUT?\n\n&gt; M- The 3-letter airport code for Chicago is ORD. Charlotte would be CLT.\n\n&gt; G- Well you need to change the spelling and stop confusing customers. (click)\n\n\n~~accidentally changes his seat from an aisle to a middle~~",
        "created_utc": 1488963984,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone here worked as a Client Service Representative for Vanguard? What was your experience like?",
        "author": "flyersfan314",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y6iba/has_anyone_here_worked_as_a_client_service/",
        "text": "[removed]",
        "created_utc": 1488956283,
        "upvote_ratio": ""
    },
    {
        "title": "That one on the commercial",
        "author": "purrsandkilos",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y5m0u/that_one_on_the_commercial/",
        "text": "Work for a health insurance company. During ye ole training days (eh, within the past couple years), we had one member call in and get my neighbor...\n\n(after all the verification)\n\n**M:** I want to know if that drug is covered.\n\n**CSR:** and which drug are you checking for?\n\n**M:** The one I saw on the commercial.\n\n**CSR:** Ma'am, do you remember the name of the drug?\n\n**M:** No, it was that one on the commercial!\n\n**CSR:** What is the drug for? Do you remember what it helps with?\n\n**M:** No, it was that one on the commercial! I think it had a dog. Can't you find it for me?\n\n**CSR:** Ma'am, I suggest you write down the name of the drug next time you see the commercial and call us back.\n\n**M:** You're no help! *hangs up*\n\nMy neighbor and I started to Google for \"prescription commercial with dog\" but there were SO many to choose from, we never would have made any progress...",
        "created_utc": 1488944101,
        "upvote_ratio": ""
    },
    {
        "title": "The end is near!",
        "author": "ayannauriel",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y4w4l/the_end_is_near/",
        "text": " I'm moving out of State and do have the opportunity to take my call center job with me. I was really considering it.\n\nThen this morning on my first call the customer told me to, \"Shove it up my ass.\"\n\nSo I'm just going to quit. My last day is April 16th, I'm thinking of making some sort of advent calender for it.",
        "created_utc": 1488935641,
        "upvote_ratio": ""
    },
    {
        "title": "My first call of the day",
        "author": "anfea2004",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y39dm/my_first_call_of_the_day/",
        "text": "Cx calls in, saying how she recently changed her tv package and there is a channel she had on the older package, but no longer has on the new one. \n\n\nMe: Okay, do you know the channel number?\n\nCx: No, I don't remember\n\nMe: Alright, how about the channel name? Did you catch that?\n\nCx: No, I never really paid attention the channel name\n\nMe: Oooookay, well, what shows did you watch on the channel?\n\nCx: Can't remember. But I really liked the shows, so I want the channel back\n\nMe: I'm sorry, but if you can't give the channel name, number or the shows you watched on it, then I can't help you\n\nCx: Well, then just go back and add the old tv package I had before, or just go thru the channels\n\nMe: It's not possible for me to add the old package back on, it's no longer available. And that package had over 200 different channels, I'm not able to go thru them all\n\nCx: I am a paying customer! I want you to add the channel on so I can watch what I want again!\n\nMe: If you're able to identify the channel in some way at all, I'd be more than happy to add on the channel, but since you aren't able to remember anything about that channel, I'm afraid there is nothing I can do. \n\nCx: Fine, but I want you to know I'm completely upset with [company]! **click**\n\nI seriously can't make this shit up. I don't know how she thought anyone could help",
        "created_utc": 1488919028,
        "upvote_ratio": ""
    },
    {
        "title": "Tired of allllll the sales pushes",
        "author": "xUnikx",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5y2n8e/tired_of_allllll_the_sales_pushes/",
        "text": "[removed]",
        "created_utc": 1488913373,
        "upvote_ratio": ""
    },
    {
        "title": "How dare you try and resolve my self created issue!",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xzir0/how_dare_you_try_and_resolve_my_self_created_issue/",
        "text": "Sigh. This is another call from the out of hours hell desk.\n\n**Me:** Service Desk\n\n**Caller:** I can't login!\n\n**Me:** Okay. What are you trying to login to and what error message are you receiving? \n\n**Caller:** I don't know I just can't login you need to fix this right now!\n\n*seriously?*\n\n**Me:** Okay, what's your username?\n\n**Caller:** &lt;obviously not username&gt;\n\n**Me:** That's not the right format for &lt;company&gt; usernames sir.\n\n**Caller:** Listen to me. This is absolutely the right format I have used this for years. You need to fix this problem urgently.\n\n**Me:** Please can you try &lt;correct format&gt;?\n\n**Caller:** Listen here you, that isn't going to work. YOU NEED  TO FIX MY ISSUE\n\n**Me:** Sir, please humour me.\n\n**Caller:** I'm sick of you people wasting my time and... It worked. What did you do? You changed my username didn't you!\n\n**Me:** No, as I said, we've had a standardised username format for several years now and this has not changed. You had been putting in the incorrect username.\n\n**Caller:** I'm not satisfied with this at all.\n\n**Me:** *(patience just about gone)* Has the issue been resolved sir?\n\n**Caller:** YES THE ISSUE IS RESOLVED BUT I'M NOT SATISFIED WITH YOU IT PEOPLE *click*\n\nWTF.",
        "created_utc": 1488880187,
        "upvote_ratio": ""
    },
    {
        "title": "Test",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xz1jw/test/",
        "text": "[removed]",
        "created_utc": 1488870957,
        "upvote_ratio": ""
    },
    {
        "title": "Opening Call Center - Need design ideas",
        "author": "TMCresource",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xu8ja/opening_call_center_need_design_ideas/",
        "text": "[removed]",
        "created_utc": 1488818540,
        "upvote_ratio": ""
    },
    {
        "title": "Okay mam, i'll transfer your call",
        "author": "shadeslayer0930",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xmvdb/okay_mam_ill_transfer_your_call/",
        "text": "I've posted this at r/malicouscompliance and r/pettyrevenge and someone said this would fit here as well.\n\nThis isn't my story, but my gf. Obligatory sorry about poor formatting and whatnot, this story is quoted from my hazy memory, and im not really good at english so sorry about sounding like a 6 year old.\n\nMy gf works in a large and well known call center company, where they receive calls from other foreign countries. Also almost half of her coworkers are foreigners. In her short time there, she realized just howdumbandmeanpeople can be. This is one of those people.\n\n&gt;GF:*(in a slightly accented filipino voice)* Hello there! Welcome to [company]. My name is [name]. How may i help you?\n\n*In what my gf referred to as the \"give me your manager\" kind of tone, Racist Bitch replied:*\n\n&gt;RB: Wait, you're not american? I thought this was an american company.\n\n&gt;GF: No mam, im Filipino, and yes this company is US based, however we do services and has branches all over the world.\n\n&gt;RB: I want you to transfer my call. I dont want to talk with third world blumbering idiots like you.\n\n&gt;GF: Mam I can assure you i am quite trained and well experienced in this job. Please tell me your issue so i can help you fix it.\n\n&gt;RB: Didn't you hear me you fucking idiot? I said TRANSFER MY CALL. I want to talk to somebody of my own IQ, I dont want to deal with somebody of your own species. And i want your whole name too. You should have transferred my call the first time i said it you moron.\n\n*That's right folks, RB doesn't see my GF as the same of her own species. GF is at first reluctant to transfer her call, as doing it is a way of showing incompetence, but this bitch is really taking it too far. GF being the devious little devil she is, transferred the call to Co-worker A.*\n\n&gt;Co-worker A:*(in a very heavy indian accent)* Hello mam. My name is [name]. How may i help you?\n\n**RB LOST HER SHIT**. Cue screaming. Cue cussing. Screaming about how incompetent the company is, the classic how she's going to get them all fired, that she's an important person, blah blah blah.\n\nGF and Co-worker finally earned the grounds to to hang up on RB (in their job, hanging up is a big no no) and for their manager to block her number. Nowadays, whenever their office needs a big laugh, they just play the recording of her call on the intercom.",
        "created_utc": 1488722008,
        "upvote_ratio": ""
    },
    {
        "title": "Google Bing Lady - Final Update",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xlsxm/google_bing_lady_final_update/",
        "text": "Hi Guys,\n\nI'm sure by now most of you are familiar with Google Bing Lady (GBL) who has become a bit of a legend on both r/talesfromtechsupport/ and r/talesfromcallcenters/ for her \"certificate of proficiency in computering\" the [original](https://www.reddit.com/r/talesfromtechsupport/comments/5htbtu/i_need_you_to_fix_google_bing_immediately/) tale is now number 3 top post to r/talesfromtechsupport/ of all time.\n\nYou may recall from [one of my previous updates](https://www.reddit.com/r/callcentres/comments/5ppxcy/the_return_of_the_google_bing_lady/) on GBL that she was scheduled for \"mandatory education\" - It turns out that $servicedeskmanager tried to negotiate with GBL and $GBL'smanager several times to schedule GBL into our IT Basics training, but she refused each time - for your enjoyment, here's one such refusal email from GBL;\n\n&gt; **From:** GBL\n&gt; \n&gt; **To:** $servicedeskmanager; $GBL'smanager\n&gt; \n&gt; **Subject:** IT Basics Training\n&gt; \n&gt; i will not be attending this training as i have said many times IT ARE MESSING UP MY BING which is unacceptable the bing is a priority which i use as part of my job on a daily basis \n&gt; \n&gt; may i remind both of you that i have a valid certificate of proficiency in computering and therefore do not require your basics training i know how to use the bing very well thank you very much\n&gt; \n&gt; it is IT who keep messing up my bing and workflow please stop\n\nGBL continued to call IT for the next several weeks claiming we \"messed with her bing\". We'd fully briefed all tier 1 agents by this point so they all knew to simply remote in and change the name of the shortcut back again. GBL continued to refuse to allow us to amend permissions of the shortcut to prevent her from changing the name. By this point it's clear that GBL keeps accidentally changing the name of the shortcut herself.\n\nThe situation came to a head a couple of weeks later when we had a visit from $HRlady as it turns out GBL had made an official complaint with HR about IT \"purposely\" interfering with her computer. Luckily we had a trail of evidance by this point which $HRlady took one look at and agreed GBL was an idiot. In the spirit of things however HR suggested some \"one to one\" training with GBL.\n\nGBL refused the one to one training on the basis that she already has a \"certificate of proficiency in computering\" and apparently has now also obtained a \"certificate in bing\". GBL left the company a few weeks later and went to work for a rival business. \n\n$servicedeskmanager and $servicedeskmanageratrivalbusiness are good friends and $servicedeskmanageratrivalbusiness has informed $servicedeskmanager that GBL is just as much of a nuisance caller at rival business as she was with us.",
        "created_utc": 1488699784,
        "upvote_ratio": ""
    },
    {
        "title": "\"Well go upstairs and stop them.\"",
        "author": "jitterbunny",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xljhr/well_go_upstairs_and_stop_them/",
        "text": "So I've posted here a few times before; I hope you're not sick of me yet. We had another gem last week that I wanna share.\n\nI work in a finances help center at a university. It's 24 hours, and we take calls from other departments once they have closed up. \n\nLast Friday, at 5:30pm, I got a call from an international student who had a past due balance hold on his account, meaning he couldn't register for classes that begin next Fall. We're just a help center, we can give information on the account and recommend students on who to talk to, but we can't actually lift their holds or make decisions on appeals or anything like that.\n\nOur long, two-rep conversation went a bit like this (Customer will be EA (entitled asshole) and I will be me!) Keep in mind throughout this that he had a heavy accent and was mumbling; it was very difficult to understand and that much more frustrating. **I will also apologize at this point for the length of this post, but I want to transcribe it word for word so that you understand how literally asinine and ridiculous this was. I'm sorry for your scroll wheels**:\n\nEA: \"I have a hold on my account that I would like to have removed so I can enroll in classes.\"\n\nMe: *verifies his identity, pulls up his account to see what kind of hold it is so I know who he needs to get in touch with*\n\nMe: \"Oh, I do see that. Well, if the balance is paid, it is possible that our Collections office can try to speed up the process of getting that hold lifted so we can get you enrolled, but they are closed for the weekend. They will be back on Monday, if you'd like to call back.\"\n\nEA: \"Monday is way too late. I need to enroll in classes.\"\n\nMe: \"I understand, but unfortunately, our Collections office is closed for the weekend, and they are the only ones who can lift this hold for you.\" \n\nEA: \"Monday is too late. Who can lift my hold right now?\"\n\nMe: \"Sir, the earliest that we can get that hold lfited for you would be on Monday.\"\n\nEA: \"But I need to enroll in classes. Give me their phone number.\"\n\nMe: \"You actually called the correct number, but their line transfers to us after business hours. You will need to call the same number between 8-5 on Monday.\" \n\nEA: \"Is anyone still there?\"\n\nMe: \"...No sir. All of our offices are closed.\"\n\nEA: \"It is only 5:30 there. They haven't all gone home yet.\"\n\nMe: \"Sir... their office is closed. There is no one here who can lift your hold.\"\n\nEA: \"Go upstairs and talk to someone. Monday is way too late.\" [okay fuck you dude]\n\nMe: \"Sir, their office is closed. There is nobody in the office. There is nobody who can lift this hold for you.\" \n\nEA: \"I need to enroll in classes.\"\n\nMe: \"Well, you should still be able to by Monday. Registration isn't even open for all students and classes don't start until Augu--\"\n\nEA: \"They will all fill up. Who is going to lift this hold for me?\" \n\nMe: \"Collections will be happy to discuss that with you on Monday.\"\n\nEA: \"Monday is way too late [is there an echo in here?]. Can I go onto campus and speak with someone?\" \n\nMe: \"All of our offices are closed.\" \n\nEA: \"Can I go onto [other campus] and speak with someone?\" \n\nMe: \"All of [University's] offices are closed.\" \n\nEA: \"Can I come to you?\" \n\nMe: \"We are just a call center, and we have no ability to lift those holds.\" \n\nIt's been about 30 minutes by this point, and I see that I'm not going to get through to him. I figured maybe he was just one of those who needs to hear it from someone else, so I offer to get someone else. I don't have any supervisors available, but one of my coworkers offers.\n\nMe: \"Sir, we are not going to be able to do anything to resolve this hold tonight. If you like, I can transfer you to an associate who can perhaps clarify this for you--\"\n\nEA: *vague mumbling*\n\nMe: \"I'm sorry?\"\n\nEA: *vague mumbling with the word \"transfer\" somewhere in there*\n\nMe: \"Okay. Just to be clear, he will not be able to lift this hold for you. Nobody is here who can.\"\n\nEA: \"Okay transfer me.\"\n\n*transfers him, and stays on the line like a creep to hear it play out. From this point, since you can already guess how this conversation is going to go, I'll just list out some fun excerpts.\n\n\"Sir, the building is literally locked. Nobody is inside. Nobody can get in. The office is closed.\"\n\n. \n\nEA: \"Can I get their email?\" \n\nIB (Innocent Bystander, my coworker): \"Sure! It's *begins to give the collections email*\"\n\nEA: \"No. The office will not reply until Monday, correct? I need the email of a person who can lift it tonight.\"\n\nIB: \"Sir, I am not allowed to give out that information.\"\n\nEA: \"May I get their phone number?\"\n\nIB: \"No.\"\n\n. \n\nIB: \"What I would recommend if you are very concerned about the class filling up, is that you contact the instructor and let them know that you are currently in the process of getting a hold lifted and see if he can perhaps reserve you a seat. There are no guarantees, but that is the best we can do at this point.\" \n\nEA, in direct response: \"So what do you recommend?\" \n\n.\n\nIt just ended kind of suddenly after another 20 minutes of repeating and me snickering in the background. Aside from the obvious shock at how repetitive this shit was, can we talk about the fucking *entitlement* this kid must have to expect someone to spend their Friday night lifting his fucking hold in their free time? What makes him better than any other student? That part made me actually angry, despite how funny the situation was. ",
        "created_utc": 1488694582,
        "upvote_ratio": ""
    },
    {
        "title": "I'm NOT a Nigerian scammer...I Promise.",
        "author": "ThatsAtroShus",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xka1b/im_not_a_nigerian_scammeri_promise/",
        "text": "I used to work in a bank where we sometimes manually processed transfers to other banks. As part of this role, we would call the receiving bank to see if the details were valid. (say for instance...if the transaction bounced back/rejected previously and we were sending to the same account details again).  \n\n\nAs part of privacy, most banks can confirm the banking name , account number are \"valid\"....but only that, if they are valid...You have to give them all the details but if you get anything wrong- they won't tell you WHAT is wrong, just that it's \"not Valid\".  \n \n\nA new staffer came up to me and says...\"ThatsAtroShus\"  can you please call *major Australian bank* and verify this account number for me?  \nMe: Sure....Is your phone broken?    \n \n\nHim: No, just everytime i ring to do a verify call...I just get transferred around and then I never seem to get the answer.    \n\n\nMe: Huh? are you using the script....?  \n\n\nHim: Yeah, but i seriously have made five calls today and none of them have been successful...  \n\n\nMe:(Seeing a coaching opportunity) ...ok...let's pull up your call and we'll listen in to see how it went....\n  \n*listens to last call new starter did*    \n  \n\n**Start laughing half way through**     \n \nIt seems our new starter was doing everything right. Except for one thing. He was born in South Africa. While he had a pretty strong Australian accent from being here for so long....when it came to reading the general script for when we make these calls...he sounded....Ummm.....Not entirely legit. Like he was \"putting on\" the Australian accent.  \n\n\nSo it seems the other bank thought he might have been a scammer trying to access account details.  \n\nAt his request- we took him off those calls :D",
        "created_utc": 1488675723,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why couldn't they just take one more person\"",
        "author": "mama-megs",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xk3w2/why_couldnt_they_just_take_one_more_person/",
        "text": "I work in a call center for a bank. Had a girl freak out on me because she's trying to get a payday loan, and needs her direct deposit information, but the bank is now closed. Apparently she got to the bank just as they finished locking up the doors and was appalled that no one would unlock them, disable the alarm, and log back into their terminal to get her this information. \n\nI diffuse the situation by directing her as to where she can download the exact same form on her phone, and email it to the payday company.....BUT when she logs in she realizes she can't see the account she just closed with us to get proof of a recent deposit. Only her new account. That she just set up because she wanted to stop payday loan companies from being able to debit her. Cue second freak out that I couldn't magically make her activity visible online that very second without going against policy and reopening the account. Which would have then opened her up to be debited again.  \n\nThankfully it was my last call of the day, but unfortunately she had called in using a security code to identify herself, and those are the people we target for surveys. ",
        "created_utc": 1488673484,
        "upvote_ratio": ""
    },
    {
        "title": "How Dare You",
        "author": "lala_7dipiti",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xj95o/how_dare_you/",
        "text": "I work for a small tech retail store.  Sometimes it amazes me the attitude that we get when answering questions.  The company has moved all calls from the retail store to the home office so that associates can actually help people in store.  \n\nThis just happened:\n\nCustomer: Yes I want to know if the price on your website is correct on this product.\n\nMe: [after pulling teeth to identify the product] yes the price is accurate.\n\nCustomer: How dare you sell it for $100 more than the manufacturer.\n\nMe: Let me check into it for you.\n\nGo to manufacturer's website - turns out the one for $100 less is a totally different system.  The one she was looking at is on sale for $100 less at our store.\n\nMe: Well, actually that is a different system and we have it for $100 less.\n\nCustomer drops attitude real quick at this point and asks if it is in stock.  I give her the information at which point she asks for my information.\n\nMe: Yes, my name is lala_7dipiti, but I am located in the Home Office so you are welcome to speak to any associate when you are in store.\n\nCustomer: Well then How do you know if it's in stock in store?\n\nMe: [Wow! have customers never heard of corporate knowing what is in stock in a store before?] Because we have a live inventory on our web site.  Anything else I can help you with ma'am?\n\nCustomer: [Hangs up without a word]\n\nI love my job, I love my job, I love my job.\n",
        "created_utc": 1488662829,
        "upvote_ratio": ""
    },
    {
        "title": "102 Year Old Lady with \"The Prime\"",
        "author": "mattied23",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5xguq5/102_year_old_lady_with_the_prime/",
        "text": "Elderly woman calls up wanting to place an order for some replacement filters for one of our products.  \nC=Customer\nM=Me\n\nM - &lt;Intro&gt;    \n\nC - Hello, there &lt;M&gt; My name is &lt;C&gt;. I need some replacement filters for my &lt;Product&gt;. How much would that cost if I order through you?  \nM - &lt;Price&gt; plus &lt;Shipping&gt; yielding a grand total of &lt;Total Price&gt;  \nC - Can I purchase them locally?  \nM - Yes ma'am, absolutely. May I suggest a list of local retailers?  \nC - Surely.   \nM - *Reads Several Entries from Retail List*  \nC - Can I purchase them on \"The Amazon\"?  \nM - Amazon.com? Most definitely!  \nC - I have \"The Prime\"  \nM - Me too. Pretty awesome, isn't it?  \nC - Oh, is it ever  \nM - Did you want to order them over the phone with myself or go through Amazon?  \nC - I'm 102 years old and don't get out very often, so it's easier for me to order them over the phone. Hold on one moment young man, while I dig out my charge card so I can order them through you today. I'll just use \"The Amazon.com\" next time  \n\n\nM - *Completes Order*  \nM - &lt;Outro&gt;",
        "created_utc": 1488633540,
        "upvote_ratio": ""
    },
    {
        "title": "They can't be this out of touch right?",
        "author": "GiveMeYourThrowAway",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x8sg4/they_cant_be_this_out_of_touch_right/",
        "text": "Quick one from one of my agents today (I'm Workforce for a new project that does seller support for a retail website).\n\nThis lady had called in demanding compensation for an error on a listing that had given her some very bad feedback. The issue was that the merchandise she was selling had the images mixed (she was selling hats with different designs so customer thought they were getting design A but got Design B instead.) The mistake was obviously hers, but it's still our fault apparently for having a confusing system or something.\n\nThe kicker is that she asked my rep \"What if \"redacted\" was paying you $5,000 a month, but due to a small error you were suddenly cut in pay to $3,000!?!?\"\n\nI wish I could speak to this woman who apparently thinks call center agents make between $31.25 and $18.75 an hour. \n\nWhat do people think it is like working in a call center? Who do they think they are getting a hold of when the call? Do you think you are speaking to someone with their own office half way up a sky-scraper seriously?",
        "created_utc": 1488521417,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Mar 3",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x8rgl/free_talk_friday_mar_3/",
        "text": "[removed]",
        "created_utc": 1488521009,
        "upvote_ratio": ""
    },
    {
        "title": "REMOVE THAT .02!",
        "author": "vegakit",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x7858/remove_that_02/",
        "text": "I am not kidding today. now I usually used to be active around here but let's just say I'm a little peeved at my current job with their taking away BOTH my m-f days off for mandatory overtime this week [I work 3x12s sooo on the plus side 16 hours of OT $$$$$]. SO LETS GET ON WITH THE DRAMS SHALL WE? :D\n\nSo! I work for a utility company, the way we read the meters at time of disconnection is the use the same reading to end as to start [Ex: Person x is disconnecting - last reading 12345 person connecting - starting reading 12345].\n\nWELP. Miss Doctorate decided that she was going to hem and haw over this bill.\n\n...for .02 more. Because she no longer lived there so it wasn't her responsibility. She never requested to disconnect services. Sooooo technically her responsibility. I tried to explain to her that unless we get a disconnection request we will take them out of the account holders name at the time they read the meter. \n\nNot that 'smart' people listen. -.-;",
        "created_utc": 1488501866,
        "upvote_ratio": ""
    },
    {
        "title": "Refund my fees!",
        "author": "Supertac3",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x6vt2/refund_my_fees/",
        "text": "Hey guys, this one is from a while back but I thought was pretty funny. \n\nMe: thanks for calling bank my name is supertac3 how can I help you today?\n\nC: you need to refund the fees on my account!\n\nMe: alright sir I would be more than happy to review the account, can I have the account number?\n\nC: *give card number*\n\nMe: I'm sorry sir but I'm not pulling anything up, our cards start with (series of numbers).\n\nC: this is a card from your bank, it's from my bank, you charged me fees and now you need to return them! (Screaming angrily)\n\nMe: sir I do apologize but we do not have access to your banks accounts, for any refunds you would have to go through your bank and dispute the charges, the atm does also tell you there is a service fee to use it.\n\nC: my bank said you have to refund it and I am not supposed to be charged for that with the type of account I have! Refund my money now!\n\nMe: sir as I stated I can't because we have no access to that account, we do offer accounts where we do not charge for foreign atm as well but that doesn't stop that company from charging you, this is something you have to take up with your bank.\n\nC: you aren't listening to me! Get me your manager! \n\nThe best part about this call was i told my manager how I handled it and my manager was like I can't do anything for him either but I guess I'll talk to him and they argued for a while too being told the exact same stuff, I'm not sure why people think bankers are gods lol",
        "created_utc": 1488498061,
        "upvote_ratio": ""
    },
    {
        "title": "Going above and beyond",
        "author": "Medication_Tolerance",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x5fag/going_above_and_beyond/",
        "text": "All my callers are being jerks today so I thought I'd share an old story that still makes me happy.  It's a bit long. \n\nIt was a Saturday several years ago and it was pretty slow.  I get a call from a nice woman, probably in her mid 50s to early 60s, not too bright or maybe didn't have much common sense. \n\nCaller:  \"Hi, I've been getting this magazine addressed to the person who lived here before and I want to cancel that. I live in an apartment and don't know her or where she moved to and I don't read this magazine.\"\n\n*Now we don't have magazines per se but we do have some publications and mailings so I figured this would be straightforward, just find the address and change the record to show that person no longer lived there so we'd stop sending mail there.*\n\nMe: \"Ok, sure. Happy to help. What is your address and the name of the person to whom it is addressed?\"\n\nCaller: *gives me information*\n\nMe: \"Hmm...I'm not seeing her in our system at all. She should be in here if we're sending her mail. What is the publication about?\"\n\nCaller: It's about exercise and stuff. \n\n*Starting to suspect this is not anything put out by us.*\n\nMe: \"Ma'am, what is the title of the magazine?\"\n\nCaller: \"Well, I'm not really sure, the picture of the girl on the front covers up most of the title.\"\n\nMe: *getting more suspicious*  \"Ok, that really doesn't sound like anything we would send out.  How did you get our number?\"\n\nCaller: \"It was just in the magazine.\"\n\nMe: \"Was it in the front where it has all the names of the people who worked on it and the publisher?\"\n\nCaller: \"No, it was just in there.\"\n\n*After a little more back and forth I realize we had an ad in the magazine and it had our number or she called information to get our number*\n\nMe:  \"Ok, ma'am. That doesn't appear to be our publication. What you need to do is go to the front of the magazine where it tells you how to contact the publisher and reach out to them to cancel the subscription. It should be one of the first few pages.\"\n\nCaller: \"Oh!  Ok.  Let me look then.\" *pages rustling*  \"Ok I think I found it. The number is 1-800 C-O-N-T-A-C...\" I'm making this up, I can't remember the actual number.) \n\nMe: *realizing she had just found another ad and is reading me the number for 1800Contacts*  \"Sorry to interrupt ma'am but that's just another company that is advertising in the magazine, not who published it.\"\n\nCaller: \"Oh, dear. Well, I'm not sure what to do.\"\n\nMe: \"Tell you what, why don't I try to figure out what magazine it is and then I can look up the number online for customer service.\"\n\nCaller: \"Would you, honey?  Thank you so much.\"\n\nMe: \"You're welcome. Now it sounds like one of those fitness magazines for women. Can you tell me the celebrity on the cover or at least what she looks like?\"\n\nCaller: \"I don't know who she is but she's real pretty. She has blond hair and is wearing a green bathing suit.\"\n\nMe: *googling images of current covers some of the main fitness magazines out there*  \"I think I found it!  At the bottom right of the front cover does it say, '1001 Tips for Choosing the Best Yoga Mat'?\"\n\nCaller:  *getting excited* \"It does!\" \n\nMe: \"Ok, great!  That's (name of fitness magazine).  Their number is 18005551234 and they're open Monday to Friday 8am to 5pm.  All you have to do call them Monday and ask them to stop sending you the magazine.\"\n\nCaller: \"Thank you, dear. You were such a big help. I just hated getting this magazine every month and throwing it away because I don't read it.\"\n\nMe: \"No problem. Have a nice day!\"\n\n\n\n",
        "created_utc": 1488483624,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me take a test?",
        "author": "Fileobrother",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x519f/can_you_help_me_take_a_test/",
        "text": "I work for an online safety product distributor as a fall protection specialist. We take incoming leads over phone and Live Chats from prospective customers and answer their questions about our products and OSHA code. Sometimes we get guys that just need info and have no intention of buying.\n\nToday, my coworker took a chat with a guy who was in the middle of a safety professional cert course and was taking a test on fall protection. He started asking my coworker true/false questions, and even basic questions that if he was barely present in the course, he would have known.\n\nHere's a life pro tip. If you want to get a certificate in a certain program, especially one where people's lives are on the line, please learn the material. \n\nTL;DR: Guy used our live chat to cheat on his safety test, putting people at risk. \n\n",
        "created_utc": 1488480063,
        "upvote_ratio": ""
    },
    {
        "title": "\"Ethernet Is Antiquated\"",
        "author": "GlissandosNTrills",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x19t5/ethernet_is_antiquated/",
        "text": "I got a call from a customer who was having issues with slow speeds over WiFi on her laptop. From the start, I will say that her attitude was rather condescending and reeked of \"millennial entitlement syndrome,\" but I mostly ignored it. I verify her account, and as I see her information load on the screen, I notice that not only is her device online, but the signal strength is excellent and she has a pretty good gateway that she purchased from a company whose name I will not disclose.\n\nShe tells me she has a few other devices connected to WiFi, but her laptop is the main one she's having an issue with (1st red flag). She ran a speed test over WiFi and was getting like *20mbps (she's paying for a *50mbps package). While that's not great, it's also not enough to send a tech for and it's limited to the one device. I had already explained to her the basics; WiFi speeds are not guaranteed and can vary; the more WiFi in the area, the more interference; common in apartment buildings and the like, etc.; great we had gotten all of that shit out of the way. \n\nThe tool we run to detect network issues didn't detect any problems with our network going into the home or any home signal problems in general, so that usually means it could be an issue with the device. Since she was using her own purchased device, the next step is to reach out to the manufacturer for further assistance. This is what transpired:\n\nC = Customer, M = Me\n\nM: This is what I'm going to recommend, just so we can get the best and most accurate results of the speeds you're receiving. I'd want you to plug your laptop directly into your device with an Ethernet cable and then we'll run another speed test. Do you have one of those available?\n\nC: (Huffy) Well, yeah. But I don't see how that's gonna resolve my problem. I barely use Ethernet anyway, it's like so antiquated.\n\nM: Well, plugging directly to the device will get better speeds. This is usually why most gamers prefer to use Ethernet instead of WiFi to get the best gameplay results. Otherwise, your game would probably lag more often and the next thing you know, you're dead (we chuckle).\n\nC: Yeah, well (laughs) I don't game so...ok...\n\nM: (Thinking) *Clearly*\n\nI hear her fiddling around with her laptop for a moment and then a sigh of either confusion or realization, I'm not sure.\n\nC: My laptop doesn't have an Ethernet port...\n\nM: (WTF?) Really? Are you sure?\n\nC: (Snotty) I know what an Ethernet port looks like and I definitely don't have one.\n\nEarlier in the call she had mentioned she had a certain fruit company's laptop. Remembering this, and knowing that that particular company (for whatever weird-ass reason) decided to remove the Ethernet ports on their later model laptops, I realize that she's going to have to use a USB Ethernet adapter. I was quite certain she probably didn't have one of those (since...ew...Ethernet, why would she right? /sarcasm), but I had to ask.\n\nM: Ah, you must have one of the newer [fruity-laptops] that doesn't have one of those. Usually you need to use a USB Ethernet adapter to use an Ethernet connection. You wouldn't happen to have one of those would you?\n\nC: (Snotty again) Uhh...no.\n\nM: Okay, so at this point, the signals coming through the home and the device are great and within specs. There also aren't currently any network issues going on, so you would need to contact your manufacturer to dig deeper into what's going on with your speeds.\n\nC: (Completely snotty at this point) I don't see what that has to do with anything. Like is it even possible that it could be a device issue?\n\nM: It's possible. There are many factors that can contribute to slower speeds that could be device related such as the router module having issues, or even a needed firmware update. You would need to reach out to them to find out for sure so they can rule out any device issues.\n\nC: But this is like a really good modem and I just bought it. I think this is a [Company] issue and I just want it fixed.\n\nM: I can definitely understand that. Your network is showing to be in good shape, though. So because we're not able to troubleshoot your hardware, I'd want you to go through the correct avenue to get that done. \n\nC: (Rudely) Yeah but I still don't see how you're fixing my problem by telling me that.\n\n*I pause to collect myself as she is aggravating the hell outta me at this point*\n\nM: Once again, the signal lev- (cuts me off...one of my MAJOR pet peeves)\n\nC: (Snippy af) Yeah, I heard you the first time.\n\n*I pause briefly again*\n\nM: Okay, so is there anything else that I can help you with? (Thinking) *Since you admittedly heard me the 1st time and thus know what to do from here*\n\nC: (Condescending) Is your only response going to be call the manufacturer of my modem to fix my problem?\n\nM: Yes. \n\nC: *click*\n\n(*) = True speeds have been altered for confidentiality purposes",
        "created_utc": 1488430149,
        "upvote_ratio": ""
    },
    {
        "title": "The first caller to make me truly uncomfortable [TW: anti-semitism]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5x12zk/the_first_caller_to_make_me_truly_uncomfortable/",
        "text": "[deleted]",
        "created_utc": 1488427714,
        "upvote_ratio": ""
    },
    {
        "title": "Sun Flowers(jpeg)",
        "author": "WhitestHispanic",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wzuou/sun_flowersjpeg/",
        "text": "I work in a call center that does HR roles for larger companies. My specific role is Dependent Verification. As some back ground for the rest of the story. If you have dependents enrolled on your benefits your company may wish to have them verified. A company can do this at any time. Typically it happens after annual enrollement.\n\nI just started this job coming up on 2 months ago. I have worked in call centers before doing other HR related duties. I will admit I am still learning the in's and out's and all the details of my job.\n\nIts late in my shift and I get a call, I wont put the company on blast but its an airline company. This specific company not only has us verify dependents for Benefits but for passengers of Employees who want them to fly for free. The customer calls in and hes pretty annoyed. He wants to know why his step-mother hasnt been verified as a passenger. I didnt set things off on the right tone when I told him we dont verify passengers.\n\nSo I place him on hold and review my resources. After having him hold for an extended period of time, I come back on the line and apologize for the long hold and for the mininformation. I explain to the customer that after further review I was wrong and we do verify passengers and that documenation we received for his step-mother was not what we needed to verify.\n\nFlying off at the handle the customer raises his voice and asks; \n\nCustomer \"What do you mean its not what you needed? Im looking right it.\"\nMe \"Sir if youre looking right at it then you would see you sent us a picture\"\nCustomer \"A picture of what?\"\nMe \"Flowers...Sun flowers to be specific\"\n\nSo I should mention, the only reason he wanted to verify his step-mother as a passenger was because his sister was excepting her first child and he wanted his step-mother and father to see her delivery.\n\nSo because I am having a great time knowing he fucked up harder than I did, I tell him in a very condesending tone. \"Well sir the good news is your deadline isnt for a few more weeks so you have plenty of time to send in documents needed\". He becomes more iriate and begins yelling at me. \"HOW IS THAT GOOD NEWS? SHE IS GOING TO DELIVERY ANY MINUTE AND THEY WILL MISS IT!\"\n\nAgain in a condescending tone I say, \"Well Sir once we get the documentation we will process. Is there anything else I can assist with?\" Without missing a beat, he says; \"No you've been a great help. (Sarcastic AF) Thanks for nothing!\"\n\nThe line goes silent, I have myself on mute to hide my laughter and he says; \"Did you hangup on me you cocksucker?\" I unmute myself and tell him \"I'm still here sir\" but at this point he was to busy yelling at someone else in the background.",
        "created_utc": 1488413578,
        "upvote_ratio": ""
    },
    {
        "title": "I WOULD LIKE TO CHANGE MY FORM OF PAYMENT",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wzu9v/i_would_like_to_change_my_form_of_payment/",
        "text": "I got a quickie for you:\n\n\nLady calls in and says she found a different credit card and would like to use that instead of the one she used...for a ticket she bought....2 months ago.\n\n\nGets upset that we can't \"reverse\" a payment on a nonrefundable ticket 2 months later so she can use a different credit card. \"THIS IS RIDICULOUS\" she says...\n\n\nSee y'all kids later.",
        "created_utc": 1488413476,
        "upvote_ratio": ""
    },
    {
        "title": "2 years for DirecTV, and another year after the AT&amp;T takeover. I'm done.",
        "author": "ConcernedCSR",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wwg5l/2_years_for_directv_and_another_year_after_the/",
        "text": "[removed]",
        "created_utc": 1488381287,
        "upvote_ratio": ""
    },
    {
        "title": "A Great First Call (Or: How I made sure I wouldn't last.)",
        "author": "NightwingAuditor",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wuinb/a_great_first_call_or_how_i_made_sure_i_wouldnt/",
        "text": "So, I was reminded of this story while catching up with a friend from my short stint in a call center working in the Retention department for the Small Business sector of a Major Financial Company.  Training took a few weeks, and I was completely paranoid that I'd be terrible.\n\n\nIn our cubicles, we were all divided into three 'teams' of sorts, which was mostly just a way of differentiating who our Manager was, while also making for a lightly competitive atmosphere.  When I was first put on the floor to sidejack with someone, and then take calls towards the end of the shift, We were in the midst of one such competition.  The goal was simple; See who could uncover the most unused spend.  Basically, they wanted us to find things that our customers weren't using our services for, and explain to them the benefits of paying with those expenses using us.  Pretty straight forward, right?  We were slowly working towards are goal, and It was finally time for my first call.\n\n\nI don't remember all the specifics, but the nice gentleman just wasn't seeing the value of keeping our services, he was a very low-grade account, which was why he had been sent to my queue.  Come to find out, he runs a shipping company.  Primarily using trucks.\n\n\nTrucks that use Gas, which he's been paying for with check and/or reimbursing drivers, because he didn't know A) About our Employee cards and B) the bonus rewards that come from Gas purchases.\n\n\nThe long and the short of it is, this account that was in the low thousands, had between twenty and twenty five thousand dollars, per month, in gas expenses that he hadn't been paying for with us...  In a competition for the first team to find $50,000 of money not being spent with us, My first call stumbled into nearly $300,000.\n\n\nOf course, I didn't win any actual prize for it, but in upper management's eyes, it somehow set the bar higher.  I was held to a higher standard, which lead to more stress.  My first call was a tall order to live up to.\n\n\nIn the end, I don't think I ever topped that call for sheer value.  My calls were minor accounts, and while I always ranked great on surveys for helpfulness and all that, but... Well, Financial companies don't care about that as much as the bottom line.  I never handled an account that big again in my short time there, and eventually the entire program was cut from the company I worked for, so the Financial Institution could handle it all inhouse.",
        "created_utc": 1488359357,
        "upvote_ratio": ""
    },
    {
        "title": "TFCC Top 5 Tales - February 2017",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5woa3s/tfcc_top_5_tales_february_2017/",
        "text": "**The winning tale from February 2017 is:**\n\n[Blacklisted a guy from ever calling us again](https://www.reddit.com/r/talesfromcallcenters/comments/5rk91t/blacklisted_a_guy_from_ever_calling_us_again/) by /u/BourbonBaccarat. Well done, your Reddit Gold has been deposited!\n\n**Our 4 runners up are:**\n\n[\"...to sell the toys you won't be needing soon?\"](https://www.reddit.com/r/talesfromcallcenters/comments/5uajuh/to_sell_the_toys_you_wont_be_needing_soon/) by /u/SquidbaitJR \n\n[Protip: don't chat with your significant other in the computer you work](https://www.reddit.com/r/talesfromcallcenters/comments/5u2b6d/protip_dont_chat_with_your_significant_other_in/) in by /u/unicodepepper\n\n[\"How do I get it to $499?\"](https://www.reddit.com/r/talesfromcallcenters/comments/5twtvs/how_do_i_get_it_to_499/) by /u/pierogituxedo \n\n[\"I want to interview your CEO.\"](https://www.reddit.com/r/talesfromcallcenters/comments/5tnpxs/i_want_to_interview_your_ceo/) by /u/Medication_Tolerance\n\n*You can find an archive of our previous top tales [here](https://www.reddit.com/r/talesfromcallcenters/wiki/top).*",
        "created_utc": 1488292291,
        "upvote_ratio": ""
    },
    {
        "title": "IF YOU MAKE SOMEONE ELSE HOLD MY BABY THATS GOING TO BE A BIG PROBLEM FOR YOUR COMPANY",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wnj8i/if_you_make_someone_else_hold_my_baby_thats_going/",
        "text": "Lets squeeze in two stories today\n\nAirline guy...\n\n\nFirst things first. Most airlines dont assign seats. That means when a flight is available for sale, you pick your seat when you book your flight at your leisure. That means the earlier you book, the more seating options you have available. You wouldnt ask someone to get out of their seat opening night in a packed movie theater if you wanted to sit with your boyfriend would you? Same concept.\n\n\nSo of course theres always a grey area. Such as families traveling with small children. So what airlines do now is they \"hold\" X number of seats, and dont make all seats available to assign before the flight so that in the event that all side by side seats are booked, we can still have seating for families or ppl with disabilities to be placed in certain spots.\n\n\nWell often I have to explain to parents who book flights for the very next day that theres absolutely no more seats left to *PRE-ASSIGN*, and that the airport will have to handle the seating on the day of. Meaning the airport has to assign those blocked seats we have no access to, literally the seats they want are the seats we are holding FOR THEM. And it usually goes like:\n\nM- it appears that the free seats that we have are all booked. But no worries, there are plenty of seats on this flight, they all appear to be held for family seating, so they will seat you guys together tomorrow morning once you arrive at the airport.\n\ncrazy parent - WHY CANT YOU DO IT NOW? THIS IS RIDICULOUS WE ALREADY PURCHASED TICKETS\n\nM- **paraphrases previous statement, with emphasis on \"you will have seats, but we cant take someone out of their seats to put you together today, it will all be handled for you tomorrow\"**\n\ncrazy guy- This is OUTRAGEOUS. So you mean to tell me, you are going to split me from my wife and children, and my child could possibly be sitting in the lap of a complete stranger? IF YOU MAKE SOMEONE ELSE HOLD MY BABY THATS GOING TO BE A BIG PROBLEM FOR YOUR COMPANY\n\n\n(me thinking back to a time where we have required a mother to hand her infant over to a complete stranger because we didnt have side by side seating available because they booked the last 5 seats on a flight scheduled for tomorrow morning)\n\n\n\n**calls another department after disconnecting to ask a really dumb question, acting as if I didnt know the answer, just to get a break from a call that almost made my hair melt**",
        "created_utc": 1488282297,
        "upvote_ratio": ""
    },
    {
        "title": "You only have $4",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wmn6y/you_only_have_4/",
        "text": "Cx: [Big long rambling story that has nothing to do with any actual issue}\n\nMe: How may I help with that?\n\nCx: They're not accepting my Debit Visa card number\n\nMe: Who is \"they\"?\n\nCx: [some online merchant]\n\nMe: How much are you trying to charge?\n\nCx: $1XX.xx\n\nMe: You only have $4, that's why you can't spend $1XX.xx\n\nCx: Why is that?\n\nMe: .....You spent all your money\n\nCx: You mean I don't have any left?\n\nMe: Yes",
        "created_utc": 1488266276,
        "upvote_ratio": ""
    },
    {
        "title": "Free Talk Friday - Feb 28",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wmdi9/free_talk_friday_feb_28/",
        "text": "Welcome to Free Talk Friday! We're suspending the usual 'tales only' rule within this thread (other rules still apply) meaning you guys can talk about whatever you like and let your hair down.\n\nP.S. If you want to have a rant about something, head over to /r/callcentre where you'll find the Weekly Rant &amp; Rage Thread has just been posted.\n",
        "created_utc": 1488261983,
        "upvote_ratio": ""
    },
    {
        "title": "YOU'RE GOING TO THE UNEMPLOYMENT LINE!!!",
        "author": "renkkun",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wm27u/youre_going_to_the_unemployment_line/",
        "text": "Hi guys! Me again. This reddit is addicting, isn't it?\n\nI have another story for you guys. So, there is a woman that is literally banned from calling my work. She is literally banned from a government agency. Let that sink in! \n\nStill with me? Good!\n\nThe lady is schizophrenic and thinks the call center has been hacked and her files have been tampered with. In training, they mention her by name. Let's call her Jane Doe. The supervisors get special training on how to deal with her.  If you get her call, you are told to escalate it immediately. \n\nShe's kind of viewed as a right of initiation. She calls a few times a day, even though she's banned. She gets other agencies to transfer her, or borrows people's phone numbers. In any case, I got her last week. I noticed the name pop up but her name is very common, there could be a million Jane Doe's.  I didn't immediately panic and the lady didn't seem too crazy....\n\nFor the first minute.\n\nShe ranted at me for twelve minutes. She mentioned she had a problem, started to explain, and it delved into the government is being hacked, her files are tampered with, no one will help her because she knows the truth and the government is trying to stop her. I'm flipping my shit at this point, all of the supervisors are away or have gone home as it's nearing the end of the day. There's one guy and he's in a meeting, so I send an IM and just say Jane Doe. He has an \"oh shit\" reaction, leaves his meeting, comes to my desk and says I'll take the call.\n\nI haven't said a word to Jane Doe at this point and it's 12 minutes into the call. She finally pauses and goes: \"So, can you help me?\"\n\nAnd I'm like: I'm transferring you to a supervisor.\n\nJane Doe flips her shit and starts screaming in a demonic voice: you're going to the unemployment line! You're only sending me to a supervisor because I know the truth!! \n\nI transferred her while she was still screaming. Lady was scary!\n\nShe's very famous apparently on the internet for doing this sort of thing, has a lot of internet conspiracy blogs about the federal government and believes Obama was born in Kansas or something.",
        "created_utc": 1488257959,
        "upvote_ratio": ""
    },
    {
        "title": "It can't be that!",
        "author": "Joetato",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wkr8b/it_cant_be_that/",
        "text": "So, I work in a call center for a company that makes touchscreen Point of Sale systems. I'm a Tier 1 rep who fixes the POS systems when they break. Software only, though. If it's a hardware problem, I diagnose it and let another department handle replacing the hardware.\n\nSo, a guy from our biggest client calls in. And by big, I mean if we lost this client, probably 70% of the company's employees  would be laid off because this client accounts for the majority of our revenue. So, generally, we have to be extremely nice to these people. The guy calling in is the owner of one of our client's stores. It's a franchise model.\n\nHis POS isn't working. I won't get into the exact details of what's wrong, but our conversation went about like this, picking up at the troubleshooting part:\n\nMe: Well, the first thing you'd want to do is check the ethernet cable running from your modem to our router. If that cable is unplugged or bad, your system won't work.\n\nHim: No. It can't be that.\n\nMe: Well, if you could check it anyway, I'd appreciate it. We need to check everything.\n\nHim: No, there's no reason to. It can't be that.\n\nOh great. Okay, well, instead of pushing the point, I'm going to assume he's right and it isn't the cable. If nothing else works, I'll go back to the cable.\n\nMe: Well, next, let's check the router we installed. We need to make sure it's powered on and everything that should be plugged in is.\n\nHim: It can't be that. I won't do that.\n\nMe: Um, all right. Well, you should at least power cycle it, as sometimes hardware just need to be rebooted.\n\nHim: No. It can't be that.\n\nMe: Well, we can't really eliminate that possibility until we check it.\n\nHim: No. It's impossible that's it.\n\nOkay. This is getting real frustrating real fast. Let's give it one more shot.\n\nMe: All right. You have a server installed on the wall in the back. It's bolted to the wall in the back of the store. Let's check that and make sure it's turned on.\n\nHim: No. It can't be that.\n\nOH MY GOD. WHAT THE FUCK IS WRONG WITH THIS PERSON?! He never gave me a reason why he kept saying that and literally every single thing I suggested he check was met with \"It can't be that.\" \n\nFinally, he hung up on me after a few more suggestions that I \"have no idea\" how to troubleshoot.\n\nIt wasn't a bad call so much as an annoying one.",
        "created_utc": 1488242875,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do you have a computer with internet?\"",
        "author": "pierogituxedo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wkijq/do_you_have_a_computer_with_internet/",
        "text": "Hey all, It's your friendly neighborhood Pierogituxedo here with another great story from the front! This happened just a wee bit ago. Now, for those of you just tuning in, I work for the online division of a major Orange company. In my very opening, I always tell customers the same thing:\n\n\"Hello and thank you for calling ****.com...\"\n\nToday, a customer asked me a very honest question...\n\n\"Hello, and thank you for calling ****.com, My name is Pierogituxedo, how may I help you?\"\n\nInternet User: \"Hi there, My order came in wrong when I ordered it on the internets from your google. I need to return it, how do I go about that?\"\n\nI politely explained our return policy, and she was really understanding. She even went to place a reorder.\n\nIU: \"Ok, so I saw this product on *Major Competitors* google. Do you have a computer with internet?\"\n\nI stopped a moment, and looked around. Without missing a beat, I replied:\n\n\"Yes ma'am, I certainly do, I'd be happy to match that price!\"\n\nI finished the order, and thanked her for her time. I gave her her order number, and she paused for a minute and asked me:\n\nIU: \"So, what department is this?\"\n\nMe: \"This is ****.com, ma'am. We're the online division.\"\n\nIU: \"Ohhh, so you guys work on the googles?\"\n\nI couldn't hold it in anymore. \n\nMe: \"(Chuckle) Yes ma'am, we work on the googles.\"\n\nShe laughed and went on to my survey. It's nice folks like this that make my job better.\n",
        "created_utc": 1488240402,
        "upvote_ratio": ""
    },
    {
        "title": "Credit cards aren't borrowing money",
        "author": "conservio",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wjyzh/credit_cards_arent_borrowing_money/",
        "text": "I work in a call center for a credit union. This guy opened a membership to apply for a bill consolidation loan. He was not approved due delinquent accounts and his credit score. I told him tha and then asked to apply for a credit card. This guy is 59\n\nI'm me and he is Dude \n\nDude: okay can I apply for a credit card? It's not the same as A loan.. it's not like I'm borrowing money. You probably won't need to check my history. \n\nMe: well we actually do need to because you are borrowing money for he most part. That's why people need cards. Let's say you have $100 in checking and need $200 with of groceries, you are borrowing that extra $100. \n\nDude: well how would they know? They don't know my income or accounts. \n\nMe: that's correct but it's still considered borrowing money. \n\n*do the app, surprised it's turned down** \n\nMe: I'm sorry but you were turned for the same reason, delinquent accounts.\n\nDude: I don't have any delinquent accounts. I don't have a credit card or any loans! \n\nMe: well if you have anything like gas, electric, etc and you are delqient on those, it'll report to the bureaus. You can check your Report on annualcreditreport.com \n\nDude: no I have nothing delinquent! \n\nMe: well you still should check just to be sure\n\nDude: well since you can't offer me anything, there's no point in me joining.  \n\n\nOkay bye. You're rude as fuck anyway, good luck getting anything elsewhere! ",
        "created_utc": 1488234864,
        "upvote_ratio": ""
    },
    {
        "title": "Spreadsheet guy and the impossible birthday",
        "author": "Theblackholeinbflat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5whb8a/spreadsheet_guy_and_the_impossible_birthday/",
        "text": "Hello, it's me again, #1 bad person. I have another spreadsheet guy story (hopefully the last) that I wanted to share. \n\nHere I am, sitting at my desk and enjoying my morning coffee, dreading the tax season Monday. The second I get into ready my phone rings. Who else would it be but spreadsheet guy? \n\nMe: hi thank you for calling! This is blackhole, can I get your first, last name, and DOB? \n\nSG: spreadsheet guy, and December 33rd 1942.\n\nMe: I'm sorry? December 23rd? \n\nSG: No! I said 33rd! Enter that in your system and pull me up! \n\nMe: uh, SG, that's not an actual date. \n\nSG: YOU WILL ENTER IT IN, MY POINT WILL BE PROVEN. \n\nMe: Err what? \n\nSG: That you don't need a valid DOB to pull up my account and that you're just trying to make things difficult! \n\nMe: ok, SG, I entered it in and nothing came up (I did not, in fact, enter it in. I'm a filthy liar). \n\nSG: THAT'S IT! YOU'RE AT THE TOP OF THE LIST! - click-\n\nSo... That's the first call of the week for me! Hope yours isn't as eventful!",
        "created_utc": 1488209223,
        "upvote_ratio": ""
    },
    {
        "title": "WHAT DO YOU MEAN I HAVE TO CALL THEM BACK?",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5wfiz0/what_do_you_mean_i_have_to_call_them_back/",
        "text": "Hiya! Airline guy,\n\nSo in the airline industry we have a concept called \"reprotecting\" which means if a flight is delayed or cancelled and its not weather related, we can sometimes call another airline that we have a contractual agreement with if they have flights to the same origin and destinations.\n\nSo lets say airline A cancelled their flights and have nothing else that day. Airline A can book flights using Airline B's aircraft and schedule but they HAVE to confirm with airline B because if not youre basically putting a flight on hold that hasnt been paid for. The other airline can and will deny the passenger and its really a nightmare for them, but its nothing we would be able to do. Its like asking Target to take a return from Walmart for a broken item. So it is IMPERATIVE that Airline A make sure that the protection is properly done so that someone doesnt show up to Airline B gate with a ticket thinking everything is taken care of. Unfortunately if its not done properly we have to direct the customers back to the airline they booked their original ticket with so that they can properly send over the information that shows they have paid to put THEIR passenger on OUR flight.\n\nAnd thats exactly what happened today. Some guy calls in upset because his nieces ticket is \"cancelled\" and \"we need to do something about this\", keep in mind, our flights arent cancelled, the airline he booked with cancelled and someone didnt do their job over there and sent the guy over to us.\n\n(after hearing a 20 second rant)\nM-absolutely sir can I get your confirmation code?\n\nguy- THEY DIDNT GIVE ME ONE\n\nM- i understand sir, i would need for you to give me something. did _____ not provide you with ANYTHING to bring to us?\n\nguy- look they put her on this flight why cant you find it?\n\nM- there does seem to be a flight at this time, however your niece does not appear to be one of the passengers on the flight. You would need to reconfirm with the carrier that they in fact placed her on our flight, we arent showing and record of a ticket being issued.\n\nguy- look you need to get this straightened out.\n\nM- the only way to fix this is to give them a ring\n\nguy- I JUST GOT OFF THE PHONE WITH THEM YOU MEAN I HAVE TO CALL THEM BACK?\n\nM- that is correct\n\nguy- **hangs up**\n\n\nJust in time for me to sign out of the phone. Shift complete!",
        "created_utc": 1488181688,
        "upvote_ratio": ""
    },
    {
        "title": "Four weeks from yesterday until our call center closes.",
        "author": "Darwi_Odrade_",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5w7yqk/four_weeks_from_yesterday_until_our_call_center/",
        "text": "[removed]",
        "created_utc": 1488076455,
        "upvote_ratio": ""
    },
    {
        "title": "Snowflakes killing my NPS and VOYC",
        "author": "Wrap_Monkey",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5w7tyj/snowflakes_killing_my_nps_and_voyc/",
        "text": "Past few months I have had a terrible run with surveys.  My last Voice of Your Customer survey was typical example with every catagory returned with lowest score. \n\n\n\n*I look at her details. She has come through with lowest level of security I also notice later she is 19.\nMe: Hello Snowflake, I understand you want to change your address. \nSnowflake: Oh yes please, I need that changed now, its important I need to do this now.\n\n&amp;nbsp;\n\nME: I can see you have answered all questions coming through, I do not suppose you have a Secuirty Number issued for Telephone Banking do you?  (I already knew she did not have one, just letting her down gently)\n\n&amp;nbsp;\n\nSnowflake: No, I just use interenet banking, not telephone banking, why?\n\n&amp;nbsp;\n\nMe:  I really sorry about this, I can not change an address unless you had that Secuirty Number.   \n\n&amp;nbsp;\n\nSnowflake: What do you mean no.  You must be able to, look I answered all the questions, now just change my address.\n\n&amp;nbsp;\n\nMe: Sorry Snowflake, that is impossible, much as I would  like to do that, I can not. However you can change it at any bank if you take in some photo ID or send us a change of address form in.\n\n&amp;nbsp;\n\nSnowflake: Oh... So there is nothing you can do?  Are you sure about that?  I can not get to a bank, they are shut when I finish work. \n\n&amp;nbsp;\n\nMe: I really am sorry, but those are really the only options you have.\n\n&amp;nbsp;\n\nSnowflake.  Ok then thank you goodbye.\n\n&amp;nbsp;\n\n*Close call in usual way. \n\n&amp;nbsp;\n\nSo I think nothing of this, just a diaspoint polite young lady, but the comments in the Survey were a total opposite, a lengthy rant about how rubbish the bank is, how disgraceful it is we can not change customers address without a Secuirty Number and so on.\n\n&amp;nbsp;\n\nReally sucks they just want revenge without thinking what effect they can have on someone who has been very sympathetic and could not do anything apart from give advice how to move forward. \n\n",
        "created_utc": 1488074637,
        "upvote_ratio": ""
    },
    {
        "title": "App issues",
        "author": "MisazamatVatan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5w0f89/app_issues/",
        "text": "When I first started working at my current job I was working as a CSA I've since transferred to the legal department but when it's busy I help out the CSA'S.  \n\nSo today it was pretty busy and I was helping out, I was only on chat and usually it's just people asking simple questions like \"what products do you offer?\" Etc \n\nSo about 10:30am I get a chat through that went a little like this I'm Me and customer is AM (for angry man). \n\nMe \"hi Angry Man, you're through to Misazamatvatan how can I help? \n\nAM \"I HAVE LOGGED ON TO YOUR APP FOUR TIMES AND IT HAS CRASHED!!!!\" \n\nMe \"I'm sorry to hear that, just to clarify you've logged in 4 times and each time, the app has crashed?\" (This is usually because of connectivity issues, the app will only work on 3g / 4g or wifi) \n\nAM \"YOUR APP KEEPS CRASHING!!!\" \n\nMe \"OK,  well I'd be more than happy to help troubleshoot this for you, I'll just need to ask you a few more questions.\" \n\nAM \"No I just wanted to tell you it keep crashing\" \n\nHe then left the chat, he didn't come back at all the rest of the day. It's quite possibly the weirdest chat I've ever had, although straight after I had a guy ask me if I was a real person and then say I must be as I was too friendly to be a bot.",
        "created_utc": 1487973636,
        "upvote_ratio": ""
    },
    {
        "title": "I'm free! Finally free from it all",
        "author": "ukwonwon",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vzjdf/im_free_finally_free_from_it_all/",
        "text": "[removed]",
        "created_utc": 1487964620,
        "upvote_ratio": ""
    },
    {
        "title": "Incorrect Password",
        "author": "ermergerdberbles",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vv7yn/incorrect_password/",
        "text": "I just had this call for maybe the 10th time tonight.  Rather than attempt again, they call in and wait only to be advised the same thing the website already did.\n\nCx: Why can't I log in?\n\nMe: What is the error message you are receiving?\n\nCx: Incorrect Password\n\nMe: That's why you can't log in, just use the correct password\n\nCx: But I am\n\nMe: No you're not.  Try it, you'll see\n\nCx: [typing sounds] ohhhhh it worked!  What did you do?\n\nMe: Nothing more than telling you to use the correct password.",
        "created_utc": 1487906960,
        "upvote_ratio": ""
    },
    {
        "title": "Reservation for a non-existent date",
        "author": "archergwen",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vtxaz/reservation_for_a_nonexistent_date/",
        "text": "I took reservations at a call center for a hotel for about a year. While I have forgotten many details of calls I wish I'd shared here, this one I will never forget a single word.\n\nOur company has quite a few hotels, and several accommodate conferences. A woman called in, and at first it seemed fine. She was pleasant, had the conference name and the one on the reservation so I could pull it up easily, and she just wanted to be sure her reservation was in our system, since it was made through the conference and not the hotel itself. Thanks to that, I can only see the barest bones of the reservation - don't even have an email to send a confirmation - but even so I was starting to relax when I verified the dates.\n\n**Me:** -and you're booked Friday, September 16th, 2016, for two nights with X Conference.\n\n**Caller:** That's not right.\n\n**Me:** *mentally screaming as I look in the other window to see when the other conference reservations are for.* Let me double-check that for you.\n\n**Caller:** Yes, I need my reservation for September 18th.\n\nNow, I pull up all the information on this conference. It shows that everyone coming into the hotel for this conference is checking in Friday the 16th and checking out on Sunday, the 18th. At bit more digging shows the reduced rate is not supposed to be offered outside of those two nights. Even so, no one - not even our CEO - could change this reservation as the conference made it.\n\n**Me:** Ma'am, I'm seeing that you have the two nights of the conference reserved, the same as everyone else. Everything is fine.\n\n**Caller:** So my reservation is for September 18th?\n\n**Me:** No, ma'am, it's for Friday, September 16th.\n\n**Caller:** I don't want to come in then! I need my reservation for Friday, September 18th!\n\n**Me:** Ma'am, that's not possible; the 18th is a Sunday. The conference will be over then; you have the dates you want.\n\n**Caller:** My reservation should be for Friday the 18th.\n\n**Me:** Ma'am, as I told you, the conference falls on Friday and Saturday, and in September 2016 the Friday you want is on the 16th. Your reservation is correct.\n\nThis goes on for at least thirty seconds to a minute, with her insisting that September 18th, 2016 is a Friday and me, staring a calendar, knowing her to be wrong and trying to slip in suggestions to look at a calendar that won't send her from mildly frustrated to yelling at me. I don't want to try to explain this to a supervisor. Eventually, with my neighbor at this point trying not to laugh at me as she shoots me pity looks:\n\n**Caller:** So it's for Friday the 18th?\n\n**Me:** *My soul ascends to another plane in which I scream.* Sure.\n\n**Caller:** Thank you.\n\n**Me:** If you like, I can send you a confirmation-\n\n**Caller:** *hangs up*\n\nWhich, in all honestly, was probably for the best.",
        "created_utc": 1487892243,
        "upvote_ratio": ""
    },
    {
        "title": "But the app says AAA",
        "author": "koalaplum",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vprpi/but_the_app_says_aaa/",
        "text": "Customer needed help completing setup for our \"Safe Driving discount\" program. Its not possible to complete setup without downloading it's app first.\n\nCustomer: Hello I needed help setting up your \"Safe driving discount\" but Im not sure what Im doing wrong and I already have the app downloaded.\n\nMe: Okay sorry to hear that I can definitely help you complete setup. Were you able to login?\n\nCustomer: yes\n\nMe: Okay what do you see after you login?\n\nCustomer: Uhh it lets me request road side service like if I had a flat tire or dead battery.\n\nMe: Okay, that would not be the \"Safe driving discount\" app since our app only has your mileage and trip logs, can you go to your home screen and find the app icon that says \"safe driving discount\"?\n\nCustomer: Okay, uh ya I found it, it says Triple A(AAA).\n\nMe: No sir that is not our app, the app has to say safe driving discount. Can you go to your app store and type that in please?\n\nCustomer: Ya I typed it in and i already have the AAA app downloaded to my phone!\n\nMe: We are not AAA, our app is not called AAA, its called safe driving discount, can you please type that in? and I spell it out for him.\n\nCustomer: Oh okay I just downloaded the app but it only shows me help for road side service.\n\nMe: It sounds like you're still in the AAA app, can you please get out of the app and search for safe driving discount?\n\nCustomer: Okay but the app icon has 3 A's and theres like a blue saturn ring around it which is you guys.\n\nMe: Mr. C we are not Triple A nor are we associated with them in anyway and the colors on our logo do not have the color blue and they have never had that color. The app that has 3 A's is not our app.\n\nI tell him the colors we do have on our app logo.\n\nCustomer: Ohhh that must be my problem, Im in the wrong app! Im so sorry, let me see if I see any app in my phone that have those colors.\n\nI wait a few minutes and he ended up having our app already downloaded and was logged in and I just helped him complete setup.\n\nWe had a good laugh afterwards and he told me he would be fine from here. Really polite guy.",
        "created_utc": 1487847002,
        "upvote_ratio": ""
    },
    {
        "title": "Rude customer who thought I misunderstood but he was the one who misunderstood.",
        "author": "koalaplum",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vpn8x/rude_customer_who_thought_i_misunderstood_but_he/",
        "text": "Customer needed his email updated so he could login since he said we had the incorrect email on file for him.\n\nSo it makes it easier for you guys to understand later, his previous and current email were only one number different from each other so the email we had on file for him was \"jerk1@aol.com\" and username was jerk1.\n\nHe was already really agitated after I said my greeting but after he told me his issue this was our conversation:\n\n\nMe: what email would like to have on file?\n\nCustomer: Email is jerk2@aol.com, can you hurry up and log me in already?\n\nMe: ok thank you I just updated it and I apologize these are the procedures I have to follow to help you login.\n\nI then had to verify him more so I could provide his login information and I ask if he would like to keep the same user name \"jerk1\"\n\nCustomer: NO DID YOU NOT HEAR Anything I just said, I told you already that you have my email incorrect!\n\nMe: I know and I changed it but I asked what username you'd like to have.\n\nCustomer: I told you I changed my email so no, obviously I don't want my username to be the same as my old email\n\nMe: Ok what do u want your user name to be?\n\nCustomer: Jerk1, I already told you this. You know for a big company you guys have terrible service.\n\n??????\n\nMe: When I asked you what email you wanted on file you said jerk2@aol.com\n\nCustomer: no you asked me what my old email was so I told you.\n\nMe: I didn't but just so were clear, you want your username to be jerk1? And the email jerk1@aol.com? \n(LIKE IT WAS IN THE FIRST PLACE)\n\nCustomer: yes?? I only told you 10 times.\n\nI update his info to what we originally had for him.\n\nI really couldn't handle starting another argument with him explaining how he was actually the one that was wrong so I just told him I just wanted to make sure so this issue never happens again.\n\nCustomer: okay can I get off the phone now?\n\nMe: unless there's anything else I can help you with today then yes.\n\nCustomer: Actually there's one more thing, in the future can you make sure to pay attention to what your customers say so you don't piss them off like you did to me?\n\nMe: I do pay attention, is there anything else I can help with?\n\nCustomer: nope except for what I just said okay?\n\nMe: okay thanks for calling \"company name\" have a great night. And I hang up.",
        "created_utc": 1487844738,
        "upvote_ratio": ""
    },
    {
        "title": "Rude customer who misunderstood.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vpmcb/rude_customer_who_misunderstood/",
        "text": "[deleted]",
        "created_utc": 1487844344,
        "upvote_ratio": ""
    },
    {
        "title": "Rude ass customer acting like I misunderstood , when he was the one who misunderstood.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vpkhf/rude_ass_customer_acting_like_i_misunderstood/",
        "text": "[removed]",
        "created_utc": 1487843363,
        "upvote_ratio": ""
    },
    {
        "title": "F*&amp;% YOU UNBLOCK MY CARD!!!",
        "author": "alesher",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vp5hm/f_you_unblock_my_card/",
        "text": "So I work for a certain bank in the fraud detection department. After training, and on the first day of my job on the floor I have a \"coach\" sitting with me to give me tips and such before I go out on my own. My first call comes in from another rep in my department's call center and the representative tells me, \"I have Mr. D on the line and he is very irate. He was transferred from customer service and he is upset because his card is still declining.\" So I think ok no problem I can help him but why can't you? She then says \"I was trying to help him but he said he wants to speak from someone in the US.\" Now our bank doesn't actually have any staff outside the US but this poor woman had a very slight accent. I apologized that she had to go through this and accepted the call. I answer the phone and say, \"Hello this is xxxx this call may be monitored or recorded.\nFirst thing I hear, \"FUCK YOU UNBLOCK MY CARD.\"\n\"OK sir I can help with that but I need to ask you some security questions to access your account. What are the last four digits of you SSN?\"\n\"0000, FUCK YOU UNBLOCK MY FUCKING CARD!\"\n\"Thank you sir, and how about your date of birth?\"\n\"FUCK YOU! UNBLOCK MY GODDAMN CARD FUCK YOU ITS 1/1/1960\" (Or whatever it was, he was middle aged).\n\"OK sir I need you to refrain from using profanity otherwise I will disconnect the call, I understand you're frustrated but swearing isn't going to help the situation.\"\n\"FUCK YOU UNBLOCK MY CARD.\"\nI turn to my coach and her eyes are wide open. \"Just try to ignore it, if he keeps swearing at you just disconnect the call, you are not required to listen to this,\" she says.\n\" OK sir I have your account pulled up let me make some adjustments to your account to let that transaction go through.\"\n\"FUCKING HURRY UP THIS IS BULLSHIT, FUCK YOU AND FUCK THIS BANK!\"\nI ignore it and make the adjustments and after a few seconds tell him to retry the purchase and it should go through.\n\"OK sir did it work for you this time?\"\n\"Yes it went through. Thank you, you have been very helpful, I appreciate your time.\" he says in the most polite voice I have ever heard. \nAfter I wrap up the call my coach tells me that she has never had such an angry customer in her 2 years of working there. It was one hell of a first call.",
        "created_utc": 1487835568,
        "upvote_ratio": ""
    },
    {
        "title": "Jokes on you, lady, the call is recorded.",
        "author": "renkkun",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vosth/jokes_on_you_lady_the_call_is_recorded/",
        "text": "This is my first post! Hi guys.\n\nSo a few months ago I got a job in a call center that deals with health insurance. We get lawyers, doctor's, Bene's, and insurers calling in constantly. It's a high volume call center and very stressful. \n\nToday I had a terrible day. This woman, who I knew would be terrible just by looking in the notes from a previous employer, was belligerent and rude. The short version of it is I informed her she had to call an insurance company to get the date they dropped her from the insurance. We had already sent a letter to the insurance company, which was ignored as they usually are.\n\nShe didn't like that, informed me that my coworker said the letter would fix everything, and then started screaming at me. Then she insisted I was screaming at her, demanded a supervisor, then filed a complaint against me. Because I didn't tell her what she wanted.\n\nWhat's fucked up is our supervisors tell us before we transfer we have to advise the caller, no matter how abusive they are, that the supervisor will tell them the same thing. Which makes them angrier. \n\nWhat made matters worse is the lady was loudly talking shit about me while I tried to flag down a supervisor. It just amuses me that this lady tried so hard to get me fired she literally made up shit.\n\nJoke is on her though, the call is recorded!",
        "created_utc": 1487830586,
        "upvote_ratio": ""
    },
    {
        "title": "My job makes me want to punch kittens. And I love kittens.",
        "author": "Imreallynothere1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vmuzg/my_job_makes_me_want_to_punch_kittens_and_i_love/",
        "text": "[removed]",
        "created_utc": 1487811180,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't Want To Talk About This Crap Either",
        "author": "GlissandosNTrills",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vlnpl/i_dont_want_to_talk_about_this_crap_either/",
        "text": "So in order to hit certain points and improve our metrics, we're required to mention certain things during a call, specifically the app. What really irritates the hell out of most of us is the fact that even though it is clear we are speaking with someone who is technologically challenged, if we don't mention it because....well...common sense, we still get dinged. It also opens the door for stupid-ass exchanges like this one:\n\nTCA =Technologically challenged...yeah you know...\n\n*Closing the call*\n\nMe: Alright, I'll also let you know that you can also track or modify your pending appointment through  [our stupid app we have to mention on every damn call], if you have something like a Smartphone or tablet. You can get it from the App Store if it's an Apple product, or The Google Play Store if it's an Android device.\n\nTCA: Yeah, I didn't understand a word you just said and don't see how it's going to fix my problem.\n\nMe: Well, I've scheduled a tech visit for you, in the event you need to reschedule I was giving you a quicker option to do so without having to call in and wait on hold for an agent to do it.\n\nTCA: But I don't ever intend to use that and don't see what it has to do with my problem I just want it fixed.\n\nMe: *Thinking* Bruh, I don't give a shit if you intend to use the stupid app or not. Just say \"ok\" stop arguing with me and hang the fuck up. Jesus.\n\nMe: *What I actually said* Ok, is there anything else I can help you with?\n\nTCA: NO. *Click*\n\nWho knew not having caller ID for a moment would bring a person to that level of hostility when literally EVERYTHING else with the phone is working fine? I wonder how he survived the 80s and early 90s. I know his old ass was alive before caller ID.\n\n/rant",
        "created_utc": 1487799993,
        "upvote_ratio": ""
    },
    {
        "title": "Usual layer 8 ..",
        "author": "Aphrodite_",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vip0k/usual_layer_8/",
        "text": "First time bla bla bla. \n\nSo I work as L1 tech support for a company that operates several call centers. My colleagues are a couple of other L1 and L2 guys and our manager (L3). This tale takes place today.\n\n- Operational manager for one of the call centers\"$opman\". Handles business from our side with the customer.\n- Call center sort of \"senior\" supervisor \"$ssup\". A mid 50s lovely guy. \n- Yours truly \"$me\"\n- My boss \"$L3\"\n- A very popular franchise restaurant call center \"$tasty\"\n\nNow, keep in mind that $ssup is not completely tech-illiterate, or that's how I imagined him to be. Alas, layer 8 will always be layer 8. \n\nSo I was sitting at my desk finishing some things and I get an email, followed directly by a call from $opman telling me they have a major problem: the call center is down, no inbound or outbound calls are going through! Now, this guy is always precise with his words so \"down\" meant they were actually down, which means they were not taking calls, the customer is gonna get very angry every passing minute, $opman's ass is on the line and the clock is ticking!\n\nI immediately stand up and go directly to $L3's office as the situation is very urgent and it would be best to be communicated in person while at the same time dialing $tasty's IVR and trying to reach an agent. I enter his office and find an L2 friend and colleague sitting down with him so I tell them both: gents, $tasty is down. At the same moment, I hear \"Hello, this is $agent, what would you like to order today ?\" so I tell the agent I'm calling to test the system and ask her if she can hear me clearly, to which she says yes I can hear you very well so I thank her and hang up. $L3 looks at me and says \"well, looks like it's not down after all, go to them and see what's up. $L2 and I will monitor the system from here\". \n\nRelieved that $tasty was not actually down, I take a stroll to $opman's office (another building). I meet him and assure him that I was just on the phone with an agent, $tasty is not actually down. He tells me that the original email came from $ssup and he just took a quick look at it and then forwarded it to us. I go to the actual call center (different floor) to meet $ssup to understand what the hell was going on. The agents tell me he was finishing something and will be back shortly so I sit down and wait for him. A couple of minutes later, $ssup comes over and we have this chat:\n\n- $me: could you explain to me what the problem actually is ?\n- $ssup: well, I can't make outbound calls. \n- $me: okay, let's make a test call to troubleshoot this\n\nI dial my mobile number and sure enough, my phone rings (thank god, this means outbound dialing was working fine), I pick up and give him the phone while I try to talk to him from his PC.\n\n- $me: Hello, can you hear me ?\n- $ssup: Yes, but can you hear me ? \n- $me: No, I can't hear you from the headset. \n\nI notice that there was no sound whatsoever from the headset so as any sane tech support pro, I trace the problem to the first probable cause: is the PC sound muted ? It was indeed muted, I turn it up and $ssup and I confirm that we can actually hear each other just fine now. \n\nI explain to the guy what was wrong and how to solve this \"issue\" next time and go back to my desk while thinking deeply about the meaning of life. \n\nA user had his PC sound muted so the whole call center was suddenly \"down\". Another day at the front, eh ?   ",
        "created_utc": 1487770647,
        "upvote_ratio": ""
    },
    {
        "title": "When the customer puts YOU on hold?",
        "author": "ColdHeartedSleuth",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vhzhj/when_the_customer_puts_you_on_hold/",
        "text": "Hey guys :)\n\nSo I work in banking. Some days we have some inbound calls (sigh), some days we have some outbound calls. This customer requested a call from my department in relation to his application. He didn't want to speak with the frontline department.\n\nI call this guy, we don't get through the ID check as yet, but I do tell him where I'm calling from. He tells me to hang on the line for a few mins. Uhh ok? So he leaves ME on hold for 3 mins. Half way through, some hold music starts playing ..?? I have no idea how as I called his mobile. What is the purpose of this?\n\nI'm about to squeal, he finally gets back on the line and then tells me to wait a little longer.. sigh. \n\nI tell him that I will not be allowed to wait any longer. He then proceeds to tell me \"well can you call me back then?\" Why? So you can keep me hostage on the phone? I tell him no and I will text the number and he can call us back. To which he reluctantly agrees. \n\nGood luck to him cause the wait time can be 30 mins. \n\nA few hours later, I just get a message from another banker who advises me that a certain some one should be contacted again. \n\nIgnored that message!",
        "created_utc": 1487759720,
        "upvote_ratio": ""
    },
    {
        "title": "Defensive lady who should not have a smart phone.",
        "author": "koalaplum",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5vcm7f/defensive_lady_who_should_not_have_a_smart_phone/",
        "text": "Ill call her DL for short.\n\nAfter I verify her identity, she tells me she has an iPhone and this is our conversation:\n\nDL: Hi I needed help finishing setup online for your safe driving discount when I was pretty sure I already completed it but I keep getting emails that it is incomplete.\n\nMe: Okay definitely, sorry to hear that but I can assist you with that today. Also, I just want to make sure but do you have the \"safe driving discount\" app downloaded because our company has 2 different apps. Do you know your login information too?\n\nShe does a complete change in her voice to where she's right on the verge of yelling at me the rest of our conversation.\n\nDL: I just told you I need help with the app?!\n\nMe: I understand that but I just wanted to make sure you had the right app downloaded and knew your login so I know what step you need help with.\n\nDL: Yes I need help with the app! I don't know what I'm doing, this is my first time setting up the app.\n\nI assume she doesn't know her login from here so I ask her to click the \"forgot username\" link underneath the login area and then \"forgot password\". \n\nShe flips again.\n\nDL: Where are these links? I don't see anything?\n\nMe: When you first open the app it has 2 login boxes and under those boxes are \"forgot username and pw\".\n\nDL: Im not seeing that?\n\nMe: What do you see?\n\nDL: The email that I keep receiving from you guys about my safe driving discount not being setup.\n\nMe: Can you go to your home screen on your phone please and let me know when youre there?\n\nDL: Okay, there.\n\nMe: Now can you go to your app store and let me know when you're there?\n\nDL: What is that? I told you I need help I don't know what I am doing.\n\nMe: ..Um.. It would be a small blue icon with the letter A and will say app store right underneath it.\n\nDL: Can you find that for me? I dont know how to do this. \n\nMe: I apologize I can only tell you how to find this app, I cannot physically find it for you.\n\nDL: Can I even access the app store while Im on the phone with you?!?\n\nMe: I dont know you may be able to, if not you can call us from a different phone so we can assist you on your cell phone.\n\nDL: But this is my only phone?? \n\nMe: Okay well your agent can help you in person if youre still having trouble finding the app store and then they would be able to help you download the app.\n\n\nShe goes on long rant on how her agent cant help because she works during their business hours.\n\n\nDL: Oh I just got to the app store! What is the app called?\n\nMe: Safe driving discount\n\nDL: I already have the company name app downloaded to my phone?!? I told you I set it up.\n\nMe: No that is our other app, you need to type in and download the \"Safe driving discount app.\n\nDL: But I cant find that app?\n\nI go over the same steps again and eventually she downloads the right app. I also go over the forgot username and pw link steps and she gets her login.\n\n\nThank god at this point she said she thinks she can do the rest and if she has any problems shell call back. but fuck these are the times I contemplate leaving the call center life.",
        "created_utc": 1487696465,
        "upvote_ratio": ""
    },
    {
        "title": "YOURE CALLING ME BACK? WHY?",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5v91p3/youre_calling_me_back_why/",
        "text": "So like most modern call centers my company has a way to queue your hold time and give you a ring back so you don't have to wait. Well, for better or for worse customers call multiple times and request multiple callbacks...and our system will actually call you back as many times as you request a callback...\n\n\nSo when we get the call our CTI states that it's a callback and yet the customers usually go \"thanks for the callback I've already got it taken care of\" they're happy, it appears that we are concerned for them, I have a 20 second call averaged in to my metrics which is great puts a smile on both of our faces. Until:\n\nM-hi this is pain how can I assist?\n\nL- I don't know\n\nM-have we reached you already? Is there something else I can help you with?\n\nL-I don't know you already called once\n\nM-I apologize we are returning your call request is there nothing else that you would like to do with me today?\n\nL-I DONT KNOW YOURE CALLING ME BACK\n\nM-I understand, well give us a call back if you do need assistance we are 24 hours!\n\nL- *sigh* ((hangs up))",
        "created_utc": 1487644724,
        "upvote_ratio": ""
    },
    {
        "title": "Interested in moderating TFCC?",
        "author": "TheDroolinFool",
        "url": "https://www.reddit.com/r/callcentres/comments/5v8uhg/moderator_wanted_apply_within/",
        "text": "",
        "created_utc": 1487642444,
        "upvote_ratio": ""
    },
    {
        "title": "Double paid. Double trouble.",
        "author": "lucky2u",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5v68i5/double_paid_double_trouble/",
        "text": "So throwing this one out while it's still fresh.\n\nI alternate between emails and inbound calls at my center. I took an email that required me to outbound call the customer. Customer started an account with us in last year. At the same time he signed up for automatic payments. He apparently forgot because we were getting checks from him mailed in each month. That's fine because our system recognizes this and stops the auto draft when this happens before the due date. This happened every month. This month however the check was late. So auto draft activates and he gets his bill deducted and we of course cash his check when it comes in. \n\nWhen I explain this to the customer he starts yelling that (1) he was never on auto draft, we need to cancel this, refund the double pay ASAP, etc and (2) we are going to compensate him for the 2 checks he bounced because the double pay over drafted him.\n\nI kindly inform him that we will cancel the auto draft and refund the excess payment (even expedited which we don't always do). However we will not be compensating him for anything else since there was no error on our part. Customer flips out and starts threatening legal action and accusing us of fraud etc. He demands my name and gets even madder when I won't give him my last name (because you know... I'm not an idiot). Customer is just ranting so I give him the \"any other questions ?\" Response and hang up as soon as he says no.\n\nTLDR; not our fault, not our problem.",
        "created_utc": 1487615378,
        "upvote_ratio": ""
    },
    {
        "title": "\"I know that you can't tell me if I have full coverage, but do I have full coverage?\"",
        "author": "Bibo193896423",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5v3duh/i_know_that_you_cant_tell_me_if_i_have_full/",
        "text": "Bibo back with another story from an auto insurance call center.\n\nOne of the big things that gets stressed in training in becoming an insurance sales rep is to avoid using the term \"full coverage.\" It's a term that gets tossed around a lot when it comes to buying a car, and we are not supposed to use it directly when building an insurance policy with a customer because it can be misleading when people because people can end up thinking they have more coverage than they really do. Ask yourself, does full coverage mean you will get a free rental car if your car is damaged? I certainly don't know, and neither does anyone else for sure.\n\nOne really annoying part of this is that when you buy a car, often the dealer and financing company will actually tell you, \"You are required to have full coverage for this loan\" which makes our job an absolute nightmare sometimes because people want a direct answer from us if their coverage meets their financing company's minimum criteria to drive the car they want to buy when we have absolutely no control over what they require e.g. the maximum deductibles.\n\nNow, what most financing companies mean when they say \"full coverage\" is that you need to have \"Collision\" coverage to pay for the damage to your car if you get into a wreck even if it is your fault, and \"Comprehensive\" coverage to pay for damage to your car from basically anything else like weather, theft, animals, etc..., in addition to state-mandated liability coverage which pays for damage you cause to others.\n\nSo cue Bane of My Existence, or BME. He is calling me from the dealership, which is a terrible experience half the time because usually people calling from the dealer: 1) Have been there for many hours and want to go home, 2) Are frustrated because they ended up spending a lot more than they planned to on the car they bought and, thus, *always* get mad when they need to pay for the insurance too, and 3) Are impatient as all hell and uncooperative as a result, not wanting to answer questions, etc... \n\nAfter I do start the process of adding his new car to his policy:\n\n&gt;Me: BME, now that I have taken down the vehicle information, I need to go over your coverages, allow me to explain what coverages we offer... *And so I explain in excruciating detail how comprehensive and collision coverages are what most financing companies require and the way ALL the auto insurance coverages work*\n\n\n\n\n\n&gt;Me:Okay BME, now that I have explained the liability, comprehensive, and collision coverages to you, I assume that since you are financing your car, your lienholder has some requirements about coverage and probably a limit on your deductibles is that right?\n\n\n\n\n\n&gt;BME: Yes, I also need to have full coverage. The financing company says I need that.\n\n\n\n\n\n&gt;Me: Right, remember, like I said earlier, full coverage does not have an exact meaning so I need to clarify what exactly they want you to have, what they usually mean is-\n\n\n\n\n\n&gt;BME: Right, full coverage they said.\n\n\n\n\n\n&gt;Me: *Kill me please.* Right, full coverage isn't really an actual coverage, it's a phrase people use to talk about a variety of coverages so I need to understand what they need you to have.\n\n\n\n\n\n&gt;BME: Oh okay. *Chatters in the background to some guy at the dealership.* Yes, they said I need to have full coverage please.\n\n\n\n\n\n&gt;Me: Sir, as I have said a few times, I do not know what they mean when you say full coverage, does that mean they need you to have medical payments coverage? Do they need you to have uninsured motorist coverage? Or do they just mean you need to have comprehensive and collision?\n\n\n\n\n\n&gt;BME: Look, I don't know why this is taking so long, I just want to have the lowest full coverage you have so I can take the car off the lot...\n\n\n\n\n\n&gt;Me: (*What the hell does that even mean? Lowest full coverage???*) Look sir, for legal reasons I am unable to tell you if your policy has 'full coverage' or not, it does not have an exact definition, it means different things to different people. I do not know if this is enough to satisfy your lienholder, only they know what they require. Please, you are there with them, ask someone if they mean comprehensive and collision when they say 'full coverage.'\n\n\n\n\n\n&gt;BME: **Loud-ass sigh.** Fine, hold on.... *More chatter.* Yes they said that's fine, as long as it's full coverage.\n\n\n\n\n\nAt this point I wanted to bang my head into a wall I was so done with this call.\n\n\n\n\n\n&gt;Me: Sir, as I have explained to you multiple times tonight. I. CANNOT. TELL YOU. If this is full coverage. If you are happy with this coverage, I will get this change submitted so I can send you your proof of insurance.\n\n\n\n\n\n&gt;BME: Okay finally, just send me the documents that is what I was waiting for.\n\n\n\n\n\n&gt;Me: *YES THANK GOD* Okay sir I have submitted the change and sent the documents to your dealer.\n\n\n\n\n\n&gt;BME: Okay thank you, took you long enough. Now, to be clear this is full coverage right?",
        "created_utc": 1487577401,
        "upvote_ratio": ""
    },
    {
        "title": "IVE BEEN ON YOUR WEBSITE FOR HOURS!!!!",
        "author": "ExteriorPain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5v17w8/ive_been_on_your_website_for_hours/",
        "text": "Just to avoid a 25 dollar service fee you're willing to spend 4 hours which imo is well over the equivalent of struggling for half a day just to avoid said fee. \n\n\nMy favorite passive aggressive line is \"*please don't struggle on the site for hours on end, that's what we are here for*!\"\n\nThen they transfer the frustration to you for not being able \"understand the website\"...but by the end of the call you realize they just didn't remember their password...or the email associated with recovering said password...",
        "created_utc": 1487547553,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're lying to me\"",
        "author": "ColdHeartedSleuth",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5ux76i/youre_lying_to_me/",
        "text": "Hey all :) \n\nSo I work in banking, for personal loans. I pick up an application and call this dude because we were requiring documents to verify his income. \n\nFirst he picks up the phone so happily thinking he is about to get his $$$. HE then tells me to call him back cause he is busy. \n\nUGH SIGH. Normally we don't do call backs, but I was nice and newer to the job so I did it. Not sure why they want our day to be rearranged around when they can talk on the phone but whatever.\n\nCall this crazy dude and this is how it goes. \nCM - crazy man M - me\n\n&gt;**M** - Hi sir. My name is _____. And I am just calling in regards to your lending application. I can see that we are still just trying to verify your self employed income and we are requiring your tax return. When are you able to send this through to us so we can proceed with your application?\n\n&gt;**CM** - well I shouldn't have to give you any documents, you should trust me enough as i have been a customer for x amount of years. \n\n&gt;**M** - I understand sir. Unfortunately as per our policy we  do require this documentation to go ahead with this application. I definitely believe you are making *this* much per year. However we do need the tax return. \n\n*i do not get why they harass the front-line employee who has no control over this and is just doing what they have to do so they don't get fired.*\n\n&gt;**CM** - well all my business accounts are there and this bank can see all my banking. \n\n&gt;**M**- sir as I said we cant verify like this because it isnt accurate, we need to see this by an accountant. \n\nSir flips out and was just ranting and wouldnt  let me get one word in. He wouldnt stop his rant so i can even say something. At some point I proceed to talk a little louder to talk on top of him so I can get a word in and wrap up the conversation. but he proceeds to talk substantially louder so I cant even speak at all. \n\nNow, when this took place, there were recent legislative changes by the government in regards to banking and lending. All applications **need** to go through verification. In the past, if a customer was a long time account holder, or if their credit report was good, we wouldn't need to verify. But this changed sometime before I had this interaction. Of course this is all they told us, and from then on we needed to ask customers for documents. \n\n&gt;**M** - I understand sir, however new legislation requires us to verify your income. \n\n&gt;**CM** - I don't believe you, you're lying. Show me the part of the law where it says this. \n\n&gt;**M** - I can assure you I am not lying about this. It is also our policy. \n\n&gt;**CM**- I want to speak to the manager because they can make decisions you cant. \n\nAt this point I completely stopped trying to get him to cooperate and trying to diffuse.\nI look around for the manager, but surprise, surprise they are not there and they haven't left another manager in charge. Typical mismanagement. \n\n&gt;**M** - Sir there is no manager here right now, but I can let them know to give you a call back when they are back. However, they will just tell you the exact same thing I have told you. \n\n&gt;**CM** - well then i am just going to call back and complain. \n\n&gt;**M** - ok sir, that's your right. \n\nWe both say bye and then I proceed to take 10 mins away from my desk. \n\nEnded up forwarding the situation to another manager, who didn't call him back LOL. I had this as a small victory because we werent accommodating to his tantrums.  \n\n**TL;DR** crazy customer wants a loan and doesn't want to provide any documents. Is rude and condescending. Manager snubs calling him back also. Crazy man left empty handed.",
        "created_utc": 1487488679,
        "upvote_ratio": ""
    },
    {
        "title": "\"People hangover?\"",
        "author": "DarkLord84",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5uwa7e/people_hangover/",
        "text": "[removed]",
        "created_utc": 1487473277,
        "upvote_ratio": ""
    },
    {
        "title": "My brother made a _short film_ about what working at a call center does to you and how it makes you feel",
        "author": "thetrublemaker",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5utpn6/my_brother_made_a_short_film_about_what_working/",
        "text": "[removed]",
        "created_utc": 1487441329,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not going to tell you we are a collections company, just google the damn name it's not hard.",
        "author": "ParkerKis",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/5uqk4h/im_not_going_to_tell_you_we_are_a_collections/",
        "text": "[removed]",
        "created_utc": 1487388505,
        "upvote_ratio": ""
    }
]