[
    {
        "title": "Worst brain fart ever!",
        "author": "LaLunaLady1960",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z97sil/worst_brain_fart_ever/",
        "text": "This is from several years ago. I (obviously) had been working too many days for too many hours.\n\nSo, I go into the break room to call my husband on a Sunday at lunchtime.\n\nHusband: Hello!\n\nMe: Thank you for calling \\_\\_\\_\\_\\_\\_.  May we start with your account number so I can assist you?\n\n\\*dead silence\\*\n\nHusband: Um, \\_\\_\\_\\_\\_.  Are you OK? Do you need me to come and pick you up? \n\nI would occasionally do this from home on my day off as well. Anyone else have a brain fart and do this?",
        "created_utc": 1669852631,
        "upvote_ratio": 1.0
    },
    {
        "title": "This ain’t Lake Wobegon!",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z96jq6/this_aint_lake_wobegon/",
        "text": "Someone in management allegedly with a college degree decided it would be a good idea to institute a quality improvement program.  Using current metrics, any agent whose scores for the month were below average was let go.  Never mind if they were meeting past expectations.  The new expectation was “better than average.”\n\nThis did not take into consideration the fact that for approximately every agent above average, there would be one below average.  That’s how averages work.  They assumed that it was a very small percentage of agents that were dragging down the metrics.  They could not understand why they had to replace about 50% of the agents each month.\n\nI think they wanted workers from Garrison Keillor’s fictional hometown of Lake Wobegon, Minnesota, “where all the women are strong, all the men are good-looking, and all the children are above average.”\n\nSo with all those bad apples gone, the metric average should improve, right?  Throw in 50% of your work force as hastily trained replacement agents and see what happens.  Metric levels plummeted.  Most of the new hires were gone at the end of their first month (some survived because of the new lower metrics), and they had to scrape the bottom of the local labor barrel to replace them, further escalating the process.  I think it took them three months before they gave up.  Meanwhile, we lost a lot of agents who were good, just not better than average.",
        "created_utc": 1669849659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feels everytime they talk to their coworkers, they always shake their head in disappointment?",
        "author": "iminlovewithyoucamp",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z96e0w/anyone_else_feels_everytime_they_talk_to_their/",
        "text": " Meh... I did this to myself. I don't even blame them. I am a pothead in the most basic way possible. i'm addicted to weed to a point where all i talk about, consume and do relates to weed, I am a Black- Incel and I think my co workers know this because my views on women are terrible and it leaks out from my mouth ever so often and I'm ALWAYS angry. The best thing about my job is we get calls every 10-20 minutes and my coworkers are really close to each other. I just stop participating in the conversations after I blew up at an Admin due too he is the \"Mean Guy\" in the call center. The admin is known for talking mess about everyone in the call center and I just told him, \"You are not a good person due too you talk about everybody in the call center in a negative way\" That went as horrible as one could expect. I didn't get in trouble with management but, it ended up being social suicide for myself.... which is why I reddit all day at work. I miss talking to my co workers.  \n\nI don't hate them, hell, I care about each and every one of them. Theirs's only 7 of us and eh... I feel a bit of cold energy from 3 of 7 of my co workers while all other co workers get along with each other quite well.  I do care about \"fitting in\" with my co workers but luckily, Reddit and Youtube are not blocked from the company website so here I go too reddit day and night. So what do y'all do in this predicament?",
        "created_utc": 1669849297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might get fired because of surveys",
        "author": "Positive-Hedgehog-36",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z91b6k/might_get_fired_because_of_surveys/",
        "text": "I’ve been put on a corrective action plan due to not meeting company survey goal for 3 months in a row. In order for the corrective action to be removed I have to meet goal for 3 consecutive months. This is the only metric that I have been missing. It’s frustrating because I’ve gotten poor surveys for things beyond my control that another department should’ve handled. But that’s how call centers work I guess. It’s frustrating since I only miss by 1-2%. Company goal is 96.25%. If I get a score of 0 this means that I need 25 100% in order to be redeemed. I met goal last month but I won’t meet this month because I got a 50% from an offshore agent who more than likely did not like the solution to their problem. This elevates my corrective action plan.\n\nCrazy part is that my supervisor does try to overturn my bad surveys. However there’s nothing that can be done if the customer doesn’t answer. I work in provider services but most of callers are from an overseas call center that call on behalf on the provider. So they’re hard to contact.\n\nI’ve never been fired before and never had a corrective action plan. My supervisor doesn’t even have feedback all she says is the call was good and to offer more surveys. Which I do offer more surveys but this opens the door for more providers to rate me based on something that has nothing to do with me. I also be sure to let them know that the survey is based on my service. It’s upsetting, disappointing and irritating. I’m also hopeless since there’s so much uncertainty. But I’m going to be good. I’ll quit before I get let go",
        "created_utc": 1669838009,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Can you log into aux for me, there's a call I want you to listen to.\"",
        "author": "SilasMarner77",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z90fcj/can_you_log_into_aux_for_me_theres_a_call_i_want/",
        "text": "Haven't we all heard those words and felt the same profound dread prehistoric man must have felt when he heard wolves outside the village wall. \n\nThe team leader pulls me aside and asks me to listen to the call then tell them what I think. As if what I think makes a difference any other time. \n\nI always despise this exercise. There's something vaguely inquisitorial about listening to the excruciating sound of my own voice for ten minutes (knowing I've done something wrong) while the team leader sits there gazing at their little screen waiting for the big reveal.\n\nIf I've done something wrong I'd rather my overseers just told me outright rather than subject me to this tedious ordeal.",
        "created_utc": 1669836023,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Can you log into aux for me, there's a call I want you to listen to.\"",
        "author": "SilasMarner77",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z8yzcm/can_you_log_into_aux_for_me_theres_a_call_i_want/",
        "text": "[removed]",
        "created_utc": 1669832954,
        "upvote_ratio": 1.0
    },
    {
        "title": "The $65,000 shoes",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z8ccuu/the_65000_shoes/",
        "text": "A little change of pace today, as I was busy for quite a while answering a number of posts from yesterday’s thread.\n\nFor anyone new to my posts, I worked in a call center for a major athletic shoe outlet.  We handled catalog and internet sales.\n\nMany years ago, there lived an NBA player named Allan Iverson.  His signature shoe was the Reebok Answer.  Actually, his first shoe was the Reebok Question, so named because he declared his eligibility for the NBA draft before he finished college, and there was some question if he’d make it in the NBA.  He did, and so the followup shoe was the Answer.\n\nOne fine day, our company, Reebok, and Mr. Iverson all got together and came up with a really neato idea.  We would sell a special edition of the Answer!  It would not be just any shoe, oh no.  This one would be blinged out with two hundred and forty-six diamonds, total carat weight 25 and a half ounces, fastened down with white gold to the shoelaces.  The finest leather would be used for the upper, with logo detailing in silver.  The aglets (the normally plastic tips on the end of the laces) would be made of platinum.  It would come in its own special stainless steel suitcase with combination lock.  Best of all, it would be a real collector’s item, as only one pair would ever be made.  First come, first (and only) served.  The first customer to send us the money via wire transfer would get them.  They would then specify what size they wanted them in, and the pair would be custom-made.  Sorry, no discounts, no returns, no exchanges.  The price? A measly $65,000.\n\nThey came out in the catalog, and the phones went nuts.  “I wanna get that $65,000 shoe!  How much does it cost?”\n\n“$65,000.”\n\n“No, I know that’s what they’re calling it.  I wanna know how much it costs!”\n\n“65,000 actual dollars, sir.  No, I’m not kidding.  That’s the actual price.”\n\n“That’s crazy.  Who would pay that much for a pair of shoes??”\n\nGood question (no pun intended).  I figured some rapper would end up buying them and wear them to the Grammy’s or VMA’s.  But they didn’t.\n\nFor a month, we had to deal with this.  No, you can’t pay for them cash on delivery.  No, you can’t mail us a personal check.  No, no credit card, it has to be a wire transfer to directly to our bank.  Once we have the funds secured, we’ll start work on them.  If you’re actually serious about purchasing them, I’ll take down your information and our chief financial officer will be in contact with you to help arrange the funds to be transferred.  Don’t worry, we won’t ship them UPS.  We’ll have a bonded courier deliver them.  Well, they never told us, but I would assume we wouldn’t charge you the $7.99 for standard shipping.  No, only one pair, no matter how generous you say you are, you can’t equip your local high school team with ten pair.\n\nAs time went on and they remained unsold, we did some calculating. We had around 246 people in the call center.  If each of us chipped in about 264 bucks apiece, we could buy the damn things ourselves.  The plan was to pry loose the diamonds so everyone could have their own souvenir, sell the gold, platinum and silver to a jeweler and split the revenue, and take what remained out to the middle of the parking lot and set fire to them, symbolically sending back to the Hell they came from.  The ashes would then be shoveled into the stainless steel case and thrown into the river.\n\nI think we got about twenty “serious” inquiries, but none of them panned out.  In the end, they remained unsold.  As a publicity stunt, I can’t tell you if it was successful or not.",
        "created_utc": 1669770326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strictest or Most Absurd Rule in Your Call Center",
        "author": "notsoaveragemind",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z8456a/strictest_or_most_absurd_rule_in_your_call_center/",
        "text": "While I don't work in a call center anymore and I know things have changed for those companies that have went remote, but gosh I remember a couple that just seemed absurd. No phones, pens, notebooks, etc.. on the call center floor, totally get that where customer information is concerned. I am talking about things like.\n\n\\-Talk time should not exceed 7 minutes, BUT you must follow each step, verbatim, which if doing so on each call, takes 10 minutes.\n\n\\-You are not permitted to leave the site for your lunch break (granted we only had 30 minutes, but that is unpaid time).\n\n\\-You did everything correct on the call , but neglecting to utter a minute phrase before ending the call caused an automatic fail for QA.\n\nWhat are your crazy rules?",
        "created_utc": 1669751640,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Why did you add $80 to my bill?”",
        "author": "gameofthrones_addict",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z82p5z/why_did_you_add_80_to_my_bill/",
        "text": "Sometimes I just can’t help but wonder people’s mindsets come to be what they are.    \n\nI work for an electric utility company. Yesterday I received a call from a customer who was utterly confused, and yet spelled out exactly what was going on in the same time.    She said she went over her bill from last month, October, and it’s said we essentially charged her $150.     Then she said she received a new bill just today stating the new amount she is charged is $230 and she read off to me where it stated the overall account balance is $380.    \n\n  She wanted to know why we added an extra $80 to her bill.   I asked her if she sent in a payment to cover the $150 since she received the previous bill in October in which she admitted she hadn’t.    A bit confused on my end then I decided to play coy and asked her between those two bills where it stated we added an additional $80 to her account.   \n\n  She went off to say that was the difference between the $230 new bill and the $150 balance from the bill from October.    I had to explain to her that we just recently read her electric meter and the $230 is her new bill that’s not owed officially until December.   the overall account balance she read off to me of $380 is the $150 plus the new bill of the $230.  The $230 is a new bill entirely.    \n\nShe then became further upset asking why that was so much.  I went in to describe the process that we base the bills off of how much kilowatt hours were used since the last time we read the meter and now.  This month’s usage was much greater than the previous reading.   She interrupted me asking when we started doing that because surely that wasn’t how we have been doing it.   \n\nTold her that is how we always judge the bills for, by how much power was used.    She then gave up and hung up on me abruptly without asking for any form of Payment arrangements.  I suspect that she figured I didn’t know what I was talking about and was going to call back to get someone else.   \n\nMade a note and went on.  I just wonder how people’s thought process can be so different sometimes.",
        "created_utc": 1669748397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customers who call who can’t hear anything and wont wear hearing aids.",
        "author": "Glittering_Tooth_368",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z80rgr/customers_who_call_who_cant_hear_anything_and/",
        "text": "[removed]",
        "created_utc": 1669744089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forcing me to come to work despite constant fainting",
        "author": "StunningPuffin",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z80h0m/forcing_me_to_come_to_work_despite_constant/",
        "text": "Recently I’ve been fainting a lot at random places and no one knows why. I’ve been to the ER about it a few times and they just take my vitals and tell me I’m good to go and never follow up on the results of tests I do. Recently I fainted on the bus on the way to work. My doctor recommended I work from home as I cracked my head open pretty good.\n\nOn the same day my supervisor said he could accept a ONE TIME exception to work from home, he went to work from home because his child was sick, who is sick every week. When I brought up that I needed the time to work from home due to my illness, he said I was hired with the expectation to work from the office. Why does this not apply to him? He knew what the rules are before he had a kid.\n\nSo I was thinking... what are the rules in Canada for injuries at work? What if I fainted there and got seriously hurt? Would I get any type of workers comp for avoidable, non job related injuries that happen while at work?",
        "created_utc": 1669743439,
        "upvote_ratio": 1.0
    },
    {
        "title": "You keep using that word. I do not think it means what you think it means.",
        "author": "ig0tst0ries",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z7s1wm/you_keep_using_that_word_i_do_not_think_it_means/",
        "text": "I work in a call centre. It's a small-ish, family owned business, so we managers wear many hats.\n\nSomething to know is that in the UK for businesses, all electricity suppliers are done under contract, and there are a lot of suppliers (over thirty) you can chose to go with. In order to stay competitive, suppliers update their prices every week or two, all with a different schedule. More right now due to the energy crisis. As a result, and price is that day's price.\n\nOne day, I had to take an escalated complaint call (the buck stops here), that our agent had used high pressure sales tactics to try and sign a customer. \n\nI immediately see that something is off as we don't do that.\n\nIt took quite some conversation with the customer, but we where getting nowhere as she couldn't figure out how to explain her problem.\n\nI made it easier for her and explained what our staff are supposed to do and how everything works.\n\nWhen I get to the point about any price being that day's price, she lost it, saying that that's how we pressured her.\n\nIt transpired that the customer was of the opinion that providing that information was pressuring her. That she should receive a couple of weeks to think on those prices and make a decision. She would only sign with a company that gave her that. \n\nAnd when I told her that no UK business supplier was offering prices that way, I was apparently pressuring her again.\n\nI pointed out that according to the way that things actually work, informing her honestly of the situation so she could make an informed decision could not be considered pressuring her, and is she had a problem, she needed to take it up with the dictionary people.\n\nShe hung up on me at that point, but I had reasoned that if that didn't get the reality of the situation through her head, we'd not win her as a customer anyway.",
        "created_utc": 1669723105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s your discount",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z7f0jr/heres_your_discount/",
        "text": "I worked for an athletic shoe store chain with a large catalog and internet presence.  I was taking phone orders and got a call from a kid of about 12 who had a catalog.  It wasn’t uncommon to take calls from youngsters— they’re the ones who know what they want or need, and a lot of parents want to teach them the responsibility of shopping.\n\n“Hi, I need to order three pairs of shoes.  What kind of discount will you give me?”\n\n“Well, we don’t have a discount for just three pairs.”  We did have team sales discounts, but the order had to be for at least six pair, all the same product number.  “Do you have a promo code from a catalog or our website that might apply?”  We were not allowed to just search for a promo code for a customer— they had to earn it by actually receiving a catalog or checking our website, and maybe while they were at it, they’d see something else they’d like to order.\n\n“No, we don’t have internet [this was a couple of decades ago], and this catalog doesn’t have any specials, but the last guy I talked to said that if the shoes I wanted weren’t in stock, I’d get a 10% discount, so I’d like to use that.”\n\n“Yes, we do offer that for most items.  So if you called earlier tonight, the last agent would have left a note that you had a discount coming…”\n\n“This was a year ago.  I didn’t have anything else I wanted to order then, so I never used it.”\n\n“Sorry, but that offer is meant to encourage you to still buy your second choice at that time, not a year later.”\n\n“So what kind of discount am I gonna get?”\n\n“Here’s how this works.  You give me the product numbers of the three shoes you’re looking for.  You’ll get 10% off your second choices for each of the shoes that aren’t in stock.”\n\nHe gives me the first shoe.  “That one’s in stock, $59.99.”\n\n“How much of a discount?”\n\n“No discount, it’s in stock.  Next\n shoe?”  He reads off the number.\n\n“That’s in stock as well, $49.99.”\n\n“I should get a discount on that one, right?  It’s my second choice.”\n\n“No, that’s your first choice for the second pair.  What’s the next shoe?”\n\nHe reads it off.  “That’s in stock as well, $69.99.”\n\n“So what’s my discount?”\n\n“Sorry, no discount applies.  All three were in stock.  Did you need anything else?”\n\n“Yeah, I wanna get some of these pairs of Jordan shoelaces.”\n\nHe gives me the product number for the first color.  “I’m sorry, that one’s out of stock.”\n\n“So I’m gonna get a discount on the shoes, then, right?”\n\nI sighed.  “I can give you a 10% discount on your next choice for a pair of *shoelaces*!”\n\n“Aw, all right, here’s the next number.”\n\n“That one’s in stock!  It sells for 99 cents. With the discount, it comes to 89 cents.”\n\nHe proceeds to order eight more colors at 99 cents a whack.  I give him the total with shipping and handling.  There’s a muffled conversation and Mom comes on the line.\n\n“How come the order’s so much?  Don’t we get a discount??”\n\nI explain the second-choice discount policy.  “Soo, what you’re saying we should do is call in to check your inventory until we find three pairs of shoes that are out of stock, then call back in, say we want those, and then we can get a discount on the ones we really want?”\n\nSteam was about to come out of my ears.  “Well, not anymore, you can’t.  I’m flagging your account that you’re considering this… strategy… and now, I’m the future, we’ll have to assume that this is what you’ve done in an effort to get a discount that you’re not entitled to!  Now, the total for this order, with the discount for the one pair of shoelaces, comes to $XXX.XX.”\n\nShe grumbled but gave me a credit card.  After the call, I congratulated myself on not mentioning that the shipping charge was $7.99 for the first item, $1.99 for each additional item.  They paid $17.91 S/H for nine pairs of shoelaces. We were empowered to waive the shipping for something that small, but I would be dammed if I would do that for them.\n\nBut they got their $0.10 discount.",
        "created_utc": 1669684495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I getting micromanage?",
        "author": "mfli123",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z7cz8w/am_i_getting_micromanage/",
        "text": "[removed]",
        "created_utc": 1669679410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you take me for a fool?",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z6o5t6/do_you_take_me_for_a_fool/",
        "text": "Sometimes, people just assume we’re not going to help them, and they call in ready to do battle.  I worked for a company that primarily sold athletic footwear, but we also carried some clothing.\n\n“Thank you for calling Customer Service!  This is Duff, how can I help you!”\n\nThe first words out of the customer’s mouth…\n\n“Do you take me for a fool?!?”\n\n“Um, I presume you’re calling about some problem.  What’s the issue, and I’ll see what I can do to help.”\n\n“Well.”  Long pause.  “This shirt!”\n\n“Ah, there’s a problem with a shirt you received?\n\n“This ain’t the shirt I ordered!”\n\nOkay, we’re getting somewhere.  I got his info and pulled up his order.  He had ordered a shirt from Sean “Puff Daddy” Combs’ fashion line, Sean John, that sold for $59.99.  Instead, he got a $9.99 t-shirt.\n\n“I apologize, sir.  Our shipping department is pretty good, but we ship thousands of orders a day, and some mistakes are bound to happen.  It looks like a warehouse error.”\n\n“So I’m supposed to just take this shirt instead?? That’s bullcrap!”\n\n“No, sir, we certainly don’t expect you to accept the wrong shirt.  Let me just check to make sure the correct shirt is still in stock so we can get it shipped to you…”\n\n“Why should I have to pay for another shirt?  What are you trying to pull here?”\n\n“No, no, I never said you’d need to pay for the replacement shirt.  We’ll be happy to send it free of charge.”\n\n“That don’t help me none!  It took this a week to arrive, and I ordered it for a wedding we’re going to this Saturday!  It’ll never get here on time!”\n\nThis was Wednesday afternoon, after the rush cutoff, but we could send it Next Day Air.  It would ship Thursday, and he’d have it on Friday.  Ignoring why he thought it would be stylish to wear a P Diddy shirt as formal wedding attire, I explained how we’d get the correct shirt to him by Friday.\n\n“Why should I have to pay for rush delivery??  Why should I have to pay for shipping at all??? This was your fault!  You’re just trying to screw me!!!”\n\n“No, sir, the shipping and rush delivery are free.  We would just ask that you use the return shipping label to return the incorrect shirt.”\n\n“WHY SHOULD I HAVE TO PAY TO RETURN THIS SHIRT???”\n\n“There’s no cost to return it.  We normally would deduct a fee from your credit for using a return label, but that doesn’t apply if we’re correcting our mistake.”  Besides, there’s no credit due to deduct the fee from.\n\nAnother long pause.  “I don’t understand any of this.  Talk to my wife.”  She comes on the line.\n\n“Listen, why should we have to pay for a new shirt, or shipping, or anything?  This is a poor way to run a business.”  She went on to explain— again— how they ordered this nice shirt, and got this lousy t-shirt, and how dare we, and so on, until I could get a word in edgewise.\n\n“Ma’am, I’m sorry we sent the wrong shirt.  I promise you it was just an honest mistake.  We’re going to get the correct shirt to you, by Friday.  With the standard shipping you paid for, there was no guarantee the order would have delivered by Friday in the first place, but to try to make up for the error and inconvenience, we’re offering to ship it with a service that we’d normally charge $24.99 for, but at no cost to you, of course.  All we ask is that you return the incorrect shirt, again at no cost to you.  Now, what more can we possibly do?”\n\n“Oh, well, that would be lovely!  Thank you very much!”\n\nAll’s well that ends well, but why do some people assume the worst?",
        "created_utc": 1669614130,
        "upvote_ratio": 1.0
    },
    {
        "title": "The time I was accused of racially profiling a customer because she didn't remember which service her complaint was regarding",
        "author": "solace-in-misery",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z6fqhe/the_time_i_was_accused_of_racially_profiling_a/",
        "text": "It's been a while since I share a story about my time working for a call centre (good news, I've now left that job and am working at a new job which I'm actually liking). I figured this would be a doozy, so get comfortable.\n\nI used to work for an energy company that also offered telephony services (phone and internet), specifically in a department that dealt with people moving home, but would occasionally assist on the general queries line if needed. One day, I received a phone call from a woman who wanted to discuss a complaint that she had opened with another colleague the week before, as she wanted an update.\n\nI took her details as usual, however I didn't see a complaint on her telephony account at all. I double-checked the account number to make sure I heard it correctly, and she confirmed it was correct. She said that she spoke with a certain colleague who was going to look into something regarding a payment. I checked to see if she had any other accounts with us - lo and behold, she had her electricity with the company as well...and, to my amazement, there was an open complaint on her electricity account. I read the opening note out of curiosity, and it matched exactly what the woman was asking for.\n\nI assured the woman that there is no complaint on her telephony account, however I mentioned to her that I could see she had an open complaint regarding her electricity account and asked if she was calling about that. The woman then told me not to touch her electricity account because someone else was dealing with that and was going to call her back, and that she wanted to discuss the open complaint on her telephony account. I told her again that there was no open complaint on her telephony account, however if she could tell me when it was she initially called to raise it, I could check to see if we had the call on record. (I'd also just like to point out, that there was never a complaint on her telephony account up until this call.) Up until now, I was probably 10 minutes into the call already.\n\nThe woman became very angry with me, and outright told me that I was being racist. I was taken aback, because I was fairly certain I said nothing that would insinuate anything of the sort. She told me that I was racially profiling her and said that I could obviously tell from her voice that she was a black woman, the same way she assumed I was a young white man by my voice. I tried to reassure her that I was just trying to get to the bottom of her query, however she constantly shouted over me that I'm a racist and to stop denying it. She proceeded to tell me about how she is regularly racially profiled on a daily basis and that she's fed up with it. By this point, we were 30 minutes into the call.\n\nI tried to apologise for any misundersanding, and to assure her that I wasn't racially profiling her at all, however she would not listen. She then proceeded to tell me all about her encounters with racist people while shopping, and started telling me of one such incident where she went shopping in a department store and was being followed and confronted by members of staff. By this point, I gave up and just muted my mic, because trying to reason with her at that point was futile. She would occasionally pause her story to ask if I was still there - to which I would unmute myself and tell her I was, but she'd cut me off before I could salvage the call. This first story went on for no less than 1 (one) hour, and no one else in the call centre had realised how long I'd been on the same call for.\n\nWhile muted, I asked my colleague next to me to flag a manager, which they did...however, all they did was ask if I was ok, and just shrugged it off before I could explain the situation. Meanwhile, the woman (calling from her landline, I should add) started to go into another story where she was racially profiled in public, and occasionally paused to check that I was again still listening. Mid-way through the second story (coming up to around 1 hour and 40 minutes by now), the same manager came back to ask what I was doing, as they'd only just realised that I'd been on a call for nearly 2 hours. I told them the situation, which they finally listened to in its entirety, and told me to stop her from talking and take back control of the call, despite me telling them I tried that no less than 10 times.\n\nI even proved it with them by unmuting myself and tried to interrupt her story, but the woman berated me for trying to talk over her as she hadn't finished yet, and just continued. Now I'd started to get people looking over at me, as two other managers have walked over at this point to find out what I was doing. While the three of them were becoming more flustered than I was at that point, some of my other colleagues in my immediate vicinity were starting to laugh quietly while they continued taking other calls. The managers then walked away, and I realized that the call had exceeded the 2 (two) hour mark.\n\nFinally, the woman stopped talking long enough for me to get a sentence in. I spoke in a calm manner and reiterated the complaint that she quoted to me at the very beginning of the call, and asked her if I had recounted it correctly. She said I did. I then explained to her that the complaint she described matched the complaint on her electricity account, and that I had just wanted to establish which account she intended to call about, whether she wanted to discuss her electricity complaint (to which I would need to transfer the call), or whether there was a separate complaint regarding her telephony services that may not have been properly logged.\n\nAt last, the woman understood what I was saying...and did not offer any sort of apology for screaming down the phone at me for those last two hours; instead she told me that she had to tell me her story because of how angry she gets when people make unfair assumptions about her. She then confirms that it WAS her electricity complaint she was calling about, and she asked me to pass her call through. I instead gave her the number for the department so that she wouldn't incur any further call charges, logged the entire mess as a resolved complaint on her telephony account, and literally threw my headset across the table in frustration when the call finally ended after around 2 hours and 15 minutes.\n\nLike, I get it - I'll never truly understand what it's like to be subject to the sort of racial discrimination that she described, but I can certainly appreciate how upsetting it must be to those who have had to endure it (I've even witnessed one of my best friends be subjected to it). I don't know whether it was something I said that triggered her, or if something happened to her earlier in the day, but I would like to assume that asking for clarification on something isn't considered a hate crime. Also, management really weren't any help, and I dread to think how long it would've taken them to notice me if I hadn't asked my colleague to flag one of them down first.\n\nTL;DR - Woman calls telephony department asking about an update regarding a complaint with her electricity account, accuses me of being racist when I try to explain her confusion, proceeds to keep me on the phone for over 2 hours.",
        "created_utc": 1669590485,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first ever job as a call center agent",
        "author": "an_earthling_v",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z6821d/my_first_ever_job_as_a_call_center_agent/",
        "text": "[removed]",
        "created_utc": 1669572478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cancel and refund my order (that has already shipped)",
        "author": "nerdanele",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z66ezf/cancel_and_refund_my_order_that_has_already/",
        "text": "This gets me every time. \nDo customers assume that we teleport their orders to them? \n\nLike if it's not at their house it's still at our warehouse and we can cancel the order right up to the minute? Or if it's not there it's because we still have and can control when they will receive it? \n\nThere is no speciao super secret merchant phone line to ups where I can call up and tell them to \"act right\" and deliver your order today all of a sudden. \n\nI do not understand this thinking at all.",
        "created_utc": 1669568684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having trouble with a TPS report in real life",
        "author": "ig0tst0ries",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z65arp/having_trouble_with_a_tps_report_in_real_life/",
        "text": "I work in a call centre. It's a small-ish, family owned business, so we managers wear many hats.\n\nHere in the UK, there's a listing called the Telephone Preference Service. The idea is that direct marketing is opt-out, and you can't cold-call anyone who has registered on this list in the last year. Anyone can simply pop on the TPS web site and register their home number with the TPS or their business with the Corporate TPS.\n\nNow as no system is perfect, there are wiggle rooms, so we're allowed an occasional accident, mostly happening where a person has only just registered, there's a simple typo, or other human error, etc.\n\nIf we call such a number, the customer can complain to the TPS or CTPS over the phone or through a web site. We then have to investigate &amp; fill in a form, explaining ourselves to the TPS' satisfaction.\n\nOften, they've been called by a different company with a similar name, similar number, they're our customer already and thus exempt from the restriction, registered a business on the domestic list, etc.\n\nOn one occasion though, the customer had complained via the web form. Where the form asks for the customer's details, they'd put our details. Them where the form requires our details, they'd also put our details.\n\nThe logical upshot of this is that we had to investigate ourselves for calling ourselves, which would be an exempt call anyway as we have a prior relationship with ourselves. However, we also knew that maliciously complying in this case would not work, as there was no way to reflect this on the TPS form. \n\nI had to call the CTPS to ask how they wanted us to proceed. I confirmed that we had \\*not\\* called ourselves on that occasion, and such a call would be exempt anyway. The TPS agent thought that this was hilarious.\n\nOnce the laughter died down, they checked, but as the customer filled in the form, they had no clue who it was, and so closed off the complaint internally as the form had been miss-filled.\n\nSo I made am internal report, saved it, and washed my hands of the affair.\n\n&amp;#x200B;\n\n(Yes, I'm an Office Space fan, and I appreciate the inevitable jokes, but the TPS is a legitimate thing here.)",
        "created_utc": 1669566082,
        "upvote_ratio": 1.0
    },
    {
        "title": "We don’t ship orders unless they’re prepaid",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z5jp6b/we_dont_ship_orders_unless_theyre_prepaid/",
        "text": "I’m working Customer Service for a large athletic footwear retailer.  New agents only work Order Entry, but after you’ve been there a while, they trust you to take some action to solve problems without it escalating to management.\n\nI get a call from an OE agent.  “I don’t know what to do.  I’ve got a guy on my backline that’s insisting we ship his order and bill him for it.  Is there anything CS can do?”\n\n“No, but give me his account info and go ahead and transfer him.”\n\n“Hello, this is Duff from Customer Serv…”\n\n“All right, look, before you say anything, I have a perfect credit rating, 8A.”  (Never mind that personal credit ratings are a three digit number.)  “I have eight credit cards.  I’ve never paid a bill late in my life.  So I wish to order this particular pair of shoes, size 9.  You WILL ship them to me.  As SOON as I receive them, I will send you my PERSONAL check for the full amount.  Now, the product number is…”\n\n“I’m sorry to interrupt, sir, but I’m afraid we simply do not have a payment option available where we can ship orders without them being paid for in advance.  While I’m sure your credit rating is stellar, there are those customers who would be less than honest about that, and then we’d never receive payment nor hear from them again.  As such, we don’t even have the ability to check someone’s credit.  It’s a shame that people like that have to ruin it for good people like yourself.\n\n“But I am glad to hear you have eight credit cards, which we certainly accept!  Now, if you’ll just give me the card number from whatever card you’d like to use…”\n\n“Um, uh, well, you see, I really don’t like to use my credit cards.  Most people don’t realize that every time you use a credit card, they charge a $25 fee.  That’s how they make their money, y’see.  So if I can just give you that product number…”\n\n“I’m sorry, sir, but I’m just not able to do that.  I must say, I have a credit card, and as long as I pay my bill in full every month, I have no transaction fees, interest fees, or annual fees. You may want to look at some other card providers.”\n\n“Uh, yes, well, that’s very good advice, and I’ll be sure to look into that for the future.  But for now, if you could just send me these shoes…”\n\n“Sir, I’m sorry, but we just do not send orders out on credit.  Not even if you were Bill Gates or the Pope.  We’re just not set up to do it.  I can check inventory to see if the pair you want is in stock, and you can then mail us your PERSONAL check and order form.  We WILL process and ship your order, as SOON as we receive it.”\n\n“I, uh, really don’t want to have to wait all that time, I’d much rather you just ship the shoes now…”\n\n“Sorry, no can do.  Would you like to check inventory now?”\n\n“Well, I’m sure this will change your mind.  I have a perfect driving record.  I’ve never had a ticket or been in an accident.  I have a card from the state of Oklahoma that lets me go to the front of the line of any DMV of any state that I may be at.”\n\nI was done wasting time with this clown.  “Well, sir, we’re not selling auto insurance and we’re not the DMV, so I don’t see how that’s relevant.  But I have to say, I find what you’ve told me today to be incredible and unbelievable.”\n\n“Well, thank you, I…”\n\n“I find your story lacking in credibility and I don’t believe it.”\n\nHe finally gave up.  His home address was in Las Vegas.  All I could picture is some gambling addict that had blown his last dime and now was trying to con us out of a pair of shoes.",
        "created_utc": 1669501212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question to people who work as Customer Care regarding daily phone calls...",
        "author": "unregihea",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z5g36u/question_to_people_who_work_as_customer_care/",
        "text": "So, I guess I should be happy cause I accepted a job offer as Customer Care Specialist after searching for 3 months for a position with good salary and remote option.\n\nHere is the thing that makes me worried a little bit - on the job description, it states that the mainly communication are emails and \"small amount of phone calls\". Now, since I'm really shy on the phone, I've asked the recruiter what does \"small amount\" means on which they replied with \" usually around 10-20 per day\".\n\nNow, I guess compared to other positions with 100+ calls a day that's nothing but I'm kinda worried that the recruiter doesn't actually know much about the role and told me a random number.\n\nMy question is - ppl with similar position, how many calls per day you have on average? The company ( as far as I understood ) is helping customers with information regarding orders ( where is the order, if the order has broken parts what should they do etc.) but that seems more like a \"non stop on the phone\" position rather than emails and small amount of calls.",
        "created_utc": 1669491944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best part of the job",
        "author": "zero6ix",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z5ddjf/best_part_of_the_job/",
        "text": "I work for a bank. *A very predatory bank*. Attracts a lot of...we will call them special customers. Incredibly reckless, entitled, stupid, you know the drill. And their insane financial decisions lead to a lot of...lets just say interesting transactions. And the customer, well, they don't pay attention. They have admitted as much. You know, those people that outright state, \"Yeah, I was warned about this thing but I didnt pay attention, so this is still not my fault. Fix it.\" Okay. I can \"fix it\" for you. This charge that you do not like, this bank fee that was explained to you and you just blew it off? Yeah, I can help you by getting you in touch with **Disputes**. Oh? You waited twenty minutes to talk to me, and that was annoying? And you want this gone from your account? All twenty dollars? And that put your account down to negative six hundred dollars? I will send you to **Disputes**. \n\nAnd you will thank me. \n\n***For the two hour wait I just threw you into.***\n\nTo have the disputes team say, \"Yeah, naw, you did this to yourself. Goodbye.\"\n\nIts the little things in life that get you through. (side note: If you use cash app AT ALL, congrats! you're one of my customers. You did this to yourself.)",
        "created_utc": 1669484942,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was an experience where you went above and beyond to help a customer, and it was worth it?",
        "author": "pinkmor",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z5b5xh/what_was_an_experience_where_you_went_above_and/",
        "text": "[removed]",
        "created_utc": 1669479251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice is welcome!",
        "author": "Cherry_Starling",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z5533o/advice_is_welcome/",
        "text": "For about 6 months I have been working at a high stress call center area of Bread financial, which was once known as comenity bank. The company of course offers everything you can imagine, good pay, adoptions, health care, matching 401k, raffles, bonuses and everything in between.  Like a Willy wonka of call center’s… so of course there’s the dreaded point system, and Ada requests if you need more coverage like me who suffer\nFrom anxiety and depression but still obviously need to get by. I am working here and they have been asking we add hours on top of hours I’m talking 11-12 hour days here with no extra break or longer lunch. I have been not happy but following the rules here with that. I have added my extra hours this week and while they scheduled me on a day off for 4 hours as a surprise was ok with me I still did it today. It seems all of my calls are being graded and I do get 100% but the ones my supervisor decides to over look I get a 2/5 and her and I don’t see eye to eye which is fine. But she micromanages to the point where I have already asked with proof to HR to be moved off her team, and they HR lady of course said no, she loves and sides with supervisor so no. Even with her texting my personal cell off the clock when I called in one time yelling about “where are you what’s wrong? I need paperwork from your doctor ASAP or we will have to follow through with next steps” here is where I need advice please Reddit. I have an Ada out, it’s clear I’m also on lithium an RX I have made them aware more than few occasions that I may need to use “personal” a little over the 3-4min PER DAY (that’s the cap btw 3-4mins but 1% or less is needed and encouraged) I have been at my end here- I have told this company every single detail about myself it feels like I’m a child being punished for going to the restroom or grabbing water. Im trying to rush but it’s never good enough. Never. The callers are so bad- so bad. To the point now where I’m just waiting all late fees and blowing through it. I used to like this job I wanted to be trainer… now I feel sick so sick, I feel depressed, I have anxiety even higher than before, along with my supervisor constantly threatening me over every move I make; I now have told them my meds I’m on, the symptoms they cause, if they can medically understand and let a few things go due to that, now my health has gone above it all to where my kidney and liver are not handling the stress and sitting of the time so well. I’m not feeling good. I’m fighting to basically go “potty” and have anxiety attacks they keep calling “episodes” which I find insulting… my supervisor went on today to let me know that if I don’t clear my bodily function with lithium with hr that she and the other half of hr will have to “follow” through with the finally warning. (Meaning firing me ) now, I’m sick but I know I did not go through all of this just to be fired for taking a 💩 as a side effect. Can I just have some advice ?? In a positive way. I can’t handle right now anything else. Thank you.",
        "created_utc": 1669461126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only one that really likes call center work?",
        "author": "flyingthing123",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z4tlk3/am_i_the_only_one_that_really_likes_call_center/",
        "text": "[removed]",
        "created_utc": 1669424119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Address issues",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z4oy4h/address_issues/",
        "text": "I’m trying to post a story a day for as long as I can recall some good ones. For anyone who hasn’t seen my previous posts, these are from a call center for a large athletic footwear company.  They have stores, but also a catalog and internet division.  Unfortunately, a lot of the customer base tended to be urban youth, not always the best educated.  I have a few short stories about issues with determining a customer’s address, which often would be more difficult than one would think.\n\nFirst of all, in getting a new customer’s info, we’d often get a three digit number for their ZIP code.  “No, that’s your area code.”  Vice versa, a five digit number for the area code for the phone, though this was back when it was still pretty common not to have to use all ten digits to place a call, so people were a little less likely to know their area code.\n\nBecause young adults are not settled yet and move around a lot, they often could not remember what their current address was.  It was a common tactic to ask them if they had a piece of mail that had recently been delivered.  “Your address would be on that.”\n\nI once had to ask a guy who knew what street he lived on, but not the house number, and didn’t have any mail handy, to go outside and look at the front of his building.  “Your house number should be on the front somewhere.”\n\nOne guy’s address? “33rd Street.”  “What’s the house number?”  “It’s the red house on the corner.”  He lived in Brooklyn.  No chance of there being more than one red house on a corner there.\n\nOne young lad called to get a free catalog.  Sure, glad to send you one.  He gave me his name, and I asked for his address.  Suspiciously, he asked, “What do you need THAT for?”  I guess his parents taught him not to give out his address to strangers, but I just pointed out that the mail carrier needs to know where to bring the catalog.\n\nAnother boy wanting a catalog was happy to provide his name, street address, city, and state.\n\n“And what’s your ZIP code, please?”\n\n“Uhhhh, six!”\n\n“No, no, your ZIP code would be a five digit number.”\n\nThe kid was smart enough to realize that he has to give me a five digit number of some kind, or there’s no chance he’ll get a catalog.  He’s also smart enough to know that if he says his ZIP code is one-two-three-four-five, that’ll sound too obvious.  His ZIP code?\n\n“Two-four-six-eight-ten!”\n\nFinally, I got a call from a woman, upset that her order was overdue.  I looked up her account and found the order in question.\n\n“I see it was shipped, but returned back to us as undeliverable.  You were credited for the purchase price of the item.”\n\n“Why should that be??”\n\n“Well, I see a couple of problems here.  First, you placed this order yourself online, correct?”\n\n“My son did, yes.”\n\n“Ah, that explains it.  When he entered your address, he only listed your street, not the house number.”\n\n“That shouldn’t make any difference!  We live on a very short street, there’s only four houses on it!  UPS still should have been able to deliver it with the name on the package!!!”\n\n“That’s the other problem.  Do you have anyone in your household that’s actually named Seymour Butts?”\n\n“WHAT?!?”\n\n“That’s the name your son put down for the delivery recipient.  Now, what’s the UPS driver supposed to do? Knock on every door and ask for Seymour Butts?  He’ll get in trouble.”\n\nAfter a stunned moment of silence, she asked, “What about the shipping charge?  Aren’t you going to refund that?”\n\n“No, I don’t think so.  This is clearly not our fault.”\n\nShe sighed.  “Okay, can I reorder it with you?”\n\n“Sure, one moment while I set it up… I’m sorry, that item is now out of stock, and we have no backorders coming in.  Can I help you find an alternative item?”\n\n&lt;click&gt;",
        "created_utc": 1669412184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funniest experiences working for a CC",
        "author": "dck1221",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z4mhg6/funniest_experiences_working_for_a_cc/",
        "text": "[removed]",
        "created_utc": 1669406042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call Center Services and BPO Outsourcing Provider in the India",
        "author": "Logical_Cap5874",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z44xbq/call_center_services_and_bpo_outsourcing_provider/",
        "text": "[removed]",
        "created_utc": 1669353870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where’s my order???",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z3z8zr/wheres_my_order/",
        "text": "Here’s a followup to yesterday’s post, titled “That’s not how it works.”  Major athletic footwear store, catalog and internet sales.\n\nNot two weeks after the call from the guy who didn’t understand how the postal system works, I got this call—\n\n“I wanna know where the hell’s my order!”\n\n“I’d be happy to help you with that.  Can I get the catalog number on the back of your catalog, please?”\n\nI pulled up his account.  There were a number of previous orders, but nothing recent.\n\n“Did you place the order online, or did you call in?”\n\n“I mailed it.”  Here we go again, I thought, thinking about the guy who called about his mail order the same day he mailed it.\n\n“How long ago did you mail it?”\n\n“Four weeks ago!”\n\n“Yeah, we should have received it by now.”  I checked for possible duplicate accounts, but no luck.\n\n“It’s unlikely but possible we received it, but it somehow got posted to someone else’s account.  If all the shoes were out of stock, we’d be holding the money received as a credit on that account.  It’s more likely that we just never received it, so here’s what you do.  Check to see if the check or money order was cashed.  If it was, have them look up the actual document— we would have stamped the account number on the back.  If it wasn’t cashed, you can stop payment and have it reissued.”\n\n“I sent cash!”\n\n“Cash money?  Green pieces of paper with pictures of dead white guys on them?”\n\n“Yeah, a whole lot of it!”\n\nOh, lord.  “How much?”\n\n“Four hunnert dollars!”\n\n“I’m sorry to tell you this, but apparently we never received it.”\n\n“Well, when am I gonna get my shoes?”\n\n“We’ll ship your order when— and if— we ever receive your mail order.  But it’s not very likely at this point.”\n\n“How do I know you don’t already have my money?”\n\nI was a bit exasperated at this point.  “That’s why you should send a check or money order, so there’s a paper trail.  It even says on the order form, Do Not Send Cash.  Otherwise, how do we know you SENT any money?  And even if you did and we never received it, what good does that do us?”\n\nIgnoring the fact that sending is not the same as receiving, he bellowed, “I put it in an envelope with your name and address on it!”\n\n“Okay, let’s examine that logic.  Let’s say we did receive your order, and were able to process and ship it, but you never received it.  If you then asked where your order was, what would you say if we told you, ‘Well, we shipped your shoes in a box with your name and address on it?’ Would that be good enough for YOU?”\n\nNo, he never got his shoes.",
        "created_utc": 1669336664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Promotion at work but still on the phones",
        "author": "Comfortable_Bug2930",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z3qa0x/promotion_at_work_but_still_on_the_phones/",
        "text": "I imagine this is fairly common practice. I landed a promotion following a really good year and doing great in various off line projects. \n\nInterviewed in house and succeeded in getting the role. \n\nI then find out its a half on half off position, 50% the new role (business trainer) and 50% on my team under my normal manager, taking calls as normal. \n\nThe promotion isn’t a waste of time, most people in my place end up in full time positions following the half on half off arrangement and its incredibly competitive to get here.  \n\nHowever, I feel under an enormous amount of pressure to be perfect while on the phones. It places me in a really awkward limbo position and naturally my regular manager will use this against me every time I make any kind of mistake. \n\nIts actually really quite off putting, Im under the spot light massively now and feel its a bit unfair to use the “your a business trainer” line if I’m not 100% perfect all of the time. \n\nAnyone else been through a similar process, how did you handle it?",
        "created_utc": 1669312388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Returned to a previous company",
        "author": "Physical_Resolve_659",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z3ama3/returned_to_a_previous_company/",
        "text": "[removed]",
        "created_utc": 1669265345,
        "upvote_ratio": 1.0
    },
    {
        "title": "That Will Be A Long Wait",
        "author": "One_County_104",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z2xpjz/that_will_be_a_long_wait/",
        "text": "I work as the mostly solo phone answerer person in a niche antique automotive parts supply company (the owner helps on occasion).  Our call center used to have 8 people before our business shrank, leaving me as the only person left.  Years ago, we used to offer a rebuilding service for large mechanical units alongside our usual new parts inventory.  Our mechanic had grown ill and retired before passing away.  We tried to purge the rebuilds from our website but customers still find listings in old catalogs to this day.  Most callers are 60+ years old men.  This is a rough transcript of a recent call:\n\n\"C\"-Customer\n\n\"M\"- Me, the one and ugly, master of my domain.\n\nM- \"Parts and Technical, this is One.\"\n\nC- \"Yes, I'm looking for a rebuilt differential for my 1976 ---\"\n\nM- \"I'm not able to supply already rebuilt units or rebuild yours at this time because we don't have a mechanic.  If you would like, I can supply you with the list of parts you would need for your or a local mechanic to rebuild yours.\"\n\nC- \"I don't really want to do that.  Most mechanics have no idea what they are doing with a British car. How long until your mechanic could get mine done if I sent it in?\"\n\nM- \"As I said, we are not able to do that job right now.  Our rebuild shop is closed while we look for a new mechanic as the old one passed away.\"\n\nC- \"OK.  But surely the old mechanic can easily put one together for me while you look for a new one. Do you have a number for him?\"\n\nM- \"He is unreachable right now as he doesn't have a phone.  I can't give you a time line because our rebuild shop is closed.  Getting things rebuilt by our old mechanic has been massively difficult since he decided to die and get buried.  I'm giving him another week, if he doesn't show up for work, I might have to fire him.\"\n\nC- \"Oh? Oh! That's really messed up!  Why do you have such a twisted mind?\"\n\nM- \"Comes with talking to owners of really old cars looking for parts.\"",
        "created_utc": 1669230725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apparently she doesn't like emails",
        "author": "cheesusismygod",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z2x01r/apparently_she_doesnt_like_emails/",
        "text": "Client is escalating that I never reach out to her, except I have emailed numerous times, but GUESS WHAT??  She prefers phone calls...did she ever once tell me that??  Nope and now my manager is involved and breathing down my neck..super super annoying.",
        "created_utc": 1669229042,
        "upvote_ratio": 1.0
    },
    {
        "title": "That’s not how it works",
        "author": "DuffMiver8",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z2esar/thats_not_how_it_works/",
        "text": "“I’m calling to check the status of my order.”\n\n“Thank you.  Do you have one of our catalogs?”\n\n“Yes, that’s what I placed the order from.”\n\n“Great, can I get the catalog number on the back, please?”\n\nI find an account, but there’s no activity.\n\n“Hm, I’m not finding your order.  How did you place the order?  Did you call in, or use our website?”\n\n“I used the order form and mailed it in.”\n\n“Ah, that explains it.  We apparently just haven’t received it yet.  When did you mail it?”\n\n“4:30.”\n\n“4:30 TODAY?”\n\n“Yup.”\n\nThe time of the call was 7:30.  On a Sunday night, yet.\n\n“I’m sorry, but first of all, there’s no mail service on a Sunday.  It’s still at the bottom of whatever mailbox you put it in.  Second, even if you had mailed it from the mailbox across the street from us, it wouldn’t get picked up until tomorrow, and we wouldn’t even receive it until Tuesday.  Third, you live in Mississippi and we’re in Wisconsin, so it takes a few days for it to make that trip.”\n\n“Oh.  Well, I paid extra for that next day delivery.  Am I still gonna get my order tomorrow?”",
        "created_utc": 1669176250,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need specifics stop being so wounded whenever I ask for them.",
        "author": "Throwawaybae2322",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z24lsk/i_need_specifics_stop_being_so_wounded_whenever_i/",
        "text": "[removed]",
        "created_utc": 1669150224,
        "upvote_ratio": 1.0
    },
    {
        "title": "I only did exactly as she asked.",
        "author": "Phoneyalarm959",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z207h1/i_only_did_exactly_as_she_asked/",
        "text": "Just yesterdst, I recieved a rather rage enducing customer.\n\nShe was getting pissed off at merbecause I was typing notes about her complaint, you know, as one should do.\n\n \"STOP TYPING AND JUST LISTEN\"\n\n\"okay okay, I'll stop\"\n\nShe goes on to complain at a thousand words per minute\n\nAfter a few minutes \"put that in the complaint\"\n\nI follow with \"well honestly, I can't remember 90% of what you just said to me and since you instructed I stop typing, I have no notes to refer to either\"\n\nShe then rants about how im useless while I am trying to explain that to do my job, I NEED to take notes\n\nWhile I was trying to explain this, she kept telling me to stop talking\n\nShe wanted me to stay silent so she could keep complaining, BUT \n\n(you'll all love this)\n\nShe used a very odd combination of words to get me to stop talking\n\n\"IM TRYING TO TALK, JUST END THIS CONVERSATION AND STOP INTERRUPTING ME\"\n\n\"Okay, ending the conversation now\" and I hung up.\n\nThat is all.",
        "created_utc": 1669140000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I call in today?",
        "author": "Hachey97",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z1r113/should_i_call_in_today/",
        "text": "I have .5 (point 5) occurrences and we get 10 before we get fired. I also have a baby son at home and I just want to spend some time with my family, and relax, try and fit in some me time which I never get anymore. At work they’ve given me a leadership role where I review calls and take supervisor calls and help everyone with questions but they haven’t given me a raise of any kind and when I asked if I could get some kind of raise they flat out said no, so I’m kind of bitter every time I go to work now. I always feel super guilty about calling in. What do you guys think?",
        "created_utc": 1669115858,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one become a call center ?",
        "author": "chezzy2213",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z1nfuq/how_does_one_become_a_call_center/",
        "text": "I heard that bank of American is hiring for 50k and wells Fargo a year starting as a call center. Been working for 1 year now I was a busser, prep cook, front line cook and dishwasher in the same restaurant. What is the qualification to be a call center. Want a home job in the morning and then work in the afternoon. 19 years old.",
        "created_utc": 1669102067,
        "upvote_ratio": 1.0
    },
    {
        "title": "I shouldn’t have to pay! Duh",
        "author": "mistakenusernames",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z1ggrq/i_shouldnt_have_to_pay_duh/",
        "text": "Thank you for calling NotMyLife services my name is Mistaken how may I assist you today? \n\n(Exasperated voice) Oh Mistaaaken I hope you can help me I really, really do. No one seems to know what is going on. The first person told me that I should of gotten my card Friday but I didn’t now I’m supposed to get it today and I didn’t! I don’t know what is going on and also my app I have tried and tried and I can’t get into my app I HATE THE UPDATE so I need help with that. I have the tracking number for the current card but I need to see where the first card went and you see I can’t afford this I was charged twice and the first girl told me that I’d get it Friday and .. \n\nMAAM, I would be happy to assist you let me get into your account so I can follow along with you. May I have your SSN please? (Verifies) \n\nSo, I see the first card and we have the correct address (reads it back) is that correct? \n\nYes, yes I’ve been through this it’s all correct. (I’m frantically searching the account not understanding why this call was even routed to me) The second card I was supposed to get TODAY and it’s not here but also I can’t even see if anyone has used it no one will reset my app! \n\nI’ve reset your app MrsSpacey you can now create a new login. I’ve also tracked your card and it says delivered. \n\nWHAT?! I don’t even have pants on! No one is here! Who signed for it?! \n\nWe do not require a signature however it does say left with a person. \n\nLet me check the office don’t hang up! Please I’m 20ft away! (Running and putting on pants) I can’t believe this I was supposed to get one Friday I shouldn’t have to pay. \n\nI can submit a request for a credit it will be reviewed and you should have an answer in the next 3 days, I’ll wait until you speak with the… \n\n(Speaking to office lady) Yes my package it says delivered OH YOU DO HAVE IT! This is the second card I had sent..what? Oh you have another one? (Speaking to me) She has it! \n\nGreat! I’m so glad you found both of your cards. I have reset your app, and now all you have to do is activate, I’m glad it worked out MrsSpacey is there anything else I can assist you with? \n\nYes, there is. I want a refund for the shipping fees. \n\nYou’d like me to submit a request for a fee reversal for both of the cards that arrived on time? \n\n(Scoffs) Yes, I do. I waited hours on the phone to speak to you. I checked Friday and the office didn’t have it the girl wasn’t there all day but I didn’t get it and I shouldn’t have to pay for shipping when I had to wait and I’ve been through all of this. Between you and my doctor I’ve been on the phone two whole hours this morning, I want my money back. \n\n(Submits fee reversal request notating cards arrived on time and card holder wants refund which will be denied) Alright, I’ve submitted those for you, you’ll have an answer here in the next 3 days. Anything else I can help you with? \n\nNo, I just want my money. \n\nThank you for calling NotMyLifeServices have a wonderful day. \n\nWe have actually been advised to stop offering expedited shipping due to these types of people. Literally ruined it for everyone smh",
        "created_utc": 1669080221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hard job. Top tips",
        "author": "Ok_Technician6120",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z15mdu/hard_job_top_tips/",
        "text": "Listen. You will lose faith in humanity with this job. If you’re calling in or out it doesn’t matter I’ve done both. I’ve made loads in bonus, been top earner consistently in my team and department and it doesn’t matter. The money isn’t worth it even when making thousands a month. \n\nThe details are irrelevant and never ending but the customers (regardless of industry) will drive you mental in a range of different painstakingly awful ways! You will lose faith in people. I’m at the stage we’re I strongly believe not everyone should be given the right to vote 😂 Haha. \n\nAnyway the top tip you all came for… is …..\n\nHave an exit date set - say 6 months max. Know precisely when you will hand your notice in and when your last day will be. Do not stay in this job it will depress you. You need to know there is an escape. Only then can you get by. Be constantly looking for something else. \n\nThis crucially applies for those working in telesales for phones. \n\nThank you.",
        "created_utc": 1669054039,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t hear them",
        "author": "WunderPug",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z0wc2d/i_cant_hear_them/",
        "text": "I got a phone call today from a lawyer. \n\nShe is complaining that she has a video link legal conference and she can see her client, but can’t hear them. \n\nShe is complaining that this fault has taken too long to resolve, she needs to speak with her client. \n\nHer client ( which is who I work for ) has already had 2 techs come in while on the conference and check the equipment, and even reboot. \n\nI figure I will do the right thing and rule out any connection issues on our end, check the link, and it’s got more than enough bandwidth to support audio and video. \n\nI ask her if she has checked her laptop, and she snaps at me. \n\n“This isn’t my first conference. I know what I am doing.”\n\nI say “Other than checking your volume settings, I am not sure what else I can advise you on. Everything looks fine from our end”\n\nI then hear some volume in the background getting louder and louder. \n\n“Don’t worry. It’s working now” click.",
        "created_utc": 1669029029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't Get an Escalation Handled",
        "author": "DetroitBrat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z0bnly/cant_get_an_escalation_handled/",
        "text": "VERY, VERY LONG - some venting and my escalation problem. \n\nI've been stewing on this one for a month now and I just feel like, if I don't get it out, it will keep poisoning me. So, without further ado...\n\nI've worked for a particular cellular carrier for ten years. When COVID hit, we were all moved to WFH and it was not bad. There were certain annoying things that still happened, simply due to the nature of the work. However, glorious bonus, the micromanaging decreased!  I happily continued working through the pandemic.  \n\nOne arbitrary day, the powers that be decided that we should all return to the call center. I didn't bitch too much about it because, quite honestly, I'd become something of a hermit. I packed my bags and returned. As it happens, corporate decided that the end of the pandemic was the perfect time to fill all the empty seats. I returned to find approximately 200 new faces, of which 180 of them would be gone before year end.    \n\nWhen corporate decided that a \"virtual\" call center was viable, they allowed all of the tenured reps (2 yrs or more) to move back to WFH, however, they would now be part of the virtual center rather than our physical center as a WFH employee.  So, January of 2022, I'm full time virtual. My first manager has no clue that I've been with the company for years so I'm suffered with a week of onboarding and process training. I tried telling him, but he cut me off with \"You do what I tell you to do.\"  I get it boo, you do you.  So I spend my first two weeks pretty much doing nothing because they are \"training\" me to use software that I helped test when it was new. An important thing to note here is that my escalation software does not work on my new profile. I emailed my manager, one of the managers on duty and the training manager - twice. (Important later) \n\nThe \"GENIUS\" moves they made in the months leading up to the fateful day:  \n\n1. It was decided that reps would bid on schedules every three months, however, the managers would be rotated depending on THEIR availability. The result of this meant that I worked Monday - Friday, 6.45am to 3.45pm; my teammates worked various hours; and had EIGHT different managers in ten months. If you needed something, you just went into chat and found one of the managers on duty and asked them. (This point is important later). \n\n2. Our commission breakdown was changed so that we were no longer paid for our customer feedback scores - which for me, was a minimum of $500 a month. After the first three months, only 28% are passing this metric, but it's secondary now so who cares if the customers are happy? \n\n3.  After the fourth month or so, we get a system update and my computer will no longer connect to the internet via ethernet. I contact the manager on duty and he tells me to use WIFI - which is a HUGE security violation.  I ask him to put that in writing via email and he does. After all, what is customer information security anyway? \n\n4. In efforts to get the reps to use the company approved \"plan &amp; equipment calculators\", they removed the standard computer calculator and Excel, so we can no longer correctly quote final prices. Who cares, just get them to sign the contract, right? \n\n5. I took time off for a medical procedure and when I returned, I discovered that my manager had been promoted and no one knew where I belonged. My password expired and the time frame for a simple reset had passed, requiring a manager to unlock it. I sat (clocked in), for a week before they figured out who was supposed to help me. Free pay, I'm down! \n\n6. It was decided that the reps were transferring calls to tech support, insurance and other specialists too often, so a manager approval was required for every transfer. Of course, you have to FIND one, first!  Handle time problem, anyone? \n\n7. One fine sunny day my internet is down and won't get fixed 'til Saturday, but it's Friday so it's not too bad.  I call a random manager and this clodpoll tells me to connect my company computer to my PERSONAL cell phone hotspot and work like that.  Noped right out of there! \n\nThe day before I quit was my ten year anniversary.  I chose my gift (a very nice,  8qt. Instant Pot Crisp Pressure Cooker &amp; Air Fryer) and got on the phones.  My first call of the day:  Me and KI (kind idiot)\n\nMe:  Good morning, my name is DetroitBrat, how can I help you?\n\nKI:  I need to speak to a manager right now!  \n\nMe: I'd be happy to get you a manager, but the company gives me to the tools and permissions to help you in almost all situations. \n\nKI: My Fruit Phone speaker went out and I'm going to need your company to send me a brand new one, shipped next day air, at no cost, right now. Because of the problem with it, your company has forced HIPPA violations on us and I will turn them in. \n\nMe: Sir, we are aware of the Fruit Phone speaker problem, however, The Orchard that makes it demands that all exchanges go through them. I would be happy to help you through the process. \n\nKI:  I've already talked to The Orchard and they want to put a hold on my credit card and I didn't buy my phone from them, I bought it through you.  I want to talk to a manager if you can't make this happen.  I know you're just doing your job and I don't want to be ugly to you. \n\nMe:  I appreciate that very much, thank you Kind Idiot.  Before I get a manager for you, you mentioned something about HIPPA violations?  We don't handle health information here. \n\nKI:  I know, but since my husband and I are forced to talk over speakerphone only, I can hear medical information in the background - and that's a HIPPA violation, and it's your company's fault.  (Wait, what?!?) \n\nMe: Thank you for explaining that, bear with me for one moment while I get you a manager. (We are forbidden to put the customer on hold, unless they are being immediately transferred and the time is not to exceed 60 seconds.) So I don't put him on hold and just keep shooting the shit while working on chat. \n\nI quick message my manager of the day (TAH - today's ass hat) , \"Take it to the escalation chat\" is what I'm told.  \n\nMe to TAH Manager: As I've said multiple times before, my escalation chat software does not work!  \n\nTAH: Talk to Incompetent Support (IS)\n\nMe to IS: I have a customer that is demanding a manager and TAH Manager said to have you handle it. \n\nIS: Take it to escalation chat, I don't do that. \n\nMe:  I am unable to access escalation chat, tech is working on the problem and TAH told me to have you handle it.  \n\nIS: Wait...I'll talk to TAH myself\n\nLiterally FIFTEEN MINUTES later, IS comes back and wants to walk me through the set up of the escalation chat. I tell her that it's a tech issue and give her the ticket number. I remind her that the customer has now been waiting over half an hour to talk to a manager.  \n\nIS: That's not really my problem now, is it? I am floor support, I don't talk to customers ever! \n\nKind Idiot is so nice and polite, telling me funny stories from his day.  We're laughing and  having a good time.  I am the one that's pissed off! \n\nMe to TAH Manager: I can't escalate, floor support refuses to help, what do you want me to do with this customer?  No response....for ten minutes. \n\nWe used to have an old system for handling escalations.  You would enter the information and then it would be emailed to your manager and they would handle it within the hour. Since it's no longer in use, any entry made in there now goes to the Director's office. So...I used it.  I told the customer that a manager would call him within the hour and then I would call him later to ensure that a manager called him.  \n\nAt this point, the situation is incredibly stupid because I only need a manager to tell this man the same thing that I did, because there are no loopholes in The Orchard process unless you are a VP or higher. Can I get someone to do that?  Nope! \n\nAbout 20 minutes later, I get a scathing phone call from TAH Manager:  Why did you use the old system?  Who gave you authorization to do that? Who's log in did you steal to use it?\n\nMe: If any of you had bothered to listen to anything I've said over the past months, you would know that I've worked here for almost ten years. I've worked advanced tech support and floor support, you would be amazed at the systems that I have access to! I used the old system because I had a customer waiting almost an hour total to speak to a manager and no one could be bothered, so I handled it. \n\nTAH Manager: It's been handled, don't you EVER log into that system again, do you hear me? \n\nMe:  Yep, I hear you, I'm gonna need that in writing though, then hung up.  I called the customer back an hour later to make sure a manager called him.  Nope, no response. \n\nNow what?  I can't use the old system again.  Then I remembered! When I worked at the physical call center, our Area Director was a hell of a nice guy and went above and beyond his job. He always told us that no matter where he was, if we had a problem to let him know.  Well, he's VP now, but what's the worst that can happen?  I send Archangel Michael an email repeating everything I've written here.  I received a three word reply:  \"I got you.\" \n\nI waited until my day was almost over and called the customer back.  Kind Idiot said:  I don't know what you did, but a man named Michael called me and told me that he is sending me two, brand new Fruit Phones and he waived my bill for the month. You said you would help me and you certainly did!  \n\nI logged out of my phone a little early because that was plenty of stress for one day, and I was almost immediately bombarded by messages from TAH manager and the area manager.  They were beyond pissed off that I emailed Michael and now all of us were scheduled for a meeting in the morning.  I told both of them to shut the fuck up, I'm done talking - and closed my chat program.  \n\nI wrote an email to Michael thanking him for being a true, and good human. I proceeded to purge my computer of every scrap of information that I wrote, gathered or had my name attached to it. I wrote another email (and cc'd Michael) to my assigned manager (the poor bastard was on vacation and hadn't a clue) and the area manager, detailing the day's accounts.  I asked them to send someone to pick up their equipment and that I quit.\n\nLater that day I received two emails in my personal account. The first was from Michael, giving me his personal information so I could use him as a reference. The other was from the Virtual Center Director telling me that he'd just heard what happened today and wanted to know if I would reconsider. Also, did I happen to know where my data had been saved? I didn't think ignoring him was any fun, but all I could think of was \"New phone, who dis?\" \n\nMy new job starts next week.  I'm SO sorry for the length, but I thank you for putting up with me!",
        "created_utc": 1668969568,
        "upvote_ratio": 1.0
    },
    {
        "title": "i guess this is the end",
        "author": "patricksayswhat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/z020ya/i_guess_this_is_the_end/",
        "text": "I’ve skipped showing up to the job for 4 days now. My supervisors are chatting and texting me and all, but I leave them with no response.\n\nI’m a university student and I didn’t showed up because I’m so busy with my midterms right now. I’m tired, I think I’m done. I’m going to pass this resignation letter tomorrow. I’m done!",
        "created_utc": 1668944405,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the saddest customer experience you had to take?",
        "author": "gameofthrones_addict",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yzvpc3/whats_the_saddest_customer_experience_you_had_to/",
        "text": "I work for a utility company.  Pretty much every day I come across customers that are constantly behind on their bills for one reason or another.   Many have run out of the few options we have at our disposal and yet are still behind on their bills.  And you can’t help but think that this isn’t the only company people owe money to.  \n\nIt can easily get overwhelming to you when you can’t help people because they’re at the end of the rope that you are allowed to assist them.   Sure you can try to write up some of these Instances that people are just bad with money and it’s easy to write some people off when they lash out and become irate with you for not helping them.  But it still can get to\nYou when you realize that some people just have a whole life of difficulties behind them.  \n\nIs there a time that you couldn’t help but feel bad for a customer?",
        "created_utc": 1668920685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worst industry for call center employees",
        "author": "Wil3791",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yztvo2/worst_industry_for_call_center_employees/",
        "text": "What would you say is the worst industry for call center employees? For me it has been a cell phone carrier. \n\n* Customers would yell and cuss at me.\n* A customer would complain about poor service. I would look at the map and see the coverage is terrible but was still expected to fix it.\n* I was in tech support Agents from other departments would dump on us any call they could not or did not want to handle, even if it was not a tech issue. They would also raise false expectations in the customer before dumping a call on us.\n* I was expected to solve every issue before letting the customer hang up but was also expected to keep the call short.",
        "created_utc": 1668914560,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s stopping an agent from stealing and using customer CC info?",
        "author": "supersyan777",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yzpuc0/whats_stopping_an_agent_from_stealing_and_using/",
        "text": "Soooo I have a question. Idk the exact stats but I’m assuming several hundred thousands if not millions of CC payments are taken on a daily bases from a customer to a customer service representative for XYZ service. What’s stoping that agent besides morality behind it from storing saving and using that info (CC number expiration CVV zip code) to ether sell the info or use it for their on personal gain?",
        "created_utc": 1668902179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tracking",
        "author": "Tha_Mountain",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yzpizh/tracking/",
        "text": "So I have been a working in call centers for a few years to many already, and at this point most of the silliness that is inherent in a call center no longer bothers me. However there is one thing that I see in my own job and in other posts as well. Like most I will not change the world or even call centers in general but I have to vent this somewhere... WHY oh WHY do people loose the ability to understand how to read a tracking number for shipping. They keep calling in and asking when they have the tracking number. I have the exact same info from a tracking website that the customer can see so why do they call anyone other than the shipping carrier about their package status?",
        "created_utc": 1668901279,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Why does it matter which card I want to talk about?\"",
        "author": "TrippingGoat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yzlf32/why_does_it_matter_which_card_i_want_to_talk_about/",
        "text": "So one of the last calls I ever took before I (hopefully) never have to take another customer service phone call in my life was a guy who wanted to speak about promotional rates on his card. No problem, I can do that. It went something like this:\n\nMan: begins call off with rant \"I've been on hold for 20 fucking minutes while I'm being transferred from department to fucking department and nobody wants to fucking help me! All I want to do is check on my promotional rate on my fucking card!\"\n\nMe: \"Okay, sir. I can understand that's frustrating. Can I get your first and last name?\"\n\nMan: \"It's Ranty Swearingpants\"\n\nMe: \"Okay, Mr. Swearingpants. I see you have several different credit cards here. Was there a particular one you were interested in knowing the rate on?\"\n\nMan: \"Why does it fucking matter which goddamn card I want to fucking talk about? All I want to know is my promotional rate!\"\n\nMe: \"Sir, each card has diff-\"\n\nMan: \"I DON'T FUCKING CARE! WHY SHOULD IT MATTER WHICH CARD I WANT TO FUCKING TALK ABOUT?\"\n\nMe: \"Sir, again, each card has different promotional rates. If you're interested in knowing more, I'm going to need to know which card we're talking about.\"\n\nMan: \"Well that's crazy. Why should it fucking matter which fucking card I want to fucking talk about? This is unprofessional! Your bank needs to know that this is bad customer fucking service!\"\n\nMe: \"Okay, sir. I'm going to get you over to someone who discusses promotional rates\" Transfers call",
        "created_utc": 1668890099,
        "upvote_ratio": 1.0
    },
    {
        "title": "I understand now",
        "author": "Electrical_Tune5334",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yywumq/i_understand_now/",
        "text": "I never understood how people in call centers have the worst mental health…like who cares? These people don’t know you, what they say doesn’t matter.\n\n….until I started working as a collections agent at a bank. I cry every single day because I’m told how worthless and incompetent I am and throw insults at me nonstop. Only thing keeping me here is the pay. But at this point, it’s effecting my will to keep going in life. You hear how worthless you are so many times you start to believe it",
        "created_utc": 1668811522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mandatory OT",
        "author": "throwaway512567",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yyw6d4/mandatory_ot/",
        "text": "Mandatory OT every week\n\nDoes anyone else’s call center have mandatory OT every week? Pretty sure that’s not gonna help if multiple people leave a week but idk 🤷🏼‍♀️ just feel like I’m becoming more miserable everyday I’m at this job. Was really hoping they would at least do away with it next week but of course not, because why would they?",
        "created_utc": 1668809712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mandatory OT every week",
        "author": "throwaway512567",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yyw5k1/mandatory_ot_every_week/",
        "text": "[removed]",
        "created_utc": 1668809652,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate it when callers act like they know more than you when you’re just trying to help.",
        "author": "gameofthrones_addict",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yyngrr/i_hate_it_when_callers_act_like_they_know_more/",
        "text": "I know that I shouldn’t let it bother me but occasionally it does.   The point of the job is patience, though sometimes people pull out the frustration out of you.     \n\nYesterday I was helping someone go over her bills.  She called in to discuss what she thought was just one bill.  Though the next billing cycle already came out so she was a little late.  So she paid all what was owed but then called in to the call center to complain and want to know why she owed double what she thought was being charged for the time.   \n\nShe was confused and wanted to know if we received the payment she made in October.  In which we did.  So I explained what happened, that recently back earlier this week her next billing cycle actually started and that wasn’t technically owed until December but since she paid it her account balance is $0.00 now, she paid earlier than when it was due so she’s all caught up.   \n\n\nShe then denied that was true because she didn’t receive the bill yet.  I advised her that this just happened like two days before she called so the bill may still be in the mail and she could receive it at any time.   She then asked when would it have been due originally and I told her that the due date for the new bill is in December but since she paid it once she receives the bill she can go ahead and ignore it.   That made her go off and ask why we are charging her for December when December isn’t here yet.   \n\nI then explained how the billing cycles worked.  That the period she’s paying for in the bills aren’t for the time that the due date is, it’s for the time period between when the previous bill came out and when the new one came out.  We just give people 3 weeks time frame to receive the bill and then pay it or call us for any type of arrangements.   \n\nCue going back and forth on repeat from the questions she already asked for another 10 minutes.  In which I could feel my blood pressure rising.  Until she decided to just tell me that it sounds like I don’t know what I’m talking about and wanted to talk to someone else.  Told her if she wants to talk to someone else she’ll have to call back.   In which I’m sure she did.",
        "created_utc": 1668787130,
        "upvote_ratio": 1.0
    },
    {
        "title": "To my glasses-wearing friends",
        "author": "Savings-Grapefruit",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yy4j63/to_my_glasseswearing_friends/",
        "text": "[removed]",
        "created_utc": 1668726490,
        "upvote_ratio": 1.0
    },
    {
        "title": "This call is non-urgent and there’s no cause for concern…",
        "author": "The_Mystik_Spiral",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yx9ddw/this_call_is_nonurgent_and_theres_no_cause_for/",
        "text": "\nPreface: While I don’t work in a call center, making calls and answering them is a HUGE part of my job description and leads to many of the same frustrations as my compatriots in the call center.\n\n I work for a financial institution in what is, essentially, a glorified sales role. The pay is okay, but there’s the possibility of a good pay out for sales commission. Regardless…. As part of my job, I’m assigned leads that I’m required to call on in order to schedule appointments. Yes, it’s annoying. For us and the customers. That said, I’m not pushy about it and I try to approach it in a light and friendly manner. \n\nObviously with these phone calls I expect some push back and nastiness. That’s not necessarily what makes this customer a Karen, however. \n\nSo, Karen McKaren winds up on my list of leads, and worker bee that I am, I want my calls done before the next calls come I so I don’t get backed up. Karen doesn’t answer and I leave a message. I NEVER go into heavy detail in these messages nor do I mention any of the leads personal details. Essentially, I say my name, where I’m calling from, that the phone call is non-urgent and there is no cause for any concern, but that I do have an opportunity I’d like to discuss. \n\nPretty inoffensive, and frankly most people ignore it.\n\nNot Karen McKaren.\n\nShe calls me back and I can immediately tell she is on *edge*. \n\n“What’s going on!? What’s wrong with my accounts?”\n\n“Hi Karen, as I stated in my message, there is nothing wrong and the phone call is not urgent. As your banker, I like to reach out to my clients every so often to, first and foremost thank you for being a customer. Secondly….”\n\nI’ll spare you my spiel. It’s an invitation to sit with me and essentially have a check up. It’s a way to get people on the door. \n\nKaren McKaren doesn’t like this….\n\n“Not ONCE in all the time I’ve baked here have I ever gotten one of these phone calls!”\n\n(Lie. I can see in the notes you have, but okay.)\n\n“AND you have caused me UNNECESSARY panic and anxiety because I thought something was wrong with my accounts”\n\nOkay, whatever, it happens, I’m listening. \n\nAnd then she says it. The line that took this from the usual and into weirdo Karen territory. \n\n“*AS A MILLENIAL* you need to watch how you speak to us. I suggest that you learn how to properly address us *millenials* as I’ve been anxious every since I got you message. And your opportunity? I thought you were going to tell me that my credit improved and I was going to *blah blah blah ramble ramble ramble*.”\n\nGuys.\n\n*I’m* a millennial. I literally have no idea why being a millennial is being mentioned by her so much. Honestly, I thought the whole making fun of sensitive millennials was just an internet joke. But here I am…. Being confronted by someone who, as a millennial, is concerned and anxious and in a panic over my message explicitly telling them not to panic….\n\n\nAs good drone does, I apologize, document the complaint, make notes that no one should call her (I may have been petty and quoted her line about feeling that we’re not addressing millennials properly…”) and turn off her phone call permissions. \n\nAt this point my co-workers have caught on to the drama, so, I explain the phone call to them. \n\nAnd now the running joke all nighthas been starting any answer to “As a millennial….”\n\nSo, at least it was entertaining for us all.",
        "created_utc": 1668640156,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote haikus in my downtime at work.",
        "author": "Phoneyalarm959",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yx26bn/i_wrote_haikus_in_my_downtime_at_work/",
        "text": "[removed]",
        "created_utc": 1668624222,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got told off for helping a team mate!",
        "author": "clumsy_swan",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ywqinv/i_got_told_off_for_helping_a_team_mate/",
        "text": "A colleague of mine was struggling yesterday. We work from home and they had messaged about 5 managers for help. None of them even read their message except one who ignored it! I spent some of my after call time helping them as they were almost in tears, and had had the angry customer on hold for over 10 minutes. \n\nI messaged my manager to say my wrap may be a bit longer for that call because I had to help a team mate. They sent back some messages telling me I’m not a floorwalker, don’t ever do that again, my stats are not good enough to be wasting time helping team mates, don’t sink your own boat helping others etc. If I had the balls I would have said ‘if you did your job and supported them when they needed help, I wouldn’t have had to do it for you’.\n\nReally angry about it, mostly because the team mate has mental health problems and they know this, but still ignored them asking for help. I get that managers are busy, but surely not every single manager and floorwalker at once! I hate that they would rather I left them to struggle to save my own stats, that’s not nice at all.",
        "created_utc": 1668596608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Darrell Brooks remind me of some of my customers",
        "author": "Sea-Competition8233",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ywhj0t/darrell_brooks_remind_me_of_some_of_my_customers/",
        "text": "Darrell Brooks remind me of some of my callers\n\nAnyone else watching the Darell Brooks trial? That guy is very argumentative, think he knows it all and above the law. Reminds me of some of my callers especially those who like to play mind games and twist my words. Some of my callers think they know better than me and I want to tell them to do my job for me.",
        "created_utc": 1668566868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Darrell Brooks remind me of some of my callers",
        "author": "flatbreadpinafore",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ywhi8d/darrell_brooks_remind_me_of_some_of_my_callers/",
        "text": "[removed]",
        "created_utc": 1668566801,
        "upvote_ratio": 1.0
    },
    {
        "title": "New-ish to the job, strangest thing that's happened so far",
        "author": "MunaDarks",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yvo8gb/newish_to_the_job_strangest_thing_thats_happened/",
        "text": "I started working for this call center on December last year so I'd say I'm still kinda new to it. I've got a couple stories of some weird calls, but this one is the strangest so far.\n\nSo a while ago, I was on a call with a client while two of my coworkers gossiped by my side. We use Podium for texts and Ring Central for calls, so all the texts can be seen by everyone unless they're sent to your direct RC number, which we don't give out unless it's an absolutely necessary thing. When suddenly I get a pop up notification from RC that I got a text to my direct number. I couldn't read the whole thing, but the words \"fuck\" and \"husband\" did stand out to me. I look at my coworkers and one of them has this shocked face and just mumbles \"I saw that\". I finish helping the client I was with and then I immediately go to see the text. It says something like \"did you fuck my husband [name] on [date]? And if so, what are your prices so we can rebook\". Now in this moment all the colors left my face. I have done online SW in the past, never anything in person but you know, I was terrified it was somehow someone who actually knew me from that lol I know it makes no sense really but it was the first thing that popped into my mind. Then a follow up text comes through, \"I found you on [website]\". I didn't get a chance to even process it when I got another call, so I pick up... \"Hello, thank you for calling [company name], this is [name], how can I help you?\" Then I hear this woman with a really sultry voice basically repeat what the text said. I just went \"I'm sorry ma'am, this is an insurance company\", she laughed a bit and said \"ok\" kinda hesitantly. I just hung up. Then I looked up on my phone the name of the website and found out it was an escort site, so I looked up the name of it plus my direct number and found a profile of an escort who had my direct number plastered all over. She probably made a typo or something but yeah. I tried reporting it but for that I had to make an account on the website so nope lol... I just reported it to my boss and hoped no one else would call from that website. Thankfully no one has, maybe she realized her typo and corrected it who knows.\n\nAnyways, I was mortified for a moment but so relieved knowing it wasn't my own SW stuff coming up. Unfortunately that would get me fired on the spot.",
        "created_utc": 1668491047,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it about call centers that makes management completely unwilling to pay 1 cent for experience?",
        "author": "MachinePotato",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yvfcvd/what_is_it_about_call_centers_that_makes/",
        "text": "I get calls everyday from recruiters, internal to companies, or temp agencies. They literally BEG me to consider working for them.\n\nYet they want me to work onsite when I have full remote and they are not willing to pay one cent more than I'm getting. They're probably paying the same for someone with 0 experience. It's kind of crazy really.",
        "created_utc": 1668466402,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"you can't put the phone down on customers.\" \"yeah? watch me.\"",
        "author": "angelofessence1",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yuu0ns/you_cant_put_the_phone_down_on_customers_yeah/",
        "text": "Oook so some places in retail environments and even at post offices in the UK where I am have signs saying abusive behaviour will not be tolerated and service will be refused etc. Why can't I have that same protection? Oh yeah because I'm a phone grunt so I should just take it. WRONG. \n\nOver the weekend shift I took no shame in going *click prick* to 4 real nasty ones. Best off to do it before you even get into the account so they have no record of you. One started very bitter and nasty as soon as I answered and then demanded my name again before I even got in the account and I knew she was going to be an hour worth stress not worth the pay so clicked that fucker off. \n\nSorry, but if you call and don't even want to be helped and just want to shout and be abusive you are gone. Sure if you're angry and just want to vent whilst being helped that's dandy and I'm happy to give you all the help I can and make your day better. But nope. I will NOT be a verbal punchbag for no reason. Don't get paid enough for it.\n\nLuckily I'm ducking out of call centre work in the new year so I'm happy to work off of my own policy such as this one. Otherwise there would be no protection, and yet corporates wonder why the turnover is so high at their contact centres.....here's a hint........OFFER YOUR EMPLOYEES MORE SUPPORT TO ABUSIVE FUCKWITS!!!!",
        "created_utc": 1668418287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear Customer - Go fuck yourself",
        "author": "Mardoo",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yuf3sw/dear_customer_go_fuck_yourself/",
        "text": "[removed]",
        "created_utc": 1668375305,
        "upvote_ratio": 1.0
    },
    {
        "title": "i am done with training and start calling on monday but already had a few calls on friday and i feel lost already",
        "author": "nefelibatainthesky",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytx0v2/i_am_done_with_training_and_start_calling_on/",
        "text": "Like the training was fun, just a small group of people of mostly equal experience in call centres (little to none) but friday was the last training day and it was mostly spent listening to calls with experienced callers and occasionally doing an actual call, and also in the main office space with the rest of the team and not in our own classroom\n\nIdk but the whole vibe just soured for me, i felt like i did horribly and the first guy that was supervising my calls made me seem like an idiot and was incredibly rude to me and other people. (He also made sexually charged remarks to customers out of nowhere) and i feel like people have already clocked that i am on the spectrum and are treating me like a child.\n\nMy main trainer for example is making inside jokes and small talk with others and when i try to talk with him its like how a teacher reacts to a toddler.\n\n\nHopefully it will go better on monday but now i just feel like the whole vibe is going to be toxic and stressful.",
        "created_utc": 1668332775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sup Behavior",
        "author": "Prestigious_Ask_5661",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytqisn/sup_behavior/",
        "text": "[removed]",
        "created_utc": 1668309807,
        "upvote_ratio": 1.0
    },
    {
        "title": "first job (inbound sales)",
        "author": "mepicalatripa",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytmqyd/first_job_inbound_sales/",
        "text": "So I'm 18 and recently managed to get a job as a inbound sales agent , its my first job so of course I don't have experience,im excited but don't know what to expect, \n\ndo I need to make my own script?\n\nWhat can I expect?looking for some advice!\nThanks",
        "created_utc": 1668298559,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I'll send you good energy\"",
        "author": "AnonyDogg",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytmk7m/ill_send_you_good_energy/",
        "text": "Trying to stay positive about my call centre job at the moment as we're slammed with an issue we have no ability to fix (as per usual). Luckily, a fair few of our customers are just really decent people.\n\nHad a woman the other day say she'd send good energy to me, and pray for me. I'm not religious, but it was really sweet. We talked for a good while; she was having a tough time and I couldn't do much, but I listened and was just human about it. At the moment, that's a lot of my calls.\n\nAlways makes me smile when they think they've put the phone down and I hear a, \"she was lovely!\" in the background.\n\nThe abusive callers are louder and angrier, but I think that the nice ones make the day a little more bearable.",
        "created_utc": 1668298035,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice for first job (inbound sales)",
        "author": "fqoas",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytmjy0/advice_for_first_job_inbound_sales/",
        "text": "[removed]",
        "created_utc": 1668298015,
        "upvote_ratio": 1.0
    },
    {
        "title": "“I’ll be removing my money and breaking up with this bank!”",
        "author": "Tiffandthe-gap",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ytgszj/ill_be_removing_my_money_and_breaking_up_with/",
        "text": "[removed]",
        "created_utc": 1668283192,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Will my bill be prorated!?\" \"We don't employ psychics\"",
        "author": "abblejacksvaill",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ysx113/will_my_bill_be_prorated_we_dont_employ_psychics/",
        "text": "Hello all! I had this lovely call this morning. Enjoy!\n\nC-caller\nM-me\n\nM \"thank you for calling the place I work, my name is abblejacks, how can I help you?\"\n\nC \"hi, my installation appointment had to be rescheduled because of manpower issues and I was wanting to know if my November bill will be prorated.\"\n\nM (verifies account) \"I'm so sorry that happened, ma'am. I'd be happy to take a look. You said this was an install?\"\n\nC \"yes.\"\n\nM \"okay, so if you don't have active services right now you don't have a November bill yet so no, you will not be charged for time you don't have active services. Your billing will start the day we install services. \n\nC \"you didn't answer my question\"\n\nCue 6 or 7 minutes of her asking the same question and me trying to word In a way she understands...\n\nAnd then giving up.  \n\nM \"I'm sorry ma'am, so no, we won't be prorating your first months bill because your billing hasn't started yet. It will begin the day your services are activated\" \n\nC \"what are my billing cycle dates?\"\n\nM \"well, that would depend entirely on when the services are installed for you. The billing would start the day services are installed and the cycle runs for 30 days after that date. So if you are installed on the 8th your billing cycle will run from the 8th of One month to the 7th of the next.\" \n\nC \"why won't you answer my questions!? Why are you just running me around?\"\n\nAnother few minutes of the same repeat question and answer.  \n\nM \"ma'am, I'm answering your questions.\"\n\nC \"DONT argue with the customer.\" \n\nShe then proceeded to finally allow me to reschedule her appointment and demand a sup when I couldn't 100% guarantee no techs will get sick or hurt and cause an power issues on the 29th of this month. \n\nTGIF DUDES.",
        "created_utc": 1668229237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whenever a customer screams I turn my volume down",
        "author": "Sea-Competition8233",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ysu2l0/whenever_a_customer_screams_i_turn_my_volume_down/",
        "text": "Hearing customers scream, complain, yell, curse, makes my ears hurt. It’s not fun to have someone scream in your ear. Lately I’ve come to the realization that these customers are very bold behind the phone and they probably wouldn’t do that in person. Whenever I get a caller that screams I turn my  volume down very low because more than likely they’re not saying anything important and there is nothing else I can do for them. Then I come back with “I understand sir/ma’am and I wish I could do more for you but this is the only option.” Turning the volume down helps me keep my composure as I won’t feel like they’re talking over me. Does anyone else do that?",
        "created_utc": 1668219655,
        "upvote_ratio": 1.0
    },
    {
        "title": "oops I did it again",
        "author": "firstmelissabaldwin",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ysp9v6/oops_i_did_it_again/",
        "text": "[removed]",
        "created_utc": 1668205967,
        "upvote_ratio": 1.0
    },
    {
        "title": "The End",
        "author": "Tacofan-attic2012",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ysp7ui/the_end/",
        "text": "[removed]",
        "created_utc": 1668205827,
        "upvote_ratio": 1.0
    },
    {
        "title": "My job made me feel like i'm not \"a team player\" because I refused to take calls during my lunch",
        "author": "iminlovewithyoucamp",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yse2ww/my_job_made_me_feel_like_im_not_a_team_player/",
        "text": "A few days ago, only 2 out of 7 people from my department showed up to work. The worst part, it was a monday. Now, i'm cool with it because I like to take back to back calls due too the the high call volume makes the time go faster.  The problem lies when it came to lunch time. My supervisor asked me and my other co worker \"Could you and the other employee clock out for lunch but take calls during your lunch?\"  I asked, \"so are you going to pay me for taking the calls?\" My sup said, \"No\" Long story, short, I told my supervisor I refuse to work for free. I ended up taking my lunch and my co worker decided to clock out for lunch but work through her lunch. \n\nHowever, on the next day, my manager decided to buy lunch for myself and my co worker. my manager later learned that I did not elect to work through my lunch so i didnt get free lunch. After a bunch of back and forth, i ended up getting my lunch paid for but my manager told me, \"When you said you refused to work during your lunch, it make you look really bad to the VP. You need to be a team player and help the team when needed.\" i replied, \"If you needed me to work during my lunch, why not just pay me?\" My manager said, \"Because we would get in trouble if we didn't give you a lunch break.\" I simply said, \"Ok\" and moved on. Later on in the day, my other co worker talked to me in private to explain why she decided to work though the lunch. My coworker explained to me, \"I decided to work though my lunch because we are a small company and we are like a family\" Oh heck no! I'm not your family, My loyalty is to me and my dog. This is a job. I am exchanging my time for money. That's it. I may sound a bit cold but after 10 years of working in calls centers. Lesson number one is too trust nobody. To be fair, i work for a super small company. the company has less then 30 employees. The company is so small, i'm looking at the owner as i'm typing this out. I may be more willing to \"take one for the team\" but when the manager tells you the company just received a 3 million dollar investment but every time anyone ask for a raise, the VP fights tooth an nail against the raise for all of the employees, it doesn't make me want to, \"take one for the team\" Just to be clear, i put in my two weeks notice 2 days ago because i just got a job offer with a 3 dollar pay increase.  If you were in my shoes, how would you best handle the situation? Would you \"Take one for the team\" or refuse to work, without pay, during your lunch, or a mix or something different? \n\n&amp;#x200B;\n\nTLDR: My Sup asked me and my Co worker to work though our lunch. I said no. I am now considered not a team player and how would you handle the situation if you were in my shoes? \n\n&amp;#x200B;\n\nFYI: I already put in my two weeks notice 2 days ago but not for this reason. I was offered a new job with better pay.",
        "created_utc": 1668181488,
        "upvote_ratio": 1.0
    },
    {
        "title": "A little different—using my job to stay mindful and practice compassion.",
        "author": "Rosegardenteahouse",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ysc4i4/a_little_differentusing_my_job_to_stay_mindful/",
        "text": "I do not want to sound like an over optimistic person—I am not. Nor do I care about the company I work for in any way, or their stats. \n\nBut I’ve been working in call centers for a long time. I make decent money at this point and time. But every time I answer the phone I am filled with dread and almost hatred towards the person I am speaking to.\n\nIs this the persons fault or mine? I’d say neither. Humans were not made to communicate in the ways we are forced to now. With hundreds of strangers a day, navigating a huge bureaucracy.\n\nOften, I find myself siding with the company over some bullshit policy they have simply because I know the client will get angry. Clients become non-human to me. Just something to endure and kick off my line.\n\nPersonally, I don’t have huge career goals besides being comfortable. I have stayed in call centers for this reason, despite having certifications and experience that could put me into an off the phone (but much more stressful) role. \n\nSo if I’m going to be here, how do I make the best of my time? \n\nI’ve been taking a step back and remembering each customer is a human being. Yes, even the snotty ones. Some I don’t bother with, but many are actually just fearful and have no one. For instance, I realized a lot of recent widows put up a front of anger and bitterness because they are afraid. Their husbands did everything for them and they want to appear like they know too, so they don’t get screwed over. \n\nOlder people in general act like technology is an issue and not themeselves, because they are terrified that they exist ina world in which they can’t even accomplish basic tasks. \n\nAll it takes is kindness, and non-patronizing patience and I swear these people act like you’ve made their year. And maybe you have because you are treating them like a human in a vast sea of bureaucracy and hold times and institutions, and maybe their family visits them once a week as the only real “human” contact.\n\nI also go out of my way to waive any fees for people because, personally, I care more about people than my corporation and I sort of like the thought of using all the powers I have to help a common human at the cost of my job.\n\nI am in a position where I can even send gifts, so if Theres a customer going through a particularly hard time I’ll send flowers on the companies dime.\n\nI’m not saying this is easy or even makes the job better, but I feel like it allows me to work on my own self as a human being in one of the most demanding trials to do so that exists. So my time isn’t wasted.",
        "created_utc": 1668176979,
        "upvote_ratio": 1.0
    },
    {
        "title": "My coworker just told me, \"I wish you could as sociable as you are on Reedit\" I appreciate her",
        "author": "iminlovewithyoucamp",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yru5s6/my_coworker_just_told_me_i_wish_you_could_as/",
        "text": "It was a nice comment she said to me. How often are y'all on reddit at work? Do yall talk to your co workers? I have zero desire to talk to anyone. IMO, as long as i do my work and pass my metrics. i don't need to talk to anyone. Plus, talking to real people is scary. People can talk about you, or hit you or steal your weed lol the last one was a low key joke but for real tho, how often do yall talk to your co workers? When i'm not talking to customers, i'm on reddit all day.",
        "created_utc": 1668120366,
        "upvote_ratio": 1.0
    },
    {
        "title": "i ran away from work (literally)",
        "author": "patricksayswhat",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yrre9b/i_ran_away_from_work_literally/",
        "text": "im on college, i have told my supervisor before that i could not go on dayshifts. i was so pissed off when she gave me a 2AM-11AM schedule because i have classes at 8AM and 10AM.\n\nOf course, I had to accept it thinking that she had no choice as well. Today, I just discovered something from a teammate, she saw the original schedule and I was actually on nightshift originally, from 7PM-4AM, but my supervisor exchanged my schedule to the my other teammate without me knowing.\n\nOf course, being the bigger person, I just accepted and went on with it.\n\nOn today’s shift, I was on lunch and when I came back, someone is already seated on my station and removed all my things, it was an entitled day-shifter who always sits on where I am during night shift. I hated how I reported it to 3 supervisors but they all didn’t give a single flying fuck about it. They just told me to find another station and log in immediately. I was so pissed off.\n\nI sat on a different station in the back area and as soon as I saw the supervisors sat on their areas, I packed up my things and ran away. I also told myself that I’m not gonna come back anymore and just fake sick and file an immediate resignation.\n\nBut the Christmas pay is already next week, so I’ll just force myself in this job, take that pay, and file an immediate resignation.\n\nDo I have any regrets? NO. Call center is hell. RUN.",
        "created_utc": 1668113297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice on how to play \"Office Politics\" well at a call centers.",
        "author": "iminlovewithyoucamp",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yrogr1/any_advice_on_how_to_play_office_politics_well_at/",
        "text": "I've worked in call centers for over 10 years. I am \"good\" at my job. I can do the tasks adequately enough. I pass my QCs and my AHT is amazing. On paper, I am a pretty good agent. However, i'm terrible at playing office politics. \n\nHow do Y'all play office politics at work?  Are y'all popular or the one that nobody talks too? I'm personally the one that few people talk too but that's because drama tends to happen with me. I get it.  My current call center is actually really good. The calls are easy, we get 20-30 calls a day and we are allowed to be on the internet. Nothing is blocked (which is why i'm on reddit all day lol) This would be my perfect call center except. i'm not well at \"playing the game\" Any and all advice would be received well. Thank You \n\n&amp;#x200B;\n\nTLDR:  How do Y'all play office politics at work?  Are y'all popular or the one that nobody talks too? Any Advice on how to be better with office politics?",
        "created_utc": 1668106901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Came back in today after my day off",
        "author": "Blueangel27",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yrkhtc/came_back_in_today_after_my_day_off/",
        "text": "I have felt off ever since I came back into work. I have been on a roll up until I called in yesterday. My calls today my mind has been blank and it is scaring me. When I was gone for just one day, there was little things sent out regarding aht and quality and the new process we have. I confided in one of my friends that I have been struggling with my aht and that they have been putting more work on us. My friend said they probably fired a bunch of people and kept the good ones including me. My mind just feels blank today and I haven’t been remembering the processes. My AHT has been slipping slightly and my QA is still good, but I can feel the pressure. The friend I confided in said not to be a wuss and keep this job until I find a new one and I can’t just call in like I did yesterday ( I never call in). I’m at a crossroads. I am a good worker, but I think this job is starting to take a toll. I was fine up until yesterday, maybe I just have to get back in the groove. I told my friend if they fire me, I can find another job. I know it would be hard to fire me because I am a good employee but I feel word now. Today I have been doing the best I can but it was not the same effort I was putting in as before. The QA and adherence is supposed to be at 97%. I like this job, but I’m not going to live up to the expectations anymore. What do I need to do next? I think I’m starting to feel burned out, but I need to start job searching before anything happens. I did get a kudos on a call on Tuesday. I don’t know what to do or think at this point….",
        "created_utc": 1668098417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are they trying to can me?",
        "author": "ghostof_lisasbabytoe",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yr0fi1/are_they_trying_to_can_me/",
        "text": "So, I started my current call center job in May 2021. While in training a week later, I tripped over a power cord the trainer had stretched across my path and plugged into the wall. Ended up breaking my elbow, kneecap, and completely tore my ACL (I know...wtf?). I filed for workers comp and my case is finally about to settle. Last month I had a complication to my knee injury and was on LOA for a month. Now that I'm back, I've been informed that I'm going on a \"QA Coaching Program due to being on leave\". \n\nI'm trying to figure out what the correlation is between a medical leave of absence, and a QA Coaching plan? Makes no sense to me. I've never had to have a coaching plan the whole time I've been there, nor any type of dosciplinary actions of any kind. I feel like they're trying to nitpick me to death and find a reason to fire me. Does it sound that way to anyone else?",
        "created_utc": 1668040317,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Experience With Concentrix",
        "author": "Fire_Water_Fiend",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yqzcjv/my_experience_with_concentrix/",
        "text": "Report from r/workonline \n\nObligatory I'm on a mobile and also my second account  so forgive me for any formatting errors.\n\nHello, fellow call center worker I'm sure you heard of Concentrix and all the horror stories that surround it's reputation, now I'm betting your wondering... is it all true?\n\nI say this with unrestrained vitriol and memories containing sleeplessness nights and stress abound!\n\nMostly.\n\n\nLemme explain:\n\n**Start**\n\nHonestly the recruitment process wasn't so bad, I received a few on phone interviews after sending in my credentials and the individual who interviewed me was also extremely polite and professional. They gave me a start date and everything was normal.\n\nEventually I started training and the process itself of learning the ins and outs of working for this company, but besides learning about what I'll primarily be doing which is pretty much being support for a particular company that sells smartphones with a fruit on them, a one thing stood out to me. That being all breaks are not paid and overtime is to be mandatory due to the high call volumes. Little bit iffy but I stomped through it.\n\nTraining was about two weeks and it was generally very pleasant, then nesting was the next week after which was also decent but not terrible. \n\nThen my journey really went downhill and after going through the motions I understood why Concentrix had developed such a bad reputation.\n\n\n**Issues**\n\nSo, Concentrix has a attendance policy and I have had clashes with management regarding the policies and the problems I had with it. Now, the policy without going to specifics has it's own limits so to speak meaning if you call sick you get docked or if you decide to throw in the towel early meaning if you leave early you will also get docked and the time that is missed you get docked accordingly.\n\nI had developed quite a docking experience so to speak,  for unrelated medical reasons I had missed time at work and had developed docks and with that in mind if you hit a certain amount of them you will punished in some ways, maximum punishment is termination and ideally everyone would like to avoid this. But, the catch to this is that you can make back any docked time by not missing a month without any absences.\n\nCatch is to that. Absences also counts for being late, if you are late that time gets reset and you don't make any progress on your docked time.\n\nMeaning, that you could go a whole 29 days without missing a single day but if on the 30th day if you clock in even one second late, that time you wished to make up? Your progress is reset back to the beginning and you are back at day one trying to make up time.\n\nAnd yes I thought this was bullshit and also yes I went to complain to the relevant management and I had confirmed with them that this was the policy and there was nothing they could do. So I got stuck in a cycle of being fearful I would lose my job despite almost perfect attendance. \n\nI should also mention that during my time with Concentrix, I dealt with a multitude of technical issues and had to do the runaround with the various support departments and when asking for assistance from management due to the inadequate service, they kept pointing me back to them, thus keeping me within a another cycle. Only when I threatened to resign did I recieve actual support.\n\n**Tipping Point**\n\nAt this point time being stuck in the cycle I had been actively looking for a new job and began not giving a fuck about Concentrix but two particular incidents happened which tipped me over the edge and caused me to immediately rethink my employment.\n\nOne day, one of my family members had a medical emergency and I couldn't attend work so I proceed to go through the right channels and tell them I won't be at work for a few hours. Then, the emergency while it didn't get worse it required a little bit more time so I yet again inform them that I'll be a late for a little longer. (you don't get docked for being late) \n\nI show during that day for my shift and everything proceeds as normal. I show up the next day and find out I had been docked. I am immediately bewildered as I showed up for my shift and not to mention I couldn't afford being docked further due to termination (didn't want a firing on my credentials) so I go ahead and contact management and eventually they get back to me and this while I'm paraphrasing here, here is what they said:\n\n\"The time you missed on (date) was more then the alloted time allowed for single day lateness. Therefore you are a docked a full day absence. If you have a issue read up on the policy.\"\n\nI was fucking furious, I tried to 'do the right thing' and Concentrix had fucked me for it, I was better off just calling in sick instead of trying to show effort for this job.\n\nSadly, that wasn't the only thing that also made me furious. One day while in the middle of my shift I had received a message from a family member in the middle of a emergency and I had to step away, so I informed management who gave me the all clear to step away so I can deal with said emergency. So, I leave and attend to it then I come back to complete my shift and it's all good for that day.\n\nNext day come back and I get docked for \"leaving early\" I got once again completely bewildered and was able to get into a chat with management this time after I alerted them to this and once again I'm paraphrasing but this what they said.\n\n\"The dock will remain because while you did step away under permission from management we didn't think you'd be gone as long as you did and so you were docked for it. If you're confused read up on our policy.\" \n\n*Management has left chat*\n\nYep. Now I was done.\n\n**Exit**\n\nFew days later I was able to find separate employment and normally I would have stuck it out and just dealt with the politics and the bullshit until I started the new job, but after one particular shitty shift I had just decided to quit. I send my notice to my HR department and I was done I was so unbelievably happy, I took the time I had I spent it with friends and family it was a wonderful break.\n\nThen, a few days later after my exit I recieve a email I check it and it's a HR representative that represents the company not the same one I had sent my notice too. Paraphrasing again.\n\n\"Hello, Throwaway. You didn't show up for work for the last *number* of days, you didn't tell no one you wouldn't be there we tried to get into contact with you but you didn't get back to us. You also, didn't notify anybody about you not showing up during these days gone from work. We are gonna follow our policy and assume you don't wanna work for us anymore, so now offically your fired. If you have anything you wanna say regarding you being gone from work you have until *certain date*. Bye!\"\n\nYes, I got fired after I quit. The hilarity and irony of it does continue to astound me. I got back to said representative and sent them my original notice (alongside proof I had sent it to them) and I said my gripes about them even emailing me in the first place. And that then promptly concluded my time with Concentrix.\n\n\n**Epilogue**\n\nThis is certainly the definition of call center hell in my experience they clearly do not care about their employees whatsoever and whenever there's legitimate criticisms they are downplayed and you treated like a child.\n\nDo not work for this company unless you can follow these policies to a T and are able to devote 10 mins prior to your shift to start your equipment up and make sure you're signed into your punch at the exact time, oh and make sure you're signed into 3 other things as well as it's required before punching in oh and that also takes 10 mins.\n\n\nAll and all I have a new job and I'm happy. I hope you enjoyed my suffering.\n\nBye!",
        "created_utc": 1668037421,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’d rather be punched in the face multiple times all day than to stay at this call center job.",
        "author": "ProfessionalLink4460",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yqrp2z/id_rather_be_punched_in_the_face_multiple_times/",
        "text": "[removed]",
        "created_utc": 1668019599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking half day or whole day due to lack of rest.",
        "author": "Blueangel27",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yqln3q/taking_half_day_or_whole_day_due_to_lack_of_rest/",
        "text": "I don’t take off often, but today I feel lack of sleep. I thought my system wasn’t working at first but come to realize I forgot a step in the process. My gut feeling told me to take some time off to rest. Lately I’ve been on top of my game but been struggling with sleep. I have been going through a lot of changes and also think this would be a good time to take some personal time to reflect and rest and we have been quite busy with new systems. What is your guys take on it?",
        "created_utc": 1668006733,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Paid by the minute, penalized by the second\"",
        "author": "slapchopchap",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yqgvlc/paid_by_the_minute_penalized_by_the_second/",
        "text": "",
        "created_utc": 1667995054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cycling your call.",
        "author": "Kayiko_Okami",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yq3s08/cycling_your_call/",
        "text": "This takes place a few days ago. I actually work tech support for retailer systems. And my phone has a caller ID on it, so I can tell who's calling before I answer. \n\nBusy Saturday, which is odd since Saturdays I normally get 15 calls the whole 8 hour shift that day. I had hours with 20 calls in an hour.\n\nI get this guy yelling that his machines are down. There was a power outage and most of his other machines were back up. To determine if the outlet had power I asked him if the printer button was lite up for the machine. He says he's not on site and puts me on hold, accidentally hanging up on me in the process. \nThat's fine. I'm too busy to wait for him.\n\nBlah blah.. work work work.\n\nBit later I get an automatic call back message. I recognize the name. Busy tone. So I hang up.\n\nMore work work work.\n\nHe calls back finally and he's on site now, or pretending to be. I walk him though restarting the first machine and checking the modem. Machine doesn't power on. Modem is good. Printer is good. Well, dang going to need a tech for that. But first the other machine.\n\nHe hangs up on me again as I'm getting ready to start troubleshooting the other machine. Keep in mind I haven't even got his information to send out a tech yet.\n\nI get at least two more automated call back messages from him too. Let them connect but get no answer.\nWhich clears out my call back que. Also he was rude in each message too, yelling as well.\n\nInstead of waiting in que or just leaving a call back. He called 5 times or more to end up further back in the que. And still might of not gotten his machines back up.",
        "created_utc": 1667954536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cycling yourself.",
        "author": "Kayiko_Okami",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yq35rs/cycling_yourself/",
        "text": "",
        "created_utc": 1667952878,
        "upvote_ratio": 1.0
    },
    {
        "title": "The sitting is killing me! Anyone else?",
        "author": "SnugglyWugglys",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yq1pnx/the_sitting_is_killing_me_anyone_else/",
        "text": "I am a half step away from putting in a resignation notice. I work from home on a line where calls are automatically routed. Three beeps and you have a caller. You are expected to stay on ready/green status for the entirety of your shift. I am basically attached to the headset/computer with essentially no option to accept or decline a call while on ready. This means I can’t really take little breaks to walk around at all. I cut down my shift to 6 hours a day during the week, and I am still having a horrible time not being able to move around. I have gained a bunch of weight, and despite eating less and going to exercise classes, the 6 hours of sitting with no movement is not letting my weight budge. Just venting. I can’t stand this! The only thing keeping me at this job is the flexible hours while I have a young child!!",
        "created_utc": 1667949142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some customers get stuck in their own endless loop",
        "author": "gameofthrones_addict",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ypr9l1/some_customers_get_stuck_in_their_own_endless_loop/",
        "text": "I work in a call center for a utility company occasionally I’ll get a call about a specific issue from more often than not an elderly person.     Typically it comes down to paying their bills.  Customer calls in to complain that we sent them a disconnection notice or a bill that shows they’re late.   \n\nThey are automatically angry because they claim they already paid the bill.   When I inquire about it they claim they sent in a check to pay it.   That method of payment is fine though it’s the method of payment that takes the longest to reach us.  Typically due to its at the whim and mercy of the postal service to have it delivered.   Therefore sometimes it arrives after we already sent out the next bill, weeks after they sent us the check.  \n\nI have to explain to the customers that this is what happens.   They then complain further that it isn’t fair or we shouldn’t threaten to shut off the power due to this.   I further go into detail saying we can’t know for sure the bill is paid until we receive the payment unfortunately.  Even if you claim it is in transit.     Afterward I give the options of other payment methods such as calling in a payment, going online to do so, or even going to a local payment center.   Each option would post the payment on the same day they pay it.   \n\nAnd of course they decline because “I’ve always paid my bills with a check.  Besides, most pay stations charge a fee.”   \n\n\nKnowing that’s gonna be the response I still offer it.  We just have to keep on trucking and they’ll call in the next month to complain about the same thing.   Always stuck in the same pattern of behavior.   I think many people just like to have something to complain about.",
        "created_utc": 1667925006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lazy customers",
        "author": "Ok_Technician6120",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ypp08a/lazy_customers/",
        "text": "I work for a call center, my new team have to call customer out of contract and get them back in a contract. Even through I probably save 8/10 customer money and give them genuinely better deals SO many people just “can’t be bothered” or are “too busy” when in reality I know most are sat doing NOTHING. The laziness of the modern population is crazy it takes about 15 minutes to save £5 a month every month for at least 2 years. Come on customer.",
        "created_utc": 1667920235,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Experience With Concentrix",
        "author": "Throwaway224978",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ypggt2/my_experience_with_concentrix/",
        "text": "[removed]",
        "created_utc": 1667898597,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was terrible at my job and they promoted me for it",
        "author": "New-King701",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yp65kg/i_was_terrible_at_my_job_and_they_promoted_me_for/",
        "text": "I've been a CSR for one of the biggest companies in the world for a couple years now. You know that chart that shows ten companies actually own everything? It's one of those. \n\n\nAt first I was very enthusiastic and wanted to be the best at my job. I took on extra assignments. I tried to learn as much as I could. I tried to make myself invaluable. When we had some open leadership positions, I was sure I would get one. I put in the work, had nearly perfect attendance, constantly volunteered to help train new employees. \n\n\nI didn't get it. I immediately said \"fuck this job\" and started \"quiet quitting\". I was taking zoom interviews for other companies on my breaks. I did below the bare minimum. I was down right rude and unhelpful to customers. I didn't care anymore. I had one foot out the door. \n\n\nNot my boss, but someone in management that I had a good rapport with talked to me and asked what was going on. I explained that I was unhappy and would be leaving soon. That I couldn't see myself here anymore. \n\n\nWhile I didn't get the exact position I wanted. I got a raise and promotion. Not only do I work 100% remote but I never have to speak to a customer again. I review cases and respond to a couple emails a day. I literally do maybe 40 minutes of work in an day. \n\n\nLast week I spent a whole day organizing my garage while being paid to do it. \n\n\nCorporate life makes no sense. Try hard and get nothing. Be a lazy jerk and get rewarded.",
        "created_utc": 1667867769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone ever lost their voice on the job?",
        "author": "throwawayheyhibye",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yp3gnr/anyone_ever_lost_their_voice_on_the_job/",
        "text": "I work for the us dept of veteran affairs in insurance, I lost my voice my manager said if I don’t get a doctor note I’ll get “docked points” (not upset at my manager it’s just our stupid policy). So I’m stuck talking on the phone today and people keep hanging up on me… how does that not look bad for the VA, they hear me clearly sounding sick and working?\n\nMy regular doctor is on vacation, none of his colleagues are available tomorrow. I can’t get into any clinics because I need a covid test first. Fine, whatever. This clinic said they’d give me an at home covid test kit but I can’t come in until Thursday. Went to break to get the kit. Then when I get there they say it has to be some specific covid test which is not the kind they gave me before I come in.. Like wtf am I supposed to do? It’s so cringe taking calls because people can hardly understand me, and I know they feel bad asking me to repeat myself a ton. People keep hanging up on me. Imo it just makes the VA look bad…",
        "created_utc": 1667861417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last Week...(a first timers review)",
        "author": "Tacofan-attic2012",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yp3fbh/last_weeka_first_timers_review/",
        "text": "[removed]",
        "created_utc": 1667861342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a particularly abusive customer today. I saved her phone number and wanna sign her up for as much spam as possible. Give me ideas…",
        "author": "hellopotentialfriend",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yp2rr1/had_a_particularly_abusive_customer_today_i_saved/",
        "text": "",
        "created_utc": 1667860006,
        "upvote_ratio": 1.0
    },
    {
        "title": "He was hiding in his car",
        "author": "Positive-Hedgehog-36",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yp12yo/he_was_hiding_in_his_car/",
        "text": "I work remotely for a health insurance company taking calls from providers (physician, therapists, those who work in physician offices, etc). Most of my calls are claims. This means that callers are calling in to find out why their claim was denied. One time I had a doctor call in who had a thick accent stating all of his claims are being denied. His claims were denied due to missing taxonomy code (this is a 10-digit code that designates a providers classification and specialization. For this particular state taxonomy codes are required on the claim form and if it’s not there the claim will get denied.\n\nWhen the provider first called in he just stated that he hasn’t been receiving payments for services he rendered. In order for me to see what’s going on I need the date of service for the claim and also the billed amount. The provider didn’t even have that. When I asked him to look for it he stated that his nurses would have that information but he didn’t want to go inside because they were upset that they haven’t been paid. He told me he was hiding in his car so he wouldn’t have to go inside. Fast forward he ended up calling one of his nurses and we were all on 3 way and they were stating the taxonomy code is there. But it wasn’t so I advised they need to submit a claim with the taxonomy. It’s sad that he was hiding from the nurses but call me sadistic I thought it was a joke that the doctor was hiding from his nurses. Lol the craziest call ever.",
        "created_utc": 1667856604,
        "upvote_ratio": 1.0
    },
    {
        "title": "inbound call center outsourcing in USA",
        "author": "pbus123123",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yool7h/inbound_call_center_outsourcing_in_usa/",
        "text": "[removed]",
        "created_utc": 1667831335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having fun today",
        "author": "yogz78",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yom2fn/having_fun_today/",
        "text": "There is a customer who didn’t like the answer I gave him this morning, so he keeps calling back trying to get someone else.\n\nHe doesn’t realise there are only 3 of us in our department and we can see the numbers coming through. So I have told my colleagues to leave this number for me to answer. He’s tried 5 times so far, 3 through our department option and 2 going to reception and being transferred. \n\nEvery time hears hello me speaking I just hear “oh ffs” before he hangs up. It’s the small things that get me through the day.",
        "created_utc": 1667825824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I hate customers.",
        "author": "Durbokii",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/yo3a78/sometimes_i_hate_customers/",
        "text": "Had a call today where I was accused of undermining someones disability by asking them questions about their reason for calling, saying how dare I after they were just in an accident and have amnesia. Then I get called sexist for misgendering them by calling them \"maam\" after I ask them to stop screaming but still doesnt tell me what to refer to them as, and then told how its not their job to know the answers to my questions. I work for a dispute center at a major credit card. She was upset because she made one dispute and not 2 and was refunded back the money for both charges... but im still the bad guy for doing my normal job. Caller then calls back and claims I threatened them and belittled them by asking anything to help understand the issue further. She couldnt tell me what date the merchant charged or how much it was or even the name but I was expected to know by reading her mind.",
        "created_utc": 1667769853,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate working for the apron lady",
        "author": "Existing-Bet9145",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ynct5k/i_hate_working_for_the_apron_lady/",
        "text": "[removed]",
        "created_utc": 1667697654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offshore agents",
        "author": "flatbreadpinafore",
        "url": "https://www.reddit.com/r/talesfromcallcenters/comments/ymml3d/offshore_agents/",
        "text": "[removed]",
        "created_utc": 1667631061,
        "upvote_ratio": 1.0
    }
]