[
    {
        "title": "That's not how hyperlinks work",
        "author": "Technopath47",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/11329fa/thats_not_how_hyperlinks_work/",
        "text": "[removed]",
        "created_utc": 1676479307,
        "upvote_ratio": 1.0
    },
    {
        "title": "The last chapter from Acme Corp - We need you to sign this",
        "author": "techtornado",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/112n6xp/the_last_chapter_from_acme_corp_we_need_you_to/",
        "text": "[removed]",
        "created_utc": 1676428088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Angriest Email I ever wrote to any manager",
        "author": "dave999dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/112lzxl/angriest_email_i_ever_wrote_to_any_manager/",
        "text": "This was almost 15 years when I worked for a Fortune 500 company I will call Conglomerate. I had been selected (go me!) to support our division's biggest and most complex client. Our division was split into two halves. My division, which I'll call Boons was by far the bigger and more complex side. Within it I supported 15 or so products. The smaller side, which I'll call Doggle, had about 4-5 products. Both divisions appeared to an outside observer to be remarkably similar. End users got them mixed up all the time. So did our clients. It was like filing a lawsuit in federal or state court. It may look the same, and it often is the same, but there are lots of things that will trip you up if you're not familiar with them.\n\nI was very experienced in Boons. In some cases I was our local expert. By sheer necessity I also understand a fair amount of the Doggle's environment, legalities, terms, processes, etc. But I had zero understanding of their applications. I had never used them or even seen them. I had approached my manager about cross training, but it was something we never got around to. I had plenty to keep me busy, and besides I never interacted with the Doggle's clients anyway, at least not in terms of their products. Clients knew to approach the appropriate representatives most of the time, and would typically understand if they were gently redirected.\n\nThen I got the big new client. By chance their enrollment with us happened at roughly the same time that Conglomerate rolled out this new idea that we would all work together. We would work as one seamless entity. Every division, and every group within the same division too. I will go to my grave not understanding this edict. It was employed relentlessly in our marketing materials and in our internal cheerleading. For years. Aside from that, nothing else was ever done. At least not at a level where I could see it. It was like a coach showing up before each game to make a passionate speech about \"trying harder,\" and then leaving immediately to cruise the streets with the top down.\n\nSo we all kept on as before, sometimes working well together congenially, sometimes spitting in each other's face. I once had a division tell our mutual client that an issue wasn't their problem, and they should \"call Conglomerate.\" Uh no, *you are Conglomerate*. I don't care that Conglomerate bought your company just a scant three years ago. You are now Conglomerate, just like me. Let's not piss in each other's faces please, at least not in front of the client.\n\nBut big new client took this to heart. This \"you can contact any of us about any issue at any time\" made a big impression on them. It's one of the reasons why they picked Conglomerate as a provider. So they started contacting me about anything. And I mean, anything. I once chased an opaque line item on one of their invoices for weeks. Since their time zone was about 3-5 hours behind mine (depending upon the office), I would often come to my desk to find a bunch of new tickets waiting for me, filled with head scratchers and wild goose chases. \n\nNormally this contacting me about stuff I knew nothing about was a minor nuisance. I grew comfortable flipping them over to the right person. They also learned pretty quickly that it was all a myth (which infuriated them, but they had already signed the contracts and migrated all the infrastructure, so what could they do?), so the pile waiting for me shrunk over time. Except for one particular issue.\n\nSince they thought of our division as one big product suite, why shouldn't I help them with Doggle's products? It's the same thing isn't it? This caused a lot of problems since Doggle questions could be time sensitive, where they needed to make decisions that day, so they wanted a response same day.\n\n1. Since they were hours behind me, They didn't get to their desks often until it was around noon my time.\n2. The Doggle staff was on the East Coast, hours ahead of me. And they normally left the office a little before 5 PM their time.\n\nThis left me about a 1-3 hour window to call Doggle and get them on the phone so they could provide the expertise the client needed. If they called after 5 PM Eastern, I would have to go through the on-call sheet for Doggle.\n\nGoing through this exercise was maddening. Their representatives would routinely not answer the on-call phone, tell me that I should help the client, refer me to other coworkers, say they don't have their laptop, say they've only been on the desk for a few months and don't feel like they can help, etc etc etc. Any and every excuse you can possibly think of I heard. It often took 3-4 hours for me to find someone who was willing to help them.\n\nThis was particularly frustrating when our operations center would call my on-call phone, *just so I could contact Doggle's on-call staff to help the client*. That at times would mean I was playing phone tag for hours, from my house, in between trying to look after my kids. There was one person who would actually respond if she was on call, who I will call Taneesha. She too had kids and often took these calls while trying to juggle family life and helping big client. Often she ended up being the person who was finally tapped to help even when she was not listed as the on-call resource.\n\nThis situation went on for almost a year while I routinely whined to my manager, occasionally commiserated with Taneesha, and also tried to speak with Doggle's support manager. It only took that long for me to realize why the client kept calling me. It was simple. *I was answering my phone.* Except for Taneesha, no one else was. It was that simple. That was the reason. That epiphany prompted me to send the angriest email I ever sent to any boss. Particularly one I otherwise liked and respected.\n\nIt began with 72 point font in red capital letters saying \"CAN WE TALK ABOUT THIS PLEASE? DO I HAVE YOUR ATTENTION? I SAID DO I HAVE YOUR ATTENTION?\" And then a long stream of consciousness rant about how Doggle sucks! The manager of their staff should be fired! Taneesha is the only one there worth anything! They should double her pay and fire everyone else! There are no repercussions for Doggle staff blowing off me! Blowing off our client! Why the hell is Operations calling me and not Doggle regarding Doggle products! Which can only truly be supported by Doggle staff! Can you riddle me that? Can you?\n\nThe email to my manager got a one sentence response. He would look into it. Shortly thereafter the responsiveness from Doggle support improved. However, karma also struck in that Taneesha quit. She told me the main reason was because it seemed like she was doing all the work for their team. Which she was. Which pushed her to find a better job.\n\nSo, Believe it or not, the big client once again went back to reaching out to me, and telling operations to reach out to me, because the Doggle on call staff were worthless. Couldn't they talk to Taneesha? No, you can't. So they hired someone new, in my time zone, specifically to help support clients further west. Someone who sat next to me at work, knew his stuff, and had a decent work ethic. Yahoo!! After that, they stopped calling me. \n\nSo my manager eventually came through. I had come to respect him and I'm certain he was spitting fire just like I was, behind the scenes though. On the other hand, shortly after all this happened, the manager of Doggle support was promoted. There is no justice.",
        "created_utc": 1676424439,
        "upvote_ratio": 1.0
    },
    {
        "title": "They Didn't Catch The Phish",
        "author": "Alitazaria",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/112lhzo/they_didnt_catch_the_phish/",
        "text": "[removed]",
        "created_utc": 1676422933,
        "upvote_ratio": 1.0
    },
    {
        "title": "I lost access to my Yahoo account",
        "author": "chiheb_22",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/112ddmy/i_lost_access_to_my_yahoo_account/",
        "text": "[removed]",
        "created_utc": 1676401688,
        "upvote_ratio": 1.0
    },
    {
        "title": "“It won’t import, it keeps giving me an error”",
        "author": "ginger-inside-007",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/112belz/it_wont_import_it_keeps_giving_me_an_error/",
        "text": "Old story of mine. Female in IT. This was when I was about 2 years with the company I worked for. I would assist clients setting up their new MFP devices to the network onsite. This is about one particular client I disliked visiting. I worked with when I first started and found out they were going to be a problem. The IT group at this place thought highly of themselves. I think that came from the liquid courage they kept in their desks, no joke and everyone there knew. None of them cared for me, would say they didn’t need help, but cried for it until I showed up. I’d directed them what to do, then it worked and they shoved me off like they fixed it.\n\nThis time, we’re replacing their fleet. Export/import settings. Like many MFPs back then (some still are), their files were specific extensions and needed the file name formatted properly to import so it could recognize the file. During the replacement, the main IT guy wouldn’t let me view him getting the files as I physically swapped MFPs old for new. Security reasons. Fine. You do what you’re doing, I do what I’m doing. I reminded him at least 5 times when he was exporting to not change the file name because it has to be specific. Since there’s many MFPs, create a folder and name that. “I know what I’m doing, I don’t need you to tell me how to do my job.” Every other word was a cuss word. Ok!\n\n10 minutes go by… “It won’t import, it keeps giving me an error.” I tried to look over and he snapped at me. “I know what I’m doing, your machine doesn’t want to take it. You can’t look at the screen due to security.” He cusses, blabs, whatever. Reminded him of the file format again. I did my part, so I sat down opposite of him as all new are in place. 20 more minutes go by and he finally gets up and goes to his office to check his computer, cussing at me as he walks away. So, sir… let’s see why you’re having an issue since you failed at locking the PC for security reasons. Good job, buddy. Also, I had other clients to get to. There wasn’t anything on the PC opened, just web UI.\n\nFile name format - wrong. Shocked face. He added a letter that was to represent the location. I deleted the letter, uploaded the file in the correct file name format, and kept the confirmation up on the screen when he returned. I sat away from the PC, waiting for him. “Hey, it worked.” He acts like he did it himself. Next one. Nope, won’t work. Same error. I repeat about the file name. He yells at me. At this point, my patience ran out, I was tired of being cussed at, and wanted to get away from that place. I stood up, walked over, he flipped, I told him to move if he wants it fixed or I was leaving. 5 minutes and a lot of yelling from him, he finally moved. I deleted the last letter in the file name. “Import it,” I said as I walked away from him. He looks at me like I’m insane. He imports the file. “Look at that, it works!” I exclaimed while gathering my stuff. “What did you do?” He’s looking for logs and info. I started walking away. “Fix the file name like I told you and you’ll get your info into the new machines. Have a good day.” I headed out of the department and to the front. He cussed me out all the way up to the front door. I smiled, waved at the front desk lady to say bye and looked at him and said “you know what you’re doing. Good luck.” I walked out.\n\nHe apologized to me 5 years later during their next upgrade.\n\nFile name format is no longer a thing with the MFPs after that model series. He still sorted them into folders, not changing the name.",
        "created_utc": 1676396805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Successfully referencing the Princess Bride in a meeting",
        "author": "_wjaf",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/111nhfi/successfully_referencing_the_princess_bride_in_a/",
        "text": "[removed]",
        "created_utc": 1676330913,
        "upvote_ratio": 1.0
    },
    {
        "title": "End user does not know how to ask questions to colleagues.",
        "author": "snekbat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1119c28/end_user_does_not_know_how_to_ask_questions_to/",
        "text": "[removed]",
        "created_utc": 1676298005,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think a user might be too embarrassed to talk to me",
        "author": "polandreh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1117y1f/i_think_a_user_might_be_too_embarrassed_to_talk/",
        "text": "At my work, we have two technology teams: Desktop Support, and Systems Support. Since we're understaffed (who in IT isn't, right?), we have visibility of both ticket inboxes since sometimes we can assist each other with small incidents.\n\nI work in Systems, and I have my roster of \"regulars\" with whom I interact almost daily, and most of the current Operations staff knows me, since I'm also the DBA for our main systems. My friend works in Desktop, and he deals with all the new joiners, setting up the accounts, handing down the hardware, etc., as well as regular support, so *everybody* knows him.\n\nAbout 6 months before this... \"incident\", a new joiner started, let's call her $user. My friend set her up, but as with every joiner, he had to help her navigate the company portals, registering user accounts, setting passwords, RSA tokens, mailboxes, etc. Having visibility of the Desktop Support inbox, I saw $user's name pop up many times, so I knew about her before ever meeting her. Also, $user isn't in Operations, so she hasn't met me.\n\nOne Friday, most of the office is WFH, including my friend from DS. However, $user would need some help getting her Bloomberg account setup, so Thursday evening, my friend tells me \"$user will be coming to the office tomorrow to set up her Bloomberg account. Can you help her log in the Bloomberg terminal?\" Cool! Easy peasy, lemon squeezy.\n\nFriday morning, $user arrives and asks \"are you $polandreh? I was told by Desktop Support to come see you for my Bloomberg access.\"\n\n\"Ah, yes, let's have you log into the terminal and set up your credentials. Shouldn't take more than 2 minutes.\"\n\n$user sits down and enters her details while Bloomberg is registering her new account. I'm sitting next to her, doing my own thing on my laptop. While she's there idly waiting, she tries to engage in small talk: \"So, I haven't met you before, you must be new. When did you start?\"\n\nI just side-eye her and quizzically smile: \"I've been with $company for 4 years.\"\n\nI just see her freeze and go quiet. Bloomberg confirms she's been registered as a new user. I tell her \"That's it! You are now set up. If you have any other issues, don't hesitate to email Desktop Support.\" $user leaves and never interacts with me again...\n\nNot even after she started needing help from Systems, preferring to go directly to my junior colleague than to email us directly. Safe to say, I think she's still embarrassed about that and doesn't want to risk having me pick up her tickets. Junior colleague is currently away on holidays for 2 weeks. $user still refuses to come to me for help, I think she's waiting for Junior colleague to return.\n\nOh well...",
        "created_utc": 1676294041,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Don't worry I will not forget my password again, I wrote it on this piece of paper\"",
        "author": "NotAnOwl_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/110dm4o/dont_worry_i_will_not_forget_my_password_again_i/",
        "text": "Just had the call no one wants to get at 6AM on Superbowl Sunday, the guy working the early shift forgot is password (actually it was a fuckup we did on his account, poor dude)\n\nMy question regarding the title is what is a good comeback to this? Obiviously, lost password dude only wants to get his day done without any trouble, including talking to me at 6AM. What I am struggling with is the fact he should not be doing this however at the same time, as soon as we end the call he will done whatever the fuck he wants to get his day done without any trouble. \n\nI always find a little humor goes a long way to pass the message, I often go with \"Whatever you do when we are not talking on the phone is on you ;)\" but I would still like to be more clear that passwords should NEVER be written down.",
        "created_utc": 1676201246,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the problem isn't the customer",
        "author": "1Mandolo1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/1100dm8/when_the_problem_isnt_the_customer/",
        "text": "Obligatory on mobile, so excuse bad formatting please.\n\nFor context: I work for a small software company that runs their products on-site for customers in a specific niche around the world. I'm gonna be vague for obvious reasons, but I'll change jobs soon so I don't mind that much if someone finds out it's me.\n\nCharacters in this story:\n* yours truly\n* The customer\n* Our head of support\n* Another dev\n\nThis happened earlier today.\n\nSo, this week I have hotline duty. That means, when our daytime support is done for the day, support calls get redirected to my phone until they take over the next morning, and for the whole weekend.\n\nThis nice Saturday afternoon, I get a call from a gentleman (C) with a bad connection and a thick, but not completely incomprehensible accent - still a bad combination. I barely understand what he's trying to tell me, but he seems miffed about the fact that \"we already sent two E-Mails\" (policy in our support contracts is you call to notify support, THEN you E-Mail details if necessary). There is some problem with data not showing up in our system, so I say I'll take a look at the mails and get back to them.\n\nI boot up my work laptop and take a look. The E-Mails are basically just a data dump from their business end of a data transfer process.\n\nSome more context: Our software is highly customised for different customers. I have not dealt with this particular customer before, so I'm not familiar with the inner workings of their particular flavour of our package, but support staff recently added common support cases to each customer's wiki page. I get lucky and the current problem seems to be similar to the one currently happening. I connect to their system via VPN and take a look.\n\nThey seem to dump data in a transfer database table which is then collected by our system and put into our database according to our model. Some datasets are marked as successfully transferred, but do not show up in our system.\n\nI restart the transfer service and mark the records as not transferred in the transfer table. The customer checks and yes, now the records are there.\n\nI'm not the best with these types of things, so figuring this all out and fixing it took about two hours. Overtime pay semi-well-earned.\n\nI figure there might have been some network hiccup, but I get a feeling that it's not and this will not be the last I'll be hearing of this.\n\nLess than 3 hours later, I get another call. Same issue again. Okay, probably not a hiccup. Customer also tells me that they have lots of data coming through the next day (yes, a Sunday, but the customer is in a country where that's basically the equivalent to our Monday) so we can't just manually adjust until main staff gets back to work the day after that. Damn.\n\nI call our head of support and ask him whether he has any idea how to solve this. He doesn't, but he knows who has the most knowledge of that customer's code. I call him and to my relief, he picks up even though it's a Saturday.\n\nWe take a look together and it's just weird. Some records are there with fitting IDs, but different data, and we just get more confused as we look through the stuff. How does this stuff get transferred, but not transferred? We come to the conclusion that there are some crossovers between IDs, but since our system is strongly typed, we determine that the records that have been reported by the customer to not be visible despite being marked as transferred, have in fact not been transferred - no data in the database, no trace in the logs, nothing. But what went wrong? Did the customer put in corrupted data? Did our service mark the data wrong?\n\nOther Dev suggests we get on a Teams call with Customer, and I'm completely out of my depth by now so I have no objections. They talk for a few minutes, and then it hits my colleague.\n\nYou see, we have productipn servers and test servers. But because customers usually don't replicate their environments for our test systems, tests are often done with connections to live external data. You might see where this is going.\n\nThe same data collection service picking up data in the live system also ran on the test server. With the same configuration. And whenever a new record was put in for transfer, whichever of the two hit their refresh first would pick it up.\n\nAt that point, my colleague apologised profusely to me and told me to get out of the call, he'd handle it, for he was the one who had handled the tests and configurations.",
        "created_utc": 1676156017,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I...undelete?",
        "author": "WizardOfIF",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10zvhyq/how_do_iundelete/",
        "text": "[removed]",
        "created_utc": 1676143187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for a job at an it consultancy firm",
        "author": "alkanord",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10z9rgw/applying_for_a_job_at_an_it_consultancy_firm/",
        "text": "My first job as it support engineer was at a local it consultancy firm. They made sure that the person they interviewed where informed that they had people placed in top 100 firms.\n\nSo the interview starts through teams and the 2 persons on the other side didn't have there webcam turned on. I tried telling them that the issue might be a slider or button, if not maybe a faulty setting.\n\nThey absolutely did not find the source of the problem!\nSo they take another laptop to continue the interview. \n\nWe go back and forth, thay ask a bunch of \"technicall\" questions (stating that i had absolutely no experience in the field or on paper they asked me very simple questions (workings of a switch, what is html, if you encounter ... what do you do)\n\n4 months later i start working there, first day i started talking to the person i asked what the problem actually was.\n\nGuess what:\nSlider.\n\nThe person that took my interview didnt know a lot about pc's and I had to help her every week or so. She was kind so i guess i did not mind it at all.\n\nLeft the company for another job (same field so A LOT more stories to come (not joking i have seen my share))",
        "created_utc": 1676082093,
        "upvote_ratio": 1.0
    },
    {
        "title": "It was working until you arrived!",
        "author": "UrFriendlyTechGuy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10z0ql9/it_was_working_until_you_arrived/",
        "text": "  \n\nI'm a VoIP Installation Specialist for a large company. We help with phone solutions and IT solutions for all kinds of businesses. I mainly focus on VoIP support/helping customers with their phones, but occasionally I like to help with I.T. support as well. I love my job and I pride myself on my customer service skills. \n\nWe recently acquired a small phone customer in our town that we already did IT support for. I had been to this client's place before our phone contract to work on their network and fix a computer. It was maybe a dozen phones that they needed. I got them set up and got their phones ready in no time.  The point of contact (we'll just call her POC) at the business was bit lost when it came to anything IT or Phone related and she was also very rude to IT guys, especially me.\n\nThe install process is easy. All we do is hook the phones into their network and possibly attach a power supply if they don't have PoE. My phones are already provisioned before I go onsite and have all the settings ready. Again, it was small install of about a dozen phones, so it was going to take no time and no hassle since I already knew the layout of their building.\n\nI didn't have to make any changes to the phones at all or the network while I was there. It was essentially plug-in-play. I was midway through the install and on the other side of the building when POC calls an employee close to me and asks, \"Where is urFriendlyTechGuy?\". The employee explains to her on the phone that I'm installing phones on their side of the building. POC is on speaker. I could tell she was frustrated.\n\nPOC: \"He needs to get over right now and fix this.\"\n\nI respond to her and say I’ll be right over and that I’m happy to help. I walk over to her side of the building and immediately as I walk in the door she says, \"What in the hell did you do to our network?\" Confused, I tried to assure her that I hadn't made any changes and that I was just plugging in phones.\n\nPOC: \"Well I can't access my *special software.* I don't have internet!\"\n\n (I won't say the name of the software she was using so I'll refer to them as \"Special Software\" because I don't want to seem like I'm dogging on the software. The software company was just experiencing an outage on this day.)\n\nI told her I would look at it and see what's going on. She made a smart remark about how it stopped working when I got there. I ignored her comment while I looked at her computer. She still had internet service, but her special software was not working. I could access other sites with no problem. I even called another I.T. tech from my company and he tried the special software site from the office, and it wouldn't load. We called in to the company that manages her special software and their main message said they were currently experiencing outages.\n\nI told her about their outage and she flipped her lid on me. \"This is your fault! It was working all day with no issues until you arrived.” She said to me in a very mean tone.\n\nI politely and calmly responded, \"You're right. Because me plugging in phones on the other side of your building would affect your special software’s servers to go down, right? I won’t be spoke to this way.\" \n\nShe got quiet after I said this because she realized how stupid she sounded. I immediately left her office to get into my car to call my supervisor to explain the situation to him. He knew she had been a \"problem child\" before based on what other techs had told him. He advised me to go wait in my car and he would be calling me back. About 15 minutes later, he called me back and he told me to come back to the office. He politely declined to provide them anymore service unless she apologized to all our techs who she had yelled at or been difficult with. Apparently, she had said some pretty rude and harsh things to another tech one time when ISP went down. She sent us an email a few days later apologizing and asked for us to come back to finish the phone installation. \n\nShe left their business shortly after that and we continued to service them. The relationship with the business is much better now.  It feels good to know that we could continue the relationship with this client even though the previous POC tried blame everything on us.",
        "created_utc": 1676057643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tenable",
        "author": "ZebraBorgata",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10yww28/tenable/",
        "text": "[removed]",
        "created_utc": 1676048180,
        "upvote_ratio": 1.0
    },
    {
        "title": "My laptops charger is defective, I need a new one (Or: Yes, everything is plugged in!)",
        "author": "Interesting-Gear-819",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10yshio/my_laptops_charger_is_defective_i_need_a_new_one/",
        "text": "Nothing fancy, minor story that just happened 10 minutes ago.\n\n  \nWe have a $User with a cheap dock and a few year old laptop since $User isn't working full-time and sometimes from home (y'know. Kids and all that). The dock requires an external power supply for the laptop.\n\nAnyway, today $User is in the office. Get's a pop-up that the internal battery is down to 6% and obviously calls us, which is .. correct so far. Knowing $User and how often they plug-in and pull-out the cables, my first intention was to ask/check if all cables are correctly set/pushed in (Hint: They were not).\n\nSo $me asks $user to check if the cables are plugged in and if maybe someone pulled the cord/plug out under the table, maybe to charge his phone or so (happened..). $User accepts, calls back a few minutes later that everything is as it should be.\n\nIt's friday, so I'm in a rather good mood and believe it. Pull out a new charger and start my journey. On location $User, saw the new charger and happily accepts the \"situation\" and leaves to talk to another colleague (I could hear the chit-chat and .. prefer that over users that look over your shoulders). \n\nTook a quick dive under the table, followed the cord, checked if everything is plugged in (it was) and at last checked the side of the laptop if it's plugged in too. (It wasn't. It was half-way out).\n\n$User now believes they have a fancy new charger and I can close that case and had a few minutes of fresh air / walking. Win/Win, I guess? At least on a good day, they all were not unfriendly like on some days.",
        "created_utc": 1676037022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad review for answering a question",
        "author": "sweetcreature1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10y3yf5/bad_review_for_answering_a_question/",
        "text": "[removed]",
        "created_utc": 1675971495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't access any network drives...",
        "author": "Throwaway156469",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10y3iot/cant_access_any_network_drives/",
        "text": "Just had a ticket that took nearly a week to resolve that I still can't believe. \n\nI work for a third party IT company (Company A). One of our clients (Company B) had an employee we will call C. I had just set up a new laptop for C to use after her previous one just decided to hit retirement early. I physically met her at their office, confirmed she could login, confirmed she could map and access her network drives, then went on my merry way.\n\nPanicked calls the next day about how she cannot access her network drives at home. They use a third-party VPN to access on-prem resources (including active directory) which I know worked fine since I configured and tested it off-site prior to delivery.\n\nWe couldn't even enter the direct name of the file share on the network. Nothing we were doing was getting her access to her network drives while on her home network. \n\nThen I finally managed to get this error \"the domain controller could not be contacted for the authentication request.\"\n\nCheck her network settings and yup, there it is. Her home network was using a nonstandard subnet (for a home at least)... Which happened to be exactly the same subnet as Company B's office intranet.\n\nThe only reason we found out now was because upon giving her a new laptop, when her home router assigned her an IP address, it happened to give the exact same IP address as the domain controller...\n\nHer computer techy husband fixed their home network. She is fine now.\n\nBut seriously, what are the odds...",
        "created_utc": 1675970507,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Why do I have to switch user every computer I go to\"",
        "author": "DiAOM",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10xayyl/why_do_i_have_to_switch_user_every_computer_i_go/",
        "text": "Hey all, I am just ITsupport(First year in IT will be in 1 month) and do my best but my no means am I experience or know a bunch like most of you LOL. But today was the first time I have had a situation come up that I felt I wanted to share and my first time posting!\n\n \n\nSo, I work at a credit union, a ticket got placed detailing the struggles of a manager having to always log off and lose where they were at in order to login to help out the tellers up on the line. Then they pointed out that their \"switch user\" button was gone. Some info to preface the rest; we are in a VMware environment and push all their computers out to HP VM's for some good reasons, one of them might be painful to know, THIS exact situation! VM's are a very good solution if you have to move around a lot and dont want to have to log off, just a roaming profile and you can go login at any station and pick up where you left off. We as of July had upgrade from Wyses to HP ThinClients and I had to go to all of our branches and set them up, explain new features, how to use them, etc. (so I have directly discussed this already with said ticket customer.)\n\n\\-------\n\nMe: \" Hey anonymous! I saw your ticket. So the new HPs we put it were to actually get rid of the \"switch user function\", you no longer have to log out to move anywhere. You just login on a different pc and itll pull your profile wherever you are! \"\n\n\\-------\n\nAnon customer: \" So it looks like other users still have the switch users but mine doesn't.  I thought the only way for Anonymous(new core) to recognize printers is that we have to do switch user............. When did we get new HPs? \"\n\n\\-------\n\nMe: \"so no switch user, no disconnect/logging off.  If you go to the TellerLine just login again and itll log you out of wherever else you are and pull it to the TL. The HP's are the black boxes that are on your desk I came in before conversion and set up at all the branches! I was in your office with you as I set it up to ensure it was to your liking. \". \n\nBeing professional, I left out the bit that the day I set them up was the same day I trained them on this exact topic and how doing it through switch user can actually now sometimes cause problems....and the 4 emails we sent out as a department covering this....and the allstaff meeting we had to ensure everyone was ready for this change.... and finally, it was my pinned teams message the entire time \"When switching TC's ensure you log out of AnonSoftware before calling IT\"",
        "created_utc": 1675890824,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I asked her to reboot, she got it half right.",
        "author": "O-U-T-S-I-D-E-R-S",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10xa414/when_i_asked_her_to_reboot_she_got_it_half_right/",
        "text": "Reading another tale of someone switching off the monitor and saying they've rebooted reminded me of this tale from a long time ago in a job far, far away.\n\nThe error reporting system was down so it was everyone calling for everything day and all of us on the phones only.  I cannot recall what this lady's problem was but I recommended a reboot, which yes, I had to explain meant turning the computer off and back on again as yes, she turned the monitor off usually.\n\nI knew things had gone wrong when I heard the phone being put down.  She came back to the phone to say that she had switched the computer off but couldn't switch it back on again.  It turned out she turned it off at the mains and (amazingly) it didn't switch back on when she switched the mains back on.  She then wanted to know where on the PC the power switch was.\n\nShe was in the building and I was about to go upstairs as she didn't get that I couldn't describe exactly where the power button was (loads of different PC types) - but thankfully a colleague of hers was technical enough to locate the power button for her.",
        "created_utc": 1675888830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell Me you needed that server after we decommissioned it!",
        "author": "Weebitski",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10wy3kl/tell_me_you_needed_that_server_after_we/",
        "text": "  \n\nYears ago, we had a project to get rid of zombie servers.  (Zombie servers, besides wasting resources can be taken over by bad actors, but that leads to a tale for cyber security) Anyway, what would happen was that people would set up a server.  Then just forget to decommission it. We did an audit and took note of servers that were not being used and we communicated the best we could with the known server owners. After a couple of months, we removed the servers from the network. Then we let them sit for a couple of months. Occasionally a customer would say, hey, where did my server go?  And we tell them to keep better track of their equipment and put it back in service. But most of them were abandoned and we would decommission them. The number was in the thousands. Probably 10% to 20% of all the servers we had.  One server got through this process, and we were in the process of decommissioning it. We had removed the disk array and were starting to wipe the disks. I think it was RAID 5. Lo and behold, the customer calls up all in a panic. Seems they needed that server once a year. And we're all like, Gee, don't you ever read your emails? Oh, also they did not have a backup. Real smart for a critical server that you use once a year not to have a backup. We found a company that could recover the raid array. We removed The disk array from the server. From our scrap pile, we kludged together a couple of old computers. With a raid controller. And connected them to the Internet through a secure tunnel. This enabled the vendor to recover the data. It took them a day or so, but they were able to do it. The recovered data was copied to a USB hard drive. While the recovery was in progress, we rebuilt the server with a new array. We didn’t want to touch the original disks just to keep our options open. We went to copy the data back to the server, but all the server had was a USB 1.0 port. It was going to take forever. Fortunately, there was a Microcenter a few miles away and one of the guys races over there before they close, because you always find you need stuff with minutes to spare.  He got a higher-speed USB card, installed it, copied the data back over to the rebuilt server, and got the customer back in service.",
        "created_utc": 1675866557,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Share Audio On AirPods and Beats Earphones",
        "author": "MillerEmma90",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10wwaak/how_to_share_audio_on_airpods_and_beats_earphones/",
        "text": "[removed]",
        "created_utc": 1675861765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easiest (and funniest) $300 I’ve ever earned",
        "author": "casguy67",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10wuv6p/easiest_and_funniest_300_ive_ever_earned/",
        "text": "[removed]",
        "created_utc": 1675857559,
        "upvote_ratio": 1.0
    },
    {
        "title": "That time the USB stopped working.",
        "author": "lemachet",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10wkr8f/that_time_the_usb_stopped_working/",
        "text": "This may or may not have happened recently. \n\n A client had just moved offices. It was a pretty simple operation. Two Windows 10 computers, two HP USB connected printers (one to each), a NAS and a modem &amp; switch. Pretty bog standard, my 10 yo could probably do it in his sleep.\n\n&amp;#x200B;\n\nClient physically disconnected and got the PCs relocated. We came in and did the reconnection, set it up on the desk, hooked it all up. VGA to VGA, Ethernet to phone, phone to wall, all the usual. \n\nConnected the NAS drive. Spun up the Internet. All going great. Just one final thing to do, plug in the printers and do a test print. Gotta make sure there's nothing wrong, we can get out of here quick smart and it's a fixed price fee, so we'll have better margin. USB cable from PC to Printer. At least it's one of those square ones, so i don't need to flip it three times. Still, it's like fumbling around in the dark your first time, just gotta find that right spot.... there we go.\n\nWon't print. An error occured. Checked the drivers. Ok. Changed USB ports on the back of the computer. Ok. Doesn't make that little dun-dun noise. Weird. Tried the printer in my laptop. No dun-dun. Hmm. \n\nGrabbed a spare USB cable. Plugged it into the USB port on the computer, unplugged the existing one from the printer, plugged this in, more virginal fumbling. No print. WTF\n\nStarted getting in the weeds. Removed drivers. Deleted USB001 from the registry. Checked for all known issue, started reading up on usb printers and windwos update issues. Started removing those.  By this point, was focussing on just one computer, figure if I fix that, i'll probably know what to do on the next. \n\nInstall BIOS update. Reboot. Check for windows updates. No we don't want Windows 11 because LoB doesn't support it yet. Start frustratingly mumbling to myself and going over things. The principal has, by this point, gone for a long lunch. Can't really blame them, but the offsider is over there, working away. \n\n&amp;#x200B;\n\nSuddenly, I hear the printer on the other PC spring to life and start printing. W. T. A. F. Turn and look at them, \"You forgot to plug this in.\" User is holding up a grey USB cable, they'd plugged into the printer. Above the black USB cable I'd also plugged into the printer. Only, they called it \"the network cable to my printer.\"\n\n&amp;#x200B;\n\nNo less than 6 times, did I plug a square USB plug into the ethernet socket on a printer. Completely ignoring the socket above it, which was /actually/ the USB socket. There's definitely no ethernet in use on these printers. When the user said 'network cable' - they meant USB cable. I was, clearly, just stupid that day.\n\n&amp;#x200B;\n\nThe user had a laugh with me; we told the principal \"Uh, yea, a Windows update last night broke the USB on both the computers\" and went on my way.",
        "created_utc": 1675823351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got Payed 90$ to log into a users computer",
        "author": "MrLookeyLuc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10wbfnw/got_payed_90_to_log_into_a_users_computer/",
        "text": "It was Sunday afternoon and I was watching football and got a phone call from work, apparently some one was having trouble logging into the PC and I new what the problem was. This was a shared computer so I new that this person was logging into the wrong account. \n\nI tried over and over again to tell him change the Username to the following and he just kept saying I did it doesn't work, I DID IT DOESNT WORK! Just come and look at the computer its broken. He refused to try anything I told him.\n\nSOO.. i then drove to work walked up to the users computer and changed the log in, like i requested on the phone and put in the password, took all but 5 seconds. He then proceeded with saying \"How did you do that?\" and I said i changed the log in like i told you to do on the phone, and he said \"I Swear I did\" I said nothing to him and just walked away and went home.\n\nLuckily my work pays an automatic 4 hour pay if I have to go to work after hours, and you bet that I made sure i got that money, imagine getting payed 90$ just to log into a computer.",
        "created_utc": 1675799958,
        "upvote_ratio": 1.0
    },
    {
        "title": "IT Guy Becomes the $User",
        "author": "SpongeJake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10w6uao/it_guy_becomes_the_user/",
        "text": "[removed]",
        "created_utc": 1675789165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skipping the \"Trust\" in \"Trust but verify\" saves so much time",
        "author": "dlongwing",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10w3er9/skipping_the_trust_in_trust_but_verify_saves_so/",
        "text": "So it seems I'm back on the helpdesk queue again. I work for a small shop. We lost our T1 guy, and until we get someone new onboard, we're all keeping an eye on the queue.\n\nI get a gem of a ticket from one of our \"frequent fliers\". We call them Lightbulb, because we'd like to swap the flickering component with one that's actually bright. This is a person who shouldn't be allowed to use a computer, so I always take a little extra care when dealing with their tickets.\n\n\\-------\n\nHi IT team,\n\nThis is an urgent request as it affects my daily job.  File manager keeps crashing and not able to stay in files for very long.. I’ve rebooted several times this morning.\n\n(Includes unhelpful screenshot of open file folder)\n\nPlease help,  \nThank you,   \n$Lightbulb\n\n\\-------\n\nHi $Lightbulb,  \n   \nThank you for taking this initial troubleshooting step. FYI, while one reboot is a great first step, if one reboot doesn't fix the problem than additional reboots aren't likely to improve the situation. I'm just letting you know so you can save yourself time in the future.  \n   \nI've applied a fix to your system. Now that I've made the change, I'd like you to reboot by following these specific steps. This is important for the fix to apply:  \n\n\n1. Open the start menu in the lower left corner of the screen\n2. Select the Power icon from the lower left corner of the start menu\n3. Select restart from the list of available options\n4. Allow the restart to complete\n5. Test the issue again and let me know the result\n\nThanks,  \n$Me\n\n\\-------\n\nINTERNAL COMPANY NOTE\n\n&gt; I've not made any changes. I'm just making sure that \"Rebooted several times\" doesn't mean \"Closed the lid and opened it again\".  \n   \nIf he replies back that the problem is still occurring then I'll do actual triage. \n\n\\-------\n\nHi $Me,\n\nThank you so much for your help.\n\nIt seems to be working now.\n\nWill let you know if any issues come back.\n\nThanks,  \n$Lightbulb\n\n\\-------\n\nCLOSE TICKET\n\n&amp;#x200B;\n\nMy boss saw the ticket and the updates. I thought he was going to tell me not to be so cynical towards our users, but instead we all had a good laugh about the outcome.\n\nI know they say \"Trust but verify\", but skipping past \"Trust\" and right to \"Verify\" saves a ton of time.",
        "created_utc": 1675780714,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Are you SURE you're putting in the right password??\"",
        "author": "queendogma",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vun7y/are_you_sure_youre_putting_in_the_right_password/",
        "text": "*This tale is sort of a hybrid of tech suppot, plus customer sided. I think it's a good fit for this sub and that maybe the readers here would enjoy it, but please remove this if you feel like it breaks rules.*\n\ntl;dr at the bottom\n\nI used to work from home for a that hired and trains call center agents, and I'm sure you're all intimately familiar with how bad individuals in a boring office setting can be with tech (of course it got worse when people were working from home). I know it, you know it, everyone knows it.\n\nI'm very aware of the nonsense tech support has to slog through, and I absolutely hate wasting people's time so whenever I had issues I made sure to pre-emptively do whatever I needed to make the tech's life easier. Turned the computer on and off again, made sure everything was plugged in, make sure the monitor didn't accidentally get shut off, whatever I could. Because of this, I cleared up most of my issues on my own. It helped my team's manager a lot because the rule of thumb was, if I was down, EVERYONE was down.\n\nOn this specific day, the login was giving me issues that I was putting in the wrong password. Checked for capslock, made sure my strokes were going through (so no missed or doulbe inputted keypresses), still no luck. At this point I figure maybe I accidentally locked myself out trying to solve the situation on my own. Sure, that's fine -- it happens. I go to the website for self trouble shooting, and request a manual password reset. It asks you to put in some identifying information yourself and input a new password. Pretty standard, have done this many times before.\n\nTry to log in, still no luck. Same as before, rinse and repeat. Now this has never happened to me before. I've locked myself out a small handful of times but I've always gotten it taken care of, but resetting into a lock out has never happened.\n\nSo instead of logging into my work PC through the VPN, I did a login without the VPN which gutted whatever access I had to my computer, but it at least let me put in a support request ticket. The ticket system we have to go through that we had to fill out for issues that includes very standard stuff. Which domain you logged in, what type of VPN you had, hardware info - etc.\n\nIt always starts off with a text chat. A few minutes after submitting my ticket a tech reaches out to me and asks me if I put in the right info, I say yes. He resets it for me manually on his end and asks me to try it again. Do the same thing. Same results.\n\n\"Are you sure you're putting in the right info???\"\n\n\"Yes I'm sure.\"\n\nAnother couple of resets, and at this point I'm worried there's something wrong with my keyboard despite doing everything in my power to confirm my inputs were right.\n\nI could tell the tech was growing increasingly more frustrated with me, and I'm pretty sure he was rolling his eyes at this huge case of 'users always lie.' At this point I felt like I was both stupid and/or crazy. I was promptly escalated to tier 3 support.\n\nTier 3 is always a live call when you work from home, and he went through the standard fare 'did you turn it off and on again' and reviewed the entire log of the ticket thus far.\n\nThe tech manually reset my password just like before but told me to type my password into the user box so we could visibly see if my input was correct, and copy paste it. We did this, and now we knew without a shadow of a doubt that I'm not misentering my password, and that there's also no issue with my keyboard not parsing properly. Which to me, is a relief.\n\nThe tech I was now working with was a guy in his late 40s early 50s, and he's seen some shit, and it was the first time he's ever seen anything like it. The fix took a long time of active back and forth between me and the tech -- easily over an hour. There was a lot of backdoor manual VPN shenanigans, and multiple reinstalls, or reimages. It was a long time ago, and I've forgotten what happened for the most part.\n\nFrom my understanding, it looks like there was some glitch in the matrix where my user key went ghost in the system so no amount of password resets would help me because my username didn't exist in the database anymore. The password resets were all successes, and my login info was correct. I wasn't able to log in. All of this was mutually exclusive.\n\nAnyways it ended with the tech saying \"I've never seen anything like this,\" in a pretty positive tone. Maybe the absurdity of it all was refreshing, or maybe the bug was interesting to try to work through. He finished by manually re-registering my user credentials in the database, and the reinstalling of my work VPN before letting me go and resolving my ticket.\n\nEvery once in a while I think about how I probably frustrated that tech. I hope he's having a good day right now.\n\ntl;dr the one time the user didn't lie.",
        "created_utc": 1675750559,
        "upvote_ratio": 1.0
    },
    {
        "title": "So my dad goes to Best Buy to replace his computer",
        "author": "ravencrowe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vqfbi/so_my_dad_goes_to_best_buy_to_replace_his_computer/",
        "text": "[removed]",
        "created_utc": 1675738289,
        "upvote_ratio": 1.0
    },
    {
        "title": "best PC steering wheel",
        "author": "irtazaali193",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vocm0/best_pc_steering_wheel/",
        "text": "[removed]",
        "created_utc": 1675732863,
        "upvote_ratio": 1.0
    },
    {
        "title": "20TB hard drive not recognized when using a docking station",
        "author": "doobah-doobah",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vklot/20tb_hard_drive_not_recognized_when_using_a/",
        "text": "[removed]",
        "created_utc": 1675723298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do not demonstrate the capabilities of RAID",
        "author": "bothunter",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vichy/do_not_demonstrate_the_capabilities_of_raid/",
        "text": "This is a real old story.  I was working for a small company to earn a few extra bucks during high school.  Although I was initially hired to do data entry, they quickly learned that I was able to fix a lot of their computer and networking issues.  After doing things like upgrading their 10 megabit hubs to 100mbit switches and rebuilt the network with a topology that actually made sense, I moved on to setting up actual servers -- starting with a simple print server.  I eventually convinced them to shell out a bunch of money for a fast file server with gigabit ethernet and RAID!  When the server arrived, I started setting it up and the owner of the company wanted to see what he had just purchased.  Specifically, he wanted to know why we spend so much extra on a hardware RAID controller, so I did a quick impromptu demo.  Since the server was new and I was still setting it up, I showed him how any of the hard drives could fail, and the server would keep going.  I stupidly did this by pulling one of the drives and showed him how it showed as failed -- then plugged it back in and showed how the controller automatically detected this and started rebuilding the RAID.  So far, no actual harm and the owner was very impressed.\n\nI then went to lunch to let the server continue installing things, and came back to a blue screen.  It turns out that the owner was so impressed, that he decided to repeat the demo a few more times for some of my coworkers.  We all had a good laugh as I explained to him that while yes, RAID can recover from an occasional hard drive failure, there are limits to this process, and maybe we shouldn't be randomly pulling drives from the server just for fun.",
        "created_utc": 1675717957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parent didn’t know his own email",
        "author": "mr_techy616",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vhq05/parent_didnt_know_his_own_email/",
        "text": "[removed]",
        "created_utc": 1675716501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another Tale of Missing Backups",
        "author": "ascii4ever",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10vez5m/another_tale_of_missing_backups/",
        "text": "Back in the day I was tech support and system administration at a University.   As more and more students started showing up with laptops (this was the early 2000s), I had some interesting encounters.  \n\nI was in our student computer lab one day and a student walked up to me with a laptop and asked if I could help with something.  Sure, no problem!  That's what I'm here for.\n\nShe explained that she had installed Linux on her laptop \"just for fun\".  She had experimented using it and while it was kind of fun, she now wanted to return her laptop to the original configuration.  I don't remember which version of Windows she needed, but I got a really bad feeling about this.\n\nI asked if she had done a dual boot install.  I got back a blank stare.  I asked her to describe how she installed Linux.  It was easy, she burned a cd from an iso file she downloaded, booted her laptop from the cd, followed the prompts, it was easy peasy.\n\nI think I had her boot up and checked the partition table to see if there were any NTFS or FAT partitions, nope, it was a nice clean Linux install.  \n\nI explained that she had partitioned  and overwritten her entire hard drive, and please tell me you made a backup of your laptop BEFORE you did this Linux install, because your files are gone.\n\nOf course it turned out she didn't have any backup of her Windows stuff.  I spent some time having her try to remember what files she might have had that were important.   I was kind of hoping she could just re-install Windows and pretend she had a \"new\" laptop.  She had lost some project files for a class she was taking, I recommended talking to her professor right away.  Explain what happened, throw yourself on their mercy, maybe you'll get some extra time or something.\n\nShe was very upset (who wouldn't be?), and went off to talk to her professor.   I don't know how things shook out, I'm guessing she was able to work it out with the professor.",
        "created_utc": 1675710295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Awkward Support Session",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10v4rxm/awkward_support_session/",
        "text": "[removed]",
        "created_utc": 1675684532,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am informed by a reliable source",
        "author": "monedula",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10v2bmf/i_am_informed_by_a_reliable_source/",
        "text": "One from a colleague who came for a cry on my shoulder a few days ago.\n\nShe supports a few customers, each of which has a custom application we built. Here we go with one of them.\n\n&gt; Customer: your application is causing us problems.\n&gt; Angela: sorry to hear that. What is the problem?\n&gt; Customer: we're getting an error message.\n&gt; Angela: What does it say?\n&gt; Customer: I'll mail you a screenshot.\n\nHey! That's an improvement on a lot of the stories around here, isn't it? But wait ...\n\n&gt; Angela: but ... that isn't our application. \n&gt; Customer: no, but your application is causing the problem.\n&gt; Angela: why do you think that?\n&gt; Customer: it's caused by data we're getting from you over the interface.\n&gt; Angela: are you sure? We process files that your application produces, but I've no recollection of any interface which sends data back to you.\n&gt; Customer: well, John told me it was data from your application causing the problem.\n&gt; Angela: could I speak to John then?\n&gt; Customer: no, he doesn't work here any longer.\n\nAnd apparently it went downhill from there ...\n\nAt least there was one good outcome: it gave me a better feeling about *my* main customer. (Which lasted until about ten minutes ago, but that's another story.)",
        "created_utc": 1675675037,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are.... Backups?",
        "author": "itenginerd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10uxs58/what_are_backups/",
        "text": "This one's almost 20 years ago now--2004 or 2005. My smallest customer--the owner (a guy) and his laptop, his admin/secretary/bookkeeper (a woman) and her PC and the server. More CPUs than heartbeats in that organization. The IT nuclear family...  We should note here that this was the first and only Small Business Server installation that I ever did (this becomes important later). So I do the installation of all three systems, built thier AD and group policies out, and spent the afternoon showing the admin how she should get the backup tapes in and out of the server and which tapes go when, so they had a backup rotation.\n\nFast forward about a year. She calls me up and starts with \"Hey, I think I messed up. I just accidentally deleted our Quickbooks file off the server.\" No problem, I'm thinking - it's 8:30am. We'll just pop in yesterday's tape, since there's no recycle bin for deleted network files. So I ask her to grab yesterday's backup tape, to which she responds \"Tape... Is that the thingy that sticks out of the front of the server?\" In that moment, I realized that a) she had never pushed the tape INTO the server, so b) there wasn't a single backup of my customer's data anywhere. ohshit.\n\nNow in a not-minor panic about what smells like a business-ending loss of data and probable lawsuit on the horizon, I tried to keep my cool while I drove over to the customer site. I check the server and confirm that no backup has been run since I was there to do the installation the year prior. I cast about for a solution, and in that moment, the gods smiled upon me. Took me about a half hour to realize it, but Small Business Server is the only flavor of Windows Server 2003 to preconfigure Volume Shadow Copy out of the box. I just had to go to the drive, access the shadow copy and restore their entire bookkeeping system.\n\nI wrote out all the procedures for backups in email (to cover my butt should that ever happen again), but I never have forgetten the sound of that bullet whizzing past me. Still the luckiest moment of my career, even almost 20 years later.",
        "created_utc": 1675658457,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Server\" is an old desktop",
        "author": "sajason",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ugzwy/server_is_an_old_desktop/",
        "text": "Reading these threads, I too had a reminder of my old days working as a MSP in 2012, similar to [this post](https://old.reddit.com/r/talesfromtechsupport/comments/10tfjt1/in_which_the_server_isnt_a_server).\n\nThe \"server\" was an old desktop that died and it had some really old software (10+ years) that was never updated, only the operating system and hardware was changed (upgraded from 98 to windows XP). We had issues upgrading on newer hardware and couldn't find a solution.\n\nI called the vendor and inquired about what the specific error I kept getting was referring to. The tech said they had never seen the error and it wasn't showing up in their system, but they would get back to me in a day or two after they researched it.\n\nfast-forward 3 days later and I finally get an email. It's from the same person and it reads:\n\n&gt; I talked to X guy who somehow remembered it and this is an issue that hasn't been seen for over 10 years. The version you are running had an issue and it was fixed in a subsequent patch release shortly after. However, the only fix is to install the patch on the same machine and export the data.\n\nI was able to upgrade the version by imaging the machine and re-imaging on another desktop similar to it. When asked why it took so long by the client, I replied \"you never upgraded anything for so long that even the vendor was confused\".\n\nThe client was pissed and ended up getting the owner's nephew to run the place... we were contacted 2 years later to fix something and the MSP owner declined it as he knew it wouldn't be worth our time, lol.",
        "created_utc": 1675615657,
        "upvote_ratio": 1.0
    },
    {
        "title": "The tableau dashboard is not updating",
        "author": "ToDonutsBeTheGlory",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10twmfg/the_tableau_dashboard_is_not_updating/",
        "text": "This was when I was in operations and we sometimes helped with operations.\n\nI was a business analyst and had developed some visuals on business operations using tableau. The tableau used an excel sheet was its date source.\n\nMany agents would tell me during staff meetings “the tableau isn’t calculating my meetings right.”\n\nI would ask them had they inputted their meetings into the excel sheet. The tableau showed their number of meetings and it fed off the excel sheet. They knew this from multiple trainings. Invariably every time the answer to my question was no. Even when I explained to them and showed them how to use excel to enter data into a column (yes, i know but even this was required).\n\nDespite this they would bring them up for months afterward. Every time I explained again they would act like they were hearing it for the first time.",
        "created_utc": 1675558584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Important Meeting",
        "author": "ACCinAFSPCjerk",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10to2hh/important_meeting/",
        "text": "I'm not IT, I get called for advice by our IT guy occasionally because I'm \"old\". \n\nOur office has two networks, one is for regular day to day business NormNet and another for information we don't want to share. Ever. Henceforth nicknamed as SecrNet.\n\nBig boss had a meeting with his peers and big big boss in 3 hours. He wanted to display slides from SecrNet.\n\nThe conference room was setup with a big ass tv to display NormNet. They used a thin client to get a desktop into the room, the they tried to output from the thinclient to the 30ft VGA cable coming out of the wall to the front of the room. \n\nSecrNet has some encryption... I asked them if it worked if we didn't use the 30 foot VGA cable and used a regular monitor with Dvi instead. \n\nPaid IT \"Yes, that works fine, just can't get it over the VGA.\".\n\nMe \"HDCP\"\n\nPaid IT \"?\"\n\nMe \"remember back in 2003 when there was a bunch of calamity and anger about all displays needing to requirements to meet HDCP? And how it was the end of piracy, screen caps, end of TV tuner cars recording?\"\n\nPaid IT \"?\"\n\nMe \"VGA can't display HD content, move the thin client box to the TV and use DVI instead.\"\n\nPaid IT \"that's lame\".\n\nWe got the meeting up and running with 30 minutes to spare... Just for the big bosses to decide that they're going to take a break and have dinner first and just reattack in the morning.",
        "created_utc": 1675536829,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which the server isn't a server, but the other way round",
        "author": "Automatic_Mulberry",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10tijw4/in_which_the_server_isnt_a_server_but_the_other/",
        "text": "u/Kazhmyr1's  [story](https://www.reddit.com/r/talesfromtechsupport/comments/10tfjt1/in_which_the_server_isnt_a_server/) of just a few minutes ago reminds me of a situation a consultant friend told me about. In this situation, the server wasn't a server, too, but the other way around. I'm sure I am incorrect on some of the technical details since it was a long time ago and secondhand, but the gist is correct.\n\nMy friend got called by an office who had fired their previous consultant. They had worked with the previous guy to build them a server for file storage and an app backend. When my friend arrived, they told him this story:\n\nThey had spec'ed hardware to meet the app vendor's recommendations, and it was actually pretty solid. It was real server hardware, not just a beige box. It was delivered with one CPU, but capable of four. It had lots of slots for memory and a SCSI RAID setup. They were never really satisfied with the performance, though, and the other consultant looked into it and decided that it was CPU-bound, so they added another CPU. That didn't really seem to help. In waves, they ended up getting four CPUs into the box, adding a bunch more RAM, etc., and the thing still sucked.\n\nSo they called my friend in, and he looked at it. It was all pretty well set up, honestly - but the installed OS was a desktop version (Windows 95, maybe? I don't remember, but that was about the right timeframe), which of course was not capable of using more than one CPU. So they had high-spec server hardware sitting there, with three processors just sitting idle.\n\nHe got them a license of NT4 and installed it, and things got much better from there.",
        "created_utc": 1675523310,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which the server isn't a server",
        "author": "Kazhmyr1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10tfjt1/in_which_the_server_isnt_a_server/",
        "text": "I work for a small MSP as a contractor, I have many stories. This one from around when I started a couple years ago.\n\nI get a call from a new client that their \"server\" crashed. I go out and it's a small non profit using a mix of Vista and 7 on circa ~2009 HP PC's. I asked to see the server and get pointed to the front desk PC. Turns out \"server\" meant PC with a network share on it that all the other PC's were connected too. It wasn't booting but I was told oh it should be an easy fix even if it was dead, because there are backups! The \"backup\" was a USB tape drive that was corrupted. Anything I plugged it into immediately threw up a warning that the drive was corrupt and unreadable. Further inspection of the \"server\"was almost just as bad. There was about a medium sized cat's worth of fur inside (they had two office cats), the heat sink and PSU were completely clogged up, and the intake and exhaust fans were almost completely seized. After cleaning it out it still doesn't boot, tried a different psu and tried the HDD in a different PC, still no go. The drive was at least readable as an external do I got their files back for them, but couldn't recover any software they had including an apparently expensive and EOL legal paperwork database thing that had moved to a cloud based solution some years prior. Client was pissed I couldn't recover his \"very expensive software\" (that he tossed the disc for years ago), and told me to my face I was bad at my job. We did not keep them as a client.",
        "created_utc": 1675514588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fix this! Get everyone worldwide to fix this!",
        "author": "dave999dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10szmaf/fix_this_get_everyone_worldwide_to_fix_this/",
        "text": "I posted something a few days ago that described a challenge I had around [the definition of a business day](https://www.reddit.com/r/talesfromtechsupport/comments/10q4qpp/as_the_world_turns_what_is_a_day/). I faced a similar challenge years earlier around when a transaction occurred.\n\nIn my old industry there were multiple entities involved in each transaction. Customers would make a request via a terminal, which would connect to an acquiring entity, which would connect to a network, which would connect to an issuing entity, who would respond. The response would flow back down to the terminal. The customer would then complete their transaction and go on about their business. All of this combined should take 5-10 seconds.\n\nOkay. What time did this happen? Typically the important time is the one from the customer's point of view. If they looked at their watch, what did it display? Unless a user made a manual note of the transaction, they would need to rely upon what was printed on the ticket or what they saw later in their account. What was printed on the ticket was almost always set to the local time for the terminal. If that was a physical terminal, then the user would have been standing in front of it. And their watch would have matched the ticket.\n\nHowever, it was important to keep in mind that the \"ticket\" the user received was created and printed by a mechanism distinct from the process I mentioned above. Think of this in terms of a cash register. The register prints a receipt. But totalling up of the items from a grocery basket is completely different from the authorization process related to a debit card. So the date/time recorded on the cash register receipt has nothing to do with the date/time recorded for the authorization. This was a very similar situation.\n\nI hope this makes sense, because this is exactly what I had to explain to our biggest and most complex client. They wanted to know why the date/time on the statement for their clients often did not reflect the date/time of the transaction. Why not? In fact, in over half the cases, the date/time on the statement reflected GMT. Why were most of the transactions set to \"England time?\"\n\nEach step of the process I mention above was captured by the relevant environment as it passed through. It was date/time stamped and logged according to the settings in that environment. My company always used Eastern US time as the stamp. We also captured the stamp of the terminal as well.\n\nThis is where we ran into trouble. The terminal's date/time was supposed to be set to the local time of its physical location during installation. At least that was supposed to happen. Given that the relevant terminals were literally worldwide, my company used that time as \"the time\" a transaction happened. That's what appeared on statements, reports, etc. \n\nWhat actually happened was that setting was typically not touched. Given that the default time when shipped was GMT, that was normally the time used by the terminal. So when customers checked their statement, most of the time transactions were displayed in \"England time.\" The home base for my client was on the other side of the world to England, literally almost. So not only was the time wrong, but also often the date.\n\nEven if the date was set properly, the terminal could be moved too. I saw a few terminals which had clearly been installed at some point in the United States and a few others that had clearly been installed in Western Asia. They were moved to near my client's home base, but the time zone was not changed.  \n\nThis confused and infuriated my client.\n\n* The first suggested course of action was that we \"fix this.\" Sure. Just let me contact a few million people worldwide and have them modify the setting for each terminal, of which we had no ownership and no means to compel this. This was gracefully dismissed as impossible. (But they still brought it up briefly and bitterly at each meeting, how we should be able to simply fix this.)\n* We contemplated using our timestamp, then converting everything from Eastern time to the local time for their home base. However, although 70% of this particular client's transactions occurred in the same time zone near their home base, a fairly large percentage of their clients traveled to nearby countries. A significant percentage were true world travelers. If we converted everything from EST to home base time, that would still be wrong for some thousands of transactions per day. This was dismissed as simply exchanging one problem for another. The only difference here is that \"our\" timestamp would now be wrong. The wrong time would now be our fault. Or more accurately *more* our fault.\n\nThe one thing I never understood was, what did their previous vendor do? How did they handle this? This was not an unknown issue. It was common in the industry. Somehow their old vendor had hidden this problem from them. It was the only thing that made sense. But how? I could not figure that out. Did the old vendor have some means of matching a terminal to a time zone? They must have, or else my client would have had the same issue. However, they couldn't have, since that was impossible. I'm still baffled by this.\n\nEventually the client stopped complaining. I think they eventually realized there was nothing we could do. So they gave up.",
        "created_utc": 1675469147,
        "upvote_ratio": 1.0
    },
    {
        "title": "24[f4m] I'm down for hookup both incall and outcall,, bored and horny rn , looking for fun and someone to make me squirt. DTF , blowjob, Anal,, Doggy,, deep throat,,, bareback,, hit me up on snap",
        "author": "tight_pussy3561",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10sxua1/24f4m_im_down_for_hookup_both_incall_and_outcall/",
        "text": "",
        "created_utc": 1675464572,
        "upvote_ratio": 1.0
    },
    {
        "title": "The stress of a meeting",
        "author": "Another_Basic_NPC",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10st99x/the_stress_of_a_meeting/",
        "text": "[removed]",
        "created_utc": 1675453501,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Nice tiers of backup systems... Did you test any of them?\"",
        "author": "COMPUTER1313",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10sdbbi/nice_tiers_of_backup_systems_did_you_test_any_of/",
        "text": "This story came from a friend who recently started work at a datacenter. I think they had been at the job for maybe a month.\n\nOn paper, it seemed they were ready to ride out a disaster.\n\n- Double backup generators with their own fuel tanks and a combined capacity to keep the place running for a few days.\n\n- Large UPS to allow for enough time to safely power down everything if the generators fail. He didn't mention if the HVAC was on its own backup power as well in the event of the generators going out.\n\n- Redundant electrical system so that no single failure could take down the entire thing.\n\n- Tiered storage backup systems.\n\nSo, what could go wrong?\n\n- Power went out for maybe less than an hour.\n\n- One generator refused to start. The other one was making loud grinding noises and the staff made the call to shut it down immediately.\n\n- UPS failed to kick in.\n\n- Backups were never tested.\n\nSo they had to verify which backups were corrupted and thus be discarded. From my understanding, they restored different data/services from different save points because no tier of backups had the complete set of data. So some data was coming from a backup that was only a few hours old and other data were coming from a week old backup.\n\nThey are still dealing with the predictable mess of restoring data/services from different times.",
        "created_utc": 1675405732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old man and his iPhone",
        "author": "Ich_mag_Kartoffeln",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10s5icy/old_man_and_his_iphone/",
        "text": "The other day (probably the other week by the time I type, edit, and post this) I visited my grandparents, and took them out for lunch. While we were out we ran into one of their friends, who I have met before but hadn’t seen for a long time. Greetings were exchanged, and I was (re)introduced.\n\n\"Oh yes, I remember you! You're the one who fixed my phone for me!\"\n\nMe thinking: *Did I? I wonder when that was. It must have been quite a while ago, because I can't remember the last time I saw you.*\n\n\"A couple of years ago I had to get rid of my trusty old flip phone because they closed down the network on me....\"\n\n*Jeez I know you're old, but flip phone, network closed down; so we're probably talking when Hellstra shut down their 2G network. Again: WHEN did I fix your phone?\"*\n\nFYI: checking now on the Googles tells me that the network shutdown I'm guessing was the catalyst for his \"new\" phone happened at the end of 2016.\n\n\"....and now I've got this damn fool Apple thing that I've got the same problem with.\"\n\n*OK, what problem could a technologically illiterate nonagenarian have with both a flip phone and an iPhone? Hopefully my vast experience with all things Apple (/s) will serve me well here.*\n\nI took possession of the ancient iPhone (no idea what model it was), and woke it up. Swipe only to unlock, no security (no surprise).\n\nAs I looked through the almost complete lack of icons on his home screen (there was only one screen -- I checked), he finally gave me a hint what the problem was (and thank God he did, because at that point I still had no memory of ever fixing his phone).\n\n\"That damn thing rings so loud it hurts my ears. I just want it to buzz!\"\n\nWith that comment, I remembered! Yes, I had turned off the ringtone on his flip phone while leaving vibrate on. I was still at high school at the time, so we're talking 15+ years ago.\n\nAfter a brief explore of the settings, I was able to make the necessary changes. I handed the phone back to him, and asked what his number was so I could check my work. Upon me calling him, his face lit up as the silently vibrating phone alerted him to the incoming call.\n\n\"Thank you so much for fixing that! You're a lifesaver.\"\n\nAfter a brief chat with my grandparents, we said our farewells and went our separate ways. But it staggers me that he had been putting up with his phone hurting his ears for SIX YEARS without getting it fixed, but still remembered me fixing a similar problem for him at least 15 years ago.\n\nAt least I was able to fix it. Tech wizard image preserved again.",
        "created_utc": 1675383147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calling HP's repair centre makes me die inside a little every time.",
        "author": "bobwinters",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10rlz5w/calling_hps_repair_centre_makes_me_die_inside_a/",
        "text": "*Dials HP repair centre*\n\n\"Please say what device you are calling about\"\n\n\"HP Elitebook\"\n\n\"I see you are calling about an HP Elite Notebook, I'll transfer you to the correct department...\"\n\n*Himm Notebook..? Weird, it's an Elitebook though. Meh...*\n\n*Dials HP repair centre for a different job a week later. Remembers last phone call*\n\n\"Please say what device you are calling about\"\n\n\"HP Elite Notebook\"\n\n\"Sorry I didn't get that. Please say what device you are calling about\"\n\n\"HP Elite Notebook\"\n\n\"Sorry I didn't get that. Please hold the line and I'll transfer you to an operator\"\n\n*Hangs up and redials HP repair centre*\n\n\"Please say what device you are calling about\"\n\n\"HP Elite Notebook\"\n\n\"Sorry I didn't get that. Please say what device you are calling about\"\n\n\"HP Elitebook?\".\n\n\"I see you are calling about an HP Elite Notebook, I'll transfer you to the correct department\"\n\n...\n\n#THERE ARE FOUR LIGHTS!!",
        "created_utc": 1675330749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back on the Help Desk part 4, Pittsburgh.",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10rcu9h/back_on_the_help_desk_part_4_pittsburgh/",
        "text": "This is a part of a series:  \n   \n[Part 1](https://www.reddit.com/r/talesfromtechsupport/comments/z7jatb/back_on_the_help_desk/  \n  \n[Part 2](https://www.reddit.com/r/talesfromtechsupport/comments/zgjcrd/back_on_the_help_desk_part_2/)  \n  \n[Part 3](https://www.reddit.com/r/talesfromtechsupport/comments/1049uc8/back_on_the_help_desk_part_3/)  \n  \nI’ve got a bunch of tickets sent to the appropriate parties to set up site visits for the following weeks. I decide to ignore the flurry of onboarding emails welcoming me to &lt;&lt;BIGCORP&gt;&gt;, since they’re intended for real employees rather than a short term mercenary like myself. I know I’m not going to enroll in health care, sign up for training or attend Carrie’s ten year anniversary.  \n  \nLuckily, two sites respond quickly. There’s a datacenter near Pittsburgh, PA and a call center in Knoxville, TN that would love to have me the following week. This is perfect. I’ve got something billable to do, it’s warm out and I’m getting paid to ride my motorcycle.  \n  \nFor some oddball reason, I’m seeing tickets unrelated to the site visits. I ignore them, figuring I’ve been put on a bunch of unnecessary distribution lists.  \n  \nI pack up my stuff and ride home, then decide to ignore work on the weekend.  \n  \nSunday night, I ride out to a suburb of Pittsburgh, PA and re-enter the consultant’s world of midmarket hotels, restaurants filled with plasticky décor serving plasticky food. I entertain myself by reading the spotty and inconsistent documentation on this datacenter.  \n  \nMy review _should_ be simple. I’m curious how resistant this DC is to the usual insults- breakins, backhoes and natural disasters. I’d like to know what happens to &lt;&lt;BIGCORP&gt;&gt; if something were to knock it offline or remove it from existence entirely.  \n  \nI’ve got incredibly detailed physical documentation. I could probably rock up to the counter at a Greybar or Grainger, hand the clerk the docs and a big check and rebuild the interior of the DC. The systems documentation is spottier. I have an inventory of system names, but no clue of what they do, applications they run, let alone what business functions they support.  \n  \nSo I’m going to have to ask a bunch of basic questions for the operations staff, which is going to be painful for all involved. I resist the desire to close out the bar at the chain restaurant that’s walking distance from my hotel.  \n  \nNext morning, I make my way to the datacenter. I’m greeted at the door by Clyde. Clyde’s one intense dude. He stands at parade rest while I show my credentials to the security guard, then takes me to a small conference room. He takes up a position by the door while I sit down and start pulling stuff out of my bag.  \n  \nClyde: ”The rest of the team will assemble here by 9:30. If you leave this room, I will escort you. Do you require anything?”  \n  \nI’m glad that he reminded me that I can leave this room. The law school student part of my brain wants to yell “Am I being detained?”  \n  \nEventually the rest of the team assembles and takes seats across from me:  \n  \nClara, a middle aged woman, conservatively dressed, but with a clear love of exciting eyewear. She’s the IT Operations Lead.  \n  \nRaymond, a heavy set man with a clear love of caloric foods and short-sleeve shirts. He’s got an ill-developed goatee. He’s the Compliance Liaison, a role I’d be curious to learn more about, but not enough to ask Raymond.  He emits a steady stream of corporate word-salad like a junior high football coach vomiting out a Successories catalog.  \n  \nStefanie, a college intern happy to not be stuck in a cube for half an hour.  \n  \nI decide to get things rolling.  \n  \nMe:”Hello. I’m Lawtechie and I’ve been sent by Enterprise Risk to better understand the operations here at this datacenter. I want to thank you all for your documentation and time. I do have some follow up questions which I hope you can help with”  \n  \nRaymond (leaning forward ominously):”We’ve prepared a presentation”  \n  \nI used to believe that any presentation that started with a safety warning was going to be interesting.  \n  \nUsed to.  \n  \nThe presentation starts with the types of fire extinguishers and a requirement that steel-toed boots are required to be on the property. A few slides in after the history of the company and its importance in the industry and I have to interrupt.   \n  \nMe:”I’m sure  you all worked really hard on this, but I’m here for technical details. Might there be a slide about those?”  \nThe quartet huddles for a minute, then looks back at me.  \n  \nRaymond:”You should have written your questions beforehand so we knew what to prepare for”  \n  \nMe:”I gave you all an agenda with the topics we’d discuss. We’re just going to have a friendly conversation about what you all do here. If we hit questions you don’t know the answers to, we can find other people to ask. Is that cool?”   \n  \nClara (looking over the top of her excitingly chunky eyewear):”Any questions you could possibly have are answered in the documentation we provided”  \n  \nMe:”About that. I have a list of systems, but I don’t know what they do or what applications they support”  \n  \nClara:”That’s not in a document”  \n  \nYour honor, permission to treat the witnesses as hostile?  \n  \nMe:”So how would I guess what CNLP1431 does from its name? I have to ask somebody, and as far as I know, that someone is you”  \n  \nClara:”Do you want a current list of all the applications on that server?”  \n  \nMe:”Sure. That and what its purpose is”  \n  \nShe starts typing on her laptop for a few minutes, then turns it around to me. I see a screenshot of Task Manager. She’s giving me what I ask for, not what I want. I’ve been at friendlier depositions.  \n  \nI close my eyes, push away from the table and lean back. I need to keep my composure if I want to keep this gig. I breathe in and out, trying to calm myself.  \n  \nMe:”All right. Let’s try this thought experiment. Imagine a large, iron-nickel asteroid comes in and smashes much of Allegheny County, vaporizing us and this datacenter. How would BigCorp’s business be impacted?  \n  \nThere’s a silence, other than the susurrus of the HVAC system and Raymond’s open-mouthed breathing. I’m about to regret my open-ended question until I hear Stefanie’s voice.  \n  \nStefanie:”I’m writing a report for credit. This datacenter hosts Email, calendaring and chat capabilities for BigCorp along with another datacenter in San Jose, California. It also hosts development servers for GreyGoo, our new product offering. If this data center went down, BigCorp email would automatically switch over to the other datacenter.\"  \n  \nMy soul re-enters my body with a snap.  \n  \nMe:”Is she correct?”  \n  \nClara:”Well, that’s a gross oversimplification. This datacenter has other process streams”  \n  \nMe:”Ok, such as?”  \n   \nClara:”Which server are you referring to?”  \n  \nFine. Clara has chosen to do this the hard way. A few minutes of fiddling and I have my laptop connected to the projector. I put up the list of servers and we go line by line like an Active Directory eye exam. At the end of this, I’m hoarse, sweaty and in possession of a very rough data flow diagram for GreyGoo’s development environment. It’s a smaller mirror of the production environment and a bunch of repository servers. I take a few pictures of the scribbles and send them to Stefanie, who promises to make them into coherent documentation for the next assessment.  \n  \nI have what I need for now for a half-assed report. There may be follow up questions but I’m tired of being here. I thank everyone for their time. Clara jets out of the room, while Raymond tries a soliloquy about how useful and productive this session was and that our hard efforts made real improvements to BigCorp’s metrics. I flash him a wan smile and gather my stuff. Clyde walks me out.  \n  \nClyde turns to me and gives me a thin smile.  \n  \nClyde:”I’ve never seen someone just stick with a question like that with those two”  \n  \nI laugh and bid him a good day. As I walk to my bike, I pull out my phone. Huh. I have about five missed calls and a few texts from a number I don’t recognize. Oh boy. Mark the Interface Guy from HQ. I wonder what he wants.  \n  \nI call him and hold the phone between my shoulder and ear while I pack the saddlebags of my motorcycle.  \n  \nMark:”Hello, BigCorp Help Desk”  \n  \nMe:”Hey, you were trying to get a hold of me for some reason?”  \n  \nMark:“Yes. Are you not coming into the office?”  \n  \nMe:”Er, no. Wait. No. Why does that matter?”  \n  \nMark:“We don’t support work from home on the help desk”  \n  \nMe:”Well, that’s a shame. Must make it a bit harder to recruit. Anyway, I have the access I need. What do you need from me?”  \n  \nMark:“You’ve not done any work on those tickets you’ve been assigned”  \n  \nMe:”What? Why are you assigning me help desk tickets?”  \n  \nMark:“Why wouldn’t you take help desk tickets? You’re _on_ the help desk”  \n  \nMe:”I’m a contractor working in cyber security”  \n  \nMark:“Why were you at the help desk?\"  \n  \nMe:”All the good cubicles were taken? Ask Squirrel. Anyhow, stop giving me tickets and reassign the ones you already sent me”  \n  \nMark agrees and hangs up.  \n  \nLike most people, I’m happy to leave Pittsburgh.  \n  \n   \n  \nTo Be Continued.",
        "created_utc": 1675301611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Back on the help desk 4, Pittsburgh",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1675300649,
        "upvote_ratio": 1.0
    },
    {
        "title": "They lost some points on the landing",
        "author": "Ol_JanxSpirit",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ra5zv/they_lost_some_points_on_the_landing/",
        "text": "We use a third party for phishing tests and cyber security training. As my bosses don't allow me, yet, to punish the people who don't complete the training, I have to be nice instead. Quarterly, I draw a random user who has completed 100% of the trainings and send them a gift certificate to an online retailer who doesn't need my help marketing them here. \n\nI give the user a shout-out in the all-staff chat, and I shoot them a message telling them to be on the lookout for the incoming email.\n\nWell, this quarter's winner was a little bit overly proactive. They ignored my heads-ups, and promptly flagged the legitimate email as a phishing attempt. \n\nI guess I should be happy that they're airing on the side of caution, but I couldn't help but laugh when they, after seeing my notices, came asking if there was any way to recover it.",
        "created_utc": 1675294956,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I'm sure it will be broken soon enough again...\"",
        "author": "FreakFromSweden",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10r9e41/im_sure_it_will_be_broken_soon_enough_again/",
        "text": "Hello again! A shorter story for you guys this time.\n\nThis one starts weeks ago when one of our departments started having read/write performance issues on their shared folder. Went over the normal stuff, tested other folders, other files and everything was working well. The problem was their folder and the files within it. We tried everything to resolve it and the department was getting more and more annoyed. \n\nThe structure was a mess to begin with. They had hundreds of folders, file-paths longer than Windows allowed hundreds of Excel sheets spread over dozens of folders (Excel and DFS is a database, right?). We suggested they started looking into a program suit that could fill their needs but they refused since \"Excel is easy to use\"... sure easy to use, but broken.\n\nAfter testing basicly everything we just decided to move everything to a new folder on our shared disks. One script and the entire content was moved, permissions reset and they got back to work. This fixed it, god knows why but that original folder was cursed.\n\nI reach out to the user who first reported the issue informing her that it had been resolved. She insists on me getting on a call with her so she can test it her self. She tries about 30 Excel sheets (each being hundreds of rows... dear god) and the performance is excelent. \"Well I'm sure it will be broken soon enough again, this never works. When it becomes slow again I will show you! By the way, we lost a file here the other day. It was named something like *\"most\\_generic\\_name.xlsx\"*, do you think you can help us recover it? It's so hard to keep track of things in this folder...\"\n\nPlease don't let your users turn their shared work space into a database and don't let them make it your problem turning you into a \"lost and found\"-hero.",
        "created_utc": 1675293067,
        "upvote_ratio": 1.0
    },
    {
        "title": "I built a twitter account where i post every hour the most trending tech news/subjects",
        "author": "smehfy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10quus5/i_built_a_twitter_account_where_i_post_every_hour/",
        "text": "[removed]",
        "created_utc": 1675258471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving DBs to new server",
        "author": "National_Active2451",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10qq6k1/moving_dbs_to_new_server/",
        "text": "[removed]",
        "created_utc": 1675247630,
        "upvote_ratio": 1.0
    },
    {
        "title": "At least glue it RIGHT!",
        "author": "iNeedtoReeddit",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10qeuyv/at_least_glue_it_right/",
        "text": "At my first job, I worked at IT tech for a university. Typical issues include deployments, software installs, occasional warranty calls etc. simple.\n\nOne day I had someone put in a ticket saying their right arrow key doesn't work. Kinda vauge but okay, probably needs a keyboard replacement so a warranty call should do the trick. I knew the user was using our standard issued laptop and all our laptops have premiere warranty so how hard can this be? Of course to make a claim I need to get some proof of how it is broken so I paid user a visit. \n\nI went there and I was not prepared for what I saw. User showed me their laptop and \"how the key doesn\"t work\" and by that I mean user had hotglued the keycap back on to the keyboard after it fell off. And the best part? They had glued the keycap in the WRONG DIRECTION. It went: up down left LEFT. I didn't say anything about the direction to the user but did let them know hot glueing the key likely counts as deliberate damage to the laptop and would not qualify for warranty. I am not sure who would be the one responsible for paying for the repair but nonethless to let me know if they would like to proceed and I would escalate to my supervisor. \n\nThe user ended not going for the repair but I did get a good laugh with my coworkers.",
        "created_utc": 1675209927,
        "upvote_ratio": 1.0
    },
    {
        "title": "As the world turns, what is a \"day?\"",
        "author": "dave999dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10q4qpp/as_the_world_turns_what_is_a_day/",
        "text": "Years ago I faced a problem similar to what's described [here](https://www.reddit.com/r/meirl/comments/10okunv/comment/j6h77s3/?utm_source=share&amp;utm_medium=web2x&amp;context=3) by DavidAdamsAuthor. I was asked to create a report that would indicate if a task was late or not. Based upon priority, tasks had to be completed within a certain number of \"days.''\n\nAt first mine this was straightforward. Business days were the only thing that mattered.\n\n* I excluded company holidays. They didn't count.\n* I excluded weekends. They didn't count either.\n\nHowever, the concept of \"business days\" didn't consider that tasks could arrive at any time, 24 hours a day, 7 days a week. The actors were on-call too at times, so handling work related to the tasks also could occur 24/7.\n\nNow let's do some basic math. Let's say a task is assigned at 8 AM and is finished at 3 PM the same day. How many days have passed? My patron told me 1 day. What if it was assigned at 8 AM and finished at 3 PM the next day. My patron says 2 days. How about assigned at 11 PM and finished at 3 AM the next day, so only 4 calendar hours have passed? Or even where an actor is assigned a task on a Saturday morning and completes it on Sunday evening. Would that be zero days, since neither of those are business days? My patron considers this and concludes we have to push the start time to 12:01 AM of the first business day after the task was assigned. Okey-dokey.\n\nNow we have a simple formula. Clock starts at 12:01 AM on the first business day after the day the task was assigned. Clock ends at 11:59 PM the day the task was completed. If the day of completion is not a business day, the task ended on the last business day before the day of completion. If a task is completed in the same calculated within 24 hours of the start date/time, that is 1 day. Beyond that just count the business days. This was fairly straightforward to set up and validate. (Mostly. I do remember there was a discussion around what happens if the task is completed before the official clock begins. Is the day count zero? Should the eager beavers be rewarded? Or wouldn't that confuse leadership?)\n\nHowever, we merged with another company that had an international presence. So now the relevant group had a lot of users in other countries. This introduced a lot of variation that I never truly solved:\n\n* Each country had their own national holidays.\n* When a day began and ended depended upon the rotation of the Earth.\n\nSo now a \"day\" depends upon upon the user's country. In theory this was somewhat easy to account for. Each user had a home location, which included the country. Just use that and add the relevant days to a holiday table which maps to the actors home country. However, the actors performing the tasks could be in one country, and the consumers who received the outputs could be in another. Which perception of a \"day\" mattered here? My patron again simply stepped in. He concluded the that the actors perception mattered. (He was darn helpful with these decisions). Okey-dokey.\n\nAt times there was collaboration between users. In some cases the task would begin in one country, but end in another. Which \"day\" mattered here? My patron, after some though, decided that we would have to switch to the consumers perception of a \"day.\" Great. But which consumers? In many cases they were located in multiple countries too. After some more thought, my patron elected to return to the actors perception, but retain the concept of a \"day\" aligned with the very first actor assigned to the task.\n\nThis final arrangement prompted some consternation:\n\n* There were protests from some actors. In some cases a task was reassigned cross countries so that the concept of a '\"day\" meant the task would be late, through no fault of the person who it was re-assigned to. That didn't seem fair.\n* Some countries had a generous holiday, work hours, and leave policy. This meant that in terms of sheer calendar days, people in some countries could take longer on their tasks and still have them be on-time. That didn't seem fair either.\n* Finally, the consumers in some countries grew frustrated at how actors in other countries were more often \"late\" with their tasks. But they weren't late, at least not according to the metrics. How does that make sense?\n\nAs time passed, see what I did there, I gradually moved away from working on this stuff. One of the last things I did was an analysis of cross-country collaboration and consumption. I concluded that more than 80% of the time the relevant tasks were primarily acted upon and consumed in the same country. So, most of the time this was a non-issue. When I last talked with my patron he consoled himself with that analysis. He decided that the gripes would never end no matter what he did, so we might as well stick with this arrangement. He kept the definitions as is.\n\nI left as some new on-call policies were rolled out that called the definitions once again into question. (I learned that some of continental Europe's worker protections were a lot stronger than in the US. Apparently you cannot simply modify someone's role to be on--surprise!--call like you can in the US.) Conversations were just starting on how to revise them and I never did learn what the result was.",
        "created_utc": 1675185611,
        "upvote_ratio": 1.0
    },
    {
        "title": "A developer should never have to be told this",
        "author": "ZZartin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10pfk0q/a_developer_should_never_have_to_be_told_this/",
        "text": "[removed]",
        "created_utc": 1675116284,
        "upvote_ratio": 1.0
    },
    {
        "title": "counterproductive pseudoscience",
        "author": "Obadiah-Mafriq",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10p6rln/counterproductive_pseudoscience/",
        "text": "[removed]",
        "created_utc": 1675095375,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am not IT but I can still attempt to fix things... (part 2)",
        "author": "UVlite",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10p54pd/i_am_not_it_but_i_can_still_attempt_to_fix_things/",
        "text": "[previous](https://www.reddit.com/r/talesfromtechsupport/comments/ulqhmt/i_am_not_it_but_i_can_still_attempt_to_fix_things/)\n\nHe did it again. But differently.\n\nThe printer was giving an error none of us have seen before. He even rang the supplier to ask them for help (apparently they do not know that the error code meant). He asked me to look at it. The error was about connectivity. This specialist printer is in 2 discreet units that need to be perfectly aligned to pass the plastic blank from one side to the other so my first idea was that they were not inline with each other. No luck.\n\nI then check the wiring going into both parts of the printer and notice there is a missing power light  on one side but it is turned on. I trace the power cable and find the printer is unplugged. someone had unplugged one side to plug in a laptop at some point and had not plugged it back in when they left. He now had his laptop plugged into the now spare socket without thinking why there was a loose plug on the ground.\n\nI told him I would be posting this and he said \"fair enough\".",
        "created_utc": 1675091423,
        "upvote_ratio": 1.0
    },
    {
        "title": "The time a scam caller planted a brick of C4 in my firewall",
        "author": "GenexenAlt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10p3tmo/the_time_a_scam_caller_planted_a_brick_of_c4_in/",
        "text": "[removed]",
        "created_utc": 1675088613,
        "upvote_ratio": 1.0
    },
    {
        "title": "7 Most Difficult Programming Languages to Learn in 2023",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10p2f3j/7_most_difficult_programming_languages_to_learn/",
        "text": "[removed]",
        "created_utc": 1675085996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fighting the $EXTREMELY_PREDATORY_DATABASE_COMPANY",
        "author": "OvidPerl",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10oy2qf/fighting_the_extremely_predatory_database_company/",
        "text": "I can't really say much here, because much of this is covered under NDAs, but _every_ experience I've had with both the `$EXTREMELY_PREDATORY_DATABASE_COMPANY` has been terrible, but there is one I _can_ share.\n\nIn the early 2000s, we had a huge query that should have been idempotent, but every once in a while, it was returning the wrong result. We couldn't figure it out, so we turned to `$EXTREMELY_PREDATORY_DATABASE_COMPANY`'s tech support. We were paying for it, so we used it. However, we were using Red Hat Linux, something which was relatively new for `$EXTREMELY_PREDATORY_DATABASE_COMPANY` at that time.\n\nWe contacted `$EXTREMELY_PREDATORY_DATABASE_COMPANY` and explained the issue, sharing the query. They asked us what version of Red Hat we were running and when we replied, they informed us that support was only available for Red Hat Advanced Server.\n\nF*ck. So we spent a lot of time and money setting that up and moving our database to it. The problem still existed.\n\nWe contacted `$EXTREMELY_PREDATORY_DATABASE_COMPANY` and explained the issue, sharing the query. They asked us what version of Red Hat Advanced Server we were running and when we replied, they informed us that support was only available for version X (I don't recall the number).\n\nF*ck. So we spent a lot of time and money setting that up and moving our database to it. The problem still existed.\n\nWe contacted `$EXTREMELY_PREDATORY_DATABASE_COMPANY` and explained the issue, sharing the query. They asked us what version of Red Hat Advanced Server we were running and when we replied, they informed us that support was only available for version X, point release Y.\n\nF*ck. So we spent a lot of time and money setting that up and moving our database to it. The problem still existed.\n\nWe contacted `$EXTREMELY_PREDATORY_DATABASE_COMPANY` and explained the issue, sharing the query. They asked us what version of Red Hat Advanced Server we were running and when we replied, they informed us that it was a known bug.\n\nF*ck. So we spent a lot of time and money setting up PostgreSQL and the problem went away.",
        "created_utc": 1675072088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lenovo laptop mic and camera hot keys not working. I haven't been able to turn on the camera because of it. Lenovo Ideapad 320.",
        "author": "far_from_earth",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10otcpr/lenovo_laptop_mic_and_camera_hot_keys_not_working/",
        "text": "[removed]",
        "created_utc": 1675055033,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Best Deals] Microsoft Office 2021 Life time License (Windows/macOS Digital Download) - $17.50",
        "author": "grmljemkx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10o4wwr/best_deals_microsoft_office_2021_life_time/",
        "text": "[removed]",
        "created_utc": 1674988920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keyboard craziness due to corporate stupidity",
        "author": "JaquesStrape",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10nwrsn/keyboard_craziness_due_to_corporate_stupidity/",
        "text": "This started off as a reply in another thread. Someone suggested it could stand alone here. I've rewritten it with more details. Enjoy!  TL;DR at the end.  \n \n\nA long time client called with a keyboard issue. It would just randomly stop working and could only be fixed with a reboot. However, it would stall again at some point but it was always random. This guy, we'll call him Red, owned a branch office of a financial consulting company.  He had a few people there. Red is no dummy, knows enough about computers to install software and hardware, swap out components, etc so he opted out of the corporate recommended IT support because they were very expensive and very slow. When he was truly stumped with an issue or just didn't want to take the time to solve an issue then he would call me.\n\nSo, anyway, on with the keyboard issue.  He'd reinstalled drivers, swapped out the keyboard, and a few other items until he was ready to fix it with a chainsaw.  This gave me a pretty good baseline on where the issue was not located.  My first step was going to be swapping the keyboard to another USB outlet. Could be he goobered it up somehow and it's just making intermittent contact.\n\nI pulled the case out from under the desk and discovered ALL of the ports were occupied.  Even on the front of the case. So I started tracing the wires:  printer, mouse, scanner, keyboard, wifi, headset, external HD, and a big red button with corporate's logo on it. Press the button, browser should launch,  and takes you to their home page. I had never seen one of these so I decided to try it. Nothing happened.  I figured it was outdated or had the driver removed or something like that. But at the back of my pea brain a little voice was telling me to unplug the button and test the keyboard.  So I unplugged it and everything starts working fine. Pluged it back  in and the keyboard goes wonky.\n\nSo Red and I get on the speakerphone to corporate's in house support because they required EVERYONE to purchase one of these for every computer in the  office. Likely tens of thousands nationwide. Red says \"The big red button is not working. What---\" and the IT guy immediately cuts him off. \"DISCONNECT ALL OF THE BUTTONS AND THROW THEM AWAY!\"  Apparently there was an epidemic of this going on company-wide.  The guy on the phone said there would be an email from corporate next week telling everyone else to do the same. Seems about 30% of these things were  defective. There would be no refund, either. Red was not happy about that, especially considering his lost time from the keyboard craziness and the lost funds from me and the buttons.\n\nRed later heard through the grapevine that some VP had a kid with an ad specialties biz and convinced marketing to buy these things without consulting IT. The vendor could program the action of the button to do whatever the customer wanted. The total cost per unit was about $0.50. The company \"sold\" them for $20 each. He only bought them for his desktop units. Didn't get any for the laptops that also doubled as desktops when the reps were in the office.  \n\n\nTL;DR: Keyboard goes crazy at random times. Turns out it's a USB device with a big button that launches the web browser to corporate when pushed. Corporate required all locations to purchase these devices and many fail. No refunds, either.",
        "created_utc": 1674959928,
        "upvote_ratio": 1.0
    },
    {
        "title": "The mystery of the disappearing iPhone",
        "author": "npaladin2000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10nrmid/the_mystery_of_the_disappearing_iphone/",
        "text": "[removed]",
        "created_utc": 1674945308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Again, I'm not Tech Support!",
        "author": "ukitern2",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10niuqu/again_im_not_tech_support/",
        "text": "Whilst usually UKITERN2 has major projects in various stages of implementation and planning, usually he gets drafted to help look at issues that Frontline Support, T2, and T3 can't solve.\n\nIn one issuance it's a blessing to spend hands on time with hardware, other times it's a curse of the position of being both good at the cloudly stuff and running a homelab and keeping those physical practical skills up to date.\n\nSitting at his desk UKITERN2 is on call, usually these last in shifts for 24/7 operations but usually shifts last a day or so at most. SLA doesn't really matter so long as the problem gets fixed under best effort as most companies we deal with don't have that level of support. Those clients that do pay extra for a specialist team. Everything we do is billable to the client at a very high rate for those clients who don't pay for a support contract. Our side do not get called out to site, as it's usually a very billable event.\n\nBoss: We need you to look at a weird error going on with ($Client's) network, it's been right through support several times and we can't figure it out. The budget has been assigned to take a look but if we solve it, it will be a major feather in our cap with ($Client)\n\nUKITERN2: You got it boss!\n\n\\---\n\nA few hours later UKITERN2 ends up on the ($Client's) site and going through the problem with their company support staff.\n\nWhat seems like the Printer not being available for a few hours, transpires both us and them were out looking at it to be a backhaul network issue. Generally we don't deal with Printers but as it involves Payroll and Accounting we have to care.\n\nIn the programme managements offices - which are quite large with a split partition between employees and hotdesks. Ethernet plugged into network switch, network switch plugged into Core router. Pings ok, Traceroute ok, general basic diagnostics check out. Currently the printer is available to the network and responding to Ping.\n\nCore switch is in the server rack and network switch for the room is in the corner office of the of the floor of the office - which turns out is the access switch.\n\nChecking the ports of the Access Switch means being in the accountants office. Whilst doing this; a man pop's his head into the room UKITERN2 is in and says that he needs help with his computer NOW!! Whilst formulating a response the man becomes irate and says if he doesn't he's fired! (Must be serious UKITERN2 thought). UKITERN2 makes it clear he doesn't work for the company.\n\nMan: I DON'T CARE IF YOU ARE A TEMPORARY CONTRACTOR I WANT THIS FIXED NOW!\n\nUKITERN2: I think you misunderstand I work for ($Company) your accountancy soft... I'm not IT Support...\n\nMan: (Waves violently) NOW! (Face turns red)\n\nUKITERN2 gets greeted to the hotdesk on the clearly marked programme management set of desks which clearly doesn't have Ethernet but for some reason his docking station suspiciously does.\n\n\\---\n\nLooking at the issue appears to be that his laptop isn't getting Internet via Ethernet through his dock to his laptop. And the Wifi is abysmally bad.\n\nMan: SEE!\n\nUKITERN2: But wait- this is the project desk, how are you getting Ethernet? I've checked the switch over there and the plans and I don't see any Ethernet for these hotdesks?\n\nMan: We have (points) that we bought from ($Supplier) that we use off that ($Object)\n\nUKITERN2 traces the cable to find a garbled mess of wires from one of the Wired desks. An Ethernet HUB?!?!?\n\nUKITERN2 but its not configured correctly, that can't surely be a HUB?!\n\nUKITERN2 becomes curious and asks how it's powered. Well it's in the 4 gang switch that gets swiched on from the hotdesk... It's NOT A Hub BUT A CABLE ROUTER WITH DHCP!\n\n\"Holy Guacamole!\" UKITERN2 thinks to himself! And grabs local IT and the ($Company) IT Manager to look at this.\n\nBetween the wireless, ancient Cat5!!! cabling, the Router and some network devices that have clearly been there since the late 2000s. And just repurposed.\n\nUKITERN 2 hears the IT Manager say \"Hey is that the old Netgear switch?\"\n\nThe man interrupts that one of the programme managers had rolled off one of the jacks and had rolled his own mini network within the network to the programme managers desks.\n\nClearly no one thought to tell local IT at ($Company) this. As they start untangling the mess to assess the damage. Clearly the printer and some other devices were getting a different DHCP reservation because of the unauthorised hardware.\n\nAlso known as Shadow IT. Plugged into the network, doing stuff it shouldn't be.\n\n\\---\n\nUKITERN2: \"Well this is looks like your problem, shadow IT\"\n\nIT Manager: \"Guess since you solved it, you're looking for a payout for the printer? I think this should come from their budget, since it's their issue?\" (Office politic ensues for 10 minutes)\n\nUKITERN2: \"Sorry would you mind if I leave and head back to my office? Happy to mark up the ticket for payment and close the issue. Would you mind if I test the theory? Just to be sure?\"\n\nIT Manager \\*Nods\\*\n\nAfter testing that the printer indeed is getting the wrong DHCP reservation- or rather the kind-of right one but behind a NAT created by said device. All our pings and traceroutes were on that network segment in that room, hence no one noticed.\n\nIT Manager: (Looking a bit like an idiot that he didn't notice the problem) \"So the price will be ($Cost) from callout fees, time spent on site etc?\"\n\nUKITERN2: \"I'll ticket it up so you get the hours and I'll also raise up which budget it will come out of, hey look if it wasn't for this ($Man) I might never have known myself so don't put yourself down\"\n\nIT Manager looks like he took some solace in the understanding\n\nMan: \"What do you mean? You work for us?\"\n\nUKITERN2: \"Again, I'm not Tech Support\"\n\n\\---\n\nOn getting up the ticket, adding his hours and also adding comprehensive notes. He awaits payment- quite a hefty sum by some standards but a job well done. Not just the hours but the callout fee.\n\n\"Going to be quite the payday!\" UKITERN2 thought to himself.",
        "created_utc": 1674922842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctors Office Running Windows 98 and XP Computers with NT4 Server connected to 10MB HUB!!! (Part 1)",
        "author": "evelynsilver7967",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ncxyl/doctors_office_running_windows_98_and_xp/",
        "text": "[removed]",
        "created_utc": 1674905133,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's not broken just because you expected a smaller number.",
        "author": "PashPrime",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10mx7cg/its_not_broken_just_because_you_expected_a/",
        "text": "I work as a Biomedical technician, maintaining all the medical equipment in a hospital. We work on many things, but we all work on medical patient weight scales.\n\nMost scales nowadays are very accurate and keep their accuracy for quite sometime, needing only a calibration check every year. \n\nEvery so often we get a call requesting their scale be calibrated because it is *definitely out of calibration*, as they say. So I haul 100 pounds (45.36kgs) of medical grade calibration weights over for a quick calibration check, and 10 times out of 10, it is within calibration. \n\nWhen I report my findings to the end users I often get the same response. Someone throws a quick frown... Because they used themself as the weight reference point. I am fairly certain the requesters train of thought prior to calling was *but my scale at home says!* but I can't stop the inevitable process of hurt feelings.",
        "created_utc": 1674856336,
        "upvote_ratio": 1.0
    },
    {
        "title": "The mysterious recurring mouse problem",
        "author": "Pertolepe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ms1rd/the_mysterious_recurring_mouse_problem/",
        "text": "Get a call. \n\n\"yeah I need to keep restarting because after like 30 minutes my mouse won't click\"\n\n. . .\nOkay weird.\n\nGo up and see it first hand, unplugging and replugging the mouse doesn't fix it. After a reboot it works again just as the user said. Alright. Try uninstalling stuff in device manager, rebooting to let drivers reinstall. Same issue. Different mouse. Same issue. Finally realize that opening the laptop lid and using the track pad seems to work but still, after it's been shut a while the issue returns. Eventually it gets to the point of an entire windows profile rebuild. Same issue. \n\nKeep scratching my head. Open the laptop. Notice that there's a stick-on webcam cover that's protruding out a bit. Realize that when the lid is closed it just presses down the left mouse button on the track pad. \n\n\"uh is this new?\"\n\n'yeah just got it from some CLE we were in'\n\nTear it off. Back to normal.\n\nWe had 4 more calls that week with the same problem and everyone had gone to the same CLE and had the same webcam covers. I'd just get the call, walk in, open the lid, tear off the cover, explain briefly then dip.",
        "created_utc": 1674844038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highest paying callout",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10mou2u/highest_paying_callout/",
        "text": "I read something recently that reminded me of this story from a discussion about the best money/time ratio work they had ever done. It's not very impressive, but this is mine.\n\nA customer came in close to closing one day asking for advice as he was fighting with his ISP. Some issue he'd had going on for ages that was hampering him starting his own new business. \n\n&amp;#x200B;\n\nCustomer: \"Hi, I was hoping you could help me with a problem. I've got internet that hasn't worked since it was installed, my ISP is saying it's an issue with my computer and I don't think it is\"\n\nMe: \"What kind of service is it?\"\n\nCustomer: \"dialup\"\n\nMe: \"And what are you connecting it to?\"\n\nCustomer: \"My laptop\"\n\nWe sold three types of \"modem\" cables. All RJ11 to BT plug (a quick look tells me \"*BS 6312 431A plug, colloquially a British Telecom 4-wire male plug\" -* yes wikipedia that just rolls off the tongue in casual conversation doesn't it?*)* with different pinouts. MyBoss had told me one was for desktop modems, one for laptops and another we never ever sold. I didn't know what the technical difference between them was and still don't. \n\nMe: \"You might have the standard desktop cable, you can try this laptop one, £3.95\"\n\nCustomer: \"I've been at this so long, I'm really not interested in try this try that. I was hoping I could get you to come out and look?\"\n\nMe: \"I reckon it's this and it's much much cheaper than a callout\"\n\nCustomer: \"I really have just had enough with the ISP, I just want it sorted, today, done and dusted\"\n\nMe: \"Sure I get it, but seriously I'd charge for the callout no matter how little work I do. You're much better off just buying the cable and trying it\"\n\nCustomer: \"Thanks but honestly I'm sick to the back teeth with trying one more thing one more thing, I really just want it fixed and I get on with my life. What are your rates?\"\n\nMe: \"£40 for the callout and the first hour, £15 for every hour or part hour after that\"\n\nCustomer: \"I was thinking more like £20 for a quick look?\"\n\nMe: \"It's £40 callout for my time, sorry\"\n\nCustomer: \"I'm trying to get this internet up and running to start my own business, I really can't spare more than that\"\n\nMe: \"Sorry but those are my rates. Getting out to you, getting home, for the loss of my evening. It's not just about the work\"\n\nCustomer: \"It's not far from here\"\n\nMe: \"I don't drive, everywhere is far from here\"\n\nCustomer: \"It's only on Roady McRoadface Road\"\n\nMe: \"OH\"\n\n&amp;#x200B;\n\nHe was a little pushy but not in an entitled, never take no for an answer way so much as never take no as the first answer. Normally I turn off and stop listening to this type but he was polite and not unreasonable, I didn't get any red flags or feeling of making hassle for myself later. Meh, I'm in a good mood for once.\n\n&amp;#x200B;\n\nMe: \"That's just round the corner from where I live. Tell you what. I'm 99% sure it's going to be this cable. Come back in 10mins when we close, give me a lift, and I will give you 15mins. It's no fix no fee anyway so either I get it done and it's £20, or I can't do it in quarter of an hour and I won't charge you anything, I just call it quits\"\n\nCustomer: \"DONE!\"\n\n&amp;#x200B;\n\nWe get to his place and I try to dial up with what he has so far, no joy. I swap the modem cable with one I brought with me, that too failed. But I think, technically the request is to prove to the ISP the fault isn't with the customer. \n\nMe: \"Well that's still not working but I can do one more thing, can I get your mobile number?\"\n\nCustomer: \"Sure, it's &lt;mobile number&gt;\"\n\nI create a new dialler through the Control Panel with his number and it rings through. Huh, I think I still remember he had a dark blue Nokia 3310 which lit up with his home phone number.\n\nMe: \"That's the best I can do but what we proved is your laptop is able to make an outgoing call. The ISP should provide you with their own dialler, the equivalent of the one I just made, with the correct config for their network. If you tell them we've proven this much it's on them to prove to you it's not a fault their side\"\n\nCustomer: \"I can accept that, thank you for coming and £20 as agreed. What about the cable?\"\n\nMe: \"Keep the cable, no worries\"\n\n&amp;#x200B;\n\n£20 for 7 minutes. It's nothing compared to the stories I've seen here involving international flights to turn it off and on again. But I go via the shops and get home with a freshly baked pizza and a bottle of wine, still earlier than if I'd set off from work on foot. Still a couple of quid richer and slightly more summer evening to myself. Nice.",
        "created_utc": 1674836384,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I got some of everything!",
        "author": "fuknthrowaway1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10mjjao/i_think_i_got_some_of_everything/",
        "text": "Was flipping through looking for something to watch on TV earlier, saw Office Space, and got reminded of this one from early in my career.\n\nIt was just coming up on six, I'm on my way out, and the phone rings.\n\nCaller-ID says it's an executive, better answer.\n\nAfter some chit-chat it sounds like his keyboard has been recently 'coffee enhanced'. No biggie, we've got a ton of spares and he's high enough up the food-chain I don't even need permission. \n\nI ask how long he'll be in the building, he tells me he was about to leave. Small world, me too! I'll be by in the morning with a new one.\n\nWe meet up at 8am, he lets me into his office and there's a series of dust voids where his PC should be.\n\n&gt;Me: Dude. Where's your computer?\n\n&gt;Guy: I thought you were bringing a new one!\n\n&gt;Me: A new *keyboard*. What'd you do with the rest of it?\n\nSilence.\n\n&gt;Guy: I, uh.. Took it home.. And, uh, used it for target practice.\n\n&gt;Me: You know those things have all sorts of toxic chemicals in them, right?\n\nMore silence.\n\n&gt;Me: Okay, well. I can replace it, but I'm gonna need at least most of the old one back here to do that.\n\n&gt;Guy: I can do that.\n\nNot long after my lunch he came into the office with muddy knees and a handcart holding the box for a microwave. \n\n&gt;Guy: I'm sorry, a lot of the pieces are pretty small, but I think I got some of everything. There's a bit of dirt and grass in there too, I kind of had to hurry and I couldn't find a rake, so..\n\nI didn't even look, I just grabbed my own hand cart to roll the new PC upstairs. When my manager returned from lunch he didn't want to look either, so we labelled it with the inventory number from our records and stuck it in a closet.",
        "created_utc": 1674822210,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your memorable IT job interview?",
        "author": "IT_Tested",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10md5oz/what_is_your_memorable_it_job_interview/",
        "text": "I have had a couple interviews for IT jobs that will forever stick with me.  My very first attempt to break into IT was a dismal failure.  \n\nI worked for a government agency and PCs were new and I knew I wanted in.  I had spent a lot of time in the newly set up lab teaching myself the ins and outs of the PC, DOS, and Windows.  I also kept a lookout for a job that would be a decent \"starter\" job. Came across one that I was sure if I could talk my way into it I would be a decent fit.  I would have to spend my night studying up on a couple aspects that were in the job description but I didn't think it would be much of a problem.   \n\nso I applied and scored an interview.  Interview was with the branch chief and went well.  He knew less about PCs than I did.  At the end of the interview he said \"you know I think you would be a good fit here but I want you to come back Monday and interview with two other guys who are off today\". I said sure no problem.  Walked out knowing I was in like Flynn if I could get around the guys on Monday. \n\nMonday rolls around and I go in for my final interview, we pass pleasantries and with their next question I was telling myself \"self said I answer the rest of the questions straight up, don't even try to pretend, don't lie cause you ain't getting this job so do what you can to preserve your dignity and go back to your desk\".    The two guys were IBM engineers, who probably wrote DOS lol.  \n\nThe question? the one that I knew sealed my fate?  \"What does DOS do\"?  Hell I was self taught, I barely knew what DOS was let alone what it really did.  I said something along the lines of \"it translates what the user types into language that the computer can understand\"  way more simplified than they were looking for I am sure.  Interview lasted another 10 minutes or so, they said thanks for coming in, and I walked out and back to my desk with my tail tucked and went back to self study",
        "created_utc": 1674797307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dell XPS screen broke :(",
        "author": "a7700",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10m5pa3/dell_xps_screen_broke/",
        "text": " \n\nSo I emailed Dell about several issues I was having with my laptop including a hinge problem when my laptop was under warranty. They responded but recommended only software solutions. They then emailed to confirm solution but I couldn't get back to them as I was abroad and thus they close the request. The warranty then ended and my laptop's hinge was coming loose. I took it to an IT repair centre to fix it but they didn't finish the job and made it worse. When I opened the laptop, it wouldn't close as the hinges were fully out and bending against the screen. A few moments later the screen broke and there were lines all across it. My question is would there be any chance Dell would repair this for free if I emailed them. Or could I buy warranty for it and request them to fix it - I would feel bad about doing this if it was my fault it broke but it wasn't. Thanks  \n\n\nTldr: Could I buy warranty and ask dell to fix my laptop?",
        "created_utc": 1674775146,
        "upvote_ratio": 1.0
    },
    {
        "title": "DEJA DE HACER LO QUE ESTAS HACIENDO EN ESTE MOMENTO….AQUÍ PUEDES ATRAER A MUJERES",
        "author": "Zestyclose_Rain_3897",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10m1c8y/deja_de_hacer_lo_que_estas_haciendo_en_este/",
        "text": "[removed]",
        "created_utc": 1674764224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it rusty?",
        "author": "darkhelmet46",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lz51x/why_is_it_rusty/",
        "text": "[removed]",
        "created_utc": 1674758758,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you fix a laptop that won't boot in under a minute",
        "author": "aclatavimr",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lywah/how_would_you_fix_a_laptop_that_wont_boot_in/",
        "text": "Last year, Help Desk got a call from a user complaining that the laptop we issued him would not read DVDs. He was one of those \"I'm a very busy and a very important man, and I don't have time to follow your troubleshooting steps over the phone. Just fix it, dammit.\" kinda guys, so he said he would get someone to drop off the laptop at our office and pick up a loaner.\n\n \n\nWe received the laptop a couple days later, there was a note attached saying that now it wasn't even booting into Windows anymore. Sure enough, he was right - it didn't even attempt to load Windows, and instead we were greeted by the \"Non-system disk or disk error\" message. It sounded and looked like the PC was trying to boot from the DVD drive instead of the HDD.\n\n \n\nWe opened the disk tray, and saw the culprit. There was a DVD in there, all right - but it was placed upside down.\n\n \n\nWe flipped the disc over.\n\n \n\nHe was trying to watch \"Dumb and Dumber\".",
        "created_utc": 1674758133,
        "upvote_ratio": 1.0
    },
    {
        "title": "I already rebooted this morning",
        "author": "smoothies-for-me",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lwfxg/i_already_rebooted_this_morning/",
        "text": "[removed]",
        "created_utc": 1674751984,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Airport - Part 5",
        "author": "PersimmonOdd3806",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ltjup/the_airport_part_5/",
        "text": " One final story from the airport series for those that are interested. It is going to be another long one.\n\nI will leave you with my third FIDS (Flight Information Display System) and paging upgrade adventure. FIDS and Paging are basically two separate aspects of the same beast. For those of you who don’t know, FIDS are the screens that show your flight information at the airport. There are a few vendors that do this type of stuff. The first upgrade I was involved with was also quite the beast, but it pales in comparison to the third one. The second one I did was mostly just a computer upgrade from XP which was easy.\n\nSome background information on this. The FIDS aspect of the system is just a client/server application. There are feeds the airport subscribes to for flight information from third party vendors and the server basically downloads the information and the clients update. Just another piece of software running on a box really.\n\nThen there is the paging aspect which is made up of an audio over ethernet protocol I will refer to as snakenet. There are several components to make this happen including applications and equipment like DSPs, DACs, mixers, speakers, etc. It can be very complicated. The airport was divided into different audio zones and there were 7 in total and areas within that like zone 1 area 1 or zone 1 area 2, etc. Each zone had dedicated equipment like DSPs, mixers, speakers, and other related stuff.\n\nAnyway, on to the third upgrade of the paging system I was a major part of, the project consisted of upgrading our main server and upgrading all of the audio equipment with new stuff. The old paging system was stable but aspects of it were starting to fail due to age. It was funny in that some of the audio equipment would make announcements sound what airline folks said sounded like a \"Cylon\" due to audio distortion. Or sometimes the audio channels would just stop working. I would have to disable those audio channels once I identified them, but it started happening more and more. Identifying the problematic audio channels was a real pain and it would take hours to cycle through all of them with test announcements and monitoring which channel was firing. \n\nThe project began well in that we started building the new environment alongside the old one. Everything is mounted, staged, and ready to go. Cutover night came and we crossed our fingers for a smooth transition. This all began around 8pm on that night. We have two engineers from our FIDS/paging vendor onsite to resolve any issues and complete the install. All we have to do is replace paging stations and plug in the new equipment and we should all be good with all the prep work we have done. HAHAHA nope.\n\nWe switched out all of the equipment, so we were really at a point of no return. The first thing that happened was the new paging stations all crashed and went to an equivalent BSOD. The onsite vendor engineers went to work doing their best to resolve the issue with their development team. By the time the mid-morning rolled around, the vendor Dev team was able to somewhat stabilize our new paging stations. At least the airline staff weren’t yelling out to passengers as much during boarding. I felt really bad for those vendors and myself since we were running on 30 hours of no sleep again. Not our first rodeo though with an airport related project.\n\nThe airlines started attempting to use the paging stations regularly after they stabilized from the BSOD and we quickly found a problem in that only one paging station worked at a time. As I said, the airport was divided into audio zones so if one paging station was using a zone, the other paging stations were supposed to go to a recording mode. Neither are working properly in that recording mode isn’t coming on and the paging station is giving an error whenever there is a zone in use. It would be a few days before the development team figured that one out, but it did get fixed.\n\nThere were two other major issues. The first one was when making pages, only 4 audio zones could be activated and the airport had 7 zones total. The other problem was audio was dropping constantly. The problems weren’t fully related. The 4 zone activation issue was a big problem causing random zones to be silent and miss announcements. It was pissing passengers off when they are in the restaurant drinking and they miss the final boarding announcement. These issues began the week-long war of the vendor blaming the airport network and us blaming the vendor and their shit equipment and setup that was sold to us.\n\nThe first thing we focus on is looking at the zone activation problem. I worked with an engineer and a dev guy. I asked them why the hell this was going on when it didn’t happen before with the old system and they told me there was a built in restriction with the paging stations being able to activate so many zones on snakenet or the network is dropping it for some reason. Ironically the restriction prevented the paging mic from activating more than 4 zones at at time so there was the problem I felt. I don’t even know why this was a thing. I mean this vendor did larger airports than us so surely this behavior had been seen before? Maybe I was just naive.\n\nThe vendors did packet captures on the snakenet network segment and nothing really looks amiss, but they are still blaming the network. There wasn’t any progress on this until I asked them if there is a way to just broadcast to all zones and bypass the restriction on the paging station. Imagine that there was a way to override the restriction and just totally broadcast from the paging station so I have them turn it on and the problem goes away. The paging station is able to open up all of the zones without an issue. I am thinking I just absolved my network of any sins since the snakenet network segment was layer 2 only so no routing or ACLs at all. I suggested to the vendor to remove that damn restriction on all of the paging stations, but the engineers are hesitant because it could overwhelm our network. \n\nLet me just say I wasn’t worried about it because we had a very robust network and everything within the airport terminal had 10GB uplinks directly to the cores. That programming on the paging stations would’ve been inefficient for sure, but doable yes. The data throughput was nowhere close to our equipment limitations. It was enough to handle some audio streams for snakenet as well as hundreds of cameras. However I couldn’t convince them we went back to the drawing board.\n\nWhile the vendors are focusing on paging issues the airport is experiencing, I decide to monitor the new DSPs they installed. I had a hunch the audio drops for the background music and announcements are related to some type of configuration the vendors have set up. Sure enough all of the DSPs have 100MB interfaces and one of them has all of the snakenet streams coming from it. Snakenet basically required an audio stream for every zone. As I said there were 7 zones (one stream for each zone) and each stream required about 12MB of bandwidth. So 7, continuous 12MB streams on a 100MB interface. Do the math and we are looking at a saturated 100MB interface on the main DSP.\n\nI report my findings to the vendors and they are in denial about my findings at first. It wasn’t using the entire 100MB interface they tried to tell me. I retorted to the vendors if any of them had ever tried to do 5 unicasts using Ghost while trying to image 5 computers at the same time without it crashing or timing out and there were crickets. Looked my point finally got across.\n\nI ended up asking if there was a way to separate the audio streams from the main DSP. The main unit had a partner that wasn’t being used at all. There was some kind of internal link between the two DSPs. So I suggested they split the audio streams by doing 3 on one and 4 on the other and it would probably eliminate the audio drop issue. Again these engineers and dev guys were taken aback before stating they would get back to us.\n\nAfter several hours go by, the onsite engineer calls me and tells me the developers opted to do my suggestion. The also enhanced the design by splitting additional audio streams over the other DSPs to overcome the paging station restriction. The vendor made it so certain snakenet audio streams were always open between certain DSPs so they “tricked” the system into working basically so the default paging restriction of 4 zones wouldn’t be a problem. It took the development team about a day to do the new programming for our paging system, but it worked like a champ once it was implemented.\n\nI felt sorry for the onsite engineering that was still there. The gent had to stay 4 days longer than expected and I thought his fiance was going to dump him for being on the road so much that week.\n\nAnyway, I chatted with the onsite engineer for a bit after project wrapped up and I learned sometime later our FIDS/paging vendor took my design suggestions and made them standard for all new installs. Apparently, that design also saved their asses at one or two other installation sites as well. The onsite engineer quit that vendor sometime later for a job with more stable hours and less travel. I still think that vendor owed me some kind of consulting fee, especially with the 100s of 1000s the project cost. They could’ve spread a little my way, but I probably would’ve been fired because of the state gift law.\n\nAnyway, I was at the airport a couple of more years after this project. The odd hours and project demand just kept on building, and I started to get burnt out. With my young family and the demand the airport put on me, my wife eventually convinced me to quit. It was a hard decision because working at the airport was never dull and I was making bank, but the constant after hours needs, projects, and on-call were taking a toll on me. I ended up finding another job with one of the local municipal suburbs and taking a huge pay cut, but it was well worth it. And by now, I have pretty much gained back what I had lost in salary so it's all good.\n\nI wish you all well and thank you for reading my long stories.",
        "created_utc": 1674744709,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you reply?",
        "author": "durgwin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lsp4w/how_would_you_reply/",
        "text": "[removed]",
        "created_utc": 1674742352,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much money do you guys actually need?",
        "author": "HappyDutchMan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lp1ex/how_much_money_do_you_guys_actually_need/",
        "text": "[removed]",
        "created_utc": 1674729866,
        "upvote_ratio": 1.0
    },
    {
        "title": "The degradation of language in our IT dept.",
        "author": "Bossitronas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10ljv9f/the_degradation_of_language_in_our_it_dept/",
        "text": "[removed]",
        "created_utc": 1674708829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inherited Technical Debt, or: Wait wait, where's the domain controller?",
        "author": "ChickenPicture",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10lhzgg/inherited_technical_debt_or_wait_wait_wheres_the/",
        "text": "[removed]",
        "created_utc": 1674702852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customer solves their issue by making it worse.",
        "author": "Bondubras",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10leux0/customer_solves_their_issue_by_making_it_worse/",
        "text": "Not mine, but my dad's. Also more than a decade ago.\n\nDad used to work as an over-the-phone support technician.\n\nOne day, he gets a call and does his normal \"Tech support. How can I help you?\"\n\nThe customer, for their part is borderline incoherent with their speech: \" This f---ing piece of s--t won't get off it's a-- and do is god d--n JOB!\"\n\nDad: \"Sir? Sir? I can't help you if you don't tell me what the problem is. Can you describe your issue?\"\n\nCustomer: *about a minute of silence, only broken by a distant crash*\n\nDad: \"Sir? Are you still on the line?\"\n\nCustomer: *slightly breathy, but calmer* \"It's okay. I just threw the piece of s--t out the window.\"\n\nDad: *removes headset and silently mouths out 'oh my god' before putting headset back on* (forced cheerfulness) \"Have a nice day!\" *Click*",
        "created_utc": 1674693787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update on the Frankenprinter",
        "author": "LampeterRanger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10l3cbk/update_on_the_frankenprinter/",
        "text": "Lots of you asked for an update on whether Mick the accountant lost his job. Sorry its a bit delayed, but we'll, we've had OFSTED inspectors in (regulatory body for education) and the teachers have been stressed out. which makes my life not worth living seeing as waste flows downhill, and im at the bottom of a valley. \n\nMick the accountant still has a job. For now. This is because they decided that the full facts of the case are even worse than the frankenprinter. (He also, amazingly, remains unmurdered).\n\n1. The job he was printing was basically a how-to guide to tax evasion. We discovered this when he was ordered to send all printing no matter what, through us. \n\n2. This illegal how to guide contained large portions of a guide for accountants on how to spot tax evasion. This breaks the Copyright and Liscensing Act 1988 and makes both him and the college liable to a big fine if caught. \n\n3. He broke the Frankenprinter's replacement, beyond repair, in less than 24 hours. We're not sure how he did it (a cigarette was apparently involved, but not how you would think), but the printer company have declined to replace it even on a full service contract. they are also are reviewing the rest of their premises contract (one man is making a company question a mega lucrative contact).  \n\nSo there you go. Our policies are also changing. No more coming in while I'm out. I have to eat my lunch at my desk and we're not getting cameras, but they are paying for new handy dandy boxes for large print jobs so they don't look like paper boxes (though only an idiot can't tell the difference). Best of all, I have to do a presentation at the next all staff meeting on safe use and care for photocopiers. I have a 'care and feeding' sideshow, and with ITs help to move a copier on stage im borrowing a seven year old cousin to prove its so easy even a child can manage better than them.",
        "created_utc": 1674665656,
        "upvote_ratio": 1.0
    },
    {
        "title": "It wasn’t fun while it lasted",
        "author": "Nobel_107",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10krjy8/it_wasnt_fun_while_it_lasted/",
        "text": "\nA little back story, I worked for a help desk company for 3-4 years as a level 1-2 tech. We supported everything from medical practices to non for profit. One client in particular had a general manager (we will call him Joe) who knew enough to help troubleshoot most basic issues and everyone that worked in the same office was instructed to talk to Joe before contacting support. He would never do something he didn’t understand, he was reasonable with expectations and wasn’t afraid to ask for help. Everyone loved him. Due to his duties becoming more than he could handle he decided to nominate someone inside there organisation for the go to IT guy (we will call him Tom) at the start he was alright, asking questions learning about how things worked so on. Tom had requested an administrative account (both domain and office 365) I had followed the process to get him one including the legal form stating “any work done as a result of miss use of the accounts will be charged out of contract” and that “[insert my company here] is not responsible for any damages or lost of data due to miss use of this account” This was all signed. Gave him the accounts and then things changed. Tom was more demanding from us. Submitting tickets then calling 10 minutes later asking if they have been completed they hadn’t been assigned yet as there is a 5 minute time lag between us getting the email ticket getting created and then it getting assigned to tech’s. Tom had done this so much he managed to piss of everyone working for my company and I have anxiety spikes when he calls. Then one day. I come into the office sit down, log in and start working. 10 minutes into my shift the phone rings\n\nMe: Thanks for calling [insert company name here] you’re speaking with OP how many I help\nI should also mention I already knew who it was before I picked up the phone as I had is number saved in my contacts as “ass hat”\nTom: Hi, OP I have just sent a email about 5 mins ago requesting some data to be exported from our office 365 and wanted to know if it’s ready? The ticket number is …\nMe: Ok let me have a look.\n*checks ticket system*\nMe: I have the ticket here and it looks like it’s just been assigned as there is a 5 min time lag. This ticket will have to be escalated as it’s a request I’m not able to complete (the data had to be pulled using powershell and I wasn’t familiar with powershell) and that data can take some time to collect as you are asking for a lot of information. I’ll escalate this now and have a tech let you know once it is done via email with the data attached.\nTom: ok thank you\n*phone call ends*\n\n30 mins later the phone rings again with “ass hat” showing on call ID\n\nMe: Thanks for calling [instert company name here] you’re speaking with OP how many I help\nTom: Hi, OP just wanted to check if anyone is working on the ticket.\nMe: *checks the server we do all our powershell work on* yep it look like someone had started the process and it is currently running.\nTom: Do you know how long it will be?\nMe: The type of data you are pulling is quite a substantial amount of data this can take some time in itself. You also need to factor in Microsoft’s servers and the internet on both ends. I am unable to give you a ETA before the reasons listed before. A tech will contact you once this is completed.\nTom: *repeats again* Do you know how long it will be?\n*my anxiety is starting to spike as he will always push for answers even if you don’t have them*\nMe: *repeats myself*\nTom: can you find out for me?\nMe: Let me talk to the tech that it’s assigned to and see if he has a eta for you\n*places call on hold for 1 min then takes off hold*\nMe: I have spoke to the tech and he doesn’t have a eta for you but once it is ready we will send the information to you right away.\nTom: ok thank you.\n*call ends*\n\nAt this point in time my anxiety is quite high and I know he’s going to call back soon.\n\n30 mins later he calls back again and my anxiety is through the roof\n\nMe: Hey Tom.\nTom: How did you know it’s me?\nMe: I have your number saved in my contacts but since you have called a few times I didn’t think you would want to hear the greeting again. Let me check if it’s done. *log into the server still not done* Nope sorry not done. We will get it to you once it is done.\nThe tech it is assigned to told me to pass the call to him as he was tired of him calling\n*passes call to tech*\nHe basically got told that he isn’t our only client and every time he calls he delays the calls behind him and that we will send it once it ready.\n\nThat’s all I hear from him till later.\n\nFast forward till about 15 minutes before closing.\nThe phone rings and it shows as Joe\n\nMe: *picks up phone* Thanks for calling [insert company name here] you’re speaking with OP how many I help\nJoe: Hey OP I need you to have a look at a shared mailbox for me as no one can access it. (This mailbox is the most important mailbox in the organisation)\nMe: *looks and is unable to find it* that’s strange *looks in deleted mailboxes nothing called that mailbox* I’m sorry Joe I’m not able to find it but leave it with me and I’ll take a look and call you back.\nJoe: Thanks OP\n\n*Call ends*\nI keep looking for this mailbox and am unable to find it and that this point it is past closing so it’s after hours rates (some work is covered in there contract so this is fine) I found a email address in the deleted items with random numbers upon restoring it and giving the admin account access we found that someone had deleted the mailbox. The logs showed that Tom’s admin account had done this. Remember the legal for he signed to got those admin accounts?\n\nI call Joe with the biggest grin on my face knowing that I’ll have to let him know what had happened and that the 45-60mins we worked on this will be out of contract and 45 mins was after hours work so extra.\n\nThe next morning I come into the office with a nice email from Joe thanking us for our hard work and to let us know that Tom will no longer have any IT authority (this just means he can’t request changes) and to lock out the admin accounts as he won’t me needing them and that moving forward he was taking over role again.\n\nA few weeks later we got the request to lock out his work account. I have never been so happy to disable a account.",
        "created_utc": 1674626123,
        "upvote_ratio": 1.0
    },
    {
        "title": "The teacher keeps sending it back!",
        "author": "echo-mirage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10kizgt/the_teacher_keeps_sending_it_back/",
        "text": "This happened about 20 years ago. My aunt called me to come over and help, because she had helped  my cousin type up (read as: done the typing for him) a paper for school that needed to be APA formatted, and the teacher had sent the paper back twice because the margins were all crooked and looked nothing like it was supposed to.\n\nSo I go over there, and she fires up the document in Word. I have never in my life seen so many squiggly multi-colored underlines. Word did not like one single thing about the spacing and formatting of anything, so it was having as absolute shit-fit flagging everything as wrong.\n\nI know, because I was still in school myself, that APA formatting dictates that (among other things) the margins need to be 1 inch all around. I click on Word's handy right+left justify icon, then try dragging the margin markers around. Word is dutifully moving things around, but no matter what I tried the margins are still all jagged and uneven. \n\nSuddenly, it hits me. \"Did you hit the Enter key near the end of EVERY line?\"\n\nHer: \"Yes! Isn't that how it works?!\"\n\nShe's not an idiot. To be fair to her, she had learned to type 2-3 decades ago on a typewriter. It never once occurred to her that spacing and margins could be adjusted on-the-fly or after the fact.",
        "created_utc": 1674601040,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"But I don't need those! I don't know what they say!\"",
        "author": "texas1st",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10kdl7m/but_i_dont_need_those_i_dont_know_what_they_say/",
        "text": "This actually happened twice. With the same guy doing it both times.\n\nThis was in the early 90's when I was working for my dad's company doing systems support and helping to do product development.\n\nThe \"customer\" was my dad.  We worked together in the same office, and that was fun. Had to talk with him that the family ended at the door, and that this was business.  He'd had my brothers and sisters work with/for him before, but I think I was the first to get him to agree to that differential.\n\nHe had a computer running MS-DOS (6.22?) and Win 3.11. He used Word Perfect 5.1 for his documents.  One day he says \"hey, texas1st, my computer won't start!\".  So I go over and it's telling me the system is not found. Wha?  I reboot it, and make sure the drive is configured properly in BIOS, no errors on POST, but it just won't boot into DOS.  I grab a boot floppy, and boot to that. Then I go look at the C drive. Autoexec.bat is missing as is config.sys. what?? Try running win.exe and it won't boot. Well, my boot floppy may not have a sufficient path set up to run Windows. So I manually change directories and there are no files there. I me tion a lot of files are missing. Dad says, \"Oh, I deleted a bunch of junk yesterday. \"\n\n...\n\n\"You...deleted...junk.\"\n\n\"Yeah, I was looking for (whatever it was) and found I had a bunch of junk files I couldn't read or Word Perfect wouldn't open. So I just deleted them.\"\n\n...\n\n\"Dad, you couldn't read them, but the computer could.  Those are what tell the computer what to do and how to work.\"\n\n\"Oh...\"\n\nWound up copying his files to floppy, blanking the drive, and starting over.\n\nThen a few months later, he called me over and had the same problem.\n\nAfter confirming my suspicions, I said, \"Dad, do you remember our talk a while back?...\"\n\nHe finally got it and I don't think I had to do it again after that, but was always fixing something for him.",
        "created_utc": 1674587942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facepalm - Online training is wrong.",
        "author": "kevin75135",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10kbegd/facepalm_online_training_is_wrong/",
        "text": "OK.  I work for a large organization that requires everyone to take different Online Training for various things.  Today I was assigned \"Information Security Awareness\".  Now I have 20 years of IT experience.  I am not currently working for the IT department, but I work for a department maintaining specialized equipment only used by that department.  Like most organizations, we are a Windows environment and use Microsoft Servers and Desktops for everything.\n\nDuring the course, you can take a pretest and if you get a 100% you can skip the 2 hours of mind numbing dumbed down explanations of what you should and shouldn't do on your computer.  During the course I am asked the question \"A computing account uniquely identifies:  A.  A user on the Network, or B. A computer on the network.\" I mean I think I know what they mean, in a User account, as previous questions were about passwords and such.  Or do they mean a computer account, which does identify the computer, but is usually unknown and behind the scenes to a user.  But I thought maybe that do get into the differences in the lecture, so I selected B, a computer on the network, as that does at least sound the least incorrect.   I got it wrong and had to put up with the extremely basic security talk, which they never once mentioned a computer account.  It did refer to User Accounts as \"Computing Accounts\" several times.   I think the non IT people that created the training are punishing those of us who know more about IT security than they do. (Same people do training on sexual harassment (didn't  learn how to harass anyone), how not to clean up broken glass, etc.",
        "created_utc": 1674582701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech Shop Stories from the early days",
        "author": "Lazlo8675309",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10k8is6/tech_shop_stories_from_the_early_days/",
        "text": "[removed]",
        "created_utc": 1674575434,
        "upvote_ratio": 1.0
    },
    {
        "title": "It wasn’t fun while it lasted",
        "author": "Nobel_107",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10k628b/it_wasnt_fun_while_it_lasted/",
        "text": "A little back story, I worked for a help desk company for 3-4 years as a level 1-2 tech. We supported everything from medical practices to non for profit. One client in particular had a general manager (we will call him Joe) who knew enough to help troubleshoot most basic issues and everyone that worked in the same office was instructed to talk to Joe before contacting support. He would never do something he didn’t understand, he was reasonable with expectations and wasn’t afraid to ask for help. Everyone loved him. Due to his duties becoming more than he could handle he decided to nominate someone inside there organisation for the go to IT guy (we will call him Tom) at the start he was alright, asking questions learning about how things worked so on. Tom had requested an administrative account (both domain and office 365) I had followed the process to get him one including the legal form stating “any work done as a result of miss use of the accounts will be charged out of contract” and that “[insert my company here] is not responsible for any damages or lost of data due to miss use of this account” This was all signed. Gave him the accounts and then things changed. Tom was more demanding from us. Submitting tickets then calling 10 minutes later asking if they have been completed they hadn’t been assigned yet as there is a 5 minute time lag between us getting the email ticket getting created and then it getting assigned to tech’s. Tom had done this so much he managed to piss of everyone working for my company and I have anxiety spikes when he calls. Then one day. I come into the office sit down, log in and start working. 10 minutes into my shift the phone rings\n\nMe: Thanks for calling [insert company name here] you’re speaking with OP how many I help\nI should also mention I already knew who it was before I picked up the phone as I had is number saved in my contacts as “ass hat”\nTom: Hi, OP I have just sent a email about 5 mins ago requesting some data to be exported from our office 365 and wanted to know if it’s ready? The ticket number is …\nMe: Ok let me have a look.\n*checks ticket system*\nMe: I have the ticket here and it looks like it’s just been assigned as there is a 5 min time lag. This ticket will have to be escalated as it’s a request I’m not able to complete (the data had to be pulled using powershell and I wasn’t familiar with powershell) and that data can take some time to collect as you are asking for a lot of information. I’ll escalate this now and have a tech let you know once it is done via email with the data attached.\nTom: ok thank you\n*phone call ends*\n\n30 mins later the phone rings again with “ass hat” showing on call ID\n\nMe: Thanks for calling [instert company name here] you’re speaking with OP how many I help\nTom: Hi, OP just wanted to check if anyone is working on the ticket.\nMe: *checks the server we do all our powershell work on* yep it look like someone had started the process and it is currently running.\nTom: Do you know how long it will be?\nMe: The type of data you are pulling is quite a substantial amount of data this can take some time in itself. You also need to factor in Microsoft’s servers and the internet on both ends. I am unable to give you a ETA before the reasons listed before. A tech will contact you once this is completed.\nTom: *repeats again* Do you know how long it will be?\n*my anxiety is starting to spike as he will always push for answers even if you don’t have them*\nMe: *repeats myself*\nTom: can you find out for me?\nMe: Let me talk to the tech that it’s assigned to and see if he has a eta for you\n*places call on hold for 1 min then takes off hold*\nMe: I have spoke to the tech and he doesn’t have a eta for you but once it is ready we will send the information to you right away.\nTom: ok thank you.\n*call ends*\n\nAt this point in time my anxiety is quite high and I know he’s going to call back soon.\n\n30 mins later he calls back again and my anxiety is through the roof\n\nMe: Hey Tom.\nTom: How did you know it’s me?\nMe: I have your number saved in my contacts but since you have called a few times I didn’t think you would want to hear the greeting again. Let me check if it’s done. *log into the server still not done* Nope sorry not done. We will get it to you once it is done.\nThe tech it is assigned to told me to pass the call to him as he was tired of him calling\n*passes call to tech*\nHe basically got told that he isn’t our only client and every time he calls he delays the calls behind him and that we will send it once it ready.\n\nThat’s all I hear from him till later.\n\nFast forward till about 15 minutes before closing.\nThe phone rings and it shows as Joe\n\nMe: *picks up phone* Thanks for calling [insert company name here] you’re speaking with OP how many I help\nJoe: Hey OP I need you to have a look at a shared mailbox for me as no one can access it. (This mailbox is the most important mailbox in the organisation)\nMe: *looks and is unable to find it* that’s strange *looks in deleted mailboxes nothing called that mailbox* I’m sorry Joe I’m not able to find it but leave it with me and I’ll take a look and call you back.\nJoe: Thanks OP\n\n*Call ends*\nI keep looking for this mailbox and am unable to find it and that this point it is past closing so it’s after hours rates (some work is covered in there contract so this is fine) I found a email address in the deleted items with random numbers upon restoring it and giving the admin account access we found that someone had deleted the mailbox. The logs showed that Tom’s admin account had done this. Remember the legal for he signed to got those admin accounts?\n\nI call Joe with the biggest grin on my face knowing that I’ll have to let him know what had happened and that the 45-60mins we worked on this will be out of contract and 45 mins was after hours work so extra.\n\nThe next morning I come into the office with a nice email from Joe thanking us for our hard work and to let us know that Tom will no longer have any IT authority (this just means he can’t request changes) and to lock out the admin accounts as he won’t me needing them and that moving forward he was taking over role again.\n\nA few weeks later we got the request to lock out his work account. I have never been so happy to disable a account.",
        "created_utc": 1674568642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another Old Guy Story",
        "author": "Quadling",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10jx1g1/another_old_guy_story/",
        "text": "[removed]",
        "created_utc": 1674534324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tech support in the deserts of Jordan",
        "author": "5parky",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10jfqla/tech_support_in_the_deserts_of_jordan/",
        "text": "[This post reminded me](https://www.reddit.com/r/talesfromtechsupport/comments/10itwss/sometimes_it_pays_to_be_the_old_fart/) of some tech support that I did while I was overseas.  I wasn't there to do tech support, but being the biggest nerd in the unit, I ended up fixing everyone's laptops, including those that had been issued.  \n\nTo really get into this story, I have to introduce you to Namrac.  Namrac was an architecture student, but his knowledge was annoyingly all encompassing. He would share all of his knowledge with you at length, and would argue with you about everything for just as long. Once, I even told him that he would argue with a sign post, and he instantly responded with, \"I WOULD NOT!\"\n\nAnyway, on to the story.\n\nNamrac's laptop had started malfunctioning to the point where it wouldn't even post.  The BIOS would flash briefly, and it would power down. He was lamenting non-stop the fact that he'd have to wait weeks for a new laptop to make it from the US, and he'd been using everyone else's laptops to check his emails. I walked over to his laptop, popped the battery and power supply, held down the power button for 10 seconds.  I then restored power to the laptop, and booted it up.\n\nNamrac: WHAT ARE YOU DOING TO MY COMPUTER!  IT'S ALREADY BROKEN WHY ARE Y... &lt;blink blink&gt; OMG THANK YOU!",
        "created_utc": 1674489293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just another of those days",
        "author": "Old-Full-Fat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10jd1m0/just_another_of_those_days/",
        "text": "You know what it's like, you get to the office, pour your first coffee and tip it all over the desk.  This was going to be another one of those days, wasn't it?\n\nContext - not working directly in IT but also not directly for tech support.  I worked as a Field Application Engineer in the UK (remember the country for later) for an industrial network device manufacturer.  However, your name and number get around so you receive some of \\*those\\* calls now and again.  \n\nJust finished wiping down the desk and underside of the keyboard when ..... RING, RING!\n\nDCust: Hi OP, it's DCust.  We received the switches we ordered as we discussed a few weeks ago and one of them is dead.\n\nOP:  That's OK.  If it's dead on arrival we can replace it quickly but if you are tight on your deployment deadline (I knew he was) I can send you a loan unit in the meantime.  What exactly is wrong?\n\nDCust:  It is totally dead.  No lights on the front or back panel at all.  \n\nOP:  Have you checked the fuse?\n\nDCust:  Just off for a meeting so I'll check and call you back.\n\nWhy do folks ring when they don't have time to do the most simple of things to check and need to rush off????\n\n2 hours later.  RING, RING!\n\nDCust:  Hi OP.  I couldn't find anything in the documentation so I took the panels off and couldn't find a fuse at all, is it in the power supply module?\n\nOP:  What!  (\\*UK mains plugs have a fuse inside them\\*)\n\nOP:  Did you check the fuse in the plug?\n\nDCust:  Yes and it was duff but just in case I left all the case panels off and plugged it in.  YAY!  Panel lights all came on and I could connect to the switch over ethernet.  But then I dropped a screwdriver into the guts and now it is dead again.  Is there another fuse?\n\nOP:  \\*SIGH\\* (Deep Thoughts - At least he owned up but why strip it down before checking the plug fuse?????)\n\nI give up.",
        "created_utc": 1674482168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone from Afghanistan asked for support with our time management software",
        "author": "WeightRemarkable8139",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10j9hz0/someone_from_afghanistan_asked_for_support_with/",
        "text": "[removed]",
        "created_utc": 1674470157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terminating resistors are omni directional, right?",
        "author": "HeadacheCentral",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10iwp3k/terminating_resistors_are_omni_directional_right/",
        "text": "[removed]",
        "created_utc": 1674427669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes it pays to be the old fart.",
        "author": "IT_Tested",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/10itwss/sometimes_it_pays_to_be_the_old_fart/",
        "text": "I have been doing IT in one form or another for 40 years.  Am reminded of a story when I was an IT contractor in Iraq. This would have been around 2006 or so.  I started out as a help desk tech in 2003 but by 2006/7 had moved into a Network job due to some fortuitous circumstances.  One day one of the help desk guys came in and asked me to come over to their office as they had a problem they couldn't figure out. \n\nGot over there and they had a computer that they were rebuilding.  The guy working on it said they had \"successfully\" loaded the OS (windows) n less than 4 times but every time they went to boot the system it would not boot up.  They figured if anyone could tell them what was wrong I could.  I asked a few questions and got satisfactory answers which told me they were doing mostly the right stuff but obviously missing something.   Then while looking at the front of the machine ... I was like ..Wait a second ... \n\nMe:  is that a SCSI drive   \nTech:  yeah why?  \nMe:  Did you load the SCSI drivers while you loaded the OK   \nTech: wellll shit  \nMe:  yep. you gotta do that or it isn't going to work.\n\nThe tech doing the work knew but had forgotten.  couple of them had no idea there was such a thing, or a procedure",
        "created_utc": 1674420771,
        "upvote_ratio": 1.0
    }
]