[
    {
        "title": "Honey, Im booring so much! Let's have some fun together. Oq3dqWFSW",
        "author": "lighporcua",
        "url": "http://hawaiifive-orealty.com/47520160226.php#3zdjOtDxeU",
        "text": "",
        "created_utc": 1456693589,
        "upvote_ratio": ""
    },
    {
        "title": "Are you looking for some fun sweety. Just sign up for sex j4Lzcsxhz",
        "author": "doubteotei",
        "url": "http://roberthedeenacoustics.com/47520160226.php#MfvIrzzu",
        "text": "",
        "created_utc": 1456690214,
        "upvote_ratio": ""
    },
    {
        "title": "Like Russian girls? Want to look at them online? Then you just to us. KwJ5nSy6HkU",
        "author": "oplimor",
        "url": "http://castlelodges.com/41720160226.php#5xZFoL",
        "text": "",
        "created_utc": 1456678879,
        "upvote_ratio": ""
    },
    {
        "title": "Come see me in free video chat. My name:UrBunny. 7lwSnmoK0a",
        "author": "ledgcomphand",
        "url": "http://freshaquaponics.com/50520160226.php#hLTDw68Rp",
        "text": "",
        "created_utc": 1456674336,
        "upvote_ratio": ""
    },
    {
        "title": "Someone stole my clothes, but what will dance for you, registration and ofc 9QlmdP",
        "author": "preschurka",
        "url": "http://txtrumpet.com/2820160226.php#Z6bPrxqY",
        "text": "",
        "created_utc": 1456670550,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a partner to have fun. Just registred and YzXPDuOK",
        "author": "compbestdo",
        "url": "http://readingtruck.com/41720160226.php#S5sUnNKhMEK",
        "text": "",
        "created_utc": 1456668132,
        "upvote_ratio": ""
    },
    {
        "title": "We are sweet g1rls love and seeeeeex 9tq14x0V1f9",
        "author": "liliden",
        "url": "http://1stchoicefinancialgroup.com/dimbilim.php#zKVdr",
        "text": "",
        "created_utc": 1456608602,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you! I will recommend Telegraph dating to friends and colleagues JpnoF9K",
        "author": "diedaco",
        "url": "http://crowdfundrr.com/22720160226.php#Ldn9Gei2oM",
        "text": "",
        "created_utc": 1456599515,
        "upvote_ratio": ""
    },
    {
        "title": "I have really enjoyed your site and I have met a new lady and things are going well UikI2Kc1",
        "author": "catchdislind",
        "url": "http://yicairen.com/405.php#6sTCjR",
        "text": "",
        "created_utc": 1456594836,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you for giving me the opportunity to find my perfect match. XjjRwAoT",
        "author": "trinircon",
        "url": "http://solutionsaddiction.com/200.php#BhyVlM7RS",
        "text": "",
        "created_utc": 1456591267,
        "upvote_ratio": ""
    },
    {
        "title": "I've found the perfect girl - the love of my life S2xDpwhkUi",
        "author": "adbalwebp",
        "url": "http://nexteducation.com/7.php#L4wxkqc",
        "text": "",
        "created_utc": 1456586628,
        "upvote_ratio": ""
    },
    {
        "title": "Pussy-licking",
        "author": "hargbirthpred",
        "url": "http://espacloud.com/7.php#YYPU20",
        "text": "",
        "created_utc": 1456583478,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the most enjoyable ways you might have a quick sex session with your partner? aPkoMeCaO",
        "author": "yxzwkjd",
        "url": "http://tqwo.com/7.php#NOswQTZ",
        "text": "",
        "created_utc": 1456527779,
        "upvote_ratio": ""
    },
    {
        "title": "H1i! Y_0_u l_o_ve s::::x! 92ynE33IpH3",
        "author": "cgqienxkwa",
        "url": "http://southfloridaoptimist.com/KaVDZUhWvD",
        "text": "",
        "created_utc": 1456431316,
        "upvote_ratio": ""
    },
    {
        "title": "Not busy? No cards and stuff. Just sign up and sex JnkNSLZQI",
        "author": "ndegzatfkwcmqxijy",
        "url": "http://lttbroadband.com/tGMey6eXgC",
        "text": "",
        "created_utc": 1456424498,
        "upvote_ratio": ""
    },
    {
        "title": "You have long had sex with a girl? Let's agree on vsteche. Join Now - it's free! EzKi25uQkKN",
        "author": "gokqmrptyixfa",
        "url": "http://morecasual.com/qbueeR",
        "text": "",
        "created_utc": 1456361037,
        "upvote_ratio": ""
    },
    {
        "title": "ATTENTION! NOT A Dating! gAaH4fIt6E6C",
        "author": "tistcycphyo",
        "url": "http://b8u02mx2.m111elasej.com/2IQO",
        "text": "",
        "created_utc": 1455995712,
        "upvote_ratio": ""
    },
    {
        "title": "You Want sexxy girls? Yes! Here 4p_Qw_H5_6kWs_F",
        "author": "nR_8W6f_r_7DS",
        "url": "http://evrazis.com/k_8P_2Ax5z_J_",
        "text": "",
        "created_utc": 1455467023,
        "upvote_ratio": ""
    },
    {
        "title": "Sex With Sexxxy Girls? Yes!? - Here P_q23D_j_tG75",
        "author": "Nr2__7Lj9W",
        "url": "http://zhilservice77.com/6c_QM3k_i_5RH2",
        "text": "",
        "created_utc": 1455466072,
        "upvote_ratio": ""
    },
    {
        "title": "Sex With Sexxxy Girls? Yes!? - Here Y_g87oD__B",
        "author": "Zj8_q5_F_dP64_",
        "url": "http://zhilservice77.com/Gg4_i7_TQk6_3",
        "text": "",
        "created_utc": 1455464547,
        "upvote_ratio": ""
    },
    {
        "title": "Want Sexy g1rl? Here 4Xw_B_3a_2oAk_H",
        "author": "c_7P5rB__J3n",
        "url": "http://qeebra.com/y_2TRx_76D",
        "text": "",
        "created_utc": 1455456369,
        "upvote_ratio": ""
    },
    {
        "title": "You Want Sexy Girl? Here beautiful bW_97wG_f_6J2rS",
        "author": "2Pe__y8Z7A",
        "url": "http://a-miroman.com/rK_3_2Yg",
        "text": "",
        "created_utc": 1455453264,
        "upvote_ratio": ""
    },
    {
        "title": "Want Sex Today? Here super girls pB_5_d2Ts4K_6H",
        "author": "5Mp__4Raz_9H8",
        "url": "http://etalon-moscow.com/Gd4__3Kr",
        "text": "",
        "created_utc": 1455449127,
        "upvote_ratio": ""
    },
    {
        "title": "WANT hot sEx? Here W0MENS Aa8_4_pK_sF5tC3",
        "author": "Sg5__Gy2Q9_f_i",
        "url": "http://begilola.com/3Cp_g_P47Ti_t",
        "text": "",
        "created_utc": 1455446937,
        "upvote_ratio": ""
    },
    {
        "title": "You want hot sex? Here girls 9Ri__s2Ay8E",
        "author": "dB_93_bJq",
        "url": "http://gmt-clinic.com/D_c98gQ_",
        "text": "",
        "created_utc": 1455442448,
        "upvote_ratio": ""
    },
    {
        "title": "Sexy girls for hot sex here bG_7_n3YN_",
        "author": "xB_5M6t_f_",
        "url": "http://hearthstone-kulon.com/3i_FN_4t7",
        "text": "",
        "created_utc": 1455378742,
        "upvote_ratio": ""
    },
    {
        "title": "Here sexy girls for sex 7m_FR2i_3_Wc",
        "author": "o_2D_Li94w_",
        "url": "http://everydatum.com/5Ep_Pj_6",
        "text": "",
        "created_utc": 1455374553,
        "upvote_ratio": ""
    },
    {
        "title": "live bear bad, dead bear not so bad, but...",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/42mw9v/live_bear_bad_dead_bear_not_so_bad_but/",
        "text": "Bear attempted to take my cave as own.  I wait until bear try to exit cave. Smash with large rock on head, then stab with best spear til dead. Only took one claw to arm. herb woman patch with green stuff. \n\nDead bear was fair food. but soft fur usually goes icky soon after.  I was so angry i pissed on bear fur; and buried in sand near salty water.   went back later and found fur was soft. not rotting. \n\nMe now upgrade bed with bear fur!\n\ntl, dr; piss on bear!",
        "created_utc": 1453746849,
        "upvote_ratio": ""
    },
    {
        "title": "integrate fire with cave",
        "author": "TeapotofWrath",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3ztogp/integrate_fire_with_cave/",
        "text": "borak not live in cave. borak believe borak mention this before. why, then, do men live around borak always ask borak help with cave?\n\n\n\njocoto, dumb, ugly, say he light fire at mouth of cave. fine, say borak. not fine, say jocoto, fire make cave all smoky. borak know this natural trait of fire by cave. jocoto tell borak that fire must integrate with cave.\n\n\n\njocoto practically send borak brightly colored rock to tell borak to mess with jocoto. borak fed up with shit of jocoto, so borak tell jocoto burn weird leaves grow near cave. this make smoke go away, borak tell jocoto, for borak has trap to check.\n\n\n\nlater, borak go near cave of jocoto. jocoto, borak brother nok, borak other friends, all sit by fire, eat roasted meat like not eaten in week. cave still smoky, but now no one care.\n\n\n\nhas borak integrated fire with cave?",
        "created_utc": 1452138670,
        "upvote_ratio": ""
    },
    {
        "title": "Nok find something taste bad",
        "author": "blisstake",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3ydtb9/nok_find_something_taste_bad/",
        "text": "nok find something shiny in jungle. nok lick to see if it food and taste good. nok find it no taste good. then shiny jumped away. nok start to see sun god. did nok lick something he should no lick?",
        "created_utc": 1451207604,
        "upvote_ratio": ""
    },
    {
        "title": "pay no attention to the mon behind the burning bush.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3vyep1/pay_no_attention_to_the_mon_behind_the_burning/",
        "text": "Many day ago Grah ran to me yelling that the dead bush was yelling at her. Dead bush normally quiet so I went over to bush; expecting to find bear or boar in bush. \n\nBut the bush was on fire and screaming at me to do many things.  Since me not want to be on fire I backed away from bush, circling it like when we approach big cats when hunt.   That is when I spotted someone crouched behind rock.  I snuck around and got good look and it was clearly Mon. \n\nI picked up small rock and threw it at his head. Mon/Bush screamed loudly and then spotted me. He was not happy. \n\n\"why you ruin joke\" he scream. I hit him in head with another rock; and he fell down. \n\nDead bush burned out. I left Mon there to think about what he did. \n",
        "created_utc": 1449596765,
        "upvote_ratio": ""
    },
    {
        "title": "Hand not rock.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3u9fxm/hand_not_rock/",
        "text": "$rockchipper yell at me that hard rock not working to chip sharp rock.  that his hand hurt too much in process. \n\nI look. his hand is pulpy mess. he had been smashing rock on hand. \n\nI smash hard rock to $rockchippers's face and walk out. \n\n",
        "created_utc": 1448484239,
        "upvote_ratio": ""
    },
    {
        "title": "Rock smash rock.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3tgtnb/rock_smash_rock/",
        "text": "smashing rock to make sharp rock for hunting. \n\nsmash rock normally chip sharp rock. \n\ntoday smash rock chip on new rock. \n\n\nNew rock smash more chips off sharp rock. \n\nshould i upgrade to new rock? ",
        "created_utc": 1447959263,
        "upvote_ratio": ""
    },
    {
        "title": "Too much fire. How less?",
        "author": "Swordude",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3t9uub/too_much_fire_how_less/",
        "text": "Me am new fire-maker-watcher for tribe. Last fire-maker-watcher no watch then no fire, many die. Before him fire-maker-watcher watch good, but no make fire-good, many die.\n\nI not want be like last and last-last fire-maker-watcher. I watch fire, I make fire. I put not-water tree in fire when small. \n\nFirst must tell this, some year ago, woman put corn in water pond in old cave, then we move cave, forget corn-water. Last moon-big, me find old cave, find corn-water pool. Taste funny, but not bad. I bring back, I show to chief. Chief likes, gives many clam for. Is happy for time, only few die.\n\nProblem start with Chief dum son. Not smart son who learn new hunting-ways. Dum son, sit in cave like woman. Hit lots by dumdum stick. Dum son steal Chief corn-water to drink, drink much, little left but Dum son covered in corn-water, corn-water make clumsy, Dum son fall into fire, usually not big problem, just need get out before am become flame. Even if become flame, water or dirt spirits help become not-flame.\n\nDum son become flame fast, too fast. Dirt not help, water not help, hit with DumDum stick small help, take many hits by me to make not-flame. Dum Son cry like baby to father, Say I not good fire-maker-watcher, say I made him flame, now I trouble. \n\nWhat I say to Chief?",
        "created_utc": 1447836965,
        "upvote_ratio": ""
    },
    {
        "title": "Fire fail to start?",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3t76da/fire_fail_to_start/",
        "text": "I build pyre of tree wood for Urg. \n\nUrg now on top pyre. \n\nclan is gathered around. Fire bow not making hot and small fire?\n\nbeen trying to start fire for time now. \n\nPlease help? Do needful?",
        "created_utc": 1447790345,
        "upvote_ratio": ""
    },
    {
        "title": "Urg head hard, Rock harder.",
        "author": "Capt_Blackmoore",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3t5xec/urg_head_hard_rock_harder/",
        "text": "Urg and me play rock after eat near cave before sundown.\n\n\nUrg throw big rock and me catch it. rock so big i land on ass.\n \nI throw rock at Urg. he catch with face. \n\nUrg fall. does not get up. \n\n\nDrag Urg into cave - but Urg not get up. \nwolf nuzzle Urg. Urg not get up.  Dump water on Urg. Urg not get up.\n\nHelp. how do wake Urg?\n",
        "created_utc": 1447773112,
        "upvote_ratio": ""
    },
    {
        "title": "Thagg, Decorator of Caves",
        "author": "andrinatron",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3me0il/thagg_decorator_of_caves/",
        "text": "Me woman. Man called Thagg. Thagg, Thagg woman and baby live in lovely cave. Thagg spend all sunlight search for bison, trade bison meat for nice thing. Thagg woman spend sunlight grow lizard-leaf, cook berry, keep baby safe, clean furs.\n\nThis hand of sun-jump Thagg swap bison meat for delivery large shiny rocks.\n\nThagg say \"Woman accept delivery,  Thagg hunt only short time then come home put rocks in nice place.\"\n\nRocks arrive, need assembly. Thagg woman unpack and assemble rocks.\n\nNext sun jump Thagg say \"Woman do good job. Thagg move big rocks.\" Thagg woman plant lizard-plants, move small rocks and shiny coloured pebbles, make part of cave beautiful.\n\nNext sun jump Thagg say \"Woman do good job. Thagg move big rocks.\" Thagg woman finish decorating other part cave, keep baby safe, help Thagg make bison trades.\n\nNext sun jump Thagg woman impatient. Woman move big rocks and make other part of cave beautiful.\n\nThagg say \"Thagg would have moved big rocks! \" Thagg move shiny colorful pebble from one part of cave to other part.\n\nThagg say \"Thagg make cave beautiful!\"\n\nThis how woman learn Thagg colourblind.",
        "created_utc": 1443217634,
        "upvote_ratio": ""
    },
    {
        "title": "dark cave worst place ever",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3lwfum/dark_cave_worst_place_ever/",
        "text": "[deleted]",
        "created_utc": 1442897973,
        "upvote_ratio": ""
    },
    {
        "title": "[talesfromcavesupport] I am Nicole I wait you! Fck me now! My id: 83630060491",
        "author": "enmi76097_qq",
        "url": "http://myprofileid1096.ssseexxx.tk/talesfromcavesupport",
        "text": "",
        "created_utc": 1441479828,
        "upvote_ratio": ""
    },
    {
        "title": "nok stupid bastard",
        "author": "TeapotofWrath",
        "url": "https://www.reddit.com/r/talesfromcavesupport/comments/3j1eb0/nok_stupid_bastard/",
        "text": "me borak. borak live in tree. tree much drier and safer than cave. big tooth animal like cave, but not bother look in tree.\n\nnok brother borak. nok live in cave near river with woman and friendly wolf thing. me usually visit nok round time when sun is hottest, because cave cooler then. me bring fruit and bird stones and snake flesh, share with nok and woman and friendly wolf thing. nok try hunt skinny run thing, too slow and loud most sun jump.\n\nrain much one sun jump. river have too much water, run into nok cave. ruin furs and leaves. friendly wolf thing get wet, smell awful.\n\nhow much borak tell nok move other side river? other side of river higher than nok cave. me tell nok, live in tree. me tell nok, if no live in tree, live away from where water run. now while nok wait for cave dry, nok lounge in borak tree, eat fruit before is most tasty. borak wish nok move other side river, then maybe borak get damn peace quiet. nok and woman make grunt noises alla alla time.",
        "created_utc": 1440991098,
        "upvote_ratio": ""
    },
    {
        "title": "Have Thagg try put out fire then light fire again?",
        "author": "just2quixotic",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/3hxfk8/have_thagg_try_put_out_fire_then_light_fire_again/",
        "text": "I Go out to hunt, I ask woman “What meat want eat?”  \nWoman say, “Not know.”  \n“Want deer meat?\"  \n“No, just had deer meat.”  \n“Want bird meat?”  \n“No, taste gamy.”  \n“Want fish meat?”    \n“No! Sit in bush all day after fish meat.”   \n  \nWoman say, “I know, want saber-tooth meat!”  \nI think “Damn it! Saber-tooth dangerous! Woman try kill me so can be with Clan-Chief!”  \n\nThis when Thagg yell I name.  \nThagg complain, “Fire no work right, fire make cave hot.”    \n\nIt Thagg, I *know* this make head ache, but better than hunt saber-tooth.  \n\nI point out “It hot-season; fire no make cave hot, hot-season make cave hot. It right in name, HOT-SEASON!”    \nThagg say, “No, Thagg cave more hot than neighbor cave! Can feel hot come from fire in Thagg cave make Thagg cave hot!”  \n\n   \n“What Thagg want do, no light fire and no cook meat? No cook meat like Neanderthal? (I think Clan-Chief no Thagg father, Thagg mother spend too much time with Neanderthal; if know what I mean.)   \n\nThagg ask “Start fire?”  \n\nSigh…  \n\nI say, “Thagg, ever think of put fire out when finish cook meat, and light fire when need cook meat?”    \n\nThagg say, “No! Make fire work right. Have fire make cave good; no hot, no cold. Like fire do in cold-season.  \n\nI say, “Thagg, fire no work that way! Only make more hot!”\n\nThagg say, “Make fire work right!” (Why clan-chief say no more hit Thagg with dum-dum smacker? It fix sooooooo much.)   \n\nI give up, tell Thagg, “Fire bring bad hot-season spirit, but take bad hot-season spirit time to get to Thagg cave. If Thagg put out fire when done cook meat, spirit get lost before find Thagg cave, and Thagg cave no more hot than neighbor cave.” (If Thagg think fire also bring bad cold-season spirit, *maybe* Thagg freeze next cold-season and I not have to deal with Thagg again.)\n  \n\nWhy I forget poison Thagg berry at start of warm-season?",
        "created_utc": 1440212355,
        "upvote_ratio": ""
    },
    {
        "title": "UD never lend spear again",
        "author": "under-done",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/3fa2ng/ud_never_lend_spear_again/",
        "text": "Me am UD. Thag borrowed Ud's spear to break bones for marrow. Me know Thag, lent anyway. Me dumdum sometimes. Me know what Thag wanted for. Me **big** dumdum sometimes. \n\n&gt; Thag: UD! Me have marrow for you  \n*gives me broken spearpoint*\n\nFinish throwing rocks at Thag and woman asleep. meat burned. fire out. Hate Thag.\n\nOriginal: https://www.reddit.com/r/talesfromtechsupport/comments/3028fx/leathermen_are_technology_too/",
        "created_utc": 1438343165,
        "upvote_ratio": ""
    },
    {
        "title": "It hard making good fire!",
        "author": "poindexter5221",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/3ex9ka/it_hard_making_good_fire/",
        "text": "Good fire hard to make. Many things notburn, like rock. Rock make good wheel; make lousy fire. Water not make good fire or good wheel, what water good for? Back to story. Many things burn but bad for fire. Mammoth skin stink when burned. So does Oog skin, and hurt for many moons! Pterodactyl good *over* fire, but not *in* fire.     \nTree good for fire make, but must be old, dead tree... young tree notburn almost as bad as rock.\nOog already talk about water, so not say again.\nFire hard to make!  ",
        "created_utc": 1438105383,
        "upvote_ratio": ""
    },
    {
        "title": "Oog busy at faraway cave; not check cave support paintings for many suns.",
        "author": "poindexter5221",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/3ex24b/oog_busy_at_faraway_cave_not_check_cave_support/",
        "text": "But, Oog only see one new painting. Must not be very many cave support men in tribe. But Oog still look for new paintings! Oog make many haha noises when find new painting!",
        "created_utc": 1438102380,
        "upvote_ratio": ""
    },
    {
        "title": "Oog see this?",
        "author": "sunshineonsnow",
        "url": "http://www.burnafterreadingpress.com/news/?webcomic_post=caveman-tech-support-2",
        "text": "",
        "created_utc": 1437232493,
        "upvote_ratio": ""
    },
    {
        "title": "Oog get invited to join clan! Much happy!",
        "author": "poindexter5221",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/38mx1a/oog_get_invited_to_join_clan_much_happy/",
        "text": "...but, Oog not cave support. Oog not know how to make wheel, or fire. Oog only know how to hunt mammoth, and make cave paintings about hunting mammoth. Oog also grow tired much faster than younger caveman, and need many sleep-times during sunup. Clan Elders still want Oog to join clan? ",
        "created_utc": 1433486107,
        "upvote_ratio": ""
    },
    {
        "title": "Us bury cave painting for archeologist",
        "author": "under-done",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/38lyx0/us_bury_cave_painting_for_archeologist/",
        "text": "Me am UD. UD make cave paintings and raindances. Today clan elder tells UD:\n&gt; UD, you make painting in dead cave.\nMe say  \n&gt; But we filling cave in with rocks. Is half full already.  \nElder say:  \n&gt; You take out rocks. Make painting. Put rocks back. Be very nice to look at.  \nMe say:  \n&gt; If you not be elder I say you dumdum.  \nElder say:  \n&gt; Be very nice to look at. Shamans will tell you what paint to making. Me give UD whole derpasaurus leg bonus if finish fast.  \nMe ask for dumdum smacking tool back. Elder say no. Me think me go eat Thag's poison berries and be sick until cave finished getting rocks in put.\n\nTL;DR shaman eat funny mushroom. Say hear vision about \"future archeologist.\" Strange sounds. UD think shaman ate wrong mushroom.",
        "created_utc": 1433470211,
        "upvote_ratio": ""
    },
    {
        "title": "Need more story from cave support!",
        "author": "poindexter5221",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/38e17a/need_more_story_from_cave_support/",
        "text": "Oog look at all cave painting, much happy \"ha ha\" noise from Oog mouth! Then Oog see no more cave painting... much sad... no more dum dum story? No more painting about Clan Elder ideas for breaking rock? Oog not make much happy face until new paintings drawn on wall...",
        "created_utc": 1433349173,
        "upvote_ratio": ""
    },
    {
        "title": "Me eat breakfast! Why me hungry again?",
        "author": "asphaltdragon",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/30as0o/me_eat_breakfast_why_me_hungry_again/",
        "text": "Me Aga. Me eating dinner, good mammoth. Grog bang on cave door. Aga go to cave door, see what Grog want. \n\nGrog say \"Me hungry! Why hungry? Grog have breakfast, but hungry again.\"\n\nMe tell Grog go eat dinner. Grog say he come back when he still hungry.\n\nStupid Grog, now Aga mammoth cold.",
        "created_utc": 1427318844,
        "upvote_ratio": ""
    },
    {
        "title": "Dry pot bad pot",
        "author": "SecretCoyote",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2yvcvc/dry_pot_bad_pot/",
        "text": "Me Urt. Make pottery. Nephew Yurt ask me show him how make pottery. Me agree.\n\nYurt come to cave for teach. Me teach Yurt use clay and water. Put in fire. Yurt go home.\n\nNext day Yurt visit. Say he try make pot but no work. Say me pot teach bad. \n\nMe ask Yurt, \"What Yurt do different?\" Yurt say \"Nothing.\" Me sigh.\n\nMe pester Yurt. Yurt give in. Yurt say he no use water because no want wet pot. \"Pot for dry grain,\" say Yurt. \n\nMe angry. Call Yurt dinklesaurus. Give Yurt pot so no have to deal with Yurt. Smash other pot on Yurt head. Me tell Yurt no come back.\n\nYurt gone now. Not seen Yurt long time.",
        "created_utc": 1426215396,
        "upvote_ratio": ""
    },
    {
        "title": "Mammoth rock",
        "author": "DethRaid",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2yuhzv/mammoth_rock/",
        "text": "Me make pretty rock. Grog want pretty rock. \n\nGrog come, say \"Grog want rook look like mammoth! Grog want rock big like mammoth! Grog want rock tomorrow!\"\n\nMe say \"Grog, no can make mammoth rock for tomorrow\"\n\nGrog say \"No, tribe over hill have mammoth rock! Grog want mammoth rock now!\"\n\nMe say \"I make mammoth rock small like Grog brain by tomorrow\"\n\nGrog say \"No, Grog want mammoth rock bit like mammoth!\"\n\nMe take ugly rock and smash Grog face. Now Grog no yell. Me eat Grog meat. Me happy.",
        "created_utc": 1426199739,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of how I almost was arrested because of screen sharing",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2y1dpz/the_tale_of_how_i_almost_was_arrested_because_of/",
        "text": "Lurking in this sub has reminded me of a story in my freshman year of high school.\n\nOne day, I was sitting around in graphic design class. There isn't much that the school is allowed to do with freshmen, so we just sat around and talked about news. But today, we were doing research on the computer lab in the back. (filled with iMacs) Because I was a certified slacker, my main activities included getting in the way of others.\n\nI went into the network, connected to one of the local computers to the left of me, (They all used the same password, and the password also doubled as the maintenance account) and opened [this image] (http://i.imgur.com/pS9jLrW.png) in the browser, and quickly disconnected. Unfortunately, the wrong kid was watching, and taught it to the bad part of the school.\n\nMy school is partially submerged in the ghetto part of Atlanta, so many of the students do nothing but fuck *everything* up. The difference between me and them, is that I make sure my pranks and general fucketry are legal and not punishable.\n\nAbout a week later, in the same class, we're being handed out sheets to report kids who are screen sharing. Apparently, one of the bad apples of the school had sent a threat via a Word document with it. Another kid opened the browser to a **PICTURE OF HIS DONG**. The situation had spiraled out of control.\n\nWhen the class had ended, our teacher had pulled me to the side. For the sake of the story, I'll call him Mr. N. N was the kind of teacher who looked out for his students, and made sure they didn't get into serious trouble. He saw me do the prank first, and because of it's harmless effect, didn't yell at me for it. But because of the recent events, he needed information.\n\n&gt;Mr. N: Max, can you stay here for a second?\n&gt;Me: Sure. (Cue puzzled and worried expression while sitting in a chair)\n&gt;Mr. N: I know you're a good kid, so I need to know, did you send either the threat or the picture?\n&gt;Me: No, all I ever did was open up a picture of Shrek as a joke.\n&gt;Mr. N: Did you teach anyone how to do it?\n&gt;Me: No. Someone might have watched me do it, but I didn't intentionally show how to do it.\n\nAfter this, he kept me for a while longer to tell me the risks of what I had done. He actually said that I could be **SENT TO PRISON** due to guilt by association. While this may make N sound crazy, he was just telling me this to protect me, and made me promise not to mess with screen sharing until this blew over.\n\nEnd of part 1, will try to write out part 2 once I get home.",
        "created_utc": 1425574938,
        "upvote_ratio": ""
    },
    {
        "title": "Thag think everyone steal from unripe berry bush",
        "author": "just2quixotic",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2wyf8g/thag_think_everyone_steal_from_unripe_berry_bush/",
        "text": "Last season, Thag ask \"Why you always have good berry eat in warm season?\"  \n  \nSo, I show Thag how plant berry. Tell Thag small berry tree grow here next warm season, and warn him **no eat until red** - Important **Thag no eat green berry!**\"  \n  \n\nCold season pass...  \nenjoy good fire, good Saber-tooth Steak, and woman sit by me when I hear Thag call...  \n\nI  pretend I not in cave, but Thag see fire. Thag say, \"neighbor will eat berry. Make so neighbor not eat berry before Thag eat berry!\"  \n\nI try tell Thag that neighbor no eat green berry, but Thag no listen...  \n\nFinally go where Thag's berry tree is and tell Thag that \"I put curse on Thag's berry tree; if neighbor eat *green* berry, neighbor get pain in belly. and poop all over self and never eat Thag's berry again. **BUT,** curse only last until berry red so Thag can eat red berry. When berry red, neighbor can eat berry too and no get curse. Make sure Thag eat red berry before neighbor eat red berry.\"  \n\nThag happy with curse, Thag leave.  \n\nI return to cave...   \n\nfire out, saber-tooth steak cold, and woman asleep.  \n\nHate Thag. Think I will poison Thag's berry.",
        "created_utc": 1424752615,
        "upvote_ratio": ""
    },
    {
        "title": "Me am UD. UD am living with \"upgrade\" in evolved working world",
        "author": "under-done",
        "url": "http://i.kinja-img.com/gawker-media/image/upload/s--hnsoCsyp--/18m4bew2qgo24jpg.jpg",
        "text": "",
        "created_utc": 1424115296,
        "upvote_ratio": ""
    },
    {
        "title": "Rock Not Rock!",
        "author": "kyrpa",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2sfo7o/rock_not_rock/",
        "text": "In cave. Making wheel more wheel. Smell mammoth on fire. Fire good. Mammoth good. Woman make good food. Tonight good fire, good food, good woman. \n\nWheel.  Wheel wheel wheel.\n\nHear thud at front of cave\n\nIs Urho.\n\nUrho... is not good.\n\nUrho: \"ROCK NOT ROCK!\"\n\nMe: ...\n\nUrho: \"ROCK NOT ROCK!  YOU MAKE ROCK ROCK!\"\n\nMe: \"Rock.... not... rock?\"\n\nUrho:  \"YES!! ROCK NOT ROCK!  YOU MAKE ROCK ROCK!\"\n\nSigh. Urho cave many steps away. I look back at mammoth. At fire.\n\nAt woman.\n\nSun move far. Walk to Urho cave long. Try talk at Urho.\n\nUrho: \"ROCK NOT ROCK! YOU HELP!!\"\n\nTomorrow, remember move boulder front of cave. No thud. No Urho.\n\nEnter Urho cave. Many Urho children! Urho woman unhappy. Urho show me.  Mammoth hide on cave floor. Urho grab round rock from water place and beat onto mammoth hide.\n\nUrho: \"ROCK!  NOT ROCK!!\"\n\nLook around.\n\nSee sharp rock in corner of cave.  Take sharp rock, give to Urho.\n\nMe: \"Rock?\"\n\nUrho begin cutting hide with sharp rock.\n\nUrho:  \"ROCK ROCK NOW!\"\n\nUrho hug me. Strong. Pain in back.  Urho let go.\n\nBegin walk back to cave. Sun finish moving, go away. Moon come. \n\nCold.\n\nEnter cave. No fire. Mammoth cold. Woman sleep.\n\nHate Urho. When wheel is finally wheel, make sharper rock. On stick. For Urho.\n",
        "created_utc": 1421265944,
        "upvote_ratio": ""
    },
    {
        "title": "Ogg want new rain dance",
        "author": "xiaopb",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2sck5m/ogg_want_new_rain_dance/",
        "text": "Ogg come my cave.  Fire still on, me cannot hide from Ogg.\n\nOgg: You make good rain dance.  Your rain dance make lots of sky water. Can you make new rain dance?\n\nMe: Why, old rain dance no work?\n\nOgg: Need new rain dance, old rain dance have evil spirits.\n\nMe ignore this.\n\nMe: Ok, me make new rain dance to summon lots of sky water.  Me take one moon to make, plus one rain to see if rain dance work.  \n\nOgg: thank, thank!\n\nMe start make good sky water rain dance.  Half-moon later, Ogg come back to me cave.\n\nOgg: We need sky water!  Where is rain dance?  You have new rain dance?\n\nMe: Ogg, me say one moon, *plus* one rain to see if dance work.\n\nOgg: We need sky water now, now now!\n\nMe: Ogg, you need use me old rain dance.  It work fine.\n\nOgg: Old rain dance summon evil spirits!\n\nMe: Ogg, me need a half-moon plus one rain to test new rain dance.  You want new rain dance good, right?\n\nOgg: Yes, we need good new rain dance!\n\nMe: You need wait one half-moon plus one rain.\n\nOgg:  No, no!  We need new good rain dance now.\n\nMe: Ok, then I give you new rain dance, but me no sure rain dance work.\n\nOgg: No, no!  We need rain dance work good, get sky water!\n\nMe: Ogg, you want fast fast rain dance, good good water, now now?\n\nOgg: Now, now!\n\nMe: You need pick.  You want fast fast rain dance, or good good rain dance?\n\nOgg: Fast fast rain dance, but it need be good good.\n\nMe: Ogg...Dorb have good rain dance, go see Dorb.\n\nOgg: Ok ok, me go see Dorb!\n\nMe look up at sky.  Why rain gods no like me?  Me go run find Dorb before Ogg find him.",
        "created_utc": 1421198046,
        "upvote_ratio": ""
    },
    {
        "title": "Ogg's picture brush no work",
        "author": "xiaopb",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2qwk9b/oggs_picture_brush_no_work/",
        "text": "Today Ogg visit, want me go his cave.  Ogg want me come right now, no wait, picture brush not working!\n\nMe: Why you need me come now?\n\nOgg: Help, evil spirits make picture brush no work!  No make cave painting, picture brush have evil spirits!\n\nMe: What wrong with picture brush?\n\nOgg: Evil spirits!  Picture brush no work, picture brush have evil spirits!\n\nMe: Who tell you picture brush have evil spirits?\n\nOgg: Come my cave now, picture brush have evil spirits!\n\nI drop meat and walk with Ogg.  Meat taste no good anyway.  At Ogg's cave, he show me cave painting.\n\nMe: You picture brush no work?\n\nOgg: You look, picture brush no work.  Picture brush have evil spirits!\n\nMe: Ogg, picture brush have no horse hair.\n\nOgg: Yes, because of evil spirits!\n\nMe: Ogg, picture brush with berry paint but no hair no good.  You need hair.  You go Grogg, get horse hair, put on picture brush, put brush in berry paint, you make purty cave painting.\n\nOgg: Evil spirits!\n\nMe: Ogg, go see Grogg, get hair for picture brush.\n\nOgg: Evil spirits, evil spirits!\n\nMe: Ogg...only thing get evil spirits go is wait for full moon.  Full moon come, you go in forest, look for wild horse.  Find horse, cut off horse tail.  Bring horse tail to cave, I make evil spirits go away.\n\nOgg: Thank you, thank you!\n\nMe go back my cave.  Meat still there.  I not hungry anyway.",
        "created_utc": 1420014137,
        "upvote_ratio": ""
    },
    {
        "title": "Urk need shinyrocks taken away.",
        "author": "under-done",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2q4mi1/urk_need_shinyrocks_taken_away/",
        "text": "Urk like gather shiny-rocks. Him keep in skin bag with little hole in one end. Today me see Urk try put rock in bag from wrong end. Urk getting mad, me show him right end. Urk think me am shaman.",
        "created_utc": 1419297853,
        "upvote_ratio": ""
    },
    {
        "title": "Have askings about big grey rock in second cave painting. what is?",
        "author": "under-done",
        "url": "http://www.userfriendly.org/cartoons/archives/99aug/uf000939.gif",
        "text": "",
        "created_utc": 1418265589,
        "upvote_ratio": ""
    },
    {
        "title": "grot no understand good fire",
        "author": "Eisinger",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2osacy/grot_no_understand_good_fire/",
        "text": "grot ask me to make fire.\nI make fire.\ngrot ask \"why i make fire so good\"\nI tell grot to show me him fire.\ngrot no make fire.\nme say grot \"you no make fire\"\ngrot understand.\ngrot learning.",
        "created_utc": 1418154435,
        "upvote_ratio": ""
    },
    {
        "title": "What you mean water bad for fire?",
        "author": "WilliamtheV",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2o913n/what_you_mean_water_bad_for_fire/",
        "text": "Me in cave. Fix others stupids. Ogg come to cave and say I need fix fire. I ask if he try lighting fire with spark rock. Ogg say spark rock make sparks but no fire. Me ask if he have dry grass and twig.\n\n&gt;We have good grass and twig.\n\nme: But is dry grass and twig?\n\n&gt;No, is better grass and twig.\n\nme (am head-slabbing): Grass and twig need be dry. Fire no like water.\n\n&gt; No, water am goods for me, and fire am goods for me. So water ams good for fire. Fix my fire.\n\nme: Things need be dry for fire.\n\n&gt;No, you fix fire now. I want fire to heat up water.\n\nme: Water cold unless in hot-pool. Cave not hot-pool. You broke the fire.\n\n***************\n\ntoo long, didn't cave paint: Ogg try to water fire to make water hot. Think water good for fire.",
        "created_utc": 1417690592,
        "upvote_ratio": ""
    },
    {
        "title": "Trade friend wheel. wheel no work. friend say wheel broken. he dumdum.",
        "author": "PlausibleSarge",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2miluc/trade_friend_wheel_wheel_no_work_friend_say_wheel/",
        "text": "Me trade wheel. Friend have wheel. Me tell roll wheel down hill. He try roll wheel up hill. wheel no work. He say wheel break. He say me fix. Me say no. Me show wheel work down hill. He say not want wheel down hill. He want wheel up hill. Me say wheel no up hill. He say he want sheep back. He say want wheel up hill. Me want show dumdum wheel never work up hill.",
        "created_utc": 1416187448,
        "upvote_ratio": ""
    },
    {
        "title": "Quid and the broken Shiny",
        "author": "TheMagicalFarmWizard",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2mh21h/quid_and_the_broken_shiny/",
        "text": "Me Thou, thou have many shinies. Other cavemen tell that Thou needs to share shinies from cave filled with shinies because others broke theirselves. Thou says no, but Elders complain. Eventually Thou finds other's shiny, it no make light anymore.\n  \nMe put stick in fire, then dip in tar, then put in fire again. Shiny make fire again! But Others already playing with me Shinies! I pummel others and give them their shinies.\n\n\nTD;DR MY SHINIES. I FIX YOU SHINY. NOT TOUCH MINE.",
        "created_utc": 1416154908,
        "upvote_ratio": ""
    },
    {
        "title": "Why evolve memory if no use it?",
        "author": "under-done",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2mgwhr/why_evolve_memory_if_no_use_it/",
        "text": "Me am UD. UD's cave have many dumdum eat much derpasaurus meat than needed. One day dum-dum ask UD put pointy-rock on her spear for easier kill derpasaurus. UD like weapons, so UD puts rock. Day later dum-dum come to UD.  \n&gt; what is rock on my spear?! is sent from bad cave demon! Take off now!!",
        "created_utc": 1416150933,
        "upvote_ratio": ""
    },
    {
        "title": "Cave Expansion",
        "author": "knivesngunz",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2kpe35/cave_expansion/",
        "text": "\\&gt;Me build expansion for cave.\n\n\\&gt;New pool and diving board attract Ungabungas. \n\n\\&gt;Try big rock smash hole in side of cave. \n\n\\&gt;Miss by mile and smash Grok's cave. \n\n\\&gt;Grok mad. \n\n\\&gt;Grok want clan war and stamp feet with grunt. \n\n\\&gt;Me no berrypicker so naturally me accept. \n\n\\&gt;Grok step outside to challenge. \n\n\\&gt;Me trip Grok on way out. \n\n\\&gt;Grok tumble down hill. \n\n\\&gt;Fading grunts into distance. \n\n\\&gt;Now me have two caves. ",
        "created_utc": 1414611014,
        "upvote_ratio": ""
    },
    {
        "title": "The day the sun went out",
        "author": "johnothanswift",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2jd16a/the_day_the_sun_went_out/",
        "text": "Me trainee Cave Support, Shaman say he tired of dealing with stupid cavemen 24/7 so me get trainee job.\n\nOthers say me useless at any other job but me know that not true.\n\nOne morning Gronks women come running up to cave saying Gronk needs Shaman. Problem is Shaman busy testing new mushrooms and not talking, or moving. So, me go on first callout. Me very proud.\n\nGet to Gronks cave, Gronk sitting on rock crying.\n\nMe say, 'Wat wrong Gronk ?'\n\nMe talk very slowly as Gronk considered dumb even by other cavemen.\n\nGronk say 'Sun gone out !'\n\nSun clearly not gone out for everyone else so me think back to my training about what to do next.\n\nMe say 'Sun working for me, have you opened your eyes Gronk?'\n\nThis make Gronk very angry, he say 'You only stupid trainee, Gronk need Shaman. Gronk not dumb caveman, of course Gronk open eyes. Shaman tell Gronk last time Sun went out Gronk need to open eyes'\n\nGronk then start shouting so me run back to cave to see if Shaman returned yet.\n\nShaman still drooling in corner so me think hard, then me remember Shamans special tool. He tell me it only used for special cases but me think this special.\n\nMe run back to Gronk with special tool and apply it to Gronk.\n\nWhile he asleep me cut Gronks hair so not covering Gronks face.\n\nWhen Gronk wake up he happy that sun come back.\n\nWhen Shaman came back he said special tool works well on Gronk, he often used it to fix Gronks problems. \n\n",
        "created_utc": 1413412019,
        "upvote_ratio": ""
    },
    {
        "title": "No send, no get, no try. Me confuse",
        "author": "zeroblur",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2eaf1h/no_send_no_get_no_try_me_confuse/",
        "text": "Me UR. Ur have talky sell man who need much help. One day him say \"Ur, come!\". Me go. Him say him no can send email. Me ask if him close outlook and reopen. Him say no. Me say try. Him do, then him send email. Works. \n\nMe say welcome. Him ignore Ur. Ur not like talky man. Go back to caveicle for coffee. Happy quiet.",
        "created_utc": 1408724697,
        "upvote_ratio": ""
    },
    {
        "title": "Grug skins store in fire pit, burn",
        "author": "djdanlib",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2do29x/grug_skins_store_in_fire_pit_burn/",
        "text": "Grug store all Grug important skins in fire recycle pit instead of cave like rest of Grug friends.\n\nGrug hire djdanlib fire technician keep cave warm and dry for when come back. Almost as much shiny as other fire technicians! djdanlib take, other cave have fire technicians. Grug go hunt. djdanlib make cave warm and dry with fire pit. Grug come back, Grug skins all burn. Grug demand djdanlib fix skins, not see why not use fire pit for store skins.\n\nWhat djdanlib do to fix skins? Urgent smoke signal send to whole tribe, please signal back with fix.",
        "created_utc": 1408136138,
        "upvote_ratio": ""
    },
    {
        "title": "Orgith fix cave wet, fix brings cleaner",
        "author": "chris45215",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2dlmov/orgith_fix_cave_wet_fix_brings_cleaner/",
        "text": "Me Marn. Me friend Orgith have wet cave floor. Orgith fall on wet, face say ouch. Orgith ask Marn help. Marn say \"dig hole cave floor, wet go down hole\". Orgith dig, now cave better but still wetty. Sada live under  Orgith, now Sada cave wet. Sada move to Orgith cave for dry and Sada clean cave for Orgith. Orgith now much happy.",
        "created_utc": 1408070420,
        "upvote_ratio": ""
    },
    {
        "title": "Donk and the broken water hole again",
        "author": "gtphanta",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2co0px/donk_and_the_broken_water_hole_again/",
        "text": "Tribe very angry with Donk. Whole tribe get sick from drink from water hole. Donk only person in whole tribe not sick. Tribe say Donk must have poisoned tribe, but not his self, cos why else tribe sick and not Donk?  \n  \nDonk try explain Donk use other water hole other side village, but they no believe me. They say why would Donk walk so far to get water when this water hole so close. Donk say because this water hole by toilet hole. Still not believe.  \n  \nTribe throw rocks and try bash Donk with club, but Donk smartypants. Donk run much fast without brownsmelly leaking from leg join.  \n\nDonk try start new village, but try marry cavewoman, but she prefer strong caveman even when he got brownsmelly leak and Donk not have.",
        "created_utc": 1407221238,
        "upvote_ratio": ""
    },
    {
        "title": "I want security - yeah! Without it I had a great loss - oh now! Security, yeah! And I want it at any cost, oh now!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2bwo2v/i_want_security_yeah_without_it_i_had_a_great/",
        "text": "My co-worker regaled me with this tale.\n\nHe had a meeting with one of the managers of our IT security section (SM).  Meeting room with a projector and smart board (that never, ever works, and the projectors are all too close to the smart boards, but that is another story).\n\nThe computer has been left on... but not locked.  This is in direct conflict with our IT Security Policy, but is usually only enough to warrant a warning - on the first few times...\n\nSM see's the user's credentials, and makes a note of them.  Obviously male and anglo name.\n\nSmall Asian woman (SAW) comes in and says something along the lines of:\n\nSAW: Oh, I'm just here to log out of this computer.\n\nSM: Is this your account?\n\nSAW: No, it's *co-workers*, but it's ok, he's given me his password.\n\nSilence from my co-worker, and SM.  Funnily enough, we haven't seen the other guy around",
        "created_utc": 1406512934,
        "upvote_ratio": ""
    },
    {
        "title": "$3 beer",
        "author": "narangutang",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2bu79m/3_beer/",
        "text": "Me em. Em apple genius. Reh say computer no work. Em open. Em see 3rock beer inside computer. Em say to Reh \"why beer in computer\". Reh say \"??????\". Em sigh. Em suggests new computer. Reh ask if is marble brand. Em die inside little.",
        "created_utc": 1406438479,
        "upvote_ratio": ""
    },
    {
        "title": "Red dust go all place",
        "author": "darryshan",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2b2cer/red_dust_go_all_place/",
        "text": "Uf try make wall bull. Uf by side try blow dust, dust no make bull. Make mammoth. Me get angry. Very bad. Dust is on tum-tum and up nose holes. Grab blowpipe. Show Uf make bull. Make more good on horn. Look like bull now. Bigger though. Uf annoy, say me is bad to him. Leave cave look for mammoth to eat.",
        "created_utc": 1405706373,
        "upvote_ratio": ""
    },
    {
        "title": "[Mod Message] Is anyone interested in continuing this subreddit?",
        "author": "trentv4",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2b0jeu/mod_message_is_anyone_interested_in_continuing/",
        "text": "I started this sub as a quick joke, a diversion from TFTS. If anyone is interested, I'll contact the mods of TFTS and let them know this sub-subreddit exists and see if I can let the TFTS people at large know this exists so it doesn't die. \n\nLet me know if you think this is a good idea.\n\n(no caveman in comments, please)\n",
        "created_utc": 1405652232,
        "upvote_ratio": ""
    },
    {
        "title": "Donk supposed to fix impossible.",
        "author": "gtphanta",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2azxdu/donk_supposed_to_fix_impossible/",
        "text": "Me Donk of cave support. Donk fix much caves, but one day whole village become angry. Come bang much on Donk cave with rocks and clubs. Shout and yell that Donk broke water hole. Donk go see water hole. Water hole fine. Is upriver from toilet hole, water is full. Water tastes good. Chief and tribe yell - this old water hole!!! They talk about new water hole!! Donk ask which new water hole? Tribe lead Donk past toilet hole to new water hole. Tribe say this water hole closer to caves, so tribe use this one instead, but now water taste like smelly clay after tribe all been eat bad berry berry. Donk point to toilet hole. Say this too close to toilet hole. Tribe say, this hole close to village. Just fix! Donk find rock. Bash head on rock. Fall down. Much better.",
        "created_utc": 1405637706,
        "upvote_ratio": ""
    },
    {
        "title": "At least is short",
        "author": "robotshoelaces",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2avs4r/at_least_is_short/",
        "text": "Sometimes, like all cave support, cave men ask support no sense question. Today ask for help with few words. I still no know what need do. He ask:\n\n&gt; Problem: Cant received\n\n([Original](http://www.reddit.com/r/talesfromtechsupport/comments/1h6xj8/at_least_this_ones_concise/))",
        "created_utc": 1405536989,
        "upvote_ratio": ""
    },
    {
        "title": "Why Glik No Go Hunt?",
        "author": "Skandranonsg",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2av8ph/why_glik_no_go_hunt/",
        "text": "Glik want go hunt. Jer keep all spears in small cave so no bad cave men steal. Jer ask Glik to make secret word so Jer know when Glik want  spear and is not bad cave men from other tribe.\n\nGlik say, \"Glik secret word is Glik.\"  \nJer say, \"No, you dodo-for-brains! Secret word must be hard to think of.\"  \nGlik frown, \"Glik secret word is GlikGlik.\"\n\nThis make Jer very mad, and he hit me with club. Glik spend rest of time with sky-fire with Jer club hitting Glik head. Jer say secret word must have name of animal, a number, two grunts, name of tree, name of rock. Glik not even know what number is!\n\nGlik settle on \"Two*grunt*TreeBirdFour*grunt*Rock\"\n\nIt now next day. Glik no remember secret word. Glik no go on hunt.",
        "created_utc": 1405526564,
        "upvote_ratio": ""
    },
    {
        "title": "All fire now Kromagnon's problem.",
        "author": "kromagnon",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2av4fn/all_fire_now_kromagnons_problem/",
        "text": "[[prev]](http://www.reddit.com/r/talesfromcavesupport/comments/2assek/some_people_no_should_have_fire/)\n\nKromagnon's woman's mother [kwm] tell all friends that Kromagnon good with fire. Now it Kromagnon's problem when any fire no work.\n\nKromagnon not even able to hunt own food, spend so much of light time fixing fire for tribe.\n\nShagga come into cave at first light, complain that fire no work. Kromagnon make hot bean drink to open eyes. Can tell today going to be shit. \n\n\"Fire gone!\" Shagga say. \"Fire here when sleeping, fire gone when open eyes at first light!\"\n\n\"All wood gone, Shagga. What you think burn?\"  Kromagnon ask\n\n\"Shagga gave fire wood LAST LIGHT!\" Shagga shout. \"Kromagnon say that Shagga give fire wood, fire burn!\"\n\nKromagnon sip hot bean drink from horn.\n\n\"Shagga, fire always need wood.\"\n\n\"Kromagnon lie! Kromagnon fix!\" Shagga yell. Kromagnon not like be yelled at when help, and Kromagnon hot bean drink not hot now.\n\nKromagnon smash Shagga head with rock.   \nWalk back to cave.   \nMake bean drink hot again on fire.\n\n\n",
        "created_utc": 1405524045,
        "upvote_ratio": ""
    },
    {
        "title": "Why me still hungry",
        "author": "maplepenguin",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2auwd1/why_me_still_hungry/",
        "text": "friend come to me, say \"you gave meat, will stop hungry, why no work? me want berry back!\"\n\nme ask \"what do with meat?\"\n\nfriend say \"me put on belly!\"\n\n&gt;*me shake head*\n\nme say \"no. meat in mouth, not on belly. same as eat berry.\"\n\nfriend say is very complicated\n\nme say \"keep eat berry. more easy\"\n\n&gt;*me go back on hunt*",
        "created_utc": 1405518984,
        "upvote_ratio": ""
    },
    {
        "title": "hE sAY i nOT gOOD aT cAVE mAN",
        "author": "robotshoelaces",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2auskd/he_say_i_not_good_at_cave_man/",
        "text": "Just have this talk with other man through rock-and-note net\n\n*Cave Man is start rock-and-note*\n\n*Cave Man is invite 7 Boss Men*\n\nCave Man: cAVE SUPPORT KEEP BREAKING MY POINTY STICK\n\n*Boss Man 1 throws rock away*\n\nMe: What happen? What wrong with stick?\n\nCave Man: yOU KEEP BREAKING STICK AFTER SOME SUNS. i CAN NEVER USE. yOU VERY BAD.\n\n*Boss Man 2 throws rock away*\n\nMe: I no do. You pointy stick maybe just backward. I help.\n\nMe: Is pointy end of stick face you or face tiger?\n\nCave Man: Ugh. Pointy end was face tiger.\n\nCave Man: Now is not. I fix. Stop turning stick around. You bad man.\n\n*5 Boss Men throws rock away*\n\n([Original](http://www.reddit.com/r/talesfromtechsupport/comments/23v117/apparently_im_very_unprofetional/))",
        "created_utc": 1405516145,
        "upvote_ratio": ""
    },
    {
        "title": "Ugh! No speaky-speaky with new voice!",
        "author": "PoglaTheGrate",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2aukmh/ugh_no_speakyspeaky_with_new_voice/",
        "text": "Pogla hear drum call.\n\nPogla head hurt because had much, much over-ripe fruit last sun down.\n\nPogla have fun time, take off loin cloth and dance!\n\nPogla try to ignore drum call, but drums beat again.\n\nPogla answer drum call, go to friend's cave.  New cave.  Very nice.  Limpet pool in corner.  New skin on opening to cave.  New skins on floor.\n\nPogla friend tell him new voice near cave.\n\nNo one seen them, but always beating drums.  Pogla asked by friend why new call no speaky-speaky with friends.\n\nFriend try everything!\n\nYell at new calls.\n\nYell louder at new calls.\n\nThrow rocks!\n\nPogla wait to hear new call.  Not drums, not voice, not music.\n\nNew call not new call at all, new call dripping water at back of cave!\n\nPogla laugh.  Pogla laugh more.\n\nPogla friend angry, hit Pogla on head with club.\n\nPogla head hurt more now.\n\nPogla never answering drum call after over-ripe fruit again!\n\nPaid with fresh limpets to jamb wood into opening, no more drip-drip from back of cave. Pogla also take deer leg from back of cave that friend not know about.  \n\nBlame new voice!  Friend still believe new voice took deer!!!",
        "created_utc": 1405508636,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why hurt?!\"",
        "author": "_aex",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2auit2/why_hurt/",
        "text": "Cave woman come to me, say: \"I put thing in fire, try to take out. Why hurt?!\"\n\nI go to see. Woman try to take out of fire which is on!\n\n\"Switch off fire!\" I say. Walk away angry.",
        "created_utc": 1405506541,
        "upvote_ratio": ""
    },
    {
        "title": "Thag eat poison berry",
        "author": "TedTheViking",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2au9gu/thag_eat_poison_berry/",
        "text": "Hullo Reddit! Me Ted.  \n  \nYesterday, Thag sick. Me ask if Thag eat poison berry. Thag say he no eat poison berry. Me look in Thag cave, Thag have many poison berry. Me tell Thag he do eat poison berry. Tell Thag stop eat poison berry, Thag say ok.  \n  \nToday, Thag sick. Me ask if Thag eat poison berry again. Thag say he never see poison berry, say me have crazy talk. Me find more poison berry in Thag cave!  \n  \nSome Cro-Magnon no deserve to have opposable thumbs. ",
        "created_utc": 1405495289,
        "upvote_ratio": ""
    },
    {
        "title": "I try 20 rocks and wall doesn't paint",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2au57d/i_try_20_rocks_and_wall_doesnt_paint/",
        "text": "fix the rock",
        "created_utc": 1405490990,
        "upvote_ratio": ""
    },
    {
        "title": "The gods stole my password.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2au4jv/the_gods_stole_my_password/",
        "text": "I painted good password.",
        "created_utc": 1405490374,
        "upvote_ratio": ""
    },
    {
        "title": "is protect cave a thing?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2au2i6/is_protect_cave_a_thing/",
        "text": "nut water cold. many picture-rock of message from shouting mans and old boar meat. this is things what left by message-taker. not happy making. me stare at cave entrance, hope cave fall down before must do fix work. today is not going be day of happy.   \n\nme drink little leaf-water.   \n   \ntaste like poison berry.   \n   \nfirst message, I make shout man tell tribe second leader and make tell that me following mans no draw naked picture in cave.   \n\n&gt;TS: WHO OF YOU FOLLOWING MANS SNEAK INTO CAVE AND    DRAW NAKED PICTURE?   \nme: no of me following mans, maybe other mans. Should make cave guard man change word for go in.   \nTS: change go in word? why I do? find man who did, we make leave in forest now!   \nme: we do, but make change go in word too because some man know go in word.   \nTS: NO! HOW LONG UNTIL FIND BAD MAN?   \nme: me not find bad man!   \nme: cave guards have picture of mans in cave, maybe look at rock drawings?   \nTS: you do. me must count rock. find bad man before leaf sun and put in cave.   \nme: me get cave guards to find.   \n   \nme drink nut water.   \n   \nIcky!\n   \nmake shout at cave guard.    \n&gt;me: this CT! I make talk at boss guard!   \nGard: uhg! CT you hear about problem with message-rocks?   \nme: no, must make talk at boss guard.   \nGard: boss is not have. we not like have boss.   \nme: oog. you look at cave picture, see if man draw on TS wall?\nGard: no, only boss guard can see.   \nme: but you say no boss guard!   \nGard: yes no boss guard!   \n   \n*me hit head on rock because stoopid man.*   \nme feel like talk to dog following self back-fur.   \n&gt;me: where is cave picture?   \nGard: at me.   \nme: me need all drawings of last 7 suns.   \nGard. yes, I put in basket.   \n   \nme am think that may look at rock-picture for sun moving much across sky.   \nme sip nut-water.   \nnot taste like bad so much now.\n   \n   \nshiny rock for first drawings give to /u/airz23    \n\nmake change to bunga-speak take much of sun moving, maybe not keep do more\n\n",
        "created_utc": 1405488579,
        "upvote_ratio": ""
    },
    {
        "title": "Rock doesn't do same as before.",
        "author": "watahboy",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2au23n/rock_doesnt_do_same_as_before/",
        "text": "\"My rock worked before. Now it doesn't sit the same. What did you do?\"",
        "created_utc": 1405488248,
        "upvote_ratio": ""
    },
    {
        "title": "All Cave No Berry Berry Now",
        "author": "Skandranonsg",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2atz8v/all_cave_no_berry_berry_now/",
        "text": "Me Grem. Grem best at berry berry bush. Cave Chief say so, and I get to hit cavemen with club when they touch berry berry bush. \n\nToday, Grem come to berry berry bush to get berry berry for big feast. What I find at bush? Ugly dead birds! No bush! Bush is floating in salty lake! Grem get mad and break whole tree with rock.\n\nLater at feast, Chief say to Grem, \"Why no Grem get berry berries?\"   \nGrem say to Chief, \"Grem no has berry berry because dodo-for-brains try to plant dead bird and throw bush in salty lake!\"  \nChief say to Grem, \"Chief is one who plant dead bird and throw bush in salty lake. Chief son who is very good at berry berry bush said that is best to grow big berry berry.\"   \nGrem say to Chief, \"Now berry berry bush ruined! Feast ruined!\"  \nChief say to Grem, \"Chief not care. It Grem job to get berry berry. If Grem no come back with berry berry, Grem will be smushed!\"\n\nGrem look for new cave now.",
        "created_utc": 1405486025,
        "upvote_ratio": ""
    },
    {
        "title": "Fire stick burns field is cave problem?",
        "author": "djdanlib",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2atws5/fire_stick_burns_field_is_cave_problem/",
        "text": "Me with cave support. Tok buy sticks with fire. Use in cave for warm and cook food. Tok leave in cave while family sleep. Make much dark air. Tok wife have great head pains after sleep. Make Tok sleep in field. Tok bring fire stick to field. Burn field but warm. Tok think problem with cave. Me not understand how Tok become man without die. Boss say give Tok new fire stick. Me look for new job for next moon. Nearly eat by tiger.",
        "created_utc": 1405484249,
        "upvote_ratio": ""
    },
    {
        "title": "Silly neanderthal ask for cave help. Is stupid much.",
        "author": "apiosiscool",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2atom2/silly_neanderthal_ask_for_cave_help_is_stupid_much/",
        "text": "Silly neanderthal go ask me for cave help. He say that his food eaten by animals. I ask if he put fire at cave entrance to scare away bad animals. Neanderthal say yes of course, first thing he tried, everyone knew that that was first step and to be done immediately upon problem occurrence.  I go look. There no be fire. I make fire and neanderthal think I do magic. I club face. I go drink berry juice. Now neanderthal say that his friend need help. I out of berry juice, will get more.",
        "created_utc": 1405478883,
        "upvote_ratio": ""
    },
    {
        "title": "Atuk no see tree",
        "author": "ScumbagInc",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2atlp4/atuk_no_see_tree/",
        "text": "Atouk tell Scum he trade bean for tree.  He say he no see tree.  \nScum say, \"You have two eye?\"  \nAtouk say, \"Yes.\"  \nScum say, \"You open eye?\"  \nAtouk gasp.  \nScum say, \"Now what see?\"  \n\"Tree!\"  \nScum die inside.",
        "created_utc": 1405477052,
        "upvote_ratio": ""
    },
    {
        "title": "No use sabretooth rug with sharp pointy bits attached.",
        "author": "gtphanta",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2ati2l/no_use_sabretooth_rug_with_sharp_pointy_bits/",
        "text": "Me Donk. Donk do level 1 support for cave furnishings. Yesterday Gonk come to me, say rug make sore when he try sleep. I go to Gonk home, find he use live sabretooth for rug instead of dead one. Sabretooth rug still have sharp pointy bits which stick in him when he try lie down on it. Facepalm!",
        "created_utc": 1405474809,
        "upvote_ratio": ""
    },
    {
        "title": "Try to Teach Dodod About New 'Wheel'",
        "author": "OllyTrolly",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2ate57/try_to_teach_dodod_about_new_wheel/",
        "text": "OllyTrolly tell cave tool maker, Dodod, about new invention, 'wheel'. He try to make but keep asking how many pointy bits it have. Me say, no pointy bits friend, but he say not possible to have shape with no pointy bits, so is it like shape with four pointy bits or shape with three pointy bits? Then he say, so shape long or short? Me say wheel same long in all ways, but he no understand and get mad. Now delivery to cave down path is late and cave get no food delivery back for 3 suncycles.\n\nTL;DR, Dodod stupid.",
        "created_utc": 1405472374,
        "upvote_ratio": ""
    },
    {
        "title": "Show up man, make fire, make fun times with lady",
        "author": "PoglaTheGrate",
        "url": "http://2.bp.blogspot.com/-DnnMyDxe89U/UCjRPeHZ4lI/AAAAAAAAADw/GhdX61hNodo/s1600/valleyOfTheFarSide_p051_002.gif",
        "text": "",
        "created_utc": 1405467069,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes cave is problem",
        "author": "robotshoelaces",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2at2ly/sometimes_cave_is_problem/",
        "text": "Me no cave support but me own cave. Me say \"cave support, why me cave wet?\" Cave support say \"put lion skin on door of cave, keep rain out.\" \n\nMe say \"OK, but hole in top of cave.\" \n\nProblem was hole in top of cave.\n\n[Later on talk more: I fixed hole in top of cave with dead lion skin. Me thank you cave support magic men.]",
        "created_utc": 1405465192,
        "upvote_ratio": ""
    },
    {
        "title": "Me no speak grunt",
        "author": "KindaDutch",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2asuap/me_no_speak_grunt/",
        "text": "Birth lady have far off visitors.  They have broken mud stick.  Birth lady ask me to look.  Bad thing is it is in grunt. Me only know growl.  Translator has to leave me try use mud stick but no understand.  Translator cone back.  Me happy, me take off bug nest stuck to mud stick.  Visitor happy me fix.",
        "created_utc": 1405460405,
        "upvote_ratio": ""
    },
    {
        "title": "Hullo Reddit! Me Ponter.",
        "author": "banjo2E",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2ast5e/hullo_reddit_me_ponter/",
        "text": "Friend come to me, tell me he no can get skin off gazelle. I ask, you make sure knife sharp? He say yes, show knife, it sharp. I ask, you show me what you doing? He say ok, follow. He bring me to gazelle herd. He throw knife at gazelle, it miss, herd run away. He turn to me and say, see? Knife not work.",
        "created_utc": 1405459775,
        "upvote_ratio": ""
    },
    {
        "title": "Some people no should have fire.",
        "author": "kromagnon",
        "url": "http://www.reddit.com/r/talesfromcavesupport/comments/2assek/some_people_no_should_have_fire/",
        "text": "Kromagnons woman's mother [kwm] comes up to Kromagnon and say : \"Kromagnon, you good with fire, why my fire no work?\"\n\nKromagnon sigh, as [kwm] always messing up fire, and Kromagnon must always fix.\n\n\"What you mean, fire 'no work'\"? Kromagnon say.\n\n\"It just no work! GRAAAAAHH!!\" [kwm] shout while stamping feet.\n\n\"ugh... What you burning?\" Kromagnon ask.\n\n\"Try to make stew.\" [kwm] say\n\n\"Show how you make fire for stew\" Kromagnon say\n\n[kwm] rub sticks together, and make small fire in leaves. It good fire, Kromagnon not understand problem.  [kwm] drop fire-leaves into pot with stew, fire go away.\n\n\"FIRE NO WORK\" [kwm] say\n\nKromagnon bash own head with club and walk back to own cave.\n\n\n",
        "created_utc": 1405459361,
        "upvote_ratio": ""
    }
]