[
    {
        "title": "[Officer] Lessons in Dope Dealing",
        "author": "theforcereview",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/11smmvg/officer_lessons_in_dope_dealing/",
        "text": " \n\nI've worked patrol for my entire, 13-year career. Like most patrol officers, I like to dabble in street level narcotics every now and then. But a few years ago, I made drug dealers my focus. And I enlisted the help of my patrol team to make some arrests. I spent hours staking out street corners and dope houses, hiding in various locations to observe drug deals in progress.\n\nMy team had decent success. We made 17 dealer arrests that year if I remember correctly, including an arrest with a pound of meth and one with 4 ounces of heroin. But the time spent hiding in bushes and crouching on hot rooftops got old, and I eventually gave it up to handle my radio calls without the added stress.\n\nBut I kept thinking about what I had learned. And it occurred to me what the problem was when arresting drug dealers. Identifying them wasn't hard. I had a stack of cards filled out with their names. The problem was catching them with the dope. We'd always find a scale or baggies or cash, but not always with a sales quantity of dope. So I figured out a way to ensure they'd have the dope on them when I contacted them. I would just ask them to bring it to me.\n\nOne day, a young officer comes up to me and says she saw a bunch of homeless people gathered around a car. She says it might be a dealer at a corner I had worked for a while. So I get a description of the car and the guy from her.\n\nThe next day, my partner and I find the car and the guy. He's on parole. Great. We search him and his car. Nothing. No dope, no baggies, no scale, nothing. So I get his information and let him go.\n\nThe day after that, I call him. I tell him I'm looking to buy some meth. I tell him some guy at the internet cafe told me about him. He asks me my name. \"Randy Slazinger,\" I tell him. I have no idea where that came from. Made it up on the spot.\n\nAnyways, the guy agrees to sell me two 8-balls of meth in the gas station parking lot. I park down the street and go into the restaurant next door to wait for him. Remember, I'm a patrol cop. I drive a marked car and I'm wearing a uniform. I call for two other officers to stage nearby to help bust him when he shows up.\n\nSo the guy is taking forever. I call him and he says he's on his way. He tells me which street he's driving down so I redirect my backup to intercept his car. He's still taking forever so I call him again.\n\n\"Where you at?\" I say.\n\n\"I'm in the hamburger place,\" he replies.\n\n*Hamburger place? What the fuck is he talk-*\n\nHoly shit. I realize where he is. He's talking about the restaurant I'm standing in. I look around. He's walking in the door behind me. We see each other at the same time. He makes a b-line for the exit. I follow him into the parking lot.\n\n\"Hey Tony!\" I say.\n\nHe ignores me and keeps walking.\n\n\"Don't be like that,\" I say.\n\nHe keeps walking.\n\n\"Police,\" I say. \"Stop right there.\"\n\nHe runs. I chase him. My backup is a ways away because I had redirected them earlier. But he's a big guy so he's slow. I tackle him in the parking lot. I'm on his back and he's clutching something in his right hand.\n\n\"Drop it,\" I say.\n\nHe tries to throw the objects, but he can't get them more than a few feet with me on his back, and two 8-balls of meth go tumbling through the parking lot.",
        "created_utc": 1678949564,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Officer]",
        "author": "theforcereview",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/11smjpn/officer/",
        "text": "I've worked patrol for my entire, 13-year career.  Like most patrol officers, I like to dabble in street level narcotics every now and then.  But a few years ago, I made drug dealers my focus.  And I enlisted the help of my patrol team to make some arrests.  I spent hours staking out street corners and dope houses, hiding in various locations to observe drug deals in progress.\n\n&amp;#x200B;\n\nMy team had decent success.  We made 17 dealer arrests that year if I remember correctly, including an arrest with a pound of meth and one with 4 ounces of heroin.  But the time spent hiding in bushes and crouching on hot rooftops got old, and I eventually gave it up to handle my radio calls without the added stress.\n\n&amp;#x200B;\n\nBut I kept thinking about what I had learned.  And it occurred to me what the problem was when arresting drug dealers.  Identifying them wasn't hard.  I had a stack of cards filled out with their names.  The problem was catching them with the dope.  We'd always find a scale or baggies or cash, but not always with a sales quantity of dope.  So I figured out a way to ensure they'd have the dope on them when I contacted them.  I would just ask them to bring it to me.\n\n&amp;#x200B;\n\nOne day, a young officer comes up to me and says she saw a bunch of homeless people gathered around a car.  She says it might be a dealer at a corner I had worked for a while.  So I get a description of the car and the guy from her.\n\n&amp;#x200B;\n\nThe next day, my partner and I find the car and the guy.  He's on parole.  Great.  We search him and his car.  Nothing.  No dope, no baggies, no scale, nothing.  So I get his information and let him go.\n\n&amp;#x200B;\n\nThe day after that, I call him.  I tell him I'm looking to buy some meth.  I tell him some guy at the internet cafe told me about him.  He asks me my name.  \"Randy Slazinger,\" I tell him.  I have no idea where that came from.  Made it up on the spot.\n\n&amp;#x200B;\n\nAnyways, the guy agrees to sell me two 8-balls of meth in the gas station parking lot.  I park down the street and go into the restaurant next door to wait for him.  Remember, I'm a patrol cop.  I drive a marked car and I'm wearing a uniform.  I call for two other officers to stage nearby to help bust him when he shows up.\n\n&amp;#x200B;\n\nSo the guy is taking forever.  I call him and he says he's on his way.  He tells me which street he's driving down so I redirect my backup to intercept his car.  He's still taking forever so I call him again.\n\n&amp;#x200B;\n\n\"Where you at?\" I say.\n\n\"I'm in the hamburger place,\" he replies.\n\n*Hamburger place?  What the fuck is he talk-*\n\nHoly shit.  I realize where he is.  He's talking about the restaurant I'm standing in.  I look around.  He's walking in the door behind me.  We see each other at the same time.  He makes a b-line for the exit.  I follow him into the parking lot.\n\n\"Hey Tony!\" I say.\n\nHe ignores me and keeps walking.\n\n\"Don't be like that,\" I say.\n\nHe keeps walking.\n\n\"Police,\" I say.  \"Stop right there.\"\n\nHe runs.  I chase him.  My backup is a ways away because I had redirected them earlier.  But he's a big guy so he's slow.  I tackle him in the parking lot.  I'm on his back and he's clutching something in his right hand.\n\n\"Drop it,\" I say.\n\nHe tries to throw the objects, but he can't get them more than a few feet with me on his back, and two 8-balls of meth go tumbling through the parking lot.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThe Force Review",
        "created_utc": 1678949246,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Suspect] Game Warden: I'll make you a deal. I took that deal, my friend did not.",
        "author": "ImbambiBitch",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/zxqfnf/suspect_game_warden_ill_make_you_a_deal_i_took/",
        "text": "I was at a state park fishing, we had picked what we felt was a remote spot as we wanted to fish and smoke a little bit of weed. (this was years ago before weed laws where as progressive as they are now).\n\nWell a game warden found us and I don't know if you know about game wardens. But if your on a state park, the game warden doesn't need probable cause to search you, they don't need your consent, they are law enforcement. My buddy and I where both very much aware of this rule.\n\nWe had been smoking, we heard a guy approaching us we threw the joint into the water. Game Warden comes up and goes \"having a good time fishing?\" I go \"Yes sir\" he goes \"Staying under the limit?\" and I go \"That's awfully easy when you ain't catching anything\" he laughs and goes \"So the reason why I came by here is cause I smelled weed and having drugs or alcohol on your person in a state park is a crime\"\n\nI'm thinking \"Ah shit, lets try to reason my way out of this\" so I go \"And what makes you think its us?\" he goes \"cause your the only people here, and deer don't smoke pot\" to which I thought \"fair point\"\n\nSo the Game Warden said \"So I'm going make you a deal\" I go \"Ok\" he goes \"I'm going search you, if I find anything illegal I'm going confisicate it and your going need to leave the park right away and can't come back on for one month, also I won't charge you with anything\"\n\nTruth be told we had no intentions of returning anytime soon, also...I know he didn't need my permission to search me. So I figured I might as well take the deal and hope he's telling the truth. Now the joint we had smoked my buddy was carrying I still had my joint. So I agreed and my buddy is like \"bro he's lying\" and I'm thinking \"Even if he is...it doesn't matter\"\n\nSo the cop finds my joint, he rips it up, throws it in the water and looks at my buddy and says \"Your turn\" my buddy goes \"No, you can't search me\" and the Game Warden says \"Yes I can\" so my buddy turns and runs.\n\nOne problem with running (which fyi I had thought of) it was really slippery to get out of there so I figured even if I attempted to run I wouldn't get far. But my buddy, he didn't think that far. So he ran, he then slipped, he then got cuffed, he then got searched. The cop found a half pint of whiskey we were going to share. My friend was also underage (so was I)\n\nSo the game warden arrests my friend, The game warden says \"Well alright, I'll take you back to my station and you can call your folks\"\n\nSo the game warden puts my friend in the back of the car and I sit up front. We get to the station, my friend is put in a holding cell and I go \"So what do I do?\" the game warden goes \"You can use the office phone to call your folks to come pick you up\" and I go \"What about my friend?\" the game warden said \"He's going have to wait for me to process him, but your free to go\" I go \"Really?\" the Game Warden goes \"A deal is a deal, you are banned for one month though so don't let me catch you back here\" I go \"Alright\"\n\nSo I call my parents, my dad comes and gets me. My dad asks the Game Warden what happened and the game Warden said he caught my friend doing something wrong but I was good to go and just needed a ride home.\n\nMy friend ended up being charged as a minor with possession of alcohol and breaking some state park regulations. He was banned from all state parks for a year, and half to attend an alcohol and drug abuse class. Thankfully we were under 18 and that record won't follow him anywhere.\n\nLater my friend was like \"Why did you trust the Game Warden? Cops can lie\" I go \"I know they can lie, I also knew I didn't have a choice\"",
        "created_utc": 1672274351,
        "upvote_ratio": 1.0
    },
    {
        "title": "The secrets of Angels who become sex dolls to Jejus and God for Eternal Life",
        "author": "_Please_believe__me_",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/zow2vm/the_secrets_of_angels_who_become_sex_dolls_to/",
        "text": "[removed]",
        "created_utc": 1671361092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apparently the flashing lights are decorations (Officer)",
        "author": "wiqwqoot",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/zlpspx/apparently_the_flashing_lights_are_decorations/",
        "text": "Picture this: 3 car collision scene, 4 police cars, pylons galore, lots of emergency lights. No individual in their right mind would consider this road open for business.\n\nBut no. There I was, taking pictures of the scene, and I hear a vehicle behind me. I turn around, and this random car is being driven by a man, holding a chicken wing with both hands, coming straight at me. \n\nI jump out of the way, and pull him over. Some other officers observed him weaving through the maze of barriers and came over to give him a piece of their minds.\n\nWhere I am, I need probable cause that the driver is drunk to breathalyze him. I didn't have that.\n\nAs we discuss the case a bit away from the car, out of the corner of my eye I see not 1, not 2, but 4 bottles of vodka being yeeted out by the passenger.\n\nEveryone gets detained, and I have my PC. I Breathalyze the driver, and he blows a zero.\n\nThe passenger gets tickets for open containers AND littering.\n\nThe driver got tickets for distracted driving via chicken wing, the ticket for ignoring a police blockade, and a slew of administrative penalties.\n\nI left them with the other officers. \n\nTurned out the passenger had a common name and eventually the other officers figured out she had warrants. I came back and arrested her.\n\nSo in summary: guy drives around numerous illuminated obstacles and almost runs over a cop while eating a chicken wing. GF throws alcohol out of the car to protect her BF from a non-existent DUI investigation while her BF is sober. GF gets arrested for falling and hitting her head on a toilet and breaking it and refusing to pay for it from a year ago. \n\nWhat the heck is my life.",
        "created_utc": 1671021207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy a drink, i'll assault you [Officer].",
        "author": "Percy_Penguin86",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/zgbbfc/buy_a_drink_ill_assault_you_officer/",
        "text": " \n\nFor context I'm 6'2' and at the time was like 18st 115kg so a big unit \n\nIn a past life I worked as an officer in a tourist town in the UK. Walking the streets interacting with locals and visitors, the usual community engagement type stuff. \n\nOn a hot day in the height of summer I stopped off to get a bottle of water, I was stood in line with my helmet off enjoying the feel of the A/C hitting the back of my head and going down my neck and back trying to cool the space between me and my body armour. \n\n\\*Crack\\* \n\nSomething hit me across the back of my head. \n\nTurning slowly my hand dropping to my CS spray I looked to see who had just assaulted me. I was met with an old lady with a walking frame and walking stick. she proceeds to have a go at me. \n\nOAP: You should be out there catching criminals not in here stuffing your face.  \n\nME: I'm just getting a bottle of water and.... did you hit me? \n\nOAP: Yes, because you were ignoring me. \n\nME: Right. \n\nI turn away from her as there is now a till free and purchased my water and left. About 30 minutes later the Inspector gets hold of me on the radio asking to meet with me to discuss a complaint. so, he comes out to where I am and gives me the details. \n\nA member of the public had complained that I was rude and belligerent to them and ignored them when they were talking to me. I asked when this had happened, and he told me today within the past hour. I then give him my side of the story and when I mention the hit to the head he immediately wants to go to the shop. So, we do off in his car back to the shop where I got my water from. Once there he goes straight to the till area and is excitedly asking me \"where were you standing exactly\" I showed him, and he smiled from ear to ear and just pointed. There was a CCTV camera pointed right at where I had been standing. We went and reviewed the CCTV and sure enough there I was stood there helmet in hand enjoying the A/C on my head and the OAP behind me.  \n\nYou can see on the CCTV she is trying to talk to me, but I have an earpiece in and can't hear properly so genuinely missed that she was talking to me, then it happened. she took hold of her walking stick and proceeded to tap me on the back, on my body armour. she did this 4 or 5 times maybe before she just cracks me on the back of my head. I turned in such a way my face could be seen on the camera, and you could clearly read my lips for the short conversation we had. \n\nwith that the inspector turns to the staff I would like a copy of that burning off and just left, got back in his car and left. leaving me and the staff member there like \"ok\". At the end of my shift, I went to his office with the CCTV, and he filled me in. \n\nThis lady had been a serial complainer against police for anything and everything, patrol cars parked in the wrong place, this officer looked at me funny, officer was seen doing things they shouldn't. but this time he had a counter argument. \n\nwhen he called her back to advise that he had spoken to me he opened with. \n\nInsp: what did you do to get the officer attention \n\nOAP: I tapped him on his arm \n\nInsp: really.... \n\nOAP: yes \n\nInsp: ...you know there is CCTV in the shop, especially around the till area,  \n\nOAP: so \n\nInsp: so, I have CCTV of you assaulting my officer. you struck him across the back of his head with your walking stick.  \n\napparently after this revelation she was very shouty and incoherent before calming down and being delivered the parting shot by the inspector of \n\nwe will ignore the fact you assaulted an officer while on duty as long as you stop making unfounded complaints against my staff, we are entitled to a break to get food and drink, we can park our cars in the visitor carpark of your complex when dealing with incidents we are human and should be allowed to work unimpeded. \n\nAs far as I know she never did make a complaint against officer again, we did attend anti-social behaviour in the area of her complex which we were sure would create a complain of why we were not doing something about it but nope we didn't hear a peep.",
        "created_utc": 1670532943,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Deputy] You're Spare Parts, Bud",
        "author": "jollygreenspartan",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/zer0ss/deputy_youre_spare_parts_bud/",
        "text": "My partner and I went to a call at the shitty trailer park. The office staff was trying to tag a disabled vehicle in the park and the owner (son of a resident but not a resident) called 911 on them. My partner got there before me, I rolled up to see him, our caller, the caller's father and two women from the front office. My partner is already giving the caller a speech. The caller is unmoved. \"They can't put a sticker on my car, that's vandalism.\" \n\n\"No, it's not. Your car is in violation of trailer park rules, they're allowed to tag and tow it.\" Not sinking in. I step in. Sometimes a different voice works.\n\n\"Look, this is not vandalism. They are within their legal rights to tow a vehicle in violation of their rules. This is not a crime and not a police matter. If you call us back when they tow your car after we've told you it's not a police matter you will be committing a crime. I can cite or arrest you for misuse of 911. Got it?\" I thought I had made the issue pretty black and white so I started to turn not expecting any actual questions. My mistake.\n\n\"No, I don't understand.\" *Really?* \n\nI turn back to the caller but before I can speak his father grabs him by both shoulders and says, \"You stupid motherfucker, just shut the fuck up! You're wrong, you need to get this hunk of shit off my lot before I get in trouble with the office! They've got more important things to do, you're wasting their time.\" To me he says, \"Officer, I'm sorry. He won't be a problem.\" \n\nMy partner and I move off as the ladies walk up and stick the tag to the windshield. As we all leave the caller starts peeling the tag off of the car. But for once, dad was right and no one called in about an illegal tow later.",
        "created_utc": 1670384379,
        "upvote_ratio": 1.0
    },
    {
        "title": "[ride along] smooth suspension",
        "author": "bravestar255",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/z9gk51/ride_along_smooth_suspension/",
        "text": "I had an amazing opportunity to do a ride along a few years ago. \n\nit was for my local college police department, it was a busy day and throughout the day we had to look for a potential suicidal guy, and got to arrest someone, but that's now what my story is about, rather my story is about when we got a call for... well he never really told me what it was, only that it was a false alarm, but whatever it was it was serious as he turned on his lights and sirens and began speeding through traffic and red lights. before this i was practically half asleep, keep in mind I was a young kid then, someone who was not used to waking up at 6:00 AM for a long day of work (sitting and observing) . but going code 3 unsuspectedly did the trick and I was quickly wide awake. he laughed a little bit when he noticed how surprised and alert I had become. As he cut through traffic and made turns at high speeds I couldn't help but notice how well the suspension was taking it, Maybe all cars are like this not just police cars but man it felt really smooth for the maneuvers being made.",
        "created_utc": 1669875769,
        "upvote_ratio": 0.77
    },
    {
        "title": "[Reserve Deputy/Suspect] What a way to end a 30-Day Cross Country Trip",
        "author": "Radiant-Art3448",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/z5lrvj/reserve_deputysuspect_what_a_way_to_end_a_30day/",
        "text": "So back a few years ago, quite a few, my SO and I decided to take a cross country trip from east coast to west coast and northern route west, southern route east. We had recently retired from the service after 62 years between us. It would take us 30 days to visit multiple places, friends, and family. We blogged our entire trip and had quite a few folks following us. The one drawback was the car. We had decided to get a rental instead of putting that many miles on one of our vehicles.  We picked it up the day we left and it didn't take long to realize it did not have cruise control. OK it would be a pain but too late now. I just warned my SO, since she has a bit of a lead foot, that she'd have to watch her speed.\n\nOn the last day we were driving from Alabama to Homeplate (mid-Atlantic state). We had had a couple close calls with the popo along the trip but all was right in the world.  The SO was driving and I was asleep in passenger seat when I was awoken as she yelled, Aw F@@K! I sat up with a start and a Wha What? She stated I just got busted doing 93 in a 70.\n\nI looked behind, didn't see a cruiser but she pulled over anyway. Sure enough an Alabama State Cruiser pulls in behind us. I state 29 days and we get busted the last day. She looked at me, I looked at her, and we busted out laughing. Just our luck.\n\nNow imagine this poor trooper as he walks up to our car and seeing us laughing like idiots. He introduces himself and asks did we know why he was pulling us over? She replied you didn't pull us over, I pulled over and was waiting for you since I was speeding. She looked at me and we busted out laughing again. The confused Troop stared a bit and asked for her credentials which she gave him. Then asked what's the big rush to get back to Homeplate? She explained that we had been on the road for 30 days and just wanted to get home. I piped up that if we get home in time I wanted to get a patrol in as I missed being on the road. He looked confused a sec and asked what I meant. I explained I was a County Reserve Deputy at Homeplate and really wanted to get back to it. He challenged; can you prove that? I said sure and handed him my ID. \n\nAs he was back at his cruiser, we were discussing how much this was going to cost us and still laughing like idiots, I came up with the idea that I should get some video of the blue lights behind us for the blog to give everyone else the chuckle. About that time he showed back up at her window. I asked if he minded if I got some video of him sitting behinds us for our blog. He looked at me and said, hell no! You should know better than that! I thought WTF? Everyone takes video these days. I said I just thought the guys back at the Sheriffs Office would get a kick out of it. He said, don't worry. I already talked to them and explained your situation. I answered very dryly, Gee. Thanks. \n\nAfter he handed us back all our IDs and stuff, he said slow the hell down so you get back to Homeplate. Have a good day and walked away. SO looked at me, I looked at her and we both said WTF? And were still sitting there laughing like idiots when the good trooper pulled past us.\n\nAs we continued our drive my SO looked at me and said Thank you! I said for what? She replied, no one has ever gotten me out of a ticket before and this one would have hurt!",
        "created_utc": 1669506691,
        "upvote_ratio": 1.0
    },
    {
        "title": "[STATE TROOPER] One last stop",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/yqp6wy/state_trooper_one_last_stop/",
        "text": "I was working swing shift but I was new to the shift. I didn't realize that if I keep stopping people near the end of my shift, my shift will be extended because someone will go to jail. Guaranteed.\n\nI was headed back to the office to turn in paperwork when I came across a car with underglow lights. I think they were green and blue - obviously not stock and clearly illegal colors. I pulled the car over to the right shoulder with the intent of giving a warning.\n\n\"Good evening, I'm Trooper 2BlueZebras. I stopped you because your underglow lights are illegal. If you want to turn them on in a parking lot, that's fine, but you can't roll with them on while on the freeway.\"\n\n\"Oh, I didn't realize that, I'll turn them off.\"\n\nI asked for his license and he gave me an ID. So I asked, \"This is an ID. Do you have a license?\"\n\n\"Yeah I lost it, but I have one.\" 9 out of 10 times, they do not.\n\nI went back to my car and checked his license and ran him for warrants. Suspended license, four warrants. So much for a warning. I went over the radio to confirm the warrants.\n\n\"Training unit, we're en route.\" They heard me and came to handle it, which meant I would be getting off on time. I love training units.\n\nThey showed up, got the driver out of the car, and placed him under arrest while I watched traffic to keep us all safe. \n\nI watched as a big rig with a trailer drove by us slowly, with the rear bumper hanging off, and pulled slowly to the side. Weird - maybe some mechanical malfunction?\n\nAbout a minute went by while the trainee worked on doing an inventory of the car.\n\n\"Oh shit!\" I exclaimed. \"Something's on fire.\" About a football field behind us was a big fire starting to form. At the same time, the guy from the big rig had walked back to us.\n\n\"Hey I just got hit!\" I directed him to go back to his truck and wait and told him we'd be back with him when we could.\n\nI went over to the FTO, \"I'm gonna head to that thing on fire.\" Then, to Dispatch, \"Unit 2, start me fire and an ambulance for a crash.\"\n\nI figured out the fire was a car on fire. Getting back to it was going to be a challenge. The next exit was pretty far ahead of me, and the exit before the fire was also far away. But there was construction on the road and the far left lane was blocked off with cones.\n\nSo I went full lights and sirens, shot over to the blocked off lane, and floored it in reverse. I arrived in about 30 seconds and saved myself 10 minutes.\n\nI checked on the car and there was a guy standing outside. He was the driver and had been the only occupant. I figured out he wasn't injured, and he was obviously drunk. So I was not going to get off on time.\n\n\"Graveyard training unit, we're en route to the crash.\" Another training unit coming in with the save!\n\nThe fire department showed up and put the wet stuff on the red stuff. The graveyard unit showed up and arrested the drunk. And I went home on time.",
        "created_utc": 1668014328,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Deputy] Much Ado About Nothing",
        "author": "jollygreenspartan",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/yn61il/deputy_much_ado_about_nothing/",
        "text": "\"Complainant says he was stabbed in the back, is lying in the yard and feels very weak. Says he was stabbed by Juan who is still in the house. Call is via language line.\" I'm first on scene with my partner, we find several people out in the yard screaming. \n\nWe make entry into the house and begin clearing. I'm screaming in broken Spanish, *\"Police! Come out with your hands up!*\" One door opens and a woman comes out wailing. Another door stays locked. *\"Open the door right now!\"* I kick the door down to find two scared little kids. As I go to help them out of the house another door opens and a man comes out. I push the kids back into the room and handcuff the man. \"Juan?\" He nods. We clear the rest of the house without further incident. There's a lot of blood, a long trail that eventually leads to our victim. He has a stab wound in his shoulder that has mostly stopped bleeding. The ambulance arrives and takes him to the hospital while we freeze the scene for the detective.\n\nIt's a long wait. Our major crimes unit decides that this isn't their problem because the stab wound is minor so our domestic unit ends up catching it. The on-call detective arrives and begins the laborious process of interviewing the 10 or so people who were on scene when we arrived. None of them speak English and none of us speak Spanish well enough to conduct an interview. Via cellphone the detective gets multiple stories, all conflicting and none establishing probable cause to arrest anyone.\n\nOur crime scene tech is unable to locate a weapon inside the house. There are broken Corona bottles everywhere but none have blood on them. Same with the knives in the house.\n\n\"No weapon and conflicting stories about self-defense. I don't have enough to take anyone to jail. Let 'em go.\" ...OK? We clear the scene as the detective heads to the hospital to interview the victim. The next day everyone decided they wanted to be one big happy family again so the case was cleared.",
        "created_utc": 1667682111,
        "upvote_ratio": 1.0
    },
    {
        "title": "school zones (citizen)",
        "author": "samantha54361",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9k21kb/school_zones_citizen/",
        "text": "Why do they exist? The lower speed limit pisses off motorists and  causes no enhanced safety for the students who should be in class. Additionally why on hwy ny 78 is there an area where it goes from 45mph to a 15mph school zone. Doesn't that seem stupid?",
        "created_utc": 1538268246,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Normally I love big rig drivers.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9iy0sy/state_trooper_normally_i_love_big_rig_drivers/",
        "text": "I was working a graveyard shift with my partner (Johnson) when we found ourselves behind a big rig on a backcountry road. The road was a little challenging to navigate, but nothing too crazy. As Johnson and I were talking, I interrupted him.\n\n\"This big rig has me worried.\" I watched the wheels of the trailer cross the double yellow line and into oncoming trafffic.\n\nJohnson replied, \"Yeah...he could just be tired.\" It was around 10 o'clock at night. We followed for a few more miles, and the big rig crossed the double yellow line two more times, and the right shoulder once. Johnson commented, \"It would've been bad if there was oncoming traffic right there.\"\n\n\"Ah, screw it, it doesn't hurt to have a conversation.\" I pulled him over. My reason for the stop was to check for DUI.\n\nI walked up to the driver, stepped up to the cab, and immediately smelled alcohol. You're not allowed to drive with any alcohol in your system if you're driving a big rig. The driver had both windows down and was chewing gum; common tactics to try and hide the smell of a drunk driver.\n\n\"Good evening, the reason I stopped you is because you crossed out of your lane a few times. Was there any reason for that?\"\n\n\"Oh yeah, I've been driving for a while and I've never been on this road before. Some of the curves sneak up on me.\"\n\nHe explained he had come from a town about 3 hours away, and had another 2 hours to go for the day. As I was standing alongside his window, I spotted a half-empty, unlabeled bottle of pills.\n\n\"Have you had any alcohol today?\" He shook his head no. The smell suggested otherwise. \"What about drugs?\" No, nothing. \"What are these pills? Half are missing.\"\n\n\"Oh, that, it's just some pills I got in Nicaragua I take for pain. I'm not really sure what it is. The last time I took one was yesterday.\" He had already lied about the alcohol, so I was going to assume he had lied about the pills, too. Pain pills from a foreign country sounds like opioids to me, which also cause impairment.\n\nI had him exit the truck and conducted some sobriety tests, which he did okay on. The legal limit for a commercial driver in a commercial vehicle for alcohol is lower than a regular person in a regular vehicle, so impairment is harder to detect (I think this is federal rule across every state). That said, he was so close to the legal limit that if I had stopped him 10 minutes earlier, he would've been at the limit. And he had definitely been driving while above the legal limit, but wasn't tested above the legal limit. I can't arrest based on that since the law doesn't let me.\n\nI had to consider the mystery pills. Since I stopped him not for any specific violation, but because I thought he might be drunk, that was solid probable cause for me to think he was too impaired to safely drive, and possibly under the influence of alcohol plus something else. I placed him under arrest.\n\nWhen we think drugs may be a factor, we request a specially trained Trooper for a further evaluation. He was taken to the jail and evaluated by someone who had more training than me. After about 45 minutes of extra tests, the other Trooper made his determination. He decided there probably wasn't anything in the truck driver's system other than the alcohol. He tested below the legal alcohol limit, and that meant I had to let him go.\n\nObviously, if I thought this driver was driving so poorly that he needed to be arrested, then I wasn't going to simply let him go. He was let off criminally, but not administratively. I issued him an order not to drive for 24 hours and included it in his log book. That would cause whatever was impairing him to process through his system by the time he drove again. And he'd be docked pay since he couldn't drive. I couldn't find a statute that applied, so he didn't even get a ticket.\n\nI know he was driving over the legal limit at some point, but we have to catch them when it happens. He got lucky, and hopefully the hour he spent in handcuffs was enough of a learning experience.",
        "created_utc": 1537924667,
        "upvote_ratio": ""
    },
    {
        "title": "[Officer] why your attitude matters on a traffic stop.",
        "author": "IrishGingerKid",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9ii58w/officer_why_your_attitude_matters_on_a_traffic/",
        "text": "Back when I was a SF (MP) I was running selectives (radar) 25mph maximum.  The base commander was wanting us to enforce the speed limits as a single vehicle was being reported to his office. \n\nWe were only permitted to run radar on selected hours by authority of the base commander. I finally was able to lock in this vehicle. \n\n62 in a 25... I call in my traffic stop.  Make my approach, lady is on her cell phone,  (hands free only on base) window still up. I tap on window.  She holds up her finger as to wait.  I police knock on her window.  She cracks her window and says hurry up! \n\nI explain the stop and say I was authorized by the base commander to run selectives. She says give me the ticket you white mother fucker, I'm in a hurry. \n\nI explain again what selectives are and then do an \"inspection\" of her vehicle to see if it's road safe. \nFull on, left blinker,  right blinker,  horn, hazards, break lights,  low high beams, etc. \n\nAfter her vehicle failed the inspection I deemed it unsafe.  Explained to the nice lady it will be unable to be driven on base until meeting the standards. \n\nI gave her 14 \"fix it' tickets in total.  Along w reckless and speeding.  She says we're not towing her vehicle and calls the base commanders hotline. \n\nBase commander shows up a few moments later. \nI explain the situation to him.  He then talks to the lady. \n\nAfter he speaks to her he advises me she is to be placed on the barment list indefinitely. \n\nHe has trespassed her from the base... criminal federal trespass if she's caught on the base. \n\nWe towed her car,  escorted her off, court date comes,  she's a no show and the magistrate then orders warrant for the tickets. \n\nI call up my civilian Leo's, (ride along) and we go to her house,  they see her drive up,  traffic stop,  arrest her on warrants,  tow her vehicle which is not even 50ft from her house.  She gets in the car, sees me and starts screaming.  \n\nI enjoyed every minute.",
        "created_utc": 1537797595,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Zelda saved me from a traffic ticket today.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9hsv8j/suspect_zelda_saved_me_from_a_traffic_ticket_today/",
        "text": "On my way to the car dealership to get some warranty work done I got pulled over. \n\nOfficer walked up to my window and asked me for my license and insurance saying he would let me know what is wrong in a minute. Not my favorite way to get informed but meh oh well. \n\nI handed him my license and LTC and informed him the firearm was in the door as well as my conceal carry on my waist. He thanked me for that and told me to just make no sudden movements and told me not to show him mine so he would not have to show me his. \n\nI laughed and informed him the insurance was in the glove box. I opened it up and pulled out my switch case. He asked me what was inside and I said my nintendo switch. \n\n\"Oh you play too? What are you playing right now?\" I asked him if I could show him and he agreed. \n\nI opened it up and loaded Zelda telling him it was my second playthrough. He asked me if I had cleared a temple and tried to remember where it was. I opened the map and he navigated to one I had already cleared. He asked me how I cleared it and I ported over and showed him. \n\nIt was the one where you had to create the ice blocks on the waterfalls running down the sides of the walls.  I showed him in detail how to clear it and then he watched me as I cleared some of the guardians on the ground. \n\nThis went on for about 15ish minutes and he stood up remembering where he was and what he was supposed to be doing. \n\nWe both started laughing and he told me to just show him my insurance. He takes a look at it, hands it back to me and tells me he is giving me a warning for speeding. Said I was doing 83 in a 70. \n\nDoes this mean the 199.99 I paid for the nintendo switch paid for itself?",
        "created_utc": 1537555402,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Walking a straight line...in heels.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9h2nv3/suspect_walking_a_straight_linein_heels/",
        "text": "Tl;dr: He wasn't dumb but he couldn't understand how I looked like a woman but walked like a man\n\n*Sorry, I completely forgot my tag the first time around. It's my first time posting here and New Reddit was screwing me up so I got discombobulated. My apologies for the second try of a post.*\n\nNecessary context: I'm a guy who crossdresses on a fairly regular basis. I'm using this account as a throwaway because not all of my family knows about it, and I'd really rather not post it on my regular account. Awkward, I know, but that's how I'd like to keep it for the moment.\n\nThis story happened back at the beginning of winter in late 2016. I had been out to dinner with some friends and then gone to have a few drinks and catch a live band at a local bar and music hall. I left around eleven or so, well before regular closing time. My house is a few miles south of the town where I'd had dinner, and the main highway out of town goes down several steep hills with winding curves. I'm asthmatic and have terrible sinuses (a double curse), and I had the bad luck to have a sneezing/coughing fit as I wound my way down the thankfully-empty stretch of road outside of town. In the course of the fit, I went back and forth across the double yellow lines at least a few times.\n\nMy bad luck didn't end there. I find it hard to describe the sinking feeling I had in the pit of my stomach when I saw the blue lights in my rearview mirror. \"He thinks I'm drunk,\" I thought to myself. \"And I can't blame him. How's he going to react when he sees my license, though?\"\n\nTo make matters worse, my bag had fallen off the passenger's seat and my ID had spilled out onto the floorboard. I'm sure the officer who pulled me over thought he was entirely justified as I stammered apologies while looking for it. Eventually I found it, and he gazed at it and then at me with no change in expression or vocal tone.\n\n\"Have you been drinking tonight?\"\n\n\"Yes, I had one beer with dinner and then two more at the bar,\" I answered, truthfully. \"That was spaced out over about five hours, though.\"\n\n\"Do you know why I pulled you over?\"\n\nI told him that I knew what it looked like, and explained the coughing and sneezing fit. He asked me to step out of the car and said that he wanted to administer some field sobriety tests. At this point, I should explain that I live fairly high up in the mountains. Our winters start early and end late, and are accompanied by some of the worst winds I have ever experienced in my life. This night was particularly bitter, and I have to admit I felt some measure of both pride and amusement as I walked along the white line at the edge of the highway at the officer's direction. I'd never done a field sobriety test under any conditions whatsoever, and now here I was doing it, while wearing pumps, on one of the windiest nights of the year.\n\nHe did the eye-tracking test with his finger next, and after I apparently did all right with that he asked if he could breathalyze me. As confident as I was that I wasn't impaired, I had the same thoughts I'm sure every other person in my position does (\"What if it screws up? What if I breathed, like, all the molecules of alcohol left in my system into that bag and it thinks I'm drunk? What if--\"). It came back 0.026. He stared at the digital readout for a moment and then said in a conversational tone, \"Okay, clearly you're not drunk. And it's really cold out here. I think we should both get home. You be careful out there and use your inhaler as soon you get indoors.\"\n\nGod bless you, officer, for your professionalism, practicality and courtesy. I hope you got a funny story you could post about on Reddit out of it as well.\n\nEdit: a sentence",
        "created_utc": 1537337286,
        "upvote_ratio": ""
    },
    {
        "title": "Walking a straight line...in heels.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9h2lvf/walking_a_straight_linein_heels/",
        "text": "[deleted]",
        "created_utc": 1537336681,
        "upvote_ratio": ""
    },
    {
        "title": "[Coworker] Who Says the Police Can't Have a Sense of Humor?",
        "author": "lAbstractedl",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9fgqv6/coworker_who_says_the_police_cant_have_a_sense_of/",
        "text": "I would just like to preface this by mentioning that this is not my story, however this is a coworker of mine and this is a report that he submitted to his shift supervisor that was approved by said shift supervisor.\n\nHis prior report on the same incident was deemed not descriptive enough, and this was the result that followed. Please enjoy.\n\n\n\n\n\n\nI responded to 24512 Moss Creek Ln in reference to a sick raccoon. Upon my arrival I found a raccoon chasing construction workers around the front yard.  I approached a construction worker who inhaled and exhaled deeply as he had just sprinted from his truck to evade the raccoon.  The construction worker stated the raccoon was sick and possibly had rabies. I asked if the homeowner was around and he answered no.\n \nThe raccoon was average height and weight as far as raccoons go, but its fur was dampened greasy. It looked as if it had just taken a casual swim in the retention pond near by and did not shake the water off. The claws were long and unkempt, and I made sure to stay out of reach of them.  It constantly licked it paws with its long pink tongue.  The raccoon did not wobble on its feet and there was no frothing at the mouth so I knew to rule out rabies.  I looked at the sun beating down with indifference towards us, and I sensed something was wrong when I remembered I had read once a normal raccoon shouldn't be in daylight and chasing construction workers.\n \nI attempted to call animal control to resolve the now harrowing situation as the raccoon would casually amble towards a person so close you could see the shimmer off its beady black eyes, and then it would stand on its hind two legs with arms splayed open and shriek before running off a few feet only to repeat the gesture for every person who made the mistake of making eye contact with it.  Animal control did not respond to my pleas of help, and I knew what must be done as I learned from my sergeant only minutes prior through a telephone conversation explaining to him the facts of the event now being called by the construction workers as “the day we lost a job because a stupid raccoon chased us away from our supply truck” that the animal displayed the disease of distemper.\n   \nSchool buses were letting children off at the bus stop down the street and parents were walking them home passing right by the house I stood. A particularly concerned grandparent with two small, blonde headed children stopped and shouted at me, “hey deputy!” I replied with an appropriate wave and smile, but he continued “Hey deputy! There's a raccoon next to you!” I thanked him for his astute observational skills and walked back to my car with the raccoon now shrieking and chasing yet another construction worker who was only trying to get a piece of 2 by 4 lumber from the truck the raccoon now determined was his territorial home.  A small crowd gathered to point and spoke quietly amongst themselves about the relation of raccoons to the natural environment, and their role within the environmental community.\n \nI pulled my agency issued AR-15 rifle from my car and one mother put her hands over her child's eyes and said “let's go inside son.” This action cleared out most of the crowd, but there were a few who continued to mill around either ignorant of the events about to unfold or there was a morbid curiosity in the same way people are fascinated by train wrecks.  I explained to the families I was going to have to dispose of the animal, and they quickly retreated to their houses.\n \nThere was a sudden calm as if the very essence of the world was holding its breath in anticipation.  A plan was developed and a plan was put into action. We lured the raccoon into the backyard using a particularly brave worker who stated “I think he likes me,” in reference to the raccoon having an affinity for him. In the background was a retention pond with multiple trees and thick underbrush and its banks.  I chose this location based off of two circumstances. The first being there were no people or property in the line of fire or nearby in case of a possible stray shot or ricochet, and because this is the spot where the raccoon stopped and determined this was his last stand.  At this moment it squatted and looked directly at me as if it were begging for sympathy, and for a second I thought I could name it Frank, but then it raised up on its hind legs and let out the ear piercing screech the workers had become accustomed to hearing throughout the day, and I knew at this moment Frank was too elegant a name for such a tormented creature as this. There would be no sympathy today for it. I raised my rifle to my shoulder and thanks to the agency issued Aimpoint sight I knew there would be no need to worry about not being true to my target. The calm that had settled over the air turned to a deafening silence in the waning seconds before I pulled the trigger. The crack of a bullet being fired from the barrel echoed through out the neighborhood and there was a softer clink as the spent brass fell to the ground.  The raccoon stiffened, and fell on its back straight like a furry board.  I asked if the construction workers would get a trash bag and dispose of the animal, and they stated they would.\n  \nSuddenly, as if it were a horror movie monster, the raccoon rolled over and stood up licking its wound between its shoulder blade and neck. I was shocked and sweat began to bead on my forehead. How do I kill something that can't die? I thought to myself.  I took a deep breath and fired again, and again the raccoon not named Frank stiffened and fell on its back before getting up again. I fired twice more, and on the 4th shot, it rolled and squirmed on its back before finally the muscles slowed and came to a halt. Its tail gave one last flick and the raccoon exhaled one last breath before its life extinguished to the sweet serenity of everlasting sleep.\n \nThe construction workers thanked me for what I had done, but I didn't feel like a hero. I just felt like I did what was necessary. I completed and submitted the discharge of firearms report, and the workers stated they would contact the Sheriff's Office if they had anything further regarding the incident.\n\n\nEdit* Formatting\n",
        "created_utc": 1536833600,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] My Mouth Gets Me In More Trouble Than Anything I've Ever Done",
        "author": "WindLane",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9e8cr9/suspect_my_mouth_gets_me_in_more_trouble_than/",
        "text": "Like many people, I was once a dumb kid. Back when I was 18, just graduated from high school, a couple buddies, one of their brothers, and I went to a local amusement park.\n\nThere's a lightrail system in town that could get us there and back for cheap which was great since none of us owned a car and only one of us was licensed. And even though I was the oldest, I wasn't the licensed one - with the lightrail literally right outside my front door, I just never felt the need.\n\nAnyway, after a day of fun, merriment, and *way* too much sugar, we're all at the lightrail stop waiting for the train. It's a weekend, so the trains can sometimes run late due to unexpected crowds - it's usually only busy during rush hour.\n\nBut the stop we're at is empty except for us, so we're goofing around. My friend's brother keeps running into each of us acting like it's an accident, but laughing about it each time.\n\nI give him a push to get him off me and he goes running backwards as though I were Superman, which he finishes off by jumping backwards into a bush.\n\nThe little idiot gets stuck and I go to help him out, everybody's laughing because of how stupid it all is.\n\nI pull him out, just as the train is pulling in and we get on.\n\nBecause I know it'll freak out my friend who's the older brother, I loudly say, \"Man, it's a good thing we didn't buy tickets. What a waste of money!\"\n\nThat's when the plain clothes cop makes himself known. Though I don't know if it counts as being a plain clothes cop when he's wearing his badge right front and center on his chest from a neck chain.\n\nHe pulls all of us off at the next stop except my friend who's the older brother (probably because he was the one telling me to shut up when I opened my big mouth). There's a bunch of other cops waiting in a nearby parking lot.\n\nThe very first question, of course, is, \"do you have your tickets?\"\n\nAnd we all show them our tickets for the train.\n\nAfter a few questions about who did what from when I was helping the younger brother out of the bush, they let us know that the younger brother and I had been arrested and were now free to go, but needed to go straight home.\n\nDays later I found out that despite everyone telling the same story, of how the younger brother jumped into the bush on his own, I was charged with vandalism.\n\nEven though I absolutely didn't do what I was accused of, I've never once thought of fighting the charges because I knew that the only reason any of us got pulled off that train was because of my big, fat mouth.",
        "created_utc": 1536447682,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Pretending to be law enforcement.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9brthl/state_trooper_pretending_to_be_law_enforcement/",
        "text": "At the end of shift I went back to the office to type up my reports for the day. Another Trooper and a sergeant were there. The sergeant came in, \"Hey, you guys got the Be On the Lookout for the people in the area impersonating officers, right?\"\n\nSix hours earlier...\n\nI was at one of my typical speed enforcement spots when I picked up a gray SUV rolling at 83 in a 65 zone with blacked out windows all around. Not on my watch.\n\nBefore I pulled it over, I ran the plate. No results, which was weird. I walked up and found a driver with a passenger. The passenger was holding something shiny out the window...oh look, a badge. Before I said anything, the passenger started, \"Hey man, we're undercover and on our way to a sting.\"\n\nI thought about it for a second. They didn't look like cops, but they acted like them, which makes sense for undercover.\n\nThe driver added, \"Yeah, there's a lot of dope and guns in this car.\"\n\nI checked the badge, and it returned to a local agency. Our undercover car plates also don't return to anything, so that made sense. I've pulled over FBI, DEA, US Postal Police, off duty cops, DAs, judges, military...enough to generally know what I'm dealing with.\n\nI gave a mock salute, \"Carry on.\" And I went back to speed enforcement.\n\nBack to the office...\n\n\"Uh, what kind of vehicle?\"\n\nThe sergeant continued, \"A gray SUV.\"\n\nAww crap. \"I stopped a car just like that today, and I've got the plate.\" The other guy in the room coughed.\n\n\"Oh yeah? Any description of the occupants?\"\n\nI provided the description. The other guy bust out laughing. He used to work undercover. \"Nah man, I know those guys. They're working for a taskforce. They called me and asked me to apologize to you for speeding.\"\n\n\"God...dammit.\"\n\nNow I ask for a badge and ID on every stop.",
        "created_utc": 1535703531,
        "upvote_ratio": ""
    },
    {
        "title": "[DISPATCHER] Sometimes it's the little things that get you through the day",
        "author": "RedOctober282",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9b6ms5/dispatcher_sometimes_its_the_little_things_that/",
        "text": "I work dispatch in a medium sized county. We have a lot of open space, but one city area where most of the crap goes on. And that is where this story begins.\n\nThe other night was boring. It was a rare evening: we are usually crazy busy with non stop calls. But that night just happened to be slow. We were all looking for something to do. Dispatchers, police, fire/EMS. We had a few traffic stops, but no one was wanted or did anything real bad. There were several parking complaints, but those don't make for a good story. \n\nBut halfway through the shift, we had an animal complaint. A (possibly) wild dog was running around a ladies yard, growling and snapping at people nearby and wouldn't leave. Nothing overly crazy or interesting, but it beat \"my neighbor is parked an inch closer to my yard than he should be, I need the police here, wah wah wah\" and so on and so forth. \n\nSo anyway, we dispatch a unit. He is on the way and the complainant called back. She said that the dog ran away and we can disregard. We all went back to our bored Facebook and Reddit and Twitter browsing, until the guy on police channel said \"hey guys watch this.\" \n\nHe went on the radio and got the en route unit's attention. When the unit acknowledged, he said \"suspect fled the scene once he heard police had been called.\"\n\nNow, this is kind of a silly and admittedly not that funny joke. But with all of us being bored, we absolutely lost it. Sometimes, it's the little things that make you laugh and make work better. Was it the funniest thing we've had? Absolutely not. But hey, like I said, it's the little things that help you through the day at times. ",
        "created_utc": 1535522254,
        "upvote_ratio": ""
    },
    {
        "title": "[Officer] The Transmission Tower",
        "author": "XxDrummerChrisX",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9awk07/officer_the_transmission_tower/",
        "text": "This particular incident occurred sometime earlier this year and I figured I would share it with the rest of you. I remember it was a Wednesday evening, and my partner and I were typing up reports at the station. It was approximately midnight and it had been a pretty frustrating day because we had just wrapped up a call that took up the entirety of the day so far. That day was the first day of my work week but the last day of the week for my partner. He was typing furiously trying to get off on time and start his weekend.\n\n     \nAs we typed the power at the station shut off suddenly. My partner slammed both of his hands upon the desk in front of him and exclaimed, \"Fuck!\" The entirety of his report was erased. Then the emergency lights in the station turned on. This was weird because usually it takes a significant outage to cause this to occur. My partner and I decided to go outside and see what the deal was. We went in front of the station where some other officers were standing. It was eerie and strangely quiet. All the lights in the vicinity were suddenly off and what was normally a well lit area, was just black. A major street approximately 100 yards in front of us was no longer visible. We became alarmed as we knew there were still vehicles driving upon this roadway in this darkness. It was at that moment we saw just above the lining of storefronts ahead of us, further past the roadway, the large red-orange glow of a fire. The glow increasingly became brighter and a few of us tried guessing where the source of the fire was.\n\nMy partner and I decided we needed to investigate further. We hopped in our patrol vehicle along with other officers and began driving to where we felt the source of the fire was. As I pulled out of the parking lot and into the roadway I immediately realized the danger of the situation. I couldn't even see the intersection. I switched on my emergency lights to avoid a collision and proceeded slowly through the intersection heading towards the light. I passed several residential streets and I realized I was closer to the fire than I had initially estimated.\n\nA long line of residences ended at an intersection of a street called Emerson, and suddenly I saw the fire. In order to completely understand this story, I feel I need to describe the layout of Emerson. Emerson is a two laned, east-west roadway separated by a large center median whereupon there is grass and two rows of large, high voltage transmission towers. This roadway curves left and right (north and south) back and forth for its entirety. For that reason the speed limit is set to 30 mph, because you can lose control if you are speeding.\n\nI stopped right after seeing this fire, in the middle of the roadway. It spanned the entirety of this center median and about a quarter of a mile in length. Right at that moment, dispatch chimed up advising us of a traffic collision where a vehicle collided with a transmission tower. My partner told me to drive westbound down Emerson, we needed to find this traffic collision.\n\nI started driving down and the only source of light was the dim glow of the fire and the lights of my vehicle. As I began driving I noticed an electrical wire hanging approximately 30 feet above the ground, I was alarmed but we continued on to try and find this collision. Further ahead I saw flashlights blinking at me. My partner and I figured this was more officers as that is sometimes a method of quietly signalling your position to your partners. I stopped the car and we both got out. \n\nDirectly in front of my car I noticed a tire and then, 20 yards further down the road I saw a Ford Explorer sitting facing westbound on the median. The vehicle was absolutely destroyed. All the windows were shattered, the body of the vehicle sustained major damage and surrounding the vehicle I remember seeing a large amount of personal property. I vividly remember looking down and seeing a tube of lipstick and a circular make-up mirror. There was mail and a variety of other items from inside the vehicle strewn about the roadway.\n\n    \nIn that moment I heard voices shouting, \"There's a body!\" I noticed who I thought were officers were just civilians yelling and pointing my partner and I towards the front of the vehicle. I immediately sprang into action. I went to my patrol vehicle and opened the trunk. I put on a pair of gloves and grabbed a red, emergency box containing equipment to aid me in CPR. I began sprinting behind my partner to where the body was located. As I ran past the vehicle, I saw an adult sized woman laying face down upon the center median, lifeless. What was even more strange is I didn't immediately make the connection. I saw her lying there and assumed she had been electrocuted instead of being in the vehicle. After all her body was easily 250 feet west of where the vehicle was located. \n\nIt was at that moment my partner stopped and he then stopped me. We saw even further past the female a large transmission tower, normally held up by four base points, was only being held by two. Even worse it was bent over and being supported by the wires of the other row of transmission towers. Before we even had a chance to say anything there was a large explosion above our heads. A few seconds later, to our right on the ground, there was a secondary explosion. These explosions were so loud and powerful I could feel it in my chest. I remember looking to the source of the explosion and seeing sparks flying. I realized at that time there was a high voltage power line laying across a house, through the front yard, over a large metal fence and upon a truck parked on the street. \n\nI had been so preoccupied on rendering aid that I developed tunnel vision and completely ignored my surroundings on scene. I didn't realize the danger we were in until the explosions occurred. My partner and I then began screaming for all the people at the scene to get out of the street and go home. My partner began shouting on the radio to other officers on scene about the explosions and the downed power lines. We both knew when the explosions happened that we couldn't help the woman because we didn't know if she was electrocuted or not, and we had to focus on preventing anyone else from being harmed. It was at that time our sergeant arrived on scene and advised us to clear the area. We began going house to house along with a handful of other officers and told people to stay inside and shelter in place. \n\nWe did this for approximately 30 minutes and we were advised through dispatch the electricity to the lines had been shut off. Streetlights no longer worked, and I later learned approximately 70,000 people were without electricity in the area. During that time as we notified people to shelter in place, we were advised the woman was pronounced dead. My sergeant ordered me to stand by with the body and make sure it wasn't disturbed. As a had a chance to get closer and see the body I could tell it was a younger woman. I realized the woman hadn't been electrocuted but instead the back of her head was crushed inward. I looked toward the tower that had been impacted and realized there were imprints in the grass made by a vehicle that stretched about 75 yards leading up to the tower. \n\nAt that point I realized what happened. Remember I said Emerson curves, and I realized this woman was going so fast she didn't even have time to turn. She was driving, went onto the center median, took out two of the legs of the tower and her car began flipping. Upon her body I didn't see any bruising or redness upon her left shoulder/chest area indicating she was wearing a seatbelt. I realized she was ejected and the car, while flipping, landed upon her head before continuing eastbound where it came to rest. \n\nI stayed on scene for another 4-5 hours and during that time I began speaking with employees of the electrical company who responded to begin working on repairing the tower. They advised the explosions were caused when an employee in a city 1 hour south of where I'm at noticed an outage upon the grid where the collision occurred. When that person noticed, they gave the grid some sort of command to test the lines and hopefully restore power. Those explosions were the surge of electricity from the tests. I was frustrated that someone would do that, considering the increased potential danger of injuring more people, without understanding what the situation was. What was even worse that night was all units were ordered to stay working until further notice. Simultaneously after this collision occurred and the subsequent power outage, many thieves decided this was their prime opportunity to begin committing burglaries and break into businesses along the aforementioned street that did not have power. \n\nTo end this long story, this was the most terrified I've ever been on this job. I know this isn't the last time I'll be afraid but in that moment I thought I could die at any second because I didn't take the time to see the power lines above my head. One of the 13 deadly sins of being a police officer is ignoring the danger signs and I committed that when I ignored the low hanging line. That's the story, thank you all for reading and be safe out there.\n\nEdit: wording ",
        "created_utc": 1535437604,
        "upvote_ratio": ""
    },
    {
        "title": "[Friend] When showing off goes wrong...",
        "author": "TheDocRaven",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/99yvps/friend_when_showing_off_goes_wrong/",
        "text": "So a few days ago, I had just came off duty and was following a friend (a detective) from the station to grab some coffee before she went out on patrol in her district. I'm in my POV and she's in her completely unmarked (standard 28's, no visible lights/antenna/etc) Tahoe.\n\nWhile en route, I had a fella in a new, bright red Corvette (still rockin' them 30 day temp tags) come up and start riding my ass. I was already doing ~10 over, I was in the far right lane and I felt that he had absolutely no reason to not pass me. I just said whatever and maintained.\n\nFast forward a few minutes and my friend has about a 1/2 mile lead on me, the ‘vette is still on my ass and we're exiting off the interstate onto a four-lane divided with a speed limit of 55. Again, I take the far right turn lane while he takes the #2 and to my surprise, I watch as he blows the light and fucking takes off, legit wide open flat out full throttle. I couldn't help but smile watching him accelerate easily to 110-120, partly because that V8 sounded pretty amazing and partly because I was sitting there thinking \"this oblivious dumbass has *no* clue she's a cop\". \n\nBut sure as shit, he blows right by her, the lights come on and he immediately locks it up. Too little, too late bud!\n\nShe went out with this dude and come to find out he's DOSL, DUI and has an OFA. Gotta give the guy credit for not running or putting up a fight but damn. Not the brightest bulb.\n\nWe met up later that evening for coffee and luckily that attempt was much less eventful, albeit still cut short by someone riding a motorized wheelchair on a highway. \n\nIt‘s no wonder we have jobs. ",
        "created_utc": 1535128106,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Audacity doesn't beat evidence.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/9911n3/state_trooper_audacity_doesnt_beat_evidence/",
        "text": "I was on a 2 lane freeway (two lanes each direction), heading back to my post, just about done with my shift for the day. I was cruising at 73 in a 65; fast enough to avoid being a rolling roadblock and slow enough to be within reason. I passed a truck doing 65, exactly the speed limit, and didn't pay much attention to it.\n\nSince I wasn't moving particularly quickly, I moved into the slow lane after completing my pass, as any law abiding citizen should. A few seconds later, I checked my mirror and saw headlights alongside the truck I had passed. I thought that was odd since I was going above the posted limit, and the truck had been going the limit, implying these headlights were also above the limit. My basic rule for writing people tickets is I don't write what I do. I drive 73 in a 65, so I don't write that ticket. But I don't do 80+ in a 65, so I do write that ticket. You can argue all you want whether that's reasonable or not.\n\nI activated the RADAR on the rear of my patrol car. It picked up the other car. 78mph...79...80...it peaked at 83, still catching up to me as I was watching, which lasted a good 10 seconds. It slowed back down to a steady 81, until it was alongside my rear bumper and I wondered if this person was going to be stupid enough to pass a Trooper on a highway when the Trooper was going above the posted speed limit. They finally realized oh crap, cop! And jammed on their brakes. Waaaaay too late. I slowed down and lit them up.\n\n\"Good afternoon, the reason I stopped you is because of your speed.\"\n\n\"I was going 70.\"\n\nI smiled at the audacity of his lie. \"I was going 73, and you caught up to me. Besides that, the speed limit is 65.\"\n\nI got his information, wrote his ticket, and returned to him.\n\n\"You're getting a ticket because of your speed, 83 in a 65.\"\n\n\"But how could you know how fast I was going?\"\n\nI'm no doctor, so I don't try to argue medicine, and I'm no bridge engineer, so I don't argue bridge construction. It seems to me that if you don't have any training in speed enforcement, you shouldn't try to argue speed enforcement against someone who does have training in it. \n\nBut I explained, \"I have RADAR in both the front and rear of my car. It works whether I'm stopped or I'm moving, or whether you're approaching me or moving away from me...and I watched you the whole time.\"",
        "created_utc": 1534835569,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] You know what they say about assumptions.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/98psi3/state_trooper_you_know_what_they_say_about/",
        "text": "My office was understaffed, which led to mandatory overtime, 14 hour shifts, no days off, and only one or two patrol cars on the road when we should've had three or four. A crash came out, and two of the three units responded to it. The end result was multiple arrests and multiple people being transported, which left just me and Johnson as the only available car for the county.\n\nWe received a call of a car fire with a firetruck and ambulance on scene. It took me a good 45 minutes to arrive because I was on the other side of the county when the call came out. When I showed up, only an ambulance was on scene, along with two other cars, and an upset paramedic.\n\nThe paramedic told me, \"This car was driving down the road on fire, but we put it out. We had to follow it with our lights and sirens for a while to get it to pull over. The lady in the car ahead said she thought the driver was drunk, so she wasn't going to leave until police showed up.\"\n\n\"Okay, I'll check it out.\"\n\nAngry paramedic continued, \"We told your partner up the road at the crash about it but he didn't seem very interested. So we've been here for about 30 minutes.\"\n\n\"Well...yeah, he was dealing with the crash and multiple people had to go to jail because of it.\"\n\n\"He didn't seem to care it was a possible drunk driver.\"\n\n\"Okay...we're here now. We'll handle it.\" Ignoring that my beat partner had actually just arrested two drunk drivers, and our staffing problems had us spread thin, and the paramedics were advised of this, but whatever. \n\nI went to talk to the driver, and looked for fire damage to the car since it looked brand new. The driver pointed it out on the fender wheel well. There was no fire; the driver was helping a friend move, overloaded the vehicle, and the rear wheels rubbed on the plastic causing it to melt. Had his hood been on fire and he kept driving, that'd be a good indicator of possible DUI. But what I saw, not so much. \n\nThen I went into all the tests, part of which is asking questions. Turns out the guy had been up for 20 hours, got 4 hours of sleep the night before, and needed to be at work in another 4 hours.\n\nThe end result of the DUI evaluation was that he was completely sober and really sleepy. Not illegal to drive while sleepy, just not a good idea.\n\nThe angry paramedic did not get the justice he was hoping for, and really there was no justice to be had.",
        "created_utc": 1534731568,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone help me out?",
        "author": "asaspades0311",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/98dsue/can_someone_help_me_out/",
        "text": "[removed]",
        "created_utc": 1534616865,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect]Reported as a suspicious person at first.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/98ar0a/suspectreported_as_a_suspicious_person_at_first/",
        "text": "A couple of weeks ago I was out doing my usual nightly ritual of going on a walk, which is a hobby of mine that I've been doing for about a decade now. It's a coping mechanism of mine that works wonders some nights for my depression. \n\nThis particular night I was also feeling antsy and paranoid (thanks, psychosis) and so I was carrying a metal baseball bat with me as a means of feeling protected (I usually carry a pocket knife, but had recently thrown it away and had yet to replace it.) Also with me, I had a Nike drawstring backpack, which contained two bottles of delicious water, my makeshift bedroom door key, and my guitar-shaped house key.\n\nOnce I was back in my town after about an hour and a half to two hours walking along the highway and trying my best to cope with my hallucinations, I decided to do a lap or two around the outer edges of town before heading home.\n\nAs I'm heading down towards a nearby park, I am illuminated by headlights, followed by the familiar red and blue flashing lights that I'm all too familiar with due to my rather \"unusual\" hobby. \n\nI'm greeted by two state troopers. Trooper #1 asks me to put down my bat and then where I'm going. I reply for a lap or two around town before heading home. He then asks if I was in so-and-so township earlier, which I was, before stating that earlier they had a call about a suspicious person walking up in the area, which was around the time I confirmed that I was up there.\n \nTrooper #2 takes out a notepad and pen and takes down my information (name, date of birth, address, phone number) since I don't own nor was carrying an ID card or a driver's license.\n\nTrooper #1 then makes a comment about how I'm dressed in all dark clothes and shouldn't be walking on the highway at night and that I could get hit by a car or truck, which I give a mere shrug to, and commented that I wouldn't mind if it happened to me anyway. \n\nHe calls out my suicidal implication (I think I'm using that word correctly) and then asks if he would call an ambulance if I would willingly go to the hospital, which I refused. I knew what I was getting myself into at this point.\n\nI'm then given the choice that I've had to make before: either I go with the ambulance to the hospital, or I go with them. He asks twice, and both times places emphasis on the fact that if I went with them, it'd be in handcuffs. I don't have an issue with being handcuffed, and a hefty ambulance bill isn't exactly appealing, so I once again refuse the ambulance.\n\nHe then suddenly asked me who I lived with, and I said my parents and 3 siblings. He then proposed to me that I could either have my dad (the only one home at the time with a car) come pick me up and take me home, or he'll take me home. I choose the latter.\n\nThe decision was made, and both troopers agreed that that's what we're going to. Trooper #1 asks for my bag to look through and grabs the bat while his partner handcuffs me and pats me down. He finds nothing on me except for my cell phone, and after a brief exchange of words that I've since forgotten, places me in the car.\n\nThe ride was relaxed, as were all the other times I've been transported by police somewhere, and after having some words with my dad and wishing me luck with my mental health struggle, they left.",
        "created_utc": 1534588077,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Why having the labels facing out is a much better choice.",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/97k1rs/suspect_why_having_the_labels_facing_out_is_a/",
        "text": "SO I was on my way home from a fun session of gaming with friends. I am drinking some Sarsparilla Root Beer, cause sometimes I like to live on the wild side, and exit off the highway onto the service road going towards my home. \n\nAbout 400 yards after exiting off the highway is the turn I need to take to get home, so it is kind of a hard stop and turn. Not the best design. \n\nRight after turning on my road I noticed an SUV riding my ass. Now I NEVER brake check anyone, but that doesn't mean I wont let off the gas. \n\nMistake number 1. \n\nInstantly the red and blues flashed, I pulled off to the side in a parking lot for a strip mall still being built and an office came to my window. \n\nHe told me I failed to signal a lane change after exiting the highway and wanted my info. Handed him my License, insurance, and Texas LTC informing him that the firearm was in the center console. \n\nHe acknowledged it and just told me to keep my hands on the wheel and there would be no issue. He took my info and went back to his car for about ten minutes. \n\nI noticed more and more police cars showing up for this stop. Not unusual as my town is small and local pd generally have nothing to do. But then 6 officers approached my car. One at each window and two more by my door. \n\nRuh roh\n\nSo he asks me if I would mind stepping out of the car so we can chat. I comply and verbally told him every action I was about to take so there would be no surprises with my movements. I get out and he pats me down with all of the officers looking into my front seat. \n\nAt this moment I am thinking about that ticket that I got in Dec of last year. I paid a lawyer to take care of it and he told me he got it dismissed. Its possible he was wrong, or the court made a clerical error. I see several officers pointing their flashlights into the front of my car and nodding. \n\nHe finishes patting me down and says the most beautiful words I heard all night. \n\n\"You mind explaining those beer bottles in your front seat?\"\n\nI had to suppress a smile. \n\n\"Officer those are not beer bottles. Those are [Sarsaparilla root beer bottles](http://cdn6.bigcommerce.com/s-vs756cw/products/1265/images/1875/boots_sarsaparilla_root_beer__55780.1495582546.333.500.png?c=2)\" \n\nHe squints, asks me if I am sure, I say yes and offer to show him one. The other officers are giving me stone faced looks or are looking at each other in confusion. The one talking to me says he will take a look and verifies with me 4 times that it is ok to reach into my car and grab one of the bottles. \n\nI agree and he finally does. He reaches in and comes out without the bottle and lets everyone know its root beer. \n\nThey had me stand behind my car for roughly ten minutes and came out with a written warning for the failure to signal. He stated that I was polite, cooperated, and was friendly with him so he gave me a break. ",
        "created_utc": 1534352822,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Additional Units Code 3",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/97bj6i/state_trooper_additional_units_code_3/",
        "text": "I've worked in a busy area, and after doing that for long enough you slow down your responses. A lot of calls we get start out sounding crazy, and end up not as reported or significantly less hazardous than what they originally seem to be. We have a few radio codes we keep in reserve to signify something is serious once a unit goes on scene.\n\nA side effect of a busy area is the generation of a lot of paperwork. At any given time, half the Troopers assigned to the road will be sitting in an office typing up frivolous reports about scratched bumpers.\n\nLike a normal day, myself and a few other Troopers were typing away in the office. I was the most experienced guy in the room at that point. Another Trooper got a call of a crash on the freeway that appeared to involve a motorcycle and a car. We get those three times a day and aren't a big deal to us, although they tend to involve injuries to the motorcyclists.\n\nThe Trooper assigned to that area responded to the call and arrived on scene. A few moments later, he put out garbled radio traffic that sounded like, \"Additional units code 3.\" I got up and ran down the hallway towards my car. I don't run very much. The new guys picked up on that, and ran after me. One asked, \"What did he say?\" I told him, \"It sounded like he said additional units code 3!\" I later confirmed that is what he said. That radio code is basically one step below a shots fired call.\n\nWe jetted out of there and arrived on scene within two minutes. I came up to a scene with the other Trooper laying on top of a college-aged female, pushing her into the ground, as she was acting like a zombie. She was snarling and writhing around beneath him as he tried to keep her under control.\n\nI helped detain her as we called for an ambulance and waited. The medics eventually showed up and strapped her into a gurney. The original Trooper described it like a scene out of The Exorcist with how eerily she was behaving. \"It was like she had her voice, and a second voice.\"\n\nIt turned out there was no crash. The female was a mental patient who jumped out of her caretaker's moving car. The original report of the motorcycle was a guy who stopped to help, and backed off when he realized the situation was not what he expected.\n\nOn the plus side, there was no report required.",
        "created_utc": 1534276135,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] A Two Unit Call",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/95vm4c/state_trooper_a_two_unit_call/",
        "text": "Most offices have three shifts; days, swings, and graveyards. Days and graveyards are full shifts. That means they're fully staffed and have more units regularly assigned. Swings is just a cover shift, primarily used to give days down time to write reports at the end of their shift, and graves time to write reports at the beginning of their shift. Swings usually has one third or one quarter the staffing of a normal shift.\n\nI was working swings, and by chance of scheduling, injuries, vacation, and whatever else could screw me over, I found myself as the only Trooper unit in an area covering over 1 million people.\n\nAs you might expect, calls stacked up and I had to prioritize them. I asked dispatch, \"Unit 2 to Dispatch, what's pending?\"\n\n\"Unit 2, well, take your pick. We have three crashes without injury, one hit and run, one disabled motorist, one vehicle blocking the road, and we were just notified by the DMV that someone is attempting to register a car that has a registration hold.\"\n\nRegistration holds can be for a lot of reasons, the most common being a stolen car. Someone buys it locally for a great price, all cash, no title, never met the person they bought it from, only to find it's been stolen.\n\n\"Dispatch, go with the details on the DMV call.\"\n\n\"Unit 2, DMV is reporting a registration hold per the MadeUp Police Department. They're requesting stop and question the occupants. The DMV is reporting at least two parties on scene.\"\n\n\"Dispatch, I copy. Can you contact MadeUp PD and get more details, please?\"\n\nDispatch came back a few minutes later. \"Unit 2, per a  MadeUp PD Sergeant, that vehicle is connected to a string of armed robberies in the area. It was captured on security footage with up to four suspects.\"\n\n\"Dispatch, I copy...I'm not going to that, that's a two unit call. Hold it for shift change. I'll take the next priority call.\"\n\n\"Unit 2, good idea. I'll show you en route to the hit and run.\"",
        "created_utc": 1533814158,
        "upvote_ratio": ""
    },
    {
        "title": "I have a question for officers working in states where marijuana has been made legal.",
        "author": "Daddycooljokes",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/95ftr0/i_have_a_question_for_officers_working_in_states/",
        "text": "[removed]",
        "created_utc": 1533677337,
        "upvote_ratio": ""
    },
    {
        "title": "[Detective] \"Did you mean to hurt her?\"",
        "author": "Felony_Screening",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/94oqrz/detective_did_you_mean_to_hurt_her/",
        "text": "\"No, it was just a mistake.\"\n\nThese are the words that echo in the interview room after I finally call out my suspect on his inconsistent statements and state that my victim would never lie about something like this. The silent camera in the corner of the room captures the words coming out of his mouth.\n\nThe suspect? A 40-year-old adult male.\n\nMy victim? His 9-year-old daughter.\n\nIf there is one question that I know will forever remain unanswered in my law enforcement career, it'll be, \"Why would someone want to hurt their own family member like this?\"\n\nThe most difficult part of any sexual assault investigation involving family members is looking into the eyes of the victim across the table and knowing that this day is forever burned into their minds. Someone that they trusted all of their lives have betrayed them in just a matter of minutes and now they begin to question who they can actually trust ever in their life. I know that when they leave my station that night that they will always remember those several hours they spent in my interview room.\n\nIf there's any silver lining to these investigations, it's the fact that my prosecutors and future jury members will never allow someone like this to walk out of a courtroom as a free man. I can sleep soundly at night knowing that they will endure many years looking up at the ceiling of a cell from their metal padded bunk. The type of person that betrays their own family member for a few minutes of sexual gratification should experience the same pain as their victim.",
        "created_utc": 1533437485,
        "upvote_ratio": ""
    },
    {
        "title": "[Corrections] Merry Christmas To All, And To All A Rough Night",
        "author": "Muff_Huffer",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/945ksq/corrections_merry_christmas_to_all_and_to_all_a/",
        "text": "One of the givens in any first responder job is that you work weird days. Your weekends are Thursdays and opposite Mondays, you miss birthdays and anniversaries, you lose track of the weeks and months, and so on and so on. One of the biggest and most well-known drawbacks is that more often than not, you end up working holidays. Your family and friends will adapt, and so will you. People you know tell you how rough it must be to work on Thanksgiving, Christmas, Flag Day or whatever other day is important to them, you nod and agree, and then realize that you can’t remember the last time you celebrated St. Patricks’ on March 17th and at this point, you’re kind of beyond caring. The part that doesn’t get discussed, however, is that even without taking into consideration the fact that you’re separated from your family/friends/drinking buddies, holidays can be some of the worst days to work. \n\nChristmas night arrived on the back of a cuttingly cold wind. Winter was late that year and seemed to be making up for lost time. I was without any family in town, so I woke up like any other day, made a quick phone call to one or two people to wish them a happy holiday, got dressed and headed in. The radio happily blared “Jingle Bell Rock” for what would have been the 50th time that day as I shivered in my seat and cursed the car heater for warming up too slowly for my liking. Traffic was predictably light (it was Christmas, after all), so I could take my time rolling down the road, not that I wanted to for fear of catching hypothermia in my own car. I parked, headed in, and sat down to a typical briefing, only unusual in the sense that the LT wished us a Merry Christmas and then verbally hoped that the eggnog we’d been drinking all day didn’t have anything extra in it.\n\nI prayed that the cold weather meant a slow (or dare I say it?....*quiet*) night. A storm had been whipping through town for the last few days, bringing sleet and single-digit wind chills, and mercifully driving a majority of the local shitheads back indoors. This hopefully meant that I wouldn’t have to deal with too many new customers in Intake that night, just the ones left over from the previous shifts. This was, of course, wishful thinking.\n\nInitially, the night went well. There were a few pending tasks left by daywork that I was able to quickly cross off my list, and being a holiday, the facility was operating under “modified conditions” – restricted movement and limited services, in essence, making my job less demanding than usual. The inmates had gotten their Christmas dinner (turkey leg!) and most were, for once, sound asleep by 2300. Except for the odd homeless drunk or DUI, the door wasn’t moving too much. Road guys reported worsening weather, and instances of senior guys packing up early and going for the gusto with 2- and 3-hour naps in their usual hiding spots. The Charlie Brown Christmas special was on the TV on a loop. Luke was in to help out that night, along with my other partner Tom; another sergeant, Gordon; ANOTHER sergeant, Big Steve, and the LT. With so many people off on holiday leave it was all hands on deck – 1 set of bars and 9 total stripes to look after 2 deputies. Such is life. Being that by midnight, nothing had happened, and that there was enough rank there to handle anything that would come up, I headed out for lunch. After I had thoroughly de-iced the glass on my car, I cruised through the virtually empty streets to a (mercifully) open 7-11 to pick up snacks. Break over, I came back to the parking lot, begrudgingly locked my car, and walked back through what had now become a cold rain to the locker room. I dropped my soggy coat and hit the sally port. What greeted me was…not what I left. The next hour could only be described as the proverbial coal in my Christmas stocking.\n\nThe previously empty intake rail was now almost chock-full – I stopped counting at 10 new customers. There was hustle and bustle as arresting officers ran around with paperwork and in and out of the magistrate’s office. To make matters worse, I looked across the desk just in time to see Luke, Tom, LT and a PD guy being challenged to a full fistfight by a drunk in the holding cell they were attempting to carry him into. I barely even had time to put down my second lunch, before Tom grabbed the guy and spun him as he attempted a takedown. Luke sidestepped and tried to catch his other arm, but the momentum carried the guy into the wall just the same, and his face hit the padded wall with a resounding *smack*. The man crumpled, and his face slid slowly down the wall like a bad cartoon, a streak of blood trailing behind. Tom, not known for his compassion, or gentle handling of aggressive subjects, had a genuine look of shock and remorse on his face as blood quickly pooled from the man’s nose and cuts on his face. \n\n“Oh, shit, dude,” Tom muttered to me. “I think I broke his nose.”\n\nLT bent down to inspect more closely. “Looks straight to me. He’ll be fine. Call the nurse anyway.”\n\n“Damn, Tom!” Luke was already on shittalk mode, even as he was single-handedly rolling the guy over to recuff him. “It’s like that? What’d this man ever do to you?”\n\n“Fuck you! I fuck…bitch ass…fuckin beat your whole ass, kill yo mamma! Bitch ass!” With every syllable, the drunk sprayed blood across the cell. His nose was running like a faucet as this point and he knew it, but it didn’t stop him from spitting vitriol (and more blood).\n\n“See man, he didn’t mean it.” Luke was perpetually joking, and this was no exception. “He just wants to kill your whole family and beat you up. Ain’t that right, bud?”\n\n“Fuck yourself!”\n\n“Okay, sir! No problem.” Luke hauled the guy up by his cuffs and plopped him in a wheelchair, chuckling the whole time. The alcohol had thinned his blood, making his (albeit superficial) bleeding worse than it otherwise would have been. The officer standing behind him, watching this whole mess unfold, was now just shaking his head.\n\n“Damn, we just left the hospital, too. I just got him cleared for his face.”\n\n“What happened?” I asked, curious to know the backstory.\n\n“Genius tried to run from me, but he had so much to drink he could barely stand still in the first place. Add the sagging pants…he lost his balance and faceplanted right in front of me. Slid a good distance on his face. He just got all those cuts butterflied and Durabonded back together. 45 minutes down the drain,” he moaned, probably more upset at the sunk time than over the subject’s medical condition.\n\nLT and I looked at each other before shrugging in perfect unison. The phrase “play stupid games, win stupid prizes” came to mind. \n\n“What about his nose?”\n\n“Oh no, that’s new. I can thank you guys for that one.”\n\n“Way to go, Tom.” Now it was my turn to hop on the joke train. “You just undid this nice officer’s hard work.”\n\nTom continued to look somewhat sheepish off to the side as the nurse arrived. I heard the sally port door open again, and because I was last on, I became the first to pull off and go greet our newest guest for the evening. I met PD at the door and walked them into the first intake room, where the officer sat his guy down and we both started our paperwork. Another drunk, this guy was a little mouthier than the first one, and clearly had been going at it in the car with his AO.\n\n“I’m just saying, though, you’re wrong. How can I be driving inside of an influence if I’m not even in the driver?”\n\n“I already explained this to you.”\n\n“No, I didn’t esssplain anything to myself. How?”\n\n“Because when I pulled you over and you eventually stopped the car, I watched you climb into the passenger seat. No one got out of the car, and no one else was in the car. That means you were driving it.”\n\n“But I wasn’t driving.”\n\n“Dude…I’m done talking you right now. Just sit there and wait for the deputy to tell you what to do next.”\n\n“Bro no! My boy was driving!” The drunk got up and began to hop up and down, hands still cuffed behind him. “I show you he house! I’ll take you there! He’s there now and you arress’im instead! What the fuck, bro!?”\n\n“Siddown.”\n\n“I gotta piss.”\n\n“We gotta do this first. Sit. Down.”\n\nThe drunk turned to me. “Man, I gotta piss. Y’all are violating my….you are violating my CONSTITUTIONAL RIGHT to TAKE A FUCKING PISS.”\n\nNow it was my turn. “We’re almost there. You can make it 3 more minutes. Siddown.”\n\n“I’m not sitting. I gotta piss, bro.”\n\n“Okay, you can, when I finish my forms. You need to sit.”\n\n“I’m gonna piss right fuckin here.”\n\n“Last chance, man. Act right or you’re going in a cell.”\n\nIt was the AO’s turn again. I guess he subscribed to the adage of “don’t piss off the dep in his own house,” because he sort of shouldered me out and got eye to eye with his guy. “Hey. Sit, or they’re gonna make your night worse than it’s already going. Trust me.”\n\nNow pissed at me, the (still-cuffed) drunk mean-mugged me around the officer. “Or what? Or fucking what? I’m trying to FUCKING PISS, BRO.”\n\nBy this point, I had come around from the small desk that was in the room and both PD and myself had stepped up to him. It gave me an opportunity to get a closer look at the man’s amazing sweater – a knit, patterned, button-up cardigan with a full chest, embroidered picture of Paddington Bear riding a unicycle. I took a brief moment to appreciate the absurdity of the situation – getting challenged to a fight on Christmas night by a man probably 15 years my senior, wearing this…ultimate ugly Christmas sweater. My moment of clarity was interrupted by Gordon poking his head in the door.\n\n“Muff_Huffer, you good?”\n\n“Nah, he ain’t good. And I need piss,” the drunk interrupted.\n\n“Hey, man, what happened? No sense in yelling.” Gordon was always quick to try the friendly route, but would just as quickly get impatient, skip the stern route and go straight to hands.\n\n“Suck my dick.”\n\nGordon turned to me. “He hit the x-ray machine yet? I got a dry cell ready.”\n\n“Dry cell it is,” I responded.\n\n“Hey, look guys, I tried-” The officer’s apologies were cut short as we shrugged, told him it was fine, and then ~~dragged~~ gently escorted the drunk to his new quarters for the evening. Much to his simultaneous delight and chagrin, he found it had a toilet – that didn’t flush, being that he was uncooperative with the search procedure. Despite his convincing argument (consisting of cursing and kicking the door), Gordon and I were unmotivated to move him into a cell with a normally functioning toilet, giving him an opportunity to dispose of potential contraband. \n\nAs I returned back to my post in Intake, I passed by the holding cell where Tom and Luke were still watching the nurse attempt to repair the first drunk’s face. The drunk had mysteriously made his way out of the wheelchair that lay discarded in the corner, and now found himself fully secured in one of our restraint chairs. Despite every limb being strapped down, he was thrashing his head with all his might in an attempt to get free. This, of course, made it impossible for the nurse to apply ointment, butterflies and skin glue, but she was trying her damndest just the same, occasionally jabbing a cotton swab or a butterfly at the side of the man’s head to close the smaller cuts. Unsurprisingly, when his face slid down the grippy rubberized wall, not only did he reopen all of the cuts from his nasty case of road rash, he also gave himself a new strawberry where he had rubbed the very topmost layer of skin off. Bad day to be him, I guess. Tom still looked sheepish, and Luke was still giggling and very clearly making fun of him. \n\nI walked back into the Intake office to grab my water bottle, but before I could leave, the sally port slid open again and a shrill wail filled the room. A short, stocky state trooper appeared around the corner, grasping the arm of a clearly agitated (and clearly drunk) young woman in a clearly Christmas-inappropriate dress. He was attempting to put her in a control hold, and failing, as she frantically wiggled her arms and hopped around, shoes and wig flying all over the area.\n\n“You want a hand?” I half-jokingly asked.\n\n“mmphf-Please!” The trooper caught a face full of shoulder as she twisted her elbow free from his grip.\n\nI quickly looked around and realized that my smart-assery had bit me back, as there was no one else I could con into dealing with this. I groaned and jogged over, grabbing the girl’s very sweaty other arm. Now I knew why this 130-pound female was giving him so much trouble – she was slippery as hell. I hit my control points and, together, we got her bent into a cuffed comealong. I took a step towards the intake office, but the trooper shook his head. \n\n“No way, dude. She’s been acting crazy this whole time. You guys got somewhere we can stick her?”\n\nI sighed and jerked my head towards the rest of Intake. “Yeah, sure do. Not many spots left, though. Come on.”\n\nThe girl’s wailing grew louder. “You’re gonna put me in a roooommm? I didn’t even do anythinnnggg!”\n\n“You can’t act right!” Much like the last PD guy, the trooper had clearly already been arguing with her.\n\n“Fuck you! Djoo know who my dad is?”\n\n“I don’t care. Keep walking, or me and the deputy are going to drag you.” Her feet flailed beneath her – based on how intoxicated she was, I doubted that she could have kept a steady gait even if she was walking under her own power, and certainly not at the speed we were going.\n\n“Fuck you, pussy! You can even not touch me! Is assault. Yeah! Sex assault! Rapist! You RAPIST! RAPIST RAPIST RAPIST RAAAAPPPPEE!”\n\nWe both shook our heads as we arrived at the cell. Suddenly, the female swung her legs in front of her, planting them on the closed door, in an attempt to keep us from opening it and placing her inside. “Nope. Not going. I’m not go in there.”\n\nOut of patience, the trooper clearly wanted no further conversation. “Yes. In.”\n\nI ran the door and swung it open with my free hand. The trooper made a step to guide her into the cell, causing the whole 3-person chain to rotate. This bladed her body to him even further, so he pushed her shoulder on that side forward to rotate her away from him. This turned out to be a smart move, because as he did this, the female remarked “Back home, I spit on trash like you.”\n\nAnd sure enough, before either one of us could open our mouths to say “Don’t even think about it, dummy,” she turned her head and hocked a loogie right into the poor guy’s eye.\n\nTime froze for a second. The two of us were dumbfounded. This tiny woman may well have just took a piss directly into the Eye of Sauron. She had just stood in the face of everything this trooper stood for – the snappy dress uniform, the tight discipline, the hat (she disrespected the freaking HAT!) – and basically gave it two flaming middle fingers. To make matters worse, before either of could totally process what had happened, she did it again. Same spot, same eye.\n\nSuddenly processing what was happening, the trooper’s face changed. The color drained out before coming back a unique shade of what I’ll call “bullfighter cape red”. I could see little cartoon fires dancing in his one clear eye. I’m pretty sure steam came out of the top of his head. Failing to notice any of this, and taking advantage of the fact that neither of us had moved yet, the auspicious female reared back and went 3-for-3 on saliva shots. This caused the trooper to finally physically react – he let go of her arm, squared up, and wound up for what I genuinely thought would be a punch that would take this girl’s head off. He quickly caught himself, gave a frustrated yell like a wounded animal, stomped his foot like a child, and quickly left to go find an eyewash station. \n\nNow, at this point, it’s probably worth mentioning that the last three paragraphs could have happened 5 or 6 times over in the time it took you to read all that. It was so quick and bang-bang that my brain could barely keep up, and my body certainly couldn’t. All of a sudden, I was alone with this female, who I had definitely just watched spit on another cop, and I had an open cell door two feet away, and she was turning her head towards me. Was she going to spit, or just yell, or ask me a polite question? I had no way of knowing. I also had no other bodies in the form of backup, and my patience for the evening had very quickly worn thin. I had two options – talk her into the room, or put her into the room. I watched her head rotate and quickly picked an angle where I was no longer comfortable allowing her face, to, well, face. A split second later, her head crossed the imaginary line, and, out of patience and other ideas, I took what seemed like appropriate action at the time - I hip tossed the girl clean through the doorway.\n\nShe flew into the cell, and somehow landed in a perfectly seated position on the bunk. She fell with a solid **thump**, paused for a second, and began to cry. I felt little remorse for her at that point. She opened her mouth to blubber more, and I instinctively snapped at her like a parent at a misbehaving child.\n\n“NO!”\n\n“But I didn’t!” she blubbered through a face full of tears and snot.\n\n“Yeah you freaking did! You spit on a trooper, I watched you do it! That’s real dumb – real damn bad decision.” Professionalism was kind of out the window at this point, at least for the next few seconds before I could get my emotions back in check.\n\n“I’m gonna go to jaaaaailll?”\n\n“You’re already IN jail, lady. Sit down. Not another word.” I slammed the door harder than I needed to and went in search of my chapeau’d comrade. I found him in the nurses’ station, rubbing hand sanitizer around his face and what appeared to be directly into his eye.\n\n“Hey bud, I’m sorry about that. You good? You want our people to check you out or call you a rescue or something, get it flushed?”\n\n“Nah, I’m straight,” he sighed. “Shit just makes me mad. Guess I gotta take out a Battery LEO warrant now. More bullshit on Christmas. Thanks for giving her a little ride though – had to catch myself back there.”\n\n“Happy to help. I guess you can list me as a witness for your charge, if you need one. We’ll pull the tape for you.” I begrudgingly offered my court time and the services of pulling camera footage, despite not really wanting to do either. The troop just shook his head and continued rubbing gelled alcohol directly into his eye socket. Unable to think of anything witty or relevant, I simply sighed and turned to the full rail of subjects to be processed, scanning my newly full printed name roster.\n\n“Mr….Jacobs, step up. Let’s get your paperwork done before the stores open for those post-Christmas returns.” And thus, another holiday at work rolled on.\n\n------------------------------------------------------------------\n\nThe first drunk would eventually pass out from the booze and the weed, allowing the nurse to close the wounds and examine his nose more closely. It wasn’t broken. When he finally woke up (on the following day shift), he had no recollection of the previous night’s activities. He was released the next night with a court date for PI and probably an appointment at the doctor.\n\nThe second drunk sobered up and was released on the following day shift, with a court date for PI. I am still shopping for a sweater like his.\n\nThe female was charged with PI and Battery against a Peace Officer, convicted a few months later, and sentenced to time served. She was in and out of lockup a few more times before ICE got wind and had her deported back to her native country. \n",
        "created_utc": 1533262156,
        "upvote_ratio": ""
    },
    {
        "title": "(Serious) What were the most disturbing calls you’ve responded to? Ultra creepy paranormal or full on fucked up breakdown. Share your stories!",
        "author": "GenderStudies4Life",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/93ac5r/serious_what_were_the_most_disturbing_calls_youve/",
        "text": "[removed]",
        "created_utc": 1533002427,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Road closed.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/90vxl5/state_trooper_road_closed/",
        "text": "The bane of any cop's existence is working a road closure, especially on a busy street. This is actually two stories cut in half, and I'll tell the first half at some point.\n\nAs you probably guessed, I had a major road closed and it was due to a crash. But it was around a bend, so the road looked clear. There were flares and cones and my car blocking the road with all my lights on, directing people down a detour. Cars were coming in groups of five or six, but 99% of them figured out they they needed to go down the detour. \n\nBut there's always that one guy. Sometimes it's an off duty cop going into the office. Because they know not to destroy evidence or damage the scene, drive with due care, and they're going to be the unit relieving me, sometimes they're allowed through when the road isn't completely blocked.\n\nThis road was completely blocked. The President himself couldn't get through unless his limo can secretly turn into a helicopter and fly.\n\nAt one point, an off duty cop pulled up next to me and asked if he could get through. I told him no, he understood, and followed the detour.\n\nSo \"that one guy\" went around the cones, went around me, and kept going towards the crash. I went full emergency lights and sirens after him, and he stopped. The gall of his maneuver caused me to be less than cordial as I contacted him. There were emergency personnel on scene prying vehicles open, trying to rescue trapped and injured drivers. \n\n\"What are you doing?!\" As I walked up, he pulled out a badge. I don't remember what department it was, but it was something federal.\n\n\"I need to get through this way.\"\n\n\"I don't care, the road is blocked! In case you missed all the cones and my police car, you can't go this way.\"\n\n\"Well I don't know any other way.\"\n\n\"Take the same detour everyone else is taking!\"\n\n\"Does that lead to where I'm going?\"\n\n\"Yes!\"\n\n\"Okay, I'll go the other way.\"\n\n\"Thank you!\" That was not a polite thank you.\n\nIt doesn't matter who you are; if the road is blocked, the road is blocked.",
        "created_utc": 1532241249,
        "upvote_ratio": ""
    },
    {
        "title": "[firefighter] duck hunt",
        "author": "themedicduck",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/900te2/firefighter_duck_hunt/",
        "text": "Firefighters and cops are alike in many ways.   We both are public service, we both work weird assed hours and we both like to tell war stories.  And we get some crazy, nutty stories that you would just not believe.  like this one that occurred nearly 11 years ago during my probation.\n\nWorking out of a suburban/rural town in a smaller FD means you typically (at least on my side of the US) do both fire and medical.   We get toned to a \"unknown medical/trouble\" alarm at the drug store.  This store has an attached pharmacy.  this plus the fact the druggies have flawed logic equals this incident.  \n\nso we are told to stage, we park 1 block away, facing the back end of the attached pharmacy where the drive-through window is.\nNothing happens for about 5 minuets.  But then we see 3-4 officers bolting to the back where the drive-through window was located.  \n\nSee, apparently this genius had decided to rob the pharmacy and the boys in blue had blocked the front door and were trying to get him to give it up.  \n\nThis Genius had other plans.  the drive through was a good 4 feet off the pavement.  not a huge jump when you're not under pressure, however, with 4 of the city's finest barreling down on you, he suddenly believed he could fly.   Yes, he believed he could soar, running through that open door.  (window.)  ((my kids wanted to watch spacejam, seemed to work here.))  \n\nwell he launched himself out of this window.  It was magnificent, it was graceful, it was poetry in motion!!  the jump and escape of legends!!  \n\nwell it would have been.  Until the officer who was about to tase him at the window fired right as the suspect jumped. \n\n\nThe end result was probably the most insane taser trick shot I've ever seen.  The suspect flew through the air for a fraction of a second before twitching in midair and hitting the ground HARD like a sack of bricks.   \n\nAs we were now evaluating him for injuries, (other than the taser darts in his leg and chest.) I overheard one officer ask the other officer \"hey man, you ever play duck-hunt as a kid?\"  \nother officer: \"nah what is that?\"\nFirst officer: \"old NES game where ducks would suddenly fly out of the bush and you had to shoot them with this zapper thing.\"\nSecond Officer: \"huh.  I totally get the resemblance.\"\n\nNote: suspect lived with minor scrapes and went to jail.  ",
        "created_utc": 1531958657,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Policing the police.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8zkbz9/state_trooper_policing_the_police/",
        "text": "I was stopped on the side of a rural road, monitoring activity logs and eating a snack when I saw a Be On the Lookout log pop up on the screen. It was for a reckless driver; a black sportscar with a bicycle rack on the back that was speeding, tailgating, and making unsafe passes. It was headed my direction. As I was reading the log, three cars passed me, and the one in the middle looked like the suspect vehicle. \n\nThe car in the back pulled over and the driver yelled to me, \"That guy in the black car is driving like a maniac!\"\n\nI asked, \"The one that just went by?\"\n\n\"Yeah, with the bike rack!\"\n\nOff I went. I can't really stop someone without seeing a violation myself, so I tried to catch up, while also hanging far enough back to see if they'd do something dumb. They did. I watched them tailgate the car in front of them, and speed up to 80 in a 55 to pass the car ahead of them.\n\nI hit my lights and siren, and the sportscar yielded immediately.\n\n\"Good afternoon. I stopped you because of your speed, tailgating, and you were called in as a reckless driver. Are you in a hurry to get somewhere?\"\n\n\"I'm on my way to the academy.\"\n\n\"Which academy?\"\n\n\"The Trooper academy.\" My agency's academy. \n\n\"What do you do there?\"\n\n\"I'm a cadet.\"\n\n\"Oh man. This is not going to end well for you. Wait in the car and I'll be back with you in a moment.\"\n\nI wrote him a ticket and sent him on his way. But that's not where this story ends. Cadets are required to report any contact with law enforcement to the academy staff as soon as they reasonably can. If they don't, it's an integrity violation and they can be fired. And even if they do, they will get destroyed by the drill instructors once they return for breaking the laws they're about to be enforcing.\n\nTwo hours later, I called the academy and spoke to the drill instructors. I explained the situation; I stopped Cadet So-and-so, he was called in as a reckless driver, I observed these violations, and he was cited.\n\nThe drill instructor replied, \"Cadet So-and-so? Yeah, he called to tell us about it roughly an hour ago. He'll be getting some extra attention this week. Thanks for the call.\"\n\nHe went on to graduate and made it as a Trooper. It was probably rough for him for a week, but at least he kept his job thanks to his integrity.",
        "created_utc": 1531827059,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Bet you that's the last time he forgets to bring a corkscrew",
        "author": "ilikedonuts42",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8zde9w/suspect_bet_you_thats_the_last_time_he_forgets_to/",
        "text": "I've never had anything to contribute to these tales subs but today I found this one and remembered I actually have something to contribute. This happened a little over two years ago.\n\nI was 19 and had just gotten a fake ID. Most people with fake IDs know that there a few things to avoid when you're using them. Most people with fake IDs don't try to buy shitloads of alcohol all at once and they definitely don't try to do so at the walmart next to campus on a Friday night before a game day. Unfortunately I'm not most people so like the idiot I was I set out that night to buy booze for a pregame (get together and drink before going to a big party) my girlfriend was having at her apartment. \n\nEverything went well picking stuff out and checking out, the clerks at walmart either can't spot fake IDs or just genuinely don't care, and I was on my way out. As I was leaving the building a guy in a hoodie and jeans approached me, pulled out his badge, and asked to see my ID. I did my best to fake it, I really did, but I'm a terrible liar so after I stumbled through my fake address he walked me over to his squad car parked on the side of the building. He asked me one last time to tell him the truth. I was a huge weenie and had never been in trouble with the law before so I caved and admitted it. Luckily for me he decided to show me some sympathy. He wrote me a ticket for possession of a false ID (a civil infraction so just a fine, no court date or record) and let the MIP slide (which would've been a misdemeanor). While he was writing my ticket he bragged to me about how well his \"undercover\" outfit was working, I was the 8th fake ID he'd caught that night.\n\nAfter all the official business was done he decided to teach me a lesson by forcing me to pour out the $100 or so of booze I'd just paid for. This is where we ran into a problem. I was buying for a group of 19-year old girls. My purchase consisted of a small bottle of rum for me and about a dozen assorted bottles of wine. The officer rummaged around in his car for a few minutes looking for a corkscrew. No luck. He and I walked to the back of the store where his superior was waiting in another squad car. He asked for a corkscrew. No luck. We walked back to his car where, clearly determined to teach me this lesson one way or another he took out a pocket knife, sat down on the sidewalk, and went to work on the first bottle.\n\nIf you've ever tried to open a bottle of wine with nothing but a knife you know it's not exactly easy and this guy's technique was severely lacking. It took him about half an hour, sitting there getting progressively more frustrated while he stabbed at one cork after another trying to pull them out. I stood next to him and watched as the fear of being apprehended by a police officer for the first time in my life was gradually replaced by the hilarity of a grown man struggling to open a dozen bottles of $8 wine. I barely managed to keep from laughing in his face when he finally handed me the last bottle and I dumped it out onto the asphalt. I have nothing but respect for our local law enforcement but I was still annoyed that he was so smug about screwing over college freshmen so in a way it felt like justice.",
        "created_utc": 1531765569,
        "upvote_ratio": ""
    },
    {
        "title": "[Deputy] Some people just don't learn. \"Three'fer\"",
        "author": "fromtheleftseat",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8yh0cf/deputy_some_people_just_dont_learn_threefer/",
        "text": "About six months ago I was doing extra DUI patrol and I cited a guy for a small amount of marijuana and set him up with a court date and let hims sign a promise to appear. Great... no big deal, no big charge, guy was super nice and we bonded, or so I thought, over how funny it was that when he threw the joint he was rolling when I pulled him over, it landed perfectly in the backseat with the weed scattered around. \n\n\nEvidently he fails to appear on the court date I set for him. Not great...About four months ago my partner and I go to serve an arrest warrant on him for missing court. My partner and I like warrants to start the week as they have minimal paperwork and start  the momentum. When we hook him up he asks to go inside and get some shoes. Since it was -100 degrees we decided this was a reasonable request. My partner tells him \"since your under arrest, were coming in with you.\" He says \"ok\" without even thinking and walks into his apartment towards the bedroom (bypassing three pairs of shoes) where he has a  load of weed and bongs. How he didn't think that through is beyond me.\n\n We take him in and he eventually gets out with a court date. \n\nToday I get a warrant for him... You guessed it he missed his last court date for the charges from earlier...when he missed his court date. I was joking with my partner that If I could go 3/3 on him, people might start to think that I'm picking on him. \n\nI go to his apt and knock on the door. He asks who it is, and when I tell him \"Sheriff's Office!\", I hear shuffling and glass rattling, and then he comes to the door.\n\n I inform him he has a warrant and that he is under arrest. He then asks \"Can I get my shoes.\" I tell him yes and tell him I would have to go in with him and that to remember what happened last time. He says \"ok\" and walks into his room (bypassing an even larger shoe collection) and low and behold I see a bong on the bedside. I asked him calmly \"Really dude?\" and without even seeing where Im looking he breaks into the worst explanation of how the two bongs with marijuana in them are for flowers and that I was mistaken. Now, my personal view of marijuana and my jobs view of don't exactly see eye to eye, so I use my discretion when I can for a lot of first time offenders, but some people...well they just don't learn.  \n\nI told him next time, \"Maybe just come to the door in a pair of slippers.\"\n\nSorry Im not quite as eloquent as u/2BlueZebras. Thats why he wears a campaign hat. ",
        "created_utc": 1531456905,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Start the New Year off wrong.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8voxse/state_trooper_start_the_new_year_off_wrong/",
        "text": "I was stopped on the side of the road on New Years Day, near a busy intersection, looking for violations. Not long after stopping, I watched an older sedan approach the intersection as the light was turning from green to yellow to red. He hit his brakes, locked them up, and skid halfway into the intersection while the light was red. He stopped, looked around, then proceeded through the intersection and immediately pulled to the right. That made my job easier. It also made me more likely to give a warning.\n\nI pulled in behind him, and he was apologetic and knew he messed up. He was a young guy, still in his teens. While I was talking to him, I saw a black object sticking out from under the passenger seat. It looked an awful lot like the grip to a pistol.\n\nIn hindsight, I didn't go about this as well as I could have. I asked him, \"What is that?\" I should've had him put his hands on the wheel or had him exit the car.\n\nHe asked, \"What is what?\" And leaned to the right to reach for it.\n\n\"Don't reach for it.\" My hand moved to my gun. He kept reaching. \"Don't reach for it!\" I removed the retention from my holster and gripped my gun. He kept reaching. \"DON'T REACH FOR IT!\" I drew my gun from the holster, and he finally stopped and leaned back upright. \"Oh, it's just an airsoft gun. There should be two there. We were playing with them at my dad's.\" \n\n\"Okay. Do me a favor and keep both hands on the wheel. I need to check it out.\" He did so. I determined they were airsoft guns with the orange tip, but all I could see was the grip at the time. I did a sweep of the car and didn't find anything else.\n\n\"It's a warning for the red light today. And for future reference, don't keep guns, or imitation guns, visible in your car. Keep them in the trunk.\"\n\nAnd thus another year went by without me shooting anyone.",
        "created_utc": 1530588227,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] what’s the best day to smoke without getting caught?",
        "author": "jtlee3333",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8v780o/suspect_whats_the_best_day_to_smoke_without/",
        "text": "Back a few years ago, young old teen me decided to celebrate the super edgy middle schoolers first 4/20, I’m sure you all know where this is going, but trust me I was way stupider then you anticipate.\n\nTo set the scene, me and a friend who was just getting into weed decided to smoke on 4/20, it was really shitty because we had to go into her backyard in the middle of the night and she was tweaking every thirty seconds over every little noise, so I thought what better time to smoke, what day would be so out of the park that cops wouldn’t even think to come looking for some smoky teens!\n\n4/21\n\nAt about 12:30 in the afternoon\n\nIn a public park.\n\nWe went and trecked into the forested area of my local park and did the deed, damn near finished half a ziplock baggy of the stuff, when who do I see start to appear from behind the trees and bushes but a police officer. I quickly hid everything underneath my longboard and did my best to act natural, but thank the lord my brain switched on and I thought, don’t be an idiot, you’re caught. \n\nI hand him the rest of what we had, as well as my lighters bowl and pocket knife. They give us the whole what are you doing don’t do drugs stay in school schtick until her dad shows up to get her (my parents we’re out of town and my sister didn’t have a car, I ended up getting a nice ride home from the police) \n\nCome to find out, HER DAD WAS A CAPTAIN IN THE SHERRIFS OFFICE. \n\nIf he felt like it, I would have gone to jail. I was out in public getting high with a SHERRIFS DAUGHTER and because I was honest and didn’t try to get out of it I got a slap on the wrist and sent home\n\nEdit - a word",
        "created_utc": 1530415872,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] High Score",
        "author": "WideBee",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8rxdpd/suspect_high_score/",
        "text": "On my drive home in a 35 mph zone, there's one of those signs that shows you how fast you're going. It's at the bottom of a small hill with some businesses off to the side that are closed because it's late. No one is around, and as I get close to this sign and see the numbers start to pop up I think, *wow, wouldn't it be fun to see how fast I can get this to go?* because I am what one would call ***a giant fucking moron.*** It passes 40, it passes 45, and as I'm passing this sign with all my windows down, I literally yell, '49' with just entirely too much enthusiasm.\n\nIt's not even two seconds later that the cop that I definitely did not see in that dark parking lot pulls out behind me. I am fucking crying I am laughing so hard, trying to compose myself when he comes up to my window. Behind the flashlight I think I can see the faintest hint of a shit-eating grin.\n\n\n**Him:** You know why I pulled you over?\n\n**Me:** I have an idea.\n\n**Him:** And what is that?\n\n**Me:** Probably how fast I was going.\n\n**Him:** Yeah... was that your high score or something? You're making this too easy, I could hear you from over there--\n\n\n\n\nYes I got a ticket. But I also got some amazing parting words:*roll up your windows next time, okay?*\n\n\n\n**tldr:** don't shout that you're going 14 over directly to a cop on accident ya dummy",
        "created_utc": 1529303571,
        "upvote_ratio": ""
    },
    {
        "title": "(Suspect) Honesty Really Is the Best Policy",
        "author": "engelwolfe",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8rlyom/suspect_honesty_really_is_the_best_policy/",
        "text": "Writing this on mobile, and also my first Reddit post ever, so please forgive any formatting issues!\n\nLet me take you back to last Tuesday night. I'm driving home from work, about 11:30PM, when I get the infamous red and blue EDM concert behind me. \n\nCrap. \n\nMy license is also suspended.\n\nDouble crap.\n\nAfter pulling onto a side street, the officer makes contact and informs me my tag light is out. When handing her my registration and proof of insurance, I inform her that my license is suspended and I am aware. Huge gamble as driving suspended unknown is just a ticket, but driving suspended with knowledge can be jail time. \n\nWe go through the usual. Where are you coming from (work), why is your license suspended (failure to complete the correct type of traffic school), why are you driving (didn't have a ride to/from both of my jobs), etc. Its at this point I realize I have left my license in my boyfriend's wallet since we went to an amusement park that weekend.\n\nCue internal Gabriel Iglesias voice, \"I'm gonna go to jail!\"\n\nShe asks for any type of ID with my name and photo, to which I hand her my concealed weapons permit. She radios to dispatch for a license check and then gives me the \"You need to find a ride out of here. I'll be back.\"\n\nAt this point, I'm an odd mix of stressed out, but surprisingly calm. Like I've somehow accepted the inevitability of my immediate arrest, but I'm still not prepared to deal with it. After about 20 minutes of arranging a ride and contemplating my fate, she comes back to my truck.\n\n\"So I've appreciated your honesty, and you don't seem like a bad person. I've cut you a huge break, and I've written you a ticket for driving suspended unknown. It's a non-appearance ticket. Just don't drive until you get it reinstated. Understood?\"\n\nI must have stared at her for an eternity before my brain remembered how to operate its speech portion. \nKeep in mind she had every right to arrest me, tow/impound my truck, and write me three tickets, at the worst. \nLucky isn't a strong enough word to describe the divine interference that happened that night.\n\nI'm typing this story on my phone, as I await my ride, drivers course completion certificate in hand. To that officer, wherever she may be, thank you. Thank you beyond what words could ever say.",
        "created_utc": 1529180213,
        "upvote_ratio": ""
    },
    {
        "title": "[Xpost] Cops share paranormal encounters (theoccultmuseum)",
        "author": "[deleted]",
        "url": "https://old.reddit.com/r/HighStrangeness/comments/8qebmw/cops_share_paranormal_encounters_theoccultmuseum/",
        "text": "[deleted]",
        "created_utc": 1528791510,
        "upvote_ratio": ""
    },
    {
        "title": "[DEPUTY] SWISS cheese cows",
        "author": "allyraegree",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8q2k8u/deputy_swiss_cheese_cows/",
        "text": "I work in a rural county where we have constant animal calls. At least once per shift, I get a call about loose horses or cows. It usually goes pretty smoothly. Once in a while, people surprise me. \n\nThese particular cows are pastured on a fenced lot next to our outdoor gun range. They've gotten out multiple times in the last few days. This was the jist of my conversation with a ranch hand today. \n\nHim: I thought my cows were allowed on the gun range as long as they didnt go any further.\n\nMe: Your cows are kept in a fenced pasture on YOUR land next to the range. You do not own the range. There is a fence between the range and your land. Not only do you have no property rights for the gun range, but IT'S A GUN RANGE. \n\nHim: So my cows can't be on the gun range?\n\nMe: No. Fix your fence and keep them on your property. \n\nWhat I wanted to say: I'm gonna go full auto on your cow and turn it into swiss cheese and THEN maybe you can understand why your cows shouldnt be grazing on a GUN RANGE. \n\nHe still doesn't understand why his cows can't be on the gun range. ",
        "created_utc": 1528653669,
        "upvote_ratio": ""
    },
    {
        "title": "Your cows are gonna be shredded beef.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8pxsky/your_cows_are_gonna_be_shredded_beef/",
        "text": "[deleted]",
        "created_utc": 1528596670,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Party Shenanigans",
        "author": "TheAgnosticChaplain",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8ph1xs/suspect_party_shenanigans/",
        "text": "Several years ago I was a young, and very dumb college student. Most of us tend to be that way, to varying degrees. This particular story is one of the shorter ones that I have from my time in college, and probably one of my favorites to tell.\n\nIt was a warm fall night, right after classes had started. This meant that everyone didn’t want to just stay home and enjoy their evenings like a responsible adult, which I’m of the opinion is almost impossible as a college student but I digress. To take advantage of the new influx of potential friends, partners, and generally people my neighbors and I decided to throw a party. There were 3 houses involved; mine, my neighbor directly behind me, and my neighbor behind me to the left. The one behind me and to the left had a large gravel parking lot that ran behind it in the area where my neighbor beside me would be. They had a large deck on the back of their house, and they had somehow found a local band that wanted to play a live show and were treating the deck as a stage. There were people in all three houses and all three yards.\n\nAfter a while of enjoying the alcohol and music I decided to go back into my house which was fairly empty by this point. I was joined by my best friend at the time, John (obviously not his name). He and I are in my house drinking and entertaining our guests which consisted primarily of women under the legal drinking age. Looking back I wonder what the hell I was thinking, it surely wasn’t with the big head.\n\nI’m chatting with some of these girls, enjoying my beer when I hear the music cut off outside. My self-preservation instincts kicked in at this point. Currently there were only two people in the house that were of legal drinking age, John and myself. I usher all of these people into one of the bedrooms on the main floor and shut the door behind them, telling them to shut the hell up and don’t move.\n\nI had no more than sat down on my couch to continue watching whatever show was on upon turning on the television, when we hear a knock on our door. I asked John to answer the door because out of the two of us, he was the more sober one.\n\nJohn walks over to the door and begins to open it, when it starts to get pushed open. On my front porch there was a police officer who upon seeing the door begin to open pushed it. John being the quick thinking guy that he is puts his foot behind the door firmly planted to the floor.\n\nJohn asked, “Is there something that I can help you with officer?”\n\nThe officer replied, “Is everything alright in here? Are y’all throwing a party?”\n\nNow mind you, we were young and dumb….. So clearly honesty is not the best policy.\n\n“No of course not officer, we’re here just watching…” He glanced at the television, “Uh, desperate housewives….”\n\nThe officer was kind of confused but continued, “Well uh, were you gentleman aware that there was a woman being raped on your front lawn?”\n\nJohn and I were both very shocked at this, and as John was saying “What no offi…”\n\nHe was cut off by another officer that was down the 8 steps from our porch to the driveway saying, “Nooooooope, it was consensual.”\n\nThe officer at our door sighed and then said, “Oooookay, were you aware that there was a woman having consensual….” He glances back down at the other officer who nods, “consensual sexual intercourse on your front lawn.”\n\nBoth John and I are trying not to lose it laughing at this point, but somehow John keeps a perfectly straight face when he replies. “No sir, just us and desperate housewives this evening officer.”\n\nThe officer just shook his head and said, “Alright, well y’all have a good rest of your evening.”\n\nMind you midway through this, I had gotten up from the couch and was standing not far behind John at the bedroom door. These kids had decided that they wanted out. So they were constantly trying to open the door and were starting to make noise. This is clearly what you want to do as a drunk 19 year old, come stumbling out of a bedroom in a house suspected of having a house party…. While the police are having a conversation at the front door 10 feet away.\n\nThe police left, and I stepped outside to have a smoke and calm down a little bit from that dodged bullet when my neighbor walked up. He asked if I knew what happened and I told him my part of the story. He then tells me, “Bro, I got it all on tape.”\n\nThis is the best description that I can give you of this video. He was in his yard directly behind mine shooting a video for the memories. My front yard has a large concrete retaining wall right at the sidewalk that is about 4 feet tall. He is filming facing my house, and you can see the top of a squad car drive by, light bar off just cruising by. You then see from the front of my house, red and blue lights suddenly turn on and light up the night. The car is thrown in reverse and you can see it come back in frame. The entire time, you can see this couple laying in the grass. The guy was on top and just going to town. When the lights came on he stood up real quick like, pulled up his sweat pants and took off running. The woman gets up, wearing nothing but what God gave her and starts to run. Out of the left, from the front of my house, you see a female officer come sprinting into frame and drop her shoulder and tackler her in a way any linebacker would be proud of. Cuffs go on and that is that.\n\nHe and I lose it watching the video, I finish my smoke and walk inside. I just go to my room and go to bed. That was entirely too much commotion for one evening.\n",
        "created_utc": 1528432348,
        "upvote_ratio": ""
    },
    {
        "title": "[PROSECUTOR] Elk or bomb in the courthouse?",
        "author": "thehotshotpilot",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8pdqmi/prosecutor_elk_or_bomb_in_the_courthouse/",
        "text": " I was just sitting in the backrooms of the courthouse chilling with some of the deputies during cases. We just hear this big BOOM, and glass shattering. TBH, i've never heard a bomb go off, but it sounded like what I thought it would sound like from a distance. I wasn't the only one who thought that. Deputies rushed to see what happened, and I followed as a lookieloo as soon as I could get out. Before I could get down there, I heard one gunshot from outside the courthouse. I get down to the room that was demolished. There was blood everywhere (but not pools of it like a Tarantino film) and computers thrown everywhere and a window was out. Everybody is out of the room, but we aren't being evacuated so I kept going. I then go around to the outside and see it wasn't a bomb. It was an elk that decided it should jump through a window. Turns out the blood was elk blood from it getting cut on the window and it destroyed the office before it jumped back out. The gunshot was an officer putting it down.  \nAfter the animal was put down, the trustees got a great job this time. Usually, the trustees get to clean up piles of poo after someone has an accident in the courthouse (it happens more often than you think). This time they actually got fresh air and was outside hosing the animal blood off the building and concrete.",
        "created_utc": 1528403552,
        "upvote_ratio": ""
    },
    {
        "title": "[ride-along]",
        "author": "redbull21369",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8o53ua/ridealong/",
        "text": "I recently went on my first ride along at my local department. A picked a Friday night cus I figured it’d get the best taste of what it’s like this way. I’m at the station waiting for someone to pick me up for awhile \n\nA lady eventually comes and picks me up, didn’t say much, as we were walking out she’s asks my name, she tells me hers and 2 seconds in the car (not exaggerating) we get a domestic call. \n\nIdk if she was just trying to play it extra serious cus of me or what but she booked shit outta there and to the address.  But didn’t say anything so this being my first time for anything like this I’m sitting here freaking out a little wondering what is going on exactly. \n\nSo she stops and tells me to stay in the car and that she’ll try and get her stuff working later so I can listen to everything she says when she’s out there, not sure what it was. Something to do with her body camera recording system. \n\nAnyways. That was the end of our talk, 10 minutes or so pass by and they come out with a dude. Who they proceed to throw into our car. Who’s obviously trashed and balling his eyes out and here I’m thinkin o ok I guess were leaving. \n\nNope they leave me in the car will and bawling mid age drunk man for about 7 minutes lol. Which in its self isn’t a big deal but I’m still here thinkin this is a super serious situation and some crazy shit just went down. \n\nEventually she got back in and we took off. And he starts going on yelling and bitching about his dad who was the other person involved (I’m learning this by him telling us) and then everyone goes quite. She then asks him, well call him chuck. \n\nOfficer: Chuck what day is it?\n\nChuck: Friday\n\nOfficer: ok do you know what time it is?\n\nChuck: hell idk I started drinking at 1 and it’s dark now so I guess it’s pretty late. \n\nOfficer: ok...who’s our president? \n\nChuck:DONALD TRUMP THATS WHO OUR PRESIDENT IS! \n\nOfficer: that right chuck. \n\nWe pull up to a stop light. \n\nChuck: you see that train over there, ITS HUGE!!  Did U hear me i said it’s HUGE!!! And that gas station?? ITS FUCKIN HUGE!!! That’s what our president says right??? I mean look at the moon! It’s FUCKING HUGE!!! \n\nThis basically goes on about everything he sees until we get to the station with me and the officer we’re dying laughing the hole time. \n\nNeedless to say it was the perfect way to start the night, it broke all tension and nerves I had and made the rest of the night quite fun and enjoyable, all with the added bonus of a story I crack up about every time I think about it",
        "created_utc": 1527988033,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Let me be nice to you.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8o3f4b/state_trooper_let_me_be_nice_to_you/",
        "text": "This has happened on more than one occassion, but this is one story of it.\n\nI received a call of a man walking in the middle of the street. It was dark out, he appeared to be intoxicated, and he was yelling at some nearby turkeys (thank you for the detailed call, whoever called this in). He didn't have a flashlight, there were few to no street lights, he was wearing dark clothing, so he was a danger to himself or anyone who may swerve to avoid him.\n\nI found him exactly as described, in the middle of the street. He stopped in the lane to face me as I contacted him. He was swaying from side to side as he stood still, and from his breath, speech, and eyes I could tell he was drunk.\n\n\"Good evening, how are you doing?\"\n\nHe replied, \"I'm fine.\"\n\n\"What's going on tonight?\"\n\nHe paused for about five seconds before replying, \"I'm training for a marathon.\" I hate drunks, especially sarcastic ones.\n\n\"Okay. Do you have an ID on you?\" He provided it, and I had dispatch run a check for warrants, probation, or parole.\n\n\"Listen, if you're just going to arrest me then arrest me.\"\n\n\"I'm actually trying not to, as long as you don't have any warrants. I'll just give you a ride home.\"\n\n\"I don't want your ride!\"\n\n\"What if you promise not to walk in the street?\"\n\n\"No!\"\n\n\"Okay, so here are the options. I can give you a ride home, or you can go to jail.\"\n\n\"I guess I'm going to jail!\" Dispatch returned that he was on probation and was not allowed to have any alcohol.\n\nHe went to jail.",
        "created_utc": 1527971878,
        "upvote_ratio": ""
    },
    {
        "title": "[Officer] Bad Day",
        "author": "enforcer219",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8nx00e/officer_bad_day/",
        "text": "First time posting and also on mobile so bear with me! \n\nSo today started with the city hiring a less than desirable Chief to take the place of the recently retired Chief. Long story short, the new Chief is from a department that does sloppy and questionable work. Morale was down and everybody was in a terrible mood. Skip forward to lunch time, my partner and I stop in at a restaurant and I see a father there with his two kids. I noticed he only ordered chips and salsa for himself and the kids had burgers and what not. This is usually the opposite of what I say in the area, typically parents only care for themselves here. Anyways, I notice this single father caring for his children, on of which has a disability. At this point I go up discreetly to the cashier and pay for their meal and have a plate sent out for the father. He asks for his bill and they let him know that it was taken care of, he proceeds to come up to me tear in his eyes and shakes my hand with endless “thank you”. I then gave the kids some stickers that we carry and they give me hugs and say thanks. That’s when the reminder of why i do what i do hits me and I’m thankful for what I do and love to make peoples days just that much better. Stay safe out there brothers and sisters! ",
        "created_utc": 1527900716,
        "upvote_ratio": ""
    },
    {
        "title": "[PROSECUTOR] Don't apply for gun permit with warrants outstanding",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8nu9x8/prosecutor_dont_apply_for_gun_permit_with/",
        "text": "[deleted]",
        "created_utc": 1527877882,
        "upvote_ratio": ""
    },
    {
        "title": "[PROSECUTOR] Police takedown by door",
        "author": "thehotshotpilot",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8nu6w5/prosecutor_police_takedown_by_door/",
        "text": "I'm in court doing routine felony pleas, with some people getting sentenced to prison. Generally not that long, split sentences of a few months with 5 years probation, but there are some long sentences. Sentencing is very structured and the public defenders are generally competent in the county so defendants know what is generally going to happen within a couple months of confinement margin of error, even without a plea deal.  \nOne defendant was ancy and you could see he was ready to flee. He gets sentenced to a couple of months with felony probation following and he bolts. The bailiff radios and runs after him. He could possibly get out of the courtroom but not out of the building, so no need for a taser. I then see the bailiff hesitate and slow down. I then see why. There are two doors that open to the courtroom. One is almost always locked and people use the second beside it. This guy is full sprint at the locked door. He hits the door and gets KNOCKED OUT. No taser or takedown needed. Just a locked door. ",
        "created_utc": 1527877240,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Different approaches.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8m5ud3/state_trooper_different_approaches/",
        "text": "When I was on training, one of my instructors told me he was more lenient to elderly driver's who committed traffic violations. He figured they had been through enough in their lives and didn't need a ticket, and they were often on fixed incomes and couldn't afford it.\n\nOn the flip side, I had a supervisor who said we needed to build a case. When the elderly driver accidentally mistakes the brake for the gas and plows into a store, there's usually warnings signs. Yet they often have a clean record because they're given warnings they don't deserve.\n\nI was stopped at a stop light to go straight when I spotted an elderly driver on his cell phone. I pulled him over.\n\nThe driver spoke first. \"Good afternoon, sir. I'm sure you stopped me because I was on my cell phone.\"\n\n\"That's correct. I'll need to see your driver's license, registration, and insurance.\"\n\nAs he was retrieving his information, he was still talking to me. \"So the reason I was on my phone was to call my wife and let her know that I was leaving the store, on my way home, and I would be there in a few minutes.\"\n\n\"Okay.\" I didn't care. Unless you're on the phone with 911 or using a hands-free device, you can't use your phone and drive.\n\n\"You know, I probably haven't been stopped in about 20 years.\"\n\n\"Well that's good, sir.\" Another thing I didn't care about. The only thing relevant was the violation I just observed. People always like to tell me they haven't been pulled over in *X* amount of years. That doesn't mean you're a safe driver, it just means you're good at not getting pulled over. I used to be like that.\n\nI returned with a ticket and he wasn't too happy. He explained, \"You know I really didn't break the law since I was just on the phone for a minute. I didn't even talk to anyone since I only left a voicemail, and I was about to hang up anyway.\" He just explained all the elements of how he did indeed break the law. And since he couldn't see how he was still wrong, he earned his ticket.\n\nMy instructor went the way of leniency for the elderly, but I don't think that works with driving.",
        "created_utc": 1527288717,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Thanks for making a shitty night better instead of worse.",
        "author": "Coming2amiddle",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8lpkw8/suspect_thanks_for_making_a_shitty_night_better/",
        "text": "I got violently ill with food poisoning last night and ended up driving myself to the ER a little before midnight.  The only car readily available to me has expired tags and needs a headlight replaced,  and I have not been driving it,  but I thought I could get to the hospital and back and be OK.   \n\nTLDR that was a bad call but all blessings be upon the officer who ignored it all and just let me go home.  Life has been pretty shitty for a little while now and I appreciate that he just *helped* and gave me the benefit of the doubt. \n\nAt the hospital I got some tests and IV meds and a few hours later I was on my way home.   About a mile from the hospital and 3 from home, my car died.  That's when I remembered that the gas gauge was broken - I haven't been driving it,  and I was pretty sick - and though it says I have gas that might just be the problem.  I coasted over to a *very* narrow shoulder and put my hazards on.   It was 3am.  It was over a mile to the closest gas station and I was too sick to walk it.   I have roadside assistance (and insurance and a valid license,  fwiw)  and called them.  90 mins later the guy still hasn't shown up, but a state trooper has, and he's been sat behind me for what seems like a looong time.   But I haven't been pulled over in 20 years so I'm not sure. \n\nHe came up and asked what the problem was.   I told him it died and might just need gas, but roadside assistance was on the way.   Road guy had finally called me and they'd sent him to the same intersection on the other side of town.  It would be another 30 mins or so.  \n\nThe officer told me to turn off my hazards to save the battery and sat behind me with his lights on,  his SUV protruding into the lane to force people to give me room.   He stayed until help arrived, held a flashlight on the paperwork for us,  and then made sure I knew where the closest gas station was before directing me back out.  I got home at 5am.\n\nI don't know how many times I thanked him. \n\nThe tags expired on my husband's birthday.   The car is in his name.   He died unexpectedly a few months ago.   I haven't been able to deal with it,  and I can't afford to keep the car anyway,  so it is just waiting to be picked up.  (I am giving it back to the loan holder.)  I have been able to just not drive because my severely disabled 18yo has home health care workers coming in and out of the house all day and they're all willing to drive us around and run my errands for me and whatever we need.  But I don't have staff at night.  Even with the help I get I am not able to work due to his needs,  and we are living on my husband's death benefits now.  \n\nSo yeah,  I'm struggling.  I'm sure the officer knows exactly all the trouble I might have caused myself,  but he doesn't know the rest of my personal life.  He probably saw the hospital bracelet on my left wrist,  and I have an autism license plate,  and a big yellow caution style bumper sticker.   It says a teen with special needs may be on board and gives some basic info.  So he did have some pieces of the picture, but still. \n\nIt can be monumentally hard to just get through a day, there is *always one more thing,* and I just so very much appreciate not having to do all of those one more things.  \n\nSorry this got long and rambly.   Thanks for listening. :)  Stay safe out there! ",
        "created_utc": 1527132457,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Getting Lucky",
        "author": "TexasHooker",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8l1gvo/suspect_getting_lucky/",
        "text": "This one happened about a month and a half ago on the first weekend of April, I was headed out to the lake for a weekend fishing, So there I was just cruising along the hilly and winding highway going within about 5 mph of the speed limit, when I see a state trooper coming the opposite way and as soon as he passes me he flips on the lights and turns around, I immediately know I'm getting pulled over since I didn't have my front plate on the truck at the time.  I put my blinker on, slow down and follow the curve to a safe driveway to pull into (out in the country, no shoulder blind curves, not the safest area to stop on the side of the road). Trooper walks up and goes straight into it,\n\nTrooper: I pulled you over for not having a front plate. That's illegal here in Texas, where is yours. \n\nMe: (thinking, oh boy he seems upset, no hi I'm so and so or anything) It's in the bed of the truck on my old bumper completely mangled since I was in an accident a few weeks ago my new one should be in the mail along with the bracket to hold it on.\n\nTrooper: Oh well, hold on a sec\n\nHe walks around the truck looking everything over, checks the bed and sees my bumper/plate,  even checks my exhaust, I drive an older diesel so it only has to pass a safety inspection and a muffler is required although most people run a straight pipe only. I do have a muffler. \n\nTrooper: OK well I'm giving you a warning for the plate since I can see your being truthful, but I'm going to check your window tint (fuck I know it's illegal, too dark) and then we'll get going from there. \n\nHe walks back to his car to get his tint reader and at this point I realize he hasn't noticed my registration is expired by 6 days, since I didn't have plate or bumper I couldn't get it inspected and that he hasn't asked for my license or insurance yet and that I'm currently carrying, legally with a chl, but that might worry him since I haven't informed him yet. \n\nTrooper comes back checks tint, yep it's too dark. \"I'm going to write you a ticket for the tint, it's a fix it ticket if you get it removed and show the court its a $25 court charge only and warning for the front plate. Let me get your license and insurance and I'll get you on your way.\n\nMe: \"Ok I understand thanks officer\" I hand him my license and insurance and decide to not inform him of the chl (not legally required here in my state) since he already decided what he's going to write.   \n\nHe goes back to the car and is there for a while, at least 10 min, which I'm am now getting concerned, wtf is taking so long, what did he find? My registration, an old ticket that's a warrant? highly unlikely but every thought crosses your mind. after about 15 min of waiting he walks back and I just want to get back on the road, I'd be willing to take almost any ticket at this point..\n\nTrooper: Texas Hooker (in that tone that sounds like you fucked up)\n\nMe: yes?\n\nTrooper: Well it looks like it's your lucky day.\n\nMe: what do you mean?\n\nTrooper: Well it looks like my computer can't get a signal so I can't access anything. I called in your info and it's good, but I can't write you a ticket. So consider this a verbal warning, get your truck fixed up and don't let me catch you again with it not. \n\nMe:(internally cheering) ok great, I appreciate it, Stay safe and have a good one.\n\nTrooper: Thanks, you too.\n\nWas a decent stop, even with him seeming mad at the beginning but it all worked out and I got my truck all fixed up. And I'm pretty sure it all payed off this past weekend. I was making the same route to go fishing again and a trooper passed me going the opposite way, flipped around pulled up by me, looked over, waved then drove off. I'm 99% sure it was the same Trooper. \n",
        "created_utc": 1526914981,
        "upvote_ratio": ""
    },
    {
        "title": "[Ride-Along] I think I know that guy.",
        "author": "Gilgamore",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8ky9hq/ridealong_i_think_i_know_that_guy/",
        "text": "This happened on a ride along I went on with a state agency trooper a few months back.\n\nWe were on a major highway through a rural part of the state. The trooper I was with was running radar and showing some proactive strategies they employ in the area to stay busy. \n\nWe stop at the bottom of a curved hill. We sat talking for about 3 minutes and stop a car. He showed me how the tickets worked and I asked questions as he printed off the ticket. We did this stop two more times, and the last one stood out to me a lot. \n\nA few years back, I had lived in Texas for a couple of years and made some good friends. Afterward the few years, I moved back to the state where I would finish college. I've lived here a few years and did a ride along to see how I liked the agency.\n\nWell the last car we pulled over from the hill was going over 95. We hit the lights, and the car pulls over. As the trooper brings back the license and registration and begins running it, the name looked familiar from my time in Texas. I said \"Wait, is that Rodrigo _____? Can I see the License? I think I know him.\" I grabbed the ID and sure enough, I knew him! \n\nYou can't imagine how surprised he was when I came and walked up after the trooper gave the ID back. He was a mix of amused and embarrassed when I shot the shit with him for a few minutes before they took off, a little poorer and a lot slower than before. ",
        "created_utc": 1526877544,
        "upvote_ratio": ""
    },
    {
        "title": "[Trooper] Stopped someone for 121 in a 70, ended up finding and citing them for a plethora of violations...",
        "author": "WashingtonLaw",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8k1kw4/trooper_stopped_someone_for_121_in_a_70_ended_up/",
        "text": "(First post!)\n\nIt was about three quarters through my shift on an unusually quiet evening. We only had a few minor in severity MVAs and a broken down motorist called over the radio since the start of my shift, so everyone including me was pretty much just running traffic the entire time.\n\nI felt particularly hungry, so I pulled off at an exit and got me some Jack in the Box. After I received my order, I headed back onto the freeway, and a few minutes later, I pulled onto the central median and stopped in a spot where I usually run radar and nab people for violating the state's keep right except to pass law.\n\nFor the first five minutes or so, nothing much happened. The most I got was 6 over the posted limit of 70, which I obviously didn't bother going after. Everyone was in the correct lane aswell, which is very strange given no one in this state usually gives a shit about that law. However, after that, the most I was getting was 3 over.\n\nI glanced down on my phone, and opened the Waze app. And, sure enough, I was reported within minutes of stopping on the median. Figures, people in this state use that app religiously for whatever reason.\n\nOh well, atleast my presence should slow people down. There was a bend a bit ahead that's notorious for excessive speed-related MVAs. I decided I would use this time to eat my food, and started working on my burger and fries.\n\nHalfway through my burger, the hum that emits from my radar unit became a lot louder. I look at the 'target' reading on my radar unit.\n\n81 MPH. 93. 112. Then all of a sudden, 123, and I see a car hauling ass past me in the far left lane, passing motorists in the other lanes. I managed to lock him in at 121, dropped my burger, flicked on the lights and siren, did a quick check to the right for traffic, and there was none at that particular second, so I pulled into traffic, and pressed the gas pedal as far as it would go.\n\nI was running full code 3 and getting people out of my way, but there was no chance in hell my explorer could catch up with what later turned out to be a McLaren 720. I was going absolutely full out, probably just north of 100, attempting to catch up to his disappearing headlights.\n\nI decided to radio in.\n\n\"131 to central.\"\n\n\"131, go\"\n\n\"EB 90, MM 21, attempting to catch up to a McLaren, unknown color, want is for speeds in excess of 120 MPH, do we have anyone further down who can aid in intercepting the vehicle?\"\n\nDispatch: \"131, standby.\"\n\nIt turns out by pure chance another trooper was running radar 5 or so miles past me at that point.\n\n\"119, central.\"\n\n\"119, go\"\n\n\"I'm up near marker 27, I'll keep a look out for the vehicle and attempt to slow it down with my lights.\"\n\n\"119 10-4, 131, did you copy?\"\n\n\"131, clear\"\n\nAt that point I continue going full out for a few miles attempting to catch up.\n\nAbout 1/2 a mile from the other trooper, all of a sudden I see the trademark McLaren taillights in the furthest right lane (I was in the far left lane). I ease off the gas, as it appears the McLaren slowed down, and I actually appear to be catching up.\n\nJust as we approach the other trooper parked ahead on the shoulder with his lights running, I pull behind the McLaren, switch off my siren, and chirp it several times. He indicates right, and just as we pass the other trooper, pulls onto the shoulder and stops. The other trooper pulls in behind us.\n\n\"131 traffic\"\n\n\"131, go\"\n\n\"We got the vehicle stopped, orange in color McLaren, &lt;out of state tag&gt;, about mile marker 27, occupied 1 time (s.i.c, turned out there were two in the vehicle, it was hard to see inside), 119 is with me.\"\n\n\"131, 10-4\".\n\nI walk up to the passenger window, the passenger opens the sliding door.\n\n\"Good evening, reason for the stop is your speed. Any reason why I got you locked in at 121 in a posted 70 this evening sir?\"\n\n\"No sir, I'm sorry, I let the speed get away from me, I'm showing off the capabilities of my vehicle to my friend here.\"\n\nI wasn't having any of it. With an extremely pissed off tone, I respond.\n\n\"That's not a valid reason to be doing upwards of 50 miles per hour over the limit. You very easily could have killed yourself and your friend here if you lost control at that speed. Or even worse, killed someone else by plowing into them. You do know I can take you to jail right now for reckless endangerment, right?\"\n\n\"I'm so sorry officer, that wont be necessary, please I wont ever do it again!\"\n\n\"Switch off your vehicle and hand me the keys. Also, Give me your license, the vehicle's registration and proof of insurance. Now.\"\n\nAfter I got back to my car, I ran his plate and found his registration out of his state is expired, and his insurance was expired aswell. He's the R/O, however. The other trooper also pointed out that he had fake stickers on his plate, something that could warrant an arrest at our discretion. However, his driving and arrest record was squeaky clean.\n\nAs I returned to him, I saw that I brought the poor young kid to tears, and I felt a tad bit bad for him. So I decided not to take him in, but I nevertheless threw the book at him and got his car impounded.\n\nThings I cited him for:\n\n-Criminal speed (cited him for the full 121 in 70)\n\n-Reckless Endangerment (Justification was he was swerving in and out of his lane at the high speed he was doing to get around slower drivers)\n\n-Expired Registration\n\n-Expired insurance\n\n-Fixit (correctable) ticket for failure to display the correct state-issued stickers on license plate (cut him a break)\n\n-Fixit (correctable) ticket for failure to carry proof of insurance (he did not have an insurance card on him)\n\nShould he rectify the latter two offenses before the court date, I'm sure the judge will throw the charges out. That's the least of his worries, however. I sincerely hope the judge throws the book at him, as he needs to learn a tough but valuable lesson. \n\nHis car was towed by the other trooper after taking an inventory, and I gave the two gentlemen a lift to the next exit.",
        "created_utc": 1526532920,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] The barbed wire.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8jk6vy/state_trooper_the_barbed_wire/",
        "text": "Academy tale.\n\nThe academy I went to, like most state academies, is basically boot camp. You live in dorms and get yelled at a lot. The campus is surrounded by a fence with barbed wire on it. We were told, \"The barbed wire isn't to keep criminals out; it's to keep cadets in. One cadet jumped the fence in the middle of the night to get out and never came back. We sent Troopers to his last known residence and found him there, having quit in the middle of the night.\"\n\nBy the middle of day 1, one cadet had quit. By breakfast on day two, one of my roommates had quit. Roughly 10% of people had quit by the end of the first week. And to get to that point, they had probably spent 18 months in the hiring process. \n\nAnd then you had people like my other roommates. Near the end of the Academy we had to pass the state required fitness test. One of my roommates had been running with a limp for a few weeks. He started wearing a brace and taking a bunch of ibuprofen, but it was obvious he was in a lot of pain. The fitness test came along, and he passed, limping his was through it all. A week later he got an Xray and realized he had been running for weeks on a fractured shin.\n\nMy other roommate was injured during boxing training a little later. We were maybe 90% of the way through the Academy, and he was one of the older recruits. During boxing, there was a loud POP as he winced and groaned. He said, \"I'm fine, keep going.\" The instructor stopped it. He went to the hospital, got an Xray, and they found out he had fractured his spine from how hard he was punched. I had to help him put his boots on up until graduation.\n\nThe academy is known for being tough. People complain that it's outdated and pointless. But when it's a life or death situation, I don't want a quitter as my backup. I want one of the people who made it through hell with me and said, \"I'm fine, keep going.\"",
        "created_utc": 1526375834,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Is firing 14 shots at a suspect overkill?",
        "author": "most-bigly",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8i9iha/question_is_firing_14_shots_at_a_suspect_overkill/",
        "text": "[removed]",
        "created_utc": 1525900254,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Head over heels",
        "author": "Ralph-Hinkley",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8i94e9/suspect_head_over_heels/",
        "text": "I grew up in a large trailer park which was the largest in the county (~500 homes) and we all had our little cliques. Mine liked to smoke weed and cause mischief like most teens.\n\nAnyhow, there was an overpass near the front that we would go sit under to smoke weed and cigs, and maybe drink a couple beers we weasled from the drive-thru across the way.\n\nSo we were walking there one night, and there were road signs with the flashing lights on them on the way to smoke from a toilet paper roll. There were about eight of us, so obviously we didn't think we'd draw attention to ourselves at night as we picked one up to carry it to the hang out.\n\nBad mistake. Apparently we walked it past a few houses and one of them might have called the cops. We got there with the sign with the lights, inconspicuous, right? No. We packed up the home made bowl and began to pass it around.. when it came to me, I saw some lights coming towards us so I looked up.\n\n\"COPS!\" I threw the bowl, and we all took off running.. down a large hill. Complete mayhem. People are screaming, dogs are barking, kids and flashlights everywhere. We all ran down that dark wooded hill like lightning. I lost my footing and fell about eight feet into a creek, struggled to get up and kept running. Tumbled head over heels for a good twenty feet through leaves and sticks and whatever else there was and finally came to a stop where I was on my back mostly covered with leaves.\n\nThe cops conducted their search and collected about five of my friends. At one time, I was about ten feet from the cop and his dog, so I have no idea how I wasn't found. I'm leaving it to the creek and the leaves. \n\nI stayed there until I fell asleep and woke with the sun. There were a couple others that got away, but they just kept running.\n\nI didn't need that shit when I was sixteen.",
        "created_utc": 1525897174,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Laughter can't be detained",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8i4nwd/suspect_laughter_cant_be_detained/",
        "text": "[deleted]",
        "created_utc": 1525858523,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Robotic policing.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8ha6o3/state_trooper_robotic_policing/",
        "text": "I was on patrol on a rural county road, stopped near a stop light looking for whatever violation came across my way. I saw an old Buick roll up to the light, and it looked like the registration was expired. I checked the license plate using my computer, and it came back expired. As I did this, the passenger opened his door, and poured out some soda on the ground. That's not illegal, it's just annoying. As he did that, I saw the passenger seatbelt was also broken; another violation. I pulled him over. The car was occupied by two older gentlemen, both over 60.\n\n\"Good afternoon, I stopped you because your registration appears to be expired, and it looks like that seatbelt is broken.\"\n\n\"Oh okay. It's not my car, it's his car.\" He pointed to the passenger. \"But I want to let you know up front that my driver's license is suspended.\"\n\n\"Okay. I appreciate that. So why are you driving?\"\n\n\"His license is suspended, too. We're coming back from the hospital and he just got diagnosed with cancer. I was trying to get him to and from his appointment. We have all the paperwork from the hospital.\"\n\n\"I'd like to see that.\" He handed it to me. The path he was taking was from the hospital to his house, but people lie. The paperwork didn't. It had a lot of fancy medical jargon on it, but the date and times matched up.\n\nI addressed the passenger. \"What's up with the registration and the seatbelt?\"\n\n\"I'm waiting on my next social security check. I can't really afford it.\"\n\n\"Okay. Hand me the keys.\" The driver did. \"Wait in the car, I'll be right back with you.\"\n\nI checked them both through dispatch. They were both suspended, no prior crashes, no warrants. They were suspended because they got a ticket and failed to go to court for it. I imagine it's because they couldn't afford to pay it, so they ignored it. This is incredibly common with low income drivers.\n\nI walked back up to the car and handed the keys back. \"If I see you driving this car again and you're still suspended, I'm taking the car and you're both going to jail. Take a bus next time.\" What I told him I could do is what the law says I should do. The passenger could go to jail for allowing a driver with a suspended license to use his vehicle.\n\nThe driver said, \"You'll never see me drive it again.\" And I never did.",
        "created_utc": 1525552207,
        "upvote_ratio": ""
    },
    {
        "title": "[Corrections] The Suicide Attempt",
        "author": "Muff_Huffer",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8gp83n/corrections_the_suicide_attempt/",
        "text": "“We just have to make do with what we got, folks.” Big Howard’s voice filled the ready room, but there was a resigned note of defeat in it. We were, as usual, down a few bodies, and as luck would have it, there were several inmates admitted to area hospitals requiring security, thus depleting our ranks even further. “There’s two at St. Joseph’s, Inmates Brown and Rescara – they’re both old guys and laid back so we can get away with one deputy for both just for tonight. Day shift says they’re both pretty out of it still from surgery so that’s a help. Inmate Darcy is still in critical care at University – whoever gets that, drop the deputy off at St. Joe’s, because we’re gonna be limited on vehicles.”\n\nA general murmuring ran through the ready room, questioning the nature of the lack of wheels. “That’s because we got one all the way out in Plumbersville at River Medical Center.” The murmuring grew, and Big Howard sighed. “I know, it’s BS. Apparently Inmate…Washington, needed some kind of specialized treatment while they were at the jail out there for court, and River Regional Detention couldn’t sit on them anymore due to some policy. Plumbersville PD did us a favor and took over security for a day, but now it’s up to us for some reason. Walker, that’s you tonight. Get a set of keys and get a move on, with traffic you’re at least an hour away. Car 227.” Walker nodded silently and trudged out the door, gloomily resigning himself to the 40-mile trip to the hospital.\n\nBig Howard sighed again. “That leaves us pretty short tonight. What you see is what we got, right now no one is coming it to work OT. Just…make do, I guess. Howard?” Big Howard nodded to Little Howard, the other sergeant working that night, and his cousin. Little Howard shook his head. “I got nothing. Anyone that needs help, pitch in if you can. I know it’s gonna be tough, though, cuz we’re pretty tight. Assignments are as follows-“\n\nAssignments given, the shift began their journeys throughout the jail to relieve the beleaguered day shift. The night began smoothly enough for me, and I settled in to my usual position in Intake, albeit without my usual sidekick at the time, Country Mike. I watched as the usual parade of drunks, unlicensed drivers and dime-bag holders passed through the doors. Nothing out of the ordinary was going on that night beyond the usual swearing, wailing and gnashing of teeth. I was able to steal glances of that night’s national game, and set a side bet with one of the Intake supervisors – lunch, Luke told me, said that the Raiders would win by a touchdown. I poo-poohed his notion and took the bet, the points, the Rams in the process.\n\nAfter a few unremarkable bookings (with just a little excitement provided by a drunken lawyer who foolishly tried to get his arresting officer’s phone number and ask her out), Luke and I sat discussing the finer points of [Sam Bradford’s ridiculous throwing face](http://media.philly.com/images/092115_sam-bradford_600.jpg). We were only on our fourth or fifth consecutive Google image result, laughing hysterically, when my crappy agency-issue radio crackled to life.\n\n“…**KRRCT** need assist-**CRRST …** **KRRT**-unit!”\n\nWe both stopped and looked at each other. I reached down and slapped the front of the radio, hoping a little percussive maintenance might seat the weak battery better for a more clear transmission. Next came Control, clear as day.\n\n“All units, deputy needs assistance, suicide unit. All available deputies respond.”\n\nLuke and I looked at each other again. “Well, go on, man, nothing keeping you here right now. They need bodies! I got it.” Luke began to shoo me away with his hands as his eyes swept the area, seeing nothing pressing. I jumped out of my chair and bolted for the door, still carrying a set of keys for my area and leaving a spinning office chair behind me. I hit the first two security doors at a good clip, timing my application of my prox card to unlock the door in a way that slowed my momentum as little as possible. I hit the third door as the radio kicked in again.\n\n“Control to all areas, deputy needs immediate assistance. Supervisor respond with a cut-down knife.” I swore and my brisk jog became a full-on sprint. If control was calling for a cut-down knife, that only meant one thing – an inmate was hanging and current efforts weren’t enough. I hit the final two doors like a truck and burst into the suicide unit, where a handful of deputies were gathered around one of the suicide cells, struggling mightily with something at the door.\n\nA piece of orange fabric was slammed shut in the door’s tray slot, protruding on both sides. Deputies were furiously tugging at the two ends, trying to free it from between the metal flap and the rest of the door so that it would retreat back into the suicide cell. On the other side, the nude inmate had his back to the door, his rear suspended a few inches from the floor by the piece of orange uniform around his neck. His hands flailed wildly as he searched for purchase to push himself down into the makeshift noose and speed his exit from this earth. His legs began to propel himself up and down in a bouncing fashion, probably hoping to collapse his windpipe against the fabric loop he had created.\n\nThe door to the unit flew open and Big and Little Howards ran inside. Little Howard elbowed through the pack, armed with his cut-down knife, and began feverishly hacking at the material on the outside of the door. The inmate began to shake his now-purple head and redoubled his efforts to smash his own throat against what I presumed to be the remains of his pants. Little Howard’s hooked knife was dull and seemed to only tug at the fabric, not making any progress towards freeing the stricken inmate. “Who’s got something else?” shouted Big Howard. Someone quickly came up with a regular old straight folding knife (how that was in the facility, don’t ask, because I sure as hell don’t know or want to know), and Big Howard sawed through the material. The inmate dropped to the floor with a resounding *smack* and Big Howard discarded the strip of fabric and the knife.\n\nAs quick as a flash, the inmate was back on his feet. He coughed a few times, and immediately darted back toward the door. The nature of cutting the fabric meant that he was still left with half of his clothing article on his side of the door, and he quickly grabbed what was left, wrapped it around his neck, and began to pull at both ends. Cries went up from the deputies gathered to stop this action, and a few more made the obvious remark that we needed to retrieve whatever was left of his uniform. The deputy assigned to the unit produced the keys quickly, and rammed one into the cell’s lock.\n\nHearing the key inserted, the inmate changed tactics. He ran to the door, dragging his mattress with him, and applied the mattress and his body to the door. “You can’t come in here! You can’t touch me! I’m a god,” he screamed. “It’s impossible to touch me! Don’t touch me! Don’t come in!” The door lock popped open, and I found myself closest to the door along with the Howards. Big Howard relayed the plan quickly as the door swung open – “Bumrushhimgetthepantsherewego.” It all came out in one big word as we all rushed forward, bracing one arm each against the mattress as the others reached around to grab a limb. Collectively we drove the inmate back to the wall, grasping for a wrist, before ripping the mattress away. The inmate darted to the side, and we all fell on top of him, taking the whole pile to the ground. Big Howard and I both grabbed an arm as Little Howard snatched the pants away.\n\nSensing defeat, the inmate changed his tune. “Hey, y’all just kill me. Please. Please kill me. Choke me or shoot me or something. Please just kill me.” Little Howard quickly retreated out of the cell, pants in hand. I was next to go, relinquishing my wrist to Big Howard’s control. Big Howard leaned in next to the inmate’s ear. “Stay on the floor. Don’t move.” Big Howard released the man’s arms and quickly backed out, and I slammed the door shut. The inmate remained where he was, sobbing and gently beating his face against the floor. Big Howard examined the remains of the pants before passing them around for group inspection. A few congratulatory fist bumps were exchanged, and deputies began to trickle out of the unit and return to their duties. I breathed a huge sigh of relief and got the nod to go back to Intake, where Luke was waiting for me.\n\n“Well? All good?” Luke asked. I shook my head in response.\n\n“I got good news and bad news, man.”\n\n“What’s up?” he responded.\n\n“Good news is the guy’s alive and breathing again. The bad news…” I pointed over Luke’s shoulder at the TV, where the Rams were celebrating a come-from-behind victory that I’d missed. “The bad news is you owe me lunch.”\n\n",
        "created_utc": 1525341624,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Why should I be in class, officer?",
        "author": "13jlin",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8fq0zy/suspect_why_should_i_be_in_class_officer/",
        "text": "This is going to be a short one, which might not fit here with an obligatory \"this happened a few years ago.\" All dialogue is approximated to the best of my recollection. \n\nYears ago, one day in the early fall and late morning, before freshman year of college, I was at a filling station getting gas, as you do when your tank is running low. A marked crown vic pulls in at the pump behind me; not strange at all, I'm just going to drive more sedately until I'm out of sight. The officer however, doesn't pump, and instead walks over to me. The following conversation occurs; Cop will me Cop, I will me Me.\n\nCop: shouldn't you be in class?\n\nMe: Sorry?\n\nCop (louder): You're supposed to be in class, aren't you?!\n\nMe (taken aback): What? No I'm not?\n\nCop: Don't you take that attitude with me, young man you're supposed to be in class; I ran your plate, you're 17! License!\n\nMe:For 3 more weeks, yea? \n\nI'm calling your parents and principal and reporting you for truancy! Stay right there! \n(It's useful to note that I live in a state where education is compulsory through 18 unless you graduated HS younger (which, tbf, I did) and where the school year started in late august)\n\nMe (realising that he thinks I'm a high school student): Oh. Officer, I'm not in high school. I go to [big flagship public university, with a post Labor Day move in]\n\nCop (getting into my face now): I don't care or believe you.\n\nMe: seriously! (Points at freshly applied university parking permit on the windshield)\n\nCop: stalks around car; looks at it, grunts. Nope. Could be your brothers. Student ID or you're going to class. \n\nMe: uhm, here? (luckily, I had it from summer orientation- big school, after all)\n\nCop: looks between it, my license and my face, grunts again. Hands back cards, Closes his cell phone and and walks back to his cruiser and drives off without a word.\n\nThese days, not 18 year old me would probably have put in a complaint, but hey. Also, now I would have enjoyed walking into my principals office, and saying sorry... i missed this place so much that this officer thinks I need more time here. Ah well. C'est la vie!",
        "created_utc": 1524988551,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] The time I was pulled over by a ninja!",
        "author": "SamusOfHouseAran",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8fd7oz/suspect_the_time_i_was_pulled_over_by_a_ninja/",
        "text": "Hi folks. I’ll try to keep this short and sweet.\n\nA couple of weeks ago I was driving home after picking my kids up from grandma’s house. No big deal. I live in Texas, so we’ve got access roads alongside most of the highways. I was in queue to merge onto the access road, started the turn, and heard a “whoop whoop” behind me. Stealthed cop pulled out behind me, lights blazing. \n\nSo I pulled over. I’m a bit worried because I’m carrying, and I’ve got my kids. Got my licenses out, registration, all that. Kept hands in view. You know, being smart about it. Cop comes up, glances at my carry license and hands it back with no further comment. Says my registration is expired. I’m a deer in the headlights. I’d completely forgotten it. So I apologized, he stepped away. Came back with a warning. \n\nI got lucky, no lie there. And I appreciated it, too. I deserved a ticket, as I was three months overdue. That interaction was a lot smoother than I expected. Thought y’all might like to hear it. \n\nHave a great day, folks.",
        "created_utc": 1524848311,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Window tint.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8f7lf2/state_trooper_window_tint/",
        "text": "Window tint is prohibited or restricted in pretty much every state, even the desert ones. I stop people for it primarily because it interferes with my cell phone enforcement; I can't tell if the driver is using their phone if I can't see the driver.\n\nI was in heavy traffic, looking for cell phone violations when I saw a pickup truck with blacked out front windows. It was a little strange because there was a company name on the truck, so it was obviously a work vehicle. Work vehicles tend to be stock, or only modified for legal work purposes. The tint was illegal and had no work purpose, so I pulled it over.\n\nI contacted the driver, \"Good afternoon, the reason I stopped you is because -\"\n\n\"Is it because of my window tint?!\" He was oddly excited.\n\n\"Yes it is.\"\n\n\"And are you going to give me a ticket?!\"\n\n\"Uh...that's the plan.\"\n\n\"Awesome!\" He was genuinely enthusiastic.\n\n\"I'm sorry, I don't understand why you're excited about a ticket.\"\n\n\"I don't like the tint. It's hard to see out of. I told my boss that I wanted it taken off the truck, but he said it was his truck, he could do what he wanted with it, and I had to leave it on. Now that I'm getting a ticket it has to be taken off! Sometimes I even drive by Troopers real slow hoping to get pulled over for it.\"\n\n\"Oh. Well, since it's not your truck, you're not getting the ticket. The owner will get the ticket in the mail in a few days.\"\n\n\"Even better!\"",
        "created_utc": 1524789252,
        "upvote_ratio": ""
    },
    {
        "title": "[Friend] I tackled a guy who was hitting and choking his girlfriend that was running from the cops",
        "author": "PM_ME_ur__NUDES_PLS",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8e1l69/friend_i_tackled_a_guy_who_was_hitting_and/",
        "text": "TL;DR I tackled a guy who swung on a cop and tried to run away after I went and told the cop at a movie theater about the abuse.\n\n\nSo I was on a date today with my girlfriend at our nearby cinema. We were watching the new movie Rampage with the rock. When we started hearing, behind us, a couple arguing, crying, and what sounded like fighting. As the movie got quiet so did they, but as it picked up the arguing did too. Turns out they had been movie hopping and they were arguing about not having 3D glasses to see the movie we were in. Well at the end of the movie the girl walks out and is crying and has her hoodie up. So my gf asks if she can go make sure she’s ok and I tell her go ahead and go be careful. She went into the bathroom with the girl where the girl told her that the two of them had been fighting and he hit her and choked her. Here’s where it gets interesting. I walk out and my gf comes up to her with the girl and told me what went on. The boyfriend then came up and was all scratched up and bleeding. They said they had been hitting eachother throughout the film. I said I was going to call the cops and as I pulled out my phone they both told me not to as they had already had a run in with the cops for the same thing and that she wasn’t supposed to be with him. They started arguing and I mouthed to my gf I was going to get the cop on duty at the front of the theater. The couple tried to walk out but the cop stopped them.  They then are talking to the cop and arguing with eachother. The cop then asks me and my gf what we saw so we tell him, in the meantime another cop comes into the theater and is talking to the two of them. Eventually the guy starts to try and leave and walk towards an exit. The cops go to stop and grab him and he starts swinging on them. He then runs around a pillar to try and juke them out. He then runs straight towards the exit and I book it after him. I’m pretty fast as I played rugby and wrestled. So about as he’s getting to the door I hit him from behind through the door (sadly breaking it) and bring him into the lobby where the tickets are, I literally tackled him out of his Jordan’s . He’s on all fours so I hit him with a cross face from behind and throw my legs in on him and put him in a rear naked choke hold. The cops catch up and start cuffing him and tell me I can release the hold because he is about to pass out . So I’m on top of him with the boots in and there’s a cop on either side of me grabbing his arms and he tries to lift his chest up and get up so I forearm him in the back of the head and shove his face into the tiles. All while yelling obscenities at him for making me run and trying to hit the cop. After they have the cuffs on him I took out the boots and got up and finally took a long needed breath. I finished the night by signing a police report, getting a sticker that they give to kids, and a couple pictures with the cops. It was by far the craziest date I’ve ever been on.\n\nEdit: [link to photos ](http://imgur.com/a/a01rDMS) ",
        "created_utc": 1524378271,
        "upvote_ratio": ""
    },
    {
        "title": "Shock and Awe",
        "author": "PopularPen",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8d6s03/shock_and_awe/",
        "text": "[removed]",
        "created_utc": 1524067465,
        "upvote_ratio": ""
    },
    {
        "title": "[SUSPECT] Do you have a drivers license that is valid?",
        "author": "SpiritedDistribution",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8cuk3b/suspect_do_you_have_a_drivers_license_that_is/",
        "text": "When I was 23, I finally got my drivers license. In England, since I lived there at that time. Yes, I was a late bloomer in that regard.\nAnyway, a few years later my husband and I had moved to the Netherlands.\n\nI had my spunky, boy racer dream car souped up Volkswagen Polo, and was on my way to the beach with my dog. There was a routine stop that day, checking for license and registration and I ended up in that funnel. Oh well, it'll add a few minutes to our journey but my dog (a 100 lb rottweiler) was sat in the front having a grand old time so I didn't mind.\n\nWhen it comes to my turn in the line, I get asked for my license and registration and I hand over both. The cop is a dog person so he asks if it is ok to pet my dog. I tell him no, because she has this thing about people in uniform, ANY uniform, and the guy looks devastated. I feel bad for him so I apologize and explain her issue, making sure to note it isn't his fault, my dog is just... special. \n\nAnyway, he goes off and checks my paperwork, comes back with a look on his face, and asks how long I've been living in the Netherlands. I tell him 2.5 years. He tells me that my license isn't valid and I need to get it changed to a Dutch one lest I end up with a big ticket, but he let's me go on the condition that on Monday I get my license sorted out. Ok thank! I will!\n\nThat evening I end up talking to my dad, who is a driving instructor, and I tell him what happened. He looks at me and says that that cop has no idea what he is talking about, that my license IS valid. He then pulls out his books and shows me the legislation. Turns out not only was my license valid, it would be valid for another 6 years! (10 years valid after date of issue)\n\nSo, me being the smartass I am, write down that legislation on a piece of paper in case I get checked again and keep it in my glovebox.\n\nSure enough, a few weeks later I am picking up my husband from a night out with friends. And ofcourse I end up in the funnel. I get one of those breathalyzer tests, and have to show my license and registration. I pass the test, being a tea totaller that isn't hard, and again get told my license isn't valid. Cop tells me I am going to get arrested, car impounded, the works. I tell him, point blank, that none of that is going to happen. He looks at me, then decides to play along (thinking I am messing with him maybe?), and asks why that is. So I grab the piece of paper and tell him that in fact, my license is very much valid and if he doesn't believe me to check that particular piece of legislation. Which, to his credit, he does. A few minutes pass, he comes back and apologizes profusely and sends me on my merry way.\n\nIn total, I had to use that piece of paper around 10-12 times (most times late at night on my way home from work, my parents, or picking up my husband and getting stuck in one of those funnels) and every single time I had to explain to the police that they were wrong. Now I know it's a citizens job to know the laws, but that one is obscure at best, and none of the cops who stopped me knew this, every single one thinking I was driving without a valid license and about to arrest my ass.\n\nMy dad though, was the true winner in this story because without him I'd have never known. Way to exercise my rights for me dad! ",
        "created_utc": 1523947375,
        "upvote_ratio": ""
    },
    {
        "title": "2 b*****s in the jail.",
        "author": "StevenGaryStout",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8ct5p6/2_bs_in_the_jail/",
        "text": "[removed]",
        "created_utc": 1523931544,
        "upvote_ratio": ""
    },
    {
        "title": "[suspect] Are you joyriding?",
        "author": "SpiritedDistribution",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8clc1z/suspect_are_you_joyriding/",
        "text": "So this happened probably around 8-9 years ago. I was in my late 20's, a little 5'7\" 100 lb girl driving a Volkswagen Polo GTI. \n\nMy little speed demon was chipped, tuned, lowered, had a full body kit on there, Wolff double exhaust, BBS rims, the works. It was basically a young guys wet dream. And yes, she was a manual (stick shift).\n\nI'm driving down the highway in the Netherlands where I lived at the time, being a goody two-shoes following the speed limit which was 70 mph on that particular stretch. I'm on my way to my mothers house, about an hour away from where I live. \n\nNow, I got my drivers license in England, and my initials are identical to my dads, which adds to the confusion in this story.\n\nI am driving along, and notice a police car behind me. But since I am not breaking any laws I think nothing of it. The police car passes me, and as it does so I notice both officers looking at me. So I wave, just being polite and all.\n\nThe police car pulls in front of me, and turns on their \"police, follow\" sign on top of the car, indicating to me I am being pulled over. \n\nThey lead me to a gas station and I pull over. I roll down my window expecting that maybe I have a light out, since that was a common issue with my car. But no.\n\nThis fresh out of police academy, green around the gills, not a day over 21 rookie cop walks up to my car, with his much older mentor in tow. Before I can even say anything, such as hello, or ask what the problem is, rookie cop asks if I am having fun joyriding in my dads car with a look of disdain on his face and a tone of total condescension. I look the kid up and down, notice his much older mentor and fire back \"Nope, are you?\" while smiling sweetly, my tone dripping with sarcasm and a hint of glee. (I'm nothing if not an asshole, and a sarcastic one at that).\n\nNeedless to say rookie did not take to my sass kindly. His mentor however was trying his hardest not to burst out in hysterical laughter. I mean this guy was standing behind the rookie and he was doing everything he could not to lose it.\n\nRookie starts yelling at me, telling me I am \"insulting a cop in uniform\" and he is going to give me a ticket. I tell him that's perfectly fine by me and ask why I was stopped in the first place. \"You are in a car you don't own, you are not old enough to drive (you have to be 18), don't have a license, and probably no insurance either!\" \n\nAt this point I just look at this kid and tell him I am impressed he deduced all that all by himself and that he must be a regular Sherlock Holmes. (Now I'm being the condescending one, and sarcastic to boot).\n\nRookie is still steaming out of his ears, so his mentor steps in and explains that the car is registered to someone with the same initials as me, but the only person they can find with a Dutch drivers license is my dad. So I pull out my license, which is English, and my registration papers to prove that I do have a valid license and, in fact, own the car. The mentor takes a look at my papers, finds it to be in order (apart from an issue with my license, cops you guys and gals need to know the laws better than we do okay? Just saying...) and tells me all is good.\n\nIn the end, rookie was fuming mad, wanting to give me 5 tickets in total, I was being a sassy idiot and the mentor sent me on my merry way without a single ticket while laughing and poking fun at rookie. \n\nNot sure how the rookie fared, but I never saw him again so it's safe to assume he either transferred to a different region or just realized he wasn't cut out for the job and quit.",
        "created_utc": 1523857309,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] How does a heron kill a fish?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8c48vj/suspect_how_does_a_heron_kill_a_fish/",
        "text": "Going back a few years here. \n\nI went to a small liberal arts school known for its recreational drug use. The students were overwhelmingly brilliant high achievers, and  at the time the pot smoking and acid tripping were generously overlooked by our ex-NYPD campus police. They genuinely cared about our safety, and we loved those guys. \n\nOne morning a group of friends and I took LSD and walked to the waterfront. We stood staring into the rainbow oil slicks, mesmerized, until the silence was broken but the sound of a car approaching. A campus police car was driving over the grass toward us. We were all shocked, silent, and (as they say) shitting bricks. Covered in dirt stains, bedragged, and barefoot at the waterfront at 6 AM, we knew how we looked. \n\nThe officer stopped the car about twenty feet away and got out and casually walked toward us. When he got to our group, he smiled and said good morning. Not a single one of us was coherent enough to respond, and we all just stared at the ground, or his chest, or off into the distance. Boy, did he know what was up. \n\nCalmly, he placed his hands on his hips and smiled out over the water, watching a blue heron fly by. \n\nHe said, \"I watched one of those blue herons catch a fish one time. I had always wondered how they eat them. They're so darn big!\"\n\nWe just stood there with saucer eyes, completely frozen in place. What did this have to do with us being arrested and going to prison? We were all in a total panic, beet red and shaking. \n\nHe continued, \"so I watched this one. Would he start with the tail first? Or the head? Either way, it would be flopping around a lot. But you know what that heron did? It put the fish in the ground, stabbed it through the belly, ripped out its intestines, and ate them while that fish was still alive and flopping!\"\n\nHe then turned away from us, said, \"you kids have a good morning!\" and got back in his car and drove away. \n\nNeedless to say, we left the waterfront real quick and found a safer place to continue our trip. \n\nThat officer knew exactly how to scare us just enough to get us to be safe. \n\nA huge thank you to all of you who care so much about our well-being, and who sometimes get creative in our care.",
        "created_utc": 1523668586,
        "upvote_ratio": ""
    },
    {
        "title": "[Officer]Adam Henry",
        "author": "lightning_strike1",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8bi6o3/officeradam_henry/",
        "text": "I pulled up to a business because i see a bunch of people loitering. I tell everyone to leave and they do. There's one guy sitting on top of an electrical box, who didn't listen so I detained him.  \n\nI conducted a quick pat down and ask for his basic info. To which he replies \"I don't know.\"  \n\nMe: look man just cooperate and if you don't have any warrants, you'll be free to go.  \nHim: hell nah I hate the police, I ain't going to tell you shit, ya pig. You can take me jail I don't care.   \nMe: you serious? I'm just detaining you for loitering, it's not a big deal.  \nHim: you gotta read me my rights. I ain't talking to you.  \n\nI put him in my patrol unit and request for an officer with a fingerprint machine. Luck would have it no officers have one today.  \n\nMy only other option to identify this guy was taking him to jail to get him fingerprinted.  \n\nI get to the jail got him finger printed and his info. I thought for sure this guy has a warrant.  Ran him on the computer and no warrants. I thought it was a mistake so i double checked and sure enough no warrants on this guy. \n\nHe was being a total Adam Henry the whole ride and at the jail so I decided to book him for loitering. He refused to answer any medical screening questions so I had to take him to the main county jail which was in another city about 20 miles away.  \n\nI don't know what happened but he decided to be cooperative at the main jail. He answered all the medical screening questions and even signed his citation, which surprised me.    \n\nAll in all, what should've been a 5 minute detention turned into a 2+ hour arrest cus he was being an Adam Henry and refusing to give me his info.",
        "created_utc": 1523462356,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] \"...do you have any idea why you might have been weaving, son?\"",
        "author": "i-tell-tall-tales",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8b8yir/suspect_do_you_have_any_idea_why_you_might_have/",
        "text": "So this happened MANY years ago when I was in college, back when there were chat rooms on AOL. I met this girl, and went out on a date, and things went well. We wound up in this kids playground afterwards, making out, some heavy petting, etc. I was pretty straight-edge back then, and hadn't had sex, and didn't drink, and of course, we were on a playground, so it didn't really go beyond that.  So by the time I get into the car, I'm starting to feel this... ache... like someone had grabbed my balls and was squeezing them in a vice. \n\nI'm super uncomfortable, and get into my car and I'm driving home, trying to keep my legs as wide open as I can so as not to add any extra pressure down there. And then I see it, red and blue lights behind me. My 19 year old heart starts pounding like a drum. This may be the first time I'd ever been pulled over. Flashlights start coming towards me, and these two officers tap on my window, and tell me to lower it.\n\nI'm trembling, and they ask me if I've been drinking tonight. I was so shocked, and so straight-edge, that I said, horrified \"NO.\" (Kind of like, \"Why would you even ASK me that?\") And the look on my face must have been pretty compelling, because the officer looked just a little like \"Oh, wow, I guess he hasn't.\" So he says to me, \"Well, the reason I pulled you over is because you were weaving a little on the road back there. Any idea why you might have been weaving, son?\"\n\nThere's this long moment and I sort of mumbled... \"Because I have blue balls?\"\n\nThe cop sort of twitches. Looks at me again. \"I'm sorry? What?\"\n\nMe, a little louder: \"Uhhh.... because I have blue balls?\"\n\nAnother long pause. \n\nHe looks at his partner to make sure he's heard me right. The partner starts trying not to laugh. He's trying REALLY hard. But this is making the officer who's talking to me have a hard time not laughing. \n\nSo while he's doing his best to keep a straight face, and not laugh me into total humiliation (he's REALLY trying hard, and barely holding it together) he tells me \"Okay, well, try to drive a little more carefully. There's some fast cars here, so I want you to pick up speed on the side here before you merge back in.\"\n\nAs they walked away, my face burning, I could hear them giggling like school children, finally losing it completely.",
        "created_utc": 1523377654,
        "upvote_ratio": ""
    },
    {
        "title": "(Suspect)Received my first ticket ever!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8b3qq1/suspectreceived_my_first_ticket_ever/",
        "text": "[deleted]",
        "created_utc": 1523322835,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] No Officer, I don't know why you pulled me over?",
        "author": "Sh4d0wr1der",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8b3m89/suspect_no_officer_i_dont_know_why_you_pulled_me/",
        "text": "Although at one point I was a \"young and dumb\" teenager, I feel I've come a long way since then.  Unfortunately, I had a lot of officer run-ins in those short years--all automobile traffic related.\n\nSince getting my driver's license, I've always driven four-wheel drive vehicles or full-size vans.  My second vehicle was a 1983 Toyota SR5 4x4.  It had the little 22R engine, a lift, and tires that were much too big for the stock gears.  I was lucky if I could get it to the speed limit on the freeway.  Man, I loved that truck!\n\nSo, one day my friend is moving, but I'm working that day, so he asks if he can borrow my truck.  For trade, I get to take his new, \"sporty\" Ford Escort GT for the day (dating myself here).  This one had the \"high output\" 1.9L engine, 5-speed manual, and could do 0-60 in about 10 seconds, woohoo, lol.  Fun for me!\n\nFinally, time for me to get off work and take his little car for a ride!  I'm stopped at a stop light.  The road is an empty, slow 40mph side road with a long gentle curve in front of me.  I rev it up, adrenaline pumping.  I'm ready to see if I can get to that 60mph in the time frame they claim.\n\nI rev again, pop the clutch and hear the sweet sound of the front tire start to squeal.  Shift into second.  Hit third, feel it pulling, fourth gear.  Man, this is awesome!  Coming around the long curve with a smile on my face...  Parked on the shoulder facing me, long arm of the law with his radar gun pointed right at me, CRAP!!!  Slam it back down into third, BRAKE!  Putt-putt past the officer who's already thrown his lights on and is pulling a U-turn behind me.\n\nI dutifully pulled over to the shoulder, now my adrenaline is pumping for another reason.  Mr. Officer storms up to my window, furious.  He's so mad at me.  He asks, \"Do you know why I pulled you over???\".  I've always heard the answer is always \"No\" to this question, so I give him my reply, \"No Sir?\"\n\nThat was way too much for him and he starts flipping out on me.  \"WHAT DO YOU MEAN YOU HAVE NO IDEA?!?!  THE FRONT OF YOUR CAR NEARLY HIT THE PAVEMENT WHEN YOU SAW ME!!!  YOU HAVE NO IDEA???\"  I just sat there in silence looking at him knowing I wasn't getting off with a warning.\n\nIn the end I rightly received my speeding ticket for hitting 67 in that 40, and sheepishly drove the rest of my way home without putting the car through any more of its paces...",
        "created_utc": 1523321748,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] RCMP aren't always jerks",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8b03g8/suspect_rcmp_arent_always_jerks/",
        "text": "Location: Just outside a capital city in Canada.\n\nI was pretty stupid around this time (I've since taken my need for speed to a track). Newly licensed and only recently allowed by law to drive alone. My parents had just left the country to vacation in America. They flew there and left me both vehicles. My only restrictions. Don't break the law &amp; no long distance trips. Though, I was allowed to visit my best friend out in the sticks.\n\nI was on my way back from my mates house. I'd been out there before and knew the roads well. I'm cruising along doing the speed limit (80kph) when I come up to a vehicle in front of me. It's quite evident he's going dramatically slower than the speed limit. I match his speed at an astounding 55kph in a legal 80kph zone. Most people do \"10 over\" so most are traveling at 90kph.\n\n\nI tried to be respectful of his decision to drive slowly. But going that slow on a highway is dangerous. I stayed at his speed for a little while. But, I'm young and impatient. Didn't take more then a couple kilometers before I honked my horn, flashed my high beams and revved my engine. That worked a little bit - he sped up briefly to 70kph. Granted, this is better, but still really slow considering traffic normally drives at 90 in the area. Of course, this didn't last long. He slowly drifted back down to 55kph.\n\nUnbeknownst to both of us, there was a cruiser up the highway with radar on him. I'm sure you can see where this is going. The good officer has this guy clocked at 55kph on a highway. I chose this moment to (legally) pass him at an extremely high rate of speed. When I let off the gas I was doing over 130kph.\n\nCop turns on his lights behind the first guy and tells him to follow him. At this point I knew I was screwed and was already on the side of the road. Cop pulls up behind me with the other guy close behind him. Gets out and asks me how fast I was going. I was honest, I had looked at the speedometer.\n\nMe: \"My speed? Much to fast. Somewhere around 130-135kph.\"\n\nOfficer: \"Yep. I got you at 134. License and registration please. Who's vehicle is this. Something tells me it's not yours.\"\n\nMe: \"The car belongs to my parents. They're not in the country. They're in America on vacation. *Hands license and rego over*\"\n\nOfficer: \"Wait here. I'll be with you in a moment.\"\n\nThe Officer had a talk with the other guy. I couldn't here anything but I got the point that the officer was questioning why he was driving so slow. it was also during this time he ran my info.\n\nOfficer: \"You're saving grace is this. I recognize you were passing the guy. However what both of you did was extremely dangerous. You were on the breaks before I'd even put my seat belt on. I was far enough in the driveway that I doubt you even knew about me. Would I be correct in assuming you were slowing down to the speed limit?\"\n\nMe: \"Yeah. I was going to slow down to 85kph and just go home.\"\n\nOfficer: \"I'm still writing you a ticket. But I'm pretending I didn't catch you doing 55 over the speed limit. Your ticket will be for 10 over. You're newly licensed. Can you tell me the actual punishment for this?\"\n\nMe: \"$10k fine, license revocation and potential jail time for reckless driving.\"\n\nOfficer: \"Good. Here's your ticket. I'm going to follow you into town. Since you're going home, that's where I'll stop following you. You've learned your lesson. When are your parents returning home?\"\n\nMe: \"Couple days. You can reach them when they return at &lt;Home Phone and Cell&gt;.\"\n\nWith that, I went home with scared beyond words. A couple days later, the phone rang. It was the Officer who pulled me over. He talked to my parents, let them know what happened.\n\nI may have been given an ass kicking that night.\n\nTLDR: Followed slow guy home. Passed him at 55kph over the speed limit. Got pulled over, given a ticket for 10 over. Cop gave me a massive break. Guy behind me got yelled at for driving at unsafe speeds on a highway (too slow).\n\n\n*I actually have a pretty clean driving record. Just the one infraction. Most of the driving I do (at those speeds at least) are done on the tracks nearby.",
        "created_utc": 1523293825,
        "upvote_ratio": ""
    },
    {
        "title": "(Suspect) Sometimes having a nice car isn't so nice",
        "author": "Thatconfusedginger",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8av0bj/suspect_sometimes_having_a_nice_car_isnt_so_nice/",
        "text": "Context: I own a rather expensive, albeit - 'Street racer' looking vehicle. '99  Subaru WRX STi Type RA, and my other friends own similarly styled vehicles.\n\nThrowback to approximately 2 years ago, I've just finished work for the night and had dinner out with a few friends at our favourite local Japanese restaurant. They do magical Ramen and Karaage Chicken. Along with this, we hung out and it's approaching midnight.\n\nI decided it's time for me to start my 50km journey back home and call it a night.\n\nSo as a group we pack it in and I peel off and up the motorway while my other friends take their leave. Not even thinking about it, I give it a casual pull from low to speed limit up the on-ramp and then cruise. \n\nAfter I did this, I noticed a vehicle come up rather fast behind me and then fly by. Me thinking nothing of it, give it no attention and a 'You do you bro' attitude. \n\nCouple minutes later, I pass this said vehicle sitting on the side of the road with hazards on, and as soon as I'm past them, pulls out behind me and keeps what I call a 'following distance'. At this point I'm thinking 'Thats a bit strange... Ah well, whatever.' but I keep a mental note on what vehicle it is and what they're doing. \n\nAs time passes and we get closer and closer to my home, I notice this vehicle is following me where-ever I go. So I decide to take a few extra routes to see if my suspicions are true. \nLo and behold, they follow me no-matter where I went through routes no-one who knew the area would take unless they're following someone else. \n\nAt this point I'm thinking *'What in the hell am I gonna do? I don't want my car stolen'*\n\nI kindly oblige to take the last method, drop a gear and pissed off. \nTo say there was a moment of panic and relief when the car following me flipped on the red and blues was somewhat of an understatement. \nI had been tailed for 50km, by a police officer tracking down street racers....\n\n&gt;Officer \"Give me your keys, ID and an explanation as to why you tried to run from me\"\n\n&gt;Me &gt; \"I genuinely thought you were someone trying to follow me home to steal my car, I couldn't tell that you were the police\"\n\n&gt;Officer &gt; \"Seriously?\"\n\n&gt;Me &gt; \"You have no idea the sort of relief and panic seeing you flip your lights. It's a mix of 'Oh thank god, no-ones stealing my car tonight' and 'FUCK. I just tried to run from the police'\"\n\nWe had a good chat and apparently they've been concentrating heavily that week on street racers, hence why I was targetted as they were trying to find where the group was. Super nice officer. He was completely lost though so I drove him back to where he could find his way back to base.\n\nAnother reason why I'm in the process of becoming an LEO. \n\n",
        "created_utc": 1523239609,
        "upvote_ratio": ""
    },
    {
        "title": "[Dispatch] Go to the jungle and never leave the snow",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8apo8y/dispatch_go_to_the_jungle_and_never_leave_the_snow/",
        "text": "[deleted]",
        "created_utc": 1523191050,
        "upvote_ratio": ""
    },
    {
        "title": "Ghetto SWAT",
        "author": "xtraordinarygenius",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8akg9g/ghetto_swat/",
        "text": "[removed]",
        "created_utc": 1523129575,
        "upvote_ratio": ""
    },
    {
        "title": "[Witness] PD Night Shift are Basically Desensitized, Right?",
        "author": "im_from_detroit",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8aaxdv/witness_pd_night_shift_are_basically_desensitized/",
        "text": "So I got to finally meet two officers of my local police department at 2am this morning. I'm my underwear. I wasn't awake enough to care.\n\nSee, they were there for a wellness check on the tenants upstairs (duplex), and I was the first one to respond to the insistent dinging on my door bell. Peeking out and seeing they were officers, I thought 'fuck it' and half hid behind the door when I opened it. \n\nI thought I would have met them in a more dignified manner than this, but when I was able to hand them off to the tenants upstairs, I just went back to bed.\n\nEveryone thinks it's weird I didn't put clothes on, but there are some times you just have to not care.\n\nBut, I should ask, what would you LEOs prefer at 2am, being delayed, or seeing a dude in his whitey tighties?",
        "created_utc": 1523032063,
        "upvote_ratio": ""
    },
    {
        "title": "[firefighter] that's not mud you're standing in",
        "author": "themedicduck",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8a8cxi/firefighter_thats_not_mud_youre_standing_in/",
        "text": "I'll start by saying you all have been very fun to write for and also that this is kinda addictive. \n\nAlso, I love the cops I work with.   That being said, this was probably one of the funniest things I've seen in a while and it happened not 2 hours ago.\n\n12:30 AM: dispatched for a 32 foot RV trailer on fire in a farm field.  The CAD terminal in the engine is just going nuts with updates, something about purposely set fire, something about a gun....the cops are coming.\n\nWe arrive and lo and behold it's a trailer on fire next to another trailer.  (I guess one was to live in and one was to store his crap on/in.   Not sure which was which.  Dude was a high roller.) I pull a hose off, deploy it out and noticed two things while waiting for my engineer to get me water.  First, HOLY SHIT THERES A PROPANE BOTTLE ON FIRE 4 FEET FROM ME.   *Applies water vigorously* second........WTF is that smell.......at this moment there was a 'whump' sound that was not unlike the sound an infant makes prior to pooping their pants spectacularly.   Which was fitting because really it was the sound of the septic tank rupturing.  \n\n\nRight.  Next. To. Me. \n\n\nWhatever, put fire out, vomit can be washed off later.   \n\nUse your air pack if you're a firefighter,  don't breath toxic waste like me.\n So anyway, get the fire knocked down pretty good. Checking around for anything suspicious or whatever. \n\nSo the deputy had brought his rookie with him.  Kid was fresh out of academy.  Must have been his first fire.  (they assist with a lot of stuff on fires, really great guys.). \nSo Jr comes hopping over to me, wants to know what I saw when I arrived and if anything seems suspicious about this fire and was this and that evidence visible and what was the guys motive and what was the best color for something and did I hear about that car wreck somewhere he went on, this was for some time befoe finally asking me \"hey  what's that smell?\"  At this point I looked down, realized where JR was standing and couldn't help the small smile on my face.  \n\"Hey dep JR?\" \n\n\n(Dep) \"yea themedicduck?\"\n\n(Me) that's the smell of a ruptured septic tank.\n\n(Dep) gross man, from the RV?\n\n\n(Me). Yea, and that's not mud you're standing in either man.\n\n(Dep)..........wut?\n\nPoor Jr.  He looked down, realized his nicely polished boots were now ankle deep in what I can only assume is poo, pee and possibly other things.  I'll give him credit.   \n\nHe held it down for a good 30 seconds.  \n\n\nJr fled to a bush out of the way and lost his doughnuts all over it.  \nHis partner, Sarge, eventually comes over looking for Jr and spots his young partner doing the midnight worship and gives me a confused look.   \n(Sarge) did you break my rookie, themedicduck?\n\n(Me) no Sarge, just broke him some tough news.  He might need some therapy.\n\nSarge realized what had happened after he sees the pile of poop I'm dealing with, sighs and shakes his head sadly, collects his rookie and they clear the scene.  Presumably to get the rookie new pants.  \n\nThanks guys.",
        "created_utc": 1523009719,
        "upvote_ratio": ""
    },
    {
        "title": "Suspect. The time I was pulled over with two guns in the car..",
        "author": "marokyle87",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8a7ysj/suspect_the_time_i_was_pulled_over_with_two_guns/",
        "text": "Ok one last story for you guys.  Sorry for the formatting on these as I am on mobile.\n\nI’m a mechanic and have a small child 15 months old.  I don’t get much time during the day to work on my project cars on account of the baby so I do it at night.  The car I was working on didn’t have front fenders installed a hood or front bumper but was otherwise legit IE current tags and whatnot.  Now I need to do a test drive to figure out writhed or not my lean code has been fixed.  I connect my scanner and proceed to start driving it’s 10:30-11 pm.   I live in a rural area so not many people on the road that time of night.  I drive for 5-10 minutes and come to an intersection and keep driving. I now notice bright headlights behind me... I’m thing ah shit... cop gotta be..  and this car I’m driving ah shit I’m getting pulled over...  So I’m driving along and sure enough the cop pulls me over.  At this point I will mention that I have my CCW.  Whenever i get pulled over i always rest both my hands on the out side of the window so that the cop can seem them. Cop says good evening Sherrif’s department I say hi.. reason I pulled you over is because you were swerving a bit.. (I wasn’t but the car looked bad).  License and registration he says I say ok but hang on before I reach for anything I should tell you that I have my CCW and I am armed. He say OH! Yes that’s good to know.. where?  I say I have a ruger LCP in my front pocket and i went target shooting today so I have my Sig p238 in my left front jacket pocket.  Both are on my permit.   He says nicely says ok please step out of the car I proceed to slowly do that he has me put my hands on the roof as he takes the guns out and frisks me.   He says ok can I see your permit? I say ok It’s in my wallet can I reach for it. He says yes I pull it out and hand it to him.  He says ok I’m going to have you take a seat in my car while I check this out. I’m not going to cuff you or anything .  I say sure! I understand do what you have to do.  He puts me in the back seat of the ford explorer cruiser and closes the door.  I hear him radioing my permit number as well as lic number and plate number.  His laptop is visible from back seat.  After a few miniuts it says in text permit valid DL valid Lic plates valid.  He walks back to the car lets me out and says you’re probably wondering what’s going on huh? I say absolutely not I totally understand i have two guns on me..! He say we wish there was more of you permit holders we like to see citizens armed and says good bye I walk to my car and both my guns are laying on my seat racked and loaded..  that is how you do that without being shot.   Oh also I’m white so that too haha",
        "created_utc": 1523004659,
        "upvote_ratio": ""
    },
    {
        "title": "(Suspect). The time I was the target of a chp street racing sting",
        "author": "marokyle87",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8a7vyo/suspect_the_time_i_was_the_target_of_a_chp_street/",
        "text": "Ok i was 20 here again and I had a pair of 5.0 mustangs a 93lx and a 88gt t top car.  Now for the past week my buddies and I had been drag racing down this country road at night beteeen the stop signs.  I had also driven max speed down this street this week in the 93lx (155mph) really dumb I know.. i was 20..  Nothing ever came of it then at the end of the week on Saturday it was cruise night so my buddies and I would all convoy in our cars to the cruising street like we did every weekend.  We proceeded to do this and then head to our buddies house at the end of the night.  Now it should be mentioned that our buddy lived at the end of the drag racing street.   We all drive up in our muscle cars and realize that a helicopter has started circling over head..  we don’t think anything of it at first but then it turns on it’s spot light on us...  the buddy who lives there says GO! This is gonna wake my parents GO!!  So we all drive out of his neighborhood and on to that street.   We come to the drag race street intersection and a large group heads one way another another way and I headed another way...   well the helicopter followed me and the one guy that took the way I went, buzzed in front of me and got on the loudspeaker and said “pull over theres officers behind you!”   I immediately pull over and sure enough two CHP cars materialize out of thin air!  An officer comes to my window and says license registration and give me your keys!!  Now I should mention this is the t top car and the t tops were off.  The helicopter is now above us and is shining the spot light down on me through the open roof.    I give the officer my keys and he slams them on my roof.   He says we have been getting complaints of people street racing on this street!  And we know it’s you guys!!  He says this is bullshit and do I know how much time and money was wasted doing this?????   I say nothing... he says if you’re gonna race PICK A DIFFERENT STREET!   He gives back my keys and the cops all leave... the cops must have been waiting there for us on that street all evening knowing we would probably come through there.   Thing is.. they just assumed it was us..  didn’t have any proof..\n\nNow next day I’m working at my maintainer mechanic job and the plant manager drives up to me and says “hey there’s a black and white out front wants your keys” I say what?????    He says you were on the news... local street racing ring busted!!     Seems like forever ago now like 10 years.. I drive like a grandpa and own a Camry lol..    I ran into the other guy that was pulled over with me a few weeks ago. He says he’s told this story to a bunch of people and no one believes him..  he says you’re the only one because you were there",
        "created_utc": 1523003529,
        "upvote_ratio": ""
    },
    {
        "title": "(Suspect) the time I was 20 and went for a beer run drove 90mph got stopped by CHP and not given a speeding ticket",
        "author": "marokyle87",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8a7t3d/suspect_the_time_i_was_20_and_went_for_a_beer_run/",
        "text": "Ok so I was 20 years old at the time and had a decently fast car (93 mustang 5.0). Now I live in the country and the nearest store is about three miles away, this is a small liquor store.  I went to elementary school with the guy who runs it (score)  meaning I was able to buy alcohol underage for all of my friends.  So one evening a buddy and I went to get a bunch of beer for a party later that night????  Long time ago... anyway   It was maybe 8:30-9 pm and we were driving home and i decided to drive fast...  It was really easy to do in that car, too easy.   By the time I noticed how fast I was going i was doing 90mph and I see headlights approaching me in the opposite direction. Before i can react the car passes me, I saw push bars.. fuck I think cop....  now I was going so fast that he had to stop turn around and then go after me.  I decided well shit I’m not more than a half mile from home and this cop hasn’t put his lights on yet maybe I can get to my parents driveway (which had a large covered gate that completely blocked their property from the steet) and get away.  So I get to their corner and this cop is gaining on me but still hasn’t put his lights on.   I would have stopped if he had I wasn’t THAT dumb.  I make the corner,  turn into their driveway and start shouting to my buddy open the gate open the gate there’s a cop there’s a cop!!!! He hesitated but does this I pull the car in and he shuts the gate just as the cop drives past.  I thought oh man we did it!!!   Then I hear braking and the cop car going in reverse.  I yell hide the beer and my buddy just bolts...   the cop, a CHP Officer a seemingly a very nice guy gets out of his car with his flashlight out and leans over my parents gate. Says to me “almost got away huh?”  And I sheepishly said yeah...  I said this is my parents house... he asked where’s the fire!?  I said yeah sorry.. he said why the hurry??  I say no reason I was just going fast... )I’m panicking because I KNOW there’s a backseat FULL of alcohol in my car and if this cop sees that it’s not gonna be pretty.   I also know that my drivers door is wide open because of my haste to shut my parents gate.). He shines his light around my parents yard and sees my dads classic mustang collection.. he says wow you guys have a lot of mustangs! I drive by here everyday on my way to work and sometimes i see your dad leaving in one of them.  I say oh yeah..  he loves mustangs.... my voice probably cracking..    he says Ok I’ll tell you what I’m gonna do. I noticed you don’t have a front license plate correct?  I say yeah..  my voice probably quaking. He says ok o tell you what, I won’t write you a ticket for the speeding I’ll just give you a fixit ticket for the missing front plate.  I say wow! Thanks! So much I appreciate that!!   He says I just need to look and confirm that it isn’t there (I’m thinking FUCK jigs up he’s gonna see the beer!!) he says can I come in the yard and look?  With my voice trembling I say yeah.. and proceed to start walking to my car which is 40-50 feet away. I’m walking in front of him a little faster than he is and as I pass my drivers door I shut it without looking.  He walks up to the front of the car glances at the plate says “Yup no front plate” then flashes his flashlight across the front windshield of my car!!  Doesn’t say anything and proceeds to walk back to his cruiser and write the fixit ticket.   He finally leaves and I start looking for my buddy who bailed..  I walk in my parents house and there he is sitting there with a scared grin on his face watching tv with my dad..   He follows me outside and I say thanks for bailing motherfucker and he says “hey someone would have had to bail you out”.   Not that he ever had money haha he died a couple years ago.. To this day 10 years later I’ll never know if that CHP Officer had seen the 3-4 cases of beer clearly visible in my backseat or not but, man he was a nice guy either way!!! ",
        "created_utc": 1523002344,
        "upvote_ratio": ""
    },
    {
        "title": "[Witness] Mystery Car Crash",
        "author": "laughatbridget",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/88w9rg/witness_mystery_car_crash/",
        "text": "I saw this story and was inspired - https://www.reddit.com/r/TalesFromTheSquadCar/comments/856mgq/firefighter_drunk_lady_pulls_houdini_and_then/\n\nI'm 19 years old, summer after Freshman year of college. I get a ride and hang out with 2 friends. Not gonna lie, we smoked a lot of pot.\n\nThey are giving me a ride home at maybe 1 am. We decide to take the country roads, so a 15 minute ride on the highway takes about an hour in the country.\n\nOn the drive, one friend starts talking about how weird it would be if someone ran out into the road covered in blood and asked us for help. What if they were a murderer or a zombie or something? As I mentioned, lots of pot.\n\nWe go around a curve and a tree has fallen across the road. Luckily for us, someone had smashed through the tree on our side of the road already, so we didn't wreck.\n\nWe see a car about 50 yards up the road run off on the left side and stuck between a tree and a fence. We stop to see if they need our help and it gets weird. We are in the middle of nowhere and there is no one in sight. There's blood on the steering wheel but no one anywhere.\n\nWe are thoroughly freaked out at this point, what with the earlier zombie/madman conversation, and (stoned) don't remember what road we're on or what the closest intersection is. We drive to the next crossroad and call 911, and wait there for the officers so we can show them where the wreck is.\n\nThere is a HUGE police response once the officers see the truck, the blood, and no one around. They must have gotten 10 to 15 cars out to start searching. We told several officers what we saw and waited in our truck, scared out of our minds because we were still worried about zombies and also getting arrested for weed.\n\nAfter 3 hours or so, the cops started to leave. Eventually there were only a couple cars left and I got up the nerve to get out of our truck and ask an officer if we could leave. He told me they found the other driver; she had no cell phone (2002) and walked a few miles to the closest house. Apparently we hadn't been needed for quite some time, but they all forgot about us and we were too high and paranoid to bother the cops.\n\nI got home at 5 am and I was still freaked out!\n\nI am so glad so many police responded and worked so hard to find that driver. I could picture them lying in a field somewhere dying alone quite easily, and we were all so lucky that night. I never got to thank the officers. I'm sure we looked high as heck, but I imagine they cut us a break for trying to help someone.",
        "created_utc": 1522637609,
        "upvote_ratio": ""
    },
    {
        "title": "[Deputy] The Smoking Gun",
        "author": "Ausare117",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/88p0jw/deputy_the_smoking_gun/",
        "text": "I went over this in an earlier post: working extra jobs is nice in moderation, but you can't let your pursuit of profit interfere with your ability to do your job. We experienced cops don't spend enough time impressing this upon the rookies. We could probably save some careers and marriages if we would explain to the new guys exactly what kind of toll this job can take on your life, and emphasize balance and moderation. If you're coming from a job where there's a more physical aspect, like working in a warehouse, you feel capable of putting 100 hours a week into this. But the fact is, the job wears on you in ways you don't perceive at first, and it makes you more tired than you think you are.\n\nBefore I figured this out for myself, I was working long hours at extra jobs all day, and on patrol all night. One sweltering August day a couple years ago, I stood in front of a grocery store in the burning sun for ten hours, then started a 10p-6a shift at my real job. I was tired and dehydrated, and couldn't seem to clear my head for my whole shift.\n\nIt was four AM and I was ready to quietly stalk around until the end of my shift without getting into anything that would require me to stay over. I was a bolt of very slow lightning, seeking the path of least resistance to my bed. I was a questing knight, riding right past the dragon and saying \"slay you tomorrow, I'm tired.\" I was a draft horse with blinders that ran all the way to my nose.\n\nUnfortunately, where I work, the moment you slip into that lassitude is usually when trouble finds you. I was stopped at a red light next to an all-night Jack in the Box, fighting to stay awake, when I heard two gunshots literally right next to me. Ten Red Bulls couldn't have woken me up faster.\n\nI was searching around when the tone dropped: \"1C N65 for a weapons disturbance, Jack in the Box, [my location], priority one.\"\n\nI responded on the radio, still sweeping around: \"[My unit number], I'm next to the store, show me onscene and tell me everything you know.\"\n\n\"Show you onscene, adult female in a red two-door in the drive through threatened reportee with a gun and fired two shots, suspect is still onscene - all units hold your traffic, emergency traffic only.\"\n\nI turned into the parking lot and saw the only red car - a two-door - in the drive through. The red car was next to the speaker box, and a woman was leaning out of the window, ordering tacos. Several other cars were in the parking lot, including a few that seemed to be moving to give the red car as wide a berth as possible.\n\nIn another situation, I might have thought this was a bogus call, but I heard the shots! I was right there! Had I been hallucinating? Had the exhaustion finally caught up with me?\n\nThis was the weirdest approach to a suspect vehicle I had ever attempted. There were shrubs on the right side of the car, making a passenger side approach sketchy. I would have done a felony stop, but there wasn't enough room between the driver door and the order screen for the driver to comply with commands to step out - the car would have to be moved a few feet. I went with the most subtle option I could think of, simply walking up on the driver side with my gun drawn but hidden, to allow me to peek inside the car before the driver noticed I was there.\n\nAs I approached, I saw a clearly drunk woman leaning out of the driver seat, demanding tacos: \"Oh my god, you have no idea how bad I need this. Give me ten. No, twelve. God, your tacos are so good.\"\n\nI reached the side of the vehicle and saw it was just her, and she was quite drunk. I relaxed. The \"gunshots\" were probably popping noises from this drunk running her car into a curb or trash can or something. I kept my gun in my hand, but hid it low by my thigh. I made contact with her, while glancing over her to look in the passenger seat.\n\nThere it was. The first and hopefully last time in my career I would see a literal smoking gun. A shiny Taurus automatic rested in the passenger seat, a tiny tongue of smoke wisping from its barrel.\n\nThe adrenaline surge was immediate. My hands shook briefly, then I grew still. There were only two ways this encounter could end, and that knowledge filled me with a strange, icy calm. There would be no deliberation, no agonizing over options. Tacos were no longer on the menu. She would comply, or she would die.\n\nI calmly got her attention. \"Good evening.\"\n\nShe turned and stared at me in slow confusion. \"Hiiiiiii~burp\"\n\n\"I'm Deputy Ausare117 with the Sheriff's Office, and is that your gun?\"\n\nShe slowly turned to look at the gun in the passenger seat, then slowly turned back to me. Her eyes started to well with tears.\n\n\"I was in fear *hic* for my liiiiiiiiiife~!\"\n\n\"Leave the gun where it is,\" (I paused) \"put the car in park,\" (I paused again) \"and step out of the car so you can tell me what happened.\" I wanted the instructions to be perfectly clear, for both of our sakes. It was like talking a suicidal person from a ledge, only she had no idea she was on the ledge.\n\nAfter a tense moment where she almost backed into my car due to drunkenly shifting to reverse instead of park, she got out and was promptly handcuffed. I wiped sweat from my brow as a Jack in the Box clerk stepped outside, having been watching the spectacle from inside the store. She asked me if I wanted some water, and went to get me some when I was too dry-mouthed to respond. Thinking back, the employee must have heard the exchange over the drive through, and was preparing to help us both if the arrest went wrong. The citizens of my community don't get enough credit for being amazing people.\n\nUpon investigation, I learned the hungry lady had pulled too far ahead of the speaker box to order. She put her car in reverse and backed right into the car behind her. When the indignant driver of that car got out to confront her, she got out of the car with a cell phone in one hand and a gun in the other. The Jack in the Box clerk heard the suspect through the speaker box saying \"I gotta call you back, I'm about to shoot this motherfucker.\" She then fired two shots into the air, letting the other driver know how she felt about exchanging insurance information. She then got back in the car and resumed ordering the tacos she needed so badly.\n\nWe have an on-call DA system. Remember, police don't really file charges most of the time - we file a petition for the district attorney to file a charge on the state's behalf. When we want a warrantless arrest, we call the DA to ask for the charge by explaining the facts of the case. It's sometimes frustrating to basically have to try your case over the phone, but it helps the DAs to avoid taking lots of charges before the judges which won't even find probable cause.\n\nI called the DA and got deadly conduct for the shooting, and advised I would call back once sobriety tests were done. I finished sobriety testing and formed the opinion that she was, in fact, drunk. I called the DA and got DWI. Therefore, the car was being used during a criminal offense, and would be towed. During custodial inventory of the car, I located a bag containing several thousand in cash and about ten grams of MDMA in the glove box. I called the DA again and got PCS with intent to distribute. The DA asked if there was anything else I wanted to charge the defendant with this evening, since we were apparently throwing the entire book at her.\n\n\"Well, she did order some tacos and fail to pay for them...\" The DA snorted and hung up.\n\nI was at work until well past 11 AM putting her in jail, getting breath specimens, securing the dope and money, towing the car, doing the crash and arrest reports, and enjoying some free tacos that Jack in the Box gave to me. Evidently whoever ordered them never showed up at the second window, so they were free game.\n\nWent from deadly confrontation to free tacos in no time flat. This job is tough but it has its perks.",
        "created_utc": 1522564875,
        "upvote_ratio": ""
    },
    {
        "title": "[State Trooper] Not as reported.",
        "author": "2BlueZebras",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/88g30j/state_trooper_not_as_reported/",
        "text": "I received a call of a hit and run, no injuries. The victim had chased the suspect to a nearby gas station and blocked his car in so he couldn't get away.\n\nI showed up scene, with another unit to back. As per usual, the victim was yelling to me and pointing that the car ahead of them was running and he needed to go to jail.\n\nI went up to the suspect, and he handed me his driver's license. I told him to wait at his car, get the rest of his paperwork, and I'd be back with him shortly. He was pretty nonchalant for someone running.\n\nI went to speak to the victim. She told me he had sideswiped her car on an off ramp, got out of his car, looked at the damage, and took off. She also told me her passenger had video of it all on his cell phone.\n\nI went back to the other driver. All his paperwork was in order. He told me had had a kid, his life was all in order, and he wouldn't run for something so dumb. I asked him why he didn't stop where he was, and he told me because he was blocking the off ramp, and he directed the other driver to follow him. He said he stopped at the first gas station he came across, which was true.\n\nI went back to the victim and watched the cell phone video. It started maybe 10 seconds after the crash. It showed my victim screaming at her passenger, \"Get this on video! Call 911! He's gonna run! He's gonna run!\" It shows the suspect look at the damage to his car, walk up to the victim's car, kind of shrug, and point down the street. The victim was yelling through her window, \"We're calling the cops!\" He walked back to his car and went the direction he had pointed. Then there's a little \"pursuit\" as the victim followed the suspect to the gas station. The victim never tries to get out of her car or talk to the suspect, just screaming.\n\nI took the crash report, no crime committed. Just because she felt like a victim doesn't mean she was one.",
        "created_utc": 1522467043,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Pulled over twice in two hours.",
        "author": "dc2691",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8828kv/suspect_pulled_over_twice_in_two_hours/",
        "text": "Circa 2008...\nFriday night and I had plans to drive me and a friend to meet other friends for dinner. I was 15 and 6 months old which in my state meant you could get a restricted license. I was driving my 1981 Chevy Malibu. Not five minutes after we left home stupid 15 year old me cuts off an unmarked. The officer was cordial but clearly gave me a ticket. I think it was something like 55 in a 45. I was bummed and drove home assuming my mom would be pissed. \nLuckily she was understanding and gave me a quick \"don't let it happen again.\"\n\nI didn't get out much and she was glad I was spending time with friends so she insisted we would deal with it later and that I should still go meet my friends. So I'm an hour behind and to cheer me up mom suggests I take her VW GTI (a fast little car, I don't know what she was thinking.) So I get 10 minutes down the road and come over the crest of a hill and my heart stops... I know that I am about to be pulled over by the city cop coming in the opposite direction. I was going at least 10 over. \n\nBlue lights come on and I am so mad at myself. I was assuming I'd end up in cuffs due to the recent ticket. The officer was cordial and after waiting for 20 minutes I was nervous. \n\nFinally he walks up and gives me a ticket almost identical to the one I got an hour ago...\n\nApparently he had no idea about the earlier ticket and I sure wasn't going to tell. \n\nI drove immediately home, handed the ticket to my mom, said I was sorry and went to sleep. Needless to say she was not happy.",
        "created_utc": 1522337751,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Do I have a free doughnuts sign on my car? Or how many times can I be stopped",
        "author": "Nemesis651",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/8820oh/suspect_do_i_have_a_free_doughnuts_sign_on_my_car/",
        "text": "I might post this in TIFU as well, as it all happened today...\n\nDriving in town A this morning. Got stopped by Officer 1A, for an expired license plate. My state went to a new tax/tag/fee system and its been a mess for cars, especially new cars (which mine is). Told me to fix the plate and the ticket would be dropped. \n\n10 minutes later, get pulled over by Officer 2A. I hand him the ticket. He remarks \"ah ya I just did hear this\". Looks it over, gives it back and lets me go. \n\nI leave town A. I live in the country, and need to stop at my house before I can go to our DMV to fix the plate/pay fees. State police officer stops me. At this point Im laughing. He gives me a really odd look, but after I hand him the ticket, and explain hes the 3rd to stop me, he starts laughing too. Offers to escort me to the DMV so I dont get stopped, but since I needed to stop at home, so I declined. \n\nGet home, head to town 2 where the DMV is. Get to office, pay the fee, get a new plate indicator to show its current.\n\nTown 2 officer is standing by my car where its parked on the street. \"Stopped to say your plate is expired and that Id have to give you a ticket unless you go to the DMV (across the street) to fix it\".\n\nWhile he starts thinking I need to go to the loony bin, I give him the plate indicator and paperwork showing I just took care of it, and the ticket, and after a few minutes of calming down, inform him hes officer number 4 to inform me. He responded that ya he would probably also need a good laugh after all that. ",
        "created_utc": 1522336090,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] First and only speeding ticket iv'e gotten so far",
        "author": "AnonElbatrop",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/87yc64/suspect_first_and_only_speeding_ticket_ive_gotten/",
        "text": "Decided I would share my story involving my very first (and only) speeding ticket I got a few years ago.\n\nThis was when I was 17 if I'm not mistaken (memory is not the best) on a Sunday morning. I was headed back home from a few hours away for a family event, and had work at noon that day so I wanted to make sure I was not going to be late. \n\nFor reference I drive a 97 civic so it is not like I have that much power anyway, but this was on a 4 lane both ways highway with a decently large median and hill separating either direction. I had been coming down a minor slope and decided to put the pedal down, partially because the road was basically empty, and I was just pushing the car, not expecting run into any police because this area was pretty rural.\n\nAnyway, I let up on the gas at the bottom of this small slope, and conveniently located here was a connecting road  between the two directions. I immediately saw a state trooper coming my direction from the opposite way appear from behind the hilly median and lock eyes on the car as I pass it, foot is on the brake at this point. I can already tell i'm screwed because I glanced at my speedo and saw it in the mid 80's and moving down quickly as I slow myself down, the speed limit here was 60 by the way. \n\nSo I can already tell the trooper was slowing down to flip a U turn at the connecting road, and there is a very small gas station and empty gravel lot beyond this so I decide to pull aside and into the lot. Not once did I glance behind me so I never even saw the blues until I was parked, and the trooper did not even use the siren, safe to say we both were on the same page.\n\nThis was not my first time being pulled over, as I once forgot to turn on my headlights at night (got off with that one) so I was not too nervous about knowing how to deal with being pulled over but I was not sure what to expect in terms of the ticket.\n\nShe walks on over and I believe the first thing she said was along the lines of \"any idea how fast you were goin.\" I did not have any response to this so I just responded with \"i'm not too sure.\" She informed me that she had me at 89 but her machine locked in at 85, so 85 was what I was gonna get. Now, in my state anything over 20 the posted limit, or 80 mph is a reckless driving ticket, and my state is known for being strict so I guess I was not too surprised when I received my citation. \n\nIn the end, the worst part ended up being the 9 am court date, which happened to be 2 and a half hours from home. I was a minor so my mother won a trip down to a nice little rural courthouse early on a Wednesday morning. I ended up paying all the associated fees (which ended up being under 100$ if i'm not mistaken) and had the ticket dropped upon completion of a driving class and 40 hours of community service.\n\nTl;dr. Reckless driving ticket in a well known to be harsh state multiple hours from home, judge dropped it if I did community service and a driving class, which I gladly completed.\n",
        "created_utc": 1522296172,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] My first speeding ticket could've been so much worse.",
        "author": "ellie_love1292",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/87toum/suspect_my_first_speeding_ticket_couldve_been_so/",
        "text": "So, I've spent the last few days reading about everyone's posts here, and thought it was finally time to share the story about my very first speeding ticket. \n\nI was 17 years old, and had had my junior license for a total of 6 months.  Once you're 18, several restrictions can be lifted from your license, or, if you stay accident/citation free, you can get your unrestricted license one year after you pass the initial driving exam.  That was my goal.  My mom had Hodgkin's Lymphoma (don't worry guys, she's all good now, 10 years later) and I had spent my bright and beautiful summer day in the chemo suite of the closest oncology-hospital about an hour away.  My boyfriend at the time and I were in the process of breaking up, so I was talking to my mom about it, and wasn't paying attention to how fast I was going on the freeway.  I lived in a pretty rural area, so there were maybe 3 other cars on the road with me.  \n\nSuddenly, I see a state trooper sitting on the side of the road.  I immediately brake, seeing my speed slow down to 80 as i'm braking.  Guys and Gals, He didn't even bother to put on his lights. He just stuck his arm out the window and waved me over.  I complied, like a good 17 year old girl with her Momma riding in the passenger side.  His lights eventually came on and he pulled up behind me.  \n\nIt was at this moment that I knew I fucked up.  It was my first time being pulled over, at all. My family is close with the local LEOs and I paid attention in drivers ed, so I knew I was completely screwed. I was going (at least) 85mph in a 65. I was under 18.  I was easily looking at a $400 fine, a 90 day license suspension, and WAY over 6 points on my license if the cop cited me for careless driving on top of speeding. \n\nI knew that I wouldn't be able to drive unrestricted (after 2300) and I was heartbroken.  I wasn't planning on being out after 2300 anyway, but if I needed to take my mom to the hospital, I didn't want to break the law driving home. Plans were obviously dashed, and my stress level was obviously high.  I just start sobbing hysterically. My mom's trying to get me to calm down enough to be able to speak actual words to the officer, so I do my best and roll down the window. Looking back, I feel bad for this guy having to deal with me. I was a HOT MESS. He asks me if I knew why he was pulling me over.  I told him I was going too fast.  He laughed.  He told me I was going ... I think almost 90? in a 65.  My heart drops and I start to cry more.  He asks if we were coming back from the mall or something, and then I tell him I was driving my mom home from her chemo, and he sees my mom, bald as can be with her wig sitting on her lap, corroborating my story.  My mom converses with him for a minute, and he finally asks for my paperwork.  I give him my license, the registration and insurance for my mom's car, and my hand is shaking so badly I almost drop it. He said, \"alright, let me see what I can do for you.\"\n\nOne. Eternity. Later. \n\nIt was probably only 25-30 minutes, but since I'd never been pulled over before, I didn't realize how much paperwork goes into pulling someone over, and how much documentation you have to do before you can even return my paperwork.  He walks back up, and I've finally regained some composure.  He feels bad about my mom, understands the situation, appreciated my honesty, doesn't want to completely screw me, but also doesn't want this to ever happen again, so he took a while to figure out what to do with me. \n\nSo instead of citing me for speeding (4 points), careless driving (3 points), which would then have roughly $350-$400 in fines, plus a 90 day suspension on my junior license, he gave me a non-traffic citation of \"failure to obey a traffic control device\"  which was a total fine of $102.50 including all of the extra fees with zero points added to my license.  \n\nOf course, I started crying happy tears at this point, and thanked the officer, told him to stay safe, and went on my way.  My mom told me to make sure cruise control was on the next time we went to her chemo appointments. \n\n\n\nTl;dr. I was 17 and driving way too fast, but the officer felt bad for me because my mom had cancer and gave me a much smaller fine, saving me hundreds of dollars, a 90 day suspension on my license, and keeping my license points-free.\n\n\nedit, grammar/formatting.",
        "created_utc": 1522257372,
        "upvote_ratio": ""
    },
    {
        "title": "[Suspect] Really glad I listened to my police friend",
        "author": "EveRommel",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/87d1c6/suspect_really_glad_i_listened_to_my_police_friend/",
        "text": "I was out at the bar with a couple friends last week and near the end of the night one of my friends started acting weird. We thought she had just had a few too many so we were prepping to get an uber to take us home. \n\nWhile we were working out the logistics she bolted out the door and ran down the street. I took off after her and found her curled up in a store doorway. After an odd conversation, her boyfriend came up and we tried to get her to calm down, at one point she tried to bolt from us across a busy street and we had to physically stop her.\n\nAfter we got her calmed down we called an uber, something about us walking her to the car set her off again and I held her with all my strength, which led to her yelling and screaming to let her go and leave her be. The uber drive screamed from the car he was going to call the cops. \n\nThis is when I thought fast and as my buddy tried to chase her down, I got on the phone with 911 to give my side of the story. I was a 6'8 giant of a person physically restraining someone who did not want me to. The operator was helpful and hung up. \n\nWhen I saw the police car I immediately flagged it down with both of my hands clearly visible so that I could tell the story how it was actually happening vs the uber drivers story that we were kidnapping her.\n\nLuckily we found them sitting on a corner and were eventually able to take her home safely. \n\nI'm really glad I remembered to call the police to give my story before they rolled up on a giant chasing a panicking women.",
        "created_utc": 1522100904,
        "upvote_ratio": ""
    },
    {
        "title": "[Corrections] Memory Like a Goldfish",
        "author": "Muff_Huffer",
        "url": "https://www.reddit.com/r/TalesFromTheSquadCar/comments/87cjzr/corrections_memory_like_a_goldfish/",
        "text": "“It’s just BULLSHIT!”\n\nA loud swear jarred me from my paperwork at the intake desk. It was at that weird time in the shift when it’s either totally dead or totally nuts, and while nothing was going on (the “q” word comes to mind), I was still hustling because I had gotten my work off to a late start in the shift. My coworkers nearby barely even looked up, the vehement vulgarities usually spewed by new commits no longer provoking any kind of reaction. I lazily spun my chair to see the source of the noise. Standing by the rail was short, somewhat fat male, with a dirty, slightly bloody shirt, and a hulking officer keeping a tight grip on his cuffed wrists.\n\n“I live there, man! That’s such bullshit.”\n\nThe officer sat him down and moved to the desk to start on his paper. The man sat and sulked in the chair and pouted, swinging his feet back and forth like a child. Apart from the odd mumble (“…bullshit…lived there for a year…”) he remained quiet and still. The officer hardly paid him any mind as he prepped for the magistrate. I poked my head up and looked around at the rest of my area, and, seeing nothing else going on, I let the sergeant know that I was heading off to eat. \n\nLunch was a simple affair – leftovers, a cup of coffee, and a soft pretzel from the gas station up the road. After a good half-hour spent in my happy place, I cleaned up the mess I’d made, washed my hands, tucked my shirt back in, and headed back into the sally port. When the door popped open, I was greeted with our chubby arrestee from earlier, who had somehow wandered his way over to the entrance. Over his shoulder, I could see the officer who had brought him in craning his neck to shout around one of the columns that dotted Intake.\n\n“Hey man, what are you doing? Sit back down.” My new friend started to splutter and protest, but he was cut off by the angry officer. “No! Unh-uh. Siddown. Right now!” The drunk huffed and slowly made his way back to the seat and plopped himself down, muttering under his breath. I watched this and then quickly made my way back to post, where Sarge was covering my meal. I put down my coffee and my bag of snacks and turned back around, to see the pouting man-child stand back up again. I leaned towards the sergeant’s ear and muttered “Shouldn’t that guy be, like, attached to something?” \n\nSarge wordlessly got up and made her way over to the officer desk. “Hey, so your guy needs to be hooked to the rail. Right now.” Now it was the officer’s turn to splutter and argue. “I was just getting ready to take him back to the magistrate, he just-” Sarge put up a hand and cut him off. “Not with him wandering and carrying on. Hook him up, please.” The formality was added moreso to drive the point home than to be polite, and the officer produced his cuff key with an angry flourish. This was only met with more protests from the still-grumbling arrestee, who eventually gave up a wrist.\n\nAs I slid back down into my seat, I put him out of my head and started to pick up where I left off. As the minutes ticked by, I tuned out his complaints as they grew louder and more frequent. He continued to complain to no one in particular (“I lived there for a year! That’s bullshit! I need a nurse…”) as he waited to go back in front of the magistrate. He went and then came back, and was finally turned over to me. I received his paperwork, and looked up to find the officer smirking to himself as he packed up his stuff. He looked at me and chuckled. “Yeah, he’s got no bond. This genius cursed out the magistrate. Twice.” He grabbed his gear and gave a jaunty wave as he headed for the door, and I looked over my new charge for the evening. \n\nDespite the fact that he’d had at least a few hours to sober up, he still stood there, swaying like a small tree in a stiff breeze. I glanced at his paperwork and his charges – trespassing, first offense; public intoxication – and further down, sure as day, “held without bond.” He was still grumbling to himself about “trespassing” and “bullshit,” looking at his own feet. He looked at me with his dirt-smeared face, and asked, “Heeyyy bud, when do I go home? I need my medication. I just…the…only trespassing, so yeah.” I sighed and put the paperwork down. “You don’t have a bond, man. You’re here for the night.” The man looked crestfallen. \n\n“I don’t understand. It’s just…trespass? And how even the trespass, because I live there! For a whole year.” \n\nI shrugged. “That’s not my call. You have to take it up in court in the morning.” \n\nHe shook his head. “No way! I need to go home. I gotta take my klonopin.” \n\n“Take it up with the nurse,” I told him. “For now have a seat until they call you back up here to get processed.”\n\nHe grumbled and found a seat in the intake area, huffing and muttering under his breath. He remained there for some time, until it was time for him to be processed. The deputy handling his processing, Bryant, called his name to get his attention. “Perkins! Step up.”\n\nThere was a grunt and some motion before the drunk was able to extract himself from his seat. He begrudgingly walked up to the processing desk and slapped his paperwork down with a huff. \n\n“Hey, can Iaskyousommthin…” His words all ran together and his vision wobbled lazily in every direction but the deputy. “Can I just…I need to take my medication, I take…it’s klonopin…”\n\n“We know,” replied Bryant. “We have to do this first and then you can see the nurse.”\n\n“Okay, because I took it, and now…I had some drinks, but I take it! It’s klonopin. I need to take it already.”\n\nBryant stopped what she was doing. “So do you need to take it? Or you took it already?”\n\nPerkins the Drunk shook his head dismissively and began swaying back and forth again. “No. I take the klonopin and the drinks, so it’s got my head all…” He waved his hands in front of his face, attempting to convey his extraordinary, drug-enhanced level of inebriation. “It mess me up. But is 9:30 and I gotta take it every night nine thirty bed. Bedtime. Before bedtime.”\n\nBryant sighed. “Ok, well, it’s actually 11:45, but you need to tell all that to the nurse, okay? They can help you. Fill out this form first.” Bryant, amazingly, began to coax Perkins the Drunk through the necessary paperwork, with only a few deviations (“My address! I fuckin’ live there for a one year! How I can be trespass?!”). As soon as he was done, Bryant and I walked Perkins straight to the nurse.\n\n“Hey, you can tell the nurse about my klonopin? Because I already took it but again I need to.”\n\n“You can tell the nurse right now, man. Sit down right here.” I pushed his shoulder gently down, propelling him into a chair in the nurse station. The nurse turned her attention to Perkins, and we stepped out to let her question him in privacy. Only a few words made it through the cracked door (“Klonopin! Trespassing!”) and the nurse hastily finished her examination. She opened the door and gestured me to approach.\n\n“Yeah, he’s all kinds of messed up. Take him to the detox pod. He needs it.”\n\nI nodded in return. “Okay, we’ll get him right up there as soon as I put him in his jail clothes.”\n\nPerkins perked up again. “When I got to the pod, I get to take my medication?”\n\nThe nurse turned to Perkins. “Yes, Mr. Perkins, in the morning. Right now, you’re too intoxicated to take it.”\n\nPerkins began to splutter, but before he could form a coherent sentence, I grabbed his arm to put him in not-quite-a control hold and practically dragged him out of the nurse station, just to speed the process up. His unintelligible protests continued as I moved him into the area for him to change clothes. I quickly sized him for his clothing and handed him his new gear. “Here, put this on. Take off your other stuff and put it in the box.”\n\nPerkins slowly began to remove his shoes, before losing his balance and stumbling. “I’m sorry, man. I had some drinks, and I took my medication…”\n\n“Was it klonopin?” I jokingly asked.\n\nPerkins’ face lit up. “Yeah! I did! How’d you know my medicine?”\n\nI shook my head. “Lucky guess. Put these pants on.”\n\nPerkins continued to clumsily dress himself. “Yeah man, I took my klonopin and had some drinks, and now I feel it, like my head, I’m messed up, man. Hey, am I gonna go to the detox?”\n\nI nodded. “Yeah Perkins. I’m taking you to detox after this.”\n\n“Okay, good. Because then I can still get my the medication up there. Do they know about it?”\n\nI nodded again. “Yep. Put this shirt on.”\n\n“Okay, sure. Yeah man, I took my klonopin and had some drinks man, and now….now I…damnit!” One of Perkins’ flip flops had escaped his clutches, and he couldn’t quite put his foot back in it.\n\n“Now you’re really feeling it?” I asked.\n\n“Yeah, man. I’m messed up. Okay, I think I dressed myself all way finished. We can go.”\n\n“Okay man, let’s go.” I handed him his blanket and a mattress, and opened the door to take him to the detox pod. We began to walk (or stumble) down the hallway as Perkins mostly focused on keeping one foot in front of the other.\n\n“Man, Officer Deputy, I can’t really walk so good. Wait, what was your name again?”\n\n“Deputy Muff_Huffer.”\n\n“Yeah Officer Deputy Muff_Huffer, I’m messed up.”\n\n“Is it maybe because you drank and then took some klonopin?”\n\n“Yeah! Howdja know?”\n\nI just shook my head. We continued our slow shuffle down to the detox pod. We arrived and I opened the door for Perkins. “Okay, Perkins. Step in. You’re in cell 8.”\n\n“Okay office-umm Deputy. Hey, can I asked you something?”\n\n“Yeah bud. What’s up?”\n\n“Hey, will they bring my medication? In the morning.”\n\n“It’s klonopin, right? They’ll bring it.”\n\n“Okay, great. Hey, you know about that already! Cool!” \n\nPerkins turned to put his mattress down and laid down on it, not even throwing the blanket over himself. I shut the door, and I swore I heard a snore before I even turned the corner. I laughed to myself as I headed back to Intake, ready to meet the next inebriated miscreant. I knew it wouldn’t be too long before I had another one to deal with.\n",
        "created_utc": 1522097151,
        "upvote_ratio": ""
    }
]