[
    {
        "title": "My girlfriend handed a customer their food while the box was on fire",
        "author": "bwoodz552",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nwge3/my_girlfriend_handed_a_customer_their_food_while/",
        "text": "My girlfriend used to work in a Marcos, and on this specific night she was working the cash register as her station. A lady comes in to get her sub she ordered, so she takes her money and goes to get the food from the warmer. Now, somehow the receipt that was tucked into the box caught on fire in the warmer. We have some theories as to how this happened, but all in all we have no clue. Anyways, She can’t think of anything to do other than hand the box to the customer. At this point the box is already on fire and the customer freaks out and starts stomping out her sandwich. They immediately made her a new sub and my girlfriend would continue to be teased for the remainder of her time there.\n\nEdit: It’s just a funny story guys no need to be rude. The customer laughed it off and nobody was hurt. The managers actually replayed it several times on the cameras and they all had a good time with it.",
        "created_utc": 1515003243,
        "upvote_ratio": ""
    },
    {
        "title": "My Recent delivery job ( seasoned vet )",
        "author": "0nlyTruth",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nu0ow/my_recent_delivery_job_seasoned_vet/",
        "text": "So ive had delivery jobs on and off my whole life ever since high school, ive worked for pretty much every resturant in my local area and have had different compensations from good and bad.\n\n My first one when i was 18 got me to know my area pretty good. 7 resturants later i jus look at a ticket and go, no need for gps. its seccond nature by now. The worst job i had was for a company that let you use their fleet of cars and they paid for gas but thought that ment it was okay to pay you 20 dollars for a 10 hour shift plus your tips.. \nI made it a year and a half in that one before leaving to enjoy a summer with my savings.\n My current job has been a rollercoaster ride to say the least. A sushi place opened up in 2014 ( i live in long island ny ) and i became buddy buddy with the owner who is a pretty cool dude. I work from 11-9 with a 1 hour break from 3-4 because all sushi resturants like to close for a hour (chefs break) \n\ni always drove stick so it keeps the job pretty physical, But my boss is so chill that i dont even have to be there in between any deliverys. I live less then 5 minutes from the store so im pretty much a on call driver. When i get a text saying the letter D it means a delivery just came in, if i get a text R that means it just got ready and i need to step on it to dock at the store but im usually there before that, well why you wonder? because to my benefit and my misfortune, i am the only driver. My boss is too cheap to hire more then one driver, this means i am responsible for every single order that comes in throughout the day near or far. we take around a 4.5 mile radius but because i know my hood like the back of my hand i cut threw all the back streets, Avoid lights and get this shit done. i work in a very weathy neighborhood and usually deliver to mansions in the bay area and lots of residential houses, businesses, docters and the like but if i get into a accident, am feeling under the weather or god forbid broke a leg or some shit im fucked. My boss has tried other ppl and they cant  pull it off the way i do. I worked for 2 years straight eventually worked some 7 day weeks. I get paid $50 a day house pay and thats suppose to cover my gas and stuff.\n\n Sushi tips are for the most part better then pizza tips. In the past week i got 40 from 1 guy on new years and multiple 20 dollar tips, And 70 bux for delivering to a private jet company at JFK Airport, which was like 9 miles away and i had to sacrifice my break so they could get it done. The worst part about this line of work is you miss out on Life, you litterally live behind the wheel. Im my bosses right hand man and as much as i dont want to let him down, Im not struggling for money or anything. I trade the forex market on the side and invest in crypto currencies and during those 2 years i had a awsome clientel for 420, so i helped out alot of people. It got to the point where i was making more then double what i would make in a day from the sushi alone. One day in october 2016 i overslept and woke up to a bunch of pissed texts from my boss and decided to Quit. My hustle grew and i got to the point where i was banking like 500-1000 profit from that then caught a case when i jus made the wrong turn at the wrong time dec 29 2016. with something not stashed and a cop pulled me over for having a ipad mounted on my dash. I was riding w 2 other people and all 3 of us got arrested. my car is jus mad suspect to begin with, scion coupe, tinted windows, 18 inch rims, loud subs. Im never the type to smoke in my car ever and everything stays vaccume sealed always. 3 Grand to lawyer fees and a few months of draged out court dates but steered clear of probation or jailtime. So i consider myself lucky i guess? After laying low for a few months i burned threw alot of my savings. Although i got into a cool hobby racing drones and building them from scratch while i was on that year off from delivering. I discovered a new passion but its by no means a cheap hobby with plenty of expensive gear and components. In october 2017 i stop by the sushi place for the first time in a year and sit down just to eat, chat and catch up and see how the business was because i left on a bad note, even though i was having the time of my life. He said you ready to start driving again and as we were eating, i seen the chinese guy, my replacement, running in and out of the store and it brought back all the memorys of the job. So i said \"yea part time\" He only gave me one day a week so i was like whatever because what off the boat asian delivery guy wants to work less then 6 days a week. So i took him up on the offer and the next week the guy quit after working 9 months to take care of his kid or some shit. He was obviously looking for a ticket out and i was it.  So now i went from working 1 day back to 5 and its like i never left now. He is forced to close the resturant 1 day a week this winter which he has never done before to save on bills and payroll because the store hasnt been doing as good, probably because his other drivers throughout the year sucked balls and couldnt handle the pressure. Now im stuck in the same trap as a year ago. I had a taste of my dream career but it got snatched from me because im stuck in this loop again. Im not a big pothead but i know alot of them. I havent fliped anything since i got off with a slap on the wrist but i dont know if im going to fall back into that too. I dont really care about the money, its the free time i miss and 50 hours a week in the winter is really sending waves of thoughts threw my head. Snowstorms are just gonna get worse. The main point of my thread is after reading all this, If you are a delivery driver would you think i have it easy as a driver with this one? Would u switch in a heart beat or stay with yours?  I make 140-160 a day consistantly but at the expense of no life. Shifting all day 10 hours is taxing and sitting all day in my coupe just pools the fat. I was a avid gym goer now i jus get exhuasted after a days work. It was fun when i was younger but im 26 now and kinda want to get into something that doesnt involve wasting away in traffic all the time. My boss looked out for me when i met him in 2014 and was down and out but 3 years later im kinda ready for the next chapter of my life. I have a gf of 3 years that i met when i first got the job way back, i had 2017 to myself but got sticked with a full schedual now. 2-3 days a week i can handle but if he finds another asian dude they are gonna wanna work like 6-7 days a week and ill be shut out. Any advice or thoughts? Whats the most amount of hours you guys work and how do you not let it break you. i get 7 to 10 dollar tips all around locally.\n\nSushi orders are cold so time doesnt matter too much in that respect but if its sent with hot food it gets crazy because as the only driver sent with 3-4 deliveries at a time i get to pick the late one and the hood deliverys to far rockaway suck balls. They take 15 minutes to 20 to drive to and almost never get over a 5 dollar tip. Lucky to get 3 out there.. This is just my 2 cents rant from a guy whos not a newbie to this industry by any means. In between deliverys i get free time but not much sometimes its almost not worth it to leave the store but i do have the option.i feel like a on call EMT but for sushi.  I kinda dont know where 2018 will take me. if you read all this, thankyou just one drivers story to another man! I",
        "created_utc": 1514978096,
        "upvote_ratio": ""
    },
    {
        "title": "When you're delivering to an apartment building and there are police out front",
        "author": "reydelarudeza",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ntf5d/when_youre_delivering_to_an_apartment_building/",
        "text": "https://imgur.com/a/fdOEX",
        "created_utc": 1514968919,
        "upvote_ratio": ""
    },
    {
        "title": "Dumbest Complaints of New Years Eve Weekend 2017",
        "author": "idk_ijustgohard",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ns5v8/dumbest_complaints_of_new_years_eve_weekend_2017/",
        "text": "For some ambiance, the area I live is usually not colder than 40 degrees F even in the deep despair of winter. We get the arctic blast for. A good few weeks then back to normal programming. \n\nThis past week, its been below 20F in the middle of the day. Even with a three deck oven running all decks and our heating cranked up, we managed mayyyybe 68-69 inside temp this week when normally its a blazing 85-95F with just one deck running. \n\nMy personal favorite from a Carryout order and this is a direct quote from an email survey: \"I want my order replaced and I want my money back. I made a carryout order.  I saw the lady at the oven take it out and the manager gave it to me as soon as it was cut, but when I got home, it was cold. That is absolutely unacceptable and you need to turn your ovens higher. When can I expect my refund?\" \n\n\nAnother good one: \"The estimated quote time was 45 minutes and I waited an hour and a half and my pizza was way too dark\"  Mind you this was a customer who called to make sure the 90 minute delivery time was correct after receiving her confirmation. And made sure to say she wanted her pizza extra well done so the crust cracked when she bit it. It was a pan pizza. Cooked in BUTTER. (Or butter flavored brand specific products lol) \n\n",
        "created_utc": 1514952923,
        "upvote_ratio": ""
    },
    {
        "title": "Some Holiday Pizza Cheer",
        "author": "invisiblefirehunter",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7np8q8/some_holiday_pizza_cheer/",
        "text": "I hope this is the right subreddit! I know Christmas is over but I thought I'd share this story anyway.\nI work in a strip mall. Our store is on one end and a pizza place is on the other. On Christmas Eve, I asked my coworker to go check if the pizza place will be open as I wanted to buy pizza for lunch for our crew as a Christmas treat. It was open, so I asked my coworker to go order two mediums and I would pay and pick them up when they were ready. He comes back and tells me that not only did the pizza place upgrade them to larges but they paid for them as well. We were all pretty blown away at such a kind gesture. So a big thank you to that pizza place for making our Christmas Eve amazing :)",
        "created_utc": 1514925841,
        "upvote_ratio": ""
    },
    {
        "title": "Any Cali motorcycle delivery drivers here?",
        "author": "BlasphemicPuker",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nlhaa/any_cali_motorcycle_delivery_drivers_here/",
        "text": "Lost job but have some cash and wanna drive a motorcycle in the sun, so thinking to go to Cali and sign up for some pay per delivery job like GrubHub, lane split (its legal there) to make many more deliveries than a car could in San Fran (or wherever I end up) traffic. Wondering if anyone doing this is making a decent buck? Or should I just get a normal delivery job for some pizza place and drive a car and get paid by the hour?",
        "created_utc": 1514886046,
        "upvote_ratio": ""
    },
    {
        "title": "Lovely start to the year!",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nl0zf/lovely_start_to_the_year/",
        "text": "When the GM (slash only cook today) walks out just before 6pm without saying a word and won’t respond to calls or texts so we’ll know if he’s coming back... there were 3 screens like this. Note that the black background means **not made** and the top order was promised delivery within 65 minutes, but 82 minutes have already passed since the order was placed. Plus all the carry out and dine ins. \n\nTranslation? AHHHHHHHHHHH FUCK.\n\nhttps://i.imgur.com/qIQXFJG.jpg",
        "created_utc": 1514879037,
        "upvote_ratio": ""
    },
    {
        "title": "Justice for the pizza boys",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nkdjr/justice_for_the_pizza_boys/",
        "text": "[deleted]",
        "created_utc": 1514870246,
        "upvote_ratio": ""
    },
    {
        "title": "Here’s to 2018 in tips, cheers Reddit!",
        "author": "enzoronchi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nk5a5/heres_to_2018_in_tips_cheers_reddit/",
        "text": "$280 in a 12 hour shift for New Years Day. I fucking love this job. ",
        "created_utc": 1514867480,
        "upvote_ratio": ""
    },
    {
        "title": "Should I have called the cops.",
        "author": "crescentthedoge",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nk4xd/should_i_have_called_the_cops/",
        "text": "So I was working last night driving down a road on my way to a delivery when the vehicle in front of me pulled over to let me pass I figured the person was just lost. Four blocks further up was my delivery so I was out of the vehicle walking up to the sidewalk when said vehicle caught back up to me and what i thought was a cigeratt3 got thrown at me til it exploded.  Phone was in car charging as i didn't need it for the delivery so I didn't call the cops as by the time I got back to car person was long gone.\n\nTl;Dr Had a firecracker thrown at me while on a delivery. Should I have called non emergency",
        "created_utc": 1514867352,
        "upvote_ratio": ""
    },
    {
        "title": "Do credit card tips go to your paycheck?",
        "author": "DianiTheOtter",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nhk4z/do_credit_card_tips_go_to_your_paycheck/",
        "text": "Always been kinda curious about that.",
        "created_utc": 1514840255,
        "upvote_ratio": ""
    },
    {
        "title": "How physically demanding is the delivery job?",
        "author": "DQEight",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nbnj6/how_physically_demanding_is_the_delivery_job/",
        "text": "Been whipped by life recently (pneumonia, hospitalization, lost my job) and now I have medical bills, auto insurance and other things I can't fathom how I'll afford. I'm still feeling awful and I think the pneumonia  in my lungs is back. I can drive but I'm worried about the other demands of the job.\n\nWhat are the other physical demands I'm overlooking? So far there is actually bringing the food to the door, stairs, in store stuff like sweeping.",
        "created_utc": 1514761504,
        "upvote_ratio": ""
    },
    {
        "title": "CONSTANT VIGILANCE",
        "author": "iftreescouldspeak",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7nakdj/constant_vigilance/",
        "text": "Wishing all you guys luck who have to deliver on new years eve. Be on the extra defense for drunk drivers. ",
        "created_utc": 1514749815,
        "upvote_ratio": ""
    },
    {
        "title": "Do y'all do any stretches or anything before/after a shift?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7naeyf/do_yall_do_any_stretches_or_anything_beforeafter/",
        "text": "[deleted]",
        "created_utc": 1514748285,
        "upvote_ratio": ""
    },
    {
        "title": "I had thirteen delivers today in two hours, between 2 and 4, they were my only deliveries",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n6gir/i_had_thirteen_delivers_today_in_two_hours/",
        "text": "[deleted]",
        "created_utc": 1514693909,
        "upvote_ratio": ""
    },
    {
        "title": "Oh the joys of delivering pizza in a decommissioned Crown Vic",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n5030/oh_the_joys_of_delivering_pizza_in_a/",
        "text": "The other night I was driving along and some guy starts driving really slow when he's near me. That's not much of a new thing; it's what I get for driving without a car topper. (Sometimes though if I'm lucky people will get out of the lane I'm in en mass and I'm free too defy estimated delivery times, so IMO it's worth it). This guy's doing the usual stuff: he's driving a good 5-10 under the posted speed limit, he's stopping nearly a full car length before the front of the intersection so that he doesn't come face to face with me, and he's generally driving very nervous-like. After about the third intersection this guy cracks his window a bit, hurls what looked like a sandwich bag stuffed full of weed out his window, and then cut across two lanes to make an unprotected left turn and get away from me as fast as his little base model civic could take him. I had to pull over because I was laughing so hard. Poor dude. Weed becomes legal here in like two days.",
        "created_utc": 1514677563,
        "upvote_ratio": ""
    },
    {
        "title": "Serial stiffer complained because I refused to have conversation with him",
        "author": "Issued4Approval",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n4fw7/serial_stiffer_complained_because_i_refused_to/",
        "text": "I believe this was my 4th time delivering to this guy. It wasn't until after the 3rd time that I realized this guy always stiffed me. He is a very talkative guy and I always have brief conversation with him. He'll ask how my night is going, traffic conditions, if we're busy, sports, local news, etc. This last time I delivered I gave my usual friendly greeting, asked how his night is going, etc. before I hand him the receipt to sign. I immediately see the motion of the pen of him writing a '0' then slide the pen downward while he begins telling me about his day. I never see what the customers write on the receipt until I get back to my car, but I couldn't resist with this guy. I was deciding if it was worth my time to stay an extra minute or two to chat with the guy. But once I saw that my mood changed and I just responded to this guy with a bunch of one word responses; \"Yes, no, ok, probably.\" \n\nHe immediately noticed and asked if I'm alright. \"I'm fine. Have a good one\" I tell him. Then I walk back to my car. I didn't want to spend one more second than I had to with this guy. Then he asks for my name. I knew what that meant and I expected for the manager to have a word with me once I got back. Apparently I was being rude. Haha, I guess that's open for interpretation. Maybe I was an asshole but I don't care. I told the manager exactly what happened and he just simply told me to be a little more friendly to the customers.\n\n",
        "created_utc": 1514671733,
        "upvote_ratio": ""
    },
    {
        "title": "Are the roads bad?",
        "author": "euphoricentropy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n4884/are_the_roads_bad/",
        "text": "No, not at all! It's only been snowing for 7 days straight, and your unshoveled driveway only has about 3 ft of accumulation (Thank God for 4wd), but that 30 seconds that the sun was out today, totally melted and dried all of it.\n\n\nI hate that fucking question ",
        "created_utc": 1514669581,
        "upvote_ratio": ""
    },
    {
        "title": "I deliver pizza and cater for a restaurant and lemme tell you.... those catering tips are off the hook.",
        "author": "IEATTURANTULAS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n2uds/i_deliver_pizza_and_cater_for_a_restaurant_and/",
        "text": "$190 tip from a $1250 order yesterday. I split it with a few people that helped so I kept $80. It's not required at all but I'm pretty new so I want to be on everyone's good side. I delivered pizza for 9 years before starting big catering deliveries and it is so refreshing. Try it out if pizza delivery is burning you out. Way less deliveries but you get paid way more hourly and you get those fat tips.",
        "created_utc": 1514655789,
        "upvote_ratio": ""
    },
    {
        "title": "Is this common?",
        "author": "BornToGetCucked",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7n15ba/is_this_common/",
        "text": "I work for a place we shall call \"Schmizza Schmut\", lately my manager has told me to not bother answering the phones after 10pm because \"they can either use the website or call the main call center since we're busy\", to be fair, it's just me(the main cook) and him, and we usually stay late since we are busy up until around 11:30pm. but what I'm wondering is, how common is this and can I get in trouble if it's someone important(like an rgm or the main store manager) calling and we don't answer? Any feedback is greatly appreciated.",
        "created_utc": 1514633846,
        "upvote_ratio": ""
    },
    {
        "title": "A story of an odd order made last night.",
        "author": "BreakdanceMacabre",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mzw8b/a_story_of_an_odd_order_made_last_night/",
        "text": "Reposting from /r/TalesFromFastFood at another user's suggestion; this happened last night shortly before closing.\n\nSo a guy calls in and says he wants to order for carry out, and asks if we had any specials going. I reel off the specials, including one large pizza plus *rather a lot of toppings*. He says \"Yeah, I'll take that. Let me get pepperoni, ground beef, bacon, sausage, and...I dunno...\"\n\nI ask \"Do you want a meat lover's? You're basically there, except for the ham.\"\n\n\"**NO!** No ham,\" he says. \"Can't eat the stuff; Jewish.\"\n\nNow. Normally, this is the kind of stuff I just filter out through the Customer Service filter, and don't pursue, but it caught me so off guard that I reacted like a person rather than a calorie dispenser drone. I said \"Okay, but you know, the pepperoni, sausage, and bacon, they're all made from pork, right?\"\n\nHe said \"Yeah, yeah, I know, but I like them enough I'm willing to cheat. Ham isn't worth feeling guilty over. So no ham. So, I'll just take the pizza with four toppings.\"\n\nNow I'm tempted to explain that this is functionally the same as saying 'I don't like ham', only using more words and giving me a ringside seat to his crisis of faith, but Customer Service filter has kicked back in. So I collected myself, said \"Alright!\", gave him the price and told him we'd have it ready it in 15 minutes or so. 13 minutes later on the dot, he comes in, we have his pizza ready, he pays and comments on us having it ready early, and puts a couple bills in the tip jar. And goes off into the night, the least observant Jewish dude in the world.\n\nI'll note again as I did in my first post, if you ever read this, Semite-bro, know that I don't judge you. I put extra bacon on your pie and I hope you enjoyed it enough that it was worth the tip.",
        "created_utc": 1514612691,
        "upvote_ratio": ""
    },
    {
        "title": "My pizza place has made our delivery area smaller. I went from 50 dollar tips to barely making 15 dollars.",
        "author": "Sonicomegaz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7myn9d/my_pizza_place_has_made_our_delivery_area_smaller/",
        "text": "I now do about 10 orders and 8 stiffs a night. I’m really depressed. I see people asking for the hourly rate. It’s 5.07 lol",
        "created_utc": 1514597645,
        "upvote_ratio": ""
    },
    {
        "title": "How much is too much to ask of the delivery guy?",
        "author": "jjmeadowlark",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7my2zr/how_much_is_too_much_to_ask_of_the_delivery_guy/",
        "text": "So my car's in the shop, and I was hungry and thirsty.. I ordered a pizza from my local regional spot, and asked that the driver stop an pick up a quart of beer for me (I did ask for no malt liquor, just beer- no brand specified).. Said I'd tip $15 when I placed the order...  \n\nI'm way, way way way over 21, been ordering from the same place since forever (think twenty years), and always tipped well.\n\nPizza guy shows up super quick (since I'm on the 'nice' list and always get my food super fast and piping hot), and with delicious food in hand, but when I ask him where my beer is, he tells me the last dude to do that got caught and was fired, etc, etc.\n\nStill tipped $5.\n\nI assume because I'm always a pretty good tipper, I get my food first, and jeebus, I've been ordering from this place long enough that even if I was ten years old when I placed my first order, I'd be at least thirty years old by now.\n\nMaybe I'm too full of assumptions, but I figure a quart of beer costs two bucks tops, so the prospect of a twelve dollar tip on top of the customary pizza tip net of beer cost would be incentive enough to drop $1.69 on a quart of Miller High Life and five minutes out of your way on the delivery.\n\nWas I out of line?  \n\n\n",
        "created_utc": 1514591816,
        "upvote_ratio": ""
    },
    {
        "title": "Work place drama. Need some advice.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mqims/work_place_drama_need_some_advice/",
        "text": "[deleted]",
        "created_utc": 1514505460,
        "upvote_ratio": ""
    },
    {
        "title": "Gift card as a tip?",
        "author": "JediMattawan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7moo2d/gift_card_as_a_tip/",
        "text": "I’m about to order pizza and I have a $25 Starbucks giftcard I’d never use and I’m considering offering it as a tip to the pizza guy, and I’m just wondering if it would be offensive to them?  Thoughts? ",
        "created_utc": 1514488307,
        "upvote_ratio": ""
    },
    {
        "title": "Why are customers so surprised when I hand them the drinks they order?",
        "author": "enzoronchi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mo0kd/why_are_customers_so_surprised_when_i_hand_them/",
        "text": "I think it’s the funniest shit. It’s like they act like it’s a free complementary to their order. Every time I get to a house and a customer gets let’s say, a large pizza, 20 wings, and a 2-liter drink, I’ll hand them the food first, and then once I hand them the drink, they get so excited like “shit nice thank you!” I don’t know if this happens to any of you guys, but it’s primary thing in my area. God, I love this job. ",
        "created_utc": 1514482521,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good tip for hotel delivery?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mk0ti/what_is_a_good_tip_for_hotel_delivery/",
        "text": "[deleted]",
        "created_utc": 1514431526,
        "upvote_ratio": ""
    },
    {
        "title": "Why do customers get so offended when I tell them I need them to pay for their order before I give it to them?",
        "author": "GreatNoodlyAppendage",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mjo6a/why_do_customers_get_so_offended_when_i_tell_them/",
        "text": "I had a guy cuss me out and stiff me because I had the audacity to ask for his cash before I gave him his food. I’d rather not take the risk of having to call the police on a customer again. It’s too much of a hassle. ",
        "created_utc": 1514427655,
        "upvote_ratio": ""
    },
    {
        "title": "Your worst tip ever?",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7miurd/your_worst_tip_ever/",
        "text": "Stiffs don't count and the tip has to be over a dollar but extremely disproportionate for your order (ex $1 on a 50 dollar order)",
        "created_utc": 1514419018,
        "upvote_ratio": ""
    },
    {
        "title": "How2get FREE ANY LARGE PIZZA from PizzaHut",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mbula/how2get_free_any_large_pizza_from_pizzahut/",
        "text": "[removed]",
        "created_utc": 1514337918,
        "upvote_ratio": ""
    },
    {
        "title": "A \"Great\" Tip!",
        "author": "RiotPolizei",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7mb3vf/a_great_tip/",
        "text": "So here's a new one to me. This did happen a month ago, but I still found it funny enough to share with you guys.\n\nIn Jimmy John's, orders paid by card are sent out with an additional credit slip that must be signed. The top of the slip gives order summary, total price, and then the three lines beneath it are for the tip (gratuity), new total (previous total + tip), and signature. Easy, right?\n\n[Well, sometimes, we get special customers like this one.](https://imgur.com/a/uQW5o)\n\nI suppose my \"tip\" was knowing that I did a great job delivering to this kid at his school, lmao! It makes me wonder if I did better or worse than my coworker, who received an \"awesome\" on the tip line...",
        "created_utc": 1514330013,
        "upvote_ratio": ""
    },
    {
        "title": "How to get away with tipping less",
        "author": "New_To_NAVY",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m65u3/how_to_get_away_with_tipping_less/",
        "text": "https://imgur.com/a/lNr2E\n\nThe first time I just thought he’s bad at math. But 3 times??? Why do me like that man. ",
        "created_utc": 1514268523,
        "upvote_ratio": ""
    },
    {
        "title": "When you check the customer feedback, and they gave you 1 star out of 5, because it took more than 30 minutes to get to their door.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m65o1/when_you_check_the_customer_feedback_and_they/",
        "text": "[deleted]",
        "created_utc": 1514268474,
        "upvote_ratio": ""
    },
    {
        "title": "I wasn't feeling well so didn't post this till today but I love this job during the holidays",
        "author": "SuperPants87",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m5joe/i_wasnt_feeling_well_so_didnt_post_this_till/",
        "text": "Had a regular customer come in and give us $100 to split among everyone. We had 12ish people who worked that day, so we split it among everyone. I really like our regulars who we talk to like old friends.",
        "created_utc": 1514260471,
        "upvote_ratio": ""
    },
    {
        "title": "After 6 Months, most of those being 70 ish hour a week stints, my time as a delivery driver has come to a close....",
        "author": "Prius_For_Life",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m4uoc/after_6_months_most_of_those_being_70_ish_hour_a/",
        "text": "It's been real and it's been fun, but it hasn't been real fun...as my co worker would say.\n\nIn all seriousness it has been fun, I've grown to know a lot of great people, I've become the top person in my store (well from a driver standpoint anyway) and I've made a lot of money in the process.\n\nI'm not leaving though, I've done such a good job that i'm being promoted to shift runner and i'm only driving one day a week now. Running shifts is fun too, my team seems to enjoy it when I run shifts. It kills me not having money at the end of the night though.\n\nHas anyone else went from driver to shift runner? How long did it take you to adjust? Or did you never adjust fully and went back to being a driver? \n",
        "created_utc": 1514251466,
        "upvote_ratio": ""
    },
    {
        "title": "I’d like to vent about a big order I took to Target.",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m42tj/id_like_to_vent_about_a_big_order_i_took_to_target/",
        "text": "It was a timed order for 12:00. I get there around 11:45 and call the lady to ask where I’m meeting. No answer. Call her like 10 times, before she answers at 12:00. She tells me to bring it in the customer service area and leave it there. 4 huge bags filled with heavy pizza. \n\nKeep in mind, it’s Friday and busy as fuck with a ton of holiday shoppers. I lug these bags in and the customer service worker has NO IDEA what the pizzas are for. I literally stand around for 20-25 minutes looking like an idiot waiting for them to figure out what to do with it. Literally, standing there. Finally they get ahold of the lady (corporate) and she says it’s for the staff. She probably should’ve let them know ahead of time, just sayin... The one lady was about to just sign the thing and ONLY sign it. I’m like oh fuck that, and she ends up calling the original corporate lady and I get a 30$ tip. \n\nI hate to complain about this stuff but this shit infuriates me to no ends.",
        "created_utc": 1514241873,
        "upvote_ratio": ""
    },
    {
        "title": "I got stiffed 4 times on Christmas Eve.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7m293z/i_got_stiffed_4_times_on_christmas_eve/",
        "text": "[deleted]",
        "created_utc": 1514220597,
        "upvote_ratio": ""
    },
    {
        "title": "Customer asked for exact change and to deliver to his locked dorm, but a little instant karma ensued afterwards",
        "author": "FlightOfBrian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lzvss/customer_asked_for_exact_change_and_to_deliver_to/",
        "text": "So this happened a little over a year ago in September 2016 during my senior year of college. I picked up a delivery job to finance a big purchase I was about to make, but ended up enjoying delivering so much I worked a couple different delivery jobs from then up until last month when I got a full time job. This is story is simultaneously why I loved and hated delivering.\n\nIt was about 12am on a college campus and someone put in an order for a pizza that totaled out to be $12.86. As per usual, when I got to about a minute away from his dorm I called him and said \"Hi this is Pizza Place! You live in Dorm? Can you meet me out by the front door?\"\n\nInstead of the normal, drunken \"yesss I'll be right down\" that Friday nights usually handed me, this kid went \"umm, I'm in room 315. Just knock and I'll come out.\" His tone sort of rubbed me the wrong way, but I was delivering to a mostly freshman dorm so this could've very well have been this kids first time ever ordering food. So I calmly said \"unfortunately delivery drivers don't have swipe access into the dorm buildings so we have to meet outside.\" Then instead of an understanding reply, he goes \"fine, I guess I can meet you.\" I really wanted to tell him he literally couldn't eat if he didn't meet me outside, but I just said okay!\n\nFast forward 30 seconds, I pull up to the main entrance, wait like 5 minutes, and finally I see the customer walk down the stairs. So I start to get out of my car to walk up to him, and instead of coming part way to me or even just waiting for me to walk to him, he waves at me to come over to the door he's holding open with his foot. Once again, kind of rude, but it's okay. So I walk up to him, and ask for his name just for safety purposes. He gives me the right name so I go \"that'll be $12.86!\" He hands me $15 and I ask him \"do you want change?\" implying that he's hopefully at least giving me a $2.14 tip.\n\nHis response baffled me. \"Um yeah, it's only $12.86, I gave you $15.\" I kind of had it a bit so I just went \"I didn't know if you wanted to leave a tip or not.\" So I handed him two singles back because I didn't have 14 cents on me, and I just hoped he wouldn't comment on that. BUT HE QUICKLY GOES \"where is the rest?\" So I have to tell him how drivers don't carry coins on them and deliveries typically round up to the nearest dollar, which isn't technically true but is at least some sort of etiquette/tip. So he goes \"okay fine you can keep that\" and I respond with a very sarcastic \"thanks for that bud!\"\n\nSo I walk back to my car that's 20 feet away as the kid is fumbling trying to hold the pizza while put his $2 back in his pocket, and as I'm getting in my car I see his foot slip slightly and the door closes with him outside. I don't know exactly how he managed this graceful maneuver but he ended up getting locked out of the building (you need your student ID to swipe into your dorm at the school) without his ID and presumably his phone, because I watched him bang on the locked door as I was driving away. I still felt horrible laughing, but as I reflected on it for the rest of the night, I felt less and less bad.",
        "created_utc": 1514181045,
        "upvote_ratio": ""
    },
    {
        "title": "Guys I need help.",
        "author": "WhiteKoala__",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lwt26/guys_i_need_help/",
        "text": "Hey dudes, I got a job at this really dirty looking pizza place as a driver and I took the job. He said I can work for now and see how it goes and If I want to work in the future I can. I get paid $2.50 per delivery+tips. There is not flat hour rate or anything so if I get no deliveries I just wasted my time. This place just feels uncomfortable but I can tolerate it as long as I make good money. I'm 17 so this is probably the only place that will hire someone at my age. He said I'll get paid cash at night. I don't know if I should work here or not, any thoughts?",
        "created_utc": 1514141943,
        "upvote_ratio": ""
    },
    {
        "title": "What are some dead giveaways that you are about to get stiffed?",
        "author": "hrrrrforce1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ltapb/what_are_some_dead_giveaways_that_you_are_about/",
        "text": "I deliver around the Baltimore area and I’ve picked up a few indicators that let me now I’ll be leaving with no tip. Luxury car in the driveway, empty shopping carts around the neighborhood, super long time to answer the door.....what are your indicators?",
        "created_utc": 1514090375,
        "upvote_ratio": ""
    },
    {
        "title": "Turned a stiff into a $10 tip",
        "author": "sweetiejam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lt1ds/turned_a_stiff_into_a_10_tip/",
        "text": "So I'm taking a $60ish order to the \"eh\" side of town(not really in the bad area, but not great either), which includes a three 2-liter drinks and enough pizza/sides to make the bag super awkward to hold with them, especially with my weak baby arms. I hand him the receipt to sign, don't look til I get into the car(dumb, I know) and realize he completely ignore the tip/total lines. Stared at it and thought \"fuck it, I got nothing to lose\", went back, knocked and said I needed everything signed.\n\nHe was just like \"oh\" and returned it to me with a $10 on it. Dunno if he was playing dumb or legit didn't realize he could tip with his card, but super glad I decided to give it a shot and go back. \n\nAnyone else have a similar experience with turning a no-tip around?",
        "created_utc": 1514086900,
        "upvote_ratio": ""
    },
    {
        "title": "Random citizen sent 2 sheet pizzas and a catering salad to the police station and fire department",
        "author": "Generic_Cleric",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lsqw8/random_citizen_sent_2_sheet_pizzas_and_a_catering/",
        "text": "Did it anonymously as a holiday treat.  They were surprised and pleased.  They didn't tip.  The lady who called out in didn't put a tip on the order.  2 deliveries,  over $120 in food. No tip.  ",
        "created_utc": 1514083059,
        "upvote_ratio": ""
    },
    {
        "title": "\"You ever seen a glowing cloud?\"",
        "author": "theplaneflyingasian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lruaf/you_ever_seen_a_glowing_cloud/",
        "text": "If any of you were working a driving shift in Southern California around 5:30 PM last night, you may or may not have seen the falcon nine space X rocket launch, and the glowing contrails that came along with it. \n\nI saw this in the sky driving to one of my deliveries, I had no idea what I was looking at so I immediately pulled over and snap a few pictures. Got back in my car, decided I had more important things to be doing than looking at this unexplainable cloud in the sky. \n\nPulled up to my delivery address no more than two or three minutes later, and this crazy cloud was still there. I have obviously never seen anything like this, and it was seriously blowing my mind at the time, I couldn't help myself.\n\nI had to. I couldn't stop myself. Mid transaction with this guy, I nonchalantly ask him, \"have you ever seen a glowing cloud before?\" He looks up at the sky and can't see anything, I point for him to come over a little farther, he immediately sees it and doesn't seem to have nearly as much interest in it as I did. Whatever. I was stoked! \n\nA few deliveries later, I hear them explain on the radio what it was, it was nice to have a valid explanation of what I saw. I wish they had given everyone a heads up as to when they would be launching a rocket, it seems to have freaked some people out. I just wish they gave me a heads up so I could have taken better pictures and not been driving around so distracted. 😉",
        "created_utc": 1514072032,
        "upvote_ratio": ""
    },
    {
        "title": "I delivered to a highly religious lady today.",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7loa34/i_delivered_to_a_highly_religious_lady_today/",
        "text": "She’s a regular. Orders quite often and she always gives a few dollars with one of those repent cards with the burning cross to save you from Hell.\n\nAnyways, today she decided to put me on the spot and ask me if I am religious. She asked me “Are you ready for Jesus 2nd coming?” And other religious questions. She fucking put me on the spot! I am in no way religious and don’t believe in any of that. I said yes to all her questions, as I did not want to hear the whole spiel about why not and blah blah blah. It was quite awkward. I left quickly praying (ha!) that she wouldn’t ask me to go to her church.",
        "created_utc": 1514030190,
        "upvote_ratio": ""
    },
    {
        "title": "Robbed on delivery",
        "author": "Waffles_and_Waffles",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lnh45/robbed_on_delivery/",
        "text": "I’m sure this is no new thing to most delivery drivers. But tonight I was robbed for the first time and it left me feeling very vulnerable and violated. What are some coping methods or things I can do to make myself feel safer on the job?",
        "created_utc": 1514015460,
        "upvote_ratio": ""
    },
    {
        "title": "I may have worked for the mafia (or at least drug dealers)",
        "author": "struggleworm",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7llki7/i_may_have_worked_for_the_mafia_or_at_least_drug/",
        "text": "Before I worked at round table I worked at this local Sicilian family owned pizzeria. It was the boss and his wife and three guys who sat around doing nothing all day because there were never that many customers. Me and this other guy did everything else but they just sat around talking. Three reasons together make me think they were mafia or at least drug dealers.\n1. One day one some random cousin visits (about 17 or 18 years old) and he's dressed nice and drives a nice car and offers me and my buddy some coke. He lined us up in the storage room and it was the best I had ever had. \n\n2. Me and my buddy tried stealing alcohol by putting it in the trash and taking it to the dumpster. That night we climb the wall to the back walled area where the dumpsters were. When we got to the parking lot the family roles up with their lights off and comes out with weapons (baseball bats and pipes. No guns that I could see). First off this was the mid-80s I don't even know if there motion sensors but if they were they were expensive. We never understood why the alarm went to their house and not the police and why did they even have a dumpster area alarmed? Anyway they didn't fire us and they didn't make a big deal out of it it went back to normal.\n\n3. They made their dough and put them in these little tin bowls with matching lids. they were big enough to make a large pizza which they put in the walk-in for the night and used the next day. One day this guy walks in with a briefcase. My boss comes out and greet him with about five or six of these tin things. They don't go back to his office which just had one of those swinging doors with windows on them and no lock. They went to the men's restroom instead. About 20 minutes later they both walk out but the man is now carrying the tin bowls and my boss has the briefcase. They said good bye and he left. My gut is the tins were full of coke and the case was full of money. No proof though but it was shady whatever happened. ",
        "created_utc": 1513990272,
        "upvote_ratio": ""
    },
    {
        "title": "Served gutter toppings, ate slices, and sexed my manager.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7llc03/served_gutter_toppings_ate_slices_and_sexed_my/",
        "text": "[deleted]",
        "created_utc": 1513987748,
        "upvote_ratio": ""
    },
    {
        "title": "Your suite number is not your address",
        "author": "duhyangster247",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lggn8/your_suite_number_is_not_your_address/",
        "text": "Wednesday night, I was out on a run with 3 pizzas for 202 W 7th Ave. I get there and it's a construction site that appears to be empty. My mind tells me \"customer put down the wrong address.\" I call the number to ask if the address is correct. Kid picks up and assures me his address is correct. I ask him what is the nearest intersecting street to him. The street he tells me is 1.5 km away. I ask him to outside and tell me the 3 or 4 digit number on the front of the building. So the actual address was 960 W 7th Ave #202 which 5 min from my store. Needless to say, my run time ended up being 30+ min when I could've been there and back in 10-15 min.",
        "created_utc": 1513935611,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have to open or close at your store? (as a driver)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lgeli/do_you_have_to_open_or_close_at_your_store_as_a/",
        "text": "[deleted]",
        "created_utc": 1513934779,
        "upvote_ratio": ""
    },
    {
        "title": "Had a driver get into an accident, had to rescue 25 pizzas",
        "author": "tris2662",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lfq39/had_a_driver_get_into_an_accident_had_to_rescue/",
        "text": "Happened a few weeks ago during the Friday rush. A large order came in for what seemed like a school trip or some sort of large retreat for students at the local Holiday Inn. 25 lovely pizzas all warm and ready to go are sent off with one of the drivers, who I assumed was really lucky for getting such a pricey order ($400).\n\nFast forward 5 minutes from when he left, the store gets a call. Its the driver saying he got into a car accident at a busy intersection a block away. So they send me off to go collect the pizzas from his car and get them to the hotel as ASAP as possible. I assume it was going to be a small fender bender on the side of the road. Nope. it was right in the middle with two cars face to face with crushed hoods.\n\nThe first problem came when I had to figure out how I was going to get to the other delivery car. It was around 5 pm on two main roads so traffic was serious right now (for a small town). So I drive down the road from the scene and whip around and stop, blocking an unusable lane. I run out and meet up with the other driver and he just starts taking all the bags out of his car and putting them on his roof and trunk while I try to keep up with trying to move the bags back to my car. This was sketchy seeing that it still running as an active intersection with cars still zipping by. After about 10 minutes of darting back and forth, almost getting hit, and looking both ways I managed to fit all the bags into my car and I get out of there.\n\nAfter feeling like a Tetris god for the whole ride I get to the hotel and the teachers were not exactly impressed with the delivery time, I apologize and say that there was a car accident near the restaurant. They kind of shrug it off as whatever, and they tell me just to put the pizzas down on a table in a conference room filled with hungry middle school students. That's when we find out that all the pizzas had been crushed into the side when every single bag fell forward during the accident. Except for the vegan pizza which survived, possibly due to a lack of cheesy goodness. The teachers immediately ask why they are like this and I tell them the entire scenario (which I should have done in the beginning in hindsight).\n\nI call my manager about a discount which was already at 20% off for an increase which ended up being 30% off. The teachers complained as the discount did not seem to reflect the pizzas but they did not want to cause any more problems. After paying $280 for 25 smooshed, late, and lukewarm pizzas I was lucky to receive the $10 tip for the troubles getting there. Long Night.\n\nTLDR, Coworker got into a fender bender, and I had to collect 25 visibly damaged and lukewarm pizzas from the accident and take them to a hotel for some school.\n\nOne of my friends happened to be there too and got a quick picture of the accident. https://i.imgur.com/jjko4Jq.png",
        "created_utc": 1513924703,
        "upvote_ratio": ""
    },
    {
        "title": "Had a delivery driver get into a car accident. Had to go save what remained of the pizzas, Operation Ripperoni is a go.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lfokr/had_a_delivery_driver_get_into_a_car_accident_had/",
        "text": "[deleted]",
        "created_utc": 1513924104,
        "upvote_ratio": ""
    },
    {
        "title": "SWAT team Encounter on Delivery",
        "author": "zT1TzbaT",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lfbyy/swat_team_encounter_on_delivery/",
        "text": "This was my best story from my time as a delivery driver from Pizza Slut. I posted it at /r/AskReddit and somebody recommended that I post it here, so here you are!\n\nI used to deliver pizzas for a Pizza Hut in East Phoenix years ago. There was one neighborhood we delivered to that was, simply put, a shitty crime-riddled neighborhood (Between Broadway and Southern, 20th-28th St, for those local). I think the area was initially conceptualized as a decent suburban neighborhood, but something went wrong and it's now a shady place where they gut out the suburban houses and divide them up into 3-4 apartment buildings.\n\nOne day, I had a delivery to take to a house in this neighborhood and I wasn't happy about it. So I'm driving over there grumbling and when I see the street in the distance, I notice two police cars parked on the sidewalk just in front of the street. My first thought was \"Police in this neighborhood. What a surprise! Not!\" When I got closer, I saw that they weren't parked on the sidewalk, they were blocking off the street. As I drove up to the police car barricade, I saw five or six more police cars, at least 40 patrol officers and a SWAT van all in the area. I parked my truck behind one of the barricade police cars and walked up to the sidewalk with my order. A patrol officer saw me (Pizza Hut attire and delivery in hand) and approached me.\n\nCop: Can I help you?\n\nMe: (relieved that I probably won't have to make this delivery) I'm not going to be able to get through, am I?\n\nCop: No, no. We can walk you to where you need to go. What's the address?\n\nMe: (I read the address off the receipt)\n\nCop: (grins) It wouldn't happen to be apartment #1, would it?\n\nMe: No, it's #2.\n\nCop: Oh, ok. Well, come this way.\n\nHe walks me through the blocked off area at a leisurely pace while everybody starts collectively murmuring \"Is that a fucking pizza guy? Apt#2 ordered a pizza? Are you fucking serious?\". We walk by a group of armed SWAT team members who slowly stop talking and stare at me. The patrol officer, never one to disappoint the SWAT team, stops and says \"Apparently, #2 ordered a pizza.\" The SWAT team guys all smirk at each other (as best as SWAT members can, anyway) and one of the taller ones ask me, \"Can you stand over here for a minute?\" I'm expecting to be searched, until the tall guy pulls out a digital camera and some short ball of muscle with what looked like an M32 (filled with gas cans?) stood to my left. \"Look over here and smile.\" I immediately grinned and held up the pizza pouch and Mountain Dew 2 liter in a melodramatic way. The tall guy snaps the picture, and tells me \"It's his [the short demoman guy] last day on the team. That's why we have the camera.\"\n\nThe patrol officer walks me over to the crappy little house and asks a young woman with three or four toddlers and eight cops surrounding her, \"Somebody order a pizza?\" She responds \"Oh god, yes!\" and runs over to fill out the credit card receipt, while asking me if the cops hurt me or searched me,etc.\n\nAfter not tipping me, I gave her the order, the patrol officer led me back to my truck, we thanked each other and I drove back to the store, laughing like a maniac.\n\nTL;DR I delivered a pizza to a building that had just been raided by a SWAT team. I ended up on a picture in some tough guy's retirement slideshow and didn't get tipped.\n",
        "created_utc": 1513919726,
        "upvote_ratio": ""
    },
    {
        "title": "I ran my first shift tonight!",
        "author": "Driddle07",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7leyxf/i_ran_my_first_shift_tonight/",
        "text": "and I was fucking awesome! I'm at the moment a driver but working on training for a promotion to assistant manager. I've been making sure to communicate with alot of my team and seeing why morale has been so crappy lately. \n\nThe biggest complaint I got was not enough people did their jobs. just standing around doing nothing. there wasn't a single person standing around this evening during dinner rush. everyone had something to do at all times or I found them something to do quite quickly that played to their strengths and knowledge of training. \n\nthe few drivers I had on shift who know make line were directed onto make line to help clear the screen between deliveries. my drivers who don't know make line where on cut table getting pizzas out of the oven. I have to say overall I feel the shift ran pretty smoothly.",
        "created_utc": 1513915584,
        "upvote_ratio": ""
    },
    {
        "title": "Quickly cancelled pizzas",
        "author": "_Dialtone",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lejth/quickly_cancelled_pizzas/",
        "text": "So typically, if someone calls and quickly cancels an order with a pepperoni or cheese pizza or something else pretty common, we hang on to it for maybe 15 or 20 minutes to see if someone orders the same thing. but lately, it seems like a lot of the orders that are immediately cancelled (within 10 minutes of placing) are super weird pizzas that nobody else will want.  \n\nthe other day, we had a ranch pizza with pinapple and anchovies that was cancelled almost immediately after we put it in the oven. two days ago, we had a chicken and mushroom pizza with no sauce and no cheese get cancelled. yesterday, someone ordered 5 pizzas, 3 of which had no cheese and 2 had no sauce, and called back right after we made them all to say they messed up and wanted cheese and sauce on all of them.  \n\nhow are people this stupid and indecisive? why do people who place orders online wait 15 minutes to call and tell us to change their order?",
        "created_utc": 1513910995,
        "upvote_ratio": ""
    },
    {
        "title": "What's the biggest (or nicest) tip you've ever received?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ld08v/whats_the_biggest_or_nicest_tip_youve_ever/",
        "text": "[deleted]",
        "created_utc": 1513895372,
        "upvote_ratio": ""
    },
    {
        "title": "I love being a delivery driver, but sometimes there are me moments that make me want to quit.",
        "author": "zxchary",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7lbcg8/i_love_being_a_delivery_driver_but_sometimes/",
        "text": "Just had a $200 run today to a business and they stiffed me. Like how does that even happen? Lol man, this is depressing. ",
        "created_utc": 1513880822,
        "upvote_ratio": ""
    },
    {
        "title": "Almost jumped on a delivery",
        "author": "Sunlesslime",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7l5ezk/almost_jumped_on_a_delivery/",
        "text": "So I work at a gas station that has a pretty decent sized kitchen and we also deliver pizza. That night I was delivering and now that its winter time its getting dark here at 5:00pm. \n\nAnyway I get a delivery to a pretty ghetto part of town where people almost never tip or are just rude in general. Luckily it was to a regular customer who almost always tips $10.00 so I was pretty happy to be going down there, I leave the store hop in my truck drive to the address give the dude his pizza with no problems at all and he left a pretty generous tip too which made me even more happy. \n\nI'm standing at the passenger side of my truck counting the money and putting it in my bank bag and all of a sudden I hear fast footsteps coming up behind me, I turn around and see a person wearing all black hood up and a face mask with nothing but his eyes visible both hands in pockets and going straight for me. As soon as I noticed him I yelled \"OH JESUS\" because it scared the shit out of me and he instantly turned the other way and started running down the road.\n\nI instantly get in my truck lock the doors and get the fuck out of there, I drove right past him and he started pulling something out of his pocket so I floored it and got the fuck out of there. Would rather not go back to that area again but none of the managers at the store seemed to care. \n\nSorry for the shitty formatting this happened a couple weeks ago and It still creeps me out. ",
        "created_utc": 1513812985,
        "upvote_ratio": ""
    },
    {
        "title": "When to draw the line and file a complaint with the GM or store owner over poor customer service for a local pizza place?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7l51un/when_to_draw_the_line_and_file_a_complaint_with/",
        "text": "[deleted]",
        "created_utc": 1513809594,
        "upvote_ratio": ""
    },
    {
        "title": "If you see that a driver forgot something, call them.",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7l3miy/if_you_see_that_a_driver_forgot_something_call/",
        "text": "That's all, really. I just find that it saves time when we're busy. Having to send a guy on the road for one drink is a huge pain in the ass.",
        "created_utc": 1513797271,
        "upvote_ratio": ""
    },
    {
        "title": "The $6 bowl of lettuce",
        "author": "DarkMatterBurrito",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kzuq7/the_6_bowl_of_lettuce/",
        "text": "These are the people that I wonder about.\n\nSeveral nights ago I delivered to someone whose order included a regular garden salad with the cheese, black olives, onions, green peppers, tomatoes, and croutons removed. The only thing left is the lettuce. They added double Greek vinaigrette dressing, which is 4 packets; enough to drown everything like it was cereal. So, they have spent $6 on less than 3 ounces of a romaine and iceberg blend. You could buy 3 packages of romaine hearts with 3 in each package for that much.\n\n",
        "created_utc": 1513754424,
        "upvote_ratio": ""
    },
    {
        "title": "How do you guys feel about being rushed?",
        "author": "MikeDoinNumbers",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ky3hk/how_do_you_guys_feel_about_being_rushed/",
        "text": "Just curious if theres any drivers out there who feel the same way. There are times ill have to take say, 3 deliveries and the manager will tell me to \"hurry\" or something along those lines because the last ones close to being late for example. Im sure some of you get told things similar, but how do you guys react to this? I just ignore it with the mindset that i can only get there as fast as the route takes me.\n (quickest route, but normal, safe driving at speed limit) when you guys get rushed by someone inside does this make you change how you drive? (Speeding , roll stop signs, etc?) ",
        "created_utc": 1513734486,
        "upvote_ratio": ""
    },
    {
        "title": "My AM doesn't give a fuck.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kxdy1/my_am_doesnt_give_a_fuck/",
        "text": "[deleted]",
        "created_utc": 1513727782,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza delivery app",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kv9ci/pizza_delivery_app/",
        "text": "[deleted]",
        "created_utc": 1513708957,
        "upvote_ratio": ""
    },
    {
        "title": "The underage card wielder",
        "author": "vincousticglory",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ksoh9/the_underage_card_wielder/",
        "text": "Well, this happened tonight. \nIt was bizarre.  Someone unfaze me.\n\nTo set the scene:  I work for one of top 3 in the biz. Been here several years, so I have seen everything, or so I thought. Tonight was a first for me.\nFirst time poster, etc etc. Be kind.\n\nBeing in store for once (we're slow, no deliveries at all),  I decide to be proactive and I'm handling most of the carry out orders.  Insiders out back smoking, probably.  It's about 10 in the evening, freezing out and not in the best area of town (think dark corners, high crime, and busy parking lots).\n\nCue the cutest 8 year old on the planet, who happens to be my next customer.  He walks up to the counter, waiting patently.  Never even hear him come in. I've been blind-sided (you'll see).\n\nK for Kid\nM for myself\n\nM:  Well, hi there!  What can I do for you tonight?\nK:  Order for \"Mary Smith.\"  (All business. Nice. Sure kid, coming right up!)\nI grab the properly labelled order from the heat rack and head to the counter.\n\nAt this point I'm just going with it, he's been more polite than 80% of my other customers, got the name right and has payment.. and you know, maybe an adult is teaching him how to handle the world.  Starting with pizza and CC TRANSACTIONS.  Pigs can fly.\n\nNext thing I know, little dude reaches up, hands me a credit card. \nOkay... and I go to enter it, making some talk about favorite toppings. I love kids. I then tell him to wait one second, and go to grab a receipt (to cover my ass!)\nWe typically don't have customers sign for any amount under 20 dollars (idfk), so I hand little dude the receipt to hopefully give mom. And off he goes, holding on tight to a hot pile of food. \n\nNow I'm just staring out of the window, is this life?Thinking to myself, that was weird. Is that legal? Shit... don't drop it, don't drop it! \n\nNot two seconds later, cue the return of cute kid, and a newly materialzed mom following.  Alas, she lives!\n\nMom: I ordered a blue cheese!  (Barked is the correct verb for this)\nM: Okay.. I do believe it's in one of the boxes!  (the order was weird, no wings, just a bread product of ours, so I already checked to make sure the dipping cup was inside a box).\nOpening of the box, lo and behold.\n\nMom:  Oh.\nTurning and walking out.\nMe, relentless:  Well, have a terrific night!\n\nParents, unglue yourself from your phone for 2 seconds and supervise your kid!  (Hahah, right)  If you were that quick for a .69 cent cup, couldn't you have just come in and paid for it yourself, with your credit card?  Easier and quicker, but shit, Becky just posted something good to facebook.\nHope the kid kept the card.\n\nAnyone else with strange tales?   It was bizarre. Adults are bizarre.\n\nSame night, delivered a 50 dollar order, prepaid and pretipped... to a single, large man. :(  He was sweet, but couldn't get up from the table.  Also tipped 5 dollars.",
        "created_utc": 1513682592,
        "upvote_ratio": ""
    },
    {
        "title": "Only 1.5 months into managing and today was my breaking point. God, I hate this job.",
        "author": "tacopirate2589",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kq8hn/only_15_months_into_managing_and_today_was_my/",
        "text": "I've been an opening manager for a month and a half now and it has been a horrible experience. Night crew rarely finishes dough prep (very problematic because we have frozen dough), never finishes cleaning the store, and most of the employees are constantly testing the limits to see how much they can get away with. The night manages spends 2+ hours hanging out in the dining room on the clock every night even though they consistently never finishing their closing duties.\n\n\nAlthough that has been frustrating, I think I have done a decent job getting my work done and making a dent in the extra work they leave me.\n\n\nToday was my breaking point though.\n\n\nI opened and as per usual, it was just me in the store until 4. I had two drivers who were on the road pretty much the entire day. There were supposed to be four night-employees coming in, plus a manager, at staggering times (4, 4:15, 4:30, etc.). Every. Single. One. *including the relieving manager* showed up 30+ minutes late. We were already a bit busier than usual for a Monday, but we went into dinner rush around 4 and it was only me in the store to do everything. \n\n\n3 of the employees were late because of a fucking video game. The relieving manager tried to tell me it took them an hour and a half to get to work (they live &lt;20 miles away), but another employee had already told me she was going to be late because of the video game. Two of the late employees then mozied around in the back after they got there and tried to take their sweet time before actually getting to work.\n\n\nWe had a full make screen, pizzas coming out of the oven, fryers going off, customers up front, phones ringing off the hook and on hold. It was complete bullshit. I didn't have a second person inside the store until a little after 4:30.\n\n\nI ended up writing up all of the late employees, reassigned my till, and left as soon as the other manager got there. I feel a little bad about writing up the employees that called and warned me, but it still is not okay. Too many of our employees treat their shifts as suggested times to come in or leave.\n\n\nBut, fuck this job, I am done.\n\n\nMy GM is on vacation right now, but I am putting in my two weeks as soon as she gets back.",
        "created_utc": 1513650700,
        "upvote_ratio": ""
    },
    {
        "title": "Wrongly accused of forging a tip?",
        "author": "SexyMcBeast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7knex1/wrongly_accused_of_forging_a_tip/",
        "text": "Hi I'm working right now so I'll be quick. Cop came in, said I forged a $5 tip ok an order a week or so ago, didn't do it and he's looking for the receipt now. Don't even remember this order. \n\nWhat can happen here? What's the process? I work at Domino's, manager puts in all the tips at the end so I don't even put them in manually. The cop doesn't believe me at all, can I lose my job for this even if I didn't do it?",
        "created_utc": 1513624504,
        "upvote_ratio": ""
    },
    {
        "title": "Escapee cat take a flying leap!",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kk1fc/escapee_cat_take_a_flying_leap/",
        "text": "So I had a delivery on the third floor of an apartment.  Apartment has exterior stairs.  When the customer opens the door, I see the cat making a break for it.  I tell the customer the kitty is trying to escape.  He shuts the door and signs the CC slip.  When he reopens the door to get the pizza, the cat bolts.  It immediately runs down to the landing in between the 2nd and 3rd floor.  Owner walks up to kitty, kitty looks back, then jumps down to the ground.  Owner is distraught.  I just chill, knowing the cat is fine, but might be hard to corral now that it's down on the ground.  I manage to see the black cat crawl under a car in the parking lot and tell the owner where to go.  He finds cat, but is unable to reach cat to extract and retrieve it.  I've been standing watching for about 5 minutes, and feel the situation is calm enough for me to leave.  I tell the owner good luck!",
        "created_utc": 1513586712,
        "upvote_ratio": ""
    },
    {
        "title": "any karma is a bitch stories?",
        "author": "woolsey1977",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kizdp/any_karma_is_a_bitch_stories/",
        "text": "i posted a question an askreddit that aparently pissed off everyone who saw it yesterday. so today at work karma had me delivering an empty unmarked pizza box to a custimer. there was plenty ov other fustrating stuff that hapend, but the nondelivery delivery was all me.",
        "created_utc": 1513571864,
        "upvote_ratio": ""
    },
    {
        "title": "One of our Employees called our Regional Supervisor hot without knowing who he was.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kic83/one_of_our_employees_called_our_regional/",
        "text": "[deleted]",
        "created_utc": 1513564579,
        "upvote_ratio": ""
    },
    {
        "title": "How hard is it, honestly, to remember to call the store after you drop off a delivery?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kf7uv/how_hard_is_it_honestly_to_remember_to_call_the/",
        "text": "[deleted]",
        "created_utc": 1513533518,
        "upvote_ratio": ""
    },
    {
        "title": "How do you keep morale up in your store?",
        "author": "Driddle07",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kemkg/how_do_you_keep_morale_up_in_your_store/",
        "text": "morale has been in the gutter at my store lately and I'm trying different ways to improve it to make my fellow coworkers happy to come to work. \n\nI bring in candy and cookies regularly for everyone to eat but it's about all I got right now. anyone have any ideas how to improve it?",
        "created_utc": 1513527683,
        "upvote_ratio": ""
    },
    {
        "title": "Just had my first $100+ night! Delivery driving is awesome!",
        "author": "pokeaotic",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kc0kp/just_had_my_first_100_night_delivery_driving_is/",
        "text": "Worked for 5 and 1/2 hours and made $105!! Plus the hourly wage, which probably adds another ~$20 or something. I can't believe I just made over $100 doing the easiest thing in the world, delivering pizzas.\n\nI wish every day was Saturday.",
        "created_utc": 1513486656,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else getting fed up with customers demanding online-only coupons when they call in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kboys/anyone_else_getting_fed_up_with_customers/",
        "text": "[deleted]",
        "created_utc": 1513482415,
        "upvote_ratio": ""
    },
    {
        "title": "Discounts and how they rob us of our tips",
        "author": "GhostofPacman",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7kb7ji/discounts_and_how_they_rob_us_of_our_tips/",
        "text": "Alright so I work at a little eatery you may know of, name begins with P and ends with apa John's. Now as you may know Papa J's can be a little pricey with their pizza. Depending on how much food a customer gets, prices can range from 60 dollars upwards, but I've begun to notice that most orders are discounted significantly. Now generally this wouldn't bother me. Its a better deal for the customer, but when it starts to bother me is when I'm delivering 60/70/80 dollars worth of pizza and drinks that are discounted to 20/30/40 dollars. I'm still putting in the same amount of work but I'm getting tipped less because the customer doesn't feel obligated to tip me as much. It especially sucks since where I deliver already doesn't tip super great. Any one else noticed this? What can we do because ultimately it cuts into the money we make?",
        "created_utc": 1513476348,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else do anything in store while not on deliveries?",
        "author": "imapieceofshitAMA",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7k5zga/does_anyone_else_do_anything_in_store_while_not/",
        "text": "It seems simple enough to me, I go on my delivery, come back and if there's nothing else to do then I'll buss tables or wash dishes or something to pass the time. I've only been at this place for a few months now but it seems like none of the other drivers do shit in between deliveries. One driver actually got fired for not doing shit around the store (he also had really bad drive times). I got a $2 raise because of my \"work ethic,\" when in reality I just thought that you're supposed to work in between deliveries. Does anyone here work in a store where you're allowed to just chill on your phone in between deliveries?",
        "created_utc": 1513412761,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of the Disappearing Doorbell",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7k5nzc/the_tale_of_the_disappearing_doorbell/",
        "text": "[deleted]",
        "created_utc": 1513407288,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Hut offering $10,000 reward for tips in delivery driver's murder",
        "author": "CavalierEternals",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7k1vri/pizza_hut_offering_10000_reward_for_tips_in/",
        "text": "Link to article: http://www.kwch.com/content/news/Pizza-Hut-offering-10000-reward-in-delivery-drivers-murder-464245593.html",
        "created_utc": 1513365210,
        "upvote_ratio": ""
    },
    {
        "title": "Did a customer ever tried to take back a tip?",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7k1qnj/did_a_customer_ever_tried_to_take_back_a_tip/",
        "text": "So these videos where the pizza guy gets a big tip?  I'm wondering if they're real.  Do they [take the tip back when the camera's off](http://www.thewebcomicfactory.com/comic/tales-of-pizza-thousand-dollar-tip/)?  Have you ever had a customer tip you and then take the tip back somehow?",
        "created_utc": 1513363928,
        "upvote_ratio": ""
    },
    {
        "title": "Quitting my second delivery job after NYE",
        "author": "enzoronchi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7k1kt3/quitting_my_second_delivery_job_after_nye/",
        "text": "My main job is at this busy family owned pizza place in South Jersey, but I’ve also been working at this other place off shore 10 minutes away for some extra cash in the mornings full time. I’ve been doing this second job for only three months, but I’ve grown sick and tired of it of how poorly run and dead the place is. At my main job, I get paid $5 an hour on top of my tips, make a good $130-150 with my pay. At the second place, I get paid $5 to NOT only be a driver, but they overwork you. You have to wash dishes, sweep outside, and they have me out here making croutons and overall doing prep work. For $5 an hour? That’s bullshit. It’s not even busy at all, my boss and his stupid daughter hype the place up for no reason. I put in my two weeks to leave after NYE and they’re guilt tripping me into staying. My boss overworks me, originally told me I would be getting paid $4 for driving, or $6 if I did some dishes, but I ended up with the $5 for doing 3x the work a driver does. His daughter, can’t work for shit. She’s in charge of bagging the food, taking te orders, and is waitress all at once. She can’t handle it. She gives me wrong addresses half the time and sometimes even forgets to write the tip and price of an order, so I’ve lost money in the process of working. And on top of that, she gives me the nastiest attitude when I fuck something up, and I once called out sick and then bitched at me that I didn’t bring a doctor’s note in the next day, when this job isn’t even on the books, nor did she tell me that when we’re texting the night I couldn’t come. The best part about all of this, my main job is giving me 15+ more hours or so since a couple of drivers are going away. Had to vent. Thank you for listening!",
        "created_utc": 1513362501,
        "upvote_ratio": ""
    },
    {
        "title": "\"I was put on hold\"",
        "author": "kingdom18",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jy8f7/i_was_put_on_hold/",
        "text": "No shit.  \"I was on hold for ten whole minutes!\"  And then you hung up before I could get back to you.  \"And then I was put on hold three more times!\" Yes, after you kept calling back and hanging up once on hold, while I dealt with in-store customers and all of my co-workers were on the pizza line.  \n\nNo, we put customers on hold for shits and grins, it doesn't matter that we are getting slammed with orders, most of which are pickups.  Doesn't matter that that means we had at least three people in the lobby at nearly all times for two hours. Which meant someone who could be cooking or answering phones was constantly interrupted.  \n\nNo, I purposely put you on hold just to inconvenience you.  ",
        "created_utc": 1513322769,
        "upvote_ratio": ""
    },
    {
        "title": "I just marked my third year at Domino's... and my transmission quit.",
        "author": "notevilfellow",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jxwgx/i_just_marked_my_third_year_at_dominos_and_my/",
        "text": "A few years ago I started working part-time for a DPZ franchisee to help pay for university. Despite the offer of $3.50/hr on the road and. 95 per run I figured that with tips it would still be some of the best money I could make in the area while still having time for classes. Since then I've gotten my first apartment and transferred to one of our most profitable stores to cover it. A little over a year after that, things were going pretty smoothly, other than my ass of a GM, but I could ignore him. But as I was going in a few days ago, my car started shuddering, lurching, losing power, whathaveyou. I still managed to get there and spent the shift as an insider. At the service shop, it was confirmed that I'm in need of some transmission work, which for my car could easily start around $1500. And I can't do that. Next semester is my last before graduation and tuition is due in a few weeks, while I barely have enough to cover my rent. Over the past year it had just faded out of my head that this could happen, and now I may well be screwed. I've been making *just* enough to keep me there (of course by design), and now that this has come up, I could easily lose my job; I'll essentially get in trouble for them not paying me enough to keep my car running. \nI guess this came out to be a little more of a vent than I'd anticipated, but I feel like it just should be said. It's just so broken that I'll get swindled out of my car in slow motion and then just thrown by the wayside when they're done with me. I can't move back in with my dad because I'd have to commute to school, and I couldn't stay in my apartment and still pay tuition. I think I may finally be fucked.",
        "created_utc": 1513318123,
        "upvote_ratio": ""
    },
    {
        "title": "I have to brag on myself a little.",
        "author": "_TheWolfHimself",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jx65o/i_have_to_brag_on_myself_a_little/",
        "text": "As a very dedicated pizza lover, I quickly found this subreddit in under 24 hours after creating my account. I hadn't realized just why drivers were always SO damn happy about dropping a couple pizzas by. Even on busy nights I always get a smile, and a take your time attitude. And come to realize, my $7-$10 tip for a 3-5 mile drive is about as sweet as the deal gets. Generally I just go off what I have in my wallet or round up to the nearest 10. I tipped a driver $15 and offered him a quick \"420\" before he had to drive off in the snow just last weekend.\n\nStay safe out there guys, I know some (pizza place) dont pay their drivers well or regulate tips to minimum wage in some states.\n\nI seriously love the people who bring me pizza. Bad days when its shitty weather, and I'm too lazy to cook. Or when I have a friend over and just want to chill. The pizza guy is there.",
        "created_utc": 1513309380,
        "upvote_ratio": ""
    },
    {
        "title": "Tonight I was THAT person",
        "author": "SpaceOctopus94",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jx629/tonight_i_was_that_person/",
        "text": "I've been following this subreddit for a while now and I've learned a lot. Generally how to make things easier for the wonderful person delivering the food. But tonight I was an idiot. \n\nI'm in the middle of moving, today was the last day of finals and my kid was sick today so my brain has been bleh. The pizza guy had called for step by step instructions because gps always takes delivery drivers the wrong way. Everything was cool until the last part of directions. \n\nInstead of telling him to go left and then left I told him to go right and right, which where I live makes a big difference. Obviously he ended up a tad lost and I realized my mistake and I profusely apologized as I gave him the correct directions. \n\nWhen he got to my place he wasn't even mad, in fact he was actually sorry that the store had run out of plates and napkins and we cracked a few jokes back in forth before I signed the bill and tipped him 40%.\n\nLong story short pizza guy if you're out there I'm still very sorry and happy holidays. ",
        "created_utc": 1513309351,
        "upvote_ratio": ""
    },
    {
        "title": "Some things I have noticed as a new driver about tips.",
        "author": "djcarbary",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jwhf3/some_things_i_have_noticed_as_a_new_driver_about/",
        "text": "I have started to deliver for a place, let’s call it Bread-era. Fresh sandwiches, soups, the like, and I deliver at lunch times before I go to my other job. I deliver in some very high end neighborhoods.\n\nOur system only allows for credit card and digital paying, so I don’t have to worry about cash and exact change. People can choose to tip when they are ordering, or when they sign. They can add it to their card total or some give cash. Even though I have not been delivering for very long, I have noticed an interesting dichotomy in big tips or little/ no tips on orders.\n\nNurses at the hospital tip well and usually provide good directions to get to their office.\nDoctors, don’t.\n\nI do some delivery to a retirement community/ assisted living facility. The residents tip well.\nThe receptionist up front writes 0.\n\nSometimes teachers submit an order in advance and I deliver to them at lunch time. They tip well. \nThe classroom moms that come in to help the class (think the stereotype of ‘I need to be there for my little Brayden’) tip poorly or not at all, and barely even look at me. \n\nPayPal provides a tip line automatically, but disappears if they choose not to tip using their account so we don’t have to go back later. PayPal users tip.\nApple Pay doesn’t give a line for a tip unless you put in yourself. Most Apple Pay users do not tip at all. In fact the 2 Apple pay users who have tipped me, they tipped in cash and told me that they were former wait staff.\n\nNow I know this isn't indicative of every delivery. It is just something I have noticed.  People who work in service industries tip the best and usually in cash.  Most people tip around 3 dollars for a delivery, but you can get some 4, 5 , even 10 dollar tips on big orders. Some people think that the delivery charge goes to me. When asked, I explain that it doesn’t. \n\nAnd, I actually like this job. It is great part time work, and most of the time I deliver in the daylight. I like the people I work with and most people understand on how busy we are. I have encountered a few rude people and only one mean person in the months I have worked. The food is good, and all of this combined has made me pretty content. I hope I can do this for a little while longer. \n",
        "created_utc": 1513302049,
        "upvote_ratio": ""
    },
    {
        "title": "Spicy meme I almost forgot I ordered on the receipt for pizza hut",
        "author": "Gengar11",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jv4br/spicy_meme_i_almost_forgot_i_ordered_on_the/",
        "text": "[removed]",
        "created_utc": 1513289079,
        "upvote_ratio": ""
    },
    {
        "title": "An Open Letter Thank You To My Driver Yesterday",
        "author": "allofthethrowing",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jv043/an_open_letter_thank_you_to_my_driver_yesterday/",
        "text": "Thank you. \n\nI'm my grandfathers part time caregiver. He's on a no sugar-low carb-low cal-low salt diet. It's food. It's not always good. While serving him lunch yesterday, I decided I didn't have enough energy to cook for myself as well, and well...I wanted food that wasn't necessarily going to be good for me.\n\n\nBeing an introverted millennial, I ordered online. Personal pizza, 6 wings, bread, and a 4 pack of caffeine to get me through the rest of the day. It was 12:30, and it was snowing. I knew I'd be waiting.\n\n\n1:30, you showed up. Apologetic because my 4 pack was breaking, so it needed to be held on the bottom. No big deal. Set that in the house to avoid disaster, and you handed over my receipt to sign. I tipped you $8.00 on my $35 order. Then....the food exchange.\n\n\nYou handed over my food, and almost as soon as it was in my hands, my personal pizza fell to the ground and the box opened, spilling the pizza on the floor. Totally my fault. My balance sucks. You were even in the process of closing the door for me. All I could do was laugh. You said sorry. I waved you off.\n\n\nI picked up my pizza. I know whats on that floor. 5 second rule, right? Never thought about not eating it.\n\n\nBy the time I had checked on my grandfather, and was getting ready to eat myself, my doorbell rang.\n\n\nIt was my driver, less than 15 minutes later, holding a new personal pizza. \"I saw it fall, so I got you a new one.\"\n\n\nI thanked you then, and I'm thanking you again now. That bad-for-me greasy pizza tasted amazing. I wish I carried cash on me so I could have tipped you more, for going out of your way for me.\n\nI hope next time I get a craving, you show up so I can thank you again.\n\nTL;DR: Ordered food, I dropped my pizza, driver saw it happen, and brought me a new one.\n\nP.S. Obviously, I'm not a driver - I wasn't sure if reaching out to the Store Manager is the right option to let him know how much I appreciated it? I don't know if he could get in trouble for what he did. That's the last thing I want. If anyone could offer an opinion, I'd appreciate it!",
        "created_utc": 1513288088,
        "upvote_ratio": ""
    },
    {
        "title": "Serial stiffers",
        "author": "JayLar23",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jtyr6/serial_stiffers/",
        "text": "Wondering how you guys deal with serial non-tippers. I won't be blatantly rude but I've gotten to the point where I just don't talk to them- I tell them the price and hand them the food, and that's it. If they say \"Thanks\" or \"Have a great night\" it's greeted with deafening silence. Maybe I'm being petty, but I don't see why I should kiss your ass if you're not going to bother even throwing me a buck or 2 for your FREE delivery (we dont have delivery charges). It seems like the only way I can send a subtle message without coming right out and being rude, which would only earn me a reprimand from my boss (or a pink slip).  And this is reserved for repeat offenders- I'll still be nice to you the first few times, because sometimes non tippers can be recruited to the \"dark side\". But if I've brought you food 20 times and walked away empty handed every time, you're dead to me. What do you think?",
        "created_utc": 1513279540,
        "upvote_ratio": ""
    },
    {
        "title": "What the hell is the deal with customers that order wings?",
        "author": "sk8ingnakedhurtz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jsiwr/what_the_hell_is_the_deal_with_customers_that/",
        "text": "I don't work for a food delivery service that works with multiple restaurants in town. I know there is the \"black people don't tip\" myth, but we have stumbled on a new correlation. People that order wings are almost guaranteed to not tip. And not only that but usually end up to be some of the most difficult customers to deliver to. I have so many stories about them, so here is a pretty typical one:\n\nAs a delivery driver I only carry $20 in cash, and just an extra safely measure our website says we do not carry cash. This day we get 3 separate delivery orders to the same address to one of our \"favorite\" places to deliver to, its a factory where a good deal of customers order and are always difficult. When I get there 3 different customers each ordered the same $9 meal, and each one wanted exact change back. They immediately thought I was trying to short them out of money when I told them I didn't have enough change. One guy was so sure of this he was ready to fight me, his friends had to calm him down but were equally suspicious that I was trying to short them. I let them know I had to drive back to the office and to get the rest of their change, and eventually they realized they had no choice but to let me go. So, I leave and come back, and start calling them. We have a call &gt; text&gt; and keep calling policy for customers (mostly because we live in a college town with dorm orders), and if the customer doesn't answer in 5 minutes we leave, because we usually have more than one order on us. After 5 minutes I leave, and then about half an hour later the customer starts blowing up my phone asking why I left with their money, accusing me of robbing them, and starts threatening me. At a certain point I just hang up because I no longer feel safe, and start ignoring that phone number. After a while one of his friends starts doing the same thing with a different number. After this point Ive called the restaurant the food was from and let them know the situation and asked if I could just leave their cash there for them to pick up later, and they agreed. \n\nI just don't get it, Ive taken so many deliveries, Ive worked delivery off and on for years at different places and no one ever has a story like wing customers. ",
        "created_utc": 1513267626,
        "upvote_ratio": ""
    },
    {
        "title": "Rate your chains food",
        "author": "fretwork",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jlv12/rate_your_chains_food/",
        "text": "You/we are the guys and gals who end up trying the majority of the food at our respective chains, so how would you rate your food? I work at devilominos and would rate us thusly: \n\nHand tossed pizza - awful, somehow both under and overcooked with a crust that feels like eating sand\nThin crust - somehow worse than the hand tossed. Tastes like nothing and can't support many toppings at all. Usually cooked all the way through at least\nPan - honestly not terrible. So naturally it's not something we can get with our free meal\nWings - the worst in the biz bar none. Tiny? Check. Overcooked? Check. A gallon of sauce per 8 wings? Check!\nSalads - not bad at all actually!\nSandwiches - The one spot where I think we shine. I've had 4 or 5 different kinds and they've all been bomb as hell \nCheesy bread - not terrible. Have them throw some pepperoni on it and it's pretty good just reeeaally greeasy. \n\nWe sell a few more things like pasta and gluten free pizza but I haven't had any of them. What do you think of your chains food?",
        "created_utc": 1513195025,
        "upvote_ratio": ""
    },
    {
        "title": "White out in CNY",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jkynp/white_out_in_cny/",
        "text": "[deleted]",
        "created_utc": 1513187518,
        "upvote_ratio": ""
    },
    {
        "title": "Drunk woman wouldn't let me leave for about an hour and a half",
        "author": "Kalooeh",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jhucm/drunk_woman_wouldnt_let_me_leave_for_about_an/",
        "text": "Happened literally just a bit ago and I need to share/vent.\nBut stuck at this woman's trailer for over an hour and a half because afraid she would have either gotten violent towards me or freaked out and hurt herself and as I had no idea if she had a gun or not considering her talking about her bf having gotten in trouble for almost shooting up a place, only thing I was able to do was try to keep her calm and try to convince her to just let me leave without her freaking out about it.\n\nI already knew the delivery was going to be a pain in the ass because usually people who call last minute before closing tend to be, but I get there and she asks me to put the pizza on the table while she tried to find her money. Not that big a deal since I've had to do that before with food, especially if people have trouble carrying things and this woman is drunk.\n\nProblem is that once she gives me the money (while blocking me in) and she started talking about an injury she had because she had been drinking because of issues with her boyfriend doing something, every now and then she starts crying a little and sounds like had a fight or broke up or something.\nNo, more turns out (from what I could make out? Unless he is out and just left instead?) that he had gotten in trouble for threatening to shoot up a minimart or work but had gotten drunk and said something in a mini mart or something but he was currently gone for some reason and she wasn't letting me leave, asking me what she should do and how she loved him, and I'm trying to stay calm and tell her but let her know I do have to go and she should sleep and hopefully feel better and let me know later on how things go with my advice.\n\nShe continued on, often repeating herself and a lot of it is still hard to make out because she's that drunk.\nEventually I started crying because I'm having an anxiety attack but she takes it as me crying for her, and I had told her several times I needed to go, as best I could to try to avoid her shouting or freaking out since she kept doing that whenever I told her I needed to go or I didn't really have a phone that I could talk to her on because pre-pay with barely minutes and needed for work, etc (lies, but I wasn't giving her my number), but I had her number and I'd try to talk to her if I could, etc, agree to whatever I could so she'd just let me leave without freaking out about me trying to leave since I was blocked. Several times would take my hand for a handshake and just not let go and pull me towards her or squeeze my hand hard. \n\nOf course I didn't make the other delivery I had and the person I was closing with was freaking out thinking I had gotten in an accident by the time I finally managed to get the hell out and in the car so I could call without worrying if I was going to get shot.\n\nOfficer I had talked to knew who the person was because she has mental problems and shouldn't be drinking so he said he was going to go and check on her because seriously drunk, injured (not enough that she couldn't have come after me unfortunately or could have shot at me from her doorway if she did have a gun, check if she may have a gun because she shouldn't, and tell her she can't be keeping people at her place, or to do whatever he needed to considering her mental state cause she definitely wasn't stable. \n\nI understand her situation and she likely just really wanted someone to talk to, but same time I'm freaked out and pissed because working and her problems and upset over this guy that apparently is violent/abusive himself is not an excuse to be doing this kind of thing with delivery drivers.\n\nI have pepperspray, and I had been trying to work my way out the door slowly and consider escape options even with all the ice on her porch, and drunk, but same time I don't know this woman and I don't know what she's able to do or not do or how violent she can be, especially when she's already yelled at me several times.\n\nI at least don't have to work tomorrow (today I guess since 2am now and didn't get out of work until nearly midnight when I should have been done or home by 10:30pm at the latest), and owners will deal with it further in the morning. \nOne of them already knows at least since the guy I closed with called.",
        "created_utc": 1513152641,
        "upvote_ratio": ""
    },
    {
        "title": "Cheese and Peppers: The Pinnacle of the Heart's Desire",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jhsyt/cheese_and_peppers_the_pinnacle_of_the_hearts/",
        "text": "Okay so why the fuck do people get so passionate about their fucking cheese and pepper packets.\n\n\"Maybe I should go to the store and get some Parmesan cheese for like $2\" no I need shitty little packets to pour on my pizza. But I'm not going to fucking ask for it on the driver instructions, I'm just going to hope my driver has them and get pissy when they don't.\n\nIt wasn't so bad in my previous area, since most people asked. But in this new area I'm delivering in, i've gotten some of the following\n\n1) \"Man I should have fucking asked that before I gave you the tip\"\n\n2) \"Well since you didn't fucking bring any cheese and peppers you need to go to the gas station and get me some soda\"\n\n3) \"Well why the fuck don't you have any in your car?\"\n\n4) \"*intense door slam in my face*\"\n\n5) \"So you're coming back to bring some to me?\"\n\n6) \"Why not?\" \"*gives explanation of why not, including corporate policy as well as food safety reasons*\" \"You're fucking retarded\"\n\n7) [The Face]\n\nLike it befuddles me beyond belief and I have no idea why people have such an impassioned yearning about this to the point where they don't feel the need to ask.\n\nOh but like they make sure that they write on there \"knock on door!!!\" because otherwise I'd just smash in your fucking window and walk into your kitchen. (Also side note, when they ask you to knock on the door but the glass screen door is locked so you're just kind of stuck tapping on glass that doesn't resonate because the wood door is blocking it)\n\nLike can someone explain to me why people are like this lmfao.\n\nAnd before you mention it, I'm not taking any with me lol. I will help out customers when I can but I'm not just going to carry free shit on me because you don't know how to request it. Also I don't wanna do it because it screws over my other drivers when they don't take cheese and peppers because if I do it, they'll start expecting it (which is why I think I'm in this predicament in the first place)\n\nWhat I'm doing to combat this is that I ask people when I do phone orders \"would you like cheese and peppers\", unless they sound like shitty people, in which I don't. Also if they ask I tell them they have to request it on the delivery. Which about 10% of people are like \"oopsie okay\" and about 90% just make a face like they're in the fifth grade and the teacher asked them to come in from recess.\n\nNever before have I seen substances destroy a man's heart so much that it reverts them to such a vulnerable and child-like state. Truly, this substance is the secret to the eternal beauty of youth. But not like the good part, only the part where you act like a little bitch half the time.",
        "created_utc": 1513152076,
        "upvote_ratio": ""
    },
    {
        "title": "What’s your thoughts on door Dash and post mates and what not ?",
        "author": "WoolyMacdowell",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jgrwy/whats_your_thoughts_on_door_dash_and_post_mates/",
        "text": "Sup heroes \n\nJust curious , what’s your thoughts on food delivery apps and do you guys do them as well as deliver for your pominos and pizza slut jobs ?\n\nIve been doing food app delivery as a reliable  side hustle for the past year but the tipping sucks. I get the best tips when I do pizza delivery , and was considering applying at a local shop. I know my area well and am pretty good at delivering . I have a super high rating and 1300 deliveries with door dash. I do enjoy the flexibility and being able to do whatever the fuck I want though. I haven’t had a day job ( my main hustle is in the entertainment industry)  in 3 years so idk if I can genuinely deal with a supervisor with a straight face .\n\nAnyway, what are your general thoughts on this ? Just kinda want some advice on this and hear what y’all think \n\nMuch love \n",
        "created_utc": 1513139126,
        "upvote_ratio": ""
    },
    {
        "title": "My coworker got exact change on a cash order and handled it in the oddest way possible",
        "author": "RCBurnout11",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jdbkw/my_coworker_got_exact_change_on_a_cash_order_and/",
        "text": "Mondays for us are usually slow as fuck, so we tend to stick with three drivers (one opening, one closing, and one for the rush) which means the day usually goes one of two ways: Either we have nothing to do and just chat with each other most of the night or we get slammed and have to quote hour delivery times. Last night was the latter.\n\nIt's almost 7:00 and even though the list of deliveries is down to 3 from where it was an hour ago, we're still trying to get caught up. Our dinner driver walks out the door with an order about 45 minutes after it was placed and I start on my run as well. My delivery is only about 1.5 miles down the road, so I'm back in about 15 minutes. \n\nAs soon as I walk in, the phone rings and my manager grabs it. While I'm putting my bags back and getting out some boxes to fold, I see her getting more visibly upset as her conversation goes on. As soon as she hangs up the phone, she yells \"fuck you!!\" which I've never seen her do before, so I knew something terrible had happened.\n\nAt first I thought that she was just dealing with an asshole customer, but nope. Dude called and said one of our drivers threw a \"calzone\" out his window which ended up landing right in front of his house. He angrily told my manager to make sure the driver drove back and picked it up, before sarcastically addressing her as \"sweetie\" and hanging up on her while she was mid-sentence. \n\nThings got even better when I read the name on caller ID. Turns out, I used to work with this dude at Pizza Hut a few years ago. I remember him as a kind-hearted, considerate, and silly dad figure of our store and it blew my mind that he would end up being the one to call about one of our drivers hucking a pizza slice out the window. I was even more shocked after hearing how much of an asshole he was to my manager.\n\nI went ahead and texted him shortly after out of curiosity as I was leaving on another delivery, \"I'm sorry my coworker threw a slice of pizza in front of your house. That ain't right.\" He replied shortly after, \"hey man, I figured it wasn't you. It didn't look like your car, otherwise I wouldn't have called.\"\n\nI get back from my delivery and the dinner driver is there. \"Man, I got busted. Someone stiffed me down to the penny on a cash order and I was super mad, but I still shouldn't have done it. It must have been a different guy who called because I drove a good 300 feet before I threw it and there's no way he could have seen me.\" As he takes off to go pick up his wasted slice of the crew pizza that's probably been run over by now, I text my old coworker again and explained to him what happened. His response: \"That's fucked up of them, but if he had just thrown it in their yard instead, I wouldn't have cared at all\"",
        "created_utc": 1513107599,
        "upvote_ratio": ""
    },
    {
        "title": "How was this job during the recession?",
        "author": "PizzaGuyS197",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jcz26/how_was_this_job_during_the_recession/",
        "text": "Like 2007-2010-ish. I'm on my second job delivering pizza, and I plan on going back to school next semester using money from it. I have a hunch that the economy could get a bit bumpy in the next 5-ish years. I wouldn't say I'm paranoid about it, but it has been a while since the last recession. How was working pizza delivery during the last ond? Was it secure? And how did people tip compared to better economic times?",
        "created_utc": 1513104762,
        "upvote_ratio": ""
    },
    {
        "title": "Caffeine dependency",
        "author": "xTrimmZ",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7jcpwu/caffeine_dependency/",
        "text": "I've been driving for Domino's for ten months now. Over time I've developed an unfortunate caffeine dependency; I'm sure I'm not the only one here who's gone through it as well.\n\nDoes anyone have any advice on how I can safely get away from caffeine and start having natural energy?\n\nIt's so bad that it's to the point where if I don't consume a lot of caffeine; even on a full night's sleep and with proper protein/vitamins, I'll start to nod off behind the wheel which isn't safe. So I'm stuck between risking my life passing out or risking having a heart attack.\n\nHow do I get out of it without missing work?",
        "created_utc": 1513102616,
        "upvote_ratio": ""
    },
    {
        "title": "An attempt at a tutorial after years of delivering pizzas: Coupons, and why they're your best friend.",
        "author": "saltyleave",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j8dyi/an_attempt_at_a_tutorial_after_years_of/",
        "text": "*I just sent this message through our schedule software to my fellow drivers, but I think some of you might be able to gleam some insight from it.*  \n  \n\nHey folks, (coworker) pointed out to me today that I average more tip money than other drivers in the store, so I decided to share some tips with you that will increase the money in our pockets, especially if we put forth a concerted effort as a group. If you don't care how much money you make, that's fine, just ignore this message and go about your day. \n\nThe first tip I'm going to inform you of is that coupons are your best friend in regards to encouraging good customers to order more frequently. (Pizza Restaurant) wants them going to all customers on the two liters, but encouraging non-tippers to order more doesn't benefit us in any way or form. I don't know if any of you have noticed, but I keep a stack of coupons in my pocket to hand out to customers that I wish would order everyday. My rule of thumb is that if they tip more than $2, I give them a coupon and inform them of the special. Boom, they order again next week, somebody gets a good tip. If we ALL do this you'll notice your pocket feeling a little heavier.  \n\nThe second piece of advice I have for you, and this will probably cost me money in the long run so please appreciate this advice, is to develop a relationship with your customers. Yes, *your* customers. Take good customers and make them yours. Here's how a typical interaction will go when I'm at the door with someone who tips well:\n\nFirst, put a fake smile on before they open the door. This is basic customer service. \n\nMe: (with a bright and cheery tone) \"Hey! How are you tonight?\"\n\nCustomer: Doing just fine!\n\nMe: Awesome! (Insert comment about how nice their yard looks, what a nice home they have, ask a question about their dog, high-five their kid, whatever. Make some sort of positive remark that reflects you have taken the time to notice something they've put effort into.) I just need you to fill this slip out for me! Alternatively, if it's a cash order, I'll say something like \"Looks like we've got you down for $24.82 tonight!\" Subpoint: Don't tell them to sign the credit receipt. *Ask* them to fill it out. If they sign it and hand it back, politely let them know you need them to fill out the rest of the slip, and make a subtle motion with your finger around the tip area and hand it back to them. My verbage is typically \"Oh, could you please fill this part out as well?\" Is it slightly tacky? Yes. Will it make your pocket a little heaver after your shift? Yes. \n\nNow you make your judgement about whether or not you want to make this customer *your* customer. If somebody drops more than $5 on me, I turn it up to full volume. \n\nMe: (Pulling coupon out of my pocket) While I have you here, (Pizza Restaurant) has a special going on for the month of December. (I now write the DEC50 code on the coupon, along with my name.) Next time you order online, this code here I'm writing down will save you 50% off your next order. My name is (saltyleave) and if you request me the next time you order I will do everything I can to make sure your pizza is here as quickly as possible! (The customer actually now has two codes for discounts. The DEC50 code is different from the one on the coupon, which will take 35% off through Jan 15. With any luck, they will use both codes, request me both times, and I'm making $5 every time they order. I have now made $15 or more just for putting in 10 seconds of extra effort.)\n\nCustomer: Thank you so much! \n\nMe: Have a great night!\n\nAnd that is how you use coupons to increase your tips and the tips of those around you. \n  \n",
        "created_utc": 1513054454,
        "upvote_ratio": ""
    },
    {
        "title": "Frustration with Drivers",
        "author": "GuapoCam83",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j7ao3/frustration_with_drivers/",
        "text": "This is probably gonna get down voted a ton but, I just want to vent, the store I run grosses 3 million a year, we have Friday nights where we have between 530-600 orders, and will have nearly 2400 orders throughout the week. We run 4 drivers for all day shifts mon-Thur and 5-6 fri-sun. If you are an all day driver on any of those shifts. You’re gonna clear at least $100- 80% of the time. Mostly hitting $120ish. With the full time drivers we have, just on credit card tips not counting cash. They average $300 a week. Not counting any cash tips. They get payed $8.25 an hour, and the area is a relatively wealthy area with no shady areas. On top of this we get a ton of catering orders. Ranging from $200-1000 every week. We have Weekday mornings where we have before the day starts 3k in deferred catering orders. On top of this the night time workers make a killing consistently. Where on a Monday night, 5-11 takes 15 deliveries. 5-12 on a Friday can be between 20-30 deliveries. The delivery area is fairly big at 7-8 miles in all direction and yes traffic in 2/3 of it can make you want to drive into oncoming traffic. But at the end of the day if you’re a part time driver working a 10 on a weekend and two nights, they’ll clear $300 in just tips. \n\nPoints of stress for drivers:\n\nYes they have a shit ton of side work, between pans, covers, dressings, boxes, bagging 15 cases of wings which is disgusting. Cleaning walkins, sweeping and mopping the dinning room, answering occasional customer phone calls. Putting away 18k worth of weekly deliveries. No dishes though, but still a lot of shit \n\nThey receive nothing of the 1.99 delivery charge. And they themselves can see that the 1.99 per delivery for “cost of having drivers” is BS, and it is. It doesn’t cost 3k a week in delivery charges to have drivers lol. So yes it sucks to go 12 miles one way and get a stiff, to where you actually lost money going down there. I empathize with you. I am sorry you lost money. I am sorry you get stuck taking a 30 Pizza contracted order to a schools football game and spend 20min making trips back and forth and get a standard $3 tip. Wasting a chunk of your Friday night. \n\nTake backs, again you go out as far as the end of the map for a fuck up that was not your fault, it was the 15yr old who thought that the customer wanted a mushroom pizza when they really wanted a special pizza without mushrooms, that sucks. I know. And we try our best to make sure you don’t go to any take back without at least 2 deliveries. We try not to fuck you. That’s not our goal. \n\nYet without fail, I have drivers claiming there’s too much work, they get pissy with the way deliveries are assigned, they take deliveries in a wrong order so a customer who doesn’t tip gets their food last, who then calls and complains, who I then either send replacement food out for, or give a credit meaning they’ll order again. \n\nLook, I get that driving is a rough job, you can’t consistently depend on making the same amount of money each day. But in the grand scheme of things at my store the all day shifts where you get $70 for 10hrs, you’ll have 5 where you make $130. \n\nI guess my main gripe is the drivers have days where they make more than anyone in the store. Myself, the GM and any waitress. Yet you’re gonna give us an attitude when you’re last delivery is a 2 runner where the one that’s at the edge of the map is a known stiffer. Yes that’s sucks, but you made over $130 today, I’m just tips. Please just take it, shut up, do the mountain of pans. And walk away with you’re handful of cash. \n\nIn the meantime just 2 semesters left a nursing schools, so I can more on from dealing with dickish drivers and proceed to sticking catheters in actual dicks. \n\nIt felt nice to vent. \n\n",
        "created_utc": 1513043981,
        "upvote_ratio": ""
    },
    {
        "title": "I just got to use Korean with a customer! Last week was sign language.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j781z/i_just_got_to_use_korean_with_a_customer_last/",
        "text": "[deleted]",
        "created_utc": 1513043247,
        "upvote_ratio": ""
    }
]