[
    {
        "title": "I Always Get The Weird Ones",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8z3qgl/i_always_get_the_weird_ones/",
        "text": "[deleted]",
        "created_utc": 1531678636,
        "upvote_ratio": ""
    },
    {
        "title": "Today is the World Cup Final and debatably the fourth busiest pizza day in the industry. May we all have a lucrative Sunday!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8z1izn/today_is_the_world_cup_final_and_debatably_the/",
        "text": "[deleted]",
        "created_utc": 1531659398,
        "upvote_ratio": ""
    },
    {
        "title": "Question about taking doubles at Dominos",
        "author": "Itwasgunstuff",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8yzyf1/question_about_taking_doubles_at_dominos/",
        "text": "I just started at Domino's as a driver, and some of the deliveries I think make sense as going together, can't. The manager says it will make them \"late\". Is there some kind of formula to figure this out so I don't always have to bug the manager asking what to take? ",
        "created_utc": 1531638047,
        "upvote_ratio": ""
    },
    {
        "title": "I sure am glad that I get to harass poor old deaf women as part of my job.",
        "author": "styxman34",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ysnfs/i_sure_am_glad_that_i_get_to_harass_poor_old_deaf/",
        "text": "A little while ago I get a run up for a normal-ish online order going to some not so great apartments. It was a cash order and the only instructions on the order were, and I quote: \"deaf.\" Okay, this will be interesting, I thought. So I pull up and, sure enough, the signs taped to their door indicated that they were in fact deaf. Cool, I'll knock loud.   \nAn older woman answers the door, visibly frustrated at the sight of me. She starts waving her arms, \"no!\" and explains, in a combination of ASL and her best speech, that she didn't order, and doesn't know how to order. \nI say, okay, I'll give the number a call. I do, and it's an interpreter number, which was not at all evident at first, so I was very confused. After some disjointed communication, I get told basically what she to me at the door, and I left. The manager on shift said he had the same thing happen not too long prior. Weird.  \nFast forward a few weeks, and I see that address pop up again, with instructions saying something along the lines of \"I am deaf knock loud.\" Against my better judgement, I for whatever reason decided not to call and try and deliver it.   \nI pull up, do the same knock, she answers the door, and gets *pissed*. She looks to the side of the door, and a guy pops his head out and screams at me, \"you need to leave!\" The only words I was able to get out were \"I'm sorry, I'm sorry.\". \nI get back to the store and the phone rings, sure enough, it's them. My manager picks up, and I'm hearing phrases such as \"well that's not acceptable behaviour from my driver.\" Their story involved me screaming and cussing at them, I guess, trying to get me fired. I was flabbergasted, given that I couldn't have done that if I wanted to. Thankfully, nothing came of it.  another order came up a few weeks later, which I flat out canceled immediately.  \nWhoever is making these orders is a real bastard.",
        "created_utc": 1531567891,
        "upvote_ratio": ""
    },
    {
        "title": "Deja Vu",
        "author": "Commatower",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8yrdal/deja_vu/",
        "text": "A story from work. \nHad two deliverys going out. The first one was to Hotel 1 with the customers at the pool. Second was to Hotel 2 with no room number given leaving me to have to call.\n\nGet back to the store and maybe an half hour passes when im called up for my next deliverys. To my amazement its to Hotel 1 with notes saying \"at pool\" and the second one going to Hotel 2 with no room number given. 🙃\n \nI have come to be accepting of the unexpected when working the pizza game, but this was too much for me. Anyone else experience something crazy like this?",
        "created_utc": 1531550242,
        "upvote_ratio": ""
    },
    {
        "title": "“Pizza boy! Pizza boy!”",
        "author": "cheifkeef01",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8yotjr/pizza_boy_pizza_boy/",
        "text": "This happened the summer of my 18th birthday. I had just gotten a job delivering pizzas in a ski resort town and was working my first shift there. \n\nAround 10pm (closing time) I had my last delivery of the night on a street I had never visited before. As I got there, I realised there was probably a party going on inside as I could hear the music blasting from the driveway and there were cars parked everyone on the street around this house. \n\nAs I walk up the stairs to the door I’m not really sure what to expect as it’s my first time delivering pizzas to a party. Of course some silly scenarios go through my mind as I’m waiting for the customer to open the door but I never could’ve dreamed in my wildest dreams what was about to happen. \n\nFive guys end up answering the door - all in their late 20’s early 30’s I’d say. There’s obviously a party going on inside and these guys have been drinking. Behind them in the kitchen I see a few women casually talking and drinking at the dinner table. I give the guys their order and they proceed to pay me (they left a decent tip if I remember correctly) and just as I’m about to thank them and leave one of them asks me if I would like to stay and have a beer with them. Now I wasn’t expecting this and politely declined their offer but the 4 others seemed to like the idea and quickly started insisting that I come in and join them for just one beer. After declining a few times I hesitantly gave in and accepted their offer. I had not yet taken one step into the house that all five of them grabbed me and dragged me through the front door. Before I could realise what was happening they had taken me through the house to the living room where they quite literally tossed me like a ragdoll through the air and onto the carpet. When I looked up, completely stunned, I realised I was surrounded by about 25 other guys, seemingly all drunk, and 2 women who were barely dressed. After noticing one of the guys wearing a pink dress, I put 2 and 2 together and realised that this was a bachelor party. The two women were effectively giving them a show, one had a strap on on and was riding the other. As all this information started to sink in, one of the guys started chanting “PIZZA BOY! PIZZA BOY! PIZZA BOY!” and the others all joined in and started cheering. It was hilarious and surreal and after the initial shock passed I was more than happy to sit back and have a beer with my new friends and enjoy the show and so I did for about an hour. The guys at the restaurant couldn’t believe it when I got back and told them what happened. ",
        "created_utc": 1531524330,
        "upvote_ratio": ""
    },
    {
        "title": "Just got a new job",
        "author": "MyNameIseARL91",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ym2v2/just_got_a_new_job/",
        "text": "Hey all, I don't know if this is aloud here but I figured I would see how it goes.  I applied at Pizza Hut yesterday because I was actually wanting to get into cooking or delivering pizza's and the pizza god has bestoweth upon thy a job.  I'm 19 years old and will be working as a cook and and delivery driver.  I own a 2002 Honda Civic 2 door that has pretty decent gas mileage.   I'm looking for any advice you'd like to give! I'm excited. ",
        "created_utc": 1531503809,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever quit a delivery job because you weren’t being treated properly?",
        "author": "mflb_monster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ylvgo/have_you_ever_quit_a_delivery_job_because_you/",
        "text": "I recently quit a sushi delivery job because I was not getting as many deliveries on the clock as my other coworkers. It doesn’t make any sense, but I would basically just sit there in my car waiting for a delivery while they would give all the deliveries to the other guy working. I tried talking to my boss about it but she didn’t do anything about it, so I quit. How about you guys?",
        "created_utc": 1531502422,
        "upvote_ratio": ""
    },
    {
        "title": "Newly hired driver questions for pizza hut drivers",
        "author": "JulesWinnfielddd",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ylutc/newly_hired_driver_questions_for_pizza_hut_drivers/",
        "text": "So I got a job offer for a part time driver position at my local PH and I was wondering a few things\n\nDo PH drivers spend much time in the store doing things like making pizza or answering phones or do they try to keep you on the road as much as possible?\n\nWhat percentage of your orders are card versus cash?\n\nHow many of your orders come over the phones versus online?",
        "created_utc": 1531502287,
        "upvote_ratio": ""
    },
    {
        "title": "Left that delivery and then laughed all day",
        "author": "Powerfuldot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8yj76z/left_that_delivery_and_then_laughed_all_day/",
        "text": "I’m a pizza gal in a relatively affluent neighborhood in a big city. \n\nThe other day when the heat was turned up too high in America, I brought a couple of pizzas to a house. A man opens the door wearing nothing but shorts, maybe they were swim trunks. Two little kids approximately 3 &amp; 5 years old run up behind the man and they are as naked as the day they were born. \n\nThe man looks at me and gives a helpless shrug. “Apparently, it’s naked time.”\n\nThe little kids raise their arms up and yell “NAKED TIME!!!!”\n\nXD",
        "created_utc": 1531481618,
        "upvote_ratio": ""
    },
    {
        "title": "Lock boxes",
        "author": "Jobmcjobface",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8yi5pe/lock_boxes/",
        "text": "Before my current delivery job I worked at a major pizza chain in a bad area and we never used lock boxes and it felt unsafe. My current job in a very safe city requires lock boxes. Is it normal to require lock boxes? ",
        "created_utc": 1531469556,
        "upvote_ratio": ""
    },
    {
        "title": "Sent home from delivering as I had to drive my convertible? wth?",
        "author": "diskman_1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ydnn6/sent_home_from_delivering_as_i_had_to_drive_my/",
        "text": "I cannot drive a convertible at PH.  I was sent home before my shift started the other day since I cannot put a \"topper\" on my car.  My little car is down with a headgasket issue and I dropped insurance on my winter vehicle as it's summer here.. lol.  I'm scheduled for this weekend too.  Now what?  ",
        "created_utc": 1531429110,
        "upvote_ratio": ""
    },
    {
        "title": "Just think about it...",
        "author": "XANphoenix",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y9xlt/just_think_about_it/",
        "text": "On the phone \nCustomer: \"Hey, do y'all still have the 7.99 deal?\"\nMe: \"Yeah, the 3 topping large? What toppings would you like?\"\nC: \"well, how much does it cost?\"\nMe: \"the 7.99 deal?\"\nC: \"yeah, what does it cost?\"\nMe: \"the 7.99 deal costs 7.99 before tax.\" \nC: \"oh wow, thanks.\" (Proceeds to place order). \n\nOne of my more interesting calls. I later realized that C may have been wanting the total after tax maybe, which I gave at the end. Just the way it was all presented kind of flabbergasted me. And my manager, who only heard my side of this and gave me a really confused look, lol",
        "created_utc": 1531403423,
        "upvote_ratio": ""
    },
    {
        "title": "Hit a kid :(",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y7i2k/hit_a_kid/",
        "text": "[removed]",
        "created_utc": 1531378903,
        "upvote_ratio": ""
    },
    {
        "title": "why yes i would love to sue you after i fall down your stairs.",
        "author": "woolsey1977",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y6pfk/why_yes_i_would_love_to_sue_you_after_i_fall_down/",
        "text": "ive had a rash of customers turning off their porch light while im navigating down their stairs leaving me night blind mid step. how common is this? it only started a month or so ago for me.",
        "created_utc": 1531370286,
        "upvote_ratio": ""
    },
    {
        "title": "I need your APARTMENT number.",
        "author": "jimmythebass",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y6n4i/i_need_your_apartment_number/",
        "text": "Today I had a customer place an online order to an apartment building and not put his apartment number in, so I had to call him to get it.\n\nMe: this is [me] with [company], calling because I need an apartment number for your delivery.\n\nCustomer: My phone number?\n\nOne, why did it not occur to you that I need to know which apartment you're in to deliver to you? Two, how the hell does \"apartment\" sound like \"phone\"? Three, why the fuck would you think I need your phone number when I am calling you *by using your phone number?* I had to repeat that I needed his apartment number two more times before he got it.",
        "created_utc": 1531369634,
        "upvote_ratio": ""
    },
    {
        "title": "Papi Juans",
        "author": "210pakalolo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y5z12/papi_juans/",
        "text": "Did anybody else have slow business today because of a former CEO that the company is named after?",
        "created_utc": 1531363482,
        "upvote_ratio": ""
    },
    {
        "title": "I’m still reeling from this high",
        "author": "tryeffer",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y44xo/im_still_reeling_from_this_high/",
        "text": "[removed]",
        "created_utc": 1531348256,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone remember Martin Lawrence's pizza guy character in Blue Streak?",
        "author": "clarkkent1521",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8y0fji/anyone_remember_martin_lawrences_pizza_guy/",
        "text": "[removed]",
        "created_utc": 1531322152,
        "upvote_ratio": ""
    },
    {
        "title": "Clipboards",
        "author": "Jobmcjobface",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xxubr/clipboards/",
        "text": "How many of you use clipboards? I am the only one in my store who does but I get positive comments from customers about it all the time. ",
        "created_utc": 1531297854,
        "upvote_ratio": ""
    },
    {
        "title": "They forgot mom had ordered.",
        "author": "MarisiaKing",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xx9m9/they_forgot_mom_had_ordered/",
        "text": "We got an order late at night for a house I've delivered to before. It's not in the best area, but the people are nice and tip well. I took it out to them, rang the bell as the receipt described, and waited. The customer opened the door, we exchanged pleasantries, and she signed her receipt. In the background, I saw two teenage girls come rushing out of a back room, one of whom was holding a bat and the other had a can of mace. They stopped dead when they saw my uniform, and their mom assured them there was no danger and made them carry the pizza. She gave me 5 bucks cash, so it was worth the trip. ",
        "created_utc": 1531290767,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know you're getting tipped when people order online?",
        "author": "Qazxswedc55",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xtsjj/do_you_know_youre_getting_tipped_when_people/",
        "text": "I work out of town, and order dinner every night from the same pizza joint. They're a local place not a franchise, offer more than just pizza, and are very reasonable on price. They use a thing called \"Slice\" for online orders, and I always leave a $5 tip for $16-25 of food purchased to be generous. \n\nBut it seems like every 2nd or 3rd time they send a different person. And they never say much. Just hand me the food and leave. \n\nI don't get it. When I first started working in this location and eating here often, it was always the same guy for about a month when I ordered via phone call and tipped in person. Then they started offering online ordering through \"Slice\" and they seem to hate delivering here. ",
        "created_utc": 1531260339,
        "upvote_ratio": ""
    },
    {
        "title": "Paying in change",
        "author": "J_S_8",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xrz23/paying_in_change/",
        "text": "Hey guys I’m new here, been delivering pizza since I got home from hockey this season, around May. I work at a super busy local pizza shack in Alberta and my goodness the money is a lot better than I thought it would be. \n\nAnyways, my question for you guys is what do you think when people pull two handfuls of change to pay for their meal? We have this one lady who orders regularly, and she pays in dimes, quarters, and nickels. Not even loonies ($1 coin) or toonies ($2 coin). I must admit it is very annoying, but at the same time she is paying me in full, never shorting me. What do you guys think when people do this regularly?",
        "created_utc": 1531247493,
        "upvote_ratio": ""
    },
    {
        "title": "Advice needed!",
        "author": "tiltedsquash",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xpwjo/advice_needed/",
        "text": "I work at a local pizza franchise, and I have been a phone guy for two years. I just got scheduled for a few delivery shifts with little to no delivery experience. I know the area fairly well, but the actual act of greeting and delivering pizza is a foreign concept to me. Would any of you pizza guys, nay, you Pizza Lords, have any words of advice for me? I am a noob, so assume I know nothing.",
        "created_utc": 1531234610,
        "upvote_ratio": ""
    },
    {
        "title": "Unicorn Milkshake Confusion",
        "author": "Commatower",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xm4tk/unicorn_milkshake_confusion/",
        "text": "This is a story of mine from long ago. I was working a late shift on the phones, doing cut table, and taking deliveries when this phone call comes in. \n\nMe: Hello this is pizza place delivery or carryout tonight? \n\nC: Hi yes I was wanting know if you sold milkshakes?\n\nMe: No young man we do not sell milkshakes at pizza place.\n\nC: Are you sure? I wanted a unicorn milkshake.\n\nMe: Yes I am sure. I think the place you want is Starbucks.\n\nC: I thought this was Starbucks. \n\nMe: No this is pizza place we do not sell Unicorn milkshakes and I want you to have a very good rest of your night. *Click*\n\nWherever Unicorn Milkshake Boy is I hope he is well and that he received milkshake.",
        "created_utc": 1531202587,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone do pizza as a second job?",
        "author": "AnObviousDisinterest",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xll67/anyone_do_pizza_as_a_second_job/",
        "text": "I worked in a pizza joint as an insider, driver, and manager since I was 15. I’m 23 now I just graduated college and moved to a new city and began a new job. It’s your typical 8-5 m-f gig.  \n\nWhile no one actually likes working, the delivery gig wasn’t ever so bad. I think I actually miss it. I’m curious if anyone does it as a part time, night/weekend thing. \n\nThere’s a place near my apartment hiring and I picked up an application, and have an interview, but wanted some further input from anyone who does it. Im not necessarily looking to drive because I’m unfamiliar with the city and replaced my current vehicle is shit on gas for city driving. I’m also worried that all of my free time will be eaten up.\n\nOn the other hand everyone could always use some extra cash, and being in a new city it might be a good way to meet people. At my old shop many of my coworkers were some of my good friends.\n\nThoughts? Is it even worth working in a shop not making tips driving? \n\nEdit: thanks For the replies everyone! It seems the consensus is not to brother if I’m not driving. The job posted appeared to be for an insider, if they don’t have a driving position open I’ll pass on it. Thanks again",
        "created_utc": 1531197569,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery Droid alternatives?",
        "author": "dread_ben",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8xixpo/delivery_droid_alternatives/",
        "text": "Howdy all. So, I just upgraded phones, and I noticed that Delivery Droid didn't transfer over. It's not even on the app store anymore. I *really* liked using that app and have for years. I could probably figure out a way to move it over from the old phone, but I was wondering if there was a better alternative that people had been using in the meantime.",
        "created_utc": 1531184921,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes people turn out OK [Short]",
        "author": "dominosalt1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8x8hpc/sometimes_people_turn_out_ok_short/",
        "text": "Got an order over our website about 5 minutes before close (national chain). As a driver this means everyone winds up having to stay past close, and truthfully the extra time on the clock is never worth it. Nevertheless, we get the order together after firing up the oven again.\n\nI show up to a local apartment complex about half an hour after close. I'm not expecting much, and I'm just glad I can drive straight home from this delivery. A college-aged guy answers the door, clearly drunk. He pays and asks how much longer my shift is, and I inform him that I was staying a bit late due to his order. He excuses himself, and comes back with $20 and a six pack of beer (although I'm still  20). He apologizes for ordering so close to close; apparently he used to deliver sandwiches and he just didn't realize the time. He demanded that I share the sixer with whichever coworkers had to stay late for him.\n\nAlthough I got to bed a bit late, it was a nice way to end the evening. Not everyone is an ass some nights.",
        "created_utc": 1531113434,
        "upvote_ratio": ""
    },
    {
        "title": "They know who I am!",
        "author": "starggg",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wyxik/they_know_who_i_am/",
        "text": "So I'm a regular customer of Papa John's. I am freaking obsessed with their brownies, I don't know why. They're kinda good, but only if they're hot and slightly undercooked. And that doesn't always happen, but I keep trying anyway :) I have been ordering the same thing, brownie and a water (I need the water to meet the $ minimum) for years. A couple years ago (and maybe sometimes now, if I'm being honest), I used to order every other day. So yeah, the some of the delivery people know me.\n\nI ordered an actual pizza the other night (shocker, lol), and my delivery person commented that she was surprised that it wasn't my usual brownie and water. She said that her manager told her that I've been ordering since before their current location, and that everyone knows me. And apparently I'm super nice. \n\nI'm torn between being super mortified and also pleased that they think I'm nice. I try to tip well and treat everyone nicely. I mean, I think you should be nice to everyone! But also, I've always worried that all the staff make fun of me and my regular order behind my back. Hopefully not! I just wanted to share. Do you guys have any regular customers that everyone knows about (for good reasons)?",
        "created_utc": 1531022389,
        "upvote_ratio": ""
    },
    {
        "title": "Avoiding awkward conversation",
        "author": "Chilibody",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wxi9v/avoiding_awkward_conversation/",
        "text": "In the area that I deliver within, there are an abundance of hotels/motels/resorts. Most of our business comes from people visiting from out of town staying in these places, which entails us visiting then pretty frequently and consequently traveling on many elevators with strangers. \n\nMost nights, I don't mind the occasional round of small talk about weather/food/events in town or whatever else might come up. However, that's not always the case and I have run up many flights of stairs in avoidance of these situations. \n\nI often make an initial judgement of the people it appears I'll be making my ascent with and check how many floors I need to travel. This has led to occasionally running up as many as 8 flights of stairs. I view my preference for silence as having an added bonus of providing occasional workouts, while I'm sure others view it as just silly behavior. \n\nAnyone else run into similar situations or have similar inclinations?",
        "created_utc": 1531007867,
        "upvote_ratio": ""
    },
    {
        "title": "What's a good tip when you order in and pick it up yourself?",
        "author": "hippowishes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wu82r/whats_a_good_tip_when_you_order_in_and_pick_it_up/",
        "text": "[removed]",
        "created_utc": 1530979842,
        "upvote_ratio": ""
    },
    {
        "title": "(non-driver) Why do you delivery drivers never get pulled over by cops when you have a topper on?",
        "author": "97chris1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wplay/nondriver_why_do_you_delivery_drivers_never_get/",
        "text": "I always see comments about drivers never getting pulled over by cops when they have toppers on.",
        "created_utc": 1530927610,
        "upvote_ratio": ""
    },
    {
        "title": "The old days of delivering before GPS...",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wm6b2/the_old_days_of_delivering_before_gps/",
        "text": "I adapted [this comic story](http://www.thewebcomicfactory.com/comic/tales-of-pizza-fat-landmarks/) for the modern era, but back in the day, this is what you had to deal with.  Paper maps in your car and customers on the phone trying to describe where they lived.\n\nYou kids today have it easy!  Back in my day, we had to deliver pizza in the snow!  Uphill!  Both ways!  Anyone else deliver in the age of Pre-Internet and no cellphones?",
        "created_utc": 1530899539,
        "upvote_ratio": ""
    },
    {
        "title": "What is the strangest request a customer has given you when you got to their house with their delivery?",
        "author": "silvermannn92",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8wdkh3/what_is_the_strangest_request_a_customer_has/",
        "text": "For example, I drove a guy to a convenience store during a blizzard so he could buy a 12 pack and some scratch off's. He tipped me $25. Not strange, just...wow. ",
        "created_utc": 1530820711,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever agreed to run an errand or pick anything extra up for a customer?",
        "author": "Soronir",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8w8lqd/have_you_ever_agreed_to_run_an_errand_or_pick/",
        "text": "Every once in a while someone has a special request. \"I'll make it worth your while.\" I tend to do these every chance I get since people generally tip very well.\n\n\nUsually someone wants smokes or alcohol. On one occasion the guy wanted s'mores, lol. I stopped for graham crackers, marshmallows, and chocolate bars.\n\n\nReceived a $30 tip the other day just for stopping for a pint of vodka.",
        "created_utc": 1530775987,
        "upvote_ratio": ""
    },
    {
        "title": "The worst and the best",
        "author": "Telepenisis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8w65t0/the_worst_and_the_best/",
        "text": "The worst delivery I ever had was an order that the customer thought he placed as a delivery, but somehow got set to carryout. His order was made, and was sat in our store for a while. One of my coworkers called him to let him know his order was ready to be picked up after it had been waiting about 30 minutes. He gets pissed off and said it was supposed to be delivered. They remake it, and it's ready just as I get back from another delivery.\n\nI know right away it's going to be bad because I see it's an old order, about 50 minutes old by the time it gets assigned to me. I take the remake and drive out. His house is about as far away as it can be, about 13-15 minutes of a drive. I ring the doorbell, and a child yells out \"Who is it?\". I say \"(Store Name) here with your pizza!\". The child yells back \"Who?\" Annoyed already, I repeat. The child yells out that it's the pizza guy, and a few moments later, the dad comes to the door (which by the way is still not open at this point) and in a loud, \"thug\" voice yells out \"WHO IS IT?!\" Unfazed, I say \"(Store Name) with your order\". He opens the door, and there are about 3 small children behind him.\n\nHe then spends a few minutes berating me about how the order took so long, how could we let his kids starve, etc. I explain that somewhere along the line there was an error when placing the order (I didn't check to see if it was an order placed over the phone/online). He didn't care and just wanted to act foolish in front of his kids. He even had the audacity to ask if it was an old pizza, and pretty much didn't seem to believe me when I told him it was remade and fresh. And of course, he stiffs me on the tip. Completely ruined my night.\n\nThe best delivery I had was a nice old man, who was drunk when he answered the door. After exchanging money and food, he hands me a $20. I ask if he meant to give me that much, and he just says \"You're worth it, aren't you?\". I told him I appreciate it, and then I leave after saying goodbye.\n\nHonorable mentions to bad deliveries are always those who order late as hell, are at the edge of our radius, and stiff on tips. When I'm delivering that late, it's literally eating into my free time, wasting my gas, and putting my car at risk. Always burns me up.",
        "created_utc": 1530749039,
        "upvote_ratio": ""
    },
    {
        "title": "Need suggestions on how to deal with this situation.",
        "author": "Throwitaway874213",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vrpdj/need_suggestions_on_how_to_deal_with_this/",
        "text": "Throwaway for obvious reasons. I work at a pizza place with franchises. I've worked there on and off for almost 3 years. The GM is editing time cards, stealing time from employees. He's not doing it in massive amounts, 15 minutes here, an hour there, but stealing is stealing. Made contact with the franchise, nothing was done, GM continues to edit time cards. We have several high school students and veterans working here. It's pretty messed up to steal from anyone, but a disabled veteran? \n\nTo make things worse the GM also consistently stirs the pot between high schoolers. For example, morning shift was busy, couldn't finish prep. Dishes were piled up like some 8 foot tall statue to the Greek god of lexans. Morning shift drivers stayed late to get things caught up, but the delicate sensibilities of the closing assistant manager were impinged upon. GM tells closing manager to leave all dishes for morning shift. All the trays, lexans, everything. Shitstorm ensues. \n\nI have the next few days off for an event. When I get back I want to have a plan to get this shit taken care of. Any suggestions? Thanks in advance.",
        "created_utc": 1530620049,
        "upvote_ratio": ""
    },
    {
        "title": "Almost Conned and Locked in...",
        "author": "Siepej",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vplhm/almost_conned_and_locked_in/",
        "text": "This happened today, and I have started working at a very large pizza chain in South East PA. Today as I was on my daily runs, I came across a house in the poor area of town, and the man I was delivering to was waiting outside. I brought him the pizza and he gave me the money which was only 7$ when the pizza was ~20$. He hurried back inside before I counted the money when I realized that he conned me for 13$ which would come out of my tips for the day. I Knocked on the door and his wife came to the door, she asked what the problem was and I told her. She opened the door and yelled at me to get in or the cat would get out. I went inside against my better judgment and immediately felt a sinking feeling in my stomach. It didn't feel right. The wife kept trying to close the door behind me which had quite a few locks. I was pretty scared and have heard of this happening to other drivers in the area, so I kept my foot in the door so she couldn't close it. She told her husband to get more cash, he got it and I left. Not to mention that I never saw a cat. Sorry for grammar and storytelling - not very good at it, as you can tell. Have been shaken all day and needed to spit it out. Didn't feel good at all.\n\nEdit - Am 18 and not very big at all.",
        "created_utc": 1530594899,
        "upvote_ratio": ""
    },
    {
        "title": "Papa Johns made me deliver from Pizza Hut",
        "author": "garysquare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vm2tl/papa_johns_made_me_deliver_from_pizza_hut/",
        "text": "So, kind of long, but.. in college, I was a delivery driver for Papa Johns. Basically what happened was one night, we had an intense power outage. It lasted most (if not all) of my shift. Our backup generator wasn’t functioning at all for some reason, and we were getting overloaded with online orders. My boss was a drunk, and quite literally a wreck. \n\nAnyway, Pizza Hut was next door, and they literally offered to make our pizzas (they weren’t receiving any orders for some reason, and also had a backup generator that  was functioning properly). \n\nThey made EVERY ORDER for us, and I delivered them. Sad part is, is that we had the best reviews that night. I’ll never forget it. \n\nEdit: sentence structure sux",
        "created_utc": 1530564139,
        "upvote_ratio": ""
    },
    {
        "title": "Hilarious phone call tonight.",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vgvhi/hilarious_phone_call_tonight/",
        "text": "So, I answer the phone this evening.  \n\nThe cast:  TE: Me.\nC:  Customer.\n\nTE:  Pickup or delivery?\n\nC:  Delivery.\n\nTE:  What's your address?\n\nC:  The woods.\n\nTE:  Which woods? (we have a couple of apartment complexes with woods in the name.)\n\nC:  The woods behind my house.\n\nTE:  We don't deliver to the woods.\n\nC:  What about the helicopter?\n\nTE:  The helicopter is in the shop, won't be ready until next week.\n\nC:  What about the delivery drone?  I saw the delivery drone on TV.\n\nTE:  We have the option of having either the helicopter OR the drone.  Our owner choose the helicopter, but again, it's in the shop.\n\nC:  Ummm, OK.\n\nTE:  Sorry we can't help you out tonight.\n\nC:  &lt;click&gt;\n\nRest of the staff laughing.  Manager asks why I didn't hang up on them.  I reply this is comedy gold, you can't hang up on that.",
        "created_utc": 1530517742,
        "upvote_ratio": ""
    },
    {
        "title": "Dominos kept my credit card tips",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vgqat/dominos_kept_my_credit_card_tips/",
        "text": "[deleted]",
        "created_utc": 1530515889,
        "upvote_ratio": ""
    },
    {
        "title": "Straight theft",
        "author": "Chilibody",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ve8ha/straight_theft/",
        "text": "A little background before I begin: \n\nI work at a local Italian restaurant that does a pretty good delivery business. We have nearly no strict policies in place in regards to deliveries, it's pretty much common sense and whatever seems right at the time. They've expanded their business past what they're capable of managing and rely heavily upon their employees experience and judgement to run efficiently. That's all relevant to what transpired a few months ago:\n\nI arrive at a room within a fairly nice hotel with a pizza and a few sides and a ticket indicating the customers were going to pay me in cash. A father and mother answer the door with their kids eagerly looking behind them. I tell them their total and they immediately ask if there's something they need to sign.....great. Here we go again (this confusion happens constantly at our store). \n\nI explain that I have indicated that they were to pay in cash and they state that they've already given their credit card information to the store. I asked if they called back after initially placing their order, which they confirmed. Not the end of the world, I just need to call the store to confirm that this took place. \n\nI wait for nearly 4 minutes on hold while the weight of their pizza begins to ache my arm. I feel awful about the situation because one way or another, I'd like this family to get their food and I'm standing there holding it hostage. I decide that I've made them wait long enough and I tell them I'll get it resolved back at the store, but I'd take their word for it. I hand them their pizza and I'm on my way. \n\nI get inside and immediately ask if they received payment for that order, and find that I've been deceived. I don't panic though, and decide I'll just give them a call and sort it out now that I know we have no payment information from them. I'll be Me and they'll be LC (lying customers):\n\nMe: Hey, this is the driver from ***** Italian restaurant. I got back to the store and nobody here received a call from you regarding payment for your delivery, so I was hoping to get that information now. \n\nLC: Oh, well honestly the pizza you gave me was cold, the mozzarella sticks were burnt and the salad was disgusting. \n\nMe: I'm so sorry to hear that, the pizza didn't feel cold as I took it out of the bag and handed it to you, but I'd be happy to remake that for you and get a fresh order sent to you as soon as possible. However, that still doesn't resolve the lack of payment. \n\nLC: I don't think we should have to pay for the food. We don't want any replacement but I certainly don't think we should have to pay for what you delivered us. \n\nMe: I see. I'd be willing to give you a 40% discount on your delivery to compensate you for the unsatisfactory food, but you still accepted and received food from us without payment. \n\nLC: No. I'm not going to give you any information and I'm not paying for this. \n\nMe: Ma'am. It seems you intentionally deceived me regarding the payment of this delivery. I want you to have a good delivery experience with us, and I'd like you to give us the opportunity to make it better, but it looks like this was intentional from the beginning. \n\n(I understand that I maybe shouldn't have been so accusatory, but it's pretty apparent at this point what has happened and I'm slowly losing my cool. I begin pondering calling the police for theft, but immediately realize how poorly that would reflect on our business.)\n\nLC: I have nothing else to say to you. Please don't call me again. \n\nMe: (defeated) Alright. Have a good night. \n\nI tell my manager what happened, what I said in attempt to recover at least something for the restaurant and she kind of just shrugged it off. She didn't want to pursue it further for fear of a bad review online (which they take very seriously here) and I close the case. \n\nThe owner's son came in later that night (a 23 year old hot head with no business sense or desire to work at his father's business) and demanded I give him the hotel and room they were staying in so he could go handle it, but I hid the ticket and told him it wasn't worth it at this point. I felt betrayed just like him, but I didn't feel there was any recourse at this point. Some people are just shitty. ",
        "created_utc": 1530489665,
        "upvote_ratio": ""
    },
    {
        "title": "Nicknames for any customers?",
        "author": "hardhitsscott",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8vbxql/nicknames_for_any_customers/",
        "text": "I have a regular biker dude I call \"The Undertaker\"\n\nAlso \"Uncle Phil\" who's a spitting image of well, a younger Uncle Phil.\n\nAny double or triple going to the cluster of section 8 complexes is always known as the \"Poo-Poo Platter\"",
        "created_utc": 1530469743,
        "upvote_ratio": ""
    },
    {
        "title": "I really, really love being a delivery driver.",
        "author": "ghost-of-john-galt",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v8tu2/i_really_really_love_being_a_delivery_driver/",
        "text": "I really enjoy my job and it's not just because the money is good.\n\nLong story short I took a delivery the one night and the following morning the manager said the customer came in and dropped off another $5 tip for me. She felt she didn't tip enough. I'm still rattled. I'm at the point where I really don't care about the bad customers because I have enough awesome regulars making my job a great experience.\n\nAnd all the puppies. God, yes. So many puppies.",
        "created_utc": 1530437165,
        "upvote_ratio": ""
    },
    {
        "title": "What can I do about incompetent management?",
        "author": "PhunkyPhazon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v7zia/what_can_i_do_about_incompetent_management/",
        "text": "So I've been working for one of the big chains for a few years now. Recently our store got bought by a franchise, and this eventually led to ALL the former management staff quitting due to pay and policy changes they didn't like. This sucked, as I got along great with them and thought they were genuinely great managers. Our store performed well, ran efficiently, and even when things got stressful I could trust everyone to do their best and weather the storm.\n\nEnter the new guys. Where do I even start? In all the time I've worked here, I have **never** seen a manager crew this infuriatingly bad at their jobs. I could seriously type several pages describing my various issues with them, but I'll attempt to keep this brief. Right now, there's three managers. The general manager, an assistant manager, and another assistant who only works weekends (I'll call them the weekend assistant for clarity's sake).\n\n\\- The general manager is lazy and doesn't know how to properly prepare for anything. It's not uncommon for there to be a full screen on makeline, only to find him in the office twiddling on his phone or smoking out back instead. When he DOES do his job, he does it alright enough but he lacks the gumption and organization of previous managers. He doesn't start making huge plan-ahead orders ahead of time, he doesn't try to route drivers in particularly sensible ways, and when something goes wrong like, for example, the late or closing driver calling in sick, he won't try to find someone to cover the shift. His philosophy in that situation seems to be \"Meh, things will sort themselves out.\" And this is assuming he bothered to schedule a late or closing driver to begin with. Yes, seriously.\n\n\\- The assistant manager is...an odd case. Of the three, she's definitely the most effecient and hard-working. But she has  bad habits of micro-managing and over-demanding things (like expecting drivers to stay later to do side-work *they weren't even assigned*; although tbf I think she's realized this). The thing is though, she has no qualms about telling people to do tasks that she KNOWS they shouldn't do. She keeps sticking this one newer kid on cut station that really really really really shouldn't be doing it, as he seriously does not do one single thing right. He forgets basic side-items, constantly mixes up orders, forgets special instructions like square-cutting and, on occasion, even forgets to cut the friggen' pizza. I tried bringing this to her attention recently, and her response was just \"Oh I know; it's because he hasn't been trained.\"  In other words: THESE MANAGERS ARE NOT BOTHERING TO TRAIN NEW EMPLOYEES. HOLY. FUCKING. SHIT.\n\n\\- The weekend assistant. Oh god, the weekend assistant. There is not one job in the store I trust him to do. Not one. If he's in charge of makeline, we have to deal with an absurd number of remakes as he doesn't even know what goes on certain specialty pizzas. If he's on the phones, there's a strong chance he'll enter the wrong address AND the wrong phone number. If he's on cut-table, well, he might do a *slightly* better job than the kid I was just talking about. Slightly.\n\nSo, other experienced drivers and general employees of Reddit, what are my options? What used to be at least a very tolerable job has turned into something I dread, as I never know what new bullshit I'll have to deal with next. My first instinct is to quit, since it's time for me to start a real proper job hunt anyways. But job hunts can take months, and I don't like the idea of being unemployed for that long. My only other idea is to contact some higher-ups and tell them my grievances (and believe me, I only scratched the surface in this post. I could go on more about the terrible scheduling and general in-effeciency). Who do I contact? What will they do about it? I seriously fucking hate this job now and I don't know what to do about it.",
        "created_utc": 1530424700,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone here work at Sarpinos?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v6orl/anyone_here_work_at_sarpinos/",
        "text": "[deleted]",
        "created_utc": 1530409842,
        "upvote_ratio": ""
    },
    {
        "title": "Pretty sure this was unethical",
        "author": "beahave",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v4g1u/pretty_sure_this_was_unethical/",
        "text": "Hello beautiful people! Many moons ago I worked at a pizza place where the company was franchised, but the owner worked along side the staff. \nSome of the things that the owner did was in my opinion unethical or illegal. She loved to threaten to take our tips if we didn’t do something right(I.e not doing side work or if we got a negative review) we would “lose our tips for the day” \n\nShe was a very vindictive bitch, who allotted tips to people based on how she felt about them or what they did during that pay period(tips where paid out “based on performance”) If things break in the store she would take it out of our tips to fix it. If we were “over topping” she would take it out of our tips to cover food cost. \n\nNow mind you that this store had a VERRRRRRY high turn over rate. So it was very hard to train and keep people. Eventually, this made it hard to do things “the right way”  She treated ppl like shit but she refused to see that the restaurant toxic environment was her fault. \n\nTLDR: she would take people’s tips away as a form of punishment. She felt like this would whip ppl into shape, but it just made people quit. That along with her weird labor practices, shitty hours and pay made ppl leave. \n\nShe would also state that she takes tips for herself, since she works too(we get a lot of money in tips) now mind you that this lady is damn near a real estate tycoon and she has plenty of money, but she sees fit to take away from her poor(literally) hourly employees.",
        "created_utc": 1530388247,
        "upvote_ratio": ""
    },
    {
        "title": "Tips please",
        "author": "Hikku_Rikku",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v33yh/tips_please/",
        "text": "[removed]",
        "created_utc": 1530377390,
        "upvote_ratio": ""
    },
    {
        "title": "Hourly rate while on the road",
        "author": "HLMD651",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v2fv8/hourly_rate_while_on_the_road/",
        "text": "  Just started last week driving for one of the big 3, starts with a D. I'm working for a franchisee, and the hourly rate while on the road is $3.00 plus mileage. I read this entire board while considering driving as a second job, and I don't recall anyone mentioning being paid so little. I was shocked when they told me, I expected @ $5.00.  Anyone else out there getting paid similar? ",
        "created_utc": 1530371321,
        "upvote_ratio": ""
    },
    {
        "title": "No one home",
        "author": "jay_to_the",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v0iox/no_one_home/",
        "text": "So this happens to me more than I like...people who order for delivery and when you show up they aren’t even home. What are your thoughts and experiences with this lunacy? Happened to me twice tonight. On the first, I rang their fancy door bell and just as I was about to call them they start talking to me via door bell. “ just put x-amount tip and leave it on the door step. We won’t be home for a few more minutes”. ..you get the picture. My biggest pet peeve for delivering to the point we put notes in our system “wasn’t home, don’t arrive till 45 min minimum” even when they can get it in 25-30. ",
        "created_utc": 1530347302,
        "upvote_ratio": ""
    },
    {
        "title": "Seriously thinking of quitting after tonight",
        "author": "alexterry1234",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8v05et/seriously_thinking_of_quitting_after_tonight/",
        "text": "I had two deliveries completely stiff me tonight on credit card bills. The first was a lady on the same street that stiffed me the night before. She had sunglasses on while talking to me, which isn't a good sign to begin with because I feel it is courteous to take that shit off when talking to people. She wrote 0 on the tip. The second was to the absolute end of our already too large radius. She had on a \"redneck lives matter\" shirt and crossed out the line for the tip. I was pretty fucking pissed when I got back to the store. \n\nI've only been in this game for about three weeks, still came out with 70 dollars including gas. How often do you guys get stiffed? My first ever delivery they gave me a 60 cent tip, and I've gotten as low as a 6 cent tip.",
        "created_utc": 1530342050,
        "upvote_ratio": ""
    },
    {
        "title": "Had my worst two hours of pizza delivering yet last night.",
        "author": "Pagecrushers",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uzxcw/had_my_worst_two_hours_of_pizza_delivering_yet/",
        "text": "Background: This week we had an in store worker quit (no show when he had a double shift) and that had everyone on edge the next day since no one had been asked to come in to take over his shift, leaving us with only 3 workers total for a 4-12 shift. \n\n\nSo last night was going fine, even though we were understaffed until around 9:15 when I went to grab an order off the shelf and dropped it. In store had to remake 2 pizzas and a cinnamon stick. Then an hour or so later I was taking two orders to be delivered and accidentally swapped the receipts in the bags so they were delivered to the wrong houses. So those then had to be remade and redelivered. I felt absolutely horrible so at the end of the night I split the tips I had made (minus the mileage I made) with the other in store worker who was closing who had had to remake all my mistakes. Wasn’t a crazy amount, just $20, but I felt so bad about causing that much of a mess that she had to deal with and doing that made me feel better about it. \n\nSo, what’s some of y’all’s worst night experiences?",
        "created_utc": 1530339000,
        "upvote_ratio": ""
    },
    {
        "title": "So I almost killed a kid tonight.",
        "author": "faster_than_sound",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uzfp1/so_i_almost_killed_a_kid_tonight/",
        "text": "Still pretty shaken over it, even though it happened mid-shift. \n\nI am driving down a road, 38ish mph, and the road is not a part of a subdivision, but it splits a subdivision. This is a legit two lane, double yellow line road, not a neighborhood road. Posted speed limit is 40 mph. So anyway, I am nearing an intersection on the road, no stop sign my way, to the right of me on one corner are two kids, on the left of me a kid and his dad. Only maybe 30 feet or something like that to go before passing the intersection the kid on the left decides its time to try to dart across the road. I slam on my breaks as the kid *stops in the fucking middle of the road like a goddamn deer and just stares at me*. This is no exaggeration, I came within 3 feet of hitting this kid.\n\nBut here is the fucking kicker. The dad? He just casually saunters slowly across the road, barely even looking my direction as he give me a little shrug and mouths \"sooorry\", kind of lightly shoves the kid along, pretty much doesnt even care that I almost ran over his child, meanwhile I am getting over a small heart attack. Like, what the fucking fuck, dude? I literally almost went to prison for vehicular manslaughter of a fucking child, and you are acting like its no big deal. I got back to the shop, and I dont really smoke cigs anymore, but had to bum one off a co-worker because my nerves were shot.\n\nPlus side, my last delivery of the night was $10 tip on a $10 order, so I have that going for me, which is nice.",
        "created_utc": 1530332983,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Auto-Insurance",
        "author": "GZNathaniel",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uxz9b/question_about_autoinsurance/",
        "text": "*Hopefully I'm posting correctly* So my situation is that I just graduated hs and I'm looking for a small job and being a delivery driver sounds like the best fit for me. I've applied for different places online and planned to apply in person to some others.\n\nToday I get a call from someone at pizzahoot asking if I was the applicant and if my car's insurance was under my name. I said it was under my dads, to save money, and they told me if I could get it under my name in the next 2-3 days it would be an immediate hire.\n\nMy question is, will every pizza place or most delivery jobs require my name to be under the insurance as one of the car's drivers? It sucks because I'm 18 and it will cost a lot of money, but if it's a must I will do it.\n\nAll replies appreciated thank you!",
        "created_utc": 1530317711,
        "upvote_ratio": ""
    },
    {
        "title": "Ever smoke pot on deliveries?",
        "author": "jimmycrackcowboy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uwbq7/ever_smoke_pot_on_deliveries/",
        "text": "[removed]",
        "created_utc": 1530303538,
        "upvote_ratio": ""
    },
    {
        "title": "Dumb coworkers being dumb.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uv10r/dumb_coworkers_being_dumb/",
        "text": "[deleted]",
        "created_utc": 1530293730,
        "upvote_ratio": ""
    },
    {
        "title": "To the England pizza people.",
        "author": "GaZzErZz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8urmem/to_the_england_pizza_people/",
        "text": "I hope yesterday wasn't too bad for you. The Dominos twitter feed was full of complaints.\n\nI put an order in before remembering England were playing. I accepted the 2 hour wait before it arrived. I hope you all made it through unscathed.",
        "created_utc": 1530262094,
        "upvote_ratio": ""
    },
    {
        "title": "Parmesan cheese, please.",
        "author": "MarisiaKing",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8up7g8/parmesan_cheese_please/",
        "text": "People always want parmesan cheese and red pepper, so we keep the packets under the front counter for carryouts. The packets are free, along with plates, napkins, and forks. For deliveries, there's about a 5% chance we'll bring you some without you asking, depending on the driver and their mood. I personally never bring it unless you either ask for it or you've asked for it before and I remember you (and you tip good). Here are some stories for you.\n\nThe truck runs once a week to drop off new food, boxes, and other stuff we need. The night before it came, we had completely run out of parmesan cheese. A guy came in to pick up his order, paid for it, and asked for some cheese, and I told him we were out of cheese, but I could give him some red pepper. He flipped out, accusing us of stealing his money while not providing the paid for service. He demanded the manager, so I, fed up with his attitude, went to get her. I have to give her credit, because she stood her ground and told him the cheese was free and he'd gotten everything he'd paid for, so he stormed out with his pizza.  \n\nAnother driver took a delivery to a house on the edge of our radius, a good 10 minute drive with no traffic, and the customer asked for parmesan cheese while the driver was counting the exact change to make sure she wasn't stiffed. She didn't have any, and told the customer that. The customer opened the pizza box, said, \"Too bad, I was really hoping to have [my chain]'s pizza tonight.\" She overturned the box on the step, sending the pizza everywhere (the driver had to dodge really quick to keep it off her shoes), and slammed the door. The driver wasn't happy, but the customer had paid for the pizza, so she could technically do what she wanted to with it. The customer later called the store claiming the driver had dropped her food, but was shut down by the manager who had heard the full story.\n\nJust last week, I took a delivery to an old folk's home. The delivery was on the eighth floor, and there was a line for the elevator. I got there, the customer paid, and she said, \"The parmesan cheese is in the box, right?\" There was no note on the ticket saying she wanted it, and I told her as such. She countered that she had specifically requested it, and informed me she would be calling my manager. She shut the door and I left, and when I got back to the store, the manager was busy dealing with her. Apparently the woman had ordered through the call center, and they never add notes to the tickets, so it wasn't our fault for once. The woman demanded twenty dollars of store credit, which she wasn't given since she'd gotten everything she'd paid for. The manager, fed up with the customer's shouting, said that they'd give her the parmesan cheese if she came by the store, but the little old lady naturally never came. Something tells me she won't be ordering again. ",
        "created_utc": 1530235694,
        "upvote_ratio": ""
    },
    {
        "title": "Answer My Question",
        "author": "nickronomicon999",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8uos1t/answer_my_question/",
        "text": "First post, more to come. \n\nThe phone rings and I answer it, conversation goes as follows with Me being M and Customer being C.\n\nM: City Pizza Hutch, how can I help you? \n\nC: Yes, I want your large 1 topping with breadsticks for 9.99 please?\n\nM: carryout or delivery?\n\nC: can I get it with a supreme?\n\nM: it's one topping. Carryout or delivery?\n\nC: I want a large supreme with beef.\n\nM: Carryout. Or. Delivery.\n\nC: *slowly* I want a large supreme-\n\nM: *puts the phone down to get some else to deal with this moron*\n\nThe customer wanted a large supreme with beef, a total of seven toppings, and breadsticks and was surprised when it wasn't 9.99. \n",
        "created_utc": 1530231629,
        "upvote_ratio": ""
    },
    {
        "title": "How long until I get fired?",
        "author": "VeXedZenith",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ugkfv/how_long_until_i_get_fired/",
        "text": "So how many fuck ups can I afford to make before I just get fired? I've never considered myself absent minded, but I've already forgotten 2 different customer's drinks and taken the wrong order 3 times now (this still baffles me to this day, I have no idea how I managed this), not to mention a few calls about how slow I've been taking doubles. Today I forgot that I was suppose to even come in. I was scheduled as off today but yesterday, boss lady told me to come in anyway, an exchange that I completely forgot until she reminded me over the phone a few hours ago.",
        "created_utc": 1530163125,
        "upvote_ratio": ""
    },
    {
        "title": "Highest tip you've ever gotten?",
        "author": "dramaticcrisis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ucqv3/highest_tip_youve_ever_gotten/",
        "text": "I saw an older thread with some comments about highest tips, but I haven't seen one recently so I thought I'd ask.\n\nI once got $250 (cash) tip on an $8 order from a hotel. Got really scared that the guy (i'm a girl) wanted me to do some sketchy stuff so I backed up and he said he just wanted a hug and to make somebody's day. I gave him hug and bolted out of there and called all my pizza friends on the way back to the store.\n\nThe same guy then proceeded to try and tip $100 to another driver later in the week, but the driver couldn't get it because he used his credit card and the tip was over the maximum percentage of tip that you can get in our system :(",
        "created_utc": 1530128961,
        "upvote_ratio": ""
    },
    {
        "title": "Need help, think I am being frauded by my manager.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8u6fq7/need_help_think_i_am_being_frauded_by_my_manager/",
        "text": "[deleted]",
        "created_utc": 1530071238,
        "upvote_ratio": ""
    },
    {
        "title": "Sounds Aggravating",
        "author": "airbornecavepuppy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8u365x/sounds_aggravating/",
        "text": "For anyone who doesn't frequent Not Always Right... I thought I'd share this little gem with you guys.\n\nhttps://notalwaysright.com/online-offers-to-an-offline-brain/115790/\n\nOh. My. God. I think I would have gone insane. I'm also glad that when I order pizza, I am nothing like this guy.",
        "created_utc": 1530043268,
        "upvote_ratio": ""
    },
    {
        "title": "My favorite attempted robbery",
        "author": "SpecificMost19",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8u29ep/my_favorite_attempted_robbery/",
        "text": "My favorite delivery story happened to one of my best friends in college. We were both working for a local pizza place, in the store that was just blocks from the local university campus. My friend, T, was what you might call a gun nut. He owned several firearms, and never left home without one, particularly when he was delivering. One night, he takes a pie to a private home on the other side of campus, on a street with no street lights. He knocks on the door, and it is flung open by one guy, revealing another guy pointing at T with, I swear to God, a spear gun. The adrenaline kicks in, and before they can demand the pizza and his money, he whips his semi-auto AMT Hardballer out of the holster in the back of his pants and goes into a firing crouch. (Pizza hits the ground, of course.) The 2 would-be robbers go pale, and the guy who opened the door slammed it closed, fast. T heard them run out the back of the house and get into a car, which sped away. He calmly put the gun away, picked up the pizza, and came back to the store to report what happened. We blacklisted that address, then later found out it was vacant, and the guys had broken in to use it for the robbery. The order was called in on a nearby payphone.",
        "created_utc": 1530036533,
        "upvote_ratio": ""
    },
    {
        "title": "I thought about quitting my job to deliver pizzas.....",
        "author": "Eight6FiveStudios",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8u04ta/i_thought_about_quitting_my_job_to_deliver_pizzas/",
        "text": "I'm in a very financially comfortable position in my current line of work. I travel a lot for work, never knowing where I'm going to have to catch a plane flight to when I wake up. Recently I've thought about giving up what I have been doing for the past ten years of my life and delivering pizza.\n\nIt seems like it would be a chill way to live life for the next year or more of my life. Between the struggles of being a traveling salesperson and being away from home for sometimes months, I think I would enjoy it. The thought crossed my mind to start a blog about delivering pizzas and how leaving a six figure a year job for my own sanity changed (possibly changed) my life. \n\nThoughts?",
        "created_utc": 1530020762,
        "upvote_ratio": ""
    },
    {
        "title": "Question about ordering online...",
        "author": "Mozart666",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8twfsc/question_about_ordering_online/",
        "text": "Do you guys see that I've tipped for an online order? I had a driver drop my food off and then stand there looking at me in a confused manner. I always include minimum $4 tip when I order online. What's everyone's take on this? Do you see it before you get on the road?",
        "created_utc": 1529980708,
        "upvote_ratio": ""
    },
    {
        "title": "Fool me twice....",
        "author": "Chilibody",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tvkwe/fool_me_twice/",
        "text": "This story happened last summer and I never really got to be the bottom of what happened. \n\nOne night I come inside from my run and one of my coworkers is visibly upset, but it's not clear why. The other employees are all wearing smiles and I begin to inquire as to what happened. \n\nApparently someone had placed an order through our website to be delivered to a house. When the driver got to the door, he knocked and nobody answered. He said the front door was open and the screen door remained closed, so he was able to clearly see inside the house. He knocked again and decided to open the screen door and yell inside for the customer. That's when he saw him. \n\nA man, fully nude, walking around the corner with headphones on and just casually strolling to the door. There were several expletives shared between the two of them and the driver learned that the man had not ordered the food for himself, or so he said. So not only does he not get to successfully complete the delivery and potentially earn a tip, he had the misfortune of seeing a stranger's junk. I'd be upset too. \n\nWe \"blacklist\" the address and eventually just laugh it off. Except we don't run on a computer system and our \"blacklist\" is just a piece of paper. And humans are prone to making mistakes. \n\nTwo or three months pass and I get an order going to the same address. We've all forgotten by now and the person on the phones/who handles online orders lets the order slip through without looking at the list, but I can't really be upset about that. \n\nI arrive and like clockwork, nude guy comes around the corner with his headphones on and it all clicks for me. \"***king hell\" I remark and just go back to my car without saying anything else. They got us. Again. \n\nI get back and yell about how the list exists for a reason and point to the address clearly printed on it, but I know it was equally my fault for forgetting. It never happened again, but the fact that it worked twice on us is pretty sad. \n\nAnyone else have any similar stories happen to them?",
        "created_utc": 1529972532,
        "upvote_ratio": ""
    },
    {
        "title": "Why are y'all crying about tips?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tpies/why_are_yall_crying_about_tips/",
        "text": "[removed]",
        "created_utc": 1529923529,
        "upvote_ratio": ""
    },
    {
        "title": "Question for delivery gods",
        "author": "bellsxo11",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8toatq/question_for_delivery_gods/",
        "text": "Hiya, lurker here and not a delivery guy but I do order a fair amount of delivery. Anyway, is it annoying when you get tipped an uneven amount of money? Like I tip 20% and round up to the nearest dollar. So if my total was 20.18 i would tip 4.82. Is it annoying to get that 82 cents? I never really thought about it. It’s an OCD ritual and I don’t feel like explaining my mental illnesses to every delivery guy ",
        "created_utc": 1529907841,
        "upvote_ratio": ""
    },
    {
        "title": "The most obnoxious customer ever",
        "author": "MarisiaKing",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8toapr/the_most_obnoxious_customer_ever/",
        "text": "We've all got our tales of annoying customers, but this guy takes the cake. \n\nOne Thursday night, I got this delivery for a new customer in a not so great area, but it's still light out so I'm not really too worried. The customer had paid some of his total with a card, with 7 dollars left to pay in cash. I get there and knock, have him sign for it, and ask for the seven dollars. He tells me he had paid for all of it on his card, and I decided not to press the issue. I should mention this guy was a large black guy, taller than me (I'm 6'2\"), covered with tattoos, and only wearing his boxers. I went back to the store to cash in, saw he hadn't paid the seven dollars on his card, and told the manager what had happened. The manager immediately got on the phone and tried to get it straightened out, but the guy wasn't having any of it and cussed the manager out before hanging up. The manager wasn't willing to call the police over seven dollars, so she decided to just eat the loss and move on. \n\nThe very next day the same guy orders again, and it's a different manager working. It's also a way busier night, as it was a Friday, so people were just trying to get orders out of the oven as fast as possible. The customer ordered two pizzas, and I ended up having to take it out to him. He's in his driveway this time, fully clothed, with a bunch of kids. He pays for his food in full, and I leave, glad it went smoothly this time. But I tempted fate, because it did NOT go smoothly. I got back to the store and saw that, yet again, the guy stiffed me seven dollars. The total on the computer screen didn't match the total on the receipt. Do you know why? The guy called the store after I'd left and had another pizza added to his order, cussing out the manager when she refused to change his order since it was already on its way until she gave in and did it. So I couldn't cash in or take any more orders until this guy's other pizza was done and I could take it out to him. I feared for my safety after what happened last time we'd asked him for more money, so I asked another driver to come with me, a driver who has pro-gun bumper stickers on his car, so I knew he could take care of himself. We get to the guy's place, and as soon as we approach him, he shooed us off, outright DENIED he'd ordered a third pizza, and started cussing us out. So we hotfooted it out of there and had the manager take the third pizza off his order so I could cash in. But she messed up which pizza he'd refused, and she took a more expensive one off by mistake, so I got an extra dollar in change, making it 1.09, which I split as best I could with the other driver. \n\nAs a chain, we're not allowed to blacklist customers (if we want to blacklist someone, we have to run it by corporate, and it's ultimately their call; we've only successfully gotten one address blacklisted), but fortunately that guy hasn't ordered again. And it should go without saying the guy never tipped and he got mad both times because I didn't bring parmesan cheese, which he never asked for.",
        "created_utc": 1529907805,
        "upvote_ratio": ""
    },
    {
        "title": "Tonight was the night our entire staff revolted",
        "author": "dragonballgotim101",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tnz0k/tonight_was_the_night_our_entire_staff_revolted/",
        "text": "Starting with a bit of pre-info: I work for a franchise of one of the big 3 &amp; have for almost 2 years. Our franchise owner rarely ever pays us on time &amp; in the last 2 months has payed us with personal checks twice. And because the owner can never pay us on time, he moved the Pay dates back a day to compensate a few months back &amp; still fails to pay on time.\n\nSo today was payday &amp; I opened with our GM who has been running the place since just after Christmas who's turned our store around after the horrible GM we had prior. So about a half-hour after we open, the GM gets a message from the DM that paychecks would be arriving tomorrow at 5 PM. After this, the GM called the owner about our paychecks because people have bills to pay &amp; need the money they earned. The two of them get into an argument &amp; the GM starts throwing other things that our owner has cheated us staff out of such as offering raises &amp; never following through, Holiday pay that was first gonna be on our checks then as separate checks that we never got, Never letting us put in Coke orders so we go months at a time without soda, and the Personal checks for pay. This pisses the owner off to where he starts swearing and the whole conversation ends with the GM being fired &amp; quitting at the same time. Owner tells the GM that the DM is coming in to cover him etc. So the GM not wanting to screw me out of any runs that come in, agreed to stay till the DM came in from the city. as all this is happening, the GM fills in our staff through our Discord chat &amp; here's where the revolt begins.\n\nOur only Insider: quits\n\n5:15 Driver: Strikes &amp; says he isn't coming in.\n\n3:00 Driver: Doesn't show after reading the chat.\n\n6:00 Driver: Asks if we're still open, ends up not showing.\n\n * note that when you include me, that's all drivers*\n\nAssistant Manager: Without my check, my phone's shut off &amp; I have no way of getting a ride for tomorrow.\n\nTakes till an hour later for my first run to come in &amp; it stays slow afterwards. GM says that if someone doesn't show by 3, he shutting the store down. The time comes &amp; we decide to shut down after I finish the 2 runs behind us. I leave with them at quarter after 3 &amp; as I walk out of the store the DM shows up, &amp; the GM leaves. I get back and tell him Insider quit, &amp; the Drivers aren't gonna show. he asked for the numbers that he doesn't have &amp; the owner called the Insider. Insider doesn't put up with the owners BS and it ends with the Insider being told to not enter the store again. Closing Manager comes in 15 minutes late due to his ride &amp; never looked at the chat, so he has no idea what happened. I fill him in &amp; he flips his shit &amp; nearly walks out. About a half-hour after the CM gets there, the DM vanishes. CM is sick of all the BS &amp; decides to shut the store down but doesn't get the chance as now we are in the middle of the dinner rush &amp; he can't.\n\nCM finally gets the chance to do so around 6/ 6:30, but then the DM shows back up to drive as I was only scheduled till 8.  DM offers a bonus to stay the extra 4 hours to close, because He didn't give an amount &amp; I just didn't want to, I tell him I had plans for 9 but ask what he was offering. he said never mind and I get back from my last run at 10 after 8, help with what was coming out of the oven. DM comes back from his run &amp; I tell him I got to go. He then says to the CM, \"Don't take anymore orders, closing the store when I get back.\" He leaves &amp; the CM clocks me out so I can go &amp; I leave. Assumably the store was shut down shortly after. \nIn the time where the DM vanished, the Insider showed up to get the bag of energy drinks he left in the cooler &amp; came with a coffee for the CM who was outside smoking. tells me that he managed to already get hired as a Assist. Manager at the franchise store to the South-East of us. The rest of us are considering jumping to the store to the North-West of us that used to be owned by our owner but was sold a few months back if they have enough openings.\n\nApologies if not formatted correctly, not the greatest writer, &amp; am not use to posting on Reddit.\n",
        "created_utc": 1529903901,
        "upvote_ratio": ""
    },
    {
        "title": "You guys ever get tipped with something that isn't money?",
        "author": "Flavortown9",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tneku/you_guys_ever_get_tipped_with_something_that_isnt/",
        "text": "I got tipped with a beer tonight. just thought it would be an interesting conversation",
        "created_utc": 1529897689,
        "upvote_ratio": ""
    },
    {
        "title": "A new employee is ruining my favorite pizza spot.",
        "author": "GrapeCakes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tmf26/a_new_employee_is_ruining_my_favorite_pizza_spot/",
        "text": "[removed]",
        "created_utc": 1529888095,
        "upvote_ratio": ""
    },
    {
        "title": "A quick little laugh for you",
        "author": "Arokthis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tlcln/a_quick_little_laugh_for_you/",
        "text": "https://www.facebook.com/DocRatComicbyJenner/photos/a.856006901243504.1073741829.533031840207680/1031306610380198",
        "created_utc": 1529878143,
        "upvote_ratio": ""
    },
    {
        "title": "If you have kids at home this summer, your address might be black listed",
        "author": "msciel",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ticd3/if_you_have_kids_at_home_this_summer_your_address/",
        "text": "So around the time summer began we started getting deliveries from kids/teens. A lot of crumbled up bills and confused youths not understanding credit card receipts, it’s fine, that happens with adults too. What isn’t fine is being a chronic non-tipper or messing with the drivers.\n\nTo put the chronic non-tipping in perspective: there was some teenager who would order a single pizza and not tip. No big deal, except that he was ordering almost every day and lived pretty far out on our delivery area. After each driver confirmed that they had all taken a delivery to this guy in the same week and he hadn’t tipped anyone, that was it, black listed. That address can only get carry out now.\n\nMessing with drivers: don’t throw a drink on a driver. Or on anyone, I can’t believe I’m having to type this. A kid thought it’d be hilarious to pour water on a driver from the 2nd story window. And a week later when the parent tries to make a delivery she yelled at *us* for black listing her, saying that it was our job? It’s not our job to get abused by your kid. \n\nLast note that doesn’t fall into those two categories: if your kid/teen is going to order food once a week or more, teach them how to listen for the total and to get the money ready before we get there. My manager is really close to blocking a particular address because we always end up standing at the door for 5-15 minutes waiting on a teenager to run around the house counting up $20 in ones. ",
        "created_utc": 1529852491,
        "upvote_ratio": ""
    },
    {
        "title": "The night that no one tipped",
        "author": "faster_than_sound",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8thw4o/the_night_that_no_one_tipped/",
        "text": "Brutal one last night. 12 deliveries. 9 stiffs. I made more in mileage than I did in tips. So hard to walk up to a house with a smile on your face when you just dealt with your sixth stiff in a row. But you gotta do it. Put the shit eating grin on and say \"thanks a lot\" when that cheap ass  motherfucker stiffs you too. \n\nOh well. There's always next shift, and weed. Glorious weed.",
        "created_utc": 1529848028,
        "upvote_ratio": ""
    },
    {
        "title": "Scammers man...",
        "author": "LastandLeast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tgadj/scammers_man/",
        "text": "Took this lady's order tonight; I noted that she asked for carryout despite having an address on record. I finish her order and ask again to make sure that she wanted to pick the order up and she unequivocally said yes she wanted carryout. \n\nAn hour and a half goes by and she calls back; she hasn't gotten her delivery order. My stores system is such that if you switch it from carryout to delivery the convenience fee won't show up, and she wanted a discount because her pizza would be old by the time it got to her. \n\nI wasn't around to point out the lie so she got the pizza; I definitely told the manager after he gave it to her though. \n\nbut then\n\noh then\n\nShe had to try her luck; gotta have that good pizza\n\nShe calls back almost at close and says I cussed her out and had an attitude (keep in mind our only interaction was me taking her order and the only way I strayed from the script was by asking her to confirm she wanted pickup) . Thankfully the same manager I told about the scam picked up the phone; he was basically next to the phones all night. \n\nHe called her on her BS and told her she was getting blacklisted; \n\nHad it been anyone else she could have cost me my job for some free fucking pizza. \n\nPeople suck. ",
        "created_utc": 1529825210,
        "upvote_ratio": ""
    },
    {
        "title": "Any tips on not having a shit mpg?",
        "author": "RolfIsSonOfShepnard",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tfikv/any_tips_on_not_having_a_shit_mpg/",
        "text": "Got a new car (not brand new) with a digital dash and for the past month I get like 22.5-23 mpg every time I work. Even with Eco mode its still bad and while a full tank is only $30 (once a week) I would still like to make it better. Is 23 normal when delivering? Also when you guys arrive at a house do you idle the car or shut it off. I always idle unless its an apartment and I always turn the car off when I get back to the store unless I know there are tickets already up like on a dinner rush on a Friday, is that good or bad?",
        "created_utc": 1529814927,
        "upvote_ratio": ""
    },
    {
        "title": "Help me stop worrying about being hired by Dominos",
        "author": "ritzmotel",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8tbr2i/help_me_stop_worrying_about_being_hired_by_dominos/",
        "text": "I'll keep it short. I went to the class dominos offers after you apply. Where they explain basic things and dress code and all that. But then the teacher told us that they won't hire drivers with more than two moving violations in the past 2 years. I got a speeding ticket one year ago, then two more in the past 6 months for dumb shit like accidentally turning during a time of day when left turns aren't allowed. So only 3, but more than 2. I need this job bad and can't stop worrying that they won't hire me. I paid all tickets off immediately as well. Do you think they'll still hire me? \n\nEdit: I got the job!! Thank you everybody!!",
        "created_utc": 1529777175,
        "upvote_ratio": ""
    },
    {
        "title": "I cannot break your $50 Bill right at the moment, Oh but you can and you will",
        "author": "Blue_Pizza2001",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8t8aqh/i_cannot_break_your_50_bill_right_at_the_moment/",
        "text": "\nThis post is a mess.\n\nHere:\n\nTonight I had a rude customer, and I just happened to be the only delivery driver at the time. I work for Papa Johns, and policy says that we cannot carry more than $20 in the bag unless if you ask to have a bill broken. P= Blue pizza(me), B= Bitch customer, and M is the Shift Manager\n\nP, Arrives at B's House \n\nP: Hi I have your--\n\n--Cuts Me Off B: I have a fifty Dollar bill \n\nP: Unfortunately due to corprate I can only carry $20 with me \n\nB: Well cant you get me change? \n\nP: I would have to run back to the store(Thats on the other side of town), I can leave the pizzas, take the $50 bill and get your change out here in about 10 to 15 minutes \n\nB: I dont trust your theiving Skimpy ass(all while raising her voice at me)\n\nP: Let me call my Manager \n\n--Manager tells me that the only option would be to take her money and come back. I pass the phone to bitch, Manager and her argue for what felt like forever, Manager tells her that she should have informed us about the big bill, She tells the manager that I was \"Disrespectful, and sassy\", when in reality I was courtious to her.\n\n Afterwards the manager convinced Bitch to give me the $50 bill, Once I got back to the store I got my ass chewed up by the manager, he said that he wasnt upset at me but he was upset at the situation, He basically told me to be as bubly as possible.\n\n Went back. Bitch sent her family member/friend, I count the change back slowly, he doesnt say a word to me, I apologise, go back to the store, call her a bitch, Manager, Coworker, and other worker(from the gas station area of the store) All agree that she was a bitch. Hope I never go back to that house again Kudos to the shift manager for handling everything well.\n\n(Edit: Formatting)\n(Side Note)\nThe shift manager really is not a bad person, He was just upset that this situation even happened, He was very understanding of the situation",
        "created_utc": 1529737812,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys smoke on the road?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8snm28/do_you_guys_smoke_on_the_road/",
        "text": "[deleted]",
        "created_utc": 1529542435,
        "upvote_ratio": ""
    },
    {
        "title": "Not A Pizza Driver, But Here's A Funny Story",
        "author": "96Steelers",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8smvot/not_a_pizza_driver_but_heres_a_funny_story/",
        "text": "I'm not a pizza delivery driver, but I do deliver for Panera Bread. Here's a little backstory with that before I start. Panera Bread just recently started delivering around the time I started there last September. Their deliveries are strictly pre-paid on the app or the website by credit card or gift card so us drivers don't have to worry about counting out change and wasting more time. It does make things easier, but I'm telling you what...until you've worked for Panera Bread, you've probably never seen so many people with 1st world problems...Middle class and rich assholes that literally think they're better than everyone else and can NEVER be pleased.\n\nAnyway, one day I get a delivery order from a customer I had delivered to before fairly regularly. I've only dealt with minor problems with her such as maybe forgetting a fruit cup or yogurt once every 5 times I delivered to her. She ordered very often and usually tipped pretty well. While the line people were putting the delivery bag together for the sandwich and soup, I was asked to call the costumer to inform her we didn't have any more coconut macaroons. Our policy is to let the customer choose another pastry of any kind regardless of price if we don't have any available that they want. I called her 3 times and texted her twice with no answer. My GM told me to just give her a Chocolate Chip Cookie since we got no answer from her, a Free You Pick Two coupon ($10 on average value), and a Free Pastry coupon. Basically $13 in coupons all because we didn't have her coconut macaroon.\n\nFast forward to me arriving. At the time, she worked at this Lutheran Church organization/partnership. I'm not sure exactly what they did but my best guess is they helped raise funds for the church and organized volunteer work. I walked in, asked for the customer. She had already kept me waiting for about 5 minutes or so, but hey, I didn't care too much. It kept me out of the cafe for a little longer. One of the workers there told her that I had been there for a while now, and she screamed out from her office \"Well it's gonna have to wait a little longer! I'm busy!\" I told the other worker I can just drop it off because it's paid for already. At that time, the customer finally comes out, takes the bag into her office, and starts to look at the slip she has to sign.\n\nI politely said to her \"Ma'am, I was told to inform you that we ran out of coconut macaroons. My GM gave you a Chocolate Chip Cookie instead and coupons for a free pastry and You Pick Two for the inconvenience.\" Right then she got this psychotic look in her eye, she ran back to her office, brought the cookie back out, and crumbled it up all over the carpet and screamed her head off \"I DON'T WANT THIS DUMBASS COOKIE!!! I WANT A COCONUT MACAROON THAT I PAID FOR!!! LOOK AT THIS THING CRUMBLE!!! IT'S LIKE A DAMN ROCK!!! IT'S BURNT TO A CRISP IS WHY I DON'T ORDER YOUR COOKIES ANYMORE!!!\"\n\nI told her \"I really don't care, I'm just the driver. If you don't want the thing, take it up with my GM.\" I gave her the number to the cafe, and she went full PSYCHO on my GM. The bits I remember from the grown 30-something woman's toddler tantrum were:\n\n\"Good morning Jessica. My name is Jessica as well and IIIIIIIII AM PISSED!\"....\n\n\"I order from you guys 950 million times every week, blah blah blah\"....\n\n\"I've loved Panera since they opened here over 10 years ago until now...blah blah blah\"....\n\n\"...I mean what kind of business are you running there!!! It's 11:30 AM and you're OUT of coconut macaroons!!!!! What kind of bakery ARE YOU!!!!\"\n\n\"I've had (this obvious made up problem at this time) and (that obvious made up problem at that time) and blah blah blah\"...\n\n\"I've had problems with your male GM, the female District Manager, and the male District Manager blah blah blah\"...This one was hilarious because we only have one GM, a female, and only one District Manager, also a female.\n\n\"I want a full refund and you're gonna give it to me!!!!\"\n\n\"I WILL NEVER ORDER FROM YOU GUYS AGAIN!!!!!\"\n\nOf course, we had to give her a full refund, even though she ended up eating the soup and sandwich and everything else was correct besides the stupid coconut macaroon...oh that fucking macaroon....all this bitching, which happened for 17 minutes by the way...17 MINUTES! All over a $1 coconut macaroon. I don't get what's so great about them. You can buy an entire case of them at any grocery store bakery for $1.\n\nShe finally gets off the phone, I tell her I still need her to sign the slip. She refused and bitched some more. So I wrote a note in front of her saying she refused to sign the slip and demanded a full refund. I got no tip at all and drove back to the cafe. My GM laughed and told me what she was saying on the phone. I told her \"I know...I was there the whole time...\" My GM had the biggest jaw drop. All the managers that were there at the time were laughing and told me my GM kept putting the phone up to their ears the whole time every few minutes during the whole bitching-and-crying-like-a-mental-patient-fest. We still joke about that to this day.\n\nThat's not even the end of the story....Even after she said she'd never order from us again, she ordered from us a few days later to her home address. Another driver took that order. We definitely didn't forget her macaroon this time....buuuuuut of course...she calls in bitching AGAIN...\n\nThe new problem? The driver arrived 5 minutes early.......\n\nFuck you, cunt. Go to Hell you worthless sack of flesh. At this point everyone there has just had it with the dumb bimbo.\n\nThe driver arriving 5 minutes early IS SOMETHING PEOPLE FUCKING STRIVE FOR!!! YOU'RE GETTING YOUR DELIVERY SOONER THAN EXPECTED....You just can't please some people...",
        "created_utc": 1529535901,
        "upvote_ratio": ""
    },
    {
        "title": "The weirdest and scariest delivery I ever had.",
        "author": "Throwawayanalflakes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sgdr6/the_weirdest_and_scariest_delivery_i_ever_had/",
        "text": "About one year ago I took a delivery that I will never forget. It was around 9 pm on a Saturday and I had to take two extra large pizzas to an address that was outside of town in the country. I pulled down a very long gravel driveway up to a run down farm house with one porch light acting as a beacon. As I walked up to the house I noticed Halloween decorations still up on the porch (it was the middle of June) one of which was a grim reaper sitting in a rocking chair. There was no door bell so I knocked on the door, no answer. Knocked again, no answer. Right as I was about to knock for a third time the door slowly creacked open. A decrepit male voice spoke \"hold on a sec\" a light came on  revealing an old man in his underwear. The guy must have been in his 70s or older . He had a terrible hunch and stood no taller than 4'11to 5ft. He was grinning revealing yellowish black teeth. I told him the total was $17.xx. He asked if I could carry the pizzas inside to the kitchen (normally I would say no, but I didn't want this oldtimer to hurt himself). The house was immaculate from what I could see. The old man asked me to wait in the hallway so he could light a candle since the kitchen lights were out (I know weird right?). As he lit the candle I could see five pickle jars sitting on the counter in front of me. The old man asked me to put the pizzas on the floor next to the counter. So I bent over and placed them on the floor. As I was getting up I heard an exhale and the candle went out. I asked the old man to light it again so I could see to no response. I heard the sound of a jar opening followed by the clicking of a lighter. The candle was lit again revealing the old man holding a pickle. He said that \"this is Margery, she isn't supposed to be awake right now but since we have a guest who brought food ,it is ok\". At that moment I wanted to get TF out of there but couldn't for some reason. He walked over to me and handed me the pickle and told me to \"put her next to the pizza box\". I did, and I fucking hate pickles. He then paid me and a booked it out of there.\n\nEdit:- He did tip me though",
        "created_utc": 1529479578,
        "upvote_ratio": ""
    },
    {
        "title": "Tip?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sg7ei/tip/",
        "text": "[deleted]",
        "created_utc": 1529477478,
        "upvote_ratio": ""
    },
    {
        "title": "Douchenozzle customer",
        "author": "Platinum_Junkie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sg5qu/douchenozzle_customer/",
        "text": "So I literally just got home from work and had to share this story. It's been a fairly average night, but the last hour was pretty slow, so my manager and I had time to do all of the cleaning and whatnot in order to close at midnight and go home. I finish all of my tasks and glance at the clock: 11:58pm. Not a second later an online order comes in. My manager and I look at each other and roll our eyes. I'm thinking to myself, oh well, maybe it will be worth it tipwise. I look at the address and it's a known stiffer. Fuck! It's a big order, so my manager's pissed that he has to make all of these pizzas. Three taco pizzas, two mediums and a large. One of the mediums half without onions. He accidentally puts onions on the whole thing, but realized it and has to pick half of them off. Guy also orders a smores cookie, extra ranch, root beer, orange soda, and two waters. We stand around shooting the shit while the pizzas bake cause there's not much else to do. When the pizzas come out, he puts the lettuce, tomatoes, cheese and chips on them and bags them up. I leave the store and head over to this guy's apartment. $55 worth of food, so I figure this guys having a party and maybe I'll get a tip anyway. I get there and call him from my car to tell him I'm outside. He sounds super stoned and asked me to \"review\" his order. I read everything back to him from the receipt, and he's like \"I only ordered the large taco and the smores cookie\". WTF!?!? I tell him I have to call the store and I'll call him back. I talk to my manager and explain what's going on, and of course he's pissed too. He gives me the new total and I call the dude back to tell him to come down and get his food. New total is $25.95. Guy gives me five fives and a one and says \"thanks\" and heads back up to his apartment. I got a nickel tip and a free taco pizza out of it, manager took the other one. SMH at some people. ",
        "created_utc": 1529476932,
        "upvote_ratio": ""
    },
    {
        "title": "I came back with $0.63 less in my pocket after a delivery.",
        "author": "clarkkent1521",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sfgll/i_came_back_with_063_less_in_my_pocket_after_a/",
        "text": "It was a cash order for a single medium pizza for $13.63 to a gated golf community. Very decently sized houses. I get to the house and ring the door bell. I hear several teenagers talking in the kitchen or somewhere. No one comes to the door. I ring the doorbell again and knock on the door. No one comes, but I can still hear them. One of them finally answers the door after I ring the third time. I tell him $13.63 and he hands me a 20 dollar bill. I hand him the pizza and six dollar bills. I wait for him to tip me from the six dollar bills, but he says, \"you don't have exact change?\" At that point I knew he was a non-tipper, and also he expected his remaining 37 cents. I told him I don't carry coins. I also wanted to tell him \"people usually tip me, especially when I'm bringing them food late at night to their parent's posh house,\" but of course I didn't say any of that. Instead, I just gave him another dollar bill and said, \"just take it.\" He quickly took it without saying anything and closed the door.",
        "created_utc": 1529468992,
        "upvote_ratio": ""
    },
    {
        "title": "Do you ever praise the customer for a big tip?",
        "author": "wastinmytime12",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sdnqw/do_you_ever_praise_the_customer_for_a_big_tip/",
        "text": "If there was a delivery with a pre tip on it I’d always reaffirm that their order was placed ahead because of the tip to encourage behavior. Anyone else do that?",
        "created_utc": 1529451931,
        "upvote_ratio": ""
    },
    {
        "title": "What is the appropriate tip?",
        "author": "sth2256",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8sd5hz/what_is_the_appropriate_tip/",
        "text": "Non driver or pizza person.\n\n20% or $5 whichever is higher has been my go to. Yay or nay?",
        "created_utc": 1529447537,
        "upvote_ratio": ""
    },
    {
        "title": "Hey! You’re that driver that can ....",
        "author": "shebua",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8s5dwr/hey_youre_that_driver_that_can/",
        "text": "About 20 years ago I was in college and got a job at pj’s working pretty much every Friday Saturday and Sunday night as a closing driver. Really sucked always missing out on shit but the people I worked with were pretty cool and I made enough working those three nights to be able to live. Store I worked at was in a smaller college town 23k + 5k students and many of the deliveries were to the college or close to it. One Saturday night it’s nearly closing and just me and the manager left. I had been out almost straight and not had a chance to take care of any of my closing shit (dishes mop etc). I get back to the store with like 10 minutes to go and there is one last delivery left. A single small pie for about $6.30. Boss sees the look on my face and says it’s the last one. \nI get to the address - shitty 3 story apartment house, climb the stairs to the third and knock. No answer but I can hear people so I knock a lot louder. Guy comes to the door and then just yells out ‘pizzas here’. So I’m standing there thinking about all the shit I have to do still when I get back and this guy finally shows at the door. I step inside while he writes me a check for exact change and hands it to me. Then he says ‘if you want a tip you have to come have a beer with us’  I’m like - I can’t I’m working, I drive for a living and I need my job.  So he just repeats himself. I’m thinking ‘asshole’ but say ‘fine’ and follow him through the apartment and into what looks like a closet but is actually a stairwell to the attic. \nI get up into the attic and realize they had a keg and there was like 50 college kids there. So my customer pours a beer into a cup, hands it to me, and starts pouring one for himself.  Now I am not a world class beer pounder but I can hold my own and I wanted out of there so I tipped it back and sucked the beer out of the cup finishing it before he was done pouring his own beer. I immediately present the cup and demand my tip. Guy was wasted or something because he totally loses it saying how it was the fastest he has ever seen anyone drink a beer and causes a huge scene. I get my tip $3 and get out of there. \nWhen I get back to the store I find that my boss has taken care of most of my shit for me so I finish up and cash out thinking it didn’t turn out so bad after all.  \nThe next Friday I am on the clock again and take out a triple, 2 at the college and one close by at an apartment building. Drop the first one at the freshman dorm and move to the next - a motel 66 style dorm for on campus non freshman. Small party going on inside and while the customer is paying me for the order someone in the room shouts “ hey your that driver that can pound beers wicked fast!”  caught me off guard but I recovered with a quick I hold my own and a speedy exit. I get to my last and this time it’s the girl at the door. “ aren’t you that driver that drank that beer really fast at that party last weekend” I didn’t know how to react - she was kinda hot and I liked being recognized but was also a bit nervous.  \nTurns out I was right to be nervous - this was before you tube but somehow it went viral. For months every weekend i was met with “hey - you’re that driver that can drink beer really fast” usually followed by “you gotta come pound a beer with us”. At first I really struggled with it and my tips suffered until I learned to say - I can’t man, on the clock driving, but I will take one for later!   For the rest of the school year I had free beer every weekend cause no one ever said no to me taking one for later and for some reason giving me a beer was pleasant for them cause my tips bounced back too.   \nMy boss did eventually find out - and I wasn’t fired but he did say if he ever caught me drinking on the clock I was done. \n\nSometimes I really miss those days.... ",
        "created_utc": 1529376004,
        "upvote_ratio": ""
    },
    {
        "title": "Tips/Stiffs at the Same Address",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8s0w8v/tipsstiffs_at_the_same_address/",
        "text": "[deleted]",
        "created_utc": 1529339595,
        "upvote_ratio": ""
    },
    {
        "title": "(Non-Driver) I think I got a driver fired, was I wrong?",
        "author": "naterr3343",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rzx6j/nondriver_i_think_i_got_a_driver_fired_was_i_wrong/",
        "text": "This happened a few weeks ago...\n\nI was driving down a relatively busy street and there was a driver from a local chain behind me for a couple minutes.  He got on my left hand side,  and without warning turned RIGHT across the front of my car from the left lane!  \n\nI had to slam on my brakes to avoid t-boning this guy and he spiked his brakes, skidding into the far curb of the side street he cut me off to turn down.  He then proceeded to burn out down that road,  complete with some and squealing tires. \n\nSince he had a topper on his car,  I knew where he worked and called the location as soon as I got home.  With it being nice out,  and the fact that kids like to bike/ people like to walk their dogs on this street and accompanying side streets,  I felt that this guy's manager should be made aware and he should be reprimanded. \n\nI explained what happened (coincidentally the locations district manager was at the store when I called)  and she agreed with me that this was unsafe and unacceptable.  She told me that it's not the first time it has been reported regarding this employee and that drastic measures will be taken.  I said,  \"I'm  not trying to get anyone fired,  just wanted him made aware that he has to be careful. \" to which she responded, \"he got himself fired,  don't feel bad. \"\n\nWas I wrong?  I mean,  this dude could've caused a serious accident on a busy road.  But we're not in the most high income area,  and I'd hate to take food off of someone's plate. \n\nTl; Dr: Driver almost caused a serious accident,  so I called his boss and was told he would be fired.  I'm now feeling guilty. ",
        "created_utc": 1529332100,
        "upvote_ratio": ""
    },
    {
        "title": "The Time I Got Stiffed Twice on the Same Delivery",
        "author": "JustABilly",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rziqi/the_time_i_got_stiffed_twice_on_the_same_delivery/",
        "text": "I delivered to this one lady who was notorious in our delivery range for never tipping, so I lowered my expectations going in, but it still sucks to get no tip even if you know it's coming.\n\nAnyway, I got there, allowed her to sign, and as expected- No tip. Anyway, she went inside, I was back at my car ready to get in, when she opens the door again and screams out to me. \"Hey, did I tip you?\"\n\nI thought, hey, maybe she just forgot and she's going to give me a few bucks. So I said \"No, you didn't.\"\n\nShe said \"oh okay, cool\" and went back inside.",
        "created_utc": 1529328702,
        "upvote_ratio": ""
    },
    {
        "title": "The night I learned that my car-topper was not a blank check to break the law",
        "author": "Pickphlow",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rzb6k/the_night_i_learned_that_my_cartopper_was_not_a/",
        "text": "Haven't delivered for about 8+ years, but still have fond memories of my times driving around trading people hot food for cash. Wanted to share a story I remembered recently about getting pulled over.\n\nFor the longest time, I was convinced that the car topper was basically a \"police please leave me alone sign.\" I was about 20 years old, and drove like a 20 year old idiot. Drove a bit too fast, sped through yellow lights, and would pull the occasional illegal u-turn to get to my deliveries faster. Never seemed to have any problems with the local police, and so my dumb ass figured they just respected a working man doing what he needed to do. One day, I'm heading to a delivery about 15 minutes away and hit the gas on a long straight road (probably going about 65 in a 40mph zone). Cue flashing lights in the rearview, and I'm blown thinking I'm going to basically be dumping tonights tips into a speeding ticket. The cop comes up to the window and immediately starts in with \"do you know how fast you were going?\" \"No sir, but probably a bit too fast.\" He agrees, grabs my license and registration and heads back to his car.  But, as he's walking back to his car, I hear his radio crackle loudly and suddenly a beat up old sedan comes whizzing by us with two police cars in close pursuit. He runs back up to my window, tosses my license and registration into my lap and shouts \"tonight's your lucky night kid!\" as he runs back to his car to join the pursuit. I learned later that some guy got pulled over for a DUI and decided to do a runner.\n\nWas certainly my lucky night, and you better betD I drove much more carefully after that!!",
        "created_utc": 1529326844,
        "upvote_ratio": ""
    },
    {
        "title": "Why can’t you read my mind?",
        "author": "kyscco24",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rykc0/why_cant_you_read_my_mind/",
        "text": "Last delivery of the night, lady ordered 2 family big dinner boxes. Get all the way to their house, at the very edge of our delivery zone. She starts by screaming about how I better have brought her garlic butter. Now, I had made sure to triple check the delivery slip before leaving the store, and there were no sauces listed. When I mentioned that fact, she screeched that “you bastards always forget the sauces”. I apologized for the inconvenience, and restated the price. She paid, gave me a 3¢ tip, and said she will be calling my manager in the morning ",
        "created_utc": 1529319002,
        "upvote_ratio": ""
    },
    {
        "title": "GPS is always a few houses off",
        "author": "VeXedZenith",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rwwil/gps_is_always_a_few_houses_off/",
        "text": "This is an issue because house numbers can often be incredibly hard to find, even more so at night because people don't ever have their lights on. My GPS usually takes me to the right street, but can be anywhere from 2-15 houses off. This is an even bigger issue with hotels because there are sometimes 3-5 hotels in the same area, and the GPS brings me to the wrong one. Is this normal or should I get a new GPS?",
        "created_utc": 1529297788,
        "upvote_ratio": ""
    },
    {
        "title": "She thought I was her grandson",
        "author": "KirbyDogs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rvy8e/she_thought_i_was_her_grandson/",
        "text": "This just happened last night and I was so full of confusion and laughter afterwards.\n\nSo I work for a local cookie delivery place. It's quite popular. We have this online system where you can gift cookies to anyone in our range and leave a note for the recipient.\n\nI deliver a box of chocolate chip cookies to this older couple who look in their late 50s or 60s. I could see in the recipient notes the names of who it was from.\n\nUpon this nice woman answering her door, I say \"Hey I have a cookie delivery for you guys!\"  (Their names inserted)\n\nWith a smile and a look of surprise she says, \"Oh, are these from Mr. Massey?\"\n\nI pause for a moment then say \"Who?\"\n\n\"Mr. Massey?\"\n\n\"Oh, uh, I don't know, but I have a note here that says 'Happy Father's Day! Love, McKay and Tessa!'\"\n\nShe looks slightly confused, like I was joking, or more like she didn't believe me or something.\n\n\"You sure?\" she says smiling.\n\n\"Uh, yeah, that's what it says here at least, haha.\"\n\n\"Who are you?\" she says still smiling.\n\nI am so confused. I think maybe I went to the wrong address or something. But I proceed to give my name and the cookie place I work at, which is like 2 small towns above this particular delivery.\n\n\"Oh.\" I think it finally clicks with her. \"You look just like my grandson.\" Her husband then comes in at that time. \"Look, doesn't he look just like Nathan?\" The man lets out some noise somewhat of agreement.\n\nI am awkwardly standing there smiling stupidly. \"Ohh, hahaha... That's interesting!\" I don't know what else to say, because I could see how dumbfounded she was.\n\nI wish them a good night and to enjoy their cookies but I get stopped *multiple times*...\n\n\"So where are you from?\"\n\n\"Uh, same town as the cookie place\" (I said the real name obviously)\n\nI think her grandmother instincts were still circulating since she first saw me at the door because as I'm about to leave she says \"You be careful driving out there, it's dark!\"\n\n\"Thanks I will, haha.\"\n\nI start walking down the steps.\n\n\"OH watch your step! Don't fall!\"\n\n\"Yep, thank you.\"\n\nI left in a such a confused state. Apparently, I am a striking image of this woman's grandson and she totally thought I was. I almost think she still didn't believe me because of the way she acted. It sunk in, then I laughed my way back to the store.\n\nTL;DR: Customer thought I was her grandson, and took a while to grasp the fact that I actually was not and had never seen her before.",
        "created_utc": 1529287864,
        "upvote_ratio": ""
    },
    {
        "title": "Domino's NEW civic stand Paving for Pizza.",
        "author": "racketmanpizza",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8ruz8l/dominos_new_civic_stand_paving_for_pizza/",
        "text": "OK these guys get a 40% tax cut while we peons get 1% and the best thing Dominos can come up with fixing pot holes?????  Yeah I get it -- potholes do cause a lot auto damage BUT still.....\n\nhttps://www.simplemost.com/dominos-pizza-is-on-a-mission-to-fix-potholes/\n\nWhy not do something nice for say YOUR EMPLOYEES, like raises, and somewhat decent benefits, better vehicle compensation, less whining about being sooooo poor.",
        "created_utc": 1529278308,
        "upvote_ratio": ""
    },
    {
        "title": "The day I forgot the same customers' order...twice.",
        "author": "universityofnonsense",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rt86e/the_day_i_forgot_the_same_customers_ordertwice/",
        "text": "So this happened years ago before mobile phones were commonplace.  I was delivering pizzas as a summer job in my hometown - a resort town on Lake Michigan with a sizable population of second-home owners. I was 21 and absolutely loved the job because it was pretty carefree, I got to drive around \ninstead of being cooped up in a building, meet interesting people, and make pretty good money for that point in my life.\n\nIt was a typically slow day, Monday I think, and the manager only scheduled one inside worker, who was also the assistant manager, and two drivers. The second driver no-showed/no-called, leaving me as the only delivery guy. We decided to go ahead with business as usual since it was normally a quiet day, and I certainly wasn't going to complain about the potential for extra tips.\n\nThings started off fairly well and we burned through a few hours before things went straight to hell. We started getting the usual dinner rush, except for some reason our volume was MUCH higher than normal for that day of the week. It didn't take long for orders to pile up, with several hitting the 30+ min mark before they even got out the door. Eventually, I'm taking 3-4 orders at a time, trying to pair runs geographically while still addressing the oldest orders first.  Every time I came back to the store it seemed like there were a half dozen new orders.  I grabbed three orders and their order tags for the western edge of our delivery zone, including one in a fancy new housing development known for high-dollar homes and wealthy summer residents, which was my first stop.\n\nWhen I arrived at the house three kids, the oldest no more than 6 or 7, perched like sentinels in an enormous bay window erupted in joy at the sight of the pizza guy. I grinned a little and reached over to get their pizzas from the hot bag and discovered to my horror that I did not have their pizzas.\n\nMaking matters worse, the kids had clearly seen me and their exuberance surely alerted their father, who'd just opened the door to greet me.  I sheepishly exited my vehicle and approached the door.\n\n\"Sir...I'm really sorry...I think I forgot your pizzas.  I just realized it when I pulled in,\" I said.\n\n\"Huh?\" replied the customer.  In the background I could hear his wife trying to wrangle the kids and get them situated for dinner. Two of them were yelling \"Pizza! Pizza!\"\n\n\"I don't have your pizza - I think I left it at the store...we're busy tonight and I'm the only driver on and I just forgot it while trying to get the rest of my orders together.  I'll go straight back and get it, I'm really sorry.\"\n\n\"Well....how long is it going to take you?\" he replied, clearly annoyed.  \n\n\"Probably a half hour - I'll throw in a bottle of soda and some vouchers, I'm really sorry\" I said, wishing I could suddenly uncover the secrets to teleportation.\n\n\"Uh....well alright. Hurry up please\" he replied.\n\nI zoomed back to the store, cursing myself the entire way. Meanwhile I had two other orders that I couldn't reasonably deliver without breaking the 30 minute promise I'd made to the guy, who was undoubtedly engaged in the unpleasant task of explaining to his children why there was no pizza when they'd CLEARLY seen the pizza man arrive.\n\nI burst back into the store and commented to my co-worker that I'd forgotten a customers' order.  He laughed and pointed out that the orders hadn't slowed down and there were several more in the queue.  He said he was telling people that delivery would take an hour or more due to short staffing but people still wanted delivery.  Bear in mind this town is not particularly large - the furthest reaches of our delivery area was 5 or 6 miles from the store and topped out at about a 15 minutes drive. Nonetheless, people preferred to wait up to an hour rather than drive their lazy asses to the pizza store and pick up the pizza.  \n\nI threw up my hands in frustration and threw the order I'd forgotten in a hot bag, setting it to the side while I scanned the monitor for any other orders I could take with me.  I grabbed two more orders and sped off to the customers' house.\n\nI triumphanty arrived 23 minutes after I'd last left his house. This time, he was waiting by the window.  As before, I reached over to grab his order and discovered to my sheer horror that I'd forgotten it again.   \n\n\"No fucking way!\" I shouted to myself as I furiously looked through all the other orders. Nope - definitely forgot it again.\n\nI looked up to see the guy waiting at his open door. Since I'd yet to discover the mysteries of teleportation I began wishing for the ability to time travel, become invisible, or ultimately make pizza appear from thin air.  Failing at all endeavors, I exited my car and in the most deferential and groveling manner approached him to explain that I, again, did not have his pizzas.\n\n\"WHAT?  HOW!?\" he shouted while turning an impolite shade of red. \n\n\"I don't know.  We don't have enough staff tonight, I'm trying to keep up but in my rush I left your order again\" I said in the meekest and most forlorn voice I could muster.\n\n\"I'll go straight back again, if you still want the pizzas.\" I said.  In the background, I could hear hungry children crying as their dreams of pizza were snatched cruelly from their young hearts for the second time in less than an hour.\n\n\"Do what you gotta do\" the customer replied, with obvious contempt. He gazed into the distance from his expensive doorstep, probably wondering why his life with plagued with such riff-raff as this pathetic pizza boy. \"This is the story I'll tell my children when they don't do well in school,\" he probably thought, \"The parable of the idiot who couldn't even deliver pizzas right\"\n\nI didn't wait around for him to verbalize his disdain any further and once again sped back to the shop. The assistant manager greeted me with the customer's pizza and said \"I realized right after you left that you'd forgotten it again.\"  \n\n\"Yeah, I can't believe I did that, this night is nuts.\" I said\n\n\"Yeah I told customers we're suspending delivery tonight because we're short-staffed.  Just finish out the existing ones and we'll do takeout only until close.  By the way, how was that guy when he realized you forgot it twice?\"\n\n\"Eh, I mean he was really pissed.   That was obvious.  I feel so bad - he's got a bunch of little kids who clearly want pizza more than basically anything else right now\"\n\n\"Yeah,\" my co-worker replied, \"he called after you left and was really, really angry. I told him that it's only two of us and we had one guy no-show. He said he just didn't understand how this could happen, how it was so appalling and one of the worst things he's ever experienced.  He went off...  Anyway, his pizza is free and I have him like $50 in free pizza vouchers.\"\n\nOn my third trip the house there was nobody waiting in the window.  The customer greeted me calmly and took his pizzas without a word.  The house was eerily quiet - no trace of the rambunctious kids from before. I'd hoped his free pizzas, my contriteness, and my co-workers' explanation of why things had gone so awry would maybe lead him to toss a few bucks my way as a gesture of sympathy but, unsurprisingly and quite deservedly, I received $0 as a tip. The customer gave me one last look of disgust as he shut the door and retreated to the comforts of his million dollar house.  I trudged back to my ten-year-old Chevrolet Lumina, angry with myself and the driver who no-showed.  Eventually, the story became one we all laughed about and remains one of my funniest/worst days at a job that I enjoyed a lot more than I probably should have.\n\n*grammar edits\n\n",
        "created_utc": 1529262404,
        "upvote_ratio": ""
    },
    {
        "title": "Any pizza guys here see an ownership change in their restaurant?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rpg27/any_pizza_guys_here_see_an_ownership_change_in/",
        "text": "[deleted]",
        "created_utc": 1529218833,
        "upvote_ratio": ""
    },
    {
        "title": "Player One has re-entered the game.",
        "author": "faster_than_sound",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8rgxvi/player_one_has_reentered_the_game/",
        "text": "First night back in the pizza biz in 4 years. Was an assistant manager for 7 years. Came back as a part time driver. Made bank on the first night! About to crack a beer to celebrate my newfound spending money. Cheers fellas!",
        "created_utc": 1529121880,
        "upvote_ratio": ""
    }
]