[
    {
        "title": "Lady orders 8 pizzas",
        "author": "Depuceler",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6h0m0f/lady_orders_8_pizzas/",
        "text": "But expects 9. I get called in today, immediately walk into a hellstorm at 11am. Our store is pretty understaffed and I am one of the few people able to do everything. One of our drivers is cutting and I find him sorting through pizzas trying to figure out why the ticket says 8 pizzas but 9 were made. I find a strange incorrectly topped supreme and put it away and check off all the pizzas on the order. As Im doing this a customer enters and asks for the order. I hand it off to her and read through the order, easy. 2 hrs later she calls back. Area manager and Franchisee are in store. Really don't want to attract negative attention here.\n\"I ordered 9 pizzas where is the 9th!?\" I find her previous ticket.\n\"Uh sorry maam, your ticket only says 8\"\n\"No thats incorrect I definitely ordered 9, but I paid for 8. The 9th was another meatlovers\" \nTicket has 1x meatlovers \nAt this point I consider whether climbing in the oven or disconnecting the gas line would be the fastest death.\n\"Okay maam well since you didnt pay for the 9th I can set that up as a paid delivery\"\nI can hear her telling a friend in the background that she totally ordered 9 but paid for 8.\n\"I am a teacher at a school and there are kids that are hungry because you didnt give me 9 pizzas.\"\n\"Sorry maam but we just made the order as we recieved it and it was paid for, is it too late to take a delivery order for the kids?\"\n\"I guess next time I'll have to order more\" and hangs up.\nProbably not the best solution, but we made no error. At least she didnt want to escalate the issue and at least admitted her fault.",
        "created_utc": 1497367999,
        "upvote_ratio": ""
    },
    {
        "title": "When the costumer is \"tired of seeing you\"",
        "author": "whipbryd",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gyzmm/when_the_costumer_is_tired_of_seeing_you/",
        "text": "This happend last year, as I just recently found this subreddit. (And it's also my first time posting on reddit, yay!)\n\n\nI used to work for Joey's Pizza in germany, wich does now belong to Domino's. \n\n\nOne day I had a delivery to a apartment building, including a pizza, pizza buns and garlic dip. I took the heating bag out of my bike and rang the main door. When I was opened, half way up the stairs I noticed that I had forgotten the garlic dip. I remembered that the protocol expects me that if I make a mistake I should act in a way that I will have more work but not that the customer gets his meal any later than necessary. Plus, I would have to ring the bell a second time and the costumer would ask why. So I decided to go upstairs further. When I arrived at the costomers appartment, I handed him the pizza and the pizza buns, cashed and told him that I would be right back because I forgot his garlic dip in the bikebag. He said okay and I quickly descended to the ground floor. So that I wouldn't have to ring again, I put my cap inbetween the lock of the main entrance. I went to my bike, took the garlic dip, took the cap out of the lock and rushed up the stairs, as I know that I am already wasting time. At maximum one and a half minutes passed since I talked to the costumer. I rang the bell of this appartment, and nothing happend. \n\nI rang again.... nothing. \n\nI knocked.... nothing. \n\nI stood there for about 2 minutes, ringing and knocking, I knew that I didn't have time for this. \nSo I put the dip in front of his door, rang two more times and went back to the store.\nAbout an hour later, my shift was going to end. I was already checked out and only had to leave the room when the phone rang. Since everybody was busy, the PM asked me if I could pick up, although I was already checked out. \n\nI did it, because I quite like picking the phone and taking orders. \n\nI picked up and responded with a shockingly nice version of \"Welcome to Dominos, this is [me], how can I help you.\"\n\nA womans voice answered. \n\n\"Yeah, hey, uhm... my boyfriend recently ordered a pizza and pizza buns, but the driver forgot the garlic dip. He went down getting it, but never showed up.\" \nI was suprised, as I had nearly already forgotten it. \n\"Wow... yeah... that was me. I rang at your door but you didn't open.\"\n\n\"And what did you do?\"\n\n\"I placed your dip in front of your door, as I had to leave at some point.\"\n\n\"WHAT!? What kind of IDIOT are you that you fail such a simple task!?\"\n\nI started talking in a serious, defending voice, almost getting a bit loud. \n\n\"Wait, no! This is NOT my fault! I DID rung! You didn't open!\"\n\n\"Yeah, maybe we didn't open because we are tired of seeing you.\"\n\n\"wha.... what kind of B****HIT is THAT? This is no valid argument!\"\n\n\"What counts is, that we now have to eat your cold sh*t because we thought you would show up at some point.\" \n\nI tried to calm myself.\n\n\"I am sorry for the inconvienience, but it was definitley not my fault! And why do you call so late?\"\n\n\"Yeah, I can see how you're sorry. I thought you would get your job done at some point! Thanks for nothing! Bye!\"\n\nI was about to drop the phone back on it's charging station, when I noticed my boss (the leaderess of the store, not the PM) standing beside me, having heard all. (Well at least, heard what I said) \nI supposed some commentary like \"Don't let you get down by this, some people are assholes.\"\n\nBut instead she said \"Have you gone insane? You can't talk to a customer like that! What were you thinking!?\"\n\n\"You didn't hear what she was like. She just talked nonsense and insulted me.\"\n\n\"I don't care what she told you! If we lost this costumer, we lost a four-digit amout of money! The average costomer spends about 5000€ in his life at our store!\"\n\n\"That value sounds rediculus, honestly. And no matter what you say, I will not be friendly to someone insulting me.\"\n\n\"Oh yes, you will! This discussion is over now! P*ss off before I decide to hold you liable for the lost income!\"\n\nIt was the only time I cried at home because of work. \n\nEDIT: Added double Line breaks, as it seems to be necessary for formatting on some devices\nEDIT2: Changed some spelling errors, turning the cosplay convention back to normal people\n",
        "created_utc": 1497349297,
        "upvote_ratio": ""
    },
    {
        "title": "Lying costumers (or so I thought)",
        "author": "Boobporn69",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gyio9/lying_costumers_or_so_i_thought/",
        "text": "Apologies in advance, typing on mobile. \n\nSo I had a delivery. 1 pizza, a salad and a two liter. Easy, put the salad and two liter in a bag, pizza in the insulated bag and I'm off. Get there, give the person the pizza and the bag. Easy. I come back to the store and my manager says\n\n\"Yo these people just called and said they didn't get their salad can you run it out to them?\" \n\nAnd I'm like \n\n\"What the fuck, that's bullshit I'm CERTAIN I gave em their salad what a bunch of cunts. Like they're literally lying what the fuck.\" \n\nAnyway I took the new salad out to the car and it turns out the original salad slid out of the bag and was sitting on the floor in the back. Not sure how I missed that when I gave them a saladless bag but I ended up just giving em both salads to make up for my incompetence. \n\nYou guys ever had any situations like that, when you were pissed at a costumer/coworker and it turns out to be entirely your fault? \n\nEDIT: they were also dressed up in funny costumes. \n\nEDIT 2: The last edit was a shitty joke based on my typo. ",
        "created_utc": 1497341381,
        "upvote_ratio": ""
    },
    {
        "title": "If you get a pizza, B E H O M E.",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gyigw/if_you_get_a_pizza_b_e_h_o_m_e/",
        "text": "Remembering stories as I'm on vacation.\n\nSo I'm working as a morning driver and I get an order to take one medium pepperoni pizza to a house by one of the elementary schools.\n\nStandard order, pepperoni pizzas are always shitty because you're never going to get a good tip on those, especially when its a medium. But it's morning driving so meh.\n\nDuring this time, we had an hour long delivery time when they placed the order. There were about 4 orders on the screen, but the second driver came in, and I took a double pretty quickly, so we managed to get the screen clear with just that one order in about 20-25 minutes. \n\nGood for us, we get to deliver it early.\n\nSo I drive my little dinky ass pepperoni pizza to this house in a very okay area, and I knock on the door. No response. So I go through my usual, double check the address, knock again, call with no message, knock again, and then I call a second time.\n\nA young girl with a thick Ethopian accent answers the phone.\n\n\"Hello?\"\n\"Hi, this is CDFReditum from Pizza Hut, I'm here with your pizza\"\n\"no\"\n\nbitch what do you mean no\n\nSo we go through the predictable conversation when people assume that the expected time means that we'll come exactly in 60 minutes rather than \"we say 60 to be safe\"\n\n\"You said 60 minutes on the phone!\"\n\"Yeah, but we managed to get things done quick so we got here a little early (A little admittedly being about 30-40 minutes early)\"\n\"Well we're not home we're at church\"\n\"(&gt;wednesday morning) Oh okay! Well when will you be home? I can wait for a little bit!\"\n\"30 minutes!\"\n\"a\"\n\". . .\"\nI knew that I had to pull the plug. I knew that I had to do what I hated doing.\n\n\"Okay so I'll head back to the store and bring it back in about 30 minutes.\"\n\nNote that I don't really get extra mileage for taking back a pizza. Sometimes my managers will be able to get me the extra mileage by CSing the 1st order and re-entering the order as a separate thing (which is also nice because it doesn't screw up delivery times). But I guess I have to do it.\n\nSo I pop back to the store and we're hitting the usual stride of orders on a wednesday early afternoon, which is like an order every 20-30 minutes. Good, I can make the delivery order, deliver it, come back, and pop over to that other house.\n\nThe phone rings\n\n\"Hi welcome to Pizza Hut, will this be for delivery or carryout!\"\n\"HELLO WHERE IS MY PIZZA\"\n\nMy time has come.\n\n\"Oh you must be the house I called earlier! It's sitting hot and ready in our oven right now, and I'll be driving it to you right now\"\n\"You guys said 60 minutes!\"\n\"*re-explaining the situation*\"\n\"Well we won't be home for another 45 minutes!\"\n(NOTE: It was about 10 minutes before the order was due, which is pretty standard delivery when things are on time).\n\"O-Oh.\"\n\nidk why we have this pizza. idk who wants to eat this pizza. It's an hour old in this oven, it's a single pepperoni pizza, and apparently the daughter ordered it for herself.\n\nBut man my manager can't do anything about it. I have to take this. This has become the brunt of my day. By god, it is my solemn duty to give this Ethiopian girl her medium pepperoni pizza delivered to her.\n\nOf course when I go in they're not ready to do anything. It almost seemed like a surprise that they were getting a pizza, they had no money on their person, took forever to find their purse, some 3rd unrelated person ended up paying for it, the usual stuff when the world is in the mood to give me no tips.\n\n$2 tip.\n\nPlease, for the love of god, when you purchase a delivery, please be  home. If you want it delivered at a certain time, then do a future order. (Arguably you could say that they might have wanted to do that but couldn't because of the hour long wait time, but they weren't home at that time either so ???). If you REALLY REALLY REALLY want to go out before your pizza comes, I'd say that your safest bet is to order the pizza 10 minutes before (MAYBE 20 minutes if the delivery time is high) you get home. It takes 10 minutes to make a pizza.\n\nPlease\n\nI know you want to be smart and beat the system and have a fresh and hot pizza waiting for you from a very attractive delivery man 2 minutes after you get home, please don't. It won't work. It will never work. (NOTE: This actually worked twice where I was doing my first or second knock and they pulled up and got home, running up and handing me money with usually a good ass tip. But I've had many more situations like these.) Primarily if you don't even fucking know what time you'll be home, don't order something from a time sensitive business.\n\nAt least they had money when I showed up. . . unlike some other person I drove to. . . (which is a story for later)",
        "created_utc": 1497341288,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't care if you're giving me more\"",
        "author": "peteroh9",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gwez5/i_dont_care_if_youre_giving_me_more/",
        "text": "We had a substitute manager recently who switched our Pepsi deliveries to every other week for no known reason. So of course, now we only have two drinks 20 oz bottle varieties that are actually listed on our website, and we're low on those. We got a customer who ordered four bottles of Diet Pepsi, but we only had three.\n\nInstead of using our entire stock of Diet Pepsi 20 oz bottles, we decided to give him two 2 liter bottles (with six cups) because we had a bunch of those and each big bottle is actually 67 fl oz. When I get to his town home, he's waiting just inside the door, which he opens as I approach. As soon as I start explaining the drink situation, he starts shaking his head.\n\n\"That won't do,\" he says, \"I need the four bottles.\"\n\n\"Oh,\" I begin, putting a cheery note in my voice because he already seems mad at the world, \"well, we actually didn't have enough twenty--\"\n\n\"I don't care. It's that there are four people drinking it.\"\n\n\"Oh, I brought cups!\" I reassure him, turning the bad to show him.\n\n\"No. I need the bottles.\"\n\n\"It's actually--\"\n\n\"I don't care about the amount. I don't care if you're giving me more; I need the bottles.\"\n\nNow keep in mind that we run out of the smaller bottles every once in a while, so I've had to bring two-liter bottles several times, and the customers aren't just understanding, but they usually at least pretend to be glad to be receiving the equivalent of almost seven bottles for the price of four. Not this guy.\n\n\"So...you want me to bring you the four bottles instead?\"\n\n\"Yeah,\" comes the gruff response.\n\n\"Well, we only have three left, so I would have to stop at a store to get another,\" I return, hoping he'll just take the better value.\n\n\"Then just give me a regular one,\" he grumbles.\n\n\"Do you mean the two-liter?\" I ask, doubling down on the hope he'll be reasonable.\n\n\"No, give me a regular Pepsi.\"\n\nWell, we didn't have any of those, so let's just skip the rest and say that it ended with my manager making a note in this guy's account.",
        "created_utc": 1497314306,
        "upvote_ratio": ""
    },
    {
        "title": "I wish the customers knew",
        "author": "theplaneflyingasian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gvn9a/i_wish_the_customers_knew/",
        "text": "I wish i could convey how thankful i am towards tipping customers.  Sure standing there and repeating \"thank you\" a thousand times kinda gets the gist across, but i dont think they truly realize how thankful i am for every penny they give. \"Thank you\" sometimes just doesn't cut it. ",
        "created_utc": 1497306095,
        "upvote_ratio": ""
    },
    {
        "title": "Lying customers",
        "author": "the_eluder",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gtthb/lying_customers/",
        "text": "So we were pretty slow last night.  I had a single delivery to an apartment complex.  I go there, knock on the door; no answer.  I ring the doorbell, no answer.  I call the phone number, straight to voicemail.  I leave a text message, no response, so I leave.\n\nI get back to the store, and about 10 minutes later they call, wanting to know where they pizza is.  The girl on the phone sounds high AF.  I tell her I already went there, no one answered the door.  She says I must have went to the wrong apartment.  I confirm the apartment, and then describe exactly where it is in the building (it was an end apartment, so easy to describe.)  I ask if she wants me to bring it back out to her.  She says yes, then claims it can't possibly still be hot.  I tell her that it's only 30 minutes old now, and it was in a hot bag or under the heat lamps since it was made, so it's still hot.  She complains again, I tell her that if she had answered the door when I was there 15 minutes ago it's would be really hot, and again asked it she still wanted it.  She finally said yes, she paid for it, she wants it.\n\nSo I make the 4 minute drive over there, and two girls answer the door.  The first one (the phone one) is actually pretty nice, apologizes for the mix-up, and then the second one suddenly starts in on me.  She says I didn't have to be so rude on the phone.  I tell her I was just trying to figure out why they didn't answer the door the first time, to see if the problem was on our end or their end.  I then recite the phone number on the box and ask them if the phone number was correct.  The first girl immediately says, no, I must have screwed up when I entered it online.  I then tell them that it's aggravating when I have to make return trips, and the second girls is like, \"That's your job\".  Then I retort that answering the door when we arrive is YOUR job.  The first girl then finally admits that they 'might have been' walking the dog the first time I came by.\n\nI was like, \"So you WEREN'T here the first time I came by\" turned around and left.\n\nSo they called me incompetent and rude; turns out they gave the wrong phone number and were not at the apartment.",
        "created_utc": 1497289477,
        "upvote_ratio": ""
    },
    {
        "title": "Tell a joke. Please.",
        "author": "redout9122",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gtdk7/tell_a_joke_please/",
        "text": "That was the instruction label.\n\nI told her a joke. \"What's brown and sticky?\" \"I don't know.\" \"A stick.\" Got a stiff for that.\n\nWhat are your experiences/opinions ofnthe old \"wrote/tell a joke\" instruction?",
        "created_utc": 1497285587,
        "upvote_ratio": ""
    },
    {
        "title": "This may be a dumb question",
        "author": "Kirk23232",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gss0l/this_may_be_a_dumb_question/",
        "text": "When people order delivery and they live in an apartment do you expect them to come down to meet you by the front door or do you get buzzed in and bring the pizza to their door?",
        "created_utc": 1497280018,
        "upvote_ratio": ""
    },
    {
        "title": "Saw some old friends on a delivery!",
        "author": "HydroponX",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gqyel/saw_some_old_friends_on_a_delivery/",
        "text": "I just started delivering to a suburban area that I used to live in nearly a decade ago. A couple days ago, I had a delivery to a house party. It was pretty wild. However, some of them had recognized me in an instant. I even saw my middle school (and very first) crush! At first it took me a second to realize who everyone was once I heard the names. For a good second, I felt like I was in 2008 again. It was great. I would have stayed and took a shot they offered, but I had pizzas to attend to. They invited me to come the the party after close, but the cops came. Guess it got too wild. Hopefully I'll get to see them again, they were an awesome bunch and I sure missed them!",
        "created_utc": 1497255912,
        "upvote_ratio": ""
    },
    {
        "title": "No idea how much more I can take!",
        "author": "lIIlllIIIl",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gq30r/no_idea_how_much_more_i_can_take/",
        "text": "I think I'm done delivering pizzas. I work for one of the big chains and deliver on their scooters. For months now I've been putting up with shit from a shift manager, being spoken to like crap, treat differently and given ALL the dodgy delivery addresses and accused of lying all the time. Heck I have to get up recent calls and prove to them ive called a customer if I've returned to the store after no answer. I stopped calling the store before returned too as they'd demand I took a photo with myself stand in it. I've been accused of going on long journeys for no reason even though I explained it's not a long journey, I just don't come back the same way I went, especially after being mugged twice.. At most it's a 2 minute extra or sometimes shorter journey. Fuck I even get accused if needlessly filling up with fuel. The scooter only takes at most £4 worth of fuel and having to go flat out on a 50cc little thing with a big fuck off box on the back means I gotta fill up before every shift. I've now gotta let this specific manager inspect the tank before I go. He's also made me add him on Find My Friends on ios so he can track where ever I am, even though the scooters have a tracker built in for upper management to view.\n\nI got setup by a customer last week who distracted me whilst his friends stole the delivery scooter. Every bit of it was on CCTV and the bike was recovered after being chased by the Police. Not once did I get asked if I was okay, instead I was accused of being involved or lying. It's all on camera for fuck sake!\n\nAnd the final straw ontop of all of that was coming into work after two days off to find someone had cut the cable on my own personal helmet that I use (their helmets don't fit my head, plus it's Bluetooth so I can listen to music and satnav) and pissed inside of it before putting it back ontop of my locker.. Fucking pissed inside of it! \n\nStore Manager doesn't give a fuck, Area Manager doesn't give a fuck, nobody seems to give a fuck. Its not asif I'm a terrible driver too, I'm in the top 5 of highest performing drivers in the area. I'm fed up of coming home and just crying from all the stress. I've loved delivering pizzas, getting out on the road and meeting some interesting customers but I'm looking for a new job as fast as I can!\n\nSorry for the wall of text, I just needed somewhere to rant  :/.\n\nTL;DR, shift supervisor pissed inside my helmet, left it in a hot room for two days and now it's fucked.",
        "created_utc": 1497242241,
        "upvote_ratio": ""
    },
    {
        "title": "Done doing favors for customers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gpcj1/done_doing_favors_for_customers/",
        "text": "[deleted]",
        "created_utc": 1497232714,
        "upvote_ratio": ""
    },
    {
        "title": "Customers Whose Orders Were \"Messed Up\"",
        "author": "fspring23",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gp9sm/customers_whose_orders_were_messed_up/",
        "text": "Anyone commonly have this happen? It's now at least once a day that a customer calls in saying their order \"wasn't right\", like not enough sauce on an extra sauce pizza (Our manager made it and we both saw it was fine). Of course I have to drive back on my own dime to bring ANOTHER couple pizzas for free. \n\nI recently started telling them some BS that it's company policy we take back the old order to see what went wrong for quality assurance. Most of these scammers aren't really happy about that. Wondering how do you guys deal with this? ",
        "created_utc": 1497231762,
        "upvote_ratio": ""
    },
    {
        "title": "[help] rookie closing driver advice",
        "author": "Royalation",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6glluw/help_rookie_closing_driver_advice/",
        "text": "Hi! I just started working as a closing driver for Dominos! I have to clean the front every night while another closing driver does dishes.\n\nI can clean fast when I get the chance to, but when it's busy I'm out on the road constantly with no time  at the store, so I end up not getting out of there until 2 hours after close! I always get clowned on for it by the other closers, lol.\n\nHow can I manage my time more efficiently? Is it okay to let an order sit for a while before I leave so I can clean here and there?",
        "created_utc": 1497190866,
        "upvote_ratio": ""
    },
    {
        "title": "Add 10 to the tip",
        "author": "EntReaper",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gk864/add_10_to_the_tip/",
        "text": "Had a guy that I couldn't deliver to because he was watching his kid. In the end he told me he couldn't get the pizza and said to keep it and write a 10 dollar tip on the ticket paid through credit. Is it OK to do so if the customer tells you to?",
        "created_utc": 1497166339,
        "upvote_ratio": ""
    },
    {
        "title": "Would you like the same thing you ordered last time?",
        "author": "Chafin123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gha22/would_you_like_the_same_thing_you_ordered_last/",
        "text": "Hi all, im on mobile so I apologize for any spelling or formating mistakes. This isnt a long story but it happened yesterday, wasn't a bad customer, just stupid.\n\nSo me and the crew just finish up with the biggest rush we have had all summer when the phone rings. I was the only one near it that wasnt busy, so I answer it. I go through the spiel and get the customer's info and when I get to the order screen I see his last order.\n\nMe:\" Your last order was 1 large pepperoni, 2 large Italian sausages, and 1 large bacon, everything with ranch base.\"\n\n\nCust:\" No im gunna order something else, your 4 pizzas for 8.99 each.\"\n\n\nMe:\" Alright sir (clears entire order) what can I get you?\"\n\n\nCust: \"I'd like 1 with Italian sausages, 1 pepperoni, wait make that 2 with Italian sausages, and a bacon pizza and all of them with ranch instead of red sauce.\"\n\n\nMe:\"...ok...\"\n\nI read his order back to him, quote him the time, hang up and tell my coworkers about this idiot. Atleast he was nice.",
        "created_utc": 1497125118,
        "upvote_ratio": ""
    },
    {
        "title": "[Rant/Advice]Am I justified in my irritation or am I just being a bitch?(Or: A Drama of Expectations)",
        "author": "SpookyKid94",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gec3f/rantadviceam_i_justified_in_my_irritation_or_am_i/",
        "text": "This is mostly dealing with some garbage that happened earlier this week and my boss's response to it. It's really months of frustration hitting a boiling point, though. I'll break it up into 2 parts for convenience.\n\n\n**Background**\n\n\n\nI'm the senior-most driver where I work, with over a 3 year tenure(christ). I enjoy my job, because I'm usually pretty good at it and I get to drive around listening to Slayer all day. I do basically everything besides making pizza and rolling dough, because we have dedicated people for that. I pride myself on trying not to be a moocher; I'm worthwhile to employ, beyond my job description and I follow the philosophy of making sure everything gets done properly outside of what's specifically expected of me.\n\n\nMy boss is the owner(We'll call him Ray), he's there pretty much every day. Other than that, we usually have a cook and 2-4 drivers per shift. None of these people are a problem save a single driver that is a straight up leech(We'll call him Peter). He fits descriptions of what others have complained about on this sub: only in it for tips, hounds the dispatch and memorizes what everyone tips, throws fits anytime things don't go his way, straight up sabotages the store to try and get the best deliveries, does the bottom line with everything, refuses to do any closing work besides dishes and his lack of work is secured by the fact that he's shitty to a point where you don't want him doing it anyway. Peter's saving grace is that he is fairly fast at delivery(he is only faster than my, because his fucking dad pays for a toll road pass for him, which shaves as much as 20 minutes off of a delivery under certain circumstances, this guy is like 33). Working with him is so draining that I remember every shift I've ever done alone with him, because they're the only times I've considered just walking the fuck out.\n\n\nObviously I stand diametrically opposed to this Peter, because I give a shit about work ethic and he doesn't. The kicker here is that he gets away with it, because society will always make room for moochers. My effort is rewarded with higher expectations, whereas he works to keep his expectations at rock bottom in every area save delivery. This is where my real issue begins: he doesn't get reprimanded for fucking anything he does. Last week, he told a regular never to order again, because he was far and only tipped $3. *Boss didn't care.* Few months back, he told off a customer and used a fake name(of a former driver, actually) to avoid anyone finding out. *Boss didn't care.* Last year, he intentionally shorted a 13 year old kid change, so he'd get a tip and his parents noticed and complained. *Boss didn't care, covered for him, actually.* The guy takes shots of vodka with one customer every time he delivers to him. *Boss doesn't know, but I can probably guess what wouldn't happen if he found out.*\n\n\n\n\n**Events of This Week**\n\n\n\nI do Monday and Tuesday with just Ray and one other driver(not Peter), so if it gets a little busy, things slow down very quickly. This Tuesday we were fairly slammed, both of us were taking triples all day. Somewhere around 7, I dispatch on a triple that included 2 in one city(Pink) and one out of the way in a different city(Green). The Pinks sandwiched the Green in the order, the Green was on the way to the Pinks direction wise. They were weekly customers and had an order close to $100, while the other 2 were pretty small. We were running behind anyway and I decided to do them out of order, delivering the Green first, then the Pinks after words. At most, it added 7 minutes(or so I thought) to the delivery time for the pink that was intended to be delivered first. \n\n\nThe result was the first pink losing his shit, calling my boss, yelling at me. His words: \"*Dude this pizza is an hour and a half late and your manager doesn't give a shit, so I'm not gonna eat your fuckin' pizza.*\" I walk down, flustered, call my boss: \"*You're so stupid, it was supposed to go first and you took it last!*\", which wasn't true, but okay. Third delivery went fine. I was pissed that I was pinned for this, because all the orders were late, this guy ordered online(doesn't give you proper delivery time), and I was put in a position where I either choose which customers to satisfy properly or play /r/maliciouscompliance and inefficiently take them in the dispatch order. **Side note: Shit wasn't even my fault. The guy orders online and his ticket sits there, not entered into the POS for at least 30 mins. I've been specifically complaining about this for months, it happens a lot and we finally had a cancellation due to it.**\n\n\nI wrote down my justification, because I didn't feel like explaining it while we were both mad. Gave him the note and that's the last that was said until today.\n\n\n\nToday was a shitshow, Rey decided I'm not qualified to take triples at all. Took 2 extra hours to clear the dispatch. I'm normally off by 8:30, but today had me on until after 10 all to punish me(it's true his punishment made me extra money, but he's also aware that I don't care about that). This is beyond me, because last week fucking Peter intentionally lost a customer, I do the same thing on accident and it's not even my mistake and it's the end of the world. I called him out on having a ridiculous double standard and all I got back was something about how he gave me extra chances when I was new. I became a better driver over time, Peter has been garbage since day one(in fact he's been doing this shit for 10 years apparently) and he never changes his behavior. I make honest mistakes and he deliberately does stupid shit to benefit himself and sabotage everyone else. What it comes down to is that absolute flawlessness is expected of me, which I am totally fine with, but it's endlessly frustrating to have the fucking free loader getting away with shit in front of me every day.\n\n\nI know this post is probably drenched with bias, but I'm sure others have similar stories. I'm out of this place in a few months, when I'll start posting my ravings on /r/talesfromtechsupport, but this summer is going to bleed my dry. I feel like shit. It fucking sucks, because I like my job and I respect my boss, but I have a really hard time reconciling this double standard garbage. I think it's more of a philosophical thing, how do you deal with the fact that putting in more effort doesn't actually gain you an advantage over the moocher? I think I hate myself less, but what's that worth if I feel like this as an alternative?\n\n\n\n\n**TL;DR** Get shit done overall and get treated with standards for my performance miles higher than another driver that does nothing at all and gets preferential treatment for being fast.\n\nEdit1: Sorry for this godawful wall of text.",
        "created_utc": 1497085408,
        "upvote_ratio": ""
    },
    {
        "title": "First day delivering--wondering if I went home with an acceptable tippage or if I got completely shafted?",
        "author": "Austin1173",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gdoyn/first_day_deliveringwondering_if_i_went_home_with/",
        "text": "So, I just started at Papa John's and, as the title indicates, today was my first day. I really like my coworkers &amp; manager and, hell, even the customers are nice enough. But, I delivered pretty consistently (I didn't take accurate notes, I would say ~7-8 orders) from like 6:45 to 11:00 and I went home with $31.50. My GM assures me tonight was a slow night compared to most Friday's, but I'm not sure if I'm doing the whole \"delivery\" thing appropriately, it seems like the customer already has a tip in mind regardless of how I act. \n\ntldr; how much would you expect to make in tips on a normal friday in about 4 hours?",
        "created_utc": 1497072891,
        "upvote_ratio": ""
    },
    {
        "title": "Just remembered one of my most ridiculous moments yet",
        "author": "Jaitzche",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gdk0h/just_remembered_one_of_my_most_ridiculous_moments/",
        "text": "Happened about two years ago when I was working for Papa Johns. I can't remember if I took the delivery initially but I clearly remember what happened after. My manager had stopped me and asked me to go to the customers house (my delivery initially, or I was heading that way. Don't remember.) apparently when they ordered they said no seasoning packets (for the thin) because someone in the house was allergic to it. Whoever took the order must have forgotten to tell the rest of us. Well, the customer called, irate. Wanted us to come and pick up the packets, and take them back. The store was terrified of getting bad reviews so the manager sent me on my way. I get there and the guy opens the door about 5 minutes later, frowning but doesn't say a word. Just gives me the two little packets because he couldn't be moved to throw them away himself. \n\nBonus story: before THAT I worked at another pizza place. I delivered a salad and a pizza and cheesesticks to an older lady just down the road. She called back before I even got back to the store, bitching about getting the wrong sauce. The receipt said ranch but really what she wanted was blue cheese or whatever. Okay... So I drive out there with the new sauce, get to the door, and she answers she's absolutely pissed. There's a young girl behind her with a forlorn look on her face. Older lady bitches while I give her the sauce, and hands me the sauce we originally gave her. It's in a bag it didn't come in, she's all snooty at this point, tells me to do whatever with it, claims the cheese sticks didn't have enough cheese on it and slams the door in my face. ",
        "created_utc": 1497070609,
        "upvote_ratio": ""
    },
    {
        "title": "The Dogs of Delivery",
        "author": "ddmartz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gdg9y/the_dogs_of_delivery/",
        "text": "One of my favorite parts of being a delivery driver is getting able to see all the dogs people have.\n\nSo we have this regular customer, Kaleb, at the place I work at, he orders multiple times a week and ALWAYS right before I'm about to leave, causing me to stay and delivery it. If anybody else were to order a pizza for delivery so late, I'd get pretty pissed, but this guy is pretty chill and doesn't live that far from the restaurant so I usually don't mind.\n\nAnyway, Kaleb lives behind a chain link fence that never opens, so every interaction I've had with him had the fence between us. Every time I deliver to his place, his little brown chihuahua always runs up to the fence and starts barking at me followed by Kaleb yelling at the dog to \"shut the fuck up.\" I've never seen Kaleb with anybody else before besides his dog, I'm positive he has friends, but he only lives with his dog. \n\nEarlier this week when I delivered to him, he showed up by the fence alone, without the dog. I greeted him, \"Hey how's it going, man?\" \n\nHe says \"what's up\" back, but shortly after he says, \"My dog just got hit by a car, man\"\n\nI immediately gasp, and ask if the dog was okay, he then tells me he was found dead on the side of the road just two hours before. He told me that the dog is usually chained up, but somehow got out and escaped the fence. \n\nKaleb seemed really bummed, and every time I told him I was sorry he would reply, \"It's all good, man.\" But you could tell that it wasn't. \n\nI never even pet the dog before, I didn't even know the dog's name, but it made me so sad that I almost cried. It was there every single time I delivered, but now it's dead. \n\nI wasn't thinking at the time, but I really should have paid for his meal.\n\nAnyway, I just wanted to share this experience that kinda fucked me up for a bit. Anybody else have stories about dogs they have encountered on deliveries?\n",
        "created_utc": 1497068983,
        "upvote_ratio": ""
    },
    {
        "title": "What's the highest number of deliveries you've taken in one run?",
        "author": "MySuperLove",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gd123/whats_the_highest_number_of_deliveries_youve/",
        "text": "What's the highest number of deliveries you've taken in one run, either to a single location or to multiple different ones?  We've all taken doubles and the occasional triple. . .\n\nMy previous record was seven deliveries in one run, all of which went to a high school which usually produces 2-3 orders per day.\n\nToday, I topped that one with eight deliveries to the same high school.  The security guard was cool and made them line up for me as I called out their names.",
        "created_utc": 1497062997,
        "upvote_ratio": ""
    },
    {
        "title": "Quick respond please!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gcvaa/quick_respond_please/",
        "text": "So I just ordered papa johns with a $25 visa gift card and the total came out exactly to where all I had left was 2.61 for a tip. \n\nQuestion: do I give the guy a bunch of nickels and dimes and quarters to bring it up by about $1.60? \n\n\nEdit: too late, did it anyways",
        "created_utc": 1497060829,
        "upvote_ratio": ""
    },
    {
        "title": "Working for two competitors",
        "author": "Dakarts",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6gaj9h/working_for_two_competitors/",
        "text": "So when I first started out as a pizza driver, it was at the Hut. After a few months I took the opportunity to be a manager there and did so for 2 years. I got sick of the stagnant pay and switched over to papa John's with a nice pay raise and became a manager pretty quickly there. Now, I'm working around 35 hours a week and have some free time and I'm considering picking up another job. Would it be alright to be working at both places simultaneously if I were to take my old job back?",
        "created_utc": 1497035310,
        "upvote_ratio": ""
    },
    {
        "title": "Customer \"Math Whiz\" with the tip.",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6g9s17/customer_math_whiz_with_the_tip/",
        "text": "I had [this happen twice](http://www.thewebcomicfactory.com/comic/tales-of-pizza-math-whiz/).  The customer is trying to figure out the tip to the penny.  Can't just round it off and has to do the math right in front of me.",
        "created_utc": 1497028329,
        "upvote_ratio": ""
    },
    {
        "title": "I delivered to a dispensary today. It was not a good time.",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6g7jyw/i_delivered_to_a_dispensary_today_it_was_not_a/",
        "text": "Today was pretty slow since most everyone had blown their pizza money last night watching the Warriors edge out the Cavs in what was all around a very interesting basketball game. Deliveries were few and far between and orders were being made with impeccable accuracy thanks to us getting them pretty much one at a time. We get an order to that's to an address we don't really recognize partly because they comically misspelled a major street but we're able to figure out where it's supposed to go. It's one pizza and one order of wings to make the absolute minimum one needed to get food delivered to them. Lucky me, I ended up getting that delivery\n\nI go to what I assumed was the correct address if you weren't a complete imbecile who spells the name of the street they work on wrong and for a moment I genuinely think it might be a set-up since the parking lot is deserted save for 2 run down looking cars. I decide against my better judgement to cautiously make my way in and beyond the first door and lo and behold it's a weed shop; the saddest excuse for a weed shop that is.\n\nFor those of you that don't have any sort of weed clinics in your neck of the woods let me tell you how they usually look and compare it to this shithole. For starters, clinics are cash-only businesses thanks to the legal limbo they're in right now (at least here in California) and often have at least one armed guard posted outside the door with the gnarliest looking guns that the state of California will allow a private citizen to own giving off as much of a do-not-fuck-with-this-place vibe as they can. The \"Guard\" they had here had a nappy looking rent a cop uniform, a small canister of mace, and a leather cell phone pouch positioned to look like to was a magazine pouch that wasn't fooling anyone. I was significantly better armed than this guy with a pocket knife and a general sense of alertness. Secondly, weed shops will have a sort of screening area with tempered glass you have to go through before entering the luxurious showroom filled with the goods; think large jewelry shop but with drugs instead of diamonds and you've got it. this place had a thin wall with a window-hole in it and a flimsy door sporting a sign that said \n&gt;\"just push doornob[sic] doesn't work\"\n\nI didn't end up going in but I caught and eyeful of what it looked like on the inside and was surprised considering the investment needed to get so much as a permit for this kind of business. inside an otherwise barren 1500 square foot office space was one 8' glass display containing maybe half a dozen mason jars full of what looked and smelled like very cheap, low grade marijuana. As a point of reference my sister worked as a Bud-tender in what would be considered a typical clinic down in Santa Ana. By the standards that clinic set I'm not even sure that this place could be called a weed shop.\n\nSo I get approached by the security guard who asks me how much it is and then starts rummaging through his pockets trying to get to $17. he only comes up with $7 and starts literally jumping up and down trying to see if he has any change. The girl who I guessed was the clerk/bud-tender/whatever who the nicest word I can think to describe her is... unwashed comes up to help pitch in. All the while I'm waiting for them to scrap together the money for this. all the while they're asking me for forks, free ranch, pepper/cheese (which for some reason our chain charges for now) plates, napkins, anything they think they can get for free from us. They even ask for goddamned spoons. After telling them that we don't carry those things unless paid for in advance or asked for before the driver leaves the store the security guy and the girl throw a little fit and the guard goes on about \"how he was gonna tip me but not anymore.\" Bruh I'll be fucking surprised if you even scrap together enough cash for me to hand over this pizza. they eventually do after a while and I hand over the pie and the chicken so I can get on with my life.\n\nAs I get back, *what a surprise*, the girl from the weed shop called to complain about not getting the wings she wanted which the manager who received the call knew was a bold faced lie since several people checked the order and now there's a remake in the delivery queue. Of course there's now an added comment containing a long list of free things they'd like us to bring (some of which we don't even stock), yet the street name is still horrendously spelled wrong. I was slotted to take it but I flat out refuse, opting instead to take a delivery to the far fringes of our range to a high rise apartment. The AM doesn't stop me and tells me how rude the weed shop lady was over the phone. Someone finally ends up taking the remake but not without taking another order since it's known that they have no money to tip with and they're extremely rude to boot. The driver only takes 2 plates and some napkins to satisfy their lust for freebies (pretty much everything else they asked for was something they had to pay for anyway).\n\nThis is actually kind of sad considering that a business that should have a fuckload of cash on hand can barely scrap together 17 bucks after a trip to someone's car. I almost think that maybe this clinic was started by some poor sucker who heard that \"modern day green rush\" ad on the radio and got roped into a near-predatory business loan based on some program that features numbered steps and being a member of some \"team\". Maybe those two losers were the only people that this person is able to keep on their payroll. That's not my problem though. Lucky for my fellow drivers and I we have a feeling it's going to be a while before they can scavenge $17 to cover another delivery order.",
        "created_utc": 1497003648,
        "upvote_ratio": ""
    },
    {
        "title": "Fits of Rage and Pizza Covered Walls.",
        "author": "Jacobwages",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6g7fdw/fits_of_rage_and_pizza_covered_walls/",
        "text": "Back story: A gentleman by the name of Steven Wes (fake name for privacy) loved getting free pizza. His signature technique is to order an overly complicated pizza(s) five minutes before we close. My restaurant is a lower revenue store so we have the luxury of breaking down the make line a good two hours before we close and placing all the topping in the walk-in. With that said complicated orders late at night spawn minor mistakes.\n\nStory: Steven places his order, \"large thin 'supreme'. Add pineapple, jalapeno, sliced sausage, and left half no onions. Piecut.\"\nI tell my closing driver to not fuck the order up otherwise we'll be here all night making this asshole free pizzas. \nHe makes the pizza and I pull it out of the oven to find he didn't add the sliced sausage. \nI then make the pizza and pull it out. It's perfect. Exactly the way he ordered it until muscle memory kicks in. I quickly run the blade from one side to the other 6 times making a square cut pizza. \nAfter the 4th cut I realized I had fucked up. In a fit of rage I pick up the pizza and box only to violently thrust it into the wall. A couple slices fall on to my skin but my adrenaline is pumping. \nI don't feel a thing as I'm rushing for a 3rd time making this prick's pizza. Finally... 30 minutes later with the pizza deliveried and no petty call back demanding a free pizza we close up shop. \n\nRest in Pepperoni. FML",
        "created_utc": 1497001655,
        "upvote_ratio": ""
    },
    {
        "title": "Had a 1 armed delivery driver and he was awesome!",
        "author": "culesamericano",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6g6gxl/had_a_1_armed_delivery_driver_and_he_was_awesome/",
        "text": "I'm not a driver but I ordered pizza the other day and a 1 armed guy delivered my 2 pizzas and a soda effortlessly, no idea how he balanced all of this and got my signature and everything! He handed everything over to me and I tried hard to hide how much I was struggling trying to carry everything with both my hands. \n\nAnyways he was really cool and nice. I tipped him the regular 25% I wanted to tip him more but didn't want him to feel like I was doing it just because. Not sure if that was wrong of me. Oh well cool dude.",
        "created_utc": 1496986014,
        "upvote_ratio": ""
    },
    {
        "title": "\"You can't bring change for $100? I'm never ordering from here again!\"",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fzks9/you_cant_bring_change_for_100_im_never_ordering/",
        "text": "We had a customer call up and to place aa order for deliver. Immediately notice the store note saying no free food for the guy. Typically means there is potential for a problem. Guy orders 3 large philly steak pizzas and an order for cheesy bread. Total comes out to $58.XX and I ask if he's going to pay cash or card. Says cash and tells me he only has a $100 in him. I tell him we most likely wouldn't be able to take it, but I'd double check for him. \n\nOne of the CSRs take the line because I had to do something, don't remember, but a few minutes she comes back saying he wants to speak with a manager. Current manager had stepped out for a few mimutes, so I take the phone call back over. C is Customer M is me.\n\nM: Yessir?\n\nC: Yeah, I was just on the phone with someone and she said you guys wouldn't break my $100.\n\nM: That's correct. Our drivers carry no more than $20 on them to a delivery everytime. \n\nC: Well I've had it done multiple times before because I only pay in $100 bills.\n\nM: Well sir, whoever approved that was wrong to do so, and could get in troube with corporate. We've actually gotten in trouble twice for doing that, and I don't plan on  breaking any rules like that.\n\nC: Well every time I've placed an order it's been around $50-60 and I've always pay with $100 bill. (Which is not true, only 1 of 8 orders were above $50, the rest being at most, $23)\n\nM: I'm sorry but we're not sending a driver with $40 in change to your house. Like I said, I'm not breaking the rules.\n\nC: Well how do other people with $50-60 orders pay with their food if you don't break $100's?\n\nM: Well sir most people pay with $20 denominations.\n\nC: So you're just going to give up a $60 order over $40? \n\nM: Like I said, there is nothing we can do unless you want to come pick it up, and we might be able to change it out for you.\n\nC: I'm not driving out that far. I can't believe you won't do this. I've been a customer for 15 years with you guys, (also not true, the store has only been around for about 10-11 years) and I've always paid with $100. I'm never going to order from you again!\n\nM: Okay sir.\n\nI can never understand why if we say we can't do something, we can't do it. No amount of pleading or \"loyalty\" is going to change that. Also turns out the girl who talked to him before told him exactly the same thing I did.",
        "created_utc": 1496908561,
        "upvote_ratio": ""
    },
    {
        "title": "Ever drop a pizza that came straight out of the oven on yourself?",
        "author": "spacecrafts145",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fypuo/ever_drop_a_pizza_that_came_straight_out_of_the/",
        "text": "We were slammed with orders and I was trying to get pizzas out. Somehow I slipped and a pizza ended up falling straight onto my hand. Hurt like a bitch but kept going with my shift. As time went on the pain increased, got to clock out finally only to realize I got a 3rd degree burn on my fingers! :)",
        "created_utc": 1496895762,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hey Papa John's do you have any free pizzas?\"",
        "author": "joshuabeebe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fux58/hey_papa_johns_do_you_have_any_free_pizzas/",
        "text": "Earlier today I was delivering a pizza and saw a dog running down the road. Being the Good Samaritan I am I stopped to check the dog's collar for a phone number. It took a little bit of coaxing but I got the dog to come over to me. Before somebody says that I shouldn't have tried this, keep in mind I've done this multiple times but only when we're not super busy.\n\nAs the dog is approaching me some idiot in a giant lifted pickup truck with LEDs as bright as the sun pulls up next to me. He screamed out his window as loud as he could, \"Hey Papa John's do you have any free pizzas?\" This scared off the dog causing him to scramble into traffic again. \n\nHere's the issue: I don't work for Papa John's, he's screwed up my attempt to save this dog comma and of course we don't have free fucking Pizza in our car. It would have been so simple for this asshole to just not say anything. Plus, this dude had three teeth, a Budweiser trucker hat, and both of his eyes were pointed into different directions. What the fuck.",
        "created_utc": 1496856379,
        "upvote_ratio": ""
    },
    {
        "title": "Taking back a tip? (customer question)",
        "author": "Zembar",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ftl95/taking_back_a_tip_customer_question/",
        "text": "Not a tale from a driver, but a customer, and more of a moral question.\n\nI had an order the other day, Large pizza and 2-litre.  Bill was 22ish.  I had a 20 and two 5 to give to the driver.  But he gets to the door and doesn't have my soda.  Now fortunately he had it in his car, so few extra seconds and everything was peachy.\n\nBut I was curious, if he had left it in the store and had to make another trip to get it, would it have been bad form to get $5 back from his tip?  I wasn't gonna take all of it, but instead of 7 and change it would be 2 and change.\n\nTo me I feel it would have been justified.  I mean he would have forgot an entire item off my order.  Just curious what yall think.\n\n(And I'm not nor have I ever been a driver, but I have waited tables)",
        "created_utc": 1496844030,
        "upvote_ratio": ""
    },
    {
        "title": "What's the nicest/most expensive car you've seen a driver use?",
        "author": "idrinkjarritos",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fti7c/whats_the_nicestmost_expensive_car_youve_seen_a/",
        "text": "We've all seen our share of dim witted drivers use cars that are terrible for delivery from Ford F350s to fickle foreign cars.\n\nBut what's the nicest, fanciest car you ever seen a driver at your store deliver in?",
        "created_utc": 1496843139,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hi, welcome to Do-\" \"JAMES\" \"minos...\"",
        "author": "PizzaCSRlol",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fr2zg/hi_welcome_to_do_james_minos/",
        "text": "Other insiders probably know what I'm talking about without me having to say anything. But whenever someone walks into my store, I greet them with \"Hi, welcome to Dominos. How can I help you?\" And there's a certain two or three regulars that come in that shout their names to the heavens before I can even say the second or third word in the sentence. The worst part is that they're not even in a rush. It's like they just have no common courtesy to wait for the person helping them out to finish their sentence. I don't know, just a pet peeve of mine. Just let me finish my sentence, man. :(",
        "created_utc": 1496808011,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone here make a surprising amount of money in tips?",
        "author": "marho",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fqx90/does_anyone_here_make_a_surprising_amount_of/",
        "text": "We see posts everyday complaining about getting stiffed. We've all been there and done that. I've been delivering for 8 months while in college. I rarely get stiffed, probably less than 10% of my orders (I consider those &lt;$1 tips to be stiffs). Is there anyone else here that makes (in my opinion) a ridiculous amount of money consistently? share your stories guys!",
        "created_utc": 1496805968,
        "upvote_ratio": ""
    },
    {
        "title": "Oh no, they figured us out!",
        "author": "TheJediPikachu",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fq2hr/oh_no_they_figured_us_out/",
        "text": "https://imgur.com/gallery/AcWQl\n\nContext without leaks: \n\nMy very chain pizza employer has this posted on their login website under new info. I don't know if they have ran into problems, but I found it hilarious they mentioned reddit.",
        "created_utc": 1496796420,
        "upvote_ratio": ""
    },
    {
        "title": "When people hang up and call back immediately after putting them on hold",
        "author": "Infinit_G",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fpug9/when_people_hang_up_and_call_back_immediately/",
        "text": "Happened to me just now. I'm the only one in the front, currently helping out a customer in store. Phone rings, I pick it up, tell them I'll be with them in just a moment, and put it on hold. They immediately disconnect and call back. I could've been with them in less than a minute of waiting on the line. Just a little patience issue some people have that's kind of annoying.",
        "created_utc": 1496793971,
        "upvote_ratio": ""
    },
    {
        "title": "The former employee that wouldn't let it go: \"DO YOU KNOW THE LAW?!\"",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fpmdx/the_former_employee_that_wouldnt_let_it_go_do_you/",
        "text": "[Previously...](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/63hasf/that_one_time_there_was_a_crazy_huge_storm/?st=j3m4t44i&amp;sh=25d5d9e7)\n\nBack in January we had this crazy huge storm that ended up flooding most of the streets in out area and making the already intense amount of deliveries we had for football semi-finals a herculean feat. During that night someone who probably shouldn't have been hired in the first place but he got in on another employee's endorsement and literally begging to the GM was fired for having a meltdown. I was meaning to post this a while ago but things kept on happening concerning this dude and his inability to move on with his life and leave us alone.\n\nA few hours after the big storm had cleared and we were closing shop, our AM sent a message to the now-defunct driver group chat congratulating us on our perseverance in the face of a screwed up situation. This driver, who we'll call LawBoy, blows up the group chat with a rant that is probably longer than this whole story will be about how we're all \"heartless monsters\" and how \"he was sick and tried to open his feelings to us\" and we just rejected him with \"inhuman cruelty\". The AM responded with something along the lines of of 'even if we're as evil as you say we are, that doesn't excuse how you treated us last night and you're still fired.' A few other people who witnessed LawBoy's meltdown chimed in to back up the AM and it was the last we heard of it... for the time being.\n\nThe next morning I was scheduled to work with the GM who had convinced the Franchisee to rush order LawBoy's final check so we wouldn't have to deal with him anymore since he always seemed more than a bit on the unstable side. I was out on delivery when LawBoy came in to turn in his shirts and collect his check but the GM and the other driver filled me in on what happened. LawBoy shuffled into the store and placed his dirty shirts on the counter. Our GM begins to hand him his check wordslessly but then LawBoy mumbles,\n\n&gt;\"Do you know the law?\" \n\nThe GM replies,\n\n&gt;\"Yes, we are an at-will employer and your actions-\"\n\nThe GM is cut off by Lawboy\n\n&gt;\"No, I said do you know the LAW?!\"\n\nGM isn't having it\n\n&gt;\"look if you want I can give you my supervisor's contact info and you can take it up with him. You want you check or what?\"\n\nLawBoy Persists \n\n&gt;\"DO YOU KNOW THE LAW??\"\n\nGM stands his ground in the face of about 130lbs of red-faced angst\n\n&gt;\"So you want my supervisor's number or what?\"\n\nLawBoy mumbles something else, takes his check and shuffles out of the store. The phrase, \"Do you know the law?\" becomes an in-joke at my store and a de-facto reply to whenever you didn't get your way over in some petty matter. For example, \"My good sir, I'm on over duty right now, do you know the law?\" or \"The lady at KFC almost gave me original chicken instead of the extra crispy. Does she even know the law?\" And as the joke died down we thought that was the end of LawBoy... Or so we thought again.\n\nA couple months later I'm unsure what to get for lunch on my day off so I press the resturants button on Google Maps and I notice my own store pop up. I click on the reviews out of morbid curiosity and the first one I see when I sorted by recent is by none other than LawBoy (using his real name in the review no less) giving us a scathing 1 star review talking about how we were awful people and this and that, even mentioning that he worked here. I took a few screenshots of this review and sent it to the GM as so we could have a few laughs before reporting it for conflicts of interest. We later learn from another driver (not the one who got LawBoy Hired) who happened to rent a room from LawBoy and his Parents (surprise, surprise, LawBoy lives at home) that he *was* working for Uber Eats now but he washed out. He is the first and only person I've ever heard of to not make the cut for Uber Eats. He had also quite another job about a week and a half in because his arms were sore. And that was the end of LawBoy's involvement with out store... or so we thought, for the third time.\n\nA month or so later I come in for a shift to find the GM, the DM, franchisee, and someone who looked like he might have been some form of advocate for the franchisee looking concerned about something. I mind my business and later on when everybody who didn't have some sort of daily task to be at the store left the GM told me that LawBoy had filed a formal complaint with the department of labor and was trying to do everything in his power to get back at us. At the point Lawboy had been fired for over 4 months and before that he had only worked with us for about 2 and a half months before that. According to the phone call from the representative of the Dept of Labor LawBoy claimed that we refused to give him breaks or rest periods and that we were a hostile work enviorment, blah blah blah...\n\n**BULL. SHIT.**\n\nLawBoy was always sitting on the unfolded boxes in the back munching on reject pizza weather or not it was appropriate to do so and whenever he wasn't he just followed around the guy that got him hired trying to be his Multi-Level-Marketing wing-man. Once the guy who lives with LawBoy comes in and learns of this development he tells us something interesting. It turns out that this is just what LawBoy and his family do: Whenever they're even slightly wronged by any organization they romanticize their plight, go get a flea-bitten, second rate attorney, and try to sue their so-called tormentors into the dirt. Lucky for us, LawBoy has made every mistake possible in trying to use the legal system and before he's even filed the actual court papers we had a 4-pronged defense. We had the accounts of the AMs who he lost his shit at that fateful night, we had the end-of-shift sign off sheets from his every shift that he signed started that he had gotten all this proper breaks and whathaveyou, we had my screenshots of the review which showed how LawBoy was just on some sort of delusional warpath to being us down any way he could, and finally we had another driver who LawBoy had told that he had spent the whole night smoking tons of pot and playing video games which lead to him being in the state he was in that rainy night. The other driver seemed to be okay with helping in the defense of the store so we were feeling pretty good about our defense. I decided to explain to the guy that lived with LawBoy just how bad it would end for LawBoy if he tried to pursue this and asked him to at least try to explain to LawBoy and his family that this wasn't a good idea, and that he should really consider withdrawing his complaint with the Dept of Labor since we had hard proof to discredit everything he'd said, which could mean a whole lot of bad things for him. I didn't exactly like LawBoy by any stretch of imagination but a libel lawsuit or maybe even prison time was the last thing he needed in his life.\n\n Days went by, then weeks, and now here we are in June with not a peep from LawBoy or anyone representing him. Maybe that was the last we'll hear of LawBoy... or so I hope.\n\n...\n\nYup, I'm pretty sure LawBoy's group chat rant was longer than this post.",
        "created_utc": 1496791523,
        "upvote_ratio": ""
    },
    {
        "title": "Large Lady Stiffs Me; Steals My Tip",
        "author": "Viraljester",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fp6pl/large_lady_stiffs_me_steals_my_tip/",
        "text": "Okay, I've been lurking here for a while and I feel like I should share the most ridiculous delivery I have ever sent.\n\nSo I was taking a delivery on a slow day, no work to do, all cleaning done mid-day, and I had a short delivery nearby (sweet! easy money).\n\nI get the pizza and head out for the three minute drive and I call because there's a gate that I stop at in front of a business/house. A morbidly obese lady starts waddling out toward me at what can only be described as a labored rate of speed. After a long eternity, she finally gets to the gate and opens it up. I tell her the total and hand her the pizza. \n\nShe hands me the money and takes away a five dollar bill and looks at me and says \"That tip was for you, but since I walked down here, I'm gonna keep it.\" I wanted to punch her so badly. She walked away and opened the box and started chowing down on her way to the house. She couldn't even wait. Disgusting. I don't care about getting stiffed, but hide it. Don't mention that you're stealing from me.",
        "created_utc": 1496787119,
        "upvote_ratio": ""
    },
    {
        "title": "\"30 minutes or it's free, right?\"",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fnojp/30_minutes_or_its_free_right/",
        "text": "Dominos was the only chain that was willing to even try that, and it ended in about 1991 or so. I guarantee you that  many people have had that said to them. I know I've heard it quite a few times. Anybody else?",
        "created_utc": 1496773441,
        "upvote_ratio": ""
    },
    {
        "title": "Do people ever NOT tip you? Really?",
        "author": "Infinit_G",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fl4ml/do_people_ever_not_tip_you_really/",
        "text": "I remember delivering an order to a pretty cool guy many months ago. He opened the door, said hello. I said the same and gave him the receipt. It was low 20-something, I don't really remember the exact price. While he was signing, he asked, \"So do people ever *not* tip you?\" Internally, I screamed with laughter, but casually told him \"Ha ha... Yeah, I'd say almost every day it'll happen.\" There are always those serial stiffers who order all the damn time. We all know the deal. But hearing that, this guy was in genuine shock. \"Damn, really?\" He shook his head in disappointment. \"Those people are dicks. You should always tip your pizza guy. Here you go, man. Have a good one.\" He handed me $7 in a cash tip. His reaction made me think he must be a real good, generous guy, and tips like that for everything. If only every customer in existence was like this guy...",
        "created_utc": 1496748023,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to a College Student only wearing socks",
        "author": "spacecrafts145",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fjfzq/delivered_to_a_college_student_only_wearing_socks/",
        "text": "So I haven't been delivering pizzas long and I just found this subreddit so thought I'd tell (in my opinion) my weirdest delivery story. \nWe deliver mostly to the college that's right down the street and the surrounding college off campus housing and such. So I'm making a delivery as usual, I have like 5 pizzas and 2 litter sodas, and being 5'0 90lb me, I'm struggling ok. The delivery ends up being to a college party and a bunch of guys walk by me and scream saying \"pizzas here\". After like 5 minutes waiting, an extremely happy man yanks open the front door we a giant \"AYYYYYYY\". I peer behind my giant stack of pizzas to find a huge ass man butt naked with only socks on and a beer in his hand. At this point I had no idea what the fuck to do so I hand him the receipt and ask him to sign per usual. This dude seriously was acting as if nothing was wrong. Scratching his balls and everything.  I ended up forgetting one of his pizzas (it was my first day too) but he hands me a $10 tip anyways and I run back tot he store. When I return he's still naked, and nobody else seems to be minding. \nI still deliver to his house about once a week. I think he was too drunk to remember me but I don't think I'll ever forget him. ",
        "created_utc": 1496721637,
        "upvote_ratio": ""
    },
    {
        "title": "What's your delivery machine?",
        "author": "NucksStealthFan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fgbf2/whats_your_delivery_machine/",
        "text": "I'm currently driving a 1994 Mazda 323 with 188,000 kms on the clock.. I paid 150 dollars for it and it has yet to let me down in five months and 20,000 kms of use!",
        "created_utc": 1496689617,
        "upvote_ratio": ""
    },
    {
        "title": "What would corporate say?",
        "author": "Powerfuldot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fdsez/what_would_corporate_say/",
        "text": "Note: I swear to gawd I am not a management shill nor a corporate employee. Will provide proof to mods if needed.\n\nSo we pretty much all can agree that sometimes customers waste our time. Sometimes it's just a little, but it's probably adding up to a lot. \n\nYou know how it goes: They give the wrong address or forget details, they don't know how to buzz you in so they slowly make their way down to meet you, they order when they aren't home for another 15 minutes, don't hear you knock cuz they're in the basement blasting Skynard, takes them 3 minutes to come to the door cuz they're looking for money, forgot to turn their ringer on, they don't answer unfamiliar numbers even though they requested a call, and on and on. \n\nFor those of us who work for the very cost-conscious places (ones who find every way possible to keep their employees busy every second of the day to get their money's worth) this seems like an obvious waste of labor money that could be addressed. If we drivers could cut down on our waiting for the customer time, we could make more runs and get more money, so win-win situation! \n\nI'm thinking that one way to combat this is to have the company give customers a very clear message (especially those with online ordering enabled) about being ready to receive their delivery. My big 3 shop has a 5 minute rule for when you can leave if you are unable to reach the customer, but I am trying to figure out how to reduce all the \"time inefficiencies.\" \n\nSo, what would a good, clear, professional, short(!) message be for a customer who has just placed (or is just about to finish placing) their order on a website? \n\nHow to say \"For fucks' sake: don't waste our delivery drivers time! Have your shit together, come to the door promptly, make sure you didn't fuck up your own address, turn your ringer on and answer your gawddamn phone.\" like corporate would? Probably with fewer curse words, for a start? :)\n\nThought this might be a fun discussion!\n\nCustomers who lurk here especially welcome to advise on what they would think might work or would like to see!\n\n\n\n",
        "created_utc": 1496664894,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have change for this much?",
        "author": "Drakidor",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6fbnak/do_you_have_change_for_this_much/",
        "text": "The amount was $100, for a $17 order. I told them that they would have to call the store as I only had about $30 on me at the time and was not notified to bring change by them (as we always ask if they will be requiring change). The customer then proceeded to shout at me causing me to leave with the pizza, drive the 5 Miles back to the store and notify my boss about it. The person drove down to the store and demanded to see me. Boss goes out, explains they should have said to bring change for $100, customer shouts that we should always be ready, words escalate, the customer cancels the order and I got the pizza (Hawaiian, my favorite) for my troubles by my boss.\n\nAnyone else ever get that issue? Like usually if people forget they are understanding and call up to pay with a credit card but this person was just... You know.",
        "created_utc": 1496631743,
        "upvote_ratio": ""
    },
    {
        "title": "Hardest places to find?",
        "author": "NucksStealthFan",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f8vmg/hardest_places_to_find/",
        "text": "What's the HARDEST place you've ever had to find in all your time delivering? There's people with invisible addresses, people who don't turn their porch lights on, various apartment complexes..\n\nLast night I had one that damn near drove me crazy.. So the city I'm delivering in has a numbered grid system.. All the address numbers coincide with the nearby cross street.. So if you're on say, 170 St and the most recent cross street is 60 Ave, all addresses on that block will be 60__.\n\nFor the sake of customer privacy, though I've not named the city I'll change the numbers for this story.\n\nWe have a pretty decent rush going, so I take 2 deliveries, one is really close tp the restaurant so I think to myself this one will be easy its super close.. Was I ever wrong about that.. \"4530 102 St #127: Back door\" I was thinking townhomes or a subdivision based on that instruction but as I'm coming down 102 and pass 45 Ave I dont see the number yet. I cross a named street (streets that don't conform to the grid, diagonal or curvy are named rather than numbered and do not change the block number)\n\nI couldn't see the number anywhere and I finally figured out where it was, a huge tree branch blocked the address.. It was an apartment with two doors, however there was no indication whatsoever that you could go around to the back door.. Right next door was the subdivision which is fenced off from the apartment, after many u turns and observation I found a driveway (the only driveway, the \"front\" had street parking only) around the other side on the NAMED street.. Thanks a lot you braindead city planners.. If you're going to make the only driveway on ******* Crescent, try making the address there rather than assigning the address to a pedestrian only entrance.. ESPECIALLY in a city designed more for vehicle traffic rather than pedestrian traffic.\n\n/end rant\n\nTl;Dr. Building address did not coincide with actual entrance.",
        "created_utc": 1496600772,
        "upvote_ratio": ""
    },
    {
        "title": "Absolutely lost it on a customer",
        "author": "awoozy2",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f88er/absolutely_lost_it_on_a_customer/",
        "text": "I've been working delivery about 2 years on and off, about 5 months at my current place. Anyway, Friday was a hectic evening. One of our drivers who's scheduled 8 hours a week usually calls out (as usual) on his only shift because \"his tummy hurt\", and the others car was in the shop. This leaves me, and my buddy as the only drivers. We're fucking slammed, taking 5 deliveries at once, phones beeping, managers screaming at cooks and everybody, you get the picture. I'm off on another run with a metric fuckload of pizza in my back seats. One of my slips is to the resident asshole customer of our store, so of course I take it last. This dude always gives drivers a literal fucking penny and acts all snarky. I pull up to his McMansion and grab his bag with 3 pizzas and a 2 liter. Knock on the door, nothing. Knock again, a minute later he casually opens the door in a fancy bathrobe with a smug look on his face. \"Good evening sir, your total is going to be ___\". As I expected, he opens his stuffed fucking wallet with a few hundreds in there, casually shifting through to find the exact dollar amount. He then says \"one moment\" and goes back to bring his fucking change jar back to count out exact change, and of course, he gives me one penny on top and says \"there you go, I'm sure it will help\". I'm already fucking pissed off and stressed from how busy we were and that I had to deliver to this guy, so I just completely blew my lid. I chucked the pizza boxes through his fucking door and took the change he gave me out of my pocket and tossed it at him yelling some expletives. I walk back to my car and he yells some shit about calling corporate as I slam my car door shut and drive back. Of course I got fired, but it was worth it, I'm tired of dealing with stupid fucknuts like this. ",
        "created_utc": 1496593946,
        "upvote_ratio": ""
    },
    {
        "title": "Delivered to a \"pede\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f7zw3/delivered_to_a_pede/",
        "text": "[deleted]",
        "created_utc": 1496591327,
        "upvote_ratio": ""
    },
    {
        "title": "I had this discussion with a coworker and our GM during down time and would love to hear Reddit's thoughts",
        "author": "patrick809",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f6ttb/i_had_this_discussion_with_a_coworker_and_our_gm/",
        "text": "Driver A arrives in the parking lot first. Driver B arrives at the punch-in screen first. Who deserves to clock in first?",
        "created_utc": 1496574491,
        "upvote_ratio": ""
    },
    {
        "title": "Ok I'm at a loss",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f6qdz/ok_im_at_a_loss/",
        "text": "[deleted]",
        "created_utc": 1496572614,
        "upvote_ratio": ""
    },
    {
        "title": "I fucking love my Pizza Hut",
        "author": "JessicaTheThrowaway",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f68br/i_fucking_love_my_pizza_hut/",
        "text": "It's so nice to work at. We've had some issues but whatever those have been small. The work environment is just so awesome. Everyone loves to joke around and have fun and of course we all work hard as well. People are always laughing and the customers are nice as heck too. Hell even when they somehow get a slice of pizza missing from their pizza they act pretty cool about it. \n\nMy boss is also super freaking cool. The dude thinks wayyyyy too highly of me and is already getting me ready to be a shift lead. He also treats all of his employees so well. Only manager I've seen that would act just like your best friend would. And of course he's harsh when applicable and disciplines workers so don't go off saying he's soft. \n\nI've been with Pizza Hut for almost three months now and I'm so glad I finally have a job that I don't completely dread showing up for. Although that might actually be because we're not a busy store so things are super slow ( today we only had like 90 tickets! Our store in Caldwell has twice that by 6 usually).\n\n\nI hope other people out there have Hut as great as mine is. Sorry for the rant but I really fucking love my job for once and ended to tell somebody.",
        "created_utc": 1496562106,
        "upvote_ratio": ""
    },
    {
        "title": "My worst day ever",
        "author": "DesigningKnight",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f680h/my_worst_day_ever/",
        "text": "Hi everyone!  It's been over 20+ years since I've quit delivering pizza, but I had some good experiences I'll share as I can remember them. I used to work at Round Table Pizza (a West coast chain) in Northern California as a delivery driver and shift supervisor. \n\nThis story is about the worst day I ever had on the road.  At the time I was driving a 1974 Mercury Cougar XR7, your basic big ass tuna boat. Now keep in mind this was before the days of cell phones, just pagers.  Cells were around, but only the well to do had them.  \n\nI was on the way to the Solar System with a pair of deliveries (the name for a subdivision where the names of the streets were all astronomy related), when all of a sudden I heard a loud bang and lost steering, as in it took all my strength to turn the steering wheel. Smoke started pouring out from under the hood and I could barely see. Well, I managed to get myself to a gas station and got to a pay phone to call my shop.  They had another driver come get my pizzas and take them (which sucked, because where they were going were guaranteed $ 5 - 10 tips each - again, this was around 1994-95, so 5 bucks was more than my hourly wage).  Thank goodness I had a nice manager.  I had to go off the clock and start my repair.  As it turned out, the power steering pump return line had blown a hole in the line, thus dumping all of the fluid all over the engine block, making the smoke.  I had to walk to Napa Auto (the closest auto parts store - about 3 miles away) to get a replacement hose, walk back, replace the hose, refill the system, and get the car going again, all while still wearing my uniform and somehow managed not to get it dirty.  It took about a total of 3 hours with all the walking and repairs, and somehow I was still able to get back onto the clock and complete my shift.\n\nNot a terribly exciting first story, but it still sucked big time.\n",
        "created_utc": 1496561908,
        "upvote_ratio": ""
    },
    {
        "title": "Pens connected to the internet",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f0ox5/pens_connected_to_the_internet/",
        "text": "You guys hear this? Apparently, somewhere, they have these pens that when you sign the receipt it sends your signature over some kind of a signal and finalizes the order. So if you don't sign, you don't pay. At least, that's what our customers seem to think. I had one guy write less than the total on the \"total\" line, apparently in the belief that he'd only have to pay ten dollars for a $35 order. Geniuses.",
        "created_utc": 1496488545,
        "upvote_ratio": ""
    },
    {
        "title": "Worst customer horror stories? Is it always this bad?",
        "author": "Spookiestbacon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f0i99/worst_customer_horror_stories_is_it_always_this/",
        "text": "So I work at pizza slut as a driver and manager in what i consider an upper middle class california town.\n\nI get cursed out so often at work. Like 4 times in the last 2 days. And not like \"fuck you\" its like the worst things you could think to say to someone. One woman was so bad I almost called the police to kick her out. She was upset because she wanted free cheesesticks (but she didnt add cheesesticks to her order and she already had a 50% off pizza coupon?). After my tall, built driver happily threw her out I ended up quitting on the spot because I'm done being treated like absolute trash over $7 cheese sticks. \n\nIs my stores area just a soulless black hole? Is this a problem in all food service jobs? \nAnd I'd love to hear some horror stories about past customers if anyone has any.",
        "created_utc": 1496485029,
        "upvote_ratio": ""
    },
    {
        "title": "\"Oh the wreath blocked the door!\"",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f0cwd/oh_the_wreath_blocked_the_door/",
        "text": "So I know I've been posting a lot but yeah. I've been trying to space things out so I don't spam the board\n\nAnyways,\n\nSo I'm taking a delivery to our highest delivery area, mostly filled with really nice houses and the such. And as I go there, it already sucks since it is super far from theatre so my delivery times get fucked. Anyway so I get there and wait. I do my first knock and I hear movement. Which is a good sign, I should be all good to go! Just wait for them to do what they can to get ready and open the door! Because of this, I wait a little longer before knocking again. This time, it hear giggling. It's the worst thing you can hear anywhere, not just for a delivery, but anywhere in life. So I obviously see that they're home, and for some reason not door because god knows why. So I figure that I'm not going to call and just leave. Of course, wouldn't you know it? The second I reach my car, some little ass kids run out screaming \"wait wait!!!\"\n\nHell is on earth\n\nSo I've now been here about 5 minutes as they finally go and get the pizza. I'm visibly annoyed. Their reasoning s \"oh the wreath on our door blocks the view\" (it's like March or April at this time)\n\nFine. Go sign the fucking thing. I give them the receipt and pen and kind of just stare at them with a look of. . . Not a scowl, but a look of \"you're fucking wasting my time\"\n\nI guess they decided that right around then was a good time to bust a nut or something because it turns out that it took a another 5 minutes for them to sign the damn thing. There was a mom there who eventually came out and signed for it, but still, what the fuck?! This mom handed me the card and I think I got like a $3 tip idk. Whatever, it's a 10 min drive back to the store, I'm fucked anyway. \n\nWhat the fuck was their goal? Even as she was giving me the thing the kids were like \"you should have seen the look on the pizza guys face!!\" And shit like that.\n\nI go back to the store and tell the shift manager, and he's just like\n\n\"Yeah I think I delivered there before. The kids just laughed at the door and would run out later to waste your time. But when I delivered there I just drove off when they ran outside. Their parents called back and after I explained the situation she apologized and we brought it back\"\n\nWhich just kinda made it funny but also worse! How the fuck do the parents allow their kids to do this shit twice! And she was there! There's no excuse!\n\nSome peoples kids, man. . .",
        "created_utc": 1496482199,
        "upvote_ratio": ""
    },
    {
        "title": "Really Grinds Your Gears",
        "author": "Trubsy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6f013q/really_grinds_your_gears/",
        "text": "I had a delivery today to a notoriously shitty apartment complex tonight. It was late at night and raining like a mother fucker. The receipt said 1900 X# apartment. 1900 is the office building, which usually happens when people order online from apartments. I called to see what the BUILDING number was and asked him to go look in the middle of the building, because there's no way it's 1900 if the apartment number is X#. I even explained that the apartment buildings start at 1901, but the kid insisted it was 1900. I repeated that's not possible and asked how to get to him. He said oh just take 2 lefts and a right and I'll be outside. I tediously followed the microscopic apartment number signs (which led me to a completely different direction than what he said). I was expecting a light on or someone outside, but the apartment had no porch light on, and he wasn't outside. (It took me maybe a minute after the phone call to find the place). I knocked on the door and when he answered and he goes \"What took you so long I told you where I was\" WEW BOY. I calmly said yeah see the number on the building? That's 1938, not 1900. Then his dad walked out of his room and told me to come inside and \"get out of that fuckin rain young man\", I said nah it's fine I've been in it all day. He then told his son \"you better tip this man for that.\" Guess what. Kid's bill was 27 and change, handed me 30, and asked for the EXACT change back. Told him sorry bro I don't carry coins. Got a 9 cent tip ;) I wish I had the father's number. If my dad knew I did that I'd get an ass whooping from here to there.",
        "created_utc": 1496475489,
        "upvote_ratio": ""
    },
    {
        "title": "If you're going to let your kids order pizza, please make sure they know what a tip is.",
        "author": "PhunkyPhazon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ez4u1/if_youre_going_to_let_your_kids_order_pizza/",
        "text": "I've been delivering for a few years, and I've always known what to (generally) expect when someone under the age of say, 15, answers the door. Most kids don't understand the concept of tipping or if they do, they don't know how much. The thing is, these encounters are typically few and far between, so I've never been all that bothered by it.\n\nUntil now.\n\nI don't know why, but in the last two or three weeks I have delivered to children four times. And when I say children, I mean LITERAL children. Like, 8-12 years old, apparently home alone and with access to a credit card. I have no idea why this is suddenly a thing (and I would love to ask questions about why elementary school kids are being left unattended, but that's another topic). I'd contribute it to summer vacation having just started, but in my three years of delivering this is a first.\n\nBut yeah, of those four child customers, only one of them gave something even resembling a decent tip. With the others, I was lucky to get 25 cents. If this is going to be a thing now, so be it. But, on behalf of delivery drivers everywhere, I ask any parents reading this: \n\nIf you're going to let your children order for delivery, please teach them what a tip is. I'm not asking they even tip WELL, but believe me, when we drive to the edge of our sectors only to be greeted by a ten year old, we'd rather drive away with an extra buck or two instead of nothing at all.",
        "created_utc": 1496460919,
        "upvote_ratio": ""
    },
    {
        "title": "Lemonade stands",
        "author": "badly_overexplained",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6eyz9l/lemonade_stands/",
        "text": "What I love most about delivering pizza during the summer is the lemonade stands.  Today I actually had some kids run up to me while i was delivering a pizza and they offered me a free sample and told me they loved our pizza.\nDoes anyone else like to get 50 cent lemonade while delivering pizza?  Also, garage sales because I can browse a bit while they get their money and possibly come back when my shift is up if I spot something nice. ",
        "created_utc": 1496458789,
        "upvote_ratio": ""
    },
    {
        "title": "The 69,420'th \"I hate smug ass tippers\" thread",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6eyfnw/the_69420th_i_hate_smug_ass_tippers_thread/",
        "text": "So me being the nice guy (*le fedora tip*) That I am, I generally don't hark too much about not getting tipped. Granted, I PREFER being tipped, but I'm not going to like bust a nut on their pizza because I didn't get tipped. It bothers me to get stiffed but meh. . .\n\nWhat BOTHERS me though is when people obviously live in nice homes, and have money, and DO decide \"Let me tip\" but decide to be cunts about it. It's even worse than being stiffed, because at least you can think \"oh maybe they forgot\"\n\nSo I'm going on a month long vacation this month, and I was working my last day until July. It's been an okay day, but the kicker is on one of my later deliveries. I pull up to a decent looking house with a decent looking order (I think 2 pizzas? I honestly don't remember). It's a cash order too, which is a danger zone. I'm either going to get a pretty good cash tip that is distinctly separated from the cash, I'm going to be able to have them round up to $25 and they're like \"keep the change\", I'm gonna get like a 15 cent tip to round up to the next dollar, or I'm gonna get exact change.\n\nToday was none of those.\n\nThis kinda Urkel kid walks up to the door and gets the pizza. He's pretty friendly, I guess, but not in the \"Oh how sweet\" kind of friendly but more in the \"Friendly dorky kid that would probably spend 40 minutes to you talking about Hearthstone in great detail even though you have no idea what it's about.\"\n\nSo I give him his order and I'm like \"yea so that's $21.40\"\n\nHe smiles and hands me the change and says \"Allright! Here's 21 dollars, and here's 50 cents! You can keep the change as your tip!\"\n\nBesides the Little Caesar's story I posted, this is the only time where I've really \"broken character\" in front of a customer. I'm not entirely sure to describe the sound that I made, but imagine it like someone's voice cracking while doing a scooby doo impression. But I'm just like \"O-Oh b-BOY, T-THANK YOU!\" and was on my way.\n\nLike fuck man just stiff me lmao don't make me feel like shit lmao. Probably thought his bitch ass was being generous too.\n\nLike if it were a carry-out order like yeah okay cool thanks, I don't think any cashier would give a shit, but it would help with our cash count if some change went missing or whatnot.\n\nLuckily this is the only time where someone had verbally made me aware that they were giving me a shitty tip (but I've had plenty of tips under a dollar too so)\n\nhelp",
        "created_utc": 1496451733,
        "upvote_ratio": ""
    },
    {
        "title": "Story time",
        "author": "krazyjake247",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ew0bf/story_time/",
        "text": "So when I was 11 or 12 I had a bunch of friends over (we were home alone) and it was about 10am. we got hungry so we called Pizza Hut and they told me they didn't open till 12 but I still placed the order anyway. The total was about $35. Well because we were 11 we didn't have any money so I went into my dads room and got the change jar(plus $5 tip). \n\nThen we sat there for 20 minutes counting out the money IN COINS. Well about 2 hours later I got a knock on the door and it was the pizza guy. So gave him the coins in a ziplock bag and he didn't wanna take it so we called his manager and he said it was okay so he took the money.    \n\nI'm posting this because I wanna know if anyone else has done something similar.",
        "created_utc": 1496426230,
        "upvote_ratio": ""
    },
    {
        "title": "Security Guard Problems?",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ev53r/security_guard_problems/",
        "text": "You ever have [one of these rentacops](http://www.thewebcomicfactory.com/comic/tales-of-pizza-securing-your-pizza/) stop you (or try to stop you) from delivering a pizza?",
        "created_utc": 1496418028,
        "upvote_ratio": ""
    },
    {
        "title": "I got paid $38? ....what the fuck?",
        "author": "Dent18",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6euyay/i_got_paid_38_what_the_fuck/",
        "text": "I worked 23.5 hours over that period. Let's assume, worst case scenario, all these hours were on the road. So $4.25 times 23.5 is $99.875. \n\nHow the fuck did I lose 62% of my paycheck to taxes?\n\n__________\n\nThis is at a corporate Papa John's, by the way. So we get paid every Friday morning by direct deposit. I assume/hope that takes into account Thursday hours (last week I got $23, I just started and only worked a Saturday and a Thursday. That was 11 hours. 11 times $4.25 is $46.75. 50% of paycheck gone. What the fucking hell)",
        "created_utc": 1496416157,
        "upvote_ratio": ""
    },
    {
        "title": "A guy asked me while I was on a delivery if we were hiring...",
        "author": "SpicyDucks",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6eu5iq/a_guy_asked_me_while_i_was_on_a_delivery_if_we/",
        "text": "But he didn't tip. He even told me to put a good word in for him. Not sure how I'm going to do that lol. ",
        "created_utc": 1496407603,
        "upvote_ratio": ""
    },
    {
        "title": "WE ARE NOT LITTLE CAESARS",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6et82k/we_are_not_little_caesars/",
        "text": "\"You guys got anything ready?\" is a question that bugs me every time it gets asked to my while I pop on the cashier's area. Usually it's  just a peeve though, the people will genuinely just not realize that we don't do that, and they'll place an order, pay nicely, and be on their way.\n\nThose memories of nice customers ran through my head as I answered the phone, and got asked the classic question. First off, I figured it was a little odd that I'd get a phone call asking about this (seeing as, if we did have a \"hot and ready\" area, it could change from the driver over). But I told her we don't causing her to simply give an annoyed sigh and hang up. Weird, but okay (this was the same day that I got a prank call from a kid requesting a \"Pee pee pizza with extra farts\" so I'd just accepted that phones were gonna be weird.)\n\nSo another phone call happens. My manager is making me clean so I run to the phone to get a break. Same woman again, only this time she seems to be more cooperative. She asks me how long it would take to make a pizza, so I give her our 15 minute wait time. I figure she either didn't want to drive down to Little Caesars (which is in our delivery area so it's not TOO far), or someone really wanted Pizza Hut but with Little Caesar rules. She asks me how much one large pizza would be. I tell her about our $10 deal.\n\n\"But Little Caesars sells them for $7\"\n\nWell damn get some Little Ceasars then lmao. I'm not entirely sure what she thought she was going to get out of that. Maybe she figured we had some \"Price Match Garuntee\"\n\nLike \"oh golly miss, you're correct! I'll go ahead and adjust that price for you!\"\n\nBeing insanely nice on the phone, I just kind of went \"Y. . . Yup.\", causing her to just hang up.\n\nwhy do people do this\n\nyou're not even home\n\nIf you just make the phone call before you get ready to leave, it'll PROBABLY be ready by the time you get here. \n\nLike Little Caesar's is doing the lord's work in cheap ass pizza but still please don't assume that every store is like that.",
        "created_utc": 1496393929,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone Have Some Weird Stories?",
        "author": "Trubsy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6esxu3/anyone_have_some_weird_stories/",
        "text": "I worked at Jimmy John's for 2 years, almost nothing abnormal happened. I've been at Pizza Hut for a little over a month now and holy shit. Delivering pizzas at night is some weird shit. I've been flashed by strippers, got offered drugs, been given the offer to buy drugs, had some rednecks from out of state at a hotel try to get me to give them a weed connect, saw a man scream at his girlfriend/wife for ordering pizza without his permission, had a woman try to break into my car to move it because I was parked in her spot, the list goes on.\n\nAnyone else have weird stories? Or is my city just fucked?",
        "created_utc": 1496388740,
        "upvote_ratio": ""
    },
    {
        "title": "A Strange Order...",
        "author": "1512832",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6esdy8/a_strange_order/",
        "text": "This happened just a few hours.\n\nWhile at the cut table, I turn around to look at the oven and see this [giant inflated crust](http://i.imgur.com/k7pPZXp.jpg) coming out. So I yell to my manager, \"What the hell is this?\" to which he replies, \"I don't know, no cheese or sauce.\" So I'm like, \"Well, alright. I'll never understand people,\" then continue to [cut it](http://i.imgur.com/D8dtUAm.jpg) (with little success) and put garlic oil on it.\n\nOut on the delivery I go, and I mention to the guy that it was a bit hard to cut and he seemed fine with it and wasn't laughing or anything. That's where I knew there was definitely a mistake.\n\nAs I get back to the store, I see my manager on the phone, and as he hangs up, I ask him who that was. It was the no cheese, no sauce guy.\n\nHe wanted a sausage pizza.\n",
        "created_utc": 1496380057,
        "upvote_ratio": ""
    },
    {
        "title": "I smacked into a Kid.",
        "author": "Drakidor",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ernh4/i_smacked_into_a_kid/",
        "text": "WASNT MY FAULT\n\nA kids party place nearby always orders from us and often a very large amount of Pizza. I was carrying 6 of the like 18 pizza in and shouted if it was clear (since I couldn't see the kids as they are too small). All the parents said I could go and right into my first step I kneed some child right in the face. \n\nThe kid was fine, got right back up and resumed running at a frantic mother apologized heavily to me before chasing the kid down. Work got called and I'm waiting for my new nickname. (Boss was cool with it, this actually happenes before to another driver. Nobody got seriously hurt.)",
        "created_utc": 1496370526,
        "upvote_ratio": ""
    },
    {
        "title": "'Urban' deliveries",
        "author": "papajohnpeon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6eoqpz/urban_deliveries/",
        "text": "[removed]",
        "created_utc": 1496342056,
        "upvote_ratio": ""
    },
    {
        "title": "Worst delivery that you ever made (because it was your fault).",
        "author": "NormanRB",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ensyp/worst_delivery_that_you_ever_made_because_it_was/",
        "text": "I'm not talking about '... I forgot their soda with the order..'. \n\nFor example, here's my story.\nI was delivering one very rainy, night and had so many deliveries (only driver for the night) at once that I had'm stacked in my front seat and not in the warming bags. Well the short story is that without the bags to also keep the boxes dry, a few orders were crushed under the weight of other orders due to the boxes being soaked. Not only did I get drenched making the original deliveries but also had to go back shortly later and deliver a few again due to the pizza being a mess. Then I had to stand there (still pouring rain) and count out the refund of the full amount.\nIt was the worst night of my life as a delivery person.",
        "created_utc": 1496333879,
        "upvote_ratio": ""
    },
    {
        "title": "[Pet Peeve] \"Don't use the damn blinker ! I'll just guess wherever the hell it is you're going !!\"",
        "author": "QcRoman",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6emh8l/pet_peeve_dont_use_the_damn_blinker_ill_just/",
        "text": "I am a delivery driver but this is also more widely related to driving in general. One of my biggest pet peeve out on the road is about not using something that comes standard on every vehicle out on the road, requires the smallest effort to use and I have yet to see someone pulled over for, ever: blinkers/indicators/turn signals.\n\nAll day, every day. \n\nIt's not like I'm out on a casual ride and I get to choose where I have to go. Sure I can adjust the chosen road to get to my destination to a point but at the end of the day I have many different addresses to get to, preferably faster than not, and I have to deal with so many inconsiderate self absorbed drivers that it just gets to me and I end up saying out loud, in the car, by myself the quote I used as a title.\n\nMy \"favorite\" is coming out of the place's parking lot where most of my outings have me make a left onto the street out front. Across the street, diagonally to the left, is one of those coffee shops, the largest chain in Canada. Most of its traffic comes there from my left as I wait to enter traffic. Way too often I sit there waiting for a car to cross in front of me as they don't have a turn signal on only to see them make a left into the coffee shop's parking lot/drive through lane without ever using the turn signal which would allow me to make my left and enter traffic safely while they make their own and go about their business of filling their caffeine addiction.\n\nAnd I don't need to tell you about all the lane changes and other situations where indicators should be used and are not. We've all seen it time and again.\n\nPeople who don't use turn signals are just assholes the way I see it. It requires too little effort to be dismissed as anything else of a reason not to be predictable out on the road, help out other drivers and road users and just be safer.\n\nThoughts, comments ? \n\nThanks for reading.\n\ntl;dr: title.",
        "created_utc": 1496320905,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone Park In The Wrong Place And Get Yelled At? (Then Rewarded?) Semi-Long Story",
        "author": "Trubsy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6el9xp/anyone_park_in_the_wrong_place_and_get_yelled_at/",
        "text": "There's this apartment complex where I live that is completely ass backwards and I still haven't figured out the layout. There's 3 sides and 3 floors of each building so you basically have to walk up and down each one trying to figure out where your room in this shitty ass layout is. Like floor 1 would be 1000, floor 2 would be 1400, shit make NO sense. So anyway this complex has 0 parking spots available ever, and the only places you can park are in front of garages. 99% of the garages never have cars in front of them so I didn't think it was in issue to park there instead of walking a mile. I walked up and down 9 flights of stairs because the numbering of this place makes 0 sense at all. (no tip on a $55 order btw.)\n\nWhen I got back to my car I saw some biker lady trying to fucking break into my car, I said \"HEEEY I'm a pizza guy, sorry if I took your spot, I didn't know anyone needed this spot!\" in a friendly tone. She started screaming at me for being an asshole, I can't park there, don't ever do that again, etc. Her boyfriend or husband or baby daddy or whatever got off his bike and started talking shit too. At this point I was ready to throw hands. But I explained again that I was a pizza guy and that's why I took their spot. He actually felt bad, apologized and actually sounded sad and threw me a $20. This was the weirdest delivery of my life. Had about a 20 minute conversation about him and his life. Shit was weird.",
        "created_utc": 1496303204,
        "upvote_ratio": ""
    },
    {
        "title": "My employees lost the cash I turned in",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ek6j8/my_employees_lost_the_cash_i_turned_in/",
        "text": "[deleted]",
        "created_utc": 1496288017,
        "upvote_ratio": ""
    },
    {
        "title": "General Questions Thread!",
        "author": "trmbnplyr1993",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ej7xe/general_questions_thread/",
        "text": "This is a new general questions thread. Any general questions can be asked and answered here in regards to anything pizza delivery! Any story leading questions can be made as their own post, but questions should be posted here. Previous question post will be posted below for viewing purposes.\n\n[New driver/Customer Thread](https://www.reddit.com/r/TalesFromThePizzaGuy/comments/614md8/customer_new_driver_question_thread_please_read/)",
        "created_utc": 1496277196,
        "upvote_ratio": ""
    },
    {
        "title": "Chronicles of Michigan Winter Delivery Driver [Long]",
        "author": "TheCyber416",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ehl5m/chronicles_of_michigan_winter_delivery_driver_long/",
        "text": "These are all from this past winter, if you didn't know then this year the NE and Midwest got a horrible winter between melting and freezing and horrible snow, sleet, and ice storms. I deliver in a VERY rural area with the store being in a ~2000 town but I am from the ~800 person town that is within range. So there is an intersection of two state highways (not freeways) in the 2000 town and one of those in the 800. All other roads are just your 55 or in town 25 roads. Didn't get as bad here but that also mean't we had to deliver and sorry to those in the NE that did during these storms. Also sorry for the long read as I didn't want to spam the page so if a certain story looks good below just \n\n**Summaries**\n\n1) Someone angry with us taking long in a snowstorm when only two drivers are available AFTER telling them it would be over an hour and we couldn't promise a time.\n\n2) Someone angry with us for not delivering that far during a sleet storm.\n\n3) A steep driveway\n\n4) The unmarked house with 6 in. of snow on the ground.\n\n**Actual** **Stories**\n\n1) It was snowing very heavily and being Wed. we only have two drivers and the Manager. We have no luck contacting any other staff as they are 45 - 1hr away during excellent weather and we would be short staffed anyways due to the staffing at the time. Due to the storm we get hit hard and we are telling customers over an hour. After 1 hr I get a call from one of the people and I tell them it is coming out now and should be there within 30min-1hr. They huff and whatnot then hangup. The driver turns onto their street ~30min later and cancels. Sure enough they leave a fun [review](http://i.imgur.com/QPKvuJ1.jpg) (Name blocked out obviously and sorry for potato edit) I could understand if not for the storm and the fact that 1hr 30min or even 2hr is more than 1hr.\n\n2) It was sleeting and roads were so slick that we reduced range to 2 miles with orders from the owner. The trailer park 5 miles away calls and my manager answers to get passed to the entire household to be yelled at for not risking the other driver and I's lives. Bless that storm as they never tip anyways.\n\n3) There is a house on a private drive where about 1000 ft. from the house there is a dip with ~30 - 35 degree slope above a creek. Considering it had melted then frozen with some powdery snow and blowing frigid I had come prepared to get stuck with high grip insulated snow boots, a trapper hat, mask, and gloves. Not wanting to get stuck in that I gear up and shield the bag and walk it. They said they could drive me back down or call me next time I decline the drive as I slid on the way there and didn't want them to get stuck or hit my car. I made it back but man was that cold and I was surprised the pizza stay hot when I checked it at the porch.\n\n4) Another storm with heavy snowfall we had 4 inches on the road as the plows couldn't keep up with 6 on the ground and increasing at a rapid pace. Visibility is also very low and it is night. I am delivering to a close place however I cannot see the driveway and just start binary guessing. First stop led me down to a service drive to a pole as I was thinking perhaps a long driveway. Was able to just turn around with tires spinning and get out. Second guess was an ATV trail and was unable to turn around so fortunately one side gets traction flipping me around and I am able to floor in 2nd out of there. Finally they answer the phone and they have no driveway, just a field with no mailbox with a trailer and car... At least they tipped decent.\n\nOn the bright side deliveries are more frequent with better tips on non-holidays during the winter. ",
        "created_utc": 1496261244,
        "upvote_ratio": ""
    },
    {
        "title": "\"That's for me!\"",
        "author": "Striker__Eureka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6eglzo/thats_for_me/",
        "text": "Every goddamn time I deliver to a goddamn hotel somebody makes that joke. When I'm trying to find the right customer it can get frustrating when a dozen fucking people make that fucking joke.",
        "created_utc": 1496252694,
        "upvote_ratio": ""
    },
    {
        "title": "It finally happened. Someone finally yelled at me for parking in a 'no parking' zone.",
        "author": "Jellz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ecm7x/it_finally_happened_someone_finally_yelled_at_me/",
        "text": "The setting: I'm delivering to an apartment building that has parking only on the far end from the side I need to go to. BUT, there's a strip of concrete that is perfectly sized for a car that goes down to the other side of the building, lined with 'no parking' signs and a handicap parking sign at the end. \n\nNaturally, I drove straight to the end of the concrete strip, threw it in park, and hopped out quickly. Just one pizza, no drinks, no credit receipt, no nothing else. I knew exactly where I was going, I had had to call for the apartment number before I left the store so she was expecting me:, honestly the most quick-and-easy, clear-cut delivery possible. \n\nAs soon as I was out of my car, I heard some old dude behind me: \"Ah he's from Florida, must not be able to fucking read.\" (Sidenote: I have out-of-state plates). \n\n*And you must not be able to fucking see,* I thought, but said nothing as I jogged into the building. I knocked; she answered immediately. She handed me what she said was $20 but was really $19 (the difference between a $1 tip and a stiff), I handed her the pizza and I was jogging back to my car with a pizza bag under my arm. Didn't even count the money, which I normally would've, because I just knew Mr. Parking Police was waiting. \n\nAnd waiting he was. I saw an old guy standing next to my car with his phone out to dial. Before he could say anything, I said what I have always wanted to say in a situation like this:\n\n\"Yes sir, I can read. Call a tow truck.\" \n\nI then jumped in my car, threw it in reverse, and zipped off. \n\nOh, but the story doesn't end there. He called to complain. I love when people call to complain about my driving. I have laughed in the face of managers who have told me about it. I think it's hilarious. Apparently, the guy said, \"He's lucky he's so fast or I would've broken his jaw,\" along with saying he was a disabled vet about half a dozen times. So apparently parking in a no parking zone is punishable by breaking people's jaws? \n\nWatch out, fellow drivers. You've been warned. ",
        "created_utc": 1496204356,
        "upvote_ratio": ""
    },
    {
        "title": "Forgot to tip delivery guy, feel terrible.",
        "author": "gaycheesecake",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ecine/forgot_to_tip_delivery_guy_feel_terrible/",
        "text": "I ordered pizza the other night and usually, I put the tip on the card when I order it. But this time I had singles so I left a few for my dad to answer the door and tip the guy. \n\nSo I figured he did. I found the cash the next morning in the place I left it and felt like a dick right away.\n\nDoes this happen sometimes? I don't want him to think we genuinely didn't care enough for their service to tip him. But, shit happens. \n\nDo delivery people know shit happens or do they think everyone that doesn't tip them is an asshole? Ugh",
        "created_utc": 1496203071,
        "upvote_ratio": ""
    },
    {
        "title": "Swinger Town, USA",
        "author": "RainDownAndDestroyMe",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e7xbo/swinger_town_usa/",
        "text": "Alright, full disclosure this happened when I was a Jimmy Johns driver, though I am a Pizza Hut delivery driver now. \n\nI delivered to an apartment complex that I've delivered to only once before, a few weeks prior. The apartment in question happened to be the same apartment i delivered to last time. \n\nThe lady answers the door and is extremely friendly, which is always nice. \n\n•\"Hey how's it going?\"\n\n\"So good, the kids are gone for the night and we're celebrating. Drinking some Captain Morgans.\"\n\n•\"Yeah I don't blame you, I'd do the same thing.\" \n\n\"Oh! Do you have kids?\"\n\n•\"Hell no, I'm only 20!\" It always flabbergasts me that I look/am old enough to be a parent. \n\nI have her sign the receipt and hand her the food while the conversation takes place. \n\n•\"Is that any good? Never had it.\" \n\n\"You've never had it!? It's soooo good!\"\n\nShe remembers me from last time. \n\n\"You delivered here last time! But I didn't get your name.\" \n\n•\"My name is John Doe.\"\n\n\"Nice to meet you John Doe! Gimme a hug\"\n\nUhhhhh\n\n\"Come by after work and have a shot and see if you like it.\" \n\n•\"Sounds fun but I have an early day tomorrow.\"\n\n\"Well if you change your mind here's my number\" she writes her number down on the receipt. \n\nHer husband chimes in, \"honey, leave him be he has an early day tomorrow he said.\"\n\nI get back to the store and tell my coworker of my awkward encounter. My coworker just so happens to be next door neighbors with them, which I already knew. \n\nHe laughs. \"Oh yeah they're big time swingers, that was her inviting you to play.\" \n\n•\"Oh god.\"\n\n\"So you gonna go play with them?\"\n\n•\"Fuck no.\"\n\nAnd that's how I learned that there's a vibrant swingers community in my fairly Mormon city. ",
        "created_utc": 1496157100,
        "upvote_ratio": ""
    },
    {
        "title": "Accidemtly got a $30 dollar tip",
        "author": "pleasegivemesomepie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e6fp9/accidemtly_got_a_30_dollar_tip/",
        "text": "Few nights ago I was Delivering 3 pizzas to this house at night, I walk up to the door and hear nothing but blaring loud music, I ring the door bell, a minute goes by and nothing, knock a few times and calling him, then eventually , a good 15 minutes later his mom answered the door. She calls up her son and he comes. I read him the total, 59.68 and he hands me a wad and says its 70$ And  keep the change, alright!! I hand him the pizza and go on my way. However once I got in my car and counted the cash it turned out to be 90$. So I called him back telling him the mistake and he'd be outside in a minute to get the extra 20, after standing outside for a good 15 minutes with nothing happening I just left. With a 30$ tip!!",
        "created_utc": 1496138863,
        "upvote_ratio": ""
    },
    {
        "title": "Should I thank people for a tip?",
        "author": "pleasegivemesomepie",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e676g/should_i_thank_people_for_a_tip/",
        "text": "At my job most people (I'd say 9/10) pay with debit or credit card, so my question is should I thank people for the tip they leave when they pay through a machine? I just find it rude for me to stare at the paper as it's printing just to see how much I got. I'm just wondering this because once in a while I would get a 10-15$ tip and not thank them because I didn't look at the receipt. What do you guys do? ",
        "created_utc": 1496134909,
        "upvote_ratio": ""
    },
    {
        "title": "Who is that favorite customer of yours?",
        "author": "jbtk",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e5ubo/who_is_that_favorite_customer_of_yours/",
        "text": "We all have one. We see the address pop up, we see it lines up with our run, we get excited...\n\nThere's this one guy I deliver to every few days or so that orders a single pizza. Most of his orders after tax and delivery charge come out to more or less $20. I walk up his steps and ring the doorbell and every time he makes me feel like I'm one of his friends he's goofing around with. \n\n\"Hey how's it going today man?\n\n\"What's up bud???\"\n\n\"Your total comes out to...\"\n\n\"Gimme my fuckin' pie bro\"\n\nTosses me $15 over whatever the total is. He's had cheaper orders like $12 and he'll still tip nearly $15. I always ask if he needs change and he says hell no man you have an awesome night. People like this are seriously so fucking awesome. With his welcoming and carefree attitude a $3 tip would suffice, even lower since it's not that far from the store. That one dude makes my hellish shifts so much more rewarding.\n\nWho is that customer for you?",
        "created_utc": 1496128628,
        "upvote_ratio": ""
    },
    {
        "title": "Funny Story (You'd have to be there?)",
        "author": "Runferretrun",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e4ok5/funny_story_youd_have_to_be_there/",
        "text": "So, at the time I worked for a medium sized VA outpatient clinic.  It was fairly common that someone on staff would order delivery at least once or twice a week.  The delivery driver didn't have the customer's name or clinic.  It's 11:30 ish and there's an overcall, \"Woukd whoever ordered (store name) come to the front desk?  Your pizza is here.\"  The employee who ordered was vegan.  Or at least his wife was.\n\nThere was a fair amount of laughing when the announcement went over head.\n\n\nAnother announcement story.  There was a new employee working front desk.  There was a mess that needed cleaned up.  The correct call is \"Houskeeping to (location)\" then a number code of wet, dry, body fluid.\n\n\"Housekeeping to women's restroom flocation).. bring a mop and gloves.\"  \n\nWeird place",
        "created_utc": 1496112323,
        "upvote_ratio": ""
    },
    {
        "title": "Scheduling dispute with manager?",
        "author": "abrawt00",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e4lh9/scheduling_dispute_with_manager/",
        "text": "Just started at a new place for the summer, at the moment I'm taking summer classes, and when I was interviewed and hired, I made it clear that I was looking for 20, 25 hours maximum which would most to be done on the weekends, because I'm taking summer classes and need time to study/do homework during the week. \n\nFast forward 2 weeks, I've been scheduled 30-35 hours including most of the weekdays right before/after class. I've brought it up to the store manager with all details above (not the hiring) as it started and he told me he needed drivers to cover shifts as we only have 3-4 including me.\n\nHow should I go about dealing with this? I don't want to suddenly quit as I don't want to be letting down the team, but I made it very clear in the hiring process that I can't be working this much. ",
        "created_utc": 1496111252,
        "upvote_ratio": ""
    },
    {
        "title": "How do I stop feeling tired and dead inside a few hours into a shift?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e1pqq/how_do_i_stop_feeling_tired_and_dead_inside_a_few/",
        "text": "[deleted]",
        "created_utc": 1496080140,
        "upvote_ratio": ""
    },
    {
        "title": "Private school in our delivery zone tips when parents dont!",
        "author": "telepathetic_monkey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e1not/private_school_in_our_delivery_zone_tips_when/",
        "text": "A private school we deliver to all the time wrote in their parent handbook that any and all food deliveries will receive a standard tip if the parents don't leave a tip on the cc receipt.\n\nThey even sent a note to our resturant stating if anyone questions the tip to refer them to the school. They photocopy every receipt and the ladies in the office initial them too. \n\nIf it's a cash order and there's not enough for a tip, they have a \"loose change\" envelope for us drivers then \"bill\" the parents.\n\nThis is hands down one of the best schools to deliver to. They don't make you wait for the person who it's for, it's a guaranteed tip, and the ladies in the office actually care and are so nice!",
        "created_utc": 1496079562,
        "upvote_ratio": ""
    },
    {
        "title": "\"Uh... No. Pizza guy! Come back here!\"",
        "author": "JerbaHerba",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6e0ptf/uh_no_pizza_guy_come_back_here/",
        "text": "Disclaimer: I'm a delivery driver for one of the big chains. This incident happened last night, but I wasn't able to post it since I fell asleep.  \n\nI was going on a standard delivery to this one house. It was a clear night, barely anyone on the roads. All in all, a relaxing drive there. I didn't recognize the address that I was going to until I pulled up on the house. It was *that* house. The last time I had delivered a pizza to that house, there was a kid that was pointing a laser pointer in my eyes as I walked up to the front door. After I knocked on it, he took forever to come down the stairs, too. The mother opened the door and told me to wait as she shouted for him. It was some fifteen year old high school kid. By the way he was acting with the laser pointer, I assumed he would be nine, but no. I read him the total, and he handed me a wad of cash. The mother looked at him and asked, \"Does that include the tip?\" He said, \"Yeah,\" and took his pizzas out of my hands and ran upstairs. As I got back to the car, he started to shine the laser pointer in my eyes again as I started to count the wad that he had given. Technically, he did include the tip into the wad of cash; a whole two cents.\n\nThis last encounter flashed through my mind as I put my car in park and got out. *Well, at least there's no laser pointer tonight,* I thought. I walked up to the front door again and knocked. The mother opened the door again and called for the kid. He came down the stairs and I read him the total - $19.98. He gave me a single $20 bill, grabbed his pizzas and closed the door. I started on down the drive way when I heard the front door open again and a female voice shout \"Pizza guy! Come back here!\"  \n\nI immediately tensed and ran over the itemized list in my mind. *Oh, crap. Did I forget a two liter or something? I don't remember there being a drink on the order...* I turned around, puckering my butthole as I walked back towards the door expecting a reaming for something that I thought that I had forgotten. As I got to the door the mother was there. She looked at me and said, \"How much did he give you?\"  \n\"Uh... $20.\"  \n\"How much was the order?\"  \n\"$19.98.\"  \n\"That's what I thought.\" She yelled upstairs for the kid to come down and to wait at the door. She went back into the house for a minute and came back. She looked at her son with one of those \"you're in deep trouble\" mom looks and asked him, \"Why didn't you give him a tip?\"  \n\"Uh... I did.\"  \n\"Two cents? That's not a tip. I told you to give him five. Why didn't you give him a tip?\" The kid just darted his eyes between me and his mother. \"Apologize to him. Now.\" The kid turned his eyes towards the ground and sheepishly said,  \n\"Uh... I'm sorry.\" The mother told him to go back upstairs and handed me a $10 bill. She looked at me and said,  \n\"I'm sorry for that. I expect he didn't tip you the last time either so here's $10. Have a nice night.\"  \nThat's some A class parenting.\n\ntl;dr Delivered to this one house  for the second time who had this 15 year old kid that was being rude by shining a laser pointer in my eyes the first time and didn't tip. Didn't tip the second time and his mom called me back to the door. Dressed down her kid right before my eyes and handed me a $10 tip to make up for the last time. ",
        "created_utc": 1496070050,
        "upvote_ratio": ""
    },
    {
        "title": "T H I S I S N O T A L A R G E P I Z Z A",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dyxoa/t_h_i_s_i_s_n_o_t_a_l_a_r_g_e_p_i_z_z_a/",
        "text": "Prefacing this: If you order a pizza and then bitch about the price when I'm standing in front of your fucking door rather than when you order it, please stop.\n\nAdditionally, if you want to order one pizza for delivery, do not. If you do, do the $7.99 deal online. I can't tell you how many people will spend $20 on just one pepperoni pizza. It physically hurts me inside (especially because usually they're shitty tippers too)\n\nSo I'm taking a delivery. It's a pretty okay Wednesday afternoon, still tired since I had to open, but meh. I take a single pizza delivery to a house that's really not that far (Technically maybe 2 streets away but there's a busy intersection so it's not always such a quick delivery). It's some really weird ass pizza, like half supreme, half cheese.\n\nI get to the house and I get out of the car. Luckily, the woman was already standing outside, which USUALLY is a good sign. I don't have to wait, I can just hang out by my car and do everything super quick, pop back to the store and. . . idk make some boxes or something, it's wednesday (my dudes).\n\nSo she's like \"ARE YOU THE PIZZA GUY\" and me, being in my full pizza hut uniform carrying a pizza bag, reply \"yup\"\n\nSo she walks towards the door, when she starts aggressively pounding on the door. Like, I figured she was trying to break it or something. At this point all I could just do was stand and stare. I wasn't entirely sure what was going on, if she was like locked out of her house or what. I thought later that maybe she was trying to get me in trouble by having her husband open the door and being like \"your driver knocked very aggreesively and rudely please give us free pizza\". But eventually two kids opened the door after like 3 minutes.\n\nThat was weird, but I gave her the pizza. Immediately she asks for the total, and I tell her (its' like $18.35 idk). Immediately she's like \"why would you pay that much for a pizza\"\n\nMentally I'm like \"fuck idk maybe you should have thought about that before buying it.\" but I'm just like \"ya uh sorry that's the price. We even applied this coupon to bring it down.\" So she kinda goes off about that for a bit but she eventually is like \"whatever\"\n\nThe kid hands me the wad of cash, but the mom immediately snatches it. She then proceeds to count every single bill, straighten it out, and put it in my hand. I'm not entirely sure why, because honestly I just eyeball it and as long as it looks fine it doesn't matter, nor do I care if the bills are given to me in a giant crumple. But she did, and I started getting a little antsy because I just wanted to leave. And she gives me exact change because god is dead, and I'm on my merry way. . . somewhat. \n\nI'm sitting in my car, and I hear \"EXCUSE ME SIR!\" I figure maybe she's gonna ask for cheese and peppers or something, so I roll down my window and ask her what's up.\n\n\"This is not a large pizza\"\n\nI'm dumbfounded. Never before in my life did I think I would be confronted with this question. Especially considering I cut this pizza, I knew that this was a large pizza. Usually, I have answers for stuff like this, but for this, I was just lost.\n\nSo I get out of the car, and she tells her kids to give me the pizza.\n\nI look at it\n\nIt's in a large box\n\nIt's a fucking large pizza\n\nI had to go into the details of \"yeah our large is 14 inches and this is the 14 inch pizza so yeah\" but she wasn't having it. She was like \"I paid $18 for this pizza and I deserve to get a large pizza, bring this back and give me a large pizza\"\n\nSo, me being me, I gave her her money back and I'm like \"I'll see what I can do but I'll call you when I'm back at the store, and I'll give you the money back just in case you wanna cancel it.\" For some reason she claimed she gave me $18.50 but fuck i didn't give a shit lmao.\n\nSo I get back to the store, and I am laughing. Actually laughing, wheezing as I have to tell my manager that this large pizza is not a large pizza.\n\nHe's just like \"what the fuck\" and is pretty much like \"yeah call them and tell them that this is a large\". Of course they don't fucking pick up because that would make things too easy. So I have to drive back out there and explain the situation to them.\n\nGranted, one of the older drivers was like \"yo man space out the pizza so it looks bigger\" and I shit you not I have never seen a man craft a pizza with so much tender care as I have with that man fixing up that pizza.\"\n\nSo I drove back, and in classic \"person that gets angry at me\" fashion, she just kinda gives me the money and doesn't say anything.\n\nTechnically, since she gave me back the two quarters I gave her, I made myself a 15 cent tip. Woohoo.\n\nI'm tempted to carry a ruler in my car now so I can be like \"that's 14 inches bitch\"",
        "created_utc": 1496042885,
        "upvote_ratio": ""
    },
    {
        "title": "Pay dispute",
        "author": "MuphynToy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dx7ps/pay_dispute/",
        "text": "My buddy and I have been working at this pizza place for two and one years respectively. I was previously an insider and decided to become a driver. One of the managers said that I was going to get an extra dollar an hour for my training inside. Well he said he was going to take care of that and time went on and it never happened. I ended up going to the owner about it and he said that he knew nothing and that I should talk to that manager because he does payroll anyway. Well I mentioned it and he said he would get around to it. Well around Christmas my friend was told he'd get a dollar raise and so would I. Well here recently I was able to see a form that showed our pays when a manager left the computer on and saw that I didn't get the raise and my friend only got half he was promised. The issue is that we only just found out because our job doesn't make it easy for us to view our pay stubs but requires us to use direct deposit. Any advice?",
        "created_utc": 1496018246,
        "upvote_ratio": ""
    },
    {
        "title": "What would you do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dw5zp/what_would_you_do/",
        "text": "[deleted]",
        "created_utc": 1496005527,
        "upvote_ratio": ""
    },
    {
        "title": "How long has everybody been driving for?",
        "author": "itouchpokemon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dvgtq/how_long_has_everybody_been_driving_for/",
        "text": "I've been doing this for about 2 years now and I pull a decent amount at night, 4 nights a week.  I have no intention of quitting but my car is slowly getting beat down.  \nJust curious if anyone has attempted to make a long term career out of this?",
        "created_utc": 1495997735,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes I Hate People",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dswiv/sometimes_i_hate_people/",
        "text": "[deleted]",
        "created_utc": 1495962361,
        "upvote_ratio": ""
    },
    {
        "title": "Tip to prevent customers getting your number",
        "author": "goonscrubbih",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ds5s5/tip_to_prevent_customers_getting_your_number/",
        "text": "Signed up for google voice last week and downloaded the app for my iphone. Gives you a free number. I can call customers when I have problem from this number on my own phone so they can't get my personal number. Helps when your customer base is mostly idiots and they tend to call you back randomly because they don't pick up their phone in the first place. You can turn on do not disturb mode on among other things.\n\nPs: If you have an out of area number you can get an in-area number so customers are more likely to pixk up",
        "created_utc": 1495948042,
        "upvote_ratio": ""
    },
    {
        "title": "Had to call for a suite number today.",
        "author": "Jellz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6ds5fb/had_to_call_for_a_suite_number_today/",
        "text": "My GPS pointed to a plaza, and I had no suite number/letter. I had never been there before, so I wasn't sure if each business had its own individual address or if it's all one address with different suites.\n\nUnfortunately it was the latter, and I had an incomplete address.\n\nI pulled up and started to dial the number. I surveyed my options as it rang. I had my money on the hair salon. Usually it's good to deliver to salons or barber shops. After a few rings:\n\n\"Thanks for calling Cricket Wireless, how can I help you?\"\n\n\"Thanks, that actually answers my question. I'll be right there.\" I hung up. \n\nA few moments later, I walked into an empty Cricket store. The head of a black female twenty-something peeked out the back, terrified for a split second, then she burst out laughing. She looked back into what I assume was their stock room and said, \"it's the pizza guy\" (still laughing). \n\nI was also laughing at that point; so was the girl in the back. We laughed the entire time I was in the store. We all laughed as I handed her the clipboard and she signed over a $3 tip. We all laughed as I walked out.\n\nMoral of the story, give your whole address :P",
        "created_utc": 1495947896,
        "upvote_ratio": ""
    },
    {
        "title": "Resident crazy man near my store",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dlvlr/resident_crazy_man_near_my_store/",
        "text": "[deleted]",
        "created_utc": 1495860151,
        "upvote_ratio": ""
    },
    {
        "title": "I'm delivering 1 pizza and 17 bottles of water to this guy.. should I stab him?",
        "author": "fiestamango",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dl299/im_delivering_1_pizza_and_17_bottles_of_water_to/",
        "text": "",
        "created_utc": 1495848928,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with no tippers?",
        "author": "sarakerosene",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dkujs/how_do_you_deal_with_no_tippers/",
        "text": "Papa John's offers Papa Priority for custpmers. For $3 extra on top of the $2.99 delivery fee, customers will get delivered to first. Just had a customer stiff me after paying extra and it is just is frustrating. Tipping culture pits employees against customers like this because we depend on these tips for our wages.\n\nNot trying to start a tip argument, just looking for advice on how to handle the frustration without dreaming of penny bombing their car.",
        "created_utc": 1495846267,
        "upvote_ratio": ""
    },
    {
        "title": "Delivering one pizza and 10 bottles of water to this dude rn?????????? Idiot or not?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dktc4/delivering_one_pizza_and_10_bottles_of_water_to/",
        "text": "[deleted]",
        "created_utc": 1495845850,
        "upvote_ratio": ""
    },
    {
        "title": "Just delivered to a house with no numbers",
        "author": "Dent18",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dk533/just_delivered_to_a_house_with_no_numbers/",
        "text": "How are people this motherfucking braindead?\n\nNo numbers on the mailbox, no numbers on the house. Had to fucking binary search my way up the street. \n\nWhat the fuck are these people doing with their lives? What the fuck are they going to do if they need an ambulance? How is anyone this motherfucking fucking stupid?\n\nJesus fucking christ ",
        "created_utc": 1495837746,
        "upvote_ratio": ""
    },
    {
        "title": "Terrible shift",
        "author": "BloatedBaryonyx",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dj4gk/terrible_shift/",
        "text": "I'm in the worst jam. For a bit of background, I work Deliveroo. I started 2 weeks ago, working on bike at the weekends. My second week in, I had to call in 3 times. Once in advance because of a hospital appointment, and the other two because my bikes back wheel literally came off and I had to get it repaired and call out \n\nNow, the first shift back I get ready for work, and I notice a little headset icon in my top screen. I think nothing of it abd start my shift.\n\n3rd delivery of the night and I'm making good time. The directions are a little vague but I think I find the place, the app confirms this for me - a university hall, sixth floor.\n\nI arrive and tell the app so. All I have to do now is hand the order over and swipe \"delivered\" and I can continue.\nBit I get no answer. Nothing on the doorbell, nothing by knocking.\n\nI call up the customer, they pick up and I get no answer. I call rider support and receive the same thing.\n\nI figure out after some messing around that my phone still thinks a headset is plugged into it, and is trying to direct audio through non-existant input and outputs. They cants hear me and I can't hear them.\n\nI spend some time trying to text the customer instead. No response.\n\nI look back at the app to check again that I'm in the right place. It's been 15 minutes. But, somehow, the \"delivered\" button is already checked and its buzzing angrily at me to move into the next order.\n\nI try calling anf texting over and over trying to figure out what's happening.\n\nDeliveroo starts calling me. They must have received a complaint.\nI'm getting calls from other numbers too, doesn't appear to be the customer, but I don't know. It's been 25 minutes.\n\nI panic. I text my boyfriend and I'm relieved when he replies back. He tries calling the customer for me, but gets no answer.\nHe calls rider support and speaks to then for me. Keeps me updated. It's been 50 minutes by the time they hang up to call the customer.\n\nIm panicking. The app keeps removing me for inactivity, and I'm pretty sure that counts as me removing myself from the shift. Which meand I don't get paid.\n\nI can't just leave the order here. I can't just take it with me and complete orders- it takes up most of the bag!\nIt's been an hour and a half by the time I post this- it's helping me keep calm but in pretty sure I'm going to get fired or something.\n\nFrom an outside perspective, looking at my file, I imagine someone seeing more shifts 'skipped' than completed, who's just grabbed food and ran with it, quitting the end of her shift. Im pretty sure I'm not getting paid, and I wouldn't be surprised if they fired me. \n\nI've been crying in the hall, it's been well over an hour and a half. My shift is going to be over soon if it technically isn't already.\n\nI don't know what to do. This is a disaster and I'd love some support.",
        "created_utc": 1495826950,
        "upvote_ratio": ""
    },
    {
        "title": "Saw some d-bag justice unfold before my eyes.",
        "author": "KodyBurns",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dixbk/saw_some_dbag_justice_unfold_before_my_eyes/",
        "text": "Where I work, it's on a Main strip of a busy city so drivers and coworkers have to park in the back of all the businesses. Often times you'll get people parking in the area to drop off friends or whatever so they can meet them at whatever restaurant after the person driving can finally find a parking spot.\n\nThis guy decides to park in the entrance of the parking lot, blocking the entrance while he drops off his girlfriend and finds a parking space. So I enter through the exit side, just drive around him. This pisses him off for some reason. He blares his horn and throws his hands in the air. I park in the delivery driver parking area and yell, \"Why are you about to get pissed and honk at me when you're blocking the entrance bro?\" (He had his window down).\n\nHe looks at me really pissed off, jerks his wheel and goes to cut through the parking lot to another exit area, but he completely runs over a [parking barrier](https://rixproducts.com/wp-content/uploads/2016/11/Parking-Barriers.jpg) and rips his front bumper off. I was laughing my ass off ",
        "created_utc": 1495824904,
        "upvote_ratio": ""
    },
    {
        "title": "I was kind of a jerk to an old man.",
        "author": "4smokesleft",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/6dhrum/i_was_kind_of_a_jerk_to_an_old_man/",
        "text": "Normally Im a chain type of guy, but I was feelig fancy yesterday so I ordered from like a real pizzeria close to me that I had heard was really good and just started delivering. Im an online order kinda guy, and what do you know, they have the option available. But it WORKED LIKE  SHIT, and I was spending way more money for less overall food than if I had just ordered Dominos, so I was already a bit annoyed but hey lets eat some fancy pizza.  Order placed.  \n   \nA little sidenote, my street name ends in \"-dry\" but on some GPS it pops up as \"-drey\". Its a multiple word street name, and theres nothing else like it anywhere around. Its just an extra E.\n\nSo I go back to watching Veep (good shit, I jut started it) and smoking bongs for awhile, then my phone rings. I answer and dont make out the first few words but catch the rest \"mumblemumblemumble... delivering your pizza. Can you spell your street name?\"   \n\nI after spelling it he brings up the extra E and I kinda snapped back at him, yeah man just click it thats it, thinking in my head wtf who cant figure that out.\n\nCouple minutes later he arrives, and its an old man delivering for Senor's Delivery. I guess thats a company here where old people work part time makig deliverys, and the pizza place subs out to them. Suddenly I understood, and I felt like a dick. :/\n\n",
        "created_utc": 1495813891,
        "upvote_ratio": ""
    }
]