[
    {
        "title": "Getting ripped off by home warranty company and subcontractor. What can I do?",
        "author": "bapadaka",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/38avmn/getting_ripped_off_by_home_warranty_company_and/",
        "text": "I recently had work done on my AC unit. It wasn't cooling, and I suspected a refrigerant leak. I called my home warranty company and scheduled a service request. The home warranty company sent over the AC technician to my house to do the work. He supposedly found the leak, pumped it back with refrigerant and left. When I asked if he should check again for a leak after filling the unit with refrigerant, he basically said there was no need. Couple of weeks later, the unit is no longer cooling. I went to the attic and found the leak myself without a wand as I could feel the refrigerant escaping from the copper tubing exiting the unit. I know that the leak was never fixed because when I first moved into the house, the exact same thing happened. The AC units were cooling just fine, until about 2 months in, when it stopped blowing cold air (which is exactly the same symptom now). I get the sense that the technician simply pumped it and walked out with my money. It is now past the '60 day window' for the service request in which any remaining issues regarding the request could have been attended to. I called the home warranty company and was basically told that, since it's past the 60 days, there's \"nothing they can do.\" I called the AC technician's company, and was told that since they already billed out their request to the warrant company, there's nothing they could do, and that this must be a 'new' leak. This is all incredibly frustrating since, despite having a warranty, we still had to spend about $600 on new refrigerant plus the service request fee. Even if I got a new service request, I would assume I'd still have to pay $600 again. Anyway, I have since cancelled my home warranty, and getting in touch with anybody helpful is very difficult from this company if you are not either an existing or potential customer. Is there anything I can do? I know there is an EPA law against filling an AC unit with refrigerant without sealing all of the leaks. I don't know if that would apply here, or if I could use that as leverage somehow. I live in Texas, if any state laws might apply here.\nTL;DR Got AC work done through home warranty company who subcontracts the job to an incompetent technician. Just after the warranty on the labor expires, the same problem resurfaces. Neither party is willing to take responsibility for the unfinished job.",
        "created_utc": 1433292501,
        "upvote_ratio": ""
    },
    {
        "title": "Stay Golden, Ponyboy.",
        "author": "Coffeechipmunk",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/388f2x/stay_golden_ponyboy/",
        "text": "This is going to be a short one, but it still pisses me off.\n\nBackstory: I was in 8th grade, and had to buy The Outsiders for English class (Because the school was too cheap to buy copies), so I needed to get it at Harnes and Bobles.\n\nI heard only great things about this book, so I was super excited to read it. I found it, and as I was pulling it out of the shelf, this man came up to me and said \"Oh, The Outsiders! My favorite part is when **MAJOR SPOILER ABOUT THE STORY.**\" I just turned my head [and looked him dead in the eyes](http://media.giphy.com/media/sCOWrdaV76Lh6/giphy.gif) with the most piercing of stares. He smiled, and just walked away. I still loved the book, but it was just absolutely ruined for me.\n\nTLDR: Don't be a douche canoe.",
        "created_utc": 1433261619,
        "upvote_ratio": ""
    },
    {
        "title": "\"(Civilian) National service doesn't have a card you lying scumbag deserter!\"",
        "author": "SwiftAdept",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/38765s/civilian_national_service_doesnt_have_a_card_you/",
        "text": "This is something that happened in the beginning of the year when I just started my civilian national service (there's mandatory military service in my country and I was exempt, so I chose to volunteer for civilian national service) and just got my shiny card that gives similar benefits to what you'd get as someone who does military service.\n\nTo celebrate, I decided to go with a friend to a small restaurant we saw that gives a discount to people who show their service card (the sign didnt specify if it's just military so we assumed it'd cover me too). So we went in, ordered and had a pretty decent meal.\n\n when it was time to pay I showed my card to the owner and asked if this is also valid for the discount, and he exploded in my face in rage saying that the card is fake, that national service doesn't give those kind of cards and that I'm just a scumbag liar who is evading mandatory service (people who dodge the service are seen and treated very negatively, and sometimes even people who are exempt and didn't dodge fall under flak by the more extreme parts of society).\n\n We spent several minutes more arguing with him over calling us until he decided to scream much more extreme abuse towards me and my friend (including calling her a parasitic whore), we just got up and walked away without paying.\n\nLets just say I'm a lot more careful and hesitant to use the card now when it comes to places that aren't fast food restaurants.\n\ntl;dr \nwent to a small restaurant that offers discounts to people who serve the country in some way, tried to use said discount and got called a lying scumbag.",
        "created_utc": 1433238527,
        "upvote_ratio": ""
    },
    {
        "title": "Server took part of the change as her tip.",
        "author": "scalentseattle",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/386qu6/server_took_part_of_the_change_as_her_tip/",
        "text": "Went out to dinner tonight and received mediocre service. We were still going to leave our server something, despite everything. When time to pay, she only gave back part of the change and kept the rest, assuming it was hers. How incredibly presumptuous of her.\n\nMy boyfriend was the one who went up to pay, if it had been me, I would have said something. I work in a restaurant myself and I have never taken/assumed change from a payment was \"rightfully\" mine. Who in their right mind thinks this is OK??",
        "created_utc": 1433227012,
        "upvote_ratio": ""
    },
    {
        "title": "David &amp; Goliath",
        "author": "Ampli5",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/385wqu/david_goliath/",
        "text": "Hey, first time posting here.\n\nEarlier today I was visiting my local music store to purchase a guitar cable. As a bit of preface, I've been to this particular store before with a buddy to accompany him to buy some guitar strings. The store owner was the only one working and from the brief time we spent there, I caught the vibe that he was the pushy salesman type by watching the interaction between him and my buddy. He challenged my buddy as if he was sure that my buddy needed more than what he came for, trying to get him to buy unnecessary things. My buddy and I have been musicians for a while so he knew what he needed and how to navigate around the salesman talk, but knowing how the store owner behaves now prepared me for today's shit-show.\n\nBack to the story, I came in to friendly staff who pointed out where I could find their guitar cables; the cute girl came to assist me and was still genuinely supportive when I suddenly needed more assistance. I came back to the store minutes later because the cable I bought was faulty, which I informed them of in a polite manner; the dude who helped me this time was happy to make sure that the cable they were exchanging was indeed in working condition and also apologized for the inconvenience—no problem, I was content with the customer service. I got back home and it turns out, the brand of cables that they sell aren't really great since it wasn't working reliably with my guitar. The sound from my amplifier would cut out for a few seconds every now and then, which is not good for live performance since I need consistent sound. For those wondering, I know that this cable was the problem because everything worked fine when I used my other guitar cable (if you *really* need to know why I needed another, I'll explain further in the story). Trivial stuff, this did not upset me in the slightest. My decision was to go back to explain the problem, ask for a refund, and thank them for their time in helping me out since I really was appreciative of the customer service. HOO BOY, grab your popcorn folks.\n\nNow here is a good time to recall how I said the store owner was pushy, I kept this in mind because he was at the store today and I just *knew* he was gonna challenge me on what the problem really was, leading me to the decision of bringing my guitar and my original cable. I head back and sure enough, the store owner decides to take control of the matter since it was the third time I've been there today.\n\nOwner: \"Okay, what's the problem here?\"\n\nMe: \"This cable isn't working reliably with my guitar, the sound cuts out and—\"\n\nOwner: \"Well maybe it's the guitar input, or even the amp for that matter. You were here when we tested it out.\"\n\nMe: \"I'm pretty sure it's not the guitar or amp. I've had both for a while. Look, I have my guitar and original cable in the car. I can bring them up to show you.\"\n\nOwner (with a confident tone): \"Yeah yeah bring them up, bring them on up.\"\n\nIt would have been too much hassle to bring the amp, but I knew the original guitar cable would be enough proof. I make a quick trip to retrieve both guitar and cable. We plug in the faulty cable in the store's amp first and of course, the sound is cutting out after every few seconds.\n\nOwner: \"That can't be right.\"\n\nHe fiddles with the cable input and the sound is staying consistent now.\n\nOwner (smugly): \"See? It must be your input because I just jostled it and it's working fine now.\"\n\nMe: \"I don't need to jostle anything with my other cable though, I'll show you.\"\n\nWe switch out the cables and true to my word, my cable works as soon as it's plugged in and stays consistent. I play a few more chords to make sure and then turn towards him only to see his face had now darkened as he goes to unplug my cable. \n\nOwner (in a gruff voice): \"Why did you buy another cable?\"\n\nWhat the fuck? I was taken aback by his reaction after being in the good company of his employees.\n\nMe (keeping neutral): \"Well I just bought a guitar pedal and I need two cables to connect everything.\" (I told ya I'd explain why!)\n\nOwner (being even more pushy): \"Let's put the other cable in again.\"\n\nWe put the faulty cable back in and it's working consistently now.\n\n(b)Owner: \"I didn't jostle anything this time, it's definitely your input my friend.\"\n\nFUCK. How is it working now? I'm doubting myself at this point.\n\nMe: \"It may be working now but—\"\n\nOwner: \"But what? Can't you hear? The cable is working fine. It has to be your guitar input.\"\n\nMe (losing confidence): \"I guess it could be the input...\"\n\nOwner (salting my wound): \"When these problems occur, it's commonly the guitar's input as most people foolishly blame the...\"\n\nI tuned out his bullshit to think about the situation. My cable never acted up like this faulty cable was doing just moments ago, or any other new cable I've used. I had a feeling that even if it's working temporarily now, it might not in future use. How do I prove this? He thinks the product isn't defective so he can legally refuse my refund in my state since they had a sign up. \n\nI jostled the faulty cable around the input area and the sound was cutting out intermittently like I expected. I plugged in my original cable to do the same thing and *the sound was consistent*.\n\nMe (looking back up at him): \"These guitar cables should produce consistent sound even if it's jostled, like my cable has. The other cable may work temporarily but I can see here that it won't produce sound reliably, and I like to move around when I play so it may be jostled unintentionally.\"\n\nIf looks could kill. The store owner remained leaning on the counter with his arms crossed not saying a word. A staff member that was lingering was now edging away from the silent anger this store owner was producing... at least it was consistent. I have to admit, I was intimidated because I'm a younger guy in my early 20s, this was an older and bigger ~~dude~~ gentlemen who definitely seemed like he had been in the business for a while and never lost an argument. His persistent argument had come to a stop. David had conquered Goliath.\n\nThe silence filled the workroom for about a few seconds more.\n\nMe: \"... yeah I'd like to return the cable\". \n\nThe owner was as reluctant as if he was digging his own grave while he proceeded with the refund process. The phone rang and he barked at another employee to finish it as he went to answer it. \nI thanked the staff for understanding, and I thanked the store owner but I don't know whether he was too focused on the phone call to not hear it or just chose to ignore me.\n\n It will forever haunt me. \n\nJust kidding, if I ever go back it'll most likely be to chat up the cute girl cause that store owner was a dick.\n\nTL;DR: Store owner was a dick.\n",
        "created_utc": 1433210611,
        "upvote_ratio": ""
    },
    {
        "title": "Change shouldn't be this hard to achieve",
        "author": "Boghoss2",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/385i16/change_shouldnt_be_this_hard_to_achieve/",
        "text": "Stop at an office supply store to pick up some pens. Cashier looks like she is early 20s. Total is $6.75 so I give her a $10 bill and two $1 bills. She looks at me, looks at the bills, looks at me again and says \"It's only $6.75.\" I say \"That's right\" and nod towards the cash - she is definitely confused.\n\nSo she punches in the cash amount on her screen and tells me my change is $4.37 back. I know this isn't right because I gave her the $1 bills so I could get a $5 bill back. Her response? \"Oh - I put in $11 instead of $12.\" \n\nSo she gives me change back for $5.37 - as a $5 bill, 3 dimes, a nickel and 2 pennies - I don't think she knows what a quarter is, despite me seeing at least 10 of them in her drawer.\n\n\nWhen I look at he receipt to see why I got weird change back on a total of $6.75, I see she punched in that I gave her $11.12 for the purchase. This is why I fear for our future...",
        "created_utc": 1433204122,
        "upvote_ratio": ""
    },
    {
        "title": "I must look suspicious.",
        "author": "Krazed_Bunny",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37xzb7/i_must_look_suspicious/",
        "text": "This happened a couple of years ago, but I decided to share anyway.  This is my first post, and I'm typing on mobile, so please forgive any formatting errors.  This was also a long time ago, so I'm sorry, but I can't remember the exact wording of the conversation.  \n\nI was shopping for a purse in a sort of nice retail store.  Now, where I live there are plenty of people who dress casually when shopping, no matter what store they go into.  However, there are also people who do dress up a little for stores like the one I was in.  I had been there a hundred times before, though, so I was fairly comfortable, even though I tend to be on the more casual side of things.  \n\nI was in the purse section, because I have this total obsession with them, and really wanted and needed a new one.  I'd found the purse I wanted, and I was holding it while casually browsing the others around it for a moment, and this male employee walked up to me and asked if he could help me.  \n\nI told him that no, I was fine, and smiled, trying to be friendly, as usual.  He then proceeded to take the purse from me and kept asking me if I needed anything else.  He was literally holding the purse away from me.  I could tell he thought that I was going to try to shoplift it or something.  His body language and attitude screamed it.  \n\nAfter insisting I was fine for what felt like the hundredth time, he finally (reluctantly) returned the bag to me, and I went to a cashier and paid.  \n\nI had never been treated like that in a store before.  Ever.  I wasn't trying to hide the purse, and I clearly had my own with me.  Would've looked pretty weird if I had tried to walk out with TWO bags on my arm.  \n\nI called the store when I got home and complained.  The woman I spoke to was super nice, and kept apologizing.  She made me feel much better about returning to their store in the future.  I've gone back to that store since then, and haven't seen that guy once.  Can't say I miss him. ",
        "created_utc": 1433065832,
        "upvote_ratio": ""
    },
    {
        "title": "My 8% tip",
        "author": "SanErino",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37opqs/my_8_tip/",
        "text": "On mobile; blah blah blah.\n\nI went to the restaurant across the road from the motel at which I'm a guestwhile working. I went to this restaurant last night and everything was pretty good considering it's a small town 90 minutes south of Alaska's second-largest city.\n\nFor brevity, I will cut out a lot of things since I can wordy.\n\nGuy seats me and gets my beer order saying this is Jenni's table. Guy shows up 15 minutes later asking if Jenni had showed up (No). Jenni shows up, takes my order and I comes back with my food. I finish beer while eating, finish beer, say Hello to another server who takes my next beer order as Guy is swooping in to help. Jenni shows up and I ask for check. 10 minutes later I go to bar to get change as I only have a $1 in my wallet. Jenni sees me at bar, mumbles something, I return to seat. Five minutes later, make eye contact with Jenni (the first time I've seen her from my seat other than at the table), she comes over and I ask for my check again. She thought I was paying for it at the bar when I was getting change. I was getting change for the other $1 for the 8% ($2 on $25).\n\nIt was bad. And I felt bad. I wanted to give Guy the amount I usually tip since he was the only person there paying attention (other than random server walking by). I rarely tip poorly, but for the server to only be seen at table three times in an hour is awful and she deserved it. Since it's the closest place to eat, I'll be going back tomorrow and try to get in Guy's section and (of course) over-tip to make up for Jenni and tonight.",
        "created_utc": 1432875955,
        "upvote_ratio": ""
    },
    {
        "title": "Garden Dep't employee doesn't know her stuff.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37mhq4/garden_dept_employee_doesnt_know_her_stuff/",
        "text": "On a property I used to own we had a row of Siberian Cedars which I had planted a few years earlier.  One died, leaving an unsightly gap in the row, so I went to a big box store to get a replacement.  \n\nAn garden dep't employee asked me what I was looking for and when I told her she was stumped.  She had never heard of Siberian Cedars before (they are quite common around here due to our Siberian type climate and are quite distinctive looking), and was pretty sure I was mistaken.  \n\nWas I sure I had the name correct?  Yes.  \nDo they go by a different name? No\n\nShe quizzed me for a while, then directed me to the trees and shrubs area.  As soon as I got there I saw what I was looking for.  There were about 40 of them, in 5 gallon pots, all with hand written tags that said \"SIBERIAN CEDARS\" in big big letters.\n\nI didn't have the heart to tell her was a moron she was.",
        "created_utc": 1432838066,
        "upvote_ratio": ""
    },
    {
        "title": "The Spark",
        "author": "MouseMistro",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37met7/the_spark/",
        "text": "There is a grocery store that my husband and I go to mainly for small grocery trips or little things we may need here and there. \n\nAbout 3 months ago they hired a guy who I would guess is around 18-19. Now, this guy had the spark. Anyone who has dealt in retail or similar jobs probably knows what I'm talking about. It's probably one of his first serious jobs and he wants to do his best, be everyone's friend, eager to please, and is going to love his job. Bright eyed and bushy tailed comes to mind. With every customer he would carry conversation and smile. \"Hey how's it going! Oh that's great! Hey you have a great day!\"  It was funny to see in that it was obvious how much of that spark he had, but it was nice to see as well, since it's a rare thing. \n\nSo fast forward to this week, since we don't regularly frequent this store we haven't really seen the guy since he was hired. We decide to go to the store and low and behold, he's our cashier. \n\nThe change was too obvious not to see. That spark had not only been destroyed, but it had its soul sucked out while it was slowly crushed by a wrecking ball in the form of retail. Not a single smile. The glimmer of innocence long gone and replaced by misery. \"Hi. Credit. Yep. Have a good day.\" He said in the smallest amount of words possible and in the most miserable voice. Barely acknowledging any customers except for the same basic sentence.  \n\nBoth my husband and I having worked in retail have seen the spark destroyed all to often, and can normally tell which are the new workers.  But I don’t think we've ever seen the spark so quickly destroyed in a 3 month inning. Sad to see, as we always try to encourage those workers by being friendly and responsive to them. \n\nTl;Dr: Another one bites the dust.",
        "created_utc": 1432836804,
        "upvote_ratio": ""
    },
    {
        "title": "Tell me you want a duck",
        "author": "katzbird",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37juye/tell_me_you_want_a_duck/",
        "text": "This is not my story, but my dad's. Also sorry for formatting, or lack thereof, I'm on mobile.\n\nThis happened about twelve years ago, when I was five. My dad got two tickets for a baseball game, one for him and one for me. \n\nI really wanted to go because the stadium was handing out \"celebriducks\", rubber duckies made to look like celebrities. But of course, I got sick the night before and couldn't go out. \n\nHowever, the duckies were only to be handed out to kids. But my dad had a plan. He brought my ticket to the game, and had his cell phone to call home and prove there really was a kid. Sounds foolproof, right?\n\nMy dad (MD) walks up to the booth, and has the following exchange with the duck man (DM):\n\nMD: \"So my son is sick today and couldn't come to the game.\"\n\nDM: \"Tell me you want a duck.\"\n\nMD: \"No really, this is his ticket. I brought it here.\"\n\nDM: \"Tell me you want a duck.\"\n\nMD: \"I'm telling the truth. I can call my wife and put him on the phone.\"\n\nDM: \"Tell me you want a duck.\"\n\nMD: \"...what?\"\n\nDM: \"Listen. Just tell me you want a duck.\"\n\nMD: \"I want a duck...?\"\n\nDM: \"Here you go! Have a nice day!\"",
        "created_utc": 1432784943,
        "upvote_ratio": ""
    },
    {
        "title": "No, I do not want to be Facebook friends with you...",
        "author": "freudian_nipslip",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37dx76/no_i_do_not_want_to_be_facebook_friends_with_you/",
        "text": "So, I'm a grad student and my current research project is such that my office is situated at the edge of campus. There's not a lot in the way of food around unless you want to pay $6 for a slice of food court pizza (no thanks).\n\nLuckily, a local grocery chain known for its good deli selection is right nearby - like, literally a five minute walk. Over the past couple months, I'd taken to stopping by daily before work to grab a cheap lunch. I always ended up going through the express-lane checkout because I'd only have two or three things, so I got the same worker as my checkout clerk pretty much every time (let's call him Clerk). \n\nNow, Clerk seemed like a pretty normal guy: middle aged, slightly overweight, friendly (kinda irritatingly so some days), liked to chitchat with his customers. Since he saw me almost daily, we introduced ourselves (first names only) and would chat a bit while he bagged my groceries - nothing too personal, things like what I was studying, the fact that his birthday was coming up next week, the weather, whatever.\n\nWell, a couple weeks ago I was buying my lunch and decided to use one of the normal lanes, since I was super tired/grouchy and didn't really want to talk with Clerk. I pretended I hadn't seen him, but he noticed me and called me over to his register. Okay, fair enough, I loaded my groceries onto the belt and tried to make polite small talk.\n\n...except that Clerk immediately told me, \"Hey, I found you on facebook! Your name is Firstname Lastname, right?\" Seeing the WTF expression on my face, he proudly added, \"Yeah, I found you because I remembered your info from your credit card. Anyway, I'm going to add you, but I didn't want to freak you out.\" \n\nWell, let me tell you, that ship had sailed. I stammered something along the lines of how I never use my facebook anyway (lie) and grabbed my stuff to leave. As I was walking out the door, he yelled after me, \"I'M GOING TO ADD YOU ON FACEBOOK, OKAY?!\" \n\nI went home, changed who can find me on facebook (I already have all my info and stuff on a limited basis), and decided to start bringing a lunch from home from now on. I'm sure Clerk meant well and all, but why he thinks that facebook-stalking some random girl 20 years his junior using her information from her credit card wouldn't be creepy is beyond me.\n\n**EDIT: Because apparently there's been some confusion, here's some clarification:**\n\n1. No, I do not think this guy is an axe murderer or anything. That doesn't mean the situation wasn't awkward or creepy. I'd like to be able to purchase my lunch regularly without some random guy old enough to be my dad deciding that he needs to find me on social media using information I didn't consent to him using. See [here](http://www.reddit.com/r/TalesFromTheCustomer/comments/37dx76/no_i_do_not_want_to_be_facebook_friends_with_you/crmj3lv) for more explanation.\n\n2. I know that using my card info the way he did is illegal where I live; however, I'm not interested in getting him into any legal trouble. If he had continued to try to contact me persistently, used my credit card number, or otherwise escalated the situation, that would be different story. \n\n3. People commenting along the lines of \"OMG just confront him, stop being a baby\" may refer to [this](http://www.reddit.com/r/TalesFromTheCustomer/comments/37dx76/no_i_do_not_want_to_be_facebook_friends_with_you/crm5ovj) and [this](http://www.reddit.com/r/TalesFromTheCustomer/comments/37dx76/no_i_do_not_want_to_be_facebook_friends_with_you/crmiyil) comment. tl;dr The guy probably isn't a threat at all, just awkward, but confronting him would stir up enough bad memories and anxiety that it isn't worth it for me.",
        "created_utc": 1432679847,
        "upvote_ratio": ""
    },
    {
        "title": "Brewhouse Horror!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37aijl/brewhouse_horror/",
        "text": "This is an exact quote, with some names changed for privacy of course, of a survey response I just sent to a well known chain restaurant about my experience there this evening. \n\n\"Our second server, AR., was amazing and attentive. Our first server, whose name I don't know as he never introduced himself, was awful. Inattentive, kept walking away while we were trying to order and just plain rude. We arrived and were seated between 7:05 and 7:09 PM. Our server came over and asked us if we wanted waters while we looked over the menu, that took longer than expected to get. Then it took even more time for him to finally come and take our orders, and that's just our drink orders. Then he came back after only taking one of our drink orders to ask about food, each of the last couple times he came back I tried to get my rewards number to him and each time he said he'll be right back and get it then. His version of be right back seemed to range from 10 or so minutes to probably about 15.\n\nI ordered a Jameson and Coke, with 3 rocks. He said we don't have coke we have pepsi is that fine? I said yes that's fine because they're the same thing. He then proceeded to vehemently disagree with me that they were in fact NOT the same thing. I mean really? You're going to debate with a guest about soda? I told him it's not important enough to argue over, to which his reply was snarky and rude. Approximately 10 minutes later he finally brought my drink out, filled with ice/rocks which was NOT what I requested. And when I told him this he was not pleased and proceeded to snarkily ask me \"You wanted a jameson and pepsi with 3 rocks?\" He made sure to emphasize that it was PEPSI not COKE, to which I replied yes and when the new server, Alex, finally brought my drink out, instead of filling the glass with more pepsi in place of ice the glass was about half empty, but now it had the correct amount of rocks in it so I can only assume that the original waiter had told the bar to fill it up only halfway, as I've ordered this drink on several occasions and at several restauraunts and none of them CHEATED me out of my drink like this.\n\nIt got to the point where what should have been a half hour, 45 mintues at most, dinner turned into an over an hour fiasco.\n\nOur food took forever to come, and at least it was warm and correct by the time it did come. \n\nWe asked to speak to the manager on duty, who was a very nice Asian gentleman named K. He changed our server from the original server to AR who was awesome, attentive and super nice!\n\nK comped dessert for us as an apology for this fiasco however we had come in because JB had sent me an ecourtesy card for a previous bad experience at this particular brewhouse, and this is actually not the first time I've had a negative experience here.\n\nI've eaten here many times and most of the time the service is good, not amazing or great, but good. Where good is nothing to complain about and everything was on time or just a few minutes behind(which happens in every business/industry especially the restaurant industry), but this is literally the worst service I've ever had at this or any restaurant ever.\"",
        "created_utc": 1432615590,
        "upvote_ratio": ""
    },
    {
        "title": "Literally chasing down an employee to unlock items",
        "author": "SpiderRider3",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/379o0g/literally_chasing_down_an_employee_to_unlock_items/",
        "text": "A couple months ago I attended a multi-day video production workshop at the art college I will be starting at this fall. The day before the end of the workshop I stopped by a major supermarket to purchase a USB drive so I could bring home the video files from the workshop to keep. Like many stores, they keep electronics locked up to prevent theft, and if you want to buy something an employee will unlock it for you and walk with you to the checkout to make sure you pay for it.\n\nI arrived at the electronics department to overhear an employee telling a customer who wanted to buy a video game that he was also assisting a customer who wanted to buy a TV, and that he would walk with both of them together to the checkout lanes. I approached him and told him I'd also like to buy a USB drive, and asked if he could unlock it for me and I could join them.\n\n**He ignored me**. I thought that perhaps he hadn't heard. I waited around in the electronics department and repeated my request when he returned about 5 minutes later, only for him to ignore me again and walk off. At this point, I wasn't sure if he was ignoring me intentionally or just not paying attention. I couldn't think of any reason why an employee would ignore a customer like this, but I also couldn't think of how someone could twice fail to notice someone next to them talking to them directly.\n\nI'd had enough of waiting, so I decided to follow him. Then I realized he was walking a bit faster, and the fast walk turned into a hustle. I had no idea what was going on, not knowing why the hell an employee would actually run away from a customer. I wanted to find out what his deal was, so I began jogging to keep up. The chase ended at the front of the store. It turned out he was grabbing a peripheral for the customer who bought the TV and was waiting for him at the checkout counter.\n\nAfter he handed the peripheral over, I finally managed to get his attention and told him I wanted to purchase a USB drive. He asked me to give him a minute, and I told him I'd be waiting back in the electronics department. He seemed extremely stressed out, although that didn't exactly make up for ignoring me thrice. A few minutes later, he returned to unlock the drive, handed it to me, and left me with it, not even being bothered to come with me to the checkout area.",
        "created_utc": 1432599961,
        "upvote_ratio": ""
    },
    {
        "title": "More money for us, less for you if you're not quick enough.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/379kcb/more_money_for_us_less_for_you_if_youre_not_quick/",
        "text": "Hello y'all!!\n\nAnother tale from the wonderful customer service that Mexican chains and government licensed buildings provide.\n\nHere in Mexico, sometimes we get some goods provided by the government but not for free. Some are Basketball courts, football (soccer) fields, gyms and county pools. The gyms and pools are not for free and they charge you an enrollment fee, monthly payment and they make you buy their \"uniform\" even if you're not planning on staying for long... Simply because that's what they're required to do in order to gather money. Sometimes the employees charge you extra so they can get a \"bite\" of the chunk since usually salaries are pretty small. \n\nI went to register to swimming classes and I had already calculated the costs for a month, which were going to be $1110 pesos ($72.15 USD, very cheap) including the uniform. I went through the registration things and provided my info and I went to pay.\n\nI greeted the lady and handed her the registration paperwork along with the exact amount of money. Then she tells me:\n\n&gt; Lady: I still need another $400 pesos ($26 USD) \n\n&gt; Me: $400? Sure. \n\nI was about to hand them to her when I remember that I had already calculated how much it was going to be, so I stopped and asked her:\n\n&gt; Me: What are those $400 pesos for?\n\n&gt; Lady: So we can evaluate how well you swim. The woman in the registration's office should've told you that you had to pay for the exam.\n\n&gt; Me: I think she didn't tell me because I don't know how to swim, at all.\n\n&gt; Lady: Ohhhhh I see... Then she's waiving it. OK then, if you say so.\n\nI thanked her, she didn't answer or looked at me after that and that was the end of it. Not too bad but not good either. Gotta be quick here when it comes to government issued activities!\n\n\n",
        "created_utc": 1432598186,
        "upvote_ratio": ""
    },
    {
        "title": "No I won't join your 'loyalty' program.",
        "author": "layzpcofcrap",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/379b2h/no_i_wont_join_your_loyalty_program/",
        "text": "This is less a specific story than a combo of experiences at several places.  I try to be really polite, I know it's policy and people are just doing their jobs, and although it's a bit annoying I can handle places like 'bigdrugstorechain' that ask if I have my card, because if I say no, they drop it right away.  There are a few places though, that are really aggressive about pushing memberships, to the extent that they don't want the sale to proceed.  \n\nOne place, the clerk kept saying \"just give me your phone number, it's really easy\" and wouldn't take no for an answer until I got angry and threatened to leave.  Another insisted on my email and a bunch of other info.  A third generated a card and handed it to me.  Twice I've had to walk out without my stuff because they have such a rigid policy that the person apparently can't override it and make a sale without me being in the system.  I mean, I am standing there with a wad of cash and they don't want it without my personal info.  WTH?  In both cases, I just went somewhere nearby that was happy to take my money and so got what I needed anyway.\n\nWhat corporate persons think this is a good tactic, alienating customers for life and losing sales?  And if you work at one of these stores, you have my sympathy, I can only imagine the heartache.",
        "created_utc": 1432593809,
        "upvote_ratio": ""
    },
    {
        "title": "A site to behold",
        "author": "GrisCasey",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/377nps/a_site_to_behold/",
        "text": "So, I've become a recent addict to reading these awesome stories on reddit.  I've got some great ones, involving underground card rooms which I used to frequent.  Seeing as there is no /talesfromthepokerroom (maybe there should be, some hilarious stuff happens in a card room, and I'm sure there are tons of people with stories) I figured I would submit some stories in here.  Unfortunately, some of the stories are quite dark, as can be imagined involving underground card rooms.  I'll start with a lighthearted one.\n\nWhat is an underground poker room?  Basically just a place where people play cards, but not in a casino.  And yes, the ones I went to were equipped with the camera on the front door and all, so they could verify you before buzzing you in.  And there was always an eclectic lineup of players who would show up.  College students, business owners, professionals, bartenders, retired vets, there was a dentist that would play often, there was even a guy who worked for a local tv news station, and, of course, your seedy drug dealers and criminals. The stakes of the games varied greatly too, but I won't get into that.\n\nAnyway, my first story involves the dealer and a very large man.  Let's call the dealer \"shady kid,\" and the large man \"fat J.\"  Actually the large man went by \"fat *insertname*\" and that was how he was greeted by everyone.  \"what's up fat *insertname\" was not uncommon.  The dealer, was a young kid, about mid 20's, who had been known around the scene for dealing cards at various clubs for some time.  Trustworthy wouldn't be a way of describing this kid.  He could be quiet and evasive, almost as if he was hiding something from you.  And he had a well known problem with opiates (painkillers).\n\nBefore a poker game starts, the cards are fanned out on the table face up.  This is probably so everyone can see all of the cards, and know there aren't any doubles or any cards missing.  And just before the poker game would start, in this case there were only 6 of us starting the game, us players would be chatting, probably walking around in the kitchen area or shooting a game of pool.  Shady kid (SK) was sitting at the dealer chair, and I believe Fat J (FJ) was sitting at one end of the table as well, probably conversing with someone.  Then someone, probably the club owner, said \"OK game is starting\" and we'd all take our seats and exchange our money for chips.\n\nThe very first hand, the cards are dealt, and two people got it all in.  Which isn't common at all.  The hands are tabled, and it's the dreaded AA vs KK (or pleasing if you're on the AA side).  Some middle aged guy had the AA and FJ had the KK.  The aces held, and the pot got pushed over to the middle aged guy.  \n\nFJ immediately exploded at the dealer \"I know you set the fucking deck you piece of shit!\"\n\nSD threw his arms up \"What are you talking about!?\"\n\nFJ \"I noticed you playing with the cards while they were on the table, you set the fucking deck! I'm gonna kick your ass!\"\n\nFJ, who is probably 350 pounds on a good day, then jumped from his seat instantly.  He then proceeded to chase SK around the poker table.  Hahaha, it makes me laugh just thinking about it.  They probably went around the table 2 or three times, before standing on opposite ends yelling at each other.  It was probably a good thing FJ was winded and didn't get his hands on the short, average sized SK. The club owner cooled things off, somehow.  He was also a smart guy, so he probably took money out of his pocket and gave it to FJ to keep the game going, but that I don't remember.  It's not everyday you see a 350 pound man chasing a kid around a poker table.  And how I remember it, all us players didn't try to stop it, we kind of all got up from our seats and watched stunned. \n\nOn a side note, I don't for a second put it past the kid for setting the deck.  And it wouldn't be too difficult for him either.  He probably set the top cards in the deck and when shuffling, made sure not to disturb these cards, which really isn't hard to do.  Actually, later on, word got around that the middle age guy offered SK half of what he won if he could set the deck for him, but who knows.  And what I don't get is, if FJ saw him messing with the deck, why wouldn't he say anything then?\n\nThis is just the tip of the iceberg for the stories I have involving these underground poker clubs.  And as you can imagine, some of the situations get very real and scary.  Let me know if I should share more, and if this even the right place to share them.",
        "created_utc": 1432567963,
        "upvote_ratio": ""
    },
    {
        "title": "Didn't expect that",
        "author": "Catalystic_mind",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/377jdb/didnt_expect_that/",
        "text": "Last year I was working insane retail hours and finally got an evening off. Since my SO was working his retail job and wouldn't be home, I went and grabbed sushi from an upscale grocery store near my house. After having my delicious California roll I watched some tv and went to bed.\n\n4am the next morning I woke up in extreme pain with nausea. 3 horrible hours later (mostly spent on the bathroom floor) I called work to tell them I wasn't coming in and then called my Dr. There was a nasty virus going around at the time and I needed to know how contagious I was.\n\nMy Dr enlightened me that it wasn't a virus, it was nasty food poisoning. He said due to the timing it was probably the last thing I ate. \n\nWell crap it was the sushi from the night before.\n\nAfter another 12-15 hours spent in my bathroom, I finally emerged a limp beaten individual in high need of hydration, but I could relatively function enough to count on not projectile vomiting.\n\nI called the grocery store to let them know what happened.\n\nMe \"Can I speak to a manager?\"\n\nManager \"How can I help you?\"\n\nMe tells him what happened, \"The Dr was sure it was the California roll. But I just wanted to let you guys know in case anyone else got sick.\"\n\nManager \"I am so very sorry that happened. I know you won't be feeling able to do much for the next couple of days, but can I offer to leave you a Giftcard at our customer service for you whenever you next visit?\"\n\nMe who was quite startled \"That's not necessary.\" \n\nManager \"I insist. It'll be here for whenever you come in.\"\n\nWell I didn't leave the house for a couple of days. About four days later I went back and not only had he left me a gift card but a bag of little goodies that the store offered. Not food, but cute little soaps, herb packets, and a few other things. I then explained what happened to the customer service employee and said I hoped I didn't create an inconvenience. She said that they just double checked everything and had the health inspector in to triple check them. No one got in trouble and there were no other cases.\n\nI still shop there and really love the customer experience every time I go. But I stay away from the sushi... Not wanting to tempt fate.\n\n",
        "created_utc": 1432565929,
        "upvote_ratio": ""
    },
    {
        "title": "The first $1 delivery tip I've ever felt obligated to give.",
        "author": "danbag213",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37353j/the_first_1_delivery_tip_ive_ever_felt_obligated/",
        "text": "All other delivery tips have been at least $3, more if I felt they did a really great job or the weather was terrible. \n\nI delivered pizza for a couple years all together and I understand the job. \n\nLast night I was staying at a hotel that I'm a regular at due to my job. I ordered a pizza from a place that I'd ordered from before. They stick us in the back part of the hotel, the walk to the front and back to my room is probably about 1/4 mile. I'm no stranger to exercise, but I also know that entrance J is about 20 feet from my room. In the special instructions area on the online ordering form, I entered \"Enterance J. Text MY-NUMBER.\" I actually entered my number again to make it easier for the driver.\n\nI understand that safety is an issue and took that into consideration. The hotel I stay at is well known and in a good area, it was still very light out, and the area by Enterance J is by the park area of the hotel. I figured I'd be getting a text soon and I'd stroll out with no shoes on to get my 'za. \n\nMy room phone rang. The front desk person tells me that my pizza is there. I ask if it can be brought to J, she says the driver can't due to security issues. \n\nNot being prepared for a journey across the hotel, I suit up for my trek. I wonder why the driver hadn't just bypassed the stupid policy after using their own discretion to discern that this request was non-threatening. I also wonder why I hadn't got a text alerting me that I'd have to pick it up in the front so I could have been there waiting. \n\nAll my questions are answered when I arrive at the front desk. The delivery driver is talking to the desk clerk and never breaks her conversation with the clerk. The clerk broke away quickly to at least greet me and point toward the credit slip that I need to sign. The driver never even turned and looked at me, never said a word to me, and never stopped talking to the clerk. I had no regrets in leaving a $1 tip on a $14 bill. \n\nThe store is less than 5 minutes from the hotel. If she didn't have a phone, she could have called from the store to let me know that she couldn't complete my request, at least I could have been prepared and waiting at the front. That would have earned her a $3 tip. She also could have easily completed my request. That would have earned her a $4 tip. ",
        "created_utc": 1432471785,
        "upvote_ratio": ""
    },
    {
        "title": "You DESERVED to be fired! You have no say in how I spend my money.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/371mus/you_deserved_to_be_fired_you_have_no_say_in_how_i/",
        "text": "So, we have adopted 2 orphan kittens and they're on formula, bottles, and butt wiping. Went to the store to buy a few  more bottles ($1.29 each). There weren't any on the shelf, as it's kitten season, but 2 employees went and searched the back for me. Success! They come back with 2 cases and I took 4 bottles. Got a couple things we needed (food) and headed to checkout. All good, until I try to leave. \n\nThe security guard stormed over, snatched the receipt from my hand and started giving me hell over \"wasting money on frivolous things\" and tried forcing me to justify my purchases to her. She went nuts over the fruit because she doesn't believe in eating healthy. When she saw the kitten bottles, her fury was shocking. Demanded that I **drown the babies in a bucket** and stop wasting money on animals. Livid doesn't begin to describe how furious I was and our argument drew a crowd. Both the store manager and her manager were just as angry and shocked as I was and she was fired on the spot. \n\nI still can't believe her nerve. That could put them on catnip for life!\n\nEdit - http://imgur.com/a/ksShz\n\nDon't worry, the loose lining in the 1 pic was replaced as soon as we got home. The new lining is much better and safer.",
        "created_utc": 1432428523,
        "upvote_ratio": ""
    },
    {
        "title": "One year and my tshirt never came",
        "author": "mvpetri",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/37166n/one_year_and_my_tshirt_never_came/",
        "text": "Last year (may 21th) I saw this company that were creating an new kind of tshirt, super hydrophobic. They were a start up collecting money in these crowdsourcing sites. I bought one t-shirt right after they met their goals and started the preorder.\n\nYet they had problems with the delivery company, so my t-shirt was delayed.\n\nMonths later, when they finally sent out the t-shirt I received a tracking number. But my ZIP code were wrong. I don't live in US (the company is in US, I'm from another country), so this mistake was enough to the shirt to be returned. I spotted this mistake and at the same day that they had sent me the tracking number I sent a message correcting the mistake. They didn't answer me.\n\nSo, as expected, the shirt came to my country but it failed to deliver. It was sent back to them.\n\nI wrote another email reporting again the problem, including screeshots and the days of everything I had registered in my email. They answered saying they were sorry and they would send me as soon as possible.\n\nThis was probably two months ago. Now they don't even answer my emails.\n\nI don't know what to do, actually. I paid a lot for this tshirt, and since I live in Brazil I don't know how to do justice for my purchase. ",
        "created_utc": 1432419302,
        "upvote_ratio": ""
    },
    {
        "title": "Just because you paid for the room doesn't mean you will get one.",
        "author": "noturmomma",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/370oj4/just_because_you_paid_for_the_room_doesnt_mean/",
        "text": "I just had an issue with a hotel. I read the reviews and it was supposed to be awesome. Had a pool etc. So I made reservations and packed up the kids for a fun 4 day weekend. We were arriving late Thursday so I called at 5pm to let them know we would have a late check in. I was assured that it would be fine because I had prepaid with my credit card. \n\nI arrived at midnight with two very tired small children in tow. When we walked up to check in I heard the front desk guy say \"Oh shit!\" He then informed me that because I was late he had already canceled my reservations. I was livid as I had already prepaid and called. He then told me to wait a minute. Came back with a key card and sent me to my suite.\n\nIt was on the second floor so I dragged my kids up. We walk in and the lights in the front room are out. I manage to fumble in the dark to the kitchen and turn on the lights. I notice everything looks a little threadbare. Whatever I'm tired I'll deal with it in the morning. I head upstairs to put the kids to bed to find a toilet sitting in the hallway and a padlock on the bathroom door. There are boxes in the closet and a tv covered in plastic in the corner. Not wanting my kids to fall down the steep stairs that had no railing or peeing in the wrong toilet I put them to bed in my bed and I slept on the couch. I put the do not disturb sign up so we could sleep in and at 830 housekeeping pounded on my door for so long I was able to get dressed and answer to tell them to go away. \n\nI went to talk to the manager. One of the employees was in the office screaming. I waited patiently and she came out and I explained the situation. She told me that the room they put me in is the emergency room and was more worried that I might have used the upstairs room than the fact that I had to sleep on the couch. She then informed me that because they had accidentally canceled my reservation they didn't have a room for the rest of my visit. But don't worry she was not going to charge me for last night and would refund the rest of my stay. So I am now back home. Because it will take up to 5 to 7 business days for my refund.",
        "created_utc": 1432410210,
        "upvote_ratio": ""
    },
    {
        "title": "She really helped my Christmas (First post, happy story)",
        "author": "SnowCone4673",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36ygt3/she_really_helped_my_christmas_first_post_happy/",
        "text": "Background: Last year around the middle of December I was really struggling for money to buy people gifts. I knew my boyfriend was spending a lot on me so I wanted to return the favor. I didn't have a job at the time so I got most of my money from selling my own stuff. Besides spending money of gifts, I had other obligations like my pets, gas, schooling, and so on.  \n\nStory: One particular night I had planned to meet someone from craigslist outside of my regular pet store, intending to sell them my Nintendo DS. I picked the pet store because it was well lit at night and had a lot of traffic, but mostly I had run completely out of pet food and was going to take the money from the sale right into the store. I really had no other choice; I was out of food. I stood outside the pet store for probably an hour waiting, in the cold and dark, hoping the person would show up like they said (they didn't). The lady that worked inside saw and watched me the whole time. After a while she called to me from inside, asking why I was there. When I explained that I had been waiting for a craigslist person to show up so I could get money for pet food she offered to buy me the pet food I needed to get me through the season. I've seen this woman work at this pet store for like 17 years, but I doubt she knows who I am, and here she is spending her money on me. I was able to repay her by baking her some cookies a few weeks later. Still not sure if she knows who I am, but I won't be forgetting her name any time soon.",
        "created_utc": 1432355432,
        "upvote_ratio": ""
    },
    {
        "title": "The Day I Became That Customer",
        "author": "JetDog30",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36x7t3/the_day_i_became_that_customer/",
        "text": "So my work is about 80mi from where I live, and I stop for coffee every morning. On my way in, the traffic was a little lighter than usual, most likely due to the heavy rainfall the night before and the fact that the collage that I work at, just had graduating ceremonies the week before.\n As a pull into the gas station I see a spot by the main entrance. \n\n\n&gt;Lucky day!! \n\nPark the car, grab the mug and keys, lock the door, shut it and pull the handle just to make sure, and walk to the entrance.. \n\n\n&gt;What the... these doors should be opening. \n\nSo I press my face to the glass and have to cup my hand over my face, cuz its dark in there. \n\n\n&gt;Why are the lights off? This is suppose to be open, I need my coffee. \n\nThen it sank in, the power must be out. Defeated I turned around to get in my car and see that there is not a single car in the parking lot. Not. One. Slinking back into my car and heading back to the highway, I notice the row of orange cones that were blocking the entrance.\n",
        "created_utc": 1432330326,
        "upvote_ratio": ""
    },
    {
        "title": "An all-you-can-eat shrimp adventure at a restaurant with the kids",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36ws3p/an_allyoucaneat_shrimp_adventure_at_a_restaurant/",
        "text": "The wife is working late and I ask the kids if they want to eat out at a non-franchise restaurant who's having an all you can eat shrimp special.\n\nMy kids have loved eating out from the time they were in (literally, as in literal) diapers.\n\nIt's not that I can't cook, but the kids love going out with daddy so off we go.\n\nWe get the shrimp.  It's deep-fried with an incredibly thick coat of greasy yuck.  My kids love me because I do things that they think are a bit naughty.\n\nI tell the kids the coating is all grease and it'll fill you up so peel off that crap and you'll be able to eat lots more shrimp (the kids love seafood).  They ain't stupid so they want in on the action.\n\nWaitress comes by and we say we'd like another round.  She shoots me a look at the greasy carcasses and takes the plate away.  We get another platter and 2 minutes later we finished it off.\n\nWaitress comes back again and this time disappears for awhile.  I finally get her attention and ask her when the shrimp will be ready.  She manufactures a rule *\"You can only have one platter every 10 minutes\"*.  Where did it say that on the advertisement?  We get another platter.\n\nThe kids love the conspiracy and deep intrigue so they're giggling.  After finishing off that platter, the waitress invents that they're momentarily out of shrimp.  Did I mention that this was a seafood joint?\n\nThe waitress is taking this all very, very personally.  We're such horrible customers because we don't want to eat the greasy shit.\n\nSince we're not in a hurry and mom is still not home, we wait.  Get and finish another platter.  Wait awhile for another platter.  Finally, the kids are stuffed and probably ate more than they normally would have because of the adventure.  \n\n***\n\ntl;dr:  All you can eat shrimp special.  We remove the greasy coating and order tons of shrimp.  Waitress takes it personally.\n\n***\n\nEdit:  Seems like some redditors are/were waitstaff and take this post personally too.\n",
        "created_utc": 1432323243,
        "upvote_ratio": ""
    },
    {
        "title": "How are you today?",
        "author": "awhq",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36vv0x/how_are_you_today/",
        "text": "I recently moved to the south. I'm originally from the south, but after living in a large city in the north for 30 years, I had to relearn how to be a southerner.  Especially waving at everyone you pass, saying hello to everyone and slowing way the heck down as I go through my day.\n\nYesterday I went grocery shopping at my regular store.  The cashiers tend to be very, very slow, but everyone is friendly so I put on my zen hat and work on being chill.\n\nAs the cashier is scanning my groceries, the bagger asks me \"How are you today, ma'am?\".\n\nMe: I'm fine, how about you?\nBagger: I'm fine.\n\nA minute goes by.\n\nBagger: How are you today?\nMe: I'm fine.\n\nA couple of minutes go by.\n\nBagger: How are you today, ma'am?\nMe (smiling): I'm fine, thanks.\n\nWe are almost at the end of the transaction at this point.\n\nBagger: How are you doing today?\nMe: I'm fine.\nBagger: I can help you out with these groceries if you like.\nMe: No, thanks, I've got it.\n\nAs he finishes bagging my groceries, he stands in front of my cart ready to wheel it out to the parking lot.  I nudge in front of him, take my cart, wish the checker and bagger a good day and leave.\n\nBut really, I'm fine.\n\n",
        "created_utc": 1432307405,
        "upvote_ratio": ""
    },
    {
        "title": "\"Sorry, we were wrong about the shipping cost. You owe us $30 more.\"",
        "author": "AndHankMardukas",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36td51/sorry_we_were_wrong_about_the_shipping_cost_you/",
        "text": "I've never encountered this before: I just bought brake pads and rotors for my truck from a major online auto parts retailer. The total cost was ~$175, including shipping. About an hour after I completed the purchase and received a confirmation email from the site, I received the following message: \n&gt; \"Order Number: ########\nHello AndHankMardukas, Thank you for choosing XXXXXXX.com. We received your order and we have some questions or need more information before we can proceed. The estimated freight of $18.44 isn't enough for the 60lbs making the actual cost $45.55. We will need your approval for the new amount. If not, we can take thE rotors off your order and send you just the factory pads? Please call our Parts Department at (###)###-#### extension #### at your earliest convenience or reply to this email with the necessary information. Thank you \n\nMy mind is blown. I really don't know what to do. Their prices are very reasonable, and even with the increased shipping costs it's still cheaper than going to a local dealer, but I'm inclined to tell them to cancel the whole order on principle. I don't doubt that shipping two giant hunks of metal does cost more than $18, but it seems like that's a problem in their system that needs to be fixed, and it's not my fault they undercharged me. In effect, it's a misrepresentation of the cost. I really am torn about what to do. ",
        "created_utc": 1432250932,
        "upvote_ratio": ""
    },
    {
        "title": "\"No, Just Go Grab It\"",
        "author": "undead_heart",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36qztx/no_just_go_grab_it/",
        "text": "This just happened this morning with my SO. Little background info:\n\nWe went food shopping at the grocery store around the corner from our house. I had picked out several vegetables to bring home, paid for it, and SO and I headed back home. Dropped the stuff off, and drove to another store to grab a few other things. \n\nWhen we got back I was about to dig into some of my newly bought vegetables until I noticed they were missing. I had thought SO had put them away, but he hadn't. Cue us searching around for about half an hour. \n\nSO: -sighs- I guess I'll go ask if a bag was found. \n\nMe: Sorry hon. \n\nSO: It's okay. If they don't turn up, I'll buy you some more today after I get off work.\n\nHe did go back to the grocery store to check if the vegetables had been left behind. He told me that as soon as he walked in and told the girl up front what had happened, she just smiled at him and said, \n\n\"Go ahead and grab it! I'll bag you when you come back up front.\" Note, my SO and I had lost the receipt. He asked her if she was sure and if she needed to check anything. \n\nLady: -all smiles- \"You paid for it! Go ahead and grab it.\" So off my SO goes to get the vegetables we had left behind. \n\nWhen he came back up the lady bagged everything for him nicely, and according to him was very friendly. My SO asked her if he needed to sign anything for coming to retrieve the vegetables we had paid for last night. She gave him basically the same response about how he had paid for them, and he should get what he paid for. He thanked her, and came home to tell me the story. \n\nI don't know if the store implemented a new policy or what. My SO grabbed only the vegetables we had left behind, and told me no employee followed him/asked him questions about what had happened. I just felt what that lady did was incredibly kind. ",
        "created_utc": 1432212891,
        "upvote_ratio": ""
    },
    {
        "title": "T-Mobile Customer Service Surprise",
        "author": "phazey",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36nl81/tmobile_customer_service_surprise/",
        "text": "",
        "created_utc": 1432145706,
        "upvote_ratio": ""
    },
    {
        "title": "Old Books are Stolen Books",
        "author": "undead_heart",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36gdkg/old_books_are_stolen_books/",
        "text": "I decided to post this because why the heck not. I used to work retail, so I know how it goes.\n\nSo, one night me and my boyfriend decided we needed to run errands. I want to note here he and I both work at night. So when we go to the grocery store it's when no one is around. There is maybe 10 people in total (not counting employees) that are inside the store. \n\nI like shopping this way because 1) We get everything we need. 2) No crowds. 3) We get in and we get out. \n\nAnyway, I have this habit of taking a book with me everywhere I go. I buy used books, and this day I had a book that had seen better days. Most of the time I remember to leave my book in the car if going into a store. Sometimes I'll accidentally bring it with me though, but no big deal. \n\nNow, this book was dog eared. The cover was bent (I had smoothed it back out) had some tape on it from past fixes, the corners of the cover were starting to come apart, etc. This thing was well read, loved, and used. \n\nAs my SO and I are walking in I take my book with me without thinking. We're in the produce section, and I want to note there were two Employees a few yards from the front entrance. They were chatting or what not, but I didn't care. There was no one around anyway, so I thought whatever. \n\nI realized at the last minute I had my book with me. I let my SO know, and he mentioned I should probably go put it back in the car. Now, I want to mention the store we were at only sold new books. And they weren't selling the book I had anyway. (It was a Wolverine Novel.)\n\nAs I'm leaving to go put the book back the two employees are still chatting. One of them sees me, and turns to give me this nasty look while saying out loud:\n\n\"Ma'am, you CANNOT go into the parking lot with the book!\" I just stopped and stared at her. Remember, they are several yards away. I expected her to come over and talk to me. (I don't know, be human and ask me if I'm stealing my OWN book? That I brought in with me?)\n\nThe other employee goes silent and now both are staring at me. Granted, I probably should have gone over to show them. But I figured if a person is brave enough to shout at me from several yards away they would probably want to elaborate on their accusation, or come over to see what I have in my arm?\n\nNope. Nothing. Both women just continuing to stare at me like I just stepped out of a time portal. So I shrug and head on outside. I toss my book into the passenger seat and walk back. When I come back in both women glare at me as I head over to the produce section. \n\nOh, and we didn't leave their line of sight for the first fifteen minutes my SO and I were in the store. There is no book section near the produce (it's all the way in the back), and my book was in plain sight the entire time. \n\nI mean, I wouldn't even been offended if they had just come up and ASKED. Who knows, maybe the fact I wearing a batman hoodie that day made me terrifying. Oh, and the whopping 5'3 height I have and glasses. \n\ntdlr: Apparently I stole my own book I walked in with, and had to go put back in the car. ",
        "created_utc": 1432009778,
        "upvote_ratio": ""
    },
    {
        "title": "I'm so gross that she had to throw the whole tray away.",
        "author": "kokomocat",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36f0rb/im_so_gross_that_she_had_to_throw_the_whole_tray/",
        "text": "Hello y'all! \n\nThis happened today at a big chain grocery store in Mexico (where I am from); where apparently I was found gross.\n\nMom and I were buying groceries and supplies for the whole week at *Grocery Store* where they have a small bakery inside where they sell all sorts of pastries, buns and baguettes. They sell tortillas too and [fried tortillas](http://i.imgur.com/8Jm2Ji0.jpg) cut in strips for tortilla soup; sometimes nachos too. When they sell these, they usually put them by the counter so the client can take a taste of them. \n\nMom and I picked some pastries and buns for dinner later on and went to the counter, where a lady will put all of the bread in a paper bag and a label that has the price depending on what we picked. We greeted the woman and she had a tray with the tortilla strips so I tried a couple while she was bagging the bread.\n\nShe saw me take a couple and she stopped bagging the bread, snatched the tray away and threw all of the tortilla strips in a trashcan and then threw the tray back onto the counter and resumed bagging the bread. \n\nMy mom looked at me and then said to her \"You'd rather throw them away than to have clients taste them?\" She turned all sorts of red and came up with an excuse that she didn't know who put them there because they don't allow them to have free samples (bullshit, there are always free samples at this chain.) It wasn't so much the action but her demeanor; apparently I'm just so dirty that she had to throw a whole full tray away because I picked two... Or at least that's how I felt. \n\n*Edit*: I'd like to clarify a couple of points.\n\n* I wasn't gross but her demeanor made me feel like that because fuck social anxiety.\n\n* The tray was fresh on the counter for customers to take. Here in Mexico (or in the part of Mexico where I am) people don't tend to give you samples, you just go ahead and take them.\n\n* Customer service isn't a priority here. People can get away with being rude and nothing happens because nobody cares.\n\n* I took just two tortilla strips, which were small. The tray was at least 9\" x 13\" (cookie sheet) and it was filled to the top with strips. \n\n* The strips for sale are put in cellophane bags with a white label, [like so](http://i.imgur.com/15INJKT.jpg)",
        "created_utc": 1431985565,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure you bought that from this store?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/369dxy/are_you_sure_you_bought_that_from_this_store/",
        "text": "A couple of days ago I bought some clothing from a giant (mostly clothing) chain store in the USA.  The store is in walking distance so I go there fairly often.\n\nI want to buy some more items since they're on a sale, I have a 30% off coupon and my wife absolutely loves them (they're for her).\n\nI go to the store armed with a photograph of the item, my receipt and the UPC on the label.\n\nI ask the clerks at the check-out lines where I can find the item.  The clerks are perplexed and have no idea where the item could possibly be.  Eventually one clerk reluctantly offers to help me.  It's around dinner time so the store is virtually deserted.\n\nShe meanders around and I point out that I bought the item is somewhere in the area where we're currently standing.  The racks are so densely packed that it's very difficult to find an item unless you either know precisely where it is or stumble upon it (which is how I originally found the item).\n\nShe can't see the item but she's not actually looking. Her eyes are wandering around.\n\nClerk:  *Are you sure you bought the item here?*\n\nMe:  Yes, I live across the street and bought it here.\n\nClerk:  I don't think we carry those.\n\nMe:  I just bought them 2 days ago.  Here's my receipt.  She doesn't want to look at the receipt.\n\nClerk:  *Are you sure you bought them at this store?*\n\nMe:  Yes, I was here just recently and here's the receipt.  She doesn't look at the store address on the receipt.\n\nClerk:  I think we're out of stock.\n\nMe:  There were a bunch of them just recently.\n\nClerk:  I've been working here for quite awhile and I've never seen them here.\n\nMe:  I just bought them here.  Just a few yards from where we're currently standing.\n\nClerk:  *Are you sure you bought them in this store?*\n\nMe:  Look,  I told you I bought them in this store.\n\nClerk:  You don't need to get so rude.\n\nMe:  I've told you 3 times that I bought them in this store and I've got the receipt. \n Why don't you find someone who can help me out?\n\nClerk:  You don't need to be so rude.\n\n[I should point out that I'm really a very patient person and I'm not in a hurry and I know that clerks make pitiful low wages and it's a shitty job so I cut clerks a lot of slack, unless they get nasty which fortunately happens very rarely]\n\nMe:  I want to buy more and I know that I bought them here.\n\n.... clerk momentarily disappears...\n\nClerk:  Oh, here they are! (a few feet away from where we were standing the entire time)\n\nMe:  Thank you. \n\nI buy a few more and leave.  Wife is happy.\n\n\n",
        "created_utc": 1431869450,
        "upvote_ratio": ""
    },
    {
        "title": "How do you not know how coupons work?",
        "author": "nancynaturally",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/367fpe/how_do_you_not_know_how_coupons_work/",
        "text": "A few days ago, I stopped at a big chain grocery store (not the biggest) to grab cigarettes and also get some cash back. I received some coupons from American Spirit for a pack for $2. I have been using these type of coupons for years now, as Camel also sends them to me. \n\nI go inside and head to self checkout because the service desk and all checkout lines are full. The girl working self checkout (SCG) is up front, so I go straight to her and say that I need two packs of the dark green American Spirits then head to a checkout. She comes back with one pack. \n\n\n&gt;ME: I need two packs.\n\n&gt;SCG: (with a snarky attitude) That would have been nice to know. \n\n\nUm, okay. \n\nShe gets the other pack and I hand her my coupon. She scans it, then starts to walk away. I stop her when I see that the total says $4.something. This is a common mistake with these types of coupons, and I've been dealing with the cashier confusion for years.\n\n\n&gt;ME: The coupon is for a pack for $2.00, not $2.00 off. \n\n&gt;SGC: Do you see this asterisk? (points to asterisk at the end of \"Pack for $2\", then flips coupon over and points to retailer instructions) It says \"Subtract the amount of the face value of gift certificate from cost of cigarettes.\"\n\n&gt;ME: The asterisk is referring to the other asterisk at the bottom of the coupon that says to apply tax. And if you read the rest of the retailer instructions it says \"Write this amount in the box to be reimbursed.\"\n\n\nShe is not having it. She is arguing with me and talking down to me. At one point, she snatches the coupon from my hand. \n\n\nI was shaking with anger when I demanded to speak with someone smarter than her. I hunt down a manager (she won't page one) and explain everything to him. He sees that she was wrong, rings me up, and I leave. On the way home, I call the store and ask to speak to the store manager. I did not say why I was calling. The girl on the phone is being rude and short with me, when I realized it was the same girl with whom I had just dealt! I was connected with the store manager, and I explained everything to him. He seemed very sympathetic and told me that he would look into it and deal with her appropriately. \n\n\nI have never been talked to or treated in such a rude manner by an employee of a retail establishment before. I work in the restaurant industry, so I always treat my fellow service workers with respect. It was just so unprovoked. ",
        "created_utc": 1431814139,
        "upvote_ratio": ""
    },
    {
        "title": "I guess the gloves are just for show.",
        "author": "RadiumBlue",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/366znw/i_guess_the_gloves_are_just_for_show/",
        "text": "This happened a few days ago when I tried to take my mother to a local gourmet/artisan donut shop in town near my college. This particular donut shop gets rave reviews for the food quality and the atmosphere, but after this experience I'm not quite sure where that came from.\n\nWe go in at maybe around 3:00PM-ish, and there's no one else in the shop and a single bored looking employee behind the counter. We say hello and ask him to give us a second while my mother hems and haws over all of the strange donut flavors. We decide on a couple donuts and ask to be rung up, and the employee takes the money with his gloves on and then takes the donuts with the same gloves and puts them in the bag and hands them to us. \n\nThis doesn't bother me particularly, but I think it's a little bit gross. My mother, however, has obsessive compulsive disorder and is really, really concerned with cleanliness and she can't help it, but she doesn't say anything originally because she doesn't want to be rude. We sit down to eat our donuts, but then see the employee sit down and use his phone with the same gloves he just handled our money and food with. Another customer comes in, and he takes their money and gets their food with the same gloves he used to touch his phone and get all of our food/money. Then he went and used the bathroom and came out with the same pair of gloves. \n\nThe multiple counts of health-code violation is a bit too much for my mother to bear and she can't eat her donuts anymore. She still wants one, though, and goes up to the counter to ask for a new one and ask the man to change his gloves before he touches the food. This conversation ensues (M for mother, E for employee):\n\nM: \"...E-e-excuse me, I couldn't help but notice that you haven't changed your gloves between touching the food and touching the money,your phone, and the bathroom. I know it's a bother, bu-\"\n\nE: (Barely looking up from his phone) \"My shift is over, it's fine.\"\n\nM: \"But I just watched you serve that customer one second ago and no one else is here, it's a health code violation to not change gloves and...\"\n\nE: \"Whatever, sorry. What exactly do you want me to do about it, *lady*?\"  \n\nM: \"I...I was hoping you could change your gloves.\"\n\nHe pauses for a second, then says: \n\nE: \"Yeah, this conversation is now *over*.\"\n\nAnd walked into the back room and left. Seriously, are we in a donut shop or middle school?\n\nWe stood around for a few minutes, then just left. It probably would have taken him about two and a half seconds to get a new pair of gloves and not give my poor mother a panic attack. I know customers in retail can be annoying, but what exactly does he think food service gloves are for? I think \"Don't use the bathroom with the same gloves you touch the food with\" was like, day one of ServSafe. &amp;#3232;_&amp;#3232;\n\nWe left a bad review on yelp, at least. \n\n",
        "created_utc": 1431805310,
        "upvote_ratio": ""
    },
    {
        "title": "Really?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/36437l/really/",
        "text": "I am sitting at a popular chain restaurant right now trying to avoid the rain. When it occur to me that I could be using this time to study for my exams. Therefore, I purchase some food (I feel guilty mooching free wifi off places without buying something) and I settle into my corner. \n\nIt is fairly noisy but that's alright with me, since I need white noise to help me concentrate. \n\nSuddenly, I hear a loud manly yelled and all heads in the restaurant turn toward the source. The yell was immediately accompanied with high shrieking high school girly yells. *Okay...back to work*\n\nUsing a combination of studying and procrastinating on reddit, I continue doing my own thing. \n\nA few minutes later, the group started packing up and from my peripheral, I see a finger coming towards my laptop screen. \n\n\nRude boy: *is this a good website?*\nMe: *Yes*\nRude boy's friends: *do you like anal?*\n**Girls that were with them started laughing hysterically**\n\n\nThey left before I could ask why they thought that it was appropriate to ask a stranger that.\n\n ",
        "created_utc": 1431731609,
        "upvote_ratio": ""
    },
    {
        "title": "Why would anyone do that?",
        "author": "Anonymouse79",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/3637ae/why_would_anyone_do_that/",
        "text": "Arriving home from work late one evening, I found my poor, beat up old car listing over to one side in its parking space. The severe angle of tilt being caused by two very, very flat tires. This was clearly no accident. I cursed the stupid, bored hoodlums who had ruined my night (and the nights of a few other poor souls around the neighborhood as well), called a tow-truck, got things sorted, and went to bed.\n\nWe were able to drive our newer, shinier car for around a day before the low-pressure indicator came on for the front right tire. Off to the dealer we went, to get it checked out.\n\nEnter the fresh-faced technician who comes out after inspecting said tire, with an utterly befuddled look on his face.\n\n\"The tire's toast,\" he says, then pauses for a moment, with a clearly befuddled look on his face. \"It's weird, though\" he says, almost as much to his boss as to us, \"It's almost like they ran over a nail, but with the side of the tire\"\n\nHis boss looks at him funny. \"Like someone poked the tire with something sharp like an ice pick or something?\" she asks him.\n\nHis eyes get wide. \"Yes! Exactly. . . But why would anyone do that?\"\n\nIndeed young fellow, why *would* anyone do that?\n\n",
        "created_utc": 1431715413,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes salespeople suck... (Disclaimer: I am one!)",
        "author": "DPNovitzky",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/3606k9/sometimes_salespeople_suck_disclaimer_i_am_one/",
        "text": "I work in automotive sales at a Local Mazda Store. I like to think that I am good at my job, and I do not prejudge ANYONE based on race, gender, creed, style of dress, hygiene, anything. But I may be in a minority there, as I am about to detail.\n\n***\n\nIt was 2010, and I was in the market for a new car. I had seen a Ford Mustang GT, Race Red convertible with a manual transmission at a Mercedes/Porsche/Audi dealership near me, and I went over it with my dad. He was cosigning the loan and I knew what I wanted. So I took a trip over on a day off, eager to drive it and put a deposit so I could get out of the squeaky, rattling trashheap of a Mercury Sable. I drove onto the lot, my car creaking and groaning over every little bump in the pavement and i pulled into the parking space next to a beautiful Jaguar. I had it in my head that this would be the last time I would be embarrassed by my car.\n\nI had saved about $10,000 towards a down payment on that Mustang GT convertible. The car was on a ramp, and I fully intended on test driving the vehicle to make double sure. The car itself was $24,800, and my dad wanted to be there too, but needed to work that day so he sent me to the dealer alone to check it out. Now, I already was in the business of auto sales, but he had to be there anyway as a co. Whatever\n\nI wore shorts, a hawaiian shirt and sandals. \n\nI took a short little walk over the the Mustang, which was on the front line and I started looking over the car, at least what I could see from my angle. During that time, I figured someone would be out soon, and maybe they were shorthanded that day. No big deal, it happens.\n\n40 minutes passed.\n\nNot ONE salesperson came out to say hello, and I stared at the car, examining it in every angle to make sure. Finally, I went inside, and asked for a salesperson, and this older salesguy came over, an annoyed plastered look on his face. I told him that I wanted to test the Mustang, that I was ready to put a down payment on it right then and there if it was the right car. Did I mention I had the $10k in cash on me?\n\nHis response was quite less than stellar.\n\n&gt;Douche McSalesman: \"Kid, lets be realistic here. You don't have the money to even LOOK at a car like that, let alone the credit. Come back when you're older.\"\n\nIt may be worth mentioning that I made about $35,000 a year at my dealership, and credit was hovering around 680. And my dad was cosigning. I told the salesdude that, and he essentially shoo'ed me out the door. So I cleared my throat and loudly asked to speak with a manager, who came over right away and asked what was wrong.\n\n&gt;Me: Well, your salesperson here basically told me that there was no way that I could afford the Mustang out front, and that I should come back when I'm older. I'm 25 years old, and my dad is cosigning with me on my first major car purchase. I have about $10,000 to put down, but I wanted to drive the car first. By the way, I have the $10k on me now. (I even showed it to him, seeing as how he looked at me with that 'yeah, right' look)\n\nHis face lit up, and he called the salesperson over. I cut him off.\n\n&gt;Me: HOWEVER, after being treated that rudely, I suppose that I will have to wait. I do want a Mustang, but not that one.\n\nI turned around, got back in my POS Mercury Sable and squeaked and rattled off the lot. Not four years later, I put $1,500 down and got a 2012 Mustang that I love.",
        "created_utc": 1431647801,
        "upvote_ratio": ""
    },
    {
        "title": "What's in your pocket?",
        "author": "OnyiMinx",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/3604mn/whats_in_your_pocket/",
        "text": "Ok so major lurker here and on mobile so please forgive my formatting.\n\n\nMy husband and I are renovating an old trailer, we are young newly weds , so we were looking for cheap necessities.\n\n\nWe go to Dollar General, walk through the aisles because there wasn't anything exactly we needed we were just walking around in case we found something.\n\n\nWe didn't find anything so we leave. We are almost at our car when an employee runs out, yells at us from the store front.\n\n\n(E - employees H- Husband)\n\nE:Excuse me but what do you have in your pocket?\n\nH is pulling out item by item as he speaks\nH:Wallet, wallet and cell phone.\n\nE: Oh ok\n\n\nEmployee turns around goes back inside.\nA random woman in the parking lot screamed for us to call and complain but eh.\n\n\nI realize its not very exciting but I wanted to contribute to this subreddit.",
        "created_utc": 1431646771,
        "upvote_ratio": ""
    },
    {
        "title": "\"He died.\"",
        "author": "what_the_foxx",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35zmib/he_died/",
        "text": "I got a call today on my cell phone which I've gotten many times before. There's typically a different number on caller ID each time - today's had the first 6 digits in common with my number - but the message is always (exactly?) the same. I should probably have it memorized, as I've heard it so many times by now, but I also try to block it out. It basically just says that I'm eligible for a lower interest rate for my credit card, and that it's the last call I'll ever get about it. It gives the options to press one number to talk to a person, or another number to not receive calls from them.\n\nI've tried pressing the number-of-the-day to stop calls, and I've pressed the number to speak with a person before. Sometimes I get hung up on, if I just say \"I'd like to be put on your do not call list\", and one time I spoke with a person and explained why I'm not interested, and they were understanding and said they'd remove me.\n\nToday I tried talking with a person again. I asked, if it's my absolute last chance each time, why do I keep getting the same call? And why do they keep calling me when I've been asked to be put on their DNC list?\n\nThe person was amiable enough. He said it was showing as my first call, which I said was not true. He tried to explain why I was a good candidate for their program, which I then pointed out was exactly why I don't need it.\n\nThen he asked something new - \"What about your husband?\"\n\nHaving never been married, finding this a very odd and awkward question, and having been caught off guard, I just said, \"I don't have one.\"\n\nI forget if his response was, \"You're not married?\" or \"Oh you're single?\", but at that point I decided to try to out-awkward him. I am not quick on my feet, so I said the first horrible thing that came to mind. \"He died. I'm gonna go now, bye.\" And hung up on him.\n\nNow I'm sitting here wondering how horrible of a person I am, and what other wittier things I could have responded with.",
        "created_utc": 1431637840,
        "upvote_ratio": ""
    },
    {
        "title": "Witness to Destruction",
        "author": "kaivalya_pada",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35zk1b/witness_to_destruction/",
        "text": "Last night, I went for a cup of coffee to this known coffee chain, that is located inside a general store. \n\nI ordered the drinks for my mom and I, and I bought some souvenirs. While I was waiting for the barista to do her job, I noticed this guy with his kids in the coffee area. He wasn't eating anything from the coffee shop, he had some popcorn and pizza from the store. \n\nThe kids were just running around, spilling popcorn everywhere, while the dad was just sitting there, eating his pizza and making more mess. I felt sorry for the employee. I asked the guy to control his kids (since they were Hispanic and I am too), but he just ignored me. \n\n\nAfter they left, the small coffee shop was a pigsty. I was really upset. I left a tip to the poor girl. \n\nUgh, no offense, but I don't know why parents don't control their kids.  \n\nSorry for any grammar mistakes, English is not my first language.\n\nThanks.",
        "created_utc": 1431636738,
        "upvote_ratio": ""
    },
    {
        "title": "Have an issue with an online order with this major hardware store? I hope you have better luck than I did.",
        "author": "jpeepz83",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35py4n/have_an_issue_with_an_online_order_with_this/",
        "text": "#####For reference, this is not the orange big box retailer, but the other retailer that rhymes with Rowes (did I make that too obvious?)\n\nTo begin, I made a single order online for several items.  \n\n1. 3 of the items were carried by my local store, which I picked up in store.\n- 1 item was shipped to my home by the distributor.  \n- 1 item was shipped to my home by a different store that is not local to me.\n\nThis story focuses on the last item.\n\n####The item in question arrived damaged.  I filled out the return form, checked that I wanted to exchange the item for a non damaged item, sealed up the box, and dropped it off at a nearby UPS that same day.  A few days later, I receive an e-mail stating that a refund was being processed for the item that I sent back.  Seeing as how I wanted an exchange and the item was still in stock on their website, I thought it was odd that I received a refund e-mail so I gave the online order customer care a call.\n\n*Ring ring*\n\n**Me**: Hello.  I received an e-mail stating that a refund was being processed for an item that I wanted to exchange, but I wanted to check with you to verify that a refund was being processed or if that e-mail just served as a confirmation of receipt of the returned item.\n\n**CSR**: Sure.  Can I have the order number please?\n\n*I give her the order number that was shown on the refund e-mail.*\n\n**CSR**: I can't seem to find anything in our system referencing that order number.\n\n*I spend the next ten minutes trying to get her to find the order in the system.*\n\n**CSR**: I found your store, but it looks like these items were picked up?\n\n**Me**: Yes, that is my local store and my order had a store pick up for several of the items, but the item in question was shipped from a different store.\n\n*Spends the next few minutes trying to find the item I'm talking about.*\n\n**CSR**: Ok.  Let me give the store a call and I'll have them call you to try to help.\n\n**Me**: Uh, ok?\n\n####I receive a call from someone at my local store and they proceed to tell me that it was an online order and since the item did not come from their store, I should be talking to the CSR for online orders.  I told them I did that and he concurs that what they did was wrong.  He said that he would try to find out more information and give me a call back.  I did not receive a call back.  The next day, I call the online order customer care again and here's how that conversation went:\n\n**Me**: Hello.  I received an e-mail stating that a refund was being processed, but I wanted to check with you to verify that a refund was being processed since I wanted an exchange instead of a refund.\n\n**CSR**: Ok.  Let me check that for you.  Can I have the order number please?\n\n*I give her the order number.*\n\n**CSR**: Hmmm.. nothing's showing up.\n\n*I spend more time holding while they try to find my order.*\n\n**CSR**: Ah is it this item?\n\n**Me**: Yes, yes it is.\n\n**CSR**: What is the issue here?\n\n**Me**: I sent it back because it was damaged and wanted to do an exchange because I like the item, but I received an e-mail stating that a refund was being processed.  I saw that there were more in stock online and was wondering if a refund was in fact being processed since I just wanted a replacement.\n\n**CSR**: Ok, well it appears that a refund was issued by the original store because they themselves did not have anymore in stock.\n\n**Me**: .... I see.  Why wouldn't they just send a replacement from a different store then?\n\n*I don't really remember what she said here but it was dumb.*\n\n**Me**: Ok then.  Let me re-order that item then.\n\n*Go through order process, give her my credit card info.*\n\n**CSR**: Here is your order confirmation number. ******\n\n**Me**: Great.  Thanks.\n\n#5 minutes later a package shows up at my doorstep.  IT'S THE REPLACEMENT.\n\n*Ring ring*\n\n**CSR**: Thank you for calling.  How may I help you today?\n\n**Me**: ........Ok look.  Here's what happened.  I placed an online order and an item that was shipped to me came damaged.  I sent it back asking for it to be replaced.  I received an e-mail stating that a refund was being processed, which you guys confirmed.  I placed another order for the item 10 minutes ago.  The replacement item showed up at my doorstep just now.  I need to cancel that order that I just placed.\n\n**CSR**: The replacement item showed up at your doorstep?\n\n**Me**: Yes.\n\n**CSR**: Ok, can I get the order number?\n\n*I give her new confirmation number.*\n\n**CSR**: I can't seem to find anything in our system...\n\n*facepalm*\n\n**CSR**: Can I have the phone number that is associated with this order?\n\n*I give her my phone number.*\n\n**CSR**: Still nothing..\n\n**Me**: What about the credit card number?  Could I give you that?\n\n**CSR**: No.  Unfortunately, we don't carry that information in our systems.  Let me do some more research and I will give you a call back.\n\n####At this point, I was done.  Fortunately, she did call me back stating that she had found the store where the order was placed and had them cancel it.\n\n####I am never ordering anything online from them ever again that doesn't involve a store pickup.\n\nEdit: **TL;DR** Made order online, order confirmation numbers don't work, customer service reps don't know if refund was issued, system is incredibly stupid.",
        "created_utc": 1431444710,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm not familiar with that insurance\"",
        "author": "yesk",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35mh2k/im_not_familiar_with_that_insurance/",
        "text": "I don't have typical insurance, instead it is a discount program offered for practices that allow it, meaning I need to call the healthcare company and get a list of doctors that will accept my \"insurance\". I had just made an eye appointment at a new place and had told the gentleman on the phone my insurance. He made me an appointment and that was the end of it.\n\nThe next day I get a call from a different employee, who left me a message saying that she was unfamiliar with my insurance and asking me to call so she could get more info.\n\nSo I call her up and give her the info she needs, member ID, name of the primary insured, website and phone number that's on the back of my card. She is very kind and says she will figure out if they can accept my plan and find out the details of it. \n\nShe calls back a bit later and explains her findings, basically ending with that the part of the plan that covers vision I am not on, only my mother is. So she apologizes and says I am not covered but I can still keep my appt, which I do.\n\nI then call my mom and complain, because I got the name of this office from the healthcare company who used my info to find what places I would be covered in and I don't get how I am not covered yet they were saying I was when I inquired. So my mom calls the company, figures out what is going on, and also talks to the lady at the doctor's office. \n\nThis excellent employee figured out what was wrong with the insurance, and how I could be added to the part of the plan that covers vision and gave me the number to call so that I could be added. I was really, really pleased with all the trouble she went through to figure out how I could be covered. Truly above and beyond. She even checked in the next day to ensure that I was added. To make this even better, the Doctor found out that my plan only covers the appointment and not any new frames, and he offered to give me a 15% discount on new frames.\n\nI was extremely happy with the whole thing and I am very grateful to this employee who went out of her way to make sure my plan was sufficient. ",
        "created_utc": 1431369616,
        "upvote_ratio": ""
    },
    {
        "title": "I just need to use a bathroom!",
        "author": "IanGecko",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35kitq/i_just_need_to_use_a_bathroom/",
        "text": "I had to use the bathroom before catching the light rail today. Went into the Ballspleens on the same block as the station; asked the manager if they had a bathroom. \n\n\"NO.\"\n\nNo \"sorry,\" no \"we do, but it's for customers only,\" none of that. So I had to book it to the Moss across the street, down the elevator, and wait for someone to open the door, all while clenching my butt so I could make it. Then some guy thinks I'm getting high in there for whatever reason, so a couple minutes later store security comes in and asks if I'm getting high. Just because a random guy, probably drunk or high himself, thought I was.",
        "created_utc": 1431324758,
        "upvote_ratio": ""
    },
    {
        "title": "If you don't care that I'm not paying, then I don't either.",
        "author": "carriegood",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/35ed57/if_you_dont_care_that_im_not_paying_then_i_dont/",
        "text": "Okay, this story is ending up being kind of long, and I'm not sure it's really all that fascinating, but here goes:\n\nI went to my local office supply store because I had to do a very large and complicated copy job which was too much for our small law office printer.  The store, which never has any decent air circulation to begin with, was unbearably hot because they hadn't yet turned on their a/c and it was about 80 degrees outside. I'm standing at one of the self-serve machines, taking this binder apart, copying small groups of documents at a time, pulling out the divider pages and putting them back, and I'm spread out with different piles all around me so I can keep track of what is what.\n\nI had done 29 out of the 32 sets of papers, when there was a massive jam. I got what I could out, but there was more in there, and I didn't want to start moving internal pieces around in case I broke something.  So I looked over to the employee at the copy center, who asked me if I had a jam. I said yes, and he said he'd be right over. He was helping someone else, so I went back to my machine and waited.\n\nWhen he came over, I explained what happened and the first thing out of his mouth was \"How many pages did you put in together?\" Said accusingly, as if I had overloaded the feeder.  I told him it was 10 sheets.  He doesn't acknowledge my answer, and does some half-hearted poking around, moving levers but not actually doing anything, and says, curtly, without looking up from the machine:\n\n&gt;It's too hot in there. You'll have to go to another machine.\n\nToo hot, huh? No shit, Sherlock. I look at the piles of papers all over the place, and un-enthusiastically say:\n\n&gt;That's fine, but I was copying privileged documents.  Is there a way to stop the job so that when you do get it going again, it doesn't print out the pages it already scanned?\n\n&gt;No. It's too hot. Use another machine.\n\nThat was barked out at me, and then he spun around on his heel and stormed off. He was in such a rush, that I didn't have a chance to ask him what about printing out the piece of paper that says how many pages were copied, *so I can pay for it?*\n\nI look around, and of course, there is not another employee in sight, not even at the registers.  It's super hot in here, and after standing in front of that \"too hot\" copier for an hour, I was sweating like a whore in church.  So I moved my stuff over to another machine, copied the last 25 pages of my binder, printed out a receipt, headed over to the register, and patiently waited for a person to show up to check me out.\n\nIt ended up costing less than three dollars, when it should have been over 30.  I'm a very honest person, so much so that my husband rolls his eyes when I tell the grocery check-out they forgot to scan my pack of gum among the full cart of groceries.  And I stood there for a while, debating whether I should find someone and explain that I'm basically stealing.  But then I thought, screw that, if their employee doesn't give a shit whether or not I pay for their services, why should I?  So I paid my $3, took my enormous piles of papers out to the car and sat with the a/c going full blast in my face. \n\n**TL;DR** got my first taste of petty theft because of a lazy, rude copy tech. Tastes sweet.\n",
        "created_utc": 1431183589,
        "upvote_ratio": ""
    },
    {
        "title": "ISP reads wi-fi password remotely without my permission",
        "author": "Dragolich",
        "url": "http://imgur.com/a/S6pkU",
        "text": "",
        "created_utc": 1431128532,
        "upvote_ratio": ""
    },
    {
        "title": "Exiled from the Everything Store: Customer 'Fired' from Amazon for Abusing Return Policy",
        "author": "deegeese",
        "url": "http://www.patheos.com/blogs/imortal/2015/05/06/exiled-from-the-everything-store/",
        "text": "",
        "created_utc": 1431055711,
        "upvote_ratio": ""
    },
    {
        "title": "I'm clearly ordering the same thing I always do BECAUSE it's terrible.",
        "author": "DragonBard_Z",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/357hl1/im_clearly_ordering_the_same_thing_i_always_do/",
        "text": "There once was a new hire at the university coffee shop who did not believe that the customer is always right...in fact she thought they really had no idea what they wanted and needed to be corrected before they whined later. We shall call her NH.\n\nFortunately,  new hire was not working entirely alone. While experienced barrista (EB) was busy doing something else,  she was at least nearby.\n\nAnd up to the counter walks me...like I do 4 or 5 times a week. \n\nNH: Hi! What can I make for you today?\n\nMe: I'd like a small Italian Creme Soda with Hazelnut and Almond Roca syrup please.\n\nNH pauses then gets serious: You won't like it. \n\nMe:...Uh...it's my usual order?\n\nNH: Those flavors dont go together. It'll taste aweful. Maybe just one or the other? Or try vanilla with one of the berries?\n\nMe: No, I'd like the Hazelnut and Almond Roca. Maybe it's not common,  but I really like it?\n\nNH: I don't want to have to make it again when you don't like it.  Please order something else.\n\nMe: No, seriously,  I don't want anything else. I've had it before...almost every day. I'll like it, I promise!\n\nNH: Are you sure?\n\nEB is taking notice and calls over: She orders it every day. Make it.\n\nNH: It sounds aweful. \n\nEB to me: You like it, right?  You won't throw it away or make us remake it?\n\nMe: I'll drink it. (We're both almost cracking up)  Even if it tastes as terrible as last time. \n\nNH: But...\n\nEB: Make it!\n\nEB rang me up and took my money and I handed the tip to her directly instead of into the jar. \n\nNH hands me the drink and watches me suspiciously while I sip it.  \"Is it okay?\"\n\nMe: \"Same as always!\"\n\nNH did work there awhile longer....I think she still thought I was as nutty as my syrup flavors,  but at least she always made it without arguing, though I made a point of making eye contact while taking that first sip... every time.",
        "created_utc": 1431026192,
        "upvote_ratio": ""
    },
    {
        "title": "I just wanted to return the bras and leave.",
        "author": "sjd_13",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/354umv/i_just_wanted_to_return_the_bras_and_leave/",
        "text": "Backstory:\n\nThis happened last year at [popular lingerie store] when I tried to return a few bras I had purchased. I spent almost two hours in the store the getting sized and trying on various types of bras. I settled on two, bought them and left.\n\nThe next day I put one of them on, but it just.. didn't feel right. It felt fine in the dressing room when I had it on, but now it didn't. I screwed around with the bust and the band and to no avail. My friend linked me to a subreddit that provided a different means of measuring bra sizes, and decided i didn't have much to lose and tried it. Found my new size, 32FF, and ordered a new bra.\n\nA week later I went back to return the bras I bought at [popular lingerie store], since they were way too small (they were 36D).\n\nSA = sales associate.\n\n&gt; Me: Hi, I'd like to return these bras.\n\n&gt; SA: Sure. Why are you returning them?\n\n&gt; Me: They don't fit properly.\n\n&gt; SA: I'm sorry, that's too bad. If you'd like, I can measure you and we can try to find another bra that fits.\n\n&gt; Me: No, thank you. I found a different measuring guide and your store doesn't carry my size.\n\n&gt; SA: Well what was the size? I'm sure we have it.\n\n&gt; Me: 32FF.\n\nAt this point, she got a rather.. angry? look on her face.\n\n&gt; SA: No, you're not a 32FF. You look like a 36DD at most.\n\n&gt; Me: *thinking internally* did she just size me by looking at me?\n\n&gt; Me: If you don't mind, I'd really just like to return these and leave.\n\n&gt; SA: You can't trust online sizing guides, they're always wrong. There's no way you're a 32FF.\n\nAt this point I was getting really annoyed because she started acting very condescending towards me. I get that by me saying what I said, I was essentially saying I wasn't going to shop there, but I remained polite about it. I'd have gladly shopped there for panties and the like, but just by how I was treated, I felt like she was trying to tell me I was dumb and that their sizing guide is superior. Maybe my mistake was mentioning another sizing guide.\n\nIn contrast, the woman who helped me the week prior in sizing and finding bras was extremely patient and would run and get different sizes and styles for me, and gave me feedback on what fit.",
        "created_utc": 1430967506,
        "upvote_ratio": ""
    },
    {
        "title": "These f***heads just paid for your food",
        "author": "acanLyre",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/353jmf/these_fheads_just_paid_for_your_food/",
        "text": "I went for lunch at a very common fast food national burger joint. I was in the drive-thru, and had been there multiple times. My order is simple, a cheeseburger with no pickles and some fries. The person taking my order throws it on the drive-thru screen and all looks well. \n\nI pull up to the 1st pay window. The young man has the window shut, but is physically freaking out towards his cash machine. A 2nd co-worker stands beside him, looking very lost in life. 1st young man is throwing hands up, looking back into the restaurant for help, and looks ready to punch said cash machine or rage quit the job. The window is still closed so I can't hear them.  \n\nAs I'm watching, my visible debit card in hand, I see an older co-worker that looks like the manager come up. He pushes aside 1st young man, and starts slamming a few buttons. Manager opens the window \"You ordered the cheeseburger and fries? You are paying with card?\" he says this a bit annoyed, but not annoyed at me. He's clearly had enough of his employees.  \n\n\"Yep\" I respond. Manager looks to the young employees \"you have a dollar?? What about you dumbass?\" he says to the 2nd. Both young men kind of check their pockets and are mumbling incoherently. To note, my meal cost less than $4. Manager, while still eyeballing these two, \"well ya'll done fucked up!!\" he turns to me \"these two fuckheads paid for your meal. Go on pull up, I'll meet you at the 2nd window\". \n\nI got my meal, no other interaction. For clarity's sake, the manager was only polite and normal to me. I definitely thought it was hilarious, but spent some time thinking what those guys did to screw up their register. The only thing I can think of (the window was slightly opened once and I could hear the young men arguing about what to do) is they rung it up wrong, and instead of voiding it they refunded it. I think they rung it up wrong at least twice. So since they kept refunding it, it threw off the entire drawer's balance. At no time did they take my card to pay, and were just running transactions through the drawer with no money. \n\nNo lunch tastes better than a free one",
        "created_utc": 1430943948,
        "upvote_ratio": ""
    },
    {
        "title": "Screen repair from hell.",
        "author": "mirzawalrus",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/352yty/screen_repair_from_hell/",
        "text": "Not a product but a service. This started about 2 weeks ago when i dropped my Sony Z2 and smashed the screen. It was obviously my mistake and I went to have it repaired. I checked the replacement prices and decided to go with a local phone accessories and repair chain (Let's call them the Phone Store from Hell) for £100 (there were cheaper options but this gave a 3 month warranty against any issues after repair). They had the screen repaired in a couple of days and when i went to check, the phone was all fine except for the back camera lens being out of place and blurry pictures. They agreed to replace the back cover. \n\nUp to here their service was great. However, the issues started once i got the phone back after the back was replaced.\n\nI checked the phone again in store and the rear camera worked fine. However the phone took about 2 minutes to connect to my network (Three UK). I ignored this and went home. On the way home the connection was really spotty and once I stepped indoors I got no reception at all. This never occurred before and I took it back to them. The engineer said something along the lines of \"yeah after replacing the back, i might not have calibrated the antenna properly\" and he got back to fixing it. A day or two later they said it was fixed and I went to pick it up. Literally had the same problem but gave it a day. Came back a day later and they agreed to check it again. Got it back 2 days later and they claimed it was all good. Same fucking reception issue again. Went back a day later and by now they had begun to get annoyed too. The \"engineer\" came out and talked to me, trying to explain that they had fixed the problem. I told him that I had checked other sims in my phone and tried my sim in other phones. It was my phone that was not able to receive reception indoors but the others were fine and that I had always been able to receive reception indoors prior to the \"repair\". He said maybe something happened to it after I dropped it initially but I clearly remember receiving a call on the day I dropped it (after the screen shattered) whilst I was indoors. When the Z2 screen gets cracked, it becomes unresponsive to any touch input, and I was connected to mobile data when I dropped it (WIFI was off) but I still had reception indoors and receveid whatsapp messages and emails. After an hour of arguing in the shop floor with the engineer, he agreed to have one final look at the antenna and show me that it is fine. He brings out one of those repair microscope+light things and pops off the Z2's back. Using a voltmeter or some sort of current measuring device (im not an engineer lol but i took physics in high school) he checked the antennas connections to the motherboard. One side of the antenna was showing current while the other wasn't and this was due to some of the soldering being scraped off. Now that can't occur due to a drop but it can whilst replacing the back. The engineer was clearly surprised and said he'll solder the antenna connector and get it back to me straight away. After waiting around for an hour in the store, he comes back with the phone finally fixed and I walk away happy as can be and thought I'd never have to walk into that fucking store again.\n\nBut unfortunately it doesnt end here. The phone worked fine for about 72hrs but whilst in the library the next day revising for exams, I picked up my phone to start a study playlist on spotify. The screen was spazzing out every time I touched it and I restarted thinking that would fix it. Nope, it was still not responding properly to my inputs and then I noticed it. A small hairline crack along the bottom half of the screen... I was absolutely shocked. The phone had been on the table and it was literally working fine (crack free) 2 minutes ago. I hadn't dropped it. It was lying on the fucking table. But then I remembered, ever since i had received it ~72 hrs ago, I noted that the right side of the screen was hollow/went inwards when i touched it and was not properly placed. I thought nothing of it mostly because I didnt want to return to that god foresaken store. But it doesnt take an engineer to realise that pressure/stress through regular use on a weak point can cause cracks. Also I hadnt dropped it or done anything stupid with it. I mean I had finally gotten it back after what was 2 weeks of it fucking about in the Phone Store from Hell. I was pissed. So fucking pissed that I took it back to them straight away. It didnt help that it was pissing down that day and I had an exam in 3 days. They said \"Sorry but there's no way you can prove that you havent dropped it again and the  warranty doesnt cover cracked screens again.\" basically told me to fuck off even though I showed them the hollow point and poor screen replacement and they acknowledged the screen went inwards under normal usage. It had been 72 hours, how clumsy must they think i fucking am that I dropped it again??? I had even spent another 10 quid on a flip cover... I asked for the managers number and the lady behind the counter gave me the head office's and owners number (shows how small the chain is). I got to calling him and probably gave him 5 missed calls (I was fucking annoyed). He called back 3 hours later and after just 20 seconds of trying to explain this convoluted shitstorm, he said that hell have to confer with the store and call me back. Fair enough, and he called me back today. He didnt take any explanations from me, said that the local branch of the Phone Store from Hell was his best and most helpful (yeah right) and that the engineers couldnt replace the screen again because \"it costs us 80 punds to buy a screen\"... I told him that the 20 pounds value added was a scam because there was no value added to my phone. I'm back at square one, just a hundred pounds and about 8 hours lighter. \n\ntl;dr the Phone Store from Hell in my city took £100 off me to replace my screen. In the process they messed up the camera and then the reception/antenna only to finally fix my phone after 2 weeks of giving it in. But the screen replacement was so poorly done it cracked whilst it was in my hands and now they wont take responsibility for it...  ",
        "created_utc": 1430934481,
        "upvote_ratio": ""
    },
    {
        "title": "Awful Sandwich",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/352xxz/awful_sandwich/",
        "text": "I had sent this email a few years ago to a large sandwich chain about a pretty bad meal.  Looking back it may have just been a bad location but I stand by my complaint.  They will be referred to as \"Company X\". \n\n\n\nTo: customerfeedback@companyx.com\n\nSubject: BBQ pulled pork\n\n\n\nI just had one of the worst experiences at any fast food chain ever.\n\n\n\nI went into Company X in Ajax (Bayly St.) today.  I decided to try the BBQ pulled pork sandwich, seeing as how I thoroughly enjoy pulled pork.  I don't know who at your organization decided that mustard should go on a pulled pork sandwich but they should be promptly terminated and publicly humiliated.   This is coming from a guy who loves mustard so you know something is wrong.  Also, pickles were a questionable choice.\n\n\n\nI don't want to get into the mechanics of what makes a good pulled pork sandwich.  But seeing as how your company really missed the mark I feel I must.  Pulled pork is great because of the smokey sweet taste.  The tender pork should melt in your mouth and leave you wanting more.  The only condiment that should go on a BBQ pulled pork sandwich is extra BBQ sauce (maybe chipotle).  When you put mustard on it completely overpowers the BBQ sauce.  All you're left with is a mustard and pork train wreck, even your delicious table sauces couldn't combat the mediocrity of this sandwich.\n\n\n\nOf course I could have asked for no mustard but I put my faith in Company X seeing as how this is your business and you should know how to make a decent sandwich. A mistake I won't make again.\n\n\n\nAlso, the usually delicious raspberry lemonade tasted like it had gone bad.  So I had to wash down that dreadful assault on the taste buds that you call a pulled pork sandwich with something that would rival sewage water.\n\n\n\nSincerely,\n\n\nA customer concerned with the direction Company X is headed \n\n\n",
        "created_utc": 1430934080,
        "upvote_ratio": ""
    },
    {
        "title": "Awful Experience at Quiznos",
        "author": "Dubscityg",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/352wng/awful_experience_at_quiznos/",
        "text": "",
        "created_utc": 1430933480,
        "upvote_ratio": ""
    },
    {
        "title": "The Great Game Goose Chase",
        "author": "Cottonish",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/350kaf/the_great_game_goose_chase/",
        "text": "Greetings, everybody! A lot of the stories I read on this subreddit tend to be quite sour, so I thought I'd change things up with a happy story.\n\nI had been searching for a video game for quite a while. This game was a Japanese game, translated to English and released in a highly limited quantity in my country. And I wanted it. Bad. \n\nFirst stop was my local Game Shop Chain (GSC). After fumbling through the Japanese name of the game and asking if they had it in stock, I was told that no, they did not have the game in stock, but they could check Game Shop Chain 2 another town over for it. To my utter delight, GSC2 held one last, glorious copy in their clutches. \n\nI decided to call ahead at GSC2 to put the game on hold, and am unfortunately informed the game was already on hold for somebody else, but they had not come to pick it up in two months. GSC2 Sales associate takes my name and number, and tells me she'll get back to me if the original customer didn't want the game. Twenty minutes later I get a call from GSC2. Original customer has come to pick up the game, but they will refer me to GSC3 as they have a copy in stock. \n\nIt's starting to feel like deja vu as I dial the number for GSC3 and repeat my spiel about the game. Without missing a beat, GSC3 sales associate tells me the game doesn't exist. After I try to justify why the game does in fact exist, he then tells me that GSC has never stocked the game and you cannot get it in my country. He then gives me the number for GSC4 and tells me they might be able to help me further. \n\nI am exasperated at this point as the call connects and Friendly Sales Associate (FS) greets me on the other end. She also tells me that the game is not in stock at that current store, but she can get me a list of all the stores that do have it in stock. After she goes through the list, I feel my heart sink. All of these stores are a 2-3 hour drive away at the very *least*. After mentioning this, the most beautiful thing happened. \n\n\n**FS:** If it's going to be too hard for you to get down to one of those stores, I can always drive down and pick up the game for you.\n\n**Me:** /speechless/ You really don't have to go that far just for me!\n\n**FS:** Oh it's no problem at all, just happy to help. If I could just take your name and number and I'll call the store and make sure the game is definitely in stock. \n/end call/\n\n\nSo I sit there. And stare at the phone in awe for a few minutes - until it rings again.\n\n\n**FS:** Hey Cottonish! It's FS from GSC4, the game is in stock and on hold for you. I'll bring it up to your local store and have them hold it there for you until you're ready to come in and buy it.\n\n**Me:** /absolute gushing thanks and freaking out and telling FS how amazing she is/\n\n**FS:** Thanks so much for coming to GSC4 and I hope you enjoy your game!\n/end call/\n\n\nSo two days later I go to GSC1 and pick up my game. It's glorious. I also emailed corporate to tell them about how wonderful the customer service was from FS, and I got a personal response back from an associate who told me he was in awe of how FS helped me and that this feedback would most certainly be passed onto the store managers!\n\nThank you, FS! This great game goose chase is finally over!",
        "created_utc": 1430879615,
        "upvote_ratio": ""
    },
    {
        "title": "Anything BUT chocolate!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34z7lw/anything_but_chocolate/",
        "text": "**I will start this off by saying that I am usually very patient when it comes to service industries, and when I make an error I apologize profusely and accept all blame for my error. I also have this habit (My dogs will say that it's a Dog-mom \"Requirement\") of going to fast-food places and ordering for me, and for my dogs. Chicken nuggets, timbits(donut holes), ice cream cones etc. Most drive-thrus in my area know me and the pack by now. This is the story of the ONE time I legitimately lost my temper on Fast Food employees. I do feel bad for flying off the handle, but where I live we are constantly having issues with the types of people that are employed with these companies. I'm beginning to lose my mind.**\n\n \n W is for worker. M is for me.\n\n  \n&gt;W: Welcome to [Trademark shop] What would you like?\n\n&gt;M: Lrg iced coffee with mint and a bagel with butter. Oh and do you have any plain [trademark snack]?\n\n&gt;W: We have no plain.\n\n&gt;M: Okay. I need anything but chocolate. Well do you have [glazed trademark snack]? If so, I'll take two for my dogs. As long as it's not chocolate that's fine.\n\n&gt;W: So two [glazed trademark snack]?\n\n&gt;M: Yes please!\n\n*I get my total and pull up to the window. I pay for the food. I get the food and the [trademark snacks] in a little bag. And lo-and-behold they are chocolate. Every. Single. One. Now I have already pulled out of the driveway and into a parking stall to give my dogs their tasty morsels. I am not happy. I hate to be THAT customer, but chocolate is NO good for dogs.*\n\n*I'm walking back to the window holding up the bag of treats.*\n\n&gt;M: Hey! These are chocolate!\n\n&gt;W: Yes. You said chocolate?\n\nM: No. I said they are for my dogs. DOGS CAN'T EAT CHOCOLATE. I said anything BUT chocolate! I haven't touched these. I just want to exchange them for some NON-chocolate ones.\n\n*Literally a HAND sticks out of the side of the drive thru window with some new non-chocolate treats. I gave them the chocolate ones and took the new ones. I got back into the car and I was greeted by some drooling puppies. They couldn't give two shits what happened as long as they get their precious yummies.*\n\n\n\nI felt bad for getting mad, and if it was just my own food I really wouldnt've cared much. But this was for my dogs. Though some people think dogs are just dogs, they are my children. It was at this moment that I finally understood why parents can go crazy when their children have the wrong foods. I've never had a problem there since though.\n\n\n\n**TL;DR: Wanted non-chocolate treats for pups. Got chocolate. Got mad. Replaced them. Pups happy.**\n\n\n\n\n\n\n\n*Bonus story: I ordered dinner inbetween jobs at the same location. I left without grabbing my drink. Went back in and ordered it. Explained that I was a dummy and didn't grab it. I have no problem paying to replace it. The lady made it for me. I handed her money and she refused. Said to enjoy. Made my night. I was mad at me for being a freaking moron, but that lady is the best. I still see her working there every once in a while.*\n\nedit: Apparently people FREAK THE FUCK OUT with dogs eating a snack the size of a golf ball. Awesome. :/",
        "created_utc": 1430855791,
        "upvote_ratio": ""
    },
    {
        "title": "I have never experienced worst customer service in my life and am beyond livid. Though I am not sure what more I expected from a company that involves buying gaming accounts",
        "author": "[deleted]",
        "url": "http://imgur.com/a/EDAQA",
        "text": "",
        "created_utc": 1430846287,
        "upvote_ratio": ""
    },
    {
        "title": "Can we just scrape it off?",
        "author": "paintsalesman",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34wij9/can_we_just_scrape_it_off/",
        "text": "I am one of the unfortunate people who suffers from Gluten sensitivity... (I get sick if I ingest Gluten). So it's a great treat to find restaurants who cater to my needs.  The other night I went to a place that I've been to before, I ordered a gluten free beer and a sandwich from the Gluten Free Menu.  The sandwich came out and I noticed right away that the bread didn't look quite right, so I summoned the waitress and asked her to check with the kitchen before I took a bite.\nShe came back and confirmed my suspicions that the bread wasn't gluten free... (What she said next floored me.) \"Can we scrape the burger off and put it on a gluten free bun? or are you one of those people who will get sick if we don't make it over?\"  ......Oh it's ok lady I just go out of my way to order all this gluten free stuff cause I'm special...Duh! ",
        "created_utc": 1430796305,
        "upvote_ratio": ""
    },
    {
        "title": "Unluckiest thief ever.",
        "author": "bokker95",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34vaf0/unluckiest_thief_ever/",
        "text": "So this happened at a gas station a year or so ago. I was just a bystander. I had gone to get cigarettes and Dr. Pepper. About 10 minutes before I got there, someone had stolen a case of beer. The attendant had called the police, but they hadn't shown up yet.  As I'm heading towards the coolers, I hear \"Fuck no! Not again!\" Another beer thief. Different person this time. Just as this girl is running out the front door with the beer, the cops come through the back door to take the report on the first theft. The thief had hitchhiked to the store. When her ride saw her running towards his car with the attendent chasing her, he locked the doors and wouldn't let her in. Realizing this, she turned around and started telling this lame story about leaving her money in the car. Then she sees the cops, drops the beer, takes her shoes off and runs.  They caught her a block away. ",
        "created_utc": 1430774326,
        "upvote_ratio": ""
    },
    {
        "title": "Employee Discount Woes",
        "author": "NimdaLive",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34r28f/employee_discount_woes/",
        "text": "Earlier today, my S/O and I did our grocery shopping at a large name store, where he works. I am friendly to the cashier as she rings up our purchases, as I have worked in retail and know how awful a customer can be. Not once did she smile, or offer anything more than a grunt by way of acknowledgement while she scanned. Alright, I can assume she is having a bad day. \n\nAround halfway through scanning, my small child needed to use the restroom, so the S/O elected to take him. Before he left, he handed me his employee discount card so that I could complete the purchase in case he was not  returned in time.\n\n((Unhappy Cashier:UC, me:me, Manager:M))\n\nUC: Youre total is $XX.XX\n\nMe(in a friendly and playful tone): Can you just take my arm and my leg?\n\nI was hoping to break through the haze of blah that UC had exhibited, and obviously failed. I quickly swipe the employee discount card, and have the debit card in my hand ready to swipe it after the discount card is accepted (UC needed to press a button). I stand there happily waiting for five minutes.\n\nUC: Are you going to swipe your card or what?\n\nMe: Oh, Im sorry love, I was waiting for you to accept the employee discount card. You must not have noticed, I tend to be quick sometimes.\n\nI say this with a smile on my face, and no accusation to my tone. People miss things. It happens. But then....\n\nUC: No. I saw that, but you dont work here. Im not letting you use that card. \n\nMe(somewhat stunned): Oh, why no, I don't work here. S/O does, he handed it to me before he took our son to bathroom a moment ago.\n\nUC: Well girl, you don't work here, you aint using the card.\n\nNow, I notice there's no one behind me, and its a slow time of day. I smile kindly.\n\nMe: Oh, that's alright. Policy is policy right?  Not a problem. He'll be back in just a moment.\n\nUC: Um, no. You either pay now, or leave.\n\nMe: Excuse me?\n\nAt this point, I've become rather upset. I can only be so understanding, and I think I have been more than reasonable up to this point. Looking over her should, I see S/O exiting the restroom with our son, but he is a ways off and must walk at the speed of a tired 4-year-old.\n\nMe(as nicely as I can): Ah, here he comes now. I'm sorry for the wait....\n\nAt this point, the manager arrives, as I supposed she silently called for him.\n\nM: What seems to be the problem here?\n\nUC: She refusing ta pay. (Typed this way intentionally.)\n\nMe: What? Oh heavens no. Im attempting to S/O's employee discount card. UC says she will not accept it,  and I can understand that. But he is on his way here now (I gesture behind M to where S/O is now less than ten feet away) so he can swipe it. I'm sorry to cause a problem, he just brought our son to the bathroom.\n\nM looks at UC for a moment with a look of disgusted disbelief, then tells her to go on break. She storms off, and M completes my transaction. The entire time I am apologizing to him for causing a problem. As S/O and I are leaving, M says this beauty.\n\nM: Thank you. Ive been needing a reason to fire that three toed sloth.",
        "created_utc": 1430685620,
        "upvote_ratio": ""
    },
    {
        "title": "International Traveler",
        "author": "BoboForShort",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34ot4m/international_traveler/",
        "text": "This didn't happen to me personally but to a coworker of my step-dad. We'll call him R.\n\nFirst a little background: They have full insurance on all of their computers so all repairs are automatically covered. They are also certified to to do the repairs themselves so they just have to request the parts. The machine in question today only needed a replacement CD drive.\n\nWhen R first started the chat and explained what they needed he was told he was in the wrong support level. So he was transferred to a different queue only to find out they had transferred him to the Canadian support, which wouldn't be so bad but they can't ship parts to the US. What follows is after he was transferred a few more times. Keep in mind R is the most calm, patient, and accepting person you are likely to ever meet.\n\n&gt;Session Started with Agent (J)\n  \n&gt;Agent (J): \"Good morning, thank you for contacting *Huge Multinational Commercial Computer Manufacturer*, my name is J. May I have the Service Tag of the computer please?\"\n  \n&gt;R: \"ok well\"\n  \n&gt;R: \"ive been transferred to you\"\n  \n&gt;R: \"from someone who i was transferred to\"\n  \n&gt;R: \"who was also someone I was transferred to\"\n  \n&gt;R: \"so if you cant help with my issue\"\n  \n&gt;R: \"dont tell me you are going to transfer me\"\n  \n&gt;R: \"i will likely snap\"\n  \n&gt;Agent (J): \"sure, could you allow me the service tag please?\"\n  \n&gt;R: \"someone transferred me to Canada at one point\"\n  \n&gt;R: \"*tag#*\"\n  \n&gt;R: \"I just need a replacement DVD drive\"\n  \n&gt;R: \"and yes I can confirm that it is a *computer model*\"\n  \n&gt;Agent (J): \"Sir but could you confirm where are you now?\"\n  \n&gt;R: \"The United States of America\"\n  \n&gt;R: \"**** N ******* *Road*\"\n  \n&gt;R: \"*City, State ZIP*\"\n  \n&gt;Agent (J): \"Could you please confirm the company name that is registered on the computer\"\n  \n&gt;R: \"*Company Name*\"\n  \n&gt;Agent (J): \"correct, your equipment is registred in USA and this is a chat for latin america service only sir\"\n  \n&gt;R: \"ARE\"\n  \n&gt;R: \"YOU\"\n  \n&gt;R: \"SERIOUS\"\n  \n&gt;R: \"I WAS IN PRO SUPPORT NA\"\n  \n&gt;R: \"THEY TRANSFERRED ME TO CANADA\"\n  \n&gt;R: \"WHO TRANSFERRED ME TO BASIC SUPPORT\"\n  \n&gt;R: \"WHO TRANSFERRED ME HERE\"\n  \n&gt;R: \"ARE YOU SERIOUS\"\n  \n&gt;R: \"IS THIS A JOKE\"\n  \n&gt;R: \"ARE YOU GOING TO TRANSFER ME TO AFRICA NEXT?\"\n  \n&gt;Agent (J): \"no sir, Ill transfer you to the basic support in USA please allow me a few minutes\"\n\nThe tech he was transferred to after this refused to respond until R gave up and canceled the session. He started over with a fresh call and was done in 3 minutes.",
        "created_utc": 1430625504,
        "upvote_ratio": ""
    },
    {
        "title": "Strange day at the grocery store.",
        "author": "gravitationalarray",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34nkap/strange_day_at_the_grocery_store/",
        "text": "I had a strange experience at the grocer yesterday afternoon.  \n\nFirst, I brought a rotisserie chicken to the deli counter to have it halved, as I have done before.  \"NO,\" the girl said, \"there's a half there already.\"\n\n \"But,\" I started to say.  \"There's one there already,\" she declared.  Um... ok, never mind.  I looked, and there was a half.  It was not a nice looking half.  So, no chicken.  I put back the whole chicken.  I've read NotAlwaysRight, and it wasn't worth making a fuss over.\n\nOk, I'll get some cheese and a pie.  Oh look, key lime pie, and the ticket on the counter says $8.49.  I was not, it should be noted, wearing my glasses.\n\nThen I saw that smoked havarti cheese was on sale.  My favorite!  Smoked havarti!   I chose one of those.  Got to the checkout and a very nice young man was serving me.\n\nHe scanned the cheese.  \"Hmm,\" he said, \"I don't understand, this has never happened before\".  The bar code read NOT FOR RESALE FOR SAMPLE ONLY. \n\n\"Oh,\" I said, \"that's odd, here, I'll go grab another one \"(it was busy and there was a lineup).  I went back to the cheese counter, where I discovered that ALL the smoked havarti was marked NOT FOR RESALE.  \n\n\"Well shoot,\" I said, returning to the checkout, \"I won't get it then.\"  \n\n\"I'm so sorry!\" Said the clerk.  \"No problem, not your fault,\" I said, \"but they are all marked Not for Resale.\"\n\nThen he scanned the key lime pie.  It came up at $12.99.\n  \n\"But the ticket said $8.49,\" I said, and this time we both went together to look.  The $8.49 was under the key lime pie, but was for a chocolate pie next to it that just didn't look very nice.  I didn't see that because I didn't have my glasses on.  \n\nAt this point I gave up entirely, and said, \"well I guess I'm not buying anything today.\"  \n\n\"I'm so sorry!\"  said the nice young man.  \"It's totally not your fault,\" I replied.  \n\nAnd it wasn't.  But it sure was weird.\n\nedited for a grammar error.\n",
        "created_utc": 1430597626,
        "upvote_ratio": ""
    },
    {
        "title": "When Telemarketers Inspire My Evil Side",
        "author": "Alkuna",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34n3ue/when_telemarketers_inspire_my_evil_side/",
        "text": "Right, so, I am a horrible, evil woman who will ensure a tenth circle of hell is created just for me. Be that as it may, I don't want your telemarketer calls at 7 am. I ESPECIALLY don't want your fourth call in a row on the fourth day in a row after I already told you No before.\n\nI've been nice, asked them to remove me and hung up three times. It's quick, it's simple, and it frees you up for calling the next one on your list. But then...\n\nI'm asleep in happy bliss land when the phone rings. Dad has left for work so... I better answer that just in case. I may have to throw on some clothes and pick him up or something. Car troubles are creeping in, so it's not outside the realm of possibility that dad's broken down.\n\nNope, it's yet another dude who wants to sell me something.\n\n&gt;Me: \"No thank you.\" (Why am I still being polite? I must be too sleepy to be mean right now... Zzzz *snork* What? Oh yeah, dude on the phone.)\n\n&gt;Him: \"But this is a really great deal! Can you tell me why you don't want this awesome magical rainbow that will cure world cancer?\"\n\n&gt;Me: \"Because I'm not interested. Please remove me from your list.\" (Irritation is creeping in.)\n\n&gt;Him: \"But this rainbow will also help you fly! And it will grant wishes!\"\n\nOkay, he's a telemarketer. He has a job to do. And he's probably not allowed to hang up. But now he has deliberately ignored my direct request. I am now awake enough to flip the switch from 'politely uninterested' to 'she just made the dinosaurs extinct with just a look!'\n\n&gt;Me: \"I. Am. Not. Interested. Please remove me from your list or I will take steps. This is the fourth time your company has called me offering this.\" (Now normally people get wary, because at refusal four, harassment threats are a possibility.)\n\nI have left my bedroom and entered my computer room; which incidentally has a close-able door.\n\n&gt;Him: \"Did I mention this rainbow will make you win the lottery fifteen times in a row?\"\n\nHello youtube! My delightful repository of heaven or hell on earth! I need your skills, DAH-ling! Now where is it? Oh there it is!\n\n1 hour long rendition of \"It's A Small World After All\" in HD. I rev it up. the first strains filter through my speakers.\n\n&gt;Me: \"I've tried to be nice. I've asked you to remove me. Now maybe I could have hung up on you, but then again, the last three times I tried, it didn't work. Happy listening.\"\n\nI put the phone by the speakers, close the door behind me and crawl back into bed. I get up in an hour anyway. When I do, the automated response is running, \"If you'd like to make a call please hang up and try again.\"\n\nI wonder how long it took for him to crack like an egg...\n\nOne week later, and no phone calls from that company. Imagine that.",
        "created_utc": 1430588906,
        "upvote_ratio": ""
    },
    {
        "title": "The old guy at the register",
        "author": "SpastixFantastix",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34krd1/the_old_guy_at_the_register/",
        "text": "Hi all.  This took place probably about 10 years ago.  My partner and I were waiting in line at a popular store.  The person in front of us was an elderly man with not a lot of stuff, including food items and cat food.  \n\nWhen the cashier told him the amount, he just got pale and said he didn't have that much so started taking things out.  Specifically the human food (I can't lie, the fact that he put his cat ahead of himself was bittersweet to me).\n\nI looked at my partner and just said, \"Can we?\"  Because I knew she was thinking the same thing.  She nodded.  We had the cashier re-enter the food and we paid the difference from what the old man had.  He was so grateful but it was the first time I had ever been able to do that for someone.  It felt tremendous.  \n\nQuickly related story: When I was a kid, I wanted to buy this toy.  I didn't have enough money though and my dad was in the shop next door.  I asked the cashier if I could run to get the rest from my dad and she said, \"It's OK, don't worry about it,\" took a couple of dollars from her own pocket, and paid the rest.  \n\nEver since then I had wanted to be able to pay it forward but never had the chance or the extra money on me.  It was worth the wait.  10/10 would definitely do it again.  ",
        "created_utc": 1430526844,
        "upvote_ratio": ""
    },
    {
        "title": "Giving cashiers your trash--what's the reasoning?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34h35b/giving_cashiers_your_trashwhats_the_reasoning/",
        "text": "",
        "created_utc": 1430447084,
        "upvote_ratio": ""
    },
    {
        "title": "Screaming child at a restaurant",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34go2v/screaming_child_at_a_restaurant/",
        "text": "About a week ago, my dad and I went to our usual buffet restaurant for some dinner and some father-daughter time.  We noticed that the place was under new ownership as the menu items have changed somewhat.  However, that is not the focus of this story.\n\nWe were seated by a family of four: Mom, Dad, and two girls, the eldest being about 3-4 and the youngest about 6 mos. to a year.  The eldest daughter decided to take it upon herself to scream and cry about every five minutes.   This annoyed my father to the point where he was giving her the stink eye to shut her up.  Finally, I get up and go to the front desk where the hostess was and tell her about the troublesome family.  I lead her over to where they were and she just said something to the effect of \"you can move if you want\" and walked back to the front desk.  That was infuriating to me and my father, who paid A LOT of money for that dinner.  \n\nWe shouldn't be the ones to move; the management should've told the irresponsible parents to move or leave the restaurant if they cannot control their child.  And yes, that kid was CRYING about every few minutes or so.  My dad got angry and frustrated and said a few choice words to me about the family where the girl's father turned and asked him \"are you talking about MY daughter?\"\n\nDad shook his head and continued to complain about the family under his breath, so to speak.  After our dining experience, I found the restaurant on a social media website and complained to them about the whole thing and all I got in response was something to the effect of \"we're sorry, we'll try better next time\" or whatever.  Well, there won't be any next time with us as we will NOT go back to that restaurant in the near future ever again.\n\nPeople pay good money to eat out and the last thing they need is an inattentive parent allowing their ill-mannered children to disrupt their dining experience.",
        "created_utc": 1430439045,
        "upvote_ratio": ""
    },
    {
        "title": "A question--this might get deleted, but what the hell.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34gn5f/a_questionthis_might_get_deleted_but_what_the_hell/",
        "text": "",
        "created_utc": 1430438536,
        "upvote_ratio": ""
    },
    {
        "title": "My Absurd Experiences. . .",
        "author": "saintbenny",
        "url": "https://blog.helpjuice.com/stop-worrying-and-start-loving-the-customer",
        "text": "",
        "created_utc": 1430423894,
        "upvote_ratio": ""
    },
    {
        "title": "In a single day Uber charged my debit card for over $800 in purchases I didn't make and has ignored my support inquiries since",
        "author": "trimalchio420",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34euou/in_a_single_day_uber_charged_my_debit_card_for/",
        "text": "",
        "created_utc": 1430409042,
        "upvote_ratio": ""
    },
    {
        "title": "Is this restaurant a write-off?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34c996/is_this_restaurant_a_writeoff/",
        "text": "I'm contemplating ordering food tonight and I'm trying to figure out if I can order from a place I had a bad experience with a few weeks back. Here's the story. \n\nI live in a three story walk up across a hospital with no visitor parking. I suspect delivering to my place is difficult. Knowing this I've gotten into the habit of tipping quite well and not getting into a huff when it's a little later then the automatically estimated time. \n\nThat being said, the last time I ordered from this pizza place the driver was so flustered by the difficulties with the delivery that he told me not to order from them again unless I was prepared to meet the driver at the street. \n\nThis pizza place is a huge chain and I'd suspect the drivers aren't able to make this kind of demand but i'm a little paranoid about what this driver would consider doing to my food if I ordered again.\n\nIs this chain a write-off from delivery until I move?",
        "created_utc": 1430352758,
        "upvote_ratio": ""
    },
    {
        "title": "No, I won't give you my number",
        "author": "hollysglad",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34bajg/no_i_wont_give_you_my_number/",
        "text": "So today I had to go to the grocery store which always means I get to go to the deli to get my cheese and meats and the kids (2 &amp; 4) always get a slice of whatever the people there decide to give them if they offer.\n\nWe get there and there is a lady in front of us being served so I grab a number from the dispenser and wait. My number is next so it's not like it's going to take a long time.  There were two people behind the counter, one was taking the lady's order and the other looked like she had a huge list in front of her and was putting together party trays.  The store was practically empty so this made sense to have one work with customers and one fill out orders.\n\nUp comes older, privileged woman (OPW) and her husband.  She takes a ticket, looks at me, then looks at the number on the wall.  Mind you, I've only been there maybe 15 seconds.  She starts telling her husband about how it's taking forever to get service and how dare only one person be working behind the counter, blah blah blah.\n\nWhile she's talking to him she slowly inches her way towards me sideways and glances at my ticket.  \"Can I get your number?  I'm in a hurry.\"\n\n30 seconds had passed and the lady in front of me is waiting for her final order.  Now if OPW wouldn't have had the conversation with her husband about things taking forever and had been nice to me, I would have let her in front of me.  NOPE.\n\n\"I'm sorry, I just got here too and I'd like to be done soon so my kids can go home for nap.\"\n\n\"Well, I'm in a hurry.\"\n\nDeli girl calls my number and I hold it up.  OPW walks over and gives her order and the girl just looks at her, looks at me, then asks me what I want.  I think she's reading my mind and knows what's going on.\n\nI give her my order and she walks off.  She comes back because, Oops!  She has to go to the back to get another brick of the cheese I need because that one is almost empty.  Not a problem!\n\nShe goes back, gets another brick and continues with everything while after slicing the first slice of my 3 piece order asking me if the slice thickness was okay.\n\nOPW at this point is practically climbing on the counter trying to get the attention of the lady putting trays together.\n\nThe most beautiful thing happens.  The lady putting trays together looks up, sees the girl filling my order, walks over, ignores OPW and asks my kids if they wants a slice of something.  I thought OPW's head was going to blow off!  After my 3 minutes of time at the deli I saw the deli girl take her sweet old time putting everything back, wash her hands, then slowly make her way to OPW.\n\nI love teamwork.",
        "created_utc": 1430337246,
        "upvote_ratio": ""
    },
    {
        "title": "That Long Bread",
        "author": "nateonsideways",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/34ah7s/that_long_bread/",
        "text": "Yesterday was one of the first nice days this year and work was dead so I decided to take a nice walk to the sandwich shop near my office. I get my order, sit down within 10 feet of the order counter, and eat. \n\nThis lady in her 40s/50s walks up with her husband. Both are black, professional looking, chatting with each other in line, laughing.\n\nWhen it's her turn to order, she says \"Let me get the Italian.\" The cashier says \"Okay, you want the #9?\" to which the lady replies, \"What? No, I was the I-tal-yin,\" practically spelling it out for the kid.\n\nHe looks behind him at the menu, directing the lady's gaze in the same direction, and says \"well, the #9 is the Italian.\"\n\nThe lady says \"oh, okay, I see. Well, alright. Hm. Does it come on that long bread?\"\n\n\"... Yes, it comes on the french bread.\"\n\nI was just sitting there the whole whole time thinking, you don't think the guy who works there knows what each of their ~16 different sandwiches are? \n\nI feel like she asked about the \"long bread\" just because she was embarrassed and wanted to redeem herself somehow but I don't know, maybe she was concerned she'd get the short bread.",
        "created_utc": 1430324614,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of the Bumbling Tech Guy - How I Pissed the Bed Laughing",
        "author": "JollyOldBogan",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/348x1s/the_tale_of_the_bumbling_tech_guy_how_i_pissed/",
        "text": "People keep telling I should be furious about it all, but honestly this is the funniest shit I've had happen to me in a while.\n\n\nAbout 2 weeks ago I upgraded my 6850 HD video card to a Radeon R9 290 so I could chill out and play GTAV without wanting to gouge my eyes out. I've never been a guy to get involved with the pc masterrace stuff, but 15fps with horrible texture is pretty bad.\n\nSo whilst replacing the card, I'm getting no signal to my monitor. Turns out I'm missing a particular cable, one that only comes with the Corsair PSU (the ones supplied with the card are 6/8 point to molex, and my PSU had no molex input), and I'm certain I may have accidentally chucked the extra cable out while cleaning up. So I call this tech guy in, who's part of a bigger company who's entire policy revolves around customer satisfaction guarantee. \n\n\nSo he comes over, and he susses out what the issue is. He doesn't have the right cable, but he has something that may work. So he grabs the spare out of his car and gets to work. In his haste, he starts fiddling around while the power is still on. As I'm watching, I notice a small spark shoot out of my tower. I pointed it out to him, but he assumed it was just an LED light flicker. He goes to turn it back on, and nothing's working. Before, the fans were going and making noise, but it's radio silence. He apologises and says he'll take it off to assess it in the lab and let me know what the problem is. No worries, I've got faith in him. \n\n\nI hear nothing for a few days. Then I get a call at work from him.\n\"Hi mate, look I just wanted to let you know whats going on - so it turns out you were right, and I've accidentally buggered your PSU. Not to worry though, I've got the same one here I can hook up, it'll be no dramas and I'll have it out to you tomorrow.\" fantastic I think. \n\n\nHe calls me back again 2 hours later.\n\"Uh yeah, look I'm sorry mate, but something went wrong and I've accidentally fried your motherboard in the process of installing your PSU. I have some spare motherboards but they're not the same model and quality as yours, but I'll hook them up and see how we go, maybe I can get some more information.\" dammit, alright, I'll let him do his thing. It's his job, he knows what he's doing.\n\n\nFour days pass. No computer, all I have is my phone and a month of netflix to tide me by. I get my gaming fix by hanging out at a mates house until the wee hours so I at least feel like I accomplished something instead of lying around all day watching TV shows. Which, really, is the same as sitting in front of a screen playing games.\n\n\nI get a call. It's the tech guy.\n\"Alright.  So essentially in the process of hooking up the motherboards, I somehow managed to fry all three spares.\" (Holy shit what the hell have you been doing) \"I've been trying to locate another board but I have to order it from overseas to replace it, shouldn't be much longer mate, I'll have it before the weekend coming up.\" Now I'm a little pissed at this point. A simple cable replacement and all should have been great, but now this guy has managed to break two of my parts that weren't an issue in the first place.\n\nI call up the company he works for, which by the way - the customer support team are absolute superstars. Friendliest, most helpful bunch of workers I've dealt with. Theyre apologising, they're offering special deals and all other kinds of stuff to keep me happy. I tell them not to worry about that all, just get my computer back to me and we can take it from there.\n\nA week goes by. No computer. I'm a little flat without playing games, but in that time I've managed to pay off bills, get some cleaning and other adult responsibilities sorted out, so there's a little silver lining in it all. Work mentioned a possible promotion, I got accepted in to two pretty awesome performances to work on, it's great.\n\n\nThen the phone rings. I didn't want to get my hopes up, but I couldn't help it. It had to be time now, surely it's all fixed by now!\n\n\n**NOPE.**\n\n\n\"Hi.... Look, I'm sorry about all this wait time with your computer and everything. It's an extraordinary situation, I've never had this happen before.\" I'm polite, I'm calm, I'm just wanting to know what is happening. I'm lying in my bed, watching the second season of ORANGE IS THE NEW BLACK (really good show, actually. Got way more invested in it than I intended, Jason Biggs has a really annoying face). \n\nThen comes the big news.\n\n\"So, uh, I was having another look at your set-up, and well, while I was having a poke around in it, I decided to see if the old PSU had maybe fixed itself\" (because that's how it works, leave shit for a week and it'll just fix itself) \"and.... Well, I think the current or polarity got rerouted or went funny. And basically... Your processor is no longer working.\" \n\n\nI couldn't take it. I just knew this was going to happen. Even before I picked the phone up I thought to myself \"he's fucked another part.\" I lost it laughing. I honestly had not laughed that hard in my life since I saw a kid trip over running to his mum with an ice cream in hand and face planting it in to the cone.  I laughed so hard I lost control of my bladder. I Pissed myself in my bed from laughing too hard. I never thought it could happen, but it did. And I laughed harder. He was on the phone asking if I was okay, and I wheezed out \"holy shit I pissed the bed mate\" and burst out laughing again.\n\nWhen I calmed down a bit, I asked him \"Look mate, what the actual fuck has been going on? This wasnt a big issue and it's turned in to essentially an entire replacement of my computer.\"\n\n\"Yeah look I'm real sorry about that mate. I've already placed the order for the new parts, they'll come in soon and I'll call you once they're in and I'm assembling it together. I'll email you the invoice, it's gonna be $950 all up.\"\n\n\nWOAH WOAH WOAH. Back the fuck up. So I have to pay for the parts that you screwed up, multiple times and weren't an issue to begin with? Nah mate. You're sucking a fart out my arse if you're talking that kind of bullshit. \n\n\nI don't say this to him, but I tell him instead that I will talk to his supervisor and discuss the terms of payment and what the situation is, because I don't honestly see why I should be paying for your errors. He says he understands, apologises again and hangs up.\n\n\nThis brings us to now. I called the supervisor, who is an absolute top bloke and waived all cost because of the screw ups. He will monitor it closely and let me know as soon as the parts are in and will assemble it himself. I changed my bed sheets, and now I'm sitting outside with a coffee, waiting until next week until I get another call saying he exploded my video card or something.\n\n\nUntil then - I'm watching prison lesbians fight and sex each other.\n\n**tl;dr - A simple video card replacement turns in to the funniest shit in my life with some kind of Extreme Makeover spin-off for desktop computers.**",
        "created_utc": 1430287229,
        "upvote_ratio": ""
    },
    {
        "title": "Bulk Toilet Paper",
        "author": "silvrwoman",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/348t3j/bulk_toilet_paper/",
        "text": "Bought my brother 3 things at [membership warehouse club] for which he offered to reimburse me.  Lost my receipt and can't remember what the items cost, so I called [membership warehouse club] and asked, \"Hi. Can I ask you what the price is of a few items are?\"  She responds, \"You can ask me about one item.\"  I giggle, thinking this is a friendly joke.  But it wasn't.\n\n*EDITED because I just read the anonymity rule",
        "created_utc": 1430284348,
        "upvote_ratio": ""
    },
    {
        "title": "Had a shocking experience today.....",
        "author": "AmbrosiaSage",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/347vqc/had_a_shocking_experience_today/",
        "text": "I was in \"Accessory Store I really Like\" in a mall I don't frequent much and I was looking at some headbands when an employee comes up and says that I'm banned and if I don't get out she's going to call security. Now this store has multiple locations and this is the first time I'm in this particular location. Being the last person to do bad in a store, this shocks me. greatly. \n\nI called my mom outside the store and explained the situation to her and she gave me some advice. So, I went to the Mall Management and told them the situation.\n\nThis event has shaken me and I feel quite quite down now.\n\nHowever, I will not let this event colour my view of the \"Accessory Store I really Like\", as I have had many great experiences in the store and regularly shop there for accessories and socks. \n\nEPILOGUE: I want to thank all of you for your support and kind words. Thank you all. You truly are the best! :D",
        "created_utc": 1430266826,
        "upvote_ratio": ""
    },
    {
        "title": "Horizon BCBS of NJ supervisor refuses to pass along feedback to their web team",
        "author": "why_rob_y",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/341c4f/horizon_bcbs_of_nj_supervisor_refuses_to_pass/",
        "text": "",
        "created_utc": 1430147318,
        "upvote_ratio": ""
    },
    {
        "title": "\"Well, we don't have a tape measure\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33yffo/well_we_dont_have_a_tape_measure/",
        "text": "This one is really short, but amazed me and is worth posting here.\n\nAbout a year ago, my mom was looking to replace our kitchen stove with a brand new, stainless steel stove. In order to fit the new stove in, we had to cut off parts of our existing counter to fit the stove. This is the conversation my mom and the worker guy we hired had.\n\n&gt;Guy: \"All right, all done.\"\n\nMy mom thinks the counter just simply doesn't look wide enough, and her suspicions were right.\n\n&gt;Mom: \"Is this really wide enough? What did you measure the width as?\"\n\n&gt;Guy: \"Well we had to guess, we don't have a tape measure.\"\n\n&gt;Mom: \"Okay... well I have a tape measure!\" \n\nProceeds to take tape measure out of drawer and measure width, and of course, it isn't wide enough. The guy had to cut off even more of the counter, but at least got it correct now.",
        "created_utc": 1430081281,
        "upvote_ratio": ""
    },
    {
        "title": "Perfect sales interaction",
        "author": "CrystalKU",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33xvrv/perfect_sales_interaction/",
        "text": "Most of the time I had walking into a place where I know the salespeople are on commission -- furniture stores, car dealerships, etc. Yesterday I went to a mattress store, we are downsizing our queen size bed for a twin bed to make room in the spare bedroom to also be a nursery. Our big \"keep the prices low\" mattress store just closed 2 weeks ago so we went to a small designer store. As soon as we walked in and saw the $5000 Tempurpedic beds, I figured they probably were going to have the no frills $99 mattress I was looking for. Here's the beautiful interaction with The Sales Guy (TSG):\n\n**TSG**: What are you looking for?\n\n**Me:** To be frank, I am looking for the cheapest twin mattress you have; it's for a spare bedroom and we have a memory foam mattress for it, we are looking for cheap not comfort. \n\n**TSG:** Here is our cheapest, we are having a sale this weekend, it's on sale for $85, you won't find anything cheaper\n\n**Me:** Totally agree, we'll take it.\n\n**TSG:** Great! \n\nWhile I signed the paperwork and he processed my payment, the other guy loaded it up in my car. It was wonderful, he didn't waste my time trying to up-sale, I didn't waste his time by listening to a sell when I had no intention of buying anything over $100. In and out in 10 minutes. If I had other needs or requests, I am sure he would have helped find what I needed. \n\nI wish more sales situations were like this. ",
        "created_utc": 1430071809,
        "upvote_ratio": ""
    },
    {
        "title": "Car shop visit was a disaster",
        "author": "sdh59",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33vl48/car_shop_visit_was_a_disaster/",
        "text": "The scene: I came in 10 minutes early for the 6 pm service appointment I scheduled hours earlier online at the car shop that is supposed to put some pep in your step. I just needed to get the codes pulled off my car because I wanted to know what codes it was throwing before I get it inspected. This chain does free code pulls so I figured why not? \n\nOkay go!\n\nNo one was at the service desk when I walked in and after waiting there for about 5 minutes or so I went to the parts desk where a man, 'Greg', was helping another customer. After finishing with this customer he made a call and then asked for the next customer in the other line. Only after beginning to check out that customer did he acknowledge me.\n\nGreg: Are you here for a pick up?\n\nMe: I'm here to get my car looked at but no one is at the service desk. \n\nIn an extremely rude tone he said that it was 6 pm and they close at 7 and weren't taking any new cars. \n\nMe: I booked an appointment online.\n\nGreg literally rolled his eyes at me and went back to ignoring me. He finished checking out the customer, helped the next customer, and then just walked off.\nHe finally came back about 5 minutes later. \n\nGreg: Are you here for a cold pull?\n\nI didn't know what that was so I said I wasn't sure. Again, in an extremely impolite tone (and with quite a lot of sarcasm) he asked how I scheduled my appointment if I didn't know what I was getting done. I told him I just needed to know what codes my car was throwing and I saw online they had a free service for that. \n\nGreg: So..... A cold pull. \n\nAgain with the sarcasm except this time he was also acting like I was completely ignorant. \n\nGreg: Phone number?\n\nMe: 113-45.......\n\nGreg: Actually, I'm going to look you up under our *appointments,* you know... Since you made one and all.\n\nMe: Okay?\n\nGreg: Name?\n\nMe: sdh59\n\nHe eventually took my keys and walked off. I was standing in the lobby watching my car. No one approached my car. No one did anything to my car. After ten minutes Greg came back.\n\nGreg: Yeah your OPM (not sure of the real acronym) port was inoperable so we couldn't get your codes. You're going to have to schedule a full electrical diagnostic for *another day*. \n\nMe: ...I was literally standing here watching my car the whole time you were gone. No one did anything to it.\n\nGreg: Well you must have looked away and missed it. \n\nAgain, snottiest \"I hate everyone\" tone I've ever heard. \n\nI was so over Greg by now so I just took my keys and left. I'm sure in the 10 minutes Greg was fucking off with my keys he could have actually done the diagnostic and now I have to go out again tomorrow, take my car somewhere else, and try to get the codes pulled.\n\nUgh. Definitely not peppy after this interaction and I don't think I'll be going back. \n\n**EDIT**\n\nUpdate: I got a call this morning from 'Jake' the assistant manager of the Peppy auto shop I went to. He was very apologetic for 'Greg' who is apparently their *customer service manager.* Wow. \n\nAnyway, he said all emails are forwarded to him and asked me to explain to him exactly what happened, so I told him the story again, but added that I was currently at Carzone and they had absolutely no problem getting the codes off my car. He seemed surprised at this and asked me to clarify, so I told him I decided going to another store in their chain might be an *inconvience* to someone, so I went to Carzone and had them read my codes and they didn't get any error. \n\nHe apologized profusely for Greg's behavior and said he would pass the info along to their GM and DM and that Greg would be dealt with accordingly. He also told me if I ever wanted work done on my car they would love to have a second chance to make things right and told me I could come in for a free oil change or general car inspection or tune up any time. Jake really helped turn things around and while I still may be a bit salty, I do recognize that one person/one bad interaction doesn't necessarily represent the whole of any company, so I'll probably give them another go in the future. \n\nThanks for all your advice! Glad to know I'm not just crazy. :)",
        "created_utc": 1430011321,
        "upvote_ratio": ""
    },
    {
        "title": "The Holy Grail of awful customer service... share your worst airline experiences. (Mine included)",
        "author": "foreveraslug",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33si8n/the_holy_grail_of_awful_customer_service_share/",
        "text": "I saw someone complaining about terrible customer service on the airplane they were on and it unfortunately jogged my memory for the worst...\n\nI went to florida when i was 9 and it was really the only vacation i went on as a child because i grew up poor. We were already all pissed by the time we got on the plane because my mom got strip searched over an open bag of cheese puffs and a bottle of contact lens solution. \n\nThe airline decided to sit my autistic, practically non verbal 7 yr old brother across the aisle. My mom saw that concessions were coming so she stuck her head out to try and ask him what he wanted. \n\nThe flight attendant literally ran the drink cart, hard, straight into my moms head. And then told her, 'well, your head shouldnt have been there.' My mom had a goose egg and was pissy the whole trip. \n\nWhat's your worst airline experience?\n\nEdit: just to be clear, my mom didnt stick her head out right in front of the cart. It was way down the isle at least 4 rows away when the flight attendant raced forward and hit her. My mom didnt notice it rocketing towards her because she was trying to solicit an answer from an autistic child, which can be a frustrating and time consuming process.",
        "created_utc": 1429937481,
        "upvote_ratio": ""
    },
    {
        "title": "Manager at game store is getting on my nerves",
        "author": "throwawayaccount9ooo",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33rxws/manager_at_game_store_is_getting_on_my_nerves/",
        "text": "Using a throwaway account for this story since it involves (GASP) video games and I know how Reddit gets about these things so just in case throwaway account! Also forgive formatting, on mobile etc etc. Now onto the story.\nA while ago I stopped at a video game retailer to browse a few new games. I just finished pokemon and was wanting something else to play now. It just so happens I was presenting as female that day (I'm gender-fluid, I present as a certain gender depending on my mood that day). The manager of the store walked over to me and asked me \"Hey sweetie, are you looking for a game to get your boyfriend?\" I just looked at the manager and chose to leave because I wasn't getting paid till tomorrow anyway and I really didn't feel like dealing with that sort of attitude.\nThe next day I decide to come back in to get a new game and it just so happens that I'm presenting as male that day. And that same manager is there again. He sees me and walks up to me and says \"Hey man, looking for a new game to play? Let me know if you want any great recommendations or tell me what you've played recently and we can go from there.\"\nI usually present as female because I prefer feminine make up so I'm very used to the casual sexism that comes with my interests but to see it that outlined right in front of me really was upsetting. This all happened a few months ago. I went back in a few days ago while presenting as female and was once again greeted by that manager asking if I was looking for something to get my boyfriend. I'm just so annoyed at this point, I think I'm gonna skip going to that store again in the future now.",
        "created_utc": 1429924685,
        "upvote_ratio": ""
    },
    {
        "title": "Cashier changed my mind about ever trying for a job at their store",
        "author": "MouseMistro",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33qcmr/cashier_changed_my_mind_about_ever_trying_for_a/",
        "text": "I saw a similar post about going to a store for job applications and figured this story would fit best here.\n\nI've been handing out resumes these past couple days and went into a basic dollar store. I asked the one cashier if they were hiring and she turned to her coworker and asked if he knew if they were hiring. And this is the guy that turned off any inkling of a thought I had about working there. Imagine someone who has the tone of voice that is absolutely filled with loathing for everyone in existence.  That voice that says in its tone \"I don't give a sh!t. I hate this job. I hate everyone. Everyone is beneath me\". That is the tone of voice, along with a lovely glare, that he chose to use in front of me, and quite a few other customers, when he said \"I don't know. Probably. Get her resume.\" \n\nSo the girl grabs my resume, but at that point I'd already decided that if they actually called me there was no way I'm going to work there. I'd probably end up killing the guy because of his attitude. If he can't act civil in front of customers for 3 minutes then he's not someone I want to work with. \n\nMaybe he was having a bad day, who knows. But it was certainly enough to change my mind. And maybe it seems like I overreacted, but I'm sure many of you know the type of attitude I'm talking about. ",
        "created_utc": 1429895856,
        "upvote_ratio": ""
    },
    {
        "title": "I made a young girl cry",
        "author": "hovercraft_of_eels",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33paax/i_made_a_young_girl_cry/",
        "text": "Yesterday afternoon on my transit back home from work I stop at my usual bread shop at the train station to get some sandwiches. Normally they're not too busy and since I have about ten minutes from arriving at the train station to my train departing, that's more than enough time to get some food.\n\nToday I'm being checked out by a young girl who likely hasn't left her teens yet. Pretty much on auto-pilot (tired from work) I place my items on the counter and hand over a €20 note (since I don't have anything smaller), but I she gives me change back for a €10. I'm not angry or something, simple errors like that can happen and I don't want to make a deal out of it, so I just tell her I gave her a 20 note, not a 10. She freezes like a deer caught in headlights. \n\nNow I feel partially responsible, I wasn't really paying attention when she handed me my change back so I didn't speak up until she had closed the till, but I didn't think it'd be that much of a hassle... wrong. She is visibly upset as she tries to explain she needs to get her manager since she can't just open the till without a transaction (or something along those lines).\n\nI make a tactical error and ask if that'll take long since I want to catch my train... and she breaks down crying. I stand there mortified not knowing what to do, fortunately her manager rushes over and gets the story out of her. I apologize for the trouble but she's more or less having a breakdown so I'm not sure if it registered. Manager sends her off for a break and I get my money back, as well as a free coffee because 'they made me miss my train'.\n\nI wasn't that inconvenienced since they go every 20 minutes but I felt horrible for causing her to cry. She must've been having a stressful day as it is.\n\n~~I think I'll have to avoid my regular bread place for a while now :/~~  \nThanks for the comments! Instead, I'll just go back to the normal routine after the weekend.",
        "created_utc": 1429876280,
        "upvote_ratio": ""
    },
    {
        "title": "I had a brake problem. One shop tried to gouge me for $1,200 but then I took my car to another and they said they'd fix it for free. Here's the story.",
        "author": "ZadocPaet",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33nouc/i_had_a_brake_problem_one_shop_tried_to_gouge_me/",
        "text": "Back story: \n\nI own a [classic Mustang](http://i.imgur.com/D3T6Nva.jpg) and have been taking my car to a shop that specializes in working on Mustangs. Last week on the way to school I noticed that my brakes were squishy. By that I mean I had to push them closer to the floor in order for them to engage. But then they were working normally. \n\nOn my way home after my classes I came to a stop sign. I pushed the brake all of the way to the floor. My car came to a stop, but then it slowly started going forward. I lifted off the brake and pressed it back down and it worked. Clearly my brakes were losing pressure. There can be a lot of reasons why this could be, some more difficult to diagnose than others, so I took it to my shop. \n\nAfter having it for a day they called me back and said that my entire brake system needs to be replaced and it would be $1207. Wow. I was not prepared for that at all. I asked what was wrong and if they could just fix that one part. They said they didn't know, but it could be the Master Cylinder. I asked how much that would cost, and they said it was a $45 dollar part. So I told them just to get it working and I'd revisit replacing the entire brake system another day. \n\nA day later this shop calls me back and gives me a mouthful about how they refuse to do that because they don't want to be liable for putting me on the road with worn brakes. Now, they are assuming that A) I don't understand liability law, B) I don't know any of the technical jargon they used, and C) that I am wealthy. \n\nAs for A), I was an administrator of both the state and federal courts for about seven years, so it was my job to be well versed in some areas of law, so I know that the \"liability laws\" they said they were worried about don't actually exist. B) I've owned this car since 2001, and I've done a lot of the work, including brake work, myself. I am not master mechanic, but I am somewhat competent when it comes to my car, which frankly is a pretty easy car to work on. I do understand why they assumed C. Earlier this year I had them do two big jobs. Replace the A/C and install a new cooling system. Those are things I can't do. \n\nAt this point I was 99 percent sure they were trying to sucker me. I also had just had my brakes inspected by both this shop (before it changed ownership) and by an Alignment &amp; Brakes shop within the past three months. I told them that, and they said they didn't have the paperwork on their own inspection and that the Alignment **&amp; Brakes** shop I mentioned doesn't do brakes. [MFW.](http://www.gfycat.com/EthicalConcreteBushsqueaker)\n\nI didn't argue. I told them that if they were refusing to fix the car I'd either do it myself or take it elsewhere. When I arrived with the tow truck to get my car they wouldn't even look me in the face and tried to confuse me with doublespeak and jargon. \n\nI had the car towed to the Alignment and Brakes shop for diagnosis. I've been going there since 2002 to have my alignment adjusted. I told the shop manager what the other shop told me. He said he'd look at it and call me the next day. I got his call and he said they inspected the brakes and they're fine. I asked him if the other shop was basically full of shit and he said, 'yeah, basically.' He didn't know why the brake system didn't have pressure, but they were working on it. He was sure that I didn't need an entirely new brake system. \n\nThat was yesterday. Today the Alignment &amp; Brakes shop manager called me and said that the problem was my front two brake cylinders needed to be replaced, and one of the brake shoes had some damage. They come in a pair so he'd replace both the front ones.  \n\n\"What will this run me?\" I asked. \n\nHe paused for a second. **\"Nothing.\"**\n\nI paused too. \"What? You're not going to charge me? Why?!\" \n\n\"Because why not?\" He said. \n\nThat conversation happened just happened a little while ago. It just really made my day. I went from worrying about a potential $1200 repair bill on some relatively new brakes, to getting them fixed for literally free. I pick my car up tomorrow. \n\nIt felt so good to have a business be that nice to me that I felt like I owed it to them to share the story. \n\nI am definitely buying doughnuts and coffee for them when I pick up the car. \n\n**TL;DR** I had a minor brake problem. One shop tried to gouge me for $1,200 but then I took my car to another shop and they said they'd fix it for free. \n\n\n",
        "created_utc": 1429835343,
        "upvote_ratio": ""
    },
    {
        "title": "A VERY Awkward Moment",
        "author": "Mystic-Spiral",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33m61p/a_very_awkward_moment/",
        "text": "Bare with a little background here, please, as the details are important to the climax of the story. \n\nTwo Thanksgiving's ago I had the joy of working in retail at an extremely busy mall. To prepare for Black Friday all of us employees had decided that we were each going to bring in some food so none of us would have to worry about lunches and could take a quick break for a bit if we needed a breather. I decided to go to the local Buy-in-Bulk store because they have a great deli sandwiches and their turkey roll-ups are the perfect finger food. \n\nUnfortunately, around this time the company I worked for REALLY messed up my paychecks which in turn affected my bank account. Long story short, a check got lost and I called to cancel that one and to get it reissued but they cancelled the wrong check; one that I had already deposited weeks ago. That means suddenly my checking account had a balance of about $50 and that any checks I brought in from my employer would now be red flagged and could take up to one month to process.\n\nThe bank couldn't help, the employee hot line couldn't help (and in fact tried to pin the blame on me) and this ultimately led to me having to go to the bank branch that issued the paychecks, cash it there, then drive to MY bank and deposit the cash, after I was charged a fee for not having an account with my employer's bank of course. \n\nNeedless to say I was incredibly upset because I had bills to pay and now couldn't. The phone calls here, there, and everywhere wound me up even further to the point where I was in tears from being frustrated. \n\nThe last of these phone calls took place before I went in to Buy-in-Bulk store for the aforementioned turkey roll ups. (I felt obligated to buy the sandwiches as everyone was bringing something and I had promised to bring them in)\n\nI go in, find the roll ups, wait in line, and finally make it to the cashier. The cashier rings me up and notices my melancholy face and red eyes and asks me in a very motherly way \"What's wrong? Having a bad day?\"\n\nI just nod and say I am having troubles at work with getting paid and it was frustrating. \n\nThis is when she *grabs my arm* in a very strong grip, looks me in the eyes, and tells me \"It could be worse you know. Today is the *I forget how many years* anniversary of the day my son died.\"\n\nI had no idea what to say to that. I was incredibly surprised that she felt the need to grab me for one (it was not a motherly arm pat or a sympathetic squeeze, for the record. It was a vice-like grab.) and secondly, I don't think mentioning the death of a son to a perfect stranger while at work was very appropriate. All in all, it made me extremely uncomfortable. \n\nI don't remember what I replied, but I do remember high-tailing it out of there as fast as I could go.\n\nI have all the sympathy in the world for her, it can not be easy to lose a child, and for that I do feel for her. But it really felt as if she was looking for an excuse to mention it. Also, she should never have touched me without my permission. \n\n\nTl;dr\nCashier asks me if I am okay, then proceeds to grab me and tell me that it's the anniversary of when her son died. ",
        "created_utc": 1429809912,
        "upvote_ratio": ""
    },
    {
        "title": "Nope, sorry we're all out",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33l0i4/nope_sorry_were_all_out/",
        "text": "Of espresso. At 6:30 am, before morning rush. At a coffee shop. Where 90% of the coffee drinks on the menu require espresso. \n\nSomeone done screwed up. Someone screwed up bad.",
        "created_utc": 1429788342,
        "upvote_ratio": ""
    },
    {
        "title": "Former Server: Best handling of \"late arrival\" to our table I've ever seen (X-posted from /r/TalesFromYourServer)",
        "author": "speedycat2014",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33ivo5/former_server_best_handling_of_late_arrival_to/",
        "text": "It was suggested that I post this here (from /r/TalesFromYourServer) as well, so I am. :)\n\nHey all! I've subscribed here for awhile but never really post. I'm a former server, and I'll be honest I was kind of terrible at the job. (I'm not a huge people person.) So I enjoy reading tales from servers today. As a customer, I almost always tip generously, but having been in the industry before I do have a few pet peeves that will really make me reassess the tip during my meal.\n\nA big one? Being sat and then being *ignored studiously* by wait staff all around us even after our menus are down, and we've been clearly ready for ten minutes.\n\nWell, this happened to us right after the Boston Marathon and I wanted to share how I went from being silently furious, to tipping 25% of what our bill **would have been** had we been charged for the surprise free dessert we got after our meal.\n\nWe were at a very fancy restaurant, a steakhouse in downtown Boston. We don't often eat fancy, but this was a huge celebration for my husband who has trained for years to qualify for and run the Boston Marathon, and he'd finished it with a great time earlier in the day, so we made reservations for 6:30PM. We arrived 15 minutes early to a quiet restaurant, and were sat. We read through the menu, my husband went to the bathroom and returned. We chatted, and multiple waiters passed our table without so much as giving a glance toward my attempts at direct eye contact.\n\nMy husband, knowing this is my peeve, said, \"I'm sure we'll have someone soon.\" I said, \"For the price we're paying, we'd better.\" \n\nJust as I was about to hound the hostess asking where our waiter was, an older gentleman rushed by with his umbrella and overcoat on. He paused, \"I'll be with you both very shortly, I promise. I'm sorry for your wait.\"\n\nI watched him go into the kitchen (through the windows in the kitchen) from our table, and he continued rushing, pulling off his coat as he walked, and continued into the kitchen where I couldn't see him. Not two minutes later he was back, continuing to apologize, stating he had to run and get something during his break and he had asked they not seat his section right away. He saw my husband's Boston Marathon jacket and instantly said, \"Did you run?\" My husband said he had, and he instantly reached out to shake my husband's hand and offer a hearty congratulations. Then he turned to me and shook my hand as well. Then he settled down to business, asking if we wanted to hear the specials, etc.\n\nOur drinks came out quickly, and our salads right after. Because this restaurant was so high priced, he offered up that a single salad would and could be easily split among two, and he was right. We each received a huge salad on our plates. He also suggested we order half portions of the sides, if we wanted to try more than one, so we did.\n\nEvery last moment of our meal was professionally, personally, wonderfully handled. He even brought the manager by to congratulate my husband (Boston really loves the runners!) and our waiter and my husband bonded over living in the same neighborhoods for many years. My husband lived in Boston for 17 years before moving away 12 years ago, and this was his nostalgic return to run the marathon in the city he loved.\n\nBy the time our salads arrived, I was in love with our waiter. Gone was the frustration of waiting at the outset of the meal.\n\nWe enjoyed our steak and lobster, and wine and beer, and after a bit he came by with a dessert menu. My husband looked at me and we gave each other a, \"Oooof we can't eat another bite\" look. He and I started chatting and my husband said, \"I would probably puke if I ate something more. That chocolate cake looks good though, comes with ice cream. That always cuts the richness. Maybe I could handle that.\"\n\nWe chuckled, but it was clear we weren't ordering dessert.\n\nApparently our waiter overheard my husband, though, because a few moments later an enormous 7 layer chocolate cake slice, complete with a lit candle and scoop of ice cream ended up on our table! \n\nAt first I thought that the person who dropped it off had the wrong table until our waiter came back with a grin on his face and said, \"You have to celebrate your first race here in your old hometown!\" Big, hearty handshakes all around again, as we started to tuck into our cake.\n\nWe got the bill, sub-$200, but only by about $10 which was essentially the cost of the cake we got for free. I left a $50 tip, because I appreciated so much how well he took care of us.\n\nI know that TGIChilibees servers may not be able to comp a huge slice of cake, or treat someone ridiculously special during the course of a busy Friday night, but the thing that really stuck with me was that our server 1) immediately recognized we had been waiting, 2) acknowledged it as soon as he could 3) really **did** bust his butt to get back to our table to help us ASAP and 4) made sure we knew we were in good hands for the rest of the meal.\n\nI often feel like when someone's been late to my table at the outset, they feel like their tip is ruined, or we already have a bad perception of our service, and so it's not worth it trying to change that mindset, but really for me first impressions **can** be changed by an awesome, kind, friendly server.\n\nI just wanted to share this great experience in hopes that it makes up for some of the bitchy customers I know you guys have, and to help share that when it comes to restaurants and service, first impressions *don't always* ruin a customer's perception of the service throughout the whole meal.\n\nAnd as I always feel when I'm in this sub: Thanks to all of you who put up with the pain in the ass customers, who bust your butts, and who treat us well when we eat out. I know the job you do is tough. I couldn't hack it, so I live vicariously through your stories.",
        "created_utc": 1429739280,
        "upvote_ratio": ""
    },
    {
        "title": "The store manager at my game store is super rude.",
        "author": "nokyo-chan",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33hb6u/the_store_manager_at_my_game_store_is_super_rude/",
        "text": "My town has just one store where you Stop to buy Games. The store manager there is...well...rude as all hell. I worked there for a couple months, and honestly,  if I'd had a different store manager, I wouldn't have quit.\n\nThe other day I went in with my SO and a friend of ours. He was trading in some games to go towards Mortal Kombat X. SM = Store Manager, BF = my boyfriend, F = friend.\n\nImmediately, when we walked up, SM had an attitude. When BF told her what he wanted to do, she scoffed before she started the transaction.\n\nSM: \"Do you have the rewards card?\"\n\nBF: \"Not on me.\"\n\nSM: \"We can look it up using your phone number.\"\n\nBF: \"Try xxx-xxx-xxxx.\"\n\nSM: \"...nothing under that number.\"\n\nBF: \"Oh. Try xxx-xxx-xxxx.\"\n\nSM: *snotty tone* \"Nothing under THAT number either. Are you SURE you have one?\" \n\nBF: \"Oh, uh, maybe...not?\"\n\nF: \"Could we use my rewards account?\"\n\nSM: \"Not for HIS trade-in.\" (She jabbed her finger towards BF.)\n\nBF: \"Try xxx-xxx-xxxx. If not that, then I guess I don't have one.\"\n\nSM: \"Fine. ...okay, I couldn't find it. Sign the pin pad.\"\n\nBF signs the pin pad, and SM gets an even bigger attitude.\n\nSM: \"Uh-uh. NO. This is a binding, LEGAL document that's going to be sent to the *police department*. Your signature needs to be more legible than a circle and a squiggle.\"\n\nBF: \"...this is my signature.\"\n\nSM: \"No. Do it again. Better.\"\n\nBF: \"I opened a bank account with this signature.\"\n\nSM: \"Do. It. Again.\"\n\nSo he signed the pin pad again. SM made an exasperated noise.\n\nSM: \"*Did you hit cancel?!*\"\n\nBF: \"No.\"\n\nSM: \"*Great*. Well, you froze my register. Now we have to go *all the way* to the other one and start this *all over*.\"\n\nBF: (getting irritated at this point) \"Yes. I did that. *I* froze your register.\"\n\nSM: \"IT. I said IT. IT, as in the PIN PAD, not YOU.\"\n\nAt the other register, she again refused to accept his signature until he changed it. Then, BF actually smiled at her and said, \"Hey, I'm sorry about all this bother my signature caused. Have a good day.\" SM stared back at him, then turned around and walked off without a word.\n\nWe emailed a complaint to corporate, and surprisingly, a manager from another store in the district called him to follow up. BF told her the story again and that manager said, \"...that is NOT how things should be done. I'm sorry you had to go through that. I will definitely be talking to her about this.\"\n\nI've definitely seen SM be curt and even cold to customers, but I thought that she saved this caliber of rudeness for her employees. F said that he's seen her be like this to other customers before, but never to someone that was with him. I mean, wtf? BF was nice and friendly to her the whole way through, except for that one snarky remark he made, and honestly, that wasn't even that bad. I haven't been back, and I don't know if I'm ever going to.\n",
        "created_utc": 1429714677,
        "upvote_ratio": ""
    },
    {
        "title": "\"You cut the bok-choy so it's lighter!!!\"",
        "author": "AlanLiuGaming",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33g0q8/you_cut_the_bokchoy_so_its_lighter/",
        "text": "Reading about the spinach story in /r/TalesFromRetail reminded me of what happened to me and my mom a year and a half ago.\n\nSo here goes.\n\nAfter my swimming lessons in a hot summer day, my mom decided to go to the nearby Chinatown to shop for groceries and the like.\n -note- we both DO speak Chinese.\n\nIn a somewhat crowded produce store, there was a man placing all sorts of produce on the front. Eventually my mom took some bok choy, placed it in a plastic bag that one can get easily, and proceeded to the register.\n\nWhen the cashier scaled the bag, we both noticed the price was unnaturally high. My mom told the cashier that the price per pound was supposed to be lower (I can't remember the exact price but somewhere around .90 per pound). \n\nIn a rage, the cashier cuts open the bag, let's all the bok choy fall on the counter and ground and yells in Chinese. The following is what I can make out from the argument, which is close to accurate.\n\nCashier: Well then can you explain why you cut the bok choy?!?\n\nMom: The guy in front cut it! (Which was true)\n\nCashier: No, he doesn't cut the produce!\n\nMom: Are you serious? Did you even read the sign?!\n\nCashier: The bok choy is (a higher price then .90)!!!\n\nWe both knew this was going nowhere, so we both left.\n\nAnd my mom never went back to said produce store.\n\n-if any format problems arise, I apologize that I am on mobile for a few days-",
        "created_utc": 1429680781,
        "upvote_ratio": ""
    },
    {
        "title": "Most Insensitive Call Center Worker Ever",
        "author": "Celtic_Queen",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33e2es/most_insensitive_call_center_worker_ever/",
        "text": "Here's my crappy insurance call center story.  Hopefully it's not too long.  My grandparents lived in a small town.  On December 30th of one year (date will be important later) my grandfather had a stroke and was transported by ambulance to the local small town hospital.  Where we live, most hospitals belong to one of two networks - for this story we'll call them Network B and Network M.  My granddad's local hospital was in Network B.\n\nWhen granddad gets to the hospital, they decide he needs to go by ambulance to a big city hospital.  They load him in the ambulance and since they are a Network B hospital, they take him to the big Network B hospital in the nearest big city.  My grandmother calls me and I go to meet her at the big hospital.\n\nWhile he's in the ICU and we are waiting for news, I start thinking of issues we need to deal with.  I knew both granddad and I had different versions of the same insurance - a large company with a color in the name.  While we were sitting there, I realized that Network B hospitals are not included in our insurance plan.  They're out of network.  I realize that he really should have been taken to a Network M hospital.  But at this point it's life or death and he's in the ICU hooked up to a bunch of machines. I wasn't about to try and get him moved.  It might have killed him.\n\nSo I decide to go ahead and call the insurance to tell them what happened and see what we can do about it.  After finally getting to the right person, I explain the whole situation in detail.  And this is what the call worker replied with, \"Well, your lucky your grandfather had a stroke on December 30th instead of 2 days later because now you can appeal his being sent to the wrong hospital.   If it had been after the first of the year, you couldn't appeal it and you would be out of luck.\"  Yeah, lady, I'm really jumping up and down for joy because my grandfather had a stroke this year instead of next year.  Thanks for your compassion.\n\nNope, no \"sorry that happened to him\" or \"I know this is stressful\"  Just \"You should be grateful it happened now rather than later.\"  She didn't offer to do anything to help or make effort to try and work with me on the situation at all.  Some people suck.\n\nUnfortunately he did end up dying at the hospital and we were hit with a ton of medical bills.  We did appeal it (like the bitch told me to) and they gave us all sorts of crap.  But they didn't realize that my uncle is a lawyer who specializes in medical law.  We just sicced him on them and ended up getting the bill reduced back down to a reasonable level.",
        "created_utc": 1429645580,
        "upvote_ratio": ""
    },
    {
        "title": "What size was that?",
        "author": "Katsaa",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/339by4/what_size_was_that/",
        "text": "One day, my mom and I decided to grab a bite to eat at the nearest fast food drive-through. The dude taking our order could hardly hear us through the box and was being really rude about it. Note- My mom is one of the most polite ladies you will ever meet. It was going fairly well, that is until the end of our order. \n\n&gt;Mom: and one small coke please. \n\n&gt;Dude: WHAT?! \n\n&gt;Mom: one small coke please! \n\n&gt;Dude: huh? \n\n&gt;Mom: *leans out window closer to box* A…small…coke! \n\n&gt;Dude: WHAT? A coke? What size? \n\n&gt;Mom: small please! \n\n&gt;Dude: HUH? Lady what? *jokes with coworkers*\n\n&gt;Mom: LET ME TELL YOU WHAT YOUNG MAN. TAKE A LOOK BETWEEN YOUR LEGS. THAT IS THE SIZE BEVERAGE I WANT. \n\n&gt;Me: *stares wide eyed at windshield quietly* \n\nWe drive up to the window in silence. Mom casually pays the guy for the food and we are handed our bag. Followed by the LARGEST cup of soda I have ever seen in my entire life. No extra charge.",
        "created_utc": 1429553079,
        "upvote_ratio": ""
    },
    {
        "title": "Trashy time at home improvement store",
        "author": "redditforcash",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/338euy/trashy_time_at_home_improvement_store/",
        "text": "Well I went to big orange the other day and it was the trashiest experience I have ever had going into this store.  Some of it was the customers, some of it was the employees.  \n\nTo start my experience off, I was begged for change by a homeless person inside the entrance of the store.  That area where you grab your cart.  You would think a manager would have chased him off by then.\n\nAfter walking into the store I was greeted by a white trash women screaming at customer service.  She kept calling all the ladies \"Bitches\" and kept telling them to, \"Get Tyrell out there right now because, he knows what he's done.\"  So I walk away from this mess only to hear over the announcements, \"Tyrell, please come to the front. Your girl is causin' a scene.\"  Good job front desk, you are about to cause a bigger scene.  \n\nI then went through the aisles looking for where the screws were only to see an employee opening merchandise on the floor and putting it into his apron.  Now it could have been part of his job, but I have worked in loss prevention and knew this employee was stealing.  If product did need to be opened for the company's purpose it would have been brought behind a front desk or into the loading area.\n\nOnce I finally made it to the check out the check out girl answered her phone during the transaction.   She said, \"Wassup, nah I ain't busy. I'm just at work.\"\n\nIf it wasn't so close to me I would say I would never go back again.  But Jesus Christ on a cracker they need to hire some new people to that store.",
        "created_utc": 1429538130,
        "upvote_ratio": ""
    },
    {
        "title": "A Little Bit of Kindness ALWAYS Goes a Long Way",
        "author": "UBT400",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/332fic/a_little_bit_of_kindness_always_goes_a_long_way/",
        "text": "I was ordering food from a small burger place in the apartment complex my SO lives in. The Guy behind the counter is really nice, and he works really hard to stay afloat in a place where bigger businesses are EVERYWHERE (It's a college town, there's basically a fast food place every where you look).\n\nAfter I placed my order (Mozzarella sticks and a medium drink) I put a dollar in the tip jar. He looked very surprised.\n\n&gt; Guy: Wow, thanks so much! You have no idea how seldom that happens...\n\nI looked at the tip jar again, and noticed only my dollar, and *a quarter*. Seriously people? \n\n&gt; Me: No problem. You make the best burger in town, in my opinion.\n\nHis face lit up and he went about his business preparing my food. He handed me the box and drink and I went on my way. When I got back to my SO's place, I opened the box and what do ya know... He gave me an extra mozzarella stick. It was only then I noticed that he also gave me a large drink instead of a medium. What an awesome person. He'll have my business until the day I graduate.",
        "created_utc": 1429393467,
        "upvote_ratio": ""
    },
    {
        "title": "Another medical tale..",
        "author": "LVDave",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/33216a/another_medical_tale/",
        "text": "After reading /u/bluja000's medical tale, I figured I might as well post mine from a few years ago..\n\nFirst a bit of background.. I'm a retired computer tech/network admin, and to keep myself busy, I volunteer with the Red Cross on the local DAT Team, which is the\nRed Cross acronym for their Disaster Action Teams. These teams are the guys/gals who respond after fires to provide lodging/clothing/food for those affected by the \nfire. We're dispatched by the local fire department and provide immediate on-the-scene help for the people displaced by a fire. We have a van stocked with drinks/snacks, clothing packs, blankets, etc. Each shift is comprised of two volunteers, one driving the \nvan, with the cellphone that the fire deparment calls, and a partner. The van driver responds in the van and the partner responds in his/her own vehicle.\n\nI was on duty on July 11, 2013 as the van driver, and around noon that day, the duty phone rang, with word that there was an apartment fire. Since I was already nearby, I quickly drove over to the location. Our proceedure in the case of a large apartment fire\nis to arrive on scene, contact the fire department incident commander, and have him point out the property manager to determine the number of affected persons. I located the fire department incident commander and he pointed me to the rental office. I found the apartment\nmanager, and found that one entire section (10 units) of the apartment complex was gutted. \n\nSince our norml DAT duty shifts only consist of two people, It became glaringly apparent that I'd need to call the chapter office and get additional assistance for me and my partner in interviewing the affected residents and filling out the paperwork. The manager advised me we could use his office to do the interviews/paperwork. Since I'd left the duty phone in the van, I stepped out of the office to go to the van to get the phone to call for\nbackup. As I walked out of the managers office, I missed the fact that there was a nice little step in the doorway, and when I stepped off of it, over I went, sprawling out on the floor. Now I've derped out like that previously, falling down, and nothing really came of it, other than some bruises and lots of embarassment, but this time.... It was MUCH MUCH worse.. I tried getting up on my own, but everytime I tried to pull my legs up under me to\ntry and stand, the area around both knees burned like they were on fire.. Since the fire department was still on the scene, one of their EMT's came over and started poking around, I assume, to see if I'd managed to break both legs.. After a bit, the EMT tells me he wants to transport me to the hospital... Under normal circumstances, this wouldn't have bothered me as much as it did. The circumstances being in my current case, being without medical insurance.. At the time this happened, I was only 63, thus not eligible for Medicare, and since I'd quit working in July 2010, and my medical insurance had stopped, I'd checked into \"Unaffordable Care Act\" coverage, and it was WAAAAY beyond my budget, I was, therefore, \"flying without a parachute\", and I REALLY REALLY didn't want to go to the hospital, but since I couldn't stand on my own, and any attempt to was greeted by pain, 12 on a scale of 1 to 10....\nI gave in, and was taken to the nearest hospital, which just so happened to be where my wife had worked as an RN for over 20 years before she retired a few months earlier.. This fact will be VERY important later on in my tale..\n\nI arrived at the hospital, and endured more of the worst pain I'd ever felt while they moved me off of the ambulance gurney onto a hospital gurney.. I was admitted to the hospital and a doctor was assigned to evaluate my situation. First thing after admitting me, the doctor ordered an X-Ray and an MRI.. I understood the reasons for this, but when I was taken in for\nthe MRI, the tech doing the scan told me he would ONLY be examining me from the waist up.. I'm not a medic, but even I know when you have blinding pain in a given area, and you're going to do an MRI, you *include* the area that is exhibiting the pain.. ie: my legs..  Noooo, the tech\nsaid the order was only for the waist up.. Oh well, the doctor knows best (or *so* we HOPE!!)\n\nThe next day, both my wife (who was a nurse for 25 years) and I asked this doctor about this glaring (to US) discrepancy.. He says he was checking to be sure there was no spinal injury, and it is his medical opinion that this pain is caused by a neurological injury.. Of course his specialty is neurology... \n\nSo, he sets me up for a bunch of tests to try and figure out the pain issue and the fact I can't stand or actually even raise either of my lower legs. This goes on for nearly five days while I get poked for blood every four hours or so, and languish in bed watching television and using their bog-slow wifi on my laptop... \n\nIn the meantime, my wife tells me the doctor told her that he couldn't find anything neurologically wrong, and it was his belief I was faking the pain... When she told me this, my bloodpressure rose dramatically. The next day we both told him during one of his \"swoop in.. howareyadoing.. swoop out\" visits that we wanted an Orthopedic doctor to check me out.. His response was \"It would do no good\"...\n\nWhile laying there in the hospital, I had plenty of time to worry/wonder just how the $#%@# we were going to pay for this, not to mention, several visits by the financial department wanting to know how we were going to pay...\n\nI even called a lawyer to see if the apartment complex was liable.. The first question out of the lawyers mouth was \"did you go *into* the room thru the same door you went out of, when you fell??\" Of course, the answer was yes, so the lawyer on the other side would argue, successfully, that you already *knew* about the step... sigh..\n\nSince my wife knew a LOT of people in the hospital, having worked there for 20 years, she called\nin the \"BigGuns\" and got me a visit by the on-call Orthopedic doctor. The VERY first thing *he*\ndid was schedule me for another MRI, this time covering the legs. The next day, he came by and told me I'd blown out the knee ligaments in both legs and he was scheduling me for repair surgery.\n\nAfter the surgery, I had to wear braces on both legs for six weeks, while the ligament repair healed. They transferred me over to the rehab/physical therapy ward where I spent two weeks before going home to a hospital bed, wheelchair and walker for the rest of the six weeks. \n\nWhile in the rehab ward, my wife and I had time to put this entire horror-story down in chapter/verse\nand present it to the hospital management. We filed an official complaint with the hospital regarding the initial doctor and his statements and lack of complying with our request for an Orthopedic consult. I also indicated I was seriously considering filing a complaint against the doctor with the state medical board. Soon after I got home, we recieved a letter from the hospital \"risk management\" office telling us they were dropping about 70K from our hospital bill, due to our complaint..  I often wonder \nif that original doctor is still practicing at this hospital.. I sure the hell HOPE not..\n\nAlso, soon after we filed the complaint, I started getting visits every day from the hospital CEO, asking\nhow I was doing and was there anything he could do for me.  For those wondering how much this total of 5 weeks in the hospital cost us, well, the itemized bill\nI asked for showed a total of $347K, but we only paid about $115K, of which completely cleaned out one of \nour IRAs, and a good chunk of another. \n\nSince I was on-duty with the Redcross when this happened, their insurance paid $10K, which covered the \nbill for the surgical doctor's services and a couple of other non-hospital bills. The really nice part was that the Orthopedic doctor cut his bill from $5K down to $3K since we were paying him directly..\n\nAnother crap thing I've been told happens a LOT, is the \"delayed billing\"... Turns out about 2 months ago, in Febuary 2015, we recieved a bill for the Anathesia services rendered in August 2013!!! Nearly 20 months later and we *just NOW* get this bill for $1400?????? The 3rd party billing company's excuse? \"The doctor only sent this to us last month\".... HUH??? So we're gonna pay this off at $25/mo for the next howEVER many months... ",
        "created_utc": 1429385520,
        "upvote_ratio": ""
    },
    {
        "title": "Can't leave without oxygen, but hey, send you home tomorrow without that oxygen.",
        "author": "bluja000",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32zru8/cant_leave_without_oxygen_but_hey_send_you_home/",
        "text": "My husband has been in a skilled nursing facility or hospital for the past 10 months, due to major reconstructive surgery.  Due to the length of being away from home, he's qualified for what's called Institutional Medicaid, and has Medicare because he's disabled.  He was recently deemed healthy enough to return home, so his social worker, who handles the discharge process, was given a list of various devices needed for a safe discharge to home.  This list included a hospital bed, a special bedside lift apparatus called a hoyer (I think) lift, a transfer board, oxygen, and an array of other items.  Most were due to him being an amputee with risk of bed sores.\n\n\nWell, his scheduled discharge ended up being delayed, because some equipment had to be special ordered, and hadn't arrived in time.  I found out that the social worker had NOT ordered the hoyer lift, because she thought my husband would be given some additional staff support through his home health agency.  However, it looked like she had pretty much gotten everything else on order, including the oxygen.  We were just waiting for the doctor to write the orders, and she would be ready.  My husband's discharge date was adjusted to take effect, not Monday, but Thursday.  That's fine, gives me more time to prepare, and more time for the power chair to arrive.\n\n\nThen, I'm sick.  Not able to do anything to prepare.  Throwing up a few times during the time that I should have been spending preparing for him.  Unable to speak to his social worker, believing everything is going well.  Finally I feel better, the day of his discharge.  That's ok, I can get him home and he can deal with me cleaning up around him, whatever.\n\n\nSo I go to see him, ready and willing to help pack up his stuff.  His social worker comes in to his room, tells both of us that he can't be discharged because his insurance won't pay for oxygen.  Apparently he has to need it all the time, or have a sleep study to prove he needs it for night-time use (or a c-pap/bipap), and the facility couldn't prove he needed it all the time.  They needed to schedule a sleep study to get insurance approval for the oxygen, and couldn't do a safe discharge without that.  Ok, hubby is just SO thrilled, but what can he do?  Leave against medical advice?  If he did, he wouldn't get anything, no meds, no home health, no equipment, nothing.  Not even a ride home, since I don't have a vehicle.\n\n\nSo, we wait.  Somehow, social worker gets him a sleep study appointment for the next day.  I get home, find out his new hospital bed is 10 inches too high, no way he can get into it without massive help.  Next day, I call social worker, advise her of bed status, get told I have to call equipment provider.  No mention of him being discharged that night, or that he's still lacking some equipment, nothing.  So I call equipment vendor, nothing can be done until next Monday (btw, this is Friday, day after he was expected to be home).  That's ok, I don't figure he's coming home until at least then, because it's going to take time for the sleep study, then the c-pap.  He's had one in the past, so we know the routine.  Or, we thought we did.\n\n\nI go in that night, to go with hubby to the sleep study.  Start to ask him about whether he wants to take anything with him, get told by him that he's taking EVERYTHING.  As in, he's going home after the sleep study.  WHA???  I just spoke to social worker, no word whatsoever about this.  Ok, ok, don't panic, we can do this.  Get him packed, get him to the study.  He obviously qualifies, he's put on oxygen after half hour, then c-pap immediately after qualifying.  Next morning, get him home.  Bed is too tall, we can't get him in it.  Get him in it with the help of fire dept paramedics, and he's stuck in there until we can get a hoyer lift.  But wait, there's something else missing.  Oh yeah, that all important oxygen.  You know, the one thing that they said they needed for him to be discharged safely.\n\n\nI ended up calling the facility and speaking to the social worker, her supervisor (an administrator), AND the Director of Nursing before anything was actually accomplished.  I'm guessing that the social worker was reamed up one end and down another.  And the administrator told me that apparently my husband declined the use of the \"in house\" c-pap machine.  Umm, yeah, that's not possible.  Those machines have to be calibrated individually for each user, to make sure that there's not too much or too little pressure.  You wouldn't want to, you know, blow out a persons lungs with those things.  And of course, my husband had no idea what he was talking about.  However, after only a 20 minute conversation with the Director of Nursing, they called me back to tell me that they were paying for the oxygen, until a c-pap could be provided.  Of course, hubby has to go in for another sleep study (more issues needed study than the initial one found), which isn't at all uncommon.  For now, the oxygen is helping, and we have been able to purchase a lower bed with the help of my family.\n\n\nTLDR: Can't send you home without oxygen one day, at least not safely.  However, let's kick you out the next day and make you wait a week before sending you that oxygen at our own expense.  Because, you know, we f*cked up and don't want to be sued or nothing.",
        "created_utc": 1429325147,
        "upvote_ratio": ""
    },
    {
        "title": "\"I just started my period.\"",
        "author": "shesingsinthemorning",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32z2c8/i_just_started_my_period/",
        "text": "So a few months ago, I went to Mexican Restaurant. This restaraunt has been open for about 2 years now and has always maintained the same servers and hoatesses. \n\nAfter church one Sunday, a group of us decided to go out for a nice dinner with our pastors. One of our number notices that the server has a rather long face and asks her if she's okay. He expected to hear something like, \"yeah I'm just tired\", or \" it's been a long day\". The response the server gives him?\n\n\"Ugh, no I just started my days today!\"\n\nHe was so confused as to why she would be sharing this information with him, and let out a startled \"what?\". \n\n\" You know! My *days*. My *period* I just started my *period* \". \n\nI don't know about you guys, but I thought that it was highly inappropriate, but no one said anything or talked to management about it, though part of me thinks we should have.",
        "created_utc": 1429310103,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of how I got someone fired (Strong Language)",
        "author": "how_do_i_name",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32ya3x/the_tale_of_how_i_got_someone_fired_strong/",
        "text": "This is my little tale that happened yesterday. Sorry in advance for Spelling, grammar, and formatting. \n\nSo the other day I witnessed some true stupidity. I was going to a large store red store from some shopping. Now while i was walking through the parking lot i noticed someone parked in the no no parking next to the handicapped parking. Like this [No Parking] (http://www.pva.org/atf/cf/%7BCA2A0FFB-6859-4BC1-BC96-6B57F57F0391%7D/handicapped%20parking2_cropped.jpg). Now this guy was his his Elevator service van. I always tell people that its not a parking spot and that they cant park there. So I said to this guy as I'm passing \"You cant park here, it's for the handicapped people\" As I'm walking away i hear \"Yea why don't you don't you mind your own fucking business you faggot\" I just put my arms up like [what the hell man] (http://data1.whicdn.com/images/64061746/original.jpg) and take a picture of him in the handicapped spot. I walk inside and think that it is all over. So I walk in to get my Think Thin bars and this guy comes in finds me. Comes up to me and says \"Hey I was just waiting for a parking spot, but I guess you didn't know that did you?\"\nI already mad at this point just told him to \"Fuck off\"\nIn reply to he says \"You'll say that in here ill be waiting for you outside, stay fat fatty\" and walks ago. I  told the security guard but the guy apparently just drove off after that. \n\nAfter I buy what I buy what I what i want i head out to my car and look up the company. I call the customer support line and as soon as the guy answers I tell him \"Hi i wanted to make a complaint about a technician. Today one of them called me a 'faggot and fat' and tried to fight me\" The guy on the other side just go \"OHHHHHHHH gosh let me put yo on hold real fast\" So he put me on hold and and get the Regional Manager who i talk to and am told that she is going to make sure that it never happens again, and that the technician is going to be fired for this. Also where this guy really messed and cant try and say that he wasn't even there? All of the company vans have GPS in them.\n\n\nSo sorry about any grammatical mistakes and such. Im not that great at writing things out",
        "created_utc": 1429295983,
        "upvote_ratio": ""
    },
    {
        "title": "Aunt's Crazy Adventure",
        "author": "susieeQT",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32t82r/aunts_crazy_adventure/",
        "text": "First time posting. Also, I'm bad at titles.\n\nThis story happened to my Aunt and her family a few days ago.\n\nSo my Aunt had decided she wanted the latest and greatest phone for her birthday, so she, my uncle, and the 2 (teenage) kids all went into town to the phone store.\n\nThey get there about an hour before the store closes, and because this specific phone she wanted had just been released that day, there were about 3 or 4 people in line in front of her. No big deal, they decide to get in line anyways.\n\nThey finally get up to the counter, and my Aunt starts to talk with one of the employees about the different phones. My uncle gets a business call, and steps outside for about a minutes to take it. During the time he is outside, the store closes, and they lock the doors. My Aunt realizes this, and when he gets off the phone, she politely asks the manager to open the door for him.\n\nThe manager flat out refused. He said for security reasons, they could not let him back in. My aunt at this point is freaking out a little, as she doesn't do well doing things on her own. She spent about 20 minutes talking with the manager, explaining that because it was my uncle's name on the account, she couldn't even buy the phone without him present. She also didn't know his social security number, which was also needed to get into the account. My uncle also had the card they were going to use to pay for the phone.\n\nAt this point, my uncle is calling a friend of theirs who works for that store, and explained the situation to him. The friend said that there was no such policy in place, and that there was no reason for them to not let my uncle back in.\n\nMy aunt tells the store manager this, who laughed it off. At this point, my aunt is pretty angry, and tells him that if they are not going to let my uncle back in, they need to let her out because they just lost a sale. The manager spends a few minutes trying to convince my aunt to stay, before she finally just walks past him to the door.\n\nMy uncle is planning to call corporate to complain, and is considering changing phone providers. In my opinion, the store acted very unprofessional. They are much better ways they could have handled that situation.",
        "created_utc": 1429196554,
        "upvote_ratio": ""
    },
    {
        "title": "How not to handle international support",
        "author": "TenNinetythree",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32q01h/how_not_to_handle_international_support/",
        "text": "I considered posting this in /r/talesfromtechsupport, but decided against it as the technical issue is minor. I used to have an Android-running cellphone by a smaller company, which is mostly based overseas. This cellphone had an issue with GPS. So I called their English support (living in the RoI, I thought they were better informed about things like repair options)... and I understood almost nothing. I understand having a callcenter in India, I can accept having eager people from the Phillippines answer my questions, I can get used to the variant of English spoken in Egypt. What I mean is, I am not a racist or a language purist in regards to tech support. But who in their right mind decides the best place for their support is Scotland!? \n\nAfter several attempts to explain my issue to the Scots and understand their replies failed, I decided to call the German support line (yes, I was still in the RoI and, yes, it was expensive, but German is my native language, so I decided it might be easier). I explained the issues which I had and was told that I would receive a reply within the next week. 7 days passed and no reply. So I tried repeatedly to call again, but always gave up after more than half an hour in the queue. \n\nEventually, I reached someone. I mentioned the issues I had reaching them over the last week, not accusatory but more like: \"you must have been pretty busy last week, I couldn't reach you at all.\" The reply was special: This person told me that he was the only person who gave support in German and that he had been on vacation the last week where I tried to reach the hotline. At least he had received a reply from the overseas team and they had an idea to circumvent the bug... but seriously, that is no way to handle vacations or international support!",
        "created_utc": 1429127934,
        "upvote_ratio": ""
    },
    {
        "title": "No one helped me",
        "author": "LeonardoDecatprio",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32nrqy/no_one_helped_me/",
        "text": "I'm on mobile, so sorry if the formatting is messed up. Also, I don't know how to add flair, so mods, feel free to add a medium tag if you want. \nI went in to a Canadian home/auto/miscellaneous store today to get a couple things for my new (and very first) car. I didn't get greeted by anyone when I walked in, which isn't a big deal at all, but these stores usually have someone say hello to customers. I knew what I was looking for, I just didn't know where any of the things were. I went down the aisle I thought it'd be in, but didn't see it, so I went looking for an employee. Other than the one lady I saw helping a customer already with a large purchase, I didn't see any employees. I walked around for about 10 minutes looking, and when I finally found one and asked him where the thing was, he just said, very quickly, \"aisle 2.\" He didn't show me where it was or help me pick the right thing (I was looking for jumper cables) or ask me questions or anything. Just a quick answer and then he went back to talking to (what might have been) his manager. \nThen a couple minutes later, the same thing happened when I needed a glass case opened to get an item. Spent 5 minutes walking around trying to find an employee, then he just quickly opened the case and walked away. \nI didn't get yelled at by frustrated workers, or have someone think I work there when I don't or anything like the normal stories here, but I was just a little disappointed with the lack of help I received. I don't mean to be sexist, but I'm a teenage girl looking for stuff for a car, so I honestly kind of expected someone would offer to help me find what I needed (I'm a little too shy to just straight up ask for help).  I've never been into a store where an employee didn't offer to help me find anything for help me pick the right product, and it just kind of surprised me. ",
        "created_utc": 1429081375,
        "upvote_ratio": ""
    },
    {
        "title": "She just wouldn't ring my stuff in",
        "author": "Mallet89",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32n955/she_just_wouldnt_ring_my_stuff_in/",
        "text": "So, I came here from tales from retail. I can assure everyone  that because I work in retail, I try my hardest to be a good customer. Sometimes, it just doesn't matter. \n\nThis happened when I was in college. I had to do groceries, and when your in school, every bit of money saved counts. Where I had went, you could get the student discount of 10% off. Bought my stuff, came to $200, and then I informed her that I was a student, and it was student day, so I would like the discount. She informs me that it can ONLY happen if I had an Air-travelling points/miles card. I don't have one. I said to her that that was a little inconvenient, and had it been anywhere in the store, I would have went to the other grocery store. Her response: \"well you should have just went there!\" \n\nI was in shock this happened. But I just thought it might have been a long day, so all I said in return was\" that was a little rude, if you could please scan my items, I will go now\"\n\nThat is when she argued me, saying over and over, she was not rude. Every time she said it, I would say \" please scan my items so i can leave\" I'm also with my hubby, who at this point chimes in with the same thing, because we are  both embarrassed. Then she calls her manager. No one was yelling, or anything that would require her coming. But she does anyways. The supervisor came over and I had to explain what happened, and that I just wanted her to scan my last few items so I can go. She is still talking over me saying she wasn't rude, over and over.  At this point, I then said im pissed, And to get me outta there. I called back to complain later on, and apparently she went home crying about it. \n\nIf you act like that, you should not be in cusotmer service",
        "created_utc": 1429068907,
        "upvote_ratio": ""
    },
    {
        "title": "Sassy girl over the phone",
        "author": "kokomocat",
        "url": "http://www.reddit.com/r/TalesFromTheCustomer/comments/32mkzy/sassy_girl_over_the_phone/",
        "text": "I recently put an order online for some clothes (that I can only find online) and I got them a couple of days ago. I try them on and all fit well but one; so of course I read over what I need to do to exchange it and follow the instructions closely as to make it easier to whoever is processing my exchange.\n\nI wrote down the reason I was returning, the item, item number, size, size I wanted and all that jazz and off it goes. Today I receive a mail saying I will receive my refund soon but... I didn't request a refund but an exchange, since I loved the shirt so much.\n\nSo off I go, again, and I call their line to fix these issues. I could tell the gal on the phone wasn't having the best of days, the conversation with sassy girl (SG) when like this:\n\n&gt; SG: Yadda yadda clothing, what can I do for you?\n\n&gt;Me: Oh hi! I'm calling because I'm having a bit of an issue with an order, I requested an exchange but was given a return instead and I was wondering if...\n\nShe interrupts me.\n\n&gt; SG: Start by giving me your order number and we'll see, OK?\n\n*sigh* alright, maybe she's having a bad day. I give her the info she needs and she asks\n\n&gt; SG: So what's the problem again? I see they gave you a refund.\n\n&gt; Me: That I would've liked to exchange it, and I'm receiving a refund instead. How can I go about exchanging the product?\n\n&gt; SG: I don't know, if you didn't read the instructions or sent it like you should I have no information and there's nothing I can do for you.\n\n&gt; Me: Well, I read the instructions thoroughly and did as instructed and...\n\n&gt; SG: I TOLD YOU THAT'S NOT MY PROBLEM, THAT'S WHAT I'M TELLING YOU I DON'T HAVE THE INFORMATION!!!!!\n\nOh hell no, you're not yelling at me simply because I'm not yelling at you, I respect you and I expect at least some patience and tolerance if not respect.\n\n&gt; Me: May I speak to your manager, please?\n\nI never thought those words would come out of my mouth.\n\n&gt; SG: HE'S GONNA TELL YOU THE SAME!!! I ALREADY TOLD YOU I DON'T HAVE THE INFORMATION IT'S NOT OUR PROBLEM!!! RETURNS HAS THE INFO, NOT US, OKAY?!\n\n&gt; Me: That's perfectly fine, may I speak to him, please?\n\nShe put me on hold, came back a minute later much calmer and even offered me a discount which I didn't want or expect; she didn't let me talk to her manager, though. I thanked her for it and told her I appreciated her help. I felt terrible afterwards for losing my cool but I truly didn't like her cutting me off and yelling at me. I asked my husband if I was rude first (she was on speaker because I was doing some other things) and he said that no, that maybe there was a miscommunication. Either way, I hope she has a better day tomorrow and that she doesn't have the night shift, especially since those are tiring enough as they are.",
        "created_utc": 1429056851,
        "upvote_ratio": ""
    }
]