[
    {
        "title": "Computer gnomes",
        "author": "MalletNGrease",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gqmt6/computer_gnomes/",
        "text": "My wife went into labor last weekend to deliver our firstborn. It wasn’t a fun experience, but not an awful one either. \n\nAfter the duty nurse confirmed that the day had indeed arrived, we were moved from the observation room to one of the delivery rooms along with a pair of nurses who were assigned to look after mom and the baby (and dad too!).\n\nThe new room had a workstation that had an issue. It did not want to wake from sleep or had locked up. Fans on, but no input response, no activity LED, no keyboard indicators or mouse optics, just the power led. The nurses pressed some buttons, gave up and left to get a spare.\n\nMy wife was pretty much exhausted from the contractions and out of it. I was now left alone with a piece of equipment that was interfering with my wife's care, so as a technical support professional decided to take matters into my own hand.\n\nA quick diagnosis showed I was right and the usual remedies did not appear to work. I forced an unexpected reboot by removing the power lead, waited 10 seconds, then reinserted. The machine booted and proceeded to load as normal. I took my seat by my wife again.\n\nWhen the nurses returned they were a bit befuddled at the now functioning machine. They asked me what happened.\n\n\"It came on right about when you came back. Must be computer gnomes\".\n\nMom and baby are healthy!\n",
        "created_utc": 1525356515,
        "upvote_ratio": ""
    },
    {
        "title": "An angry professor and his coffee-damaged laptop gave me enlightenment (and laughs)",
        "author": "Universal_Binary",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gq9xk/an_angry_professor_and_his_coffeedamaged_laptop/",
        "text": "**Me**:  The green and keen PFY (jr. sysadmin/support person) in the Computer Science dept. at a large state university, a couple decades ago.  My first real job!\n\n**Prof**: The one rude and surly professor in a department otherwise full of wonderful people.  Ph. D. in computer science, but known for printing out his emails before reading them.  Had two moods: yelling, and yelling loudly.\n\n**Boss**: Sr. sysadmin, my boss, and effortless genius at solving bureaucratic and people problems.  Unflappably polite, but also didn't take crap from Prof.\n\n**Scene**: The CS lab.  I was hard at work on something or other when Prof burst in.  (He never just entered quietly.  He always burst in without any pleasantries and left with a &lt;SLAM&gt; of the door.)\n\nBoss was respectful to Prof, but didn't take crap from him.  So naturally when Prof wanted to yell and badger at someone, I, being the PFY, was an easier target.  This particular incident occurred about a week after he had used some grant money to buy the fanciest, most expensive laptop anyone in the department had ever seen, which he used for the arduous tasks of running notepad and printing emails.\n\n&gt; Prof, yelling: This laptop is broken.  I demand that you fix it immediately.\n\n&gt; Me: Hmmm...  Let me take a look....  Looks like you spilled coffee all over the keyboard.\n\n&gt; Prof, yelling LOUDLY: That is a ridiculous accusation!  I resent that!  I never drink coffee near the laptop!  I'm a professor.  Don't talk to me like that!  I'm telling Boss how rude you were.\n\nI wasn't super worried.  Boss knew this guy.  And how often his printed-out emails had coffee stains on them.  I looked closer and, before thinking, blurted out -\n\n&gt; Me: ... and cream, it would seem?\n\nProf finds Boss, calls him over, and angrily escalates to Boss in my presence.\n\n&gt; Prof: ... and so I demand you fix it immediately.\n\n&gt; Boss: It doesn't even power up.  We can't fix that.  It'll have to go back to Gateway.\n\n&gt; Prof: It's under warranty.  Make them fix it!\n\nBoss lets him dig the hole nice and deep.\n\n&gt; Boss: Warranty won't cover a coffee spill.\n\n&gt; Prof: IT WASN'T A COFFEE SPILL!  I DEMAND A WARRANTY REPAIR! IMMEDIATELY! AND WE WON'T PAY ONE CENT FOR IT!  &lt;SLAM&gt;\n\nExit prof.  Now I am a green and keen PFY.  What would Lassie do now?\n\n&gt; Me: What on earth do we do here?\n\nBoss gets a sly smile.\n\n&gt; Boss: Ship it in for a warranty repair like he asked.\n\n&gt; Me: But won't they just reject it?\n\n&gt; Boss: Of course.\n\n&gt; Me: But....   ooohhhhhhhh!\n\nBoss's smile deepens.\n\n&gt; Boss: And make sure to document for them that we refuse to pay even one cent for repair, just as Prof said.\n\nAnd so begins my enlightenment.\n\nOff goes the laptop.  Prof stops by every day for the next week or two, asking if the laptop's back, if we've heard anything, etc.  I'm sure the pain of having to print his email from a mere *average* computer was really getting to him.\n\nFinally we get a package back from Gateway.  I was about to open it, but boss says no.  He calls up Prof to tell him his laptop is back.  Prof, of course, rushes over immediately.\n\n&gt; Prof: &lt;bursts in&gt;  So it's back?  Does it work?\n\n&gt; Boss: Here it is.  We haven't opened it yet.\n\nProf almost looks excited as he opens the box.  There's the laptop, with a repair order on top, reading:\n\n&gt; Warranty claim denied\n\n&gt; Rejection reason: System board damaged by dried brown and white liquid and smells of burnt coffee.\n\nIt also, to add ~~insult to injury~~hilarity, included a bill for the return shipping fee.\n\nProf stood there staring.  He literally got red in the face.  He yelled some more.  Loudly.  Boss and I just sat there, trying hard not to grin too obviously.  Finally:\n\n&gt; Prof: Well how do I get it fixed then?\n\n&gt; Boss: Pay for the repair.\n\n&gt; Prof: Oh all right then, send it back.\n\nProf then looked at each of us intently, in an almost threatening manner.\n\n&gt; Prof: But it wasn't coffee!  Got that?  IT WASN'T COFFEE! &lt;SLAM&gt;",
        "created_utc": 1525353313,
        "upvote_ratio": ""
    },
    {
        "title": "\"Delete my profile\" - OK!",
        "author": "BezniaAtWork",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gpue7/delete_my_profile_ok/",
        "text": "[removed]",
        "created_utc": 1525349046,
        "upvote_ratio": ""
    },
    {
        "title": "Lazy users love waiting until major outages to report things!",
        "author": "muzzsjm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gotlk/lazy_users_love_waiting_until_major_outages_to/",
        "text": "I'm manager on a service desk/information desk we deal with light user support and info management so as one or only two technical guys on my team of 5 I often get pulled into doing the technical support. We can fix most things at first/second line level but a lot of stuff gets passed onto an external company who do most of our IT. It's a weird system but that's how the organisation works.\n\nAnyway we have a major system outage due to a network change over night, lots of printers stop working. \n\nAt least 30 printers lost IP settings and naming conventions. So anyway our external company fix most of these remotely no problems no changes needed on users laptops or computers.\n\nSo I get in and get an urgent call from my boss I need to floor walk as NONE of the printers are working, bear in mind the outage was a week before. To our knowledge only one printer had not successfully been fixed and was awaiting external company to come and sort it.\n\nAnnoyingly our printers only have a 2 year support period we clear jams, change toner and soft trouble shoot. To save money out of warranty we do some jobs ourself without telling external company.\n\nAfter 2 years they are replaced if anything other than rollers are faulty. \n\nSo we need to know about printing issues asap!\n\nHere's my findings on my floor walk\n\n4x printers not even turned on... working fine once turned on\n3 x printers out of toner new toners sat next to printer\n(Most people in the company know how to change toner)\n\n1 x printers has too much paper loaded tray is jammed shut\n\n7 x printers have been faulty/out of action for over 6 months not reported no idea what is wrong most likely rollers or paper jams\n\n1 x printer has been offline/not used for 3 years\n(This is a big expensive colour laser worth over £1000)\n\nPeople just couldn't be bothered to report to us or the external company by the looks of it. The external company run excellent support no queue times on the phone and you can report via live webchat or email. SLA is normally 1 day or a max of 3 on a printer! \n\nI would estimate half the printers in the three buildings we cover were out of action and users had just added another printer. Madness!  \n",
        "created_utc": 1525335788,
        "upvote_ratio": ""
    },
    {
        "title": "\"Floppy Disc\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gn0up/floppy_disc/",
        "text": "[removed]",
        "created_utc": 1525314243,
        "upvote_ratio": ""
    },
    {
        "title": "It’s not IT’s responsibility to.....",
        "author": "Phoneczar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gmxkp/its_not_its_responsibility_to/",
        "text": "[removed]",
        "created_utc": 1525313365,
        "upvote_ratio": ""
    },
    {
        "title": "One more thing...",
        "author": "heimdahl81",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gmaok/one_more_thing/",
        "text": "I am a doorman for a high end condo building and I make a little extra cash doing minor tech support for the mostly elderly residents. Getting tipped $20 for changing the input on someone's TV is a weekly occurrence. \n\nToday, a lady calls down proclaiming the internet is down in the building. Nobody else has complained, so no it isn't. I tell her I will come up and check. \n\nI get up there and she has the computer of choice for the elderly, wealthy, and technically inept, a MacBook Pro. She can't get it to connect to wireless. She keeps saying \"I can't find Milo\". Apparently she renamed her router Milo. I ask her where the router is and she takes me to the opposite end of the large apartment from where she was trying to get it to work.\n\nI bring the laptop right next to the router since every unit has their own wifi and interference is sometimes a problem. I check the router, all is green, so that's not the problem. I do the old turn it off and on again with the laptop's wireless. The router name pops right up and it connects. Problem solved.\n\nOn my way out, her husband says \"One more thing...I found this plugged in. Do we need it?\" and holds out a wireless extender. \n\nI resist the urge to facepalm and tell him to plug it back in where he found it and leave it be.",
        "created_utc": 1525307412,
        "upvote_ratio": ""
    },
    {
        "title": "User Expects Me to do Their Job; I Skewer Them in an Email to Their Boss.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8glqu7/user_expects_me_to_do_their_job_i_skewer_them_in/",
        "text": "[deleted]",
        "created_utc": 1525302341,
        "upvote_ratio": ""
    },
    {
        "title": "Reported Lines Down at Location.",
        "author": "vi0cs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gk9mn/reported_lines_down_at_location/",
        "text": "Ticket comes across to our team for a locations phone lines being down. Typical POTS lines troubleshooting needs to take place and find out whats going on.\n\nPanic Manager - $PM  \nNetops guru - $me\n\nSo, I give the location a call and ask for the MOD.\n&gt; **PM** - Hello, thanking for calling XPlace  \n&gt; **me** - Hello, this is vi0cs with netops, can I speak to the MOD please.  \n&gt; **PM** - Hi, this is the MOD but I need to let you go I have an emergency. Can you call back?  \n&gt; **me** - Okay, that is fine, I was calling in regards to your phone lines and they appear they are working.  \n&gt; **PM** - Oh, yes, but I have the fire department on the way, our bushes are on fire because someone threw a cigarette away into our mulch.  \n&gt; **me** - Oh yea, I'll call back in and check on you in a bit.\n\nAt this point, I let her go and added another crazy issue that happens to one of our remote locations.\n\n1. Dead Bodies\n1. Bushes on Fire\n1. Dumpster Fire\n1. Squirrels eating wires\n1. Termites in a phone system\n1. Rats eating wiring\n1. Dump trunk pulling down aerial cable for internet\n\n\n",
        "created_utc": 1525290275,
        "upvote_ratio": ""
    },
    {
        "title": "The Tales of Ted: You Tried",
        "author": "khaomanee",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gk314/the_tales_of_ted_you_tried/",
        "text": "I'm back with the tales of everyone's favourite tech.\n\nThis happened while I was in a meeting and was relayed to me by Andy (which, for the ones who don't know, is the senior tech guy that worked with me and Ted).\n\nA few minutes after I left Ted started to complain that Windows Update was causing trouble with his computer, as it was very slow, often lagging and getting stuck on simple tasks. He then decided that the best course of action was to lock his workstation and disconnect his tech phone line so that he could get no calls. \n\nAndy suggested a few solutions, but basically was too busy to handhold Ted through the troubleshooting, and he was also rightfully annoyed.\n\nAfter 15 minutes or so, another phone rings. It was a special temporary line that we had set up to do a sort of trial of our tech support for a new, very small, consulting firm. Ted had no choice but to pick up the phone, as Andy was already on a call, as he could not just let it ring without answering.\n\nSweet justice! It was the elderly and very tecnologically impaired owner of the consulting firm, that had trouble with his email. While Ted was babbling on the phone with him, I came back, not knowing what was going on. Ted signaled to me that I had to take the call, I asked why, and he babbled some more. I told him I could not, as I had to go to my boss' office to brief him on a project. So Ted had to unlock his workstation, which was magically working. Andy was desperately trying not to laugh, and he sent me a IM through our corporate chat software to explain why.\n\nIt was hard not to laugh in Ted's face, very hard. When I came back 30 minutes later he was still on the phone with the old man, because he had failed to understand that the problem was a simple Outlook configuration issue. The rest of the afternoon was very slow, so me and Andy got to relax a bit and do some \"housekeeping\" tasks, while Ted looked like he was about to cry.\n\nNice try Ted.",
        "created_utc": 1525288858,
        "upvote_ratio": ""
    },
    {
        "title": "I Got Disconnected!",
        "author": "NYFranc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gjpj1/i_got_disconnected/",
        "text": "It's been a good while since I posted on TFTS and it's good to be back. New job, same tech problems. Let's begin.\n\nA couple of hours ago, I get a call for immediate tech support by a tech vendor. Little on specifics \\(nothing new\\) but the usual \"urgent\" request for help. Grabbed a couple sips of coffee and rushed over to the tech client.\n\nThe client just like almost all tech clients you deal with in the world of tech support. Acting like they know what they talking about and demanding you fix it their way. Ok, I'll play along. Ten years at my former job taught me how to play it cool and let the vendor play \"Guess Who\" about the issue until they finally get to the point.\n\nAfter five minutes of rambling about how it'll affect the business, finally, they said, **\"I Got Disconnected!\"**. Disconnected from what, WiFi?, I calmly replied. **Heavens no, thank god, I need my YouTube fix and I love the free WiFi**, the client retorted. I wanted call her a bum at the bare minimum for that statement alone, but got to be professional and stuff. Then, she bellowed \"No, no, my phone. I broke my phone without even knowing it.\"\n\nI took look at the phone while she rambled on about missing phone conferences and not being able to pester her family. I told her she can use her cell phone. She adamantly insisted it was out of the question because she doesn't mix business with pleasure. O.....k.\n\nHer cheap IP phone was connected to a POE switch that had the power adapter unplugged. No power, no phone. Re\\-plug the switch and a few minutes later, the phone is working again.\n\nLike most lusers, she thank me for my IT smarts and I got the hell out of there.",
        "created_utc": 1525285931,
        "upvote_ratio": ""
    },
    {
        "title": "Today Brought Redemption",
        "author": "Krevbot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8giums/today_brought_redemption/",
        "text": "[removed]",
        "created_utc": 1525279393,
        "upvote_ratio": ""
    },
    {
        "title": "Being lazy gets you the most work",
        "author": "curtludwig",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8giula/being_lazy_gets_you_the_most_work/",
        "text": "There was a time when I was working phone support when my boss mouthed off to a customer and somehow managed to not get fired. His punishment was that he could no longer speak to customers. This meant that I became the defacto boss for my group.\n\nOne of the techs that worked \"for me\" in this defacto role had the same name as 3 of the other guys in the office.\n\n&gt; Me: Well we can't have another guy with the same name, I'll call you... Stinky.\n\n\n&gt; New guy: Oh geez, don't call me that. At my last job they called me *Hilarious nickname* and it really stuck.\n\n&gt; Me: Well *Hilarious nickname*, I think you're going to love it here.\n\n*Hilarious nickname* was a pretty good tech, he had previously worked for *big cable provider* and as people were much less likely to yell at him working with us he was pretty chill.\n\nAfter a couple months I noticed that *Hilarious nickname* was taking a lot more calls than the other 2 members of his team. This didn't make sense as I could recognize the laziness in *Hilarious nickname* as similar to the lazy streak in myself and the other 2 guys on his team were both type A personalities and very hard workers.\n\nAs I set to digging I realized *Hilarious nickname's* mistake, after every call he'd set himself to \"unavailable\" in the phone system. Normally \"unavailable\" was what you'd use if you needed a bathroom or lunch break, \"followup\" was the appropriate setting if you had finished a call and needed to tidy up your notes.\n\nIt turns out that *Hilarious nickname* thought by going \"unavailable\" after every call he wouldn't get penalized for taking a little break after every call but what really happened was that when he set himself \"available\" again he would be put at the top of the phone tree and automatically take the next call and so was unwittingly sniping calls from the other two techs.\n\nYears later I was talking to a woman I worked with at a different company and she mentioned \"oh my friend from college says he knows you.\" she told me the name but it wasn't anybody I recognized. Later that day I got an email from *Hilarious nickname* \n\n&gt; *Hilarious nickname*: \"Why did you tell x that you don't know me?\"\n\n\n&gt; Me: She didn't as about you she asked about *some guy's name*\n\n&gt; *Hilarious nickname*: Thats me, thats my name.\n\nTurns out I had forgotten *Hilarious nickname's* actual name, in the year or so we worked together I only ever referred to him as *Hilarious nickname*...",
        "created_utc": 1525279385,
        "upvote_ratio": ""
    },
    {
        "title": "Database Support 13: Embarrassingly Parallel Operations",
        "author": "db_dev",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ggbgo/database_support_13_embarrassingly_parallel/",
        "text": "Last time on Database Support: [Stop the ride, I wanna get off!](https://www.reddit.com/r/talesfromtechsupport/comments/8el4t4/database_support_12_the_developer_hokey_pokey)\n\n---\n\nA few months after my last tale, everything was looking up for my team.  We'd been assigned several new hires and [trained them up quickly](https://i.imgflip.com/296ujq.jpg) but _hadn't_ had them yanked away from us as per usual, everyone on the team was contributing well to all of our projects (even good ol' [Superfluous](https://www.reddit.com/r/talesfromtechsupport/comments/2fbihc/database_support_episode_2_testing_my_patience) was relatively competent by this point and no longer deserved that nickname), and we were finally making progress with our massive backlog of work.\n\nNaturally, this wasn't to last.\n\nThe department had a big release coming up, the biggest one in years, and management decided that having eight people on our team was simply too many.  I don't remember the exact reasons they gave as to _why_ having exactly four pairs of people to deal with _more_ than four different tracks of works was so objectionable, but I do recall that said reasons sounded pretty stupid and flimsy at the time and basically boiled down to \"Big teams are bad, mmkay?\".\n\nOne morning we were called into a meeting with a few of the higher-ups and given the bad news:\n\n&gt; **$Manager1:** We've decided that certain tracks of work in your backlog are very high priority, and are worth splitting out a separate team to work on them.  DB_Dev, $Coworker1, $Coworker2, and $Coworker3 will be staying on this team with the current tracks of work, and RelEng, Gilderoy, $Coworker4, and $Coworker5 will be forming a new Infrastructure team.  \n&gt; **$Coworker1:** Where will the Infrastructure team be located?  There's not much free space on this floor.  \n&gt; **$Manager1:** They're going to work next to the Utilities team.  The same space you're in now, just rearranged a bit.  \n&gt; **$Coworker2:** So, not everyone has the context on all the stuff the team works on, and even DB_Dev and RelEng don't have a handle on everything.  What should we do if we need someone on the other team to help us?  It seems like there would be lots of explaining back and forth going on.  \n&gt; **$Manager1:** We'll be giving both teams access to each other's task tracker, so if someone asks you a question about the other team's work you can quickly get up to speed on it.  \n&gt; **$Manager2:** But we're confident that each team will be able to do their work independently of one another, so whichever team you're on, don't worry too much about keeping up with the other team's tracks of work.  \n&gt; **$Coworker3:** What if we're working on something for a week or so?  Should we just keep going back and asking questions?  \n&gt; **$Manager1:** We'll allow periodic rotations between the two teams to enable knowledge transfer when necessary.  \n&gt; **$Coworker3:** And how does that work with planning meetings where those tasks are discussed?  Just add a bunch of notes in the backlog, or...?  \n&gt; **$Manager1:** That's a good point.  When we're setting everything up, we'll send out invites to the other team's events so you can stay up to date.  \n&gt; **$Manager2:** Again, though, remember that you'll be separate teams.  Don't feel obligated to go to those meetings, since they won't really be covering anything relevant to you, day-to-day.  \n&gt; **$Manager1:** Everyone good?  \n&gt; **Developers:** *vague indications of hesitant and skeptical agreement*  \n&gt; **$Manager1:** All right, go teams!  \n\nIf this all looks to you, dear readers, as though we were still effectively going to be a single team, but with two task trackers to check, two daily standups that cut half the team out of the loop, two sets of planning meetings that would take up double the time, and a pointless shuffling of desks, and management couldn't see the obvious staring them right in the face...you'd be right!  That's exactly what ended up happening.\n\nBut that's not the fun part.  The fun part was one particular coworker mentioned above, Gilderoy, the most recent new hire and whose addition to the team precipitated this split.\n\nAccording to management and other team members, Gilderoy checked all the right boxes:  Gilderoy had hit a home run during his interview and charmed most of his interviewers!  Gilderoy was a rock star coder with years of industry experience!  Gilderoy had worked at a different database company for a long time and was a masterful DBA and SQL guru!  Gilderoy had worked on low-level operating system code before, both at work and in his free time, making him a great fit for the Infrastructure team!  Gilderoy had several amazing ideas to revolutionize our testing and packaging automation!  Gilderoy was going to be worth two \"normal\" developers while we prepared for the big release!\n\nGilderoy...was a [fucking fraud](http://s15559.pcdn.co/wp-content/uploads/2014/11/Gilderoy-Lockhart.jpg).\n\nI'd caught the tail end of one of his interviews and expressed my hesitation about his waffling and handwave-y answers to certain questions, but the other interviewers couldn't get enough of him and their handful of \"Fuck yeah!\"s outweighed my one \"I've got a bad feeling about this.\"\n\nIt started innocently enough.  The first day after the team split, he was paired with RelEng, so named because RelEng was the former team lead for Release Engineering who'd jumped ship to the development side back when [excrement hit the rotating air displacement device](https://www.reddit.com/r/talesfromtechsupport/comments/6t33so/database_support_5_the_day_the_qa_died), and who was thus by far the most experienced person on the team when it came to infrastructure-y sorts of things.  RelEng started showing Gilderoy the ropes and ran into a problem within minutes: pretty much everything my company does is Linux-based, and Gilderoy only had Windows experience, a fact that had failed to come up in his interview, so he was unfamiliar with the Bash environment, text editors, and so forth.\n\nNo big deal, if you know the Windows command prompt you can pick up Bash pretty easily, right?  I overheard their conversation about this, but largely ignored it; I was, after all, on the Utilities team, not the Infrastructure team, so this supposedly wasn't my problem.  But I did think the situation seemed [awfully familiar](https://www.reddit.com/r/talesfromtechsupport/comments/72bax8/database_support_11_the_blind_leading_the_blind), so I kept an ear out.\n\nRelEng is a very patient and understanding guy, so he was happy to walk Gilderoy through everything in as much detail as he needed.  It wasn't surprising, then, that it took a day or so before Gilderoy declared he was sufficiently accustomed to a Linux environment.  It _was_ surprising that he was still struggling with it at the end of the week, with no signs of improvement at all.\n\nWell, it turned out that Gilderoy hadn't really coded much in the past few years; at his old company he'd most recently worked on a database-centric team, not a systems development team, so he was a bit rusty with all the virtualization and low-level stuff.\n\nFine, no biggie, we could have him work on certain parts of our testing infrastructure that mostly involved GUI-based work and that only required very basic Linux knowledge to set up new suites or debug broken tests.  To tweak and tune existing suites would only require a good working knowledge of networking and databases and the ability to use a browser, so surely Gilderoy would have no problems with that.\n\nRelEng still spent a lot of time patiently teaching Gilderoy, but on top of that I was tapped to \"rotate to Infrastructure\" for a few days to give him the New Hire 101 talk on how our database worked and so forth.  This entire time, we were dealing with double meeting loads and lots of interruptions to bring people \"rotating in\" up to speed and help out the \"other team,\" so, as expected, we were much less efficient as two separate \"parallel\" and \"independent\" teams (have I exceeded my sarcasting air quotes limit for this tale yet?) than we would have been if management had left well enough alone.  But they wanted me to rotate and teach him, so that's what I did; damn the team's velocity, full speed ahead!\n\nWell, it turned out the next week that when Gilderoy said he'd done some database development, what he _actually_ meant was that he'd been a product manager for a team that had done database development.\n\nAnd it turned out that when Gilderoy said he'd been a PM for a team doing database development, what he _actually_ meant was that he worked with a bunch of DBAs.\n\nAnd it turned out that when Gilderoy said he'd been a PM for a team of DBAs, what he _actually_ meant was that his team had done a bit of work a few years ago involving Visual Basic and SQL Server.\n\nSo he was a \"database expert\" only in the sense that he had occasionally been in the general vicinity of people who were several training courses away from starting to be vaguely competent with databases.\n\nYay.\n\nBy the end of his third week, Gilderoy was _still_ struggling to make heads or tails of Bash.  RelEng's saintly patience was beginning to fray, and the original 4-and-4 Infrastructure/Utilities split was now a lopsided 5-and-3 split (and an effective 3-and-3 split) since neither RelEng nor Gilderoy were doing real work so we had to move a Utilities person over to Infrastructure to compensate.\n\nAnd both teams, as I'm sure I don't need to remind you, dear readers, were barely making do with a combined seven people _before_ Gilderoy showed up and caused us to be burdened with all that extra overhead, and things weren't looking good for us or for our department with that major deadline looming ever closer.\n\nAlmost a month after Gilderoy appeared, he didn't show up to work one day.\n\n&gt; **Me:** Morning, RelEng.  Ready to bang your head against a wall some more today?  \n&gt; **RelEng:** Actually, I thought I'd start work on that packaging bug today.  \n&gt; **Me:** What, has Gilderoy finally gotten the hang of something?  \n&gt; **RelEng:** No.  Looks like we're going to have an odd number of people for some time.  \n&gt; **Me:** Ah.  And Gilderoy is...?  \n&gt; **RelEng:**  *shakes head*  \n&gt; **Me:** So...someone else is stuck with him, or...?  \n&gt; **RelEng:**  *significant look*  \n&gt; **$Coworker1:** 'Bout damn time!  \n&gt; **RelEng:** I have no idea what you're talking about.  \n&gt; **RelEng:** *smiles innocently*  \n\nA few weeks later, management quietly merged the two teams together again.  The task tracker for the Infrastructure team was locked, meetings were deleted from calendars, and it was never brought up again.\n\n---\n\nGilderoy was the first person I'd ever known to actually get _fired_ from my department, rather than get laid off or leave voluntarily, and to my knowledge remains the only one to this day.  Hiring standards were tightened considerably after that and we've had very few false positives since, and the new interview practices are much less game-able by buzzword-spewing individuals with whiteboard markers and brilliant ideas who claim to be an entire team unto themselves.  Stallman save us from \"rock star\" developers.\n\nComing up next: Dealing with a \"rock star\" developer.",
        "created_utc": 1525256206,
        "upvote_ratio": ""
    },
    {
        "title": "Database Support 13: Embarrassingly Parallel Operations",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ggbew/database_support_13_embarrassingly_parallel/",
        "text": "[removed]",
        "created_utc": 1525256186,
        "upvote_ratio": ""
    },
    {
        "title": "Symbolic links challenges",
        "author": "waka42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gg4bm/symbolic_links_challenges/",
        "text": "I think my brain just melted... Quick Setup:  \n\nWe support an HPC system for a research facility. There's a natural size limit on the home directory, so storages mounted at &lt;several-complex-system-paths&gt; for high I/O stuff, archival purposes, security,... are provided. Symlinks (symbolic links) help the users accessing these folders without interfering with each other and not having to mess with complex system paths. All is well documented and explained in the manual everyone has to read before using the cluster. Additionally every user get's a quick rundown where this is explicitly explained (basically \"just use /home/$user/$symlink-to-secure for secure stuff, /home/$user/$symlink-to-highio for stuff where you expect high I/O to occur, ...\"). You can't get it wrong... was what I thought.\n\nToday this conversation with the frigging head of the HPC users ensued (slightly changed for privacy reasons), who uses this system for years now. I'll call him $record. You'll see why.\n\n**$record:** So if I save my report into /home/$user/$symlink, will my data be stored in my home directory or in $symlink-target?  \n**$me:** It will be stored at $symlink-target, but accessible via the symlink in your home directory.  \n**$record:** So it will be physically stored in my home directory.  \n**$me:** No, it will be stored at $symlink-target.  \n**$record:** So it is NOT stored in my home directory?  \n**$me:** Correct.  \n**$record:** Then why can I see my report file /home/$user/$symlink/?  \n**$me:** Because when you access a symbolic link, it shows you the content of the directory or file the symlink is pointing to.  \n**$record:** So my report will be stored in my home directory, but also in $symlink-target. How does the system synchronise these files then? Isn't that quite a waste of space?  \n\n***$me encounters internal compute errors*** \n\n**$me:** No. Your report will only be stored once, at $symlink-target. It's just easier to list /home/$user/$symlink instead of $complex-system-path. We created these symlinks for all users for this exact reason.  \n**$record:** I understand. So if I save my report into /home/$user/$symlink, my data will be stored in $symlink-target and in /home/$user/$symlink.  \n**$me:** Almost. The report file is physically stored in $complex-sytem-path and $symlink points to that directory so you don't need to worry about complex system paths. You only have to access $symlink to see your report file.  \n**$record:** Ahh. So my report is stored somewhere and also in my home directory. $symlink just internally synchronizes it with $complex-system-path.  \n\n***$me: oh god why...***  \n\n**$me:** ....yes.  \n**$record:** I think this is a waste of storage, though. Why can't I store everything in my home directory directly?  \n**$me:** Because as documented the home directory has a size limit. $complex-system-path has not. The symlink is just there to access it easily.  \n**$record:** Hmm I understand. It's a Cloud storage and I just store everything in my home directory and the system stores it where it's supposed to be.  \n**$me:** That's one way to view it.  \n**$record:** Then how does the system decide where to store my report correctly?  \n\n***$me: internal screaming and twitching eyes***  \n\n**$me:** You decide where to store your data.  \n**$report:** Why would I decide where to store my data?  \n**$me:** So you can decide whether you store your report in a secure place or in a high-I/O as clearly documented in the manual for $system.  \n**$report:** I read that manual.  \n**$me:** Then you should be able to decide where you store your report files.  \n**$report:** But I don't want to waste space, because the symlink has to synchronize the files somehow in the background. Ain't that a bad decision performance wise AND a waste of space?\n\n***$me goes into internal mental breakdown mode while maintaining a straight face***\n\nI eventually got him sorted. After a solid hour of discussing with this record of a person.\n\nTL;DR: Symbolic links synchronize time-space with users, clouds and alcohol.\n\nEDIT: Just to clarify this. This user is using Linux for almost two decades by now.",
        "created_utc": 1525253680,
        "upvote_ratio": ""
    },
    {
        "title": "Having boobs doesn't remove brain cells, I promise",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gfmnq/having_boobs_doesnt_remove_brain_cells_i_promise/",
        "text": "[removed]",
        "created_utc": 1525246558,
        "upvote_ratio": ""
    },
    {
        "title": "You're a boy, so you can solve this, right?",
        "author": "superstrijder15",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gdi0m/youre_a_boy_so_you_can_solve_this_right/",
        "text": "[removed]",
        "created_utc": 1525222969,
        "upvote_ratio": ""
    },
    {
        "title": "In which we discover a locked account has more than one meaning...",
        "author": "starla79",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gd99u/in_which_we_discover_a_locked_account_has_more/",
        "text": "I'm not a true tech support person, but being the security person in charge of the logs, I spend a lot of time working with tech support to troubleshoot issues.  \n\nOne of those issues, one that plagued our organization for a time, was account lockouts.  The powers that be decided to reduce our failed login threshold, which was good, in that it was more secure, but was bad, in that our wireless ISE system was proficient in generating login failures any time a user moved from access point to access point.  This caused people to get locked out when they had effectively done nothing wrong. People would even get locked out after logging into their computers, leading into all sorts of trouble with email and other things.  Eventually they backed off on the threshold while we tried to find a way to make ISE stop generating the failures, but we still had a lot more lockouts than normal to deal with.  Usually, it was the user having the wrong wifi password in their phone, or running a script with their old credentials after changing their password, but every once in a while we had something... or someone... special.\n\nTo facilitate troubleshooting persistent lockouts, I had created a couple of queries in our logging system that tech support could use for troubleshooting, but inevitably i was called to assist pretty much every time.  TS will be tech support, Me is yours truly and *this* is everything going through my head.\n\n&gt;TS: \"This user keeps getting locked out, Joe Tech unlocked her account several times this morning but it keeps happening.  We can't figure out why.\"\n\n&gt;*Okay, I'll play your game.  I pull up my query and filter for her username.  No lockouts.*\n\n&gt;Me: \"Sorry bud, her account isn't getting locked out.  Why is Joe Tech unlocking her account when it's not locked?  You can see that in AD when you look at the account, it tells you right there if it's locked out.\" \n\n&gt;*If a tree falls in an active directory forest but no one's around to unlock it, does the user still make a sound?*\n\n&gt;TS: \"But she keeps saying it's locked and we don't know what else to do.\"\n\n&gt;*Of course.  Keep unlocking it even though it's clear from the logs and from AD that her account is not in fact locked out. Isn't that the definition of insanity...*\n\n&gt;Me: \"You do realize that's the definition of insanity, doing the same thing over and over and expecting a different result?\"\n\n&gt;TS: \"Yeah, but can you fix it?\"\n\n&gt;*if i could fix stupid i wouldn't be working here...*\n\n&gt;Me: \"This is beyond my ability to troubleshoot remotely and it's not ISE.  She's not getting locked out.  Next time she calls saying it's locked, send someone over to look at the error message, since she obviously can't take a screenshot and email it at that point.\"\n\n&gt;TS: \"Will do.\"\n\nExcellent.  Now we wait.\n\nAbout a half hour later, another techie rolls up to my desk, grinning from ear to ear.\n\n&gt;TS2: \"You're not going to believe this.\"\n\n&gt;Me: \"Try me.\"  \n\n&gt;*god i love the smell of of vindication early in the morning*\n\n&gt;TS2: \"So she calls us after she locks her account out again.  I stopped by her desk, and she showed me this.\"  He reaches over and locks my computer.  \"See?   She was letting her system idle until the screensaver locked it, and when you hit a key to turn off the screensaver...\"\n\n&gt;Me: \"It shows a lock, and says the account is locked.\"  It hits me.  \"She thought that that meant her account was locked out?!?  She never even tried to put in her credentials?\"\n\n&gt;TS2: \"Not so loud, she made me swear to not tell anyone.\"\n\n&gt;Me: \"Her secret is safe with me.\"  \n\n&gt;*Not.* ",
        "created_utc": 1525220672,
        "upvote_ratio": ""
    },
    {
        "title": "A repair that I'm really proud of!",
        "author": "WillyWonkaTheFearful",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gc3ja/a_repair_that_im_really_proud_of/",
        "text": "TL;DR I repaired a motherboard and am really proud of it!\n\nSo I'm making this post because I don't have a lot of techie friends but I'm just super psyched and had to tell someone.\n\nI work at a small, locally owned computer repair shop (we have three employees), and I've been here for almost three years. I received all of my technical training here, so I have no formal training what-so-ever. Over the last year, I've been slowly teaching myself about board-level repairs, mostly on MacBooks. I've managed to pull off a few repairs, but after completing them I still felt like I had a lot of questions and wasn't sure if I had just been lucky enough to stumble across the solution. This time, however, I can confidently say that I figured it out entirely due to my knowledge of board-level repair!! Here are some pictures for reference. \n\nhttps://imgur.com/a/pBO7Q2M \nNow, here's the story :)\n\nA customer brought in a MacBook Air that seemed to charge fine (the light on the adapter would go from green to orange), but it wouldn't turn on. The tech checking it in poked around a bit, but couldn't really find anything, so he left it for me to look at later. When I got my hands on it, I tried resetting the SMC and that worked fine, but it still wouldn't turn on. Next up I went to test each power rail to see if they were all reading what they should, so I disassembled it to have the bare motherboard on my desk. I pulled up the schematic pdf and the boardview on my computer to find where to test each rail, then hooked it up to the adapter. The first one I went to check was PPBUS_G3H, one of the more important rails that is always on whenever the computer is on power, and noticed that the area where I was touching was hot! I felt around a little bit and was almost burned by the problem component! It was a tantalum capacitor that was part of the circuitry providing the 3.3V and 5V rails power, and it had the word CRITICAL right next to it on the schematic. I immediately disconnected the adapter. When I looked closer, I noticed that the thing was even cracked! I then went into our parts closet to see if we had any donor boards, and we didn't. So I just got another MacBook Air board that seemed close in age to the one I was working on and carried it back to my desk. I pulled up the schematics for this board as well and found the page describing the same circuitry as my problem component, and there was one exactly the same! I identified it on the board, double checked the polarity of each of them, then went to the rework station and swapped them out. The swap went without a hitch, which I think is pretty cool considering I did it with just a heat gun (not even a rework station, we don't have a lot of money around here), tweezers, and a syringe of flux! I took it back to my bench, cleaned off the flux and, lo and behold, it worked perfectly!\n\nAll in all, very customer, very happy tech :) \nThanks for reading!\n\n(Edit: Formatting)",
        "created_utc": 1525210242,
        "upvote_ratio": ""
    },
    {
        "title": "The Tech Support Aura works on everything!",
        "author": "trainbrain27",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gbxpu/the_tech_support_aura_works_on_everything/",
        "text": "LTL, FTP, HTTPS (Helping To Transport Poo Scoops)\n\nI'm a school tech, so most of my support calls are along the lines of \"I didn't do anything [other than try to circumvent the filter] and it broke!\" Outside work, I do a little bit of everything. \n\nToday, I got a call that a user's peripherals weren't powering up.  These peripherals are large and agricultural, but they follow the same rules as everything else. There's two, but only one port, so I asked him if he made sure the correct cable was plugged in on both ends and it was turned on. He said he had tried that FIVE TIMES and nothing worked.  I plugged in the baler, and it worked, then the planter, and it worked. I rebooted a hundred horsepower of $Kumquat to test.  \n\nHe blames \"magic\" but may have skipped some troubleshooting steps when the new tractor didn't do what he wanted.\n\nThe user is my father.  People assume that I can fix anything with wires, and I let a few of them get away with that. Right now, I'm going to fix a track light that isn't lighting.  Six credits of Electrical Engineering should come in handy :)\n\n",
        "created_utc": 1525208933,
        "upvote_ratio": ""
    },
    {
        "title": "HR Strikes Again",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gbeqk/hr_strikes_again/",
        "text": "Maybe some of you recall my [previous work](https://www.reddit.com/r/talesfromtechsupport/comments/8eudmq/is_this_the_krusty_krab_no_this_is_patrick_i_am/) with the HR department, and how they filter all IT emails.  Today, one HR user called in for support.  Submitted for for approval for TalesFromTechSupport, \"The Tale of the Skype Profile Photo\"\n\nTech: This is the XYZ Help Desk, *proceed with gathering initial information*  \n*User wants to update their profile photo for Skype for Business and Outlook*  \n*User is in HR - our ticketing system lists what department they're in, and after the lunacy of that last post, you know what kind of people work in my company's HR department*  \n*After verbally attempting to instruct the user with changing her profile photo and being unsuccessful, we get a remote session.  It's on the Online Web Access for Outlook login page*\n\nTech: OK, so we're logged in.  Do you already have a photo in mind that you want to use for your Skype/Outlook picture?\n\nUser: Oh yes.  I just came back from a cruise with my boyfriend and there's a picture I want to use...*continues talking about the cruise and unrelated information*\n\nTech: OK, great.  *Clicked the Upload Photo button.*  Please browse the photo you want to use.  \n*User complies and the photo is uploaded*\n\nUser: That doesn't look right though.\n\nTech: Is that the photo you selected?\n\nUser: Yes, but the top of my head is cut off.\n\nTech: Can you show me the photo?\n\nUser: It's right there.  Can't you see it?\n\nTech: I mean, where is it on your computer?  Downloads?\n\nUser: No, it's in Pictures.  *sigh*  Here, let me show you.\n\nTech: OK, the photo you're showing me ends at about the middle of your forehead.  Is this the original photo or a cropped version.\n\nUser: No, this is the photo.  Can you scroll up a bit?\n\nTech: As I mentioned, this is the top of the photo, there's nothing more to scroll up.\n\nUser: No, there is.  You know like how on Google Maps, you can view all around.  How can we do that here?\n\nTech: You can't, this is just a photo.  Google...\n\nUser: What do you mean, you can't?  Of course you can.  Here, let me show you.  \n*User goes to Google Maps, drops the little man on the street, and scrolls around the 360 street view.*  \nSee?  Now, how can we do that with the photo so the top of my head isn't cut off?\n\nTech: Google uses multiple cameras to generate those 360 degree views.  You can't do that with the photo you took.\n\nUser: I took it with my iPhone, they have those video pictures.\n\nTech: Was this photo taken as one of those video pictures?  \n*Considering making a drop by the user's desk to capture the screen if it's a video and use that as the picture not cutting off her forehead*\n\nUser: No\n\nTech: Then, this is the picture you have, and we can't scroll up on this picture.\n\nUser: You obviously don't know what you're talking about.  You're not a very good tech.  *Speaking in a way where both of these sentences sounded like questions.*\n\nTech: If you have another picture, we can use that.\n\nUser: No, I want to use this picture because it shows the line of chairs down the deck from me.\n\nTech: We can use the photo, it's currently set as your Skype photo.\n\nUser: But it's cutting off the top of my forehead.\n\nTech: Yes, the photo clearly stops there.  There's no more photo, that's it.\n\nUser: You should be able to scroll around it.\n\nTech: It's just a photo, it can't do that.\n\nUser: *whining*  Yeeeeeeees, it caaaaaaaaaan.  I want this photo as my Skype photo framed properly.\n\nTech: Your photo has been set.  If you can find another photo to use, we'll be happy to set that for you.\n\nUser: I'm going to call back and get someone who knows what they're doing.  \n*click*",
        "created_utc": 1525204732,
        "upvote_ratio": ""
    },
    {
        "title": "I overly amused myself, writing up this ticket.",
        "author": "mama2dogs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8gatwc/i_overly_amused_myself_writing_up_this_ticket/",
        "text": "[removed]",
        "created_utc": 1525200378,
        "upvote_ratio": ""
    },
    {
        "title": "Uptime correlates exclusively with the cost of your hardware",
        "author": "while-1-sleep",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ga6gm/uptime_correlates_exclusively_with_the_cost_of/",
        "text": "The [story of management who wanted to buy expensive hardware](https://www.reddit.com/r/talesfromtechsupport/comments/8g9b03/only_25k_for_a_server_lets_get_the_100k_version/) reminded me of another story from the same company I mentioned previously. It was the 90s, and I was a software developer building a website. Although I wasn't tech support, the role still gave me ample opportunity to observe many of the foolish things that happen around tech.\n\nIn this company, there was an IT department that was responsible for maintaining systems. Other departments paid them for setup, support, and hosting servers, but had no authority to insist on timely resolutions. The prices were high and the service was bad, but other departments had no choice but to go through internal IT.\n\nMy manager ordered hardware to run the website. We got a shiny new Sun, despite my recommendation for Linux. Uptime was important, and you only get it with tried and true big vendors! So we got another Sun which did nothing but mirror the first, and a switch to flip over to the second if the first went down. Both the machines had RAID. Uptime was really, really critical! I suggested that if they were serious about uptime, they might want to consider getting a UPS. However, we didn't have any budget left, due to the expensive decisions that had already been made. It took several weeks to get the system set up, because of the IT department's inherent laziness.\n\nDuring the time I worked there, we never had a disk failure, and we never switched over to the backup machine. But we also never had a power outage. We did, however, have lousy uptime.\n\nThe reason? Our internet connection was not especially reliable, and would drop a couple of times a month. Although the IT department theoretically had someone on call 24/7, nobody would pick up the phone after hours. If the internet went down at 4:00 in the afternoon, it wouldn't be back until midday the following day. Unless it was a Friday, in which case it would be back on Monday. Unless Monday was a holiday... We easily had 3+ days of downtime every month.\n\nTL;DR: Spending lots of money on hardware is pointless if you can't enforce an SLA for your internet connection.",
        "created_utc": 1525195331,
        "upvote_ratio": ""
    },
    {
        "title": "Only $25k for a server? Let's get the $100k version - it's bound to be more reliable! If only we knew how to use it...",
        "author": "Universal_Binary",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g9b03/only_25k_for_a_server_lets_get_the_100k_version/",
        "text": "Scene: I was working in IT in the early 2000s.  I had cleaned up the company's core network (getting rid of the 10Mb **hubs**) and now the company realized it was time to tackle the big enchilada: the ERP system.  \n\n**The setup, in which stupid decisions are made**\n\nThis system was critical.  Through it ran all the company's financials, HR, shipping, parts processing, etc.  And I promise I am not making this up: it quite literally ran on a system that was the size of a washer/dryer set and was so old it didn't even support ASCII.  A steady parade of tech (well, ONE tech that still understood it) came by to service the line printer, the tape drive, etc.  \n\nA committee for evaluating replacements was formed.  After sitting through presentations by various sleazy ERP salespeople, a product was duly chosen.  As \"luck\" would have it, the consultants that sold and installed $PRODUCT also sold and installed hardware.  And the company's hardware they sold: IBM.\n\n$CONSULTANTS duly produced a quote for a $25,000 server.  It was nothing special, a regular rackmount job with RAID.  The sort of thing that one would have gotten for $10,000 or less from Dell or HP.  It was going to run Linux.  I knew Linux, but thought we were getting ripped off.  Cue conversation at a committee meeting which somehow I managed to attend:\n\n&gt; Me: I'm concerned about the price.\n\n&gt; $Manager: I know.  Can you really get quality for only $25,000?\n\n&gt; $VP: Right!  Our last server cost over $200,000!\n\n&gt; Me: We could have the same for $10,000.\n\nConsultant sees his boat going down the toilet and gives me the evil eye.\n\n&gt; $Manager: What if we got two?  Then we'd have a backup.\n\nConsultant starts to look excited.\n\n&gt; $VP: That's still only $50,000.  Are we sure we're not buying something so cheap it's dodgy?\n\nConsultant starts to look VERY excited.\n\n&gt; $Consultant: You know, we're an IBM reseller.  We could sell you an AIX box.  It's like what you're used to.\n\nConsultants duly provide a quote.  The clearly put everything they possibly could into it, plus a generous profit margin.  $80,000.  Managers are STILL concerned that it's too cheap.  So they add a separate \"disk expansion shelf\" (read: proprietary JBOD) to bring it up to $100,000.\n\n&gt; Me: Nobody here knows AIX.\n\n&gt; $Consultant: You're good with Linux.  We'll train you.  For free even!\n\n&gt; $VP: That's a great deal!  Where do we sign?\n\nWhich would have been fine, if $Consultants actually had anyone that knew AIX.\n\n**The plot thickens**\n\nThe AIX equipment duly arrives, followed by a consultant to do the install.  This isn't the salesguy consultant, this is the nerdy consultant.  I'll call him FreshPrince because he was always talking about his favorite TV show, the Fresh Prince of Bel Air, only FreshPrince was the opposite of Will Smith.  In EVERY way.\n\nOf course, by this point, management is nowhere to be seen so it's FreshPrince and me.\n\n&gt; FreshPrince: So I'll just install this then.\n\n&gt; Me: Great.\n\nI busy myself with the tasks of the day.  FreshPrince makes grunting noises as he struggles with the latch on the rack door, the rails, the server, the power, the install CD-ROM...   After much effort, and a few calls to tech support, he seems to have managed to configure something or other.\n\n&gt; FreshPrince: I'm all done.\n\n&gt; Me: You haven't asked me about the printer setup.  $Application needs printer access.\n\n&gt; FreshPrince: Oh!  Uh.  Right.  So, uh, tell me about these printers?\n\nI give him some information.  Correct, even.\n\nMuttering ensues.  For hours.\n\n&gt; Me: So how's it coming?\n\n&gt; FreshPrince: Would you believe it, they redid how they do printers in AIX 5!  On AIX 4, it was, uh, somewhere else, and you have 5.  I can't even find where it is in the menu!  Hahaha!\n\n&gt; Me: You've spent all afternoon not configuring the printers?\n\n&gt; FreshPrince: Oh don't worry, I've got a hotel room, I'll be back tomorrow!\n\nHilarious...\n\n**The amber lamp of doom**\n\nEventually I -- not FreshPrince -- set up the printers, the application is duly installed, migrations occur, rejoicing happens, consultants leave, more rejoicing happens, etc.\n\nThen one day, the amber lamp of doom shows up on the system.  WTF is this?   Through various phone calls and twisty little menus, all alike (shoutout to smitty for any AIXers out there), we arrive at the conclusion: a disk in the RAID has failed.  (For about the 20th time that week, I was again thinking \"this would have been so much simpler on a $10k Linux box\")  IBM duly dispatches an engineer with a hard drive.\n\nEngineer arrives.\n\n&gt; Engineer: Which drive is bad?\n\n&gt; Me: Heck if I know.  It took me two hours just to find out that the problem is a bad drive.\n\n&gt; Engineer: I can't replace the drive unless I know which one.\n\n&gt; Me: I was sorta hoping you could figure that out since you're from, you know, the people that made this thing.\n\n&gt; Engineer: That's not my job, but as a favor to you, I'll see what I can do.\n\nEngineer calls support.  An hour-long conversation involving many more twisty little menus ensued, while I eavesdropped and took notes for the future.  Eventually the defective drive was identified and replaced.\n\n&gt; Engineer: All done.  Sign here.\n\n&gt; Me: The amber light's still on.\n\n&gt; Engineer: It's supposed to do that.\n\nI HATE IT when they say that.\n\n&gt; Me: That light was never on until the drive failed.\n\n&gt; Engineer: I know.  You have to reset the lamp.\n\n&gt; Me: How?\n\n&gt; Engineer: I don't know.  Sign here.\n\n&gt; Me: Also, there's no activity on the new drive.\n\n&gt; Engineer: You have to trigger a RAID rebuild.\n\n&gt; Me: I hesitate to ask, but... how?\n\n&gt; Engineer: I don't know.  Sign here.\n\nMultiple escalations occur at this point, since nobody in AIX support has any idea how to repair a degraded RAID.  Eventually, some hours later, the magic smitty incantation is produced, the RAID is rebuilt, and the Amber Lamp of Doom extinguishes.\n\n**Epilogue**\n\n2 years later, I managed to convince management to let me build a $10k Linux box.  User complaints were way down after that because it was much faster and -- yes -- more reliable.\n\n&gt; $Manager: Wow, technology is so amazing!  Two years ago, we had to pay 10 times as much for this!\n\n&gt; Me: ...\n",
        "created_utc": 1525188575,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from Aircraft Maintenance: Code Brown",
        "author": "ITSupportZombie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g8tvs/tales_from_aircraft_maintenance_code_brown/",
        "text": "Many years ago, I was an Air Force avionics technician. I had some very interesting experiences while in uniform, some of them I can even share with all of you.\n\nIt was a beautiful warm day, the moose calls of C\\-17’s refueling could be heard all across post. I was relaxing on an especially long refuel when a call on the radio interrupted my wandering mind, thinking of all the places that I could be that aren’t here. An In\\-Flight\\-Emergency \\(IFE\\) was called. No details, just that the emergency was called. All refuel operations were stopped along with all non\\-essential activities. With this call, everyone on shift and several of the guys coming on shift that were at work scramble an emergency tow crew and response team, orders are being shouted on the radio directing people for recovery.\n\nWith the bird on approach, we get another call. Medical emergency. This is bad. Potentially really bad.\n\nThe jet lands and taxies normally. As it parks on the spot we swarm the jet ready to respond to any emergency.\n\nI walk onto the jet and catch a horrible smell. Like fermented death and curry. As I climb up to the flight deck \\(don’t ever call it a COCKpit\\), the smell gets worse. Once I was standing behind the pilot’s seat, I think I am going to be sick. The pilot, copilot, the relief pilot and one of the loadmasters have all “soiled” themselves uncontrollably and repeatedly on a 6 hour flight.\n\nThey also had a widespread electrical issue that was the cause of the IFE. Two twelve hour shifts later in an unimaginable stench, we discovered a failing circuit breaker was the cause of intermittent partial power loss.\n\nEdit: I forgot to mention that we had to change the Pilot, Copilot and 2 auxiliary seats.  Months later when the jet passed through, it still had that funk.",
        "created_utc": 1525184680,
        "upvote_ratio": ""
    },
    {
        "title": "\"Delete my profile\" - OK",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g8ias/delete_my_profile_ok/",
        "text": "[removed]",
        "created_utc": 1525181887,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes it's not just the clients you need to watch out for.",
        "author": "Stoned420Man",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g8fvm/sometimes_its_not_just_the_clients_you_need_to/",
        "text": "So this happened all of 5 minutes ago and I currently waiting on the repercussions (thankfully I work with some understanding people - or at least, I hope I do).\n\nLast week I was sent to complete my MTCNA (Mikrotik router accreditation), which I passed. Today has been a quiet day in the office and with not much to do, I thought I would reinforce my newly learned skills and play around with one of our old 751G's.\n\n\nI connected it up to my laptop eth0 port and up the device popped in winbox. Logged in via MAC connection and noticed there was an old config on there. Never to mind, I thought. Lets wipe the config...\n\nIt resets, I connect back in and go to view the wlan0 interface to configure it to our office WiFi so I can have internet while I work on the router, but there is no wlan0 interface. Odd, I thought, but whatever. I keep poking around, maybe it is just not showing up since I set it not to get default config. I check the full interface list. For some reason there are 24 eth interfaces and 2 SFP interfaces. wtf? so weird. Why does this little 5 port router think that it's a cloud router. Then it hits me: This is the office router, I just wiped it completely clean. No config export. No backup. Nothing. Fuck.\n\nI have since messaged my manager and boss and they are not super happy about it, but I think they will not blow up too much at me. They are level headed people.\n\nLooking at it, I can see where I went wrong. I had my eth0 interface on my laptop disabled and thereofre never saw the connected 751G and defaulted through the wireless network to our cloud router. I just happened to guess the right password for it and didn't check the MAC address was matching before wiping it.",
        "created_utc": 1525181247,
        "upvote_ratio": ""
    },
    {
        "title": "Yes that is a program...",
        "author": "a_leprechaun",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g3q2m/yes_that_is_a_program/",
        "text": "Our company has a number of customer support reps that work from home and while great with customers aren't necessarily technologically savvy. One in particular from today was a very nice lady, but older and can barely use the computer that is essential to her job.\n\nLast week it came time to replace her computer (that was already old when assigned) for a newer one. Setup of new CSR machines are pretty simple since they basically use only 2 programs: One is their phone application that connects to our call service, and the other is chrome. Everything else (including email) is accessed online.\n\n&gt; $me: Just to double check, are there any other programs you need on your new machine?\n\n&gt; $CSR: I don't know how to install anything so I only need what you guys put on the last one\n\n&gt; $me: And you have all the information and documents you need saved to google drive?\n\n&gt;$CSR: I have some things saved in my email - am I going to have to set up a new email account?\n\n&gt;$me: No that's fine, once you log into your email on the new computer everything will still be there for you.\n\nI proceed to setup the new machine for her, she comes in today after the weekend to pick it up and drop off the old one.\n\n&gt; $me: Do you want to hang out and check to make sure I got everything set up correctly for you? That way if there is an issue I can fix it for you right now?\n\n&gt;$CSR: No, I'm parked illegally so I shouldn't stay long! I'm sure it's all fine! Bye!\n\nOf course two hours later I get a call from her:\n\n&gt;$CSR: I thought you said you set up the computer for me! None of my information is on here!\n\n&gt; $me: Remember you saved all of your information to your google drive? You'll just need to open chrome, log in, and it will all be exactly the same way you had it.\n\n&gt;$CSR: But I don't know my login information! I had it saved in my email but I can't find the email on this computer.\n\n&gt;$me: *(not sure why she has her login info stored in her email but leaving that alone for the time being)* Okay, well then you can just go to [emailserver].com and login and you'll have access to your emails just like before.\n\n&gt;$CSR: No, no, no, I mean I can't find the email on the computer itself. I always used the computer's email not the internet's email - it never had me login so I don't know how to do that!\n\nWe do give our employees the freedom to use a couple different email clients if they choose via POP3/IMAP but that was far beyond what this particular user could have figured out.\n\n&gt;$me: Okay, do you mean you were using outlook before? Did someone set that up for you when we gave you the old machine?\n\n&gt;$CSR: I don't know - my brother was in town when I started so I just gave the computer to him to figure out and he showed me which buttons to click.\n\n&gt;$me: *eyeroll* Okay, sorry about that, you didn't mention that you needed that program.\n\n&gt;$CSR: Well email isn't a program.",
        "created_utc": 1525129041,
        "upvote_ratio": ""
    },
    {
        "title": "It must be the hackers!!",
        "author": "superflu998",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g3klx/it_must_be_the_hackers/",
        "text": "[removed]",
        "created_utc": 1525127715,
        "upvote_ratio": ""
    },
    {
        "title": "Yes that would qualify as information you need...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8g3gwv/yes_that_would_qualify_as_information_you_need/",
        "text": "[removed]",
        "created_utc": 1525126843,
        "upvote_ratio": ""
    },
    {
        "title": "Just spent 2 hours on the phone trying to find out if I can get an ipv6 address.",
        "author": "ChymeraXYZ",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fz6og/just_spent_2_hours_on_the_phone_trying_to_find/",
        "text": "[removed]",
        "created_utc": 1525092471,
        "upvote_ratio": ""
    },
    {
        "title": "Feedback from a user about a App",
        "author": "jalamanta101",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fy1ct/feedback_from_a_user_about_a_app/",
        "text": "[removed]",
        "created_utc": 1525077894,
        "upvote_ratio": ""
    },
    {
        "title": "Why won't you help your old friend?",
        "author": "annonymous2",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fwqhl/why_wont_you_help_your_old_friend/",
        "text": "[removed]",
        "created_utc": 1525060075,
        "upvote_ratio": ""
    },
    {
        "title": "Your password can be very complex, but it won't help",
        "author": "Loko8765",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fubtk/your_password_can_be_very_complex_but_it_wont_help/",
        "text": "[removed]",
        "created_utc": 1525036106,
        "upvote_ratio": ""
    },
    {
        "title": "The Talk",
        "author": "revchewie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fs8xp/the_talk/",
        "text": "[removed]",
        "created_utc": 1525017917,
        "upvote_ratio": ""
    },
    {
        "title": "The moment that elevated mum from $user to $admin",
        "author": "tan_iel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8frnl5/the_moment_that_elevated_mum_from_user_to_admin/",
        "text": "Hey TFTS. LTL;FTP.\n\n\nLike most of you here, I too have parents whom are largely tech-illiterate. but over the last two years, I've been making a conscious effort to get my parents (especially mum) to understand computers better. \n\n\nI'm a big believer of the ol' *give a man a fish, and you'll feed him for a day, teach him how to fish, and he can have food for life* mentality. So rather than showing mum how to resolve her every problem, we go through a process of:\n\n\n* *what do you think is wrong?* \n* and *how are you going to solve it?*\n\n\n\nNow admittedly, things do get incredibly frustrating in this process, and it can often take ~1/2 hour up to 1 hour to resolve issues. **BUT**, it has slowly been working.\n\n\n\nSo today, mum came to me with a problem, and as usual, seemed to blow it way out of proportion.\n\n\n\n&gt; $mum: My phone is broken.\n\n&gt; $me: What do you mean?\n\n&gt; $mum: The camera doesn't work.\n\n&gt; $me: What do you mean exactly?\n\n&gt; $mum: When I go to the camera app, it says *connection cannot be establised*\n\n&gt; $me: So have you tried anything to resolve it? (*insert smirky face*)\n\n&gt; $mum: I turned it off and on again. But that didn't work.. \n\n&gt; $me: uh huh.\n\n&gt; $mum: So then I booted the phone into recovery mode. \n\n&gt; $me: (*cue disbelief*)\n\n&gt; $mum: And then I wiped the cache partition.\n\n&gt; $me: (*sustained disbelief*)\n\n&gt; $mum: But when I rebooted the phone, it still didn't work. So I thought the problem might be larger than that. \n\n&gt; $me: ... \n\n&gt; $mum: So I went onto several forums, and a lot of other people describing similar problems said it turned out to be a hardware fault.\n\n&gt; $me: How the hell did you know how to do that? \n\n&gt; $mum: I googled it. \n\n&gt; $me: (*cue jaw drop*) So..I guess your phone is broken.\n\n&gt; $mum: Yeah. That's what I told you in the beginning.\n\n\n\nThis is the same person whom two years ago didn't even know how to use the volume buttons on her phone - now troubleshooting all on her own... \n\n\nMum, I am so proud of you. You've now been granted admin privileges.",
        "created_utc": 1525012152,
        "upvote_ratio": ""
    },
    {
        "title": "The people on the television won't stop laughing at me...",
        "author": "forlornhero",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fr2zp/the_people_on_the_television_wont_stop_laughing/",
        "text": "[removed]",
        "created_utc": 1525005326,
        "upvote_ratio": ""
    },
    {
        "title": "Gaming Laptop: 10 Best Gaming Laptop Reviews &amp; Buyer Info",
        "author": "funkeyl",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fqcai/gaming_laptop_10_best_gaming_laptop_reviews_buyer/",
        "text": "[removed]",
        "created_utc": 1524993853,
        "upvote_ratio": ""
    },
    {
        "title": "If a hole exists someone will fill it",
        "author": "twilighteclipse925",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fpum8/if_a_hole_exists_someone_will_fill_it/",
        "text": "[removed]",
        "created_utc": 1524985558,
        "upvote_ratio": ""
    },
    {
        "title": "a Big Bank nearly cut by Hanlon's Razor",
        "author": "harrywwc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fprv4/a_big_bank_nearly_cut_by_hanlons_razor/",
        "text": "I alluded to the following at the bottom of [this](https://redd.it/8f9x2z) tale. Please note, the dialogue is not verbatim, but close enough to the story as (a) I remember it and (b) as I am telling it.\n  \nIt was very early the 21^st Century, and I was working for a(nother) multinational - this one based out of Europe, and specialising in First Generation Internet Banking (IB) software. In fact, it is where I found my passion for Web Application Security and Hacking - which led me a few years later to teaching that topic (among others) at a Technical College, and contributing a little here and there to some other research in the area. But I digress.\n  \nThis incident was reported to me by the BigBankingCustomer people that I had 'won over' (won back?) in my previous tale (above). We now had a mutually high level of trust, and things were pretty well \"back on track\" as far as the relationship went. Oh, btw - I did spend some more time on site with them when we had a \"major upgrade\" to the software (Java client, Windows Web Server front end and my UNIX^TM server middle). I was blown away by their entirely separate 'copy of the Internet' in their test centre - it was limited in where you could go, but it was an amazing little data centre for testing their entire suite of software - including our IB software - in a \"real world\" environment.\n  \nWell, when I say the \"*incident was reported to me by the BBC*\" - that's not quite true. They had another issue; one I couldn't reproduce on our test system (too small, no where near enough transactions per minute) so I asked them to send me their log files.\n  \nThey did. Burned to a CD-ROM. Sent by snail mail. With no protection (well, a piece of cardboard). Not even \"sign on receipt\".\n  \nSo, I pop the CD in, and start trawling through the log file. I thought \"hmmm... I wonder if my banking id number is in here?\" It was.\n  \nI then I noticed something that sent a chill down my spine.\n  \nSeveral lines later, my password was there - in plain text - for all (where \"all\" is defined as \"me\" in this particular instance) to see.\n  \n\"Oh $#!+!\" I thought. I don't think I said it with my 'outside voice' - but I may have.\n  \nI called my lead tech contact at BBC and asked them if they had an account with their employer, and if they used the IB system?\n  \n\"yes\" and \"yes\" - followed by \"why?\"\n  \n&gt; Me: what's your banking id?\n&gt; Them: 123456789 [obviously _not_ the real number]  \n/me does quick grep of file - and bingo! Look a couple of lines down...  \n&gt; Me: is your password \"abcdefg\"? [again, not the _real_ password - what kind of a schmuck do you think I am? ;) ]\n  \nsilence...\n  \n&gt; Me: hello?  \n&gt; Them: how did you get that info?  \n&gt; Me: you gave it to me?  \n&gt; Them: no, I didn't.  \n&gt; Me: yes you did. You sent me the logs on CD last week. They're all there, in plain text.  \n&gt; Them: $#!+!   \n(they may have actually said an anagram of \"**F**rench **C**onnection **U**nited **K**ingdom\" - it's a while back)\n  \n&gt; Me: I am going to release an \"Emergency Mandatory Patch\" next week - as part of the install script we will backup and encrypt the old log files with a user-entered password, erase the logs, and then start writing new logs with obfuscated passwords. I will get back to the [original problem] after that.\n  \nI did.\n  \nNow kiddies, let's talk about \"responsible disclosure\". I could have trawled through the log files and picked up hundreds of userid / password pairs and tried them on the live system to \"check that they worked\". And this is the sort of thing that some have wound up in gaol for (or are facing some serious time). If by checking something, and you are pretty sure your suspicions are confirmed, then it makes no sense to do it another hundred or so times to \"make sure\". You already *know*. Especially after two items are confirmed as \"real\", there is no need to iterate through another hundred, or two. \n  \nit worked for *n*, and it worked for *n+1*, there is no need to test for *n+2..1000* (or more).\n  \nFortunately, the Europeans had done a good job of architecting the logging of this system, and so there was only one place I needed to make a change, so that whenever the password was about to be issued to the log file, a string of \"********\" was sent to the logfile. Yes, the password was still in memory - but it was required as it was being sent to the BBC's Big Iron via a message queueing system, where the _actual_ account details resided.\n\nI passed the same patch to my team mates looking after other banking institutions, and passed the fix back to Europe so they could roll it out to all the other customers across the globe. In less than a month my mandatory patch had been applied many many times across many financial institutions. Of course, having worked for |a|n|a|l|o|g| the previous century (before they were gobbled up) it was not my first 'global rodeo' ;)\n  \ntl;dr - massive security leak averted by eagle eyed (newbie) C-programmer - shares his ~~joy~~ horror with BBC colleague - and then around the world.\n\nedit: formatting {sigh}\n\np.s. yes, I did fix the originally reported problem - from memory it was a memory leak, and I just needed to release an object when it was no longer required (no garbage collection in C).",
        "created_utc": 1524984374,
        "upvote_ratio": ""
    },
    {
        "title": "a 20 minute job - 4 hours later. one of the best IT stories of my life.",
        "author": "Elfere",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fpi2n/a_20_minute_job_4_hours_later_one_of_the_best_it/",
        "text": "[removed]",
        "created_utc": 1524980358,
        "upvote_ratio": ""
    },
    {
        "title": "This has been happening for over a year",
        "author": "votekick",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8forw5/this_has_been_happening_for_over_a_year/",
        "text": "Just a short story that has been happening to one of our clients which we've had to escalate to Microsoft because *sigh*.  \nWe do free support from time to time for a not for profit. All the Ad Hoc troubleshooting/advice we don't charge for to be nice. They're good people and I personally have no issue with this.  \n***  \nMost of our clients are on Office 365 for email based on the fact they're either small or are not always working from their office.  \nLast last year I remember them asking me how to setup calendar sharing so they could see each others calendars. I set the calendar permissions and opened their calendars and they were happy.  \nNot long ago, someone in our office discovered they initially tried this using delegate access. \n\nDelegate access is probably best for giving a PA control to accept or decline invitations as well. Sadly it's usually the first thing to come up when you Google how to share calendar Outlook. But what we discovered is that the delegated permissions were \"stuck\" for the lack of a better term. We all had a think about it and looked for PowerShell fixes but nothing useful came up.  \n\n&gt; Boss: Guess I'll open a ticket with Microsoft.  \n\nTo cut a conversation short, they didn't understand.  \n&gt; **Boss** (hangs up): VK, can you do a remote session with both users and do a screen capture of what's happening? Microsoft will call to follow up early next week.  \n\n***  \nSimply put:  \n**$User1** has access delegated to her, which means when **$User2** receives a meeting invite she sees the alert too which privacy etc etc.\nThe permission change didn't just take up to an hour to apply since we gave it 2 days just in case Office365 was just being super slow.\n***  \nI call $User1 and explain what we're doing and she's happy to get it fixed. I take a moment to hide anything that shouldn't be seen by outside eyes start the capture, send a test invite, it appears then I go into the settings and show that delegate access is completely blank. \n \n\nDid I mention they're Mac users? I feel that may be worth mentioning.  \n\n&gt;**VK**: Alright thanks for that, can you put me onto $User2 and I'll do the same thing with her?  \n**$U1**: Oh she's not in the office today, she's working from home.  \n**VK**: Can you give me the best contact number, so we can get what we need for when we get back in touch with Microsoft?  \n**$U1**: Her mobile number is $numbers.  \n**VK**: Thanks I'll give her a call now.  \n\nI try to finish up the call.  \n&gt;**$U1**: Is there anything you can do to disable it in the meantime?  \n**VK**: Not that we've been able to find. That's why we're escalating to Microsoft we think its something in the back end they might need to do to manually trigger that setting to update.  \n**$U1**: Well this is very frustrating because **this has been happening for over a year now**.  \n\nThere's what I want to say and what I actually say. I face palm and turn to my colleague who looks at me expecting me to ask a question.  \nI make direct eye contact and answer her.  \n\n&gt;**VK**: I'm sorry to hear that this issue has been happening for *over a year* I personally only found out about it today.  \n\nTHIS time I finish up the call and hangup.\n\nI call $User2, leave a voicemail. She calls back in the afternoon we do a similar process and I reply to the email Microsoft sent with the ticket number asking for a call back.  \n\n***  \n**TL;DR**  \nI'm sure there's a great quote about inaction not being acceptable but some people just don't think.  \n***  \nThere is no ending to this story just yet as we're waiting for a technician to run \"some back end scripts\". When it is resolved I can't imagine it'll be worthy of a story.",
        "created_utc": 1524971108,
        "upvote_ratio": ""
    },
    {
        "title": "Some thoughts are only for INSIDE your brain",
        "author": "superflu998",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8focz8/some_thoughts_are_only_for_inside_your_brain/",
        "text": "Many many years ago I was young and clever, and I knew everything.  \n\nI worked repair for some very large machinery.  I discovered that I’d much rather NOT do that.  So I found a gig in an office translating the machine operators list of problems into actual words the repair crews could understand.  This has proved a very handy skill in that I frequently have no problems discerning what $users are trying to tell me in my current IT field.  \n\nThis tale comes from my time in that office.  The Machinery my department repaired had lots of complex systems and some of them them (all of them) had been built by the lowest bidder, which led to all sorts of many fun times.  \n\nOne system in particular was crucial for the operators safety, and was slightly better than garbage.  $system frequently failed, frequently like 50% of the time.  \n\nPart of my job was to document any issues the operators identified, as I said.  One night and operations crew came in and told me the system had failed, so I appropriately documented this issue within our computer machine system like this: \n\n$system broke again. Big surprise.  \n\n\nHappy me trots off home at the end of my shift, and returns at my scheduled time the next day, to find my boss wanted some of my time.  \n\n$boss: “superflu....did you put this ticket in?”\n\n$me: “hehehe *nervous chuckle* yeeeeesss?” \n\n$boss: “well. I find it  amusing, if not particularly professional, however the division manager (my bosses, bosses, bosses, boss) did not find it funny. He’s been convinced to let it go this time, if it happens again you can assume your career will not fair well”. \n\nMoral of the story:  Don’t document your own smartassery, it occasions offends.  \n\n\n",
        "created_utc": 1524966297,
        "upvote_ratio": ""
    },
    {
        "title": "\"And that's why you always close your tabs after you're done!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fo9k8/and_thats_why_you_always_close_your_tabs_after/",
        "text": "[removed]",
        "created_utc": 1524965184,
        "upvote_ratio": ""
    },
    {
        "title": "Watch what you say.",
        "author": "Not_Ross_RS",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fniun/watch_what_you_say/",
        "text": "This is a bit of a short one.\n\nI've only posted on here once before, but as a bit of background info I do tier 1/tier 2 for a small construction company. Anyway, TLDR of this thread; Watch what you say.\n\n\n- The tablet guy.\n\nI was finishing up a ticket with a user, in person. As we're a small company we don't have remote access software installed on every PC to keep costs down (I'm gonna get arthritis by 40). While walking out of the room, a guy stops me.\n\n\nThis guy, let's call him Frank,  goes \"on site\" a lot. I believe he's a supervisor, so sometimes he does work in the office, like reviewing plans before going out, etc. \n\n\nAnyway, Frank called me over and asked me to take a look at his tablet, it was slow and he wanted a new one. - I joked with him before looking at it, the quickest way to get a new one is to pour coffee over it.\n\n\nI spent fifteen minutes cleaning it up, and handed it back to him and didn't think much of it.\n\n\nOne morning, about two weeks later, I arrive to see my co-worker inspecting a tablet. He said it appears water damaged. Frank said it \"just stopped working\". Co-worker said he thinks Frank spilt coffee on it. \n\n**Edit:** fixed the \" tier 1/2\" typo\n",
        "created_utc": 1524957257,
        "upvote_ratio": ""
    },
    {
        "title": "\"I know I'm doing it right, I'm not stupid..\"",
        "author": "kamikageyami",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fmyje/i_know_im_doing_it_right_im_not_stupid/",
        "text": "So, I work in a large warehouse for a logistics company on the admin team. One small but regular part of my job is sorting out issues the warehouse floor workers get with the equipment that they use to scan products that are going to be shipped out.  \n\nFor some products, you have to first scan the barcode on the box as usual, then enter a number on the numpad, and then scan it again because the weight of that particular box needs to be recorded in our system so we know how much to charge the customer. This is the cause of a super common issue with new employees because they always scan the wrong barcode the second time and get an error message on their screen, which sends them running to me.  \n\nIt's a really easy fix, and 90% of the guys that encounter the problem get the idea after the first time and don't do it again, but last week I had a guy get stuck on this over and over again, coming back to me every two minutes to get it fixed insisting he was scanning the correct barcode. Usually I can sort this out without having to leave the office so I'd normally be a little annoyed, but I wasn't that busy at the time and I wanted to be fair and see if maybe it was just a weird problem with that particular scanner he was using. He seemed competent enough and shit happens, you know?  \n\nSo I walk out with him to his pallet where the boxes were, take a quick look to make sure they're the right product. (Sometimes a product will get put into the wrong spot in the warehouse) Everything seems fine, so I ask him to scan them again just so I can maybe see what's going on.\nHe assures me again that he's doing it right, so he kneels down and starts scanning the barcodes.  \nI stand there in disbelief watching him scan a dozen or so boxes. He scans the barcode on the first box, types on the numpad, then scans it again (the wrong barcode). Immediately an error message pops up on the screen covering the UI:  \n&gt;**\"ERROR: UNKNOWN VALUE ENTERED\"**  \n\n...but this noble error message is not enough to stop him, he just keeps on scanning boxes. He doesn't even close the error message, so nothing he is doing is actually coming up on the screen, he's just going at it like it wasn't even there.  \n  \nI really didn't even know where to start.. sure, I'd encountered people who just click straight through error messages without reading them before, but this was a different kind of beast. Continuing the motion of using the screen as though there wasn't a huge error message waiting for confirmation sitting there, preventing any other input..    \nEventually I came back to my senses, pointed out which barcode he needed to scan and sent him on his way. I walked back to the office trying to find some meaning.. some logic to it.. but some things just aren't meant to be understood by mortal men.",
        "created_utc": 1524951591,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure I’m in the right place. How do you change your email. Tried tech and no response.",
        "author": "onajrney",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fmpys/not_sure_im_in_the_right_place_how_do_you_change/",
        "text": "[removed]",
        "created_utc": 1524949279,
        "upvote_ratio": ""
    },
    {
        "title": "Try doing the other steps after Step 1",
        "author": "Boofrick",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fmh5z/try_doing_the_other_steps_after_step_1/",
        "text": "I'm a small-time computer tech helping mostly home users.\n\nI use a RAT (Remote Access Tool), that gives very detailed, simple instructions to clients for how to install it.  Those instructions are even specific for which browser the client is using.  They are given as Step 1, Step 2, etc.  Included in the instructions are screen captures showing exactly what the client is supposed to do.\n\nI was stumped as to why the RAT was not working for this one client.  He kept insisting that he was following all the instructions to the letter, but nothing what happening.\n\nAfter awhile, I determined that in Step 1, he was clicking the \"Download\" button in the screen capture EXAMPLE, not the actual \"Download\" button.\n\nGreat!  Problem solved, right?  Sigh, not yet.\n\nHe kept saying he was following all the instructions, but it turned out that he just kept pressing that \"Download\" button repeatedly, not progressing beyond Step 1.",
        "created_utc": 1524946896,
        "upvote_ratio": ""
    },
    {
        "title": "My computer is sentient",
        "author": "LividLadyLivingLoud",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fkhk2/my_computer_is_sentient/",
        "text": "I do not work in IT. I am fairly tech savy though and grateful for IT's assistance. The following is one of the stranger issues that I submitted to them, which they did not believe at first. It happened a number of years ago. The first bit of this story took place over a couple weeks. I became frustrated because IT kept closing my ticket even though the problem persisted.\n\n**My Issue**\n&gt;My work computer turns itself off and on without me doing anything.\n\n**IT**\n&gt; It is installing Windows updates. That reboot is normal.\n\n**Me**\n&gt; No. I know what that looks like. This is something else. I can be in the middle of working and it will just power down completely but not reboot and not indicate any updates. Alternatively, I can power it down, go home for the night, and come back and it will have turned itself on in my absence.\n\n**IT**\n&gt;It's going to sleep for inactivity. Move the cursor or click something periodically. Otherwise adjust the sleep timer's default settings. &lt;inserted instructions&gt;\n\n**Me**\n&gt; It is not going to sleep. It is powering down on its own. No lights, no fan, nothing, totally off no power. And sometimes it powers itself on.\n\n**IT**\n&gt; I see you're a relatively new hire. Is your cubemate playing a prank in you?\n\n**Me**\n&gt;My cubemate and mentor is away in her honeymoon for the past 2 weeks. She did witness it though. She said its possessed. This odd behavior is becoming more frequent and disruptive to my work. If I power down my computer and grab my purse, my tower will power up before I even get my keys out of my purse to drive home. It also powered down while on its own while I'm working. It's like gremlins are inside it or something. \n\n**IT** sounding annoyed\n&gt;I'll be over in a hour to show you how to change your sleep settings. \n\n-----\n\n**Me**\n&gt; I don't think you understand my issue. Please stand right here and I'll show you.\n\nI pointed at the green power light on the tower of my computer, to show that the light worked. I then logged out and shut down the computer. The light turned dark and the computer hardware sounds stopped.\n\n**Me**\n&gt;It's off. Completely off. \n\nIT nods and looks at me like I'm a bit dumb. He moves forward as if to boot it up.\n\n**Me**\n&gt;Wait. Just be patient. \n\nWe both stared at the powered down computer tower. Awkward.\n\nAfter about a minute, there was an audible \"click\" sound. The green power light lit up. The hardware began to make its usual noises. After another few moments the login screen appeared.\n\nIT looked stunned.\n\n**Me**\n&gt;As I said. My computer decides for itself when it wants to turn itself on and off. It's annoying and intermittent but becoming more frequent. \n\n**IT**\n&gt;I see. \n\nIT then searched around looking for loose cables around my desk and peeked over the cubical wall to see if others were pranking both of us.\n\nFinding nothing, he then disconnected my tower, took it to the IT desk and provided me with a loaner laptop. \n\n-----\n\nA few days later, he returned with a new desktop tower.\n\n**Me**\n&gt;Did you find the gremlin?\n\nIT laughed, sounding a little amused and slightly sheepish as he plugged everything in for me, then booted it up to the login screen. When he finished that he answered with a big grin.\n\n**IT**\n&gt;Yes. There was a short in the power supply line. Good thing no one got electrocuted. I've moved your hard drive to a new case with a good power line. All your saved files and programs should work already. You were due for an upgrade anyway, so this one should faster and you'll have an extra drive now too.\n\n**Me**\n&gt;Awesome! Thanks!",
        "created_utc": 1524928414,
        "upvote_ratio": ""
    },
    {
        "title": "Update",
        "author": "beachboy778",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fjgxb/update/",
        "text": "[removed]",
        "created_utc": 1524917061,
        "upvote_ratio": ""
    },
    {
        "title": "What does placement have to do with it",
        "author": "nik_drake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fi39l/what_does_placement_have_to_do_with_it/",
        "text": "I work techincal escalations for an ISP.\n\nCustomer calls in that her 2.4 wireless network isn’t working and the gui on our website for basic wifi information is showing someone else’s network.  I verify the url for the gui on our site.  She had been on the help page discribing how to use our gui.  When she actually gets to our gui, she sees she can activate a guest network, and starts asking questions about how she should go about enabling it.  While she is going on about that I switch the 2.4 channel to 3.\n\n&gt;Cst: What should I do to fix my 2.4?\n\n&gt;Me: Well for one, don’t worry about the guest network. That will only help if you want to give others your wifi password and don’t want to affect your own devices if you have to change the password later on.\n\n&gt;Cst: When we started talking all of the devices connected were showing good range, but now three are red, two for the 5 and 1 on the 2.4. Why did they become red?\n\nI enternally sigh, when we started talking you were still on the help page.\n\n&gt;Me: Wireless networks are always in fluctuation; things can easily shift depending on a lot of variables.\n\n&gt;Cst:  Well my 2.4 isn’t working and I am right next to the modem. Being right next to the modem it should work. Should I change the channel?\n\n&gt;Me: I already adjusted the channel to 3 to see if it helps. Now with wireless networks the main network name has great range and any devices capable will pick it up but it is more prone to interference. Those interference factors include baby monitors, garage door openers, ham radios, some wireless light bulb controls, among others. You can google search it for information. Now that i...\n\n&gt;Cst:  The 2.4 stopped working. It was working before because I was using it, but now it is not.  It has gone out again. I can’t access the site I was on.  Is it because you are on it?  Do you need to exit it so I can gain access again? I’m right next to the modem.\n\nI was already having a bad day and simply trying to explain that the reason 5 exists is because of the exact issue she is having.  I adjust the channel to 9. I decide to change direction (please forgive me the second sentence below does not make sense).\n\n&gt;Me: Being right next to the modem doesn’t matter. It would only matter if you were on a wired connection. The second you flip to wireless, it is a radio signal prone to radio interference and what I already told you.\n\n&gt;Cst: Well fix my 2.4\n\n&gt;Me: Because it is a radio signal, position is important. You are going to want to make sure your router is not hidden. It needs to be out in the open, not behind your TV or any other device. You want it up, on a table or a shelf; do not place it on the floor.\n\n&gt;Cst: Why are you telling me this? You aren’t talking about how to fix my 2.4. I am not moving my modem.  I am not going to put in on a shelf and I am not going to place is as a center piece I and every person that comes into my home has to stare at it. The position doesn’t matter.  Tell me how to fx fix my 2.4 which is what I called about.\n\n&gt;Me: Ma’am I am telling you how to start fixing your 2.4 and that is by position. This isn’t information from my company. This is readily available information by third parties. This is advise from Cisco, Apple, and Arris just to name a few. Just google search wifi interference. Now as I was saying you need to move you...\n\n&gt;Cst: I think I need to speak with someone else. You are not talking about my 2.4, you are talking about how I choose to arrange my home which is irrelevant. Since you won’t tell me how to actually fix my 2.4, I need to talk with someone else.\n\n&gt;Me: Placement is about fixing your 2.4. I am sorry that you are having trouble believing independent resources in regard to the best practices for dealing with your 2.4 issues, but I have no one I can transfer you to. I am the escalation.\n\n&gt;Cst: There are others in your department. You can transfer me to one of them.\n\nActually I can’t. I could be written up for resolution avoidance. I prepare to explain that I could have a team member call her back but it wouldn’t be a right away thing and the information wouldn’t change.\n\n&gt;Me: I don’t have the ability to do so. What I ca...\n\nShe hung up\n\nTL:DL- Customer cares more about the ascetics of her home than to accept that maybe she was getting accurate information from the tech support agent that was just trying to help her.\n\n*starts humming what does love have to do with it*",
        "created_utc": 1524895631,
        "upvote_ratio": ""
    },
    {
        "title": "keeping ahead of the Jones'",
        "author": "harrywwc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fhutc/keeping_ahead_of_the_jones/",
        "text": "July or August 1990.\n  \nI know this because of the details below.\n  \nBut let's back up a little. I'd been a software developer / programmer-analyst for a few years now, and had been playing (commercially) with MS-DOS, actually, PC-DOS since 3.2 (on an IttyBittyMachine PS/2). A year before this tale, I had started working for the (now defunct) US MultiNational |a|n|a|l|o|g| (is that obfuscated enough? ;) and shortly after starting with them received a shiny new VAX-Station 3100 with DECWindows^(TM) - this was your usual WIMP (Windows, Icons, Mouse, Pulldown-menu) style GUI system based on Motif. Something we **all** take for granted these days, but then was really only the realm of the rich (and could afford a Macintosh) or the fortunate (and their work bought them one). I was, of course, in the latter group. Oh, there was also the 'geek' who could afford an Amiga :) Although, our home PC (Commodore 286 / MS-DOS 3.2) could run GEOWorks Ensemble.\n  \nEnough background.  \n  \nIt was late July or early August 1990, and a friend from church / men's group knew I \"worked with computers\" and would I come over and help him set up his new PC?  \n  \nEver ~~the sticky-beak~~ willing to help, I said sure, and wandered over the next Saturday morning.  \n  \nIt was a brand new PC - not a \"genuine\" IttyBittyMachine, but a name-brand clone - maybe HolsteinCowComputers? We both pulled the machine out of the box, pulled the 15\" CRT (XGA - 1024x768) out of its box and hooked it all together - by (much to his chagrin) reading the documentation. We also connected his new (inkjet? maybe Epson?) printer to the computer as well.\n  \nWe did the \"Smoke Test^(TM)\" and everything spun up - and DOS 5 loaded and then (automagically) Windows 3.0 launched into the full glory of 256 colours (*where values of \"*full glory*\" may vary from person to person*).  \n  \nWe were both impressed.\n  \nSince I was driving (ever the geek), I started clicking and dragging, and opening stuff, and mousing around like a Boss. Found Program Manager, and then Write, then Calc, then CharMap, then FileManager. Basically took his baby for a test-drive in front of him, explaining each of the tools as I opened then, with a run down of what they might be used for. At some point we loaded the printer drivers for the new printer as well, and did a test print from Write.\n  \nNow, my friend was a bit of a show-off, and had to have the latest and greatest (hence the new Win3.0 PC) and always wanted to be the 'Jones' that everybody was trying to keep up with. To say he was a little put out that I was driving this beastie like it was second-nature was just a little off putting to him.\n  \n&gt;He: How do you know how to do that? This is a brand new operating system, released just last month!\n  \n&gt;Me: Oh, I've been using this kind of thing for ages (*read 7 months - but shhhh...*) at work. Yeah, all of my team have something like this - only we have a 20\" display. (*that I forgot to mention was monochrome - 512 shades of grey*)\n  \nHe seemed a little cooler after that brief conversation, and suggested that I should get back home to me lovely wife and new-born son.\n  \nHe did come back and ask me to help him sort out some other computer stuff at his office in the city. It was all new, exciting, and fun. \n  \ntl;dr - when everything new is old again\n\n-----\n\nAt about the same time, and not really deserving a whole story of its own...\n\nI was doing PC consulting for the church I attended. They would ask my opinion, I would give it, they would ignore it and do something else. After all, \"*free advice is worth every cent*\".\n\nSome weeks later would ask me to come and fix the thing. At which point I would charge them a (nominal) fee (and then put that back in the plate the following Sunday).\n  \nAfter a few iterations of this, I said \"If you want me to consult on anything, here are my rates\" and would invoice them each time they asked my advice (and drop it back in the plate the next Sunday).\n  \nThey started taking my advice seriously! It was costing them money (not a \"lot\"), and so they decided that the advice was worth paying attention to. \n  \nEven installed a small thinnet Ethernet network for them to connect two PCs together and share the printer they had. Installed DOS 5 for them on both the machines as well (two licenses, of course).\n  \nAh... fun times...\n\nedit: formatting - * and ~",
        "created_utc": 1524892576,
        "upvote_ratio": ""
    },
    {
        "title": "Password Complexity Requirements",
        "author": "Malkron",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fgkxl/password_complexity_requirements/",
        "text": "I work remote first level tech support for the employees of a large company. Everything from password resets to network outages to Fitbit troubleshooting is in my wheelhouse.\n\nWhen I drove to work today, I did not know that I was a couple hours away from putting my job at risk.\n\nIt was the second call of the day. Run of the mill password reset. This guy's password was expired, and I could tell from our brief conversation so far that he was not good with computers. That's fine. I used to teach an A+ course, so I am very comfortable talking tech with laymen.\n\nAfter obtaining remote access to his machine, I went about resetting his password, and came to the fateful change password screen.\n\nThis screen is the bane of my existence sometimes. The company I support has a laundry list of password complexity requirements, and some of their employees take 15 minutes of hand-holding to get it right. Not this user, though. This user was *unique*. I had vastly overestimated his abilities.\n\n20 minutes later, and I'm at wit's end. I have explained the requirements multiple times. I have asked him to write the password down on paper, and went line by line with the requirements, asking him if his password met each one. He said it did. I could not figure out what the problem was.\n\nI had no choice but to breach security. I had to see what this guy was typing. We only do this when all else fails. It's a last ditch effort before investigating if there is a problem in the domain. \n\nI looked at his password. It started with the number 5 followed by a sufficient number of lowercase letters and a symbol. I told him that the password looked fine, except that it didn't have an uppercase letter.\n\nWhat this guy said next would drastically lower the bar for the stupidest thing anyone has ever said to me.\n\n\"But...the number 5 is capital\"\n\nI almost broke the sound barrier with the quickness at which I hit the mute button. I laughed so hard that my coworkers started to become concerned. The entire office went quiet. Everyone was staring at me. I took so long to compose myself that the user almost hung up. I stood up and locked eyes with each of my coworkers one by one, trying to gain some moral support for one of the hardest sentences I have ever had to say without laughing. I unmuted the phone.\n\n\"The number 5 cannot be capital, and it does not meet the complexity requirement for an uppercase letter.\"\n\nI didn't make it. The last half of my response was said through a long, drawn out laugh. I had to mute the phone immediately after saying it because everyone around me started laughing at the ridiculous sentence I had just uttered into the concerned quiet of our small office. After calming them down, I unmuted the phone, apologized, and, in the most professional voice I could muster, suggested that he capitalize one of the letters. \n\nA few minutes later the call was over and I clocked out for a much needed break. On the way out, my boss told me that he was looking forward to the incoming escalation for laughing at a user on a call. \n\nI told him to make sure and record that call with his boss. There's nothing like a good laugh at an exit interview.",
        "created_utc": 1524878124,
        "upvote_ratio": ""
    },
    {
        "title": "Lost my cool over a phone call",
        "author": "joyous_occlusion",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fffh2/lost_my_cool_over_a_phone_call/",
        "text": "[removed]",
        "created_utc": 1524866726,
        "upvote_ratio": ""
    },
    {
        "title": "\"Whatever state it's in, just give it to me\"",
        "author": "rocknrollnobody",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fff4t/whatever_state_its_in_just_give_it_to_me/",
        "text": "[removed]",
        "created_utc": 1524866630,
        "upvote_ratio": ""
    },
    {
        "title": "The day my sister became a user",
        "author": "obtuseperuse",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ff9wc/the_day_my_sister_became_a_user/",
        "text": "[removed]",
        "created_utc": 1524865257,
        "upvote_ratio": ""
    },
    {
        "title": "R510 with PERC H200 Questions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fejy3/r510_with_perc_h200_questions/",
        "text": "[removed]",
        "created_utc": 1524859059,
        "upvote_ratio": ""
    },
    {
        "title": "I'm starting to wonder if we should start faking updates just to placate users...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fe68n/im_starting_to_wonder_if_we_should_start_faking/",
        "text": "[removed]",
        "created_utc": 1524855890,
        "upvote_ratio": ""
    },
    {
        "title": "Karma for Karma",
        "author": "LegendaryOdin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fe1ey/karma_for_karma/",
        "text": "[removed]",
        "created_utc": 1524854821,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of three IT Auras",
        "author": "abhik66",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fdxu3/the_tale_of_three_it_auras/",
        "text": "You all have heard countless stories of IT aura fixing things for their users. The mere presence of such individuals solves issues. It's magical ! Rarely do the IT professionals themselves get to experience this magic for their own problems since their own aura is sufficient enough to keep those small critters at bay.\n\nFortunately or unfortunately, depending on your perspective, I got to experience this disturbance in force. My own aura (and my Google-fu skills) were lacking on that fateful day. The characters and objects involved in this gripping tale are as follows:\n\n    $me - a software developer - work on $software\n    $Infra - another developer in infrastructure team, tasked with building automation for $software\n    $IT - our IT guy.\n    $chatapp - An enterprise chat application. IT recently dropped support for this, yet people (including IT) are fond of it and keep using it as chat client with a registry hack to make it play nice with the new chat server.\n    $voip - An IP telephony application\n    $test - Test suite for $software\n\nScene:\n\nI'm at my desk, working on $software while resigned to the fact that my $voip was going to be pain today. Specifically, it is crashing on me spectacularly whenever I try to receive an incoming call. What fun!\n\nSo I do what a responsible person will do after doing some google-fu and finding absolutely nothing related my problem - I file a ticket with IT and $IT guy promises me that he'll drop by in 1-1.5 hour. Awesome ! I get back to my work.\n\nOh hey, there's a ping from $infra guy. He needs help with running the $test, he says it is acting weirdly. I ask him to drop by so that we can debug and he says that he's not yet at work and will be coming in another hour. I think you all see where this is going. When the time comes for us to meet, both $IT and $infra drop by my desk simultaneously with their respective laptops in hand. \n\nI'm not that concerned about this simultaneous rendezvous, as I don't need access to my system while helping $infra. So I take over $infra's laptop and $it takes over my desktop. Everyone is happy.\n\n&gt;$me: So $infra, you run it this way, am I correct ? (runs the $software and $test suite).\n&gt;\n&gt;$infra: Yeah, but it doesn't launch. The $software throws up $wall-of-text error.\n&gt;\n&gt;$me: *launch the software*  *it works without issues*\n&gt;\n&gt;$infra: Huh ! It has never done that before.\n\nWe try to launch it in multiple ways, with different parameters and it works perfectly every time. We discuss about what to do if he faces the same issue in future, and he tries to reproduce the issue, but it never occurs again. We laugh it off.\n\nMeanwhile, $it guy is struggling with my machine. He can't get $voip to crash at all. It's working all nicely with a crystal clear sound quality. I agree with $IT guy that if it is working, let's close the ticket. $IT guy asks if he can help with anything else. I tell him all is good with the world. Just before leaving however, he sheepishly asks $me and $infra -\n\n&gt;$it: I noticed something on both your systems. I see you are running $chatapp. I take it that you use the registry hack ?\n&gt;\n&gt;$infra and $me: Oh yeah. We know you guys don't support it, but it works. We'll keep using it until it breaks completely.\n&gt;\n&gt;$it: Fair enough. I'm trying to get it running on my laptop here as well since most of you guys still use it, but for some reason, the registry key isn't working.\n&gt;\n&gt;$infra: (incredulously) Let's take a look.\n\n$infra guy verifies the settings are correct (they were) and just launches the $chatapp. It starts up like there was nothing wrong.\n\nAll three of us are stunned just now realizing the full extent of what happened just now. All of us were struggling with annoying little problems that we ourselves should have been able to solve. In fact, there was apparently nothing wrong with any of our software. $infra's $software ran fine, $my $voip ran fine, $it's $chatapp ran fine. Just not when we ran it ourselves.\n\nUntil this day I had always blamed this IT aura thing on overlooked details or user stupidity. But I haven't found a reasonable explanation to any of our problems yet ! It just needed the correct person's touch.\n\nThis was the day I became a believer. This was the day I accepted that IT aura exists. I've seen its beauty and I assure you that it's truly magical.",
        "created_utc": 1524854012,
        "upvote_ratio": ""
    },
    {
        "title": "Common sense and egos - Developers know best",
        "author": "trazom28",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fdofv/common_sense_and_egos_developers_know_best/",
        "text": "This goes back to the mid 90s. \\(Days of the 486/66\\)  The company I worked for decided to create large databases of sales data, accessible through an Oracle Forms database.  For the most part \\- it worked great.  Cue the help desk ticket \\- whenever a user accessed a particular form,  their computer crashed.  Checked over the hardware and it all tests fine.  There aren't any issues with it that I can reproduce.  Developer of the form \\*INSISTS\\* the computer must be broken and I need to replace it for this user.  Short version of the conversation is:\n\nMe: \"Does anyone else use this form?\"\n\nDeveloper: \"No.\"\n\nMe: \"Does the computer work on all the other forms?\"\n\nDeveloper: \"Yes\"\n\nMe: \"Well.. it sounds like maybe it's the form\"\n\nDeveloper: \"Can't be \\- the form is fine.  You have to replace the computer\"\n\nMe: \"I've tested the system \\- its good.  It always crashes on the same form \\- makes sense that the form would have an issue right?\"\n\nDeveloper: \"No, my forms are perfect.  Replace the computer\"\n\nMe: \"Can you at least check the form over?\"\n\nDeveloper: \"No, the form is fine.  Replace the PC\"\n\nKnowing full well the computer was fine \\- I advise my boss, who talks to the developer's boss, and at the end of that..   you guessed it \\- I'm replacing the computer.  So I do.  Brand new out of the box, fresh install of Windows \\- it's fine.  I put it in.  Give it a couple days.\n\nUser: \"My computer is crashing on that same form\"\n\nMe: \"Ok \\- I'll let the developer know to check the form and figure it out\"\n\nI do.. \n\nDeveloper: \"The form is fine \\- you just have bad computers\"\n\nMe: \"This is a brand new one.  I set it up myself, and it works fine \\- there's nothing wrong with it\"\n\nDeveloper: \"Well, it's not my form.  Fix your computer or replace it\"\n\nMe: \"Can you check the form to rule it out?\"\n\nDeveloper: \"No, I\"m busy\"\n\nBack to the boss.. who goes to his boss. .and the word comes down..  replace the computer.  Sure.. I can do that.  Setup and build a 3rd computer, put it in.\n\nUser: \"I still have an issue on that form.  My system crashes every time\"\n\nMe: \"I thought you'd be calling.  I\"ll tell the developer again\"\n\nI tell boss.. boss tells his boss.. discussions take place, a couple days go by \\- word comes back that the developer...  fixed his form.   User calls to say everything is fine now. \n\nActual fix time for the form issue \\- about 10 mins\n\nActual time for the entire rodeo \\- 3 weeks",
        "created_utc": 1524851942,
        "upvote_ratio": ""
    },
    {
        "title": "The Printer won't print.",
        "author": "Rug45",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fdnrb/the_printer_wont_print/",
        "text": "Had to share this, as I just got back from a 2 1/2 hour round trip visit to a remote office.\n\nI little background. I provide helpdesk/desktop/phone/mobile support for 3 out of 11 offices for my company. I work onsite at the largest office and will make visits to the other offices as needed or provide remote login support.\n\nThis past Tuesday I receive a VM afterhours from one of the remote offices that one of the printers wasn’t printing. I log into the printer to check the status and it shows a paper jam. \nI email the individual back and tell them there is a paper jam and could they or one of their team members clear the jam and try printing again.\n\nThey emailed me back saying they cleared the jam, but the printer is still not printing. I log back into the printer and see a new status message that says \"No paper pickup please press OK\".\nI email the individual back asking them to please check the paper tray's that they do have paper in them and that there is not a stuck piece of paper in the pickup rollers and to press the Go button to clear the message. They email me back, it's still not printing.\n\nSo I head out to the office to see if there is anything I can do before calling a printer services tech out and I get to the printer and press the Go button that clears the error message and the printer starts printing.\n",
        "created_utc": 1524851781,
        "upvote_ratio": ""
    },
    {
        "title": "STOP TAKING OVER MY GODD*MN PHONE",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fczj5/stop_taking_over_my_goddmn_phone/",
        "text": "[removed]",
        "created_utc": 1524846549,
        "upvote_ratio": ""
    },
    {
        "title": "Can you be more vague?",
        "author": "nagol93",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fc8p9/can_you_be_more_vague/",
        "text": "So, I get an email from our PoC that just says this \"Jimmy, has an issue\". Now we have had problems with this PoC being way too vague, as part of her job is to record/report what the initial error is. So we send her an email asking her to explain what the issue is. She says \"Talk to Jimmy\". This is how it goes down..... \n\nMe: \"Hi, Jimmy. We herd you have a computer error. Can you please discrive what your experiencing?\" \n\nJimmy: \"Yes\"\n\n*10min go by*\n\nMe: \"Can you discrive whats the error is? Try rebooting\"\n\nJimmy: \"The application ties up then unlocks. Reboting dosnt help\" \n\n*I check the uptime, he hasnt rebooted this in a while*\n\nMe: \"Which application are you referring to? Also what do you mean by 'ties up and unlocks'?\"\n\nJimmy: \"Yes, that is correct\"\n\n*facepalm*\n\nMe: \"Can we remote into your computer to look at it?\"\n\nJimmy: \"Not now\" \n\nMe: \"Ok, when would be a good time to do so?\"\n\nJimmy: \"Dont know...... How long will it take to fix?\"\n\nMe (internally): *What the fuck dude??? You have to give me some information to go on. I dont even know the issue, no less how long it will take to fix it*\n\nMe: \"We will have to look at your computer to determine that\"\n\nJimmy: \"Can I just call you when I have free time?\"\n\nMe: \"Sorry but this needs to be scheduled\" (otherwise users will call us at the most inconvenient time, like 3hrs after we close, then complain that no one answered the phone)\n\nPoC: \"Nagol93, can you explain why this issue hasnt been resolved yet? Do I need to get Mr.CEO involved?\"\n\nMe (internally): \"Ya, because Jimmy wont tell me whats wrong or let us work on his computer! Also yes, please get your ceo involved. Maybe he will get Jimmy to actually answer my questions\"\n\n(Also before any of you call me out on how some things are said. I am paraphrasing the emails that were sent, they are not word-for-word accurate)",
        "created_utc": 1524840781,
        "upvote_ratio": ""
    },
    {
        "title": "Can we get back at zipping files with password",
        "author": "OpenScore",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fbza4/can_we_get_back_at_zipping_files_with_password/",
        "text": "I work sysadmin at a company outside EU, but that deals with EU customers. Due to regulations coming in force this may, GDPR, we are required to use secure methods to transmit confidential data between us, the client and the main contractor (we subcontract the work from the main contractor). So, the main contractor, asks us to use PGP encryption to deal with it.\n\nFine, let's do it. I went full steam ahead, prepared  set of keys (Public and Private), did produce a manual on using gpg4win (my decision for making the life easy on my non-IT colleagues) both on encryption and decryption, teached them how to use it, and we're all set to start using it. Got also the pub_keys from the client and main contractor (they stated that we can use these keys for encryption).\n\nI personally try to enforce the usage of encryption to my non-IT colleagues, and it seems good.\n\nWithin days, both client and main contractor (not those who made the decision to go for encryption, but more like sales/customer ppl) start complaining that they can't open the data we sent, and ask for plain old files. Even going as far as saying:\n&gt;I authorize you to give me the plaintext files. \n\nThis despite the fact that the request for using encryption came literally from the boss of the boss of the boss of these persons. \n\nMy non-IT colleagues were kind of terrified on what to do, and me bluntly telling them to keep using encryption...\n\nIn the end, since both the client and main contractor didn't deploy encryption/decryption procedures or even tell all the people of the new policy, it was decided to just zip/rar the files with a password.\n\nOh, and the client is a major ISP in an EU country and the main contractor has a global presence in that specific market. ",
        "created_utc": 1524838641,
        "upvote_ratio": ""
    },
    {
        "title": "Is the network down?",
        "author": "xilog",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fbxqy/is_the_network_down/",
        "text": "$Me: Me\n\n$Dippy: Long-time low-ranking HR drone\n\n$Software: Our HR database software\n\n&amp;nbsp;\n\n$Me: Hi, this is $me, how can I help?\n\n$Dippy: Is the network down?  Nobody can do anything over here.\n\n*(Over here is a remote site about a mile away.)*\n\n$Me: No, I don't think anything's wrong; hang on while I check.\n\n*(Basic diagnostics OK, can see everything live on the remote site)*\n\n$Me: Everything looks fine; what seems to be the problem?\n\n$Dippy: Well when I go to $Menuitem.list.item it puts up a screen about needing to get permission to use that part.\n\n$Me: Well that menu item is restricted in $Software to supervisors, are you a supervisor?\n\n$Dippy: No...  Is the network down?\n\n*(headdesk)* \n\n$Me: No. Everything is fine. If you need to use that function you need to ask a supervisor to do it for you.\n\n$Dippy: Oh, OK. \\*click\\*\n\n&amp;nbsp;\n\nTIL that a single user being unable to select a restricted function == the whole network is down and nobody can do anything.",
        "created_utc": 1524838308,
        "upvote_ratio": ""
    },
    {
        "title": "The time a standing desk broke printing.",
        "author": "pizzaboy192",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fbip2/the_time_a_standing_desk_broke_printing/",
        "text": "I recently got back into user support from just hardware maintenance. Great change of pace for me. Today we had a very strange issue I doubt we will ever replicate.\n\nOne of our accountants got a standing desk this week. One of those fancy things that is multiple height and all sorts of other stuff. Facilities maintenance sent their intern (someone's son) over after hours to install the desk and he was kind enough to mount the displays, hook everything up, etc. It's pretty simple to plug in a couple dvi cables. Nobody is gonna complain to not having to mount displays.\n\nHowever, cables got transposed and left became right. Nothing a simple change in control panel can't fix. \n\nThen today we get a ticket. Completely unrelated (so we thought) about printing from some of our software. She would walk me through the steps and it would hang after pressing print.\n\nBasic troubleshooting was as follows:\n\n* Watch them create the issue\n* Attempt to create it myself \n* Ask others if they have same issue (no one else having issues)\n* Have user try logging into another machine (works fine)\n\nWhen they went to print, another window with a preview popped up. We did not get this window on their normal computer.\n\nThe fix: open control panel, move the \"left\" monitor to far right (where it was before the standing desk) in windows. All of a sudden the preview window popped up! We moved it back over and away it went!\n\nTL;DR software is not as ambidextrous as it would make you believe.",
        "created_utc": 1524834661,
        "upvote_ratio": ""
    },
    {
        "title": "Asking users to choose might not be a good idea",
        "author": "ITVarangian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fa4ys/asking_users_to_choose_might_not_be_a_good_idea/",
        "text": " \nHello TFTS,\n\nThis little story happened a few days ago, and I thought that it could belong here.\n\nSo to give some context, users here are allowed to have a professionnal mobile phone if their manager request one, and they're then asked to choose what model they want. Currently, they can choose between iPhone 7 and Samsung Galaxy S7.\n\nUser here chose an iPhone 7. After receiving the smartphone and the SIM card, I sent an email to let her know that she can come see us at the IT Office, email in which I wrote in **bold** that she has to come with her laptop so we can also configure the remote working tools on it. User finally came at the office 30 minutes before my day ends, I still accepted to deliver and set up the phone because usually \nit doesn't take more than 10 to 15 minutes to do that... usually.\n\n$User =&gt; You gess it.\n\n$ITVarangian =&gt; Yours truly.\n\n&gt;$User : Hello, I'm $User and I received an email, apparently my mobile phone is available here ?\n\n&gt;$ITVarangian : Hello, yes indeed, however I don't see any laptop in your hands... ?\n\n&gt;$User : Oh, I had to bring my laptop ?!\n\n&gt;$ITVarangian : Yes, I actually told you about it in the email.\n\n&gt;$User : Oh sorry then, I'll come back with it right now !\n\nAfter a few minutes, $User came back with her laptop and I started the delivery process. In order to use the phone, she had to create an Apple account since the professional apps we have to install on each phone must be downloaded from the AppStore...\n\n&gt;$User : Wait, what the [bip] is that ?! It's asking for a payment method like a credit card ! I don't want to put my credit card !\n\n&gt;$ITVarangian : Really ? That's weird, since the application is free, it should let you refuse to put any payment method. Can I check ?\n\n&gt;$User : Look, I don't give a [bip], do as you wish but make it so that I don't have to be forced to do that !\n\n&gt;$ITVarangian : I will check, but if you keep talking to me like that, we're going to stop here right now, madam.\n\n&gt;$User : Yes sorry, I'm really sorry, but I really don't want to put any payment method !\n\nSo $User finally accepts to give me the phone and actually, the AppStore is allowing her to select no payment method at all... it's just asking for street address, city, and number phone, and since $User here hasn't filled these fields, the AppStore isn't allowing her to proceed. After telling this to \n$User, she calms down, fills the fields and we can then download and install the apps. At each step, $User asks me at least twice the same questions, and when I ask her if she wants to configure the TouchID because a lot of users are asking for it and actually chose an iPhone for this reason (because a lot of them aren't aware that the Samsung Galaxy S7 is also able to use the fingerprints), she starts to get upset again.\n\n&gt;$ITVarangian : By the way, do you want to configure the TouchID after that ? For the fingerpri-...\n\n&gt;$User : NO ! I don't want to give my fingerprints to Apple !\n\n&gt;$ITVarangian : Okay, no problem, it's entirely up to you.\n\nI then spent the next five minutes to teach $User how to... properly use the Home button of the iPhone. It turns out that $User here doesn't like Apple and iPhones, but she still wanted one because she thought that it could be funny or interesting to use get use to one... And with all that, I've finished my day 30 minutes after it should actually have ended.\n\nSo actually, giving a choice to users might not be a good idea.\n\nTL;DR =&gt; User chose an iPhone 7, was upset along all the configuration/delivery process and in the end, she actually hates Apple and iPhone but thought it could be fun to get use to one again.",
        "created_utc": 1524818466,
        "upvote_ratio": ""
    },
    {
        "title": "Allowing users to choose isn't a good idea",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8fa4ja/allowing_users_to_choose_isnt_a_good_idea/",
        "text": "[deleted]",
        "created_utc": 1524818274,
        "upvote_ratio": ""
    },
    {
        "title": "sometimes schmoozing is a Tech Skill - or how I became an \"Onsite\" and lived to tell the tale",
        "author": "harrywwc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f9x2z/sometimes_schmoozing_is_a_tech_skill_or_how_i/",
        "text": "I was catching up on /u/db_dev's previous stories, and gelled a bit with this one [The Blind Leading The Blind](https://www.reddit.com/r/talesfromtechsupport/comments/72bax8/database_support_11_the_blind_leading_the_blind/)\n  \nI (in this instance) being the (admitted openly in the interview!) \"incompetent boob when it comes to coding in C\" - the language of choice for the middle-ware I would be helping look after.\n  \nTurns out though, it wasn't my coding skills that were required - it was my 'people skills' - the art of schmoozing the customer. This was a skill I had been able to hone over the previous decade at a couple of US multinationals including |a|n|a|l|o|g|.\n  \nI had started working for this small multinational that had created some of the first generation Internet Banking software - which interestingly, we couldn't sell into the US because of the whole \"munitions thing\" about encryption at the time. And, of course, no one outside of the US was buying the US made software because who wanted 56 bit encryption from them when you could get 128 or 168 bit encryption from anywhere not US?\n  \nSo, it was that the relationship between the company (now defunct) and one of our BigBankCustomers (BBC) was somewhat \"dysfunctional\" (there were the beginnings of threats of lawyers at 20 paces).\n  \nLike /u/db_dev's \"Onsite\", I received a crash-course in the software - it sat as the third tier in a 5 tier environment, and was written mostly in C, but mostly I was brought up to speed on the product over all, the direction it was heading, and the fact that the BBC was more than a little tetchy (read *out and out pissed off*) with us.\n  \nAfter my first week with my new company, I spent the next 4 weeks with the team at BBC.\n\nI listened to their complaints, I made notes, I listened to more complaints, I made more notes (repeat a number of times) I sent emails back to try and get things done. And things got done. Not only did I have the responsibility, I had the _authority_ to get things done! (wow! that was a new experience - much different from the \"all responsibility, but no authority\" in several previous positions).\n  \nI will admit, in that month with the team at BBC, I went 'native'. I saw things definitely from their side - I saw my company as somewhat 'the enemy'. Well, maybe not 'enemy', but certainly un-friendly combatants. I went 'native'.\n  \nBut I did achieve the main goal - I normalised the relationship. I was someone well known to the BBC people, and I knew them. We had weekly teleconferences, and the first 10 minutes or so would be catching up on each other's families and such. Not very \"business-like\", but certainly useful in keeping the communications flowing.\n \nIt got to the point that they could ask for something, I would go and research, and I could tell them \"no\" - and they would accept it, because they trusted my judgement, that I had **their** best interests at heart.\n  \nNot really much of a \"tech-support tale\" (although there were a few there) - but certainly the 'other side' to having to train someone up to be \"OnSite\".\n  \nOh - and I was able to really hone my C Skills in that place when I got stuck into it. Even custom-tweaked some Open Source code for BBC. Should I mention the non-obfuscated passwords (which I noticed in the logfiles sent to me by snail-mail on a CD) \"emergency **mandatory** patch\" I rolled out to **all** our customers early 2000? nah! - might scare too many ;)\n\ntl;dr - sometimes an \"Onsite\" can actually be a 'good thing'^(TM)",
        "created_utc": 1524815215,
        "upvote_ratio": ""
    },
    {
        "title": "The IT equivalent of anti-vaxxers. More of a development/devops tale than tech support.",
        "author": "allmhuran",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f9wfx/the_it_equivalent_of_antivaxxers_more_of_a/",
        "text": "Some developers came to me for help with an SSIS problem this morning. The absurdity of what has followed has been of so great a magnitude that I have had trouble focusing on my own work. My brain keeps interrupting me with the \"how could anything so stupid actually happen?\" thoughts.\n\n&amp;nbsp;\n\nThis isn't the story of a million dollar system crashing, or a use who accidentally deleted their entire work product. No, this is the story of a couple of SSIS (SQL Server Integration Services) developers, their \"not really all that important in the scheme of things deployment\", and the project management office. It's not the grandeur of the context that makes this story so infuriating to me. It's the sheer ignorance and stupidity.\n\n&amp;nbsp;\n\n---\n\n*A bit of background for those unfamiliar with the tech: SSIS is a SQL Server product used to move data from place to place. Using a graphical IDE, you build a \"package\" which defines all the data flows etc. The package itself is actually just an XML file.*\n\n*Since we're dealing with data flows in SSIS, we are also dealing with connections. For example, to databases, FTP servers, web services, etc. Sometimes this means sensitive data might exist in the package - for example, and FTP username and password. So SSIS encrypts this data in the XML file. There are a few ways to do it, but basically only two matter: \"Encrypt sensitive data with user key\" and \"Encrypt sensitive data with password\".*\n\n*If you encrypt with a user key then only you can deploy the package to the SSIS server, because on deployment SQL decrypts the XML and re-secures it under a server storage model, guarded by standard SQL permissions.*\n\n---\n\n&amp;nbsp;\n\nOK, so the data warehouse SSIS developers come to me today because they have a problem. They can't deploy their packages to the dev server. \"What's the error?\", I ask. Nobody here - *not even the programmers* - seem to think the actual error text might be useful information. Oh, it's a protection level error. The server can't decrypt the file.\n\nI ask the obvious question: \"Did you encrypt with a password, or with a user key?\". The response was a bunch of non-sequitur content which basically told me they don't know what I was asking them.\n\nNot really having time to do a half hour \"SSIS 101\" lesson, I provided a trivial solution. \"There are a few ways to solve your problem\", I said, \"but by far the easiest solution is to change your package encryption to be by password. Then when you do the deployment you just type the pasword into the wizard\". I showed them how to do it on my machine. It only takes a few seconds.\n\nThe response was hesitant. They clearly didn't want to do this. Why not? \"We have hundreds of packages, that will take a long time\".\n\n\"Welll\", I replied, \"you don't really have much choice\".^([1])\n\n\"Wah\", they wah'd. I shrugged. \"There are no decisions to make here. Just do it and your problem will go away\". Off they trundled, and I went on with my own work.\n\n&amp;nbsp;\n\nA little over an hour later I noticed the same two developers were talking with the apps team manager. This is a reasonably technical person (more technical knowledge than the two devs in question, at least), who is somewhat familiar with the technology. I noticed that they had an error message floating above an SSIS deployment wizard window.\n\n\"Did you change the protection level?\"\n\n\"No\".\n\nI am immediately annoyed. I don't appreciate it when people come and use up my time asking for help, only to ignore the help that I provide. \"Why not?\".\n\n\"It would take too long\".\n\n\"You first came to me an hour ago. Even if you had simply gone into visual studio and changed every package manually, you would have been done by now. And you don't even have to do that. Did you try googling your problem?\". I knew, of course, that they hadn't. People rarely do, and in this case it was obvious they hadn't, otherwise they wouldn't have come asking for help in the first place. The solution would have been found on google almost immediately.\n\n\"Why?\"\n\n\"Because I'm sure there's a way to do this quickly for multiple packages. I haven't had to do it myself because I set encryption by password every time I start developing a package - *like the programming guidelines on confluence tell you to do* - but I bet there's a way\".\n\nNon committal response. OK, I walk 10 metres to my desk, google it, and walk back with the way to do it less than 20 seconds later. \"Use the dtutil.exe utility. It can change multiple packages at once. I sent you the exact command line you need to use.\"\n\n\"OK we'll talk to Charles\".\n\n&amp;nbsp;\n\nCharles is the project manager. For a brief moment I couldn't understand what he'd have to do with any of this. But then it dawned on me. The developers thought that this was a \"change\" that would require change management approval. I almost lost it right there.\n\n\"This is not the kind of change the requires approval. DTUtil is part of the integration services developer toolset. Protection levels are defined by SSIS, and so obviously SSIS knows how to work with both user key and password based encryption. This is not a logic change to your package, nor does it change the way you do your deployment.\"\n\n\"Yes, but changing the protection level requires change approval.\" This makes me furious, but I try to hide it. These people have already professed their ignorance on this subject, have come to me for help, and are now trying to tell me that this kind of change - which they don't understand in the first place - is the kind of change that requires change management approval. \n\n&amp;nbsp;\nThey took it to the project management office. The end result of the discussion *involving nobody who has any knowledge at all of what protection levels are*, the change to protection level was deemed \"too great a risk\". \n\nOf course, the protection level is changed to \"server storage\" *every time the package is deployed to a server*. So apparently deployment itself is also \"too great a risk\". But they don't know anything about protection levels, so they don't know that.\n\nThese are the IT equivalent of anti-vaxxers, making their assertions about how things work from a point of absolute ignorance, and even in the face of those with actual knowledge on the subject in question who are telling them otherwise. In this case, *literally to my face*.\n\n^([1] To be honest they did, but I didn't want to have to explain the \"don't save sensitive\" option, because that would change their deployment steps, since all config information would have to be entered post-hoc.)\n",
        "created_utc": 1524814972,
        "upvote_ratio": ""
    },
    {
        "title": "Let me tell you why they call me Firewall",
        "author": "anacronxinetd",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f9lg9/let_me_tell_you_why_they_call_me_firewall/",
        "text": "Let me share my misery with everyone. We have an extremely technically challenged CFO. He is the type of person that in his own words have built and designed Data Centers across the world, knows Bill Gates and the CEO of Dell, just to name a few. \n\nNow to start of this particular incident, it is important to understand this CFO will not be persuaded once he starts on a rant, he will explode and keep going till he is either dead or wins. We have fairly standard security across our infrastructure, one firewall and a proxy behind it. Now above mentioned CFO tried to do his banking at home two days ago, managed to lock himself out of his banking account. But it's important to note we have nothing to or any influence over what happens at his home and over the span of 4 years he has been constantly shown how to change the proxy settings for his browsers. Now come the following morning, I was off site training a new admin, when my colleague phoned me and asked me to head back to our main office as the CEO is apparently losing it. \n\nWe head over and what followed is probably best described as awkward and technically painfull. I walked in politely into his office and tried to greet, but at the site of me he just exploded further and said the following. 'ANACRON, I DON'T KNOW WHY YOU ARE ALWAYS FIREWALLING ME, I SPOKE TO A MICROSOFT EXPERT AND HE SAID YOU ARE SCRAMBLING MY PASSWORDS! YOU ARE SCRAMBLING MY PASSWORDS AND BECAUSE OF YOU I CAN'T OPEN BANKING SITE, YOU WILL OPEN IT NOW, IF YOU WANT TO GET PAID, I SPOKE TO BANKING SITE AND THEY SAID YOU FIREWALLED ME' \n\nHe kept going like that for a few more minutes. It's important to note that it took my CEO and colleague to calm him down. Just walked over, turned his proxy on, opened the site and walked out. \n\nThe thing I took away from this is that not the people you know, but the boxes you don't tick.",
        "created_utc": 1524810948,
        "upvote_ratio": ""
    },
    {
        "title": "Why Don't You Leave Early?",
        "author": "cubs223425",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f8ybf/why_dont_you_leave_early/",
        "text": "My boss has to do a lot of extra work during his time off, server/application maintenance on the weekends and such. He uses that off-time work as comp time to leave early on occasion.\n\nI, on the other hand, I have nothing better to do. I keep to my schedule and don't use my off time. My boss suggests I take time off every so often, but I honestly just don't want to. I definitely don't want to leave us with no IT department (we have just the two of us there) by taking time off when he's gone.\n\nToday, my boss was taking off a couple of hours early. We're at a slow time of year. I hadn't done much in the afternoon today, and my boss suggested I should go early as well. I told him I didn't really have anything else going on, so no reason to use time off to go sit at home and do nothing. When it was time for him to go, this was the silly, sad exchange we had:\n\n&gt;$Boss: All right, I'm out of here. I'll see you Monday. (he's off tomorrow)\n\n&gt;$Me: All right, I'll just be here, waiting for the day to end.\n\nIn steps a coworker known for his love of old technology.\n\n&gt;$Boss, to me: Why don't you--\n\n&gt;$Coworker, also to me: Can you print me a fax report?\n\nWe've got a multi-function printer with a fax machine, and he wants to see some log from the thing.\n\nI'm just laughing at the impeccable timing of this sadness.\n\n&gt;$Boss, to the coworker: Can't you print that yourself?\n\n&gt;$Coworker: No, the machine requires admin credentials to do it.\n\n&gt;$Me, wishing fax would just die already: This is why I can't go.\n\nLogged into the machine, dug around to find the fax report setting, then carried on about the rest of my unexciting afternoon. Fax machines are the worst.",
        "created_utc": 1524803091,
        "upvote_ratio": ""
    },
    {
        "title": "Because honesty is the best policy, right...?",
        "author": "tubeace",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f7876/because_honesty_is_the_best_policy_right/",
        "text": "[removed]",
        "created_utc": 1524785856,
        "upvote_ratio": ""
    },
    {
        "title": "This is why I hate Mondays",
        "author": "Vyprman",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f6zoc/this_is_why_i_hate_mondays/",
        "text": "As a bit of background to this, I currently work as an L2 for $MSP but I'm on semi-permanent loan to one of our clients. This works for them because they get someone to fill out their Onsite team but only have to pay 2/3 of what their own guys get paid.  \n\nSo it's Monday morning and I turn up (first as usual) to work to discover two P1 issues on the go.  \n\nFirst is a high percentage of people can't logon to Office 365 so they can't get their email or access the company SharePoint. The second issue is that the company's fancy new Papercut service for secure follow-me printing has died as well, no one can get logged into the big MFDs as it throws up an authentication failure.\nSo we get down to investigating and it looks like the VM Host that handles, among other things, the server handling the Federation Services to O365 and the Papercut server has decided to throw a major wobbler. We decided to power the VMs down and migrate the host to a different blade. It takes about three hours to do this because on restarting the VM's the backup routines decided to kick in and send the Load Balancer into a panic attack. We have to make a call to the company that handles the backup service (it's a cloud service) and ask them to cancel the backups for that day so we can talk the Load Balancer off the ledge,  give it a cigarette and a new pair of trousers to calm itself down.  \n\nThis is not helped by the procession of people wandering up to the IT desk to ask \"Is there a problem with email\\printing? I'm only asking because the helpdesk line is just ringing out\" (I lost count after the 13th inquiry and no shit the helpdesk line is ringing out what with the entire company blowing up their phones to ask the same bloody question)  \n\nSo we get the servers back up and running but performance Is still pretty crappy and when we checked, discovered the SAN for the cluster we migrated the servers to has a dead battery on the RAID array card so the RAID is running on 'degraded' status until the battery is replaced.  \n\nA call is duly placed to the company that support services are contracted to and request a new battery for the RAID card. several minutes go by as we haul serial numbers and part numbers from long forgotten databases or dredged up from the depths of HP's hideously designed iLO consoles. Order is placed and we are assured that a battery and engineer are on the way toot-sweet.  \n\nMeanwhile I am still fighting with the Papercut server and I'm trying to figure out why the server is throwing JavaScript errors. After the 7th person to enquire if I knew if there was a problem with printing and when it would be working again (No, I didn't know there was a problem with the printers, I'm just reviewing these logs because they are an absolutely riveting read that would put Stephen King to shame) I put a sign in front of my desk that reads  \n\n&gt;Yes, There is a problem with the printers. No I don't know when it will be fixed. Please leave me alone, the fewer questions I have to answer, the quicker I can get this fixed.  \n\nIt doesn't help.  \n\nEventually I get the main Papercut Server back to life after finding, buried in the log file after the umpteenth restart, a line that reads - \"Failed to start application, please try deleting the c:\\Program Files\\Papercut MF\\Server\\Data\\Internal\\job-event-store.mapdb.p file and restart the application\"  \n\nSo I rename the file and restart the application and wonder of wonders, it fires into life. But we still can't print. I check the site server (Each site has it's own print server that has to sync it's own database with the central server) and it's complaining that it's running a different version of the database application from the main application server. This causes some head scratching as no one has done any updates on these servers since the application was installed. Several attempts at restarting the site application failed and we resort to \"Google the error message\" and find that the real problem is that the database is actually corrupt. We have two choices according to the documentation. We can restore a database backup or nuke the application from orbit and reinstall (It's the only way to be sure).  \n\nI take a look at the instructions on how to restore the database backup and decide on the nuke option (5 pages of Powershell commands to restore a backup or 5 minutes to uninstall and reinstall and let it pull a copy of the database from the central server).  \n\nAfter ten minutes of reinstall and careful chanting of the IT workers prayer (Work ya c*nt, work ya c*nt, work ya c*nt) the site server is back up and running. Hooray, useless pie charts can be printed again!  \n\nAt this point the package containing the RAID card battery has arrived, so the engineer should show up shortly. We open the package to discover..... A CR2032 coin cell battery. The type used on motherboard BIOS, not the large Li-Ion battery pack we had been expecting.   \n\nThey shipped same-day from the other end of the country, at great expense, a coin cell battery that we could have bought from the convenience store across the road!  \n\nThe engineer turns up about 5 minutes later as we are all gazing in dumbfounded amazement at this package. On the plus side, the engineer knew some truly impressive swear words so it wasn't a complete loss.  \n\nAnd to put the topping on this day? Both the coffee machines in the building decided to break down as well. I had to deal with all the above **WITH NO FREAKING CAFFEINE!!!**",
        "created_utc": 1524783718,
        "upvote_ratio": ""
    },
    {
        "title": "20 years nearly in IT and no US workers seem left now",
        "author": "dnbdave",
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/8f0wgd/20_years_nearly_in_it_and_no_us_workers_seem_left/",
        "text": "",
        "created_utc": 1524781252,
        "upvote_ratio": ""
    },
    {
        "title": "$Hardwork",
        "author": "Johnny21071",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f5v1a/hardwork/",
        "text": "[removed]",
        "created_utc": 1524774339,
        "upvote_ratio": ""
    },
    {
        "title": "I’m not a gamer!",
        "author": "Motioneer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f5pcq/im_not_a_gamer/",
        "text": "Hey tfts! LTL FTP \n\nI’m not sure if this fits ‘tech support’, so please remove if it’s not.\n\nSome context:  \nI work at a Virtual Reality Arcade. So basically where people can go to play VR-games. The staff helps people out with the equipment and is generally there for them.\n\n*So let’s begin the tale to end all tales.*  \nIts’s a usual day, not to busy, we are all doing our stuff, in my case that was sitting in a corner with my laptop trying to figure out why the damn wifi was down again. My college was taking care of some customers, in his usual cheerful manner. This guy could make anyone feel at home, and was genuinely the nicest person I have ever met. He was perfect for the job. \n\nMost of our customers are unfamiliar with VR and are trying it for the first time, so some calm guidance is quite important. Whenever a new customer entered, he would cheerfully greet them with the casual attitude of greeting an old friend.  \nAnd he did exactly that when our antagonist entered. The door flew open, his face grim, and his ginormous muscles tense. A perfectly tailored suit and the slim blonde following him completed the look of “people I don’t want to sit down and have a beer with”. My colleague, undisturbed, does his usual friendly greeting and quick introduction into how we operate.   \nIn return, only some sparse words and the statement: “I’m not a gamer.”  \nNot to worry, my lovely co-worker recommended an easy introduction game to him, which he begrudgingly booked, and they were on their way to the play area.  \nHis girlfriend meanwhile ordered a glass of wine at our included bar and sat to watch him play.\n\nNot long after, my colleague came back in his adorable “I sometimes forget I have knees” waddle and started opening a soda.\n\n**Thump**\n\nWe shared a look.  \nHe made his waddle back to the station, only slightly faster.\n\nThe customer dropped the controller.   \nThat’s not uncommon. People in VR sometimes forget that the table in front of them is not really there and anything they try to place on it will inevitably crash to the floor. Happens. That’s why we have carpets.\nCo-worker picks the controller back up and places it into the hand of the customer, clearly lost in the experience.\nThe waddle back commences and…\n\n**Thump**\n\nHe dropped it again.  \nWe again exchange a look. Slightly longer.   \n\nSomeone this slow to learn was a first. Not to worry though.\nWaddle to him. Pick up. Place in hand. Waddle ba..\n\n**Thump**\n\nThis time the look we exchanged was shorter. And he looked angrier.  \nAs he reaches the customer he asks him: “Hey, you know you need the controller for the game, right?”\n\n“I’m not a gamer!”\n\nGreat answer. My colleague does the whole procedure again, saying “That’s ok, if you don’t want to play anymore you can just place the controller on the…”\n\n“I’M NOT A GAMER!”\n\nAnd of course:\n**Thump**\n\nThat was enough. Co-worker stops the game and takes the VR-goggles of him, while calmly but insistently saying “I’m sorry but if you want to use our equipment you ..”\n\nThere the customer lost his excrements.  \n“HOW DO YOU DARE STOPPING MY GAME! I PAYED FOR THIS! AND I TOLD YOU MANY TIMES I’M NOT A GAMER!!!”\n\nHis girlfriend clearly got uncomfortable, shifting in her seat, looking around.   \nAnd she was not alone. The other guests where looking at the whole scene, not sure how to behave.\n\nScreaming at us: Happens. \nPotentially damaging expensive equipment: We’ll repair it.\nBut making our other guests uncomfortable was not something he would tolerate.\n\n“Look here my friend. (Listen up shithead.)  We are doing our best to give everyone a good time. (We usually can deal with a++holes.) But if you do not care to give us and our equipment at least a little respect, (If you have to behave like a c+nt,) we will not be able to provide you with our service. (You can go f+ck a landmine.)” \n\nAnd so, the customer got furious. A mountain of a man, red in the face, stormed out while yelling insults. I would not have wanted to get in his way, I like my teeth how they are.  \nHis slim blonde girlfriend scurried after him.\n\nAnd for us that was that. Everyone was relieved that he was gone, the other guests visibly relaxed, and my co-worker waddled back to me, still slightly grim.  \nAfter a few minutes we have laughed the whole thing off and where looking forward to a less eventful evening with the other, so much nicer, customers.\n\nBut then he came back.  \nAnd the transformation he had went through was miraculous.  \nNothing of the steaming, red faced, brute was left. Through the door came a smaller man, head hanging low, shoulders sacked.  \nHe made his way to my colleague and, while barely looking him into the eye, said, “I’m sorry how I behaved. This was not appropriate. If I damaged something, I would like to pay for it.”  \nA little astounded my co-worker just said something about it being ok, and that he is glad he apologized.\nAs quickly and as inconspicuous as possible he left again, the scorning grins of the other guests following him.  \nHis small slim girlfriend, suddenly looking much taller, with a satisfied look on her face, pat the customer approvingly on the shoulder.\n",
        "created_utc": 1524773098,
        "upvote_ratio": ""
    },
    {
        "title": "Word Perfect 3.",
        "author": "mzegilla",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f5p52/word_perfect_3/",
        "text": "[removed]",
        "created_utc": 1524773056,
        "upvote_ratio": ""
    },
    {
        "title": "Don't touch it's doing something!",
        "author": "Camo5",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f5ekh/dont_touch_its_doing_something/",
        "text": "[removed]",
        "created_utc": 1524770771,
        "upvote_ratio": ""
    },
    {
        "title": "my email doesn't work",
        "author": "samiam7526",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f5c9s/my_email_doesnt_work/",
        "text": "[removed]",
        "created_utc": 1524770249,
        "upvote_ratio": ""
    },
    {
        "title": "New Menu Item",
        "author": "iamdleerious",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f566w/new_menu_item/",
        "text": "Store Manager:  Hey our deep fryer is broken....\n\nMe:  Let me transfer you to operations.\n\nStore Manager:  But aren't you IT?\n\nMe:  Yes and this is not IT related...\n\nStore Manager:  Well the computer fell into the deep fryer.  That's how it broke....\n\nMe:  ......... \n\nStore Manager:  Oh yeah... So the computer is broken too.  Maybe I should've started with that one. \n\nMe:  I have no words...",
        "created_utc": 1524768952,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried shutting down? No... not your computer.",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f51o7/have_you_tried_shutting_down_no_not_your_computer/",
        "text": "You know its close to summer when you receive 5 tickets in the span of a month about the same thing. This is not a tale of woe or my ingenuity or some epic tale of me being some IT hero. These... these quick stories are just sad. \n\nLast week I am working a dead support area because things are magically working for once. Random call comes in to me, because I had been idle for over an hour in the system, and the phone call is just... just yeah. \n\n&gt; $SU1 = Sad user 1\n\n&gt; $me = me\n\n&gt; $SU1 - So I am about to go on a cruise with my family. The route we are taking will take us through to Japan, the Phillipine's, and finally down to Australia. I am being told that my email wont work outside america. \n\n&gt; $me - This is partially correct. You cant access your email outside of the US. But you can access citrix and there by access your email inside of citrix. \n\n&gt; $Su1 - Ah ok. So when we are out at sea, and there is no internet connection. How do I access my email?\n\n&gt; $ME - You don't. If you have no internet you cant use the internet to access your email. \n\n&gt; $Su1 - Oh duh... So what am I supposed to do then?\n\n&gt; $Me - Umm... enjoy your cruise? \n\n&gt; $SU1 - Not funny. Ok kinda funny. But I will be out of pocket for 2 weeks on the way to Japan. I cant be without email for that long. \n\n&gt; $Me - Well I do apologize but I will be unable to help if you have no internet. \n\n&gt; $Su1 - I guess if that is that. \n\nThis lady ended up not going on the cruise. \n\nMonday. \n\n&gt; $Su2 - Hi I am in Cambodia right now and I can not talk for long. I am trying to access my email and I have no access to citrix. What options do I have?\n\n&gt; $Me - none. Email is geolocked and you are outside of the permitting area. \n\n&gt; $SU2 - I cant be without email for 3 weeks. I just cant. Can you remove the geolock?\n\n&gt; $Me - No. For obvious security reasons. \n\n&gt; $SU2 - NO I mean just for me. \n\n&gt; $ME - That is not possible. It is either on, or it isn't. I just cant turn it off for 1 person.  (No clue if true said it because this user was getting pissy with me.) \n\n&gt; $SU2 - Can you just turn it off then for five minutes? It is vital that I get my emails. \n\n&gt; $Me - Uhh.... no that is not possible. \n\nHE hung up. \n\nLast one was a simple ticket in the system. \n\n&gt; $SU -  I am on vacation to the seychelles and a storm knocked out the wifi here. It is spotty at best and citrix refuses to work. I NEED my emails. There are very important emails coming in that need to be responded to. \n\n&gt; $me - I do apologize for the inconvenience. It looks like all of your emails have already been forwarded to your assistant and and your LOA appears to have been handling the paperwork aspect. Looks like all of your bases are covered and need no input from you at this moment. \n\n&gt; $SU3 - Dont you understand I am a people person dammit. I have people skills.\n\nOk... maybe his reply went like this. \n\n&gt; $SU3 - Every document has to be reviewed and everything needs to be handled by me. Yes my LOAs do have the knowledge and authority to do this, but I am the LO and have the final say. \n\nI closed the ticket then and there as I realized his forwarding was set to turn off tomorrow. He was flying back tonight and griping about not being able to see emails for the last day of his trip. ",
        "created_utc": 1524767968,
        "upvote_ratio": ""
    },
    {
        "title": "Stop that, right now.",
        "author": "Doomscrye",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f4pqt/stop_that_right_now/",
        "text": "Hi everyone, I haven't posted one of these in a while, and just remembered a story back from my time spent working at $localisp.\n\n\n\nPlayers:\n\n\n$me— yours truly\n\n\n$og— older gentleman\n\n\n\n*ring ring*\n\n\n\n&gt; $me: Hello, you have reached $localisp, $me speaking. How can I help?\n\n\n&gt; $og: *grumpily* My TV's not working. This crap keeps breaking all the time and you never fix it right!\n\n\n\nUh-oh...\n\n\n\n&gt; $me: I'm certainly sorry to hear that, let's get your account verified and then see about fixing it.\n\n\n&gt; $og: Look, you already know who I am, just fix the *redacted* thing.\n\n\n\nMeanwhile, in the Batca... err, call center, I'd been checking his account notes. As it turns out, $og had a bit of a reputation for being a rude, shouty jerk on the phone, and calling all the time, about everything. (I'm sure some of you already know where this is going)\n\n\n\n&gt; $me: I'm sorry that you're frustrated, Mr. $og, but I'll need you to help me sort this out for you. What we nee...\n\n\n&gt; $og: Why do I need to do anything to help you fix your *redacted* when this *redacted* keeps happening? \n*much profanity and complaining, use your imagination*\n\n\n\nI'm not putting up with this.\n\n\n\n&gt; $me: Sir, stop. Stop talking, right now. You called for help, did you not?\n\n\n&gt; $og: Yeah...\n\n\n&gt; $me: Then you're going to be civil and cooperative and let me help you, or I'm disconnecting. Do you understand?\n\n\n&gt; $og: Fine.\n\n\n\nNormal cable troubleshooting begins, you know the drill.\n\n\n\n&gt; $og: Hey, $me, thanks for putting up with me. I'm sorry for being so rude, I just don't really have anything else to do without TV. There's nobody to talk to and I don't get out much, these days. I shouldn't take it out on you.\n\n\n&gt; $me: It's alright; nobody's perfect. What sorts of things do you like to watch?\n\n\n&gt; $og: Mostly sports. $Team has been doing pretty well this year.\n\n\n\nTroubleshooting continues during discussion of various kinds of $sportsball. We wound up on the subject of the local college (my alma mater) football team, which is a fairly big deal in my hometown. We may not be very good, or very consistent, but we make up for it with enthusiasm! Anyway, it turned out to just be that the remote was set to the wrong source and on the wrong input.\n\n\n\n&gt; $me: Cool, so, looks like that's under control, now. Anything else that I can help with?\n\n\n&gt; $og: No, that's everything. Thanks for being patient with me.\n\n\n&gt; $me: Of course. Feel free to ask for me if you need to call in, my extension is ###.\n\n\n&gt; $og: Thanks! I'll do that.\n\n\n\n$og called in a few more times while I was still working there. I always made sure to take my time so we'd have an excuse to chat, since I figure that he was probably just lonely more than there being something actually out of order. He was a pretty cool guy, all told.\n\n\n\nTL:DR Sometimes an angry person is just bored and lonely, and may actually be pretty decent. Asserting yourself without being condescending can work wonders on these people (and others, too).\n\n\nEdit: I'm bad at formatting.",
        "created_utc": 1524765528,
        "upvote_ratio": ""
    },
    {
        "title": "Lemme just encrypt these critical backup keys...",
        "author": "chientaylor",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f4k22/lemme_just_encrypt_these_critical_backup_keys/",
        "text": "A few weeks ago, we had a sudden power fluctuation of a system, which caused a massive amount of disk corruption, to the point where no data recovery could help. This was a critical web service, since it had all of our internal tools and documentation, along with a password manager and service monitor.\n\nMeh, no biggie, I thought. We have a full backup solution, which runs every day. I’ll just restore from there.\n\nLooking at the backup logs on the server caused my concern to rise. Someone had obviously changed something with backups, since the “daily backups” hadn’t run in over a year, each with a “Error: file ‘gpgkey’ not found” error. Well, an out-of-date restoration is better than no restoration.\n\nAfter accessing the backups, though, my annoyance turned to alarm. All of the backups had been GPG encrypted.\n\nDigging around a bit more, I found a script called “restore.sh”. Inside, it called the pub/private keys and decrypted the file specified with a password as input. I thought I knew the password, so I ran the script.\n\n“Error: file ‘gpgkey’ not found.”\n\nHmm. Could it have been moved? It might have been an NFS mount. Nope, the directory was directly in the root partition.\n\nAfter navigating to that directory, though, I realized what was happening. The file was “gpgkey.aes”.\n\nSomeone had encrypted the private key needed for running and decrypting our backups.\n\nAfter a rageping of our department’s Slack and numerous emails to former students (Uni CS Department, students are the staff), I finally found who did it.\n\nExcept he didn’t know the password.\n\n“Check the password manager,” was his response.\n\nYou mean the password manager I’m trying to restore from backup? Great.\n\nSo now we have a worthless backups solution, no internal tools, and a VERY important lesson: If you have to encrypt the backups, do it in a way where they can actually be restored without a single point of failure.\n\nTL;DR: student encrypts private key needed to restore and encrypt backups, while putting the password to decrypt in the backup we’re trying to restore.\n\nEdit: punctuation is hard",
        "created_utc": 1524764342,
        "upvote_ratio": ""
    },
    {
        "title": "On the subject of puns...",
        "author": "theservman",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f4bta/on_the_subject_of_puns/",
        "text": "[removed]",
        "created_utc": 1524762606,
        "upvote_ratio": ""
    },
    {
        "title": "User wants the D:\\",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f3w6l/user_wants_the_d/",
        "text": "Tech: Thank you for calling XYZ Help Desk...*get initial user information*\n\nUser: I got a new laptop, and it doesn't have a D:\\ drive.  I need one.\n\nTech: Sure, do you need a HDD or a CD or DVD drive?\n\nUser: Yes.\n\nTech: Which one did you need?\n\nUser: I need a D:\\ drive.\n\nTech: The letters are arbitrary - they can be assigned any letter.  Which kind of drive do you need?\n\nUser: A D:\\.\n\nTech: What do you need to use it for?\n\nUser: I have a C:\\ and I need a D:\\.\n\nTech: What do you want the D:\\ to do?\n\nUser: I got a new laptop.  It has a C:\\ but I need it to have a D:\\.\n\nTech: Do you need the D:\\ to be an additional HDD, a CD drive, or a DVD drive?\n\nUser: I'll ask my manager.  \n*click*",
        "created_utc": 1524759345,
        "upvote_ratio": ""
    },
    {
        "title": "Best pun of my career",
        "author": "LorixsTyring",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f3u70/best_pun_of_my_career/",
        "text": "Hello all!  \n\nAs the title states I just got to use the best pun in my career!  \n\nI got a call from one of our receptionists saying that some of the keys on her keyboard are getting stuck. So I grab a spare keyboard just in case and get over to her office.  \n\nWhen I get there the first thing I see on her desk is a (mostly eaten) bagel with jelly on it. I bet you can all see where this is going...  \n\n&gt;Me: Were you eating that at your desk?  \n*The user nods taking a drink of her coffee*  \n\nI smile and sit down at her desk and start popping off a few keys. Sure enough there was jelly under some of the keys. I look up and I can see the receptionist is already red in the face from embarrassment. That is when I got to deliver my best one liner...  \n\n&gt;Me: Well, it looks like your keyboard is.... *puts on sunglasses* jammed.  \n\nI love puns. ",
        "created_utc": 1524758920,
        "upvote_ratio": ""
    },
    {
        "title": "The power of technology",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f3buz/the_power_of_technology/",
        "text": "[removed]",
        "created_utc": 1524755055,
        "upvote_ratio": ""
    },
    {
        "title": "Broken laptop webcam",
        "author": "Twitch8605",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f2d18/broken_laptop_webcam/",
        "text": "[removed]",
        "created_utc": 1524746850,
        "upvote_ratio": ""
    },
    {
        "title": "No comments? No problem. Got the important ones.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f13rp/no_comments_no_problem_got_the_important_ones/",
        "text": "[removed]",
        "created_utc": 1524731506,
        "upvote_ratio": ""
    },
    {
        "title": "not that sort",
        "author": "richardex",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8f0i9i/not_that_sort/",
        "text": "head down, trying to draw data maps (oh, so i AM responsible for GDPR, thanks for the notice), and i am aware that a large gentleman is standing over me.\n\nDo you get people \"hover\"? We are pretty small, and we don;t have a ticketing system, so generally people email me, if it is urgent phone me, or if they think they are important just appear over me, silently, assuming that i will give them my immidiate attention whatever i am doing.\n\nNo idea who this is, but he has come in, got past reception, across the building and is right next to me, bellowing \"are you richardex - they said you were the person i need to see\".\n\n\"Uh, ok, what can i do for you?\"\n\n\"They said you were the person to talk to about windows\"\n\n\"i guess so - whats the problem?\"\n\n\"i am here to wash them\".\n",
        "created_utc": 1524723286,
        "upvote_ratio": ""
    },
    {
        "title": "No, your IP Address Being 'corrupted' is not the issue",
        "author": "HPUser7",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ezbyr/no_your_ip_address_being_corrupted_is_not_the/",
        "text": "Context: I work as tech support in a university computer lab.  \nA client comes in with MacBook she checked out from the university; she also has her personal Dell and a hard drive with her. She needs to get 40GB of data onto her personal hard drive. Apparently she can't copy and paste it on the hard drive and she suspects its because the 'IP Address on the MacBook was corrupted.' Ignoring her assumption (totally 100% believe an IP address being corrupted is a thing, and that it would affect file transfer), I immediately check the hard drive file format, and it is indeed NTSF, so she won't be able to write to it from her MacBook. I let her know she is going to have to format it if she wants to use it. But no... apparently, she has files on it, files that for whatever reason cannot be copied onto either her personal computer or the MacBook during the format. I let her know that she will have to buy another drive then or do a long and painful cloud upload if she is unwilling to copy drive files somewhere else. What does she proceed to do with those three clear options? She sits down a Mac Pro (I warn her again that she will be able to read, but not write to the drive), redoes all of her work and come back in two hours with the same issue. I explain it again and she then blames the university computers and their IP addresses for her problems *sigh*\n\nTL;DR: customer refuses to believe file format systems is a thing and blames savings files to a NTFS issues on the University for having IP Addressing problems",
        "created_utc": 1524710055,
        "upvote_ratio": ""
    },
    {
        "title": "I just had the most adorable conversation.",
        "author": "StandingByToStandBy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8eyu1w/i_just_had_the_most_adorable_conversation/",
        "text": "I started doing tech support for my community in Houston. A lot of people are getting back into their homes and need help with new equipment being issued that was destroyed during hurricane Harvey. Yeah, some people still ain't back in their houses. The tech support I run is very minimal. I can help connect devices to the internet and so on so forth. This is important because I live in an \"older\" area. These people retired here. Not very tech savvy, but I can work through that since I don't have time constraints and I'm doing this for free.\n\nThis lady brightened my day.\n\nI gave her my google voice number after letting her know I'm gonna need model numbers for the devices she was having issues with. She called and gave me a list of model numbers for things that weren't working. Well then. I didn't expect that to actually work. We try to troubleshoot some of her satellite based TV box issues, which all led to call satellite based TV company because this is beyond me and I'm physically 2.5 hours away.\n\nWe go to her PC issues next. It wont connect to the internet. She got a new modem, so its likely she hasn't connected it to her new AP. No big deal deal.\n\n&gt;Me: \"Go ahead and write down the name on the sticker, and the password. Its important that these match exactly. If its capitalized, capitalize it. If its lowercase, it needs to be lowercase\"\n\n&gt;Nice Lady: \"I got it written down, what next?\"\n\nI walk her through the windows wifi setup and the password keeps failing.\n\nAfter 3 trys I'm fairly confident she's not messing this up, so i tell her we are gonna try the push button method to make this user proof. On the way downstairs to the modem, she asks if it has to be exactly what the sticker says.\n\n&gt;NL: It says to use the % sign, is it okay if I just type 0/0, because that's what I did.\n\n&gt;Me: *giggling* Yes, it needs to be a percentage sign. It needs to be exactly as shown on the sticker.\n\n&gt;NL: Oh. Thats probably where I messed up, haha.\n\nI was laughing with her the entire way back to the computer. She put in the correct password and everything worked perfectly. Got her connected to the internet and she was way more excited than she should have been. Normality is nice, I can respect that. Did the same process for her phone, got her off of mobile data. She was overjoyed. \n\nEvery bit of instruction troubleshooting she took in stride. Checking connections, resetting things, making sure things have power. She was a joy to deal with and kept thanking me for not treating her like an idiot.\n\n&gt;Me: \"Mam, I like computers. Its something I enjoy and like to learn. Just because you don't enjoy them the way I do does not make you an idiot.\"\n\nI know you guys mostly run corporate stuff with angry users. I don't want any bit of that. If I can help a grandma from 150 miles away over the phone using google to look at port layouts, you better believe I am going to do it. Shes happy now because she is connected.\n\nSide note. I informed her I was gonna record the call for my use. I have the audio of this all. I plan on listening to it later.\n\nTLDR: I spent an hour an 10 minutes helping an older lady get her PC connected to wifi. % == 0/0 \n\nShe was an absolute doll.",
        "created_utc": 1524705262,
        "upvote_ratio": ""
    },
    {
        "title": "Short and sweet...",
        "author": "PacketPuncher",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ey4kg/short_and_sweet/",
        "text": "Customer: Hello, ISP. I'm a belligerent communicator and our internet has been down for 2 days. When are you going to fix our internet?\n\nMe: We reviewed your issue 2 days ago and determined that your problem lies within your private network and contacted Steve regarding this issue. We're seeing port 0/2 down as if nothing is plugged into it.\n\nCustomer: I have no idea what you're talking about. You're saying I need call my corporate IT department?\n\nMe: ......yeah. What's their number? I can tell them exactly what's going on\n\n*click*\n\nMe: *bring bring*, Hi, Corporate IT Department. Can you please check to see if your cable is plugged in. No? It's not? ....You're seeing the internet is back up for that site now? Ok, thank you. Bye.\n\ntl:dr;  Customer's business operations dead in the water for 2 days because a cable came unplugged on site. Customer had in-house IT and didn't call them first.\n\n\n",
        "created_utc": 1524698854,
        "upvote_ratio": ""
    },
    {
        "title": "\"Exempt means Exempt\"",
        "author": "lost_idol",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8exp1q/exempt_means_exempt/",
        "text": "[removed]",
        "created_utc": 1524695067,
        "upvote_ratio": ""
    },
    {
        "title": "You actually have to give me the Device.",
        "author": "ThrowAlert1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8exozu/you_actually_have_to_give_me_the_device/",
        "text": "Wrapping up a month at the walk up ~~help~~ desk and it seems like people know so they've decided to be more unreasonable than usual. \n\n*The case of  \"Hands Free Phone Setup\"*\n\n**U** for User\n\n**M** for Me\n\n**U**: Do you guys put email on my phone?\n\n**M**: Sure can I *gestures for phone*\n\n**U**: Cause I was here like 2 weeks ago and the guy didnt help me.\n\nI've been at this desk for a month and I've never seen you before in my life. But Okay.\n\n**M**: Alright but I kind of need *gestures for phone again*\n\n**U**: So can you do it or not?\n\n**M**: Sir, I already said I can do it so can you -*gestures*\n\n**U**: What? What?! *mimics my gesture* what do you want?\n\n**M**: Sir I actually need the phone to-\n\n**U**: You know what? I'll come back when its someone different.\n\n**M**: Oooh Kay. Have a good day, sir.\n\nTech takeaway for the Day: At least he wasnt asking me to violate basic IT Security policy.\n\n---\n\n*Bonus: Answering an Unasked Question*\n\n**U2** for another User\n\n**U2**: So the 2 factor doesnt come on for my second email address I have access to.\n\n**M**: Alright what's the email address? \n\nShe gives it to me. \n\n**M**: Okay, I've put in the ticket to the relevant team. They'll contact you if they need more information. \n\n**U2**: So to get access to my emails outside the network I have to login. Then go to my phone. Approve. And then I would be in the email.\n\nCut down for time but that's essentially what she said with me going \"mhm. Yup. That's how it works. Yes.\" \n\n**U2**: So you're not going to answer my question?\n\n**M**: Maam, you didnt ask me a question.\n\n**U2**: So that means you cant  fix it?\n\n**M**: I've done all I can ma'am. I have neither the knowledge or the permission to fix what could just be a simple switch.\n\n**U2**: If its just a switch why cant you do it now?\n\n**M**: I said it could be, not that it is a simple switch.\n\n**U2**: Well you're no use then.\n\nTech Koan for the Day: How does one answer an unasked question that lives in the mind of the asker.\n\n",
        "created_utc": 1524695056,
        "upvote_ratio": ""
    },
    {
        "title": "A View to a Kill",
        "author": "dstbl",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ex6pn/a_view_to_a_kill/",
        "text": "I am a designer. Y’know, the guy the business folks like to tell “I don’t care how it works, just make it pretty.” And yet somehow, I’m seen as the tech support guy in the office (and at home, and at parties, weddings, baseball practice...) because I “work with computers.”\n\nI also think it’s partly due to the fact that I can read and comprehend things.\n\n10 minutes ago, another designer (who is my age but dresses like my teenager) came over to me and said he was having trouble with his software, could he get some help? Sure thing Dudebro Designer (DD)\n\nI come over and he’s got the software open at least...\n\nDD: “I want to view the layer groups but the column went away. I don’t know how to get it back.”\nMe *internally*... Dudebro is either an idiot or the software has a major bug I’ve never seen... let’s see what’s behind door number 1 Bob!\n\nSo I lean over, grab his mouse, roll his cursor ever-so-gently to the top of the screen where the View menu is, then deliberately scroll gently down to the currently unchecked “View Layer Column” item... and then hammer the hell out his mouse button while looking him in the eye.\n\nAfter dying a little inside...\nMe: “Fixed!”\n\nAt least he thanked me.\n\nTL;DR - Dudebro can’t be bothered to actually open a menu and now I have Duran Duran stuck in my head.",
        "created_utc": 1524691018,
        "upvote_ratio": ""
    },
    {
        "title": "\"Your software update is incompatible with this thing you told us not to install because it's incompatible!\"",
        "author": "QuantumDrej",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ex2m5/your_software_update_is_incompatible_with_this/",
        "text": "$Software - The software we support.\n\n$Program - A program that is not in any way related to or built by us, but one that we provide an integration for that a lot of customers like to use. It's an alternative financial program that a lot of people use alongside $Software.\n\n$IdiotClient - Self explanatory.\n\nLong story short, $IdiotClient asked us if they could go ahead and upgrade their version of $Program. We explained that the newest version of $Program is not yet compatible with $Software. $IdiotClient says that's ridiculous and that they wanted to upgrade $Program anyway. We basically told them we weren't responsible for what happens. \n\nYesterday, this happens (paraphrased).\n\n&gt; **$IdiotClient**: $Program isn't loading correctly or balancing with $Software! Fix it!\n\n&gt; **Us**: I see from Ticket #12345 that we advised you not to upgrade $Program until the integration for the newest version was available. \n\n&gt; **$IdiotClient**: We never said anything like that! Fix this, this is your fault! Your software should be compatible with ALL versions of $Program! This is screwing up our reports! We need these for our account manager TODAY.\n\n&gt; **Us**: Well, if you roll back to a previous version of $Program, you should be able to work until the new version is compatible with $Software.\n\n&gt; **$IdiotClient**: We shouldn't have to do that, now fix it!\n\n&gt; **Us**: We're sorry, you opted to upgrade to a version of $Program that isn't compatible with $Software despite our many warnings. Unless you wish to roll back $Program to an earlier compatible version, we cannot assist you.\n\n&gt; **$IdiotClient**: *hangs up and goes to the ticket to CC out their rage on every possible company email relating to us they can find*\n\nTL;DR: Don't do the thing we told you not to do and then get mad when shit breaks. ",
        "created_utc": 1524690120,
        "upvote_ratio": ""
    }
]