[
    {
        "title": "Painful Irony",
        "author": "BradenA8",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gek8x/painful_irony/",
        "text": "I work in the back office Tech Team of a call centre for a large British electricity and gas supplier in the Erroneous Transfer department. My job is to deal with non-customers who's gas and electricity supplies have joined us without their consent or with our customers who's supplies have left us without their consent. \n\n\nI took a call from one of our Customer Service agents who had one of our customer's on the other line. Our customer had recently been burgled and at the same time, had received an e-mail from us stating his gas supply was leaving for another supplier. Although the two are most likely not linked at all, due to his (understandable) paranoia about the burglary he wanted to know who the supplier is who's taking the supply and for us to put a stop to it as he did not request this. \n\n\nLuckily I didn't have to speak to the customer, as it is the first line agent's job to do so in this scenario. Because I did not want to be the one to tell him that 'Robin Hood Energy' was the one trying to take his supply...\n\n",
        "created_utc": 1511973412,
        "upvote_ratio": ""
    },
    {
        "title": "Turkey Day Emergency, or, You Didn't Follow The Process So You Didn't Get The Work",
        "author": "SnArL817",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gejm7/turkey_day_emergency_or_you_didnt_follow_the/",
        "text": "The week before Thanksgiving, I get a request for the development team. They've spun up a new test environment, and wanted a VIP set up on the load balancer. The network team provisions and configures the VIP, then sends me the ticket to add the VIP hostname to DNS. Easy-peasy, I update the zone files. The next week, I'm on vacation.  \n  \nImagine my surprise when I check my phone the next week and see that the development team is FREAKING OUT because they can't hit the VIP from the Internet.  \n  \nTheir application integrates with an external company, and the external company can't connect to the application. The development manager asks the Internet for the IP associated with the hostname, and gets a response that the name doesn't exist. This is because we have 2 DNS servers: internal and external. Now, adding a hostname to the internal server just takes an approved request. It's no big deal. And since they use the load balancer for EVERYTHING (that's an issue in and of itself), it's not uncommon for networking to create VIPs for the applications to use internally.  But if they want a hostname EXTERNALLY resolvable, it take a CHANGE ticket. You know, because the external DNS is *kind of important*.  \n  \nThey never submitted a change ticket. So the entry was INTERNAL only. Meanwhile, my team is chasing their tails looking at firewall rules. Good thing I'm on vacation and don't have to deal with this shit!  \n  \nOf course, this gets escalated because it's SUPER critical that we fix a non-prod issue. Development OPENS A CRITICAL INCIDENT WITH CORPORATE INCIDENT MANAGEMENT ON THANKSGIVING DAY. They page out the oncall, who is also on vacation that week. He tells them that it can wait, because they need a CHANGE TICKET for us to touch the external DNS server.  They are not happy. That's fine...he's MAD because they interrupted his holiday for a non-prod issue.  \n  \nMonday morning, I get to the office and my boss wants to know why development opened a critical incident on a holiday. I explained that they didn't follow the process for making a change to the external DNS, so the entry wasn't created. Then the developer stops by and wants to know why I need a change ticket when one was never needed before.  Well, the previous team didn't do things right. As evidenced by the MOUNTAIN of issues I'm trying to fix. They'd been told when I took over that we need change tickets for external DNS updates. Apparently they didn't think it applied to them. Or, more likely, they didn't know that they needed their VIP to be externally resolvable.  \n  \nEither way, I told MY management that if this happens again, they'll only get support during business hours. Non-prod is non-critical...I don't care HOW important your project timeline is.",
        "created_utc": 1511973271,
        "upvote_ratio": ""
    },
    {
        "title": "That time everyone lost SSH access.",
        "author": "sad_sysadmin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ge2ik/that_time_everyone_lost_ssh_access/",
        "text": "Hi tfts, long time lurker, new account so previous company can remain nameless (it would be too easy to track it down from my main account).\n\nSome background: I used to work as a sysadmin, sometimes developer and support agent at $COMPANY. It was a nice place to work - completely remote, friendly coworkers, the works. There were some red flags in my time at the company, but maybe I'll post those later.\n\nRegardless; We were preparing to do some larger-scale maintenance on our machines, and one of our support staff wanted to give me a hand, having experience in Linux. Sure, why not - I ask him to generate an SSH key and send it my way so I can deploy it to our Ansible server, and in turn to all of our other infrastructure. First, he sends me a PGP key, and after some guidance sends me a valid SSH key. Perfect. I add it to the server and deploy it to every one of our servers before going out to run some errands. \n\nThe first message I see when I get back:\n\n*Slack chat*\n\n&gt; **coworker**: what happened to ssh?\n\n&gt; **sad_sysadmin**: uh oh, what's up?\n\n&gt; **coworker**: i can't ssh into any of the machine, it says the connection closed\n\nWell this should be interesting. I try to log into the Ansible server myself and find myself locked out, and indeed my connection was closed. Odd - I try another one of our servers with the same result.\n\nFantastic. We don't have our servers in-house, but rent dedicated machines in datacenters, so I can't physically access these machines. My only option is to reboot the servers into recovery mode via the host's web interface and manually fix the authorized\\_keys file. It turns out, somewhere along the way, line breaks were inserted as a sort of hard line wrap, which of course broke up the keys and meant nobody could actually authenticate. If you're not familiar with Ansible, it works over SSH, so no large scale rollback. Oh, and did I mention we don't have backups for customer data, or any other mission critical piece of configuration? (This isn't my fault, I kept approaching management about this but was repeatedly turned down.) \n\nAnd thus my mission, should I choose to accept it, was to individually reboot each server and pull the fixed file from my personal webserver with curl. This worked fine - until users started to report that their accounts were being unlinked from their services.\n\nSo I had to break up the servers into batches, handling the SSH keys first and then waiting for users to report their accounts as missing so I could re-create their service and move their untouched files to the new directory. Manually. \n\nThis was only one of the events leading to my eventual parting from the company, and is a tale of woe and sorrow (and a lot of manual labour).  If you are to take any lesson from this story, _always verify your authorized\\_keys file_. Or use Puppet, which probably would have saved us. Oh, and use backups. There's a lot of lessons to be had.\n\nTL;DR: Deployed bad authorized\\_keys file, had to manually fix our infrastructure while recreating customers services because for some ungodly reason recovery mode borked them.",
        "created_utc": 1511969496,
        "upvote_ratio": ""
    },
    {
        "title": "The time I took down the entire voice conferencing system.",
        "author": "iguru42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ge0ew/the_time_i_took_down_the_entire_voice/",
        "text": "So here is a tale of my own stupidity...\n\nYour intrepid hero is working in his new position as a phone system admin.  I had been working on the help desk, but I was really good with the voice system and when a position opened to be a junior admin they asked me if I'd like to change positions I was stoked!  \n  \nGet off the phones?  No more dealing with vapid users?  Where do I sign up?  \n\nTurn out on the document they handed me accepting the new position.  \n\nKewl.  \n  \nOk, quick anecdote about this job before I tell the fuckup story, so I'm 2 months into my new position.  Turns out that what they really wanted from me was doing daily audits of the entire phone system.  It was a world wide system, with 3 hubs, US, Europe, and Asia.  I had to login to all the servers, check licenses, storage, and errors.  About 10 servers per region, so about 30 in total, with a mix of Windows, and Linux.  When I first started this job was pretty much my entire job, it took about half the day to login, collect data, and generate a report.  Everyone that had been in this position before me had blow off this drudgery, and had been let go when the higherups realized that they had been faking the report.  Basically copying the old report, changing some data and making it look like they did something.  \n  \nIt's wasn't a tough job, just boring as hell.  So I wrote a autohotkey script that would do all this work for me.  About 2000 lines of code, 20 minutes to run, and at then end I had my report done.  In retrospect the dumb thing I did was ever tell anyone I had done that.  Had I just kept my mouth shut I'd probably still be there fat and happy, but I digress.  \n  \nSo my boss comes to me and says iguru42, I need to know everyone that has an account in our voice conferencing system, and their credentials.  \n  \nSure no problem.  But then I go look, and actually, yeah, problem.  \n  \nThe only place with this data is in a shitty web interface, and I have 2000+ accounts go over.  I would have to click on each one to see their credentials and copy out the data.  Blerg... No thanks.  \n  \nI briefly consider rolling out AHK to do this, but I figure there must be a better, simpler way.  \n  \nThe box that hosts this web interface is linux (not my strong suit, but I usually make do), so I ssh into the box and grep looking for a user that I know has an account.  I find a single file!  GOOD!  \n  \nSince this is a live server, I don't want to do anything to that file, so I make a new directory, and copy the file there.  Then I ftp into the box and copy the copy to my computer.  And since I don't want to leave random files laying around I delete the copy I made and start analyzing the file I now have.  \n  \nTime passes ~30 minutes.  \n  \nI get a call that we're having a problem with the conferencing system, people cannot dial in, after calling the number they get silence, no busy, no waveoff, nothing, just dead air.  \n  \nWell, that is odd.  I call the vendor, this get escalated very quickly to a sev1.  I have 3 techs on the phone from vendor.  When the tech running the call says:  \n  \n\"who is username? I see they deleted a file at x time.\"  \n  \nusername is me, my heart just stops, see I was so into the project, even though the timing should have been a HUGE hint, it never occurred to me that I had broken the system.  \n  \nSo I say \"That's me.\"  (Rule T2)\n  \nDead silence for about 20 seconds, I think the vendor techs may have been messaging each other.  \n  \nSo the tech says he may be able to recreate the file, but if not they'll have to send out a tech, and billable, and blah, blah, blah.  I tell him I still have a copy of the deleted file, and they were able to get the system up and running again in about 20 minutes, so it was down for about an hour.  \n  \nSo for those curious where exactly my monumental fuckup was: \n After I made the directory and put a copy there, I thought I changed to that directory, but I never did, so when I issued the delete command I was doing it in the live directory on the live file.  Worked there in that position for another year until they didn't need me anymore.",
        "created_utc": 1511969002,
        "upvote_ratio": ""
    },
    {
        "title": "Does the power cord plug into the wall?",
        "author": "Cryptic-Panther",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gdqnq/does_the_power_cord_plug_into_the_wall/",
        "text": "So first off i do level one tech support (Help Desk) for a large Global Manufacturing company, so my callers are company employees. and we are remote so we have never been onsite.\n\nM = me  CU = Confused User.\n\nM - Standard greeting asking for users name. ( I get it, then it starts)\n\nCU - I'm having an issue getting logged in I moved stuff on my desk and the monitor has this message out of range (reading error to fast to understand her or type it out if i tried) Oh i think i'm getting logged in can you remote into my computer oh it's finally letting me login but the monitor has this message out of range blah blah blah. (I didn't include any punctuation because she never stopped talking, it was one sentence. I wanted you all to enjoy that)\n\nM - (I was like WOW) OK now that you are logged in are both monitors working?\n\nCU - No it still says out of range can you log into my computer?\n\nM - (gather info and follow company protocol for remote assistance, and get connected) I can see both monitors, one has email open the other has nothing open on it.\n\nCU - Can you see the error message on the right monitor?\n\nAt this point i knew trying to get her to adjust monitor settings was going to be a challenge, so i went with the ole powercycle trick with my fingers crossed that it would work. (I didn't know what i was getting myself into)\n\nM - Ok lets unplug the power from that monitor.\n\nCU - You want me to unplug the power? what cord is the power cord?\n\nM - (sadly not an uncommon question) The large black cable.\n\nThe user unplugged the power, I seen on the remote session it drop to one monitor and then go back to 2.\n\nM- So is that monitor working now?\n\nCU - No it still shows out of range, can't you fix this for me?\n\nM - No the error you are seeing is on the physical monitor, so it's a setting that needs to be changed. (I realized as soon as i said that she had no idea what i meant.)\n\nShe is getting more frustrated &amp; confused, I was trying not to make this worse, so i figured to defuse this and get her back to work i would just have her unplug the power again leave it, until local IT could go down and fix it.\n\nM - What we can do is unplug the monitor so you go back to one and I'll have local IT come down and fix this.\n\nCU - What do you want me to unplug?\n\nM - Unplug the power to the monitor that isn't working like before.\n\nCU - I don't know what i unplugged before.\n\nM - The power cable to the monitor that isn't working, isn't that what you unplugged before?\n\nCU - I don't know.\n\nM - Which power cable did you unplug?\n\nCU - I told you i don't know what i unplugged.\n\nM - Did you not unplug the power from the monitor that isn't working?\n\nCU - There are so many cords here i don't know.\n\nM - Didn't you unplug it from the back of the monitor?\n\nCU - Oh from the back.... does this power cord plug into the wall?\n\nat this point I had no idea how to respond without insulting her, she was getting more frustrated, and to be honest so was I. To save you from more of this painful exchange, I did have her access the monitor menu to change the display input but she couldn't get that to work, so in the end i had her unplug the power from the back of the monitor that wasn't working and i submitted a ticket..... now i need a drink or 6, but it's 9:45 am. and i'm only 3 hrs into a 13 hr day.\n\n",
        "created_utc": 1511966694,
        "upvote_ratio": ""
    },
    {
        "title": "What does that spec mean?",
        "author": "R3dtech",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gdp8h/what_does_that_spec_mean/",
        "text": "[removed]",
        "created_utc": 1511966347,
        "upvote_ratio": ""
    },
    {
        "title": "How will I know?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gdp0k/how_will_i_know/",
        "text": "[removed]",
        "created_utc": 1511966284,
        "upvote_ratio": ""
    },
    {
        "title": "Please read me your username...",
        "author": "iguru42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gdfl1/please_read_me_your_username/",
        "text": "Me:  Thank you for calling blah, how can I help you?  \nHer:  Hi I can't login to vendor app on my phone, it keeps saying invalid username or password, but I can login on the computer.  \nMe:  Oh, well, that's odd, can you confirm what it says for your username on the phone?  \nHer:  Sure it's firstname_lastname@blah.org  \nMe:  Ok great, that's the correct username, hold on, let me reset your password.  Ok, your password is now blah1 with a capital blah.  \nHer:  It's still saying invalid username or password.  \nMe:  Hunh, well, that is odd.  Log out of the app on your computer and log back in.  \nHer:  Ah, that worked it's asking me to change my password.   \nMe:  OK, great!  It's definitely working then.  \n   \nShe resets her password.  \n  \nMe:  Now try logging in on the phone again.  \nHer:  My username is blah.net right?  \nMe:  No, it is blah.org.  \nHer:  Well it says blah.net on my phone.  Why does it have blah.net?  \nMe internally:  Because you changed it, somehow, someway for some unknown reason.  I definitely do not know, nor do I care.  \nMe:  Mmmmmm, I'm not sure, lets go and change it to blah.org and see if that work.  \nHer:  Yeah it's working now, but why did that change, I wouldn't have done that.  \nMe internally:  You did do it.  The phone didn't just do it, no one else just did it, you did it.  \nMe:  I'm not sure, but it's working now so you're all set!  \nHer:  Great, thanks!  \n",
        "created_utc": 1511963957,
        "upvote_ratio": ""
    },
    {
        "title": "Hell With Wordpress",
        "author": "doge102",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gd6lj/hell_with_wordpress/",
        "text": "Sorry for formatting.\n\nThis is my first time posting on TFTS, but I've lurked for quite a bit.\n\nAbout a week ago, one of my friends needed a website, and he didn't want to pay a bit for that. So I signed him up for the AWS free trial, got wordpress set up on ubuntu, bought him the domain he had wanted (It was a 48 cent namecheap domain.). I set his nameservers, got cloudflare up and running, and them configured some stuff. \n\nFast forward a week. He starts to call me demanding I fix his broken website. I go on, formatting is broken, and when I try to login, it literally redirects me to wordpress/. Why? Since the host url was an IP, he thought those were random numbers, and changed the host url to wordpress. And he managed to rm -r /var/www/html from some online website. So now I have re-setup wordpress. \n\nThanks for reading. \n\nEDIT: Changed a few details. ",
        "created_utc": 1511961539,
        "upvote_ratio": ""
    },
    {
        "title": "The intranet is down?",
        "author": "rambuddy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7gceai/the_intranet_is_down/",
        "text": "LTL, FTP, apologies for any formatting errors, throwaway account to protect identities. Although I do all sorts with computers, I'm currently employed as a web developer.\n\nBrief background: we have several offices dotted all over the country. Approximately 95% of our work is done through the intranet we build in-house so when that goes down, we have a lot of employees doing nothing.\n\n**$me**/**$rambuddy** = Myself\n\n**$manager**=My Manager\n\n&gt;*I walk into the office and say my good mornings.*\n\n&gt;**$manager:** \"**$rambuddy**, did you do anything to the live server last night?\"\n\n&gt;**$me:** \"No, why whats wrong?\"\n\n&gt;**$manager:** \"Only one person has logged in. Everyone else is getting a 'not logged in' error immediately after attempting to login.\"\n\nSo i go and get a hot drink, pop to the toilet and think over the problem (I'm a big fan of thinking over a problem away from desk rather than at the desk).\n\n&gt;**$me internally:** \"Okay so no one has changed anything since downtime occurred, and tech support haven't said anything about our provider having problems. No success logging in on my phone. WAIT! This is the month end. I wonder................\"\n\n&gt;*Return to desk, open up My Computer, open up mapped drive to server and BINGO!*\n\n&gt;**$me:** \"**$manager**, we don't have any space left\"\n\n&gt;**$manager:** \"What do you mean, on the disk drive?\"\n\n&gt;**$me:** \"Yeah, it's showing 0 bytes available\"\n\n&gt;*deletes a few gig from the temp store and...........*\n\n&gt;**$me:** \"Yup it's working now\".\n\nDespite countless meetings people still insist on doing everything at the end of the month in a mad panic, which causes all sorts of headaches. All the reports left until the last minute had filled our hard drive, meaning we only had space for 1 user session.\n\n**TL;DR:** No one can log into the intranet, no space for user sessions because users left the bulk of the work until the last minute.",
        "created_utc": 1511952626,
        "upvote_ratio": ""
    },
    {
        "title": "My friend's computer was bought with protection.",
        "author": "Ninjabunny2point0",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ga2cp/my_friends_computer_was_bought_with_protection/",
        "text": "[removed]",
        "created_utc": 1511925205,
        "upvote_ratio": ""
    },
    {
        "title": "My friend's computer was bought with protection.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g9z7l/my_friends_computer_was_bought_with_protection/",
        "text": "[removed]",
        "created_utc": 1511924414,
        "upvote_ratio": ""
    },
    {
        "title": "you have used way too much data.",
        "author": "dewnmoutain",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g9k7c/you_have_used_way_too_much_data/",
        "text": "[removed]",
        "created_utc": 1511920606,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure it's not the internet?",
        "author": "knackzoot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g8xmz/are_you_sure_its_not_the_internet/",
        "text": "I just got a call from $HR asking for help on a jammed printer.  \n\n&gt; Hello $knackzoot here. How may I help you?  \n$HR  \n&gt;Hey I'm having issues with my printer. It's jamming and won't print. I already tried turning it off, but it's stuck! I even unplugged it and plugged it back in, but it just won't print!  \n$me  \n&gt;No problem, I'll come and take a look.  \n$HR  \n&gt;OK, good.  \n&gt;Uh...  \n&gt;Are you sure it's not just the internet that's causing the jam?  \n$me  \n&gt;No, I'm sure it's not the internet. I'll be there in a minute or two.  \n\nSo, I go there and clear the jam, clean it a bit and voilá, it works.  \nTurns out it wasn't the internet after all ¯\\\\\\_(ツ)_/¯  \n\n*Edit: fixed a typo :)",
        "created_utc": 1511915060,
        "upvote_ratio": ""
    },
    {
        "title": "Username dilemma",
        "author": "SheepNZ",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g8clh/username_dilemma/",
        "text": "Hi TFTS, I've been lurking for a while, this is my first post.\n\nSo this just happened today, I study at and work for a tertiary education institution on phones and campus support and today I am on phones.\n\n&gt; $Me: (generic but professional greeting)\n\n&gt; $User: Hi sheepnz, I'm having issues with my account.\n\n&gt; $Me: Okay no worries, could I please have your username?\n\n&gt; $User: Uhhh I don't have a username.\n\n&gt; $Me: Okay no worries, do you have a student ID number?\n\n&gt; $User: No...\n\n&gt; $Me: Okayyy, well what's your full name?\n\n&gt; $User: Jonathon Appleseed, but also my name is Jon *(obv not their actual name)*\n\n&gt; $Me: Okay just a sec.\n\nI look up their name so that I can confirm they are who they are and give them their username.\n\n&gt; $Me: Oh, that's um, strange.\n\n&gt; $User: What?\n\n&gt; $Me: That's just, the weirdest username I've ever seen.\n\nSo the user decided while signing up for an account that people call them Jon so instead of just entering their first name in the First Name box, they put their name as \"(Jon) jonathon\"\n\nOur system uses the first 3 letters of each users' first and last names to create a username, and so their username was set as \"(joapp123\"\n\nWe all had a good chuckle at that, no one had ever tried that before apparently.\n\nTLDR; User was too extra and our system was too basic to notice.\n",
        "created_utc": 1511910044,
        "upvote_ratio": ""
    },
    {
        "title": "Discovering Hidden...Treasure?",
        "author": "griffethbarker",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g83bc/discovering_hiddentreasure/",
        "text": "Greetings, friends! I wish to briefly share with you what our department discovered today and what the rest of my day looks like.  \n  \nAs some form of background, myself and our IT Director are the entirety of the IT Department for a 500-employee company that operates hotels, casinos, restaurants, and all things hospitality. So there are two of us vs. hundreds of workstations, thousands of pieces of gaming equipment, and more peripherals, software deployments, and patch cables than you can shake a stick at. Needless to say, we stay pretty busy.  \n  \nToday we received a call from one of the vaults saying that their computer wouldn't start and \"just [kept] showing the windows screen then starting over.\" Oh, great! A big bowl-full of booty-loops. While this isn't a huge issue in and of itself, the machine is the sole host for an ancient Access database that is critical to accounting function in the vaults. It is so ancient, in fact, that none of us even know who wrote it, and they definitely don't work for the company anymore (great, right?).  \nMoving along. $director asks me to go down to the vault and retrieve the computer so we can work on it upstairs. I head down stairs [fast-forward-through-vault-access-procedures-for-compliance-purposes] and head over to the computer desk. It's dark under the desk, so I reach down to pull the machine out to get a better look at it. After an overly-exhaustive tug, the heavier-than-expected workstation thudded out from beneath the desk.  \n  \nLo. And. Behold.  \n  \nAn old IBM tower that was struggling to run Windows XP. I sat there astounded for two reasons:  \n  \n* (1) We don't have anything nearly this old on our properties...or so we thought.  \n* (2) We don't have anything running Windows XP on our properties...or so we thought.  \n  \nI lug the machine upstairs to our office and heave it onto $director's desk, to which his eyes widened with wonder. After explaining that, yes, this really was what was running down there, we realized that we now have a fragile IBM machine hosting the only copy of a critical database, that will not boot. So. The rest of our day looks like it will be figuring out how to read the security permissions on that database in order to save a critical part of our company. Without having this poor machine die in the meantime. *sigh* At least it was funny in the moment? Ta.\n",
        "created_utc": 1511907982,
        "upvote_ratio": ""
    },
    {
        "title": "The hell I had to endure to print an ID card",
        "author": "driventolegend",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g81ln/the_hell_i_had_to_endure_to_print_an_id_card/",
        "text": "A perfect storm of spectacular fuckups from me, google, a printer (they are evil, as I have learned), time, and a POS system.\n\nFirst post, sorry for formatting, you know this already.\n\nSo for some background, I am a lifeguard (in California where pools are open year round), and I am 16 years old.  I know computers about as well as I can at my age, and just built one last summer.\n\nAs a lifeguard, you will typically spend 30min-1hr watching the pool, and 30min either on break (in the summer when there are a bunch of us) or working the front desk with the manager (in the offseason).  Now the city I work for operates two seperate aquatic facilities.  On is the main one, and the other is the smaller one that is only open a few hours a day in the current offseason.  I always get scheduled at the smaller facility because I live literally 300 yards away from it and its shifts are 4-9 (perfect for after school).\n\nNow at this smaller facility in the offseason there are 2 people on staff: me the guard, and the manager (isnt relevant to the story).  During evening lap swim hours (4:30-7, lining up with when our other facility is closed because of swim teams) I will be working the front desk solo for 30 minutes, this is where out tale begins.\n\nI know how to use the POS system to allow people to pay for lap swim, however there are punch passes and month passes that you can buy to get a discount for buying in bulk.  These are physical cards that are like a credit card with a name and number on them and have to be printed from a special printer.  Now this stuff is usually handled by managers, but I had to do it for the first time.  We have just switched to a new POS system that is extremely unintuitive and annoying compared to the old one.  \n\nSo a guy comes in wanting to buy a punch pass, i make the account for him, which is pretty simple.  And then trying to print the card.  I go outside and ask my manager how to do it and he tells me that there is a black drop down arrow on the right on the client page.  I thought he meant the right side of the screen, its the most further right option, but it is in the middle of the screen.  Cue 5-10 minutes of me trying to find the print button and caling the manager at the other pool to figure this out.  \n\nOk, now I know what I am doing, but this is only the beginning.  The card template took another 5 minutes to find because it is not labeled 15 PUNCH PASS, and was hidden in a submenu.  Then when i went to the chrome print screen to select the printer, it crashed.  Fuck.  I kill chrome in task manager and try some more, nope keeps crashing.  I thought about copying and pasting the URL into IE, no.  Start from the beginning in IE, dont know any of the managers logins.  Now im sweating (I told the guy to go swim and get his pass on his way out earlier).  So I try to physically look at the printer and see whats up, but i cant open it because its on a little table under the desk, so I yank the table out with like 2 PCs and 2 printers on it.  I open all the things that can be opened, check it, close it.  Nope.  I also thought that the printer was out of cards, ID card printers load weird.  So I am trying to load this printer in a really uncomfortable position under the desk, i realize that it is loaded. And continue in this hell.  Then another customer comes to swim and pays with a credit card, ok all good.  Then the receipt printer breaks and i have to yank the receipt out and cut it with scissors (there is a merchant copy and a customer copy)  Continue ID card hell.  \n\nThen i unplug the card printer and plug it back in.  IT FUCKING WORKS, but oh shit, printing cyan, printing yellow, please dont fucking print a rainbow ID card.  It prints.  FREEDOM!\n\nI take my trophy to the manager and show him, after explaining what happend and why I was in the office for 35 minutes (yes it took that long) he said THAT THIS HAPPENS ALL THE TIME.  \n\nHe says: “this is why us managers are in the office the most” i reply saying “at least i know how to do it now”  \n\nI then ask him to show me how everything else on the computer, as us guards get zero training in the POS and usually arent expected to know how to use it.  It was easy stuff, finally, thank God.\n\nEdit1: some spelling",
        "created_utc": 1511907606,
        "upvote_ratio": ""
    },
    {
        "title": "They walk among us.",
        "author": "jediacademy2000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g7vaq/they_walk_among_us/",
        "text": "[removed]",
        "created_utc": 1511906244,
        "upvote_ratio": ""
    },
    {
        "title": "DAVE?",
        "author": "kestreldreams",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g7r68/dave/",
        "text": "I’ve done tech support for over ten years now. Love my current company and position, but oooh boy I’ve got some doozies from carrier work in call center hell. So this was several years ago when I still worked in hell.\n\n\nCL: crazy lady\n\n\nCall pops, after the automatic greeting plays a screech cuts across the line. Note: I am female, with an obvious female name that is said in the greeting that sounds nothing like Dave.\n\n\nCL: DAVE?!?\n\n\nI instantly snap up to look at my friend Dave working a few feet from me, who is merrily working with someone less rabid.\n\n\nMe: I introduce myself. Assure her I am advanced tech support and will be happy to help.\n\n\nCL: I WANT DAVE! NOW!\n\n\nMe: I assure her I will do everything I can to help, ask her to give me a couple of minutes to review her account.\n\n\nAnd of course this supervisor she is screaming for isn’t notated on the account.\n\n\nCL: GET ME DAVE NOW!! HE’S a SUPERVISOR! HE PROMISED TO FIX THIS!\n\n\nAfter finally getting a call center location out of her I try and explain I’m not in that center, or that state even. I have no way getting this ‘Dave’ who not even listed as having touched her account. And I continue to promise her I will do everything I can to help her.  After about 5 minutes of screeching I finally calm her down enough to tell me her phone isn’t working. Now after an introduction like this I’m not about to suggest troubleshooting. Instead I immediately offer her a replacement at a local store since she’s covered under warranty. (Something not even offered anymore)\n\n\nCL: I’M NOT DRIVING ANYWHERE! I’M ON VACATION! *Various screaming curses follow* \n\n\nMe: I can understand not wanting to interrupt your vacation! I will be happy to overnight this to you at our expense! \n\n\nCL: I’M NOT BLEEPING WAITING! THIS NEEDS TO BE FIXED NOW!\n\n\nAdmittedly I lost all semblance of a filter at that point \n\n\nMe: LADY! I CAN NOT HAND YOU A PHONE OVER THE AIR!!!  You can go into a store 5 miles away, or have one delivered! That’s it! Those are your choices!\n\n\nPreeetty sure that’s when she hung up on me.  Lol. I’ve developed more tact since then, but will never regret that one!\n\n\nEdited for typo",
        "created_utc": 1511905362,
        "upvote_ratio": ""
    },
    {
        "title": "We don't own Youtube, can't edit that video unfortunately.",
        "author": "zushiba",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g7pt6/we_dont_own_youtube_cant_edit_that_video/",
        "text": "[removed]",
        "created_utc": 1511905046,
        "upvote_ratio": ""
    },
    {
        "title": "MFAM Sidestory: Field Service",
        "author": "Zeewulfeh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g6edq/mfam_sidestory_field_service/",
        "text": "*This story rides the line of tech support, but I’d say close enough for government work…*\n\n***\n\nAs we ‘round a bend, we come into view of both our target and an intersection.  Also at the intersection, off to the side of the road, is a somewhat white burned out SUV.  I lean forward over my Browning .50 Cal M2 Machine Gun and squint a bit, my helmet doing little to shade my eyes.  Up ahead, Gun One, a Humvee with a Mk. 19 40mm machine gun, aka, an automatic grenade launcher, slowed to a stop.  Gun One’s turret gunner was gesturing towards the SUV and I kicked the driver of Gun Two from my own turret position.  \n\n&gt;**ZeeWulf** “Hey, $Driver, I think there’s an IED in that dead truck!  Call the XO, I don’t want to get any closer.”\n\n&gt;**$Driver** “Gun One’s already calling it in.”\n\n&gt;**ZeeWulf** “Great, what’s the Major saying?”\n\n&gt;**$Driver** “Push through.”\n\n&gt;**ZeeWulf** “@!*&amp;!”\n\n***\nIt had been almost two hours since the Battalion Executive Officer’s advice to push past the truck with the Improvised Explosive Device that had killed both Gun One and Two and their entire crew compliment, half the gun-humvees escorting our ill-fated convoy.  Gun Three had at least dumped all of their mounted infantrymen before dying after taking a direct hit from a 155mm artillery round (which shows why leadership shouldn’t make the exercise referees angry by not following the rules in the first place…) the Louisiana Taliban had produced from Hammerspace.   Our lieutenant had still not stopped moping from the Commander’s seat of Gun One since the rest of the battalion had abandoned all of us dead and retreated back to the FOB (Forward Operating Base).   Which meant, since no Non-Commissioned Officers (NCOs—Sergeants) had been left behind to keep an eye on us, we Specialists were running the show.  \n\nIt was little surprise when, after those two hours, the OpFor (Opposing Force) which had slaughtered us after our valiant charge into the jaws of certain death we’d predicted (and likely would result in medals for bravery for our commander, had this been more than an exercise) showed up to ~~rub it in~~ give us some advice.  \n\nUnfortunately, said advice was given to some very…highly impressionable Privates and another not-too-bright Specialist.\n\n&gt;**$OpFor1** “Hey, you guys know how the MILES gear can work sorta like laser-tag, right?”\n\n&gt;**$PrivateSnuffy**  “Oh yeah, it totally is.”\n\nThe Multiple Integrated Laser Engagement System, or MILES gear, is made up of a handful of components.  One is a laser emitter attached to the barrel of whatever weapon you’re using.  A blank firing adapter is also attached to the muzzle of the weapon, which allows a rifle or machine gun to fire blanks, with each shot activating the laser.  Players in the exercise also wear a vest of sensors as well as a ‘halo’ on their helmet.  When hit, the system starts wailing your demise and like a good player you’re supposed to lie down and play dead or wounded until an exercise referee pulls your casualty card and tells you if you live or not.  And then they reset your system using their special laser tool so it stops screaming.  We all were given this equipment for our time in the Louisiana exercise areas.\n\n&gt;**$OpFor2**  “Yeah, you wanna know a secret of how to reset the sensors?”\n\n&gt;**$OpFor1** “You know, play laser tag and have some fun while you wait to get picked up?”\n\n&gt;**$PrivatesSnuffy &amp; Jody** “Yeah!  Tell us!”\n\n&gt;**$OpFor1** “Well what you do is after you shoot someone, you just wave the laser on your rifle in front of the detector and it shuts off!”\n\n&gt;**$PrivatesSnuffy &amp; Jody** “Woo!  Let’s try it!”\n\nThe OpFor ‘operators’ take their leave immediately and I shake my head.  \n\n\n&gt;**ZeeWulf** “You guys didn’t actually *believe* that, did you?”\n\nUnfortunately, I found myself speaking to empty air as $PrivatesSnuffy and Jodie were joined by $SpecialistMaroon and proceeded to start chasing each other around shooting their M16s and M249 SAWs at each other.  A good hundred or two rounds fired later, they come back up to me, frantically waving their weapons in front of their vests.\n\n&gt;**$MoronSquad** “It’s not working!  Help!”\n\n&gt;**ZeeWulf** “Well, I see you’ve got two choices here.  You can either go and tell the LT over there just what possessed you to chase each other around like that and hope to hell he’s got a knife or multitool, or you can bust out your E-Tool and bury the vests.”\n\nImmediately they pulled out their folded shovels and went to go dig a hole.   Into which they would proceed to put their vests.  And it would probably damage them irreparably and I’d get the blame as “Specialist ZeeWulf told us to do that!”\n\n&gt;**ZeeWulf** “Wait!  Just..wait over by the woods so we don’t have to listen.”\n\nI went over to the LT and explained the issue, but he really never made eye contact.  Just mumbled something about his plan, how he’d never gotten to even DO anything, just died, and blankly handed me a knife.  It was hard to see him so broken—he was such a happy young and inexperienced lieutenant that morning, excited and filled with hope running up and down the convoy, seeing him so down now one might feel  the humane thing to do would be to put him down, much as a steed with a broken leg.  \n\nBut then again, I was in the Army and humane wasn’t what we did for Lieutenants.  \n\n&gt;**ZeeWulf** “Thanks, sir.  Maybe next time we won’t die right away.”\n\nHe mumbled something sad, but I was already gone and using the knife to (painstakingly slowly) remove the batteries from their vests.  \n\nBecause I didn’t trust the Privates not to stab themselves with it.  \n\n\n***\n\n\n**TL:DR-** After 'dying' due to an officer's bad advice during a training exercise OpFor convinces Idiot Underlings to chase each other around playing 'lasertag' with their automatic weapons.  Irritation ensues and I use a knife as a screwdriver to take the batteries out of their detector harnesses.",
        "created_utc": 1511894924,
        "upvote_ratio": ""
    },
    {
        "title": "Not our responsibility",
        "author": "norseman2017",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g5x1e/not_our_responsibility/",
        "text": "[removed]",
        "created_utc": 1511891209,
        "upvote_ratio": ""
    },
    {
        "title": "The really long way of doing it.",
        "author": "lindersmash",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g5tjx/the_really_long_way_of_doing_it/",
        "text": "My company makes software that insurance companies use.  Because of different regulations theres certain blocks in the system.  You can't move certain files/forms from policy to policy within the system, they have to be recreated and uploaded to the new policy.  There has to be a log of each file added (this is for auditing purposes in case of lawsuit, or in case the insurance carrier claims something wasnt filed correctly) \n\nIm explaining this to a customer \n&gt;customer: \"It's the same form i just need to move it\"\n\nMe: \"sorry, you have to save the file and upload it to the new policy\"\n\n&gt;Customer: \"Fine, i'll print it out, scan it in, and save the scan\"\n\nme: \".......what?....why.... no....  Just save the file to your desktop and upload the file\"\n\n&gt;Customer: \"oh....I guess i could do that\".",
        "created_utc": 1511890475,
        "upvote_ratio": ""
    },
    {
        "title": "usb and black screens",
        "author": "ng128",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g5syq/usb_and_black_screens/",
        "text": "So the title of the tale pretty much sums up the explanation that the helpdesk put into the ticket. It was actually \"user put in usb and screen stays black\".\n\nSo helpful I know. But you know, it's a slow day and I feel like walking. So I call up the user and ask him where he's located in the building.\n\nI arrive at the users desk.\n\n\n&gt; user: See I connect the usb and the screen stays black. But everything is connected.\n\n*oh I see, he has a port replicator. So much for useful information*\n&gt;me: I see, but your monitor isn't on. \n\n&gt;user: but I pressed the power button\n\n&gt;me: Ok I'll just check the cables then\n\n*wiggles with the power cord, monitor comes to life.*\n\n\nNever ceases to amaze me how users can't perform this one simple check. No light usually means no power. ",
        "created_utc": 1511890346,
        "upvote_ratio": ""
    },
    {
        "title": "'Someone needs to save me from static bites': Infection tales of bizarreness",
        "author": "bumpycheesefilms",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g5435/someone_needs_to_save_me_from_static_bites/",
        "text": "So today we had a doozy of a ticket that goes a little something like this:\n\n*ticket arrives from customer*\n\n**Customers email**: 'Hello IT support, please can you help, we have a colleague in our office that is suffering from major static bites, do you have any anti static mouse mats or anything like that'\n\n*We do not have anything like this in the office, so users would need to buy their own.  However, thinking this is a static shock from some of the equipment in the customers office, I needed to investigate for health and safety.*\n\n**My email**: 'Hello, just out of interest, where is the colleague receiving these static shocks from?  Do they seem to be affecting their hands when they are touching a certain piece of equipment?'\n\n*Customer now phones in*\n\n**Customer**: &gt;Hi, I just emailed your team about my colleague receiving these bites.  Well obviously if you read my email correctly you will see I have stated she is receiving bites and we need you to sort this out for her.\n\n**Me**: &gt;Hi there, sorry to hear you are experiencing this, so out of interest where are they receiving these shocks?  Are they touching anything which seems to be prompting this?  Are they close to any exposed cables or anything like that?\n\n**Customer**: &gt;No as in they are sat there and experiencing electrical pains all over their body randomly, its in their hands, feet.  Like a painful tingling sensation, they have red marks can you come and sort this.\n\n**me**: &gt;I think it is important you get in touch with a doctors surgery as soon as possible, or even visit our on site health centre as this sensation could be related to a medical problem rather than anything to do with your equipment.\n\n*Customer quickly hung up the phone as they realized this was not a static shock but could be a quite serious health concern for their colleague.  We also visited the area to double check everything was secure but noone else had ever experienced anything like this.*",
        "created_utc": 1511884810,
        "upvote_ratio": ""
    },
    {
        "title": "basic checks",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g4x1b/basic_checks/",
        "text": "[removed]",
        "created_utc": 1511883112,
        "upvote_ratio": ""
    },
    {
        "title": "Mildred can't read.",
        "author": "just_wingin_it",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g4siv/mildred_cant_read/",
        "text": "For those who haven't read my first post about Mildred, you can find it [here](https://www.reddit.com/r/talesfromtechsupport/comments/6wrmhy/mildred_lacks_even_the_most_basic_computer_skills/). \n\nSmall recap: Mildred works at a school office, is old enough to have met Napoleon in person, and doesn't have the computer skills necessary for her job. \n\nI've had her on the line several times since, but they weren't nearly as memorable as the first ones (even though she blurted out gems like \"Start button? What do you mean?\"). Today, on the other hand, was amazing. \n\n&gt; **Me**: Hello, IT. How may I help you? \n\n&gt; **Mildred**: Hi, when I open *$siteA* it says page not found. \n\nShe does not introduce herself, ever. She just starts explaining and it's actually as vague as this. To get to *$siteA*, you have to log into *$myschool*, click 2 links to get to the page that has the link to the actual *$siteA*. While it's technically possible to save a direct link to *$siteA*, the authentication process will lock you out and you'll have to go through *$myschool* again anyway. \n\n&gt; **Me**: At what moment do you get this message?\n\n&gt; **Mildred**: I go to My documents, then the desktop and there I have a button. When I click that, it says page not found. That's what I always do. \n\n&gt; **Me**: Wait, what you always do? That site was launched earlier this month, how long have you been using that? \n\n&gt; **Mildred**: No, that's an older button, I've been using it longer than that. \n\n&gt; **Me**: That's not possible, are you sure you want to go to *$siteA*?\n\n&gt; **Mildred**: Oh, I'm sorry, I wanted to go to *$myschool*. \n\nWe have a landing page with info, manual, tutorials \nabout and a link to login to *$myschool*. The url of that page changed recently, so I assume that's what she's talking about. \n\n&gt; **Me**: That should be an easy fix, can you go to the website *myschool.edu*. \n\nThat's not the real url, but it is that simple. She somehow gets it wrong and doesn't know what to do. \n\n&gt; **Me**: You have to go to that website. Click on the address bar in your browser and type *myschool.edu*.\n\nThe page she lands on should be easy for anyone. A banner and a horizontal menu (standard UI elements for the entire website). Below that, in large and bold letters, the words \"My\" and \"School\". Below *that*, 2 titles (next to each other if your screen is big enough, above and below each other on mobile screens). The titles are designed to be very obvious, there is no way you can miss them. They read \"My school for school management and administration\" and \"My school for school staff\". The titles are links that bring you to their respective pages. They have a very small description and a second link that brings you to the same url as the title. \n\n&gt; **Me**: Once you're on that page, you can click on \"My school for school managament and administration\".\n\n&gt; **Mildred**: Do I have to add dot *otherdomain*?\n\n&gt; **Me**: No, just *myschool.edu*. \n\n&gt; **Mildred**: *myschool2.otherdomain*...? \n\nThose are actually domains and urls are actually ours, but that's not what she needs. \n\n&gt; **Me**: No, just *myschool.edu*. \n\n&gt; **Mildred**: And now what do I do? \n\n&gt; **Me**: Now you click on \"My school for school managament and administration\".\n\nShe starts mumbling, I believe she is reading the page and is looking for the link. I understand a few words, but they're not exactly on that page...\n\n&gt; **Mildred**: \"My school for school staff and administration\"?\n\n&gt; **Me**: No, \"My school for school managament and administration\".\n\nThis goes back and forth a few times, she repeatedly says \"My school for school staff and administration\" and I correct her every single time. \n\n&gt; **Mildred**: I found it, should I click it once or twice? \n\n&gt; **Me**: Once should be enough. \n\n&gt; **Mildred**: It again says page not found. \n\nI convince myself that maybe the entire page was loaded from her browser cache or something, I don't know. \n\n&gt; **Me**: Could you maybe go back and try to reload the page you're on? \n\n&gt; **Mildred**: What should I do? \n\n&gt; **Me**: Go to *myschool.edu* again. \n\n&gt; **Mildred**, after a pause: Yes? \n\n&gt; **Me**: There should be a button with an arrow that's going in a circle somewhere near the top of your screen. Click on that. \n\n&gt; **Mildred**: Where... Oh, I think I found it. Now... Okay, now what should I do? \n\n&gt; **Me**: Click on \"My school for school managament and administration\".\n\n&gt; **Mildred**: It still says page not found. \n\nGod. Damnit. I ask her to open Teamviewer. This goes absolutely smooth, probably because she has learned that this button makes other people do her work for her. \n\nI open the browser, type in the url I've read her several times, click that one link that should be so easy to find that I could probably explain it to a toddler over the phone, and voila, it works. \n\n&gt; **Mildred**: Why does it work now? \n\nAnd that's how I spent 10 minutes trying to get someone to open a url and click on a link. \n\nEdit: management, not magament. \n\nEdit 2: titels --&gt; titles. ",
        "created_utc": 1511882019,
        "upvote_ratio": ""
    },
    {
        "title": "Don't leave your mark on the world",
        "author": "PM_ME_CUTE_SNOOTS",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g3bvq/dont_leave_your_mark_on_the_world/",
        "text": "As the new guy in the department, I get to hear stories from the guys who have worked here for 15 and 20 years already. This one happened around 10 years ago when one of the **$oldtimers** received a phonecall from the **$police**. The dialogue is slightly weird as I've had to translate it into English. \n\n&gt;**$police:** Hello, this is the police. You already know why I've called you, right?    \n\n&gt;**$oldtimer:** Not at all. Has something happened?\n\n&gt;**$police:** A van was stopped just across the nearby border to **$country**. The back of it was filled with computers and electronics belonging to you.\n\n&gt;**$oldtimer:** Wait what? I haven't had any reports of any missing computers. Are you sure they're ours?\n\n&gt;**$police:** Definitely. Most are marked with your company's name and contact information.\n\n**$oldtimer** is silent for a while, wondering where someone would have gotten enough computers to fill a van with without breaking in and no one saying they're missing their computers. \n\n\n&gt;**$oldtimer:** They must be the computers we threw away a few days ago. Someone probably stole them from the recycling facility. No, we don't want them back.\n\nAnd that's why I'm now being told to remove all stickers and markings from the old computers I've been working to clear from the cleaning closet .",
        "created_utc": 1511866028,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried unplugging it?",
        "author": "nik282000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g3bgp/have_you_tried_unplugging_it/",
        "text": "I am an electrician not an IT professional, I work at a large industrial facility with lots of big scary robots, it's not a terrible job, sometimes it is even fun. Being the youngest person in the maintenance department I am often called on to solve computer related issues in addition to the regular “everything is on fire” calls.\n\nOne day my boss, $boss, decided that he wanted to upgrade the PC attached to some 80s test equipment from Windows 95. Despite the fact that it was working just fine and that the equipment used a parallel port to talk to the PC, the project was pushed forward and the equipment manufacturer shipped us a $3000 PC (their price) and a $1000 parallel to USB adapter\n\n&gt;$boss: Here is the new PC, adapter and software, can you set it up in the lab and show them how to use it?\n\n&gt;$me: sure, is there anything else?\n\n&gt;$boss: yeah, can you make an image of the os using $budgetImageSoftware once you are done? If anything messes up later we can always restore it that way.\n\nTwo hours into my night shift I discover that the PC was shipped with Windows 10 but the new control software is only meant for Windows 7. I goofed around to no avail and eventually had to tell $boss, in the morning, that it was a no-go. He said he would send our industrial computer tech guy, $ICT, to get a copy of Windows 7 and that they would set up the PC before I came in that night.\n\n*12 hours pass*\n\nI come in to $boss and $ITC yelling over each other about something while looking at a monitor that says **Operating System Not Found.**\n\n&gt;$boss: did you change anything last night?\n\n&gt;$ITC: How could he change anything, it's a new operating system.\n\n&gt;$boss: What about in the bios? It could be in the bios!\n\n&gt;$ITC: It's not in the bios because it booted once and we never changed it anything after that.\n\nAfter concatenating their two stories it turns out they were working on this all day. 12 hours of installing Windows 7, installing the software, booting the imaging tool to make the image successfully on an external drive and then getting OS not found when they rebooted. I asked a few questions and $boss finally decided the only way to convince me that something was really wrong was to have me do the whole process in front of them and get “OS not found.”\n\nI wiped the OS drive, installed Windows 7, made an image using $budgetImageSoftware, rebooted and got “ Operating System Not Found.”\n\n&gt;$boss: See, I told you there is something wrong, we did exactly the same process and it doesn't work. Something breaks Windows every time!\n\nI reached over, unpluged the external drive and restarted the PC. $boss hasn't asked me to help with IT since then.\n\n",
        "created_utc": 1511865870,
        "upvote_ratio": ""
    },
    {
        "title": "CPU",
        "author": "kaptnblackbeard",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g2r05/cpu/",
        "text": "[removed]",
        "created_utc": 1511857882,
        "upvote_ratio": ""
    },
    {
        "title": "You're welcome??",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g1ht5/youre_welcome/",
        "text": "[removed]",
        "created_utc": 1511843425,
        "upvote_ratio": ""
    },
    {
        "title": "To the professor I helped with his 'Tech Problem' in the middle of his class- You're welcome, bro.",
        "author": "Intrexovert",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g1gd5/to_the_professor_i_helped_with_his_tech_problem/",
        "text": "[removed]",
        "created_utc": 1511843004,
        "upvote_ratio": ""
    },
    {
        "title": "Throw me under the bus, and I'll tell your client you used your wrong email address, can't read, and overcharging them",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g0w35/throw_me_under_the_bus_and_ill_tell_your_client/",
        "text": "[deleted]",
        "created_utc": 1511837668,
        "upvote_ratio": ""
    },
    {
        "title": "Tech support on my own PC",
        "author": "draconian56",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g0jtj/tech_support_on_my_own_pc/",
        "text": "[removed]",
        "created_utc": 1511834543,
        "upvote_ratio": ""
    },
    {
        "title": "\"But you still need to fix my internet!\"",
        "author": "SuperSaltySailorX",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g0ex1/but_you_still_need_to_fix_my_internet/",
        "text": "$me - front line tech support.\n$cust - front line computer illiterate \n\n\n$me: \"hi you've reached tech support, how can I help you?\"\n\n$cust: \"My internet is still not working, and I just took my computer to a PC tech so don't try to blame it on my computer again!\"\n\n\n$me: \"Well the modem is online and the signal is really good, so that's a good start. Do you use a router or are plugged directly into the modem?\"\n\n$cust \" I'm plugged directly in so you can't blame the router, it's just your shitty internet!\"\n\n$me \" well let's take a look at the computer setting to se-\n\n$cust \" it's not my computer!!\"\n\n$me \" well let's try rebooting the modem and see if-\"\n\n$cust \" I already did that! Nothing works just send someone out who actually knows what they're doing!\"\n\n$me internally \"kill me now\"\n\n$me \" I can't send a tech our unless we find the problem so I can tell them what to do\"\n\n$cust \" well send someone out to fix the issue because it not my proble-\"\n\n*BANG*\n\n$cust *loud Yelp* \" my screen went black!\"\n\n$me internally \" rip power supply\"\n\n$me \" that's odd, what's happens if you hit the power button?\"\n\n$cust \" nothing\"\n\n$cust \" there's smoke coming from the computer!\"\n\n$me \" should probably unplug it.\"\n\n$me \" should take that back to the PC tech and see what happened and call us back if the internet still isn't working after\"\n\n$cust \" but you still need to fix the internet!, It's not my computer's fault!\"\n\n$me \" your computer just started smoking, are you sure it's not your computers fault?\"\n\nHangs up.",
        "created_utc": 1511833288,
        "upvote_ratio": ""
    },
    {
        "title": "When shutdown crashes",
        "author": "_vjh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7g0cjl/when_shutdown_crashes/",
        "text": "[removed]",
        "created_utc": 1511832660,
        "upvote_ratio": ""
    },
    {
        "title": "Never Question the power of turning it off and on again",
        "author": "mechengr17",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fzz13/never_question_the_power_of_turning_it_off_and_on/",
        "text": "[removed]",
        "created_utc": 1511829271,
        "upvote_ratio": ""
    },
    {
        "title": "A little TFTS, a little TIFU",
        "author": "Master_GaryQ",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fzo65/a_little_tfts_a_little_tifu/",
        "text": "[removed]",
        "created_utc": 1511826629,
        "upvote_ratio": ""
    },
    {
        "title": "The Speakers aren't Working! or: Solving a Simple Issue in 40 Steps",
        "author": "Nemodryt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fz922/the_speakers_arent_working_or_solving_a_simple/",
        "text": "Standard long-time lurker first-time poster.\n\nQuick backstory: I work as the Youth Pastor/Worship Leader/IT guy at my church, and I was tasked with reworking the entire sound system. The previous guy had all the monitors on stage wired to act as extra speakers, and the system, in general, was in dire need of upgrades and optimization. This was all completed and tested on Saturday so that it would be ready for Sunday service.\n\nNow to the story: I arrive early to worship practice Sunday night with another member, turn everything on and start warming up. We notice very quickly that the house speakers aren't working anymore, so we start trying to figure out what is going on. We go through the entire system, check the amps, check the connections, check the levels, nothing is working. I even grab a ladder so that I can check the speakers themselves. After about 45 minutes of trying everything I have an epiphany: I never flipped the switch to turn on the speakers. As soon as I flipped that power switch everything worked perfectly.\n\nTL;DR: Reworked church sound system, thought the speakers got busted, ended up forgetting the basic rule of IT and checking to make sure it was turned on.",
        "created_utc": 1511823061,
        "upvote_ratio": ""
    },
    {
        "title": "Hospital IT: Year Four",
        "author": "I_Am_Not_Polite",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fz7zo/hospital_it_year_four/",
        "text": "[removed]",
        "created_utc": 1511822812,
        "upvote_ratio": ""
    },
    {
        "title": "My company does support for a nursing home, here's a ticket we got this morning.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fyksf/my_company_does_support_for_a_nursing_home_heres/",
        "text": "[removed]",
        "created_utc": 1511817688,
        "upvote_ratio": ""
    },
    {
        "title": "Simple as that.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fyim8/simple_as_that/",
        "text": "[deleted]",
        "created_utc": 1511817223,
        "upvote_ratio": ""
    },
    {
        "title": "Quick Story About Encryption",
        "author": "WVPrepper",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fyffx/quick_story_about_encryption/",
        "text": "[removed]",
        "created_utc": 1511816534,
        "upvote_ratio": ""
    },
    {
        "title": "Who Stole the Hard Drive?",
        "author": "charmlessman1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fx32a/who_stole_the_hard_drive/",
        "text": "I just walked into the office this morning after a 4 day Thanksgiving weekend.  \nBefore I even sat down, I heard my $Boss call out for me and my $CoWorker to come to his office.  On the $Boss' desk was a small form factor PC, open and empty.\n  \n**$Boss**: $Charmlessman1, when did you leave on Wednesday?  \n**ME**: About 5:30, why?  \n**&amp;Boss**: Well, $CoWorker's computer went offline at about the same time, and when he came in this morning, it wouldn't boot up.  And when he checked it, the hard drive was missing.  \n**$Me**: Missing?  \n**&amp;Boss**: Missing.  Was there anyone else here when you left?  \n**$Me**: I, uh... Um... I don't... I think so?  I'm trying to remember.  \n**$Boss**: If this is a practical joke, it's over, give it back.  \n**$Me**: It's not!  I didn't!  Unless I'm the worst Manchurian Candidate ever...  \n**$Boss**: Ok.  \n  \nI went back to my desk and had a minor freak out.  Do they think I did it?  Did I miss some intruder who stole literally one of the most useless things in an office full of way better things?  Was I going to get fired for something I didn't do because there's no better explanation?  \nShortly after, I heard the boss call in the $HardwareGuy to his office.  Then I heard a bunch of laughter.  The $HardwareGuy came out of the $Boss' office, still laughing.  \n  \n**$HardwareGuy**: The hard drive wasn't missing.  It's one of those little gumstick SSDs, and it's dead.  \n  \n/FreakOut",
        "created_utc": 1511806050,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried to turn it on?",
        "author": "visavillem",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fx1x2/have_you_tried_to_turn_it_on/",
        "text": "The last support job i did for my previous employer (i left because i got a better offer) - a client calls, they had a power outage and now one of the computers won't turn on. \n\nMost of my clients are intelligent enough to know how to turn computers on. I have specially tried to teach them little things like this to reduce the amount of calls, and it mostly works. When we get a call, it's usually a serious issue, so I was thinking it's probably a dead power supply. (A power outage usually means at least a few dead power supplies.) I grab a spare one and head to the client.\n\nFirst things first. Checking the cables - all connected. Monitor is on the same PDU as the PC, and it has power. For a good measure move the power connector to another socket. Check the switch on the power supply - it's on. Starting to search for the ON button - where the fsck is it? On the front panel - no, on top of the front panel - no. \n\nI finally find it, and also understand why the client had trouble - the on button was on the side of the front panel, facing the wall. She didn't even realise you have to push the button, because it was hidden from the view.\n\nThe computer turns on, and I have a laugh with the client. It took even me, a trained and certified support specialist, a couple of minutes to find the power button, so it's understandable that she had trouble turning it on. \n\nDamn you, the manufacturers, who sacrifice the usability for the aestethics...\n\nTL;DR - The client and me had trouble to locate the ON button of the computer.\n\nEdit: because of the popular demand, moved the tldr to the end.\n\nEdit2: The amount of the commas is too damn high! Thanks /u/Telogor",
        "created_utc": 1511805809,
        "upvote_ratio": ""
    },
    {
        "title": "It wasn't the printer!",
        "author": "skyler_on_the_moon",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fx1wg/it_wasnt_the_printer/",
        "text": "Hello! LTLFTP™ etc.\n\nOver Thanksgiving, I visited my parents. After dinner, my dad asked me to supervise a \"computer migration\". This turned out to be that he wanted the computer (and all the other equipment on the desk) plugged into a surge protector, rather than the regular power strip they were connected to at the time. I watched as all the plugs were unplugged from one and plugged into the other, we verified the router came back online and the wifi was working, and job done! And a plate of cookies into the bargain.\n\nThe next day, I got a call saying that my mom couldn't print. Now, my mom has a Chromebook, and they have an old HP Laserjet which does not support Google Cloud Print. So, my solution was to give them a Raspberry Pi, add the printer on the Pi, and set it up in Chrome to forward the printer to other devices on that Google account. This had been working fine up till now.\n\nI took a guess that the printer IP might have changed when the router restarted. I came over, armed with a keyboard, mouse, and HDMI-VGA converter (my dad's monitor didn't have an HDMI port). Connected up the Pi to the monitor, and...nothing. Tried restarting the monitor, trying to make it select the right input. No dice. \n\nAt this point, I took a closer look at the Pi and noticed that there were no lights on. Apparently I'd knocked out the power cord while plugging in the HDMI converter. I plugged back in the power cord, and *still* no lights. Did we somehow fail to plug it in? I traced the power back to the plug, and discovered - that the right prong was plugged into the left slot of the power socket, while the left prong was hanging off the side. After plugging it in correctly, the Pi turned on, the monitor turned on, and the printer started printing. And I got half a pecan pie to take home!\n\nTL;DR - Thought it was tape over mouse, turned out to be a cup in the cd drive.",
        "created_utc": 1511805804,
        "upvote_ratio": ""
    },
    {
        "title": "An email came in today through the support queue",
        "author": "warrioratwork",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fwh3m/an_email_came_in_today_through_the_support_queue/",
        "text": "[removed]",
        "created_utc": 1511801270,
        "upvote_ratio": ""
    },
    {
        "title": "How TFTS kept me from being an idiot",
        "author": "honeyfixit",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fw0px/how_tfts_kept_me_from_being_an_idiot/",
        "text": "Let me set the stage. I work in a large retail department store. It's the weekend after thanksgiving, it's incredibly busy and sporting goods (not my usual department) is even busier.  You see buck season was starting the next day so all those idiots who waited to til the last minute to buy a rifle or get their hunting license are now swarming the store.  There's only one guy working in sporting goods that morning and he was getting overwhelmed (when selling a firearm, policy is that you don't wait on any other customers while this is going on), so he made a general call for help over the radio and my manager asked me to go help him get caught up.  \n\nMe being a helpful guy, I agree.  I take over the hunting licenses so he can do the firearm sales.  Everything goes fine until I get this one guy who wanted a replacement hunting license.  That by itself is not a big deal, but what happened was that I got all the way through the process, press print, and I get a \"system time out\" error.  Grumbling to myself, I go over to the phone and call the 24 hour customer support line, i navigate through 3 different phone menus and get placed in the queue on hold.  I proceed to stand there for 45 minutes listening to light jazz and soft rock, while every 2 minutes I hear \"Due to high call volume, you may experience longer than normal wait times.  Please continue to hold for the next available representative.\"  \n  \nFINALLY I get to the front of the line. I explain my problem to the tech and he tells me \"We had an issue with that earlier today but I think it's resolved.  Go ahead and try processing the license again.\"  \n  \nI wanted to be a \"CUSTOMER\" and yell at the guy in frustration about waiting on hold 45 minutes to be told \"try again,\"  I really did.  But I remembered all the tales I've read here on TFTS and just kept my mouth shut because it wasn't that guy's fault.  \n  \nTL;DR:  I waited on hold for 45 minutes to be told \"try again\" but rather than venting on the tech, TFTS kept me from sticking my foot in my mouth.\n",
        "created_utc": 1511797494,
        "upvote_ratio": ""
    },
    {
        "title": "Sub somehow messes up Boot",
        "author": "Jawa457",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fvwoy/sub_somehow_messes_up_boot/",
        "text": "[removed]",
        "created_utc": 1511796526,
        "upvote_ratio": ""
    },
    {
        "title": "Recent call from Director's Secretary",
        "author": "Ian502",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fv8fr/recent_call_from_directors_secretary/",
        "text": "Hello everyone! \n\nI've been following this sub for a while, and finally got a chance to post.\n\nIt's a short little tale that happened a few minutes ago.\n\nSo this user is the Manager's Secretary/Receptionist (She'll be $J and I'll be $ME), and she's been calling all morning for typical problems, \"Network not connecting\", and \"I need this program\" kind of things.  \nIt goes like this!\n\n\n&gt;$Me: Hello, this is /u/ian502, How may I help you?\n\n&gt;$J: /u/ian502? How are you? I must be bothering too much.\n\n&gt;$Me: Oh no, not at all. Tell me.\n\n&gt;$J: Ok, I'm trying to set up a Hangouts Meeting, through the calendar, and I'd like to know if this Friday 8th is a holiday on the other countries involved.\n\n&gt;$ME: Uhmm, $J, google is your friend.\n\n&gt;$J: Yes, all right. Which countries does $Company has HQ's for?\n\n&gt;$ME: I guess Argentina, US, Brasil, Ecuador, Guatemala, and...*got interrupted*\n\n&gt;$J: I don't know how to do it. So could you check the holidays for those countries?\n\n&gt;$ME: I'm sorry but I can't help you with that, It's not something I'm supposed to do.\n\n&gt;$J: Ok bye.\n\n&gt;$ME: Bye.\n\n\nOK I got kind of upset because she should be doing her job. Not asking me. The good thing is that she asked nicely, but is excusing herself a lot of the time with this. Last week she had lost the recovery passwords she had! And I explicitly told her to save them.\n\nI've been getting pointless requests too often.",
        "created_utc": 1511790098,
        "upvote_ratio": ""
    },
    {
        "title": "Server whisperer - Undocumented boot procedures",
        "author": "visavillem",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fv1ei/server_whisperer_undocumented_boot_procedures/",
        "text": "Background: about a decade in IT support - networks, hardware, software. I have worked for different companies that provide IT support to other companies.\n\nThis happened a while ago, when i was still \"green\". Company i worked for at the time, provided IT support for a magazine publisher (a largish enterprise, about 20 weekly magazines, over 200 users). I was the on-site support person, which meant that i spent my workdays at the site. I was also on call 24/7 every other week. So one night (around 1 or 2 o'clock) a call comes in - the emails are down. OK, i try to troubleshoot remotely - but the mail server is not responding. I lived close by at the time, so i went to check it out. I must point out, that i was not really experienced with the servers then, we had admins who kept our client's servers happy. \n\nSo, in the middle of the night i go to the server room (my second visit there, first one was \"orientation\"), and check out the mail server. The server was an ancient Compac (5U form factor, if i remember correctly, this thing was huge), with a few SCSI disks for mail database and the operating system ran from a single PATA disk (that wasn't even attached to the server, just lying atop, with an anti-static bag as the insulator. The message on the screen was: \"No operating system found\". Oh crap, do i really have to reinstall the system in the middle of the night, when all the admins are sleeping? Let's try the reboot first. On the reboot i noticed, that the server was trying to boot from the SCSI array, not the system disk (the standalone ATA). OK, i have been on this rodeo before, obviously the boot sequence is wrong (experience from fixing the PC-s told me so). Entered the BIOS and started to search around. The primary boot device was the IDE disk, no mention of the RAID array. Weird. So i tried to reboot the server one more time, but it still tried to boot from the RAID. I tried to read all the prompts, but there was no mention of the boot device. Now i was getting desperate. Client called me every 15 minutes (the reboot cycles took about 30 minutes), because their 24/7 telemarketing department was unable to work. I Tried another reboot, but this time i basically mashed the keyboard randomly and guess it was beginners luck that i managed to hit the right key that made the server to boot from the right drive. There were no prompts on the screen, it was just pure luck. Got the server up.\n\nBut of course the shutdown that started the whole thing, was not a graceful one (a power failure, for some reason the server was not connected to the UPS), so now the mail system refused to start. I was half ready to call one of the admins (actually a friend of mine, met him before i started working for the company), but decided to google the error message first. Error message meant, that the mail database was corrupted, and had to be fixed with an utility. It took a few hours, but after that the mail system started working again. It was early hours of the morning when i finished, so i decided to stay for my day shift. Spent the day feeling as a zombie and slept in the next day.\n  \nAbout a year later another tech called me - he had trouble booting the server. I told him to mash the keyboard randomly during the bootup. After that the client decided to replace the server (by the time it had other problems too).\n\nTL;DR Server refused to boot after power failure, had to discover the undocumented boot procedure and fix the e-mail database.  \n\nEdit: moved TL;DR to the end (as per advice from /u/kidasquid)",
        "created_utc": 1511788053,
        "upvote_ratio": ""
    },
    {
        "title": "The girl &amp; the spy software",
        "author": "Wiegerdubbeldam",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fu4g6/the_girl_the_spy_software/",
        "text": "[removed]",
        "created_utc": 1511776394,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Reimagining",
        "author": "Doofitator",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ftxfx/eli5_reimagining/",
        "text": "[removed]",
        "created_utc": 1511773739,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of the Missing Bell Software",
        "author": "Oneota",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fsrvc/the_tale_of_the_missing_bell_software/",
        "text": "I work in K-12 IT for a school district in the midwest US with about 4,000 students.  Our high school was rebuilt in a phased project that lasted from 2006-2009.  Our tale today comes to us courtesy of the bells/intercom system in this building, which, for cost-cutting reasons, was transferred over from the original building instead of being purchased new with the reconstruction (a decision outside of my control).\n\nCast: $me - District's IT manager.  Department of 3 (Me, Assistant IT Mgr, and a tech) responsible for the entire district (2,000 proper computers, 2,500 Chromebooks, 500 iPads, assorted printers, network, WiFi, projectors, etc).\n\n$Principal - High School principal\n\n$FOC - Freakin' Old Contractor - runs a local AudioVisual/Integration business.  Nice guy, his company has somehow come to be in the position of providing support for our intercom system.  Has also done a few Audio/Visual projects in the building.  Aging gentleman, seems to be having Parkinsons-like symptoms, usually ends up spending most of his time on-site telling me how things have changed in the 30+ years he's been in the business and telling me how we need to just replace the bell/intercom system (which his company just happens to sell, but still - he's right, it needs to be put out to pasture).  I suspect he's got another year or two before he decides to hand his business over to someone else.\n\nOur $Principal had a hands-on relationship with the bell system in his building (which, incidentally, is where my office and datacenter are located, despite my responsibility being for the entire district).  He would come in and set the schedules, tweak settings, and basically sort of made it his own thing.  We've had problems with the system since the day it was installed in the old building a couple of years before the reconstruction, and things didn't magically fix themselves when it was transferred to the new building.  Thankfully, this was one of the few areas where I really wasn't expected to provide any support or have any involvement, so the fact that the system sucked wasn't my problem, and I was totally okay with that.\n\nThe $principal had a laptop that was supposed to be dedicated to the building's security cameras, but which also happened to have the software on it to connect to the bell system to let $principal do his tweaking.  This laptop royally sucked at life - the security camera vendors provided it without consulting with me about its specs or anything, and it was a crummy consumer-grade el-cheapo laptop that was underpowered for its job from the day it was taken out of the box.  It was originally running Windows 7 (Home edition!  I mean, really...) and halfway through last school year I decided to see if it could handle Windows 10 as a last-ditch effort to make it better.  I maxed out its RAM, and surprisingly enough, it was actually a more responsive box with Windows 10 than it had been with Windows 7.  I did a wipe-and-install, but before I wiped the disk, I saw the software needed for the bell system, and made an honest attempt to copy it over.  I didn't have any experience with it, though, and so I had no particularly good way of determining if my transfer had worked.  I figured, if it didn't work, I would be told, and we'd re-install from wherever it had come from in the first place - no biggie.  \n\nEven though W10 was better than W7 on this box, it was still an awful end-user experience, so this year, about 7 years after it originally came on-site, I decided to put it out of its misery.  I got a nice new laptop prepped for the principal.  Fast forward a few months, and $principal wants $FOC to make another attempt at fixing some latent issues hanging around in the bell system.  This is apparently the first time he's tried to connect to the system since before I wiped his original laptop from Windows 7 up to Windows 10, and certainly the first time with his new security camera laptop.  This is where our tale begins.\n\n&gt;$Principal: $Me, I've asked $FOC to work on the bells, but my new security camera laptop doesn't have the software.  Can you hep?\n\n&gt;$Me: \"Sure, let's see what's up.\"\n\nHmm...apparently forgot to re-transfer the already-transferred-once software over.  Fortunately, I happen to have the original laptop sitting in a pile of waiting-to-be-recycled hardware, so let's pull it out.  \n&gt; *Launches software*\n\nDarn...basically immediate crash whining about missing DLL files.  Googling the names of the missing DLL files reveals that the original software was written in Visual Basic 4, and compiled as a 16-bit project.  Yeah.  Further research reveals that its original system requirements talk about how you can install it on Windows 3.1, Windows 95, or Windows 98.  Running in that new-fangled Windows NT 4 is \"Not supported.\"  \n\nOur intercom/bell system was manufactured by a large company, and their PA/bell division had apparently been bought and sold a few times over, and the system is old enough that no one wants to acknowledge its existence or support it.  There's very little mention of the system on the internet, and the software needed to manage it simply isn't available.  There isn't a supported, sanctioned copy out there anywhere.  The original bell system vendor (a small local company who was heavily involved in the high school's reconstruction) apparently installed the software on $principal's security camera laptop years ago, and they've fallen off the face of the planet in the intervening years, so we can't contact them to get a copy.  I had assumed our department installed it, and as such, assumed we'd have its installer in our repository, but that ended up not being the case.  This could potentially be very bad.  Even though I don't support the bell system, the fact that we no longer have a functioning copy of its management software is my fault, so I'm determined to fix it.\n\nI put on my Sherlock Holmes hat and start scouring the 'Net.  There's a forum where other sysadmins have lamented the software's disappearance, and one responder has offered to send copies out to people, but those responses are over a year old in some cases.  Still, I give it a shot and put in a \"Me, too\" response.  I figure, on the off-chance that I get a response, I'll treat the copy I get from that person as a last-resort (after all, installing software you get from random-person-on-the-internet isn't exactly a Best Practice).  Other than that, I come up empty-handed.  I find a handful of the old, 16-bit DLL files this software complains about missing, but I'm still not able to get the software back to a fully-functioning condition.\n\nI get desperate and search my email to see if I happened to have been included on any correspondence with the original vendor years ago about this software, and lo-and-behold, find an email from $principal with an attachment containing an installer for the software!  Woo Hoo!  Except...the email is from 2009.  We transitioned from a locally-hosted, Dovecot-based mail system to Google Apps for Education about 4 years ago.  While the email that $principal sent me made the leap from the old system to the new, the attachment did not - it's a 0-byte file.  You know those scenes in the movies where the hero jumps a chasm and gets about 90% of the way across the gap and then falls?  That face he makes just before gravity takes hold was the same one I made when the attachment failed to download.\n\nFortunately, I'm a digital pack-rat, and we did a Physical-to-Virtual migration of our old mail server after we decommissioned it.  I fire up the old mail server VM, and check to make sure all the files it expected to be there were present.  I wouldn't be able to connect using a standard mail client, since none of the DNS names were valid anymore, the VM wouldn't be getting the IPs it expected to get, and we had changed directory servers, so the mail server had no idea who anyone was anymore, but that was okay.  I have enough Dovecot experience to know that it stores client mail files as plaintext.  The email is there somewhere, I just have to find it.\n\nI look through my current mailboxes to find one whose name was likely to be unique to my mail hierarchy, and which would have existed back in 2009.  Run a quick `find` command to figure out the path to my mail store on the original mail server.  Then `grep` the mailbox to find the original copy of the email that $principal sent me.  Found it!  Copy-paste the Base-64 text containing the attachment to a new file, and decode that into my prize: A 3.8 MB .zip file.\n\nBring that over to the original laptop, and....it fails to install.  But!  It installed a lot of the missing .DLL files before it died.  I'm able to combine those .DLL files with the ones I found on the internet and am able to get the software to launch and not complain about missing any files.  I had honestly expected to have to set up a VM running XP or Win 7 to get the software to work (being 16-bit VB4 code, after all), but surprisingly enough, it works fine on the original laptop.  I'm sure that's because I stuck with 32-bit Windows 10 on it.  I have no doubt at all that this software will never run on $principal's new 64-bit laptop, but oh well.  $FOC was able to get his work done, and after hearing my tale, said that I had saved the district a LOT of money by getting this software back into operation, since new intercom systems run into 5-figures pretty easily.  I smile, and keep to myself that I had already basically told $principal that he needs to be talking to our CFO about replacing the intercom system with something that we can actually support with modern tools.  I'm sure $FOC will be getting a call from him soon to discuss possibilities.  Merry Christmas, old man.\n\nOh, and about half an hour after I get the software working, I get a reply from the forum with a link to a 3.8 MB .zip file.",
        "created_utc": 1511759228,
        "upvote_ratio": ""
    },
    {
        "title": "My worst tech support story of all time",
        "author": "nagumi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fpqpv/my_worst_tech_support_story_of_all_time/",
        "text": "My worst tech support story of all time wasn't a shitty user, it was an absolute failure of my brain to process information.\n\nI live in Israel, and of course our keyboards are bilingual (hebrew and english). If your OS is configured in english, your keyboard defaults to english. To switch input languages you hit alt+shift. This is pretty normal for bilingual keyboards. Hebrew (and some other languages) have something that's sometimes hard for english speakers to get: we don't have upper-case and lower-case. That means that if we're typing in hebrew and hold down shift (which in english would give us CAPITAL LETTERS) we get english capital letters. I guess the keyboard monkeys at microsoft in the early 90's figured that shift makes letters capitals, and hebrew has no capitals, so if the user hits shift they must want *some* kind of capital letter!\n\nAnyway, I get a call from my mother, who's not a very technical person (though she's one of the smartest people I know). She's typing in hebrew in MS word and is having trouble.\n\n&gt; Mom: it only types in english capital letters!\n\n&gt; Me: that's weird... did you try switching to english?\n\n&gt; Mom: yes, it still types in capital letters.\n\n&gt; Me: What if you hold down shift?\n\n&gt; Mom: it switches to lower case english while I hold it down!\n\nI troubleshoot for like 5 minutes before my mom interrupts me:\n\n&gt; Mom: Wait, nevermind, I fixed it!\n\n&gt; Me: What was wrong?\n\n&gt; Mom: Caps lock was on!\n\nI've never been so humiliated.\n",
        "created_utc": 1511729959,
        "upvote_ratio": ""
    },
    {
        "title": "“Why is my monitor black?”",
        "author": "akorah91",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fmhmj/why_is_my_monitor_black/",
        "text": "Back in the day, I was a supervisor in a small internal help desk that supported 10k+ customer-facing employees. I learned quickly that while my help desk employees knew the applications we supported very well, general computer knowledge was sporadic at best.\n\nAs I got ready to leave one day, $Employee came up to me in a panic.\n\n&gt; $Employee: The keyboard wasn’t working, so I tried to fix it but now the monitor isn’t working either.\n\nI followed her back to the desk, mentally listing the things my employees normally did, like bumping a cable or accidentally hitting the power button on the monitor. When I got to the desk, I saw the power light on the monitor was amber, so I hit the button. No dice.\n\nAnd then I noticed everything seemed oddly quiet. Out of curiosity, I put my hand against the computer tower sitting on the desk to see if I could feel a vibration.\n\nNothing.\n\nI hit the power button and heard the computer roar to life. The monitor flashed on and the keyboard lit up.\n\n&gt; $Employee: What did you do?!\n\n&gt; $Me: I turned it on.\n\nMany years and many problems later, it’s still the greatest issue I’ve ever solved.",
        "created_utc": 1511697462,
        "upvote_ratio": ""
    },
    {
        "title": "What do you mean the ethernet cord is stuck?",
        "author": "kv-2",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fjx5l/what_do_you_mean_the_ethernet_cord_is_stuck/",
        "text": "So this was a literally recent (&lt;10 minutes ago) family tech support call. \n\nWas doing the standard call back to the folks around the holidays with the small talk to make Mom happy when she commented she had a new *lled* business laptop. My brother had helped her setup the *CalendarYear* email software and when she went to unplug the ethernet cord it wouldn't pop out. Also involved were my father and brother. \n\nNames should be self-explanatory, but the fun one is the about to graduate high school brother. \n\n**Me**: What do you mean it won't come out?\n\n**Mom**: It won't, it's stuck in the doggy door.\n\n**Me**: What?\n\n**Mom and Dad**: It has a little door to hold it in. \n\n**Me**: What door, it's a standard plug.\n\n**Brother**: It's an RJ-45 port.\n\n**Me**: No shit.\n\n**Mom**: *Other son* what is the model of the computer?\n\n**Brother**: *Spouts off model*\n\n**Father**: I'll send you a photo of it. *Photo sent*\n\n*Note: The computer is so thin that a standard port is too thick for the computer, so it has a flip out expansion so the connector fits*\n\n**Me**: Oh, *googles how to remove stuck RJ-45 connectors*.  Grab the jeweler's screwdriver, push in, pry, then pull it out.\n\n**Father**: Got it.\n\nThroughout this my brother has been chatting about what he had found: he managed to Google that RJ-45 connectors can get stuck, it is an issue with this model, but not how to get it unstuck. I love being phone tech support 3 time zones and ~2500 miles away. ",
        "created_utc": 1511663015,
        "upvote_ratio": ""
    },
    {
        "title": "It is now working, thank you for your time!",
        "author": "andrewf5",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fjqol/it_is_now_working_thank_you_for_your_time/",
        "text": "Joy oh joy. I do tier 3 remote support for a national company, things get to me generally because they have reached a programming level error, or at least something tier 2 can't figure out. Sometimes though, it goes straight from end user to me, and well....\n\n&gt;Email from my boss: This is John, he's having problems in the XXXX conference room. Please assist.\n\n &gt;*Off to skype.*\n\n  &gt;Me: Hey, John (we'll go with John.) I hear you're having some issues with your conference room. I have not received much information on the topic, can you fill me in on your issue?\n\n  &gt;John: Hey - our computer isn't showing up on the screen.\n\n  &gt;Me: Oh...well, I see that particular room has multiple inputs. Which input is the issue?\n\n  &gt;John: The laptop inputs work fine, it is the desktop that isn't working.\n\n  &gt;Me: Oh. Well, John, generally issues like this are a cable failure of some form. Occasionally an input on the switcher goes down. Do you have a Tier 2 person on site that I can work with, or would you rather work through this with me?\n\n  &gt;John: It depends, what do you suggest?\n\n  &gt;Me: The best way to troubleshoot this would be to start by replacing the HDMI cable in the back of the unit. Someone may have rolled something around wrong or put tension on it...lets start there. Let me know when you've tried that and we can go from there. We can also plug a laptop into that input of the switcher to ensure the desktop isn't having issues.\n\n  &gt;John: We don't have any additional HDMI's in our facility *(uhh????)*, I'll have to see with \"steve\" when he comes in at 4. I think he may have one.\n\n  &gt;Me: Just let me know, thanks!\n\n  &gt;*4:15 -*\n\n  &gt;Steve: I checked the cable and had realized that it was unplugged the whole time.....It is now working. Thank you for your time!\n\n  &gt;Me internally: *Why the Fucking^fuck didn't you try that first*\n\n  &gt;Me on Skype: No worries, glad it was something easy!",
        "created_utc": 1511661128,
        "upvote_ratio": ""
    },
    {
        "title": "Just hit it with a hammer, that's the only way to fix it!",
        "author": "joelazot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fi89q/just_hit_it_with_a_hammer_thats_the_only_way_to/",
        "text": "[removed]",
        "created_utc": 1511646211,
        "upvote_ratio": ""
    },
    {
        "title": "The unplanned test",
        "author": "monedula",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ffwhf/the_unplanned_test/",
        "text": "Here's a blast from the past.\n\nColleagues were carrying out the Factory Acceptance Test of a safety-critical process-control system. It was important enough to include a hot standby. (This was back in the days when if you wanted hot standby you wrote the code yourself.)  The production environment would also have a cold standby in a different building. And another cold standby in another building further away. It was that important.  \n\nWe had spent two weeks rehearsing the two-day test multiple times, because we absolutely did not want any embarrassing errors in front of the customer. Not for a system with an 8-digit price ticket. Not for a system this important.\n\nThe acceptance test went well for the first three or four hours. More and more ticks appeared on various forms. People gradually relaxed. And then, after a simple innocuous command, the system froze. A \"server not responding\" message appeared.  People looked at each other with concern, bordering on horror. One of them sprinted to the server room.\nHe came back half a minute later, looking very embarrassed. \n\n&gt; **$colleague**: One of our TS guys rebooted a test server - and got the wrong server. Sorry about that.\n\n&gt; **$other_colleague**:  The hot standby has taken over. Shall we carry on?\n\nEveryone looked sheepishly at the customer staff. To their astonishment the lead customer tester was smiling broadly.\n\n&gt; **$customer**: That's fine. We can see from your faces that that was completely unplanned, and the hot standby has done exactly what it should do. That's a much better test of a standby than just following a script.\n\nThe collective sigh of relief was heard in the next room.\n\n\n(I was reminded of this incident by [this post](https://www.reddit.com/r/talesfromtechsupport/comments/7f28ws/thats_ok_im_in_the_test_systemuh_oh/) yesterday.)\n",
        "created_utc": 1511624349,
        "upvote_ratio": ""
    },
    {
        "title": "Setting up a second monitor",
        "author": "pliskin2212",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fevp1/setting_up_a_second_monitor/",
        "text": "Back when I was still relativly new with IT and on my first real assignment alone (I still believed Users knew what they where doing, bless my innocence)\nthere was this older gentleman, who was the most experienced in what he was doing. (Planing flightroutes)\nHe opened a ticket about getting a second monitor, which was approved. \nI'm me and he's OG\n\n&gt;me - Hello OG, i'm bringing your new monitor\n\n&gt;OG - Oh, they finally approved it\n\n&gt;me - Yeah, let me connect this for you (Connected it with the PC, set it up as a second monitor, you know the drill)\n\n&gt;me - So, it's connected and working, do you have any questions. (I'm expecting a \"No\")\n\n&gt;OG - Yes, I have one. How do I use the monitor\n\n&gt;me (stumped) - What? What do you mean: How do I use it?\n\n&gt;OG - Well how do I make that window go over there?\n\nme using the mouse to slowly relocate the window to the other monitor. (I wasn't sure if he was making a joke at this moment)\n\n&gt;OG - Wow, that was easy (Now I'm sure, he wasn't) Thank you for your help.\n\nEDIT: Formatting",
        "created_utc": 1511612315,
        "upvote_ratio": ""
    },
    {
        "title": "Could you fix my internet?",
        "author": "forerunner23",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fdcyc/could_you_fix_my_internet/",
        "text": "Hello all! Obligatory LTL;FTP and suches.\n\nSo, short background: I obtained an intern position at my school district's IT department, doing IT in all the schools, and tech support, of course, comes along with that. Also short aside that it's entertaining that the Tech Director has asked me how to do things like Group Policy and the like, so that's always fun. \n\nOn to the actual story.\n\nOne day a few months ago, a teacher we will call random econ teacher or **$RET** submitted a ticket into {Fairly popular ticketing system} (not sure if I can use names of software/infra). I decided to head down to **$RET**'s room after school that afternoon to see what might be causing this issue. Of course, it took an impossibly long amount of time to even login, considering many of our faculty are running on slow Dell OptiPlex machines with Core 2 Duos or Core i5s with like 2GB RAM, which is barely enough to *boot* Windows 7, let alone run it *acceptably*. So, after waiting a very, very long time, I got into network diagnostics and waited. And waited... you get the picture. Eventually, network diagnostics told me there wasn't a cable plugged in. So, naturally, I *again* checked the cable, and sure enough it was plugged in. I checked the wall, and the same outcome. So, I replaced the cable and all was well. \n\nYou might be wondering what was wrong with the cable. Well, after running the length of the cable I discovered that either a rat chewed partially through it and cut 3 of the 6 wires, or that some jerk HS student used a knife and cut through some of the cables. Pick your poison.\n\nTL;DR: Teacher submitted a ticket saying her internet wasn't working, replaced cable, found sever in the original cable that was either caused by rat or by student with a knife. Go figure.",
        "created_utc": 1511589375,
        "upvote_ratio": ""
    },
    {
        "title": "Dell's appalling customer service and warranty dodging",
        "author": "victoriashah",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fc34g/dells_appalling_customer_service_and_warranty/",
        "text": "[removed]",
        "created_utc": 1511574602,
        "upvote_ratio": ""
    },
    {
        "title": "Cranky USB Ports",
        "author": "egefeyzioglu",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7fbbni/cranky_usb_ports/",
        "text": "I'm not official IT but since I happen to know how to use Google, am not scared by CLIs, try turning it off and on again and happen to have a little bit of experience with IT related work, I am the designated \"do your magic and make this work\" person in the school. A couple of months ago, I was sitting in the computer lab, minding my own business, when $student came up to me.\n\n\n$student: Hey can you help me, I can't print this file and I need it by tomorrow.\n\n$me: Did you try going onto $fpsServer and double clicking on the pri-\n\n$student: Yes yes I know that but that isn't the problem. The computer isn't recognising the USB stick.\n\n$me: (internally: Whish you'd said that first) OK let's take a look.\n\n\nWe walk over to her computer and the first thing I notice is that she has two mice plugged into the computer. One of them goes through the cabling hole and plugs into the back of her computer and the other one is plugged into the front panel. Now, this isn't uncommon since our computers don't usually come with working mice (I know, right? Who needs a working mouse anyway...) and the mice are ziptied to the rest of the wires so you can't pull it out. When the mouse breaks (either due to wear or more likely due to someone fucking with it) we have to plug our own mice in to work. Just to be sure though, I ask her if the original mouse works and she says no.\n\nThen, I start doing the standard stuff: plug the USB drive out, plug it back in, check device manager and then I decide to try another port. Since I know the port the mouse was plugged in works, I unplug the mouse and plug the USB drive to that port and it works.\n\n\n$me: Oh there you go, the port was broken.\n\n$student: Thanks a lot. See you. *plugs the mouse in the broken front panel port*\n\n$me: Oh wait no that won't work becau- wait what? It's working?!\n\n$student: The USB drive's gone again.\n\n$me: Let me try something...\n\n\nI unplug both devices and then plug the mouse in to the \"broken\" port. It works. Then, I plug the USB drive into the \"working\" port. It shows up, bit I can't use the mouse now. I pull the drive out and sure enough, the mouse is working perfectly fine. I switch the ports, same thing happens. The device that was connected later works but the other one refuses to work until the other device is plugged back out.\n\nI still don't know why or how this happened. I've used the same computer many times now and with no such problems.\n\nTL;DR: Magical front pannel USB ports refuse to work together, one drops out the instant something is pluged into the other one.\n",
        "created_utc": 1511566756,
        "upvote_ratio": ""
    },
    {
        "title": "Screenshot",
        "author": "MichiganSupercars",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7faorr/screenshot/",
        "text": "[removed]",
        "created_utc": 1511560610,
        "upvote_ratio": ""
    },
    {
        "title": "How many bars does the device have?",
        "author": "djxiii",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f9ikv/how_many_bars_does_the_device_have/",
        "text": "Last night my evening tech. had a student walk-up to the Servicedesk.  It seemed like a normal request for help... at first.    \n    \n&gt;My Tech: Hello, what can I help you with?    \n&gt;Student:  I need help with the device over there.  I don't know how to use it.    \n&gt;My Tech: Which one?  The old video playback unit?    \n&gt;Student: No, it is the one with the letters and numbers.  I do not know how to use that device.    \n&gt;My Tech: Letters and Numbers?      \n&gt;Students: Yes, the one just around the corner.  I do not know how to use it.  It has chips and chocolate bars.  Can you help me?     \n&gt;My Tech: Ooooh.  The vending machine.  Of course.    \n\nMy tech shows her how to get her snacks.  IT support at its finest.  ",
        "created_utc": 1511549892,
        "upvote_ratio": ""
    },
    {
        "title": "Nothing is working!",
        "author": "theservman",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f9hb7/nothing_is_working/",
        "text": "[removed]",
        "created_utc": 1511549566,
        "upvote_ratio": ""
    },
    {
        "title": "Black Friday Discounts",
        "author": "twobit694200",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f9bhx/black_friday_discounts/",
        "text": "[removed]",
        "created_utc": 1511548115,
        "upvote_ratio": ""
    },
    {
        "title": "Tale of a Stupid Developer (me)",
        "author": "egefeyzioglu",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f79xl/tale_of_a_stupid_developer_me/",
        "text": "Obligatory LTL;FTP;I'm on mobile so excuse the formatting;\n\nIn this subreddit, there are usually stupid-user or stupid-other-tech stories but this time, I am the guilty one.\n\nThis one has a large backstory that could be a post on its own so I'll write TL;DR when the backstory ends and the actual story starts so you can just scroll down and skip the backstory.\n\n\nIn our school, we have close to 1000 users but only one IT technician. To make it a little less hell for him, we -the more technically inclined students- act as his minions and do the simpler tasks. Also, we have an in house system that allows users to register for events and book computer usage hours ($webPortal)\n\nThis time, I was asked to develop a module for $webPortal that would allow students to register for term projects. The students choose 5 classes in order of preference and tick a box if they want to have two projects instead of one. Each teacher has a set quota of students and the system assigns the students to teachers based on the info entered and the quota. Simple stuff. Would have been better if it wasn't the middle of the finals week but what could possibly go wrong? I develop the module and send a link to it to the vice principal ($VP)\n\n\n$me: Hi $VP, I've finished the module you asked: $link\n\n$VP: Thank you, I'll send the link out tomorrow.\n\n$VP: Actually, could you add a link to the home page of $portal, I don't want people claiming they couldn't find the page.\n\n$me: Sure.\n\n$me: Done.\n\n\nThe next day, $VP sends the link out and people start using the system. After a couple of hours, he messages me again.\n\n\n\n------------------TL;DR -------------------\n\nTL;DR of backstory: I'm asked to develop a term project assignment system on $webPortal by $VP. A couple things go wrong but nothing too major.\nTL;DR of the whole story in the end.\n\n$VP: The Prep Class students are assigned  teachers when they choose English. The English Dept will assign the teachers themselves, the system shouldn't do that. Can you fix it.\n\n$me: (internally: Well I wish you'd mentioned that before this was published) OK sure I'll add that in.\n\n$VP: Thanks when will it be ready?\n\n$me: I'll try to do it this night\n\n\nI quickly bodge in some javascript that checks to see if the user is a Prep Class student and disables the teacher assignment system. And writes \"TBD\" in the teacher field. For some reason, this doesn't work and throws an \"Teacher quota exceeded\" error. Continueing to bodge, I add in a special case that checks to see if the teacher is \"TBD\" and ignores the error.\n\nNow, this is bad enough since I'm ignoring the error instead of fixing it but it works and I don't care. Or so I thought.\n\nAfter uploading the new code, I submit the form to see if it worked. The page loads, loads, loads, loads, and chrome throws a timeout at me. I hit refresh, it loads, loads, loads and then times out again. Blaming the slow internet connection (too many checks at the firewall, I assume. I'm not allowed to look there) I decide to use my phone's LTE connection instead.\n\nI connect my phone to my laptop and hit refresh. It loads for a while and then I'm faced with the dreaded Apache 500 Error page. Shit.\n\nI look at the code again, expecting to see this:\n\n\n    if($teacher == \"tbd\"){\n        //execute INSERT query\n    }\n\n\n\ninstead I see this:\n\n\n    while($teacher == \"tbd\"){\n        //execute INSERT query\n    }\n\n\nOH. SHIT.\n\nI immideately add a die(\"This page is under maintenance\"); to the beginning of the file and decide it's too late (around 1 AM) to clean the mess in the database.\n\nNext morning, I go to phpmyadmin to check how much damage was done. Every single time someone tried to submit the form, it added rows until the computation timed out. Scared, I click on the table name. The page that usually loads in tens of milliseconds, takes almost ten seconds to load. I look at the auto increment id collumn, expecting to see a value in the thousands. The largest id in the database is somewhere around six million. My stupid simple mistake had caused the table to be 40MB in size.\n\nLuckily, though, the damage was limited since the six million rows I inserted had slowed the system so much, that no one else could load the page in the first place. So all the entries were from a single user and I could simple delete all the rows with that user id.\n\nTL;DR: I accidentally write something that always evaluates to true inside a while loop's condition and run an INSERT query in the loop, resulting in inserting over six million rows to a database.\n\nI hope you enjoyed this post and any formatting help is appreciated.\n\nEdit: Just to clarify, I like $VP very much and before he asks me to do something he always asks to make sure I actually have time.",
        "created_utc": 1511527735,
        "upvote_ratio": ""
    },
    {
        "title": "Hey, did you know the customer can't login? Or why you shouldn't \"quickly\" upgrade a critical system right before you go to sleep",
        "author": "PrutsendePrutser",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f6mkq/hey_did_you_know_the_customer_cant_login_or_why/",
        "text": "Disclaimer: This is a pretty long one, longer than I expected. It's not a story that works using different parts, as the events were spread over only one morning, a pretty damn intense morning. Also decided to keep it as a single story, because it shows for me the value of admitting your mistakes and taking your responsibility when it's most needed\n\nTL;DR: See the end of the story\n\nFirst off, I drink coffee, quite a bit of coffee. It's a very nice way to wake up, and get my brain up to speed. There are some things that work just as good, or even better, including, but not limited to, chili, waking up on a summer morning and then eating breakfast in sunlight. Oh, and getting a call at 8:32 (two minutes after business opens) if you can check why the customer can't log in.  \n\nRight, time to introduce the cast for this one:\n**$me**: Probably pretty obvious. Also the guy who did dumb things, and then managed to fix them without data loss\n**$sup**: My supervisor, who gave me the call\n**$customercontact**: Contactperson from the customer. Great person, provided helpful feedback, never rude, and understands and respects that fixing software isn't always as easy as people think\n**$sysadmin**: Dude who manages our IT equipment\n\nThe critical system I mentioned is basically a sort of ERP system that $customer uses to log all their work. We've developed an in-house system over the past few years internally, I inherited that system when I started working for my employer. Because of the very old techstack that was used, it was the time to upgrade to something more modern, and more useful. $customer is an old friend of my boss, and they happened to be the perfect testcase for a newer version of this software. We sort of supplied it as a gift, and only required them to test it and use it properly, and to provide feedback on things that don't work that well yet. They've been great in all those aspects. $customer is basically almost a unicorn.  \n\nThe first major update came a couple of weeks after the initial release, with me pushing the update over a holiday weekend. I had a long weekend planned, and almost forgot to push the update before the work week started. Cue me thinking *Well, I have to push the update, you know what, I'll do that right before I go to sleep*.  \n\nThat was my first mistake. The second mistake was to continue playing games instead of pushing the update first. You know when there's that tiny little voice internally saying *Maybe I should take responsibility, meh, how bad could it be*? And then you ignore it? Well, basically around 11pm I hopped onto the VPN, pulled my newest changes, thinking it would be just a quick update. It turned out to be two hours of debugging, adding some more code, and then having to push the update. Of course I tested the changes first, all good. And then, without noticing, made the mistake of copying the \"same\" files to the production server. I put the word \"same\" between quotation marks, because I pushed all the files instead of just the changed files. That's a mistake I came to notice the next morning.\n\n**Tuesday morning, while dreaming of sleeping for hours on my day off**  \n*Phone rings, and it's the phone number from work. 8:32am, well fsck*  \n**&gt;sup:**Hey $me, $customercontact just called that they can't login, can you check what's up?\n\nI've never had a coffee that good. I only slept for 5 hours, and I was wide awake and extremely focused within two minutes. Felt for a few moments like I slept for twelve hours and had a whole can of coffee. I also seemed like the first person here to think that logins not working is probably a bad thing.  \n\nHopped on the VPN, check the server logs, and there's nothing strange there. Check the customer site, and noticed that there \"is no table called users\". Now remember how I said I pushed all the files? I didn't clean my publish directory at my own pc, and since I wanted to do the update quickly, I didn't double check the files I was going to push. It included all the correct files, **aaaaaaaaand** an empty database.  \n\nThinking internally: *well, this is very bad, but I'm glad it is a long weekend and we have daily backups*. So I called $sup to give him an update on the situation.\n\n&gt;**$me:** Soooo, about that error they got.. I accidentally overwrote the database with an empty one. Luckily we have the daily backups, so I can just restore the one from last night, can you send me the most recent one?\n&gt;**$sup**: Sure, you'll receive it within a few minutes\n\nTime to drink a cup of coffee and call $customercontact to bring them up to speed about what's up.  \n*Side note: I've messed up once or twice in a previous job, not as bad as this, but I never had direct contact with customers. This story opened my eyes as to how well I've learned to handle critical, high stress situations like this one*\n\n&gt;**$me**: Hello, this is $me from $company. I'm calling to give you an update on the situation\n&gt;**$customercontact:** Oh, is it bad, did we mess something up? (*They're not that familiar with tech and computers, so instead of blaming us, they expect themselves being at fault, before blaming anyone/anything else. They shouldn't be so humble, because they've found bugs that we weren't able to spot during testing, even though it should be quite obvious*)\n&gt;**$me:** No, I'm the one who messed up during the update. I broke a few things, so right now we're restoring a backup from last weekend, so nothing should've changed for you. I'll update you as soon as possible\n\nAfter that call, I did get the backup archive from the night before. I know the rule that you don't have backups until you actually tested the backups you create, boy do I wish I knew that rule at that moment. We didn't have backups from THAT version, only from our internal test version, a very old one, in a docker container we no longer used. The backups from the days before were all exactly the same.  \n\nI called back $sup to explain the situation, and how I basically messed up pretty hard. I got the phone number from $sysadmin. Luckily he was awake, even though it was also his day off, and it was only 9:30 by then. He was able to initiate a VM restore (we also make full backups of those, and they were tested before we went live, thank god) from the night before.\n\nThis would take at least an hour to run, and I was able to give the customer an ETA for the uptime. I called them and notified them that we expected to be online at 11:00, 2.5 hours after we noticed the downtime. I also admitted we made mistakes and that policies would be set up to avoid situations like this. While waiting for the VM restore, I started working out the steps of what exactly went wrong, and how to fix those things, and prevent future situations like this. Not a form of CYA (well, maybe sort of, because I wrote down the facts of what I did wrong, and how we could prevent it), but there's no point in making a bad mistake and then NOT learning from it. Not wanting to learn makes those things pointless to me.\n\nAnyway, after the VM restore we still had issues with the config. I had to make more calls (I hate making calls actually) to $customercontact to update the ETA with a \"I'm not sure when but hopefully very soon\", and call $sysadmin again to notify him of the issues.\n\n*This part might be anti-climactic, or maybe it is climactic because usually those things end with the tech being blamed for everything, possible people being fired or at least getting a formal warning*  \n\nAfter the VM issues were fixed, I had already cleaned up my project, revised my publish scripts. I also documented which things went wrong, where miscommunication happened, how we could've prevented the whole mess. One big part is that I decided to push updated during daytime in the weekends. Being very tired and pushing an important update doesn't go together.\n\nWe managed to sort the whole situation out before lunchtime, without any data loss. The customer had half a day of downtime, but instead of calling us all morning to put blame on us, they temporarily reverted back to their old word forms, and then put all the information in the system afterwards. (remember how I said this was a unicorn?)  \n\nNow what I'm most proud of, is that I was able to keep everyone updated during the situation. The customer knew that we messed up, that is was bad, but I was able to communicate that, without giving them details about the situation. They knew the blame was on us, and they appreciated we took the blame, and that we jumped onto it so quickly. It was the first time that I've seen a customer respond in a way that says **Well, tech people are also just people, they make mistakes**.\n\nBesides that, this mess gave insight into gaps in my own work process. By documenting that, things become better for everyone. So the moral of the story I guess, is that even if you make a very bad mistake (probably just not in tech) you're usually better off admitting it, and taking the heat. Worst case you might get blamed and fired, but at that point you should also wonder if you're working at the right employer, at least if it's a genuine mistake.\n\nBecause the story is so long, here's a TL;DR; for y'all:  \nI'll quickly push the update, half asleep, what could go wrong?.. Well, just about everything\n",
        "created_utc": 1511518895,
        "upvote_ratio": ""
    },
    {
        "title": "Adware doesn't work on Linux!",
        "author": "AB6Daf",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f639y/adware_doesnt_work_on_linux/",
        "text": "[removed]",
        "created_utc": 1511511383,
        "upvote_ratio": ""
    },
    {
        "title": "I can't click anything!",
        "author": "AcridBrimistic",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f5q91/i_cant_click_anything/",
        "text": "[removed]",
        "created_utc": 1511506577,
        "upvote_ratio": ""
    },
    {
        "title": "WAN Upgrade Hell",
        "author": "basil_forty",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f5mbj/wan_upgrade_hell/",
        "text": "   Mid size facility ~1400 users. Upgrading to MPLS from DS3 on redundant WAN links. CentLink side goes as planned. Circuit is up and fully functional. ATT side next. Contractor shows up before my swing shift and runs the fiber connect from Telco room to server room. Leaves the server room side disconnected. \n\nOk good, get WAN team on the line and prep for failover to CentLink to make the connection. Check logical link, on fiber. No joy.\n\nDouble you tee eff. Ok start at layer one. Test fiber from server side to patch panel. Looks ok. Go to Telco room to check second patch, can't get fiber connection out of the patch panel to test. Take a closer look at the connector, it was monkey fisted in place. Have to take out pliers to release fiber. It's boned, ceramic is cracked. Mumble discontent, curse the contractor, and go get another patch cable. \n\nOk new cable in place, contact WAN again even though no logical link light. Ask them to cycle the port. Still no joy. \n\nGo back to Telco and trace back to dmark. Pull SFP out and check type, have to Google model number because it's not Cisco and of course unintelligible. It's a single mode sfp. The contractor installed multimode cable. What a muppet.\n\nContact WAN and explain that I do not have single mode running to server room, they will get back to me. \n\nBoss is breathing down my neck asking what went wrong. Try to explain, he just says get it fixed. Sure.\n\nWAN msgs me 30 mins later that ATT wont send us a multimode sfp and is demanding that we reorder a new circuit that could take 90 days. Further they tell WAN that a multimode SFP won't work. Am I taking crazy pills? Is that not what SFPs were designed for?\n\nI can't even take this to my boss, and want to forgo the 30 min armchair session about prior planning. So shut up and color. Fine. Come up with a solution to fix issue but it may take till next week (currently Thursday). Boss is not happy, but no arm chair session because it's better than a 90 day wait.\n\nThe solution is that I pull some favors with local cable monkeys and they Run me 24 beautiful strands of single mode connecting Telco to server room the next day! ty for the hookup guys! \n\nGet WAN back on the line and have them cycle the port again. Logical link is good! Hell yeah. Fixed before the weekend! WAN gets ATT on the line to activate the circuit and the crowd goes silent. They tell us we missed our activation window and have to wait till Monday. \n\nTL;DR\nATT contractor screwed me twice and ATT corporate  joined in to kick me while I was down.\n\nEdit: meant ATT I would not send us a multimode SFP not single.\n\n",
        "created_utc": 1511505175,
        "upvote_ratio": ""
    },
    {
        "title": "Issues calling one number? Alright, what is the number? No, that’s the customer’s number.",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f4y5v/issues_calling_one_number_alright_what_is_the/",
        "text": "For those who have not read my stories before, I work as a tier 2 mentor agent for an ISP. An agent called me today to escalate a customer’s issue. Essentially, the customer could not call her son in another country off of her home phone. Here’s how that conversation went. I’ll be D, agent will be A. \n\n\nD: Tier 2, this is /u/devdevo1919. \n\n\nA; Hi, this is A. I have a customer who can’t call their son. \n\n\nD: what’s the customer’s phone number?\n\n\nA: ###-###-####\n\n\nD: Alright. Is this *customer*’s number?\n\n\nA: Yes. \n\n\nD: Alright. What’s the number having the issue?\n\n\nA: *provides same number above*\n\n\nD: Oh, no. I mean the number she’s trying to call. \n\n\nA: *provides same number again*\n\n\nD: *facedesk* A, I need her son’s number to escalate. \n\n\nA: I didn’t ask for that number. I’ll be back. *places me on hold*\n\n\nD: *screaming internal profanities*\n\n\nA: Okay, it’s *son’s number*.\n\n\nD: Thanks. I’ll escalate. Anything else?\n\n\nA: No. \n\n\nD: Have a good day. *click*\n\n\nLike seriously? How much more clear did I need to be? ",
        "created_utc": 1511497292,
        "upvote_ratio": ""
    },
    {
        "title": "Why are you using the copier??",
        "author": "genkers",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f3b73/why_are_you_using_the_copier/",
        "text": "FTP, LTL\n\nBackground: so I work tech support for a community collegee. Our office is located in one of the building where most of the English, science, and government classes take place. In the middle of the building is an open computer lab that are manned by student workers who can answer minor technical question, like how to change passwords etc. Every so often one of us in tech support upstair have to go down and work the lab bc of gaps in coverage bc of student workers class schedule or someone is sick. So this story is from when I had to cover the lab. User= $U, me=$M.\n\n$U:. Ah yeah I'm trying to use your copy machine to copy this paper but your machine is down. \n(Machine is out of ink, it's from a third party machine and their vendor suppose to keep track of supplies and replace when it's low, but they've been a week late so there's nothing I can do about it, other than offering alternative options)\n\n$M: (explain situation) if you really need an extra copy, you can use the scanner to scan the paper and print it out at print station.\n\n$U: no that's not acceptable at all. It's your job to make sure that these machines have whatever they need to work.\n\n$M: I'm sorry you feel this way, but this machine is a third party supplier and it's their job to keep it supplied up. And again like I already explained, you can scan the paper and print it at the station. It's the exact same thing as if you use the copier.\n\nThis argument goes on for a good five minute, with him getting angrier as it goes on. Eventually I had to call campus police to remove him because when I told him he needed to go because he was bothering other students he refused and start shoving the desk and computer keyboards and mouses. ",
        "created_utc": 1511478845,
        "upvote_ratio": ""
    },
    {
        "title": "NDR Storms and mailbox maintenance.",
        "author": "NBDad",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f38vw/ndr_storms_and_mailbox_maintenance/",
        "text": "Obligatory LTL.  Not my first post, but they don't happen often. (feel special you all!)\n\nAnyway...I work for a managed services provider.  Part of my job is to reclaim the whitespace on our Exchange Databases for our aging infrastructure...I came across an absolute beauty of an issue today, and thought I would share.\n\nI have ONE user left on my mailstore of the moment, and no matter how high I set the -baditemlimit on the move request, it just won't move.  This dude is holding my schedule up, which annoys me.  I don't like being annoyed.\n\nNow, his mailbox is big.  Not the largest we have by any stretch, but still a really really decent size. (We're talking close to 100GB territory here)\n\n&gt;-baditemlimt 2500  (*usually more than sufficient*)\n\nA day later I find out that nope.  Apparently it is not. *Hmmmmm*\n\nSo I try it again, this time increasing it a little :P\n\n&gt;-baditemlimit 10000.  \n\nNada...same issue...fails just north of that number.\n\nOk, sez I...he's got a huge honking mailbox, it's probably corrupted out the wazoo...\n\n&gt;-baditemlimit 100000.\n\n\nIt.  \nStill.  \nBloody.  \nFAILS.  \n\n\nFinally, I open buddy's mailbox in OWA, which takes forever (cuz near on 100GB!).  I note he has his Out of Office enabled. (Cue sinking feeling)\n\nScroll (wait for it to load).  Scroll. (wait for it to load).\n\nAnd then I see it...page after page after page of \"undeliverable\" responses.  It seems, that this guy had sent some sort of email to this one particular recipient, and for whatever reason, it NDR'd. \n\nNow normally no biggie since Out Of Office is set to only send a single response to each unique sender...So Out of Office does it's thing, and duly informs this place that he's not available...BUT since the postmaster address that is being used by the recipient isn't a valid email address (BAD mail admin...*insert beatings*)...it sends ANOTHER NDR..which kicks off ANOTHER Out of Office...\n\nRinse and repeat.\nOver **FIVE**. **MILLION**. times.\n\nIt seems that eventually the other side caught on and stopped things on their end...but noone noticed on ours, because the user never complained. (*since ya know, he's NOT in the office anymore*).\n\nSearch-Mailbox basically throws up on itself...it's not designed to handle the sheer numbers involved. \n\nAfter much cursing, I managed to get Outlook to load his profile, and convinced it to begin process a rule to delete these items.  At least it's a holiday weekend.\n\nTL/DR:  User with OOO enabled notifies recipient he's not in the office, and resulting NDR pissing match because the recipient's system doesn't adhere to RFC5321 generates 5 million messages.  Follow your RFC's kiddies.",
        "created_utc": 1511478121,
        "upvote_ratio": ""
    },
    {
        "title": "When Printers Fly",
        "author": "UncommonNormal",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f31q7/when_printers_fly/",
        "text": "Hello there TFTS, I have a quick story from hospital IT support that I finally remembered to share. This tales happened towards the middle of 2017.\n\n\nNow for clarity we have three types of printers in the various hospital locations we support. The first kind are the multifunction printers that you log in to with your ID badge or PIN, they are great big floor standing units that scan to email, copy and print in high volumes. The second type of printers are high use desk printers, they have multiple paper trays and are connected to the network. The third kind of printers are small low volume printers connected via USB.\n\n\nThis tale concerns the second type of printer, a high volume network printer.\n\n\nIt was another hard day taking calls on the IT Help Desk, resetting passwords and calming down irate doctors (I know you are very smart, but just this once you may have made a mistake with your password). Then a call comes in from $Nurse on one of the wards regarding a printer that is not working.\n\n&amp;nbsp;\n\n&gt; $Me: Hello IT Help Desk, how can I help.\n\n&amp;nbsp;\n\n&gt; $Nurse: Hi, we are having issues with our printer today. Some print jobs are not being printed. Also the printer keeps going offline on the PC.\n\n&amp;nbsp;\n\nSo like the good like desk monkey I am I remote access one of the PCs connected to the printer and begin troubleshooting. Looks all good on the PC, printer is showing online and no jobs stuck in the queue. Then I access the printer via IP address and all showing good there too. Then I access a separate printer queue for $MEDICALSYSTEM *(Yay for ancient out of date patient record software)* and it all looks good to me. I even print a test page successfully. It appears that the printer just keeps loosing network connection. So now comes the fun part.....\n\n&amp;nbsp;\n\n&gt; Me: The printer queues all look good from what I can see. Can you make sure the network cable is plugged in properly, both to the printer and the wall?\n\n&amp;nbsp;\n\n&gt; $Nurse: Ok, the cable looks like it is loose in the printer. It is missing the retaining clip.\n\n&amp;nbsp;\n\n&gt; $Me: Ok, not a problem that happens a lot. I will log a call for the on site team to replace the network cable so it doesn't keep falling out.\n\n&amp;nbsp;\n\nA simple problem and a simple solution right? Well I shouldn't have been so hasty in thinking that, because then she drops this beautifully timed bombshell on me.\n\n&amp;nbsp;\n\n&gt; $Nurse: Do you think it could of had anything to do with the patient throwing the printer across the ward yesterday?\n\n&amp;nbsp;\n\n&gt; $Me: Um, wait, what? Did you say that a patient threw the printer across the ward?\n\n&amp;nbsp;\n\n&gt; $Nurse: Yes, one of our patients had a bad argumet with another patient and threw the printer at him. Do you think that could be what caused these issues?\n\n&amp;nbsp;\n\n&gt; $Me: Yes, I think that will definitely be the issue. I am going to send a tech out today to repair the printer and replace it if needed.\n\n&amp;nbsp;\n\n&gt; $Nurse: Thanks, that will be great.\n\nNow I would like to think that I have heard a lot of things since working IT at the hospital, but this really took me by surprise. it wasn't just one thing about this surprised me, but many things.\n\n\n*First*: The nurse was so calm when explaining the whole situation and event to me. I have a great deal of respect for the health workers that we support, especialy in situations like this.\n\n\n*Second*: That printer is about 35 inches tall, weighs 200lbs without paper and was thrown a good 10 to 15 feet with a lot of force. That patient must have been seriously angry. *Also to clarify he missed the patient he was aiming the printer at and hit the side of a hospital bed, a side table and then the floor. No one was physically injured.*\n\n\n*Third*: The printer actually survived!!! The on site technician went down, tested it and found it to be in perfect working order. All the damage was cosmetic, the only part to replace was the network cable as it was wrent from the printer when thrown. The rollers and fuser unit all undamaged, even the toner stayed in its cartridge.\n\n&amp;nbsp;\n\n**TLDR: You will never be expecting the unexpected.**",
        "created_utc": 1511476001,
        "upvote_ratio": ""
    },
    {
        "title": "It took my money again!",
        "author": "kamikageyami",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f2x8o/it_took_my_money_again/",
        "text": "Yo TFTS! FTP,LTL forgive formatting I'm on mobile yaddayaddayadda  \n\nPlayers:  \n*$M = My mother. A lovely, caring, and intelligent person, but clueless when it comes to technology.  \n$me = ;)*  \n\nSetting: Her living room, yesterday ~10pm  \n*$M is chilling out on her phone*  \n$M: \"Oh, what the hell? It charged me again?!\"  \n$me: \"What did?\"  \n$M: \"The *$audiobookapp* thing! I cancelled my subscription like 2 months ago but it keeps charging me!\"  \n$me: \"That's weird, are you sure you cancelled?\"  \n$M: \"Yes, definitely!\"  \n$me: \"Hmm, strange. It might be some error in their system. You should send them an email before they charge you again.\"  \n$M: \"ugh, that's so annoying. I *know* I took it off my phone..\"  \n...  \n......  \n..........  \n$me: \"...I think I know why it's still charging you.\"  \n  \nAfter a quick confirmation of my suspicions by having her log into her account on my PC, and a not-so-quick explanation of how uninstalling an app on your phone doesn't cancel an online subscription service, she was happy to be free of the monthly 8€ annoyance :)",
        "created_utc": 1511474736,
        "upvote_ratio": ""
    },
    {
        "title": "That's ok, I'm in the test system....uh oh.",
        "author": "big_j_400",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f28ws/thats_ok_im_in_the_test_systemuh_oh/",
        "text": "Used to work as a code cutter at a service provider organisation that provided telephony solutions.  We provided voice mail, some fax services and a pre-paid mobile application.  Connected via terminal emulators on our PCs that could access development, test and production hosts.\n\n\nDuring the investigation of a fault, i ran a query on the test system (which is refreshed frequently with a subset of production information and where databases are named the same) to find all the customers who fit a set of criteria across multiple tables in the database.   Not an efficient query, but it's ok because it is only in the test environment.  \n\n\nNext thing, performance alerts are going off and administrators are scrambling because the production system has suddenly ground to a halt.  I get that horrible sinking feeling that you get.\n\n\nCheck the host name at the top of the screen - yep, I am actually in the production host running a massively inefficient query.  I kill the query and a few seconds later the alarms stop and everyone is sitting around looking at each other like \"what just happened here?\"\n\n\nI fessed up, and was awarded the \"Mickey Mouse Ears\" that one had to wear around the office as the performer of the most recent act of technical idiocy.",
        "created_utc": 1511468246,
        "upvote_ratio": ""
    },
    {
        "title": "I screwed up and it was a doozy",
        "author": "ISeeNothingKNT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f1vkp/i_screwed_up_and_it_was_a_doozy/",
        "text": "A bit of pretext, I work for an IT company that sells services to any company that will pay some of the services we supply are backup, dynamic DR and hostpoint. We've just had a company sign for a backup service and I was in charge of setting it up.\n\nAs we only set it up before shipping it to the customer I have it set up in our small build room assigning it with the IPs the kit will have when at our customers site and just a small Netgear dumb switch in the middle and my laptop also connected set with a static IP on the range.\n\nAs it's just a small dumb switch  in the middle when I had to connect 2 of the servers on different IP ranges I just switched the IP address temporarily. I choose an IP close to the range the customer supplied to us just for ease of memory. I then went to connect the servers togther but there's no connectivity between the 2.\n\nI try pining from the TS server I've set up, no connectivity but I can ping it from my laptop which I found weird. I then proceed to troubleshoot the issue for about 2 hours but I give up and call our networking guy and as explaining the issue to him I realised how I fucked up.\n\nAnyone guessed it yet?\nYes, you got it right, I assinged my laptop and this server the same IP address, I can't even say it was a long day as it was the start of a long day. \n\nApologies for spelling and formatting, writing on my phone at the end of said long day.\n",
        "created_utc": 1511464862,
        "upvote_ratio": ""
    },
    {
        "title": "Can't open the link in Chrome!",
        "author": "sunlovecats",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f0wxa/cant_open_the_link_in_chrome/",
        "text": "This literally just happened. Here's a little background first:\n\n\nI work as a supervisor and even though we have an actual IT guy working in the company, my team members always come to me first about any technical problems and of course I try to solve them as much as I can first before bothering our IT guy. Today was one of those requests as well.\n\n\nOne of my team members is a sweet older lady who is very nice but a bit slow and has a bit of a hard time with technology. For the last three days she has been asking me to help her open the link for the new training material we are required to complete. I have been doing it for her so far but today I decided she needs to learn on her own and told her to copy the link from the email she received and paste into chrome search bar. Should be easy right? Well apparently not, as she comes back two minutes later saying she doesn't know where to paste the link. Now I want her to learn this so I go to her desk and show her how to do it. When I put the link into chrome search bar she says that can't be right as Chrome is only meant for our own database look ups. So of course I ask her what does she mean to which she explains to me that she only uses Chrome to pull up our company internal database and that's the only function the Chrome has. She basically thought Chrome is our own internal creation and we only use it for company purposes. This was definitely a huge facepalm moment for me. I'm still not sure that after I explained to her that Chrome and IE are browsers for internet that she understood that fully. People never seize to amaze me\n\nTL;DR: older team member thought that Crome is our company;s internal database and cannot be used to open any other website",
        "created_utc": 1511456326,
        "upvote_ratio": ""
    },
    {
        "title": "The coffee cup holder",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f0bz1/the_coffee_cup_holder/",
        "text": "[deleted]",
        "created_utc": 1511450994,
        "upvote_ratio": ""
    },
    {
        "title": "The Scanning Proccess",
        "author": "give_me_bewbz",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7f012l/the_scanning_proccess/",
        "text": "A while back, one of our managers approached me asking for a scanner for our storespeople. OK, I'll get a quote for one. Due to supplier issues, it took about 6 weeks for us to get a quote from the only supplier we're allowed to use.\n\nOnce I get the quote to the manager, it sits for another month with him. My job has been done until the device arrives!\n\nA month later I am approached by one of the storespeople chasing this up - the manager hasn't arranged delivery yet and of course it's my fault. Curious about *why* they need a scanner, I come down and see what they need it for. \n\nApparently, it's because sometimes they fill out forms that need to be taken to the purchasing department about 100ft away. Behold the process:\n\n* Purchasing sends form to Stores via email as a Word document\n\n* Stores people print off email\n\n* Stores people fill in the form\n\n* Stores people then walk to purchasing with the form\n\n*  Purchasing scan in form using their photocopier\n\nOur genius team wanted to cut out time and save the process by **scanning in the form themselves**. Note how this only saves them a 30 second walk. Note that at no point is a signature required, or anything that means they *have* to print the damn things out\n\nAlways one for efficiency - I suggest that they simply fill in the Word document on their computers, and save time, paper, money, and ink. They don't need any paper, no printing, no walking, no scanning. \nHe does **not** like that suggestion. Starts insisting they need the scanner. I say ok, and go back to my desk, having a word with my supervisor about this. He proceeds to call up the storesperson, and enquire about their needs.\n\nNow, I'm not the most confrontational of people, and so my supervisor came across somewhat mroe forecfully than I did. \"Why can't you just fill it in on your computers? Faster, easier, cheaper...\"\n\n**\"I'm not an administrator. It's not my job to type things out like that.**\n\n\nHe... he's filling it in anyway! BY HAND!\n\nAAAARGH\n\nAnywaaaay, another week passes, the manager comes up and gets really angry, insisting they need the scanner to do their jobs, we're obstructing them and slowing down vital processes. I point out it's his job to arrange for the purchasing of the device, I just handle the set up. \n\n.\n\n.\n\nThey now have a scanner in stores. ",
        "created_utc": 1511447973,
        "upvote_ratio": ""
    },
    {
        "title": "Man demands wireless USB keyboard and mouse.",
        "author": "prorat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ezn5m/man_demands_wireless_usb_keyboard_and_mouse/",
        "text": "As I started doing my internship. I am working for a company that sells school supplies in bulk to stationary and private schools, stuff that range from books, paper, and whiteboards to more technical stuff like touch-boards, projectors, and computers, it's mostly monotonous and it's simply maintaining things or making them more stupid proof for the the office workers. Every now and then we have to vacuum the inside of couple dozen PCs after everyone has left and then do nice desk cable management.\n\nThis started about 2 weeks ago. Head of IT tells me to check up on this dude that his mouse and keyboard isn't working both of us figure that me or my mate probably forgot to put his mouse and keyboard back after we finished cleaning the PC from dust. No biggie. I head down the stairs into the office rooms I see man standing and drinking from his mug looking towards the stairs doors while everyone is busy working, I assume it's him, let's call him Adam. So I head up to Adam and it turns up it's him, I great him and go under the desk and turn out our assumptions were correct. I hear him go off meanwhile, \"I can't work like this if this keeps happening\", and I thought \"Is this it? Is this going to be a problem?\", in my mind.\n\nSo I just connect the keyboard and mouse, and turns out the Ethernet cable was also not connected. \n\n\"Now everything should be working fine.\"\n\nThen he says, \"I need a new mouse and keyboard, I can't have it stop working in the middle of a sale or something.\"\n\nMe: \"It wouldn't, we just forgot to put the USB back after we took the computer to clean the dusk, sir.\"\n\nAdam: \"... Wha... Why wasn't it connected then? Isn't that your job?\"\n\nMe: \"Not just my job, but you are right, it happens, we are sorry.\"\n\nAdam: \"Well then, I want to replace my keyboard and mouse with a wireless one. So this doesn't happen...\"\n\nWe don't have wireless keyboard and mouse just laying around so I was perplex, so my smile got bigger at this mans silliness.\n\nMe: \"I understand but we don't have any wireless accessories laying around. Do you want to buy one? I can install it.\"\n\nAdam: \"No, I am not going to buy it, it's IT departments job to resource it for employees.\"\n\nIt's not, but I didn't know that. \n\nMe: \"Okay, I will go open a ticket for you in the system and get it sorted out.\"\n\nI just believed him and went back to my office to discuss what happened with my manager.\n\nMy manager cringed and told me that he is full of BS. And told me he does stuff like that with other people. And he talked behind Adam's back, which is irrelevant to the subject matter and inappropriate to share anyway.\n\nThe problem got out of my hand and went towards the higher ups. Thank goodness. I am not involved and don't have to deal with it.\n\nA week or so passed, and turns out he bought his own wireless keyboard and mouse and he also knows how to connect USB cables to their ports. Amazing.",
        "created_utc": 1511443807,
        "upvote_ratio": ""
    },
    {
        "title": "the site is logging me out immediately after logging in.",
        "author": "LibraryAtNight",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7eyeyn/the_site_is_logging_me_out_immediately_after/",
        "text": "from when I did phone support for a hosting provider a few years back.\n\n$me: Thanks for calling $SupportCO etc\n\n$woman: Every time I log into the site I am logged out immediately. My husband needs me to make a change immediately and your site's broken.\n\n$me: I hope not, I haven't had an issue and we haven't had any other calls, let's troubleshoot a bit. What happens when you log in?\n\n$woman: It accepts my password and after redirecting me to my account page it logs me back out and sends me to the front page.\n\n$me: Ok, sounds like possibly a browser issue, let's try some stuff\n\nWe check cookies settings etc, try some other browsers, nothing is working she says the same thing every time.\n\n$me: wow this is just bizarre, can you humor me and just log in one more time and just tell me each thing you're doing no matter how small or mundane the point seems.\n\n$woman: *long sigh* yes. I visit your site. I click login. I enter my user name. I enter my password. I click login.  It logs me in. I click \"My Account.\" It says \"Hi Tim, if you're not Tim, click here\" I \"click here.\"\n\n$me: Wait don't click that, that's what is logging you out,  that's for if you somehow found yourself in the wrong account...\n\n$woman: I'm not Tim\n\n$me: No, but your husband is; he set this up.\n\n$woman: Oh my god. Oh my god. I'm so sorry. *Click*",
        "created_utc": 1511428102,
        "upvote_ratio": ""
    },
    {
        "title": "Value Subtracted Reseller",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ey3ia/value_subtracted_reseller/",
        "text": "\n  \nMy first consulting job was at a small firm. Ever so often, the owner would identify a direction he wanted to go in to grow the business. He'd get excited with the prospect and start planning things out. If you wanted to remain on his good side, you'd play along until a new shiny thing came along.   \n  \nI got a fair amount of pressure to sell the new service at client meetings, even when the details weren't all in place.   \n \n  \nDisaster Recovery was our first new offering. We had space in a newly built and mostly empty datacenter in our city. The company that built it merged with a competitor several weeks before it was completed and after some consolidation, decided they didn't need those 20,000 square feet. They spun it off into a co-lo while looking for a buyer.  My boss decided that we needed to find something to do with it. There are probably two million people in the ‘donut hole’ and the location was in a major city, you could arrange housing, office space and transportation easily.  \n   \n  \nSo we were going to sell DR services in addition to anything else that might bring in money.   \n\n  \nOf course, what those DR services were and what they’d cost hadn’t really been thought out.    \n\n \nThat week, I had an intro to a potential consulting client, Rust-Belt &amp; No-Where Credit Union (RBCU).   \n  \n  \nRBCU came to us by Alice, a backslapping politician recently removed from her legislative seat. She knew lots of people and was in the same favor-bank as my boss.  \n   \n  \nWe drove up together to RBCU, about an hour and a half away from my city.  \n  \n  \nWe met with the leadership at RBCU:  \n  \n* Patrick, the bearded President of RBCU. Patrick could have made side money as a mall Santa, if the town RBCU still had one.  \n\n* Nancy, RBCU’s Head of IT.  \n\n* Vincent, RBCU’s very defensive compliance chief.    \n\n\n  \nAlice introduced me and we talked generally about RBCU and their needs. I tried asking about compliance issues and found absolutely no interest there, no siree Bob. No need there. Compliance Panthers roamed the halls, ensuring unwaivering compliance. I talked about pentesting and Nancy claimed that ‘the only systems we buy are the secure ones’.  \n  \n  \nI’m beginning to think that the time is a favor between Patrick and Alice which won’t result in any sale.  I gamely ask about disaster recovery.     \n\n  \nNancy instantly looks tired. Vincent shoots me a look. I start my pitch:   \n \n  \nme:”Disaster recovery doesn’t have to be hard. There are a bunch of options that we can work out.”   \n \n  \nNancy:”Replicating all of our infrastructure is beyond our means”   \n \n  \nme:”Hot backup allows instantaneous cutover, but it is expensive. Do you need to do that?  \n   \n  \nPatrick leans in:”Well, we need to be available to our members”  \n  \n  \nNancy:”Absolutely”    \n  \nme:”I’m going to guess that some downtime would be acceptable if we could reduce costs. How about we replicate enough of your environment in virtual machines on our systems. You’d be able to bring them up remotely, and, (for emphasis), and… you’d use the databases you backed up there. You’d be able to come back up in a few hours.”  \n  \n     \n\nI figured nothing was going to get them interested. Now that they are, I’d like to sell them some AppleCare and undercoating.  \n   \n  \nWe talk around vagaries of how we’d do this and what their options were. I, of course, don’t want to get pinned down since I don’t know what we can offer yet.  \n   \n  \nI ask that we schedule a follow up call where we can get into the details with the technical people. Smiles and handshakes happen.  \n  \n  \nI start sketching out options on the drive home. We could offer space, power and network for their boxes for one price, saved VMs on a virtual cluster for more and live private systems for even more.  \n  \n  \nI report back. My boss is infatuated with the idea. Perhaps we should figure out what other disaster related services we could offer.   \n  \nI have several conversations with Nancy. We start with her existing DR plan and we figure out she paid another consultant to download a bunch of SANS templates without any customization.  \n  \n We come up with everything they need: cutover plans, work out how to replicate their physical servers into remote VMs, We develop scripts to backup their databases and make them available the VMs  I draft a set of procedures so they can bring everything up with one person.   \n  \nWhile I do all this, my boss is working out marketing material and pricing. We haven’t come up with the infrastructure we’ll need to support  RBCU and I’m getting nervous. I want to make a sale, if only to keep my boss happy.   \n  \nIn order to keep RBCU and Nancy happy while we figure out what we’re going to do, I keep contacting them and offering a bit more prep work while we talk about ‘working out the final details on pricing and contracts’.  By now I’ve run out of things to work out for them- they’ve got a DR plan, procedure, scripts, schematics all in a nice binder, awaiting pricing and a logo.\n  \nVincent calls me and wants to talk about licensing. They don’t want to purchase additional licenses for the software that takes care of all the accounting. They want to know if we’ll supply those licenses as a part of the service cost. I know my boss isn’t going to spring for licenses when we’re talking about using some 1U SuperMicros we found next to the dumpster at the datacenter.     \n  \nI’m going to have to be a bit more creative. I’m going to consider the VMs the property of RBCU, thus we’d reuse their licenses. Vince doesn’t like my explanation that we’re only using one set of licenses for production work at one time. Fine. I talk Vincent into contacting the software publisher with me to get this approved.  \n   \nYep, that turned out to be a bad move, sales-wise.  \n  \nWe call Dale, the sales rep for SoftCO, your banking software solution. Dale’s as friendly and good natured as a LDS missionary with some good quality MDMA.   \n  \nWe explain our proposed use of SoftCO’s licenses.   \n  \nDale:”Of course, we can work something out. We usually do this as long as the licenses aren’t reused on a regular basis. I hear some typing on Dale’s end.  \n  \nDale:”Uhh, how many additional licenses will you need?”  \n   \nme:”I’m thinking we’ll need 4. Per your manual, the databases are licensed separately from the banking software”  \n  \nDale:”Well, that’s partially correct. Is that what you’re running now?   \n  \nVincent:”Uhhh...”  \n  \nme:”Per my notes, yes”  \n  \nDale:”We have a problem. RBCU only has two licenses. How long have you been using them?  \n  \nme:”I think Vincent would be the person to talk to that”  \n  \nVincent and Dale agree to talk later and I bow out of the conversation.   \n  \nI walk over to my boss’ office. I want to tell him before RBCU calls to complain.  \n  \nBoss:”Well, I’m not interested in offering DR. I want to offer managed services including DR.  \n  \nme:”Well, I know one place that might want better license management right now, but I’m pretty sure they won’t let me in the building”  \n  \nI realized that I wasted more than 40 hours to put together everything RBCU needed for DR, for free and still managed to blow the sale.  \n  \nThankfully, my boss found something new to get interested in. That datacenter is now offering DR services. I can only hope that they’re offering my paperwork as a guide to their clients.   \n  \n\n  \n\n   \n\n",
        "created_utc": 1511423771,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's your fault!\"",
        "author": "Aumann-",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ewuwh/its_your_fault/",
        "text": "First time poster, long time lurker, etc.\n\ntl;dr: Web filter wasn't working, now it is. $User blames a BIOS update, and thus me, for not being able to get to a website. Decides childish fit is best option. \n\n\n**$Me** - Obvious\n\n**$User** - Problem\n\n**$NetworkAdmin** - Our poor Network Administrator\n\n\nMy office is composed of roughly 60 people, with 3 total IT. Most of my users are fine, or at least patient, when it comes to change, not $User. $User is against anything new, regularly has problems but doesn't want changes that could fix it if it is even slightly inconvenient, and is very outspoken. Not a good combo for my sanity.\n\nWe recently got a new web filtering tool put together by a remote office and then handed off to us, though with no training and only the vendor's documentation to work with. We sent out the standard \"Here is this new thing, let us know if it doesn't do x, y, or z.\" With the the addition that some of their normal websites may be blocked and to let us know. We had the normal questions (can I still do this? what about my music? can you see every site I go to?) but not much from $User. \n\nThen we find out the stupid thing isn't even working. No filtering whatsoever. So I take over and rebuild the thing and finally get it working. Computers just need a restart and the policy should work. At the same time, my manager hands me a list of other updates that need done to some select machines (BIOS update, no biggie) and $User happens to be on the list.\n\nI go down at EOD, do my update with the mention that it shouldn't cause any noticeable effect and be on my way.\n\n\n$User calls me today right after lunch extremely angry (far more than I've ever seen them) and guess who is public enemy #1.\n\n**$User**: After that update you did nothing is working and I cannot do my job at all now! It is all your fault!\n\n**$Me**: ...What exactly isn't working?\n\n**$User**: $NetworkAdmin is working on it and I'm too angry to talk right now, bye.\n\n\nI take a visit to $NetworkAdmin's office to see what is going on.\n\n\n**$Me**: So what is $User's problem now? \n\n**$NetworkAdmin**: $User says you did an update and now some of their sites won't load.\n\n**$Me**: Which sites?\n\n**$NetworkAdmin**: MapQuest\n\n**$Me**: People still use that?\n\n**$NetworkAdmin**: Seems so, and how dare you do your job and make $User get a policy update?! :) (I really do love our $NetworkAdmin sometimes)\n\n\nTurns out our filter identified MapQuest as a bad site and blocked it. The restart from the BIOS update caused the filtering policy to be pulled down, $User blamed my doing the BIOS update for it. Instead of being rational and asking why it suddenly wasn't working, $User decided a tantrum was best. I go down to $User's office to walk them through an alternative (Google Maps) and I get this exchange.\n\n\n**$User**: Why did you only update my machine?\n\n**$Me**: You were the only one who needed the update, and the update had nothing to do with your site being blocked. Please use this one instead while we check on it.\n\n**$User**: I'll just call IT to do my job from now on since you apparently don't want me going to anything.\n\n**$Me**: *sigh* It applies to the whole building you know.",
        "created_utc": 1511409269,
        "upvote_ratio": ""
    },
    {
        "title": "I Can't Hear You",
        "author": "CaptainKishi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7evt5r/i_cant_hear_you/",
        "text": "A short one, but one I will fondly remember.\n\n&gt;$User: Calls into the Service Desk.\n\n\n&gt;$Me: I pick up to give my usual greeting, but am met with a deafening roar on the other end, loud enough to make me jerk and rip my headset off.  Sounds like a few jet engines (Genuinely possible where I work).\n\n\n&gt;$User: Hello!? (Barely audible, but $user is clearly yelling)\n\n\n&gt;$Me: Hello, this is $me with the Service Desk, how can I help you?\n\n\n&gt;$User: What!?\n\n\n&gt;$Me: Hello?  I am $me with the Service Desk, what can I help you with today?\n\n\n&gt;$User: I can't hear you!  Are you there?\n\n\n*I internally sigh, why did you call me if it was that loud where you were?*\n\n\n&gt;$Me: It is very noisy on your end, could you possibly call from a quieter location?\n\n\n&gt;$User: No.\n\n\n*I pause for a short moment*\n\n\n&gt;$Me: Okay--\n\n\n&gt;$User: G** D*****, I can't hear you.\n\n\n*User proceeds to try and hang up in the loudest possible manner, but misses the receiver*\n\n\n&gt;$User: G** D*** A******, I can't hear him.\n\n\nIt was so unusual that I laughed it off, as I've found you have to be able to do in this line of work.",
        "created_utc": 1511398552,
        "upvote_ratio": ""
    },
    {
        "title": "What happens if i via,late intergalactic law?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7euxkb/what_happens_if_i_vialate_intergalactic_law/",
        "text": "[removed]",
        "created_utc": 1511390293,
        "upvote_ratio": ""
    },
    {
        "title": "Does he live inside the P.O. box, sir?",
        "author": "trekinist",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7etv1t/does_he_live_inside_the_po_box_sir/",
        "text": "Hello TFTS! Long time lurker, first time poster, etc.\n\nI work for $Bank, a large financial institution, on their internal tech support Help Desk. This means I only get calls from other $Bank employees. You would think this would be easier than getting calls from customers, but today proved this wrong.\n\n$Me: Thank you for calling $Bank Help Desk, how can I help you?\n\n$Client: I'm trying to change the address for a customer, but it won't let me change the residential address, just the mailing address.\n\n$Me: Okay, do you mind if I remote in and check it out?\n\n\nAt this point I'm thinking that there's an error in our teller system that I'll need to report. \n\n\n$Client: See, this is the address, P.O. box ###. It won't let me set this as the residential address.\n\n$Me: ... alright.\n\n\nAfter a quick call to branch support to confirm my suspicions:\n\n\n$Me: Sir, I've just spoken to branch support, and they have told me that the residential address cannot be a P.O. box, because the customer does not live there.",
        "created_utc": 1511381402,
        "upvote_ratio": ""
    },
    {
        "title": "The Goodi the Baddi and the Nauti",
        "author": "Selben",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7etstw/the_goodi_the_baddi_and_the_nauti/",
        "text": "**Do you like to read in Chronological order? Here is the [Index](https://www.reddit.com/r/Selben/comments/60r5ps/timeline_for_tfts_stories/)**\n\n&amp;nbsp;\n\n**$Selben:** Me! “Technical team lead” previously Tier II ~~helldesk~~ helpdesk technician for a mid-sized company, very skeleton-crew helpdesk 10 of us total for 24 hour coverage (not including supervisors) to support 2500+ company-wide.\n\n**$Snickers:** My cubicle mate, also “Technical team lead” previously Tier 2. (*Tier 2 was a more advanced tech, having more experience and system access etc…*)\n\n**$Peer:** Random Tier1 technician. (*Tier 1 worked base calls and sorted them to other groups, only basic troubleshooting*)\n\n**$Goodi:** Intern1, chosen for their extra efforts put in at school and showing an understanding of the basics.\n\n**$Baddi:** Intern2, still in college - got in due to a mistake.\n\n**$Nauti:** Intern3, have a hunch on how they made it through the interview…\n\n\n&amp;nbsp;\n\nMonday arrived, $Selben dredged into the office and stopped by his desk to drop off his bag… Three young strangers sat in his place, borrowed chairs from other desks. $Snickers had his headphones on and was opening and closing random documents - clearly avoiding any involvement, jerk. $Selben simple placed the bag on his desk and retreated for some coffee before dealing with this - after his return, all three now stood and cleared a way for him to sit.\n\n&amp;nbsp;\n\n&gt; $Selben: Morning…\n\n&gt; $Goodi: Morning sir! I am $Goodi, we were told to report to you!\n\n$Baddi looked bored and stared off ~~into the deepest depths of the infinite void that made up the very existence of time and space~~ at the wall.\n\n&gt; $Nauti: I told them we they shouldn’t sit in your chair, I’ll make sure it doesn’t happen again!\n\n$Goodi and $Nauti glared at each-other.\n\n&gt; $Selben: Okay… Well anyway - lets get you started on a project. Have any of your dealt with hardware repair or $Ticketsys?\n\n&gt; $Goodi: I’ve done some hardware repair… I’m not familiar with $Ticketsys…\n\n&gt; $Nauti: **I** built my own gaming rig, it was *over* $2000. At my *last* internship I worked on a system far better than $Ticketsys, so it should be easy for me to adapt and improve in this system.\n\n$Baddi’s wall staring intensified.\n\n$Selbens expression remained unimpressed.\n\n&amp;nbsp;\n\nThe group was assigned to different tasks based on how $Selben felt they might do well, $Goodi was assigned to help work on some hardware - contacting vendors with error codes, a bit of equipment had accumulated recently so it was an excellent task - with some simple corrections he was able to navigate their ticketing system and did well, documenting all calls and putting error codes in the tickets. \n\n$Baddi on the other hand would be assigned a task… Start it while someone was nearby… Then just stop and stare off into space, they would return after a couple hours to check up and would find nothing completed… $Selben decided to assign $Baddi to listen to the other techs calls and watch them work since he seemed to like watching others. This resulted in him telling one of the female technicians that her hair smelled nice and he ended up being moved to watch $Snickers work instead.\n\n$Nauti on the other hand with his being “familiar” with the ticketing system as well as a special type of handheld scanner (that $Selben knew only their company used) but $Nauti was an “Expert” with them. He was assigned to follow the configuration sheets for each scanner, then update the tickets and have the hardware group ship them out to the requested locations, there were roughly 50 of these scanners. \n\nEach of the interns were moved around and assigned different random IT work, with their default action to go to their originally assigned tasks. $Snickers would often have to go wandering around the office to find $Baddi, on more than one occasion he would be found sleeping in a conference room - finally after being warned several times that their internship would be terminated they started to make improvements. $Goodi made some mistakes but typically owned up to them offering to fix the issues whenever possible, he was almost offered to be brought on - but wanted to finish school before committing to anything, a bit of a shame because later when he graduated we did not have any positions available.\n\nAs for $Nauti… $Selben unfortunately had his hands full with the other two and his own job - so considering the fountain of knowledge $Nauti had claimed he did not followup as well as he should of. Checking with $Nauti, he was informed the project was completed - and he was moved onto a different task… However the final week of the internship $Selben became curious after running into the hardware tech in the break room, he had not received any of the scanners from $Nauti, so $Selben did some digging… He found all of the tickets had been manually voided… Not closed, not resolved, voided…\n\nIt was discovered $Nauti had no idea how to work tickets and had inadvertently voided out (*Still not 100% sure how he did this*) every ticket he came in contact with, as for the scanners they had all been hidden in the filing cabinets under $Nauti’s desk. When confronted with the scanners, $Nauti claimed the hardware tech had told him to do this and he was just following his instructions, when the hardware tech was brought in as well - he “wasn’t sure who told him” the following day $Nauti did not show up for his internship, we did not hear back from him again after that.",
        "created_utc": 1511380909,
        "upvote_ratio": ""
    },
    {
        "title": "Fun times with Win10 rollout",
        "author": "TFTS_Win10_Throwaway",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7etop6/fun_times_with_win10_rollout/",
        "text": "[removed]",
        "created_utc": 1511380014,
        "upvote_ratio": ""
    },
    {
        "title": "I work for an ISP/ Managed Service IT company. My CEO just sent this out.",
        "author": "throwkansasawat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7etnbg/i_work_for_an_isp_managed_service_it_company_my/",
        "text": "[removed]",
        "created_utc": 1511379697,
        "upvote_ratio": ""
    },
    {
        "title": "Yeah, he’s wound pretty tight.",
        "author": "Pucker_Factor_10",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7et9q1/yeah_hes_wound_pretty_tight/",
        "text": "We’ve started another refresh cycle to new hardware from a different manufacturer, so some people are already a little freaked out to see different looking laptops that dock in a different manner.\n\nWe have RES Workspace Manager, which pretty much works the way it should, but it’s not perfect. It does remember the location of desktop shortcuts, which seems to be a big thing for people. Partly because to most of the users, if the shortcut is missing, the application that it points to doesn’t exist. There’s no magical clicking of the Start button and searching for anything…\n\nWe have a build &amp; deploy team to build the laptop, install the user’s specific software beyond the core applications and install the new hardware at their desk. Desktop Support is responsible for issues post-deploy.\n\nJust the other day I took a call from CD = Challenged Dude:\n\nME: *Answers with the usual greeting*\n\nCD: They gave me a new laptop this morning and I just noticed that I’m missing an important application.\n\nME: I’m sorry to hear that, but don’t worry. I can absolutely install whatever you need to get you working again. What software are you missing?\n\nCD: I don’t know\n\nME: (???) Ok, what was the name of the shortcut or what did the icon look like?\n\nCD: I don’t know what the name was, but I think that it was blue with a black kind of target thing. I just know that it’s supposed to be right here next to this red and white one and it’s not.\n\nME: I’m afraid that description doesn’t ring a bell. What did the application do, what kind of work did you do in the software that the shortcut launched?\n\nCD: I’m not sure\n\nME: (???) We have a software report from the old laptops in order to install what is needed on the new laptops. If I emailed or printed out that report, would you be able to recognize the name of your missing application?\n\nCD: Probably not, because I have no idea what it was called.\n\nIt’s worth a shot, because the best person to know what their “important” application is would be the one who uses it. OF COURSE, because that would be the easy way, he didn’t recognize anything on the Altiris report.\n\nME: No worries, we’ll figure this out. Would any of your co-workers use this application also?\n\nCD: I’m not sure, I’ll check.\n\nHe returns and tells me that he checked with everybody on his team and a few of them have the shortcut. JoeGoodGuy is available if you want to talk to him…\n\nI go see JoeGoodGuy, see the shortcut and check the properties. He asks what’s going on and I just tell him that CD was concerned about the missing shortcut. Joe says, “yeah, he’s wound pretty tight.”\n\nNow having a clue about its origin, I talk to one of our developers and find that it's a homegrown, Intranet-based reporting tool of some kind to which none of them have access yet.\n\nWhen I told the dev that CD was freaking out because he didn't have the shortcut, he laughed and said that they've been playing it up as the thing that's going to save the world.\n\nEDIT: CD = Challenged Dude",
        "created_utc": 1511376741,
        "upvote_ratio": ""
    },
    {
        "title": "User loves to lie",
        "author": "Xostriyad",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7et4an/user_loves_to_lie/",
        "text": "Since lying users seems to be the flavor of the week, I figure I'd thrown in a good one I had years ago.\n\n$liar calls up, I hear someone in the background I'll call $chad for the purposes of this story.\n\n&gt; $me: Hello thanks for calling $outsourcedIt lets verify who you are.\n\n&gt; $liar: *produces proper verfication details and during this time I note someone else is listening, not uncommon*\n\n&gt; $liar: I can't edit my spreadsheet\n\nStart with the soft ball stuff, selecting cells, any errors? anything weird? nope nope nope, ok\n\n&gt; $me: with that out of the way lets try to unlock the sheet\n\n&gt; $liar: I don't see that menu\n\n&gt; $me: *hmmmmmm is this guy even in a spreadsheet program?* Choose help and about and tell me what you see there\n\n&gt; $liar: *provides all information that sounds like we are in fact in $expoectedSpreadsheetProgram, I even double check. Now I'm stumped*\n\n&gt; $me: Huh weird, might be some addons or customized settings.\n\nAt this point go through anything I can think of that would make menus disapear, go through the menus he has, all the time things keep sounding strange, but always makes me think we are in a $expectedSpreadsheetProgram\n\n&gt; $me: alright, looks like we should probably try doing a reinstall and repair of office, nothing here sounds right an...\n\nduring this time I trail off because the co-pilot in this call is getting clearly aggitated and it sounds like things are being pushed out of the way with a slow grumble coming up\n\n&gt; $chad: give that to me! Give me the phone! Yes, hello! IT? Listen we aren't in spreadsheet program, we are in PDF program.\n\n&gt; $me: Ooooooooooooooooo *as I attempt to recover from a blue screen in my brain* oooooooooo kay.... *instructions in how to edit things in full version PDF program*\n\n&gt; $chad: Great that's all thanks! *as the he is hanging up* What the hell was that all about $liar?! *click*",
        "created_utc": 1511375560,
        "upvote_ratio": ""
    },
    {
        "title": "When our CTO kicked some butt",
        "author": "Janzo14",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7espf1/when_our_cto_kicked_some_butt/",
        "text": "[removed]",
        "created_utc": 1511372312,
        "upvote_ratio": ""
    },
    {
        "title": "Supervisor meets esclations",
        "author": "nik_drake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7esm2e/supervisor_meets_esclations/",
        "text": "I work technical support escalation for an ISP.  \n\nMany ISPs in the US employ enhanced error pages on their domain name servers because the general base of technology users are what keeps most of us in TFTS employed.  These pages do exactly what they are designed to do, babysit the residental internet so we don’t get a phone call saying the internet is down every time someone mistypes a website.\n\nFor obvious reasons these servers don’t play nice with sites unregistered with them.\n\nThe quickest and easiest way to deal with opting out of enhanced error pages is to change the server in the indivual device trying to access the page or by reconfiguring a router to override the ISP assigned one.  Some ISPs provide opt out tools or procedures, but these are hit or miss and often will reset if the IP changes.  Also complicating matters is some work machines are locked down so that even the company IT can’t override it or the customer think routers work by magic.  This tale is not about one of those customers.\n\n&gt;$me: Hi this is nik.  How may I help?\n\n&gt;$cst: You probably aren’t even going to know what I am talking about.  I need to to stop the enhanced error messages.  Do you even know what they are?\n\n*internal sigh.* Either this guy has spent the last hour being shuttled between departments for whatever reason or he’s a jerk.  The former is a difficult deesclation over something I sometimes can’t help with while the later has no fix. \n\n&gt;$me: I’m sorry you are having trouble accessing certain pages from home.  Let me pull up your account.  Were you given a ticket?\n\nI get the account pulled up and get an earful about how the guy is working at home, he needed to be taking supervisor calls rather than talking to me, and that we needed to fix our broken system immediately.  After 10 minutes of him insisting that he went to school for this, he wants us to fix it instead of telling him bypasses he already knows, and a comment by me that I could refer him to business if he doesn’t like our residental terms of service which seemed to have gone over his head, I sigh interally. I rack my brains at which level three might actually bother with this ticket even if just to say we won’t do it instead of letting it sit around for a month.\n\n&gt;$me:  I can escalate your ticket to a back office team.  I can’t give any promises that we will address the issue there.  I have already told you the best solution.  Before I do, I see you verified with last four on the account (it was his wife’s) can you please tell me the personal identification her account?\n\n&gt;$cst: *repeats the last four*\n\n&gt;$me:  That is the last four.  Because we are requesting a major change to the data on the account and I don’t know how my back office will react, I want to make sure to verify with a stronger form of authentication.\n\n&gt;$cst:  That is the strongest form of authentication.\n\n&gt;$me: I don’t want this to be kicked back for not being verified correctly, can you please tell me the personal identification\n\n&gt;$cst:  I work for $competitor (granted one that doesn’t service some areas of his city, and he might work for a different division) and I have never heard of something so ridiculous.\n\n&gt;$me: I am just trying to help.  FCC regulation requires that before we make certain changes to accounts, we can’t use last four of social to verify.\n\n&gt;$cst: I have never heard of such bs and I know you are lying.  When I get back to work, I am going to look it up and I am going to prove you wrong. *finally states the number listed* You are trying to tell me that some random four digit number that I made up is more secure than a number the government has given me?  \n\nYes sir, yes I was.\n\nTL:DR- A work at home supervisor for a competitor kept insisting that a system that was working how it was designed was broken and we needed to fix it even though he apparently knew the work around for it; then insisted that a government assigned set number of his wife’s was more secure than a randomly chosen number.\n\nEdit: Thank you for the spelling help.  I am on mobile because Windows 10 crashed my personal computer and I don’t want to deal with it.",
        "created_utc": 1511371565,
        "upvote_ratio": ""
    },
    {
        "title": "Wait, what?! I think you are making a mistake",
        "author": "wowdoge69",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7es0lu/wait_what_i_think_you_are_making_a_mistake/",
        "text": "[removed]",
        "created_utc": 1511366944,
        "upvote_ratio": ""
    },
    {
        "title": "More from Aviation Maintenance-Murphy's Law Part IV: Finale",
        "author": "Zeewulfeh",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7erwrv/more_from_aviation_maintenancemurphys_law_part_iv/",
        "text": "*As always, [Glossary](https://www.reddit.com/r/talesfromtechsupport/comments/7erwrv/more_from_aviation_maintenancemurphys_law_part_iv/dq6z8vg/) on the bottom.*\n\n[*Part I*](https://redd.it/7cwkt6)\n\n[*Part II*](https://redd.it/7d524l)\n\n[*Part III*](https://redd.it/7e9iv1)\n***\n*Previously on TFTS:*\n\n*Our Tech, ZeeWulfeh, has learned that Draft documentation is not the same as a Preliminary Repair Instruction (PRI--Engineering Instructions to perform a task.), $AircraftManufacturer never expected Maintenance to so fork up this part of the plane and so had never actually performed a damage tolerance analysis on it and finally that replacing a pin can result in the entire flap being removed from an aircraft.*\n\n*After briefly browsing the job bid board and tidying up his resume, ZeeWulfeh digs into another day of minimal gains and frequent setbacks.*\n\n*And now…The Finale.*\n***\n###Day 22\n\nIt had been several days since the Flap Track Spigot Pin had been identified and we’d decided to go ahead with the disassembly and removal of the flap track to get at it.  For the past few days, the Thrust Reversers were still waiting for some sort of corrosion preventative compound for the---wait a sec!\n\nI snatched the work card off the board and paged through it until I found the chemical in question.  I started feeling a twitch develop and I ran out of the office onto the hangar floor, to the chemical lockers.   Third locker, second shelf, middle….\n\nI sauntered back into the office, a grim smile pasted to my face.  \n\n&gt;**ZeeWulf** “Did anyone bother to *look* for the stuff, or did they just assume we didn’t have it?”\n\nI plopped the can onto the counter.  We’d just lost several days because someone couldn’t bother to look for the chemical in the most obvious place for it.\n\nMeanwhile, inspection had finally got around to the point of performing the NDT inspection (Non-Destructive Testing--using stuff like ultrasonic techniques to look for issues in materials) on the now extremely oversized hole in the pylon.  Out came the NDT4999 tool, they scanned the hole, and then sent the info onward to $AircraftManufacturer.  In the meantime, they were very, very quiet. \n\nBy this time Wash (A lead I worked with, name sounds like Wash) had returned as well and the pylon was scheduled to arrive.  Of course, now the issue was establishing serviceability.  We notified the shop at The Mothership (Home Office) of our intent and a turf-war immediately broke out.  That manager demanded we send the replacement pylon to them to establish serviceability, it is their responsibility and they weren’t about to let anyone encroach on their territory.  (Serviceability means it's a good part, legal to use on the aircraft)\n\n###Day 24\n\nAn enterprising mechanic realized that we didn’t need to completely disassemble the flap carriage assembly and if we just remove the stops we could slide the carriage off the track.  (Flap Carriage-Assembly that attaches to aircraft flap and rides on the track, guiding it) Simple, effective, and totally legal for us to do, it was even in the removal paperwork as an alternate removal method!  Finally, something was going right!  The thrust reversers were down to marking that the inspection had been complied with and they were even planning on hanging the #1 engine’s reverser that evening.   Friday hadn’t been this nice in a while.  Sure, we were going to be late, but only by a day or two…\n\n###Day 27\n\n&gt;**$Lead**  “Hey, ZeeWulf, did you see this note?”\n\n&gt;**ZeeWulf**  “Note?”\n\n&gt;**$Lead** “Yeah…it says for specifically this aircraft, the alternate method of removal of the flap track carriage is not approved and it must be fully disassembled and inspected.”\n\n&gt;**ZeeWulf**  “Wait.  That’s the installation paperwork.”\n\n&gt;**$Lead** “Yeah.  Looks like the removal paperwork is wrong.”\n\nWe tore apart our mostly-reassembled flap assembly and called inspection over to inspect the carriage assembly.  The inspector we got hated actually signing things off and instead wrote it up to the point where we needed to replace half of the assembly, so he managed to get out of actually verifying any sort of serviceability.  \n\nMeanwhile, on the other wing the crew was assigned to start disconnecting the old pylon.  Over the weekend the turf war had been settled once it was realized the ‘responsible’ shop at The Mothership was nothing more than an office that processed paperwork and sent out repair requests to outside vendors.  $LCE (Local Engineer) came over with a list of tasks we had to perform to make the ~~stolen~~ acquired pylon serviceable.\n\n##Day 29\n\nOvernight a plane on the flight line had power issues, so our Line Maintenance team came over and ~~borrowed~~ stole a number of our Transformer Rectifiers.  The Transformer Rectifier is a basic transformer and makes the power supplied by ground or other sources into something safe and usable by the aircraft.  Without it, we were stuck with power off.  The Mothership was predicting it would be a day or three before we could get another one up here.\n\nOn the pylon front, Management had decided we were going to *not* remove the pylon, because ~~we~~ they were confident $AircraftManufacturer would approve the fix.  And in fact, we did get a response from them that afternoon…telling us they wouldn’t approve it as we used an NDT4999 tool, not the NDT5000 tool they wanted us to use.  And literally, the difference was down to the numbers on the tool itself.  At the end of the day we decided to just cut our losses and just remove the pylon.  Two days later, we would receive the “Okay To Install” from inspection on the replacement pylon.\n\nFor the flap, we had finally received parts and it was all going back together.  With any luck we would be rigging the next day.  Over the weekend, we would be installing the engine on the replaced pylon, the flap would be good to go, and we’d have jacked the aircraft into the air to swing the landing gear on Sunday.\n\nOh, and the stolen Transformer Rectifiers?  They were returned late that afternoon, unused. \n##Day 34\n\nI walk into the work center office on Monday Morning expecting the plane to be entering into the final phase.  Instead, in the corner I see a fixed landing gear door (a door attached to the gear strut itself that would enclose the gear when it is retracted) that looks as if someone had decided to smash it and attempt to break it in half.  “Nobody” knew what happened, it just broke all of the sudden when doing the gear swings the night prior.  We ended up putting a request to acquire more parts from the donor aircraft in the desert.  \n\nOut on the pylon and wing, I saw a pair of avionics guys opening wing panels back up.  Turns out at some point the generator power cable from the engine had gotten it’s insulation damaged and so the entire wire run had to be replaced from where it started in the pylon, through the wing and all the way down into the junction in the forward cargo bin.  Over a hundred feet of wiring…that we didn’t stock, but hey, at least it was supposed to show that day.  \n\nOf course, the power struggle over the pylon serviceability had resumed as well—the department at The Mothership was demanding that they provide the serviceability, but they wouldn’t do so unless they laid eyes on it…\n\n###Day 38\n\nThe problem department at The Mothership finally gave up and signed off on the pylon.  Unfortunately, it was discovered during testing and sign-off that $LGE (Landing Gear Engineer--of the much lamented Landing Gear Control Unit project) had screwed up the paperwork for the Landing Gear system yet again, so we sat until the end of the day waiting for that fix.  And finally, while out performing engine run tests, it was discovered the Air Traffic Control system wasn’t communicating.  After much sweat, tears and an antenna replacement, that system was finally working, the logbook signed and the aircraft check from hell finally completed.  \n\nWash and I took a look at this plane’s sister aircraft and discovered something interesting: Every single one of them delivered around the same time were already retired….\n\nAnd this plane was scheduled to retire within the next year or so as well.\n\n***\n\nFinal Fault Tally:\n\n1. Thrust Reverser Airworthiness Directive wasn't noticed by planning until the last minute, making us unable to install the reversers back on the aircraft until we'd completed an extensive inspection\n\n2. Seats were modified by an outside group, they messed up the paperwork declaring them good and had to come up and fix it, delaying the seat install.\n\n3. Landing Gear Control System version was misidentified for 20+ years by $AircraftManufacturer, caused us a serious headache after I released the wrong corrective paperwork.  Engineer still screwed up his paperwork afterwards, making us wait for a fix.\n\n4. Number 2 Engine (Right Wing) attachment pylon had a bolt crudely removed by ape, rounded out by a bad reamer, and resulted in replacement of the whole thing.  Also $AircraftManufacturer never expected such shenanigans, so didn't have a damage tolerance analysis done on it yet.  And Inspection used the wrong inspection tool to inspect it.  Small interdepartmental turf war was waged.\n\n5. Flap Track Spigot Pin found to have corroded threads where you screw in the removal tool, in no way compromising the integrity of the pin.  Required complete flap disassembly to remove. And then further disassembly after reassembly because of bad directions and an inspector with a bad attitude.\n\n6. Landing Gear Fixed Door got smashed 'somehow' while operating the landing gear.\n\n7.  The line stole the Transformer Rectifiers (which smooth the power coming to the plane into something it likes) for a day and didn't need them.\n\n8. Someone screwed up a generator power wire in the pylon while installing the pylon.  Had to replace a 100+ foot run of wire.  \n\n9. Air Traffic Control Antenna Failed right before releasing the aircraft.  \n",
        "created_utc": 1511366107,
        "upvote_ratio": ""
    }
]