[
    {
        "title": "Another \"no im not here to do your job\"",
        "author": "I_Have_A_Chode",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w6vpw/another_no_im_not_here_to_do_your_job/",
        "text": "I read a post earlier from U/SnArL817 and started typing this up in a comment, and decided i wanted to go into my detail so here it is.\n\noutside user now known as $OU is coming into company to present something. all our rooms have equipment built in to the room so all you do is plug the HDMI/VGA+3.5mm/Display port cable into your laptop and viola! you can present.\n\nGet a ticket that person is coming in and they will need assistance with this. Person submitting ticket is SUPPOSED to know how to do this very basic step of plugging a cable in, because we trained everyone how to do. Whatever, ill help anyway.\n\n$OU comes in\n\n$OU \"i would have thought you guys would have laptops in the building\"\n\n$ME \"we do, they are only for employee use\"\n\n$OU \"yes but im doing a presentation for $randomemployee\"\n\n$Me \"yes, you are doing the presentation so you bring in your equipment...\"\n\nshe drops it and gets out her laptop, and proceeds to attempt to pry it open, hinge side. Now this isnt some new slim form laptop that it is actually hard to tell because hinges arent seen. This is about a 5 year old dell, blue lid, with silver hinges, blatantly obvious. So i have to tell her to open it from the other side. I take it and plug it in to the system and wam bam thank you ma'am, its on the screen. That easy.\n\n$OU \"what now?\"\n\n$ME \"you pull up your presentation\"\n\nshe fails to login and asks me what the issue is. Now this is a domain computer for her companies network. My first thought when it tells me there are no domain servers to access is that damn, this woman was given a laptop that she has never logged into before, shes up the creek here, while quietly laughing and dying inside, laughing because i enjoy the failure on her end, dying because i will have to do more work to fix this shit that isn't my issue to begin with.\n\nLuckily she just spelled her name wrong in the credentials, shes now in the machine.\n\n$OU \"now what?\n\n$ME \"bring up your presentation?\"\n\n$OU \"its a youtube video\"\n\n$ME \"ok, go to youtube and load it up and pause until the person gets here\"\n\n$OU \"what browser should i use?\"\n\n$ME \"doesn't matter to me, whatever your preference is\"\n\n$OU \"so chrome?\"\n\n$ME \"whatever your preference is\"\n\n$OU \"ok, my friend at work really likes fox fire so i always use fox fire\"\n\nI think to myself, If thats what you like, then why are you calling it by the wrong name, and why ask me if you should use chrome after the first time i tell you to use whatever you'd like to use!?&gt;!?!?\n\nFirefox is now up\n\n$OU \"oh i have to go get the link from my car i left it there\"\n\n$ME \"you can just search youtube with the video name\"\n\n$OU \"yea the links in my car ill go get it\"\n\ncomes back with a piece of paper with it printed on it, and hands the paper to me\n\n$ME \"ma'am this is all your show, you go to the link\"\n\nshe types out the link and it doesn't work, surprise surprise!\n\n$OU \"My copresenter gave me that, ill call her and see whats up\"\n\n$ME \"whats the name of the video, or whats it about in general? we can just look it up\"\n\n$OU \"ill call her\"\n\nat this point im tired of this, they had sent me the youtube link in the helpdesk ticket that the person who submitted the ticket originally had CCed them on. I was really just trying to avoid doing basic acts of using a computer for someone at this point, because it sets bad precedence, and because, common.... look at what we are doing at this point...  So i just pull the link up on my phone, go to the video and look at the name and type it in on the laptop.\n\nShe comes back in with her copresenter who has now arrived and its up.\n\n$ME \"its up and ready to go\"\n\n$OU \"OK so what do i do when the person gets here\"\n\n$ME \"Click play, anywhere on the screen (i've fullscreened it now) or hit spacebar\"\n\n$OU \"ok thank you\"\n\n$ME \"no problem, your laptop is about to die, i'd plug it in immediately\"\n\n$OU \"how is it about to die?!\"\n\n$ME \" you didn't charge it before you came in? its been on this whole time in your bag? not sure, but plug it in. Have a good one!\"\n\nI hate being level 1 support...\n\n",
        "created_utc": 1518114135,
        "upvote_ratio": ""
    },
    {
        "title": "Asshole customer gets what he deserves",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w6mva/asshole_customer_gets_what_he_deserves/",
        "text": "[removed]",
        "created_utc": 1518112254,
        "upvote_ratio": ""
    },
    {
        "title": "TFTS Top Tales - January 2018",
        "author": "MagicBigfoot",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w6cev/tfts_top_tales_january_2018/",
        "text": "Hi Everybody!\n\nWell that month went by fast, didn't it?  \n\nHere's another crop of great Tech Support tales in case you missed some of them.  \n\nI hope your 2018 is off to a good start.\n\n ~ magicB ~\n\n###TFTS TOP TALES - January 201\n-----\n_1/1/18_ : [Is that it, you not going to even troubleshoot?](http://www.reddit.com/r/talesfromtechsupport/comments/7nefia/rough_start_to_the_new_year/) [s] - _/u/upgraydd98_  \n_1/2/18_ : [Sooo, what’s your rate for one hour?](http://www.reddit.com/r/talesfromtechsupport/comments/7nmjbt/how_i_made_more_than_minimum_wage_in_two_minutes/) [s] - _/u/siro300104_  \n_1/3/18_ : [I majored in flute.](http://www.reddit.com/r/talesfromtechsupport/comments/7nvdxe/dont_think_you_need_a_degree_for_that/) [s] - _/u/syberghost_  \n_1/4/18_ : [Tell me again what happened.](http://www.reddit.com/r/talesfromtechsupport/comments/7o2z8j/more_from_aviation_maintenanceoops_part_ii_for/) [l] - _/u/Zeewulfeh_  \n_1/5/18_ : [...that's not good...](http://www.reddit.com/r/talesfromtechsupport/comments/7octdn/idont_think_i_can_help_with_that/) [s] - _/u/TinyBard_  \n_1/6/18_ : [I'd like to speak with your supervisor.](http://www.reddit.com/r/talesfromtechsupport/comments/7oj1uk/short_one_but_great_and_sad_but_funny/) [s] - _/u/tilhow2reddit_  \n_1/7/18_ : [That has nothing to do with anything else.](http://www.reddit.com/r/talesfromtechsupport/comments/7olm46/monitor_doesnt_work_reboot_the_server/) [xl] - _/u/DondoYonderboy_  \n_1/8/18_ : [Is it possible to get it done today?](http://www.reddit.com/r/talesfromtechsupport/comments/7oyi52/netnotworking_wait_for_it/) [l] - _/u/Phrewfuf_  \n_1/9/18_ : [Hey, he can't get in.](http://www.reddit.com/r/talesfromtechsupport/comments/7p8bf8/no_i_was_not_kidding/) [s] - _/u/Meanee_  \n_1/10/18_ : [Oh, yes that does make sense.](http://www.reddit.com/r/talesfromtechsupport/comments/7pfbpj/the_internet_is_down_well_you_kind_of_have_to_pay/) [s] - _/u/RagingPilot94_  \n_1/11/18_ : [Look, stop stalling and fix my problem.](http://www.reddit.com/r/talesfromtechsupport/comments/7po7nz/please_create_a_team_to_keep_me_from_making/) [m] - _/u/syberghost_  \n_1/12/18_ : [I don't see any numbers.](http://www.reddit.com/r/talesfromtechsupport/comments/7py3ei/i_have_a_user_across_the_country_who_has_been/) [m] - _/u/skramzy_  \n_1/13/18_ : [Oh wow, how did you learn all those things?!](http://www.reddit.com/r/talesfromtechsupport/comments/7q6413/call_me_if_you_need_money/) [s] - _/u/Noneofmybusinessbut_  \n_1/14/18_ : [I'm trying, man, I'm trying.](http://www.reddit.com/r/talesfromtechsupport/comments/7qfs57/encyclopædia_moronica_p_is_for_power/) [s] - _/u/Gambatte_  \n_1/15/18_ : [Hi, got a machine that won't power up...](http://www.reddit.com/r/talesfromtechsupport/comments/7qkh6j/this_is_why_you_read_your_departmental_emails/) [s] - _/u/_Rolfy__  \n_1/16/18_ : [So, like, what's next?](http://www.reddit.com/r/talesfromtechsupport/comments/7qtg46/the_heisenberg_dns_principle/) [l] - _/u/molotok_c_518_  \n_1/17/18_ : [Nonono, that can't be it...](http://www.reddit.com/r/talesfromtechsupport/comments/7r2mcd/if_you_call_me_let_me_do_my_job/) [m] - _/u/Unterdosis_  \n_1/18/18_ : [What autopilot?](http://www.reddit.com/r/talesfromtechsupport/comments/7r9k46/help_my_boat_only_goes_around_in_circles/) [s] - _/u/ccgarnaal_  \n_1/19/18_ : [Yes! That's the black screen!](http://www.reddit.com/r/talesfromtechsupport/comments/7rivvo/my_laptop_wont_start_and_it_had_all_my_family/) [s] - _/u/Isoldael_  \n_1/20/18_ : [Hey, I can add the team to the Users group.](http://www.reddit.com/r/talesfromtechsupport/comments/7rurhv/access_manglement/) [s] - _/u/ConstantFacepalmer_  \n_1/21/18_ : [Yes, four times!](http://www.reddit.com/r/talesfromtechsupport/comments/7rxg5e/with_coworkers_like_these/) [s] - _/u/Brownbagwriter_  \n_1/22/18_ : [I did, why are you asking?](http://www.reddit.com/r/talesfromtechsupport/comments/7s4sp9/lets_print_a_boat/) [s] - _/u/quadpiece_  \n_1/23/18_ : [No that'll be too complicated thanks.](http://www.reddit.com/r/talesfromtechsupport/comments/7sewau/dont_do_the_thing_does_it_anyway/) [s] - _/u/Samanthah516_  \n_1/24/18_ : [You should try it! It'll make you a new man!](http://www.reddit.com/r/talesfromtechsupport/comments/7smz0n/more_from_aviation_maintenance_first_aid/) [m] - _/u/Zeewulfeh_  \n_1/25/18_ : [It worked fine yesterday.](http://www.reddit.com/r/talesfromtechsupport/comments/7supzr/yes_the_cable_is_plugged_in_do_you_think_im_stupid/) [s] - _/u/PM-ME-UR-CUTE-SMILE_  \n_1/26/18_ : [Oh...](http://www.reddit.com/r/talesfromtechsupport/comments/7t49fu/the_300_spellchecker/) [m] - _/u/quell_in_a_shell_  \n_1/27/18_ : [It says press OK to continue, what do I do now?](http://www.reddit.com/r/talesfromtechsupport/comments/7t92uf/do_you_think_im_a_technician/) [s] - _/u/TheBluePirateIL_  \n_1/28/18_ : [How do I do that without a start button?!](http://www.reddit.com/r/talesfromtechsupport/comments/7tavyz/freeing_up_vital_memory/) [s] - _/u/Phonoi_  \n_1/29/18_ : [The internet on it doesn't work...](http://www.reddit.com/r/talesfromtechsupport/comments/7tpuot/the_tale_of_the_ipad_without_internet/) [s] - _/u/OblivionCreator_  \n_1/30/18_ : [Well the hard drive fell over...](http://www.reddit.com/r/talesfromtechsupport/comments/7u0pts/my_keyboard_and_mouse_arent_working/) [s] - _/u/DJ1NF3RN0_  \n_1/31/18_ : [Uhm, are you working on the problem?](http://www.reddit.com/r/talesfromtechsupport/comments/7u85r4/no_the_mouse_is_not_moving/) [s] - _/u/-ic3cr3am_  \n\n-----\n\nThe full set of [TFTS Top Tales by month](https://www.reddit.com/r/talesfromtechsupport/wiki/index#wiki_the_compleat_best_of_tfts) can be found in our wiki.\n\n\n_^(All stories and quotes are copyright their original authors.  No re-use without permission.)_\n",
        "created_utc": 1518110026,
        "upvote_ratio": ""
    },
    {
        "title": "Never rule out anything without checking it first. Ever.",
        "author": "Sati1984",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w4kfd/never_rule_out_anything_without_checking_it_first/",
        "text": "I'm a long time lurker / commenter, and have not posted a story yet. I have several in mind, but never thought the first one will be a story that is about the resolution of an issue that happened to me just now, a few hours ago.\n\nSo I'm using a laptop on a docking station at work. The laptop lid is shut, and I'm using an external monitor that is connected to the docking station. This morning I'm typing an important mail on the monitor, when suddenly the picture disappears. Obviously, I try to follow the standard steps of troubleshooting here.\n\nFirst I opened the laptop lid, and checked if the machine is even functional. The laptop screen came alive and showed my half-written e-mail just as it should, so it wasn't a not responding computer kind of situation. I next powered the monitor off and on, to no avail. I next checked the VGA cable running into the docking station, disconnected it and connected it again. As soon as I disconnected it from the docker, the monitor's led turned green and it showed \"no signal\". After I re-connected it, the green switched to yellow, and the \"no signal\" notification disappeared - still no picture though. I then tried to use the laptop's own VGA connector instead of the docker's - same result.\n\nI then checked in Windows whether the monitor is even listed amongst the displays. It was listed and it seemed to function correctly. I fiddled around, making the monitor the primary screen, switching from \"extend\" to \"duplicate\" in the Fn+F7 menu, and some other software things like that. Nothing helped, monitor stayed black.\n\nThis is where I began to make some noise towards the co-workers sitting near me. I told them how curious it is that the monitor seems to detect that there is a source, but only responds by turning into stand-by mode. Before they could suggest anything (first most likely they would have suggested me to check the cables) I announce that my next move will be to restart my computer as I suspect something going awry in Windows or in the display driver or something.\n\nAfter reboot, the issue still persists: as soon as I issue the restart command, I shut off my laptop lid, but the boot sequence doesn't show up on the monitor. So I mumble something under my breath and wait for Windows to become responsive, and fiddle again with the screen settings. Nothing changed. I grumble on for a bit, before mentioning this issue to a long-time friend, by announcing at the end of the story that my next move will be to move a different monitor to my desk for further testing.\n\nAt that point my friend humbly and quietly suggests to check the other end of the VGA cable, namely the end which is connected to the monitor. In my head I think this cannot be it, but I humor him. I re-seat the cable and all the blood is draining from my face at the sight of the monitor showing my desktop as normal. I humbly stop grumbling, sit back and in the next 5 minutes, finish typing my important e-mail in dead silence.\n\n**TL;DR:** Don't let your ego interfere with the troubleshooting process - **never, for any reason skip any of the steps!**",
        "created_utc": 1518094410,
        "upvote_ratio": ""
    },
    {
        "title": "Standard new user",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w47j8/standard_new_user/",
        "text": "New user picked up his kit yesterday morning, I go through the half hour introduction to our systems with him - how to log in, when to use VPN, how to add your home wi-fi etc.\n\nAt every step he tells me he knows this already and is very good with computers. First red flag.\n\nI explain there is a laptop password for the encryption, this is different to the Windows password. He tells me he understands, he had that at his previous company.\n\nTrying to change his Windows password, at first he just hits Enter and doesn't confirm. Second time, he uses the trackpad (not even the attached mouse, 2nd red flag) to move to the 2nd box, and gets it wrong. Third time lucky, he changes it and gets in.\n\nI go through all the stuff, he writes some of it down. Then I do a little test. Shut the machine down. Give it to him, and ask him to get connected to the visitor wi-fi, VPN in and send me an email.\n\nI help him on the bits he gets wrong, he writes them down. Seems OK. Eventually gets through and is able to email me.\n\nLast night at 9pm, I get another email from him. This is just a photo of the laptop screen at the encryption password stage, with an \"invalid password\" message. Not even a subject line on the email, or any text. Just the photo.\n\nI reply and tell him to use the encryption password, not his Windows password. \n\n\"This is a lot more complicated than at my last place.\" he replies...",
        "created_utc": 1518089966,
        "upvote_ratio": ""
    },
    {
        "title": "Never rule out anything without actually checking it. Ever.",
        "author": "Sati1984",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w41z4/never_rule_out_anything_without_actually_checking/",
        "text": "[removed]",
        "created_utc": 1518087774,
        "upvote_ratio": ""
    },
    {
        "title": "Scraping the bottom of the barrel here..",
        "author": "Philosopherski",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w2pyp/scraping_the_bottom_of_the_barrel_here/",
        "text": "I work IT at a university in NYC. \n\nHad some serious professor aggro the other day. He came in telling me how his password didn't work and how he couldn't assign his students grades and that he has a deadline.  \n\nThis obviously being my fault I jumped into action asking him all kinds of question, this ending with \"I don't remember my password.\" \n\nAbout a day after sending a priority ticket to reset his password he comes in telling me that he has not been able to log in still. \n\nTurns out this profesor can not differentiate between \"Can you not log in to the computer, or a website?\" and while I reset his password to the uni computers he needed a reset on his Gmail account which has a spreadsheet with all his students grades. \n \nCried a little, laugh a lot, these people keep food on my table ",
        "created_utc": 1518068833,
        "upvote_ratio": ""
    },
    {
        "title": "\"I dont know\"",
        "author": "derickkcired",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w1qr6/i_dont_know/",
        "text": "[removed]",
        "created_utc": 1518058274,
        "upvote_ratio": ""
    },
    {
        "title": "Panic! At the office",
        "author": "auxiliary1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w0uws/panic_at_the_office/",
        "text": "Blah blah LTL FTP blah mobile blah blah formatting\n\nSo, i work for a IT service provider and one of our contacts is a government department.\n\nThis user called in, and after the usual spiel of greeting eachother she proclaims that the office is in panic right now. Everyone but 2 people are sick right now. This user, just got a whole new load of responsibilities to pick up due to everyone being sick.\n\nAfter calming her down to an semi-comprehensible level, i manage to figure out what she needed. She picked up secretary duties for the director, and needed access to her outlook mailbox and schedule. She has however already gotten the login details for said director.\n\nThis is where the fun part happens. At this point, i had a choice to make. Either i remote in to her computer, have her log in under the directors account and authorise her myself through outlook, or follow our procedures for these things.\n\nfyi, procedures would be to call our security officer, which would then have to spend a few days to either give the go-ahead for the authorisarion or deny it.\n\nDilemma, either ill catch wind from management, or ill catch wind from the user. \n\nI made the choice to not have her be blocked by official nonsense, and authorise her myself.\n\nDuring the call she noticably became more calm, and we even shared some jokes about getting coffee for eachother and the fact that it would be cold by the time we reach eachother. (At least an hour drive)\n\nAt the end, when i verified she got everything working that she needed, she even told me that if she got the survey to rate the call, she'd rate me 9.9\n\nSometimes, it's not all bad working service desk :)\n\nNinja edit: and now we wait for the folks from management to catch on and give me shit for this :p (doubt anything serious will come from this, people are pretty understanding)",
        "created_utc": 1518049839,
        "upvote_ratio": ""
    },
    {
        "title": "The Mystery of the Missing HDD.",
        "author": "EchoCT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7w0bgn/the_mystery_of_the_missing_hdd/",
        "text": "So FTP apologies for the terrible formatting. \n\nThe actors! \n$Echo - Yours truly.\n$Tech2 - My partner in crime. We're the only two at this site.\n$Backup - An older gentleman, not really tech savvy but a good guy\n$IS&amp;T - The information systems and tech manager for the company that mine is contracts to for Tech Support\n$HRM - The HR Manager\n\nThe setting: The international transit company we're contracting just went through a number of mergers. As such their inventory is an utter mess (bordering on non-existant when I started there a month ago). Our site only has myself and $Tech2 who has been there about 4 months herself. \n\n&gt; $IS&amp;T \"Hey, I need you to pull HDs for these 4 people and I need them ASAP this is for a legal issue.\n\nF$CK,  Legal. This was a legal issue that required looking through some outlook .pst files. We're supposed to keep Hard drives for 2 years from previous employees for this very reason. In our case we had about 8 years of drives from leavers. Our phone server room was FULL of boxes upon boxes of old drives. This will take forever. When I said that inventory was non-existant for these I meant it, just stacked in the old phone server room with an employee ID written in sharpie. No spreadsheet, no nothing, just drives and numbers. \n\nWe're the only two people at the site and frankly we have actual tech issues to deal with so we kinda shelve it until the end of the day. \n\n&gt; $IS&amp;T \"I've had no updates from either site. I NEED those drives, this is not optional\"\n \n&gt; $Tech2 \"We haven't found them yet but we're looking\"\n\n&gt; $Echo \"We're working on it boss, you know the inventory is a mess, I know it doesn't help now but we've got some ideas to make sure this isn't an issue again.\"\n\n&gt; $IS&amp;T \"Find them.\" \n\nOk, so our other site is having the same issue, that should buy us some time. After a frantic call to our boss on the other site, and delaying as much as possible while rooting through a thousand drives. We decide to call in one of our backup techs to root through the mess. $Backup is an older gentleman, in his 50s, not the best tech but has surprisingly sharp memory and has been helping the company for decades. The next day $Backup arrives.\n\n&gt; $backup \"Oh we moved those drives from downstairs about 3 years ago, the ones from the timeframe you need should be in... *He shuffles some boxes around and finds a stack of drives beside a cabinet near the wall* here. Don't worry $Echo\" \n\n&gt; $Echo \"At least you know where to start. Good luck $Backup\"\n\nNot 30 minutes later he slaps down two drives belonging to the person in question. YES! Go $backup! One drive from 2012 and another from 2014.... Ok, we need the one from 2017 but if this is what we have it will have to do.\n\n&gt;$Echo \"Hey $IS&amp;T, we found 2 drives but they're not the right years, I have a 2012 and a 2014 for $person.\"\n\n&gt;$IS&amp;T \"Keep looking but it'll have to do for now.\"\n\nSo I pull the drives and get the .pst files onto a USB for $HRM. Now for the best part. The only thing I have done to these e-mails is change the names and format for our story.\n\n&gt; From $HRM: \"I picked it up from $tech2 yesterday but I see the USB only has the e-mails for activities until 2014. (Screenshot of explorer with 2 folders). I still have her old laptop. Would it be possible that the e-mails from 2014-2017 are still there?\" \n\n&gt;IS&amp;T : Hi $HRM, Why do you still have her PC? And why didn't you mention anything about that at the beginning of all of this? Yes, you need to return the computer to IT ASAP and yes the e-mails are most likely still on it. We will get them off.\n\n&gt;$HRM: Because the PC was initially given back to HR when she left. We figured it was all backed up to a server or the cloud. I'll drop it off this afternoon with $tech2 when I come up there for another ticket. ((IT is magical I know)) \n\n&gt;IS&amp;T: \"$HRM, For future reference all PCs must be returned to IT when ther person leaves we're required to hold onto the hard drives for this very reason and we need to re-use the PCs for other employees.\"\n\n&gt;$Echo (internally) \"Are you kidding me? TFTS will love this.\" (externally deadpan as possible) \"We'll get the data.\"\n",
        "created_utc": 1518044984,
        "upvote_ratio": ""
    },
    {
        "title": "Today's Lesson: What is, and what isn't, the Internet?",
        "author": "Stellapacifica",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vz87y/todays_lesson_what_is_and_what_isnt_the_internet/",
        "text": "Short one for you today, just happened. **TL;DR:** Google Docs is in fact part of the net.\n\nI'm working at a small school. We have a main office building, a lower campus, and an upper campus. Maybe a few hundred feet from one end to the other.\n\nThe multifunction printer that does color and all that fancy stuff is in the main office, central so that everyone is inconvenienced equally.\n\nI would like to take this opportunity to reflect on my continuing hate for all printers except the one at my desk, which works great and has never broken. May it always be so. Industrial MFPs in particular can go get in the sea.\n\nBackground: We recently put user codes on the office MFP so that we'll know who's using up so much printing. In order to print, you have to use the preset that I put on everyone's work laptop. If you're in a browser, you need to bypass its printing function and use the OS one, because the browser builtin printing software doesn't know how to send a user code, so it ignores it and the job gets cancelled silently by the printer. Yes, that's super bad UI. Tell me about it.\n\nSo an upper campus teacher says she can't print. Okay, go up there, she's printing from Chrome. Explain how to use the code, and that whenever you're on the internet you need to do the system print thing. It's one extra click, fine.\n\nGet called back up (she sent a student down to get the papers, since there weren't any student got me) as soon as I'm in my office. Still not working. Go back up. Ask if she's using the code. Get treated to the bestworst sentence:\n\n\"But Google Docs is a word document, not the internet!\"\n\nI have learned my lesson. Shortcuts don't work. The internet is only webpages. Life is suffering. Resistance is futile. Wait, what?",
        "created_utc": 1518036025,
        "upvote_ratio": ""
    },
    {
        "title": "Quick one for you; \"Software to convert Hardware\"",
        "author": "jdbrew",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vyocm/quick_one_for_you_software_to_convert_hardware/",
        "text": "[removed]",
        "created_utc": 1518031732,
        "upvote_ratio": ""
    },
    {
        "title": "[Lesson in password security]Someone managed to get into the email that auto-forwards all messages to all students at HPHS, and is using it to sign up for a ton of accounts. “It was Anthony”",
        "author": "jimothyjones",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vyf4s/lesson_in_password_securitysomeone_managed_to_get/",
        "text": "[removed]",
        "created_utc": 1518029738,
        "upvote_ratio": ""
    },
    {
        "title": "There's a Performance Issue, or, I'm Not Going To Do Your Job",
        "author": "SnArL817",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vxyj8/theres_a_performance_issue_or_im_not_going_to_do/",
        "text": "We have a performance benchmarking environment for the developers to run performance tests against. This is to ensure that they don't screw the code up and cause production to redline.  \n  \nI get an email from the performance team complaining that one of the perf servers is running slow. They're not running any performance tests, so could I take a look at it. I login and see that the application is consuming nearly 400% CPU.  \n  \nMy reply: \"Your application is overconsuming CPU. Please troubleshoot it to determine why.\"  \n  \nThey respond, \"We are not running any performance tests. Sysadmin team, why is the application using so much CPU?\"  \n  \nOh, it's going to be like that? It's not my job to fix your application.  \n  \n\"This is not an Operating System issue. This application is owned by the development team. The process using 400% CPU when IDLE is an indication of a serious problem that needs to be addressed prior to deployment to production. In the future, your team should make use of the top command to determine if an application process is overconsuming CPU. The SysAdmin team handles issues with the OS, NOT the application.\"  \n  \nThe icing on the cake:  \n\"How do we troubleshoot?\"  \n  \nAt this point, the environment manager steps in and tells the team to threaddump and heapdump and run the information through the debugger. But the GALL!  \n  \n**HOW DO I DO MY JOB?**  \n  \nNope. Not going to educate you on how to do YOUR job because I have enough work to do just doing MY job.",
        "created_utc": 1518026250,
        "upvote_ratio": ""
    },
    {
        "title": "Help me son, you're my only hope.",
        "author": "Renceward",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vxg9b/help_me_son_youre_my_only_hope/",
        "text": "A bit of in the family tech support.  This is an old story back from the early days of personal computing.  Mid-80s.   At that time, I was working in development on mini-computers and had a small amount of exposure to those newfangled “MS-DOS” systems that were out.  I had no background at all with Apple Computers (this is the pre-MAC era)\n\nMy parents had previously had an Apple II – My dad had his own business and my mom did the bookkeeping on the Apple.  The had now upgraded to an Apple IIe and had purchased AppleWorks.  This is the earlier version of AppleWorks, there was a later version of AppleWorks that ran on the Mac.  The Apple IIe was a pre-GUI computer with all the programs were text based.  The original version of AppleWorks was an early office suite that combined word processing, spreadsheet and other functions (think of it as pre-historic Microsoft Office).   \n\nMy mother calls me up in a panic.  She has had AppleWorks for a week and can’t get it to work, it won’t save her files.  I try to explain that I know nothing about Apple Computers – but she insists.  She says that I am her only hope.  She has called Apple support multiple times and they can’t figure out the problem.  She has called the store where she bought the computer and the software, they have tried to help her, but can’t figure it out.  My dad’s business hires a computer consultant that helps them with issues (and he specializes in Apple computers) and he couldn’t figure it out.  So I have to help her despite my protests that I am Apple illiterate.\n\nSo I ask her to talk me through what she is doing (remember I have never seen this software in my life).  She tells me how she opens a new document, she enters information, she selects the option to save – and this is where the problem is.  \n\nMom:  The manual says to enter the name of the file that I want to save it to.\nMe:  Go ahead and enter it\nMom:  OK, (she reads off the file name)  Done\nMe:  Now what happens after you press enter?\nMom:  Press enter?????\n\nThe manual didn’t tell her to press enter – so she had just typed in a file name and waited for the magic to happen.  Apple support, the store where she purchased it and the computer consultant had all missed this.   \nI guess I was my mom’s only hope.\n",
        "created_utc": 1518022258,
        "upvote_ratio": ""
    },
    {
        "title": "They never listen....",
        "author": "Samanthah516",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vwvfu/they_never_listen/",
        "text": "Hey everyone. Another short tale for you today. \n\nHad a user that had an issue that required me to remote in (as they often do) \n\nIn order to remote in there is a file that requests you to Run it before I can get in. The conversation is what follows:\n\nMe: **Ok, so I've sent the request over. Please click the \"run\" option when you see it. And I need to know if it says \"retry\"**\n\nUser: **Sure no problem.**\n\n-waits a minute or so-\n\nMe: **Is the request coming through**\n\nUser: **Oh yes I saw it but it says Retry. What do I do?**\n\nMe:**.....**\n\nTLDR: I ask her to tell me when the request says retry and she waits instead.",
        "created_utc": 1518017660,
        "upvote_ratio": ""
    },
    {
        "title": "HP Laptop Bollocks",
        "author": "delta301",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vwuum/hp_laptop_bollocks/",
        "text": "I work on a helpdesk at my local college. I study there too, but one or two days a week I get to work on the helpdesk that is set up for students. The main problems are resetting passwords and connecting people to the network. \n\nHowever, the college also runs a Bring Your Own Device scheme. Students studying particular levels of courses are able to get a laptop for free. It comes out of their bursary, but essentially that's free money anyway, so even the majority of technophobes won't refuse a free laptop.\n\nThe only problem is this laptop is a HP Stream 11. To say they aren't fit for purpose would be the biggest understatement of the millennium. Just for reference, these little shits have 2GB of ram, and 30GB hard drives. Now, Windows 10 takes up around 22gb of that, and the usual HP shit takes up a further 3-4 GB. We do not know where the space goes, but it seems to be disappearing, followed by the copies of Office deactivating.\n\nBecause we have an education licence for Office 365, and they do not work very well with the preinstalled versions of Office, the students suffer because they can't login. We have to remove that version, and reinstall the version provided for students here. \n\nBut for some reason, Office eats up to 5GB of space. I'm getting so frustrated trying to hopelessly free up space (yes, even after we remove the original version of Office) to install it for them. Today, I got met with a load of access denied errors trying to delete things that SpaceSniffer had found, and I lost my shit with the laptop and installed LibreOffice.\n\nSo I had to go up to this woman who had been waiting for two hours for her laptop to supposedly get office installed on it, and tell her that we wouldn't be able to do this, but I had done for her the next best thing. \n\nThese laptops embarrass me and genuinely make me disgusted to work in IT sometimes. The students are not able to use these to learn with, and I can tell how frustrated they are getting but I can't do anything about it. \n\nHere's hoping you never have to deal with any of these pieces of junk :)",
        "created_utc": 1518017524,
        "upvote_ratio": ""
    },
    {
        "title": "Anger Management Computing",
        "author": "Samanthah516",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vwu86/anger_management_computing/",
        "text": "Hello everyone! Been a bit since my last post, but I think I have found a good one for you today. \n\nHad a user that needed to have Outlook closed and opened again, long story short the application wouldn't open. \"Cannot start Outlook. Cannot open the set of folders....\" That kind of error message. \n\nSimple fix, just close Skype from the taskbar and re-open Outlook. Like I said simple enough, but I did have to remote in to fix the issue. While we're waiting the user and I are making general conversation about weather and whatnot when suddenly she says: \n\n**You know. I think I need to get my computer over to Anger Management. It just doesn't seem to like me lately**\n \nYeah nothing groundbreaking about this tale, but I figured someone would get a chuckle out of it. \n\nTLDR: User's outlook won't open, so she says her computer needs anger management.\n\nNote: please let me know if the formatting is right on this post. I usually post on my cell phone not on desktop. (been a while I know...)",
        "created_utc": 1518017367,
        "upvote_ratio": ""
    },
    {
        "title": "User has rejected resolution: \"Still the same error\"",
        "author": "fermatagirl",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vwu7z/user_has_rejected_resolution_still_the_same_error/",
        "text": "Hi TFTS! LTL, FTP here. Hardly anything TFTS-worthy happens at my job, so I'm pleased to be able to share this little nugget that I was just reminded of. Sorry if this is long, there's a TL;DR at the bottom. \n\n*Background:* My company sells a SaaS product (software as a service), and we're very developer-oriented. As a result, in addition to the software team that makes the product, we have a decently-sized team of developers who write all the automation for the sales-management, ordering, and billing systems, as well as integration between them and the product. I am on that team. \n\nWe're not operational IT, so we never have to deal with the \"my computer won't turn on, it just says 'No Signal' and turns off again\" type of users. However, as in all things, Rule 0 still applies. \n\n*The Story*\n\nI had been fiddling with some code on the sales management system which would throw an error if the sales person tried to renew a contract (referred to as \"Opportunities\") that was different from the original Opportunity without having the customer sign off on the changes. Basically, it looks at the Opp being closed and, if there's no customer sign-off, gets the original Opp and compares 9-10 fields against the new Opp. If at least one of them has changed, it throws the error. Simple, right?\n\nOf course not. One of the fields that was looked at was \"Fallout Units\", i.e., how many units were removed from the contract. In this case, there were no Fallout Units on the renewing Opp, however, the *original* Opp had 2 units removed between the initial sale and signing, so it had Fallout Units: 2.\n\nThe ticket popped up in the queue from our branch in the Netherlands, and I recognized the error immediately (having written it) and quickly sussed out where I went wrong. I fixed it and had the fix put into production within 2 hours of receiving the ticket. I then set the ticket as \"Resolved\" with a quick explanation of what had gone wrong for posterity, requesting that the user let me know if anything else went wrong.\n\nThe next morning, a rejection of my resolution greeted me, followed by this email (only names/numbers edited for vagueness):\n\n**RE: Case 123456:\"Not able to auto-renew opportunity\" Resolved** \n\n&gt; Hi Fermatagirl,\n\n&gt; This is not resolved. Still the same error.\n\n&gt; What do you mean with “Updated trigger to account for fallout units.” ?\n\n&gt; There are no fall-outs, this is a straight forward auto-renewal. \n\n\n\nNormally I'll have the user send me a screenshot of the error, to verify that it's really the same error and not a completely different error that just happens to have the same red font. This is a frequent occurrence - users don't actually read the red font, just note that it's there and assume it's the same error. \n\nHowever, I had been having problems with this code for the past week. I immediately began doubting my fix. Maybe my s#!t was more broken that I had thought. If this hadn't fixed the problem I was stumped. \n\nRather than wait for a user in a different time-zone to get my new email and email me back the screenshot (leaving my embarrassing broken code in the system for another 24 hours), I decided to check the error myself. \n\nNervously, I opened up the Opportunity, filled in all the fields from the screenshot the user had sent me, and tried to close it.\n\nIt closed immediately. \n\n:[ \n\nTL;DR: I don't understand your solution, so it must not have fixed the problem. Why should I check to see if it works? Fix it!",
        "created_utc": 1518017367,
        "upvote_ratio": ""
    },
    {
        "title": "Weight mismanagement",
        "author": "Glasofruix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vvrs3/weight_mismanagement/",
        "text": "Hey there, it's snowing and there are no clients calling so i can share a small story with you, my first.    \n\nA bit of context. I work for a small support company. We do pretty much everything tech support related for professionnal clients (hospitals, lawyers, water treatement plants etc...). Troublesome printers? That's us. You want to overhaul your entire network? That's us too.    \n\nWe have one client who's specialized in truck weighting. They sell their \"all in one solution\" with all the bells and whistles, from preparing the ground to weighting software and equipement. They have a **very** creative way of thinking when it comes to the actual terminals. Each and every one is built with whatever they have on hand, cabled in serial with homemade connectors and there's at leas three different software solutions in the wild (that i know of).   \nAbout a year ago their IT guy retired and they've decided to outsource the support to us. They still have some dude inhouse who's supposed to develop their software (with microsoft access) but when it comes to everything else computer related they dump it on us and bill their customers later.    \n\nSo, about two weeks ago i get a call from their boss (a guy who's quite good with his hands when it comes to building stuff but with the managerial skills of a 5 years old and the spirit of a snake oil salesman). I'll be $me, the boss will be $boss and his \"tech guy\" will be $techguy and the dev is $dev.    \n\nPhone ringing:  \n&gt;$me: you've reached tech support, how may i help you?  \n&gt;$boss: Hey, this is boss from weighting company, one of my guys is going to install a terminal tommorrow and he's got some troubles setting it up and testing it, do you mind giving him a call and walk him through the setup?  \n&gt;$me: Sure not at all *why the heck are you testing it the day before you're supposed to deliver it?*    \n\nSo i call the $techguy:  \n&gt;$techguy: Hey, i'm trying to connect the terminal to a pc but it's not working  \n&gt;$me: Let's take a look, can you give me access to the terminal so i can see if i can connect it from here?  \n&gt;$techguy: Well, it's not connected to a network  \n&gt;$techguy: see, we just connect the pc inside the terminal to this hub thingy and we connect the other pc to it directly  \n&gt;$me: *Hub thingy? Switch. Duh, not going to work* Aaaaaalright, can you explain me what you are trying to do?  \n&gt;$techguy: Sure. I just click on this icon here that says \"my pc\" and then network and a click on the second pc, but i can't see it here but it usually works i don't understand.  \n&gt;$me: When you say \"it usually works\" is it connected to a network maybe?  \n&gt;$techguy: Yeah, but this client doesn't need those two PCs connected to their network.    \n\nTurns out, his software is just an access form running on the terminal and the db on another PC and he's trying to connect the two together via windows' network discovery feature, which would not work with just a switch and both pcs in DHCP. I headdesk and prepare for the worse. Curiously he managed to configure the static IPs just fine.    \n\n&gt;$me: Okay, now please open the explorer  \n&gt;$techguy: The what now? Internet explorer you mean?  \n&gt;$me: *oh boy...* No the \"program\" *at this point i'm physically making air quotes* where you usually see your hard drives  \n&gt;$techguy: *pretty sure i'm hearing crickets* Huh?  \n&gt;$me: Please double click on the \"my pc\" icon  \n&gt;$techguy: Oh okay, done, what now?  \n&gt;$me: in the address bar above please type...  \n&gt;$techguy: The. addres. bar?  \n&gt;$me: Yes, the white line on top of the screen which contains the file path usually it says \"this pc\" followed by the name of the directory you're in  \n&gt;$techguy: It's not there  \n&gt;$me: *ah, the i'm looking in the middle of the screen and there's nothing around that part case then* Can you look on the top left par of the screen and tell me what you see?  \n&gt;$techguy: Uh, \"quick access\" and a bunch of files  \n&gt;$me: *Thinking, pretty sure they get hight on solder fumes there* No above that  \n&gt;$techguy: There's nothing there  \n&gt;$me: *please kill me now* Not even \"file\", \"computer\" etc...?  \n&gt;$techguy: OH! You mean way up there?  \n&gt;$me: Yes, and just below you should see arrows, when the arrows end you should see the address bar.  \n&gt;$techguy: Uh, i'm not seeing anything  \n&gt;$me: It's just right after the up arrow...  \n&gt;$techguy: Oh you mean the empty bar that says \"PC\" in it?  \n&gt;$me: Yes, the address bar    \n\nI've managed to test the connection between the PCs but he couldn't map the network drive no matter the instructions i gave him, at this point it's been 50 minutes since the start of the call. Luckily one of my coworkers was 5 minutes from his location and drove there. It took him 20 seconds to map the drive.  \n\nThe next day the dev called me, he was putting the thing in production and they've lost the connection to the drive we mapped previously. Turns out the $techguy didn't like the IPs i used and tried to change them himself.",
        "created_utc": 1518006745,
        "upvote_ratio": ""
    },
    {
        "title": "IT Support - Current record holder for worst ticket of 2018",
        "author": "DrPeirson",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vvpj8/it_support_current_record_holder_for_worst_ticket/",
        "text": "[removed]",
        "created_utc": 1518005959,
        "upvote_ratio": ""
    },
    {
        "title": "Right Password, Wrong Account",
        "author": "WSilence",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vur3j/right_password_wrong_account/",
        "text": "So I'm gonna start off by saying I'm not tech support. I'm one of those guys everyone somehow knows can fix computers. To be fair it's my own fault, but still. In any case a lot of people at work ask me to work on their laptops, phones, etc. I don't mind and for the more difficult stuff (hardware repairs) I **do** charge. The cost of the part, plus shipping. As well as a bit for my time and sanity. I still charge less then taking it in to a shop though. I know these people after all.  \nRecently I got a request from one of my coworkers to repair his laptop. Apparently his youngest son had knocked it off the table and busted the screen. Well at this point I already knew this was going to a bit of a PITA. I knew from replacing my own laptop display that I was likely going to have to gut most of the laptop to fix it. Anyways I agree to do it, but not until I'm paid upfront for the cost of the part. He agrees, I shop for prices, I quote him the cheapest I could find, and all that good stuff. I get the laptop and I get the part. Well since I knew it was going to be a bit of a pain to fix I decided to hold off on fixing it till the weekend. While I'm telling this he asks me if I could update his PC to Windows 10 as well (it was running Windows 8). I get a lot of requests like that so I figured ya sure. I told him that I was going to need the password and what not if he wanted me to set it back for him though. I only wanted it to see what all he had installed so I could reinstall everything after I was finished with the upgrade. That and file back up.  \nThe screen repair goes by without too much issue. I **did** have to tear it back down to double check the cables when the screen didn't light up. I didn't fully secure the display cable....  \nThen came the time to *upgrade* to Windows 10. So I went to log into the PC. Well the password didn't work. Then I recalled he had said that it may not be right and to try swapping things. The password he had gave me was &lt;Lastname&gt;&lt;firstnamE&gt;. So I tried &lt;Firstname&gt;&lt;lastnamE&gt;. That didn't work either. So I called him.\n\n&gt;Me: Hey man that password you gave me didn't work.  \n&gt;Coworker: You mean &lt;Lastname&gt;&lt;firstnamE&gt;?  \n&gt;Me: Yeah. I tried &lt;Firstname&gt;&lt;lastnamE&gt; too. Didn't work either.  \n&gt;Coworker: Hmm... Man I dunno then. Did you try &lt;firstnamE&gt;&lt;Lastname&gt; or &lt;lastnamE&gt;&lt;Firstname&gt;?  \n&gt;Me: Um... Nope. Let me try.  \n\nWe went at it like that for awhile with no luck. Then I hit upon an idea. I asked if anyone else had been using the laptop. He told me he'd been letting his older son use it for school. So i had him asked if his son had done anything to it. At this point I was thinking maybe his son had reset the password. I was wrong. Turns out his son had set up a second account on the laptop without telling his (less then tech-savvy) Dad. I was trying to log into it instead. For reasons I couldn't comprehend I was unable to figure out how to log into the other account either. I'm not a fan of Windows 10. I try to use it little as possible. I jumped ship to Linux in the dying days of Windows 7. Sue me.  \nI solved the issue by going in with a Live ISO. Copied his files to another USB drive. Then I ran the Windows installer, set up the account and called it good. I installed the handful of apps he remembered he had on it, moved the files back over, and returned it.",
        "created_utc": 1517992798,
        "upvote_ratio": ""
    },
    {
        "title": "Too start with the basics you must first be taught them",
        "author": "Pwner_Guy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vttg3/too_start_with_the_basics_you_must_first_be/",
        "text": "Well; ftp stl\n\n\nNot too sure if this is the correct sub for this or not but what the hell.\n\nThis short story involves Me: Me, my service manager: Serv and my now apprentice/fuckin' new guy: FNG.\n\nA bit of back story, I work as licensed Red Seal Automotive Technician. Been in the trade about a decade now, been working my entire career for a smaller independent car dealer of a major brand.\n\n\nOur tale begins as most do at the time, regretting cutting down on my coffee intake. I was body deep in a minivan doing some recall work, one where the book says 3 hours but if I follow their instructions I'll be 6 hours.  While I am doing this, FNG has brought a truck in, I notice primarily because the bay door opened and shot cold air directly up my pant leg... I don't pay much mind to him.\n\nUntil that is about 40 minutes later as the truck hasn't moved or been setup on the hoist and both doors are open. I'd just finished up with my recall, early yay, so I decided to go check and see if he needed a hand with anything.  I find wiring diagrams printed out, door panels off and him just not looking happy. So I ask what the problem is, get told the passenger window won't operate at all up or down from any switch. We take a moment and I have him run through his checks so far, sometimes a second look can catch something missed on the first go around.\n\nSo it all looks good wiring side, ok. Next step we'll check the window motor operation, he's looking at the repair manual and getting concerned as it wants you to pull the window out then remove the regulator with the motor to bench test. I calm him, classic motto, work smarter not harder. I grab a battery and make up some test leads, we hook it up in vehicle. \n\nNow I'm starting to get concerned because the motor is working fine, with direct 12V applied up/down 100%. No noise, no dragging, works like new. Well the only thing left would be the Master Switch assembly on the drivers side, it supplies the ground circuit. If it's failed that would be the first one I've seen not from customer abuse and at around 30,000km this it's extremely unlikely.\n\nSo I pick up the Master Switch which was disconnected and on the drivers seat when I arrived. With one look I shake my head. I tell FNG to plug the motor and passenger switch in I'm gonna try something.  So I hook up the Master Swtich, press the window lock button which goes down a few millimeters and pops up a little higher than it was, now showing an orange line instead of just the grey plastic it was showing before. I proceed to turn the ignition to the Key ON Engine OFF position and operate the the passenger window from the Master and passenger switches.\n\nAs FNG shouts out in agony I informed him that all our vehicles have that function and that the first thing to check in the future is that button. I leave him to reassembly as I go chat with Serv and inform him of the \"repair\". \n\nFound out later that it was Serv's buddies truck. He totally forgot about that function, been away from working in the back for quite a few years now. So we cooked up some bullshit so warranty would pay.\n\nIn the end it was a good learning experience for FNG as he's not the most comfortable with wiring issues, but he's learning. And now he knows another useful trick in the diagnostic tool bag.\n\n\nEven better not a day later we had a customer come in with a year older truck for the same issue. Didn't even pull it into the shop, went out saw the button pressed, showed the customer, made him happy, sent him on his way with no charge and a bit more knowledge.\n\nTLDR: If you're still learning the product, sometimes user ignorance will make you think there is a legitimate issue.\n\n\nUpdate1; Spelling/Grammar\n\nUpdate2; Clarified switch position",
        "created_utc": 1517980438,
        "upvote_ratio": ""
    },
    {
        "title": "We got any computer geniuses on here? Let's see if you can answer this for me",
        "author": "mcmz12",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vs4yw/we_got_any_computer_geniuses_on_here_lets_see_if/",
        "text": "[removed]",
        "created_utc": 1517963856,
        "upvote_ratio": ""
    },
    {
        "title": "I don't remember my passcode",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vrw51/i_dont_remember_my_passcode/",
        "text": "We have company issued iPhone or Android devices which can be used pretty freely.  We do have remote access software and ways to wipe phones, etc.; standard stuff any corporate device has.\n\nUser decided to download and install their own encryption software on their device.  Now their device is locked by said encryption software and they don't know their passcode.  They are furious at the Help Desk for not knowing how to get the device unlocked and not knowing a passcode they set up for encryption software not officially supported or even prescribed by the Help Desk.\n\nIt is currently on 9/10 attempts before it wipes the device.  User is furious; I heard the recording.  Shouting all kinds of profanity at the hapless Help Desk technician.  User has stated they do not remember their passcode yet it's somehow Help Desk's fault.",
        "created_utc": 1517961698,
        "upvote_ratio": ""
    },
    {
        "title": "\"That's an ad...\"",
        "author": "TheAwesomeMutant",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vrqaf/thats_an_ad/",
        "text": "[removed]",
        "created_utc": 1517960209,
        "upvote_ratio": ""
    },
    {
        "title": "One rule for the management, another for the rest...",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vrk4m/one_rule_for_the_management_another_for_the_rest/",
        "text": "So, last October I was asked to submit a budget for hardware replacements on our expired kit. We keep laptops for 5 years and desktops for 6. I know.\n\nSo, I submit a simple list from our asset register of all the kit due to expire in the next year, a simple quote from the only supplier we're allowed to use for the equivalent replacements, and wait to hear back.\n\nIn January I hear I've been given about 50% of what I \"wanted\". No, this wasn't a \"want\" list, it was a \"need\" list. No amount of explaining to my boss, or his, can get it into their heads that people need up to date machines to their jobs - after all, who does anything in their job that isn't on a computer these days?\n\nAnyway, I get on with it, and order the best kit I can for the budget. I skimp on SSD size to save a few quid, but everything else is pretty much necessary. Order arrives. I'm already rolling it out to those most in need.\n\nFinance Director comes to my desk. \"I've noticed those new laptops are going out already. What do I need to do get Richard (his 2nd in command) one of those?\"\n\n\"Er, he's got a fairly new laptop already, I seem to recall\" I say. \"I'll look it up.\"\n\n\"It's just he was in a meeting with me today, and his laptop looked awfully slow. Let's give him one of the new ones.\" says FD.\n\nI look up the asset register. \"It says here Richard's laptop is barely two years old. He's still got 3 years left on that.\"\n\n\"Oh, I'm sure you can do something. I'll leave it with you.\"\n\n\"No, unless you give me the money, I can't do anything. If he needs a new laptop, we need to CAPEX it as per the previous order.\"\n\nMaybe I shouldn't have been quite so rude to someone who makes 5 times what I do, but hey. Maybe he might now understand. After all, it's him and the other directors who created this policy, and chose not to even fund that properly. I would love to take him into the server room and show him the outrageously dated kit we run everything on. No budget to upgrade.",
        "created_utc": 1517958744,
        "upvote_ratio": ""
    },
    {
        "title": "Resistance is futile",
        "author": "VinDaGOAT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vr0a2/resistance_is_futile/",
        "text": "As a Domain Admin for my organization, my job is to oversee the account creation process. Like most admins, I script out this process because its tedious and repetitive. So users submit a form and a data sheet to HR, they key in the ID information, and whiz bang the account is created. \n\nToday I get a call from the Apps manager. She oversees the authoritative database for account creation. She also thinks her job is more important than it is. \n\n\n&gt; Her: Did you see the service request for the new interns in athletics?\n\n&gt; Me: No I did not.\n\n&gt; Her: Well the intern starts tomorrow.\n\n&gt; Me: And that means what to me?\n\n&gt; Her: Well this request was made a week ago. It should have been done by now.\n\n&gt; Me: Have the forms been submitted?\n\n&gt; Her: I don't know. The sponsor is calling me asking for the account information.\n\n&gt; Me: Until HR gets that form there is no account to give information on. But, I will find out what the hold up is.\n\nSo She gives me the service request. I make an inquiry to the Ops manager who in turn tells me the job is being handled directly by the Ops Director. I ask the Ops director who tells me the same thing I just told the Apps manager. Until the proper forms have been submitted no account will be created. \n\n\nI then call HR. They have not received an account creation request form from this department head. I return to the phone and by this time she has conferenced in the helpdesk manager. He says\n\n&gt; Him: It is probably stuck in HR. They always sit on things.\n\n&gt; Me: I called HR. They do not have the form. Has anyone asked the Dept. Head if he submitted it?\n \n&gt; Them: (in unison) NO!\n\n&gt; Me: Maybe you should start there then.\n\n10mins later I get a call from the helpdesk manager. The dept. head had not filled out the form. He is doing it now. So there you have an hour of my life that I will not get back. ",
        "created_utc": 1517954237,
        "upvote_ratio": ""
    },
    {
        "title": "I didn't want someone to trip on the cable.",
        "author": "seems_fishy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vq5dh/i_didnt_want_someone_to_trip_on_the_cable/",
        "text": "First time posting here so I'm going to keep it short. \n\nOur IT department has just taken over a new school system and we were still in the process of updating it. A couple of months after we took it over, we were sitting there at work and got a call. They said that the entire network went down. Then, they said that today was a required testing day and they had to have internet back up. So we call around to find out if the ISP is down and how much this outage has affected. It seemed to be only our Network, but it was at both schools. We checked the servers and they were all running, but they were running maxed out. It turns out that a student had unplugged a computer in their room. Then, a substitute teacher found out and didn't want anyone to trip on it, so they plugged it in to the last open port in the room..... They created a network loop that took down both schools that were connected to it on a big test day. It took us 2 hours of us trying to find where the loop was coming from an the entire time it was down until we got the network back up. The entire time it was down, we had the administration breathing down our necks because it was taking too long. ",
        "created_utc": 1517947601,
        "upvote_ratio": ""
    },
    {
        "title": "One of the many reasons why i love my job as Tech support.",
        "author": "biglink3",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vpzrb/one_of_the_many_reasons_why_i_love_my_job_as_tech/",
        "text": "I work for a Semi local computer repair shop that will sell you a custom built PC and life time labor on it. \nMy store will also service your computer if don't buy a computer from us. That being said my favorite interactions are when people have a problem i can solve in 15 mins or less. \n\nOver the course of my time working here i have had two gentleman that had a child just pass and they could not access their laptop for school and such. I would check to see if they could prove that the laptop did in fact belong to them. Each time the users last name matched the clients name. \n\n  Its moments like these that i love.  Knowing that i can use my powers for good. I took their pc and quickly got the password removed and gave them back their laptop, and to them good luck. The first gentleman i interacted with with was a burly biker like person. When i signed in front of him to show him that is it accessible, he just started crying in front of me. It sucks because there is really nothing you can say at a moment like these but i was just glad to help.\n\n They both insisted on paying but denied them twice and suggested they let my managers know that they liked my service.  One would not let me go without paying me.\n       \nThis is why i fell in love with tech support, i love helping people and watching them go from being scared because they think there is something wrong to it being okay really quick.\n    \nI like to think i am computer doctor who saves peoples lives/job/memories sometimes.",
        "created_utc": 1517946356,
        "upvote_ratio": ""
    },
    {
        "title": "Your going to refuse to do this!?! Just because its not in the contract!!!",
        "author": "nagol93",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vpxri/your_going_to_refuse_to_do_this_just_because_its/",
        "text": "My company has this one client who *loves* to cheep out on everything, including support contracts. Here is a short story I had with our main PoC via email. Disclaimer: Im paraphrasing, so this stuff isnt necessarily word for word, but you should get the idea. \n\nPoC: \"Hay, Im having issues with my smart phone. Can you look at it?\"\n\nMe: \"Sorry, but thats an unsupported device. I can get in contact with sales for a work-quote if youd like\"\n\nPoC: \"No! No need to get sales involved. I just need you to fix this small thing real quick\" (after 2 years working with these people, there is never a \"small\" thing)\n\nMe: \"We cant do that. Your contract dosnt include phone support.\"\n\nPoC: \"Your going to REFUSE to do this!!??! Just because its not in the contract!?!? Unbelievable. Do I need to get &lt;CEO/Owner&gt; involved?\" (that was word for word)\n\nMe (internally): \"umm.... ya, im going to refuse to do this. Thats kinda the point of a contract\"\n\nMe (externally): \"Yes, please let &lt;CEO/Owner man&gt; know that you are in need of phone support. I will have our sales department reach out to him as well\"\n\nAlso yes, this was made clear to them multiple times that their contract dosnt include phones, of any kind. They are fully aware of this. (aka, its not a \"in the fine print\" kind of thing)",
        "created_utc": 1517945925,
        "upvote_ratio": ""
    },
    {
        "title": "If it looks like your internet, acts like your internet...it's probably your internet.",
        "author": "QuantumDrej",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vpjff/if_it_looks_like_your_internet_acts_like_your/",
        "text": "[removed]",
        "created_utc": 1517942813,
        "upvote_ratio": ""
    },
    {
        "title": "When company policy does not make sense...",
        "author": "schatzi_sugoi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7voxbc/when_company_policy_does_not_make_sense/",
        "text": "Hey, everyone. I'm new here. I'm on mobile so please forgive me for formatting issue. I'm also the user in this situation but I also work in tech so I hope it fits.\n\nA brief background, I'm a software consultant for a fairly well known IT services company.\n\nLet's introduce our main players in the story:\n$Me: Software consultant handling several accounts.\n\n$Customer: My main client. We have a fairly good working relationship.\n\n$TS1: Email support tech 1. Loves company policy.\n\n$TS2: Email support tech 2. Actually knows what he's doing.\n\nNow that's out of the way, let's begin.\n\nI'm minding my own business, working on some development stuff. It's a weirdly light day. Not a lot of emails from my customers.\n\n$Customer: Hey, schatzi_sugoi. Is everything okay?\n\n$Me: Yeah. I'm working on the stuff you asked me to do. Why do you ask?\n\n$Customer: Well, I have sent you a bunch of emails and the business users have too. But you haven't replied to any of them.\n\n$Me: Huh... that's strange. I haven't received any.\n\nI try refreshing my email client a few times and tried the web version. No new emails from them but new ones from within the org. I let customer know that they should email me on the customer-provided email address until I can sort this issue out.\n\nI now raise ticket with email support.\n$TS1: Hi, how may I help you?\n\n$Me: Hi, I can't receive customer emails in my account.\n\nNow at this point, I should tell you that we have two email domains because of recent changes in our company. Our mailbox is on our old domain but when we email clients, it is masked to look like we're sending from the new domain.\n\nAfter some back and forth with TS1 about the details of the issue.\n\n$TS1: Do you know what domain your customer cannot reach you at?\n\n$Me: The new one.\n\n$TS1: Upon checking, company policy states that we are not allowed to receive external mail on that domain.\n\n$Me: That's not right. I was able to receive mails from customers this morning. Did company policy change in the last hour?\n\n$TS1: No, that's company policy.\n\n$Me: We're a consulting company. Our main form of communication with customers is via email. That cannot possibly be company policy.\n\n$TS1: I don't know what to tell you. It's company policy. Can you share your screen so I can check the details of this issue?\n\n$Me: You don't need to see my screen to understand the problem. I won't be able to demonstrate to you how my customer sends me an email and I don't receive it. If it's not allowed to send an email to that domain, shouldn't the customer receive an error message?\n\n$TS1: Yes.\n\n$Me: They didn't get one. That's why they thought I received the message but was not replying. Can you escalate this to a more senior resource?\n\n$TS1: Please ask your client to email you on the old domain. \n\n$Me: But when I email them from the old domain, it's masked to look like it's coming from the new domain, right? So when they hit reply, they'll send it to the new domain. \n\n$TS1: It's company policy that we don't receive external mail on that address. Do you have any other issue?\n\n$Me: No, this is my only issue and this is not resolved. Please escalate to a senior resource.\n\nTS1 proceeds to close the ticket with a resolved status. Annoyed, I opened a new chat window.\n\n$TS2: Hi, how may I help you?\n\n$Me: Hi, I can't receive customer emails in my account. Your colleague told me we can't receive external emails on the new domain due to company policy. That doesn't seem right.\n\n$TS2: There's an outage right now with the new domain. We are trying to get it fixed as soon as possible. In the meantime, I'll open a ticket for you so you can be updated once the issue has been resolved.\n\n$Me: Ahh. Okay. Keep me updated then. Thanks!\n\nI sent an email to TS1's manager and asked them to investigate this issue since they were giving me false information about company policy.\n\nI haven't heard back from them but I plan on following up with them in a few days.\n\nTL;DR: When company policy doesn't make sense, it could be because it was made up.",
        "created_utc": 1517937984,
        "upvote_ratio": ""
    },
    {
        "title": "Google is calling...",
        "author": "BigAssPuppies",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vouto/google_is_calling/",
        "text": "[removed]",
        "created_utc": 1517937435,
        "upvote_ratio": ""
    },
    {
        "title": "Banana",
        "author": "LakesideMiners",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vn21m/banana/",
        "text": "[removed]",
        "created_utc": 1517920845,
        "upvote_ratio": ""
    },
    {
        "title": "Factory reset",
        "author": "nik_drake",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vlx11/factory_reset/",
        "text": "I work an escalation line for a residental ISP and this was my last call of this particular night.\n\n&gt;me: How may I help\n\n&gt;guy:  I can’t connect to the internet.  I’m the roommate of the account holder.\n\n*I pull up the account.  It has a modem/router supplied by us.  I have basic access tools on my end, but do not have full remote access to the router gui*\n\n&gt;me: What happens when you try going online?\n\n&gt;guy:  I can’t. I just need you to let me into the admin again.  My computer is telling me connected unsecure.  I was just trying to bridge port 80.  You can undo that from where you are?\n\n&gt;me:  Nope.  This next step I need you to do from your end.  You are going to need a piece of a paper clip to factory reset.\n\n&gt;guy: Is this going to wipe out everything?  \n\n&gt;me:  Yes this is the troubleshooting step that I have.\n\n&gt;guy: So I’ll lose everything.  Can’t you just give me admin access back.  I just need to undo what I just did.  I was trying to bridge port 80 to get my server to work.\n\n&gt;me:  Nope, can’t do it.  You can’t access admin, we need to go back to factory.\n\n*he starts following instructions and my end of shift muddled brain just realized what he said*\n\n&gt;me:  Just so you are aware, running servers is against our residential terms of service.  If you want to run a server, you need to consider business services.\n\n&gt;guy: Well glad it didn’t work, but even for an interal one for a school project?\n\n*I read off the terms of service that I just pulled up*\n\n&gt;me: Based on this wording, if it is in a grey area, I just wouldn’t do it.\n\n&gt;guy:  Why then did you let it have ddns?\n\n&gt;me: I can give you our dns setting if you need those, but not anything with ddns.\n\n&gt;guy:  I don’t need those.  Why do you allow ddns and not allow servers?  That is the only use for it.\n\n&gt;me:  There could be other uses for it.  Also these modems might be used by our business team; I don’t know.  Regardless this is generic firmware set by the manufacture and later approved by us.  We didn’t include the function, they did.\n\n&gt;guy:  Okay well then what about #competitorA and #competitorB, would it be against their rules?\n\n&gt;me:  I don’t know.  You would have to read their terms of service.  Look what I am saying is I cannot condone you running a server off our system.  It is not designed for it, and we won’t help you if you screw up or need assistance.  Also there is a possiblity our secruity team will catch it.\n\n&gt;guy:  So what do other people who run servers do?\n\n&gt;me:  My experience is most people just do it anyway and ask questions later.\n\n&gt;guy:  It’s still not connecting on my computer.\n\n&gt;me:  Did you change anything with this computer’s configuration like static the ip?\n\n&gt;guy: No I have just been working with rasberry pi (*note he lists a few other devices in his physical setup that I didn’t catch*)\n\n&gt;me: Try connecting on the wifi with another device.  If you need the default network names and passkey or passphrase they are on the bottom of the modem.  It will say network name and just below it will be the password.\n\n&gt;guy:  It’s not working.  It’s telling me wrong password\n\n&gt;me:  Oh I forgot to mention it is case sensitive.\n\n&gt;guy: I typed it in all capitals.\n\n&gt;me:  What are you using for the password maybe you just mistyped something.\n\n&gt;guy:  Yeah the password is w p a slash w p a 2 p i n\n\n&gt;me:  That’s not the password.  Next line down the preshared key.  Type what is after the word key.\n\n&gt;guy:  It’s working on the wifi now for both this computer and my other one now.  I don’t know why the hardwire wasn’t working.\n\n&gt;me:  well you should have admin access now.  Have a good night.\n\nTL:DR-  Computer science major proves why they need to be restricted to a sandbox until they are at least a junior or can demenstrate they won’t break the internet.  \n\nEdit: formatting error",
        "created_utc": 1517904558,
        "upvote_ratio": ""
    },
    {
        "title": "Just found the thread and thought I’d Share 2",
        "author": "HookDragger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vkwnn/just_found_the_thread_and_thought_id_share_2/",
        "text": "All this takes place in Late 90s, rural area computer store. \n\n1. Long Story: Computer comes in for repair...   complaint of “it won’t run do more than 20mins”\n\nPut the box on the bench... notice a distinct tobacco smell and boot the box.  Sure enough, stats up fine and sure enough... right around twenty mins everything crashes. \n\nI ask the person who took in the box where it came from.  They respond “grain elevator”.  I just shake my head and go to the back of the store taking a can of compressed air with me. \n\nI go out back and pop the lid on the computer. \n\nA fine grey dust has settled on the motherboard, cpu(386dx), ram(32pin simm), etc so thick the small fan was clogged and the board is just this amorphous dust landscape. \n\nI wind up using that whole can and half of another cleaning the computer of dust and debris.  I then gave the case a good swab down of  alcohol wipes restoring it to its original beige where the monitor stand didn’t block the tar. \n\nSure enough I boot it up and everything runs perfectly for 2 hours. \n\nCall the guy up and this gravel-voiced lady answers the phone... she says in a voice that would strip paint “thanks sweetly!”\n\nI showered long and hard that night. \n\n2.  Short one:  lady complains that her computer keeps crashing and her files are messed up.\n\nI walk in to her office and her computer is COVERED in refrigerator magnets.\n\nI tell her to take them off. \n\nComputer starts working perfectly.  ",
        "created_utc": 1517891613,
        "upvote_ratio": ""
    },
    {
        "title": "Cruel ChatBot Hides Son from Mother (xpost /r/JUSTNOMIL)",
        "author": "La_Onomatopoeia",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vkrow/cruel_chatbot_hides_son_from_mother_xpost/",
        "text": "[removed]",
        "created_utc": 1517890112,
        "upvote_ratio": ""
    },
    {
        "title": "\"I have a degree\"",
        "author": "K1yco",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vkihg/i_have_a_degree/",
        "text": "Hello, been reading a few stories and wanted to share.\n\nI work tech support for a small PC company. A customer ($Cu) purchased a new PC from us and was having issues powering it up. He calls in and I answered to help.\n\n&gt;$me:Thank you for calling. How may I help you?  \n&gt;$Cu: Yes, I bought one of your PCs and it's not doing anything.  \n&gt;$me: How do you mean? Is it not getting a display or is there no power to the system?  \n&gt;$Cu: It's not powering on. I have tried everything.  \n&gt;$me: Did you try a different outlet? Different power cable?  \n&gt;$Cu: Yes. I've tried everything.  \n&gt;$me: Is the I/0 set to I?  \n&gt;$Cu: Listen, I have a degree in computer science and have been doing this for 30 years. The problem is the computer is not working.  \n\n\nAfter this, I figured I'd ask one more question that I feel I should have asked it in the beginning.\n\n&gt;$me: Have you pressed the power button on the front of the PC?  \n&gt;$Cu: (silence as I hear the PC power on) I'm sorry for calling.",
        "created_utc": 1517887428,
        "upvote_ratio": ""
    },
    {
        "title": "The Email That Broke The Company",
        "author": "francehopper",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vk0ca/the_email_that_broke_the_company/",
        "text": "[removed]",
        "created_utc": 1517882452,
        "upvote_ratio": ""
    },
    {
        "title": "Broken charging port",
        "author": "jacesonn",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7viq7u/broken_charging_port/",
        "text": "A bit of background before the story: during my senior year of high school, I worked in the IT department as part of a work based learning class. The job was to fix laptops, desktops, iPads, basically anything that showed up at the door for the whole school system. One day, I walk in the door, drop my pack, and grab a laptop off the shelf.\n\n\nThe ticket says \"broken charging port\" so I turn it over, look at the port, and sure enough, the plastic bit inside is gone and the pins are bent every which way. After I remove the battery and open the back, I'm treated with something quite beautiful. I unscrew the bottom half of hinge to get to the port and it completely comes out of the laptop, separating from the back plate. Oh great.\n\n\nFlip the laptop over and open it up to see that the screen bezel is popped out. I think that's kind of weird so I open it up and almost all the tabs are broken off and both hinges are snapped off just under the screen. I take the hinges off and attempt to screw the new ones in when I notice a new problem: the back plate is cracked all the way across the hinges. \n\n\nI brace myself to do the worst repair possible on these god forbidden laptops: back plate replacement. I spend the next hour and a half replacing that and rewiring it, thinking it's all over. As I finish that and replace the bezel and charging port, I screw the hinges into the palm rest and I'm warmly greeted by my next menace.\n\n\nthe right side hinge won't screw in.\n\n\nThe plastic is broken.\n\n\nI then spend another hour moving the motherboard, hard drive, speakers, etc over to the new palm rest. I open up the keyboard lattice, which falls out and needs to be replaced as well, to remove the keyboard to find that half the keys are falling apart.\n\n\nI spend another half hour putting it back together and I tally up the repairs:\n\nCharging port: $15.  \nKeyboard lattice: $5.  \nScreen bezel: $15.  \nBack plate: $55.  \nPalm rest: $35.  \nHinges: $25.  \nKeyboard: $25.  \nTotal: $175\n\n\nTldr; some kid out there doesn't know how to handle a laptop and I ended up spending 4 hours fixing a charging port.",
        "created_utc": 1517870810,
        "upvote_ratio": ""
    },
    {
        "title": "Password has too few characters.",
        "author": "Yosoff",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vhwpd/password_has_too_few_characters/",
        "text": "This story is from many years ago, however; I can easily imagine it still happening to people today.\n\nLike any normal corporation we had password complexity rules.  For the sake of simplicity, let's say it was eight characters and mixed case.  One user wanted to set a nine character password but they kept getting an error that they had too few characters.\n\nWhen talking to them on the phone it's hard to tell in what way they are screwing something this simple up.  We weren't supposed to ask the user their password, so our options were rather limited.  We listened as they put in their old password and entered their new password.  They called out each time they pressed a character and they did indeed type nine characters.  Was their keyboard failing?  Was one of their keys bad and not registering?  This warranted a desk visit.\n\nSo we went over and watched the user change their password.\n\nThe nine characters they typed: P a s s Backspace w o r d\n",
        "created_utc": 1517864187,
        "upvote_ratio": ""
    },
    {
        "title": "I broke all the phones.",
        "author": "ryankrage77",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vhthh/i_broke_all_the_phones/",
        "text": "TL;DR: I try and change my phone settings, and block all calls to IT.\n\nI do tech support at a university. The usual mix of ticket system and answering calls. Today is about the calls.\n\nMid afternoon, I decided I should see if I have any redundant buttons on my phone &amp; unmap them. I clumsily navigate through the phone menu, checking what each button is set to do, and get rid of what I don't need.\n\nA few minutes later I get a direct call. I wasn't signed into the phone system, so I assume it's a misdial, or somebody got hold of my number.\n\nI answer, the person says they were told to call this number for the service desk - OK, fair enough, I shouldn't give out my direct number.\n\nThe guys computer freezes while I'm trying to start a remote session, so I ask him to call back on the service desk number when he gets it working. Weirdly, he insists he did call the service desk number, and he knows what it is before I tell him. Assuming it's a glitch or he's lying, I end the call.\n\nI then call my mobile and leave it in a call, to block any more direct calls from the guy, so he'll have to wait in the queue like everybody else.\n\nA few minutes later, a ticket comes in, and it's the same guy, saying he can't get through and just hears an empty line.\n\nI tell my manager, who checks the software that signs us in/out of the phones, and everything seems fine. He doesn't seem too concerned, so I leave the call to my mobile running, and don't worry about it.\n\nA bit later, I decide he's not calling me directly, and end the call between my work phone and mobile. Immediately, another call comes in. I let it ring until they hang up. Then another one. And another. There's nothing in the queue for everybody else this whole time.\n\nEventually there's a long enough pause that I manage to dial my mobile again, and stop the incoming calls.\n\nA few of my colleagues test the system, dialling my direct extension and the service desk extension. They call get a high-pitched whine and beeping noises, which the phones seem to do if you call an engaged number.\n\nAt this point it's fairly clear every call to IT is getting directed to me for some reason. I can't even tell my manager, as he's gone home for the day.\n\nOne of the senior analysts who's been there for a long time figures out I've somehow logged into the old queue system, which overrides the newer one. You log into that one not with software on the PC, but by dialing a number. I re-dial the number, it logs me out, and calls begin queueing again. Disaster averted.\n\nTurns out, when mapping buttons, I had accidentally pressed one mapped to the sign-in without realising. I had assumed it was just a saved number for a colleague or something.",
        "created_utc": 1517863469,
        "upvote_ratio": ""
    },
    {
        "title": "2 for 1 special!",
        "author": "I_Have_A_Chode",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vhoz2/2_for_1_special/",
        "text": "So here i am, lowly tech level I. This is about the same user who called on 2 separate occasions, its 2 for 1 because its the same user, twice.\n\nCase 1: User calls to tell me their printer isnt working, it wont turn on, they keep hitting the power button but nothing is happening.\n\nI go to check it out, aside from the issue being credential based and the thing was just in sleep mode and not off. They werent pressing the power button, but in fact the ink area release button....\n\nCase 2: Remodel is done on a communal area, user calls to tell me that the PC in the area and the mini fridge arent getting power, but that they are both plugged in. I go down to check. Well.. The computer and the fridge are in the same power strip, and that power strip is plugged into another power strip, which is in turn plugged right back into the first power strip.\n\ni hate being a tech\n",
        "created_utc": 1517862497,
        "upvote_ratio": ""
    },
    {
        "title": "My monitor is black again !",
        "author": "Skritz",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vgskl/my_monitor_is_black_again/",
        "text": "I don't work in IT but I share an office with 3 other people and I just witnessed the following scene :\n\n&amp;nbsp;\n\n**10:15:**\n\n*$Coworker* calls IT. Her screen just went \"black\". She says she's going to take a break while *$ITGuy* can check what it going on.\n\n&amp;nbsp;\n\n**10:25:**\n\n*$ITGuy* enters the office and he quickly checks the screen.\nI hear a tired sigh, then he asks me : \"Could you tell *$Coworker* that it's a good idea the check the connection ? The monitor was just unplugged\"\n\n&amp;nbsp;\n\n\n**10:40:**\n\n*$Coworker* comes back. I tell her that her screen was disconnected.\nShe answers : \"Yes, but there is really a problem with this monitor ! Each time I kick the cable, the screen goes black !\"\n\n&amp;nbsp;\n\nAfter hitting my head on the desk a few times, I felt much better and got back to my work.",
        "created_utc": 1517855395,
        "upvote_ratio": ""
    },
    {
        "title": "There are 4 plugs on the station.",
        "author": "CircuitMane",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vgnbx/there_are_4_plugs_on_the_station/",
        "text": "The scent of a Monday morning already lingered in the air. Already the board lite up with shades of red and the pointing of fingers as yet again another monster of networking reared it's ugly head and the Hunters onsite drew straws to see who would tackle the beast while slowly the village of the Helldesk support burned with countless issues and no answers.\n\nHerein we see our latest victim, softly dreaming of when he will be free of the chains of a desk and finally able to be one of the Hunters, wielding mighty server blades and strong cords of Ethernet to tackle the networking monsters instead of playing with his pony figures on the desk. Sadly the dreams would have to wait as the next burning hut cried out over the lines of support for his assistance.\n\nThe actors in this play\n$Mover: As he was recently moved to his new hut that was already on fire\n$Me: The plucky young wannabe hero with pony toys on his desk\n\n[ring ring]\n$Me: [Insert standard greeting with name and begin requesting info]\n\n$Mover: [Provides information and ticket is created]\n\n$Me: How can I help you today\n\n$Mover: My desk was moved over the weekend and now my keyboard and Monitors don't work\n\n$Me: [Grateful that it wasn't another fire call, unaware of the pain to follow] Alright, Well let's tackle this one at a time. Have you checked that it's plugged in\n\n$Mover: Yes, and it's plugged in. And I also tried another usb port\n\n$Me: Alright, have you tried pressing Caps or numlock, and checked if anything was lighting up\n\n$Mover: Yes, and nothing lights up at all\n\nSlowly our Hero let down his guard, truly it just seemed like a broken keyboard. the simpleness was refreshing and different from the morning cries of pain. How soon he came to regret this.\n\n$Me: Alright, Well let's check out the monitors then\n\n$Mover: They turn on but do not display anything and show an amber light\n\n$Me: Did you try undocking and redocking the laptop, Check all the connections, etc etc\n\n$Mover: Yes, everything is connected\n\nSuddenly the wheels turn a little, and inspiration strikes the Telephone warrior as he comes up with a genius thought\n\n$Me: Is the docking station power plugged in\n\nAnd with those words, his happiness quickly drops into a tale of madness and loss, questioning the realities of the world\n\n$Mover: The monitors are plugged in\n\n$Me: No the power cord. Do you see it\n\n$Mover: Is that the green cord?\n\n$Me: no: that's the ethernet. Okay How many cords to you have plugged in\n\n$Mover: I see four cords\n\n$Me: Okay, it sounds like you're missing the power cord. It might not have been plugged in. Can you check your power strip and tell me how many plugs are plugged in\n\n$Mover: I see 4 plugs on the docking station\n\n$Me: No, I need you to check your power strip and tell me how many plugs are there. Do you see two or three.\n\n$Mover: I see four plugs on the docking station\n\n$Me: No, check the power strip please. How many plugs do you see.\n\n$Mover: Okay, one sec\n\nThen silence with random background noise on phone... then more silence... then even more. Time passes so long that eventually the phone warrior wonders if he should abandon the quest when finally more shuffling is heard 10+ minutes later\n\n$Mover: Okay I got the power strip from my desk. There's no plugs in it\n\n$Me: Wait, it didn't have anything plugged in?\n\n$Mover: No, I pulled it out of my drawer and it didn't have any plugs\n\nIt appears the villager took his power strip from his old hut when he moved.\n\n$Me: Okay, that's not what I need you to check. Can you check under your desk please for the power strip\n\n$Mover: Okay, I'll put the strip under my desk\n\nAt that point, the phone warrior is spent and in desperate need of more coffee, booze, or both. The pain is too much and he longs for the screaming of huts burning as he finally gives in.\n\n$Me: It appears I can't help you any further. Let me get your ticket to onsite and they should be able to help more from there.\n\nAnd after ticket is sent and call ended, the phone warrior dreams once again of wishing they were not strapped to phone tech support.\n\nTL;DR: There are 4 plugs!\n\nEdit0: Sorry for any wierdness or typo's. Wrote this between calls as the fires have died down but appears to have woken many issues for a very busy day",
        "created_utc": 1517854225,
        "upvote_ratio": ""
    },
    {
        "title": "The day that email died .",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vgg8r/the_day_that_email_died/",
        "text": "[removed]",
        "created_utc": 1517852638,
        "upvote_ratio": ""
    },
    {
        "title": "I like to move it, move it...",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vfxim/i_like_to_move_it_move_it/",
        "text": "Here's one from today. User bypasses our offsite helpdesk and calls me directly. They know they're not supposed to do this, but I once spoke to her at the office Christmas party so now I'm her best IT bud.\n\nUser: \"I can't get on to my email.\"\n\nMe: \"Any error messages? What's it doing?\"\n\nUser: \"It just, won't let me on...and I can't log on to my phone.\"\n\nMe: \"Let me just check your account...nothing wrong there.\"\n\nUser: \"Can you come down? I need to get on as soon as possible?\"\n\nSo I drop the actually important stuff I'm doing and go to find her. She's not at her desk. Then, from the other side of the office, I hear a \"cooo-eee! Over here, Jeff!\"\n\nYeah. She's moved herself. Apparently the other people on her pod are all out today, so she wanted to sit near her other friends. We don't have roaming profiles. We don't have IP phones. They know they're not supposed to move.\n\nShe's managed to log in to Windows (which is a miracle, as usually they can't remember their own username) but is now stumped by an Outlook dialogue box that essentially says \"do you want to set up your email on this computer?\" I tell her to click yes, then next a couple of times. Wow! It works!\n\nNow, for the phone. She's trying to log in to the call centre skillset with her own login, on someone else's phone. She can't understand why that won't work. Where she's sitting is a different subset of the call centre, so she's going to be answering phones all day about a subject she is not trained in. Apparently this is fine, as long as she gets to sit next to her friends.\n\nDon't move yourself without telling IT, people!",
        "created_utc": 1517848480,
        "upvote_ratio": ""
    },
    {
        "title": "Tired of Weighting",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vfl4k/tired_of_weighting/",
        "text": "About 5 years ago I was working as 2nd line desktop support for a medium-sized company. Early January our 1st line tech who sits next to me gets a call:\n\nTech: \"Good morning, IT, Rich speaking, how can I help?\"\n\nUser: \"Yeah, I was wondering. Is there such a thing as mouse weights?\"\n\nTech: \"Sorry, what?\"\n\nUser: \"Mouse weights. Like, to weigh your mouse down, and make it heavier?\"\n\nTech: \"Not that I know of. Why do you ask?\"\n\nUser: \"It's a bit complicated, can you come down?\"\n\nSo the Tech grabs me and we both go down to possibly the weirdest request I've ever heard. The user explains:\n\n\"So, I got this new pen for Christmas, and it's really heavy. So, like, everytime I finish writing something and go back to using the mouse, it's too light and I end up throwing it across the desk.\"\n\nCall closure reads: \"User advised to use lighter pen.\"",
        "created_utc": 1517845600,
        "upvote_ratio": ""
    },
    {
        "title": "Sony Bravia KLV-32W672E Best settings",
        "author": "prateekverma_24",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vewi1/sony_bravia_klv32w672e_best_settings/",
        "text": "[removed]",
        "created_utc": 1517839154,
        "upvote_ratio": ""
    },
    {
        "title": "Please Don't Throw Me Into That Briar Patch.",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7veju5/please_dont_throw_me_into_that_briar_patch/",
        "text": "[removed]",
        "created_utc": 1517835165,
        "upvote_ratio": ""
    },
    {
        "title": "Fixing things the only way I know how",
        "author": "manipulated_dead",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ve940/fixing_things_the_only_way_i_know_how/",
        "text": "I've been reading TFTS for a long time now, and about a year ago posted [my first tale](https://www.reddit.com/r/talesfromtechsupport/comments/5skfud/finally_got_to_use_this_classic_trick_in_front_of/) about fixing a problem beyond my comprehension in a stupidly simple way. Here's another quick one.\n\nCONTEXT: I'm a teacher. For security purposes the staff carpark at my school has an automatic gate. To enter from the street, staff are issued with an RFID key. To leave from the carpark, there is an automatic sensor of some kind that you trigger by driving towards the gate. Pretty simple stuff.\n\n***\n\nThis afternoon I'm queuing up to leave with one car in front of me and one behind. The car in front of me approaches the gate as per usual... but nothing happens - the gate doesn't move. One very frustrated PE teacher hops out of her SUV and starts walking towards the front office to try and figure things out. \n\nI think to myself \"I've got this\", and hop out of the car saying that I'll try my key on the reader on the other side of the gate (there's another open gate for pedestrian access). With all eyes upon me I wave my RFID key in front of the reader which gives me a reassuring beep and the gate... does nothing.\n\nI think to myself \"Oh well\" and turn around to head back to the car to wait for someone else to solve this issue while I sit in air conditioned comfort.\n\nThen I see it.\n\nOn the far side of the gate.\n\nCheekily poking up out of the garden.\n\nA [switch.](https://i.imgur.com/fRUkX9s.png)\n\nI think to myself. \"Hmmm\"\n\nI reach through the bars of the gate.\n\nI turn that switch off.\n\nI turn that switch back on again.\n\nI try the RFID key.\n\nThe gate... opens.\n\nA small queue of very relieved teachers proceed to exit the school.\n\n\n\n**TL;DR** I did the thing again and it fixed something. somehow.",
        "created_utc": 1517831313,
        "upvote_ratio": ""
    },
    {
        "title": "Monday morning...",
        "author": "JuKwonJitsu",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7vdlzk/monday_morning/",
        "text": "[removed]",
        "created_utc": 1517821779,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes Clicking Is Hard",
        "author": "Vulpixie_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v8p98/sometimes_clicking_is_hard/",
        "text": "Hello all! Today my story will include $me-myself. A college CS student currently filling the role of tech support/basic ETL developer/report creator. I was hired basically be a jack of all trades to help my department in any way I could. $u-user. A woman who has worked in this department for 15 years and always resists change. Important note: my idea in this story was directly a solution to a consistent problem $u has complained about.\n\nA week ago I approached my supervisor with a proposal for a new tool that would help the department with some analytics/troubleshooting. My sup loved it and told me to go gather some user stories from the users. As I was explaining my idea, $u had some problems.\n\n$u-This seems really difficult. I don't want to waste my time  learning how to do my job over.\n\n$me-I'm glad you brought that up! This design is such that you simply have to mark this checkbox if you want the new tool (to do it's job)\n\n$u- Are you serious? That's like a whole other click I have to do\n\n$me-..... Yes. **One** more click\n\n$u-I'd rather just keep having you fix it\n\nAnd thus my tool was squashed and I fix the same problem about 3 times a week.",
        "created_utc": 1517770731,
        "upvote_ratio": ""
    },
    {
        "title": "The Saddest Little Router That Couldn't",
        "author": "Chessiecat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v6f8o/the_saddest_little_router_that_couldnt/",
        "text": "To be clear, I am not an I.T. professional, so any of this jargon which is wrong...well, forgive me.  \n\nSome years ago I was doing staff work for a small science fiction convention in a hotel in my town and we'd been having ongoing, persistent problems with the wifi in the building.  Everyone on the hotel staff knew it was a bit rubbish in most of the building, but if you were patient you might eventually load a website, so they hadn't gone to any trouble to fix the situation.  \n\nSadly, the morning the convention was set to start, the problem had become unbearable.  We were intent on running a number of events that needed *some* kind of functional internet connection, so one of the con-staff and I set out to find the source of the problem.\n\nThe first sign something was wrong was that nobody on the actual staff of the hotel seemed to *know* where the router was.  No big deal, right?  I pulled out my Nook e-reader (rooted) and loaded up a wifi signal detector app, then set to following the signal strength.  I figured, at worst, we'd find they were using multiple routers cascaded together and one or several of them them had gone wonky.  \n\nThe second strange thing happened almost immediately.  The signal rose, peaked, then sank back to almost nothing.  Rose, peaked, then sank back to almost nothing.  \n\nUnderstandably a bit perturbed, I started walking, trying to get a triangulation on where the wifi signal was strongest.  It lead me to the middle of an otherwise completely empty hallway adjoining the main con hall, with two convention halls on either side.  \n\nI went first into one room and the signal dropped.  Into the other?  Signal dropped.\n\nFinally, it occurred to both myself and the gent I was with to look up.\n\nWhatever *numpty* paid for the work to wire this hotel for Internet had used residential wifi repeaters and attached them to the walls about a foot above head height.  We had to walk through the building, systematically disabling these things one after another, then waiting for the signal to rise again to get a new directional heading.  All told, it took about thirty minutes.\n\nFinally, we ended up in a back office full of ancient hotel garbage and discovered the signal distributor, sitting under a stack of ledgers.  I've no idea how long this poor thing was back there, but it was enclosed in a metal box with a single dust-clogged fan exposed on one side.  It reminded me of a puppy who'd been kept all its life in a cage.  \n\nThe reason the signal would go in and out was that single, pathetic little fan was still gamely pulling air, spinning up enough to make the thing function, then giving out.  I've no idea what the interior looked like, but it was minutes from death.  \n\nThankfully, the guy I was following around had a temporary replacement in his truck and a number of people had cellphone hotspots they were willing to let us use for specific panels on the other end of the building, but we obviously couldn't run a con on that ridiculous daisy chain of wifi repeaters.  I've no idea why nobody had complained earlier.  It was an absurd setup.  \n\nDo not just take the lowest bidder, people!\n\n  Other people's conventions may depend on it!\n",
        "created_utc": 1517746558,
        "upvote_ratio": ""
    },
    {
        "title": "Don't test it? If you say so... Or: What it's like to be a piece on a 3d chess board. [xpost from /r/MaliciousCompliance]",
        "author": "BearerOfHonesty",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7v116b/dont_test_it_if_you_say_so_or_what_its_like_to_be/",
        "text": "",
        "created_utc": 1517746110,
        "upvote_ratio": ""
    },
    {
        "title": "Accidentally disabled a customer's email service, told him I can't support Windows XP.",
        "author": "VikeeVeekie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v68ym/accidentally_disabled_a_customers_email_service/",
        "text": "Disclaimer: I don't use Reddit all that often, so I'm trying to get the formatting to acceptable levels. sorry for that.\n\n&amp;nbsp;\n\nThis is a story that took place a few months ago, and it was actually quite embarrassing on my end. To set the scene, up until last Friday I had my internship at a company that manages the infrastructure at smaller companies who don't have their own IT management employees on site. \n\n&amp;nbsp;\n\nNow this part of the story is important. Somewhere in December or November one of the website hosters would cease to support PHP 5.X (I forgot which one exactly), so I was tasked to change the active version to 5.5 and check back for any errors. I changed all the affected domains and I didn't get any errors back.\n\n&amp;nbsp;\n\nNow to the actual story, which took place about three weeks after I changed the PHP versions. Old man will be $OM, the IT manager of the customer will be $ITM, coworker nearby me back then is $CW and we have $ME.\n\nThat day I was working with $CW to help him prep some machines, and the phone rang. $CW asked me to take the call so I did.\n\n&amp;nbsp;\n\n&gt;$OM: Yes, hello. I don't have internet.\n\n&gt;$ME: Alright, let's evaluate what is working and what is not. Can you access Google, and what appears not to be working?\n\n&gt;$OM  Okay, I'll try. Google is working, but I'm not getting any e-mails.\n\n&gt;$ME  Judging by this information, it seems you do have a working internet connection. Can I see what's going on with Teamviewer?\n\n&amp;nbsp;\n\nThe man provides me the session ID, and once the session loaded I was greeted with the glorious blue Fisherprice OS taskbar. I was absolutely speechless for a few seconds, I looked at $CW with a really confused look and pointed at the monitor followed by him silently grinning.\n&amp;nbsp;\n\n&gt;$ME: You are aware that you are running Windows XP, right? This is an OS with support ceased since 2014, and I can't support this.\" Looking at $CW for confirmation as I said that, who nodded yes.\n\n&gt;$OM *in disgruntled tone*: Yes, I'm aware. I'm going to retire soon however and close down the company in two years so I'm not going to invest 10,000 EUR in new software.\n\n&gt;$ME: I can understand that, but unfortunately I cannot help you with this. The odds are likely that your mail provider stopped supporting your email client running on this platform, so in this case I can't do anything.\n\n&gt;$OM: Then I'm afraid I'll have to end our business relationship. Usually $ITM helps me out here and he never had a problem.\n\n&gt;$ME:  Okay I'll get you in touch with him, one moment.\n\n&amp;nbsp;\n\nBefore the guy could finish his sentence, I already rammed the transfer softkey on my extension and dialed $ITM's number.\n\n&amp;nbsp;\n\n&gt;$ME: Hey, I've got $OM from X company on the line here and this guy is still running Windows XP, can you for the love of God talk some sense into him?\n\n&gt;$ITM: Okay, sure.\n\n&amp;nbsp;\n\nOnce again I hit the transfer softkey, and threw the receiver back on the handset loudly exclaiming \"what the fuck\", with $CW loudly laughing. I continued my work, and occasionally glanced over at the extension's attendant console to see when $ITM finished the call with $OM. \n\n&amp;nbsp;\n\nOnce I saw his light turn green again I called him instantly and asked him what the deal was. $ITM looked into the issue and it turns out his e-mail service was disabled on his domain. He then placed a call with the hoster, and it turns out his email service was disabled on the day I changed the PHP version.\n\nConnecting the dots, I realized I must have misclicked at some point and accidentally set his e-mail service to disabled, as the dropdown menu was underneath the PHP version options. \n\nAfter I realize this mistake I made I felt really guilty for the whole weekend, and I couldn't collect the courage to call the man back and apologize. I'm glad however that the issue was found out and the other IT managers had a good laugh with it.\n\nLater down the line I found out that the IT manager and the directors were in agreement that support will be continued for this customer due to his situation, but I was unaware of this as the customer rarely had to contact us for tech support.\n",
        "created_utc": 1517743624,
        "upvote_ratio": ""
    },
    {
        "title": "Nework printer not working",
        "author": "gertvanjoe",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v5odt/nework_printer_not_working/",
        "text": "[removed]",
        "created_utc": 1517733316,
        "upvote_ratio": ""
    },
    {
        "title": "Just wait a few seconds",
        "author": "ElDavoo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v5nry/just_wait_a_few_seconds/",
        "text": "[removed]",
        "created_utc": 1517733035,
        "upvote_ratio": ""
    },
    {
        "title": "When I hold my digital camera this way, nothing works...",
        "author": "tomytronics",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v4exm/when_i_hold_my_digital_camera_this_way_nothing/",
        "text": "Sometimes tech support comes in the form of children helping parent.\n\nHappened some years ago (2009 I think) with my Mother. We were travelling together and she was using her new digital camera for the first time that year.  She asked me about an \"odd\" issue with her camera. When she held it horizontally, it worked fine. But when she turned it vertically, it stopped working.\n\nI took a look at her camera and at a glance, I didn't see any issue. I asked her to show me. She held the camera vertically and showed me that the LCD went dark.\n\nI saw the problem right away...\n\n&gt;Take off your sunglasses, Mom\n\nShe didn't have any problem since then. She didn't know polarized sunglasses and LCD didn't play nice.",
        "created_utc": 1517715833,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried turning up the volume?",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v2q4y/have_you_tried_turning_up_the_volume/",
        "text": "I work as a tier 2 tech support agent. This was a call back that I had to make roughly an hour ago because there wasn’t enough information on the trouble ticket a tier 1 agent had logged. The Customer was not irate at all but was willing to redo troubleshooting which he said he had done. This was the conversation. He will be C. \n\n\nC: Hello?\n\n\nMe: *intro* So, I understand you’re having issues with your TV. \n\n\nC: Yes! I’ve tried rebooting the box. I’ve tried rebooting my modem and swapping the cables with no luck!\n\n\nMe: Hmmm, can you try turning the volume up? (I saw his box should be working)\n\n\n*Audio can be heard*\n\n\nC: Oh my god. My wife is gonna kill me. I’m so embarrassed. I’m so sorry. \n\n\nMe: Don’t worry! Anything else I can assist you with today?\n\n\nC: No thank you. \n\n\nMe: Have a good day. \n\n\nThe problem? His TV was on mute. ",
        "created_utc": 1517698026,
        "upvote_ratio": ""
    },
    {
        "title": "\"How do I get to the internet\" and \"Where is google?\"",
        "author": "Chilled_IT",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7v2hqj/how_do_i_get_to_the_internet_and_where_is_google/",
        "text": "Just have to toss this one in. In case some people wondered, I had to take a break cause my sister got diagnosed with cancer, so I spent my time with her and didn't continue my story that I started about my weird adventures at my new job. Sis is doing much better now, cancer getting smaller and smaller.\n\n------------\n\nShort summary of the situation\n\nWe develop software for other companies, me being our sysadmin. We have to do an all-nighter because we had to finish something until the next morning. The boss was nice to pick up food for all of us, as she couldn't help us at all.\n\nAfter we are done eating, she asks me whether she can log in at her secretary's computer as she left her laptop at home. I say that she can do that and I'm about to move back to the conference room where all the others are.\n\n--------------------\n\n&gt;$Boss: Hey come back, this computer is not booting up.\n\n&gt;$Me: *goes back to her* -&gt; *turns on the 2nd screen* There you go *leaving again*\n\n&gt;$Boss: Wait a sec. How do I get to the internet?\n\n&gt;$Me: *Walks back again* -&gt; *Looks at the desktop, only \"My Computer\", \"Recycle bin\" and the 3 most common browsers are on the desktop* So which browser do you use?\n\n&gt;$Boss: I don't know. It just comes up after logging in. *smart IT-dude before me must have set it up that way*\n\n&gt;$Me: *opens up all 3 browsers* So which layout seems familiar?\n\n&gt;$Boss: I don't know but I will just use this one. So how do I get to google from here?\n\n&gt;$Me: Just type in that field on the top right. It will immediately make a google search out of that.\n\n*is glad that it is almost midnight and he didn't make any facial expressions indicating how shocked I was, as he was too tired*\n\n--------------\n\nTL;DR Boss of software development company doesn't know how to get to the internet or to google.",
        "created_utc": 1517695769,
        "upvote_ratio": ""
    },
    {
        "title": "\"All my editing options are greyed out\"",
        "author": "stilsjx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uzck0/all_my_editing_options_are_greyed_out/",
        "text": "I am our \"branch information delegate\" which means I have a marginally more technical background than 99 percent of my office (read as \"I'm a good googler\") get the envious task of bring the first line of contact for many issues... Printer doesn't work, mouse doesn't work, laptop dock doesn't work, screen, font size too big, too small, etc.  It's not a paid gig and I don't even get karma points for it so I typically mind my own business unless someone asks me directly for help.\n\n*Italic*The other day a user $a started asking all the bluebeam users if they were able to edit pdf's in bluebeam.  They all said yes.  He then explained to them that all his editing buttons are grayed out and he wasn't able to edit anything.  I continue to MMOB.  He then calls the help desk and gets what he called \"doubletalk\".  I need to print on a printer near him, and as I approach he asks me for help...\n\n&gt;$a: Stilsjx, you know bluebeam, right?  Why are all my buttons grayed out?  \n&gt;$me: because you don't have a document open.\n\nCue disbelief\n\n&gt;$a: no that can't be it.  \n&gt;$me: open a new document  \n\n*Italics*$a opens a new document and all options are now available.\n\nWhy did that take so long to figure out?  These people aren't dumb...",
        "created_utc": 1517665135,
        "upvote_ratio": ""
    },
    {
        "title": "The soup and coal debacle, part 1",
        "author": "saabstory88",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uy48d/the_soup_and_coal_debacle_part_1/",
        "text": "I would like to present you all with a tale from a slightly different field, one which is riddled with its own unique challenges and pitfalls. The firm that I work for specializes in architectural and entertainment lighting, and the associated complex control systems which cause them to function on a day to day basis. To our clients, we provide the magic boxes which allow them to impress their significant others by changing the color of historic landmarks on date nights. My role is divided between the design of these systems, as well as supporting the end users as their needs change, and as parts of their systems fail due to age.\n\nA little history...\n\nSome aspects of the industry are quite modern, with networked processors and cloud based user interfaces. Others are more antiquated, relying on serial communication standards developed during the Regan administration. This has lead certain equipment manufacturers to create weak patches to the underlying design issues, rather than understand and embrace the evolving realities of communication protocols. \n\nThe clients original design brief was delivered to our firm before I had started with the company. Their goal was to light an historic bridge, which spanned over a shopping center in a riverfront development. There were several buildings which would support fixtures to light the structure, however they were separated by a four way intersection which they were unwilling to trench to add the required serial data cabling, which would provide the 40 updates per second which the legacy serial color changing lighting protocol demanded.\n\nThe architects were stumped at how to overcome this challenge, but our firms lead technical expert stepped in which a solution. We could provide a system which utilized the 2.4ghz band, which would broadcast the lighting data over the air to the other rooftops, and allow the system to operate as a single unit. The client was elated. Shortly after the system was approved, I came on board the firm, eager to support these kind of systems.\n\nWhen this project was installed, there were a number of vacant storefronts at the shopping complex, and the least populated one was chosen for the control system and transmitter. As the years went by, more tenants occupied the shopping complex, and more wireless network traffic appeared. Lights began flashing, and the system stability declined as the aging transmitters frequency hopping algorithms began to be less able to cope with the increasingly crowded spectrum. Sending a service tech to the site to re-link the wireless receivers became a monthly ritual for our company. \n\nBut then the real fun started...\n\nA regional sandwich chain leased the storefront where our control system and transmitter was located. The period during the build out was littered with panicked late night phone calls, and resulting in the finding that the contractors had cut power to the storefront, and not reenergized it after they had left for the day, leaving our controller without power. It was a tense period, but our management team assured the client that once the outfitting of the restaurant was complete, that there would be no more interruptions in service. And at the end of spring of that year, this assumption was proved mostly true.\n\nThat is, until the fall. When the weather began to change, the communication disruptions became a weekly occurrence, and then, as the falling leaves turned to snow, a daily occurrence. As our technicians tried and failed to resolve the issues, including replacing more than half of the transmission and receiver hardware, I was dispatched to the site to solve the issue for the understandably agitated client.\n\nI spent several days there, monitoring the health of the system, and armed with a spectrum analyser to search for interference. Over several days, I began to notice a strange pattern. There were several times per day when the entire 2.4ghz spectrum was completely filled. There appeared to be no frequencies left where the transmitter could redirect its signal, and the receivers gave up their search for a data source, and were indefinitely disconnected. I started to look at the time domain, and the interference was presented in perfect intervals of 30 seconds, but did not seem to have a reliable offset from the time of day.\n\nAs I am a trained lighting designer and technician, I am not as familiar as other here may be in the issues associated with wireless networks, but after a couple of hours of research, I had my suspicions. I walked into the restaurant with my laptop, spectrum analyser in tow. The manager on duty was slightly confused when I began to enquire about their food preparation procedures, but agreed to let me observe. As it was a cold day, several soup orders appeared, and the staff dutifully reheated portions of soup in their industrial microwaves. \n\nBefore I could even see the waveform scroll across my laptop screen, the lights on the bridge outside began deviating from their assigned program. The LED fixtures attempted to faithfully recreate the corrupt data streaming into them, dancing in a spectacular show of random colors. I had found it, the root cause of the interference. Over the next several days, I worked with the on site management representatives to demonstrate that we had found the root cause of the issue. Soup was only reheated in the microwaves during the cold months when it was in demand, and these devices were powerful enough to even disconnect diners from the free wifi provided by the establishment.\n\nDuring this time, our managing director, who was the original technical lead for our firm, had given notice that he was leaving the company. It was now up to me to redesign the system to be resilient in the face of the interference. However, while I was aware of the soup, I was not prepared to deal with the coal...\n\nTo be continued in Part 2...",
        "created_utc": 1517644862,
        "upvote_ratio": ""
    },
    {
        "title": "It's...What?",
        "author": "Altrissa",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uxhfw/itswhat/",
        "text": "​Hello!\n\nAbout 13-ish years ago, I was an oil and gas programmer who specialized in building plant and well systems. Since we didn’t have a support department, any issues would come directly back to me to deal with. I had my fair share of PEBKAC calls, but my absolute favourites were ones that had nothing to do with the end users. This is one such story.\n\n\nOne day I received a call from a client who wasn’t getting any gas to their plant. I checked our system and everything was reporting as fine. The well was pumping and there were no blockages, but nothing was coming down the pipeline.\n\n\nI spent hours going over the code to see what was going on, but nothing made sense. Every ping I sent came back fine..it should have been working. Finally, I saw no choice but to send a tech out to the site and see what was going on. We were lucky that we not only had a tech in the area but they also had a helicopter ready. \nThe well site was in a far northern corner of Canada - only accessible by helicopter during the warm months or by an ice road during the winter.\n\n\nAs the tech neared the site, he called me on his satellite phone.\n\n\n“I’m almost to the site, but everything looks fine...oh.”\n\n\nThe tech suddenly went quiet and I thought I had lost him, until he spoke again.\n\n\n“It’s on fire.”\n\n\nI asked him to repeat himself, since I couldn’t have heard that right.\n\n\nApparently there was a storm a few days prior and lightning had hit the site. Miraculously, the reporting computer (called an RTU) hadn’t been fried but the lightning strike had punctured part of the above ground portion of the pipeline and set it alight. Because the RTU saw nothing wrong, it continued to pump the gas...directly into the flame, continuously feeding the fire. By sheer luck, the flame was shooting in a vertical geyser with no wind..I shudder to think how bad the forest fire would have been had the wind shifted.\n\n\nI turned off the well remotely so the tech could land safely and patch up the pipeline.\n\n\nAnd that is how fire became my favourite excuse as to why a well wasn’t working. (Well, that and bears. Those were fun calls too.)\n\nEdit: changed one instance of the word “gasoline” to “gas”. I meant gas, as in natural gas. Need to stop proof reading late at night..",
        "created_utc": 1517635475,
        "upvote_ratio": ""
    },
    {
        "title": "\"I've done your job before, I know what I'm doing\"",
        "author": "GyahhhSpidersNOPE",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uwp1o/ive_done_your_job_before_i_know_what_im_doing/",
        "text": "Hi again TFTS -    \n    \nI was reminded of this yesterday - I have been at my company for ~9 years or so as of this year. I work for a life science company so I work with a *LOT* of book smart folks that hate technology. But this tale isn't about my lab rats (lab techs), it's about a girl in marketing I shared a trailer with while the admin building was under construction (so.many.stories from that trailer!) - this was before the construction in 2010 &amp; she was in the front building and I was in a smaller trailer that served as my office and storage area.    \n   \nThe characters:    \n    \n$Me - me, GSN, IT Mangler    \n$MU - Customer Service/Marketing associate     \n    \nAbout 8:45 my phone rang:    \n    \n&gt;$Me - Hey $MU What's up?     \n    \n&gt;$MU - Hey GSN, my wireless keyboard and mouse died and it's not the batteries. I just swapped them all out and it's still not working, can you bring me another one ASAP?    \n       \n    \nNote: User's keyboard/mouse set was one of those old ones that had a USB piece that had to be plugged in a front USB port and had its own batteries as well.   \n   \n\n&gt;$Me - Sure, but have you made sure the batteries are in the right way? There should be a plus or minus sign that will tell you which end is up and which is down &amp; it's easy to get one upside down.    \n   \n&gt;$MU (yelling) - I'VE DONE *YOUR* JOB  BEFORE, I KNOW WHAT I'M DOING - I CAN PUT A BATTERY IN! IT'S BROKEN AND I WANT IT REPLACED NOW!    \n    \nUh, what? I say I will be right over and go to the front building to $MU's office with no replacement or batteries in my hands because I had a hunch.     \n     \nI walk in &amp; $MU is sitting at her desk. She stands and tells me to sit down and continues to tell me the keyboard and mouse are  broken.       \n     \nI go over and open the USB connector and lo and behold, the batteries are in backwards! BOTH OF THEM! I also check the mouse (it was OK) and keyboard (one was backwards). The only word I can use to describe $MU's face is utter embarrassment. She knew she messed up. She had already complained about me to her boss (who I'm actually pretty tight with so there was never an issue) for \"being rude\" to her and that because she used to be a sysadmin, she should have admin rights on her PC as well as ALL programs she used. Nope. Hell nope. So she was already pissy about me.    \n    \nI know a lot of folks in my position would have rubbed it in her face (and oh how part of me wanted to) but I figured it was a good chance to maybe get on her good side and also get her to trust her IT department a little bit more (she didn't know me at all or my background &amp; assumed I was green I guess).   \n     \nI was right. She asked me not to tell anybody about it and apologized for being so ugly to me. I accepted it but absolutely let her know she got one Mulligan.  She and I had absolutely pleasant interactions after that and she has since left the company and has a beautiful family. And that's is also how I became really good friends with her boss. \n        \nTL/DR:User says she can do my job because she had been a sysadmin at a previous job. User insisted batteries were changed out correctly &amp; that her wireless mouse/keyboard were dead when she had put the batteries in wrong. \n",
        "created_utc": 1517625981,
        "upvote_ratio": ""
    },
    {
        "title": "I swear I’ve never used any computer for work reasons",
        "author": "Shirinjima",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uuap2/i_swear_ive_never_used_any_computer_for_work/",
        "text": "I work in end user support for employees at a global company. We currently have about 30k employees in our organization. I support internal employees only about 99% of the time. \n\nUp until recently I have been dealing with a user who has had ongoing persistent account lock outs over 3 months. Multiple times a day. \n\nThe users lockouts start occurring after the user password expires and they the users has to update their password. We go through all the standard processes such as checking for cached passwords and everything. \n\nWe get a report of what pc name causes the lockout. It’s not coming from any of our computers. It’s coming from some external device. \n\nWe ask the user if they have ever logged into their email or any work related content on any PC ever. She swears up and down she hasn’t. \n\nThe user is vehemently against changing her user name so she will no longer have any lock outs due to not wanting to worry about the issues a new username could cause. \n\nWe bring in tier 3 support on the situation and they’re scratching their head about the constant lockouts. We have one tech spend roughly 40 hours alone researching her account and trying to find out where the lockouts are coming from. \n\nWe are now at a loss of what to do other than changing this users username. After 3 months we start the steps of the username change and plan when to implement the change since the user will be down 24 hours while we update the username and allow for it to sync downstream among all of our platforms. \n\nOne of our tier 3s manages to track her lockouts to a Mac computer.  The users personal Mac to be specific. \n\nI reach back out to the user and walk her through removing her work email from her personal computer. \n\nShe gives me the longest I’m sorry for ruining your life for 3 months when I recapped the fix for her account lockouts with:\n\n “After removing your work email from your personal computer that you set up you will no longer have any account lock outs. Also, to ensure that this is no longer an issue your account now can only access your work email from company owned property via an embedded certificate for outlook.”\n\nShe was terminated 7 days after I fixed her account lockouts. \n\nTL;DR: A forgetful user saved their password on a personal computer. The user password expires and they create a new one. They forgot to update their personal computer cached password.  We ask about it. User denies the possibility. 3 months later after daily account lockouts we find the cached password on their personal computer. They’re fired 7 days later for an unrelated reason. \n\nEdit: added TL;DR\nEdit2: updates TL;DR\nEdit3: made some details more clear kind of ",
        "created_utc": 1517603624,
        "upvote_ratio": ""
    },
    {
        "title": "Headphone Button?",
        "author": "kingdomfaraway",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ut3hj/headphone_button/",
        "text": "A few days ago I was sitting at our public reference desk, covering for a co-worker’s lunch. The desk is next to our public computers, and there was a gentleman in his early 40’s sitting at one of them. I could hear him mumbling under his breath about something.\n\nA few minutes later, he hailed me over and I arrived to see a black computer screen.\n\n&gt;ME: What can I help you with?\n\n&gt;PATRON: Yeah, I was trying to listen to a YouTube video but I couldn’t get sound. I tried pressing the headphone button but now the computer’s gone blank.\n\n&gt;ME: Ah, well that would be the power button, so it looks like you’ve turned off the computer. Let’s turn it back on and we’ll make sure to make sure the mute isn’t on.\n\nOur power button? Yeah, nowhere near the headphone jack and has the power icon on it. At least he used some thought process to arrive there. Can’t hear sound? Hit the closest button you can find! \n",
        "created_utc": 1517594010,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an outage right now?",
        "author": "mghtyms87",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uswna/is_there_an_outage_right_now/",
        "text": "[removed]",
        "created_utc": 1517592529,
        "upvote_ratio": ""
    },
    {
        "title": "Can you back up a voicemail?",
        "author": "Fiftyniner",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7usa3j/can_you_back_up_a_voicemail/",
        "text": "Hey, folks. Just got off work about 30 minutes ago. I work at a college help desk, we help students and faculty with simple problems that main IT can't be assed to do. \n\nThank god this was my last window visit for the day.\n\nTending to my computer reviews, dipping around on my phone for the last few minutes of the day when this sweet older lady walks up to our office. She pulled out her phone and iPad, normal email set up. Half-way through downloading the app she needs, however, she shyly asks, can you back up a voicemail?\n\nExpecting this to just be a normal I-need-this-message-for-work ordeal, I go to search up instructions online, like any good IT fella would do. As she taps on voicemail, however, it gives a small voice-to-text transcript. \n\nNow, I'm not one to glance at people's messages; I actually pride myself in my ability to resist letting my brain even process somebody's private messages. But this caught me off guard. I only saw a few words of it, but the words I did see were along the lines of \"mom, I love you, I'm sorry\". That's all I really saw before I realized what I was reading, and stopped myself from seeing anything more.\n\nI didn't want to press for details, but she was visibly a little choked up. As she, in her most calm keep-it-together voice possible, explained, her daughter had just passed away. \n\n She was unsure of how exactly voicemail worked and if the message would be lost, if it could be backed up, if anything could be done. Of course, iPhones apparently make this exceedingly easy. Seeing all I had to do was press this little share button, I did everything in my power to send that message to every email address, cloud storage, phone number, you name it, that she had access to.\n\nAs I finished up setting up her two devices with her email addresses, each device of hers lit up with her email. The newest message on each one being that voicemail. I explained to her how to download it from her desktop, and she's planning on putting it on a flash drive, her hard drive, anywhere she can keep a copy.\n\nI didn't want to bring up any more memories than what was on her mind already, so I left it whatever she wanted to tell me, and embraced every detail of every little story she wanted to share. Poor woman's daughter was only 25.\n\nWe talked about how bittersweet and wonderful it was that she still had the moments and memories they did get to have together. About how all she can really do is look at that framed picture of hers and remember, how she's so happy she can still listen to thst message and remember her voice.\n\nI'm happy I could save that precious memory for her.",
        "created_utc": 1517587500,
        "upvote_ratio": ""
    },
    {
        "title": "That's not how you fix water damage!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7us0fq/thats_not_how_you_fix_water_damage/",
        "text": "[deleted]",
        "created_utc": 1517585139,
        "upvote_ratio": ""
    },
    {
        "title": "Everyone Loves an XPS Print Driver",
        "author": "Ctrlaltbourbon",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7urqq9/everyone_loves_an_xps_print_driver/",
        "text": "[removed]",
        "created_utc": 1517582706,
        "upvote_ratio": ""
    },
    {
        "title": "Engineers are not always smart",
        "author": "StrategicBlenderBall",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7urj0v/engineers_are_not_always_smart/",
        "text": "So I have a user that is pretty much hopeless, most of the tickets he submits are absolute garbage but I help him out because it's my job. This user submitted a ticket recently stating he is \"Unable to open Adobe files\". \n\nI walk through some steps with him, have him try sending me the files (they worked fine), I asked him to hover over the taskbar icon and maximize but that didn't work. Finally I remote in and reinstall Adobe Acrobat DC, I figured that would solve it. Nope.\n\nA week later (yesterday) I'm in his building so I drop by and ask if it's working yet. As he's mumbling I notice his second monitor is off...\n\nI went to his boss and told him the issue. He almost had a stroke from laughing so hard. So yeah, engineers aren't that smart. ",
        "created_utc": 1517580630,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from the Baby Bell: Borat Strikes Back",
        "author": "simAlity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ur03h/tales_from_the_baby_bell_borat_strikes_back/",
        "text": "If you don't recall my first tale about Borat, you can find it [here](https://www.reddit.com/r/talesfromtechsupport/comments/7gi11j/tales_from_the_baby_bell_simality_meets_borat/).  This tale takes place about three months later.\n\n---\n\nAll good things must come to an end and for Amelia that end came on a Monday. \n\n&gt; **Me** *(staring at the meticulously cleared work space)***:** What...what happened?  \n&gt; **Walt:** Beats me.  She came in, put down her stuff and went back to talk to the Big Boss.  Twenty minutes she later came out, cleared her desk and left.  \n&gt; **Me:** Damn.  Okay.  \n\nAmelia's unexpected departure had several consequences.  First I was made a interim supervisor (dammit!).  Second a former supervisor, Janet, who had transitioned over network operations started pitching in part time.  One of her first acts was to re-open Borat's ticket.\n\nTo be fair, the ticket hadn't actually closed.  Every time we marked the issue resolve, Borat would reopen the ticket, complain that the problem wasn't resolved and demand that we send a tech.  He even filled out a \"bad feedback\" survey.  Since there was no way for us to close a ticket without sending a resolution message, Amelia suspended the ticket with the intention of closing it in a month or two after the problem had hopefully resolved itself.\n\nThat subtext was kind of lost on Janet.  All she saw was a bad feedback survey and a failure on our part to respond to said feedback.  So she re-opened the ticket and asked Jack, one of the day side techs, to give Borat a call.\n\nI wasn't there when that call took place.  I imagine it went a lot like my call with Borat because the notes indicated that Borat's grasp of the English language was too tenuous to do even basic troubleshooting over the phone.  Jack recommended a tech.  I jumped in and recommended against the tech.  Janet agreed with Jack and the tier 3 group (who decide what gets a tech and what doesn't) agreed with Janet. \n\n&gt; Tier 3: Let's send a tech and prove that the problem isn't our fault.\n\nSo, Borat got his tech.  \n\nThe tech went out and spent half a day troubleshooting all the things. He actually discovered a serious problem with the Ethernet ports in the apartment and spent an hour patching cables and replacing equipment.  Which was great except that Borat didn't want to use an Ethernet cable to get online.  The tech preached the Gospel of the Wired Internet but Borat wasn't interested.  It was WiFi or Bust. \n\nSo the tech took a look at the computer.  If this had been a simple settings issue, I'm sure he would have fixed it (he's super thorough).  But it wasn't.  The adapter was busted.  Tech recommended that Borat either replace the adapter, use a cable or take the computer to a computer repair shop.  He closed out the work order with the conclusion of, \"Device Issue.\"\n\nThree days after the tech left, we received a call from a truly livid Borat.\n\n&gt; **Borat:** YOU BROKE MY WIFI COMPLETELY.  Now I can't get online at all!  \n&gt; **Tier 1:** Sir, according to our records your account is suspended. There is a note saying you need to speak to the front office in order to have it re-enabled.  \n&gt; **Borat:** OFFICE SAYS I OWE MONEY FOR TECH.  `I DON'T KNOW WHY TECH CAME!`   \n&gt; **Tier 1:** Sir, according to our notes you were unable to connect to the Internet and demanded that we send a tech out--  \n&gt; **Borat:** TECH NO FIX MY COMPUTER!!  \n&gt; **Tier 1:** He wasn't a PC--  \n&gt; **Borat:** INTERNET WORK FINE AT OLD APARTMENT.  NOT WORK HERE.  YOU SEND TECH TO FIX INTERNET BUT HE MADE IT WORSE.  \n&gt; **Tier 1:** Sir, your account is suspended.  Until that suspension is lifted you will not be able to access the Internet at your apartment complex.  \n&gt; **Borat:** FINE I GO TALK TO FRONT OFFICE AGAIN.  (*hangs up*)  \n\nTwo days later we received a note:\n\n    I am arguing with office.  You can close ticket. -- Borat\n\nAnd here's hoping it STAYS closed.\n\n[More tales from me](https://www.reddit.com/r/talesfromtechsupport/search?q=author%3Asimality&amp;restrict_sr=on&amp;sort=top&amp;t=all)",
        "created_utc": 1517574920,
        "upvote_ratio": ""
    },
    {
        "title": "Can you fix this for free while we have a shouting match in the same room, not involving you?",
        "author": "bobcat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uq6ch/can_you_fix_this_for_free_while_we_have_a/",
        "text": "[removed]",
        "created_utc": 1517563270,
        "upvote_ratio": ""
    },
    {
        "title": "New Tricks, Old Habits",
        "author": "Aniline_Selenic",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uo5na/new_tricks_old_habits/",
        "text": "A few weeks ago, I discovered that corporate disabled scanning files to USB with the copy machine (security issue). Not a major deal for me, since I rarely had a need for it. However, our designers used it a lot to obtain digital copies of client sketches and to send designs to our installers.\n\nA few days ago, I remembered that the copy machine can scan to email. I let our designers know so they could continue their work and save a step.\n\nNow, I should note, our designers are not tech savvy and neither is my coworker. Designs are done on the computer, but they print out the designs only to scan them back into the computer to email to the installers. \n\nI've attempted to show them an easier way, but it overwhelms the designers, they say it creates more work for them, and management doesn't want me to show them because the designers will stop printing out hard copies if they don't need to (hard copies are needed for clients to sign). Honestly, after seeing how incomplete client files are and how the designers can't deal with change, I agreed with management and let the designers continue with their inefficient process.\n\nAnyways, a client emailed some photos to my coworker whom I share a mailbox with. The photos were of an issue the client has with a product. My coworker forwarded them to the vendor to correct the issue. The vendor didn't see an issue with the product from the photos and asked what was wrong with it and said to get with our rep.\n\nInstead of just answering the question and contacting our rep, one of the designers thought the rep didn't receive the photos. The designer had my coworker print out the photos from the email, scan them with the copy machine, and email them to my coworker to resend to the rep! \n\nTomorrow my coworker if off and I'll fix the issue and forward the photos correctly and answer the question.\n\nThis coworker will also print out paperwork (or hand write it when we have a digital form), take a photo of it, email it to themself, to forward it to our installer. Why they don't just print to PDF (after I have showed them multiple times), I have no idea. \n\nTL;DR Just because you learned one new trick, doesn't mean it's the correct application for all issues.",
        "created_utc": 1517538476,
        "upvote_ratio": ""
    },
    {
        "title": "The Seller Doesn't \"alow pobox\"",
        "author": "mintsmead",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uo09j/the_seller_doesnt_alow_pobox/",
        "text": "Sing for your shipment? Shopping for refurbished laptops for a client on eBay. Found the best deal was from this seller that only used USPS, but wouldn't ship to PO boxes for some reason. Maybe it's because if you Google the seller's town and \"post office\" one of the results is seriously a McDonalds. \n\nOur client has a security checkpoint that USPS drivers refuse to go through. We attached a note to to the purchase, but the seller didn't understand his own eBay store policies and my boss was **not having it**. Actual eBay message copy and paste with the obvious redactions follow:\n\n&amp;nbsp;\n\n&gt;**Note to seller:**\n&gt;USPS will not deliver to {address} because they don't want to go through security. Ship to the PO box below or use a different shipper: {POBoxAddress}\n\n\n&gt;**$RedneckPawnShop:** How are you. Before we print the label please update your address to the one that you made a note to. We can only print the label to the address that is given to us on your shipping address. Thank you.\n\n\n&gt;**$NotHavinIt:** You have a block on PO boxes so I am unable to enter that as the address. eBay will not allow it -says seller does not accept PO Boxes. Can you use UPS or FedEx? Otherwise PayPal will allow you to create the label manually here: {aReallyHelpfulLink}\n\n\n&gt;**$RedneckPawnShop:** sir Usps allow pobox shipping. fed-ex and Ups won't alow it\nthank you please let me know\n\n\n&gt;**$NotHavinIt:** Yes. I am aware that the post office will deliver to their own PO boxes. What I am saying is that eBay will not accept the PO box address for you. I am able to use a PO box for other sellers, but you have blocked PO boxes. There is nothing I can do about it. You must change your eBay settings: {anotherGoodInformativeLink} Or you could use one of the other solutions I have offered. Please let me know.\n\n\n&gt;**$RedneckPawnShop:** Yes we do not ship to PO BOX any more sins last year. This was our new rule for our Ebay store. If you want we could ship it out FeDex with a signature confirmation so you would have to **sing** for it when it comes to you. Please advise.\n\n\n&gt;**$NotHavinIt:** FedEx is good. There is a receptionist there during business hours to sign for the package.\n\n\n&gt;**$RedneckPawnShop:** OK here is your FedEx tracking #: {number} Thank you very much.\n\n\n&gt;**$NotHavinIt:** Thank you. I have asked the receptionist to select an appropriate ballad for the courier.\n\n&amp;nbsp;\n\nI'll just let that speak for itself. \n\n&amp;nbsp;\n\nUpdate:\n\n&amp;nbsp;\n&gt;New message from: **$RedneckPawnShop:** ok great thank you.\n\n&amp;nbsp;\n\nCompletely oblivious. ",
        "created_utc": 1517536976,
        "upvote_ratio": ""
    },
    {
        "title": "Reverse Tech Support From Hell",
        "author": "kingkovifor",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uneck/reverse_tech_support_from_hell/",
        "text": "[removed]",
        "created_utc": 1517530983,
        "upvote_ratio": ""
    },
    {
        "title": "Power is optional.",
        "author": "Gnoobl",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7umspa/power_is_optional/",
        "text": "This is a second hand story from my brother in law but I could not not share it. \nNot quite sure it really fits in here but it should be good for a chuckle or two. \n\nYears ago my brother in law was fresh out of basic and tech school at his first base. \n\nProtagonists:\n\nBrother in law: $noob\nStaff Sargent in charge of him: $staff\nB52 Radar operator (Captain): $cap\n\n\n$staff: Hey $noob, grab your gear and come with me. A B52 just reported a radar failure and is already sitting on the runway. \n\n$noob: Ok (hightails it to the truck)\n\n\n=&gt;&gt;&gt; Fast forward to the arrival at said B52 and some lugging of tools up narrow stairs\n\n\n$staff: Hey noob. After looking at the radar console I think I already found the problem. \n\n$noob: Can’t see anything wrong the $staff. What the heck did you find?\n\n$staff: Let me show you. Hand me the largest screwdriver in the toolkit. \n\n$noob: Okay?!? Here you go $staff. \n\n$staff: Thanks. (Proceeds to hit the Captain on the flight helmet with the handle of the screwdriver) \n\n$noob: Oh shit!!!\n\n$cap: (About to chew $staff the hell out)\n\n$staff: (Points without saying a single additional word with the screwdriver at the main power switch on the Radar panel)\n\n$cap: (flicks switch and the panel starts to do what it was designed for)\n\n$staff: Have a nice flight, guys. \n\n=&gt;&gt;&gt; Back at the workshop.\n\n$noob: Why man? Just why?  We are going to get in so much trouble. \n\n$staff: What do you think he is going to do? Report us? No way in hell is he going to do that because it would also require him to put into writing as to why he delayed the takeoff of a important flight due to his own stupidity. We’re just fine. Trust me. \n\n\n\nNothing ever came from it other than a good story. \n\n",
        "created_utc": 1517525559,
        "upvote_ratio": ""
    },
    {
        "title": "Chicken Strikes Back",
        "author": "arcanine932",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7umhm9/chicken_strikes_back/",
        "text": "[removed]",
        "created_utc": 1517522936,
        "upvote_ratio": ""
    },
    {
        "title": "Nobody used that service ...",
        "author": "grat_is_not_nice",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7um8x8/nobody_used_that_service/",
        "text": "So this would have been in 1998, probably. I was working as a Systems Engineer for a small IT firm, mostly Windows but some Unix support. One afternoon, I got a call from our bench engineer - he had a side business doing PC repairs and the like, and had a problem that was beyond his ken.\nI met him up at the local hospital - they had a scripted solution that went out every day and placed orders with their pharmaceuticals provider over a dialup system. This system had stopped working, and the hospital needed drugs ...\n$Me: IT Engineer\n$AZ: The rep from Big Pharma who had set it up\n$VA: The Hospital Vaxen Administratess\n$IM: The Hospital IT Administrator\n$BE: our Bench Engineer\n\n**$BE** introduced me to everyone, and basically stepped out at that point - he really was just a point of contact.\n**$AZ** ran through the procedure - a PC running Hummingbird TCP/IP suite for DOS (my memory is hazy - it might have been some other TCP/IP suite, but I'll say Hummingbird) used some Hummingbird scripts to allow the Hospital Vax cluster to create and download a series of order files from the Healthcare system, dial up to the pharmaceuticals provider, upload the files, and check the receipt acknowledgement. It wasn't working, and no-one knew why.  \n**VA** was a small but feisty woman. She admitted that the Vaxen had just been upgraded, but asserted in very strong and forthright terms that it wasn't a Vax issue.   \n**IM** just lurked and loomed.  \nI looked at the scripts - I wasn't familiar with Hummingbird, but it was pretty obvious how stuff worked. I threw in a few debugging lines, and verified that I could track the progress. Then I started testing each element of the process.  \n*establish a terminal session to the Vax* - **OK**  \n*check the creation of the order files* - **OK**  \n*files in the right place* - **OK**  \n*ftp session from the Vax to Hummingbird ftp server* - *hmmmm*  \nLook at the scripts and ftp server profiles, the session has been rejected. Ask **$VA** to pull up the Vax access logs, and see a bunch of *Access Denied - unknown user* messages. Look at the scripts and read some docs to try to figure out why the user is being denied, and realise that the Hummingbird ftp is relying on identd to get user authentication info from the Vax.  \nidentd runs as a service on an originating client. A server that gets connection from a client can query the client's identd service with the connecting TCP port, and get a username back for the initiator of the port. Useful for multiuser systems.  \nI set up a telnet connection and try to test the Vax ident server - the connection times out  \nAnyhow, it is obvious that without a identd service running on the vax cluster, the scripts won't work (without some serious rework that we don't have time for). So I go back to **$VA** ...  \n&gt; **$ME**: \"Can you show me the Vax TCP/IP services\"  \n&gt; **$VA**: &lt;clickity&gt;  \n&gt; ...  \n&gt; *identd* **disabled**  \n&gt; **$ME**: \"When was *identd* disabled?\"  \n&gt; **VA**: *\"Oh, today after the upgrade. Nobody used that service ...\"*   \n&gt; **$ME**: \"Let's just re-enable it, for a quick test\"  \n&gt; **$VA**: &lt;clickity&gt;  \n&gt; **$AZ**: &lt;clickity&gt;  \n&gt; **$ME**: \"Oh look, it's working &lt;sigh&gt;\"  \n\nAnd that's how our company got a year-long contract at the Hospital to manage their Y2K migration/Zen App packaging, with **$ME** on site achieving my 120% productivity bonus for 12 months straight.  \n\nWhile I was there we had a major network outage:  \nIn preparation for a major reorg in the server room, **$VA** had walked in, found a bunch of unidentified/unlabelled cables, and had just gone ahead and cut them with sidecutters.  \n**$BE** spent the rest of the week reconnecting (and labelling) everything she had cut off.",
        "created_utc": 1517521008,
        "upvote_ratio": ""
    },
    {
        "title": "\"I'm sorry it's taking so long\"",
        "author": "StPurr",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ulb45/im_sorry_its_taking_so_long/",
        "text": "I worked at an Internet tech support call center.\n\n&gt;Me : \"Hello, how can i help you\"\n\n&gt;Caller: \"My internet isn't working\"\n\n&gt;Me : \"Okay, let's check the cables. Is the power cable connected properly?\"\n\n~ noise, cables moving, a grunt, some more moving ~\n\n&gt;Me : \"is everything alright, sir?\"\n\n&gt;Caller : \"Yes, I'm sorry, it's just that the power is cut off in the building and it's hard to see in the dark\"\n\nI had to mute the conversation to consult my peers on how to explain to this man that you need electricity for the internet to work.",
        "created_utc": 1517513576,
        "upvote_ratio": ""
    },
    {
        "title": "The Magical XPS Print Driver",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ukksu/the_magical_xps_print_driver/",
        "text": "[removed]",
        "created_utc": 1517507881,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of The Naughty Intern",
        "author": "r00t_failure",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uketp/the_tale_of_the_naughty_intern/",
        "text": "[removed]",
        "created_utc": 1517506552,
        "upvote_ratio": ""
    },
    {
        "title": "\"My mouse pad is oily\"",
        "author": "The_One_True_Ewok",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ukcim/my_mouse_pad_is_oily/",
        "text": "User was having an issue with the right-click menu not appearing for a couple seconds. While it was loading the menu would just be a white box. So she sticks her head in the office (no ticket...).\n\n&gt; Her: \"Hey, I think my issue is that I have like finger oil on my mouse pad, would that cause it? My mousepad isn't very clean and that white box keeps popping up\".\n\n&gt; Me: \"I.. don't think that would cause the issue, why don't we fix that problem for you though.\"\n\nShe argues some more about mouse pad cleanliness and I get up to go to her desk and help. But wait! She has work to do!\n\nYes, she is one of those users. I tell her she can either live with the problem or let me help her. At her computer, the problem is quite apparent.\n\nTheres like 10+ massive spreadsheets open. \n\n&gt;\"But I always do that!\"\n\nWell, not if you want your problem to go away.\n\n \n(This is definitely not the last time I'll hear from her.)",
        "created_utc": 1517506044,
        "upvote_ratio": ""
    },
    {
        "title": "Call In Queue Error",
        "author": "Chopper32Dave",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ujyjn/call_in_queue_error/",
        "text": "[removed]",
        "created_utc": 1517502952,
        "upvote_ratio": ""
    },
    {
        "title": "Because the first time worked so well?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ujvfe/because_the_first_time_worked_so_well/",
        "text": "[removed]",
        "created_utc": 1517502246,
        "upvote_ratio": ""
    },
    {
        "title": "Instructions Unclear",
        "author": "aricelle",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ujkw7/instructions_unclear/",
        "text": "Cast for today:  \n$Me - IT HelpDesk  \n$Sup - Supervisor  \n$User - User getting new computer  \n\nPreface: I work for a fairly large company and am in the process of sending out new computers to a subset of Employees. Because all of these Employees are in Remote locations, we also send a Scrub Disc to DoD wipe the old computer along with instructions on how to use it.  \n\nRing, ring, ring....  \n&gt; $Me: Good Morning! Standard greeting, this is $Me.  \n&gt; $Sup: Hi, I was just wondering about that scrub disc you sent. How long does it take to wipe the computer?  \n&gt; $Me: Generally 10-15 hours. Why, did you start the scrubbing already?  \n&gt; $Sup: Yes, we started it yesterday afternoon when we got it.  \n&gt; $Me: Yes, it does take a while. Does the $user have any questions about the new computer?  \n\nLooking at Remote Software. Something is not right in Denmark.  \n\n&gt; $Me: Hey, $Sup? I only see the old computer as online. Are you sure you're wiping the old computer?  \n&gt; $Sup: Yes, I started it myself. And $user says his computer is still slow as molasses.  \n&gt; $Me: .....  \n&gt; $Sup: Did we scrub the wrong computer?  \n&gt; $Me: I think you did.  \n\nTL:DR - Instructions Unclear. Received new computer. Scrubbed new computer. Will send new computer back to IT for re-imaging.\n\n\n",
        "created_utc": 1517499839,
        "upvote_ratio": ""
    },
    {
        "title": "Why I will never work a call center tech job again.",
        "author": "Pudding36",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ujd4x/why_i_will_never_work_a_call_center_tech_job_again/",
        "text": "*beep in ear*\n\nMe: thank you for call...\n\n(Cut off in my greeting)\n\nDr: MY SERVER ISNT WORKING FIX IT!!!!\n\n(Immediately go into con the customer for information)\n\nMe: let’s check the power cable for any frays. \n\n\nDr: ITS FINE FIX MY SERVER\n\n(That was too quick for them too look)\n\nMe: and what color is our indicator light in xyz location.\n\nDr: THERE ISNT A LIGHT!!\n\nMe: let’s press the power button to determine what happens. \n\nDr: WHERE IS THAT!?!?\n\nMe: on the front of the machine there will be a big circular button that power, if you press it in\n\n(Hear the fans kick off in the background and the caller hangs up)\n\nI was pulled aside and coached on how I handled this call horribly, since I didn’t get their name, use their name directly 3x in the call. Didn’t complete the introduction. Didn’t properly end the call. Didn’t build a relationship with the customer, and a plethora of other things that the calls are graded for. But resolving the customers problem was not on the check sheet of things to do. ",
        "created_utc": 1517497939,
        "upvote_ratio": ""
    },
    {
        "title": "Printer Driver of Doom",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uj6va/printer_driver_of_doom/",
        "text": "[removed]",
        "created_utc": 1517496409,
        "upvote_ratio": ""
    },
    {
        "title": "We... don't support that... and its definitely not that high priority",
        "author": "john539-40",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uj4ha/we_dont_support_that_and_its_definitely_not_that/",
        "text": "[removed]",
        "created_utc": 1517495794,
        "upvote_ratio": ""
    },
    {
        "title": "One Way to Setup a Printer",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uj3lm/one_way_to_setup_a_printer/",
        "text": "[removed]",
        "created_utc": 1517495551,
        "upvote_ratio": ""
    },
    {
        "title": "\"No, I don't think that's the problem.\"",
        "author": "marshmallownose",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uiz60/no_i_dont_think_thats_the_problem/",
        "text": "I'm so happy that I found this subreddit.  Finally, my people.\n\n\nThe tech support I do is different from most that I see here. I work at a company that makes laboratory equipment. I'm a chemist by trade, but I work in our technical support and applications lab. About 2/3 of my job is troubleshooting with customers. In our team, we each take a product line to specialize in. So when I say that I know my product, I mean I KNOW my product. Now to get to the story.\n\n\nA few weeks ago I get a call from someone whose pH meter wasn't working. After discussing the symptoms for a few minutes, we have the following exchange:\n&gt;Me: The problem is the electrode, and it will need to be replaced.\n\n&gt;Him: No, I don't think that's the problem.\n\n&gt;Me: Well, based on the serial number, the electrode is 4 years old (quick side note, average life is max 3 years). pH electrodes are considered consumable items and need to be replaced over time.\n\n&gt;Him: No, I've been a chemist for 20 years and this has never been a problem.  I don't think that's what's wrong.\n\n&gt;Me: ...........\n\n&gt;Me: OK, so now let's change the meter's mode into milivolts so that we can see how the electrode is performing without the influence of calibration.\n\n&gt;Him: My meter doesn't do that.\n\n&gt;Me: ............\n\nI have this meter on desk and use it daily. You literally have to press the \"mode\" *once*.\n\n&gt;Him: OK, well this has been a productive talk. Have a good day, goodbye.\n\nHe didn't even say that with sarcasm. He was sincere that it was a good talk. I hung up and thought ?????",
        "created_utc": 1517494385,
        "upvote_ratio": ""
    },
    {
        "title": "It's prettier this way",
        "author": "syberghost",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uixzu/its_prettier_this_way/",
        "text": "One day I spent a chunk of the afternoon installing new UPSes on every PC in the marketing department. A pain in the butt since every single person asked me if it could be done without powering off their PC, even after hearing me answer the same question from the person sitting next to them, not to mention the one lady who was wearing a skirt but wanted to keep working at her desk while I was under it (eventually got her manager to make her fuck off while I worked, no way I was getting into that situation), but I got it done.\n\nA couple of days later, we had a brief power outage, and help desk got a call saying that all the UPSes in the Marketing department were defective and needed to be replaced. They sent the ticket to me and I went up there to find out what the actual fuck.\n\nThey had unplugged all but one of them from the wall, and plugged them into each other in a daisy chain around the room, so when the power went off the massive draw exceeded the limits of the first one causing it to power off, and so on around the room. I explained that you can't do that, they each need to be plugged directly into their own wall sockets, and the entire room objected practically in unison that \"it's prettier this way\".\n\nFollowed by loud complaints that I was costing them valuable work time by making them shut down their PCs again for me to fix the problem. At least skirt lady wasn't wearing a skirt this time when she insisted I do the work while she remained seated.\n",
        "created_utc": 1517494097,
        "upvote_ratio": ""
    },
    {
        "title": "I can't print white text!",
        "author": "Delodien",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uisam/i_cant_print_white_text/",
        "text": "So back at my old job as a helpdesk jockey, we used to joke about hiding hidden messages on emails in white text so you can't see them unless you highlight it, stupid things to pass the time.\n\nWell today at my new (sorta) place I got to witness this first hand, almost anyway! I hate how long it took me to realise the issue in the end, I was having a bad day, or just wasn't expecting something so trivial!\n\nU: = the user and D: = me!\n\n&gt;U: Hey D, I'm looking at this old email that I need to print, but every time I do it prints the to field and things but not the actual email.\n\n&gt;D: Ok that sounds...odd...I'll come and see you.\n\nI turn up at the users desk and she shows me the email.\n\n&gt;U: It's this one, every time it prints, it's printing out different bits that I don't need - is it because it's set to confidential? Because I can't change that.\n\nShe shows me the properties of the email stating it's confidential.\n\n&gt;D: Er I don't think so, as far as I know that doesn't really affecting printing or anything, it's more just a flag like the importance selection.\n\nI click around, checking the print preview and things like that, sure enough the part of the email this user wants isn't there on the preview either, I click around for a few minutes and then I notice the issue.\n\nThis particular email was sent by an old member of staff who INSISTED on using styles and things to have fancy backgrounds, no matter how many times she was told not to, probably one of the reasons she was let go...\n\nAnyway, she'd done it to this one, a horrible purple background...and white text so you can see the body of the email.\n\nAt this point it dawns on me, Outlook doesn't print the styles of an email.\n\n&gt;D: So I think I know what it is...the old member of staff has put a purple background on it, and white text. Outlook won't print the background to save toner but it will just print the white colour text regardless, it won't change it to black.\n\nSure enough, I edit the message and change the font colour to black, print preview works fine now and it prints perfectly fine too.\n\nTL;DR - Printing white text onto white paper = white space on paper...",
        "created_utc": 1517492416,
        "upvote_ratio": ""
    },
    {
        "title": "Netnotworking: Hello Darkness my old friend",
        "author": "Phrewfuf",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ui7e1/netnotworking_hello_darkness_my_old_friend/",
        "text": "As we just got a few new colleagues and were telling them funny stories of screwups, i was reminded of this gem here.\n\n*****\n\n**Backstory**\n\nThis whole thing happened in phase two of our large automotive-simulation project which i talked about in [Snowflake Servers](https://www.reddit.com/r/talesfromtechsupport/comments/7hy00f/netnotworking_snowflake_servers/). The datacenter and amount of projects running in it grew so fast that our storage systems were full to the brim in a blink of an eye. All 10PB of it. Which of course meant more storage systems incoming.\n\n**People**\n\n$FCM: Our facility management lady. Very nice and straightforward person\n\n$C: A colleague of $FCM. He knows his way around powerlines\n\n$B: A colleague from the locations own local IT-Team, which i later become a member of\n\n$Einstein: Our storage system supplier, whose techs were installing storage\n\nand of course me as $Phrewfuf.\n\n*****\n\n0800 on the clock. $Phrewfuf has barely made it into office in time to take over troubleshooting duty. Damn traffic getting worse and worse. PC is being powered up, a cup of tea is being made. $Phrewfuf stopped trusting people to run the cleaning program on the coffee machine and started preferring a good cup of earl grey instead of a potentially moldy coffee.\n\nSipping his tea, looking through his emails our protagonist suddenly gets startled by his ringing phone. He looks at the display.\n\n&gt; $Phrewfuf: Crap.\n\nIt was the network monitoring systems number showing up. A mere computer dialing a certain phone number and playing back a recorded message to the recipient. This message being \"There is. ONE. Critical alarm.\" which meant exactly what it said. The reason was an unreachable network device.\n\n$Phrewfuf barely managed to switch his attention back to his computer screen, when the phone rang.\n\n&gt; There is. ONE. Critical alarm.\n\n&gt; $Phrewfuf: Oh no...nooonononono.\n\nThe cup of tea was swiftly placed on the table and $Phrewfuf was quickly switching his windows to show him the monitoring system. All during which he had to swipe right on the phone way too often without picking it up. It was calling for each unreachable device. It wasn't the best monitoring solution but it did the job. And the UI was a bit slow.\n\n&gt; There is. ONE. Critical alarm.\n\n&gt; *clickedy clack*\n\n&gt; There is. ONE. Critical alarm.\n\n&gt; $Phrewfuf: I KNOW! STFU!\n\n&gt; There is. ONE. Critical alarm.\n\nIt must have been a lot of devices becoming unreachable. There weren't many reasons why this could happen. A spanning tree loop, a dead building or location distribution switch, an excavator that went through a fiber line or missing power.\n\n&gt; There is. ONE. Critical alarm.\n\nFinally the alert window opened and was showing loads of red alerts, each representing a device that is unreachable by the monitoring system. Thanks to the naming scheme of \"&lt;3char location code&gt; + &lt;5 digit number&gt;\", $Phrewfuf immediately knew which location was affected. But something was odd. He took a closer look to see devices that were not mathing the scheme. The only exception to this scheme were building and location distributers. Highly redundant devices by themselves and they always were in pairs. They shouldn't go down in pairs. But they did. This was bad.\n\n&gt; There is. ONE. Critical alarm.\n\n$Phrewfuf throws on his headset and dials a number.\n\n&gt; $FCM: Hi.\n\n&gt; $Phrewfuf: Hey. What happened? *he knew she knew why he was calling* \n\n&gt; $FCM: No idea. Network isn't working over here.\n\n&gt; $C: *In the background* You did WHAT? How did you manage THAT?\n\n&gt; $Phrewfuf: What's he rambling about?\n\n&gt; $FCM: Hey, $C, what's up?\n\n&gt; $C: *In the background* They killed the power for the whole building \\#101!\n\n&gt; $FCM and $Phrewfuf: They did WHAT?? How did they manage THAT??\n\n&gt; $C: I have no idea, i need to go over there and check it out.\n\n&gt; $FCM: You heard that?\n\n&gt; $Phrewfuf: Yup. Keep me updated, i'll try to figure out why you can't access anything even though you're in a different building. Also...was that $B he was talking to?\n\n&gt; $FCM: Yeah. I'll tell him to call you.\n\nA few calls later $Phrewfuf knew what happened. And he couldn't do jack about it.\n\nThis location had two Active Directory controllers on site. They were in a nice 19\" rack amidst ~50 other racks in a server room. In building #101.\n\nMost of the ~50 racks in the server room were empty and offerend enough rackspace for a storage cluster. $B was supervising a few $Einsteins who were busy installing all the hardware into the racks. And what has to be done with expensive hardware that was physically installed into a server room? It needs to be turned on. Five 40HU racks of hard drives powering up nearly at the same time shouldn't usually be a problem in an enterprise environment. \n\nUnless someone screwed up when distributing two runs of three-phase power and managed to distribute them fairly unevenly, causing highly asymmetrical load.\n\nThe storage cluster was powering up, one node at a time, until one of the three-phase lines was loaded hard enough to trip the fuses. The kind of fuses where you need two hands to reset each. This of course didn't down the cluster, it had redundant PSUs. The cluster happily switched over to the secondary PSUs, suddenly putting all load onto the second line, causing its breaker to trip aswell.\n\n&gt; There is. ONE. Critical alarm.\n\n*****\n\n**Aftermath**\n\n&gt; $FCM: And that's how they managed to kill all power in the building.\n\n&gt; $Phrewfuf: And then?\n\n&gt; $FCM: Well, $C went over there to reset the fuses, but he couldn't. \n\n&gt; $Phrewfuf: How come?\n\n&gt; $FCM: Well...he said he never seen such a huge fuse become that hot. It was hot enough that he couldn't even touch it. They had to pull all the cables of the new storage cluster with flashlights in their hands anyways, so that was enough time to let the fuses cool down enough to pull them out. All during which the whole location of 3500 people couldn't work at all for most of the day.\n\n&gt; $Phrewfuf: Holy hell. I've heard someone had to write an 8D-Report. And central IT obviously has to move one of the AD-Controllers to another building.\n\n&gt; $FCM: Yeah, who would have thought that having two ADCs doesn't mean they're fully redundant? And the poor electricians who had to rewire half of the room.\n\n**TL;DR:** \"There is. ONE. Cluster fsckup.\"\n\n*****\n\nPrevious Stories:\n\n* [Don't do the thing - Oops, i did the thing.](https://www.reddit.com/r/talesfromtechsupport/comments/4eqzlr/guys_dont_do_the_thing_it_breaks_stuff_oh_i_did/)\n\n* [Snowflake Servers](https://www.reddit.com/r/talesfromtechsupport/comments/7hy00f/netnotworking_snowflake_servers/)\n\n* [Personality issues](https://www.reddit.com/r/talesfromtechsupport/comments/7ie176/netnotworking_personality_issues/)\n\n* [Internet of Sh...](https://www.reddit.com/r/talesfromtechsupport/comments/7juazk/netnotworking_internet_of_sh/)\n\n* [Wait for it...](https://www.reddit.com/r/talesfromtechsupport/comments/7oyi52/netnotworking_wait_for_it/)",
        "created_utc": 1517485671,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't see that that matters\" or, Anpassungburo and the Sorcerers Tablet",
        "author": "anpassungburo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7ui04g/i_dont_see_that_that_matters_or_anpassungburo_and/",
        "text": "So I used to work in the frontline IT dept for a major multinational - we supported our own staff, not members of the public using our services. Despite this we had a \"customer service\" mentality, due to the sheer volume and scale of the company.\n\nWhich led to conversations like the one I am about to tell you, for your edification and enjoyment.\n\nA woman, let's call her Teach, rings up. She is training her new starter, let's call him Bambi. She cuts through my introductory pleasantries to tell me Bambi can't get his new laptop to work. I ask where they're getting stuck; will it not power on? Does it display an error message?\n\n\"I don't know can you ask him\" she replies. I pause, meditating on this riddle, before pointing out that she is sat next to him and could ask him directly, at least as a workaround until I develop telepathy. She sighs and insists she does not have time for this. I ask if she can see his screen from where she is sat and she says \"obviously not\". To be fair, why would Teach be sat anywhere near the person she is meant to be training? Despite the answer being obvious, I am an idiot and cannot divine the answer, and so ask her anyway why she can't see the screen. \"Because he left it at home\" she confidently asserts. Of course! Why would Bambi bother bringing his work laptop to work? \n\nI believe by this point I have figured out the problem. If Bambi has never used his laptop in our office, it will not be set up properly on non-office networks. The only solution is for him to bring the laptop in and log in to it in the office, at which point our system recognises him and he can work remotely.\n\nTeach has other ideas. \"Can't you send a command to it to make it work?\" she demands. I explain to her that no, our systems don't work like that as per the new recruit documentation, and even if we had zero security and it was really that easy, if the laptop is turned off in the bottom of a cupboard somewhere we can do nothing. We cannot check the error message, we cannot guarantee it will connect to any network to receive anything we send it, and we have no way of verifying with Bambi directly what is going on as apparently he hasn't completed the \"speaking to other humans\" training module yet.\n\n\"Can't you turn it on remotely?\" Teach demands. I explain that that would be amazing because it's a laptop and if I could do that I wouldn't be working frontline IT support. She insists that it's ready to turn on, and I again explain that it is currently turned off and I have as much chance at connecting to it as I do a bench or a Lego, and even if I could power it on from afar like some kind of Wi-Fi Djinn there is nobody there to grant me remote access or bypass the offline lock system we use.\n\n\"I don't see that that matters\" she insists, \"but I don't have time for this\" and hangs up the phone. \n\nTwo hours later her manager emails me asking why Bambi can't use his laptop. My manager calls him and explains what has gone on. In the end it turns out Teach has no less than three new starters stuck as she told them to leave their laptops at home \"since they don't work\". We arrange to call the team back once they have their machines in the office and when my colleague calls back, the manager picks up and explains he is now handling training directly.\nGuess Teach has plenty of time on her hands now!  \n\n\nTL;DR user thinks we are being difficult when we ask her to turn on/ be in the same rough postal code as the problem computer, her manager gets annoyed with her and takes over her role ",
        "created_utc": 1517482957,
        "upvote_ratio": ""
    },
    {
        "title": "Helpdesk not helping the problem",
        "author": "fxdil",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uhvsv/helpdesk_not_helping_the_problem/",
        "text": "To preface, English is not my native language so apologies for any mistakes. I work as a Onsite Support for a Finance company. At my workplace, to supplement the usual tickets, manglement has implemented a system of over the counter support. Think Apple Store; where users could bring their problematic laptops over and receive support on the spot.\n\nSo onwards to the story. \n\n*I was manning the counter on that fateful day; minding my own business wondering why time was moving unusually slow, when a user came over.* \n\nShe said she wasn't receiving any emails. I proceed to have a look at her machine. True enough, no emails for the past half an hour. Tried sending a test email to herself, nothing. Hmm. At this point I scrolled down to see her Outbox contained a few emails, as well as the one I just sent. \n\n*At this point couple more users showed up and stood in line. There were murmurings of not being able to send emails..*\n\nMoved over to my own machine, to confirm my suspicions. Yup, nothing in nor out. Picked up the phone to call our Helpdesk to see if our Exchange servers were down, but was only met with the standard busy automated message. So I texted one of the agents instead;\n\n&gt;Me: Hey, is Exchange down? Me and a few users are not able to send nor receive emails.\n\n&gt;HD: Hey. Yeah it's down, no one can get through. And for the few that did, it takes more than 15 minutes to get a single email through. \n\n&gt;Me: Does Mail Support team know about this?\n\n&gt;HD: Yup. They're working on it right now. Apparently a user accidentally sent a large attachment over email to a huge distribution list and it's now choking everything.\n\n&gt;Me: Alright then, I'll inform my users over here. Also, you guys should change the automated message to inform people of the Mail outage when they call your hotline.\n\n&gt;HD: Oh, we just sent out a company-wide email to inform them of it.\n\n&gt;Me: Wait. You guys sent out an email, whilst the emails are still down..?\n\n&gt;HD: Yes..\n\n&gt;Me: ...\n\nAt this point, I informed the user I'm attending to of the outage, how the Mail team is working on it, and to just give it time. She took that as a sign for a break and left her laptop with me. The other two who were in line overheard, and merrily made their way back to their offices knowing they didn't have to do work in the meantime. \n\nAfter about half an hour we received news that the queue has been cleared and to test it out on our end. The user came back with her coffee and we did a confirmation that indeed all was working again. ",
        "created_utc": 1517481233,
        "upvote_ratio": ""
    },
    {
        "title": "Son... Thank You for Fixing the Problem",
        "author": "atrayitti",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uhf4v/son_thank_you_for_fixing_the_problem/",
        "text": "Most of the time, tech support for family is a nightmare. Usually it's mundane fixes that have been done zillions of times before. More often than not, it's fixes that you've literally made instructional PDFs for (with pictures). Maybe it was the blood moon, maybe it was the plex gods smiling upon me, but sometimes... Sometimes things just work in your favor for a change.\n\n\n**BACKSTORY** My father is a man of routine. He's been a teacher at the same school, in the same classroom, for 30 years. Every evening, after watching the news, he sits in the same chair and watches a movie from his collection. While he has over a hundred films, he tends to gravitate to the same few time and time again. Now that all the kids have left the house, my mother is slowly going insane from watching the same movies every week. In an attempt to preserve her mental health (and do something nice for my old man), I set him up with an expansive plex media server and offer limited support. We've all done tech support for family before, especially parents. We love them, and it's why we do it... But every time I have to restart the service, I die a little on the inside. If only all our interactions could go like this latest service did...\n\n**Last Night:**\n&gt; $Dad: \"Left message on your phone about plex being down and your mom and I can’t reconnect. I’m very sorry to disturb you.\" \n\n&gt; $Me: \"Probably no time to fix it today, cool if I take a peak tomorrow? \n (slow shake of the head, prepare for another system restart, maybe a plex update)\n\n&gt; $Dad: \"No worries.\"\n\nNot 24 hours go by and I'm surprisingly greeted by this exchange:\n\n**Earlier Today**\n&gt; $Dad: \"My son, Thank you for fixing the problem. You will need to show your mom and me how to fix it when you come home in a couple of weeks. 👍❤️\"\n\n&gt; $Me: \"So it's fixed?\"\n\n&gt; $Dad: \"I have not tried a movie yet but after the news I will see. All I know is that the movies are up, something that wasn’t there last night.\"\n\n&gt; Me: \"Let me know\"\n\n&gt; $Dad: \"It works! Thanks again son.\"\n\n&gt; Me: \"Great, cause I did exactly nothing to fix it!\"\n\n**TL;DR:** Dad wants me to fix a problem with his plex media server. Issue fixed itself overnight (probably just needed to reconnect to the server), I still get credit for being the good son.\n\nNow if only all tech support could be resolved in such a pain free fashion...",
        "created_utc": 1517474466,
        "upvote_ratio": ""
    },
    {
        "title": "Tales of the I'm Not Paid For Tech Support Guy: How did it get like that?",
        "author": "taumason",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/7uhb8r/tales_of_the_im_not_paid_for_tech_support_guy_how/",
        "text": "Background: I am a long time night manager for various warehousing and logistics companies. Along with this has come a certain degree of expected technical savvy. I am not paid for tech support, but since most companies I have worked for were too small, too cheap, or too stupid to have on call IT support at night I end up being night shift tech support.\n\nThe players: $Me (svelte, beautiful, hardworking, intelligent me), \n$C1 clerk #1 decent fellow hard working semi tech saavy. Comes in at 4 AM.\n$C2 clerk #2 could be described using a variety of pejoratives. Starts at 3 AM is generally not quite but almost useless.\n\n$C2 is habitual slacker, and since she works independently not in main warehouse office she get up to all kinds of shenanigans. One day towards the end of my shift I realize that $C2 hasn't done anything she is supposed too that morning. I check cameras and yes $C2 is in her office. I ask $C1 if he knows whats up, $C1 says no but he will find out since he has to call $C2 about some paperwork. 2 minutes later.\n\n$C1: Her computer is down\n\n$Me: What do you mean down?\n\n$C1 she says it wont start.\n\n$Me: Wait, she's been here an hour and half without her pc working and this is the first time she is saying anything?\n\n$C1: yep\n\nAfter a few moments of headdesk I head over to see what the problem is.\n\nThe Scene: $C2's monitor is on but the pc is not. There is a power strip on the desk with two things plugged into it. One is a usb phone charger that is plugged into her phone and other looks like the monitor cord. $C2 has a VOIP phone, high volume printer, a fax/copier/printer, an automatic stapler and UPS in addition to the PC and monitor. \n\n$Me: Hey what's the problem?\n\n$C2: Oh my computer is broken. (as they turn down the volume on their phone)\n\n$Me: Really? Huh, ok. Next time your PC goes down notify a supervisor immediately. \n\n$C2: But its not my fault!\n\n$Me: Doesn't matter. It's not going to get fixed if no one knows about it. Plus we have other workstations in the main office you can use one of those.\n\n$C2 begins to pout and I get to work. A quick attempt at a power cycle doesn't work so I lean over the desk to examine our cord situation. I am greeted with the lovely smell of lemon cleaner of some sort. Lemon cleaner that has been used to scrub the power strip, the only thing besides the monitor and her immediate work space without any dust on it. Once my eyes stop watering I see the true source of the problem. Someone has completely borked the power cord setup. The fax printer and power strip are plugged into the wall outlet. The pc and high volume printer are plugged into the UPS which is plugged into nothing. \n\nThe phone charger cord is short and so is power strip's. $C2 clearly unplugged everything so she could rearrange it to have the power strip on the desk so her phone charger would reach her.\nI unplug the phone charger which causes $C2 to throw a fit about needing her phone charged in case her kids call. I point out that she has a perfectly good VOIP phone sitting on her desk. Then tell her if its really important she can plug it in across the room where there is an unused outlet. $C2 commences pouting and I fix cordage to what I think it was meant to be (Monitor/PC/Fax on UPS, high-volume/automatic stapler on power strip). \n\nNow when I try to tell $C2 that she should not mess with the cords, she insists that 'it was always like that' and she was fine yesterday. When I point out it wasn't always like that because her UPS would drain in a few hours she tells me 'IT was here yesterday messing with it it must have been them'.\n\nAfter powering up and having her log in I open the IT help portal and fill out a ticket with her there where I put all of her statements in the comments for the ticket. She keeps insisting I don't need to do this and she does not want 'to start trouble for anyone'. I calmly explain that yes I do need to, because IT needs to double check my setup and ensure I didn't make any mistakes. Also if they are screwing up while conducting maintenance they need to rectify their problem and they certainly should not be using liquid cleaner on the power strips.  $C2 looking quite mortified went to work earnestly and asked me if I saw the shop steward to send him her way. \n\nAftermath: Our 3 man IT team sent her a sternly worded reminder that they BCC'd me on. It informed her that yes the cameras in the warehouse that watch her office window (for handing in paperwork) can see into the office. And in point of fact can see if the person sitting at the desk is messing with the cords. It also informed her that the power strip had been changed and under no circumstances were cleaning products to be sprayed on the electronics.    ",
        "created_utc": 1517472827,
        "upvote_ratio": ""
    }
]