[
    {
        "title": "I want my two dollar tip back",
        "author": "Hipsterswaggins",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j7791/i_want_my_two_dollar_tip_back/",
        "text": "Normal night like any other a guy orders three pizzas I take it out to him and he tips me two dollars on card Ok cool\nI get back to the store and apparently one of his pizza’s had the wrong toppings on it, so I take him the remake it’s down the street so no big deal we get t swamped out and he says “I want my two dollar tip back” I explained to him that it was on card and I didn’t have the actual cash yet but he just wasn’t having it, so I gave him the two dollars out of pocket, granted it was kind of my fault since I didn’t check the pizza’s in the bag. But oh well, it’s just two dollars",
        "created_utc": 1513043013,
        "upvote_ratio": ""
    },
    {
        "title": "I Punted a Pizza",
        "author": "GeriatricIbaka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j6bie/i_punted_a_pizza/",
        "text": "This is the story of when I punted a customers pizza in front of him. \n\nI was closing one night and we were down to our last hour when I got a delivery to an apartment complex. I pulled into the apartment complex and left my car in the drive way. I knocked on the door. No answer. I rang the door bell. Nothing. After a minute, when I was just about to leave, a car pulls up to the curb and drops off a man--my customer. The car pulls away. \n\nAs the man approaches me, I can tell he is intoxicated. \"Move your car,\" he says. \"What?\" I say, \"I'm here with your pizza.\" \"Move it.\" \"I'll move it permanently after you pay for this pizza,\" I tell him sternly. I couldn't understand why he wanted me to move my car when he was dropped off and didn't have a car. \"Move your car or I'm not paying for the pizza.\" I sigh and proceeded to move my car. When I got out and started heading in his direction, he yelled at me, \"you know, the bigger the are, the harder the fall\" (a reference to the fact that I was a much taller/bigger guy than him). Now, my blood is boiling. I can't stop the anger. I respond, \"no, it's the smaller they are, the harder they get their ass kicked.\" I take his pizza out of the hot bag and I punt it in the air. I got great hang time. I get in my car and drive away. When I got back to the store, my manager already knew. Luckily, he was one of my good friends and since no one was there to hear about it, it wasn't hard for him to save my job. He remade the order and I delivered it to the same guy, who had sobered up a bit by this time. He apologized to me and paid for the pizza.",
        "created_utc": 1513034623,
        "upvote_ratio": ""
    },
    {
        "title": "Hidden cameras and microphones",
        "author": "tightxeyes",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j5x68/hidden_cameras_and_microphones/",
        "text": "So I work at one of the bigger names, and learned that there are hidden microphones throughout the store, which eventually leads to ownership asking questions about conversations amongst workers. I knew there were hidden cameras, but I just find this weird. Just wondering if this is present at other stores or places as well? \n\nUpdate: looked through what I had to sign, and don’t see a consent form for the recordings. This is insane. ",
        "created_utc": 1513031047,
        "upvote_ratio": ""
    },
    {
        "title": "Got sick and they still want me to come in....",
        "author": "The_Amazing_Shlong",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j50an/got_sick_and_they_still_want_me_to_come_in/",
        "text": "I’m not really sure what to do right now. My throat was feeling funny last night but I kinda dismissed it and this morning I woke up completely stuffed up, throat feels tight and I’m sniffling and coughing. I don’t know what I have but my sister has the flu so I’m worried about that.   \n\n  \nAnyways I’m supposed to work at 5 tonight and I called at like 11 to say I was sick. My manager literally said “you don’t sound sick” and told me I’d have to start texting people to see if they could cover me. Alright cool. Well out of the people that aren’t already working, some of them have finals this week and can’t work. So yeah everyone I tried said no for some reason or another. Manager said if I can’t find anyone I’d have to get a doctors note. Every clinic in this area is saying the wait time could be a few hours.   \n  \nI get that it’s short notice and I feel bad about that, but I can’t help getting sick like this. I really don’t want to work tonight, not just because I feel terrible but mostly because....well I don’t need to be around food right now. What the hell do I do??? Would you be okay knowing one of the people that touched your food and prepared it was sick?   \n  \nAt this point I would hate to be a dick but I’m almost ready to just accept whatever punishment I’ll get for not coming in because again this is straight unsanitary. I gave them as much time as I possibly could have. I constantly work 5 days a week and I don’t think I’ve ever called in.",
        "created_utc": 1513023915,
        "upvote_ratio": ""
    },
    {
        "title": "I fucking love this job.",
        "author": "imapieceofshitAMA",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7j0ebh/i_fucking_love_this_job/",
        "text": "I was a delivery driver for 3 years at Pizza Slut, quit working there due to really poor management (I worked mornings and when I was supposed to be off at 5, I'd be lucky to get off at 7-8, I got really tired of that) and got a new job working retail making minimum wage. I missed delivering so bad. The tips, the freedom, the podcasts and music, all of it. Anyways, I worked retail for about a year and a half and eventually decided that the only reason I wasn't still delivering pizzas was because I was too lazy/anxious to go apply for a new job delivering. Anyways I did in fact get a job working for a mom&amp;pop place that's insanely popular in my area. I guess the reason I'm making this post is that I've been working at this place for three months now and more often than not I get home and count my tips and such and realize that I made a little over $30 an hour. It's insane how well this job can pay. So yeah if anyone's wondering wether or not to go for it and get a job delivering, I would 200% say go for it (as long as you're making at least minimum wage the whole time that is). ",
        "created_utc": 1512972863,
        "upvote_ratio": ""
    },
    {
        "title": "Does Papa Track actually work?",
        "author": "thealphateam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ivcw6/does_papa_track_actually_work/",
        "text": "Sorry if it’s the wrong topic for this sub, can’t think of where else to ask it. \n\nI order from Papa Johns often. Is there “Papa Track” accurate? Do the employees actually tag the order at every step of the process (making, baking, boxing...etc) or is it just an estimate?",
        "created_utc": 1512928126,
        "upvote_ratio": ""
    },
    {
        "title": "(warning: politics) A proposed US Department of Labor regulation would allow any business that employs tipped employees to keep ANY AND ALL tips that bring a tipped employee's hourly income over the federal minimum wage",
        "author": "Fellidae",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7iti67/warning_politics_a_proposed_us_department_of/",
        "text": "Just as the title says. A proposed regulation from the US Department of Labor would allow employers to keep employee tips in excess of the federal minimum wage. That means, if you already live in a state that has a minimum wage that is higher than the federal minimum wage regardless of whether a position is tipped or not but don't prohibit employers from obtaining tips received by employees, your employer would have the ability to withhold all of your tips (that you report to them, of course... heh). The bill specifically allows employers to decide what to do with the tips, ostensibly to allow tip pooling, but without requiring the tips be redistributed to the employees. I know that politics isn't usually something that's discussed on this subreddit, but I thought this would be relevant to the people who the people who frequent this subreddit. If you're not involved in politics, it might be worth it to you to at least consider voicing your opinion to your representative on this matter. The source below has more information on the proposed regulations.\n\nSource: https://www.washingtonpost.com/news/food/wp/2017/12/07/the-trump-administration-proposes-allow-tip-pooling-in-restaurants-critics-call-it-stealing-workers-wages/\n\nIf this isn't the place for this, go ahead and delete this, but I sincerely believe this to be information that delivery drivers need to know about.",
        "created_utc": 1512906260,
        "upvote_ratio": ""
    },
    {
        "title": "Are Sundays crap for anyone else?",
        "author": "sweetiejam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7is91i/are_sundays_crap_for_anyone_else/",
        "text": "Every Sunday night I've worked since I've started has been super shit in tips, I've never gotten more than $30 for a 4 hour shift when i can usually get at least $40ish on a weeknight. Is it a church thing???",
        "created_utc": 1512885683,
        "upvote_ratio": ""
    },
    {
        "title": "How you guys deal with wrong orders?",
        "author": "aznology",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7is3ls/how_you_guys_deal_with_wrong_orders/",
        "text": "Basically this? How you deal with wrong orders? And cold shit and customer complaints? Also how to do refunds ?",
        "created_utc": 1512883542,
        "upvote_ratio": ""
    },
    {
        "title": "any interesting regulars?",
        "author": "woolsey1977",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7irvr7/any_interesting_regulars/",
        "text": "we have a guy order a crap ton of wings and give you a 'are you sure?' kind of tip. except all he weares is a bathrobe that im told once resembled a color other than stained. and his ability to care how covering the robe is can very greatly.\n\nto be fair he is never creepy and is quite polite. i think the consenses at the store is poorly/inconsistently treated mental illness",
        "created_utc": 1512880668,
        "upvote_ratio": ""
    },
    {
        "title": "I Finally Snapped",
        "author": "LimpCush",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7irn5g/i_finally_snapped/",
        "text": "I did it, guys. The ultimate no-no as a delivery driver. I flipped off a customer. Here's the story:\n\nI'm the Wednesday closer for our town's pominos. Well, we have this paper factory in town, which is also a reject farm, because the only people that get jobs there are heroine addicts and people looking for a job to get fired from, so they can go back to collecting unemployment. It just so happens that at least one person from said paper factory needs fucking pominos every Wednesday, because they can't be bothered to pack a sandwich. Of course, nobody tips there.\n\nSo this last Wednesday, I get an order there and I know the stiff is coming. We all know when the stiff is coming. Problem is, this is my third stiff in a row. I'm already in a pretty bad mood and when I get there, this fucking idiot makes me wait a few minutes, then comes dancing along, picks up his half off pizzas and writes a huge line through the tip on the receipt. Then, with a smile, he says, \"Have a good night.\" He then dances away.\n\nWell fuck you, buddy. FYI, I'm not having a good night. So I walk away, then turn around and flip him off. He didn't see me, but his co-workers did and at this point, I'm just so pissed, so I point directly to him and flip him off again, ensuring they realize he stiffed me.\n\nNeedless to say, he wasn't happy when he found out. I know I shouldn't have done it and I definitely do regret it, but sometimes you've just had all you can take. My life and my wages suck enough, without this tool bag jovially declaring I'm not worth a single dime. So fuck you, shit head.\n\nThankfully I still have a job.",
        "created_utc": 1512877677,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else hate 50% off week?",
        "author": "LastandLeast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7iri7h/does_anyone_else_hate_50_off_week/",
        "text": "My tips always suck that week and we're always busy enough that we keep running out of things. ",
        "created_utc": 1512876018,
        "upvote_ratio": ""
    },
    {
        "title": "THANK YOU!!!!!",
        "author": "Mg-Read",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ir93i/thank_you/",
        "text": "Just enjoying a delivery and thinking how grateful I am for all of you!  You have seen the best and the worst of humanity.  Truth be told, there were days when I simply couldn’t wrap my head around making dinner and pizza delivery really took the pressure off and let me be a better parent.  I truly appreciate you.  ",
        "created_utc": 1512873047,
        "upvote_ratio": ""
    },
    {
        "title": "Question about tipping",
        "author": "richsaint421",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ir79d/question_about_tipping/",
        "text": "Okay so I tip what I consider to be pretty well, generally on any order under $20 about $5, above that then $6 or so.\n\nWhat are your tips normally like on a per order basis? I’m honestly curious.  I was thinking about it earlier, on one side $5-$6 seems pretty good (and I’ve had a couple of pizza guys walk away muttering “holy crap that’s the best tip of the night” but I guess what I’m questioning is, is that a good tip? Is 15% good? 20%? If someone makes a large order, say 4 pizzas and $60 do they tip substantially more? Would you rather get several smaller orders or one big?\n\nHonestly I guess these are just a bunch of questions I’ve had for a while. I used to work at a pizza place but never delivered....it was also almost 20 years ago.",
        "created_utc": 1512872468,
        "upvote_ratio": ""
    },
    {
        "title": "If you're going to order food.",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ioiv7/if_youre_going_to_order_food/",
        "text": "If you're going to order food TO YOUR HOUSE!!, why the hell are you leaving it when you know you have food coming.\n\nIf I have to call you because you're not home and then you tell me to wait because you're not home.(which I was already doing at this point that's why I called you last resort).  You bet your ass I will be pissed off, seriously just be home when you order food it's hella rude to do that shit man.",
        "created_utc": 1512845068,
        "upvote_ratio": ""
    },
    {
        "title": "I've just got to stop reading the Customer Feedback",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ilstd/ive_just_got_to_stop_reading_the_customer_feedback/",
        "text": "[deleted]",
        "created_utc": 1512810627,
        "upvote_ratio": ""
    },
    {
        "title": "I once saved a Mr. Jim's from burning down",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7iiona/i_once_saved_a_mr_jims_from_burning_down/",
        "text": "The place had just opened. The owner was the only manager and he was never there so the 16 year old cooks were always fucking off and doing dumb shit.\n\nOne time I come back from a delivery and there are flames shooting out of the oven and all of the kids are just staring at it slack-jawed.\n\nI get the spatula and push the burning pizza out of the oven and smother it.\n\nApparently they had made a \"double-decker\" pizza with hand tossed crust on the top and the bottom and a ton of toppings in the middle and of course, it got stuck.",
        "created_utc": 1512773484,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone pranked on a delivery?",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ig41n/anyone_pranked_on_a_delivery/",
        "text": "Pranking on YouTube wasn't a thing in my day.  Worst that happened was some kids sprayed me with the hose.  I gotta imagine [this kind of thing](http://www.thewebcomicfactory.com/comic/tales-of-pizza-pizza-prank/) happens a lot more often now.  Who out there was pranked?  And I hope they followed it up with an amazing tip if you did.",
        "created_utc": 1512750994,
        "upvote_ratio": ""
    },
    {
        "title": "Dominos failed me yesterday",
        "author": "AcidBathVampire",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i84mv/dominos_failed_me_yesterday/",
        "text": "Order a large Meatzza and a 2 liter Fanta, asked for one garlic cup and one mango habanero cup. Put in the instructions (You know, the ones nobody ever looks at) \"press the buzzer or call.\" 50 minutes goes by with no sign of anybody. All of a sudden my phone rings. D=Dominos manager, M=Me.\nD-Hey, this is Dominos, our guy said he went there and no one came out.\nM-did he call or press the buzzer? \nD-no, he doesn't have a phone. He says he knocked on the door.\nM-well, there's your problem. This is an apartment building, with 8 units. The front door leads to a stairwell. That's why I said \"press the buzzer.\"\nD-ok, we'll send him back out. \n\nAnother 45 minutes goes by, while we finished watching Ghostbusters, finally the buzzer goes off and I go down to get...a cold, thin crust, Philly steak pizza, 2 liter Fanta (The only correct thing) and no garlic or mango habanero cups.  I was pretty pissed, gave the guy a buck and change for a tip and felt not even a little bad about it. It made me see bad tips (assuming they're not from a serial bad tipper) in a new light. ",
        "created_utc": 1512668474,
        "upvote_ratio": ""
    },
    {
        "title": "Should the GM get some of the (inside) tips?",
        "author": "tactics14",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i42mr/should_the_gm_get_some_of_the_inside_tips/",
        "text": "So I'm the GM of my pizza shop. Obviously if it's just me working I keep all the tips that come in.\n\nNow on days where it's me and a cook working inside things get tricky. Do I give them everything from the tip jar, because I'm management and make much more than the cook? Or do I evenly split it because I'm busting my butt just as hard (well, honestly twice as hard) as the cook?\n\nRight now I split tips and if we have an odd number of dollars give the extra to the cook rather than split it into change or anything. But I do feel a little guilty, but at the same time I ain't rich either and $5-20 in my pocket extra adds up over time. \n\nWhat's standard at your store for insiders? ",
        "created_utc": 1512622122,
        "upvote_ratio": ""
    },
    {
        "title": "What are some decent podcasts to listen to?",
        "author": "NoFlippingWhey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i3a5n/what_are_some_decent_podcasts_to_listen_to/",
        "text": "I take a bunch of rural deliveries and love to relax and listen to podcasts on my way to and from.\n\nI'm a fan of The NoSleep Podcast and The Last Podcast On The Left, so anything like those 2 are a huge plus.\n\nEdit: not sure why the downvote, but okay lol.",
        "created_utc": 1512613838,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone ever had customers asking for coin changes back?",
        "author": "Warchief_X",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i29ns/anyone_ever_had_customers_asking_for_coin_changes/",
        "text": "This happened to me about 2 times, one of them even lead to a 1 star review for the restaurant. Customer's total was like lets say $29.73. Gives me $30.00 cash and asks for $0.27 back.. \n",
        "created_utc": 1512603924,
        "upvote_ratio": ""
    },
    {
        "title": "Almost jumped",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i0jj8/almost_jumped/",
        "text": "[deleted]",
        "created_utc": 1512588883,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to become a delivery driver",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7i0247/trying_to_become_a_delivery_driver/",
        "text": "[deleted]",
        "created_utc": 1512585081,
        "upvote_ratio": ""
    },
    {
        "title": "Thin crust calzone",
        "author": "bwoodz552",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hyw66/thin_crust_calzone/",
        "text": "We have a two small two topping pizza or calzone coupon that we offer, and a guy called in yesterday asking me if he can do one of each. I let him, and he tells me he wants both of them thin crust. I tell him, of course, the pizza can be thin crust but it’s just not possible with a calzone. He says, “but on your website it said I could.... ugh, never mind that’s fine”. This dude was actually about to argue with me that it’s possible to make a thin crust calzone. ",
        "created_utc": 1512575410,
        "upvote_ratio": ""
    },
    {
        "title": "We don't deliver to people without phone numbers",
        "author": "snuggleouphagus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hvray/we_dont_deliver_to_people_without_phone_numbers/",
        "text": "I got a complaint the other night. She was complaining about [nearby location]. I steeled myself because we get 2-5 complaints about nearby location a week. The person running it is a close friend to several higher ups so they never get in trouble for things that would normally add up to separation. \n\nLady calls and wants to make a complaint. Ok. Another location refused service because she wouldn't give her phone number (due to the high number of phone scams(????)). I explain that while she should be treated with respect and dignity, our computers cannot process delivery orders without a phone number. She keeps ranting about how she's boycotting and will call corporate. I explain that I'd prefer a different solution, but since her beef is with a store in another district, i cannot escalate her issue and I will face zero repercussions for the incident. I offer the corporate complaint line and she refused. She wants more reasons why we require phone numbers and I explain that if her doorbell dies, a product is unavailable, etc we need it. I also mention it's a safety measure. She hangs up. \n\nShe calls back. How is it a safety measure when I got no idea who will deliver my pizza. He might show up with a rifle in hand!\n\nAt this point I politely end the call. Less than a month ago one of my drivers was shot in a robbery. Driver is fine now but security precautions exist for a reason. I will not send my driver to a shady neighborhood without a phone number. Customer kept saying \"legally you can't require a phone number\" until I told her that no we can't legally require a phone number but legally we don't have to send pizza to anyone. This was mind blowing. ",
        "created_utc": 1512535659,
        "upvote_ratio": ""
    },
    {
        "title": "Shitty addict coworker acts shitty",
        "author": "plantslut_",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hugvk/shitty_addict_coworker_acts_shitty/",
        "text": "Had a manager who was a typical south side asshole where I’m from. He often would get upset when people ordered things specifically for any reason not related to food allergies. Vegan or religious reasons didn’t matter to this guy. One time I found out AFTER delivering a pizza he had intentionally ripped up sausage and mushed it into the sauce before cheesing, just because someone requested their food not touch any surfaces that had touched meat, I believe for kosher reasons or some religious reason I can’t remember now. \n\nI didn’t call them or anything because I was a dumb 19 year old and didn’t know how to deal with my manager being a POS. I should have called corporate so many times for this company. I feel like since they didn’t call, they didn’t notice and i hope they didn’t get sick from consuming something they didn’t want to. I feel super shitty about it now. \n\n\nAnyway that guy did a shitty thing. Got away with it. A few months down the line, he got caught nodding off in the bathroom of our other location with a needle in his arm. He only got fired because the coworker who caught him called corporate, as the franchises owner was a creep as it was and didn’t want to fire ‘good’ employees over their problems with addiction. \n\nUgh I do not miss the people I worked with, but I do miss that job and how mindless it was.",
        "created_utc": 1512522606,
        "upvote_ratio": ""
    },
    {
        "title": "Boneless pizza.",
        "author": "NoFlippingWhey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7htnf0/boneless_pizza/",
        "text": "Has anyone else recieved this request? We still recieve it, even though it's an oldish meme.\n\nFucking internet lol.",
        "created_utc": 1512515198,
        "upvote_ratio": ""
    },
    {
        "title": "I Thought You Folks Might Like These",
        "author": "AlbusQ",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hs27c/i_thought_you_folks_might_like_these/",
        "text": "I hang out on TheChive as well and found some of these pretty amusing.  Hope I helped put a smile on some or all of your faces today :) \n\nhttp://thechive.com/2017/12/05/pizza-delivery-requests-that-were-taken-very-seriously-33-photos/",
        "created_utc": 1512501783,
        "upvote_ratio": ""
    },
    {
        "title": "I got to use sign language with a deaf customer!",
        "author": "IEATTURANTULAS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hqfwp/i_got_to_use_sign_language_with_a_deaf_customer/",
        "text": "I've been trying to learn sign language and I finally ran into a person who is deaf. This customer had instructions to text her when I arrived so I did and thought nothing of it. She didn't say anything but barley mumbled what sounded like thank you as she walked away. It clicked my head what was going on and I said \"Mamn wait!\". I realized she couldn't hear me and felt like an idiot so I tapped her shoulder as she was walking away. I signed \"I know a little sign, thank you, goodbye\". She smiled and was suddenly very expressive. I think she said, \"You know how to sign?\" and I badly signed \"yes a tiny tiny bit\". She smiled and I kinda implied that would be the end of my signing knowledge so I waved happily and mouthed \"have a good night!\" \n\nI'm going to study really hard and learn more for her next time. It was really fun to see her light up and sign with me, even if I'm terrible and only know 3 sentences.",
        "created_utc": 1512488360,
        "upvote_ratio": ""
    },
    {
        "title": "Lost a tip because we don’t take checks",
        "author": "msciel",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hoq0v/lost_a_tip_because_we_dont_take_checks/",
        "text": "I was having a bad couple of days at work. Worked Friday and Saturday and barely made enough in tips to cover the gas I used. So Sunday comes around and I hope the skipping or just-got-out-of-church crowd may tip a little more.\n\nThey did not. But I get to a house with a delivery and the guy answers the door holding a check and a $5 bill. I apologize for the inconvenience and tell him I can’t take checks. He gets huffy and says he always pays with checks and asks when we stopped. And I tell him we’ve never taken checks for delivery since I worked there (slightly not true but I’ll get to that). \n\nSo he calls the store and pays with his card. Then he turns to his daughter and says “put this back in my wallet” and hands her the card and $5. So even though his food got there on time I guess the two minutes it took him to call the store meant I had given him bad service or something. \n\nI have two points to make. 1) I do not run pizza place. I get paid by pizza place to follow their rules. Don’t act like I’m being a dick because I’m doing as my employer asked me. 2) we did take checks for a 2 month period. Of the 10 checks we got 8 of them bounced. So if 80% of people are gonna write bad checks/not keep up with their bank balance, you should be more mad at them than pizza place. We’d love to take your money in any form honestly. \n\nTLDR: guy couldn’t pay with a check so he revoked the tip he was going to give me",
        "created_utc": 1512467937,
        "upvote_ratio": ""
    },
    {
        "title": "People smoking weed while their baby is in the same room...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hoc68/people_smoking_weed_while_their_baby_is_in_the/",
        "text": "[deleted]",
        "created_utc": 1512461757,
        "upvote_ratio": ""
    },
    {
        "title": "Stiffed 3 times in a row!!",
        "author": "NoFlippingWhey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hna6j/stiffed_3_times_in_a_row/",
        "text": "That's it. I wanna quit.\n\nJoking, of course.. I wanna go home now, though. lol.. 2 more hours.\n\nWhat places/types of people do you despise delivering to because you know of the inevitable stiff?\n\nFor me it's nurses stations. ",
        "created_utc": 1512448060,
        "upvote_ratio": ""
    },
    {
        "title": "“I never had to pay extra before!”",
        "author": "SherlockIsTheName",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hn4ps/i_never_had_to_pay_extra_before/",
        "text": "I work at a pretty decent sized pizza restaurant and we have a lunch deal where you can get a 2 topping individual pizza, a small salad, and soda for a pretty good price. You can add toppings and upgrade your soda for an extra fee, too. It’s a pretty popular deal, to say the least. Cue Rude Lady (RL)\n\nRL: I want the lunch special, and make it a taco pizza.\n\n(Taco Pizza is like 6 toppings, BTW)\n\nMe: okay, that’ll be a little bit extra, just letting you know.\n\nRL: What? Why? The menu says $8.25! Why am I being charged extra? I’ve never been charged extra before!\n\nMe: yes, but the taco pizza has more than 2 toppings. That’s where the charge comes from.\n\nRL: But it says $8.25 on the menu!\n\nThen before I can say anything she goes “never mind, I’ll pay it.”\n\nI ask her if she wants to upgrade her drink, she grumbles “no, the small one is enough.”\n\nOkay. No worries.\n\nI tell her the total again.\n\nRL: that’s not the total on the screen in front of me. Why are you charging me more than what the screen says?\n\nI ask my manager and as it turned out, I just forgot to hit the pay button. \n\nRL: there it is! \n\nThen she looks at me and says “Looks like we all learned something today, didn’t we?”\n\nI wanted to tell her to piss off, but you know, gotta have good customer service.\n\nI then go to pour her the drink and she looks at the cup.\n\nRL: is it SERIOUSLY that small? Whatever, I’ll pay for the large one. \n\nShe pushes a quarter at me and then after getting her upgraded drink stomps away. \n\nBitch, I told you that extra toppings cost more. I told you that you were receiving the small drink by not upgrading to the large. WTF do you want out of me?",
        "created_utc": 1512446400,
        "upvote_ratio": ""
    },
    {
        "title": "In nearly 20 years of pizza delivery, I have NEVER seen anything so baffling. Ladies and gentlemen, I present to you: \"The Ballad of Toast Man\"",
        "author": "Just_1_Fix",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hmv2g/in_nearly_20_years_of_pizza_delivery_i_have_never/",
        "text": "A few days ago, I go to take a delivery and like any decent driver should, I checked all the items to make sure they were right, sauce cups were where they needed to be, etc. The order had 2 sandwiches on it, and in the boxes were only pieces of sandwich bread with nothing on them. This of course was highly unusual, so I asked my GM what was going on. Apparently this person had made an online order and had taken every item off the sandwiches. I knew there was no way in hell that was what they actually wanted, so I asked if anyone had tried calling them to verify. They had - several times - both from the store phone and from an assistant manager's cell phone. With basically no other recourse (other than to just hold the order until the customer called to check why it hadn't been delivered, which looking back on it, is probably what we should've done) than to take it, I loaded it up and headed out.\n\nI thought about asking the customer at their door if what amounted to 4 pieces of toast was what they really wanted, but I hate confrontation, and I SUPER hate being screamed at by angry customers. Since I was 99.9% certain this was a huge mistake, and there would probably be no convincing them it was THEIR mistake, I did another thing any decent driver has probably done at least a few times when we know something is wrong - I parked on the curb outside their house, left my car door open, and once the transaction had ended, sprinted back to my car and gunned it.\n\nI fully expected to hear when I got back that they had called and I needed to take 2 sandwiches back to that address, but no one said anything. It was a busy Friday night so I counted my blessings and tried to just forget about it. It wasn't until the rush was over and I was being checked out that I asked an assistant manager if anything had happened with that order, and found out why they had never called - the guy had actually driven up to the store, \"sandwiches\" in tow, and made a big cursey scene. I'm SO glad I decided to handle things the way I did, because just as I suspected, everything was our fault and no amount of hard evidence that HE fucked up could convince him otherwise.\n\nNow I'm the type of person that when presented with a mystery, I can't just let it be - my mind can't rest until I figure out the hows and the whys. The first thing I did upon getting home that night was load up the Domino's website and app to see if maybe it was possible to mistakenly order a sandwich with nothing on it. It's not. There's NO FUCKIN' WAY. Take a look at the screenshots - on the [website](https://ibb.co/hJwCvG), you have to click under the very clear \"None\". On the [app](https://ibb.co/nn9zaG), you have to hit \"Tap To Remove\" or the minus signs - tapping once changes it to Light, then tapping it again removes it. I think it's readily apparent to even the most brain-damaged person what you're doing.\n\nI've been wracking my brain since this happened and I can't come up with any explanation that makes a shred of sense. Any theories?",
        "created_utc": 1512443705,
        "upvote_ratio": ""
    },
    {
        "title": "23 cent pizza day.",
        "author": "GeriatricIbaka",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hl94f/23_cent_pizza_day/",
        "text": "I have an interesting pizza story. Though it's a bit older, I think it's worth retelling here.\n\nI worked at a Papa Johns as a delivery driver. Two days before (Tuesday) a one day \"secret\" promotion was supposed to start (Thursday), I was told to call to see if they wanted me to come in early. The promotion was 23 cent large one topping pizzas. I almost shat myself when I heard it. \"Why?!\" I cried. Well, it turns out someone insulted LeBron James with a Papa Johns sign and now Papa Johns was terrified it would lose significant business throughout Ohio, so they decided to run a 23 (LeBron's number) cent pizza special in honor of LeBron. \"Don't worry,\" they said, \"they're not advertising for it.\"\n\nThursday came at last, so I called the store to see when they wanted me in. It was busy... I've never called our store and had it come up busy. I didn't even know it was possible with all the phones we had. \" *Well, I better just head down there,* I thought. When I started pulling down a side street that led to the building, I saw an influx of cars going in and leaving. I turned the corner and that's when I saw it, a line wrapped outside of the building and down the block, well over a 100 people deep. I had to park down the block. I got into the building and everyone was panicking. \"The news reported on the special all morning. Everyone in the city knows about it. No deliveries! No phones! Just make pizza!\" It was an utter madhouse. \n\nBy 6pm, we ran out of dough, sauce, and cheese, so we had to close. As we told everyone we could no longer serve them, they began rioting. We ran back into the building and locked all the doors. The customers began pounding on the doors to get in, screaming obscenities at us. Eventually, they started a chant, \"where are we going to go!??? MARCOS! (our competitor) Where are we going to go???! MARCOS!\" over and over they repeated this. Two hours later, after the mob dispersed, we were able to run to our cars and get out of there without any injuries.\n\nThis was the most memorable day in pizza I've ever had.",
        "created_utc": 1512428624,
        "upvote_ratio": ""
    },
    {
        "title": "How I get free pizza from Pizza HUT",
        "author": "cartmc123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hl80y/how_i_get_free_pizza_from_pizza_hut/",
        "text": "[removed]",
        "created_utc": 1512428365,
        "upvote_ratio": ""
    },
    {
        "title": "Yelp and Grubhub accounts",
        "author": "Dopeydcare1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hkuhy/yelp_and_grubhub_accounts/",
        "text": "Do you guys ever prioritize other deliveries if on a double or more when one is an account? I know I always do. Last night, I was on a triple, two regular orders, one grubhub. Grubhub was 45 in (we say 45-1hour quoted time) but I deliberately took the other two regulars because this account lady tipped $1.24 and only got a small pizza.",
        "created_utc": 1512425256,
        "upvote_ratio": ""
    },
    {
        "title": "Almost shot",
        "author": "ChoosingMyself",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hisx8/almost_shot/",
        "text": "Not over the pizza ordeal. I was delivering a pizza to a guy in the gang part of town, and heard loud gunshots in a house across the street. A bullet ricocheted off the fence post next to me. The customer ran into the house after handing me the money very quickly. I told my manager I was never going down to that area again. He told me I was full of shit. I showed him the news report the next day. There was a murder at that address. He stopped all deliveries to that neighborhood after that.  ",
        "created_utc": 1512408674,
        "upvote_ratio": ""
    },
    {
        "title": "Asshole threw salad dressings all over me tonight",
        "author": "enzoronchi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hf5gj/asshole_threw_salad_dressings_all_over_me_tonight/",
        "text": "I’ll try to make this as short as possible. I work at a pizza place by the shore in South Jersey, and tonight we received an order from an address that we don’t go to at all. Now I thought it was very weird at first, but I shrugged it off and took the order. I believe it was a salad with the request of extra blue cheese and caesar dressing. He gave me $3, and I left. I get back to the store, and I’m told that I have to go back and give the man $2 back since we didn’t give him his extra dressings, when I clearly saw the cooks in the back bag the order with the extra dressing. I returned to the house and I told the man we had put it in his bag, and he immediately goes ape shit. He tells me to “come in and see for your fucking self,” I didn’t feel comfortable to go in so I told him to “bring it to me.” He comes back with the EXTRA dressings and throws them all over me and tells me to go fuck my self. I said “FUCK YOU” and left. People really are crazy. The bright side, I made $84 tonight. ",
        "created_utc": 1512363445,
        "upvote_ratio": ""
    },
    {
        "title": "Nights with &gt;75% stiffs",
        "author": "CDFReditum",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7hf4m1/nights_with_75_stiffs/",
        "text": "there's no story that was just my fucking night.\n\nIt's worse when you consider that half of my tipped deliveries were $1 tips.\n\nIt's nights like these that really make me want to quit lmao.",
        "created_utc": 1512363144,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery stereotypes you actually haven't encountered",
        "author": "sweetiejam",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7heycx/delivery_stereotypes_you_actually_havent/",
        "text": "So I checked out this reddit before I started and the two I noticed and stuck with me were:\n1. Stoners tip super generously\n2. Black people almost never tip\n\nSo now that I've actually been delivering for a couple of months, I gotta say 90% of the fucking stoners I've delivered to are grumpy and think $1 is a generous tip. just tonight I delivered to a guy for a $27.35 order, he gives me 2 $20s and I kind of expected him to say something like \"just give me $10\" like other people, but nope, straight faced \"I'll take the $12, the small change is for you\". \n\nAs for the black people stereotype, I legit think a good portion of you that spout this one are just racist, especially after seeing some of those comments in an earlier thread. Almost every black person I've delivered to has tipped me very well, especially compared to a lot of the white jock stoners around here. I honestly think most of you get pissed for a bit when a white person tips you, but you put it in the back of your mind, while the second a black person stiffs you you immediately go \"WELL OF COURSE THEY DIDN'T TIP ME\" and use it to justify this weird bullshit.",
        "created_utc": 1512361146,
        "upvote_ratio": ""
    },
    {
        "title": "Closed means CLOSED!",
        "author": "kyfto",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7haujt/closed_means_closed/",
        "text": "This many many years ago, when I worked for a major pizza chain. Had a customer call up SEVERAL minutes after we had already closed...like we had to put the mop away, punch out, put on our coats, lock up and leave CLOSED. Informed the customer we were closed and he asked politely if we could still make him a a pizza. Again, I informed him we were closed and declined. He then went on about how I’m fucking piece of shit and that he’s going to call corporate and have my ass fired...yada yada yada typical bullshit. I apologize and tell the customer “Sure, I’ll take your order if you can be up here in 10 minutes to pick it up.” He places his order and says he will be right there.\n\nTo this day I don’t know if he ever did show up. My driver and I locked up and left approximately 2 minutes after I hung up on the phone with the him. I like to think he drove all the way up there, only to see that we were CLOSED like I initially told him. \n\nNever got a complaint and I quit shortly after that anyways. My only regret is not sitting in the parking lot to see his reaction...probably priceless material right there!\n\n",
        "created_utc": 1512321421,
        "upvote_ratio": ""
    },
    {
        "title": "“Your cook almost killed my girlfriend!”",
        "author": "JessicaTheThrowaway",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h9h2e/your_cook_almost_killed_my_girlfriend/",
        "text": "I pick up the phone today and immediately start getting yelled at. This guy claims my cook last night almost killed his girlfriend. He had to give her TWO epipens and had to take her to the ER. Because they got a super supreme stuffed crust with pizza sauce when both of them are deathly allergic to tomatoes. \n\nI do the whole manager shtick of kissing ass and blah blah blah. Pull up their ticket to do a refund and see that it says they did order normal pizza sauce. Whatever that’s cool, maybe it was a mistake. But then the guy getting frustrated with me putting him on hold and asking for other mangers advice decides he just wants a free pizza delivered. But this time he wants me to make sure it has BBQ sauce on it. For him and his GF with a deathly tomato allergy to consume. \n\nHe still got free pizza cause that’s my job as a manager but why can’t these fuckers just complain like normal people, instead of making up allergies and bullshit stories. Just Say the pizza sucked, or that something was wrong and we’ll help ya out. Otherwise we’re all gonna laugh at how dumb you are (while still making you free pizza...)",
        "created_utc": 1512305309,
        "upvote_ratio": ""
    },
    {
        "title": "One hour to go...",
        "author": "VisionaryChange",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h8eag/one_hour_to_go/",
        "text": "record sales day for us... fuck half off week. \nhttps://imgur.com/gallery/DawVt ",
        "created_utc": 1512285395,
        "upvote_ratio": ""
    },
    {
        "title": "Taking a suspicious delivery",
        "author": "NoFlippingWhey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h7ns5/taking_a_suspicious_delivery/",
        "text": "My gut and everything is telling me something is off but no one at the store will listen.\n\nPosting this here so if I get robbed i can say I was right, or hopefully laugh about it if it's nothing.",
        "created_utc": 1512274728,
        "upvote_ratio": ""
    },
    {
        "title": "Just got tipped in candy.",
        "author": "doctor_datass",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h7adh/just_got_tipped_in_candy/",
        "text": "Sorry for mobile formatting. Some nice old lady just gave me some candy. Couple small hersheys things. Thoughts? Similar experiences?",
        "created_utc": 1512270194,
        "upvote_ratio": ""
    },
    {
        "title": "Sexy Ass Customers",
        "author": "plumeria1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h6y1b/sexy_ass_customers/",
        "text": "I know y'all have hot customers.\nPeople that make you smile as soon as you see their order pop up.\nCarryout or delivery\nI wanna hear about them ☺\n\n",
        "created_utc": 1512266275,
        "upvote_ratio": ""
    },
    {
        "title": "whats the biggest delivery area you have worked? mine is about 45sqmi. used to be bigger though.",
        "author": "woolsey1977",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h64u4/whats_the_biggest_delivery_area_you_have_worked/",
        "text": "whats the biggest delivery area you have worked?\nmine is about 45sqmi. used to be bigger though.",
        "created_utc": 1512257601,
        "upvote_ratio": ""
    },
    {
        "title": "Is this sub just about bitching about tips?",
        "author": "ivix",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h4a0f/is_this_sub_just_about_bitching_about_tips/",
        "text": "It's kind of sad...",
        "created_utc": 1512239155,
        "upvote_ratio": ""
    },
    {
        "title": "I hate the retirement home.",
        "author": "majorasword",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h35wt/i_hate_the_retirement_home/",
        "text": "Everyday we get a call from the furthest delivery point we have, The retirement home. They will order about 12 small items, each with their own individual notes on how they want them. \n     I have to drive about ten minutes to their home. Make my way around this labyrinth of a retirement home to find this room with about 8 old people in it. \n    They will then pull out a list of eveything they've ordered and have me pull out each individule item, check it over to make sure everythings correct, and than hand it to one of the old people one by one. 9 times out of 10 they will find something they didn't like and demand that I bring them a new one and get in a huff like I did something. \n    They will then pay there 90 dollar order in 80 dollars cash and ten dollars loose change that I have to count. I'ts always perfect down to the penny though. No tip for the pizza guy even though I can see all those loose dollars in your pizza jar!\n   \n   We all hate them but none of us have the balls to tell the elderly were they can shove it. ",
        "created_utc": 1512228023,
        "upvote_ratio": ""
    },
    {
        "title": "Mildly snapped on a business customer who has her staff sign and they stiffed me yet again on a $180 order. I told them from now on I need the cardholder to sign. Was I right about that, legally speaking?",
        "author": "AnalyzePhish",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h1wht/mildly_snapped_on_a_business_customer_who_has_her/",
        "text": "I've taken about 5 deliveries to [fancy haircut place] in the past. Everyone there looks very well to do and it's very expensive, and I assume the hairdressers get tipped so they would understand tipping. \n\nAround the 3rd delivery I noticed the trend that the cardholder and person who gives the order says to let front desk sign, and they always just sign and don't put anything on the tip line. \n\nWell today was my 5th or so time going there. It was a 10 pizza order so a lot to carry along with a bag of plates napkins etc. They did the same shtick but this time had me carry the pizzas to a different level and to a different room. The front desk lady proceeded to stiff me yet again and I said \n\n\"y'know, from now on I can't have you sign and I'm going to need the cardholder to sign for the pizzas\" and walked away. \n\nThinking I hadn't said exactly what I wanted to say I walked back to the salon and asked for the cardholder. She was \"busy with a client\" (maybe true idk) so I told them from now on she has to sign her slips or else it could be considered credit card fraud. \n\nI pulled that out of my ass and am not sure if it is true or not. \n\n**TL;DR** Repeatedly deliver to a salon and get a $0 tip from the front desk staff and not the person who ordered, even on $180 orders. Told front desk staff from now on cardholder had to sign or it could be credit card fraud. Is that true at all? ",
        "created_utc": 1512209069,
        "upvote_ratio": ""
    },
    {
        "title": "Am I the only one that notices that people who look, act, dress and speak, like they are totally ghetto, are staying in hotels that are considered expensive? Is section 8 reaching out to expensive vacation areas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7h1t2l/am_i_the_only_one_that_notices_that_people_who/",
        "text": "[deleted]",
        "created_utc": 1512207241,
        "upvote_ratio": ""
    },
    {
        "title": "Nothing like the first of the month to make you lose hope in humanity",
        "author": "Exmclure",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gzl1q/nothing_like_the_first_of_the_month_to_make_you/",
        "text": "",
        "created_utc": 1512176606,
        "upvote_ratio": ""
    },
    {
        "title": "$70 order paid in quarters...",
        "author": "theplaneflyingasian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gyj01/70_order_paid_in_quarters/",
        "text": "Yeah, really. We have a regular customer who always orders about $30 worth of food, always pays in change, never says a word to me when I deliver his food, but comes off as a polite guy. Anyways. \n\nYesterday I see a delivery for his address, a $70 ticket total. And it's cash. I told myself on the way, \"this fucker better not\" and yet, he did. Turns out he was short a few cents but hey, not bad for that many coins. \n\nI understand money is money, but this one drove me crazy. I had to count that shit back in store when i could have been taking more deliveries, actually making more money. Its really not that bad but good enough to tell the story. \n\nWhats the largest order you received a change payment for? ",
        "created_utc": 1512166298,
        "upvote_ratio": ""
    },
    {
        "title": "That happened.",
        "author": "horrorfangirl86",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gyftw/that_happened/",
        "text": "I worked day shift yesterday. Back and forth all day to our farthest area. Watched dude run across the highway and get hit by a train. Had to give a statement to the Sheriffs and everything. Kinda freaked out about getting more deliveries out there tonight. Think good thoughts for me please.",
        "created_utc": 1512165558,
        "upvote_ratio": ""
    },
    {
        "title": "(st.louis) I'm black, and my race, 95% of the time don't tip when whites tip 99.9% of the time",
        "author": "sirjj9050",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gya3c/stlouis_im_black_and_my_race_95_of_the_time_dont/",
        "text": "[removed]",
        "created_utc": 1512164150,
        "upvote_ratio": ""
    },
    {
        "title": "When a customer stiffs you, what happens to their order next time? Hypothetically speaking, of course.",
        "author": "fromwhatiheard88",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gwnyl/when_a_customer_stiffs_you_what_happens_to_their/",
        "text": "I know some drivers that say all the items might get left open next to the window on the slow drive there, or pepper spray may be heavily introduced to a single bite of the food. Sauces, drinks or whatever was asked for may be forgotten, then brought after 1 or 2 runs.\n\nIf there's any complaints, it may just happen again. No good proof, so it just looks like an attempt at free food.\n\nThe same dudes log every 'No Tipper\" in their GPS.\n\nTip your driver. Karma is real.",
        "created_utc": 1512150490,
        "upvote_ratio": ""
    },
    {
        "title": "Do people think we carry cash registers in our cars?",
        "author": "NoFlippingWhey",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gscvw/do_people_think_we_carry_cash_registers_in_our/",
        "text": "Busy night at work. Pretty much every kitchen employee is fresh as they just started working a week ago after someone bought the store.\n\nI'm working 6 to close (1 am) and the football game was on tonight so we were swamped.\n\nI'm taking doubles left and right and my last delivery was a double, as well.\n\nI go in order, first person to order gets their food first, unless of course the other customers address is closer to the store.\n\nThe customer stated over the phone that it will be a cash transaction. However, when I walk up to the door, they have their kid who looks to be around 8 or 9 standing outside. He tries to hand me a credit card!\n\nI politely let him know that I don't have any way of charging his card and he will have to have his parents contact the store to give them the credit card information and process it. He explains it to his parents and they seem to not understand at all. \n\nFinally, they call the store and do what I asked. This takes about 6 to 8 minutes and their credit card declines. So they try another credit card. I rejoice as it went through.\n\nMinor inconvenience, of course, but I was pretty irritated that the second customer on my double got his pizza late. \n\nAlso, parents, you're not slick. Having your child handle the transactions. I know what you're doing.\n\nTL;DR: Customer said they're paying with cash, hands me a credit card, makes another customers order late.\n\nAnyone else ever experience this?",
        "created_utc": 1512100326,
        "upvote_ratio": ""
    },
    {
        "title": "Just because it's 50% off week doesn't mean 50% off tips",
        "author": "BlueRaspberry",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gnskn/just_because_its_50_off_week_doesnt_mean_50_off/",
        "text": "Gas isn't 50% off. My rent isn't 50% off. Your house isn't 50% closer. You're saving money FFS.",
        "created_utc": 1512061517,
        "upvote_ratio": ""
    },
    {
        "title": "Found out my neighbors are pieces of shit tonight.",
        "author": "victorkm",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gjoeo/found_out_my_neighbors_are_pieces_of_shit_tonight/",
        "text": "I drive for Pizza Hut but tonight I was off for school.  I got a call from our downstairs neighbor because apparently they had an order delivered to them earlier from my store.  She said that they had delivered it an hour or so ago and had them sign, then got a call saying they needed to pay the cash.  I didn't really want to deal with it so I advised to call the store, and gave the name of my boss and another manager, one of whom should be there and know what's going on, or if they don't, be able to do something about it.  A few minutes later I hear a doom SLAM. I poke my head out the door and hear her talking downstairs then yelling about the person she was talking to having to pay for the order then another slam.\n\nI caught the driver's attention and it was one of our trainee managers who apparently had been on the road earlier in the night to cover deliveries, and somehow got the sign slip from one of his orders on both bags.  Then he figured out when closing out his orders that he didn't have the cash.  Apparently the girl downstairs and her elderly mother both yelled at him and the manager whose name I gave them at the store and forced them to credit a 33 dollar order. I'm guessing the mom ordered it and didn't remember not giving a credit card number. Dicks.  I guess I will have to apologize to my manager for their behavior and for giving her name. See if I \"help\" them again...",
        "created_utc": 1512015891,
        "upvote_ratio": ""
    },
    {
        "title": "What was your “I should not have done that” delivery?",
        "author": "MsLogophile",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gj8wy/what_was_your_i_should_not_have_done_that_delivery/",
        "text": "Basically trolling for scary stories. Green and didn’t know better or seasoned and just didn’t gaf that night. Dark houses, non working numbers, or just general “bad gut feelings” about runs? Motel 6 in your district? \n\nI was a smallish girl so I had a lot of runs like this but I’m curious for your stories ",
        "created_utc": 1512011598,
        "upvote_ratio": ""
    },
    {
        "title": "Does your employer take any extra measures to ensure driver safety?",
        "author": "Malicious316",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gipf9/does_your_employer_take_any_extra_measures_to/",
        "text": "I drive for a pizza chain that originated here in Wichita. We just had a driver here in town this past Sunday morning found in the trunk of his car after being shot and killed on Saturday night during a delivery.\n\nThe management issued a BOLO through police for him and his car, and that was only after other employees went looking for him and failed to find him, but did find evidence of a struggle and I believe his hat and red pouch in a random yard.\n\nI'm not really very worried about it, but it's really shaken up a lot of people.\nI just take the practical approach and realize how unlikely it was to happen in the first place, let alone the extremely low probability of it happening again.\n\nI take my own measures...\nDash cam, pepper spray, collapsible baton, etc..\nMy dash cam does have gps, but it's usually toggled off because I speed and don't need to be incriminated by my own dash cam.\n\nSo, anything special done by your location or company?\n\n\n",
        "created_utc": 1512006652,
        "upvote_ratio": ""
    },
    {
        "title": "Best place to deliver for in Orlando?",
        "author": "xTrimmZ",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7gdror/best_place_to_deliver_for_in_orlando/",
        "text": "I've been delivering for Domino's on OBT/Oak Ridge for about nine months now.\n\nGetting ready to be done with it because of the management and the fact that the only times I'll make above $60 is if I stay for an 11-13 hour shift.\n\nWhat places around here tend to have good tips? Doesn't even need to be pizza; just looking to make decent money.",
        "created_utc": 1511966929,
        "upvote_ratio": ""
    },
    {
        "title": "Experiences delivering for non pizza places?",
        "author": "fretwork",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7g5dha/experiences_delivering_for_non_pizza_places/",
        "text": "Currently work at dominos. Tips aren't great but we get lots of volume so I come out okay. Only problem I have is closing on weekends (which I always get stuck with as nobody else wants to do it.) We close at 1 and I'm routinely there til 3 or later which really screws up my sleep schedule as my girlfriend is a PhD student who wakes up at 7. \n\nAnyway! I've noticed a lot of Chinese food places looking to hire a driver and most of them close at 10 or 11, which would be much better, especially if I'm not responsible for all the closing duties like I am now. For anyone who's worked at one, how does it compare? Better tips? Less deliveries? How much side work did you have? What was the pay like?",
        "created_utc": 1511886975,
        "upvote_ratio": ""
    },
    {
        "title": "Is my local delivery worth it?",
        "author": "m3gach1ck3n",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7g10i2/is_my_local_delivery_worth_it/",
        "text": "The job pays minimum wage at $10.50 per hour. I get to keep all tips and it reimburses $10-15 per night on gas. Is it worth the cost of insurance and mileage I put on the car?\n\nI live in a college town and the surrounding area is around middle class.",
        "created_utc": 1511838784,
        "upvote_ratio": ""
    },
    {
        "title": "Most irritating part of delivering...aka help me help you",
        "author": "plumeria1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7g05ns/most_irritating_part_of_deliveringaka_help_me/",
        "text": "Why do people make it so hard to deliver?\nI need more than an address if you're not in the building \nI wasted 10 min tryin to find a guy who was in a tractor trailer behind the business\nHe didn't answer when called and by some miracle one of the guys workin on the dock saw me as he was walking up front and directed me where to go\n\nAnother one was a lady who was picking up her kids when i delivered\nI ended up calling her and she told me she was 5 min away\nOk cool\nAt least she's coming\n15 min later she pulls up (i still wasn't mad cause i hit traffic turning into the neighborhood plus getting shitty wasn't gonna help)\nI got $6 out of it so i'm good cause i've been stiffed after waiting for 20 min at a call center (hate those assholes)\n",
        "created_utc": 1511830940,
        "upvote_ratio": ""
    },
    {
        "title": "Is my compensation worth it? I only get $0.60 per run in driver reimbursement.",
        "author": "1314651920",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7g049r/is_my_compensation_worth_it_i_only_get_060_per/",
        "text": "I just started a new job delivering pizzas for a place that mainly caters to college kids. I get $3.00 on the road and $7.25 in the store. My driver reimbursement is an abysmal $0.60 per run (they charge a $2.75 delivery fee). My place of an employment is in Wisconsin. In Minnesota, when I delivered for Jimmy John's, I made $9.50 an hour (tipped employees have to be paid state minimum wage in MN) and received $0.35 per mile in driver reimbursement. \n\nWhat do you guys think? I feel like the compensation is not worth it because I am putting a lot of miles on my car for only $3.00 an hour and $0.60 per run driver reimbursement.\n\nEdit: Alright guys I ended up working from 10:30 PM to Close (which is 3 AM for my store). I'm sitting here typing this at 6:15 AM as I just got off work 15 minutes ago. I put on 50 miles on my car for about 12 deliveries. I had two stiffs and had two people not even answer their door. It was just me and a manager (really understaffed) with a Cyber Monday deal of 50% off pizza if you order online so I got royally fucked last night to the point where they had to call in another delivery driver.\nSo as you guys can imagine I'm quitting because I made less than minimum wage if I factor in the AAA estimate of $0.50 a mile (thanks guys for telling me this) . Oh for the record I made less than $40 in tips so this place sucks. No wonder why this place is so understaffed.",
        "created_utc": 1511830616,
        "upvote_ratio": ""
    },
    {
        "title": "Taking a three top and they're all running late",
        "author": "zwinky588",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fwoqj/taking_a_three_top_and_theyre_all_running_late/",
        "text": "https://i.imgur.com/zzrQX9K.png",
        "created_utc": 1511802942,
        "upvote_ratio": ""
    },
    {
        "title": "People who dont tip because they paid delivery fee",
        "author": "joserivas1998",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fw40y/people_who_dont_tip_because_they_paid_delivery_fee/",
        "text": "It happens all the time, people don't want to tip because they said they already paid the delivery fee. I literally had a lady I delivered a medium cheese to, and she told me to my face that she wasn't going to tip because it would be double the price of the original pizza for just \"bringing it over the hill.\" It was a pretty close delivery which begs the question of why she couldn't just get carryout and go get it herself?",
        "created_utc": 1511798294,
        "upvote_ratio": ""
    },
    {
        "title": "DJ pepsi",
        "author": "plantslut_",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fv6a1/dj_pepsi/",
        "text": "Working at the lovely mominos meant I got to deliver to a local college. This was honestly an annoying place to deliver to since college kids tip badly most of the time. There was a college funded radio station that the kids worked on that was pretty great to listen to tho, and one day I delivered a pizza to the radio station. I hadn't been listening to that station on my way over because I didn't realize what building I was going to on campus. I get there and see quickly written paper signs taped up with instructions to go this way, then that way, etc, which gets intimidating but since it was a college I figured its regular shenanigans... I get to the room and its finally got a sign like \"knock only once because we're on air\" which can only mean one thing, really, so I did as told and waited. Finally they open and they let me in, pay for the pizza and let me pick a song and do a shoutout to some friends on air. It turns out on of the radio DJs went by DJ Pepsi, so she bought a 2 liter of Pepsi and we took a silly picture with me in my pizza uniform, thumbs up, and her drinking her 2 liter dramatically. Yep. That's all folks. What an exciting story. 😓",
        "created_utc": 1511789507,
        "upvote_ratio": ""
    },
    {
        "title": "Teenagers and Tipping",
        "author": "TennyoAkana",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fv51k/teenagers_and_tipping/",
        "text": "Hiya, I was curious what has been your experience with delivering to teenagers and getting a tip? For me it's a hit a miss, miss happening more often than not. \n\nFor instance: \n\nThe other night I delivered to a guy whose order was 18.20 and I ask if he needs his change back, and he says yes so I give him a dollar because we don't have change change.\n\nI was talking to my coworker about this before and she said that she gets stiffed by teenagers often as parents will leave that money for them to order food and instead of tip us they'd keep the extra money for themselves. ",
        "created_utc": 1511789155,
        "upvote_ratio": ""
    },
    {
        "title": "Fake online orders. Possibly an employee.",
        "author": "New_To_NAVY",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ftj74/fake_online_orders_possibly_an_employee/",
        "text": "I work at a mom and pop’s place as a driver and we have a third party website where customers can place orders. This past month we had 3 fake online orders. 2 of them in this past week. From the names used on the fake orders and the timing of the orders I feel like I convinced myself that it’s one of my coworkers. Coworker and I don’t really get along he’s incompetent but the owners won’t fire him because they don’t want to pay unemployment but idk about the laws here in California and all I have is really flimsy evidence \n\nI called the customer support of the third party website the last 2 times we got orders but all they were able to give me were the email addresses. It only confirmed that it’s the same person using similar throwaway-emails.  They said they couldn’t give me their IP or anything and it’s up to their technical team. Even if it isn’t my coworker I really want to find out who it is. \n\n",
        "created_utc": 1511768339,
        "upvote_ratio": ""
    },
    {
        "title": "I really hate when they send the kid to the door.",
        "author": "Sonicomegaz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fqcx3/i_really_hate_when_they_send_the_kid_to_the_door/",
        "text": "If you don’t wanna tip just face me yourself... god dammit ",
        "created_utc": 1511735386,
        "upvote_ratio": ""
    },
    {
        "title": "How long have you guys delivered pizzas for? Are you full time? Do you like your shop? Any future plans of escaping the world of pizza?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fpnqf/how_long_have_you_guys_delivered_pizzas_for_are/",
        "text": "[deleted]",
        "created_utc": 1511729240,
        "upvote_ratio": ""
    },
    {
        "title": "Be Careful Delivering!",
        "author": "UrDirtyMind",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fpi01/be_careful_delivering/",
        "text": "Brothers and Sisters! A guy in my fraternity (who is also a fellow delivery driver) just got jumped by 3 men in Florence, NJ while on a route. Luckily he is okay, but this is just a friendly reminder to stay safe on the roads and be weary of your surroundings when delivering the za's!",
        "created_utc": 1511727849,
        "upvote_ratio": ""
    },
    {
        "title": "So how was Thanksgiving Eve for all of you?",
        "author": "enzoronchi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fomhc/so_how_was_thanksgiving_eve_for_all_of_you/",
        "text": "Wednesday night was weekend busy for me! I made $150 in tips for a six hour shift. No one wants to cook the night before Thanksgiving so we were slammed all afternoon. We had a lot of huge dinner and pizza orders for both take out and delivery and the tips were all very generous as they stayed in the $5-10 range. On top of that I had $30 extra as my pay. I work in South Jersey at a local place by the beach. ",
        "created_utc": 1511720273,
        "upvote_ratio": ""
    },
    {
        "title": "\" left side of duplex\", \" door on the right \", ect.... Whose left/right?!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fkxth/left_side_of_duplex_door_on_the_right_ect_whose/",
        "text": "[deleted]",
        "created_utc": 1511674306,
        "upvote_ratio": ""
    },
    {
        "title": "Karma?",
        "author": "Gator231",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fkixc/karma/",
        "text": "So this is my first post here and I’ve only been delivering for a few weeks. Well the other night I was making delivery to a customer at her apartment complex. As I step out of my car I notice a car is being towed and the guys are running to finish the job. I call the customer since I can’t find their number. She and her boyfriend come out. Normal conversation start up, “Hey how you doing?” And stuff, I give her the receipt to sign, expecting at least 2 dollars. She gives it back, leaving no tip and then I heard her boyfriend say that they had towed her car. I obviously felt bad for her too as they rushed back inside to call the company.",
        "created_utc": 1511669677,
        "upvote_ratio": ""
    },
    {
        "title": "The best customer",
        "author": "North_Polian",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fkdha/the_best_customer/",
        "text": "Guy just offered me a dab. I’m high as balls. I got halfway back to the shop before I remembered that I was on a double. God, I love Nevada. ",
        "created_utc": 1511667980,
        "upvote_ratio": ""
    },
    {
        "title": "\"You're 17 minutes late\"",
        "author": "phatKirby",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fe4hs/youre_17_minutes_late/",
        "text": "**warning:** long setup, ending with free pizza (and no revenge).\n\nIt's Black Friday evening in the US. There's a small rush at the store, a pitiful size compared to the usual Fridays. With 9 drivers at the ready, all our delivery quotes were 25-35minutes. As I came up to the rotation, I got stuck with a future order slated for 7:30 with the address being 15 minutes away. Pies were bagged by 7:19, and I knew I had to be prepared for a complaint.\n\nOut I went, speeding through the neighborhood, rolling past stop-signs, strolling through that light that would've accosted 2 minutes of my life (thank you pedestrian for pressing that button and extending my green). 7:32 wasn't so bad, or so I thought. A quick glance at a familiar street -nothing out of the ordinary- a check for the pen -unholstered with the clipboard/receipt- and lastly a reach for the steamy bag of goodies. Perfect. \n\nCue the door opening sequence: \"Hi-\" I said, but what's this? You're on the phone with someone, with one foot at the door, and the other warding that cute 'lil pup from lunging at me. Um, oh! That outstretch arm is asking for the clipboard right? \"Here you g-\" I didn't appreciate having a door slammed on me, but it's understandable that you got alot going on, take your time! \n\nThere seems to be a dispute inside the house, I could hear a guy saying ***\"you dumba$&amp; $#!|head lil' €un!\"*** in the most articulated/serene/smooth tone I had ever heard in my life, striking through my very soul! Through the door no less! This whole experience so far has left me a little emphatic and feeling sorry for that woman, albeit a tad uncomfortable to be in the middle of a lovers spat. So, I plastered on my best &lt;I feel ya&gt; face, unbagged the pies onto my right hand like I'm holding a tray of wine glasses level, and await the return of my utensils and leave the scene. I was totally unprepared for what happened next.\n\nThe door re-opened after a few minutes, the pen/clipboard assembly was pushed into my chest, and off she went. \n\n\"I'm not paying for this, you're 17 minutes late and I ordered for 7:15, I'm on the phone with your manager now for a refund!\" \n\ndazed, I held onto my tools with my left hand, she then brings out the 2 receipts and proceeds to crumple them, demonstrating her intent to not pay for her food. That paper-on-paper action snapped me up, and thus I moved the baggage from my left hand to my right armpit as I tried to reason with her while hiding my inner cringe at how wrong her internal clock was. \n\n*\"Mm'am, the delivery was scheduled to arrive by 7:30,\"* \n\nreaching for proof, I tried to show her the delivery slip with my now free hand, when she interjected \n\n*\"No, I ordered for 7:15, you're late, I'm not paying, and you're not getting a tip.\"* \n\nwelp, I tried, and thus I casually responded with a pinch of spite\n\n*\"then I'm afraid I can't hand this to you\"*\n\nwhich prompted her to furrow her brows, which, in hindsight, was the sign for me to just slam the pizzas on the porch.\n\n*\"Uh, yes you are\"*\n\nand then she lunged for the pizza with her obese arms, faster than I can finish my rebuttal\n\n\"*Mm'am you haven't paid for it (did you need to be reminded of what you just said?!)*\"\n\nThe scuffle that lasted approximately 3 seconds, and ended when she thought to remind me by yelling\n\n*\"I paid for it online!\"*\n\nIt took an instant for me to decide to let go. I knew that she was in it for a free meal, I knew that she can easily dispute the charge on her card, I knew that my manager got my back if the store takes a loss, I knew that somebody was getting hurt should this escalate, now I know that she's stupid, and there's no d@mn point dealing with stupidity of this level. So she took the pizzas, ran back into the house, and slammed the door shut. So I went back to the car, autodialed the store to report the situation, and proceeded to base.\n\nI can confirm, the woman was a ***dumbass shithead lil' cunt***. I pity the guy there, but onto the blacklist her address goes!",
        "created_utc": 1511600297,
        "upvote_ratio": ""
    },
    {
        "title": "Easiest tip I ever got",
        "author": "LimpCush",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7fbfz6/easiest_tip_i_ever_got/",
        "text": "Sorry if this post is late to the party, but I just discovered this sub!\n\nAnyways, I work Wednesday and Saturday nights for my part time pizza delivery job and get off major holidays for my full time job. This includes Labor Day. I value my free time quite a bit, so I pretty much never pick up extra shifts, but when they said they had an $1100 order right away in the morning, my eyes must have had little dollar signs in them, because I jumped all over that shit.\n\n\"Hey, if you need an extra driver for that run, give me a holler.\" I said to my friend, the scheduled driver.\n\n\"Oh my God, that would be awesome dude. We can split the tip.\" He replied. Perfect.\n\nSo I clocked in at 10:15, a full 15 minutes before the store opened, to see the owner, GM, a CSR, and the driver plugging away. I joined in and we packed up our cars to the limit, drove to our destination and unloaded the 100 pizzas. $120 tip, split between the two of us, for an hour of work. I even stayed a while with to shoot the shit, take 2 more deliveries, and pick up Culver's for the three of us who were still there (the GM and owner left by this point). Some days, it pays.",
        "created_utc": 1511567933,
        "upvote_ratio": ""
    },
    {
        "title": "Listening to music on a delivery",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7f8v8x/listening_to_music_on_a_delivery/",
        "text": "What kind of music do you listen to?  I usually only had the radio, so it was kinda random.  Although, one time, [I drove past a house because I was caught up in a song I liked.](http://www.thewebcomicfactory.com/comic/tales-of-pizza-a-few-fleeting-minutes/)",
        "created_utc": 1511544082,
        "upvote_ratio": ""
    },
    {
        "title": "I hope everyone working today has a good day.",
        "author": "B-WASH",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7f1z27/i_hope_everyone_working_today_has_a_good_day/",
        "text": "Happy thanksgiving pizza guys I hope work goes however you want it to today. \n\nEdit: made it through the day with a crew of 4. Some  people brought us some thanksgiving food it was nice I hope everyone had fun or atleast didn't have a shit day.",
        "created_utc": 1511465773,
        "upvote_ratio": ""
    },
    {
        "title": "Literally herding cats",
        "author": "attlas93",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7eyxsg/literally_herding_cats/",
        "text": "(TL;DR. The title)\n\nThanksgiving eve usually has it's big rushes since everyone is so busy getting tomorrow's dinner ready they forgot about today's meals. My store was no exception. Orders were coming in like crazy from 5:30pm and on and the insiders were handling it like a garbage disposal handles forks. Customers were getting testy, items were not being made* ^(which happens more often than any store should have that happen but it was particularly bad today) \nand orders were getting late, like you're already 5+ minutes late before you're even out the door late. I literally watched one of the insiders cut and box up one of my pies and thanked him because I needed to get out the door on a double only to watch this insider get flighty when I customer bleated for their order and immediately hand off my pizza and another one to said customer just to get him to go away. Neither myself now the other customer were very happy about this.\n\nThings were going pretty swell as I got out the door 10 minutes late of one order and 20 for the other. I head to the first one which I recognized as a regular and the guilt about the whole situation starts to creep into my stomach. I get to the door ready to grovel and instead of the elderly couple that I'm accustomed to seeing at this house I lady my age comes to the door. *'Shit right it's thanksgiving, they must have family over. Why else would the nice older couple on *[REDACTED] St. order 4 pies'* After a bit of small talk she hands over $40 for an order that's about $32 and change. Knowing that the circumstances nowhere near me getting an implicit tip I ask her if she wants change and start making it once she says yes. About a second later she says she'd be good with getting only $3 back and a young adult cat (1-2yrs maybe) struts out. \"Is that little guy a flight risk?\" I ask and I get a nonchalant answer about the cat just being curious. She walks into the living room for a second to talk to the elderly couple who live in the house and I guess it was my lucky day because she hands me the $3 back. As we're \"have a nice night\"ing and she goes to close the door the cat darts out\n\n\"no no it's cool I can get her\" Kitty is stretching her legs about the yard and she's doing her best to hide a DEFCON 2 face (remember, lower is worse). Kitty is walking about like she's an indoor car who doesn't see this part of the world much unless she's in a carrier and the lady is trying to approach her to no avail. Kitty keeps darting off. I briskly maneuver around my car in the street and get between kitty and the rest of the street. Lucky for us kitty wasn't feeling too bold and decides to avoid me and go towards the end of the cul-de-sac where we won't have to worry about cars. Neither of us can head off kitty so our little game of brisk walking and stopping tag eventually end up at the ends of the cul-de-sac where kitty is finally convinced to start moving toward the house again. I'm able to head kitty off now as I didn't go all the way to the end and the lady was able to press the pursuit enough to get kitty moving more towards the house. The chase eventually climaxed in a stand-off where I got between kitty and the house and kitty knew she could head back as the lady was behind her stopped for a second seeming to try and figure out a plan. That second was just enough for the lady who answered the door to scruff and scoop up the kitty and get her back into the house. I wish her one last \"have a good night\" and head to my car feeling reassured that I did not contribute to the ruining of a thanksgiving by letting the family cat get away. **Seriously people, always ask if pets you see at the door are flight risks and be ready to intercept them if they try to make a creak for it!!!**\n\nI headed off to the other house on my double that was now 30+ minutes late. You can't win em' all I guess.",
        "created_utc": 1511435011,
        "upvote_ratio": ""
    },
    {
        "title": "Can't tell if it's just my area, or...",
        "author": "kneightwolf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7exavg/cant_tell_if_its_just_my_area_or/",
        "text": "Is everyone that orders the day before a major holiday just really cheap ? It seems like the holidays bring out the worst of the worst when it comes to stiffs lol. ",
        "created_utc": 1511414118,
        "upvote_ratio": ""
    },
    {
        "title": "Creepy obese man",
        "author": "plantslut_",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7euyi4/creepy_obese_man/",
        "text": "So I'm a female. I feel like that makes this story a bit more understanding in creepiness. \n\n\nSo I used to work for a pizza place. Let's call it mominos. We delivered to a local motel. The kind of motel kids rent for a night to party, people live in, hookers fuck in, all that fun stuff. I get a double order one day. I bring the first order and a gorgeous female answers the door. She asks me to step inside. We aren't allowed to do this, for safety reasons, but i came really close to stepping in becauze this beautiful woman in a bathrobe is asking it. I stall for a moment but notice extra movement behind the crack of the door. I decline. She gets a little annoyed, but takes the food from me and gives me money. I notice the guy doesn't move from the doorway. I was getting a little uneasy at this point tho. I dig out her change and she asks me \"how much money do you guys carry for change?\" Which is a super red flag. I had close to $50 on me at the moment which is more than usual, but i tell her $15 in change. She looks to her left behind the door and wiggled her eyebrows like \"see I told you\" and I walk away. Later that night someone mentioned they thought they wanted to jump me, which seems like a possibility. Anyway so that put me on high alert. \n\nSo I go to the next delivery in the same motel. The person has the door lock protruding so the door wont shut. I knock and someone says \"you can come in\" so I push the door open. A very very obese man is on the bed. Like 400+ lbs obese. It's clear he basically lives in this motel as the bed is very disgusting and the whole room is cluttered. Dude asks me to come in. I'm really freaked out by this point but I realize this man is alone and probably can't walk as there's a walker and XL wheel chair in the room as well.  I actually do enter because its clear he isn't getting up. He points to a giant pile of quarters that is meant for payment. So I count out $25ish bucks in quarters, which is less than the order owes.  I tell him this and he reaches behind his pillow and grabs a $100 Bill. Asks if I have change. I really legitimately do because of the last order and  $50. Jokes on me he still made me take the quarters tho.... I put his pizza on a stack of other pizza boxes. He complimented my yoga pants and tipped me well.  I went back to the pizza place and asked tonot deliver to the motel anymore. This was a common request for females so they complied. \n\nThis seems like a boring story now that I wrote it out but I was high anxiety that whole delivery. \n\n\nTldr: delivered to possible muggers and a very obese man once ",
        "created_utc": 1511390520,
        "upvote_ratio": ""
    },
    {
        "title": "The best tip I ever got",
        "author": "dinkleberriez",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7eu5dj/the_best_tip_i_ever_got/",
        "text": "Among other things, I was employed as a delivery driver as a teenager.\n\nWeekday afternoons were usually pretty damn slow after lunch.  From 1pm-5pm it was pretty dead.\n\nI'm sitting there with my manager shooting the shit, just passing the time.  He goes to make himself his favorite snack (bacon cheesy bread), while I call some girls on my brand spanking new [Motorola CELLULAR PHONE.](http://www.jam3s.net/wp-content/uploads/2012/08/motorola-flip.jpg)  I balled pretty hard as a teen, what can I say.\n\nSo this one I'd been messing around with is acting pretty flirty.  I suggest I make a delivery to her place, and \"take my time\" since we're so slow.\n\nShe asks what the cheapest thing on the menu is.  Garlic bread for $2 is my recommendation.\n\nOrder pops up and I play it non-chalant.  Go over and read the ticket, make the bread, get it ready for delivery etc.\n\nBoss man is still eating his artery death, so I just head on out.\n\n7 minutes later I'm there.  Home alone, perfect!\n\nI go upstairs and get some awesome head while still in uniform.  I nut all over her tits, lick it off, kiss her then roll out.\n\nHalf an hour later I'm back at the shop, boss giving me a raised eyebrow.\n\n\"How'd it take you so long to run some fucking garlic bread a few miles down the road, and why'd you take an order that was 8$ less than our minimum delivery order?\"\n\n\"I knew the tip would be worth it ;)\"",
        "created_utc": 1511383705,
        "upvote_ratio": ""
    },
    {
        "title": "Banned from Section 8",
        "author": "Fouhr",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/7es7nj/banned_from_section_8/",
        "text": "",
        "created_utc": 1511377403,
        "upvote_ratio": ""
    },
    {
        "title": "Coworker accused of eating a customers wing for 2nd time",
        "author": "nurdun",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7esb5z/coworker_accused_of_eating_a_customers_wing_for/",
        "text": "I work at a pizza parlor that also serves wings. The way we make them is that we bake them in a little metal pan with oil. Our wings are pretty good if you cook them long enough but we're not really supposed to cook them for long enough to be that crispy. So when you pull them off the tray it usually leaves bits of chicken skin stuck to the surface of the tray which sucks, but what can you do. \nMy manager gets a call from ubereats and then has to field calls from the customer, ubereats corporate, and the food delivery guy about the mysterious wing. My manager is getting obviously angrier but insisting that the wing had not been tampered with, that the customer could come in and match the wing to the skin like a puzzle piece. Now keep in mind that the exact same thing has happened to this same manager except it was a customer in the store so he could easily show her the skin remnants.",
        "created_utc": 1511369237,
        "upvote_ratio": ""
    },
    {
        "title": "Young Love And Affordable Pizza",
        "author": "yepimthetoaster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7eoqpx/young_love_and_affordable_pizza/",
        "text": "One night, I got a delivery from some person who wrote \"DON'T KNOCK CALL ______\".\n\nI got there, and I called the number, and it's some teen sounding girl whispering into the phone saying she'll be right out.\n\nI wait a minute, and a high school age looking guy comes out to pay for it, and heads back in.\n\nAfter I got back to my car, I stayed parked in front of the driveway, counting money for a few minutes. \n\nAll of a sudden, I hear the side garage door he came out of originally open again, and the high school boner very quickly tiptoes out of the side fence gate, sporting underwear, shirt and pants in hands, silently walking quite fast on his way, disappearing off down the residential sidewalk in quite a hurry.\n\nIt looked straight out of an American Pie movie, but I guess that's just young love and affordable pizza.\n",
        "created_utc": 1511330843,
        "upvote_ratio": ""
    },
    {
        "title": "Has this happened to anyone else? I put in my 2 weeks notice and ended up being fired.",
        "author": "MermaidJuniper",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ejv1j/has_this_happened_to_anyone_else_i_put_in_my_2/",
        "text": "I worked delivery part time. Always showed up for my scheduled shifts, sometimes covered for people, and just generally did my job. I don't think I was a bad employee. I put in my 2 weeks notice for personal reasons. 3 days later I called off because I was stuck at my normal job. I gave 2 hours notice, but the company technically requires 3. When I went to pick up my last paycheck I had to sign a termination paper which said \"called off with 2 hours notice. Non rehireable\". Is this really grounds for non rehire? This is the only time I ever called in. I don't know if I pissed off a manager or what but I just feel like this is unfair. ",
        "created_utc": 1511288082,
        "upvote_ratio": ""
    },
    {
        "title": "I never tip and am proud of it!",
        "author": "cap2isbomb",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7eif48/i_never_tip_and_am_proud_of_it/",
        "text": "[removed]",
        "created_utc": 1511276536,
        "upvote_ratio": ""
    },
    {
        "title": "The Stealthy Ripper",
        "author": "-kkslider",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7egmo9/the_stealthy_ripper/",
        "text": "No fancy revenge story or anything, just a silly tale I thought you guys might like. So I’m approaching a house for a delivery, and I notice from the street a dad &amp; mom sitting in their living room, watching a movie with the fireplace going. As I go through the gate, I start to hear a quiet, rapid bubbling noise coming from above me. I look up to see a single open window on the second floor, the light from within blocked only by a young gentleman holding a large bong out his window, mid rip. Not wanting to scare him, I swiftly make my way to the front door directly underneath him, unnoticed. I knocked on the door, heard a muffled “oh shit” from above me, and quick footsteps inside. He came to the door, eyes redder than the devil’s dick, and you know he tipped fat :)",
        "created_utc": 1511256317,
        "upvote_ratio": ""
    },
    {
        "title": "I know it's getting colder but.",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ee39i/i_know_its_getting_colder_but/",
        "text": "Please don't invite me inside your house, I'm really socially awkward and it makes me uncomfortable.",
        "created_utc": 1511228090,
        "upvote_ratio": ""
    },
    {
        "title": "Hell hath no fury like a 4:30 patriots game.",
        "author": "extremeperson123",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7ecsfc/hell_hath_no_fury_like_a_430_patriots_game/",
        "text": "Any fellow new englanders get slammed last night as well? 45 deliveries in my 12-10, went through half a tank!",
        "created_utc": 1511216879,
        "upvote_ratio": ""
    },
    {
        "title": "Random acts of pizza",
        "author": "hlyghostpwr0819",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7eaqhk/random_acts_of_pizza/",
        "text": "[removed]",
        "created_utc": 1511200884,
        "upvote_ratio": ""
    },
    {
        "title": "I've been delivering for 16 years now. AMA",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7e7kwe/ive_been_delivering_for_16_years_now_ama/",
        "text": "[deleted]",
        "created_utc": 1511168202,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the worst type of customer?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7e7chp/whats_the_worst_type_of_customer/",
        "text": "[deleted]",
        "created_utc": 1511164854,
        "upvote_ratio": ""
    }
]