[
    {
        "title": "I have altered the deal. Pray that I don't alter it furter.",
        "author": "DragonFire003",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/11sfhkr/i_have_altered_the_deal_pray_that_i_dont_alter_it/",
        "text": "I just wanted to tell this some where cuz I thought it was funny.\n\nFor context: \n- it's a window factory\n- HR and all of management are known for not keeping promises, almost to a religious degree.\n- work ethic is nonexistent(except for the bootlickers)\n- this factory, specifically, goes through people like water\n\nSo, about a year ago, in an attempt to keep people and encourage us workers to show up on time and be safer(working with glass is dangerous). HR came up with the idea to give everyone a bonus if they can show up on time and not get hurt. I forgot what the original amount they said was, but they did say it was two separate bonuses, this is important. Now, most of us employees didn't really care because we were already being as safe as we could be working with glass. So this just felt more or less like a parent promising a kid a new toy if they behaved. \n\nIt's a year later, and HR is handing out the bonus to everyone(surprised they actually handed them out instead of backtracking and giving out gift cards no one uses). This is the funny part I wanted to tell, so my team is split into two groups. Two guys up front cutting glass, and me and a part timer cutting in the back. I had walked up to the two guys in the front to hand them paperwork when they told me that they're going to start looking for new jobs. I asked why, and they told me that HR said that out of a $700 total for the two bonuses, they have changed it to  a single bonus that caps out at $400. I, seeing something like this coming, was unfazed by it, but apparently, these two were planning their finances around these bonuses and are mad about it.\n\nIt's going to sound bad, BUT one of these guys, my supervisor, is an asshole and the other is just stupid. So, as they are telling me how this is making it so they can't buy all their new toys, I'm laughing my ass off in my head. What makes this even more stupid is that these two probably had the biggest bonus in the whole factory(like about $200) because, to be honest, I think most people forgot it was a thing. They actually had faith in a company that consistently put its financial well-being before its employees. \n\nSorry, it's a little longer than I thought. TLDR: HR skimps on its promise, and my supervisor didn't see it coming. Lmao",
        "created_utc": 1678928760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luxury Homes for Sale in Middleburg, VA | Juanita Tool",
        "author": "BarbaraBart73",
        "url": "https://juanitatool.com/loudoun-county/middleburg/",
        "text": "",
        "created_utc": 1678811422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wild email from ceo (or a failing startup) to customer",
        "author": "Emotional-Custard-34",
        "url": "https://i.redd.it/1jc4wh3996ka1.jpg",
        "text": "",
        "created_utc": 1677241886,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the turns have tabled; working in death services",
        "author": "D_Jae",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/10ybyyy/how_the_turns_have_tabled_working_in_death/",
        "text": "I currently work in the death services industry. Some would say I'm a mortician but I cremate. Pets and people. In the state of Minnesota you only need to complete an 8 hour course to do this. I use to work at a desk but this was in the before times. \n\nMy story starts in April of 2020. I work for a large insurance corporation; more specifically Medicare since April 2014. We all have this massive last minute meeting. Two of them. One group of people were told that there will be lay offs but they are not affected. The other meeting is informing thousands they will no longer have a job beginning June as the company had to make the 'tough' choice of sending our jobs over seas. To India more specifically. I bet you can tell which meeting I was in. I was even gifted the opportunity to train them how to do my job. I heard that if 'you do not possess a social security number you are not to work with social security numbers.' I guess it depends who owns the social security number. And guess what, It worked. The company had record profits at the end of that year. Billons. I had applied for 45+ internal jobs. I still haven't heard about most of them. \n\nJune 2020 I start working for the US Census. I quickly become an office operations supervisor. What they called an 'oos'. Working for the government has taught me that insurance is not the biggest scam in this country. I'm making great money, dating this great guy (so I thought). He gets cancer so I supported him from before the Census. November of 2020 Trump says the census cannot finish. Which makes sense because mostly the homeless were left uncounted (this is used to show needs for grants to help the homeless). Cancer guy gets a great paying job, tells me not to rush to find work and just continue with my schooling. That lasted almost 3 months. He starts using the white nose powder stuff, excessively. He is addicted to medications that are prescribed to his father. Well he was. His father passed last month. He became controlling and used the excuse that he makes the money so I need to just sit down and hush. I fall into a deep dark depression. I'm excusing everything he does to his fear of dying. April of 2022 I officially kick him out of my house. Other than having to steal MY car back from him, it was a clean break. \n\nNow we are at May of 2022. More specifically, my birthday. I'm single, my birthday was on a Tuesday, and my w33d dealer offered to cook up some steaks and get a cake for me. I of course jump on it. We are having fun but him and his wife are having a heavy argument. Very tense. His supplier comes on over. I've met him once before. He was nice but he fit the description of a supplier. He brings the fun mushrooms. I say hey, why not. He mentions s3x on fun fungi is great. I make a comment about how I'd like to do that some day. Dealer and his wife go upstairs and are arguing. Supplier takes the opportunity to make out with me... which leads to s3x. It lasted all night. About 7am we finish up, get dressed, and we leave. He says happy birthday and I say thank you for a memorable one. No numbers exchanged no promises made, just bye. I thought that was great. I've never been one for one night stands but it was fun. \n\nJune 10th of 2022 was the worst day of my life. My best friend of 13 years passed away on my couch. She was a border collie and the best dog anyone could have asked for. It was a Friday night when she passed. I called our local pet crematorium to inquire about that process. I'm told they are short staffed and not open on the weekends at this time so I would have to wait until Monday. June in Minnesota still gets real hot. My best human friend lets me leave her in her van in her cool garage. Monday comes around I am scrounging for change, sell my car because even though \"everyone is hiring\" no one hired me. I take her down there and while we are doing the paper work I say something on the lines of 'that was horrible, I would donate my time to help someone like this that needed it.' She says, well. We are hiring. The next day when I picked her up I learned more information. The following week I have my interview and then the first week of June I'm down there training on how to cremate and process and everything else that is involved. It was hard at first since losing my dog, but I enjoyed being that person to comfort those who lost their loved one. The pet crematorium has an attached human retort which I also learned.\n\nAbout September it is brought to my attention that they could us help at the Cremation Society in a neighboring town. I offer my help and learn how to cremate a high turn over. This isn't a glamours job but it is able to give me more hours. I quickly learn one of the funeral directors is not that great at her job. One day I'm sitting in the office filling out paperwork and she walks in asking for help. She asks me to go into the prep room and help dress a body. I'm not suppose to touch bodies unless it's for transportation but me being a people pleaser I say sure. \n\nI go back there and there is another director kinda talking out loud how he can't find anything in the room and how unorganized it all is. I notice the d3ad guy on the table. His fibula and his tibula have been removed and replaced with a green PVC pipe. I notice the chunks of skin missing all over his body. I learned a lot about organ donation that day. While I'm putting this guys arm in a white t shirt I noticed a tattoo on his neck that looked familiar. I then stared at his face as much as I could without making it obvious. My mind then went into slow motion and I thought \"No, this isn't him, it just looks like him.\" On the silver table next to him was his drivers license. The supplier.\n\nThe guy I had a one night stand with was now d3ad on a table at my place of employment. Later I took a break and sat in my car. I wasn't sure what to think. I was sad but not upset. I felt numb creeping on Facebook, trying to find out what happened. I found out he put a needle in his arm for the last time. I didn't know he was into the hard stuff. Heck, I didn't even know his last name. He was also the one who bought my car. I had seen him here and there since after my birthday adventure. \n\nAnd that is my long crazy work story.",
        "created_utc": 1675990993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coworker quit because she “didn’t like the vibes.”",
        "author": "TheOneCalledEgg",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/10pj10v/coworker_quit_because_she_didnt_like_the_vibes/",
        "text": "",
        "created_utc": 1675124906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got fired and reported missing to the police for telling my boss about an OSHA violation...",
        "author": "ProphecyWN",
        "url": "https://youtu.be/yJs50uS-LzQ",
        "text": "",
        "created_utc": 1674944198,
        "upvote_ratio": 1.0
    },
    {
        "title": "A daughter tries to explain why her mom isn’t able to retain good employees",
        "author": "No-Serve3491",
        "url": "https://v.redd.it/c0554hdqujda1",
        "text": "",
        "created_utc": 1674408906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pissed Off A Cyclist And Now He's My Coworker",
        "author": "S1mulatedSahd0w",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/10dy96h/pissed_off_a_cyclist_and_now_hes_my_coworker/",
        "text": "This happened outside of work, but I hope this still qualifies.\n\nSo, I was pulling a double shift today at work, but I had to run an errand so my job let go do it and to just come back whenever.\nWell, I walk to work. I don't live far from my job. On my way back, I came to an intersection and I frequently J walk (It's faster and I am a sucker for punctuality), which I'll admit is not very smart, but I only do it when I know nothing will be coming for a solid 5 seconds. Well, as I cross a cyclist came to the corner of the intersection and was about to turn, at the same time a car was. I was literally on the line that separates the lanes, and between two cars. The car waved me on, but I waved the car on since I was J walking, it's only fair they go first. The cyclist gave me an up-in-arms gesture and said something to me, but I had my ear buds in so I didn't hear what he said. Likely \"why did you wave them on first!?\". I didn't answer him and just kept walking. I had to get to work and I didn't have time for a petty squabble over who is supposed to go first.\n\nA rule of thumb that I have is because I walk, I am very aware of my surroundings, and because I listen to my music when I walk, I often won't hear a lot of things. So, I make sure I look behind me every once in a while to make sure Im not being followed in the event I get attacked or robbed. Well, right when I look behind me, I see the cyclist had turned around and appeared to be heading in my direction. I could see him from a very good distance cause he stuck out like a sore thumb. So I get my phone out and have my camera set to video in case he tried to start something, I had my ass covered. Fortunately, he was following me and I got to work.\n\nWell, I get to work and Im telling my coworkers about it. I then see the same cyclist fly by in front of my job. At this point, I was actually scared. Cause I seriously thought he followed me to work and was gonna start something. I was ready to get one of the managers, and I see one of the managers with him, and it was his first day on the job. Granted, I had no idea. How was I supposed to know? But I suspect he knew who I was, but I was too busy with my job that I didn't have time to really worry about it too much. I just couldn't believe that this same dude, that got pissed at me, is now my bloody coworker!\n\nWe are on seperate departments so our interactions will be minimal if any, but at the same time if he really wants to hold a grudge over some road rage, that says more about him than it does me. I didn't engage him, I just kept on walking and ignored him. I'm not confrontational, and I wasn't trying to piss him off, but if I handled the situation wrong, I'll eat crow for it later. But Im not expecting him to hold on to that, and Im off from work the next few days so he will likely forget me. I just won't be able to wear my favorite hat for a while and I'll have play very dumb.",
        "created_utc": 1673917153,
        "upvote_ratio": 1.0
    },
    {
        "title": "set up to fail",
        "author": "ricenoodles2433",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/107ln7h/set_up_to_fail/",
        "text": "In a job I recently had, I was made to feel anxious and stupid because, my manager had no experience onboarding anyone to their work flow, and made every conversation with them feel like I was getting punished for something. Their onboarding plan was to drop me into existing meetings from week one with no background info about purpose or content, but fully expecting me to learn through osmosis via the random accumulation of meeting dialogue. \n\nThe dumbest thing they told was that \"this is how they thought people learned.\" They had no patience to teach or inform me about the people I was working for in a useful context. They would also never answer my question directly but force me into a ritual where I was tasked to figure out a solution to a problem only to have them penalize me for messing it up when they already knew the right answers. \n\nTheir feedback was always extremely generic that it was on the board of being useless. \n\nOther issues I encountered were:\n\n1. Did not provide any road map for how to pick up their work.\n\n2. No high level view of team goals. \n\n3. Presents information out of context or month/weeks before I would ever use it or time frame for when I should expect it to become relevant (so I can review the information). They expect me to recall it perfectly in all the details(bells and whistles).\n\n4. Interrupting me when I'm learning the work by arbitrarily telling me what is and isn't important and then penalizing me for not reading their mind regarding what actually is important. \n\n5.kept penalizing me for various superficial asinine and low level details that had no impact over the work quality and began judging my quality against these problems. \n\nI didn't realize that this was not normal for the company until they went on leave for personal reasons and my interim manager step in was was dumbfounded about how the work was track by their predecessor. It wasn't until the temp manager that I got a crash course on the basics of the role and expectations.",
        "created_utc": 1673288500,
        "upvote_ratio": 1.0
    },
    {
        "title": "The guy who lost his car",
        "author": "realistidiot",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/101a2nh/the_guy_who_lost_his_car/",
        "text": "One early saturday morning, i was going to the town center to clear the area from cars, where the big spring market soon would start to be built. As a Parking Guard i made sure to put up extra signs saying forbidden parking saturday. Noone seemed to read this, where 11 cars stayed there anyways. So i had to tow them away which is about 260$ fine each.\n\nLater that day a guy comes up clearly irritated, searching for his beloved BMW. I tell him where it was towed and he soon returns with the fines screaming of rage. He decides to give me a big speech with a few hundreds of people stopping by to watch the scene. After minutes of screaming and pointing fingers he tells me there was no sign telling it was forbidden to park here. I then ask where he entered the parking area, followed by a whole arm pointing at a sidewalk. I tell him that its not a road at all, followed by a sitcom like laughter from the surrounding audience. The BMW owner turn around and started walking away without saying one. Single. Word.",
        "created_utc": 1672657649,
        "upvote_ratio": 1.0
    },
    {
        "title": "BURSA303 - Situs Judi Slot Gacor Pragmatic Play Terpercaya",
        "author": "RosaFillmoreby3",
        "url": "https://bursa303.city/",
        "text": "",
        "created_utc": 1671924653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Murphy Park | Team Husain Real Estate",
        "author": "jannetpnrinehim",
        "url": "https://milpitasrealestateagents.com/milpitas-parks/murphy/",
        "text": "",
        "created_utc": 1671184020,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, my vice president at work used my records to gaslight a designer.",
        "author": "JournalistSudden8290",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/zfy5zv/so_my_vice_president_at_work_used_my_records_to/",
        "text": "Have been posting complaints on how real bat shit insane my company is on r/antiwork. I believe that this is appropriate place to share my crazy stories.  \n\n\nMy coworker, who is a graphic designer had a meeting with vice president a week ago.  \n\n\nThe designer has been working for nearly a year now, and she fucking hates it. This is a family running business, and it's real bad. \n\nLike today, she finally told me what the vice president(she is wife of the CEO) said about me. The management already knew that I got unemploymnet benifits for 6 months. And this is what I was told.  \n\n\n\"Do you wanna end up with being like Kenny who wasted 6 months for the pension and achieved nothing? Or do you wanna be the top in the industry with us? It's your choice.\"  \n\n\nDamn, I do hate this company, and NOW there is no need to care about them anymore.\n\nI am more convinced that quitting this company on January is going to be right..lol",
        "created_utc": 1670504263,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m a b to my manager but here’s why",
        "author": "PhilosopherIcy6346",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/zad5iz/im_a_b_to_my_manager_but_heres_why/",
        "text": "this is my first post to reddit! i (24f) work from home doing sales for a tech company that’s super small - there’s only 3 people on my team and my manager (40m) is rather arrogant. everything about my job was a dream until one day over zoom my manager questioned me about why i can’t point my camera lower (i always look professional for zoom meetings and keep the camera at my shoulders) - i was thrown off by this because the only thing lower to point the camera to would be my chest area. i plainly &amp; quickly stated i’m sorry but i’m uncomfortable doing that &amp; left it there. a month later he brought it up again and asks me a second time to point the camera lower. at this point i get visibly defensive and state that i will not be doing that because i’m uncomfortable showing more of my body than what’s necessary - side note he would also occasionally message me after hours letting me know that i can come to him with anything because i’m “his star” - it felt borderline creepy/like he was trying to groom me in some capacity \n\ni’m posting here because i can no longer exchange even the slightest bit of pleasantries with this man. i am completely avoidant at this point and only speak to him if communication is absolutely necessary. even over our messaging platform i’m dry and cold - it’s been about 6 months of this. not the best look for me and not the kindest way to handle myself but i can’t go to higher ups (we have no HR) because the company loves him &amp; knowing him, he’d probably skew the truth to make it seem like he never put me in an uncomfortable situation - i can’t help but to have a stank attitude towards him &amp; no matter how hard i try to put on a friendly face the resting bitch always gets the best of me. the only options i feel like i have are to either to resign or continue to feel uncomfy",
        "created_utc": 1669960276,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really don’t know where to put this but I just want it out there",
        "author": "YungFatlawd",
        "url": "https://www.reddit.com/gallery/yva2pj",
        "text": "[removed]",
        "created_utc": 1668454556,
        "upvote_ratio": 1.0
    },
    {
        "title": "My shift lead, who I have a crush on, gave me a lecture (I found it sexy)",
        "author": "Affectionate_Hat494",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/yqqrkm/my_shift_lead_who_i_have_a_crush_on_gave_me_a/",
        "text": "I work at a fast food restaurant on my university campus. Our policy is to give student discounts to students when they present their student ID. It just takes the tax off the food, but it's something. But professors and other workers have to pay the full amount. One morning, I gave a construction worker for the university the discount for the coffee. My shift lead and I were the only ones on the floor during that time, and a few minutes later, he asked me how much I charged the worker for the coffee. I told him, and he was looking at me very intently for a few seconds, like he was trying to figure out what to say to me. \n\nHe then told me that the same guy that I gave the discount got mad at another employee a few days before. This other employee didn't give him the student discount, so the construction worker threw a fit. My shift lead told me to not be giving non students student discounts. He was being super nice about it, and I was embarrassed that he had to tell me something so obvious. My shift lead then was being extra nice after. He did more stuff to help me, and he spoke more softly. Maybe he felt bad, maybe he didn't. Even if he did, he wasn't being rude, he was literally telling me the truth. But I still found it really sexy.",
        "created_utc": 1668017648,
        "upvote_ratio": 1.0
    },
    {
        "title": "The cooks kept making me help them in the back",
        "author": "Affectionate_Hat494",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/yqqd0k/the_cooks_kept_making_me_help_them_in_the_back/",
        "text": "I work in a fast food restaurant, in a Front of House position. I alternate between being cashier and an expediter. One night, I kept getting called to the back to help out with certain tasks. I got bacon strips and spread them across a pan, and stacked them in the freezer, and I weighed chicken. I was doing stuff like that. One of my shift leads kept asking me to help in the back. It wasn't his fault, because the cooks kept requesting one of us to help in the back. I was kind of insecure about it because I felt like the two shift leads didn't want me around them, but I didn't say anything. \n\nAbout thirty minutes into me helping in the back, my other shift lead (who I kind of have a crush on) came to the back. He told me that he was going on his break in fifteen minutes, and to come to the front. He told me that whatever the cooks tell me, don't go to the back. I finished just before he was about to go on break. It was almost time to close at that point, so I was wiping down tables. He got back as I was doing that, and he told me that he thought the cooks made me go the back again, and he was about to scream. Turns out, they didn't actually need the help. No one called out, they were just being lazy.",
        "created_utc": 1668016810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Student's mom angry she couldn't defraud several charitable organizations",
        "author": "applebaps",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9j7czs/students_mom_angry_she_couldnt_defraud_several/",
        "text": "I work for a state university as a cashier in student accounts.  Just got off the phone with a frustrated lady calling about her son's account.\n\nThe kid gets his tuition paid by a native corporation, and the way they work is that they pay out after all other financial aid is applied.  The kid was proactive about seeking out a ton of scholarships, and that's great.  Thing is, they told the native corp that they were done getting additional aid, so the corp paid out, but the kid didn't stop seeking more scholarships.\n\nHe thinks that extra money is going to come directly to him, so he plans to use it to buy new tires for his car (they tell me this over the phone).  So, they're confused and frustrated that they weren't able to get that money.  What happened to that refund they were supposed to get?\n\nWell, what happened is that we saw what he did and refunded the difference of the new scholarships he sought back to the native corporation.\n\nMom: \"I'm just confused because it's all so random, one semester he gets that money and now he doesn't???\"\n\nOh, I'm so sorry you got caught trying to defraud several charities, lol.  Of course you don't get that money.  I'd also like to know how long they've been getting away with doing it this way before we caught them.  How many thousands of dollars have they misappropriated in this way?",
        "created_utc": 1538001939,
        "upvote_ratio": ""
    },
    {
        "title": "\"Here's our brilliant solution to the problem. You'll love it!\" No, we will not.",
        "author": "Trishata96",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9j0svo/heres_our_brilliant_solution_to_the_problem_youll/",
        "text": "So to give a bit of back story, I work in a warehouse sorting parcels. For the past 2 weeks our shipments of stock coming from the packing centre have been late. Late as in we walk in and there is no stock to process and we end up sitting on our asses for about an hour and half waiting for lorries to arrive, that sort of late. Due to this the first half of our shift will be pleasant and calming, then when the stock does finally arrive, the warehouse descends into chaos as we attempt to get 10 thousand plus parcels processed, so we can then prep routes for the delivery drivers in the morning. Aaaannnddd because the trailers are late, which delayed us, we can only start the staging process 1 hour before end of shift. When we should be letting the drivers in 2 1/2 hours before shift end, meaning people get badgered into doing overtime.\n\n&amp;#x200B;\n\nOf course upper management decided enough was enough and lit a fire under our packing centre's ass. Oh wait. The fuckers didn't, instead they came up with THE BRILLIANT IDEA TM!\n\n&amp;#x200B;\n\nThe brilliant idea??? Instead of having us cram it all into an 8 hour shift. We get to cram it into a 10 hour shift! With shift starting an hour later at 1 AM. When most of the staff have to get public transport in and the local buses cut off at 10 to midnight.  Oh sheesh \\*slow clap\\* great idea guys, there goes half the agency staff. Not as if we already changed our shift start time 2 months ago because of this same exact problem. Not as if this means I'm going to be distrubing my family member's sleep even more when he fucking needs it. \n\n&amp;#x200B;\n\nWell looks like I'm using my days off to find a new job.",
        "created_utc": 1537952216,
        "upvote_ratio": ""
    },
    {
        "title": "you know exactly what you did",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9idwn1/you_know_exactly_what_you_did/",
        "text": "[deleted]",
        "created_utc": 1537752956,
        "upvote_ratio": ""
    },
    {
        "title": "Ooooh. I should NOT have said that...",
        "author": "BrogerBramjet",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9i5agr/ooooh_i_should_not_have_said_that/",
        "text": "I work for a trucking company in the service department.  A portion of our drivers are from a certain African country. If you saw a certain Tom Hanks movie, that one.\n\n  One of the drivers that I'm friends with comes in regularly.  He's always happy.  We had a major rain storm two days ago.  I asked why he was smiling.  \"Free truck wash!\"\n\nAnyways, onto the story.  School recently started back up.  His two kids were getting ready to go back to school.  I asked how he and his wife were doing about it.  \"I'm soooo HAPPY!  They'll be out of the house, the little terrorists... Ooooh!  I should NOT have said that looking like I do!\"",
        "created_utc": 1537670765,
        "upvote_ratio": ""
    },
    {
        "title": "Home - Gomush",
        "author": "reahigbee4574",
        "url": "https://www.gomush.com",
        "text": "",
        "created_utc": 1537484640,
        "upvote_ratio": ""
    },
    {
        "title": "Smelly Lunches are the Worst",
        "author": "MesmericDischord",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9edddo/smelly_lunches_are_the_worst/",
        "text": "I work in a pretty standard office environment doing IT work for lawyers and their support staff. This is a story I typed out in a comment and thought might warrant its own post.  The tale is one of stinky lunches and resolutions. \n\n\nMy office kitchen had an unlabeled light switch when I was hired. Or rather, it had a label, but the label must've been made a decade previous because it was just blank yellowed paper.\n\nAbout 6 months into my employ, we had a serial fish nuker and toast burner. Every day for about a month the room smelled like stinky fish and burnt toast. Now we have an active lunch room scene, with people taking time to get away from screens and chat with others to relax. It is actually incredibly pleasant and positive. People were not thrilled about the smelly situation.  There were passive-aggressive notices pasted on every microwave and wall surface possible.  Tension was building daily. \n\nNormally I would ignore this entirely, however my suite of offices is directly across from the kitchen. Our receptionist was going through air freshener at an alarming rate, and the fish smell was drifting back into our lab far too often. So being a troubleshooter at heart I head into the kitchen and look for solutions. One jumped out immediately - the fan in the ceiling. I'd never noticed it, and it wasn't on. I guess we all figured it as some relic of a bygone era. So I flipped the mystery switch.\n\nI cannot accurately express how loud and powerful this thing was. It sounded like a leaf blower right next to my ear, created a breeze, and inside a quiet (near library sound levels) office filled with busy concentrating people the sudden noise was enough to make me jump a foot. Concerned staff in neighboring offices rushed in to find me grinning and writing \"exhaust fan\" on the blank label.\n\nThe next day I padded into the kitchen while our fish nuker was heating his food. Made some smalltalk as he nervously kept glancing at the microwave. When he turned his back to grab his lunch, I turned the fan on. He jumped and spilled a few bits of green on the floor. Over the din, I asked very nicely if he could please turn the fan on next time he was heating up lunch.\n\nHe never brought fish in for lunch again, and now the fan is used on rare occasion when people forget about their food in the toaster oven or burn popcorn.\n\nTl, dr: Guy kept nuking fish, someone else kept burning toast, people were grumpy. I got annoyed and found a very loud fan, and used it to startle the fish nuker. No more fishy lunch room. The toast burner remains at large to this day... ",
        "created_utc": 1536503603,
        "upvote_ratio": ""
    },
    {
        "title": "Not your normal inspection",
        "author": "Megame73",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9avmky/not_your_normal_inspection/",
        "text": "My husband works at a company that does electrical/pluming/hvac/landscaping etc. He mostly does electrical and plumbing but sometimes helps in other areas. This company just does small jobs, things that can be done in a day or two. \n\nHis boss decided that he wanted to teach my husband how to do inspections, so he's kind of been shadowing boss. Today, he goes to help on an inspection at a property that has goats, donkeys, cows, etc. very pretty place. \n\nSo they're walking around the fields and see a cow that's calving. Cool, so they kinda watch for a minute before going back to it. This donkey decides he likes my husband and starts rubbing up against his legs. Husband sort of pushes it away, not really knowing what to do. \n\nSo they are looking at this property, and all of the sudden the donkey nudges him, gets between his legs, and lifts him up! Takes a few steps before my husband has a chance to react and jump off. ",
        "created_utc": 1535427794,
        "upvote_ratio": ""
    },
    {
        "title": "Testimonials of A Former Employee",
        "author": "uhtaylorstyles",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/9avdta/testimonials_of_a_former_employee/",
        "text": "Okay, so I worked at a very common fast food restaurant that most people have worked at least once in their life. for two and a half years from the time I was 18 until I was 20. Just like anyone else who has ever worked at any fast food joint, you know the job can be hell and you’ll see the wildest array of people you’ll see in your life. \n\nBesides being harassed by customers and some employees, having money stolen, see a man smoke meth in the smoking area, having shit thrown at me, and witnessing more drug deals that I can count I want to tell about the time one of my coworkers pulled a gun out in the middle of my shift. \n\nThere was this one dude, he was like 35ish, super funny. I loved him. We had a great time working together, but this dude and our department manager did not get along AT ALL. The 35 year old, were gunna call X, was one of those dudes who made their friendship over banter and giving each other hell. The department manager did not like that whatsoever. He took his job far too seriously for how shitty our store was. \n\nWell, we all worked together for about a six month time period I wanna say. I loved working with X. He was good with customers and usually let me get away with being on my phone and he’d have my back when a customer would try to pop off. \n\nOne day, X and DM got into a huge argument because DM wanted X back on grill with him, but our regional manager and shift managers said we needed him up front because we had literally nobody running front counter or doing ice creams and frappes. X stayed up with us during our 5-7 rush which were our busiest hours. \n\nI didn’t notice X and DM actually arguing all day. I just thought they were making sly remarks at each other until I had walked back into the back to get an earn of unsweetened tea. \n\nThis is where shit gets wild. \n\nI was in the back brewing the tea and waiting on it to fill up so I could run it up to drive thru. As I was standing there X and DM are literally SCREAMING at each other, cussing, trying to fight, throwing all kind of shit, but fights happened quite often at my store so my regional manager basically told them to shut up and deal with it later. \n\nSo, here I am my little 4’11 baby body is standing in the middle of the of the fight that has sparked back up but a million times worse. \n\nDM and X are in each other’s face. X threatened to beat the shit out of him and and DM screamed “DO IT THEN N*GGA” And X being a black man this set him OFF (rightfully so might I add) and I’m standing here deadass oblivious to what’s about to happen because i just assumed they’re still talking shit to each other when X pulls out a gun. \n\nEveryone is screaming at me telling me to move. My ex boyfriend who worked with me pulled X out of the way and my general manager was DM’s wife. She came running in from lobby and basically beating the shit out of X and X’s “baby mama” (he never let us know her name. he only addressed her as baby Mama) was outside waiting on him to get off when DMs wife went outside to fight her. \n\nThey all ended up getting fired. \n\nIt was the worst two years of my life at that job, but I got some of the wildest stories you could imagine working at a trashy food joint. ",
        "created_utc": 1535425545,
        "upvote_ratio": ""
    },
    {
        "title": "I guess I can just leave whenever?",
        "author": "Spoogen_1",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/99ql16/i_guess_i_can_just_leave_whenever/",
        "text": "So I work at a small place that does shipping and printing. 2 coworkers do shipping, and 2 (including me) do the printing. \nMy manager used to do printing with me, but now works up front, while they took a front counter person and moved them back with me. They don't have any print or design knowledge. \nThis transition happened about a year ago. So we have slowly been getting more frustrated because I cant get all my work done with my coworker cant really help, and my manager who did printing gave up on printing and doesnt touch it anymore. \n\nI was working today and my coworker comes in for about 5 minutes. I was with a customer, and I had no interactions with my coworker at this time. Me and my customer hear her say \"Im done with this place\" and walked out. We didnt know what happened. For a little while we thought maybe she was aggravated with her kids daycare. We now assume its work related. \nWhen my manager came in, we told him what had happen and his response was \" She must be dealing with something\". He didn't try to contact her at all to see what happen. \n\nNow I am having to do all the work in my department, and my manager doesn't seem to even care when people get up and leave. \n\nSo like the title says, I am now to assume I can just walk out whenever I want, and it wont be an issue. \n\n",
        "created_utc": 1535053771,
        "upvote_ratio": ""
    },
    {
        "title": "Scammed shoveling snow",
        "author": "dankmemes1143",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/991i0y/scammed_shoveling_snow/",
        "text": "So, I'm only 15, and I don't have a job yet, but I felt like I had to share this snow shoveling story. \n\nA few years ago, my county had a huge snow storm (2 1/2ft), so my friends, brother, and I decided to go around shoveling snow. An older woman called to us from her porch to ask us to shovel. She promised each of us $20. We were eager to accept, because $20 is a good amount for a bunch of preteens. It took the 4 of us 7 HOURS to finish the job. Being in the cold that long really took a toll on us, and by the end of the day, we just wanted our money. She gave the excuse that she'd give it to us tomorrow, and drove away from her cleared driveway. The next day, I go alone to gather the money, which I volunteered to walk the 2 blocks in the freezing winter, being the oldest. I get the exact same excuse that she doesn't have it. I come back the NEXT day, and SHE DENIES THAT WE EVEN SHOVELED HER DRIVEWAY! I then point out the pile of snow in her yard, and the marks from the shovel, which only confuses her more. And the funniest part about it, is, for the last amount of years, she still asks us to shovel for money. ",
        "created_utc": 1534841140,
        "upvote_ratio": ""
    },
    {
        "title": "homescapes",
        "author": "dyanepalomarizt",
        "url": "https://steemit.com/how/@kfcomg/how-to-use-homescapes-hack-for-unlimited-coins-and-stars",
        "text": "",
        "created_utc": 1534380366,
        "upvote_ratio": ""
    },
    {
        "title": "Late night phone call",
        "author": "BeautyNoBeast",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/97azd3/late_night_phone_call/",
        "text": "Alright, so I work third shift (10pm-7am) at a convenience store really well known in my area for our broasted chicken. Sadly our deli closes at 9, and I can only serve deep fried food on my shift. I get a lot of calls asking if I can make this or that or if we are still delivering, etc, but the call I got tonight just left me confused.\n\nSo maybe 20 minutes into my shift last night the phone rang. The conversation will be pretty much verbatim, so apologies in advanced for the language. Also, just imagine everything he said being yelled angrily.\n\nMe: Thank you for calling [redacted], this is [me], how can I help you?\n\n(C)aller: I WANT SOME MOTHERF#CKING CHICKEN\n\nI was honestly completely shocked so I just stood there silent and confused. At first I thought maybe it was my manager pranking me by having one of his friends call in. (He's done similar things in the past, but less angry and more drunk.) \n\nC: ARE YOU F#CKING DEAF? I SAID BRING ME SOME D@MN CHICKEN\n\nM: (not sure what else to say) umm I'm sorry, our deli closed at nine.\n\nC: F#CK YOU, YOU B1TCH *hangs up*\n\nI honestly should have hung up after the first thing he said, but I've never had a call like that and was just completely shocked and confused. Heck, I still am.\n\nTL;DR: I guess someone really wanted broasted chicken?",
        "created_utc": 1534272283,
        "upvote_ratio": ""
    },
    {
        "title": "Hypocritical Manager",
        "author": "pr_kitkat",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/977iqz/hypocritical_manager/",
        "text": "So I usually work closing shifts at my fast food job. I’m responsible for taking out all the garbage in the lobby, sweeping the floors, wiping lobby tables down, mopping the bathroom and lobby floors, scrubbing the bathroom sinks and toilets/urinal, sanitizing the soda machine nozzles, and stocking up on anything that’s running low. All of this usually takes me a little over an hour to do (like less than 75 mins). Well, one of my managers got pissed at me because it took me a little over an hour to finish everything one night and told me I need to work harder/faster since I’m also responsible for cleaning the kitchen area. This is a surprise since I was never informed about having to also clean the kitchen area. I was trained to only clean lobby/bathrooms, then do any leftover dishes that haven’t been washed yet. If I was told that the kitchen was my responsibility as well from the very first day I started, I would have been on top of everything, but no one ever told me or trained me on how to clean the kitchen. I’m a bit upset because she’s scolding me for something I was never informed about, but I get over my hurt feelings and move on to the kitchen.\n\nA few minutes into cleaning the kitchen area, my manager came up to me and asked me to cover for her in drive thru because she’s tired and wanted to sit down for a while. This really pissed me off because she was lecturing me earlier about how important hard work is and how we can’t be lazy and slow at work. Like why do you get to be lazy? Just because you’re a manager? I feel like I’m overreacting, but I can’t help feeling bitter about her hypocrisy. I also feel like she has something against me because I ratted her out to the higher level manager for making me scoop shit out of a toilet during my first week. I feel like she picks on me so much while treating our coworkers like friends. Idk I’m just sick of working at fucking fast food. As if the entitled customers weren’t enough, I have to deal with terrible managers who have no leadership skills.\n\nEdit: Wanted to add that my manager was gone for like 20+ mins. I know it was less than 30 mins. She came back to drive thru after 10 mins, and I assumed her little “break” was over, but she just came to get a fucking soda for herself, then left again.",
        "created_utc": 1534245864,
        "upvote_ratio": ""
    },
    {
        "title": "When you work with students (reposted to correct sub)",
        "author": "hardblob",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/973mwr/when_you_work_with_students_reposted_to_correct/",
        "text": " I was told this would be better place for this- repost from r/TalesFromTheCustomer \n\nTLDR; Entitled student demands everything for free threatened lawyers. Owner overreacted and kicks them out.\n\nBackstory: I run a rental property that helps produce digital media for students/small biz/or whomever.\n\nWe get a pair of projects that need a location and crew to film. They are students and desperately need help.\n\nThe first project needs help acquiring a cast and crew--everything goes fine with that.\n\nSo two weeks go by and I don't hear anything from the lead producer of the second project.\n\nHowever I had been communicating to a project lead (also known as our point of contact (P.O.C.) about everything we were doing and the charges for our services that applied--heavily discounted for the students. However, as time goes on, a shoot day is not reserved and logistics aren't even finalized. Apparently the Project Lead would continuously cancel meetings.\n\nThat was Wednesday of last week.\n\nThursday: they show up with gear that piled up and took over my rental space, causing me to cancel an event.\n\nThey drop their gear off and leave. No notice or prior approval and inform me they will be here Sunday to film. (Couldnt talk, an Uber was waiting... bullshit) I inform her this is not ideal but I will stay up with the P.O.C.\n\nFriday: we start construction of the contracted props and spend $100 in supplies and a the rest of our weekend building. They looked good, and worked properly and we had the go ahead from the client.\n\nSaturday: we finalize our construction get it to the studio and start setting up. That's when we get a call from our P.O.C. She had quit and is no longer part of the project.\n\nShitty! O well life goes on, I still work. I get an email from the Project Lead with a half-assed excuse about how our P.O.C. and her \"heart were too close to it\" and asked if we could update her on the progress.\n\nI take the time and compile everything we talked about and the agreed upon invoice. (&lt;$350). I inform them that they have 30 days to pay and we can do a payment plan, as well as work off the debt.\n\nSunday morning: I wake up to an email detailing how what I'm doing is not legal, she will be getting a lawyer and will be over to use our space regardless of what we think. Okayyy....?\n\nShit goes down. The owner decided to not respond and wait for them. The project lead and the entire crew shows up late and starts to take over.\n\nNow, what happened next is not my bosses best moment so I hope all you aspiring business owners take heed.\n\nBefore we started he asked the lead to sit down while starting to explain to her that he hadn't signed the waiver yet and she can't film until they settle this.\n\nWell, a mix of \"You don't have the right/I'm getting a layer\", yells on top of \"Get your shit and get out\" shouts deteriorated into a cluster fuck of threats, tears and the claim that our company stole/rips off/ harassed her crew and are unprofessional. The threat of a negative Yelping was responded with a cold \"No one fucking cares about what you think!\" from our owner. Too much?\n\n20 minutes later they finally start moving gear out but not without tossing one line attempts to burn me, my partner or our employees. Fine, it's all they got.\n\nMuch credit to the Project lead's life partner. With a cool head and weapons of logic, she and I talked about the situation and came to the conclusion that it was a mix of miscommunication and inexperience from the project's leads.\n\nI the finacial manager and my business partner (I fronted the money to build the props) decided to offer the pre- built components as a peace offering. They left and now we wait.\n\nWe will still work with students but we are adjusting our parameters.",
        "created_utc": 1534205670,
        "upvote_ratio": ""
    },
    {
        "title": "Meat Packer - Terrifying Experience",
        "author": "dd1myt",
        "url": "https://www.youtube.com/watch?v=40qGWLb4Q98",
        "text": "",
        "created_utc": 1534022814,
        "upvote_ratio": ""
    },
    {
        "title": "Sniff Sniff",
        "author": "greyspot00",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/95mpne/sniff_sniff/",
        "text": "Meet our actors:\n\n`Me: Around 19, fatty, not too good looking working at a building that was half department of health and half state police forensic lab. I am a janitor.`\n\n`CL: Creepy lady. Dressed nicely in a business-casual skirt and I don't remember what top (It's been 10 years), maybe mid 40's, tall and thin with long blonde hair`\n\nFor some reason a lot of the DOH researchers were... weird. Like the nerdy lunch table I sat at in highschool weird but worse, they had none of the nerd charm as you are about to see.\n\n\\_\n\n*Mopping one of the the metal stairwells on the DOH side of the building. Got my signs, bucket, mopping, humming, doing my thing.*\n\n*CL opens stairwell door to go up.*\n\nMe: Careful on the stairs ma'am, they are still wet.\n\nCL: Thank you!\n\n*She steps around my wet floor sign and climbs a few of the steps before stopping briefly, turning around, and slowly coming back down to the landing with me, mop in hand.*\n\n*She has a \"thinking really hard\" look on her face, then sniffs a few times.*\n\nCL: What is that?\n\nMe: Oh yeah, the soap has a great orange smell. I love it.\n\nCL: No.\n\n*Steps towards me, uncomfortably close.*\n\nCL: \\*sniff sniff\\*\n\nMe: ...Is there something wrong?\n\nCL: That smell, what is it?\n\n*Personal space shrinks as she gets even closer. About to crap my pants.*\n\n*CL presses her nose against my chest. She breathes in deeply, and exhales in a shuddering sigh that I can only describe as somewhere in the space between relief and arousal, the creepy sigh the stereotypical weird guy in your movie of choice does when he sniffs a lock of hair from the woman he idolizes, and the places on her shrine.*\n\n*At this point, I have no funny or interesting reaction. I'm speechless. I'm weirded out and kind of afraid, having very little physical or personal-space interaction with women in my short, Christian life.*\n\n*She lifts her head, looks me in the eyes, noting the worried expression on my face and perhaps recognizing the inappropriateness of our interaction, then proceeds to LEANS BACK IN FOR ANOTHER SNIFF, but this time shoving her nose into my shoulder, right at my arm pit.*\n\nCL: *She closes her eyes.* \\*sniiiiffff, followed by a low moan\\* That scent is amazing. What is it? Is that cologne?\n\nMe: Uh, um, Old Spice?\n\nCL: Wow, that must be new. \\*getting a final sniff\\* *She lifts her head, smiling at me.* I'll have to get some of that!\n\n*She turns and starts walking up the stairs again, turning halfway to smile at me again, and then continues upwards. I never saw her again.*\n\n*I'm stunned for a few minutes.*\n\n*I feel violated.*\n\n*I feel flattered.*\n\n*I feel sad for her, because she'll never smell that again.*\n\n*But mostly, I feel embarrassed.*\n\n*I forgot to wear deodorant.*",
        "created_utc": 1533740196,
        "upvote_ratio": ""
    },
    {
        "title": "Butthead Marina Client",
        "author": "dragonbrian422",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/92svuc/butthead_marina_client/",
        "text": "EDIT:: Post was found by management at the Marina. Hours were dropped as response. Down to 1 shift a week. \n\nNOTE: All names have been changed, including brand names. \n\nCAUTION: Formatting is weird, because this was typed on a phone. \n\nBackground Information:\n\nI work as a dockhand/gas attendant at an older marina on a large lake. This is important information as it affects a great deal of our procedures, systems, and how we handle our clients (people who dock at our marina) and guests (customers who don’t dock at the marina). Many of our electronics systems have stopped working at the gas station at our marina due to both age and weathering. \n\nStorytime:\n\nIts a Thursday afternoon aprroximatly 2pm or so. Its VERY slow so several staff members were allowed to leave early, which left myself and 3 other dockhands, all spread across 4 docks of 24 slips each. Being the attendant for dock 1, which is the one with the gas station, I was responsible for cleaning rental boats and our fancier client rentals. These boats consist of mainly 3Breezes bowriders and CBC-1 style pontoons. I was half down the dock cleaning a 3Breezes boat when someone calls me on the walkie and says “Hey, there’s someone looking for gas. He doesn’t look like he’s in a good mood. It may be Mr. Boatguy from slip number.” I thank them and run over to help this person out. \n\nI get over and his boat, a wakeboarding/tubing 3Breezes, is slamming into the dock as he didn’t do such a hot job tying to the cleat. Granted, I should’ve been there to help. Once I get there he starts screaming at me “Where were you?! I honked 4 times and pulled in 3 times before this! I’ve been waiting for 45 minutes!” I apologize and say “i’m very sorry sir. Were just spread a bit thin today. I was just down the dock a little bit. If I missed the honking and you pulling in, I’m very sorry.” And he keeps going off. “You guys used to have a camera where you could see people looking to get gas and the customers could see how the lines were! What the hell happened to that?!! You wouldve known I was waiting!” \n\n“Sir, I’m sorry for the wait. I’m not familiar with the specs of whether or not we have a camera. If we did have a camera, I assure you, it would be working.” I later found out the camera fell apart from age as it had been out there for years in the weather. \n\n“HMMMPH! Whatever. Just fill my boat so I don’t have to waste any more f**king time here.” He screams. I’m staying calm but I’m starting to shake a little bit because he’s getting more and more angry. \n\nI grab the nozzle and go to his gas cap. I get there and he goes “I wanted EngineTech! Not regular! Don’t they train you idiots?!”. They do train us, but unless otherwise requested we pump regular fuel because its cheaper to get the EngineTech additive and add it yourself. \n\nAgain I apologize and get the other nozzle. I drag the hose across his back swim platform since he pulled in wonky like and he goes nuts. “Can’t you keep it off my deck?!! You’ll just mess it up!” So I calmly respond albeit still shaking, “If you’d cut the engine I’d let it go in the water but at this time your propellor is going to cut my hose and spew gas into the lake. I don’t think you want that.” \n\n“You’d better not spill on my finish. Gas eats boat finishes! Doug, your lazy ass service manager can just add it to the list of sh*t he needs to fix!” Still screaming at me of course. “Speaking of, where is that SOB?! He never answers my calls and never calls me back when I leave messages!” At this point this guy is about 2 feet away from me. I say seriously shaking cause he’s pretty much screaming in my face at this point, “Sir, once I finish filling you up I’ll see if he’s on site. I know there was an important delivery he had to make.” \n\nSo I finish filling him up and start ringing him up on the terminal by the pump. It takes a while since its a REALLY old terminal. He gets off the boat, comes over and starts screaming “How f**king long does it take to ring up 120 f**cking dollars of fuel?!! You must be doing something wrong! Stop screwing around.” \n\nSo I finish ringing him up, and, still shaking, hand him the paper to sign. He draws a line. I take it back and step a few feet down the dock to try to walkie talkie Doug. Doug’s response? “I can hear the screaming from the other end of the property. Tell Mr. BoatGuy I’m not here.” So I do and BoatGuy says “just like him to run off.” \n\nAt this point my manager, Robert, comes over and despite trying to defuse the situation he makes it worse and then walks away. I until BoatGuy’s 3Breezes and push him off. As I do, I tell him. \n\n“You want to know why no one answers your calls or calls you back? It’s because you act like this. Like a stuck up, hostile, 3 year old throwing a temper tantrum when he doesn’t get his way. Do me, and all the staff a favor and p*ss off.” \n\nMy manager says “well you probably shouldn’t have said that, but at the end of the day, even if he’s not getting our gas, he’s still docking here and paying us for that. So I guess its ok this time but the next time just walkie me and I’ll handle it.” \n\nI walk away cause I’m angry now. I deal with 20 min of BoatGuy’s harrassment and screaming and my manager says he’ll deal with it next time? Here’s the fun part, he was the one who told me it was BoatGuy at the gas pump. Turns out BoatGuy has a habit if being like this. \n\nFrom now on, I’m not helping BoatGuy. He can get stranded in the middle of the lake for all I care. ",
        "created_utc": 1532845590,
        "upvote_ratio": ""
    },
    {
        "title": "Willy the Luddite Lawyer",
        "author": "DiscordianFnordette",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/923oz2/willy_the_luddite_lawyer/",
        "text": "Let me tell you about the worst boss I ever had.\n\nHis name is Willy. Okay, that isn’t his real name. All names have been changed to protect the guilty. But Willy is close enough. \n\nWilly was an attorney. Well, probably still is, but after I left I never looked back, so I honestly don’t know. He and his long-time business partner, Jerry, ran a small but relatively successful law firm in the Midwest. I don’t want to go into too much detail about the kind of law they practice, because it’s a small enough pool of people that somebody might figure out their real names. But they found one of those small but lucrative niches helping a specific type of company with a specific type of regulatory compliance. They helped their clients stay on the government’s good side whenever possible, and helped clean up the mess when their clients screw up. They never saw the inside of a courtroom, rarely had to see their clients face to face, and generally had a pretty cushy setup if you didn’t mind doing the same thing day in and day out for your entire career.\n\nThey had been doing this successfully for decades by the time I came around, and really had no interest in changing, well, anything at all about how they did business. That includes having no interest in addressing the fact that Willy was a TERRIBLE boss. Staff turnover was incredibly high, and everyone knew Willy was to blame. Most people didn’t last 6 months. If you were good enough at your job then when you inevitably said you were quitting they would offer you a large salary, money for continuing education, and a number of other perks to get you to stay and put up with the old coot. They knew they had a problem, they just didn’t seem to care.\n\nFor one thing, Willy liked to yell. A lot. He actually warned me about that himself during my interview. Things could get tense in the office, especially if he was up against a deadline, and he acknowledged that he had a tendency to yell, curse and stomp around when he got stressed out. Nothing personal he promised, he just needed people who were calm under pressure and didn’t mind him barking orders. I told him that wasn’t a problem. I have a thick skin, and I don’t mind a few curse words. And it would have been fine, if that was really all he did. \n\nBut Willy did make it personal, and he was mean. He would micromanage, berate you and call you stupid if things weren’t happening fast enough, and just generally act like a spoiled toddler when he didn’t get his way. He was rude, sexist, demeaning, impatient and capricious. Sometimes it was funny when it wasn’t directed at you, but overall it did not make for a good work environment.\n\nHe also did not trust or understand most modern technology. He had grudgingly accepted the usefulness of email, and learned to use his BlackBerry fairly well, but that was about the extent of it. He believed that paper records were king and wanted us to work primarily from his physical files. Computers were mostly a way to print documents and keep backup copies of things. Which might not have been that bad, except that the high turnover and the somewhat complicated nature of his filing system meant that the files were an absolute mess. Things were never where they were supposed to be, but if you couldn’t find them right away then it was your fault, even if the mistake had clearly been made long before you started working there. \n\nThe electronic backups were at least a little easier to manage because you could search by things like keyword or date range, find the electronic copy and maybe even find some clues as to where the paper copy might have been mis-filed. But he automatically equated being on the computer with goofing off. If he caught you on it while he was waiting for you to find something he would unleash a torrent of abuse and demand that you get up and start searching the paper files immediately.\n\nI should probably point out that this was not that long ago. We’re talking during the Obama administration. Computers and the internet were not exactly new, but Willy was still convinced they were basically fancy typewriters with games on them.\n\nI only worked for Willy for a few months, but I have many amusing stories from my time there. There is one story, however, that is by far my favorite, and I think a perfect illustration of Willy’s fun breed of insanity. \n\nIt started off as a slow enough day. Willy was out of the office running errands most of the morning, which meant things were quiet and we could actually get some work done without him breathing down our necks. I was just a basic admin assistant doing filing and the like, so when he wasn’t around it was a pretty simple, low-stress job. Then, Willy called. His friend was having some kind of medical emergency and had been rushed to the hospital. He was on his way to pick up his wife and go over there. But for some reason they needed the guy’s home phone number. I honestly can’t remember what the reason was since the guy was in the hospital, and presumably his family was there too, but apparently it was vitally important that he (or rather, his wife) have that number immediately.\n\nNow you might be wondering why Willy would call the office for his friend’s phone number. Well, one of Willy’s few redeeming qualities was that he was constantly helping his friends and family with legal issues pro bono. Of course these usually had nothing to do with the kind of law that he practiced and there was rarely much he could do for them, but if someone wanted a letter on legal letterhead, or help negotiating a contract, they could usually talk Willy into helping them out. He had a couple of these “clients” who were actually really demanding and annoying, and he just couldn’t seem to say no to them. I think it may have had something to do with the fact that he was a petulant man-child who would have run off all his friends if he wasn’t willing to do favors for them.\n\nAnyway, even though these clients weren’t paying, we treated them like regular clients and kept files on them (though of course they didn’t fit well with the regular filing system because they were nothing like the regular clients). And this guy, who was apparently a good enough friend to require the “drop everything and freak out” treatment, but not a good enough friend for Willy to have his number stored in his BlackBerry or his Rolodex, had once upon a time needed a letter written about something. So, in theory, there should have been a file somewhere with the guy’s contact information. But of course, it was nowhere to be found, and nobody could remember who the letter was to, or what it was about, or anything else that might have helped us to find it.\n\nWell this was just not acceptable. Willy needs the number, he’s got his wife on the other line freaking out at him, and he’s not happy. And this is clearly our fault that we don’t have a phone number for some guy he once wrote a single letter for, years before any of us started working there. He wanted it found ASAP and he didn’t want any excuses. “Look him up in the phonebook then! Just get me that number now!”\n\nLook him up in the phonebook. Now that’s an interesting suggestion. Only two problems. For one, like I said, this wasn’t that long ago. The phone company had not routinely sent the residential white pages in years. We weren’t entirely sure they even still printed them. We certainly didn’t have a copy in the office. But we did have the internet, so we should be able to use that, right? Well, except that brings us to problem number two. The guy’s name was John Smith.\n\nOkay, obviously it wasn’t actually John Smith, because like I said the names were changed. But it was legitimately that generic. It was so generic that I could tell you the guy’s real name, and you would be sure it was fake. I actually didn’t want to believe it myself at first. Surely he was punking us. Nobody actually had a name that generic, right? But oh yes, people do. A quick online search showed hundreds of listings with that name or a similar variant in our city alone, dozens in Willy’s zip code. And we didn’t know his address, or even how Willy knew him. Using a phone book alone would have been absolutely pointless unless we wanted to spend hours calling people until we randomly hit on the right one (and probably not even know we had, since like I said we assumed nobody would even be home). \n\nOne admin continued looking through the paper files at random, hoping to get lucky. Another was digging through his office, thinking maybe she could find a folder stuck in a drawer or something. And I started digging through the computer. I knew this was probably our best chance, because Willy was at least smart enough to have a policy that nothing was ever deleted, only archived. So if there had ever been any kind of written correspondence with or about the guy, we would have it somewhere.\n\nSo, I began searching the email and file archives for any trace of the guy. Not surprisingly, even here there were a LOT of hits for “John Smith,” and of course I also had to search for “John” and “Mr. Smith,” and I didn’t have a date or any other keywords to go on, but it still seemed like our best shot. And sure enough, eventually I found an email from Willy, to someone who no longer worked there, asking them to draft up a letter for his friend Mr. Smith. And it had the guy’s phone number! \n\nI had solved the puzzle. I had the information he wanted. I was a hero! Or so I thought.\n\nI sent the number to his BlackBerry and got no response, not even a “thanks.” A few hours later Willy showed up at the office to pick up some things. Was he happy that we’d done the impossible and found the right John Smith in less than an hour? Of course not. He was furious that it had taken us so long (and that he’d had to listen to his wife yell at him about not having the number). What had we been doing all that time? I started trying to explain why searching for “John Smith” is actually kind of challenging, when he cut me off. “Why didn’t you just use the phone book like I told you to?!”\n\nYes, he seriously thought that looking John Smith up in the phone book would have been faster than searching through the computer. I tried to explain that an online search had not turned up anything useful, but he wasn’t having it. If the online phone book wasn’t helpful, then it must not be as good as the paper book. Why didn’t we just use that? Unable to get him to realize the ridiculousness of that statement, I eventually told him that we didn’t have one. The phone company stopped sending them years ago.\n\nHe did not like that one bit. First he insisted that we were wrong. He stormed off to the conference room and came back with the yellow pages. I had to calmly explain to a man more than twice my age that the yellow pages and the white pages aren’t the same thing, and physically show him that there were no residential listings in that book. Once he came to accept that we did not have a copy of the white pages, he decided that this was again proof that we were stupid. Did we not know that a business needs to have the white pages? If the phone company forgot to deliver one, we should have called and demanded it. In fact, he insisted that we call RIGHT NOW and get copies for every person in the office.\n\nSo, it turns out that yes, the phone company does still send out the white pages on request (or at least did at that time), though the person I spoke to was very confused as to why a business was requesting even one, let alone nearly a dozen copies. I’m pretty sure they thought I had lost my mind, but they sent them. And Willy seemed so proud when they arrived, like he had solved some great mysterious problem that his idiot staff couldn’t figure out. Those phone books are probably still there to this day, taking up space and gathering dust on people’s desks. \n\nSadly there was no great revenge, no perfect ending to the story. It was really satisfying when I found a better job and was able to tell him to shove it, but I’m sure it didn’t really affect him in any way. But hey, at least I got a funny story out of it.  \n",
        "created_utc": 1532622061,
        "upvote_ratio": ""
    },
    {
        "title": "Changing Diapers Where They Should Not Be Changed",
        "author": "superbbirb48",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/91p3mz/changing_diapers_where_they_should_not_be_changed/",
        "text": "Writing the story about the mom whose baby accidentally got poop on the floor reminded me of another diaper-related story.\n\nI work at a children’s museum, so we have many guests who come in with children young enough to be in diapers. The majority of these parents/caregivers change their baby’s diaper in the restroom on the changing table, where diapers should be changed.\n\nHowever some parents/caregivers do not go to the restroom to change their baby’s diaper, and instead decide to change the diaper on a table where there are literally items that children play with. Yes the caregiver lays down a blanket first so the baby’s diaper and bare bottom are not touching the surface, but I feel like that isn’t enough protection from poopy-germs. It is especially shocking considering the fact that we have a restroom on every floor.\n\nWhen we see people doing this, we direct them to the restroom and tell them that they cannot change diapers on the tables like that, and we sanitize the area.\n\nIt confuses me because I feel like that is something people should know not to do.\n\nEdit: However, I am young and don't have children, so I apologize if I am speaking out of ignorance.",
        "created_utc": 1532497115,
        "upvote_ratio": ""
    },
    {
        "title": "My experience working as a intern for a Congressman in Washington, D.C.",
        "author": "theketchuplord",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/91obbm/my_experience_working_as_a_intern_for_a/",
        "text": "Hey Reddit. I know this is long, but I really think it's necessary. Most Americans don't know what it's like in Congress for those who aren't elected officials. I wanted to provide the perspective of those on the lowest rung- the intern.For the sake of anonymity, I will not state specifically which office I worked with, nor will I state my name. \n\n\nI’m a double major in political science and history, and I’ve always loved the thought of working in government. As a matter of fact, I can seriously say that I have never considered any other career path in my life. I see working for government as the highest form of public service- after all, everyone who works in a government job, from the DMV to the President of the United States, is a paid employee of the people. I hope to one day be lucky enough to be a public servant that can help those who need it the most. \n\n\nSo, I was ecstatic when I learned that I got an internship in Congress. Finally, I’d be able to work in a place where I could see how people could make a difference in my country. Finally, I’d be able to see the inner workings of the so called ‘swamp’- a place where lawmakers work together to advance the interests of the American people, from Iowa to New York. Finally, I’d be able to work in Washington, D.C., the capital of what I consider to be the best country in the world. \n\n\nWhen I got to the office, I was surprised by how kind and personable the staffers and other interns were in my office. As a Democrat, I was worried that my political opinions would be stifled and ignored in the office. Instead, I stepped into a office that not only was politically tolerant, but also was fun to work with. My boss, the staff assistant, was a jolly guy who ensured that the interns could not only focus on different policy initiatives (be it healthcare, taxes, or social issues, etc.), but also made sure that we had ample opportunity to find ways to advance our career in Congress. My chief of staff was nothing but accommodating, and even ensured that he could get me into contact with offices that aligned more with my political affiliation. \nThe first thing I learned at the internship was that politics does not matter when you work in Congress. Everyone is interested in networking to find something (be it a job, a congressman, or even just friends) that help them out in the long run. It doesn’t matter whether you’re a Democrat or Republican. If you showed the initiative, that was more than enough to make your presence known among staffers and members of Congress. \n\n\nOne of the reasons I came to intern in Washington, D.C. was because I secretly wanted to see what the political climate was like in the center of American politics. And what I learned was that the House of Representatives and the Senate is the calmest dumpster fire I have ever seen in my life. Since I make sure to pay attention to political news every day. And some of the news stories I have seen have legitimately terrified me. Republican lawmakers have not worked towards ensuring that the United States election process is secure, nor have the majority even considered that the FBI may be right in the fact that Russia has interfered in the elections of another sovereign state. Not to mention that Sacha Baron Cohen has done a fantastic job in uncovering the insidious intentions of politicians like James Spencer, who clearly sees those who are not like him and his brethren (i.e. white) as Americans who deserve equal rights. \n\n\nYet no matter what, every single office I worked in or visited was full of smiling faces that worked towards fulfilling the interest of their boss. For the most part staffers and interns were much nicer to constituents who visited their office in person. Those who worked for organizations and lobbied for different interests were treated to a beverage and a snack in some offices. Every single time. Of course, I totally understand why. They’re guests of the office, and it was only right to treat them with respect. \nHowever, I can’t say the same for the constituents who had the heart to call their representatives in order to voice the opinions that they had the constitutional right to let their elected official know what they think. Most of the time, my office (and a lot others) would be annoyed with the fact that they were getting calls in the first place. Every single time that a constituent called in with an opinion, no matter how kind or vitriolic, me and the other interns in many different offices would simply write down their names and numbers, and that was the end of that. I can say for sure that the representative that I worked for never knew what the constituents who took the time to call their office thought of his policies or his voting record.  In the office that I worked in, congressional staffers wouldn’t even pay attention to the names that interns had written down, even if they lived in the district. Interns often joked about some of the people who called in. I found it worrisome that those who called in the most often had the most criticism levied against them, even by the interns. \n\n\nI was also fortunate enough to meet my representative as well, and he was just as kind as the staff that he hired. He wanted to know more about me as a person, more than what part of the state that I came from. Yet, as a black intern, it was still extremely hard to look past the memorabilia in his office, especially when he showed me a picture that he took with the infamous Strom Thurmond. It was hard to reconcile the nice Congressman I met with his pride over one of the most well-known segregationists in United States history, and it was even harder to feign awe at the photo. Politics don’t matter, but the way that you act around your boss, the congressman, does.\n\n\nWhile I loved working in the city of DC, I can say without a doubt that working for Congress was one of the most disturbing experiences I have ever had. This was a chance for me to really see what the people who worked in our nation’s capital were like. What I expected was one of the most partisan areas of the country. After all, staffers of all types of political affiliations were there. What I found, on the other hand, were actual people. There were staffers that were doing their jobs to ensure that not only were the congressman’s wishes carried out, but also trying to pay off their student loans. There were Congressman that were charismatic, no matter how loathsome I found their political philosophy to be. And there were interns, just learning how to navigate their way through all of this. And through it all, I sat and watched everything go crazy while everyone went about their normal lives. \n\n\n\nThough our lives were anything but normal. After all, we were all working for the interests of the former host of The Apprentice. How could any of this shit be normal?\n",
        "created_utc": 1532489621,
        "upvote_ratio": ""
    },
    {
        "title": "Just bothered me a bit",
        "author": "superbbirb48",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/91m68b/just_bothered_me_a_bit/",
        "text": "I work at a children’s museum, and every once in a while a little kid has an accident and accidentally goes potty on the museum floor. Usually the parent or sibling or babysitter is very apologetic when they tell us about it, and since little kids are little kids, it’s not a huge deal for us to clean it up, even if it is a little gross. \n\nI started working there this summer (although I have volunteered there during the summers for a few years), and a few weeks ago I had my first experience with a little kid having an accident. This one was a very young child who still wore diapers, and her diaper had overflowed when she pooped in it.\n\nI happened to walk by right after it happened, so the mom made eye contact with me and said “She pooped,” with a straight face. I replied, “Oh okay, I’ll get that cleaned up.” The mom didn’t apologize or say thank you or anything to me.\n\nAs I begin to walk towards my supervisors to ask them what to do since I have never cleaned up an accident, I notice the mom is heading to the restroom, but she is having trouble managing her baby, her stroller, and another bag. \n\nSo I say, “Would you like me to carry anything?” to which she replies by handing the bag to me without a word. I carry it to the restroom for her, and when I set it down next to her, she doesn’t say thank you or anything to me.\n\nIt didn’t bother me that the baby had gotten poop on the floor, because that’s not the baby’s fault or the mom’s fault. What bothered me is how the mom interacted with me.\n\nBut I understand. She was probably embarrassed and flustered about her baby accidentally getting poop on our floor, and that’s probably why she didn’t apologize or say please or thank you as I carried her bag for her, so I can’t really be mad at her for that. But for some reason it just really irritated me, as much as I reminded myself that she was probably just embarrassed and flustered.",
        "created_utc": 1532472029,
        "upvote_ratio": ""
    },
    {
        "title": "fast food jobs aren’t worth this much suffering",
        "author": "pr_kitkat",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/90w8qf/fast_food_jobs_arent_worth_this_much_suffering/",
        "text": "So I’m about 2 hours into my shift, and I’m wiping tables down in the lobby and sweeping the floor. My manager comes out of the bathroom and tells me I need to clean the bathrooms. I think all I have to do is sweep the floors for any stray toilet paper/paper towels, wipe down the sinks, and replace the bin bags if they’re full. No problem, right?\n\nI was sorely....... *sorely*..... **wrong**...\n\nI go into the first bathroom (the one my manager came out of), and I see a clogged toilet filled with lots of paper towels and **un-flushed chunks of a #2** hidden right under... I try to flush the toilet, but it just won’t *fucking* flush no matter how hard I push the handle. I stand there over the toilet for a few minutes trying to flush it, but the damn thing *just won’t go*. I give up and rush out to my coworkers, and they tell me I can grab a garbage bag and use a [grabber tool](https://www.janilink.com/img/p/O/Ez%20Grabber%20black%20n%20silver%2072%20view.PNG) to scoop the stuff out. I do so, but a different manager stops me and tells me the grabber is **only** used for picking up garbage from the parking lot. If I use it to clean the toilet, I’ll have to let the higher ups know why it is unsanitary and can’t be used for general purposes anymore. Another coworker says the same thing and *takes the grabber from me*. I ask my other coworkers for suggestions, and they say the only thing left to do is **use my hands** to scoop that stuff out.....\n\nI want to refuse, but I’m still new. I don’t wanna get fired or anything so I do what I’m told..... I put on 3 pairs of gloves and bring a garbage bag into the bathroom. I scoop out the layer of paper towels and toss them in the garbage bag. I try not to think much of it, but then I got to the **actual shit**. It’s *gooey* and *partially liquefied* at this point. I slowly reached into the toilet bowl, hesitated, then quickly scooped out as much as I can. The first thing I noticed was the *pungent smell*. It hit me like a fucking truck. Who knew a layer of paper towels could hide such a stench??? I gag and tear up so bad, but I have to finish. After I regained myself, I quickly scooped out the rest of it into the garbage bag. I tie the bag up, run out of the bathroom, and toss it out all while gagging and tearing up. I immediately washed my hands multiple times with hot water and soap, but I still feel dirty...\n\nI’m sorry this is so long and detailed, but I still can’t get over this. No matter how much I try thinking about other stuff, it’s still stuck in my mind. I hate myself for going through with it out of fear of being fired. I should have just rejected, but I desperately need a job to pay for college and bills..... God, I still feel so damn dirty. I don’t think I’ll ever feel clean ever again.",
        "created_utc": 1532245604,
        "upvote_ratio": ""
    },
    {
        "title": "Co-workers sort of have a clue, customers don't know clues exist even after directly told \"this is a clue\" (unrealistic expectations of service time)",
        "author": "MKEgal",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/90qqa8/coworkers_sort_of_have_a_clue_customers_dont_know/",
        "text": "I work in a uniform &amp; equipment shop doing repairs &amp; alterations of textiles.      \nMost things are routine *(hem pants, put unit patches &amp; names on shirts, repair holes, etc.)*.      \nI like the things that aren't routine. Usually.     \n&amp;nbsp;     \nYesterday (Friday) afternoon, 14 new police officers walk in with their TO *(training officer)*.     \nI was told later by the lead sales guy that they hadn't given us a head's up, which would have been nice with a larger group - we could have had the basic things they needed pulled &amp; ready for them.      \n&amp;nbsp;      \nPartway through their visit, 3 decide that the off-the rack armor carriers their TO had ordered don't fit their body armor and so need to be altered. *(This is why most departments have their officers fitted for this important piece of safety equipment.)*    \nEnter the seamstress.     \n&amp;nbsp;     \nLuckily, they want a fairly easy solution - open the sides of the back &amp; let the armor hang out. It will be hidden from view by the front panels so doesn't matter that the armor is blue &amp; the carrier is black.     \nWhat the customers don't understand (though the sales people sort of do) is how blippin' **long** it takes to tear apart the factory stitching without damaging the thing they're expecting to help protect their innards from bullets for a couple years!     \n&amp;nbsp;     \nThere was a faster, easier solution - cut it off. Make it narrower by maybe 0.5\" on each side. They wouldn't have noticed.     \nMaybe I should have just started there, not said anything. Or at least brought it to them as a faster option.     \nBut no... I did it the right way. Put extra binding on the now-exposed raw edges so they wouldn't fray, made it look like it came from the factory that way.    \nTook me the rest of the afternoon (several hours). Finished 25 minutes before we closed. Carried everything up to the sales person, who called the TO... who asked if we were open Saturday. *(No, only over the winter.)*    \n&amp;nbsp;      \nThe TO was apparently annoyed that I hadn't been able to do these **while they waited**!!!!!    \n*(I had told the sales guy that I'd have them done by the end of the day, and this was not a 'stand around &amp; wait on it' thing. Guess the customers didn't believe me.)*         \n&amp;nbsp;    \nWisely, the sales manager on duty had not taken me up on my suggestion of giving the new officers seam rippers so they could sit with me &amp; take apart their own carriers, while I put them back together better.         \n*(I was a bit grumpy at that point, &amp; it would not have turned out well.)*    ",
        "created_utc": 1532192382,
        "upvote_ratio": ""
    },
    {
        "title": "Pubic engagement focussed on students (x-post from Malicious Compliance)",
        "author": "MorningAfterMints",
        "url": "https://old.reddit.com/r/MaliciousCompliance/comments/8zxe0l/pubic_engagement_focussed_on_students/",
        "text": "",
        "created_utc": 1532034297,
        "upvote_ratio": ""
    },
    {
        "title": "Failure to do some of the simplest tasks.",
        "author": "chungnasty",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/904e2o/failure_to_do_some_of_the_simplest_tasks/",
        "text": "Hey everyone, thank you for taking your time to read this. I found this a place of comfort where I can express myself.\n\n-was given a simple task to set up laptop and projector for a meeting \n\n-thought I should get things prepared earlier so I got to the meeting room 30 min in advance and set the electronics up\n\n-I tried logging in multiples times with a set of wrong login names and password...then ofc shit locked itself; can’t even log in\n\n-supervisor and other biggies started rolling in...and proceed to find out how I made their two-hours meeting extremely inconvenient \n\n-my supervisor looked extremely disappointed and I felt shitty as hell.\n\nIt’s my first month at the job as a project assistant; I felt like I’m gonna get fired already. My level of guilt and anxiety are off the roof now...I can literally feel them in my chest.\nFeel like showering in listerine to cleanse myself from my own incompetence.\n\nThat’s it, thanks for reading.",
        "created_utc": 1531992899,
        "upvote_ratio": ""
    },
    {
        "title": "3 missed calls and an unwritten message",
        "author": "LightHouseMaster",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8zo96c/3_missed_calls_and_an_unwritten_message/",
        "text": "Hello TFTJ, Usually post and browse in TFTS but this doesn't quite fit there so I thought this would be a better place for this one.\n\nI work for a small Maintenance company as the dispatch operator, taking calls from customers, scheduling our service providers and forwarding calls to AP, AR or the CEO (Whose office is in the other room)\n\nThis happened yesterday. Every so often we get a phone call from annoyingly aggressive company($AAC). They want our business and they are dying to get it. What do they do? I still don't know. They are vague in all their answers. They've been a red flag since the first call from day one. The CEO has told me before to tell them that we aren't interested. \nI pick up the phone:\n\n$Small time Maintenance company, this is LHM, How may I help you?\n$AAC rep 1: Yeah, is CEO there?\n\n$LHM: I'm sorry but he is busy, may I ask what this is concerning?\n\n$AAC rep 1: I'm calling about the wholesale conversion.\n\n$LHM: What is that exactly?\n\n$AAC rep 1: We can't tell you because you are not the owner of your company\n\n$LHM: ok yeah, I'll take a message and have him call you when he can.\n\nThey proceed to give me their 'personal' number and contact info which I wrote none of it down. I figured this will satisfy them and I can continue on with more important work matters. The phone call ends and I poke my head into the CEO's office. \n\nI must have missed it but he had stepped out to go to a job site.\n\nNot even 2 minutes later the phone rings. It's the same company and the same guy. \n$AAC rep 1: Hi, this is Rep 1, We just missed a call from this number? \n\n$LHM: No one from here called.\n\n$AAC rep 1: Maybe it was the CEO returning the call from that message I gave you.\n\n$LHM: No I don't think so, He's not in right now.\n(At this point I had another call come in line 2 from the same company which I didn't take.)\n\n$AAC rep 1: Are you sure he didn't try and call? Our caller ID shows that we just barely missed a call from this number.\n\n$LHM: The CEO isn't even in right now and I never got a chance to tell him that you called. There is no way he just barely tried to call you unless he's incredibly psychic.\n(At this point then call number 2 rings up on line 3 while line 2 is still flashing to be picked up. I ignore that one as well.)\n\nI didn't listen much to what he was saying at this point and I was fed up so I just ended the phone call.\n\nPhone rings again. I gotta answer it. It's my job. I pick it up with the standard greeting.\n\n$AAC Rep 2: Hi, This is Rep 2 from AAC, Our caller ID shows that we just missed a call from this number. Is CEO Available?\n\nThis one sounded a bit timid. Never had her call before but I was done dealing with them.\n\n$LHM: No. I just barely told Rep 1 that he is not in. We are not interested in buying anything you have to offer. We don't need your services. Please take our number off your calling list.\n\nShe barely managed to squeak out a very quiet \"ok\" before she hung up. Poor girl, She needs a new job at a less scummy company. \n\nI let the CEO know what happened and he said that if they call back while he's in, I'll put them through and he's going to run them through the ringer. \n\nTL:DR Aggressive company wouldn't stop calling. I hope they call at least once more.",
        "created_utc": 1531855732,
        "upvote_ratio": ""
    },
    {
        "title": "In one ear and out the other",
        "author": "DejoMasters",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8zicpz/in_one_ear_and_out_the_other/",
        "text": "Here's a short encounter I had earlier tonight. I work at a pharmacy retailer that also provides money transfer services. At the end of each night we count each drawer down to $200 and the rest goes to the bank. Simple, right?\n\n&amp;nbsp;\n\nWell, it would be, but the particular store I work at is in a low income area, meaning people are coming in often and at all hours to do money transfers.\n\n&amp;nbsp;\n\nThe other night a cashier rang through a money transfer, after I had already brought the cash register down to $200, which caused a lot of issues for that night and the following day.\n\n&amp;nbsp;\n\nTonight I'm a little distracted. It's been a long day and I just want to get home. I turn in one cash register, put my cashier on that one, then take the other one to the office for it's end of night treatment. Then I remember the problem I had the other night.\n\n&amp;nbsp;\n\n&gt;Me, on phone with front checkout: Hey, I just wanted to tell you, do NOT let anyone receive a money transfer now. Okay?\n\n\n\n&gt;Cashier: Okay!\n\n&amp;nbsp;\n\nAnd all is well. Or, at least, it should have been. You can see where this is going.\n\n&amp;nbsp;\n\n&gt;Cashier, over intercom: Dejo to the front, please!\n\n\n\nI call the front register, as I can't leave the money unless it's an emergency\n\n\n\n&gt;Me: Hey, what's up?\n\n\n\n&gt;Cashier: Hey, so someone just received a money transfer and I don't have enough cash in my drawer.\n\n&amp;nbsp;\n\nAnd with that sentence went the last shred of hope that anyone else knew how to do their jobs.\n\n\nEdit: formatting",
        "created_utc": 1531804217,
        "upvote_ratio": ""
    },
    {
        "title": "You dissapointed the birthday boy!",
        "author": "Twat_In_Hells_Chance",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8z4rdh/you_dissapointed_the_birthday_boy/",
        "text": "I work in a heritage place and as I was scanning tickets for an event today a woman approaches me and asks where can she get on the roof to take a picture of the gardens.\nI politely told her that the rooftop is only accessible through special guided tours and she couldn't just get up and take a picture. Being British I naturally apologised.\n\"That's ok, I'm just sorry I have to tell that to the birthday boy\" then walked off with the two teenage boys on tow.",
        "created_utc": 1531686599,
        "upvote_ratio": ""
    },
    {
        "title": "This is ridiculous, I don't have to pay!",
        "author": "silentdragon95",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8yvx38/this_is_ridiculous_i_dont_have_to_pay/",
        "text": "I have no idea which Tales Subreddit to post this in since it doesn't really seem to fit any of them very well, so I suppose I'll just put it here. I sell tickets at a tourist destination. There are several different attractions visitors can buy individual or combination tickets for. Two of the attractions are free for visitors with a specific guest card that is given out by some hotels which have a contract with us. Of course, our main attraction, [rollercoaster], is *not* among those two and the guest card only gets you a small discount towards a ticket.\n\n&gt; Me: Hi, how can...\n\n*Customer shoves guest card in my face*\n\n&gt; Customer: Two tickets for [rollercoaster].\n\n&gt; Me: Of course, that'll be [amount] please.\n\n&gt; Customer: But I have these!\n\n*continues to shove guest cards in my face*\n\n&gt; Me: Yes I can see that, however, [rollercoaster] is not included with these, I have already deducted a discount of...\n\n&gt; Customer: No, it's included with these cards!\n\n&gt; Me: I'm sorry, but I'm afraid it isn't. [other attraction] is included, I could give you tickets for that if you want.\n\n&gt; Customer: No, I want to ride [rollercoaster]! It says on there that I get tickets for free!\n\n*points somewhere behind him where there certainly is no sign saying such a thing*\n\n&gt; Me: Again, I'm sorry but you must be mistaken, ...\n\n&gt; Customer: This is bullshit! I'll go find the sign again and when I come back you better give me my tickets!\n\n*sigh*\n\nIn a twist surprising no one, he comes back two minutes later and buys two tickets for [rollercoaster].\n\n&gt; Customer: Well I couldn't find the sign anymore but they told me that it was going to be free. This is ridiculous.\n\n&gt; Me: Sir, excuse me, but whoever told you that must have been mistaken, because I've been working here for two years and [rollercoaster] has never been free for guest card holders.\n\n&gt; Customer: This is just outrageous. I'm going to call your supervisor to tell him how you wouldn't give me my tickets. Somebody is going to have to refund me for this! I'm also going to tell the hotel helpdesk not to recommend this place anymore. This is just so ridiculous.\n\nI simply smile and nod thinking \"well good luck with that!\". He storms off while still rambling. He hasn't called yet but part of me hopes that he will just so he can hear the same thing again.",
        "created_utc": 1531597799,
        "upvote_ratio": ""
    },
    {
        "title": "There are dozens of labs. Dozens!",
        "author": "SciFiXhi",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8xvbj5/there_are_dozens_of_labs_dozens/",
        "text": "Hello! I wasn't certain which \"Tales of\" subreddit would best accommodate this story, but this one seemed the most relevant.\n\nI'm a student at a STEM research-focused college my mom likes to call \"that ABC school\", and I've been working in an event planning off on campus for a few years. Our office manages several spaces on campus where people can host events, so we essentially serve as \"landlords\" through which departments and student groups reserve event space.\n\nHowever, we do get a litany of calls outside of our purview. From people trying to purchase tickets to events (we only rent out the space and furniture; everything else pertaining to the event is the renter's responsibility), to people asking admissions questions (that's REALLY out of our purview), to people trying to rent space at an unaffiliated convention center 600 miles away (no clue why the call got transferred to us). I often wonder how half of these people get our number.\n\nWhat I consider one of the weirdest calls of all happened just a few weeks ago. I picked up the phone whose ring I've learned to dread:\n\n**Me**: [Event planning office], this is [Me], how can I help you?\n\n**Caller**: Hi, I'm looking for a Professor [No Name] at the [ABC] Laboratory.\n\n**Me**: *(slightly confused)* I'm sorry, I don't think I got that last part. What department is this professor with?\n\n**Caller**: The [ABC] Laboratory.\n\nThere is no singular [ABC] Laboratory. For a lot of departments, there's not even a singular [ABC] [Department] Laboratory. But she had definitely said \"the [ABC] Laboratory.\" I was certain, then, that I had heard her correctly the first time, but I was now more confused about what she could possibly mean.\n\n**Me**: I'm sorry, ma'am, but there are dozens of laboratories on campus. You'll have to be more specific.\n\n**Caller**: *(with genuine surprise and disappointment)* Oh.\n\n**Me**: I can look them up by name. Could you spell their name for me?\n\n**Caller**: [N-o-N-a-m-e]\n\n**Me**: Thank you, I'll just be a moment.\n\nI look in the public school directory. No results.\n\n*OK, maybe they're at one of the related, off-campus labs. Sometimes those staff members don't show up.*\n\nI check a private database that should include everyone associated with the school. Still no hits.\n\n*OK, maybe this person used to work here but doesn't anymore. Maybe they have a LinkedIn?*\n\nI go to my last resort, Google. Typing in '[ABC] [No Name]', I get only one relevant result: an article from my school's student newspaper. *Maybe this'll help. Perhaps they were part of some joint program with another local college or something, so they didn't have any direct [ABC] affiliation.*\n\nAs it turns out, this person came to [ABC] as part of a high school summer program in math and science... in 1999. Since then, there has been no Googleable record of this person's existence (their name is unique enough that of the few Google results I get when I type in [No Name] and [Name, No] in quotes, all but one are from reverse lookup pages for someone with a similarly-spelled name).\n\n**Me**: I'm sorry, but there's no record of this person having ever been a professor here.\n\n**Caller**: *(further dejected)* Oh. Thanks anyways.\n\nAs she hung up, I sat there, confused. Where did the caller come across [No Name]'s name, and what could have possibly led her to think [No Name] was a professor? Surely, someone who'd reached professorship would have their name appear in a publicly available document, right?",
        "created_utc": 1531272565,
        "upvote_ratio": ""
    },
    {
        "title": "My coworkers underwear",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8xp6z6/my_coworkers_underwear/",
        "text": "[deleted]",
        "created_utc": 1531229975,
        "upvote_ratio": ""
    },
    {
        "title": "Bag Face Teacher: Why I Wear a Bag",
        "author": "deskofmargaretb",
        "url": "https://www.youtube.com/watch?v=M_IAtJY7GMo&amp;t=51s",
        "text": "",
        "created_utc": 1531149271,
        "upvote_ratio": ""
    },
    {
        "title": "Las Vegas is where?",
        "author": "WeirdGrowth",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8wl826/las_vegas_is_where/",
        "text": "I work in a software company, I am covering for a co-worker today and updating some inventory for a client with some new units. I'm from the UK originally, and I totally admit my US geography is a little shaky, but I just had this exchange\n\nClient: Make sure you tag those new units \"Las Vegas, CA\"\n\nMe: No problem, but isn't it NV?\n\nClient: No, it's CA.\n\nMe: Really? But Las Vegas is in Nevada, if you tag it CA that will result in incorrect data. If you search for NV they won't pull.\n\nClient: Haha look I think I know where Las Vegas is, I live in California after all!\n\nMe: Really? I could have sworn that Las Vegas was completely in Nevada.\n\nClient: Listen, I know you're not from America so the geography might be confusing, but Las Vegas is 100% in California.\n\nMe: Mmmmm I'm sure you're right but... are you sure you're not thinking of Los Angeles?\n\nClient: Look... maybe I need to speak to &lt;managers name&gt; about this, you shouldn't be arguing... *I can hear the penny dropping*... oh... oh... Yes. Tag them as NV. *immediately puts the phone down*\n",
        "created_utc": 1530892731,
        "upvote_ratio": ""
    },
    {
        "title": "Bag Face Teacher Tip #2",
        "author": "deskofmargaretb",
        "url": "https://www.youtube.com/watch?v=gViEPK4f12Y&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1530802715,
        "upvote_ratio": ""
    },
    {
        "title": "I don't like your answers.",
        "author": "capricious_poster",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8vsar6/i_dont_like_your_answers/",
        "text": "On the phone with the boss:\n(I work in a branch office)\n\n\nBoss: So tell me what happened?\n\n\nMe: Well, the system...\n\n\nBoss: I mean, if something went wrong...\nblah...blah...blah...\nThese things happen and we are not in the business of attributing blame.\n\nAre you going to that place tomorrow?\n\n\nMe: No, the customer called and said...\n\n\nBoss: We need to get out there, there's that issue that is pressing....\nblah... blah... blah...\nWhat happened with that other issue last week?\n\n\nMe: Oh, last week we....\n\n\nBoss: You know, I ask you questions and I don't like your answers. You're not giving me the information I need.\nblah...blah...blah...\nOK Cappy, I'll talk to you tomorrow. Try to be more responsive.\n\n\nMe: OK, Boss, take...\n\n\nclick\n\n",
        "created_utc": 1530625407,
        "upvote_ratio": ""
    },
    {
        "title": "Bag Face Teacher Tip #1",
        "author": "deskofmargaretb",
        "url": "https://v.redd.it/t06gof3ozi711",
        "text": "",
        "created_utc": 1530533344,
        "upvote_ratio": ""
    },
    {
        "title": "ARE YOU DEAF?!",
        "author": "TorreyL",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8v7wrr/are_you_deaf/",
        "text": "My real job (as opposed to working at summer camps or tutoring or babysitting) started about six months after I graduated college. I wasn't at all confident professionally, and I didn't initially like talking to people on the phone.\n\nOne day, less than a week after I'd started gaining confidence talking to people on the phone, I asked a client for his email address. He said \"BT#######.\" I heard \"BV#######,\" and repeated it back. He said, \"No, I said 'T'!\" I repeated \"TV######.\" \n\nHe yelled back, \"NO! ARE YOU DEAF?! I SAID 'BT' NOT 'BV' or 'TV.'!\"\n\nI somehow managed to find the courage and serenity to calmly reply that sometimes, it's hard to distinguish similar sounding letters on the phone. He was still quite angry.\n\nThankfully, my coworkers told me I was right and he was a jackass, otherwise I would have thought I was not cut out for any job involving telephones.",
        "created_utc": 1530423699,
        "upvote_ratio": ""
    },
    {
        "title": "This is a story about how my trainer ruined everything.",
        "author": "katyvo",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8tno0y/this_is_a_story_about_how_my_trainer_ruined/",
        "text": "I'm posting this on mobile. It's also long and I just took a medication that may or may not have coordination-based side effects. Woo, judgement!\n\nA while ago, I started putting my resume up on multiple websites in the effort to find a summer job back home. I was in college and was going to be heading back in about four months, so I wasn't looking for a career. I was also enrolled in 15 credits, which meant I didn't have time to work eight hours a day once classes began again.\n\nI got a few responses on the resume sites. I applied for a few positions and heard back from even fewer, but my first week back I managed to book myself for interviews. One of these interviews has an interesting leadup to it.\n\nSee, they're one of the companies that sends out huge nets and calls random numbers listed on these sites to book for interviews. I was called four times by these people. The first was a lady who left me a vague voicemail (\"This is Unintelligible from the HR department, we sae your resume on...\"), the second was a lady I scheduled an interview with, and the third and fourth try to schedule me until I tell them I have already accepted an interview offer. I learned later that they follow a script. I learned LATER that they pay people in a call center based on how many people they \"recruit\" that actually show up and get hired. They are given sheets with name/number/resume site/email. That's it!\n\nThose are red flags one, two, and three for those counting.\n\nI put on a professional outfit to meet \"the State Director who is only here two days\" (who is actually there all days) and drive out to the office. There are paper signs on the windows saying \"INTERVIEWS NEXT DOOR\" and \"_____ _____ INTERVIEWS 2nd FLOOR,\" which I follow dutifully. I'm broke. I need the money. I go to my interview.\n\nI find the receptionist and take a clipboard, do paperwork, etc. etc. I wait in a room full of people. I do a quit five minute \"interview\" and then get called back with the whole gaggle of interviewees for a...group...interview? \"Welcome to ______ ______, I'm a millionaire with a fancy car, we're glad you chose us, here is an hour of company history, complete this personality alignment thing, we'll give you a call back later today and talk to you more thanks bye!\"\n\nI'm an idiot.\n\nI'm an idiot who got a call back to come in for the final interview! I'm asked if I have my wallet to pay for the training course and fingerprints.\n\nI'm an idiot who has less money now! How many red flags are we up to at this point?\n\nAnyway, I am hired. I complete my training course and pass my licensing exam. I get fingerprints taken. I memorize an eight page script and am \"enrolled\" in their in house boot camp, which I was reassured was paid.\n\nLies!\n\nIt takes me a while to get my agent number. My trainer who was the woman who interviewed me then states that an underling of hers will train me. She's free because two people have already quit. This underling, who I will name Susan, has already had one trainee under her quit. She demanded he give a full presentation his first day instead of just observing and then told him to get a new phone, since part of the job is in a call center and his plan was minutes-based. Either way, he's gone. My turn!\n\nMy first day \"in the field\" watching Susan do presentations is uneventful. The second day is where it gets interesting. I still don't have an agent number even though my license has been approved at this point, so all the sales Susan makes go in her name! She gets over $600.00. I get nothing. She then asks me to work Sunday. She knows I have zero chance of getting paid for it. I refuse.\n\nI contact my boss and my boss's boss, the state director who is always there, about the 600.00, and they say contact Susan about it. I do. She tells me \"I'm sorry it really sucks that they can't pay you also I can't write you a check because I don't have a bank also I already spent it lol.\" Due to how we get paid, this is a lie. At that point, she didn't have it yet. I return to my boss and boss's boss and they essentially sit there and tell me they can't do anything about it and try to scare me away from pursuing it.\n\nBy this point, I'm working 12 hour days when I was told 8, attending mandatory meetings as a 1099, and getting no salary (and no commission because Susan took the sales) and no money. I'm losing money driving around and once had to drive almost two hours one way to go meet Susan as she was doing a presentation. Usually she drives, but she drives with her knees as she texts, types on her laptop, and files her paperwork in the dash and on the backseat. She spends her time straddling the lanes doing 80 mph. She also smokes in the car with me in it (I am a nonsmoker and find smoking on your guests impolite). She spends her entire drive complaining about other clients for \"being too fat\" or \"acting weird\" and doesn't do half of what she's supposed to, instead texting angrily at her ex. This job starts to smell rotten.\n\nI make a sale on my birthday and earn about 650.00. She asks me what my bonus is because she gets paid on my bonus too. The day after that she spends complaining with me in the car and everything - great. No sales, no money. I discover I won't get my 650.00 until the next Monday. Not the immediate Monday next week, the one after. Great.\n\nNext week I make no sales Tuesday. I make an almost sale, but they need to wait on the charges to avoid overdrafting their bank, and so they want me to come back later. This is Susan's territory. She'll come back later and get the money. I'm miffed and I tell her - I won't make a dime out of this. She tells me to calm down.\n\nPardon?\n\nWednesday she makes a huge sale netting her at least a grand and I get nothing. She sits in the corner texting angrily as I try to present and then she takes \"the difficult sales.\" She and I are the top producers for the week! Yaay! She makes over two grand and I make nothing.\n\nI tell Susan I want to quit. She offers to transfer 400.00 worth of sales (not money, sales) into my name so I can meet the weekly quota. I am not at all convinced. She calls my boss, the woman who interviewed me and whom I liked, and said boss sales-pitches me into staying, saying they can do all this stuff for me and let's talk to the state director whatever. I can't get her off the phone without saying yes, so I say yes.\n\nI pass boot camp. I ask Susan to help me make calls, but she tells me \"I could help you, but I won't.\" Keep in mind I call cold leads for her from 2 to 8:30 Tuesday and Thursday. She makes one appointment that doesn't fit with the rest of my schedule so I leave early that day only to be stood up by them and sit in a parking lot for two hours. I finish my day meeting up with my boss and I make a sale. After calculations, my paycheck for that week should be about 200. For 60-70 hours of work.\n\nThe 400 is nowhere to be seen. I walk in, grab my singular paycheck for six weeks of work, and am told that I likely won't get the other 200 some for the other sale I made if someone has to go and get more info on it. I essentially worked for free for them for five entire weeks. I barely broke even with the check I got.\n\nI left and never looked back.\n\nTLDR: Workplace lies about hours and refuses to pay me. Begs me to stay, promises me they'll do all these things and then immediately forget they ever offered. I quit, likely without my second paycheck, but without regretting my choice.\n\nEdit: Changed a name",
        "created_utc": 1529900443,
        "upvote_ratio": ""
    },
    {
        "title": "GSA Media | Mill Creek WA SEO &amp;amp; Digital Marketing Experts",
        "author": "CherylNottshh53",
        "url": "http://goldensearchadvantage.com/seo-in-mill-creek-wa/",
        "text": "",
        "created_utc": 1529894386,
        "upvote_ratio": ""
    },
    {
        "title": "What a shitshow...",
        "author": "TheJayderaven",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8tmyxx/what_a_shitshow/",
        "text": "My kid lives with me.  I'm his only parent.  He's in his mid teens, so pretty self-reliant.     \n\nI went from running my own successful business to working a part time security gig that pays beans.  I'm too burned out to work in my field anymore.  I really thought I was just going to collapse before my last client died.  I daydreamed of having a medical crisis so that I had to be hospitalized and, preferrably, unconscious... just to get a break.  So, after he died suddenly, I took the first mindless job I could find (it's basically shipping and receiving, but they call it security).  I've been here for six months.  It's probably the easiest job I've ever had.  I talk to truckers all night long... I'm an introvert, but the truckers who come in on the midnight shift?  They are a different breed and they are usually in and out in less than ten minutes.       \n\nHowever, the owner of the company I work for... I have NO idea how he's still in business.  I ran my own business for nine years.  I KNOW what it takes to run a successful business.  This is a complete and utter shitshow.  I usually work an 8 hour third shift Friday night, then a 12 hour third shift Saturday night, off Sunday night, and another 8 hour on Monday third.  This weekend, I was asked if I could cover another 12 hour on Sunday night.  I had plans to take the kids swimming, so I said I could, but I could not work the full 12 hours, instead I could work 9 hours.  I was told to tell the dayshift guy that he would need to work 15 hours instead of 12, so that there was someone here at all times.  I told him, he agreed.  Great.    \n\n At stupid early this morning, he doesn't show.  I give him 15 minutes, text him to see where he is.  He says he didn't know he was working today and can't come in.  !?!?!?!!!  Reach out to site supervisor... no answer.  After an hour and a half of trying, I call the owner of the company, who proceeds to tell me it is the supervisor's problem and to get ahold of them.  I explain that I have been trying for an hour and a half and getting no response.  He basically shrugs his shoulders and says it isn't his problem.  (WTF?!?!  It's YOUR company, of course it is YOUR problem!).  I'm now at nearly 14 hours of working, after having 12 hours off, and working another 8 before that... going on no sleep since 7PM Friday evening... and it is almost 8AM Sunday morning.  So, I keep trying the site supervisor, and updating the company owner every half hour.  Yes, I was being a passive aggressive bitch, but at that point, they were lucky I wasn't just being aggressive.  I was exhausted, I suffer from chronic illness which causes extensive pain, had a flare up during work the night before, and, oh, yes, was two hours late in taking my morning medications because I was STILL AT WORK.  Oh, and I had a funeral to attend for a teenage family member of my partner that day.  \n\nFinally, at 8:30 (2.5 hours past quitting time), the owner says he's making phone calls.  Great.  I give him an hour, all while trying to reach site supervisor.  When I hear nothing, I call owner again.  He's got someone coming in to take over in 30 minutes.  GREAT!     15 minutes later, my \"replacement\" shows up.  She's SHITFACED drunk.  Like, barely able to stand.  Can't write, can't type.  I have NO idea how she managed to drive here.  She literally passed out for 20 minutes while here.  I message the owner that she is in NO condition to be here, no less work.  He says, \"Ah, she's okay.\"  NO.  No, she fucking isn't!!  I stay on to finish the part of our job that requires us to DRIVE the company vehicle around tractor trailers, because there is NO WAY she can/should do this... she keeps announcing how plastered she is, how she TOLD the owner that she was too drunk to come in (at 10AM), and he told her to come in anyway.  She's announcing her drunken state to every truck driver who comes in, which is guarenteed to get back to the warehouse supervisors.  I finally get ahold of the site sup, explain whats going on and she's just half awake, and flabberghasted.  I ended up being on site, working, for 17.5 hours, because, stupid responsible me, I just couldn't leave a half conscious, plastered person in charge of tractor trailer management.  \n\nWhen I finally HAD to go, it was 40 minutes after I was told the ORIGINAL coworker, who was supposed to work the day shift, was coming in in 20 minutes.  All the while, I am checking in trailers, checking out trailers, and wrangling my intoxicated co-worker, who kept trying to leave (owner said that she was expressly forbidden to leave), then telling me to leave, telling all the drivers how drunk she was, and counting how long I had to get home, shower, and change into funeral clothes, and if there was ANY chance I'd get to see my kid or... hahahahahahahaha... sleep.     \n\nSo, I passed the original coworker on the way out - yay!  Find out later that the drunk coworker immediately left, and that the original coworker could only work four hours and HAD to leave.  I'm walking into the funeral and the site sup calls me, asking if I would come in an hour earlier than I'd planned, because original coworker walked out after about four hours, leaving the site unattended, with a truck driver waiting, and that she has someone who apparently worked here before, but was fired, filling in, but he can only work until x time.     I saw my kid long enough to give him his new keyboard for his computer that my partner gave him (woot!) and give him a breakfast sandwich, hopped in the shower, got dressed, and left for the funeral.  Got back from funeral, undressed, passed out for two hours, and guess who is back at work?     \n\nTL;DR: work is a shitshow with no-show replacements, drunk replacements, an owner who clearly DGF, I'm running on 5 hours of sleep for the past 53 hours, having worked 28 of those hours because I'm stupid responsible, and I've seen my kid for a total of about five minutes.",
        "created_utc": 1529893466,
        "upvote_ratio": ""
    },
    {
        "title": "When a talk about the invention of hot chocolate turns gory.",
        "author": "Twat_In_Hells_Chance",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8tljkn/when_a_talk_about_the_invention_of_hot_chocolate/",
        "text": "Work at an ex royal palace and was trying to explain to two young children (about 5 and 3) about how the Georgian's were the first people to have hot chocolate in Britain.\n\nWhile this fascinated them, they suddenly declared that Henry VIII was dead and they knew how he died, but all they could remember is that he fell off his horse.\nI tried to tell them he had a bad leg that was infected but neither of them has had an infection.\n\nI explained that it looked like bogies and it smelt and suddenly they're telling me their medical history, bad feet, bad legs, bandage doctors and broken legs, trying to top the other.\n\nMum's killing herself laughing and I can't keep up as they're both talking at the same time. Mum eventually shooed them away when it became clear they weren't going to stop with a \"I bet you weren't expecting that today!\"\nA couple of doctors in the making methinks.",
        "created_utc": 1529879836,
        "upvote_ratio": ""
    },
    {
        "title": "My First Job Was a Bust",
        "author": "WarmBlanketColdBody",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8syk2m/my_first_job_was_a_bust/",
        "text": "This is a whole novel of feelings and problems I had with the company, so there's a little warning.\n\nI worked in a large, large warehouse that shipped product for a bunch of home repair stores based in the midwest. It was my first job, I liked the store well enough, and I needed money so I figured \"Hey, why not work at the distribution center for the store?\" A friend had recommended me for it and I went in about a day after submitting my application. I was eager to work and learn, and I always called my bosses \"ma'am\" or \"sir\" no matter what.\n\nThe start was fine. There were no red flags right away and things felt good, I felt productive. The pay was $10.25 an hour so I felt good about that as my first job. When things started raising questions was when I, an underage part-timer working 40 hours a week and every other weekend, was told I had to cut my breaks short. We had two ten-minute paid breaks and a half-hour unpaid lunch, and most of the floor managers told people not to take most of them. That really struck me as odd.\n\nThe next problem came up on the day I was supposed to be getting my general training. Everyone there needed to be trained on all equipment and how to run conveyor lines. That day, I got told by a floor manager (I had never met before) to start cleaning the warehouse and gave me really vague instructions. I had no protective gear, no dust masks, and no hearing protection. The warehouse was filthy from top to bottom. There was animal feces, exposed chemicals from broken product, black dust and dirt, and nails hidden in broken pallets. I had to clean it all up for about three months before I got my first training week. I developed allergies from all of it and it was so bad, my snot was black and grimy and I couldn't breathe well in the warehouse.\n\nMy training was done by an intern who was there for all of a month, and he barely knew how to run anything at all. I was pushed onto equipment that was ill-explained and handed paper after paper for things I was never tested on or even fully trained on. This happened in the span of a morning, there was no follow-up, and I was sent back to cleaning.\n\nNow, I was originally hired as a part of the line crew. I would put boxes of product onto a conveyor, and I had to keep it stocked so the sorters could process it fast enough. We had two to three people on two conveyor lines, and each line had three docks full of product that could be anywhere from 20 to 80 pounds. The lines had a productivity goal of 500 an hour and it never changed, even though we were so short-manned. I kept up and handled the line, I learned the computer work by hand on my own, and even bumped up productivity to 800 boxes an hour for both lines.\n\nAgain, after about a month of solid work for what I was hired for, I got shoved into janitorial service. I had to scrub the floors of the break room, upstairs and downstairs. I had both gender bathrooms I had to clean, alone, and I had intense exposure to all sorts of bleaches and corrosive cleaners with no training on handling them. I felt totally disrespected at my job at this point and I had no way out. I was expected to handle both the janitor service and my job on the warehouse floor, but I was pushed into sweeping and cleaning after an hour of my hired job. I was cleaning literal human shit and piss every day of the week, chemical burns from what I was using, respiratory problems from 17 to 18 from all the black dust, and I had no pay increase or recommendation.\n\nI could never find a manager or a floor supervisor until they wanted something, and then they disappeared. Any questions or problems I had, they were gone. Now, I had two managers (Tipper and Topper, I guess) that worked in corporate, Magenta and Bob as floor supervisors, and a whole HR staff that was either behind locked doors or unreachable. It was a game of never-ending telephone with all four of the people I answered to. Tipper and Topper were never available in the office and I only ever (rarely) saw them when they clocked out. I could raise as many concerns or ideas and I never got anything back. Magenta seemed to hate me, and she always pushed for me to sweep or mop or clean and was the one pulling me out of my job and into the bathrooms to clean toilets. Bob was brand new, had no idea what he was doing, and did whatever Magenta said.\n\nI received one instruction for a whole day, and it was to sweep aisles or scrape stickers. I got finished with a task early every day in the hopes of going back to my job, and I was either tossed around departments all day or just given vague \"clean aisle 2 through 9\" from whichever person I could track down. They would sometimes just walk around trying to find something for me to do, but God forbid I do what I was hired for.\n\nIt finally got too much when I started getting sick. It could have been from work, from stress, from home, who knows. But I had to take a few days off (this was the only few weeks in my whole career there that I took a day off) because I was so ill. I had no PTO, no vacation, no overtime, no healthcare, and no benefits because I was just a part timer. I didn't have the option to go to full time because I was supposed to ask within the first month of being hired, which I didn't know.\n\nI worked the full time hours and only had lunch or a 10-minute break every few days, I did exceptional work, and I wasn't recognized for it. I saw people who had been reprimanded for poor productivity, bad behavior, late marks, and disrespectful people getting raises and promotions and Employee of the Month. It was a real slap in the face when a guy, who had pressured me into giving him my number and harassed me both in and out of work, get a 40% raise and a promotion. Here I was, reporting harassment, breaking my back for my job, and doing exactly what was told of me, getting passed over and looked over left and right. It got to me that I was putting in 110% and this disrespectful guy got rewarded for his actions.\n\nI quit one morning out of the blue and I had to take a few months to get out of the depression that job put me in.",
        "created_utc": 1529642188,
        "upvote_ratio": ""
    },
    {
        "title": "Telling me one thing, when she actually means something else- Co-worker rant",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8s5nbw/telling_me_one_thing_when_she_actually_means/",
        "text": "[deleted]",
        "created_utc": 1529378460,
        "upvote_ratio": ""
    },
    {
        "title": "So it's my fault you almost ran me over.",
        "author": "smilespeace",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8s4qck/so_its_my_fault_you_almost_ran_me_over/",
        "text": "So I'm trimming a hedge on the side of a narrow road at work today, using a gas powered pole trimmer. When I use this tool, the motor sticks out about a half foot behind my back .\n\nI'm 100% focused on my work, and suddenly some contractor guy tried to get past, driving his van behind me, and drove right into the motor on my trimmer, nearly running me over! Which prompted me to yell \"F*CK dude!!!\" \n\nSo the guy stops his van and gets out, (to check if I'm okay? - NOPE) ... First thing he says to me: \"If you didn't have those earmuffs on, you would have heard me coming\"...\n\n*Seriously?*\n\nMe: \"I wear earmuffs to protect my hearing, man. If you waited like five seconds I would have noticed you. I didn't see you at all\"\n\nHim: \"Well, then sorry I bumped into you\"\n\nMe: \"Okay, sorry I was in your way, peace out.\"\n\nWhat a chowderhead!!! He didn't deserve an apology, so much as a shovel to the face- but lucky for him I can't and wont pull that kind of shit on another person. \n\nSorry I always post negative stories here lol. Later that day some guy came out from his house with a bunch of watermelon slices for me and my co-worker, so that was nice ;)",
        "created_utc": 1529369996,
        "upvote_ratio": ""
    },
    {
        "title": "Cell phone repair: A franchise that turned out to be basically slavery.",
        "author": "QuantumDrej",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8s37q0/cell_phone_repair_a_franchise_that_turned_out_to/",
        "text": "Wasn't sure where else to post this, but seeing as it's been close to a year since I quit, I figured now might be a good time to vent it all out in full.\n\nI used to work at a cell phone repair franchise that has many stores across the country. In our specific city, there's three locations. When I worked there, we mainly did cell phone screen replacements and laptop/pc repair, but I think at this point they've refocused to just cell phones.\n\nWorking there was not the most hellish experience of my life, but for a company that did have multiple locations and considered itself a successful franchise, the conditions could have been much, much better.\n\n**Let's start with Pay! Pay is a fun subject!**\n\nBeing a regular tech, I made about $11.50 an hour. That was pretty much the standard for all techs. If you were considered a \"higher level\" tech, or if you'd been shown to specialize in something (such as soldering, software flashes, ect), you maybe got like a dollar extra.\n\nIf you were a manager, you made around $12 an hour. No extras if you were a manager who happened to also specialize in something.\n\nBack around December of 2016, we were told we were getting raises around the time of the next staff meeting. Awesome. As it turned out....they weren't really raises. They were bonuses based off of how well each individual store did that pay period. So for example, if you worked at Store A, you'd get a little bump in pay if Store A managed to make top sales out of our three locations. If you were in Store B or C and didn't make top sales, you got nada. \n\n**How about benefits and tools?**\n\nBenefits, you ask? There *were* no benefits. Benefits are for poor people. /s\n\nNo sick days, No paid time off. No vacation. No health insurance. Nothing, nada, zilch. The best you got was a tiny, tiny discount on a phone repair or purchase.\n\nNow, what you might be thinking is that, \"hey, most retail jobs don't have fancy benefits\". Yeah, well, most fancy retail jobs at least have *something* in the way of employee protection or sick days.\n\nWe couldn't really call in sick, and if we did, it had to be *bad*. This was how a pretty bad virus got passed around for several weeks one winter. In a job where there's a lot of stuff being worked on close to our faces, where we're touching a lot of stuff, and where stuff is being exchanged between hands, we still had to come to work.\n\nOh, and there was no workers comp - if there was, they never honored it. Please keep in mind that we repair electronics. There are *lots* of opportunities for things to go wrong and for people to get hurt.\n\nFor example, my manager Kevin actually had a phone screen explode in his face one afternoon. This resulted in several shards of fine glass in his face and eyes (doctor confirmed). He was never given any kind of worker's comp, nor was he given any leeway for being out of work for several days because *he couldn't fucking see* out of one eye. \n\nHe eventually had to come in, wearing his eye patch, because he needed the money. What he ended up doing was ordering a bunch of safety goggles for the team, out of his own pocket, because the company wouldn't fund them nor would they reimburse him.\n\nThey also were very dismissive towards another guy who had to take some days off repeatedly throughout the year for kidney stones. Bad ones. No compensation or anything for that, either, or even any recognition for him coming in on those days when he was clearly in pain.\n\n**They wouldn't even give us the basics.**\n\nBasics being toilet paper, first aid supplies, ect. Before we actually got a guy who'd come around and actually buy shit for the store like receipt paper, printer paper, and toilet paper, all of that stuff had to come out of our own pocket. And they'd even cheap out on the toilet paper - for the longest time, they kept bringing in this sickly-smelling lavender-smelling crap that went fast because it was basically over-scented tissue paper. I don't think they actually changed brands until the smell was quite literally starting to make people sick to their stomachs.\n\nFirst aid was also one of those things that had to come out of our pockets. Once again, this is a job where handling glass, sharp objects, and hot objects was 99% of the work. If you cut your finger and there wasn't anybody partnered up with you to watch the store while you went to the Dollar General next door, you wrapped a paper towel around it and dealt with it. I think we used up what was in it at some point, but it never got restocked. \n\nAs far as lunch breaks went, we never really got those, either. You got your food, you brought it back to the store, and then you basically just prayed for a quiet moment to sit down and eat. I've had to stop eating halfway through a meal several times to deal with customers. On busy days, you were lucky if you got to finish at all.\n\n**We know we're a repair shop, but SELL, SELL, SELL.**\n\nPart of the reason I left was because they started to really push a business model of \"sell first\". What we'd usually do is try to be fair with the customer - if they dropped their phone in a pond and it wasn't turning on, we'd be realistic with them about the chances of us being able to fix it. Once they started pushing the SELL AT ALL COSTS model, we *had* to take in water damaged phones. And convince the customer by any means necessary to leave it with us for the upfront diagnostic fee + water treatment charge of $60. \n\nSince we also sold cases and screen protectors and other accessories, we had to upsell those, too. I was never good at being a saleperson - I always felt like I was too much of a thinker for the job. I couldn't convince myself to buy the product, so how was I going to convince someone else? \n\nAnd the sad part is, it became less about fixing people's shit and more like becoming a second Geek Squad. Drink the customers for every drop we could reasonably charge. \n\n**Sexual harassment gets you promotions!**\n\nOne day, early 2017, we hired a guy named Steve to work at Store B.\n\nSteve's true persona was deceptive at first. He's pretty laid back with a chill sort of demeanor. Over time, we realized he had kind of a \"shock value\" sense of humor, but nothing that would raise brows. \n\nNow, for context purposes, out of the three stores, I was the only woman who worked there. Keep that in mind for this next bit.\n\nSome time after I quit, I hung out for awhile with Max, another employee that was on the verge of quitting. He told me that they had hired a few new employees at Store B, some of whom were girls (18-25 or so). Within a few weeks, all of the new female employees had quit. Turns out that good ol' Steve was being less than respectful towards them and had even gotten lightly physical with them, leading them to rightfully dip out as quickly as possible. \n\nThat's not the worst part, though.\n\nShortly after the company had decided to just not hire any more girls to work at Store B (yes, you're reading that correctly), they promoted Steve. Now, Store B was primarily handled by Max and Steve. Max had been there longer than any of us and had been promoted to top level tech, but had never been offered a managerial position. But guess who *did* get a manager position? And guess who STILL has that manager position?\n\nNo one knows why the higher ups favor Steve. It's not like he's any chummier with them than we were. \n\nYes, we have cameras. Yes, we have eyewitnesses. But no one's done anything except to just not hire girls to work at Store B. No one who matters, that is.\n\n**Conclusion**\n\nThis probably looks disjointed, but I felt like venting about my experiences there and how the stores in our area are poorly managed. I wish the situation with Steve could be better handled, but there's nothing to be done about it since clearly the evidence is being ignored. I'm glad I'm out of there, and definitely wouldn't go back, despite the friends and fond memories. ",
        "created_utc": 1529357077,
        "upvote_ratio": ""
    },
    {
        "title": "Welcome to the “real world” - 20s growing pains",
        "author": "singinangielala",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8rg3le/welcome_to_the_real_world_20s_growing_pains/",
        "text": "I work at a large hospital in clinical research getting people signed up for studies. I think it’s a pretty easy job especially right out of college. However, I have been told multiple times that my idealistic, optimistic views are pretty childish and I need to grow up.\n\nFor example, I think it’s pretty outrageous that some patients are considered “VIP” just because they have more money or connnections. I know that having more money allows for some differences (private room, better food, a window, etc.), but I work in research and I do not think that rules should be bent to get them into a trial they wouldn’t normally qualify for like the one I am helping with. This study looks at sequencing a patients tumor dna and trying to pair actionable mutations to relevant drugs. This is great for that VIP patient who was able to circumvent the system for normally qualifying, but not so great for everyone else who still isn’t able to join the study because they’re not chummy with one of the hotshot doctors.\n\nWhen I told my supervisor about my views and how I was struggling to reconcile the good that medicine does against the nepotism and smoozing that I see in the hospital, he told me that money makes the world go ‘round and I need to learn how to accept it. He said that anywhere I go, in whatever industry, I will always find myself facing the same issue. Money and connections make things happen. Money and connections make you important. Stop trying to change things and learn to accept that this is the world that we live in and no one is happy about it. Stop being disappointed in the system and in people because you shouldn’t expect anything other than what exists.\n\nI think that is probably the post grad growing pains that everyone talks about. The eye opening experience that all of the older staff I’ve talked to  has said hits in your 20s. Any advice on how to better accept these things? Or is it okay to still hold onto that core belief that in medicine everyone should be treated equal? I’m trying to break away from seeing my workplace the way i think it’s supposed to be. Maybe that way I won’t be so disappointed...",
        "created_utc": 1529112895,
        "upvote_ratio": ""
    },
    {
        "title": "We all have the same responsibility, if I get in trouble for not doing something, you’re also in trouble for the same thing. - rants about a coworker.",
        "author": "KaejNotigen",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8qtex3/we_all_have_the_same_responsibility_if_i_get_in/",
        "text": "One of the funeral directors I work with is known  in the office for being a controlling bitch. Her way or the highway, likes to lecture the other directors who have the same/if not more experience than her. Hell, she explained to me how to handle a visitation- stand by the doors, hand out memorial cards, and direct them to the chapel. Not only is it super easy, I’ve been doing this for half a year now. I don’t know everything, but I fucking know how to do visitations. Besides the point..\n\nEveryone in the office has the same responsibilities, being a student though, I just clean more. Not a big deal, but when I’m the only student scheduled for the week, I spend 6 hours out of an 8 hour shift just cleaning, and the other directors are fine with it because they don’t want to do it, or they have better things to do. They pretty much take care of everything else if I’m cleaning or organizing. \nUsually if someone is the last one in the office/last one in the prep room or arrangement room, they’ll lock the doors. \n\nWell bitchy director was the last one in the office, and last one in the prep room the other day. By logic and what everyone else has been doing, she should have locked up those doors. We all came in today to a twenty minute rant over how we all need to make sure that the prep room and arrangement room doors are locked+ and the horror stories if someone walked into the prep room. Technically, yeah we need to make sure they’re locked.. but you can’t rant to 5 people, and think you’re somehow excluded from the same mistakes they also made. She ended it with “it’s everyone’s responsibility to make sure they’re locked every day.” Yep, everyone’s... even yours. \n\nShe then pulled me aside to specifically tell me I’m a student and need to be doing this, and I had to tell her I was too busy going through the list of shit she gave me earlier that just *needed* to be done. ",
        "created_utc": 1528904503,
        "upvote_ratio": ""
    },
    {
        "title": "I'd barely logged in!",
        "author": "TorreyL",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8q7ars/id_barely_logged_in/",
        "text": "I usually post in r/talesfromthelaw because most of my stories belong there. I was working at a law firm at the time of this story, but nothing about it has to do with the law.\n\nI was not working one Friday. We had a particular client who was needy for no real reason. She wanted to know if we'd located her husband yet (really her job, but whatever). Another paralegal said I was not in the office that day but would respond as soon as I could.\n\nOur office opened at 9:00 am. At 9:05 Monday morning, she called demanding to know why I hadn't called back yet.",
        "created_utc": 1528697901,
        "upvote_ratio": ""
    },
    {
        "title": "What it's like to work in an office that's mostly male when you're female.",
        "author": "buckybear1985",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8pv2d0/what_its_like_to_work_in_an_office_thats_mostly/",
        "text": "I'm employed by a temp agency and they send me to various businesses that are short on staff. Usually it's a few days to weeks at a time until whoever I'm filling in for comes back. I just finished up a month long term at a company that sells construction supplies. The staff there was 99% male (I was one of two women) and many of them were what you'd describe as \"rough around the edges\". My desk was in a corner out of the way so sometimes they'd forget I was in earshot. I found their conversations hilarious and started typing up some of things they'd said when I'd get home from work. \n____________________________________________________\nA: Look at my fucking tool wall! Every time customers come in they mess it up! I tell them not to touch it and you know what? They still fucking do it!\n \nB: We should just fucking glue all this shit to the wall.\n\nA: Yeah, then we'll glue a fucking dime on the floor and watch people try to pick it up. \n____________________________________________________\nA: Now there's a chick that would say \"Eat my pussy or I'll kill you\", don't you think?\n\nB: (whispers in a scary voice) \"Eat my pussy or I'll kill you!\"\n____________________________________________________\nA: If you're going to put diamond in your company name you better have a big swingin' dick and lots of cash. \n____________________________________________________\nA: I think [company X] got too big too fast.\n\nB: I wouldn't trust them to knit me a sweater let alone work on the foundation of my house.\n____________________________________________________\nA: (talking to a customer about a product) I've got this stuff here. It's way better than that shit you get at Home Depot.\n____________________________________________________\nA: Fuck you! No, wait. Double fuck you!\n____________________________________________________\nCustomer: (having trouble paying with a credit card) Why isn't my card working?\n\nA: You have to push it all the way in.\n\nB: That's what she said! \n____________________________________________________\n A: He's hurdled so many fences that there are no greener pastures left. \n____________________________________________________\nA: What are the details on [product x]?\n\nB: Hell if I know.\n\nA: What the fuck do you do all day, man? \n____________________________________________________\nA: When is Father's Day? \n\nB: Some time in June. Why?\n\nA: I have to remember to book a hotel room.\n\nB: What, you have to go out of the house to have sex?\n\nC: Are you a screamer?\n\nA: Shut up guys.\n____________________________________________________\nA: I wouldn't hire that guy to fucking wipe my ass. \n____________________________________________________\nA: Vanessa Williams was like fuckin' Michael Jackson's alter ego.\n\nB: No she wasn't! She was Miss America and she posed for Playboy and stuff!\n\nA: But they were friends, right?\n____________________________________________________\nA: I'm going to get slobbering drunk this weekend. Like so drunk that you shit yourself!\n\nB: Sounds like you have a trip to Tim Horton's planned. (This was after the whole \"poo flinging\" incident at a Tim Horton's in BC.)\n____________________________________________________\nA: (sees the fifty-something branch manager go by wearing a leather jacket) Switchblade D. He's lethal in the senior's community. \n____________________________________________________\nA: (explaining to a customer) This product has a nozzle that makes it go from a stream to a spray.\n\nB: Just like when A uses the urinal!\n____________________________________________________\nA: Is a goldfish the same as a carp?\n\nB: No, a goldfish is a goldfish. A carp is a big fucking ugly thing.  \n____________________________________________________\nA: I hate that guy. I’m not helping him. He can eat the peanuts out of my shit for all I care.\n____________________________________________________\nA: These are plumbers. They wear panties to work.\n____________________________________________________\nA: I hate that stapler.\n\nB: I like any stapler that has staples in it. You’re just mad that it doesn’t fit your little girly hands.\n____________________________________________________\nA: What happened to the old water bottle eye wash station? This thing looks like you need a fucking college degree to operate it or at least a grade 6 education.\n____________________________________________________\nCustomer: You’ve got big shoes to fill there sugarplum. (Referring to me replacing the previous receptionist.)\n\nA: You can’t be the sugarplum. I’m the sugarplum!\n____________________________________________________\nA: Does anyone have any mother in law remover?\n____________________________________________________\nA: Friends are friends but buddies sleep together.\n____________________________________________________\nA: B's desk is like Vegas. Anything that happens there stays there.\n____________________________________________________\nA: My face is so good looking it’s trying to take over the rest of my body.\n\nB: So that’s why it’s trying to crawl into your asshole.\n\nA: That’s just mean.\n____________________________________________________\nA: How can we be out of [product x]? That’s like nursing without tits!\n____________________________________________________\nA: I can’t find [product x].\n\nB: I’ll show you. It’s on a shelf at about nutsack level.",
        "created_utc": 1528571235,
        "upvote_ratio": ""
    },
    {
        "title": "A co-worker decided to show me that telling me off was worth losing her job.",
        "author": "Technature",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8pme2q/a_coworker_decided_to_show_me_that_telling_me_off/",
        "text": "So the factory I work at had a large number of new people come in lately, and most of them are pretty chill.  Last night, one of them made my day go from kind of bad to fucking hilarious.\n\nI work on quality control, making sure nothing is wrong with products coming down the line.  At the time, I was the second of two people packing spray bottles into 5 pack boxes.  Person 1 puts in 3, person 2 puts in two, and the next person checks and sends it down the taper.  The issue started where anytime I got a box I would have room for 2 and get an average of 4 bottles.  She basically took one, took a solid second to look at it, and put it in.  After a bit I mentioned that she needs to go faster, and shortly after I had to hit an emergency stop button because it got that bad.\n\nWe started again afterward and she's doing the same thing, so I tell her again that she needs to go faster.  And at that moment, cause I had the nerve, the gall, the actual thought of telling her that her lack of effort was affecting me was just too damn much and she just snaps.\n\nI'm trying to get her to calm down, because this isn't the first time I've told someone something when they have trouble with criticism, and she just refuses to act rationale about any of it.  As I'm trying to defuse the situation, she starts verbally attacking me, with things like \"This is why nobody likes you\" which is pretty big news to me.  I eventually just ask if her job was worth this and, amazingly, she says yes.  And my thoughts went from \"How do I defuse this situation\" to \"Man.  I wish I could bring popcorn on the line.\".\n\nNow for clarification, her yelling was really damn loud.  As I was going to and from the bathroom after the incident, people were mentioning they heard it and was wondering what was happening.  And this is on the other side of the factory.\n\nAnyways, the line supervisor came by, trying to figure out what was happening while she was busy with something else.  And shortly after, the boss came by.  He asked some questions, told her she definitely was working too slow, and everything was going fine til he asked if I asked in a derogatory way (for clarification, \"I need you to work a little faster.\").  She says I kept saying she needed to speed up and he asked again, since that didn't answer the question.\n\nSo she flips her shit again and starts yelling at him.  He yells at her to get into his office, and I assumed she was probably fired at this point.  But oh no, it didn't stop there.  As he's going down, trying to keep her from making an ass of herself, she keeps yelling, tells him to fuck off, and the entire situation more or less devolves into a shouting match for half the plant to see.\n\nThe entire situation was probably the most entertainment I got out of my job.",
        "created_utc": 1528483108,
        "upvote_ratio": ""
    },
    {
        "title": "Funeral home tales.",
        "author": "HySyStudio",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8peohs/funeral_home_tales/",
        "text": "Not really super interesting tales, but parts of my job that made me say “wtf” today. \n\n1.) 5AM removal call to a residence. Normal procedure, except this place has stairs. Stairs are hell, but not the point of the story. We get to the residence, and as we were backing into a parking spot, another car rolls up and starts honking at us. It’s not an emergency honk, when you just hold down the horn type thing. It’s an angry honk, I swear you can tell. Now it’s 5-fucking-AM, you don’t honk a horn unless I’m about to run over a kid, and I since I wasn’t and I’m a petty fucker that early, I tell my partner to ignore the person. So they do, and the guy keeps honking, and soon starts flipping us off, and yelling at us through his car without windows rolled down. My partner gets out and decides to talk to him after we park, and the guy gets out of his car and tries squaring up on my lucky-if-shes-five-foot partner, clearly trying to intimidate her. Why? Because we stole “his” parking spot. She explains we’re a funeral home, that there is no assigned parking in this particular area, and that we *technically* have priority. It’s not like we were taking the only open spot either, just one that was closest to the residence. He wasn’t handicapped, there were spots like four spaces down. Well dude starts getting pissed, accuses us of lying in front of the grieving family, and gets aggressive- threatening harm on my partner, yelling, hitting his own car. Thankfully the cops were there, but shit went down fast, and it ended with him getting arrested. Because we took his parking spot..\n\n2.) had a 200+ lbs woman faint *on me* today at a service due to her grieving. I’ve taken care of heavier people on removals, but not expecting it, and being behind her.. worst thing to happen to my back. When she came to, she tried reprimanding me because *her* back hurt. Like dude.. I broke your fall, how do you think I feel?\n\n3.) a couple came in for a visitation. Went to visit with family/whatnot, and then sat in our display room. No one thought much of it, sometimes people go there to be alone, and we didn’t have arrangements so nbd. Well they sat there for an hour, finally we were all about to leave, and they approached us. Pissed because they didn’t get talked to. \nThey went in through the chapel instead of the office. We have *several* large signs saying this entrance is for chapels/services only, office doors are right around the corner. And I fucking saw them talk to the grieving family. \nThey didn’t know the family.. they were just being respectful. Like okay, I get that but.. why the fuck would you sit down, not talk to anyone working here (even though I greeted them and it’s very obvious I fucking work there), and expect to get helped??",
        "created_utc": 1528410862,
        "upvote_ratio": ""
    },
    {
        "title": "What is the sense of hunger?",
        "author": "alaizk000",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8p8owb/what_is_the_sense_of_hunger/",
        "text": "[removed]",
        "created_utc": 1528360720,
        "upvote_ratio": ""
    },
    {
        "title": "Try it or not",
        "author": "alaizk000",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8p8jc3/try_it_or_not/",
        "text": "[removed]",
        "created_utc": 1528358663,
        "upvote_ratio": ""
    },
    {
        "title": "Prefer any kind of games",
        "author": "alaizk000",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8ophiz/prefer_any_kind_of_games/",
        "text": "[removed]",
        "created_utc": 1528191643,
        "upvote_ratio": ""
    },
    {
        "title": "I secretly skipped out on a grievance situation to go back to work one day after being away for some free time. Should I go to work for the last part of my weekend, the only time I have with my husband to grieve death?",
        "author": "thestuffisay",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8o5suc/i_secretly_skipped_out_on_a_grievance_situation/",
        "text": "My husband just flew back home yesterday after spending a crazy emotional week at his home state over the death of his great grandmother. I’ve known her for ten beautiful years and she loved me. My husband and that part of his family were extremely close. The closest I’ve ever seen anyone related to their still-living-90-year-Old great grandparents. She and her husband practically raised him. (Lost the grandfather three years ago.)\n\nI haven’t seen my guy in a week. We have a very small immediate family. He and I; and our two cats. No kids yet. Alone without anyone else nearby in a new state.\n\nRewind back a week ago, moments before her death. High intense job with short staff just let me have a five day weekend, including Memorial Day Monday, to host a friend at our new place from states away.\nThe family death occurred after I dropped her off at the airport to go back home. I have to go back to work the next day. Tuesday morning, I leave early for work as I let my husband fly alone to grieve and do his respects with his family. I hold it in all week. I don’t tell anyone. My mind is too occupied with crazy work to even grieve. I didn’t sleep much. Anytime in my waking hours, I worked. Even if it wasn’t at shop. 12AM? I’d just get on the computer and do anything I could electronically for work. One night I slept for one hour before going straight to work via computer/leaving around 4AM for shop (way out of my normal shift).\n\nBack to yesterday. He comes home. I don’t even leave work to pick him up from the airport. I feel awful for that. I didn’t even think about it. My shift is nearing its end. I’m clocking out when I’m alerted of a problem in shop. An order of over 2,000 pieces needs assistance in one department that only has two workers as everyone else was laid off since this is our slow season. There’s a lot of steps to do to make it happen. Then boxing up the order. I’m asked to come in Saturday morning.\n\nI say no. I finally tell my managers what happened in our family and I will not give up the time I have with my husband to do work after being away from each other and not accurately processing my own part of grieving. They excuse me as I kindly refer assistance from other people around shop.\nI go home and cry for the first time in five days since hearing the news of our family.\n\nI get a message today. The department is still short. They need to complete another thousand pieces for completion. I offer my assistance first thing Monday morning. They say that won’t do as the order needs to leave the building early Monday morning before my shift starts as it’s going over seas to Europe. Our boss is going to be upset. Crud... \nShe’s asking me again to come to work this weekend.\nI alert everyone on my team and let them know, in hopes they’ll go in tomorrow.\n\nMy husband has been a lot better since he came home. Much livelier. Happier. We’re joking around, having fun, being sweet. I’d hate to tell him I might have to work Sunday...\n\nShould I go to work?",
        "created_utc": 1527995358,
        "upvote_ratio": ""
    },
    {
        "title": "The hell clients who are impossible to talk to and understand, but when transferred to anyone else, they’re suddenly perfect.",
        "author": "HySyStudio",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8nwcam/the_hell_clients_who_are_impossible_to_talk_to/",
        "text": "I’m a newish worker at a funeral home. Been here a few months so I’m in the limbo where I’ve done a lot, but there’s also a handful of things the directors usually take care of- Usually dealing with families, which is fine by me. That’s where our business comes in at, and I know better than to risk business until I know more. \n\nWell, I get a call, and went to answer as usual when the client starts spewing out information about a family member who passed before I could even get out our company name. So I’m scrambling to find a pen+paper since I think it’s a removal call. The speaker is loud, and it sounds like they’re outside with wind, so I’m struggling to hear already. \n\nSuddenly they start asking about prices. Okay, that happens, so I get out a price list and all they kept telling me they wanted was cremation and a grave. So I tell them the various options we have for that, and was only met with a loud “no,” while they repeated the same thing. I just assume maybe I just can’t hear “not a cremation”, so I clarify, “this won’t be a cremation, you’d like a traditional burial?” \n\nI get another “no!” And they start talking about what the family member wanted, but all I’m hearing them actually say is something about a cremation and grave. So I put them on hold. It’s already been twenty minutes worth of convo before I put them on hold, and I know nothing because we literally only have two options for burial- as a body, or as cremated remains. And I was met with “no” both times. I was at least 80% sure they wanted a burial. \n\nOut everyone, the owner comes over, noticed I’m getting flustered and he started getting annoyed at me and starts to tell me just to transfer it over. Okay, whatever, this is a client, we can’t lose the money+they’re grieving they don’t need the stress of me not knowing what they want. So I transfer them. And the call drops. Instantly owner thinks it’s my fault and starts lecturing me. I seriously thought about leaving the industry because I couldn’t even deal with one call because his lecture was so stern. But I also was lectured last week because I always transferred them, so, I don’t know. \n\nEventually they call back ten minutes later, and I transferred them. Suddenly the client was like a different person. They introduced themselves, they told the story of how the family passed, and they just wanted a price list for a traditional service, like what you see on TV. Visitation and burial. They were still loud and outside, but they talked slow, and they never mentioned anything about what they did with me. \n\nMy anxiety was building up as the owner kept looking my way and shaking his head. Eventually the call ended, and I got questioned over why what they wanted, and what I said they wanted were different. It’s not like I have any reason to lie or make up things, so why would I? I just told him that I was only repeating what I understood, and apologized. It’s not like clients haven’t said one thing, but when talking to another director said they wanted something else.\n\nIn the end, he told me to be more direct and exact when talking to clients but literally, it’s a two way conversation. I can be as exact as I want, doesn’t matter if they’re not working with me. Though I’ve accepted people like him more because he’s a very “commanding” man, and just sounds super authoritative. Still can’t believe this one call made me think about leaving. ",
        "created_utc": 1527894577,
        "upvote_ratio": ""
    },
    {
        "title": "Confusing Double Standard?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8ng2wi/confusing_double_standard/",
        "text": "[deleted]",
        "created_utc": 1527746800,
        "upvote_ratio": ""
    },
    {
        "title": "I helped save a womens life",
        "author": "SwissMidget",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8mkd83/i_helped_save_a_womens_life/",
        "text": "So I am not sure if this exactly fits this sub but it was the closest one I could find I think. This story happened while I was on the way home from work. I work on appliances and drive to peoples houses. Until I get home I am pretty much on the job.\n\n&amp;nbsp;\n\nI originally posted this on Facebook a few days ago. I have copied and pasted it over so that the emotional state I was in when written comes through. I am by no means looking for recognition. I felt it was a story that may have made some people... happy, or maybe feel proud that there are still good people in the world. The post has been cleaned up a little so there is no identifying info. Not 100% sure what is and isn't allowed so I'm gonna play it safe and edit anything I dont think should be in.\n\n&amp;nbsp;\n\n\"What's on my mind you ask, Facebook? At the moment quite a bit. Namely the fact I may have helped to save a [redacted] womans life. Adrenaline still pumping.\n\n&amp;nbsp;\n\nWas coming up highway 75 south of [redacted]. Was heading home talking to my amazing wife when I came upon an overpass. Crazy lady off to the side of the road waving her arms and shouting. Almost dismissed it and then I saw the SUV. I knew I had to immediately stop. I was the third person to stop. The first was the lady the SUV tried to pass. The second was a bystander that appeared to work for the county or something. His truck had yellow revolving lights.\n\n&amp;nbsp;\n\nTold [redacted] I had to go and that I was stopping to help at an accident. Got out to find the first woman on the phone with emergency services and the gentleman trying to calm the woman in the SUV down and keep her from moving. As I got on scene, what was left of the SUV started a small brush fire at the front under the engine. The gentleman grabbed a small fire extinguisher and started knocking it back down trying to put it out. Managed to get control of it before it could take off. By this time a couple other guys have shown up and are trying to keep the woman in the SUV calm. She is obviously in pain and keeps trying to move and get out. It's still pouring down rain so I hand my army jacket to one of the guys to try and help shield her from the rain. Then I go and grab a throw blanket out of the van so that they can try and partially cover her because it's fairly cold.\n\n&amp;nbsp;\n\nEmergency services are on the way, the woman in the SUV has a couple guys keeping an eye on her, the lady that was there initially is shell shocked and just watching (not that there was a whole lot she could do), and the guy with the fire extinguisher is keeping an eye out for smoke and sparks.\n\n&amp;nbsp;\n\nThat leaves myself and another group of a few people. I carry a roadside kit that has a couple things in it useful for emergencies. I grab the orange triangle and run a ways down the road and set it on the side of the highway. Hoping that people will see it and know to slow down. Beyond that it was a waiting game for the emergency personnel. I kept an eye out and flagged them down. Relayed the brief info I knew quickly and then got the hell out of the way and let them work. As the firetruck pulled up I relayed the info about the brush fire to them. Beyond that there was very little I could do except stay out of the way.\n\n&amp;nbsp;\n\nHung around until I got my jacket back and figured I would wait until I could get the throw back also. Sheriff came over and asked if we saw what happened. Again relayed what I knew since I was on scene fairly early. He said we could head on out. I said I was waiting on my throw but then thought better of it because it was cheap and said they could just toss it. Headed back home and called my wife.\n\n&amp;nbsp;\n\nI've never been one to come upon an accident like this before. The SUV was a total loss. What had happened was the woman tried to pass going way to fast and ended up hydroplaning. It might not have been so bad except when she hydroplaned, she went straight into the support beam of an underpass. The damage was unreal. There was pretty much not a passenger side to the vehicle while the drivers side looked relatively intact. She had to have been the one driving. Somehow she managed to crawl into the back which was where she was when I arrived. The back hatch was jammed and the contents of the vehicle were strewn about.\n\n&amp;nbsp;\n\nI learned a couple things tonight. The first is I have got to put some sort of fire extinguisher in the van. I know you should have one anyways. Had the one guy that did have one, not had it. We would have most likely watched a woman burn to death as there wasn't really a way to stop it otherwise.\n\n&amp;nbsp;\n\nThe other thing I learned is I need to know what's in my emergency kit. I found a wool blanket after I got home that would have gone a long way to helping. I need to figure out a way to pack a couple packs of flares or something similar that can be more easily seen.\n\n&amp;nbsp;\n\nWhen I left, the paramedics had loaded her into the ambulance. They did not take off immediately so I can only imagine they were getting her stabilized. I hope she makes it and I have faith she will. It's going to be a long road of recovery for her though.\n\n&amp;nbsp;\n\nTell your family you love them. Dont fight with each other. Learn to let things go. You never know when it might be you in the back of that SUV and if something like that ever does happen, let there be people who will stop and give aid. Even if it's just a blanket. Love you all\"",
        "created_utc": 1527451764,
        "upvote_ratio": ""
    },
    {
        "title": "The joys of a tour guide",
        "author": "RaDus1",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8mh23x/the_joys_of_a_tour_guide/",
        "text": "*First time posting. TL;DR at bottom. All the usual excuses for formatting, english not being my first language, etc.*\n\n**Background:**\n\nThis story is from almost a decade ago. I was working as a tour guide in another country, for a company that no longer exists. My job primarily consisted of selling excursions and tending to hotel guests (yes we called them guests instead of customers). Each day I would visit hotels, where our guests would either complain, buy excursions or just get advice on how to enjoy their vacation. At the time of this story, I was sharing a small apartment complex with a few other tour guides. It was close to our offices and hotels, but out of the way, in a backyard behind one of our hotels (henceforth known as \"the hotel\"). That meant we would always have to go past this particular hotel when we left or entered the complex, which usually meant that we had to deal with the guests even when we were off duty. This is where our story begins.\n\n**Story:**\n\nIt all started late in the afternoon as I was heading home after a long weekend of handling transfers (when we transport guests to and from hotels). I hadn't had the time to change clothes, so I was still in my uniform and carrying my company branded shoulderbag. I knew I would probably have to talk to some of our guests at \"the hotel\", but I took my chances and hoped for the best (they would usually be drunk by the pool or out in the town at this time).\n\n\nLo and behold. A middle-aged woman started waving her hands at me, from the hotel's balcony, and urged me to come help her with a problem. She sounded very distressed, so my training/conditioning kicked in and I rushed up to her with the best service-face I could maintain.\n\n\nI'll be **Me** and Crazy Lady will be **CL** (you just know you're in for a ride when Crazy Lady is mentioned). Co-Worker will be **CW**. The following conversation is how I remember it, so historical accuracy might be questionable. Don't let the inconsistency in the conversation get to you, I was just as flustered when it happened.\n\n\n&gt;**Me:** Hi there! How can I assist you?\n\n&gt;**CL:** Can you help me!? One of your co-workers has been stealing from me. I want to press charges!\n\n\nThis is of course a very serious accusation, so I become a little shocked to learn that one of my co-workers, which I live with, could be stealing from our guests.\n\n\n&gt;**Me:** Can you tell me more about this co-worker and the theft?\n\n\nCL continues to give a vague description, but with enough details to let me identify who it is (we weren't that many). The co-worker she describes is a very nice girl who couldn't even hurt a fly. Sure she had some personality quirks, but who doesn't after having to deal with brain-dead tourists for months on end? Yet I couldn't quite peg her as a thief, it just seemed so out of character. So I ask CL if she could tell me more about how the theft happened and what was stolen.\n\n\nCL proceeds to pull out her credit card and shows it to me.\n\n\n&gt;**CL:** She took my credit card and withdrew a lot of money. I don't have enough money to go home!\n\n\n&gt;**Me:** But how could she do that if you still have your credit card. Did she come back with it?\n\n\n&gt;**CL:** Yes! She offered to help me withdraw some money from an ATM, but didn't give me back all of the money she withdrew.\n\n\n&gt;**Me:** Well that doesn't sound very nice. Let me just get a hold of her and ask her what it's all about.\n\n\nI pull out my phone and give my co-worker a call. I was lucky to catch her, since it was her day off that week, which I only just remembered as I called her. So I came to the conclusion that the theft must have happened af day or two prior (while I had been handling transfers).\n\n\n&gt;**CW:** Hi!\n\n\n&gt;**Me:** Hi there CW! Have you been talking to CL lately?\n\n\n&gt;**CW:** Yes? (sounding a little surprised, but also a little like \"oh no, what did she do now\")\n\n\n&gt;**Me:** Did you help her withdraw some money from an ATM?\n\n\n&gt;**CW:** Well, I offered to help her withdraw money from the ATM, but she just handed me the card and expected me to do it for her. For ethical reasons, I declined.\n\n\n&gt;**Me:** So you didn't withdrawn any money?\n\n\n&gt;**CL:** *(in the background)* She's lying!\n\n\n&gt;**CW:** No of course not. But let me tell you something about her. We've been dealing with her every day since she arrived. She seems... not quite right in the head.\n\n\nSo there I am, torn between the words of a customer and my co-worker. Even if CW and me had some differences, we had come to respect eachother as family (with all the shit that happens every day in such an environment, you bond quickly), so the decision on who to trust was easy. I thank CW for her time and tell her that I'll try to find out what is happening.\n\n\nI turn my attention to CL and switch into Investigation-mode.\n\n\n&gt;**Me:** Can you show me anything, like transactions or anything that supports your claim?\n\n\n&gt;**CL:** Yes! Just a sec.\n\n\n*CL proceeds to pull out several receipts.*\n\n\n&gt;**Me:** But those are receipts from stores...?\n\n\n&gt;**CL:** Then they must be the thieves!\n\n\n*(thinking to myself)* And cue all the alarm bells, whistles and red flags. CW was right. Let's just go with it and see what happens.\n\n\n&gt;**Me:** What do you mean?\n\n\n&gt;**CL:** Those stores have been stealing from me! *(completely ignoring her previous accusation, as if it had never happened)*\n\n\n&gt;**Me:** How so?\n\n\n&gt;**CL:** I bought some clothing, but it's all ruined!\n\n\n&gt;**Me:** That doesn't sound right. How is it ruined?\n\n\n&gt;**CL:** Let me show you!\n\n\nCL proceeds to walk up to her hotel room and I follow curiously and perplexed. She lets me in and I see that she has turned her room into a jury-rigged drying rack. Clothing is literally everywhere. The floor and even the bed is entirely covered in what looks like crumbled, almost-dry (poorly) hand washed clothing. Every wire that she could get her hands on had been used for hanging clothes on. A particular wire which spans the entire length of the room, catches my attention. CL points at the clothes on that wire, which look very used - almost sweat brown in the neck and armpit areas and also visibly worn.\n\n\n&gt;**CL:** The stores don't want to take them back!\n\n\nAt this point, it's somewhat important that I mention that from the receipts she showed me, I recognized some of the stores as some of our business partners. We had so-called \"town-excursions\" where we're \"encouraged\" to get our guests to buy stuff from. These stores only sell leather jackets, handbags and jewelry, but not the kind that CL was pointing at.\n\n\n&gt;**Me:** I can understand why they wouldn't want to take it back, since they don't sell those items.\n\n\n&gt;**CL:** *(completely unfazed by what I just said)* I also bought these from them, but I don't want to return those.\n\n\nCL pulls out dufflebag from under the bed and empties it on the floor. There were leather jackets and handbags in droves - easily worth the money the receipts showed - she must've gotten some pretty good deals.\n\n\n&gt;**Me:** From what I can see, these match the items on your receipts. I don't think anyone has been stealing from you.\n\n\n&gt;**CL:** *(again completely unfazed to the point of ignoring me)* Well you see, I had a little accident yesterday, so I had to wash all my clothes by hand and now they're ruined.\n\n\nAt this point I've come to accept that no matter what I do or say, it won't have any impact on the crazy bubble world she's living in. So I decide to not resist and get it over with so I can go home and get some sleep. CL pulls me out to the room's balcony, where all of her underwear is drying. Judging from the multiple panties, that all had a distinguishable brown stain, it wasn't just *one* accident. I was mildly grossed out and shocked at this point and just wanted to get away from CL.\n\n\n&gt;**CL:** Do you see what I mean? I can't return those!\n\n\n&gt;**Me:** *(with my best poker face)* I see your point.\n\n\n&gt;**CL:** *(derailing the conversation again)* The hotel staff also broke my shower!\n\n\n&gt;**Me:** Show me. Maybe I can fix it?\n\n\nCL opens the door to a very tiny bathroom. Just enough space for a shower, a toilet and a sink. There is a putrid stench of feces and old wet socks. I try to maintain a professional attitude while inspecting the shower. As it turns out, the showerhead had come loose and had slid down the adjustment bar. I raised it back to its highest level and tightened it.\n\n\n&gt;**Me:** There! Good as new!\n\n\n&gt;**CL:** Thank you! You know, you should fire the hotel staff for harassing your customers like that.\n\n\n&gt;**Me:** *(finding an excuse to get out of there)* You know what? I will go tell them right away, to leave you alone and be nice to you.\n\n\n&gt;**CL:** *(Big smile)* Would you do that for me?\n\n\n&gt;**Me:** *(biggest lie in my life)* Of course! You are my precious guest. You just tend to your clothes and I will talk to hotel management.\n\n\nCL wished me good luck as I did my best to run without visibly running. I wouldn't want to get caught up in her web of craziness again. I went down to the lobby and talked with the hotel manager, to know what was up with CL. He just looked at me with a blank face and said that she was crazy and he didn't want to talk with a traitor (roughly translated). Apparently she had been going around town telling the locals she was a famous actor, then a renowned politician and lastly a policeman, which garnered her some pretty sweet deals on goods. Locals talk, and it didn't take them too long to figure out that she was none of those. Needless to say that she was banned from every store, bar and café in town. Apparently, her reaction to this ordeal was to start taking her frustration out on people that were obliged to help her.\n\n\nI told this story to my manager, and she promptly started looking into who she was. Apparently she had left an open mental institution (without telling anyone - even her family, which didn't know she had left). We got CL back on a plane (that's another story in itself) and we never heard from her again... that is, until we noticed her name on the list of incoming guests a month later...\n\nTL;DR: crazy lady lies about everything to everyone and shows me her dungsmeared underwear.",
        "created_utc": 1527418613,
        "upvote_ratio": ""
    },
    {
        "title": "LooMee TV - &amp;quot;Klatsch und Tratsch&amp;quot; Magazin - Kino, TV und Musik",
        "author": "PattyDodswortht",
        "url": "https://www.loomee-tv.de/",
        "text": "",
        "created_utc": 1526547968,
        "upvote_ratio": ""
    },
    {
        "title": "Certified Yoga Teacher Training Course 2018 - Goa, India",
        "author": "AmandaBanvarde4",
        "url": "https://www.yognisarga.com/200-hour-yoga-teacher-training-goa-india/",
        "text": "",
        "created_utc": 1526517010,
        "upvote_ratio": ""
    },
    {
        "title": "Am I really the jerk here? (Swear words)",
        "author": "smilespeace",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8jqmk6/am_i_really_the_jerk_here_swear_words/",
        "text": "I do property maintenance at two residential complexes that neighbor each other. Recently I was at one of these properties when this story occured.\n\nSo I'm sitting on the tailgate of my truck, parked on the road, blocking one lane. I do this all the time, nobody cares. I have just finished some yummy sushi for lunch and I'm sending some quick texts before I get back to work.\n\nA resident from the neighboring property saw me on the road, and drove over to come talk to me. He parks right next to my truck, blocking the road completely. \n\nAfter some small talk, a car comes up the road and is waiting to get past. He is completely oblivious to this, and he preceeds to attempt to ask some questions about brick patios or something.\n\nSo then I guess I fucked up a little by saying \"Hey I'm sorry but I'm on my lunch break and somebody is waiting to get past you\"... (Honestly, I meant to say \"My lunch break is over now\"... I just blurted the wrong words)\n\nHis facial expression instantly went from carefree to utter disgust. \n\nHe says to me: \"You know you're turning down business you fucking idiot\"\n\nShocked, I respond: \"You can always call us\"\n\nHe comes back with: \"Drop dead!!!\" -He gets in his car, slams the door, and takes off (over the speed limit.) I haven't seen him since.\n\nI felt bad for being rude. But he never gave me a chance to apologize or correct myself. I was pretty flustered after that so I texted my boss, who was very supportive of my situation.\n\nCrazy stuff eh?",
        "created_utc": 1526430556,
        "upvote_ratio": ""
    },
    {
        "title": "Cambridge MA SEO | TitaniumClicks Media | SEO Expert Cambridge",
        "author": "buckvecchioneez",
        "url": "https://titaniumclicks.com/cambridge-ma-seo/",
        "text": "",
        "created_utc": 1526101304,
        "upvote_ratio": ""
    },
    {
        "title": "YouTube",
        "author": "ronnicapabeylch",
        "url": "https://www.youtube.com/watch?v=nYNw1wHXjHQ",
        "text": "",
        "created_utc": 1526028855,
        "upvote_ratio": ""
    },
    {
        "title": "Best Buy Stories",
        "author": "FalseGrapefruit",
        "url": "https://imgur.com/gallery/YLVKDrF",
        "text": "",
        "created_utc": 1525661781,
        "upvote_ratio": ""
    },
    {
        "title": "Chronicles of Kathy",
        "author": "squrlboy315",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8h1tpg/chronicles_of_kathy/",
        "text": "This may be a bit long, and at this point, not entirely sure if it is over or not yet, you see about four months ago the owners of my company hired a guy I will call Kathy (I'll explain the name shortly) to be the department head of one of our hardest to staff departments. This is one of those positions that have a limited number of people who are passionate about the field, so when you come across someone who is, you usually pounce and hand them the reigns asap.\n\nOff the bat this guy was a problem, demanding a laptop, wanting special software, asking me what is taking me so long to get him his requests, just all around being quite an arrogant and demeaning individual. We are a business, there are rules and regulations for purchases, they need to be approved before we go about getting things rolling, here I am trying to get this guys stuff together, working directly with the CEO for approval of my purchase. This guy is on me though on a daily basis... and things start to slowly come to light, this dude has no idea what he is talking about, he perpetually is talking out his ass and tries to embellish EVERYTHING about himself with nonsense and BS. As a former salesmen the term is baffle them with BS, and this guy was an ACE at that.\n\nWhen I say ACE, I mean he talked, and talked, and talked, and talked, we're talking day in and day out perpetually contradictions to reality attempting to prove his worth. He is the only person I've ever met who has taken credit for things he didn't know about, for example he was shown a very useful tool in AutoCAD, and asked for more information about it because he had never seen it before, the following day he claimed he wrote the program.\n\nWith his perpetual talking, he earned the behind the back nickname of Chatty Kathy, or Kathy for short. He would take days of time just talking, getting nothing done, having highly paid employees do completely trivial work because he was the department head. Such a god complex it was aggravating.\n\nHe began to start telling his employees to stop using the company standards because he knew better ways of using AutoCAD and other associated programs we used. These employees brought these \"changes\" to the attention of IT and CAD Management, obviously we were quite pissed, got ownership involved, had them deal with the guy after we were told not to come into these meetings. Kathy decided he needed a new tactic to get his way and told his employees to stop talking to IT and the CAD managers since we were unqualified and he knew better than us. Once again filed a grievance with management, they sat him down again, and nothing changed.\n\nI've sat in this chair for six years, I've dealt with arrogance and ignorance before, but this guy is a different beast entirely. This is a first for me to have employees to be told not to talk to me because their boss thinks they know more than me? I've heard of these types of people, but first time I've ever had the displeasure of meeting one, tack that in with managements unwillingness to fire this guy, we end up in a long long battle dealing with incompetence and ignorance.\n\nHe had an employee clean his desk for him, he taught a green user how to do everything wrong and going against company standards, that departments file size has since grown to astronomically large sizes taking up way too much disk space on our servers, the projects are over budget and late, as well as corrupted entire projects requiring many restorations of files. He has been here for four months and zero projects went out the door despite this guy telling the CEO and vice president he can promise work in a week, got nothing done in sixteen weeks.\n\nAfter a long drawn out battle, Kathy got mouthy, unorganized, and overly arrogant, he told his employees he makes six figures and doing their jobs is way below him, but he'd teach them how to do their jobs to make sure we get stuff done. Kathy would spend most of his meetings demeaning his employees and telling them how great he is (he's the best parallel parker in the world apparently, world class... his truck parallel parks itself....). After 4 months of it the employees had enough and one of them snapped, starting getting shouty and Kathy told him to go home.\n\nKathy doesn't have the authority to send people home, just like everything else in a business, you need approval for certain actions when you're not a stakeholder. This results in his direct supervisor, Kathy, the employee being sent home pulled into a conference room. Hour goes by the rest of the department is pulled in, its loud, there is shouting you can hear of constant \"JUST SHUT THE F*** UP\" echoing from the halls.\n\nThen 11:30 am hits, Kathy looks at his watch, says he forgot he had to go plan a baby shower with his wife, and walks out of the conference room. This is another one of his quirks that rubbed everyone the wrong way, he would just... leave work when he wanted too, without approval, without authorization, without planning, just say he forgot something and disappear. He went into the CEO's office started talking about how he's sorry he's wasting so much time today, and how he forgot he had to leave early, how its getting a bit heated in there but they are making progress.\n\nThe employees calmed down, looked at the owner after Kathy left the room and slammed the door behind him and insulting the team, basically a back handed childs play approach to dealing with confrontation, the oldest employee in the room tell the owner he has two options. Option #1, keep Kathy employed; Option #2, everyone else is walking out that door and not coming back.\n\nEmployees should never be put in that position where they are so hateful of coming to work that they have to threaten mass exodus to get a simple fact of incompetence through the skulls of ownership. Its decided that when Kathy comes back into the office, he's fired.\n\nNow I know at this point many of you are questioning how most of this is IT, trust me you need to hate this guy and understand him to fully appreciate this upcoming portion.\n\nI'm instructed by the CEO that the following morning, get to the office, deactivate this guys accounts, he has in his possession a company laptop with VPN and Email access, he may be working on it and we want to get that laptop back before we terminate him. I arrive at 7:00 am, log in deactivate his AD account, deactivate his O365 account, deactivate his VPN access, 7:03 a report is generated saying all is done, wash my hands of it.\n\nPresident comes over to my cube around 7:30 with laptop in hand, the guy was running late, got in around 7:15 and was told his services were no longer needed. He begged and pleaded to get his personal information off the laptop, how he knew he had his social on there and didn't want anyone else gaining access.\n\nRule #1 of being any job these days, your work computer isn't your computer, so don't treat it as such.\n\nPresident told the guy I'd take care of it and email it to him. Turn the laptop on, login to the administration account, locate the C:\\Users\\%username% folder and... there are a bunch of documents, for the sake of sanity and my desire to keep us 10 steps away from overstepping any legal boundaries, I don't know what to grab and ask the CEO if I can ask Kathy over an email. He's apprehensive of it, seemed annoyed at the idea, but gave me the email address anyway and told me to wait 3 hours before emailing the guy that way he can get home and explain stuff to his wife.\n\nThree hours goes by, I send my email clarifying what I had done to ensure some level of confidentiality and integrity, you know let him leave his mind at peace that we aren't going to do anything malicious or illegal to screw with him. I deactivated his accounts, logged in as the domain admin, copied his data to a locked drive, and was waiting for clarification on what he needed sent to him.\n\nI'm pretty sure you guys all remember at this point, this guy knows everything, as he's made it abundantly clear that he has written programs he's never heard of, he may even be a programmer who is fluent in no coding languages, he's never been on vacation but spent a week in Ghana, and got engaged in Venice, went on a honeymoon around the world, but never been on vacation. I just want this to be burned into your minds, that this guy regurgitates nonsense on a perpetual basis hoping to cause someone to think they are the second coming or something.\n\nI get a response to his email, as does the CEO, my response? \"I saw you logged into my private gmail account, that's a violation of my privacy.\" He emails the CEO telling him that I was instructed to break the law and he'd be filing charges.\n\nLets step back a few steps shall we? at 7:03 I have a report generated stating I deactivated everything, ran the following powershell script to verify\n\nget-aduser cduff | get-adreplicationattributemetadata -server dc1 -properties useraccountcontrol | select lastoriginatingchangetime\n\nHis account, as of 7:03 yesterday, is deactivated, it has not been changed since then, it has not been tweaked since then. He showed up in the office at 7:15 and I didn't receive the laptop until 7:30. How is it possible for me to log into his gmail? I'd either need his password, or use the cached data on a locked account... so... theoretically its impossible right?\n\nI throw my email on the CEO's desk, CEO and I sit down, we type up a long email about how we were going to provide this guy with a professional courtesy and had no obligation to send him any files saved to a work computer and have decided to format the laptop due to his responses implying he wasn't interested in us actually helping him get his stuff back.\n\nFun to be accused of doing something that is entirely disprovable with a powershell script, and quite frankly I don't know if its done with yet, due to this guys demeanor and attitude it may be on going, and probably will be ongoing for a while. I don't like the idea of court, but would LOVE to go to court and just call this guy an idiot in an entirely legally bound setting.",
        "created_utc": 1525461471,
        "upvote_ratio": ""
    },
    {
        "title": "Fellow employee told the rest of the staff his devious plan to call in fake sick to go on a trip to another state and got caught by boss",
        "author": "larsonisttt",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8fdezl/fellow_employee_told_the_rest_of_the_staff_his/",
        "text": "So we have a field technician who has been giving us problems with insubordination towards the owner’s son who is going to take over the business came to each of us coworkers and told us of his plan to call in “sick” the next three days so he could go on a trip to visit family. He kept it from the owner’s son, and one other employee but told the rest of us about it at different times. I personally didn’t think he was really serious so I didn’t mention it to the owner’s son or the owner. Another employee came to the owner’s son and finally spilled the beans that he wasn’t sick. Once the owners came in we told them and they tracked his location via his work iPhone (which he must’ve forgotten we can do) and told him that when he got back they had to talk. \n\nThis morning when we first suspected he wasn’t joking about it I asked another tech helper if he had mentioned it, and he looks at me before I even finished asking if he mentioned it he said “WHAT DO YOU THINK” \n\nWHY DID HE THINK IT WAS SMART TO BLAB ABOUT IT TO US OMG WHY",
        "created_utc": 1524849873,
        "upvote_ratio": ""
    },
    {
        "title": "Girl with a walker climbed spiral staircase as no one told her about the lift!",
        "author": "Twat_In_Hells_Chance",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8f6sob/girl_with_a_walker_climbed_spiral_staircase_as_no/",
        "text": "I work on a historic venue and normally if a visitor with a wheelchair or a walker came through we'd tell them about the manned lift to get upstairs.\nToday our main lift broke down but we were advised that the smaller lift would operate instead.\nOnly no one on the gate advised this poor young girl with a walker who climbed a spiral staircase to get to the room I was posted in.\n\nI was horrified and amazed, so I made sure that she knew about the lift that could take her down and took her via the easy access route(three shallow steps) to another part of the upper floor.",
        "created_utc": 1524781989,
        "upvote_ratio": ""
    },
    {
        "title": "Ask a question. Get a very vague response.",
        "author": "OhNoThatDude",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8ekwnc/ask_a_question_get_a_very_vague_response/",
        "text": "So I just recently started a new job. I'm still doing online training. They have me scheduled 8 hours a day, but I get done with the online training in 3-5 hours. On to what happened.\n\nSo on Sunday I got done with my online training courses for the day in 5 hours. The HR Manager had left 3 Hours before hand. So I left knowing I had nothing else to do. Yesterday I got done within 2 hours. Again the HR Manager had left. So I asked (who I thought was Assistant HR) what else I needed to do. She said \"you need to talk to the Sales Manager. I don't know who that is today, or where they are.\" So I was given the impossible task of finding this person. I asked Customer Service and they couldn't help me. So again I left. I have to go back in today. Most likely the same circumstances will occur. I know this isn't a good story. Just a good example of how the management is at my new job. They are idiots. ",
        "created_utc": 1524580859,
        "upvote_ratio": ""
    },
    {
        "title": "Is this job even worth it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8e424e/is_this_job_even_worth_it/",
        "text": "[deleted]",
        "created_utc": 1524412171,
        "upvote_ratio": ""
    },
    {
        "title": "Every time something goes wrong, my boss calls us ‘idiots’.",
        "author": "thestuffisay",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8e3nvd/every_time_something_goes_wrong_my_boss_calls_us/",
        "text": "Idiots. Chumps. Morons. Dolts. Dummies. Dopey. Etc.\nThose are some of the words I’ve heard so far.\nIt’s every time something goes wrong with the flow of our whole operation (we do production) at work or if something has gone wrong with a customer’s order once they receive it in the mail (even if the customer doesn’t really complain).\n\nI’m wondering if I’m being sensitive here and not bucking up to the real world as fast as I should be... he’s never directly said it towards me alone as he says ‘we as a whole look like idiots’ or generally calls a different group of working-people at our place, saying they’re being idiots when we’re talking one on one...but it’s left a sour taste in my mouth. No one likes to be called stupid. We make mistakes, sure, but we’re not stupid.\nIt’s just that that sort of talk + cussing would not fly at my last job and maybe I’ve been conditioned working nearly 3 years at that last place. My last boss was a hyper-sensitive PC guy (with a background).\n\nBonus: Boss man said I needed to handle one of my team mates who’s messed up (again). I asked him for a solution, and in ways, clarification for what we exactly wanted out of me as the man seems vague sometimes. He sternly looks at me and says to me that if I can’t proceed, then he can’t trust me.\nWhich to me......is a big ‘F—- You’ by him...as I am a firm believer in trusting your employees. It’s something I wanted to bring light to with my last boss for my last crew as he’d have the same issues. It’s important to hire and trust your employees. ",
        "created_utc": 1524408395,
        "upvote_ratio": ""
    },
    {
        "title": "Don't read your emails and be a pain in my ass? Get your own paper towels!",
        "author": "sleepygirl08",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/8d7ho3/dont_read_your_emails_and_be_a_pain_in_my_ass_get/",
        "text": "",
        "created_utc": 1524073666,
        "upvote_ratio": ""
    },
    {
        "title": "How Spooky!",
        "author": "sapphicpenguin",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8czud3/how_spooky/",
        "text": "I work at a small rental company in a tourist town. We really just focus on weekly vacation rentals in the summer, but in the off-season we offer more flexible dates. Last Thursday was our first \"big\" check-in day of the year (We had twelve check-ins, so it was the most we've had so far. In summer we can have over 300 a day) and, for the most part, it went off without a hitch.\n\nSometime in the afternoon, an elderly woman checks in (I'd say 60's or early 70's). She's staying by herself, which is unusual for us, but not alarming. When she checked in, she was very nice and friendly. We gave her the condo keys and parking passes and sent her on her way.\n\nA few minutes later, she comes back. She can't find the building. The building is one street over from where our office is located. However, we put on our customer service smiles and give her directions to the building. Again, she leaves and immediately comes back. She points to the building across the way from us, asking if she could stay there instead. Of course, all our properties are individually owned so you can't just switch rooms like a hotel. Our only option was to keep guiding her to the building she had reserved. Since it was slow in the office, my co-worker offered to ride with her and guide her to the building. The woman happily accepted. \n\nAbout ten minutes later, my co-worker comes back. She got the tenant to the building, but had a wild ride there. Apparently, the woman drove over a curb. But my co-worker was fine, so we chalked it up to a silly story.\n\nLittle did we know, the story was just beginning. A few minutes after my co-worker got back, the woman came breezing back into the office. I happened to be at the counter, so I asked her if everything was okay.\n\n\"I can't stay there,\" she said. \"It's too spooky.\" At this, I start to get worried. Is she one of those spiritual types who won't go into a building if they \"sense something\"? How do we handle this?\n\n\"What do you mean 'spooky'?\" asked another of my co-workers.\n\n\"I've been waiting for the elevator to come, but it won't come!\" the woman said. This led us to discover she hadn't realized the keys we gave her included an elevator key. We explained how to use it and she went on her way, chuckling at her little moment.\n\nThe rest of the day went on as normal and we didn't hear back from her. We assumed all was well. The next morning, however, she came storming back into the office.\n\n\"Did you have a good night?\" I asked her. \n\n\"No, I did not,\" she replied and I braced myself for what could possibly be next. \n\nShe had a whole list of complaints, ranging from one of the beds being sunken in, the popcorn ceiling had some peeling, and there was some white gunk around the kitchen sink faucet. \n\n\"I can't sleep on that bed. I've been disabled for twenty years!\" she told us. Now, this is a valid concern, but it hadn't been voiced to us when she made the reservation or at any point prior. But that's not the fun part.\n\n\"I wouldn't let a trick sleep on that bed!\" she yelled. We were dumbfounded. She later declared a tamer version of that, saying, \"I wouldn't let a dog sleep there!\" She told us she simply couldn't stay there. As we had nowhere else to put her, our only option was to call the owner to see about the refund. In the meantime, the lady went to go pack her stuff.\n\nAs we readied a refund, we called our maintenance guy to the office. Obviously, before we give anyone a refund, we have to investigate the tenant's claims. It was while we were filling him in on this woman and her antics, something new came to light: the tenant claimed to our bookkeeper that she had not stayed in the unit the night before. She claimed to have gone to stay with her brother in a different building (this is relevant, I promise). She hadn't told any of the rest of us that, so we were suspicious.\n\nI decided to go with our maintenance guy to the unit in case she was there. She was funny enough that I didn't think she'd take kindly to an unfamiliar man showing up. I thought a familiar face would help. \n\nNaturally, she was there when we arrived. And here's the thing: most of her claims were valid. The bed was sunken in (this woman was thin, so it had nothing to do with her) and there was some calcium buildup on the faucet (due to the salty sea air). However, she 100% stayed there that night. There was food in the fridge and the ironing board was out (along with the iron). Clearly she'd spent time here. But what could we do?\n\nWe helped the woman take her luggage to her car. On the way down, she started flexing (or straight up lying). Among her strange claims were:\n\n\"My daddy is an engineer. If he saw me sleeping in that bed, he'd lose it!\"\n\n\"My room at home is as big as that whole condo. I'm not used to living like this.\"\n\nWhen we got to her car, she pointed out the car next to it and claimed, \"I have that care in gold!\" She then graced us with a small anecdote on how her relatives teased her for having so many cars she doesn't use them all (apparently the one she drove down in was one she'd never used before).\n\nIn the end, we had no choice but to give her the refund. And now, all we're left with is a crazy story about a crazy lady.\n\n  ",
        "created_utc": 1523997480,
        "upvote_ratio": ""
    },
    {
        "title": "Almost answered a job scam. They yelled at me down the street.",
        "author": "Edward_Warren",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8cr3gn/almost_answered_a_job_scam_they_yelled_at_me_down/",
        "text": "I was a senior in college, about to graduate in a few months. Found a job offer on a job board for an event coordinator for about 40k for big corporate functions. They didn't require any prior experience in order to apply. That should have tipped me off that something was wrong, but I was so eager to find a real job I sent in an application anyway.\n\nAlmost immediately after sending it in got a call back asking me to come in. Small office, everyone there is my age or younger. Again, should have tipped me off considering how big a deal the offer supposedly was but I was too nervous to really notice it. I'm handed a slip of paper by the receptionist and get asked to fill it in before I can interview. Standard softball questions \"where I went to school\" and \"traits I want from a job\". Wondered why they couldn't just ask me, and then the actual interview rolls around. \n\nFirst interview takes about 15 minutes tops, mostly small talk about sports of all things and nothing about the actual job. Interviewer tells me the company office is new, they're rapidly expanding and they want *amazing* people *who can *be independent* (this will be important) to come in \"and lead a team\" (more on that later) and asks me when's the quickest I can start. I give him the standard two weeks so I can let the place I'm working at know. He gets agitated and tells me that if I start I would have to start *tomorrow*. \n\nOh wow. I was understandably shaken a little, never having a *real* job before now having only ever been in school, and more than a little weirded out that he's making it sound like he's ready to hire me right after we just met and we haven't even talked about the job. He must notice the look on my face because he backs off, and tells me that there will be a \"final interview\" tomorrow and if I'm one of the *chosen few* to be selected for the position I'd be invited back tomorrow, so there was still time. Again, I get a call back almost immediately after I leave that I've been chosen based on my \"excellent answers\" (\"lol, what answers guy?\" I wish I'd said, but again, dumb kid). This is moving really really fast, but I'm new to the job world and I really did hate the job I had enough that I was seriously okay with just not going back there if I landed this, so I OK'd the interview.\n\nShow up for the big day, nervous but even more excited. Going to finally have a real job with *insane pay* for someone just coming out of school while everyone I knew was struggling to get hired. I walk in... and immediately the rose-colored glasses come off. Something is very, very wrong.\n\nI get there early, because this place is right by my house and I wanted to make the best impression. I go in, and all the televisions in the lobby are blaring three different sports games at almost max volume. I get handed yet another piece of paper with softball questions and am told to sit. I finish in five minutes and sit back down. Another gentlemen comes in. 'Another of the chosen few' I think, because this position is supposedly so important and how rigorous the screening is according to my interviewer.  We make some small talk as best we can over the televisions going off all around us. He's a really nice guy and we pass the time a little, until I ask him what he does for a living. He's a stockboy at a electronics store down the street. This unsettles me a bit, because this was supposed to be a very important job and I was a college student with honors. He's really nice, but why is this guy here?\n\nAnother kid comes in. And another, and another. Soon the lobby is practically full of guys filling out those dumb little sheets of paper. At one point one of the guys that works there has three people following him around scheduled to interview with him. I look around. Every room I can see into has at least one person getting interviewed in it. More people are walking in when I finally get called by a kid my age going around with a clipboard of names. \n\n*I wish I was making the rest of this up, but I *swear* to you this really happened.*\n\nI get taken into a section of rooms I've never been before, and I get introduced to the guy who was supposedly the big boss of the company, or at least this branch of it. He's late forties at least, everyone else I've seen is late teens or early twenty somethings at most. He's nice, shakes my hand, then hands me off to some other guy. \"He's the best at what we do here\", I'm told. That's great, if only I knew what exactly *what* we were doing here. \n\nThe boss man tells me that this guy is going to fill me in on what we do here, and then we'll see about setting a contract up for me. \n\nOkaaay... This is still an interview right?\n\nI follow this guy around the corner of this nice office space... and right out the back door. It strikes me that this \"expanding major company\" is just the handful of little rooms I could see from the lobby and the boss' room. I follow this guy down the street, to a restaurant just opening up for the day. Half the booths are full with people getting interviewed too. We've got a window seat, so I can see the little corner cafe right next door has the same thing going on with at least all its outdoor seats. What is going on here?\n\nThe \"interview\" starts out standard enough, with the guy asking some standard questions like leadership experience, my major, business aspirations, etc. I mention I'd like to own my own business someday, and then he jumps all over that. Tells me how amazing I am just from my answers, and says we're alike in that everyone at this company has the *entrepreneurial spirit*. He buddies up to me for a little bit, laying on the flattery, and saying a few things about business in general I agree with. Mentions how this business allows all of us to succeed, and us leaders are all owners in this amazing business going very exciting places.\n\nAnd then he says he doesn't like people who want a salary. \n\nHe says that people who want to be salary can't be entrepreneurs and can't be leaders, because they're not independent and they're not afraid to take risks. \"*We're not like them, are we redditor?*\" he says, trying to get me to say yes. I finally ask him exactly what it is I'm doing as a \"leader\" on this team, because by now it's readily apparent this isn't the job I was applying for. He finally gets a handle on himself and stops tooting his own horn and we get down to the details. This isn't an event coordinator job. It's not even a leadership job. Well, \"not at first\". It's door to door sales work. I'll spare you what exactly it was I'd be selling, it was frankly ridiculous and didn't sound at all legitimate. I'd be driving around all day with the dozens of other people getting interviewed in the company clown car. \n\nOut of morbid fascination I wonder aloud where my pay would actually come from. \"Well, that's simple.\" He proceeds to take *my* notepad and starts putting down a bunch of equations, basically assuming perfect sales and if everyone I know wants to buy this stuff, I'll be making serious money from commission. Now and then he asks me to answer one of the equations, and then compliments me on how well I did and that \"I'm doing amazing already\", trying to stroke my ego. The money made off sales is split among the whole group and with the company, so my pay on average would be $200 a paycheck, far less than what I was making from the crummy job I had at the time.  My head is spinning from all the info he's unloading on me, which I suspect was exactly the point. \n\nNow it gets really fun. Here's where I start being a *leader*: after I make enough sales, I'll move to the \"next level\" of the program and get like a half dozen people under me, then when they moved up a half dozen under each of them, and so on, and so on. In about a year after I joined \"the program\", I'd be expected to rent my own office somewhere and send these people out to do their own sales. \"Just like you wanted right? Your own business!\" he said as he waved the notepad of numbers in my face. He told me he needed to confess something to me, something he knew *I'd* understand. I was one of the final people he needed to interview to get his own office, so he was grateful I was here. You know, playing up how I was doing him a favor and how it would break his heart if he couldn't make it.\n\nThis was a MLM company at best a Pyramid Scheme at worst, and by the way this guy was getting more and more nervous the more questions I asked, I was leaning the latter.\n\nBy this point my nervousness has evaporated, and I known damn well this is not a job I want. I tell him I'm not so sure, ask some hard questions, ask him to slow down and really repeat some of those points above. At this point I'm only still here because I'm having fun interviewing and grilling *him*. He starts getting red and shifting in his seat. \"Why are you worried? *You* applied *here*. Where's your entrepreneurial spirit? Let's do the numbers again and you'll see-\"\n\nI tell him he's wrong. That I actually want to get *paid*, because I'm going to be coming out of college already with a mountain of debt, and I can't afford to not have any money. He makes a face like he understands, like he's just had a huge revelation. He tells me he gets it, he's actually a college grad too! In fact, his boss joined the company, and paid off all his college bills and more in just six months!\n\nHis middle aged boss, at this office that's only been open a couple weeks at most.\n\nHe tries to loop back around into his sales pitch, because that's what it is, it's clear that's what it is after we got ten minutes into the interview and he started selling and stopped asking about qualifications. I look him dead in the eyes, and say very firmly \"Look: *I\"M DONE*\". He looks defeated, nods like he understands.\n\nAnd then he says this little gem:\n\n\"Well, I'm glad you let me know how you feel. It's important we got this out now before I hired you...*because we only want people who can actually succeed here*.\"\n\nI just smile at him and shake his hand. I leave the restaurant, passing all the kids and interviewers that are looking at me like I've grown a second head. People are sitting on benches all between the office and the restaurant getting interviewed. I walk back to my car, and he walks back towards the  door back into the facade of an office. He suddenly spins around and shouts out in the earshot of all the people around us: \"COME BACK WHEN YOU WANT A *REAL* JOB AND ARE TIRED OF RETAIL!\"\n\nSure man. I shrug and get in my car, waving at them all as I drive away.\n\nIt's been a whole day and a half since I heard about this company till I walked out of my own interview. Things happened so fast I don't remember every detail, they tried so hard to just get me to sign, don't think, just SIGN! I just knew that I needed to get out before I made a huge mistake. I checked that job board again later to make sure that guy shouting at me in the street wasn't my fault somehow. Turns out this place advertises openings for jobs from managers to accountants to party planners, all of them turn out to be the same MLM gig. Remember those TVs blaring max volume? There to keep the applicants from talking about what job they were there for or overhearing the same identical pitch. \n\nI check their website and the reviews they get online now and then for giggles. Half the reviews are suspiciously empty five star reviews and the rest are people complaining they were ripped off. \n\nNone of the people I saw seem to work there anymore.",
        "created_utc": 1523913188,
        "upvote_ratio": ""
    },
    {
        "title": "She basically said we don’t pay her enough?!",
        "author": "AmbitiousQuirk",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8bn5wu/she_basically_said_we_dont_pay_her_enough/",
        "text": "Busy worker here. Manager of a production site. I have tons on my plate, daily. I’m trying to delegate simple tasks to my team so that I may focus on bigger problems...hopefully before I pull my hair out. We’re under-staffed. Director won’t hire new people yet. This is only my second month in too... but I’m use to warehouse-environment jobs. They’re oddly in my field of talent. This ones just a bit of a bigger monster to tackle.\n\nAnyway. Long story short.\nI plopped some postal stuff in front of a girl and said I need her to sort through the poly-bags and place them where they belong comparatively to their order number. Receiving.\nShe looks at me flustered, says, “Um. Okay?...”\nI’m her boss. I ask what’s the issue.\nI grant her advice and training, getting hands on and showing her what to do with the first two items.\nShe looks to me and says, “Jake (her partner) gets paid two more bucks than me. If I’m going to do this, we need to talk about jumping my buck up. I’ll need a raise.”\nThis is the first anyone’s told me this, not following my orders. I’m stunned but still politely tell her to do the job. How hard is it to open a poly bag and look at a packing list?! Mind you. This girl gets caught staring at her phone during down time and checking out her nails.\nUgh.\nTold my director about her attitude after she finished the task. He was not pleased...\n\nMy idea from now on is I’m going to have to print out job descriptions and keep them on file for what’s expected of my team for instances like this. Maybe have them sign it too.\n\nRant over.",
        "created_utc": 1523503346,
        "upvote_ratio": ""
    },
    {
        "title": "The Stolen Interview",
        "author": "TheDivineArchitect",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8bhtgh/the_stolen_interview/",
        "text": "I have been planning to write this one for a while.\n\nI had been looking for a new job for a little while, essentially had been throwing applications around on Indeed and seeing what sticks. Eventually I received a request for an interview at a well known cross-country freight company. The position was described to me as \"driver check in\" but there was little else of note. I knew the company and had previously used them myself at my old job, so I knew they were reputable, so I had no issues with showing up to the interview.\n\nI arrived at a freight depot and walked through a rather nice office after being greeted by not my interviewer, but by the customer service manager. We will call her Nadia. We walked towards the back to the freight office where customer service, dispatch and their managers were. It was a typical slightly dingy but large warehouse office. I didn't think of it much as I had previously worked in such places and was well versed in how warehouses are. We chatted a little on the way about what I used to do and where I had been, and that I had previously used the company before to freight our products.\n\nI was taken to a small conference room and she went to speak with her boss (my original interviewer) and came back shortly, explaining that she wanted to interview me for a slightly different position.\n\nNadia explained to me that she was looking to help clean out some inefficiencies in the company and effectively was looking to have someone take her job so she could move up the ladder, and that her current team didn't want the position (red flag here). She was impressed with my previous experience and after a good hour of chatting she was very excited. Exact responsibilities were still a bit unclear but I was getting desperate to pay bills and didn't really care. I left and the next day I was called by HR to start work on Monday.\n\nI showed up and had to be buzzed in as I did not have a passcard. I sat at the small cubicle near Nadia who started showing and training me for customer service, and that I would also be needed to help in the Driver check in position. She and her customer service team were ecstatic about how I took to the customer service work and how I was familiar with the industry as part of my previous experience.\n\nThe driver check in work was a little more complicated.\n\nI had never dealt with in house truck drivers before, and much of that work was dealing with logs and deliveries for about 50 different drivers. It wasn't particularly difficult work but it was very different from both what I had done in the past, and what I was being trained to do in customer service. It was also very slow, as drivers only started checking in after 4 o'clock and there was not much else to do the rest of the day in that position as there were already two other people working in this department. We will call them Jessica and Johnny. This is where the next red flag comes in. \n\nJessica was an older woman who had been in the business for 40 years and getting close to retirement. Nice lady but a poor teacher. She did things and knew how to do them because she had always did them. There was little documentation that explained why and she said little else aside \"that's how it's done\".\n\nJohnny was quite the opposite. He was a 19 year old kid who walked in often an hour late or didn't show up at all. When he did he did his work but was otherwise very lazy and he regularly smelled like he didn't shower for days. The red flag came when, on the Friday before I started a post went out from HR that I was starting on Monday in the Driver check in position. Apparently he threw up his arms saying \"that's my job what the fuck\", went to Nadia and asked if his job was safe, which she affirmative said yes his job is safe.\n\nTwo days after I arrived Nadia's boss went on holiday for 2 weeks. During this time there were two massive snowstorms that crippled us in delivery times and customer service had to pick up the slack in dealing with angry customers. I was now sitting full time in customer service but most of my duties were related to calling out to customers to I formatted them of delays. I had little to no autonomous tasks and two weeks in, felt lost as I was partially trained on two separate jobs and didn't have a handle on either. Another red flag, in hindsight.\n\nThe third week comes by, my bosses boss is back and while I went to lunch, when of our dispatchers is taken by ambulance for a suspected heart attack, (he was fine and came back to work a few days later).\n\nNadia went to take his position and then informed me, angrily, that I needed to go to driver check in and learn to do the job there as soon as possible because Johnny no showed again, and her boss was pissed I didn't know how to do my job. For the next two days I was in purgatory back there again, spending more time on my phone than actually working for lack of work, while customer service suffered from manpower shortages. \n\nBy Thursday I was miserable. I was coasting by with the job but now felt like I was being wasted, wasn't being taught how to do the work and was just generally bored.\n\nI went to Nadia and we went to the cramped conference room to discuss the issues. I expressed my problems to her and she stopped me, saying I was never doing customer service, that I was always driver check in. I inquired why I was being trained with such a heavy bias towards customer service and she told me I needed to learn how to do things in the company. I felt very confused and lied to at this point. I had the impression she had dragooned me into her department that without informing her superior and when he came back from vacation and found out, he was pissed.\n\nWhen I informed her that I felt there was not enough work for 2 people km the department, much less 3 she said she knew. I asked to clarify the issue and brought up the conversation  with Johnny, where she said his job is safe. This is where the worst flag came from.\n\n\"OH his JOB is safe, his position is not.\" I felt very uncomfortable at this point. Regardless of whether she was right and he needed to be removed (which I did agree with) she had lied to his face when he asked if he was OK.\n\nIt got worse in the next few minutes as she continued, discussing her frustrations with her department, and how she had 3 more frustrations in dispatch, two in the back, 2 more in another department. It came to a head when she said to me very slowly \"I don't want YOU to become a frustration.\"\n\nIt was then I decided to leave. I no longer felt comfortable or safe as a new employee in the office when I had seen how my boss talks about her employees to others in private and outright lies to them. I smiled at her and said I understood and that everything would be OK.\n\nI walked out of the room with her, right to my desk, got my things and out the front door. As soon as I got home I resigned by email and sent a more detailed email to HR explaining the issues and did not go back.\n\nIt worked out in the end, obviously I was not asked to return to work but the very next Monday I was lucky enough to get an interview with a new company, have been here a while now, getting paid better, closer to home and am actually enjoying going to work in the morning. ",
        "created_utc": 1523459588,
        "upvote_ratio": ""
    },
    {
        "title": "Working for a boss who is, functionally, a child",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8b8rtr/working_for_a_boss_who_is_functionally_a_child/",
        "text": "[deleted]",
        "created_utc": 1523376335,
        "upvote_ratio": ""
    },
    {
        "title": "Boss Amnesia Syndrome-- tired of saying, remember when we talked about this?",
        "author": "madamejesaistout",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/8b8exy/boss_amnesia_syndrome_tired_of_saying_remember/",
        "text": "I don't know how some of the people who have been fortunate enough to be my boss can get through life with the memory problems I've encountered. Also, why can't people just write stuff down? I've had bosses and co-workers praise me for remembering things, but I just use the ancient technology of writing stuff down. That's my secret to remembering stuff.\n\nTwo stories:\nI am currently a contractor. I have a long contract and devote 30 hours/week to that job. Recently, I learned of another job, so I talked with current boss about cutting my hours down to 10/week so I can take this other job. He said he wanted me to have two weeks to wind down and give us time to discuss shifting project priorities. I know he had a minor panic attack and I knew to just wait it out because this is the best time for me to take a step back-- nothing there is urgent, things won't pick up until August at the earliest. \n\nI send him an invoice for this month, prorated the hours to reflect that I would work 2 weeks at 30 hrs and 2 weeks at 10 hours. He emails me back, \"Why is the invoice so much? I thought it would be a 1/3 of the normal amount?\" So I write back, remember when you wanted me to continue working for 2 weeks? (Spoiler: he doesn't. His panic attack passed quickly and he forgot all about it.)\n\nThis reminds me of a previous experience at another job. We (myself, my Supervisor, and another Colleague) had a weekly meeting with The Boss. Right before the weekly meeting, Supervisor, Colleague, and I were given a new approval process for using the office debit card, because apparently there were some issues of not having enough money in the back. Seems pretty important! \n\nSo we get the new process, meaning it will take a week to get purchases approved. Fine, no big deal. In the weekly meeting, The Boss wants some data that costs money-- it's a long process to get that data and he's getting impatient. I finally have all the paperwork complete and was planning to request the funds using our new process. The Boss wants the data ASAP and asks if we can get it by the end of the week. Supervisor and Colleague say yes (because they're not in the habit of telling The Boss no).\n\nI say, \"No.\" \n\nThe Boss looks at Supervisor. Then he looks at me. He asks again, \"Can we get the data by the end of the week?\"\n\nI say, \"Not if we want to follow the new purchase process we just talked about with the accountant.\"\n\nThere's a pause. I'm clueless. I didn't realize that my saying No to the The Boss had made everyone else uncomfortable until I thought about it much, much later. I thought The Boss would want to make sure we didn't overdraw the bank account-- since that's what the accountant HAD JUST TOLD ME.\n\nThe Boss laughs. \"That's what I need! Someone to tell me what's going on!\"\n\nI remember asking, \"Do you want us to ignore the new purchase process to get the data faster?\"\n\nHe said no. We waited an extra week.",
        "created_utc": 1523373987,
        "upvote_ratio": ""
    },
    {
        "title": "Coworker tells me I've gained some weight",
        "author": "sleepygirl08",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/89s1gw/coworker_tells_me_ive_gained_some_weight/",
        "text": "I have one coworker that I'm sure exists in many offices: she's been here forever and does a lot of good work so the powers that be basically let her have the run of the place. I'll call her Chris. I actually like her (I think?) and believe she's a good person, but man. She's SUPER opinionated and discusses highly politicized issues regularly and loudly. She also enjoys listening to political podcasts in her office. Again, loudly. She has opinions about everything else as well and isn't afraid to let people know them. If you're in her vicinity she thinks it's her right to know exactly what you're doing and why. I sit at the front desk and she often stands directly behind me so she can observe not only the lobby but also my computer and discuss what I'm doing on it. \n\nShe's very proud of her keto diet and works out religiously. Of course this gives her the right to tell everyone else what they should be eating and more than once I've heard her tell other coworkers that their food has too many carbs in it. \n\nThe creme de la creme is that today I wore jeans with a belt and my shirt tucked in. I'm tall and thin but lately I've gained 5 or 10 pounds. \n\nI went to the bathroom and when I came back THIS WOMAN was standing beside my desk eating a plate of chicken. She looks at me while she's chewing away and booms \"YOU GAINED SOME WEIGHT LATELY??\" Me: \"um maybe a couple pounds.\" \"WELL I CAN TELL!\"\n\nI go behind her back to sit down and give my coworker a WTF??! look. My coworker looks really uncomfortable and is just like \"Chrissss!\" Chris barks back \"what? She (I) know I aint got know filter! If she gets offended that makes her a snowflake!\" We definitely know which side of the political spectrum she sits on it. \n\nI know she's an asshole and people are going to tell me I should have called her out/reported her, but I really don't feel like it. If I heard her say that to someone else I like to think I'd speak up, but it's just not enough of a big deal to me to upset my calm Wednesday over. \n\nNow I can tell that she feels bad, but she can't make herself apologize so she's just loitering in the lobby making small talk with me. \n\nGood times at the office. ",
        "created_utc": 1522865949,
        "upvote_ratio": ""
    },
    {
        "title": "Moved my desk, co-worker lost her shit",
        "author": "deskmoverwavemaker",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/89q8j2/moved_my_desk_coworker_lost_her_shit/",
        "text": "I work for a company we'll call ABC Corp.  At ABC Corp, there are several offices and then units of people in each office - one unit per supervisor.  My office recently moved buildings and we were seated in our cube farm according to unit, so you sat with your other unit-mates and right outside your supervisor's office.  Fine and dandy.\n\nOne of my co-workers (heretofore known as X) is notorious for being insanely rude and inappropriate.  She's had the job almost 10 years and has had 10 years of HR meetings regarding her behavior.  Past offenses off the top of my head - *loudly* talking about her sex life in the office, receiving personal, rage-filled handwritten letters from her boyfriend's wife at the office, masturbating on the floor of the family bathroom (wish I was joking), announcing her farts to people around her, bringing in a string her cat ate and pooped out and showing it off to everyone (as you do).  ABC Corp employees are unionized and it's the kind of union that protects even the bad employees.  Hence, X is still employed.\n\nNaturally, when we moved, I was put next to X.  I knew it'd be a clusterfuck but wanted to stick it out so as not to seem difficult by immediately asking that I move my desk.  Yesterday, the straw met the camel when she farted and said, \"that was a squeaky one!\" to no one in particular.  I could not live my life in this idiot's fart cloud anymore.  So I emailed my boss asking to move seats, said the loud/busy corner I'm at was increasing my migraines (true, though not the primary reason for my request), and quickly got approval.  No big deal.\n\nThis morning, X fires off an email to our supervisor, CC:ing everyone in our unit.  *What determines if we can move or not?  Why did she get to move?*  I cringe and shortly thereafter my supervisor stops by my desk and says we're having an \"impromptu meeting\".  Here we go, get the popcorn.\n\nBoss: I know you guys have some questions about moving desks, what are they?\n\nX: What's a real reason for moving desks?\n\nBoss: It's a case by case thing, but you're welcome to request via email or in person and we'll discuss and get back to you.\n\nX: But what's a reason for moving??!\n\nBoss: Did you want to move desks, X?  If so, feel free to ask and we'll let you know.\n\nX: Well, if I get a \"No\", that's unfair.  Like you didn't consider it.\n\nBoss:  Oh, we'll definitely consider it, don't worry.  But not all requests will be granted.  Like I said, it's case by case.\n\nSince it's obvious this meeting is about me, and I don't want X to start screaming at me thinking I complained about her to our boss, I pipe up.  \"I just wanted to let everyone know - I moved because the foot traffic and noise at the corner there was making my migraines a bit worse. I just asked, and got a yes.  That's the only reason.\"\n\nX then turns around to face me and says, \"We all get headaches, and we deal.  WE ALL GET HEADACHES.\" and turns back around.\n\nI make wide eyes and look at my boss, who shakes her head \"no\" as if to say, \"please don't reply.\"  I'm mortified so I don't say another word.  I let X dig her own grave.  Boss looks at her totally confused and a little horrified.\n\nBoss then asks, \"X, are you concerned about someone else moving or about yourself?\"  X is like, \"Oh, I don't want to move.\"  Boss: \"Okay, well, then it's no one's business but the person who moved.  You might not like that answer but that's how it goes.  Any other questions?\"  There's...no other questions.  Just awkward discomfort hanging in the air like pea soup fog.\n\nSo we all file out of the room and head back to the office.  \n\nWhy do I have to work with this idiot?!?!  Why are people like this?  Why am I trapped in a dumb version of Office Space?  I feel like an idiot for speaking up at all, but I just wanted to quell the rage of the nutbag.  I need a vacation.  ",
        "created_utc": 1522854230,
        "upvote_ratio": ""
    },
    {
        "title": "At the Van Halen concert",
        "author": "MollySPrentiss",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/88t3t0/at_the_van_halen_concert/",
        "text": "I work at a large concert venue and one night, I was checking tickets for people to enter when this drunk women stumbles up to me with a beer soaked fistful of crumpled paper. She tried to unravel it, not succeeding. Obviously, I couldn't read it so I didn't let her back in. She became distraught, and had a tantrum that resembled that of a toddler. I apologised and sent her on her way. About 15 minutes later, she came back even drunker and approached me seductively. She let one of her breasts slip out and giggled, but I didn't let her in, so she pushed past me and rushed into the venue. About 30 seconds later, she was being escorted out by two policemen.",
        "created_utc": 1522609075,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry, not sorry anymore.",
        "author": "smilespeace",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/88s0pw/sorry_not_sorry_anymore/",
        "text": "I landscape/garden in a townhouse community where the gardens are squeezed into small spaces, up against walk ways and front entrances... This happened a few months ago.\n\nI go into a residents private entry area to work the garden. I've had problems with this resident before, when she made a stink over a job I'd been authorized to do by the townhouse gardening commitee.\n\nI'm sprucing up her garden because I [sadly] can't neglect her.  As I'm working, some dirt spills from this small garden, onto her front entryway/path. I make a note to clean up before I leave.\n\nBefore moving on, I migrate less than 15feet to clean out her front driveway garden. A few minutes into the job, the lady [TL] drives up and starts right into me [Me].\n\nTL: When are you going to trim this shrub? You always skip this one. (I actually trim it twice a year)\n\nMe: Well, it's actually a bad time of year to trim, but I can---\n\nTL: *Nevermind*, I'll do it myself. (turns back, walks away)\n\nThen she finds my dirt crumbs from earlier\n\nTL: *What is THIS* , (I come running over)\n\nMe: I'm sorry about the mess, I'll clea-\n\nTL: How am I supposed to get inside? (turns back again, goes inside)\n\nI finished up her driveway, came back in 5 minutes with a leaf blower, but she's already sweeping her front entry. I didn't offer to finish it up for her.",
        "created_utc": 1522600284,
        "upvote_ratio": ""
    },
    {
        "title": "The day I realized I had to quit my job",
        "author": "TorreyL",
        "url": "https://www.reddit.com/r/talesfromthejob/comments/87yig8/the_day_i_realized_i_had_to_quit_my_job/",
        "text": "(It still took me months to do so.)\n\nThis was my first real job out of college. I was a paralegal being paid $12/hr, well under the market rate (I was billed out at $125). I had recently been diagnosed with anxiety disorders. The owner of the firm was not making that any easier. She told me she would rather I come into work late and fully rested than on time and groggy. About a week later, I texted to say I was really tired that morning and would be between half-an-hour and an hour late.\n\nLater that morning, when the owner got in, she ripped into me for coming in late for being tired. After she left, my coworker who sat in the same area told me that she clearly remembered the owner telling me I should come in late if I was too tired. I was also confused because another employee had fibromyalgia and was allowed to come in late or stay home if her symptoms or medication side effects were bad. (Before anyone asks, we were too small for ADA and EEOC protections).\n\nHowever, that was not the last straw. One day, the owner decided she wanted a conference table moved from one room to another. No big deal. The table was big and heavy, so it took five people to move. The next day, she noticed the table had been moved and asked why. The five of us said she had asked us to do so the day before. She insisted that made no sense, she would never do so, and we were wrong.",
        "created_utc": 1522298047,
        "upvote_ratio": ""
    }
]