[
    {
        "title": "Well, we wanted to test that anyway ...",
        "author": "wrdlbrmft",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oa9w8/well_we_wanted_to_test_that_anyway/",
        "text": "Some time ago I was part of a team who built a datacenter. A final step of the project was a long list of tests where we would verify that\n\n* if a redundant component fails there will be no service disruption\n* monitoring alerts actually work\n\nSo we created a long list of tests. While preparing that list I noticed that one host reported one power supply as faulty. Well... we'll check that when we are onsite.\n\nSo there are about 10 people in this server room... network guys, storage guys, virtualization guys, quality manager. We are doing one test at a time... unplug something... verify its still working... check monitoring. Plug back in... verify its still working... check monitoring. Unplug the other cable... etc.\n\nI mentioned the problem with the power supply so we check.. hmmm both show 'green' but hardware monitoring reports one as faulty. Strange.\n\nWhile we are doing redundancy tests suddenly the host with the faulty power supply fails. I look up - and there's a networking guy holding a power cable....\n\nMe: 'Explain ?'\n\nNG: 'Uh.. I wanted to see if its properly seated...'\n\nMe: 'Well... seems that was the cable to the operational power supply... and we wanted to test host failover anyway.'\n\nSomehow unplugging and re-inserting the faulty power supply fixed it.\n\nAnd host failover worked (VMware vSphere HA usually does).\n\nAnd we noticed monitoring didn't monitor host network connections and fixed that.\n\nEDIT: Actually we found another thing that was kind of interesting. Well at least for me because I hadn't thought of it when preparing the test checklist.\n\nWhen we did network switch redundancy test (pull power cable from switch) connected ESXi hosts would fail over traffic to the other switch; almost no packets lost. Good.\n\nBut when the switch was powered back on network traffic to ESXi hosts would be disrupted for almost one minute. Bad. What happened was that network ports to ESXi hosts would come up, ESXi would distribute traffic between switches, but the switch that just had been powered on wouldn't talk to other switches for some time. Don't ask me why; I can 'sho run' and 'copy run start' but thats it. So they implemented a delay when the ESXi network ports would come up. If we had tested this by just shutting down ports on the switch we wouldn't have caught this.",
        "created_utc": 1528048195,
        "upvote_ratio": ""
    },
    {
        "title": "How many software engineers does it take to change a light bulb?",
        "author": "gargravarr2112",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8oa3kp/how_many_software_engineers_does_it_take_to/",
        "text": "Since I work for a start-up employing a large number of university graduates (some of them with very prestigious Computer Science degrees), I often take reports of tech problems at face value - these are smart people, surely they know what they're doing. Today's story involves one of those very smart people, the head of our Machine Learning team. The team sits at a 4-wide row of desks.\n\nCharacters:  \n$MLH - Machine Learning team head  \n$MLC1 and $MLC2 - his colleagues on the same team  \n$OM - shared office company manager  \n$me\n\nFriday midday, $MLH walks over to my desk:\n\n&gt;$MLH: Hey $me, we have some power problems here, my screen and PC have switched off three times today. So has $MLC1's.  \n&gt;$me: huh, that's odd, maybe it's the power to your desks.\n\nOur office is in a startup incubator, so the office is managed by another company. I wander over and collar $OM, then go back to where $MLH sits.\n\n&gt;$MLH: I'm working from my laptop because it's impossible to use my desktop. $MLC1, your screen has been going off too, right?  \n&gt;$MLC1: yeah, at exactly the same time  \n&gt;$me: okay, I'm assuming the floor box, $MLC2 has yours gone off too?  \n&gt;$MLC2: nope, it's been fine.\n\nI look at how the desks are arranged. There are two floor boxes, one per two desks, positioned right at the front edges of the desks, almost where the chairs would be. There's a single cable going through the cover of the one between $MLH and $MLC1's desks. $MLH opens the lid while $OM and I watch.\n\n&gt;$MLH: I don't think that...\n\nHe presses down on the plug. It seats more firmly into the socket.\n\n&gt;$MLH: ...oh.  \n&gt;$me to $OM: so, how many Computer Science people* does it take to change a light bulb...?\n\n$OM just laughs and walks off.\n\n*referring to myself as well because I also have a CS degree and didn't check this first...\n\nEdit: couple of details, formatting.",
        "created_utc": 1528046703,
        "upvote_ratio": ""
    },
    {
        "title": "If you have a gtx 970 and overclock it, please share the overclock configuration",
        "author": "Osvislto",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o90pq/if_you_have_a_gtx_970_and_overclock_it_please/",
        "text": "[removed]",
        "created_utc": 1528038054,
        "upvote_ratio": ""
    },
    {
        "title": "We have an ongoing list of silly things customers say to us.. Enjoy (Mostly Apple Products)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o7yd6/we_have_an_ongoing_list_of_silly_things_customers/",
        "text": "[removed]",
        "created_utc": 1528025407,
        "upvote_ratio": ""
    },
    {
        "title": "My nemesis, TerrorByte!",
        "author": "MordecaiKravits",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o6ckk/my_nemesis_terrorbyte/",
        "text": "[removed]",
        "created_utc": 1528001475,
        "upvote_ratio": ""
    },
    {
        "title": "Office won't start",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o5wpi/office_wont_start/",
        "text": "I got a call earlier this week, a customer can't get Outlook - or any Office program - to open. On top of that, his keyboard doesn't work. And my remote access sees him as offline. \n\nI show up, all the way across town, and start troubleshooting. Finally get the keyboard working and get my remote access reinstalled. I dig into the Google and figure out that the Microsoft Office Click to Run service is disabled; get that re-enabled and call it good.\n\nUntil the next day. His keyboard still works but office won't open. Click to Run is disabled again. My remote access is disabled again. I get him to download my remote and get me in, re-enable Click to Run and help him get Outlook working right.\n\nAnd then Friday comes. Same fricking deal. I'm ticked. He says \"screw it\" and leaves for the day. I show up after lunch and get to work. I'm figuring on writing a script to enable the service and start it periodically. And then I notice that, after I start the service, a little pop-up shows up about \"Publisher has woken up.\" And it's attached to Avast Cleanup Premium. And then I notice that the freaking Click to Run process is included in the list of items this wonderful piece of engineering is \"putting to sleep.\"\n\nYeah, a clean up program was killing Office. I'm trying to talk him into a change before he renews later this month. ",
        "created_utc": 1527996512,
        "upvote_ratio": ""
    },
    {
        "title": "Repaving the road does not change the street signs!",
        "author": "techtornado",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o5iyi/repaving_the_road_does_not_change_the_street_signs/",
        "text": "Such an odd phrase you might say, it'll make sense in a minute and you have to at least call someone to fix the signs...\n\nHere's a short story that affected many people, a migration, and a lot of lost communication.\n\n$Me/Tornado \\- Whirlwind computing associate, taking problems, solving names with an uncanny resemblance to James Bond...\n\n$EVP \\- Boss of Email/Server team, holds lots of meetings.\n\n$ServerTeam \\- A unique mixture of isolated groups.\n\nThe story unfolds with $EmailAdmin migrating the ShinyFish\\-Anti\\-Spam VM to a new cluster and assigns a different network/hostname without telling anyone.\n\nA few minutes later $VMAdmin shuts down a production database that another team was working on to integrate with anti\\-spam...\n\nThe screams of FailMail were loud and long, watchdog alerting was partially broken, device to CloudMail communication was pretty much being routed to /dev/null and the troubleshooting could have been solved much faster if they just had talked.\n\n$Me \\- A few mouse clicks later, a DNS record change, and presto! Mail is happy once again.\n\nNeedless to say, many meetings were held to address the lack of communication and to get everyone synchronized again.\n\nWith a new adventure, that is how you get the quote, repaving the road does not change the signs.\n\nTL;DR \\- The problem was both DNS and the abuse of DNS because it was only doing what it was configured to do, point all mail traffic down the black hole that the server team opened up.",
        "created_utc": 1527992460,
        "upvote_ratio": ""
    },
    {
        "title": "Making incoming data error free is good, but not to them!",
        "author": "jeffrey_f",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o3qc9/making_incoming_data_error_free_is_good_but_not/",
        "text": "long story shortened for your comfort:\n\nSeveral years ago working in IT to automate certain things, especially when someone is sick of doing mundane tasks.\n\nGet a multi-megabyte data file, process it and put the data into a production file on the main system.  Easy enough, it's a CSV file!!\n\nThe data would have keying errors periodically, but when you try to work what should be a numeric, the program will crash.\n\nIt was always 1 of 2 fields in only 1 or two records that had a non-numeric, but would always contain the numeric itself.\n\nCreated a program to strip the non-numeric characters from the fields pre-process of the file.\n\nGot a call from the group that asked us to automate this process wondering why we no longer had any errors.  When told that we fixed the data before the file was processed, they got very frustrated with us and we were forced to remove the fix so the program would fail, almost daily.\n\nGuess they wanted something to do during the day",
        "created_utc": 1527974774,
        "upvote_ratio": ""
    },
    {
        "title": "Three stories",
        "author": "meoka2368",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8o0xvw/three_stories/",
        "text": "[removed]",
        "created_utc": 1527950601,
        "upvote_ratio": ""
    },
    {
        "title": "Reading manuals can be hard",
        "author": "chill0r",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nzw98/reading_manuals_can_be_hard/",
        "text": "Short info about me:  \nLTL, FTP. I work in mechanical engineering (CNC milling centres). Part of my job is to provide support for our own personal in case they are stuck on some electrical or software problem.  \nNormally I don't speak to the customers, instead I talk to our stuff on site.  \n\nAll data is anonymized, unrelated parts stripped and written just out of what I could remember.  \n\n*$ft* = field technican (in this case a mechanic guy which had additional training to do basic electrical stuff too)  \n*$cw* = coworker which is doing the same job as I do  \n*$me* = well... me  \n\n*$ft* is at *$customer* for some maintainance and (minor) repairs.  \n*$me* wasn't involved with the case beforehand, it was handled by *$cw*\n\n&gt; $cw: Hey *$me*. I've got a call from *$ft* which has a short question about something. Could you handle that for me?  \n($cw and $me are specialized in differend fields so it's not uncommon to pass a call)  \n&gt; $me: Sure, can you tell me what's the problem before I call him back?  \n&gt; $cw: Well I'm not quite sure. He finished the maintainance at *$customer* and now has some problems pairing the new devices he had to replace.\n\nThat's strange...  \nFor stuff that's not as easy as \"plug the plug into the socket which it fits into and your job's done\" all field techs got manuals they have to follow.  \nNormally if you follow these it's as simple as follow step 1 to 4, drink a coffee and drive home.  \n\nOn telephone with *$ft*  \n&gt; $me: Hello *$ft*, *$me* here. I got told you got a problem with pairing the $part you replaced.  \n&gt; $me: I know that can be tricky sometimes. Have you followed the manual?  \n&gt; $ft: Hey. Yeah I did exactly like it was written there. Just replaced the thing, plugged it in and instead of the paring button being displayed on the screen it's throwing errors I don't know...  \n&gt; $me: Ok. Just before we continue. Are you sure you connected it to the right ports?. There are 2 ports on it. One is labeled with 1, the other with 1.1.  \n&gt; $me: On the cables there's 1 and 1.1 printed too so please check it.  \n\nIt's the most common problem with electric stuff and checking the easy stuff first is always a good idea.  \n\n&gt; $ft: Uuuuh... Not sure, give me a sec...  \n*Insert sounds of stuff falling and swearing by $ft coming through the phone line*  \n&gt; $ft: Ok I checked it. It's as written as on my manual. Cable 1 goes to port 1.1 and cable 1.1 goes to port 1  \n&gt; $me: ???  \n&gt; $me: That's not how it works. 1 should be inserted into 1, 1.1 into 1.1.  \n&gt; $ft: No... It clearly states on page 2 of the manual that it needs to be connected that way.  \n\nI'm quite sure that's not the case. Partly because I wrote that one myself.  \n\n&gt; $me: Ok... Could you read the part printed in red on that page for me please?  \n&gt; $ft: *starts reading loud* \"Warning: Make sure to NOT plug cable 1 into port 1.1 or cable 1.1 into port 1. If you do so unexpected errors will show up or the part could be damaged.\"  \n&gt; $me: ...  \n&gt; $ft: ...  \n&gt; $ft: I guess I found the problem  \n\nAnd I guess I know who's going to pay my next coffee\n\n",
        "created_utc": 1527938105,
        "upvote_ratio": ""
    },
    {
        "title": "We need a different provider for each services we require",
        "author": "AtarukA",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nzs8y/we_need_a_different_provider_for_each_services_we/",
        "text": "[removed]",
        "created_utc": 1527936476,
        "upvote_ratio": ""
    },
    {
        "title": "MCAfee Endpoint installation Error",
        "author": "raincomputer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ny75d/mcafee_endpoint_installation_error/",
        "text": "[removed]",
        "created_utc": 1527913407,
        "upvote_ratio": ""
    },
    {
        "title": "Just because lights are on does not mean it’s getting power",
        "author": "TraitorousTraveler",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nw6aw/just_because_lights_are_on_does_not_mean_its/",
        "text": "Pre-text: I am not your typical tech support. I am an electrical engineer specializing in induction furnaces. These are the items that melt metals down to liquid for pouring into molds. \n\nSo this week I’m in Chicago, headed home after solving a problem and learning an important lesson. Just because lights are on, does not mean the unit is receiving power. \n\nTuesday I get an emergency call around 2 pm est. A client in Chicago area is down and wants me out there yesterday. Before I go, I go to our aftermarket sales and ask “Does client X have all the spare parts I would need?”  Yup. They do. Awesome. \n\nI fly out that night and get there in the morning. Now before I go further, I need to give some background. Our power supplies use a proprietary unit that I can’t name without revealing my company. Let’s just call it PSPLC. Because that’s what it is. It is a proprietary PLC designed to watch, control, and fire thyristors up to 1.2 MHz. We can’t use a standard PLC as it’s refresh rates are not fast enough. To give you an idea, this particular unit was designed in the early 90s. \n\nSo I get in Tuesday morning and discover the problem is that the PSPLC is not working. It doesn’t start. At all. The unit powers up. Gives a quick BUS Error. Then goes into another language saying what translates to Self Test. \n\nNice. We’ll Bus error would mean that one or more of PSPLC cards aren’t communicating. We will start there. I have the client grab all his spares and I replace these cards one by one into the rack. No change. Spare CPU, spare IO cards, spare rectifier and inverter cards. No change. Ok. It has to be the rack then. \n\nThey don’t have a spare rack. Fuck. \n\nWe don’t have a rack in stock. Double fuck. \n\nWe have a backplane in stock. Bingo. It has the wrong transformers, but hey, my colleagues can solder and make it work.  They do that and ship it out next day. I get to go to the hotel and wait for it to arrive the next day. Awesome, an afternoon off. I’m convinced it’s the backplane. After all, it’s the only thing that hasn’t been changed and it’s the pathway between the cards. Maybe a trace blew. I’ve seen it before. This will make for an extra day maybe, but I should still be home in time for my family event this weekend. \n\nI go in Thursday morning and the parts there at roughly 8 am. Perfect. We take the rack out and replace the backplane. Install the original cards. Takes 2 hours but by 10 AM we’re ready for a power test. The unthinkable happens. Same error. Fuuuuuuuu\n\nI get out my laptop and plug in my usb to 232 converter and my null modem cable. I disconnect the customer interface module and connect manually to the PSPLC. I open up DOS. Yes. DOS. In 2018. Remember how I said this was designed in the early 90s?\n\nI type in the command to connect. I connect. Yay. Immediately see “BUS Time out... error 016.019.001”.\n\nOk so more information. I look up in our manuals and it tells me nothing I don’t know. It’s a Error with cards communicating to each other. Ok. 016 is the error number. Troubleshooting guide says to replace all the cards one by one. If not, replace the rack. Great. Already did that. 019 means it’s a problem with the inverter card for inverter 2.\n\nWait. \n\nThis is a single PS and furnace unit. It doesn’t have an inverter 2.\n\nWhat?\n\nI check the jumpers on the backplane. It’s set up for our standard one ps and one furnace combination. \n\nMaybe the error log can give me some more information. I use the DOS commands to upload the error log from the PSPLC to my computer. I then use the command to load it into a notepad file. I open it up and...\n\nGibberish. \n\nFucking Gibberish. \n\nWhat?\n\nAt my wits end, I call my colleagues who also do this. They have no idea what could cause this. I have done everything they would have. Not only that, but Jake (name changed for anonymity) tested the backplane in our simulator yesterday and it worked there. \n\nTogether we grasp at straws. They give me a few ideas and I get back to the unit.\n\nI take their spare cards one by one replacing them with the new backplane. Maybe they both went at the same time? This time each time connecting with my laptop. Bus timeout. 016.019.001. Every damn time. \n\nI grab extra cards from other units. They won’t be able to run with these cards, but they should be able to get past the error. 016.019.001. Every. Damn. Card. \n\nMaybe the units not grounded correctly. I grab a meter. Nope. Both the rack and the backplane measure shorted to ground. \n\nMaybe the unit has external issues. Reaching, but if it eliminates the possibility, I’ll try it. I disconnect every IO connection besides the input power and my laptop. Same. Fucking. Error. \n\nI recheck the jumpers in back and remove the sub print board that’s for the second rectifier. It has no effect on coms, but I’m already grasping at straws. Same. Error. \n\nAt this point I email my colleagues and boss. I call my boss up and tell him everything I’ve done. Even he’s out of ideas. He forwards my email to his superiors and instructs me to put all the spare cards in at the same time. Effectively building them a new PSPLC.\n\nI do. And to no surprise I’m greeted with the same error. I call him back and he authorizes my colleagues to send a complete PSPLC from scratch. A $40,000 unit. Damn. \n\nI go to the client. I have no answers to give him. But it’s the end of the day Thursday. I have to make it back for my event Saturday. I tell the second shift manager my situation and he can’t make that call. His boss told him I don’t leave til it’s fixed. I tell my boss and he has me come in Friday and plan the last flight for Friday. I’ll be home for Saturday and he’s flying Jake out to replace me. Nice. I don’t like leaving without fixing a problem though. Always makes me feel horrible. \n\nI schedule my flight out for 6:30 PM. I go in at 7 AM and talk to the maintenance managers boss. I tell him the plan and he’s surprisingly ok with it. The tracking for the PSPLC indicates 9 am arrival. Awesome. I wait around a couple hours and it’s in maintenance at 10. Ok. Running late.\n\nIt’s our simulator PSPLC. I am cracking up. Every card has SIM and Property of (our company) written on it. Whatever. Atleast I know that this PSPLC works and has worked for months. \n\nWe install it into the unit. The only wires I hook up are the 120V control power input, ground wire, and my PC. I turn it on. \n\nSame. Damn. Error. \n\nI call up Jake. “It just worked in the office yesterday! I made it!”\n\nWhat haven’t I done? How do I go through 4 CPUs, 3 racks, and 4 sets of other cards and none work?\n\nEveryone’s at a loss. It’s 11 am and I have their maintenance personnel grab a spare interface module. I don’t think it’s the interface. I’ve used 2 different cables and a Customer interface and my laptop, but it’s the only thing we haven’t done and I can keep him working while I think of another explanation. \n\nThen it hits me. The control power. Sure, the normal PLC powers. And the control power everywhere else works. But it’s the only common point I haven’t checked. \n\nI grab my meter and measure the control power directly into the PSPLC. 75VAC. \n\nBoom. \n\nEnough to turn on the rail and the unit. Not enough to function. I laugh. It’s 11 AM. I have to leave at 3. Jake’s Flight is in half an hour. I go to the client and tell him I found it. He laughs. He still wants jake to come out. If only to test all the spare parts to make sure they’re all good. \n\nNow the fun part. Why is control power 120 every where else but not here?\n\nI get the drawing out. It’s from another division of our company in a different country. But I can read it. I trace it back and see that the PSPLC has its own transformer. It has its own dedicated 120V stepdown transformer. What? Who’s idea was this? Why?  I’ve never seen this in all our other units. I call Jake and our other techs. They’ve never seen it either. \n\nWhatever. I measure the high voltage just in case. The transformer is getting the 440V input it should be. It’s just outputting 75V. \n\nWe talk to the parts guys and see if they have it in stock. It’s noon by the time we find out. They do! There is a god! (maybe.)\n\nMaintenance grabs the spare and replaces the transformer. We turn it on and confirm it outputs 122V. Perfect!\n\nIt’s 1 pm. We turn hook up the unit to the PSPLC. It fucking works!\n\nWe install their rack again. It works. No errors. I’m dancing.\n\nBy 2 PM, I’m out the door. I’m driving the hour to ORD. Headed home in time for my flight, feeling the bliss of being victorious. \n\nI call up my boss. I tell him the news. All he asks me is “How the hell does a transformer go from putting out 120V to 75V? Either they put out 0 or the correct ratio... and who decided to give the PSPLC a dedicated transformer?”\n\nWhen I tell him what division all he says is “Of course...”\n\nTL:DR - Just because the lights are on, doesn’t mean that the power supply is working.",
        "created_utc": 1527893071,
        "upvote_ratio": ""
    },
    {
        "title": "You need to hang up with me right now, drive to your bank, and pray to whatever god you believe in. OR. Password diversity. How changing which passwords are for what can prevent total collapse of your life.",
        "author": "TheLightningCount1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nvg7u/you_need_to_hang_up_with_me_right_now_drive_to/",
        "text": "Got a boring call from a user today that turned very very bad very very quickly. I... I will just play it out for you guys. \n\n&gt; $me = The television news anchor from the last episode of dinosaurs. \n\n&gt; $User = User\n\n&gt; $Me - Thank you for calling IT.\n\n&gt; $User - I think my password has been hacked. \n\n&gt; $ME - (Probably hasnt but...) What do you mean? Is it not allowing you to log in?\n\n&gt; $User - No I can log in, and everything is there. Its not my account with *our company* its with everything else. \n\n&gt; $ME - *Eye twitch* What do you mean by everything?\n\n&gt; $User - Well the password I use for *our company* is the same password I use for Bookface, for twitter, for youtube, for google, for basically everything. \n\n&gt; $ME - Why do you think they have been compromised. \n\n&gt; $User - Well for one my profile pic for facebook was changed to a christmas tree. I read online that this is a common tactic that hackers use.\n\n&gt; $me - Umm yeah maybe like 10 years ago before 2 factor auth. Did you get a phone text with the code in it?\n\n&gt; $User - No I never added my phone to bookface. That goes to my Yahoo email. \n\n&gt; $Me - Which uses the same password and username as your facebook?\n\n&gt; $user - Yes. \n\n&gt; $Me - Do you use the 2 factor auth with yahoo mail as well?\n\n&gt; $User - Yes. Now THAT goes to my phone. I have the yahoo mail app. It popped up four times yesterday so I just hit yes on it. \n\n&gt; $Me - (That sinking feeling in my stomach was either Taco Bell, or the sense of dread that comes from my next question.) Do umm... do you use the same password for your bank accounts as you do facebook, yahoo, youtube and myspace?\n\nLong silence as I hear her frantically log in to her phone app for her bank. \n\nEven longer silence. \n\n&gt; $User - I cant log into my account for my bank. I dont know whats wrong. \n\n&gt; $Me - I hope you have *blue bank* and not *patriotic bank* or *red bank* because the latter 2 are hell for recovering fraudulent withdraws. Also hope you had less than 2k in your account. Otherwise you may be screwed. \n\nLong silence. \n\n&gt; $Me - It is currently 3:30 your time. You have an hour and a half to talk to a person. You need to hang up with me now, drive to your bank, and probably start praying to whichever higher power you believe in. For now I am locking your *our company* account. \n\n&gt; $User - Do you think it is that important?\n\n&gt; $Me - There is a decent chance that your bank account has been drained. I am not the person you need to be talking to. \n\nShe thanked me for my time and left. I submitted a ticket to infosec for the possible breach. They checked and confirmed that only her IP accessed it, also stated that her laptop showed no signs of intrusion. So we lucked out on that one. \n\nAlmost felt sorry for her on this. Almost. \n\n",
        "created_utc": 1527887003,
        "upvote_ratio": ""
    },
    {
        "title": "The tale of Sudo Man",
        "author": "GarretTheGrey",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nv866/the_tale_of_sudo_man/",
        "text": "So this isn't the usual tale that we get here in dialogue format.\n\nAn old coworker/friend called me today asking where to get some keystone jacks and I remembered why he got the name Sudo Man.\n\nSo our network was simple AD DNS DHCP stuff with the usual Cisco routers, load balancer etc etc. We THOUGHT we had everything under check, until this guy was caught doing some nefarious things. Someone from IT caught up with him when they checked the users folder for some other reason and realized what was happening. after confronting him, he confessed. We knew he was technically enclined because he created an excel sheet that replaced him, while he spectated Dota matches all day. We didn't bother to block Steam, as we had the bandwidth to spare, and we trusted him enough. Well that trust was gone after we caught him. \n\nThis guy booted into Kali and changed the local admin password.\n\nLogged into local admin and created his own local admin account.\n\nLogged into his new account and moved whatever files he needed.\n\nInstalled whatever he wanted.\n\nUsed angry ip scanner to get a feel of our IP plan.\n\nSquatted on a static IP he figured nobody would use, outside of the DHCP pool. from a simple ipconfig, he got the gateway. He also put 4.2.2.1 and 4.2.2.2 as DNS to bypass us.\n\nOur radius server was only used for wifi to allow users to use their domain creds to get onto the main vlan, so on wired, it was free reign. \n\nAnyway, when we caught up to him, we re-imaged his pc and blocked steam. We also set a bios password on all machines, and when users asked why, we said to ask Sudo Man.\n\nHe was a bit mad, and said he'll find another way around it. Was hoping it didn't come to that. See, one of the things we backed up was his excel file. The one that could render him useless (He was a  petroleum engineer btw). We told him that the machine stays the same or his boss gets a copy of it. \n\nWe also thanked him for the internal audit, as his shenanigans got the IT manager to finally pay for a 3rd party security audit. He made the company a better place.\n\n\nHis name stuck though, as the girls from Procurement heard us calling him that, and followed suit, without even knowing what Sudo means.\n\n\nWe still keep in touch and there are no hard feelings. He took the name as a badge of honor after a while, and we appreciated what he did, as we all learned a lesson that week.\n\n\n",
        "created_utc": 1527885224,
        "upvote_ratio": ""
    },
    {
        "title": "The willing, and life affirming client",
        "author": "Boxed_Singularity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nv62l/the_willing_and_life_affirming_client/",
        "text": "Working in tech support is sometimes *very* frustrating. Other times, it can really help you realize why you're in this field.\n\nMy co\\-worker tells me of this server not willing to start at all, and a clueless client on the other side. The only issue is, we only support software that we put out, not hardware on the end\\-user side.\n\nI sigh, and wave at him to transfer me the call.\n\n&gt;BxS: Hello, This is Boxed\\_Singularity. How may I help you today?  \n&gt;  \n&gt;$Client: My server won't turn on at all, it doesn't make any noise and the fans don't come on.\n\nMy first thought at this moment was that it was a bad PSU, and I make the statement that we only support our released software, and that any hardware is not under our purview.\n\n&gt;$Client: Then what do we pay you for?  \n&gt;  \n&gt;BxS: If there are any irregularities in our software, if they don't start up or anything like that \\-\\- then we are fully able to walk you through most problems.\n\nBy this time, the customer is pleading with me \\-\\- as this is one of their necessary things for their business, ties into their POS \\(Point of sale\\), and to their other computers. After a little, I give after I find out he's just a floor worker and not even a manager, and he's the one getting yelled at.\n\n&gt;BxS: Alright, I want you to open up the case of the server, and I'm going to walk you through a couple of things. Now, is your server a Dell, HP, or IBM?  \n&gt;  \n&gt;$Client: HP. But I'm not too good with computers. Do I really have to do this? Can we just try turning it on a couple more times  \n&gt;  \n&gt;BxS: If there's something that's stopped it before, it'll most likely stop it the more we try. Try plugging it in somewhere else, and other than that \\-\\- plug a monitor up to it so you can see if it boots.  \n&gt;  \n&gt;$Client: I just don't know a lot, and I don't want to break anything  \n&gt;  \n&gt;BxS: Don't worry, with how you're already moving along \\-\\- you'll be a pro in no time.\n\nI usually say that to apprehensive clients, hoping it eases them.\n\nAt this point, I figure I'll just walk him through a couple things with the PSU because that sounded like the culprit\n\n&gt;BxS: Did that do anything when you plugged in the computer?  \n&gt;  \n&gt;$Client: Well, there's this light on the motherboard\n\nWish I'd known there was a light on this whole time, so now I walk him through taking out the ram and I ask him to turn it on \\-\\- listening and praying to hear beeping.\n\nIt beeps. So that's perfect, I figure it's either a bad stick, or slot \\-\\- so I have him plug one stick in, and it stops beeping. I have him take it out, and plug in the next one in the exact same spot, until 3 don't work there. I have him move it to the next port, and it starts to turn on. I hear him yell with excitement. \n\n&gt;BxS: Don't party too hard now, we're going to plug in the rest of the RAM except in the slot that isn't working.  \n&gt;  \n&gt;$Client: Alright, alright \\- let's get this done and I thank you so much.\n\nFor a moment while he was plugging them in, I was really hoping it was just the one slot that wasn't working.\n\nHe presses the button, and it's starting up. I tell him that the board will have to be replaced in the future, but other than that it fixed the problem for now.\n\nThe amount of thanks I received from him is something I look back from this day.",
        "created_utc": 1527884764,
        "upvote_ratio": ""
    },
    {
        "title": "You mean we need employees to work automated computers?",
        "author": "Boxed_Singularity",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nuz9o/you_mean_we_need_employees_to_work_automated/",
        "text": "I haven't posted in a while, but looking back over old posts \\-\\- I thought it would be fun to share another old story of mine.\n\nIt all starts back to when I was an hourly worker, working for the \"Little Boss^(TM)\" \\(The CEO's original supervisor/manager for IT\\)\n\nI do not know where Little Boss^(TM) came from, but he was in charge of handling our servers \\(Generation 8 dell I believe\\), we handled data storage and network setup in the IT dept. as well as maintaining equipment that was on the office floor. Anytime new user credentials were needed, Little Boss^(TM) would have one of us do it, and give us his monthly random password to log in with his credentials.\n\nEventually I began to make a name for myself with Little Boss^(TM), and anything he needed done \\-\\- I'd be the first on the spot. Anything dealing with the servers, sensitive data backup, and lastly working on the CEO's \\(AKA $BigBoss\\) computer.\n\nOne thing I hadn't realized was that I wasn't being credited with any of my work, and since everything was running so smoothly, all of us in IT were sitting around \\-\\- tinkering with computers, fixing them when parts would arrive \\(slowly building our parts stockpile\\). At one point, $BigBoss determines that us sitting means cutbacks are in order. The supervisor adjusts our schedules accordingly. I was ending up working a meager 8\\-16 hours, and getting a supplemental job until I could find a new main one.\n\nAfter about 3 months of this, $BigBoss begins to notice more errors piling up \\-\\- so we're called in more and more until finally we're pulling near doubles everytime we come in.\n\nThen, all of our services are blocked out \\-\\- no computer can access our main server. It can ping \\-\\- but for some odd reason, nothing works. I restart our workstation services to connect to the server \\-\\- but they're not working at all \\-\\- stuck loading infinitely. I use Little Boss^(TM)'s monthly random password \\(which he had taped to the under side of his desk, being 20\\-30 characters in length\\) on the main server and find out the problem; We'd set up tasks to backup any data on a regular basis. But it was was always deleted in person to ensure copying \"sensitive data\" completed, and deleting what wasn't necessary.\n\nOur main database storage was reading full.\n\nI didn't understand why it was full, as any files we had could easily be compressed and take up bare nothing on it.\n\nLittle Boss^(TM) had changed the task to begin making database copies of itself on its own drive to ensure copying completed, which was no issue at first. Until it began recursively making a backup of the backup, and all files on the drive.\n\n$BigBoss comes over and sees me working on the computer and asks very sternly \"What do you think you're doing?\", and I inform him that we'd had too much storage used. He sees me backup the old backups to long\\-term storage \\(and I sorted later\\), delete the files, restart the server process \\-\\- and in no less than five minutes, screens start loading up and I feel content with life.\n\nApparently I'd left a big enough impression that I was put back on full time hours. While I was happy with life, my previous stories should well enough explain what I was about to get myself into.\n\nEdit: tl;dr; Supervisor sets up copy task for whole drive and it continues until it can't anymore",
        "created_utc": 1527883269,
        "upvote_ratio": ""
    },
    {
        "title": "Hunting for a tech named \"Mike\"",
        "author": "Disaster_Plan",
        "url": "https://www.reddit.com/r/TalesFromRetail/comments/8no93t/hunting_for_a_tech_named_mike/",
        "text": "",
        "created_utc": 1527882290,
        "upvote_ratio": ""
    },
    {
        "title": "Even without specifics, you can all relate to this, right?",
        "author": "puppetmaster2501",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nuhk0/even_without_specifics_you_can_all_relate_to_this/",
        "text": "**Client**: \"We have this problem, and we've already started on an idea of how to solve it that is extremely complex and risky. Can you help?\"  \n  \n**Me**: \"You're right, that does sound complex and risky. Fortunately, there is an **Easy Way** to do this, that will 100% get you what you want and save you time, too. Here's how we can do it the easy way...\"  \n  \n**Client**: \"Interesting. That would make things easier, wouldn't it? Anyway, about our plan, can you help? I'm just so worried about how risky this is, and the more I think of it, I'm not even sure if this one aspect of it is even possible because we no longer have X, Y or Z that we will need.\"  \n  \n**Me**: \"I agree, if that's the case, then that might actually be impossible. Several of our clients do this the **Easy Way**, which will conveniently sidestep that entire aspect of today's problem. I can assist you with getting this started and we can schedule to do this with your team as soon as you're ready.   \n  \n**Client**: \"The problems we are facing doing this our way are just so daunting, I'm not sure how to proceed.\"  \n  \n**Me**: *SCREAMING INTERNALLY* JUST LISTEN TO ME AND LET ME HELP YOU I'LL EVEN DO IT ALL FOR YOU PLEASE PLEASE AHHHHHHHHHHHHHH",
        "created_utc": 1527879497,
        "upvote_ratio": ""
    },
    {
        "title": "Ticketception or How I Learned to Stop Asking Why the Service Desk Creates Tickets",
        "author": "Tier3Ginger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ntib8/ticketception_or_how_i_learned_to_stop_asking_why/",
        "text": "The usual First Time Poster, long time lurker on my primary account. I created this account because it's way too easy to figure out where I work on my primary account since I am involved in a local subreddit.\n\nFor background, I am contractor working for a company \\(I will call SupCorp\\) contracted to a government agency I will call the Department of HelpME! \\(Aka DoH!\\) that provides application support and development. I am considered an \"Solutions Analyst\" which is  fancy way of saying I work tier 3 tech support. As such, we do not create tickets. All tickets must go through the main DoH!  service call center either via email or phone. \n\nCurrently, SupCorp is in the middle of deploying a major upgrade to java system wide to prepare for an update of one of the DoH!'s applications. Because they are running multiple versions of Windows, each version has their own service ticket to track deployment. We are currently in user testing on this deployment, with release scheduled this weekend. The deadline for this testing was last Friday. Being a good little drone, I sent out an email to the head of testing \"Abby\" asking if user testing was complete on the three tickets. I included the numbers and what system it was for reference. \n\nAbby replied they were still testing, and copied the service call center on the email. Ten minutes later, my inbox pings as I get a notification that I have a new ticket assigned to me. I look at the ticket and it was a literal copy paste of my email to Abby.  \n\nThinking there must be more going on, I called the service center employee, \"Cher\" \\(because she is clueless.\\)\n\nMe: Hey Cher, I just got service center ticket 666, but it's just a list of tickets 555, 554, and 553. I think Abby may have copied you just so you can update the status on those tickets.\n\nCher: If we get an email, we are supposed to create a ticket. \n\nMe: Even if that email isn't a service request? \n\nCher: Every email gets a ticket. \n\nMe: So what should I do with this ticket? Do I need to send it back to you so you can use it to document something?  \n\nCher: I don't know. Work the ticket.\n\nMe: But isn't it a duplicate, essentially?\n\nCher: I just create tickets. I don't know.\n\nI hung up the phone in a state of shock and confusion. I've worked with other service center employees and they generally don't open a ticket unless it is a request, especially if the ticket references other tickets. They just update the ticket. I ended up marking the new one as a duplicate and sending it back to the service desk manager.  I looked in the ticket queue and there were three tickets created based on what looked like spam email messages.\n\nTL/DR: I'm starting to suspect that I will get a service center ticket for viagra. ",
        "created_utc": 1527872241,
        "upvote_ratio": ""
    },
    {
        "title": "How to increase sound quality in windows /7/8/10",
        "author": "vermaprateekrising",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ntfbx/how_to_increase_sound_quality_in_windows_7810/",
        "text": "[removed]",
        "created_utc": 1527871584,
        "upvote_ratio": ""
    },
    {
        "title": "Quit asking questions and do what I asked you.",
        "author": "captain554",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nt4kw/quit_asking_questions_and_do_what_i_asked_you/",
        "text": "[removed]",
        "created_utc": 1527869344,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not a wizard, aunty...",
        "author": "Fourrell",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nset4/im_not_a_wizard_aunty/",
        "text": "Hi TFTS, I've been lurking this sub for about 3 weeks now and I thought I would share this gem that happened this afternoon.  \n\nPlease forgive formatting errors, first time poster.  \n\n**Disclaimer:**\nI do not work in tech support, however (as it is with most people with any computer related degree) my family has made me the go-to guy for any problems involving any piece of tech.  \n\n**People Involved:**  \n**$me**: myself  \n**$A**: Close friend of the family. Thinks she knows better than you even though she's asking you for help (refer to her as aunty since i'm from an african home and we call everybody aunty or uncle)  \n**$Mum**: My mum  \n\n**Context:**  \nI had just finished work for the day, and being a Friday I decided to visit my mum before I headed home. Pull up to the house, turns out a close family friend ($A) is there with her. 2 minutes after I walk in, the following dialogue takes place: \n\n&gt;$Mum: $me your aunty has been having problems with her USB, can you come and see if you can help her?  \n\nKeep in mind that I had recently helped $Mum recover a deleted file from her USB, so when $A mentioned her USB problem $Mum immediately told her I knew how to recover files.\n\n&gt;$Me: Sure what's the problem  \n\n&gt;$A: Okay so last week I lost my USB somewhere, but I have a lot of important documents on there and I want you to get it back for me  \n\n&gt;$Me: Oh, get back the USB? *(at this point I'm already confused because how am I supposed to find a USB that she lost \"somewhere\")*  \n\n&gt;$A: No I just want the documents, they're all very important  \n\n&gt;$Me: So you want me to get your files back, but you don't have the USB *(Finally processing what she's asking for)*  \n\n&gt;$A: Yes  \n\n&gt;$Me: Aunty I need the USB to be able to get your documents since they're not stored anywhere else  \n\n&gt;$A: No you're not listening. The USB is lost, I just want the documents that were on the USB. *(turns to $Mum and says \"These children don't listen well\" in my language)*  \n\n&gt;$Mum: But I thought you had the USB with you, he used my USB when when he brought back the file I deleted  \n\n&gt;$Me: It's impossible to get back your files without the drive, it doesn't work like that...  \n\n&gt;$A: *(Interrupts me)* Instead of you to just say you don't know how to do it. What did they teach you at the university you went to?  \n\n&gt;$Me: I'm not a wizard aunty, I can't magically  make the files appear  \n\n&gt;$A: Later you will be acting like you know everything  *(Apparently me fixing people's problems that I never asked for equates to \"acting like I know everything\")*  \n\nAt this point I can feel the brain cells running away from me, and I just want to get out of this conversation\n\n&gt;$Me: I'm sorry, you're right. I haven't learnt how to do this yet.\n\nI walk towards the guest bedroom to figure out how my life got to this point and I can hear her laughing and saying to my mum in our language:\n\n&gt;$A: These kids don't know that no matter how much they think they know, there will always be some things we know better than them. After all when did they start using computers. (I'm 22 btw, but you would think I was 12 with the way she talks).\n\nMy poor mum tried once more to get her to see that I really did need the USB, but she wasn't budging.\n\nTL;DR: Aunt thinks files live in a magical universe and can be summoned at will by those who wield the magical IT degree",
        "created_utc": 1527864530,
        "upvote_ratio": ""
    },
    {
        "title": "Breeze mode",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ns8ke/breeze_mode/",
        "text": "So, for those who do not know, I am a tier 2 helpdesk rep for an ISP. \n\nToday, I received a ticket:\n\n&gt; \"Wants modem in breeze mode\"\n\nI call the Customer\n\n\nMe: *intro* So, I understand you want your modem in breeze mode?\n\n\nC: *sigh* No, bridge mode. I kept telling *helpdesk rep* that it was bridge mode but they told me **I** was wrong and it's breeze mode.\n\n\nMy shift started a few hours ago. Going to be a long day. \n\n\nEdit: I posted this yesterday. Mods had to approve it.",
        "created_utc": 1527862874,
        "upvote_ratio": ""
    },
    {
        "title": "Demons be gone!",
        "author": "danhmooney",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nrzkl/demons_be_gone/",
        "text": "Several years ago I worked for a public school district. Loved the job. It was a place with good people and a mostly a great work environment. \n\nAs with any workplace, some people are more stressed than others. It seemed only natural that one of the more stressful environments came from the special education department. \n\nOne one occasion a teacher came into my office in panic mode, nearly crying, because the computer that she needed for a parent meeting wasn’t coming on and time was running short before her meeting. A student had been on the PC that day and she was convinced that it was now FUBAR. She had checked all the cables to see if anything was loose. \n\nWe had hundreds of these old computers so i had seen just about every that could go wrong with them. On this particular model \\(an old IBM\\), occasionally the PSU would need to be reset. You could do this by flipping the switch on the back of it from 110 volts to 220 volts then back to 110. Then the computer would come up perfectly normal. \n\nI entered the room and sat down with the desperate teacher hovering over me, reached around to the back of the computer, checked the cable and flipped the switch. She did not see me flip it, just that i checked the power cable like she had done so many times before. \n\nKnowing that it would come on, i decided to have just a moment of fun. I put my hands together as if to pray, lowered my head and reached my hand out to top of the monitor. I convulsed just slightly and did what i can only describe as a Benny Hinn impersonation. Raised my head and hit the power button. \n\nThe PC clanked to life and the teacher’s mouth dropped nearly to the floor. I got up from the desk, faked being a little out of breath and just nodded to her. \n\nBTW, this was a small enough place that we all knew each other pretty well and i had a good working relationship with this teacher. So, when the story started to get out, I came clean about the actual issue and everyone including her got a good laugh out of it. \n\nTL;DR : I convinced a teach that I fixed her dead computer by the laying on of hands!!",
        "created_utc": 1527860711,
        "upvote_ratio": ""
    },
    {
        "title": "Do you not remember the psychic part of your interview?",
        "author": "darkkai3",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nr2qc/do_you_not_remember_the_psychic_part_of_your/",
        "text": "I don't work in tech support, but as a data processor who interacts regularly with sales people and account managers, answering some of their more...unusual questions.  \n\n\n\nMy interview for this company was a suprisingly simple one. \"Can you spot something amiss here?\" \"Can you follow these instructions?\" \"Are you able to tell what shape I've drawn on the left piece of paper in the next room?\" Pretty standard stuff.\n\n\n\nIt's a surprisingly frequent occurence to have jobs come back after they've gone to clients because they've changed their mind about something. It's almost as frequent that a sales person will come to my desk at 4:30pm asking why something's not been given to a client, when they CLEARLY asked for it...\n\n\n\nThe stars:  \n$Me: Data Assassin, consumer of bagels and lacking in psychic prowess.  \n$ESG (Expectant Sales Guy): Knows what they want, but not how to get it.  \n$ClientManager: Only gets passing mentions, but writes the specs I work from, and makes sure it's what sales want. Patience is their virtue.\n\n\n\n&gt; $ESG: Hey, $Me, I've looked at what went to $Client but it's missing a few things that are pretty integral to the contract.  \n&gt; $Me: I don't think I missed anything, let me bring up the request and you can point out what's missing.  \n  \nI promptly go to the job folder and bring up the processing modules and the spec.  \n  \n&gt; $Me: Ok, so P1 and P2 are initial processing relating to these parts of the spec, and P3 outputs like this part of the spec says.  \n&gt; $ESG: Where's the *completely unmentioned part*?  \n&gt; $Me: What?  \n&gt; $ESG: You've not included *completely unmentioned part*!  \n&gt; $Me: Nothing I've seen mentions that once... I mean, I could look at doing it, but it's usually a day or two of work.  \n&gt; $ESG: No! This has to go out today. I can't believe you've missed this out! They even confirmed the details in an email to me yesterday!  \n&gt; $Me: Was $ClientManager cc'd?  \n&gt; $ESG: No.  \n&gt; $Me: Did you send me or $ClientManager this email?  \n&gt; $ESG: No. You should have just known to do this.  \n  \nOh look, my eye twitch has returned!  \n  \n&gt; $Me: This requirement isn't even remotely standard for a job of this kind, we'd only do it if explicitly told to do so.  \n&gt; $ESG: Well it needs doing. They're unhappy it's missing.  \n&gt; $Me: I can take a look, but you'll need to send the details over in an email to me and the client manager. It won't be today though, as it takes hours to run. You'll nee...  \n&gt; $ESG (interrupting me):BUT IT HAS TO GO TODAY!  \n&gt; $Me: ...eed to tell the client there's a delay.  \n&gt; $ESG: WHAT AM I SUPPOSED TO TELL THEM?  \n  \n\"That you screwed up and expected everyone else to be psychic\" Oh wait, what I actually said was:  \n  \n&gt; $Me: Something about a communication error and the spec not being updated with a new requirement, and that we'll resupply to them ASAP.\n\n\n\n$ESG then proceeded to walk off mumbling something about incompetence and commission. I then got to work with this extra processing, which I actually managed to get sorted for lunch time the next day. $ClientManager passed the data to $Client, who thanked us for fixing the mistake and getting it over promptly.\n\n\n\nTurns out, the client wasn't expecting the file to be output until that day anyway. Were impressed they got it early, impressed that we noticed a mistake (admittedly after they received it), and impressed we still managed to get it completed on time. What the client doesn't know won't hurt them.\n\n\n\nGuess who got an award for \"getting a high profile job out on time\"? If you guessed the person who actually did the work, you're not jaded enough for corporate employment.",
        "created_utc": 1527851699,
        "upvote_ratio": ""
    },
    {
        "title": "OK, Not a problem.",
        "author": "showyerbewbs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nr272/ok_not_a_problem/",
        "text": "[removed]",
        "created_utc": 1527851541,
        "upvote_ratio": ""
    },
    {
        "title": "Over 12 Years in Tech and this is a first",
        "author": "Cryptic-Panther",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nqno6/over_12_years_in_tech_and_this_is_a_first/",
        "text": "Like the title says I've been doing Tech support for over 12 years as a job, but longer if you count doing stuff for friends &amp; family.\n\nI do Level 1 Help Desk for a huge US company and we have outside vendors who login via a company portal (Citrix) with these users it is usually account related stuff passwords and 2 Factor authentication setups.\n\n*U= User / M=Me*\n\nAfter the typical opening etc.\n\nU- I tired to login and it said my password was expired, i changed it and i still cannot login.\n\n*I checked his account and it doesn't show a password change\n(this is an issue that is still yet to be addressed by upper level)*\n\nM- If you tried to change it from the login page it doesn't actually change the password, you have to go to the website reset.Companyname.com\n\nU- OK so do i need to close this out?\n\nM- No just go up to the address bar and type that in.\n\nU- it isn't working\n\nM- are you typing it in the address bar at the top of the page?\n\nU- Yeah reset.abbreviationofcompanyname.com\n\nM- No it is (gives correct URL again)\n\nU- I'm getting page cannot be displayed\n\n*(at this point i'm wondering if the site is down, i check and it loads right up)*\n\nM- I just checked the site and it is up and running (I read the URL for the 5th time)\n\nU- Do i need WWW in front of reset@compnayname.com\n\nM- No and there is no @ in it, (I read the URL for what feels like the 10th time)\n\nU- I have put in (and he reads out what he typed) W E B\n\n*(I couldn't believe he typed in website.reset.companyname.com)*\n\nM- No you don't need to put in the word website. \n\nU- Yeah i guess i will have to talk to my local IT and try and sort this out.\n\nM- OK you have a great day.\n\n**If feel so bad for his local IT, but maybe they will post a story here.**\n",
        "created_utc": 1527846531,
        "upvote_ratio": ""
    },
    {
        "title": "The definition of Insanity",
        "author": "GreekNord",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nqn3j/the_definition_of_insanity/",
        "text": "RSA - great in theory, but when you start to include users... it crashes and explodes.  \nHere's another offshore story for you.   \nnot even entirely sure where this offshore person is even from.  \nName definitely says India, but the company is based in Japan, so not sure.  \nI get an email that somebody can't login through RSA.  \nOK, we get that a lot.  \nSome people forget PINs, some don't use it very often, some people can't type, etc.  \nSo I go in and see what the error messages are, and I see a ridiculous amount of login attempts.  \n36 failed login attempts.   \nThey were locked out after 5, which means they tried 31 more times after being told they were locked out.  \nAnd then they wonder why they can't get in.  \nWhat makes you think that 31 more times might do the trick?  \nSo I send him the info on what I found, and instructions for how to log in the right way.  \nThe thing I ~~love~~ hate about offshore is that they love to send you an email asking for help, and then they're fucking gone.  \nEvery time.  \n3 and a half hours later, I get another email from him.  \n\"I tried follow these instructs, and still not work.\"  \nSuper.  \nI log into the console again, to see.  \n24 more failed login attempts with the same exact error.  \nI can also see that they're apparently remembering their password correctly.  \nSo they can remember their password, but not a simple PIN.  \nI cleared his PIN, assuming he just doesn't know it, even though he was able to login successfully literally 1 day earlier, and many times before that.  \n2 hours after that, I'm still waiting.  ",
        "created_utc": 1527846315,
        "upvote_ratio": ""
    },
    {
        "title": "Nickle and Diming a company into oblivion",
        "author": "harrywwc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nq12l/nickle_and_diming_a_company_into_oblivion/",
        "text": "tl;dr - saving a few bucks here drains the account elsewhere\n\nWhile this is not a \"Stupid User Story\" (per submission guidelines), it certainly is a \"Stupid Management Story\" - and that's 'close enough'.\n\nBack in the mid-90s when I was working for |a|n|a|l|o|g| (again!), I was supporting the software that helped manage the spare parts inventory &amp; logistics for the \"Field Service\" side of the organisation.\n\nOne of my regular tasks was to access the \"database\" (ISAM files, but well organised enough to be classed as a 'database') via the Data Manipulation Language (DML) directly. On one of these excursions, I noticed the spare-parts inventory of repaired monitors (15\" CRT, 1024x768, full colour, case colour was technocrap white) was in the thousands of repaired units waiting to be placed back into stock.\n\nI contacted the main user of the system, and queried her about this.\n\n&gt; me: Surely this is too many by at least an order of magnitude?  \n&gt; she: No, that's about right.\n\nThen she told me a story of a high up manager in MA (USA) who just received a massive bonus because he had shaved $5 a unit for monitors from a Taiwanese manufacturer, $DarkOff. They had earnestly recommended that he purchase the more expensive monitors, as the cheaper ones are known to be unreliable, and require repair/replacement on a frequent basis.\n\n    Of course, this begs the question - \"Why the heck are you even manufacturing this crap in the first place?\"  But I digress...\n\n\nThe global order was for several million monitors with the brand |a|n|a|l|o|g| on the front, not $DarkOff, and the... (*take a breath, calm down...*) and the 'manager' had \"saved\" the company tens of millions of dollars - hence his bonus.\n\nOf course, we will ignore the consequences of his 'nickel and diming' - especially the additional resources spent in repairing and warehousing thousands upon thousands of this crap across the globe, and most especially (and I think this was a 'death-blow' to the company) the rock-bottom reputation |a|n|a|l|o|g| now had in a lot of State Government departments in Australia, and no doubt across the globe.\n\nHe may have \"saved\" the company several tens of millions of dollars, and scored a nice bonus, but ultimately, at what cost?\n\n----\nedit: credit to /u/SuperSecretSpare for prompting this memory with his story [here](https://redd.it/8mfz4w).",
        "created_utc": 1527837915,
        "upvote_ratio": ""
    },
    {
        "title": "My wife and her GPS",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nnkqj/my_wife_and_her_gps/",
        "text": "[removed]",
        "created_utc": 1527813148,
        "upvote_ratio": ""
    },
    {
        "title": "The Rogue Mouse",
        "author": "GreenEggPage",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nn3f8/the_rogue_mouse/",
        "text": "I originally posted this one at Computerworld's Shark Tank. If you've never read them, they've got some good stories.\n\nI ran into one of the oddest problems I've ever dealt with the other day. A customer - a high-end hairdresser - was having problems with two of her Mac's, complaining about slow internet and the computers locking up. We replaced their consumer wifi product with an enterprise system, but the problems continued. Whenever I would get to the site, the problem would be resolved and everything would work fine, so I began to just randomly pop in and see how things were working.\n\n\nThe other day, I popped in and the girl up front said, \"Perfect timing! This ones locked up!\" I sat down and dug in. Determined that the bluetooth mouse was working, but the left mouse button wouldn't click. The right clicker worked fine. A reboot restored functionality but while I was looking at what could have caused it, the other Mac lost it's left clicker. \"Well, self,\" I said to myself, \"that's interesting.\" I plugged a wired mouse in, but still no left click. I turned off the bluetooth mouse, no clicky. I finally discovered that I could turn off bluetooth and get the wired mouse to work.\n\n\nLooking through the list of bluetooth devices, I found 2 mice active. I start turning off mice, but there's still an \"Administrator Mouse\" connecting. I ask around about more mice and the owner says she has a couple in her purse. She goes and digs them out and, surprisingly, one of them is on. I turn it off and the \"Administrator Mouse\" disappears. Suddenly, all of their problems disappear... \n\n\nI removed the batteries from the extra mice. She promised to take them home and leave them there.\n\n",
        "created_utc": 1527809023,
        "upvote_ratio": ""
    },
    {
        "title": "I accidentally left my BlackBerry in the microwave.",
        "author": "Forever-Delayed",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nmvqn/i_accidentally_left_my_blackberry_in_the_microwave/",
        "text": "[removed]",
        "created_utc": 1527807304,
        "upvote_ratio": ""
    },
    {
        "title": "You need to use our software if you want transmissions tracked by our software...",
        "author": "unrehearsedgaming",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nm0zh/you_need_to_use_our_software_if_you_want/",
        "text": "Hi TFTS! Long time lurker, first time poster.\n\nI work at a Data Integration and Managed Services company that also happens to sell and support a few specific data-focused applications. The application i Support is a robust File Transfer application that consolidates various transmission protocols.\n\nOne of our customers has been using this software since before I even started with my company. He frequently writes in with the most basic of questions that should have been learned the first day using the software. Today's, though, takes the cake.\n\nFor some background, this customer also uses our VAN services for the transmission of data, rather than a direct connection with a partner.\n\nLEGEND:\n\nC=Customer\n\nM=Me\n\nS=Our Software\n\nOS=Other Software\n\n&gt;C: I was viewing a transaction from the VAN portal and I see that we received a transaction, but it's not showing up in our software. Please advise.\n\n&gt;M: Good afternoon C! I'm more than happy to help with this issue. Could you please provide the &lt;Relevant Identification information&gt; so I can look into this transmission issue further?\n\n&gt;C: Provides &lt;Relevant Identification Information&gt;.\n\n&gt;M: I see from the header information that the data was not transmitted with S. It appears that OS was used for sending the data, as well as the acknowledgement.\n\n&gt;C: Yes, we're experimenting with another application. Why didn't the transmission show up in S?\n\n&gt;M: Well, since you used OS for the transmission of data, the acknowledgement would have come in via OS as well. That application is from a completely different company that has no association with us or S. S can only track information that is processed through it.\n\n-----\n\nI have it on good authority that C makes at least twice as much as I do.",
        "created_utc": 1527800324,
        "upvote_ratio": ""
    },
    {
        "title": "He who knows more than I",
        "author": "zero92835",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nlz5v/he_who_knows_more_than_i/",
        "text": "I work tech support for a security company and was assisting an end\\-user over the phone who couldn't connect to their camera.  We often get people claiming that they work in \"networking\" or are \"electricians\" for whatever reason, I assume so we'll use our secret troubleshooting techniques not for the plebeian end\\-user.\n\nCustomer: I can't watch my cameras!  \n\nMe: Alright, is there an error code?\n\nCustomer: No, it just loads forever.\n\nMe: Okay, have you tried power cycling the camera and your router?\n\nCustomer: I know that isn't going to work, I do networking for a living!  Tell me the next step!\n\nMe: Give it another try then, see if you can get an error code.\n\nCustomer: \\(after a few failed attempts\\) It says error 408.\n\nMe: Oh, error 408?  So since you \"do\" networking, you know what that is, right?\n\nCustomer:  \\(long pause\\) ...right.\n\nMe: And you know how to fix it, so we're done here, right?\n\nCustomer: \\(even longer pause\\) ...yeah.\n\nMe: Alright, have a great day! \\*click\\*",
        "created_utc": 1527799932,
        "upvote_ratio": ""
    },
    {
        "title": "Miscon-what now?",
        "author": "LostSouthernOne",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nlkyb/misconwhat_now/",
        "text": "[removed]",
        "created_utc": 1527796968,
        "upvote_ratio": ""
    },
    {
        "title": "Your beeper has a bug",
        "author": "sean_the_head",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nl1q8/your_beeper_has_a_bug/",
        "text": "[removed]",
        "created_utc": 1527793065,
        "upvote_ratio": ""
    },
    {
        "title": "What could go wrong if you let employees wire their desks?",
        "author": "enzoglt",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nko4s/what_could_go_wrong_if_you_let_employees_wire/",
        "text": "Some background first:\nI work as the only IT admin a medium sized branch office (approx 80 people) and we have just a basic DC-DHCP-AD server and 3 switches.\n\nMonday morning I got in the office as always, and a pack of 5 people rush at me screaming *oh my goood there's no internet at all!!*\n\nWell, they were right. Access points are down, ethernet ports on the wall give no signal whatsoever, and I'm starting to freak out.\n\nI head straight into the server room, and everything looks fine. So basic troubleshooting begins.\n\nInternet was up, wiring was correct (I added a switch a day before, could have messed it up), but I couldn't access our router. I had to run to buy a serial-to-ethernet adapter to access CLI and even after that, the only thing that came to my mind was that the switches died (it happened to another branch a couple weeks before)\n\n4 hours have passed at this point, so I contact my colleagues from HQ explaining the situation, and after letting them do some troubleshooting too, they told me *either you've wired it wrong, switches are dead or* **there's a loop somewhere.**\n\nHere's when it came to my mind. That moring a team moved to a different desk area, and they were let free of moving their own stuff.\n\nWent to check and....... they plugged both ends of an ethernet cable in the wall ports. \n\nI was angry. Like *really* angry. I removed the cable and threw it in the middle of the room and went to my desk. The problem was still there.\n\nThey did not only caused **one** loop, but 2 of them.\nThe 3rd loop (yes, there were 3 loops at the end) was from an IP phone with ethernet pass-trough with, obviously, both ports connected to the wall jacks.\n\nReported what happened and removed the loops, network was fine as always. \n\nNever trust employees, not even on basic stuff.\n\nTL:DR - Whole office was down for 4+ hours due to employees plugging both ends of ethernet cables in the wall socket. \n\n ",
        "created_utc": 1527790313,
        "upvote_ratio": ""
    },
    {
        "title": "My uncle died",
        "author": "thekarmabum",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nki43/my_uncle_died/",
        "text": "[removed]",
        "created_utc": 1527789132,
        "upvote_ratio": ""
    },
    {
        "title": "\"It Just Does It...Automatically\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nkhz8/it_just_does_itautomatically/",
        "text": "[deleted]",
        "created_utc": 1527789101,
        "upvote_ratio": ""
    },
    {
        "title": "\"I have backed up my important files\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nk0i6/i_have_backed_up_my_important_files/",
        "text": "[deleted]",
        "created_utc": 1527785614,
        "upvote_ratio": ""
    },
    {
        "title": "\"I have backed up my important files\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8njvdn/i_have_backed_up_my_important_files/",
        "text": "[deleted]",
        "created_utc": 1527784551,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a Kevin",
        "author": "nosoupforyou",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8njqw2/im_a_kevin/",
        "text": "But I prefer to believe I just pulled a Kevin once.  ( r/storiesaboutkevin )\n\nWorked as tech support for a very large company with stores all over the country.  We'd have to regularly remote in to their store servers, which supported their cash registers.\n\nDue to the fact that the company used xml files to post prices and sales to each store, updates would take hours for each store. \n\nDue to the fact that the people who set up the prices and xml files, as well as regular failures of the update process, the registers wouldn't show the correct prices when customers tried to purchase items on sale.\n\nSo often, on the day after new updates were done, we'd get tons of tickets about prices being wrong.  We'd telnet into the server, check whether the xml file had the item and price, and if it did, rerun the load. If not, call the marketing team and have them regenerate the xml, and then we'd rerun the load.  I don't remember if we did the push to the store or if they did.  Even after the load finished, you'd have to check to make sure the prices were correct now.  If not, you'd have to do it all again.\n\nBut there was no direct way to see how far the load was.  You had to run a command to see what it was doing.  Even then, it didn't say how many records.  So you could type the command to view it, and then repeat the command, but it was easier to wait and do other tickets while this was going on, and then check later.\n\nI had one store where the load didn't work, so I figured out the problem and reran it.  Problem is, it's been hours now and the store manager is getting frustrated about these price issues today not being fixed.  So I needed to wait until it's done and then verify it as soon as the load was complete.\n\nBut it was annoying having to keep rerunning that command to see whether it was done, so I had I brilliant Kevin like idea.  I would create a batch file that would run the command every few seconds on this store's server.\n\nIt worked wonderfully.  Would scroll showing the status, and I could just sit there watching it.\n\nI could, until we got another call from that store screaming about how their registers were hung.  Oops.  Boy the manager was pissed.\n\nI aborted the script, and kept my mouth shut, pretending it was just a fluke server problem.  Afaik no one ever figured it out.",
        "created_utc": 1527783606,
        "upvote_ratio": ""
    },
    {
        "title": "Customer has pre-existing issues outside of the scope of the repair i'm doing? must be my fault when I don't prevent further issues.",
        "author": "dmfreelance",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8njd2z/customer_has_preexisting_issues_outside_of_the/",
        "text": "So I work as a computer repair tech. One of our clients came in yesterday. He needed a screen replaced on his laptop because it was cracked and wasn't working. We opened the computer up to find that there were some screws rolling around. \n\nThe thing is, he said the computer was working just fine before he took it in. That's all great and dandy, but that doesn't change the fact that there are now a dozen screws rolling around in your laptop. \n\nSo, I make sure to find and re-screw in any and all screws that I need in order to do this repair, along with any screwholes I can get to easily. \n\nSome of the screwholes are inaccessible without removing more component that are entirely outside of the scope of this repair. I decide to finish my repair and tell the customer about this. I can tell that whoever last repaired this device didn't know what the fuck they're doing because honestly it isn't hard to screw in a screw properly.\n\nSo, I tell her i can do that for a small extra fee. In the past my boss (Senior technician, he's been here a long time.) has been really strict on the ROI for repairs. If it takes too long to do a particular repair, I get reprimanded for taking too long because that's money we can earn doing someone else's repair. \n\nSo, I decide to do the bare minimum in order to make sure this repair goes smoothly and suggest the customer come back later to ask my boss for a discount on getting his shit fixed because its #notmyfault and his existing issue with screws coming out isn't preventing my repair from working properly.\n\nI then get a call from my boss, reprimanding me, because apparently a screw got loose and fucked up his computer. \n\nSo I: \n\n1) either removed all loose screws\n\n2) or tightened any existing screws\n\nbut because another screw gets loose I get reprimanded. \n\nSometimes you can't win.",
        "created_utc": 1527780839,
        "upvote_ratio": ""
    },
    {
        "title": "Modem modes... This one doesn't exist",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nj9ao/modem_modes_this_one_doesnt_exist/",
        "text": "[removed]",
        "created_utc": 1527780053,
        "upvote_ratio": ""
    },
    {
        "title": "Breeze Mode or Bridge Mode?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nj7bd/breeze_mode_or_bridge_mode/",
        "text": "[removed]",
        "created_utc": 1527779635,
        "upvote_ratio": ""
    },
    {
        "title": "Breeze Mode",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nj6bn/breeze_mode/",
        "text": "[removed]",
        "created_utc": 1527779431,
        "upvote_ratio": ""
    },
    {
        "title": "Your laptop won't turn on again and you don't know why ? Right...",
        "author": "autruip",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nhj0q/your_laptop_wont_turn_on_again_and_you_dont_know/",
        "text": "LTL, FTP, English is not my native tongue, sorry if there are any mistakes.\n\nYesterday morning, 9 am, I got a call from a co-worker based at several hundred kilometers from my office. Here what happened :\n\n$me will be me, $her will be her, to keep it simple.\nI appreciate her and she's not completely clueless... Usually.\n\n&gt;$her : Hey $me ! My laptop isn't working this morning, I can't turn it on, I don't understand why... Can you help ?\n\n&gt;$me : Yeah sure, we'll go through the basics : have you plugged it, tried a different outlet ? Is there any light or sound, maybe vibration coming from it ?\n\n&gt;$her : No, absolutely nothing. It was working fine yesterday in the office, but I couldn't use it at home, I don't know what happened\n\n&gt;$me : You took it at home ? You're not really supposed to do that, it should stay on your desk...\n\n&gt;$her : Yeah I know, but I had to for personal reasons, sorry about that... And do you think it would be possible to get a bag for the laptop ? I'm getting tired to keep it under my arm when moving around with it\n\n&gt;$me : What do you mean keep it under your arm ?\n\n&gt;$her : Well, I had to hold it from the office to my home.\n\nFrom there, I'm reminding myself that tuesday, there was some really bad weather, a lot of rain, which flooded the street, to give you an idea of the intensity. And I fear of what her answer might be when I ask her if she took it under the rain...\n\n&gt;$her : Well, yeah, I had to, I don't have any bag for it\n\n&gt;$me : And... The laptop got wet, right ?\n\n&gt;$her : Yeah... But I dried it and wrapped it in a towel when I was back home\n\nI had to really hold my sigh on the phone, and told her that since the computer was rained on, it was probably dead. She didn't seem to make any connection between the fact that her computer died and the fact that she put it under the rain...\nBut, well, my manager agreed to give her a brand new laptop, under the condition that it will not, never, ever, leave the office.\n\nEdit :\n\nWell, I sure wasn't expecting this many comments :)\nI'll answer to the few frequent questions :\n\n- Why not a desktop instead of a laptop ?\n\nUnfortunately, we don't have our word to say about the equipment, as the tech team. We do not have a single desktop spare to use, and it's easier for our coworkers to use a laptop, since they have a lot of meetings each week. Another reason is that she's supposed to move around in order to meet the clients (and for this, they are given a laptop bag), so a desktop is not really practical...\n\n- Why is our policy not to take the laptops home ?\n\nWe have quite a lot of sensitive data, ours, our clients, and the management thinks it's better if the laptop are not used at home. Again, we do not have our word to say about that.\n\n- Why not a lock ?\n\nI can't really answer this, as it's been more than two years since I first started to ask for it. It's never \"the right time\" or they \"don't have a budget\" for this. Management again\n\n- A brand new laptop ?! Why not buy a desktop then ?\n\nWe have a few laptop around, some old, some recently bought, and I think they buy them in bulk, so the price is a bit lower. She got a new one, as she sometimes have to meet with a client, and we can't decently give her a Dell Vostro 3500 bought in 2010.\n\n- Will she suffer any consequences ?\n\nI don't really know. We are in two different offices, a few hundred kilometers apart, and I've not seen my manager since monday. I don't think she will have to pay for the laptop, but I hope the management will make her learn the lesson..",
        "created_utc": 1527764834,
        "upvote_ratio": ""
    },
    {
        "title": "Just. No.",
        "author": "Taleya",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ngcmh/just_no/",
        "text": "[removed]",
        "created_utc": 1527750109,
        "upvote_ratio": ""
    },
    {
        "title": "Feels like old times...",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ncygt/feels_like_old_times/",
        "text": "[removed]",
        "created_utc": 1527719999,
        "upvote_ratio": ""
    },
    {
        "title": "Drunk custom builds x3",
        "author": "DarkFlare493",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ncses/drunk_custom_builds_x3/",
        "text": "[removed]",
        "created_utc": 1527718579,
        "upvote_ratio": ""
    },
    {
        "title": "Dueling Dual Monitors",
        "author": "necrosxiaoban",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nb7k7/dueling_dual_monitors/",
        "text": "The following tale is set in a small, East Coast office environment wherein I am often called to provide on-site tech support when our corporate tech support (West Coast) is unavailable or needs a pair of eyeballs on the problem. Lately, I've had issues where our new hires feel they need not just two, but even three or four monitors. All requests for additional monitors have been denied. \n\n\nThe cast is as follows:\n\n\n**$Me**: Yours truly.\n\n**$CSL**: Our delightfully competent Customer Service Leader.\n\n**$NewGirl**: A recent hire who defies explanation. The office pool is currently giving her till Friday before she gets the boot. Incompetence given human form.\n\n\nOur tale begins in the early hours of the morning as I'm leaving my house for the office. $CSL calls me because $NewGirl's computer isn't working, and wants to know when I'll be there to fix it. Since it will be at least 30 minutes before I get there, and $NewGirl can't work without a functional computer, I try to begin diagnosing the problem over the phone.\n\n$CSL tells me $NewGirl's monitors aren't working, both were only giving a blank screen, so I began running through general troubleshooting; are the monitors on, cables connected, yada yada, but nothing's working. I'm at a loss for what the problem could be, but we've had bad weather lately and consider a power surge may have knocked a monitor out. \n\nI start walking $CSL through getting a replacement monitor out of the storage room, when she helpfully volunteers they can only see the cursor on the screen. \n\n&gt;$Me: \"Wait, what?! I thought they were blank.\" \n\n&gt;$CSL: \"Well, yeah they're blank except for the cursor.\"\n\nOkaaaaay.... so we're not dealing with dead monitors. \n\n&gt;$Me: \"Well, did you try turning it off and on again?\"\n \n&gt;$CSL: \"Yes, let me check the cables again.\"\n\n&gt;$Me: \"No, please don't, I think we're dealing with a software issue here.\"\n\nSo I have them reboot into safe mode, which works, then into normal mode, which also works, so problem solved. Great.\n\n\nLater in the day I'm in the office when $NewGirl pops in to say she's having the same issue again. I walk over and find two black screens with only the cursor visible. No amount of clicking, Ctrl+Alt+Del'ing or Ctrl+Shift+Esc'ing produces any result, so I reboot a few times, each time it works, but then suddenly cuts out again.\n\nWell, darn. Maybe there is an intermittent hardware fault here. I go to check the cables again, when to my surprise I find 2 VGA cables and 1 DVI cable plugged into the back of the PC. That can't be right, there's only 2 monitors. Also, one of the VGA ports goes to the onboard card, and one goes to the external card. You can't use both simultaneously.\n\n&gt;$Me: \"Why are there three cables?\" \n\nNo one answers.\n\nI disconnect the VGA attached to the onboard card and voila! it works! Happy to have it working, but still confused where the extra cable came from I begin tugging on it to pull it out from behind the desk since its certainly not needed. Strangely, it seems to be attached to something?!\n\nTracing the cable I find it plugged into one of the two monitors, right alongside the DVI cable.\n\n&gt;$Me: \"Who ran two cables to the same monitor?\" \n\n&gt;$NewGirl: \"I did.\"\n\n&gt;$Me: \"... But why?\"\n\n&gt;$NewGirl: \"I saw there were 2 ports so I wanted to enable dual monitors on that one\".\n\nI glared back at $NewGirl as if to say, \"It does not work that way. Why are you messing with your PC? Why aren't you focusing on the tasks you've been assigned which you cannot handle? Why are you here? How do you function as an adult human being?\". Of course, all of that is left unsaid. \n\nA long silence follows.\n\n&gt;$Me: \"Okay, well, for future reference attaching a second cable does not turn one monitor into two.\"\n\nOh how I can't wait for $NewGirl's boss to come back from her vacation. ",
        "created_utc": 1527706712,
        "upvote_ratio": ""
    },
    {
        "title": "What phrases/terminology does your user base use that makes you want to flip a table?",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nb2g7/what_phrasesterminology_does_your_user_base_use/",
        "text": "[removed]",
        "created_utc": 1527705685,
        "upvote_ratio": ""
    },
    {
        "title": "Grandpa gets a new computer! (sort of)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nb0ij/grandpa_gets_a_new_computer_sort_of/",
        "text": "[removed]",
        "created_utc": 1527705292,
        "upvote_ratio": ""
    },
    {
        "title": "To all my fellow men and women tech support out there I just wanted to say...GDPaaaarrrrrrrr!",
        "author": "Thyri",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8nawkl/to_all_my_fellow_men_and_women_tech_support_out/",
        "text": "[removed]",
        "created_utc": 1527704488,
        "upvote_ratio": ""
    },
    {
        "title": "But who will pay me for my time",
        "author": "Polarski",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n9r5w/but_who_will_pay_me_for_my_time/",
        "text": "Hello TFTS.\n\nShort time lurker, First time poster.\n\nPlease do excuse any grammatical errors, English is not my native tongue \n\n\n**The background:**  \nI work as a Level 1 and 2 technical support engineer for $company providing phone support for what is essentially glorified printers.\n\nOnce a month these lovely machines have to connect to our servers to provide usage stats, and while most connect using DSL/Fiber/whatever-internet quite a few machines still connect using analogue phonelines and a modem.\n\n\n\n**people involved:**  \n**$me** = Yours truly  \n**$c** = The customer  \n**$phonecompany** = self explanatory i would say\n\n\n\n**The story:**\n\nI get this call early in the morning on monday, and the conversation goes something like this.\n\n&gt;$me Good morning this is $me with $company tech support, how can i help you?\n\n&gt;$c Hi this is $C with $customercompany, my machine won't upload data.\n\nSo i get her information and start checking on my end.  \nI can't see any connections that made it in to our infrastructure, but i can see that the last connection was made using a modem\n\nWe go through the usual steps of powering off the machine, unplugging the phone line. etc...\n\n&gt;$me I am sorry ma'am but it would appear that the issue lies with $phonecompany, what i can see indicates some jitter on the phone line.\n\n&gt;$c Well what are you going to do to fix it?  we pay you for this machine and this is very unprofessional!\n\n&gt;$me We have some digital solutions available that will allow you to connect this machine to your internet so you can stop paying for a phone line just for this purpose\n\n&gt;$c WE DON'T WANT ANYTHING NEW YOU JUST HAVE TO MAKE THIS WORK RIGHT NOW!!!\n\n&gt;$me As stated earlier, the issue appears to be with $phonecompany so you will have to call their support instead.\n\n&gt;$c Are you going to compensate me for the time i have wasted making YOUR equipment work?!?\n\n&gt;$me I can put you in touch with sales, they can provide you with a very competitive price for a digital solution, otherwise you will have to call $phonecompany\n\nAt this point in time she just hung up..  \nI do hope she was nicer to $phonecompany",
        "created_utc": 1527696118,
        "upvote_ratio": ""
    },
    {
        "title": "The day the music stopped.",
        "author": "Slightlyevolved",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n9g2e/the_day_the_music_stopped/",
        "text": "Actors:\n\n* $WhaIDo - Helpdesk Tech. Anytime his name is said, responds with, \"Wha I do?\"\n* $me - Good ole slightlyevolved. Helpdesk tech. Strong with the forces of Google Fu.\n* $EngineerHutt - Desktop Engineer. Also handled Active Directory and SCCM. Mostly was a waste of space though.\n* $Silly - Senior Tech. Good tech. Needs to work on his geography skills.\n* $MainApp - Citrix published app that is used by almost 70% of our 7000+ workforce. 24/7 availability nationwide. Typically around 3500 users active at any given time.\n\n--------\n\n***doom doom doom doom***\n\nA subtle thrumming sounded throughout the helpdesk room that afternoon. Not really audible but noticeable, even over the clatter of phones, talking, and whatever dubiously stupid, non-work related topic is being discussed (Why anyone would go to Africa, it being a 3rd world country; being the choice topic of the afternoon. Don't ask. Never ask. Rule 1 of HelpDesk. Rule 2 is, Always Bring Donuts.)\n\nAs was typical, $WhaIdo was listening to the Spooty music service.... No one was really sure how he managed to get a $150 Logitech speaker system for his workstation, but have one he did. With MAXBASS.\n\n***doom doom doom doom***\n\n$WhaIdo liked dance music.\n\n***doom doom doo---*** For a few moments the conversation where we were trying to get $Silly to understand that Africa was a continent, not a country, continued. Then the lack of MAXBASS started to sink in.\n\n&gt;\"$WhaIDo, why'd you turn off your music?\" I queried from halfway across the room.\n\n&gt;\"I dunno Wha I do. It just stopped.\"\n\nAfter a few moments, every phone in the room started ringing. Quite rapidly, the status board for the call queue began racking up the number of users on hold.\n\n$Silly's lesson on Eastern continent geography put on hold, we began answering the phones as rapidly as possible; as HelpDesks in crisis mode are wont to do. The first few all said the same thing; $MainApp is not working. The third call I get is not from one of our local buildings, but an offsite location, and the fourth is a VMWare Horizon user...\n\nQuickly making some tests, one thing becomes immediately apparent... the entire company has no WAN access. Not just here, but all remote sites as well.\n\nW.\n\nT.\n\nF.\n\nAround the fifth call... ***doom doom doom doom***\n\n&gt;Everyone turns to look at $WhaIDo's desk. \"Do we have the internet back up?\" someone asks.\n\n&gt;\"Sounds like it,\" comes a response.\n\n***Doom doom doo---*** Once again, the music stops.\n\n***Doom Doo---***\n\n***Doo----- om…. Doo---***\n\nEvery few minutes, it would play about 5 seconds of music. At this point, we have no idea what the Networking Team is up to; but it is obviously in their area. I decide to do a ping to Google, and all packets drop. But, how? If all packets are dropping, then why are we still hearing *Yolanda Be Cool* tell us that *We No Speak Americano*?\n\nOn a whim, I decide to run ping continuously. And thus, after 30 seconds I find, 98% packet loss, and average response times of over 4000ms! A quick IM to my **Cult of ShadowIT** (the only way anything actually gets done in IT) contact in the Networking team, to find out if they noticed this yet turns out to be a good idea as they were still working their way through the layers to find where the problem was and hadn't yet noticed the high latency, as their initial test wasn't getting through either.\n\nI don't know what magic powers they have, but though their use, Networking quickly found that something was completely saturating our outbound WAN. We're talking 2x 10Gb fiber for our primary load balanced access, plus whatever else we have for backups.\n\n**OVER 20Gb SATURATED?!?**\n\nWe continue to handle the absurd amount of calls from all over the US. Sporadically backed with snippets of MAXBASS. After about 30 minutes we hear it:\n\n***doom doom doom doom doom***\n\nIt keeps going… 10 seconds… 20 seconds… 30 seconds! A WHOLE MINUTE!\n\nWE HAVE INTERNET BACK!!!\n\nI verify I can reach google, apple, reddit, dslreports.... my usual web access test. All of them work! All of them to the backing track of ***doom doom doom doom***\n\nThe music keeps playing. ***doom doom---*** My heart begins to flutter. Not again!\n\n.... ***untiss untiss untiss***\n\nOh. It was just another song starting.\n\n&gt;$EngineerHutt speaks up from the back of the room where he sits; \"It's okay, I fixed the WAN issue, and we should be fine now!\"\n\nHe... fixed the WAN issue? How? He's not networking. He doesn't have access to anything close to that level. Despite his name, he actually doesn't have the power a large smuggling ring and a retinue of bikini clad slave Carrie Fishers. He does, however, have the equal amount of undeserved ego.\n\nI find out about an hour later. In a way $EngineerHutt did fix the problem. Mostly because he WAS the problem. Turns out that the WAN was saturated because $EngineerHutt decided 1pm would be an ideal time to update all of the SCCM distribution servers across the entire company.\n\nReally, I'm not sure who to fault here. Him for doing an update like this with no planning or notification; or Networking for never hearing of a thing called QoS?\n\nThis did not end up being the only time his Huttness managed to kill the WAN.\n",
        "created_utc": 1527693853,
        "upvote_ratio": ""
    },
    {
        "title": "I Can't Edit This Word Document",
        "author": "NYFranc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n94cw/i_cant_edit_this_word_document/",
        "text": "Happened the other day before quitting time. Here I am planning my well\\-executed escape out of the office with detailed plans to dodge people and get to my scheduled commute home. Then, blammo, a tech support call comes in. Obvious swearing and damnation instantly rummage across my brain and suddenly end as soon as I answered this call.\n\n$NYFranc: Good afternoon, this is Help Desk, how can I help you?\n\n$Retail: I can't edit this Word document, can you help me?\n\n$NYFranc: What error\\(s\\) are you getting?\n\n$Retail: No errors, just that I type and nothing happens. I'm confused. Please remote in and help me.\n\n$NYFranc: No worries, will remote in ASAP.\n\nI thought it was a simple issue with a Word document, well, it was, but common sense was lacking with this person from the Retail Department.\n\nAfter a few seconds of remote PC surfing, I entered the PC of $Retail and did a few obvious checks. While $Retail claims she did nothing wrong, I assured her that it's ok and disturbing the Help Desk team 20 minutes before closing time was ok \\(really in my mind, **IT WASN'T!**\\)\n\n* Document locked, nope.\n* Any odd add\\-ins, macros, and Microsoft weirdness, nope.\n* Corrupt file, nope.\n\nAfter doing the obvious guesswork and the lack of coffee in my system \\(**I should be a coffee ambassador \\- read my past stories on why!**\\), I was in \"bleep it\" mode and decided to type to mess with the contents of the document itself. The $Retail user gasped very loudly and passionately as I attempted to cause chaos. Then, I stumbled upon it, the contents of the Word documents was all PICTURES! Bleeping PICTURES! $Retail actually tried to type on graphics itself like it was Photoshop.\n\n$NYFranc: Um, yea, your Word document's contents is all pictures.\n\n$Retail: Really?!\n\n$NYFranc: Yes, really! It never occurred to you for one brief moment that all of it was pictures. Most likely, whoever gave you this document did a poor job in exporting it as a Word document.\n\n$Retail: \\(total silence for 15 seconds\\)\n\n$Retail: Ah yes, it makes sense. Thankfully, a colleague just noticed this and e\\-mailed me the same version just now and with words, not pictures. Thank you very much for the help. You're very sweet. Bye!\n\nI figured since my supervisor will review the ticket, either I get reprimanded for being blunt or praised for being professional and the caller will give a negative rating for me. I reported in this morning. E\\-mail from supervisor:\n\n$NYFranc, job well done on that last ticket. Also, her supervisor called me after hours to praise your commitment to the Retail Team.\n\nP.S. Don't forget your coffee!\n\nNo negative rating from user, positive praise from my boss, and still manage to catch my commute home. I'll take it.",
        "created_utc": 1527691331,
        "upvote_ratio": ""
    },
    {
        "title": "Back from holiday, have you seen my laptop?",
        "author": "Gearfried",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n8icq/back_from_holiday_have_you_seen_my_laptop/",
        "text": "So this occurred this morning.\n\nMy colleague, who we'll call Steve as that's his name, just got back from holiday.\n\n&gt; **Steve:** Have you seen my laptop?\n\n&gt; **Me:** Where'd you leave it?\n\n&gt; **Steve:** Thought I left it on my desk.\n\n&gt; **Me:** Well no one would have moved it, but try one of the cupboards behind us.\n\nSteve then doesn't bother to actually check anything and just sat down at his desk. \n\nSo I have a quick look in the cupboards behind me as that's where our team usually store things. Didn't find his laptop there so went down to the cupboards behind Steve where I happen to glance at his desk.\n\n&gt; **Me:** It's on your desk, Steve. Plugged into the dock. Completely unmoved.\n\n&gt; **Steve, looking at his desk:** Is it?\n\n&gt; **Me:** Lift up the keyboard. It isn't even fully covering it.\n\n&gt; **Steve:** Oh yeah, that's lucky.\n\nI think it's time for Steve to go on holiday again.\n\n",
        "created_utc": 1527686404,
        "upvote_ratio": ""
    },
    {
        "title": "SecureDoc is utter SHIT and my nemesis",
        "author": "ummwtfiswrongwithyou",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n8hv9/securedoc_is_utter_shit_and_my_nemesis/",
        "text": "[removed]",
        "created_utc": 1527686273,
        "upvote_ratio": ""
    },
    {
        "title": "\"Press the cancel button and it’s done.\"",
        "author": "joodstryr",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n7xel/press_the_cancel_button_and_its_done/",
        "text": "[removed]",
        "created_utc": 1527681009,
        "upvote_ratio": ""
    },
    {
        "title": "The 'Thing'",
        "author": "quell_in_a_shell",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n7o7b/the_thing/",
        "text": "This happened a few hours ago and left me with this soothing calmness inside me that I'm sure most of you have felt at some point or another. It's not terribly exciting or perhaps interesting. Maybe it might be relateble...\n\nHumility and victory.\n\n**Background**: One of our clients decided to 'deallocate' their offices here in Sweden last year. We took down most of their equipment, sent back what needed to be sent back, ran killdisk on what needed to be killed.\nWhat remained however was 'The Thing'. The Thing is a IBM iseries 740. I have built vast virtualized clusters, deployed seemingly magical solutions to esoteric problems but none of that pride I feel in work compares to the primal uncertainty and dread I feel\nwhen I'm close to 'The Thing'. The client in question wanted us to host this monstrosity for a ten year period, us supplying the means for them to connect to it when needed. The same was to made of a specific finance software.\n\nThe players:\n\n**$me** - Exhausted cat lady and caffeine enthusiast.\n\n**$pcat** - Networking Wizard and Office Dad.\n\n**$biblicalname** - My cloud-partner in crime. Also Mr. Meseeks.\n\n**$IBMdude** - Soft spoken thaumaturge of everything Big Blue. Does not work for there.\n\n\nMy boss told me to mount it up and connect it when we got\nit and that was the last I heard of it until Sunday. I had been to an MS course for the better part of a week and was exhausted, having not had any real down time in nearly two weeks and was relaxing when the email showed up.\n\n&gt;\"High Priority! The Thing and $financesoftware needs to be reachable over VPN by Tuesday.\"\n\n&gt;\"Oki dokey\" I replied, rubbing the belly of fattest of my two cats. No rest for the weary.\n\nThinking that I could keep ahead of the coming weeks onslaught I provisioned a VM with our cloud partner, setup and installed $financesoftware and then started fiddling with Routing and Remote Access. Which refused to work at all.\nHaving struggled with it well into the night, having gone so far as to provision and new VM and test my configuration on that one, I came to the office on Monday with a total of zero results and 4 hours of sleep.\nAfter a few cups of liquid life (coffee) I decided to screw the rules and do it another way I knew worked. I rang my expert.\n\n&gt;**$me**: \"Hi $biblicalname, it's $me. Could you set up a OpenVPN solution for this account?\" *I sent him the details.*\n\n&gt;**$biblicalname**: \"Sure can! I'll gateway it through pfSense wall. How many clients?\"\n\n&gt;**$me**: \"Two, me and one called $client\"\n\n&gt;**$biblicalname**: \"Gimme an hour.\"\n\n&gt;**$me**: \"Brilliant! Thanks!\"\n\nAn hour later I had a working VPN solution for $financesoftware. Which meant I now needed to face The Thing. Having had it rigged up but not powered up, it sat, silent and foreboding in our server room.\n\n&gt;**$me**: \"$pcat... do you have any idea how to boot this thing up?\"\n\n&gt;**$pcat**: \"Nope. But I tried to Google it...\" *he said, and poked a bit at the mysterious LCD console.* \"I don't think I got it right though.\"\n\n&gt;**$me**: \"So did I...\" *I said, remembering the wall of opaque information, terminology and standards that I had met when I had attempted a cursory glance at it.*\n\nFor those who never have encountered these pieces of hardware, they run on what I decided to call 'IWODT' - IBM Way of Doing Things. For example, you can't just click the power button. You need to go through a tiny display to specify boot options etc.\nAnd then it runs through, the gods know, how many SRC codes that tells you were in the boot process it is. \n\nTo be fair and honest - this might not even be true! Maybe the power button can just be pressed! I knew nothing about this and had to learn it quickly if I were to meet the deadline. Plowing through Googled articles, IBM specs and references at\ncaffeine and nicotine addled pace I managed after a while to determine that I indeed knew absolutely nothing. The Thing was built to outlast human life. An inscrutable black box to a Non-IBM simpleton as myself.\n\nI pride myself in being able to learn knew things quickly and putting them into practice but this felt so inscrutable, unknowable, that my own doubt was putting the whole venture into jeopardy. \n\nI need expert advice. \n\nThankfully I knew a guy who I had worked with when the Thing needed some TLC a few years back.\n\n\n&gt;**$IBMdude**: \"This is $IBMdude at $notactuallyIBM.\"\n\n&gt;**$me**: \"It's $me. How the hell do I boot a iseries 740?\" *I said, skipping any greeting.*\n\n&gt;**$IBMdude**: *chuckles* \"Long time no see. Go to function 1, set N and not M. Press power.\"\n\n&gt;**$me**: \"Done. Now what?\"\n\n&gt;**$IBMdude**: \"Wait for it...\" *(he didn't say this but he might as well, because a moment later I was blasted by the screaming of fans).*\n\n&gt;**$me:** \"Gods...\" *I step out of the server room.* \"Second question, which NIC should I connect? It's the same machine you got sent from $client a while back.\"\n\n&gt;**$IBMdude**: \"Hold on... I think it should be T1. In all likelihood it will have a static IP.\"\n\n&gt;**$me**: \"Which you don't have documented?\" *I said, despair setting in.*\n\n&gt;**$IBMdude**: \"Sorry, $me.\"\n\n&gt;**$me**: \"I'll manage. Thanks for the help though!\"\n\n&gt;**$IBMdude:** \"No worries.\"\n\nNow began the hunt for which NIC the machine used to do whatever it did. Thankfully I had help. $Pcat is a network wizard. However, the Thing had eight different NIC's, marked HMC, T1 and so on which to the uninitiated meant nothing.\nI asked him to set up a VPN and reserve a network for me while I hunted down the specifics. In my naiveté I thought I might be able gleam some information from IBM's manuals in regards to this but was met with terminology that in context\nof how nearly everything else is done in IT today, is alien. I plowed through a functions reference while I sat with wireshark to try and gather something, anything, from the NIC's on the machine and discovered function 30.\nFunction 30 displays some Ethernet information. Not being able to ping anything on the ports I had tested so far I click myself into it and found an IP. Excited I wrote it down, connected a cable and configured things appropriately. I got a ping response.\nI nearly wept.\n\n&gt;**$me**: \"$pcat! I GOT AN ADDRESS!\" *I cried, grinning like an idiot.*\n\n&gt;**$pcat**: \"Nice! I'll reconfigure the VPN. I'll mail you.\"\n\n30 minutes later I was pinging the machine via VPN.\n\n&gt;**$pcat**: \"I love ARP-proxy. Dirty as hell but it works.\"\n\n&gt;**$me**: \"I'd settle for just about anything now.\"\n\n&gt;**$pcat**: \"Do you know if it's the correct interface though? We have no idea about the gateway... if it needs one.\"\n\n&gt;**$me**: \"No. No idea.\" *I said with mixed feelings of dread and tiredness.*\n\nToday was the day. A meeting was scheduled so I packed up VPN packages, logon information and everything and sent it over - while dreading the response.\n\n&gt;**$clientIT**: \"It works perfectly. Thank you for the clear instructions. I don't think the meeting is necessary so I'll cancel it. Have a nice day!\"\n\nI squeaked in joy and felt the stress from the last two days burn away into nothing.\n\n**TL;DR: IBM.**\n\n**TL;DR 2: The heroes are my colleagues.**",
        "created_utc": 1527678265,
        "upvote_ratio": ""
    },
    {
        "title": "The dial-up ADSL connection that didn't work",
        "author": "heap512",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n6z7v/the_dialup_adsl_connection_that_didnt_work/",
        "text": "\nBack in the early 2000s a neighbour of mine had upgraded his old dial-up connection to a brand new ADSL 8/1 connection through his ISP. He was installing it with another neighbour acting as technical and morale support, but they couldn't get it to work. That's when they called the nerdy teenager living next door for help.\n\nAfter arriving at the scene I found everything to be superficially correct. The family PC and the ADSL modem were located in the laundry room. Both had power and were turned on, and connected properly to each other and the wall with network and phone cables. Still, the internet connection was not working.\n\n&gt; $Neighbour1: \"I ordered the upgrade from ISP and they gave me this modem, but we can't get it to work.\"\n\n&gt; $Neighbour2: \"I think the problem is the phone number in the PC's dial-up connection settings here, see?\"\n\n&gt; $Me: \"Hmm, no, the ADSL connection doesn't use the dial-up stuff, the PC just needs an ethernet connection to the modem with the correct network settings.\"\n\n&gt; $Neighbour2: \"No, I don't think that is correct. See if I go here and then...\"\n\n*10 minutes later*\n\n&gt; $Neighbour2: \"And see, it's still not working. I don't know what the problem is.\"\n\n&gt; $Me: \"Let me have a look. It's probably the WAN settings in the modem or the PC's network settings.\"\n\n*Clickety click click*\n\n&gt; $Me: \"No, the PC's network settings are fine. It's getting the IP address automatically from the modem's DHCP and we can connect to the modem's control panel through the browser. It must be the modem's WAN settings then.\"\n\n*More clickety clicks*\n\n&gt; $Me: \"The WAN settings look fine to me. See here *pointing* the settings are what the ISP says they should be. I'm not sure what the problem is, maybe a faulty modem or phone cable?\"\n\n&gt; $Neighbour2: \"It's the dial-up settings, the number is wrong. Let me take a look again.\"\n\nWhile $Neighbour2 checks the dial-up settings for the umpteenth time, I go through the whole setup in my head trying to figure out what the problem could be. Usually it turns out to be a faulty cable or the, at the time, ubiquitous Telehell ADSL modem built from a potato grown by the lowest bidder in Belarussia. In this case both would seem unlikely since everything is new. Then I get an idea.\n\n&gt; $Me: \"Has the ISP opened the ADSL connection on their end yet?\"\n\n&gt; $Neighbour1: \"Well, surely they have, but... Well, I don't know. Let me make a call.\"\n\n*One call to ISP later*\n\n&gt; $Neighbour1: \"Yeah, they haven't opened it yet.\"\n\n&gt; $Me: \"There's your problem then. It should start working with the current setup as soon as the ISP gets the connection up and running.\"\n\nAnd that's how I earned pizza money that day.\n",
        "created_utc": 1527669642,
        "upvote_ratio": ""
    },
    {
        "title": "Just \"Hook It All Up\"",
        "author": "zanfar",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n6q1y/just_hook_it_all_up/",
        "text": "***Everything*** *has been changed to protect the innocent. The guilty are getting a free ride on their account.*\n\nIt's a perfectly lovely Monday that, due to some long hours over the weekend, we are looking forward at our maintenance schedule rather than backward. I get the rare privilege of moving a Critical ticket *out* of the in-progress bin instead of *into*.\n\n&gt; **Chief Assistant to the Vice President Undersecretary of Facilities and Maintenance:** Hey, you know that suite next door the bagpipe tuners moved out of?\n\n&gt; **Me**: Sure\n\n&gt; **Facilities**: Well, we leased it last week.\n\n&gt; **Me**: Good! (We've been running out of space since the first Bush administration)\n\n&gt; **Facilities**: Yeah, we re-carpeted and installed cubes this weekend.\n\n&gt; **Me**: Wow! That was fast. I'm guessing you're here about pulling cable and getting the network extended.\n\n&gt; **Facilities**: Exactly. Well, we used the usual guy (read: lowest bidder) for the cables, we just need you to hook it all up.\n\n&gt; **Me**: Umm, okay. I guess I'll stop by later today and take a look. How many desks?\n\n&gt; **Facilities**: Oh! About 40 cubes, 5 offices, and two conference rooms.\n\n&gt; **Me**: That's bigger than I thought. (thinking out loud) So like 60 ports, I don't have really anything in stock, but I can get a quote...\n\n&gt; **Me**: Ok, I can probably work with that. We're a little busy at the moment, but as long as the cabling is all done it shouldn't be that big of a project. What's the move-in date?\n\n&gt; **Facilities**: This afternoon.\n\n&gt; **Me**: What!\n\n&gt; **Facilities**: Yeah, we finished the cubes and network this weekend, we just need you to hook it up.\n\n&gt; **Me**: Just \"hook it up\"\n\n&gt; **Facilities**: Yes\n\n&gt; **Me**: 65 ports\n\n&gt; **Facilities**: Yes\n\n&gt; **Me**: With phones?\n\n&gt; **Facilities**: Yes\n\n&gt; **Me**: In 4 hours.\n\n&gt; **Facilities**: Sure!\n\n*I snap.*\n\n&gt; **Me**: No.\n\n&gt; **Facilities**: What?\n\n&gt; **Me**: We have nothing in stock--we don't *keep* stock. We work on datacenter hardware--the only reason we take care of the office equipment is that no one else knows how. I couldn't scare up 24 copper ports if my life depended on it, not to mention PoE.\n\nAt this point his eyes get that unfocused look like Elmer Fudd after stepping on a rake, or like a third-floor suit getting told that putting it on a spreadsheet doesn't make it true. I take the opportunity to rein myself in.\n\n&gt; **Me**: At best, I can get a quote by the end of business, and if Finance will issue the PO tomorrow, we can overnight the switches for Thursday. That results in a best-case install time of end-of-day Thursday.\n\n&gt; **Facilities**: Really? You can't just use some of this (waves in the general direction of a stack of recently decommisioned SAN hardware)\n\n&gt; **Me**: No, that's for... Anyway, if you want it by Thursday, I'm going to have to get started now. I'll keep you in the loop, but honestly, I wouldn't plan on anything earlier than next Monday.\n\n&gt; **Facilities**: (Grumbling, back-and-forth) Fine.\n\n&gt; **Me**: (As he's walking out the door) Wait! You're going to need wireless too, right?\n\n----\n\nEdit: Thanks for \"[Quote of the Day](https://i.imgur.com/0NhjiRj.png)\"",
        "created_utc": 1527666137,
        "upvote_ratio": ""
    },
    {
        "title": "No, let's NOT do what the ticket says",
        "author": "SorinPlaneswalker",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n6gh7/no_lets_not_do_what_the_ticket_says/",
        "text": "LTL FTP and all the other acronyms. Also: mobile and 2:30 a.m. local, please forgive formatting errors.\n\nBackground: I work for what is in essence a cloud company, hosting servers for an industry you've heard of, but which I will not divulge due to anonymity since we are pretty much THE big company in that field. I'm the expert on one of our products and a few months ago our brainless leadership decided to do away with the on call (and associated pay) for that product. I happen to be on call for a different group this week. Pure chance, otherwise I wouldn't have answered. We're basically glorified secretaries in that we page the experts and are rarely allowed to fix anything ourselves. \n\nYour cast:\n\n$Middle-co worker in the same group\n\n$IdiotDBA-self explanatory \n\n$Me-our intrepid hero, played by a young Betty White\n\n\n\n[Phone alerting with a page at 1:40]\n\n$me-*grumbling * wtf do those idiots... ...no. seriously?\n\nA few minutes later I'm in the warm glow of my monitors \n\n$Middle-Hey, Sorin, $IdiotDBA needs you to confirm what they mean in this case that says to run a script against every database (hundreds per SQL server)\n\n$Me-Okay....I didn't create the case but it says to run against all databases with this naming protocol. I'll talk to them.\n\n\nIn the meantime I pull up the case to confirm what it says....yup \"run against all databases on these 5 servers\"\n\n\n$IdiotDBA-Can I call you?\n\n$Me-No. It's 2 am, I don't want to accidentally wake my husband or baby. What's your confusion?\n\n$IdiotDBA-So...the case says to run it against every database, but it only lists two database names.\n\n$Me-That's so you know the naming protocol the client databases use on these servers. Run it against each database. Do you need me to write a quick script to sequence through them for you?\n\n$IdiotDBA-No, i think I can do that. I just wanted to make sure you wanted me to run it against each database on the servers.\n\n$Me-Well, that is exactly what the case says to do, quite explicitly.....I'm going back to bed.\n\n\nTL:DR- The ticket says to breathe air, I just wanted to make sure it means that I should breathe air\n",
        "created_utc": 1527662793,
        "upvote_ratio": ""
    },
    {
        "title": "The mystery of the network outage",
        "author": "Ludovician42",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n5mc8/the_mystery_of_the_network_outage/",
        "text": "Hello, all. I work at the help desk of a medium-sized nonprofit business dealing with community support, aged care, and residential services. This story is about one of those residential services, which is essentially a standalone house with one or two staff there at a time along with clients who live there.\n\nCast:\n\n$Me: Me.\n\n$NA: Network admin. Knowledgeable, friendly guy, and the one I go to to escalate any network problems. \n\nShortly after I arrived at work yesterday, I received a confused call from the staff at the aforementioned residential service, wondering why they had no internet access. Cue the usual troubleshooting. Site has been inaccessible from the meraki cloud for 8 hours. Check lights, ethernet, power on both the meraki security appliance and the router. Went through each a couple of times with appropriate waiting times in between.\n\nChecked in with $NA for advice, and after a chat with him, and checking $ISP outages in the area (there were none) he recommended to check in with them. Okay, email our contact with $ISP with a description of the problem and the onsite contact details. After a short while, I get a response:\n\nSite had router connected to UNI-D Port 1 but the service is provisioned on UNI-D Port 2.\nConnected to correct PORT and everything working again.\n\nSomehow, it seems the onsite staff had, shortly after midnight, managed to unplug the ethernet cord on the NTD and plug it back in to the wrong location. I just have to wonder why anyone was awake and messing with network cables at that time.",
        "created_utc": 1527653335,
        "upvote_ratio": ""
    },
    {
        "title": "Fixing a small mess",
        "author": "sidewayseleven",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n58lt/fixing_a_small_mess/",
        "text": "\nI do not work in IT but have awarded myself the rank of enthusiast and therefore I provide emergency tech support for my family.\n\nMy brother had recently upgraded his residential service to the new controversial broadband network that had just arrived in his area and after receiving all the new gear had put it together himself.... and he reported the next day everything worked!\n\nHowever he called me three months later though to report that something had gone wrong somewhere and asked me to check it out.  I had been there on a previous occasion to optimise their setup so I had an idea of what to expect.  \n\nWhat I found was admirable though convoluted.  The modem seemed to be working ok and the cable was installed as per instructions to the new router.  It was here where things sprouted madly.  From the new router, two LAN cables went in to two different powerlines adapters.  The other two were plugged in to the old ISP wireless router and and even older wireless router.  Even though it looked a mess everything should theoretically be working.  \n\nAfter a quick examination it was determined that the new router was faulty, removed it and moved everything else up the line so as not to cause confusion and everything works as it used to.  I asked him to order a new wireless router from the ISP and to call me when it gets in so I can set up the wireless properly",
        "created_utc": 1527649628,
        "upvote_ratio": ""
    },
    {
        "title": "Always check everything. Always.",
        "author": "sans-_-",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n4kmh/always_check_everything_always/",
        "text": "Hello, TFTS! First time posting here, and first real textpost on Reddit in general.\n\n\n*Disclaimer: I'm not actually tech support but I'm the tech nerd around my house. TL;DR at end.*\n\n\n**Backstory:** My dad threatened to block my laptop from the router by IP after 11 pm, and I thought he did. Nothing else in the house was working with our router, however, except my laptop. This is the day after this occurred. \n\n\nThe cast: \n\n* $Me... you guessed it!\n* $Dad... my dad.\n\n\n**The meat of the story:**\n\nI get home from school and try to hop onto the network. Hmm... nothing's happening. I text my dad:\n&gt;$Me: \"Hey $Dad, the internet is out. Did you screw around with IP blocking? My laptop is working on the network.\"\n\nHowever, I hadn't checked if my laptop was working and just assumed so. Strike one.\n\n&gt;$Dad: \"What? I don't know what happened. I'll have to check when I get home.\"\n\nAnd I wait until he gets home, and like the fool I am, I don't check to see if the modem is functioning or restart the router.\n\n*$Dad gets home*\n\n*$Dad runs through the mental checklist of checking all network points of failure*\n\n&gt;$Dad: \"Hey, $Me, the trip switch was off...\"\n\n*(There's an electrical safety outlet in the bathroom that is connected to the modem for some asinine reason)*\n\n**cue facepalming all around, as this problem that lasted four hours could have been avoided with two minutes of work.**\n\nTL;DR: *I don't check to see if the modem is off and wonder why the internet isn't working. The modem is off.*\n\n*First rule of tech support: users lie.*\n\n*Second rule of tech support: you lie.*\n\n**Update:** \n\nToday the same thing happened. Restarted modem, no problems. Hmm.\n\n**Update v1.1**\n\nTurns out when connecting to a network my laptop displays \"no internet access\" for the first couple seconds. Modem was fine.",
        "created_utc": 1527643553,
        "upvote_ratio": ""
    },
    {
        "title": "The workers have a real rear for a boss",
        "author": "gunnerclark",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n2lt5/the_workers_have_a_real_rear_for_a_boss/",
        "text": "[removed]",
        "created_utc": 1527627169,
        "upvote_ratio": ""
    },
    {
        "title": "So THAT'S how you do this?",
        "author": "mf9769",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n2e97/so_thats_how_you_do_this/",
        "text": "In my office, anyone can submit tickets into the ticketing system, but usually a manager will do it for their front desk staff or a doctor will call in requesting something for a medical assistant, etc, instead of the person doing it themselves. Games of telephone sometimes ensue. \n\nCharacters\n\n$Doctor - a doctor in our practice. Relatively young guy, very computer savvy, and super easygoing. Basically an absolute joy to work with. \n\n\n$MA - his assistant that he's been working with for years at several practices and who has now been hired by us at his request. \n\n\nI received a call from $Doctor that his $MA couldn't access a certain part of our EHR that he could, but that he needed her to access in order to get this part of his job out of the way, so he could see patients. He explained to me that the only difference between his workstation and hers is the fact that he has firefox installed and uses the EHR in that browser, whereas she uses internet explorer and does not have the option of using firefox. Thus, he believed that it was a browser issue (common to $crappyEHR, and part of the reason she uses IE instead of firefox/chrome is that the $crappyEHR's specimen label print function only works properly in IE). He did not check what she was doing, as he trusts her due to their years working together. \n\n\nI came down to his department in person, as I was doing my daily check of how things were in the building anyway, and had him show me what he needed her to do. Having confirmed that this is something she needed to be able to do, I went to the room she was working from, opened IE under her username and password (she entered herself) to confirm she couldn't and...proceeded to perfectly replicate the exact same thing $doctor had just done in Firefox, with $MA and $doctor looking over my shoulder as I did so, to which he answer was to $doctor that she'd told him not that she couldn't do it, but that she didn't know how. Explained what to her again, and walked out.\n\ntl;dr: game of telephone in IT support. Fortunately easy resolution. ",
        "created_utc": 1527625610,
        "upvote_ratio": ""
    },
    {
        "title": "My iPad is in the wrong language.",
        "author": "Deezl-Vegas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n245z/my_ipad_is_in_the_wrong_language/",
        "text": "[removed]",
        "created_utc": 1527623606,
        "upvote_ratio": ""
    },
    {
        "title": "THAT's why it stopped working...",
        "author": "Saturn_5_speed",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n14k2/thats_why_it_stopped_working/",
        "text": "Not exactly a tech support story, but seeing as how I became my family's tech support guy later on in life, i see this as my baptism.\n\nIn the mid 90's, my father bought our first computer. It was a ZEOS 486 and came with a 3.5\" Floppy Drive, a 5.25\" Floppy drive, and a CD-Rom that you needed special cases to use. (You inserted the CD into a tray that had a flip-top lid and the bottom opened up like a floppy exposing the bottom of the CD)\n\nIt was my first exposure to software and hardware because I sat with my father as he Installed new hard drives, RAM, windows 95 etc...\n\nSo the computer lasted well into the 2000's and when my family upgraded to a Dell with Windows XP, the ZEOS became mine... and my brother's.\n\n\nThe machine was a workhorse. I wrote most of my papers on it, played a bunch of DOOM and loaded it up with all the music it could hold... until one day... one day it just stopped working.\n\n\nIt would boot to the windows 98 desktop, freeze and die. Regularly. I messed with it for weeks before I considered it dead and gave up. My father recommended we drill a hole in the hard drive before tossing it so I began taking the machine apart. I had the hole in the hard drive when I decided to see how a floppy drive worked.\n\nI pried open the 5.25\" floppy drive and saw..... a CD... My brother in his infinite wisdom shoved a CD into the floppy drive. (commence crying)\nI could only imagine that the machine was trying to read a CD via the floppy drive and didn't much like the fact that it couldn't do so.\n\nMuch to my dismay the hard drive was already toast and my computer disassembly technique had not been established yet; the final nail was driven into the coffin.\n\n\n\nRIP ZEOS",
        "created_utc": 1527616330,
        "upvote_ratio": ""
    },
    {
        "title": "Co-worker passive-aggressively demands tech support for homebuilt PC. Hilarity ensues.",
        "author": "TheITCustodian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8n0jq0/coworker_passiveaggressively_demands_tech_support/",
        "text": "My co-worker in our manufacturing systems programmer. We'll call him $Eyore, because he sounds like Eyore when you ask him to do something. \"*sigh* Oh, bother...\"\n\n$Eyore is not a very good programmer.  I'm a terrible programmer, and I know it and avoid code grinding when and where I can, which is why I'm an IT systems guy. \n\n$Eyore is a poor programmer and thinks he's great, and thinks his greatness extends into other areas of IT-ish-ness, like his home PC.\n\nOver the last two weeks or so, $Eyore has been over in his cube talking to his son on the phone, figuring out a new PC he wants to build. Then, he'd ask me \"Whats your opinion on AMD vs Intel?\" or some other similarly rando question. Shop talk. OK. Whatever. At first you're polite, but then, as you'd expect, the floodgates open. \"What kind of SSD should I get? Whats the difference between 6Gb and 3Gb SSDs?\" \"What an Intel Optane memory module?\" \"Do you think I should get onboard video?\" \"Whats a good cooler fan setup?\"\n\nNow, I've built PCs for home but I've really gotten to the point these days where I tell someone who asks me about building a PC \"Go to this mom &amp; pop computer store, or TigerDirect, and get one of their barebones kits with the CPU combo you want, then add to it.\" That usually shuts people up.\n\nNot $Eyore. It just made it *worse*.  $Eyore orders all the parts for his super stupendo PC build, and they start arriving late last week. I hear his running commentary over the cube wall \"Oh, the mother board just showed up\" or \"I go the wrong RAM, so I need to send that back..\"  Dude, I'm not encouraging you. I'm **WORKING**.\n\nFriday afternoon, he shows up late (most of the company was on holiday, and those that were left were released in the early afternoon) with some long convoluted tale of a trip to the DMV, a forgotten suit for a wedding, misdelivery of one of the PC components and a trip to find the postman, the delivery of the other components, etc, before he finally deigns to show up at the office after everybody, including our boss, has left for the day.\n\n&gt;$Eyore: \"Hey, if I run in to trouble working on this over the weekend, can I call you?\"\n\n&gt;$Me: \"No.\"\n\n&gt;$Eyore: \"Well, I mean, I don't think I will...\"\n\n&gt;$Me: \"And I don't think I'll answer.\"\n\n$Eyore isn't picking up on my tone and if he'd looked over the cube wall, he'd have gotten the \"Fuck you\" face out of me.\n\nHe did call my cell on Sunday, and I was conveniently unavailable. \"Sorry, wife &amp; I were kayaking the lower Congo with Prince Harry and ol' whatshername...\"\n\nSo he schlepps this PC into the building this morning as he comes shambling in the door.\n\n&gt;$Eyore: \"I'm having some driver problems.\"\n\n&gt;$Me: \"Don't plug that PC into the network.\"\n\n&gt;$Eyore: \"I'll put it on the guest wireless.\"\n\n&gt;$Me: \"Why do you even have it in here?\"\n\n&gt;$Eyore: \"I wanted you to look at it...\"\n\n&gt;$Me: \"OK, but I need you to code a mobile app for me first. With a database interface.\"\n\n(*woosh* that went sailing over his head)\n\nHe drops the thing on his desk and hooks it up to  a spare monitor and starts fucking with it.\n\n&gt;$Eyore: \"This thing was such a pain to assemble..\" (I hear the POST as Win 10 comes up.. 4 second boot, not bad)\n\n&gt;$Eyore: \"The motherboard wouldn't fit in to the case..\" \n\n(He's clicking the mouse and mumbling about drivers and the guest wifi password)\n\n&gt;$Eyore: \"there's like a radius to the recessed area and the motherboard didn't fit into that raised area, so..\"\n\n(I'm rolling my eyes hard. Jesus, do you not have any professional manners, guy?)\n\n&gt;$Eyore: \"so I had to drill out a little part of the case in the corner of that recess so the mother board would fit...\"\n\nI suddenly perk up.. wait, wut?\n\n&gt;$Eyore: \".. and then I had to go out and get more screws because the screws that came with it didn't fit, so I could screw the motherboard into the case.\"\n\n&gt;$Me: (standing up in my cube) \"Wait, hold on a second. The motherboard didn't fit into the case recess? What do you mean?\"\n\n&gt;$Eyore: (he unscrews the side of the case and points inside) \"Right there. See where I had to drill it out? And the screws that came with it were too short to fit into the holes in the bottom of the case..\"\n\n(I can't really see inside this thing from my cube)\n\n&gt;$Me: (Coming around the cube wall) \"Turn it off. Did you install the standoffs that came with the hardware?\"\n\n&gt;$Eyore: \"What? There were some screws in a baggie..\"\n\n&gt;$Me: \"Shut off the computer, now...\"\n\n&gt;$Eyore: \"Why? Its running OK, I just have some driver..\"\n\nI reach around the back of the PC and click the rocker on the power supply, and then pull the cord.\n\n&gt;$Eyore: \"What did you do that for?\"\n\n&gt;$Me: \"Do you not understand that you basically just shorted your motherboard against the metal of the case?\"\n\n&gt;$Eyore: \"Whaaa?\"\n\n&gt;$Me: \"Take this thing out of the building and put it in your car. This is not your personal tech support place. You want to build computer, fine. You want to ask me a couple questions, fine.  But what you're doing is way, way beyond that and you're taking advantage of professional courtesy.\"\n\n&gt;$Eyore: \"Well, I just...\"\n\n&gt;$Me: \"If you want, I'll call $Boss on the phone and you can explain to him why you're asking me for technical support for your personal computer on company time. You know, the one thats sitting on your desk, the one that doesn't belong to the company? I don't have time for this, I have actual work to do. And I'm pretty sure you do too.\"\n\nThat was 2 hrs ago. I haven't seen him since.\n\nUPDATE: Eeyore (correct spelling, my total bad. I must turn in my Pooh cred..) picked up his machine and shambled out to his car, then hid out someplace in the office, came back to his desk at 5pm, grabbed his shit and left.",
        "created_utc": 1527612017,
        "upvote_ratio": ""
    },
    {
        "title": "I am the great and powerful OZ!",
        "author": "mountainwombat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8myr94/i_am_the_great_and_powerful_oz/",
        "text": "I normally don't do this sort of thing but  sometimes you just have to go for it!\n\nI was visiting the home of an old client  trying to drum up some business from him \\(I hand delivered a quote for a new server\\).\n\nHis son approached me and asked if I had a spare USB lead in my car. It seems he was installing a small laser printer for his dad and it was not going well. \n\nThe lad was around 14 and had  almost done it correctly. He had set the printer up, and run the install disk to  setup the driver on  the pc,  but it wouldn't  connect with the wireless network and he thought that he would have to use a USB lead to program the printer, and naturally there wasn't one in the house.\n\nI winked at his father then held my hands up and said\n\n\"I am Mountain Wombat. A great and powerful  network  wizard!  TALK!!\"\n\nI placed one hand on the printer and the other on the  router and after about 15 seconds  the setup software reported that the printer had connecter to the network.\n\nThe boy looked down t the printer, then up at me looking confused and a little in awe.\n\nBoth his father and I  tried to keep a straight face but we both started laughing. After a minute or two I showed him the CONNECT button on the printer and the WPS button on the router. It only took a few seconds to explain that  pushing these two buttons let the  printer connect itself to the network.\n\nTLDR: sometimes printers are magic",
        "created_utc": 1527597507,
        "upvote_ratio": ""
    },
    {
        "title": "Yes boss, the failover works.",
        "author": "slazer2au",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mv1a6/yes_boss_the_failover_works/",
        "text": "Been a while since I have posted from the wonderful world of Australian WISPs\n\nStory participants\nMe: Slazer\nBoss: the boss\nT1: Tech 1\nT2 Tech 2\n\n---------------------------------\n\nBackstory\n\nThe boss is all about redundancy and backup. If he finds a single point of failure that I have missed he lets us know and sets a time frame for when he wants it resolved along with a when the failover testing should be done.  Because an untested backup is worse than no backup.\n\n---------------------------------\n\nTo spare the boring BGP details\n\nWe have 2 data centres in our closest state capitol. With transit multihomed transit through a single level 2 carrier (while not true multihomed we have transit of last resort through one of our layer 2 customers). \n\nOne day the boss arrives in the office around 10:30 AM after being in a huff about hearing of a major outage in a competitors network.\n\n&gt;Boss: Slazer, did you get our traffic balanced over our 2 transit paths like we discussed a while ago?\n\n&gt;Me: Yes, DC1 advertises prefix 1,3,5 and the aggregate. DC2 advertises prefixes 2,4,6 and the aggregate.\n\n&gt;Boss: What happens when one of the transit fails?\n\n&gt;Me: I am advertising the DC2 prefixes out DC1 with the backup BGP community. Then doing the same thing for DC1 prefixes over DC2.  In the event of a transit failure the upstream has a backup path ready to go.\n\n&gt;Boss: and it works?\n\n&gt;Me: Yes, last time I tested it was about 2 or 3 months ago and it failover over correctly.\n\n&gt;Boss: Why haven't you tested it sooner? \n\n&gt;Me: RANCID hasn't reported a configuration change since the last test.  I only test it if there has been a config change on and of those routers.\n\n&gt;Boss: But how can you be sure it still works?\n\n&gt;Me: Shall I force a failover now to show it works?\n\n&gt;Boss: Sure.  (which I assume he said with sarcasm) \n\nMe: *Starts logging to DC1 core router*\n\nT1 seeing me do my configuration change face.\n\n&gt;T1: If you are doing that I am going for a break.\n\nI shutdown our transit interface for DC1 and wait for BGP to time out.\n\nAfter about 10 min with no calls the boss turns around and continues the conversation.\n\n&gt;Boss: So when will you be testing the failover?\n\n&gt;Me: We are, right now.\n\n&gt;Boss: What??!! *as his face drops.* \n\n&gt;Me: You agreed. Plus this way now you know for sure it works because the phones haven't started ringing.\n\n&gt;T2: Slazer is right.  The graphs show how an increase in traffic on DC2 transit.\n\nBoss slides over to T2 desk. Sure enough, the graph for DC1 transit is reading zero traffic and the graph for DC2 is showing all the transit traffic for the state.\n\n&gt;Boss: That doesn't looks like much traffic. \n\n&gt;Me: Only about 20-30% of our traffic goes via Transit, the rest goes via the various IXs we are on.\n\n&gt;Boss: Who don't we get via the IX?\n\n&gt;Me: Customers of our transit provider who aren't on any IX, Telstra and Optus as they aren't on any IX, and any international site that doesn't use a CDN.\n\nWe continue discussing for a good 20 - 30 min about where we get various traffic from and further redundancy in the core networks. During which time T1 returns from his break.\n\n&gt;T1: Phones are quiet?\n\n&gt;Me: Yes.\n\n&gt;Boss: Can you turn the DC1 transit back on?\n\nI walk back to my desk and turn the transit interface back on and see the BGP peer back on.  While T2 and the boss are watching the graph for DC2 transit it drops about 2/3 of traffic and that appears back on DC1 transit.\n\n-----------------------------------------------------\n\nAnd from that day the Boss hasn't asked about the transit failover because now he knows it works.",
        "created_utc": 1527556323,
        "upvote_ratio": ""
    },
    {
        "title": "Reset Does Not Equal Reboot",
        "author": "Torngate",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mto0u/reset_does_not_equal_reboot/",
        "text": "The Players:\n\n\\~$Me \\- Pretty obvious, it's me.\n\n\\~$Site \\- A website, database, hosting, and associated services all wrapped into one.\n\n\\~$OldTech \\- The previous owner and tech of the site, who ran the whole thing.\n\n\\~$NO \\- New Owners of the site, trying to rebuild. Eager and Clueless.\n\nWho am I?:\n\nI'm me, obviously, I do freelance \\(And usually unpaid\\) basic IT work for my friends and acquaintances. Think, Virus removal, basic program issues, speeding up and bare\\-level maintenance on machines. I was a user of $Site, and at the time had no experience with SQL, PHP, or the like... all of which will come into play.\n\nBackground:\n\n$OldTech has \\[THING\\] requiring he drops out of $Site fully, leaving the site and server \\(full access, dedicated host\\) in the hands of $NO. Chaos Ensues.\n\nThe Story:\n\nSo this was a while ago, but I'm new around here so I'll do my best to recall it all as faithfully as I can. $OldTech has sudden events in their life, leaving them out of the loop fully on $Site. Until this point in time, the site's been buggy as hell, with errors everywhere. $OldTech had been trying to work on finding the source, but everything he did was causing more errors. However, due to his other events in his life, he has to leave. No contact whatsoever\\- and leaving $NO in charge. $NO consists of a two\\-person team, both with absolutely no experience in the matter and both very, very confident in their abilities, who are raring to go.\n\nSo go team, go enthusiasm. They do PR well, explaining what they can about $OldTech departing the site, and about them doing the best they can to pick up where he left off. Unfortunately, one of the more major issues flares up \\(Issue with how PHP is sending information to the database, caused by out of date software and an utter refusal to update\\) and the site crashes. More appropriately, the database just stops responding to queries due to some load limit that $OldTech setup, and so users are greeted with a blank white page, no data or error code or anything.\n\n$NO, being the clueless but enthusiastic pair that they are, dive into the back of the server. They're able to get into the web dashboard, a glorified CPanel\\-esque solution, and look through. To their credit, they found the PHP error log and diagnosed the issue as something with the database. As the hosting solution in play at the time was an unmanaged host, they don't pull in any professional techs or seek help from the userbase. They want to keep the impression they have things under control, and so don't let on to us they really have \\*no idea\\* what is going on. This leads to a conversation I can only assume went something like this between $NO 1 and 2:\n\n\\&gt;$NO1, over Skype: OK, so it looks like we have to restart the database or something. Is there a button that says 'Restart'?\n\n\\&gt;$NO2, looking at the web dashboard: Uhhhhhh.... yeah. Something like that. \\*Click\\*\n\n\\&gt;$NO1: In the database section, right?\n\n\\&gt;$NO2: Oops...\n\nIn the span of a few moments, from what it sounds like, Restart sounded a lot like Reset. As in, Format. With the push of one button, $NO had ordered the server to be wiped, including web files, databases, the Cpanel, and all other data pertaining to $Site. Gone. No backups, nothing. I later come to find out $OldTech hadn't taken any backups for over two years and had just been running one live copy. I know, Cringe.\n\nSo $NO almost immediately realizes what they just did, and look in vain for a way to fix it, including contacting the hosts directly. Alas, unmanaged means unmanaged, and their response was along the lines of \"Sucks to be you\", but of course I'm paraphrasing here. This is where $NO1 decides it's time to bring in extra help\\- consisting of me. Somehow they knew I did a little tech support, and give me a call. They're calling from MST and I'm in EST, so this call is rather early in my morning. I then get what is so far one of the longest phone calls of my life, as they fill me in on what monster they have just created and finish with something to the effect of \"help plz\". Having nothing better to do in the near future, I agree to help them and ask for any information they have.\n\nI get the following:\n\nOne Email address, no password\n\nOne Web Host account, with password\n\nOne Domain Management account, with password\n\nPaypal account out of which to pay for whatever we need\n\nThe first thing I do is note that the password for the web host and the domain is the same. I try it on the email account and thank my lucky stars that the password policies were so bad. It's the same password, and I get in. However, this just begins what takes up my next week. I take inventory of what I have, and the tasks I have to complete.\n\n1\\) Find out how the site \\*had\\* been hosted up until the moment of deletion, including software, database type, and requirements\n\n2\\) Collect any assets I can find on the web \\- Images, text, webpage files... you get the idea. Wayback machine becomes my friend, and I set $NO2 on the case, with very clear instructions. Success is moderate because about a year earlier $OldTech had banned all bots from the server, including the Wayback Machine's bots, meaning no archive exists of recent data. I am peeved.\n\n3\\) Begin to figure out for me WTH any of this stuff is. I've never seen anything like this before, and yet of the site users, I'm the most tech\\-savvy. I inform $NO's about this, but they tell me to go ahead\\- It's not like I can screw it up worse.\n\nSo I spend my day finding out all I need to know about web hosting and the software required. I also figure out that we were paying for a lot more than we needed\\- a whole dedicated server might have been needed back when $Site was founded around the mid\\-00's, but nowadays we could downsize significantly. I'm also not ashamed to admit I asked some pretty dumb questions on the internet, trying to figure out this stuff. By the next morning, I am able to figure out the software that was the forum host, Language \\(PHP\\), Database type \\(SQL\\), and minimum server requirements. I also find out, unfortunately, that without a proper SQL backup everything on the forum is lost and it'd be impossible to recover. They tell me they'll see what they can do and I head to bed.\n\nCue next morning. I log on and look at the chat log. They'd pulled some strings, and gotten in contact with a guy who knew $OldTech's sister, and through some arcane arts managed to acquire the last backup taken by $OldTech before his departure. I'm super psyched, and take a look at the file they send, after uploading it through Skype's horrible file transfer system. I then look at the filing date and die a little on the inside. XX/XX/2014. We've lost two years of data, from the time this database backup was taken, but according to $OldTech's sister, she'd talked to $OldTech and he'd not updated since then, because apparently \"The Updates Broke Things\". Also included is the critical assets\\- logos, landing pages, etc. I ditch a lot of the junk data in the files, such as images and assets not used in approximately forever, and upload the database, 'hook it up' so to speak and finally get into the site, thank you StackOverflow. It's all working, albeit with a bunch of errors, a few thousand filling in a minute.\n\nSo, I begin to take it logically. I start by uninstalling every single modification on the server and restoring it to the 'core' version of the forum software. I also drop about a half\\-dozen tables from the database, of information that is no longer used and should have been trashed a very long time ago when older mods were removed. I then make it a point to look at the version of the software the database was running on and that I have it running on. We'll call the current updated version X.14 and the version we were running... X.8. I dutifully inform $NO's about the status of what we have, and recommend to them that we try to update things now that older modifications have been removed. They greenlight the plan, and I begin to try and update. The update goes through fine, and I don't bother to ask why. I then begin to re\\-add some of the modifications that let the site be how people like it. A lot of the modifications are out of date, so I chalk up all the errors to a sheer lack of maintenance and phobia of general maintenance.\n\nLong story short, around five hours later I've implemented what I've figured to be a reasonable conclusion. $Site has been restored on a new host, with a \\*religious\\* backup scheme, which I perform every week and distribute to the now\\-three person $NO team. I also have set up different passwords across the Email, Money, Domain, and Host accounts and require $NO's to change them every two months. Updates are also required, and new data integrity procedures were put in place. While we lost two years of data, the group has recovered remarkably well, and somehow they decided to keep me on as the head tech, despite as aforementioned not having known the first thing about the responsibility I had just inherited.\n\nSo that's the story of how I got started in working IT for people... and somehow took over a small web community's tech support in the process.\n\nEDITED: Spelling and Grammar. Apologies for awful formatting.",
        "created_utc": 1527543941,
        "upvote_ratio": ""
    },
    {
        "title": "Stupid Moving Story",
        "author": "LowerSeaworthiness",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mtkui/stupid_moving_story/",
        "text": "[removed]",
        "created_utc": 1527543195,
        "upvote_ratio": ""
    },
    {
        "title": "Copy/paste",
        "author": "djtiez",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mtfmn/copypaste/",
        "text": "Hi boys and girls!\n\nFirst post on r/talesfromtechsupport so forgive me if I mess up but i had to share this one.\n\nI’m a 29yo tech support engineer from the Netherlands.\n\nThis particular story is about a customer who calls daily and never fails to prove that everyone can start a business and even be successful even when they have an IQ of room temperature (that joke is funniest in Celsius) \n\nI’ll go with a simple $me and $him for this story. \n\n$me hi this is $me speaking, how may I help you?\n\n$him yeah this is $him I’m having trouble transferring a file from one pc to the other... ($him proceeds to explain into extreme detail what the document is and why he needs it on the other pc... why do people do that...)\n\n$me can you tell me how you are trying to transfer the file? Is it by e-mail, your home drive or maybe an other shared network directory?\n\n$him no I just put the thingy in the usb and copy it, then I put it in the other pc but it’s not working. \n\nYes, it baffles the mind how someone can have a successful taxi company with over 30 cars in service and not be able to use an USB drive to copy a file.  At this point, I know I’m not going to be able to explain how this works just by telling him. I have to show him. \n\n$me ok can I use $remote-control-software on both pcs to see what’s wrong? \n\nHe proceeds to give me the info and i’m looking at the users desktops. pc1 has a explorer window open with a file selected, as you would expect in this situation.\n\n$me can you tell me step by step what you do to copy this file?\n\n$him yeah I copy it by rightclicking it and then I unplug the USB and plug it in the other pc and it’s not working!\n\nI notice he’s getting a bit frustrated. \n\n$me that sounds like how it should work, can you show me?\n\nWhat happened next blew my mind. He right-clicks on the file on pc1 and clicks [copy]. Then I hear the sound of something being unplugged, him walking to pc2 and something being plugged in. He then right-clicks on the empty desktop and tries to press [paste]. Now it’s dawning on me...\n\n$me can you tell me specifically what you just unplugged out of pc1 and into pc2?\n\n$him what to you mean? The USB cable to my mouse. \n\nTurns out this guy thought that by right-clicking on the file and copying it, it would be stored on the mouse. He then unplugs the mouse and walks to the other pc to plug it in, only to discover his file had mysteriously disappeared. \n\n EDIT: For the people thinking this should be a legit function, check out the comments, some reactions contain hardware/software solutions for this ‘problem’. ",
        "created_utc": 1527541996,
        "upvote_ratio": ""
    },
    {
        "title": "Headbanging learning curves",
        "author": "networkedquokka",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mstv2/headbanging_learning_curves/",
        "text": "Just a quick vent of a frustration.\n\nI use a remote connection to provide the vast majority of support. Life is good when I can jump onto a user's computer and actually viewing the screen to see exactly what error message is being displayed, or what button they are clicking or any of the other basic issues.\n\nI ask only one thing of the users: they have to give me the workstation ID. It isn't hard to find, a shiny, bright, red, metallic sticker on the front of the machine with an ID number on it.\n\nI can't count the number of times that I have to explain to users what a workstation ID is and where to find it. \n\nMe: May I have the machine's ID please?\n\nThem: What's that?\n\nMe: It is the number on the red metal tag on the front of the machine.\n\nThem: Where can I find it?\n\nMe: Right on the front of the machine.\n\nThem: (sometimes) Oh, I had to move my coffee cup (me: cringe).\n\nThem: (sometimes) I don't see any numbers on the computer. Hang on, I found this thing on the back that starts with S/N, is that what you want?\n\nMe: No, that's not it. Look on the very front of the machine. Do you see anything that is red and shiny?\n\nThem: Yeah, what's that?\n\nMe: What are the numbers on that sticker?\n\nThem: Oh, that's what you want? 123-123456\n\nThe first time with a new user, yeah, I get it. But some of the users have to be reminded *every . single . time* what the ID is. Been here for three years? By now you should know what somebody means when they ask for the machine ID.\n",
        "created_utc": 1527536973,
        "upvote_ratio": ""
    },
    {
        "title": "We Don't Service That!!!",
        "author": "8l4ck83rry",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mseep/we_dont_service_that/",
        "text": "## We Don't Service That!!!\n\nHey TFTS!!! Told ya I'd post another because of the mix\\-up with the last one, so here you are! Hope you enjoy! Now, please excuse me, as I'm off to enjoy the 2 day weekend \\(even though Monday is a holiday, support staff never get a break\\)\n\n**The Magic Jack**\n\n**Setting** A client\\-facing service desk, in the biggest municipal area for 120 miles in any direction. The city itself is constantly flooding, or choked in smog, or Imhotep\\-level dust storms. Its boundaries are defined by the “loop”; a circular road on the edge of it. Everything out past the loop looks like a setting from a Mad Max movie. The general population is typically missing some sort of body part, and people usually have more fingers than teeth. Oil is the life\\-blood of the land. And now, the players!!!\n\n**$Me** – $8l4ck83rry\n\n**$MJ** – client that really wants us to service something that we just don’t service\n\n**$TTJ** – one of the bosses at my work; tall, thin, and a jerk\n\n**$PokeTrainer** – one of the nicest people I’ve ever had the pleasure to work with; he’s gonna catch them all!\n\n**$Joker** – second most experienced tech we have; when he starts laughing, he can’t stop, and it sounds IDENTICLE to “The Joker” as voiced by Mark Hammil\n\n**$Pineapple** – the most experienced tech we have; the reason I got into IT to begin with\n\n**$SnappleFacts** – Imagine if you had a Hefty bag filled with Snapple caps, then wished on it to be a tech; this would be the result. He’s \\(both\\) least experienced AND most senior tech we have; it’s not a perfect world\n\n**$DaleGribble** – one of the tier 1 helpdesk techs; he “knows” that your tv has a mic in it, and it’s recording you\n\n**$Snickers** – another tier 1 helpdesk tech we have; always laughs like Beavis/Butthead, and is really REALLY bad at flying drones\n\nAt this time in my career, I’m attached to an IT service desk, but \\(strictly speaking\\) I don’t IT. Instead, I do Operations, and I help out with the customer\\-facing warm\\-and\\-fuzzy lip\\-service/check\\-in process you would come to expect of a retail giant. In fact, I’m quite new at this time, and I was determined to make a name for myself. Prior to this point, I learned a little bit of Chinese and Italian, but it all amounted to nothing more than what the obnoxious guy at a party does when he knows a dumb magic trick and feels lonely \\(“HEY EVERYONE!!! LOOK AT ME WHILE I DO MY MAGIC TRICK!!!”\\). Unfortunately, this did NOT work to my advantage \\(who would’ve guessed\\).\n\nOne day, **$TTJ** stuck his head into the workshop\n\n**$TTJ**: Has anyone helped this client?\n\n\\*all personnel stare blankly at the solid wall that he’s pointing at, wondering if we should tell him that we can’t see through matter\n\n**$PokeTrainer**: We didn’t know anyone was there. \\*smiles awkwardly and points at the same wall **$TTJ** is pointing at\\* There’s a wall there.\n\n**$TTJ**: \\*abruptly\\* Well, can someone get out here now?!?\n\n**$PokeTrainer**: Ok, I’ll go right now.\n\nA few minutes pass, and **$PokeTrainer** comes back to the workshop with a beleaguered expression on his face\n\n**$PokeTrainer**: Does anyone in the store know Chinese?\n\n**$Pineapple**: \\*chuckling\\* What?!?\n\n**$PokeTrainer**: Yeah, the lady out here wants us to do something, but I think she speaks Chinese as a first language, and her English is *really* bad.\n\n**$Pineapple**: \\*shakes head\\* Nope. No one here speaks Chinese\n\n\\*I over\\-hear **$Pineapple**\\*\n\n**$Me** – I speak Chinese!!!\n\n\\^ Mistake 1\n\n**$PokeTrainer**: Well, can you come out here and help me with this client? I can’t understand her.\n\n**$Me**: Sure thing!\n\nWe walk out to the first desk \\(yes, our help desk was a series of ACTUAL desks\\) and there sits a woman with an expression on her face that is equally blank and worried \\(idk how she did that\\), staring unblinkingly at us, almost as if we should already be fixing her issue.\n\n**$PokeTrainer** – Ok ma’ma, this is $8l4ck83rry, and he should be able to help you from here.\n\nIt should be noted that I didn’t find out from **$PokeTrainer** what was wrong to begin with.\n\n\\^ Mistake 2\n\n**$Me**: Hi there! I’m $8l4ck83rry! How can I help you today?\n\n**$MJ**: I want you help\n\n\\*struggles past bad grammar\\*\n\n**$Me**: You want me to help? Ok, with what?\n\n**$MJ**: I want you help this.\n\n\\*Client holds up plastic grocery bag with something in it\\*\n\n**$Me**: Ok, I’d be happy to do that for you! What is it?\n\n**$MJ**: I want you help this. Help computer.\n\nThe client then places the bag on the desk, and pulls a giant macbook from her tiny purse. Now, even more confused by the unexpected display of M. C. Escher physics I was just subjected to, I press on\n\n**$Me**: Ok, is something wrong with the computer?\n\n**$MJ**: Yes\n\n**$Me**: Ok, what’s wrong?\n\n**$MJ**: Fix it!\n\n\\*groans internally\\*\n\n**$Me**: Don’t worry, I will definitely fix this for you!\n\n\\^ Mistake 3; my fate, at this point, is sealed\n\nAfter about 20 more minutes of back and forth, I finally find out why she brought the shopping bag. In it, she stuffed a corded POTS phone, with phone line, and a Magic Jack.\n\n**$Me**: Ma’am, this is a Magic Jack.\n\n\\*Client looks at me like I’m from the moon\\*\n\n**$Me**: We don’t service this.\n\nRealizing that she’s about to hear something that she doesn’t want to hear the client begins again.\n\n**$MJ**: You fix!!!\n\n**$Me**: I can check, but I’m pretty sure we don’t do this.\n\n**$MJ**: You fix!!!\n\n**$Me**: Ok, I’ll go check\n\nWalks to workshop\n\n**$Me**: We don’t service Magic Jacks, do we?\n\n**$Pineapple**: No…\n\n**$Me**: I thought not.\n\n\\*Heads back to client\\*\n\n**$Me**: No ma’am, we can’t help you with that.\n\n**$MJ**: You fix!!!\n\nThis went on for about 30\\~45 more minutes, ending with me finally able to get her out of the store. Afterwards, I head back to the workshop.\n\n**$Snickers** &amp; **$PokeTrainer**: What was that about?\n\n**$Me**: **$MJ** wanted me to setup a Magic Jack…\n\n**$Snickers**: HAHAHA!!! WHAT?!?\n\n**$PokeTrainer**: But we don’t do that! No one does that!\n\n**$Me**: Yeah, I told her. That was kinda nuts.\n\nFast forward 2 days…\n\n**$Snickers**: Hey $8l4ck83rry, there’s someone out here who wants to see you.\n\n**$Me**: They asked for me by name?\n\n**$Snickers**: Yeah! It’s **$MJ**, and she brought the Magic Jack with her again!\n\n**$Me**: But I told her we don’t work on those!\n\n**$Snickers**: \\*incomprehensible laughter\\*\n\n**$Me**: Ok, I’ll go handle it.\n\nI speak with **$MJ** again, and after spending another 40 minutes, I convince her that we cannot and will not service this device for her. I also look up and provide her with the customer service number for Magic Jack, and suggest that she call that number for help configuring the device. Afterwards, I walk back to the precinct.\n\n**$DaleGribble**: What was that about?\n\n**$Me**: A troublesome client. She keeps wanting us to service a Magic Jack.\n\n**$Snickers**: \\*starts a new round of incessant giggling\\*\n\n**$SnappleFacts**: I’m pretty sure we service that.\n\n**$DaleGribble**: No. No we don’t. \\*turns towards me\\* Tell her to leave right now.\n\n**$Me**: I already handled it. I think she got the point this time.\n\n**$Joker**: Did you give her the customer service number?\n\n**$Me**: Yeah. That’s all I could do.\n\n**$Joker**: Ok, let me know if she comes back. I’ll handle it next time.\n\n**$Me**: Thanks man.\n\n**$Snickers**: \\*doesn’t stop laughing\\*\n\nFast forward \\~ 1.5 weeks\n\nI’m walking through the store, making my rounds in the different departments, trying to be helpful and learn as much as I can about everything, when **$TTJ** walks up to me.\n\n**$TTJ**: Hey, got a minute?\n\n**$Me**: Sure! What’s up?\n\n**$TTJ**: There’s a client here that has an issue with a laptop battery. She speaks Chinese, and says that you helped her before.\n\n**$Me**: \\*not putting 2 and 2 together\\* Ok, I’ll be right over!\n\nSure enough, its **$MJ** again, complete with giant macbook and shopping bag filled with everything as before. On seeing me, her appearance sinks a little, because she already knows what I’m going to say.\n\n**$MJ**: Oh, hi. You fix? \\*raises bag with corded phone and Magic Jack\\*\n\n**$Me**: No, sorry. We don’t service that. Have a nice day.\n\n**$MJ**: Oh, ok.\n\nI realized at that point that there are some users that will continue to think that they know better than the tech, despite the obvious being glaringly true. This lesson would be re\\-enforced repeatedly throughout my career.\n\nTL;DR Some people won't take no for an answer",
        "created_utc": 1527533465,
        "upvote_ratio": ""
    },
    {
        "title": "\"We bought these servers from you and they all have the wrong specifications!\" \"... Are you sure about that?\"",
        "author": "really-likes-tea",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mr307/we_bought_these_servers_from_you_and_they_all/",
        "text": "Hi there, TFTS! Reading [this story](https://old.reddit.com/r/talesfromtechsupport/comments/8mfz4w/dont_order_any_upgraded_equipment/) reminds me of something that happened a while ago. This happened a long time ago, I didn’t remember the exact dialogue and everything, but the gist of it should be accurate.\n\nI used to work for a B2B Internet Service Provider as my first real job, way back in the beginning of this decade. No longer a lowly L1 Helpdesk, I worked at the $ISP’s Systems Integrator division (Not sure how common this is in other countries, but here, almost all large ISPs have their own Systems Integrator division, some even has Cisco’s Gold Partner certification.) as a pre-sales engineer. \n\n\nIt was a fairly slow day, I was trying to look busy while sipping a cup of builder’s tea at my desk when I saw a new email addressed to me:\n\n&amp;nbsp;\n\n&gt;From: $Manager\n\n&gt;To: $Me\n\n&gt;Cc: $Salesperson\n\n&gt;Hi $Me,\n\n&gt;Can you help with $Salesperson’s request? Shouldn’t be too hard. \n\n&gt;Cheers,\n\n&gt;$Manager\n\n&amp;nbsp;\n\nBelow that, I saw some back-and-forth email between $Salesperson and $CustomerIT. As a background, $Customer is a household brand that you will see at least a few times a day. Apparently, they were deploying a new application for internal use, and was looking to purchase some servers. \n\nFair enough, I don’t normally work with server opportunities since I’m more of a network guy, but this doesn’t seem to be that complicated. So I called $Salesperson on her cell. \n\n&amp;nbsp;\n\n&gt;$Me: Hey $Salesperson, it’s $Me from pre-sales\n\n&gt;$Salesperson: Hi $Me, I saw $Manager’s email. Do you need anything?\n\n&gt;$Me: I need to clear some stuff with $CustomerIT, can I contact him directly?\n\n&gt;$Salesperson: Go ahead, just jump in to that email thread. \n\n&gt;$Me: Thanks, I’ll call you once I have a quote\n\n&gt;$Salesperson: Hey, thanks for asking. \n\n&amp;nbsp;\n\n&gt;From: $Me\n\n&gt;To: $CustomerIT\n\n&gt;Cc: $Salesperson; $Manager\n\n&gt;Dear $CustomerIT,\n\n&gt;Hi, I’m $Me who will be working on this request, I understand you are looking to add a few servers. May I know more about your specific requirements? I tried searching for $Application’s system requirements but can’t find much information.\n\n&gt;Thanks,\n\n&gt;$Me\n\n&amp;nbsp;\n\n\n&gt;From: CustomerIT\n\n&gt;To: $Me\n\n&gt;Cc: $Salesperson; $Manager\n\n&gt;Hi $Me,\n\n&gt;Yeah, you won’t find much about that. I think we’re one of the only few people crazy enough to buy them (*Of course, he was much more diplomatic about this than __I__ was*). I attached the requirement from $Appvendor for your reference. Also, I won’t be needing any engineering services from you, just make sure it boots before delivery. We need to be up and running in two month’s time. \n\n&gt;Cheers,\n\n&gt;$CustomerIT\n\n&amp;nbsp;\n\nThe requirement itself was pretty big for the time but wasn’t really crazy either. Three servers, dual socket Xeons, lots of RAM, a couple of spinning disks. I was a bit worried about delivery time, but I fired an email to the usual suspects (Dell, HP, IBM) for a quote. \n\nA couple of days later, I sent the three quotes to $Salesperson to give $Customer a couple of options and proceeded to move on with my life. \n\n&amp;nbsp;\n\n******\n&amp;nbsp;\n\nA few weeks later, I was about to make a cup of tea when I realized my stash is empty. This cannot be a good sign.\n\n&amp;nbsp;\n\n&gt;From: $Manager\n\n&gt;To: $Me\n\n&gt;Cc: $DivManager, $SalesDirector\n\n&gt;Hi $Me,\n\n&gt;You worked on $Customer’s opportunity a while ago, correct? We received quite a lively complaint from $CustManager about the server we provided. Could you tell us what exactly happened on your side?\n\n&gt;Cheers,\n\n&gt;$Manager`\n\n&amp;nbsp;\n\nI highly respect $Manager for a lot of things, but his calmness under pressure and his penchant for understatement are definitely somewhere on top. While he said ‘lively complaint’ what truly happened in the email thread preceding it is closer to ‘on-chair bowel evacuation’ for $SalesDirector \n\nApparently we had sent $Customer -who is now just few days away from deadline-  a server with the wrong specification. $CustManager even sent us screenshots of the servers’ specification. All of them are woefully below what I remember was required. Hell, I’m sure my gaming PC back then was faster than any of those three. I felt my stomach turning. But after I checked my email history and submitted BoQs, I was reasonably sure I was in the clear. After a few more rechecks, I braved myself to reply. \n\n&amp;nbsp;\n\n&gt;From: $Me\n\n&gt;To: $Manager\n\n&gt;Cc: $DivManager; $SalesDirector; $Salesperson\n\n&gt;Dear $Manager,\n\n&gt;I did work on that opportunity. I think something is wrong, though. The specification screenshots $CustManager sent us is very different from what I sent to $Salesperson (I attached vendor quotes, my quote, and all relevant email)\n\n&gt;Thanks,\n\n&gt;$Me\n\n&amp;nbsp;\n\nNot long after that, a little ray of hope appeared. \n\n&amp;nbsp;\n\n&gt;From:$Salesperson\n\n&gt;To: $Me; $Manager\n\n&gt;Cc: $DivManager; $SalesDirector; $Salesperson\n\n&gt;Dear $Manager, $Me,\n\n&gt;Something is *very* wrong. I actually don’t remember receiving any PO for those servers. I’ll be conferencing $CustomerIT in a moment, can you guys join?\n\n&gt;Thanks,\n\n&gt;$Salesperson\n\n&amp;nbsp;\n\nHuh. \n\n&amp;nbsp;\n\n‘Huh’ was my exact reaction reading this email, I remember this vividly because a few desks away, $Manager made the exact same sound before calling me to join him and $Salesperson.\n\n&amp;nbsp;\n\n&gt;$Salesperson: Hi $CustomerIT, I have $Me and $Manager in this call.\n\n&gt;$CustomerIT: Hi guys, I understand my boss was a bit… \n\n&gt;$Manager: I’d say ‘animated’\n\n&gt;$CustomerIT: … animated earlier today, sorry about that. That’s because we need to present the application to C-Level next week.\n\n&gt;$Manager: Don’t worry about that, $SalesDirector took most of the brunt. I need to ask though, did *__we__* even provide those servers?\n\n&gt;$Salesperson: Yea, I don’t remember receiving any PO for them \n\n&gt;$CustomerIT: You guys didn’t. Our new procurement, bless his noble intentions, decided to shop around for a price comparison. What he should do was confirm with me before issuing PO, guess what he did. \n\n&gt;$Me: Buy from whoever bid lowest?\n\n&gt;$CustomerIT: That he did. If they provided the same specification we won’t be having this conversation. \n\n&gt;$Me: Ouch, what’s your plan for the deadline , then?\n\n&gt;$CustomerIT: Honestly not too sure. We have the application running temporarily on a spare PC we have, but once users start testing I don’t think it will hold. I can’t use any other servers for various reasons. We’re definitely preparing to purchase your original quotation, though. \n\n&gt;$Me: Yeah, that thing will melt. Say, do you really need all three servers to run it? \n\n&gt;$CustomerIT: Two for application redundancy, one for DB, yeah.\n\n&gt;$Me: Can you pull the CPU and RAM from one server and put it in the other server?\n\n&gt;$CustomerIT: Yeah, but won’t it mess with the warranty?\n\n&gt;$Me: Honestly not sure.\n\n&gt;$Manager: We can’t officially recommend it, but I think that’s a valid solution. Better if you can add some more RAM. I’ll check if we have some spare laying around\n\n&gt;$CustomerIT: I’ll try that. I’ll contact you guys later.\n\n&amp;nbsp;\n\nThe servers we quoted originally have two CPUs (eight cores total) and 64GB RAM each. $CustomerIT managed to convince $AppVendor to try and install it on a server with four core CPU and 8GB RAM. That server managed to heroically last through user testing phase (with some noted performance complaints) while we scrambled to prepare the replacements. \n\nIt was a mistake from $Customer’s procurement that cost them maybe an extra $3000-4000 on top of our ~$20000 quote (plus whatever it was to expedite delivery), though still only a drop in the bucket compared to what $Application cost them. \n\nWhat amused me the most was $CustManager's sheepish expression when we met with him after that fiasco. Now that's entertainment.\n\n&amp;nbsp;\n\n----\n\n&amp;nbsp;\n\nI have some more stories from my days working as L1 Helldesk that I will post sometime later this week. Meanwhile, you can enjoy my previous stories:\n\n[Yeah, it's on fire \\(Part 1\\)](https://old.reddit.com/r/talesfromtechsupport/comments/8cmt51/yeah_its_on_fire_part_1/)\n\n[Yeah, it's on fire \\(Part 2: The bomb drops\\)](https://old.reddit.com/r/talesfromtechsupport/comments/8cug2i/yeah_its_on_fire_part_2_the_bomb_drops/)",
        "created_utc": 1527522995,
        "upvote_ratio": ""
    },
    {
        "title": "The case of the (not so) missing monitor.",
        "author": "Suurikarhu",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mq8l7/the_case_of_the_not_so_missing_monitor/",
        "text": "Hello i'm your standard FTP LTL also dutch and beginning redditor so forgive any spelling / formatting mistakes.\n\nI'm an intern at this company and I generally do everything from tickets to active directory to taking care of our linux boxes.I like to consider myself fairly  knowledgeable in what I do and am currently mainly looking for hours to put on a sheet.\n\nThis story happened today and is one of the funnier cases I've had since starting my internship.So I work for a small company \\(30\\-60 employees\\) that has its business in resale.The day is going fairly normally with the usual amount of e\\-mail requests when I spot this gem.\n\nSubject: Monitor missing, urgent need for replacement.The e\\-mail basically describes that our Customer Service manager noticed one of the monitors was missing \\(Stolen? Borrowed?\\). Now recently I installed a new monitor for a client that actually had it's monitor borrowed so I figured someone must've taken it again.\n\nCue me walking over to Customer Service with no higher priority requests to investigate.I walk in to their office and do a quick count ... 8 clients, 16 monitors all appears to be in order but just to make sure I call her over and ask which monitor is missing. She immediately points to a client with 2 monitors and stutters\"I\\-i\\-it wasnt there this morning when I walked in ... I must be tired\".\n\nEasiest request of the day and I got a nice chuckle out of it.",
        "created_utc": 1527515967,
        "upvote_ratio": ""
    },
    {
        "title": "I mean, it's not technically wrong to set up your network this way, but...",
        "author": "speckledspectacles",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mpymb/i_mean_its_not_technically_wrong_to_set_up_your/",
        "text": "Had this treat just last week. It was a good reminder to assume nothing, sometimes.\n\nCast of characters:  \n\n* Speckled Spectacles (SS) is our intrepid agent, offering phone support for our next character:\n* The Untechnical but Trying woman (UT). Really, that's all I can ask for from most people.\n* And finally, the product, which I won't go into too much detail on. However, for it to work appropriately, it should be paired directly to your router (not through an extender), and will also only pair on 2.4 Ghz. For setup, we recommend making sure you connect back to 2.4 Ghz after using the hotspot (Usually doesn't matter, but on occasion we've seen it make a difference).\n\nUT gave us a call, saying that she was working on setting up the product, but it kept saying it couldn't connect. Alright. I start going through my standard troubleshooting for when this happens. Part of that is getting the make and model of the router.\n\n&gt;UT: I have a Netgear... Let me see if I can find the model number.  \n&gt;SS: Usually, you'll see a technical information label on the back or bottom that has it listed. Did it come from your ISP?  \n&gt;UT: Oh, there it is! C7000?  \n\nSo we're dealing with one of the few Netgear routers that are also modems. Okay. \n\n&gt;UT: There's also this Apple router? My husband set it up.\n\nOh, hmm. After some probing and testing, I started suspecting that the Airport wasn't actually set up.\n\n&gt;SS: Would you like to try a quick test? Go ahead and unplug the Airport, and see if your network is still there.  \n&gt;UT: Alright... Okay, it's still there on my computer, \"My Wi-Fi Network.\"  \n&gt;SS: Oh... Huh, it almost sounds like the Airport wasn't actually set up? Go ahead and leave it unplugged for now.  \n&gt;UT: That's funny, we've noticed better speeds since we've gotten it...\n\nI mean, that could well be placebo effect. Okay. So we try all of the fixes involving the phone and app, as well as the device itself, so all that's left is the router to look at. I guide her on how to log in to the router settings, intent on splitting up the networks (As there was no \"My Wifi Network-5,\" so to speak). \n\n&gt;UT: Oh, I see where it says SSID for 5 Ghz, but it says Netgear_81-5G?\n\nOh, what. For what it's worth, my support tools give the name of the connected SSID. It was definitely paired to \"My Wifi Network\". And I'd asked earlier about the networks she saw, even... Oh, oh no. I think I see where this is going, I just wasted time by having her unplug the Airport.\n\n&gt;SS: Just to be sure, when you look at the list of wifi networks available, do you see Netgear_81?  \n&gt;UT: Oh, yes, it's there!  \n&gt;SS: Alright, thank you. Quick question. When you unplugged the Airport earlier, did you unplug power from it, or just the ethernet cord going from the Netgear to the Airport?  \n&gt;UT: The ethernet cord.  \n&gt;SS: Ah, so the Airport still has power. Okay. And you mentioned your computer still had internet, but then there's the ethernet cord connecting the computer to the Netgear... Well. Let's go ahead and plug that ethernet cord for the Airport back in. \n\nFast forward a bit, we're looking through the Airport Utility on her Mac. Now, Apple is my biggest weakness. I'm not a fan of them, so usually, when I have to help someone do something on an iOS or MacOS device, I just Google it. The Airport's no exception, really. So I'm still considering the possibility that there's a band-steering issue going on and trying to temporarily split up the SSIDs to guarantee connecting to 2.4 Ghz. Poking through the settings, we check out the Network tab.\n\n&gt;UT: It says the router mode is off, that it's in bridge mode?  \n&gt;SS: I'm sorry, one more time?  \n&gt;UT: There's three options on the dropdown here... DHCP and NAT, DHCP only, and Off (bridge mode). It's Off right now.\n&gt;SS: Oh. Thank you. So...\n\nTheir topology looked like this:  \nCoaxial cable &gt; Netgear modem/router combo (Handling DHCP and NAT, broadcasting networks) &gt; Apple Airport, two feet away from it, acting as a $200 ~~extender~~ wifi access point\n\nWe factory reset the device and paired it to the Netgear network, it worked flawlessly.\n\n**Edit: A lot of people are commenting about having the exact same setup, but very few have the following:**\n\n* The ISP modem/router still broadcasting\n* The second router within two feet of the first\n\nNot to mention lack of knowledge about your own network at the time you call in to support, leaving a phone agent to figure out this setup through your descriptions. ¯\\\\_(ツ)_/¯",
        "created_utc": 1527513225,
        "upvote_ratio": ""
    },
    {
        "title": "\"I keep receiving spam email\"",
        "author": "chief_bighorse",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mnuwy/i_keep_receiving_spam_email/",
        "text": "[removed]",
        "created_utc": 1527486929,
        "upvote_ratio": ""
    },
    {
        "title": "Uncouciously Incompetent",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mmlas/uncouciously_incompetent/",
        "text": "[deleted]",
        "created_utc": 1527472921,
        "upvote_ratio": ""
    },
    {
        "title": "Uh, well if you're going to cut it I can't stop you.",
        "author": "Fearme4life",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ml4v0/uh_well_if_youre_going_to_cut_it_i_cant_stop_you/",
        "text": "I think this is the first time I am ever posting here and I read the rules and I think this could go here. However if I am an idiot I apologize and feel free to delete all my hard work!\n\nSo I am a contracted cable technician for a large very hated isp. I receive a work order labeled \"Special Request Order\" that is outside only and this job states that there is an above ground temporary cable and I should fill out a survey so the line can be dug underground.\n\nNow how this usually works is there is an app that when I am onsite at the job and open the app it automatically fills out all the customer information with the job details and I just submit pictures and answer a couple of yes/no questions (Do we need to go across a driveway or need neighbor access stuff like that).\n\nSo I show up at 5:40pm (I am scheduled to work until 5pm but they gave me this job at 4:55 because it was a no time frame job) and I am SHOCKED at what I find. So there is a white cable coming from our box across the driveway of the house I was here to do the job for, but it did not go to that house. It went past the driveway, past the house, past the yard, past the neighbor's driveway to the side of the neighbor's house.\n\nDue to the way the survey system works I can not submit a survey for his neighbor because I do not have a job for his neighbor. I go and knock on my job address's door and an old slightly overweight man comes to the door. I give him my greetings and explain the situation to him. He becomes incredibly irate because someone ran this line without his permission and its going across his property. He tells me the line needs to be removed NOW.\n\nI call up my supervisor to explain what is going on and my supervisor tells me I can not cut the line because it could be providing phone service to his neighbor and if he needs emergency help his phone needs to be working. Customer overhears and says his neighbor is not home and he does not care and if I wont cut it then he will do it himself.  Since its his property I can not stop him so I have to wish him a good day and I pull away and see him coming out with a pair of shears.\n\nSome notes: I am on mobile writing this on the way home so please excuse any grammatical or spelling errors. Also we are usually not allowed to run lines across other people's property without their consent. It seems a different isp was installing their lines and cut up a bunch of underground lines and the temporary line was ran due to this.",
        "created_utc": 1527458710,
        "upvote_ratio": ""
    },
    {
        "title": "How do I make my password red?",
        "author": "theyounggrif",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8miatb/how_do_i_make_my_password_red/",
        "text": "Here's just a quick story that just happened a minute ago of me being the family tech support.  \nNot too long ago I installed a password manager for my mom, since before that she just wrote all her passwords and logins down in a booklet.  \nShe's been mostly happy with it, but sometimes she comes to me for help when she's having trouble copy pasting it.   \n\nHere's the dialogue of that conversation: \n&gt;mom: I can't copy paste it again, you said the apple password was the same as the icloud one right?  \n\n&gt;me: Yeah that's right, but they are asking for the password of your email, you see?  \n\n&gt;mom: Ah great now it works, thanks. Luckily too, because I didn't have any idea how to make my password red.\n\n&gt;me: Wait what do you mean making your password red?\n\n&gt;mom: Look here, these letters are red and the other ones aren't, I don't know how to type red.\n\n&gt;me: Oh mom no, that's because those characters are numbers and the others ones aren't. It's to make it less confusing when there's an o or an 0.\n\ntl;dr Mom thought she needed to write red characters as her password since her password manager showed red characters",
        "created_utc": 1527433473,
        "upvote_ratio": ""
    },
    {
        "title": "I'm sorry your mom's an asshole too, ma'am.",
        "author": "LineageOSLover",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mgsph/im_sorry_your_moms_an_asshole_too_maam/",
        "text": "[removed]",
        "created_utc": 1527414312,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't order any upgraded equipment!\"",
        "author": "SuperSecretSpare",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mfz4w/dont_order_any_upgraded_equipment/",
        "text": "About a year ago I was in charge of gathering required specs for computer needs and putting in an order for about 500 PCs, monitors, keyboards, mice, etc. for a new office building that was opening that my company manages. Being that I had already done this same quote for multiple buildings, I knew exactly what was needed. The standard PC build from our vendor comes with 4 gb ram. To run specific software, I have to include at minimum 8 gb, otherwise the computer all but stops working. When making the build through our vendor the additional 4 gb of ram only runs us an extra $26. I put the quote together and sent it off to our budgeting department for final approval and ordering. Within the hour I received the following emails from the head of budgeting.\n\nHim: I see you included an extra charge of $26x500 for computer memory?\n\nMe: Yup. We need it to run X software.\n\nHim: Will it run without the extra memory?\n\nMe: Not well\n\nHim: We are already over budget. Don't order any upgraded equipment! Just get the basic stuff.\n\nAfter trying to explain why it was important several times, why the software won't run...\n\nMe (not in the mood to deal with his crap anymore): Sure thing. I will get that quote for you right away.\n\nSo I revised the order without the memory and sent it back to him. A few weeks later, the computers get delivered and are set up in the new offices. I get them all imaged with the software over the weekend and ready to go. First thing Monday morning I come in to a frantic slew of emails about how the specialized software won't run and nobody can do their job. After a few back-and-forth emails with the COO I sent the full email chain with jackass explaining what happened. I am told to immediately put in an order for the extra memory, have it delivered as soon as possible, and get it installed immediately.\n\nBy ordering the memory separately instead of installed initially at $26 per we had to pay an extra $50,000 ($128 per memory stick because we have a horrible non-compete vendor). Not only that, but I got a ton of overtime and the company lost out on a weeks worth of productivity. All in all, the company probably lost close to $200,000 if not more.\n\nHe didn't get fired, but he now has his own policy of ordering what the IT guy suggests, no questions asked.",
        "created_utc": 1527400693,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't order any upgraded equipment!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mfsv9/dont_order_any_upgraded_equipment/",
        "text": "[removed]",
        "created_utc": 1527398136,
        "upvote_ratio": ""
    },
    {
        "title": "On the subject of mentoring...",
        "author": "Kinowolf_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mf0ht/on_the_subject_of_mentoring/",
        "text": "Reading the tale by u/Theory_of_Steve reminded me of a similar mentoring tale from my days of helpdesk.\n( https://www.reddit.com/r/talesfromtechsupport/comments/8mc9ue/training_my_replacement/ )\n\nBackground: tier 1 helpdesk supporting tax software, for both the online site and as a purchasable suite. Some of us got the 'privilege' of having other people buddied to us for them to listen to our calls as a training tool. Generally this went fine. However..\n\nEnter: I honestly can't remember her name, but picture the typical \"I want your manager\" hair bob attached to someone old enough to be my mother. \n\nHair-bob: T for Trainee\nMe: Some asshole.\n\nHere I am, going about my normal call routine. Had just wrapped a session of buddying, and T was to be the second one for that day. T sits, gets buddied in, and I go to take my first call.\n\n&gt; Caller rings, introduces self, goes \"I can't find my (proprietary software item) from last year!\"\n\nNow, this is common - accounts are free, person very likely made an account previously, and is now in the wrong account while trying to find it. happens daily. \n\nIn the middle of first question to verify caller, T interrupts\n&gt;T: Oh ask him how long he's used us! Maybe hes using the wrong company. Or maybe he never did it before!\n\nNot quite..\n\nI nod at T, and go back to trying to verify caller. I make it another two lines or so before T is poking me (literally) in the arm. We mute again.\n\n&gt;T Ask him what other sites he used!\n\nNope...\n\nI unmute and start my normal questions to prompt the caller to remember the other account (a literal Hey you made another one instead of going back to the other)\n\nT is poking me again.\n\nI mute, and ask yes?\n\n&gt;T How do you know he has another account? \n\nI look at T and politely ask:\n\n&gt;Me: Well, this is what I do. This is the most common thing we fix. Please let me assist him and you'll see how. \n\n&gt;T: Ugh. I can't believe you can't just tell me. \n\n&gt;Me: Well. You're sitting with me to learn, but I'd be happy to switch over and let you finish the call out if you think you can do this better.  (mind you, not the great way to handle it, but having been literally jabbed in the arm prior....)\n\nT rips her headset off, and gets up to leave while saying how awful I am. Later, my managers flag me over and to ask about what happened. I recount my side, and get told Alright, we'll take care of it. \n\nI didn't hear another word about it for about a week, until...\n\nI come into work, and start to head up (our call center was 2nd floor, had a boxed staircase to go up to it) and hear shouting. Turning the corner, I see two training managers, security, and T with T shouting she can't believe this shit, how dare they let her go, she can't believe they'd treat her like this, etc\n\nI glance at the manager while walking up, and say nothing. About 20 minutes later into my shift, I get an e-mail: \"We tried to critique her after she was reported as being rude, it did not go well.\"\n\nHuh. Maybe I wasn't the awful one after all...",
        "created_utc": 1527388575,
        "upvote_ratio": ""
    },
    {
        "title": "WiFi cable",
        "author": "fantompwer",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mdi9y/wifi_cable/",
        "text": "[removed]",
        "created_utc": 1527372782,
        "upvote_ratio": ""
    },
    {
        "title": "Streaming services require internet",
        "author": "CurtainClothes",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8md57c/streaming_services_require_internet/",
        "text": "I worked in customer support for a streaming service for a while. One of my most baffling calls was with a grumpy old man. He was clearly dubious that I could help him, so it was difficult to get answers or useful info out of him. We spent the first five minutes with me slowly dragging info out of him (\"It's not working,\"--\"Okay, what happens when you *try* to open the program/website?\"-- \"It doesn't work.\") \n\nOnce I finally ascertained that this was an internet related error, I mentally weight trying to walk Mr. Grouch through the steps that are supposed to come before unplugging the router, and decided to skip it. I directed him to unplug the router, being sure to describe what I meant in the most basic of terms (\"You probably have a large or small box with blinking lights that someone might have helped you install in order to get internet.\", etc) But he was adamant that he did not possess a router--or internet, for that matter. \n\nBear in mind that this guy had an account with us, his name and billing information and email had all been confirmed. I had every reason to believe that he in fact did have a router/internet, yet he kept insisting he did not have internet or a router. I spent ten minutes trying to figure out a way to communicate so that he'd understand (\"do you have cable tv?\"; \"do you get a bill from [provider in his area]?\"; \"Do you have any children who helped you set up [streaming service], can you call them?\"). \n\nThis dude was adamant--he had no kids, he paid for nothing but utilities and property tax, he just wanted me to fix his damn Streaming service. \n\nFinally, I went into a thorough ELI5 explanation of how the internet works and why he needs to have it in order for his streaming service to work. I explained to him that I found it very hard to believe that he didn't have internet at all, considering his streaming service had been working up until recently. At this point, We understood each other. It was clear there was no miscommunication. He did not have internet, and never had. He had set up the streaming service initially while at work, but had been able to use it at home for years.\n\nHe wanted to know why, if he'd never had internet, he'd been able to watch the service for so long. He was always watching on a laptop computer--I said my very best guess is that he'd been picking up someone's WiFi from next door, but to be honest I was as lost as him. If he really did not have internet (I was even then still doubtful) then the streaming service was not going to work. \n\nHe hung up angry, I hung up frustrated and burning with curiosity. I still wonder if he really didn't have internet. \n",
        "created_utc": 1527369327,
        "upvote_ratio": ""
    },
    {
        "title": "Change it without changing anything",
        "author": "MAD_ROB",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mcwn4/change_it_without_changing_anything/",
        "text": "Hey, its $me again after a long time with a new tale.\n\nFirst time posting with the new design, hope I will not screw up to hard.\n\nAlso the nice reminder: I am german, a and an are not my best friends. If it is wrong \\- sorry!\n\nSo here we go.\n\nPlayers:\n\n$me: you guess what? its me!\n\n$cw: my good coworker\n\n$cu: our beloved customer\n\n$boss: my boss\n\nThe Setting:\n\nIts a robot tale, so I am working with industrial robots and everything around them.\n\nI get a work\\-order from $boss which states something like this:\n\n\\&gt;$boss: Go to $cu and make changes to the programm, you know this application is not finished yet and there are a few difuculties with the customer and the timeframe, but you will work that out.\n\nNice... That is not really the truth. The truth is that we are 6 Mo behind shedule, we changed everything of the concept and components, we didnt communicate well with the customer and we have no idea how to get everthing running, and the main problems are mechanical. $boss told $cu that when I go home after this service everything will work perfectly.\n\nSo $cw and $me are on the way to $cu and discuss the problem. we both come to the same conclusion: it will not work, we will get in the crossfire between $cu and $boss and that it will end bloody.\n\nWe arrive and are greeted by $cu:\n\n\\&gt; $cu: hey guys, $boss told us everything is set up, now start the production, we have parts ready for you!\n\n\\&gt; $cw: hey $cu, uhm... sorry, but ... we are here for a test run and for optimization, we can not start the real production,\n\nwe will not be able to reach the cycle time and we have to stop now and then to kill a bug or two.\n\n3...2...1... booom $cu went through the roof\n\n\\&gt; $cu: but $boss told me you only have to run it, make what ever need and change what you want, but the robot has to run all the time and it has to make parts, you can not stop it for every reason.\n\n\\&gt; $me: sorry $cu, but it is not how this all works... we have to do it that way, everything else will not really get us further.\n\n\\&gt; $cu: i dont care, do it like I tell you and like I communicated it with $boss\n\n\\&gt; $me: okay, sorry but then we have to make a phone call with $boss\n\n\\&gt; $cu: \\(calmer\\): yes I know, you are \"just\" the workdrones ... sorry about that, I will get you a coffee and we meet after you called your $boss.\n\nWe make our phone call $boss is in full denial mode. We get it, we are in the cross fire. We will make the best out of it.\n\nWe go to $cu, drink our coffee, tell him everything. He says he knows a good coffee place to stay, he will call $boss and then tells us what to do. We sat there for 3hrs, went to a restaurant and then got the call to drive home.\n\nThat was a nice surprice, we saw us already dead. $boss was pissed \\- but we didnt care.\n\nTL/DR: communication is the key if everything is on fire. We know a new good coffee place.",
        "created_utc": 1527367168,
        "upvote_ratio": ""
    },
    {
        "title": "\"It's a super simple website, just scrape the product listings!\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mcp9y/its_a_super_simple_website_just_scrape_the/",
        "text": "[removed]",
        "created_utc": 1527365270,
        "upvote_ratio": ""
    },
    {
        "title": "Training my replacement",
        "author": "Theory_of_Steve",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mc9ue/training_my_replacement/",
        "text": "I'm finally getting off of the service desk. For 3 years I have been working as Tier 1, while my advanced skillset is melting away in the corners of my mind. On Monday, I start my new role in File Services/Access (hooray!).\n\nI've been training my replacement on the Service Desk. I swear, management only hired this kid to ensure maximum stress on my way out. He doesn't listen. He's an end-user who now has admin credentials and is going to be supporting other end-users. I'm terrified for the future of the Service Desk, but I guess it's not going to be my problem anymore.\n\nI'm going to list out some of my gripes about the new kid:\n\n- 20 years old, is so preoccupied with his phone. I always thought that it was a stereotype about young people. Nope, this kid is the living embodiment of mobile phone addiction. The first day I was training him he was sitting with me, supposed to be watching what I was doing so he could at least get a feel for the environment. He could hear the calls and clearly see everything on both of my screens. He was sitting a little behind me because of space constraints. Every single time I glanced over my shoulder he was staring at his phone screen. *Every*. *Single*. *Time*. I mentioned to him a couple of times that he should be watching what i'm doing, and he would always perk up and smile and project confidence and watch intently... But after a couple of minutes he was just staring at his phone again. I didn't hound him to watch my screen. I'm not babysitting.\n\n- After a couple of days of him \"Shadowing\" me, I decide it's time for him to put what he's learned to use. We trade places. When I told him that he was going to be controlling the computer he turned white as a ghost. Literally trembling. Teeth chattering. He doesn't know where anything is or what anything does. I have my windows arranged cleanly so that everything that he needs is available at a glance. As soon as he sits down he starts idly moving the windows around without paying attention to what he's doing. I tell him to stop - if he moves these windows he's not going to be able to find them later. Everything he needs is visible already, so there's no need to move anything. A call comes in. He totally botches the greeting. Here's how it goes... \n&gt; NEW KID:\"...(dead air, he's clicking on something)...\"\n\n&gt; USER: \"... Hello?\"\n\n&gt; NEW KID:\"...Uh...\" (clicking sounds resume) *at this point i tap the page in his notebook where he wrote down the greeting he wanted to say*\n\n&gt; NEW KID: \"Oh uh... Thanks for Service Desk. Hello. This is the service desk. Hello. Uh... Whats wrong?\" (this isn't even close to what was written on the page)\n\n&gt; USER: (long sigh of frustration)\n\nEventually he gets to the end of the call. Thank god it was just an easy account unlock. By the end of the call all of my neatly organized windows have been scattered to the f-ing wind by this kid idly clicking and dragging them around.\n\n- He doesn't know where anything is. He keeps losing his windows. He keeps forgetting that Windows 10 has separate taskbars for each monitor. He is always looking at the left-screen's taskbar, looking for icons for windows that are open on the right screen. He double-clicks them when he find them, then looks at me puzzled why the window keeps opening and then closing immediately. Sweat is appearing on his brow.\n\n- Day 2. He gets a call that requires him to connect to a user's PC. I've been telling him that he doesn't always need to have the answer right away. Tech support rarely has a solution immediately. I've been telling him to get the users to demonstrate the problems that they are experiencing so that we can determine what the cause might be. So he's on this user's computer, and he asks the user to show him what the problem is. The user takes hold of the mouse and tries to show him what the problem is, but New Kid still has his hand on his own mouse, and is just idly moving it a little bit, which makes the cursor on the user's screen snap back to the last location that the tech had it in. So the user can't control his mouse. I'm watching this, aghast. The user says \"I can't move my mouse for some reason\", and the New Kid kind of nods and repeats back \"you can't use your mouse\", all the while, still with his hand on his own mouse, making tiny unintentional movements. I lean in and tell New Kid \"Take your hand off the mouse\". He loudly repeats to the user \"Take your hand off your mouse\". *Forehead Slap*. \"No, no, New Kid, take YOUR hand off YOUR mouse. It's moving the user's cursor around and he can't control.\" New Kid, now *extremely* confused says to the user \"No, no, you can't move your mouse. Take your hand off. You can't control.\" *Forehead Slap x1000*. I reach over and physically remove the New Kid's hand from his mouse. The whole time he's saying things like \"Uh. Um. Oh. Mouse\" over the phone, and the user is now extremely confused. I reach across the desk and punch the mute button on the phone. I say to new kid \"You can't move your mouse while the user is trying to use it, because it makes the cursor snap back to it's last position. If you tell the user to show you what the problem is, then you need to let them control the mouse. If you're moving the mouse, the user can't move it on their end.\" **A flash of understanding**. Phone taken off mute. He apologizes to the user for the confusion, repeats instruction to show him what the problem is. New Kid then idly places his hand back on the mouse, giving it a little bump. Still making micro unintentional movements. User can't control mouse still. *Forehead slap so hard retinas detatch*.\n\nI'm sure he'll get better with time, but early indications are bleak. I have more, but i've written so much that I think i should stop.\n\nTL;DR - New Kid is frustratingly incompetent.",
        "created_utc": 1527361292,
        "upvote_ratio": ""
    },
    {
        "title": "Things I wish I could say to people",
        "author": "Conflituosa123",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mbm7s/things_i_wish_i_could_say_to_people/",
        "text": "[removed]",
        "created_utc": 1527355463,
        "upvote_ratio": ""
    },
    {
        "title": "\"My internet is not working. Could it be the fact that the pole is on fire?\"",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mbcpq/my_internet_is_not_working_could_it_be_the_fact/",
        "text": "For those who don't know, I am a tier 2 helpdesk rep for an ISP. This took place on Wednesday. Essentially, this was a call that an agent got and called me for assistance. I will be Me, agent will be A and customer will be C.\n\n\nA: Thank you for calling ISP, this is A.\n\n\nC: Yeah, hi. My internet is not working. Could it be the fact that the pole is on fire?\n\n\nA: Did you just say the pole is on fire?\n\n\nC: Yes.\n\n\nA: Have you called the fire department?\n\n\nC: No. What does the fire department have to do with my internet? I need my internet.\n\n\nA: Please hold.\n\n\n*Calls Me*\n\n\nMe: Tier 2, u/devdevo1919.\n\n\nA: Hi, this is A. We have a customer here reporting a pole on fire.\n\n\nMe: Have they called the fire department?\n\n\nA: ...no. Can you check to make sure this is affecting their service?\n\n\nMe: Um. Why haven't they called the fire department?\n\n\nA: They need their internet. \n\n\nMe: Hang on. Please hold.\n\n\n*10 minutes later*\n\n\nMe: Okay, so, I've made some calls and determined that: There is very heavy rain in this area. A transformer on this pole overloaded and blew up setting the pole on fire. It has also burned the cables coming and going from this pole. This has currently taken out just over 100 clients including this ~~moron~~ customer you have on the phone. Please advise them that this is an outage and the fire department has been called.\n\n\nA: Thank you, u/devdevo1919!\n\n\nMe: No problem. \n\n\n*A returns to their customer*\n\n\nMe: *two facepalms and a facedesk*\n\n\n",
        "created_utc": 1527353066,
        "upvote_ratio": ""
    },
    {
        "title": "Whose name should I sign?",
        "author": "IronhideD",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8mb297/whose_name_should_i_sign/",
        "text": "Hi, long time reader of TFTS, and I have a few stories locked away in my tiny brain. This one  happened yesterday.   \n \nI work in retail as an in-store technician. Mostly variations on \"have you tried turning it off then on again?\" type of stuff. One of the things we are required to do is to ensure that the same person dropping off a laptop is the one picking it up. Legally it has to be the same person signing the paperwork at drop off and pickup. With no ability to designate a secondary individual. \n   \nA customer comes is and arranged a pickup appointment. I'm in the back getting the laptop in question. The name is an obvious male name but a female customer is standing at the counter. It turns out that this is the customer's mother. \n \nI explain that I can't release the device to her as she's not the name on the paperwork. She just flips her shit saying that she hasn't been told that this was what was required. Nothing I say changes her mind. She's demanding to find out who gave her incorrect information.   \n \nI end up having to bring a manager who is having worse luck explaining. She's not leaving until she gets her son's laptop. The manager ends up saying yes because he's tired of this lady's shit. He explains to her that we are breaking legalities to accommodate her and that this is a one time exception.  \n \nAt this point I hold out the paperwork to her and ask her to sign.  \n \nAngry mother: Whose name should I sign?   \n  \nMe: You should sign your name since signing your son's name would be considered forgery. \n \nShe signs it and takes her son's computer. \n ",
        "created_utc": 1527350362,
        "upvote_ratio": ""
    },
    {
        "title": "It's Installed Where?",
        "author": "TerrifiedRedneck",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8m94wc/its_installed_where/",
        "text": "A year or so ago, I got free and clear from a job in a local educational establishment that, for want of a better term was \"Hell on Earth\".  \n\nI've got a decade worth of stories that now I am log gone from there I can start to share.  Everything from completely illogical power supply switch installations to many and varied staff requesting bizarre things becasue they think \"IT Staff\" translates to \"Wizard who can fix everything from the coffee machine to the Vacuum cleaner\"!!  \n\nThis particular story is from around 7 year ago \\(I know, an actual eternity in IT terms\\) and features one of the most heroic attempts at accidentally breaking something I had ever seen.\n\nOur cast:\n\n&gt;**$ME** A lowly level 1 tech at the time \\- plenty of experience and knowledge but hamstrung buy the IT Manager's need to make himself indispensable.    \n&gt;  \n&gt;**$FT** A friendly computer studies teacher who was lovely to talk to but impossible to deal with once out of her comfort zone.    \n&gt;  \n&gt;**$TAP** Our lovely new apprentice  \n&gt;  \n&gt;**$ITM** The IT Manager\n\nThe setup:\n\n&gt;For... let's just say reasons... when we received a request a year or so previous to this story happening to allow students access to Ruby, the decision was made to give students a small VM to run the software on.  **$ITM** was the only person that ever knew the correct combination of duct tape and WD\\-40 used to keep it working and never let us techs even look over his shoulder when fixing things just in case.    \n&gt;  \n&gt;Now,  **$ITM** is on annual leave and we get the call...\n\n**$ME** Hello, IT. TerrifiedRedneck speaking.\n\n**$FT** Please come up to $Class ASAP. I planned a lesson with $Ruby and it worked fine last week. Today it doesn't work!\n\n**$ME** \\(*kinda thinking \"yeah, right, last week, whatever\"*\\) No worries. Is it on all the computers, some, or just yours?\n\n**$FT** All the PCs. I've had students move and everything and it still isn't working. Please Help!\n\nAdmittedly, at this point I panicked. This software and it's setup is completely alien to me and I don't want to let the teacher or her class down.  **$ITM** always said that if there was an issue I could ring or text him. But my stubbornness and want of his job at some point always stopped me from doing that.\n\nI was considering it here though.  \n\nI grab **$TAP** and we head to the top floor of a five storey building \\- We were across the campus, not even in the same building.  \n\nSure enough, we get in to the classroom and **$FT** is in full headless chicken mode.\n\n**$FT** I don't know what's going on, I talked to **$ITM** last week and it as fine\n\n*$ME S\\*\\*\\* S\\*\\*\\* S\\*\\*\\* S\\*\\*\\**\n\n**$ME** Ok, lets see if the problem is immediately fixable. \n\nMeanwhile I get **$TAP** to login as himself \\(all IT Tech accounts were DA's at this point. I know, I know, as soon as I could, It wasn't a thing anymore\\). Nope, he can't make it work either.  \n\n**$ME** Right, yeah, something here isn't right. \n\nThrough a series of clever pulleys and levers, I RDP onto my office machine so I can troubleshoot in the room without being hindered by the lack of tools on the machines.  It occurs to me, i know so little about this installation, I don't even know where it's installed.  Right... Let's take a butcher's.\n\n&gt;\\\\\\\\$ITMPC\\\\c$\\\\software\\\\ruby\n\nI kid you not.\n\nI send **$TAP** back to the office to switch on his machine. Low and behold, I get a call five minutes later and things start to come to life. I could not believe it.  \n\n**$FT** was suitably impressed, **$TAP** got the credit \\(he did fix it after all\\) and I magically solved the issues of the broken Ruby installation, the broken license server for some music software that was broken for the same reason \\(but no one spotted or reported it yet\\) AND why **$ITM**'s PC would randomly slow to a speed similar to pensioners humping all while he was on holiday!  \n\nTL:DR \\- turning off the computer you install stuff on without telling anyone stops things working",
        "created_utc": 1527327881,
        "upvote_ratio": ""
    }
]