[
    {
        "title": "Why I have two copies of Coco",
        "author": "Belle-ET-La-Bete",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/810koz/why_i_have_two_copies_of_coco/",
        "text": "So first off, idk if this sub is as strict about naming establishments as most other subs so just in case, this story's about the 'Red bullseye shop.'\n\nSo for those who don't know, the Pixar movie coco came out yesterday. Loved the movie in theaters so I was excited to get the movie. I'm really interested in art and animation and the deluxe edition of this movie at RBS came with an art of book (plus usually this chain sells the movies cheaper than other nearby chains). Also, I'm currently sick and planned to pick up cold medicine while I was there (part of what happens later).\n\nSo there's two RBS near me. One is my favorite and is about ten minutes away while the other one is decent and only five minutes away. To save gas, I decided to just drive to the closer store. Made it there right before 8 when they opened. By the time I got out of the car, turned on my headphones and walked up to the doors, it was probably only 40 seconds after the store opened. I see at most two couples in the immediate area entrance area. So I walk over to the rider by the checkout stand.\n\nThe riders are those displays that advertise the special movies. This one had three sides devoted to coco (and one to lady and the tramp) and about four shelves  on each side- DVDs on the bottom row, blu Ray combos in the middle rows and the top rows are supposed to have the special exclusive edition. But there's none of the exclusives. Not one on any of the three sides.\n\nIt's still only 8:01 and I barely see any customers (the ones I do don't have the movie) around so I didn't think it's possible they had all been taken (unless they only had 5 in the whole store and the customers had ransacked the rider right when it opened and we're now hiding?). I start to walk to the back of the store to the electronics section. I get to the new movies and once again, they only have the Blu Ray combos and the DVDs stocked. I try looking around the new release section to see if there's a loose copy somewhere. A 'HELPFUL' employee notices and comes up to me.\n\nSo this lady is older, has unnatural red colored hair and seems harmless. Hell she tried to get my attention to see if I needed help without asking since I was listening to my headphones and couldn't hear her at first. So I turn off the music, ask her if there's anymore of the exclusive version of coco anywhere. As I'm saying this, I see she has a shopping cart with a lot stacks of blu Rays and DVDs to stock and in one pile I see at least one copy of the one that I wanted. I thought great, she has what I want. But no.\n\nLady says 'yeah they're all at the front on the rider, go look.' And try to tell her that the exclusive versions aren't up there but she rudely interrupts me and says 'no they're there. Look.' The fuck? I was just there and they definitely weren't. Before I know it she's walking away with the cart with the copy I want and is still rudely shooing me away saying 'it's there. Go.'\n\nWhat. The. Fuck?\n\nI didn't flag this woman down, she came up to me and she acted like I was being some rude ass customer and yelling at her? The hell?\n\nSo for whatever reason, I decided to go back to the rider thinking maybe I was SOMEHOW mistaken and there were copies there. Nope. Of course not. So furious, I grab a copy of the regular Blu Ray combo to purchase and go to self checkout. While I'm there, I see two different couples that somehow have two copies each of the exclusive version. Seriously?? Whatever, I'm done with the store. I purchase my Blu Ray and walk out fuming. When I get to my car, I realize I forgot to get the cold medicine I wanted.\n\nUgh.\n\nSo I have the idea to waste more gas and just go to the other RBS that I usually like better anyways. I'll get my cold medicine and see if they have any of the exclusive copies. Guess what, they DO. A lot more. Like the rider is full of them as well as the electronics shelf. So I got the exclusive and tonight I'm going back to the shit store to return the regular combo pack and tell them what happened. Lesson learned, stick with the favorite store.\n\nThanks again Red Bullseye shop.\n\n",
        "created_utc": 1519859417,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t worry, I’ll get the tip.",
        "author": "maybemao",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/810f6h/dont_worry_ill_get_the_tip/",
        "text": "I didn’t think I had a good story, but then I remembered this gem from 4 years ago. \n\nIt was Christmas Day. My grandma had just passed away earlier that year, so the family wasn’t exactly in the Christmas spirit. We decided that instead of bringing ourselves to have our usual Christmas breakfast, we would go out somewhere to stuff our sadness with as much food as possible. Now, we live in a casino town (not the big one) so we decided to pack up our family of 8 and go to one of the casino buffets. \n\nThe total was over $200 for all of us. We ate, drank, and made merry. All the while our waitress was busting her ass keeping our table clean of plates and drinks topped off. Honestly, it was probably one of the best experiences I’ve had at a restaurant given the circumstances. \n\nWe finish up and my grandpa says the titular phrase, “Don’t worry, I’ll get the tip”. Now I love the man, but you have to understand he comes from a different time. A time where money was worth more than it is now. The man reaches into his pocket and pulls out his wallet. From the depths of said wallet, he pulls the crispest (most crisp?) dollar bill I have ever seen and lays it on the table. In the time it took him to procure the dollar, the waitress had come over to do her final clean of the table before the bus boy took care of the rest. \n\nThe light in that woman’s eyes went out when she saw George Washington staring at her by himself. As my grandpa walked out of eyesight, my mom slid a 100 on the table to accompany the “gracious” gift. Good one Ma. The light returned to the woman’s eyes and all was good on that Christmas.",
        "created_utc": 1519858198,
        "upvote_ratio": ""
    },
    {
        "title": "Entiteled soccer mom wants my parking space",
        "author": "domine18",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80zlwg/entiteled_soccer_mom_wants_my_parking_space/",
        "text": "This happened earlier today. I am a stay at home dad and watch after a 2 year old girl. I noticed we needed a few things from the store. So loaded up and headed out. When we arrived i noticed that one door was blocked for construction. No big deal it is about 10 a.m on a weekday and the parking lot is only about 1/4th full.\n\nNow it is important to note that this store has perfered parking for customers with children. They have a few spots next to the handicapped spots marked as such.\n\nAs i am going down the lane i notice at the end one of these spots is available. Awesome! I go and park. But when i step out of my car i notice i am being yelled at by someone. Look to see what all the commotion is about and see a subburban with a very angry looking soccer mom type which she will be refered to as for rest of post.\n\nSoccer mom= sm  me=me\n\nSm- \"what the hell do you think you are doing?\"\n\nMe- \" going shopping?\"\n\nSm- \" you cant park there dipshit, thats for mothers with children.\"\n\nMe- \" i know i am here with my young child to do some shopping.\"\n\nSm- \" Get back in your fucking car and go to another spot i am in a rush here and need that spot!\"\n\nMe- \" i have a kid with me and i can park here if i want.\"\n\nSm- \" if you dont move i will get the manager and have your car towed!\"\n\nAt this point i ignored what she was saying and walked over and began getting my daughter out of the car. All the while she continued to rant and insult me.\n\nAfter i had her out of the car and in my arms did sm see her and stop her yelling. I started to walk to the store and told sm.\n\n\"Please set a good example for our children, and learn to control your temper.\"\n\nPicture of the [sign](https://i.imgur.com/6mKx9wo.jpg) at the store",
        "created_utc": 1519852011,
        "upvote_ratio": ""
    },
    {
        "title": "UPS delivered a fridge that didn’t belong to me",
        "author": "overcomplicate",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80yj3g/ups_delivered_a_fridge_that_didnt_belong_to_me/",
        "text": "[removed]",
        "created_utc": 1519844074,
        "upvote_ratio": ""
    },
    {
        "title": "Dash Without the Dine",
        "author": "bestdonut",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80tuuz/dash_without_the_dine/",
        "text": "This happened about a month ago. It's my boyfriend, me, and our newly acquired Unicorn; we decided to go out and treat our Unicorn because it was her birthday. We knew she'd never tried an Escape Room before, and my bf and I love them -- we don't go to every single one in the tri-state area or anything, but we've done around a dozen of them and actually have broken a few time records on some rooms. So I set us up with the nearest place that does private room bookings, for a room at 8:30pm on a Friday. We pick her up to grab some dinner before the appointment. \n\nI looked up restaurants local to the Escape Room, and we decide on a restaurant that is the highest- and most-rated one in this small PA town (it also had a weird name, we'll call it the BagDwarf). It's only four minutes away from the Escape Room; we head inside and are seated immediately, in a small dining room across from the main bar area - only about six tables in there. \n\nIt's relatively busy, maybe 3/4 of the tables in the restaurant are occupied. We arrived exactly at 7pm, and me (being anxious and very conscious of time, I'm never late to things), I made sure to tell my bf and friend that we need to leave no later than 8:15pm. So, 75 minutes! That should be enough time to eat a decent meal!\n\nOur server comes right after we're seated and we all ordered plain water, which comes out right away. We order just a couple of minutes later; my bf and I both order the Southwestern burger (the description sounded absolutely amazing!) and our friend orders the ahi tuna tacos... The server took our food orders at 7:05pm... the waiting began. \n\nThe three of us were making small talk; making funny observations about the decor, talking about some escape rooms we'd done in the past, talking about how our week had gone, etc. About 15 minutes into our wait, the waitress brought out fresh waters and told us \"your food will be out soon!\". Okay, great! It seems like I don't have to worry about us wolfing our food down; I don't have to mention to her that we're \"in a bit of a hurry\". I just keep having nice conversation and assume that the food will be out soon. \n\nA couple minutes later, she delivers food to a table across from us - they were here before we were and we never saw them with menus, so they must have ordered right before we walked in. Five minutes later, same thing with the large family at the table behind me. Now it's around 7:45pm (almost 30 minutes after she told us the status of our food), and the waitress hasn't been back to us. We didn't need new waters, and because she told us our orders were being made earlier, no one at my table thought we'd have to \"remind her\". \n\nSo now I'm thinking: great, we'll have less than 30 minutes to eat - the moment we get our food we should ask for the bill and pay it so we can leave as soon as we finish eating. And we still wait, and wait. And wait. The table across from us has finished eating and is ordering a dessert; the waitress is pretending like we don't exist? She doesn't look at us or make eye contact even though we're only like 6 feet away? I'm thinking \"it's gotta be any minute now. Watch, in just 30 seconds, someone will probably bring it out\" I'm checking my phone every minute or two with growing annoyance. \n\nIt's now 8:10pm, no food in sight. I'm already pissed, or hangry, because I hadn't eaten since before noon.  Now, we can't eat any food before this Escape Room. Like, seriously, how long does it take to make two burgers and some ahi tuna tacos? 30 minutes? Fine, reasonable. 45 minutes? You're pushing it. 70+ minutes? Go fuck yourself.\n\nWe bail. After being there for 70 minutes with no food in our stomachs to show for it, we just left. All we had was tap water, didn't owe anyone anything. \n\nAftermath: We made it on time to the Escape Room; we succeeded, but nowhere near record time. We were full-blown hungry at this point (hadn't eaten in 10+hours), had a late dinner at a mediocre diner, had a couple of drinks, banged, and when we dropped her off at home, she said it was the best birthday ever! So, overall, the night was a success! But I'm still pissed about not getting to eat that burger-- it honestly sounded like it would be heavenly, but I don't want to go back to that place to try and order another one. ",
        "created_utc": 1519798693,
        "upvote_ratio": ""
    },
    {
        "title": "But which one?",
        "author": "any_other_observer",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80rs9r/but_which_one/",
        "text": "On mobile, so sorry for formatting. Recently, I went to McDonald's with my friend. Now, I should mention that we almost never eat out/buy takeaways (mainly because we're broke and save money by cooking home) and, therefore, have literally zero knowledge of their offers.\n\nSo, after looking through the menu and queuing, following conversation ensued:\nC = cashier, M = me\n\nM: Hiya, can I get one wrap meal to go?\n\nC: Which one? (ignoring my hellos and in quite rude tone)\n\nMe: (internally panicking, but remembering I have seen the word crispy somewhere on the menu) Crispy, please.\n\nC: But which one?! (obviously loosing patience)\n\nMe: (no clue what she means) sorry?\n\nC: Which one! \n\nMe: Well.. which ones do you have? (at this point she's starring daggers at me)\n\nC: We have... (starts to name the kind of SAUCES)\n\nSeriously, lady?! Would it hurt you to ask which sauce rather than too general \"which one?\". It would save you a lot of frustration (that you so nicely expressed to me), and I would not leave feeling like a total idiot.",
        "created_utc": 1519778723,
        "upvote_ratio": ""
    },
    {
        "title": "i just had another patient literally burst into my room and run into the wall. screaming. with blood.",
        "author": "kittenpuke",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80q06y/i_just_had_another_patient_literally_burst_into/",
        "text": "this is kind of mildly related i guess but talesfromthepatient isnt exactly poppin and this is so bizarre that i need to like.....put this down in writing somewhere bc i feel like in 30 minutes im going to convince myself it never happened\n\nso im doing ketamine therapy which involves getting hooked up to an IV for the infusion. the treatment/results has nothing to do with the high itself but lets face it, you do get high while its being administered. theres literally no way around that. most ppl enjoy it actually. i think its p chill, i like just zoning out watching league of legends montages the whole time \n\nalso disclaimer im literally typing this still in the chair while im waiting for my head to clear up so this is probably (definitely) going to be all over the place. \n\nANYWAY im here alone for the first time (my bf had been coming with me previously) and maybe 2/3 through my session this dude literally comes bursting through the door to my room screaming. i mean BURST through the door, like the door knob made a hole in the wall even though there was one of those rubber stopper things on the wall to prevent that exact thing form happening. and then he ran into the wall and collapsed on the floor. he ripped his own IV out to get here so he has one hand totally covered in blood\n\nmeanwhile im still high af from my own infusion and im not even sure if this is rly happening or not. the dr and the nurse practitioner and the dude's dad all come in behind him and by this point the guy is on the floor just screaming and i specifically remember him yelling \"THIS IS THE TRUTH\" which is..........hilarious now but in the moment i literally thought i was going to die\n\nthey eventually got him under control and out of my room by literally dragging him out but even when they closed my door i could still hear him like screaming and crying. i was just left to finish off my infusion in total bewilderment\n\nwhen the nurse practitioner and dr came back to my room (i guess after they sedated the dude) they were both super apologetic but also kind of bewildered themselves bc neither of them had ever seen someone react like that before. they both said i had a \"very good disposition\" whatever that means\n\nanyway i guess my blood pressure was high bc of the stress of that experience or something bc when the assistant came to take my iv out my blood literally sprayed. EVERYWHERE. it was so embarrassing and i know it wasnt my fault but i was also still kind of woozy so it was just me and the assistant going back and forth apologizing to each other and uh\n\nidk. this was the most surreal experience of my life and since ive been tripping off ketamine for the past 3 weeks id say thats saying a lot.",
        "created_utc": 1519764841,
        "upvote_ratio": ""
    },
    {
        "title": "VERIZON INTERNET SCAM ALERT",
        "author": "Slapmeislapyou",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80pyi9/verizon_internet_scam_alert/",
        "text": "[removed]",
        "created_utc": 1519764505,
        "upvote_ratio": ""
    },
    {
        "title": "An employee called me fat!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80n9hl/an_employee_called_me_fat/",
        "text": "[deleted]",
        "created_utc": 1519745317,
        "upvote_ratio": ""
    },
    {
        "title": "The Saga of \"EveryPicture\"--Part 3",
        "author": "waltg12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80ma44/the_saga_of_everypicturepart_3/",
        "text": "[removed]",
        "created_utc": 1519736807,
        "upvote_ratio": ""
    },
    {
        "title": "Bank makes error in your favor...",
        "author": "cbelt3",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80i8ck/bank_makes_error_in_your_favor/",
        "text": "Many years ago I was paid in twice weekly checks. And on this payday, my little family was rigged out and ready to go on vacation. Thinking that cash would be good (before debit cards) I went through the drive through at the bank. And asked this nice teller to cash my entire paycheck and asked that the proceeds be put in an envelope. She gave lollipops to the kids, who piped up with a loud “Thank you !” and we went around.\n\nSomething felt.. off. When I opened the envelope I realized what it was. She had placed twice the cash in the envelope. An easy extra $1,000. I looked it it. I looked at my wife. And I pulled into the bank, parked. Went inside, caught the cashier’s eye and said “I think there was a mistake”.\n\nShe almost cried then and there. We fixed everything, and I received her heartfelt thanks. And a double handful of lollipops for the kids.\n\nVacation felt even better after that.",
        "created_utc": 1519693059,
        "upvote_ratio": ""
    },
    {
        "title": "The bus missed us",
        "author": "balsy_ballerina",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80i66h/the_bus_missed_us/",
        "text": "Don’t know if this is the right subreddit but whatever\n\nOk so I am a student at a private school, and my school hires out buses to pick up students. You buy tokens and wait by a road on the buses route. The bus driver picks you up, and you give him the token. Simple enough. \nMe and my two brothers have to catch the bus sometimes, and in the mornings the bus drives passes a nearby street around 8:12. Last Monday we caught the bus with no problems, but we had a new driver and he was erratic to say the least (safe breaking distance about 10cm in a 60 zone) but we got to school alive. Fast forward to today\n\nMe and my brothers are waiting by our usual stop when the bus passes us\nStraight pass\nI will admit that he was wedged between two cars, but given the distance between him and the car infront, i mean, he did not have to be that close. Thanks to that dude my brother missed his assessment and we can’t get to school until nearly 11. Thanks asshole!\n\nIn a nice twist he never got our bus tokens, which are 6$ each (18$ worth between us)\n\nNote: we are all dressed in our school uniform, including my brothers’ leavers jackets, and there was a kid on the bus wearing said leavers jacket \n\nTL;dr we don’t miss the bus, the bus misses us\n\nUPDATE we contacted the school and they initially blamed us for not being at the right bus stop (which we and two more kids regularly get picked up from) but then admitted that the bus driver sometimes skips the next stop, and that they’d contact the bus company. Hopefully before I next have to take a bus",
        "created_utc": 1519692517,
        "upvote_ratio": ""
    },
    {
        "title": "Lady calls me a shithead because",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80htwy/lady_calls_me_a_shithead_because/",
        "text": "[deleted]",
        "created_utc": 1519689554,
        "upvote_ratio": ""
    },
    {
        "title": "Somewhat subpar serving",
        "author": "sarahy2001",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80auoy/somewhat_subpar_serving/",
        "text": "So there's a chain Tex-Mex bar &amp; grill restaurant whose name rhymes with Lily's on my school's campus, and my friends and I (4 11th grade girls) went out for dinner Saturday night. It was around 7:30pm and busy--the university had hosted some sports game earlier that day, and the crowds lingered.\n\nFirst, the waitress came and took all our drink orders: two waters without lemon, one water with lemon, one sweet tea. She later returned for our food orders, and my three friends placed their orders: fried pickles with fries, queso, and steak. The restaurant turned out to be out of queso through no fault of the waitress, so the girl who ordered it got onion rings free of charge. \n\nOur drinks still weren't out yet after we had received our food, so we asked the server to please bring them, and she did so, albeit with a loud sigh that seemed more exasperated than necessary. \n\nThe girl who ordered the pickles and fries ended up with pickles and rice, and the waitress refused to acknowledge that she had misheard, instead telling my friend condescendingly that she had ordered rice. That same friend also wound up with a water instead of the iced tea she had ordered, and the girl who asked for a water with lemon got water without. No one wanted to say anything though, and the waitress still got a 15-20% tip from our table. \n\nTypically we don't have issues at that restaurant, so it may just have been that the waitress was tired or stressed from the busy night, but campus jobs don't really pay that much, so we definitely always tip, even for below-average service. \n",
        "created_utc": 1519625469,
        "upvote_ratio": ""
    },
    {
        "title": "Question about tipping.",
        "author": "cuntmuffin11",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/809hsn/question_about_tipping/",
        "text": "Where I live in Canada servers get minimum wage which is 12.20 an hour. What is an acceptable percent to tip? \nI always tip at least 15% but when I took my family out to eat the other night my waitress said to me “If you can not afford a proper tip maybe you shouldn’t be eating in a restaurant.”  \nShe did an ok job but nothing more then the bare minimum.\nAm I being to cheap considering they already make a decent minimum wage?",
        "created_utc": 1519611167,
        "upvote_ratio": ""
    },
    {
        "title": "The Saga of \"EveryPicture\"--Part 2",
        "author": "waltg12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/80964z/the_saga_of_everypicturepart_2/",
        "text": "As a recap from [Part 1](https://www.reddit.com/r/TalesFromTheCustomer/comments/8093o7/the_saga_of_everypicturepart_1/), I had a $10 voucher for \"EveryPicture\" (per anonymization rules) &amp; they stocked an 8x10 photo from another company that I wanted to buy in order to get it autographed. Their site said photos shipped in a large mailer, as opposed to a tube, but they sent it in a tube anyway. CS offered me a refund of my shipping charges to my PayPal account and an overnighted replacement.\n\nAnd that's where Part 2 begins.\n\nOn their shipping page (the same one that said my order wouldn't be shipped in a tube), they also specify handling times:\n\n&gt;Depending on the types of items you purchase, the order processing time will vary. If you select Expedited or Overnight delivery for your order, you will receive priority processing which shortens the processing time by up to 3 days.\n\nAfter a few days passed and my overnighted replacement still hadn't shipped, I logged back into the online chat to see what was going on.\n\n&gt;CS Agent: Hi Walt! How may I help you?\n\n&gt;Walt: What's the status of my reshipment?\n\n&gt;CS Agent: Your reshipment estimation ship date is [several days in the future]. Once your item ships out from our warehouse, You will get your item within 2-3 business days.\n\n...WTF?\n\nAt this point, I was just completely fed up with this company, and I wasn't having it.\n\n&gt;Walt: So \"overnight\" means \"a week later\"?\t\n\nMaybe I should have been a bit clearer here, but I assumed (wrongly) that the CS agent was competent enough to pull up what I'd been told--especially at the first sign of a discrepancy.\n\nHeck, when the last guy said \"We will also have this transcript for any future assistance.\", I figured (apparently wrongly, again) that it meant that they'd actually use the transcript should I require future assistance.\n\nBut why let actual work get in the way of some nice script regurgitation?\n\n&gt;CS Agent: Your order will arrive based on the processing time plus the transit time. For example, if your processing time is 3-5 business days and you pick expedited delivery, you should expect to receive your order in 5-7 business days.\n\n&gt;Walt: So it's not being overnighted like I was told?\n\n&gt;CS Agent: I'm sorry, We would like to let you know that selecting 2 day Shipping does not mean you will receive your order in 2 days but means that after your order is processed, we will ship it via 2 day Service.\n\nNice script you got there. Too bad it's not relevant. There was a reason I asked the last guy if the chats are logged on their end--not to mention that, by virtue of being a reshipment, I didn't \"select\" anything. If I did, it'd be a new order.\n\n&gt;Walt: I didn't select anything. I was told that the new order would be overnighted. That's why I agreed to it.\n\n&gt;2 day service isn't overnight\n\n&gt;CS Agent: I'm sorry, We regret any misunderstanding concerning the estimated shipping date of your order. We would like to let you know that 2nd day Shipping does not mean you will receive your order in 2 days but means that after your order is processed, we will ship it via 2nd day Service.\n\n&gt;Walt: Stop quoting the irrelevant script. I was told \"So, shall I process replacement via overnight priority?\"\n\n&gt;Do you see the words \"2nd day\" there?\n\n&gt;No.\n\n&gt;I was told it would be overnighted.\n\n&gt;CS Agent: I'm sorry, I have seen they are created in a 2 days shipping, Please allow me couple of moment, I'll make the shipping priority to over night now.\n\n&gt;I'm sorry for that, I have successfully cahged your shipping method to overnight now.\n\nK, fine, whatever. Now that that's fixed, moreso thanks to me than you, let's get back to the original question.\n\n&gt;Walt: What's the expected delivery date for my reshipment?\n\n&gt;CS Agent: It is estimation to ship out on [same day that was said before], Once your item ships out from our warehouse, You will get the item in overnight.\t\n\nHOW THE FUCK IS THERE NO CHANGE?!\n\n&gt;Walt: Why is it still taking 5 days to ship?\n\n&gt;\"Depending on the types of items you purchase, the order processing time will vary. If you select Expedited or Overnight delivery for your order, you will receive priority processing which shortens the processing time by up to 3 days.\"\n\nThe thing is, my original order, which used their standard shipping with no \"priority processing\" didn't take this long to ship. It was out of the warehouse two days after I ordered. With priority processing, it should've been out in at least that time.\n\n&gt;CS Agent: Your processing time is 3-5 business days and you pick Overnight delivery, you should expect to receive your order in 4-6 business days.\n\n&gt;Walt: Considering my original order used standard shipping, I know the processing time isn't 8 days\n\nAt this point, I've just had it. The script isn't addressing anything I've said, and it's nothing I don't know. For crying out loud, it's all on the same website page I've clearly read and quoted.\n\n&gt;Walt: Just repeating what is doesn't answer my question, which started with \"Why\"\n\n&gt;How about, instead of wasting both of our time quoting from a script that doesn't answer the question I'm asking, you actually answer the question I'm asking?\n\n&gt;The site T&amp;Cs tell me that overnight shipments have shorter processing times than standard. You're telling me that's not the case with my order.\n\n&gt;CS Agent: No Walt. Processing time remains the same but once it is ships out it will be delivered in one day.\n\n&gt;Walt: \"Depending on the types of items you purchase, the order processing time will vary. If you select Expedited or Overnight delivery for your order, you will receive priority processing which shortens the processing time by up to 3 days.\"\n\n&gt;That's copied and pasted from your website\n\n&gt;So why are you telling me that processing time remains the same when the site says it won't?\n\n&gt;CS Agent: That is appilcable only for new order. Since this is reshipment processing time remains the same.\n\nAh. So if they screw up your order and offer to make things right by upgrading you, they give you worse service. That make sense to anyone here?\n\n&gt;Walt: Explain the logic in that to me.\n\nAfter thinking about it, I just give up. Clearly I'm not going to get anywhere, and the only reason I had the $10 to spend in the first place was because the company was scummy, so I shouldn't be surprised.\n\nI just want to be done with their shit.\n\n&gt;Walt: If I cancel the reshipment, can I just get the full item price refunded to my PayPal account?\n\n&gt;CS Agent: Yes.\n\n&gt;Walt: So none of it will go back to the gift certificate?\n\nMore now than before, I especially don't want them profiting off my no longer doing business with them. They deserve to lose that $10.\n\n&gt;CS Agent: If you do not want refund in GC, I'll make a special request so that the refund will go to your paypal.\n\n&gt;Walt: I want the full refund on my PayPal account.\n\n&gt;CS Agent: Okay.\n\n&gt;Walt: And that's what will happen?\n\nYou'll notice that I consistently ask this question between this and part 1. The reason is simple: requests aren't results.\n\nDon't tell me what you'll request; tell me what will happen. If you don't tell me what will happen, I'll get you to tell me what will happen.  If you don't know what will happen, you find out what will happen and then tell me.\n\nThat way, if it doesn't happen, it's not \"I did my best\", it's \"I couldn't be bothered to check, so I talked out of my ass and lied\".\n\n&gt;CS Agent: Refund will go to your paypal in 7-10 business days.\n\n&gt;Walt: How much will that refund be?\n\n&gt;CS Agent: Your total refund amount will be $11.66.\n\n&gt;Walt: So within 10 days, I will receive $11.66 in my PayPal account?\n\n&gt;CS Agent: Yes.\n\n&gt;Walt: And nothing will go back to the gift certificate?\n\n&gt;CS Agent: Yes, Walt\n\nYou'll notice I'm not giving them any room to \"Well, we didn't actually mean that...\"\n\nIf they screw me out of the money, it'll be because the rep lied through their teeth, not because there was a miscommunication.\n\n&gt;Walt: Is there a way to expedite the refund processing?\n\n&gt;CS Agent: I'm sorry, No\n\nOf course, I assume you all know how this is going to end.\n\nThat's right--the refund, including the $4.99 from Part 1, processed back to the gift certificate. They get to profit off their sheer incompetence.\n\n**TL;dr: \"EveryPicture\" is incompetent from the top down.**\n\n*Edited for formatting*\n\nSo, I thought [Part 3](https://www.reddit.com/r/TalesFromTheCustomer/comments/80ma44/the_saga_of_everypicturepart_3/) was too beautiful not to share it. It's shorter, for those concerned about that sort of thing.",
        "created_utc": 1519608009,
        "upvote_ratio": ""
    },
    {
        "title": "The Saga of \"EveryPicture\"--Part 1",
        "author": "waltg12",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8093o7/the_saga_of_everypicturepart_1/",
        "text": "The parent company of, let's call it, \"EveryPicture\" (per anonymization rules), an online photo &amp; poster seller, got sued a couple years back for deceptive business practices. As a result, all class members received a $10 gift certificate good for that parent company and EveryPicture.\n\nEveryPicture stocked images from another online photo company who supplies licensed sport photos, and there was a particular image I'd been wanting to get autographed in 8x10, so I figured this was a good opportunity. EveryPicture (naturally) charged more for the image than the source company themselves, but with the $10 voucher, it would only cost me a couple dollars out of pocket, as opposed to the full cost I'd have to pay the source company.\n\nWhen I get photos to be signed, I'm incredibly particular about their condition: no bends, no folds, no dents, no curls, etc. It's pretty common to expect 8x10 photos to be received completely flat, especially those used for signing purposes, and it's more or less an industry standard to ensure that they are. Nonetheless, I always check the shipping T&amp;Cs to make sure the company adheres to such.\n\nThat page for EveryPicture said:\n\n\n**Type of Packaging**\n---\n**Tube**\n\nPosters, Art Prints\n\n**Heavyweight Tube**\n\nTapestries, Laminated Posters and Prints\n\n**Large Mailer**\n\nPhotos, Magnets, Note Cards, Tin Signs, Calendars,T-Shirts\n\n**Box**\n\nFramed and Mounted items, Canvas Transfers, Decorative Mirrors, ReadyMade Frames, Stand-Ups\n\n&amp;nbsp;\n\nSo, the photo will ship in a \"Large Mailer\" rather than any sort of tube or whatever--good enough for me. I place the order, paying the $10 out of the gift certificate and the rest direct from PayPal.\n\nThe order eventually shipped via FedEx SmartPost. Now, the nice thing about FedEx is that they show you the dimensions of the package in question via their online tracking page. FedEx listed the dimensions of mine as \"16x4x3 in.\" The only way that an 8x10 (that's supposed to ship in a \"large mailer\") would fit in something that size would be if they folded it or rolled it. Which is not only contrary to their own website, but also just bullshit in general. There's no reason to roll an 8x10. For crying out loud, it's almost always cheaper to ship it flat.\n\nSo I immediately logged into their online CS chat to ask WTF they're doing:\n\n&gt;CS Agent: Hi, welcome to EveryPicture.com! This is [CS Agent], how may I assist you today?\t\n\n&gt;Walt: Why does FedEx list my recently shipped order as \"Dimensions\t16x4x3 in.\"?\t\n\n&gt;I assume that EveryPicture wouldn't be stupid enough to roll (and thus damage) an 8x10 photo\t\n\n&gt;CS Agent: I'm sorry to learn that, Walt.\t\n\n&gt;May I please have the order #?\t\n\n&gt;Walt: order #*******\t\n\n&gt;CS Agent: Thank you for providing the order number.\t\n\n&gt;Please give me a couple of minutes while I check into this for you.\t\n\n&gt;Thank you for waiting. I appreciate your patience.\t\n\n&gt;I am sorry that you are not completely satisfied with your purchase. I am sending out a replacement and you will receive an email notification when it ships.\t\n\n&gt;You do not need to return the original shipment and you may keep or donate it as you see fit.\t\n\nSo far, so good, right? I figured they don't have a script for \"Warehouse fucked up and customer caught it before arrival\" so he defaulted to the \"Customer mad that the warehouse fucked up and we don't want a curled 8x10 back\" script.\n\nOr so I thought...\n\n&gt;Walt: And will the next shipment also be sent in a package that can't possibly hold an 8x10 without damaging it?\t\n\n&gt;CS Agent: I would like to inform you that this is not our usual way of business. We will try to ensure that such inconvenience would not happen in future.\t\n\nOk, now we're getting into the vague platitudes. That's all well and good, but it's utterly meaningless. I don't want a reshipment of another curled 8x10. So, it's time to get specific.\n\n&gt;Walt: What size will FedEx list my next shipment as?\t\n\n&gt;CS Agent: You will receive the item as originally ordered\t\n\nI mean, I ordered an undamaged 8x10 in a large mailer, but the vagueness is setting off alarm bells.\n\n&gt;Walt: That's an incredibly vague way of not answering my question\t\n\n&gt;CS Agent: One moment please.\t\n\n&gt;Walt, I checked your order and I can confirm that you have ordered the item in the size 10x8 inches.\t\n\nUmmmmmmmmmm....... What?\n\n&gt;Walt: Yes, I did.\t\n\n&gt;But I didn't ask you what size item I ordered\t\n\n&gt;Because I know that information\t\n\n&gt;CS Agent: The replacement order will be delivered in the size 10x8 inches as originally ordered.\t\n\n........shit.\n\n&gt;Walt: ...do you understand what my complaint was in the first place?\t\n\nYes, I know that was a bit rude, but better to get it into the open than go around in a circles with a guy who thought he was answering my question. Especially if I'd just end up with the same problem again.\n\n&gt;CS Agent: Yes, Please note: Posters and art prints are rolled with protective wrapping paper and packaged in a cardboard tube.\t\n\n&gt;Walt: Yes, good thing I didn't order either of those\t\n\n&gt;I ordered a photo\t\n\n&gt;Large Mailer: Photos, Magnets, Note Cards, Tin Signs, Calendars,T-Shirts $4.00\t\n\n&gt;As opposed to\t\n\n&gt;Tube: Posters, Art Prints\t$4.00\t\n\n&gt;CS Agent: Yes, It is similar to posters and prints. I assure you that you will receive the replacement order without any issue.\t\n\nWhat the heck does \"It is similar to posters and prints\" mean? In terms of shipping, it's literally not. It's a different category. As I just showed him.\n\n&gt;Walt: Can I talk to a supervisor?\t\n\n&gt;CS Agent: I am sorry Walt, Supervisors are not available on live chats. You can call us and speak to our supervisors over the phone.\t\n\nAs idiotic as that policy is (and it is idiotic), I'm not asking for a supervisor because I need a supervisor. I'm asking for a supervisor because that'll get me someone who, unlike this guy, might understand what I want well enough to address it.\n\n&gt;Walt: Ok, then can I speak to someone else who isn't a supervisor?\t\n\n&gt;Because you don't seem to understand what I'm talking about\t\n\n&gt;Telling me that you're going to ship my photo in a tube (against your own shipping T&amp;Cs) when my original complaint is that you shipped my photo in a tube (and thus damaged it), against your own shipping T&amp;C's, and then telling me that I won't have any problems with the new order makes it clear that you aren't following me\t\n\n&gt;And then telling me what size item I ordered when I'm clearly asking what size FedEx packaging will be used, in order to ensure that you're not going to ship me another damaged photo in a tube (against your own shipping T&amp;Cs) further proves that point\t\n\n&gt;So at this point, I don't care if it's a supervisor or not--just connect me to someone who can understand the very simple words I am using in the order I am using them\t\n\nYes, I know it was over the top and rude, but it's been an effing hour now and I'm getting really pissed off. If I jump off and jump back in the queue, I'll get the same guy, and I have a disability that makes using the phone even worse than this.\n\n&gt;CS Agent: Let me check on it. A moment please.\t\n\n&gt;I checked again, Walt. Unfortunately, we do not have any supervisors logged in currently. Please confirm if we can process replacement for the item with overnight shipping. So, the order will be delivered perfect as you expected. I can confirm that the replacement print will be sent in appropriate tube. I confirm that there will not be any damage to replacement order. So, shall I process replacement via overnight priority?\t\n\n...am I on Candid Camera right now? WTF?!\n\n&gt;Walt: \"I can confirm that the replacement print will be sent in appropriate tube\" Do you know what's wrong with that sentence?\t\n\n&gt;CS Agent: I confirm that the replacement print will be sent in a tube that does not damage the print.\t\n\nBWAHAHAHAHA.\n\n&gt;Walt: In all my years, I have never seen a tube that had an least 8 inch opening. Nor have I ever seen a tube that, even if it did, wouldn't cause the 8x10 inside it to curl.\t\n\n&gt;CS Agent: I completely understand. Your satisfaction is 100% guaranteed. I can offer you complete refund for the shipping charge on the order and process overnight replacement. Shall I process?\t\n\n&gt;We will take your experience and correct the packaging issues in future.\t\n\nLike I said, it's been over an hour, and I'm getting really sick of this. Just give me what I fucking ordered so I can go on my way and never use your shit company again.\n\n&gt;Walt: If you want to process that refund and replacement with overnight shipping, you can. But I'm more than a little concerned that the order will be sent in a tube instead of the large (presumably flat) mailer and I'll be back here again.\t\n\n&gt;CS Agent: Okay, Let me process the replacement order.\t\n\n&gt;I have successfully processed replacement order and you will receive tracking updates once the order ships.\t\n\n&gt;Walt: And the shipping refund? Is it possible to put it all on PayPal instead of the gift certificate that I used for part of the cost?\t\n\nI'm never using this company again, and I especially don't want the gift certificate money to turn into profit for them.\n\n&gt;CS Agent: Yes, I have already sent in a request to process the refund on shipping charges on paypal account. i\t\n\nThat's...odd, considering that this is the first time I brought it up, and refunds generally go toward the original method of payment.\n\nBest I clarify.\n\n&gt;Walt: Not the gift certificate, correct?\n\n&gt;CS Agent: Yes.\n\n&gt;Walt: Will I receive an email to the effect? The amount of the refund and where it was refunded to?\n\n&gt;CS Agent: The refund amount will be credited back to your paypal account and it will take 5-7 business days for the credit to appear.\t\n\n&gt;I have put a clear notes on the order to process refund to your paypal account.\n\nAh ha.\n\n&gt;Walt: And that's what will happen?\n\n&gt;CS Agent: The refund will be credited to your paypal account as stated earlier.\t\n\n&gt;Walt: Let's go about it this way: how much money will be credited to my PayPal account?\n\n&gt;CS Agent: $4.99\n\nAt least this way, if he's as incompetent as I suspect, I have it in clear writing.\n\n&gt;Walt: And are these chat transcripts logged, in full, on your end?\n\n&gt;CS Agent: You can save this chat transcript for your future reference. We will also have this transcript for any future assistance.\n\nAnd they will too.\n\nBut will it do any good? Stay tuned to the next installment!\n\n**TL;dr: \"EveryPicture\" said they photos in large mailers, they bent my 8x10 to ship it in a tube, CS jerked me around for over an hour with vague platitudes and a complete lack of understanding of the problem.**",
        "created_utc": 1519607332,
        "upvote_ratio": ""
    },
    {
        "title": "In a world of craziness BEST OF customer service should never go unnoticed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/807m83/in_a_world_of_craziness_best_of_customer_service/",
        "text": "[deleted]",
        "created_utc": 1519594161,
        "upvote_ratio": ""
    },
    {
        "title": "In a world of craziness BEST OF customer service should never go unnoticed",
        "author": "One_nut_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/807jg4/in_a_world_of_craziness_best_of_customer_service/",
        "text": "[removed]",
        "created_utc": 1519593470,
        "upvote_ratio": ""
    },
    {
        "title": "VOTE FOR WHAT MATTERS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/807gvn/vote_for_what_matters/",
        "text": "[deleted]",
        "created_utc": 1519592860,
        "upvote_ratio": ""
    },
    {
        "title": "Call Center Feedback",
        "author": "jill853",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8075jw/call_center_feedback/",
        "text": "I had to call to confirm something with my mortgage servicing company. I had called to postpone my payment (1st time in ten yrs) and had to call back to tell them to go ahead and take the payment. \nThe woman I spoke to was very pleasant, but had to put me on hold several times to double check everything Was input correctly. When she would put me on hold I would mute the phone and talk to my husband, sense call centers can listen into your car while you’re on hold.\nGot to the end of the car, maybe nine minutes after I initially called, and everything is settled. She thanked me for being so patient and then tells me that it’s really nice to have someone treat her so well on the phone. I was so sad for her that just being nonresponsive and calm counted for a positive customer experience.",
        "created_utc": 1519590167,
        "upvote_ratio": ""
    },
    {
        "title": "Happy to help you",
        "author": "AnnaMaja",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/806ht2/happy_to_help_you/",
        "text": "I was at a big furniture store, the biggest in Europe I think. Yep, that one, and a man who was mentally disabled came up to me and asked about a game. I read the label and told him. He answered 'okay' and left happy. I later saw him in a group with like minded people and it made me happy that I could help and that they do field trips like this! ",
        "created_utc": 1519584654,
        "upvote_ratio": ""
    },
    {
        "title": "My gym is not doing well",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/8064fo/my_gym_is_not_doing_well/",
        "text": "[deleted]",
        "created_utc": 1519581633,
        "upvote_ratio": ""
    },
    {
        "title": "Truly some of the worst behaved customers I've ever seen",
        "author": "viv_hope",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/804mrh/truly_some_of_the_worst_behaved_customers_ive/",
        "text": "So last night my husband and I met a few friends at a wing place in town. Immediately upon being seated, I notice there's a LOUD group of just children sitting directly behind us. Their parents are sitting at another table like 10 feet away, completely oblivious (or just didn't care) what Asshole their children are being. Eventually I had enough of it, I turned around and told them they were being way too loud and to please keep it down. About 20 minutes later one started screaming again, I heard one of the kids say, \"shut up you'll make the hateful lady turn around again.\"\n\nI wasn't mad at them so much as their parents. I cannot stand when people just expect restaurant staff to babysit while mommy and daddy get drunk.\n\nMy hat goes off to servers, they deal with some real shit man ",
        "created_utc": 1519567672,
        "upvote_ratio": ""
    },
    {
        "title": "Hopefully got to intercept a Giant Bitch^TM today",
        "author": "compasschaser",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/802w0s/hopefully_got_to_intercept_a_giant_bitchtm_today/",
        "text": "FTP, mobile, you know. \n\nSo today I'm at my Locally Owned Chain Grocery Store picking up some chicken from their deli/prepared foods area, because neither DH or I got around to eating anything all day and I'm feeling lazy (plus their chicken is sooooooo good, we pick some up a couple times a month). This particular employee (let's call him Luigi), who happens to be the guy who usually is working when we stop by and is always pleasant, is at the counter. I'm in line behind Giant Bitch^TM (GB from here).\n\nGB: I want some of those roasted chicken pieces. \n\nL: How many would you like?\n\nGB: I DON'T KNOW, PICK SOME UP AND I'LL TELL YOU WHEN YOU'RE DONE. YOU WANT TO GIVE THAT KIND OF ATTITUDE TO A CUSTOMER I'LL GIVE IT RIGHT BACK. \n\nAll my what's. \n\nLuigi proceeds to pick up a piece, she tells him not that one. He selects another, she again says no. This game continues until she finds two that are to her liking, he bags them, prints the label, and sticks it on the bag. \n\nGB: How much are these? Are they a dollar each?\n\nGuys. These are freshly roasted leg-and-thigh sections. Easily 1-2 pounds of chicken. They're not a dollar each. Also the label with the price was on the bag and facing her. \n\nBless Luigi, he read the price off too her and she CBF'd and walked away to pay. \n\nHaving witnessed this clear break with sanity, I just know this woman is going to get on Yelp or Facebook or ask to Speak With A Manager. So naturally I had to do the thing I've been dying to do if I had a chance in a situation like this (not fight her, I was tired as hell). \n\nI finished my shopping, and on the way out stopped by guest services and asked to leave a note for a manager. I let the attendant know that the lady in line in front of me had been insanely rude for no reason at all, and that Luigi had handled it like a pro, and I wanted to give good feedback on his work. \n\nHere's hoping that when Giant Bitch^TM complains about her \"mistreatment\" at the hands of a Local Grocery Chain employee, that whichever manager spots it has enough of a spine to let her know that actually, they had a witness, and that HER behavior was the one out of line, and that if she expects to treat their employees like that not to come back. \n\nFingers crossed. ",
        "created_utc": 1519541171,
        "upvote_ratio": ""
    },
    {
        "title": "Move along, little doggie...",
        "author": "Mistress_Jedana",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/802q05/move_along_little_doggie/",
        "text": "tl;dr:  dog and bad humans in big box store, dog pee occurs.  \n\nToday, I popped into the big box store Neighborhood Market that is a mile up from my house.  Needed milk and coffee creamer and a couple other small things, and I didn't want to drive 3 miles to the regular grocery store that has awesome subs and fried chicken here in FL.  \n\nAs I'm grabbing some hamburger buns, I notice a woman carrying a dog.  A girl dog (which I can tell because she's carrying it with the dog's back held against her chest, and holding it under it's hindquarters and around it's waist/chest), and it's about the length of her torso, so not a brand new puppy but maybe a few months old.  \n\nDog decides the bread aisle looked like a tree and cut loose.  Pee runs down the dog and the womans arm/hand, and onto the floor.  The woman goes one armed (just around the dog's middle) and shakes her arm/hand off, flinging dog pee all over the bags of buns and bread and several bags of chips.  Up comes two kids and a man, and they walk off.  \n\nI moved away quickly (good thing I grabbed my buns before the pee-magedon) and got to get the milk (which is in back of the store, end of the bread aisle) and started heading to the cheese section.  There was a line of pee leading from the bread aisle, passing three other aisles, to the meat section (which is on the end of the store; down that section on the other side is the yogurt/cheese/deli meat section).  \n\n The woman (still holding the dog around it's middle) starts handling packages of meat.  \n\nI headed past them, past my cheese section to produce (at the end of the meat/cheese section, also the door where you enter is there), as I had noticed when I came in, there were several big box store employees in suits, standing having a powwow.  I waited a minute for the man talking to stop and then I said excuse me, and let them know they had a dog in the bread aisle, and then before I can say anything else, the store manager cuts me off.  \n\nSM:(rather rudely)  \"I can't ask them to leave if it's a service dog or ESA.\"\n\nMe: \"That's not what I'm here about.  But, yes, you can, because the dog has created a health hazard.\"\n\n SM: (still very rudely) \"what health hazard?  Just because it's a dog doesn't mean it's a health hazard.\"\n\nMe:  \"Well, the dog is being carried and it urinated while it was in the woman's arms.  She flung the pee onto bread and chip products and then she was handling  packages of meat and had not washed her hand.  So you have dog urine on quite a few packages in several aisles, plus all over the floor.\"   And I walked away.\n\nI have never seen a white man turn so pale before.  He took off towards the back, and another man (no nametag) tells the produce guy who was stocking apples to run and get a mop.  They all head to the bread aisle, I think to block it off to get it cleaned, but there have been people walking through it.   It was tracked all over the place.  \n\nThey had people pulling bread and chips off the shelves, people cleaning the floors, and I think meat had to be pulled too.  \n\nFinally made it to the cashier, and she told me corporate was making a visit that day (which would explain why so many managers were hanging around on a Saturday).  \n\nI saw the woman and kids walking out of the big box store as I was leaving, and they didn't have the dog. ",
        "created_utc": 1519538890,
        "upvote_ratio": ""
    },
    {
        "title": "Neither the Server Nor the Buffet Manager Bothers to Listen",
        "author": "vegasgal",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/801nyv/neither_the_server_nor_the_buffet_manager_bothers/",
        "text": "I was at a casino buffet restaurant on the Colorado River (in NV, across the river from Bullhead City).  I've been there so many times and the service is generally OK. The food is way better than the service, so we go. \n\nOn this visit in Jan 2018, we're there again.  I tell the server I want to iced teas for myself. He walks away, completely ignoring my friend. Just looks at her and walks away. I said to him, \"Wait, you didn't get my friend's order.\" He comes back to the table and pretends to care. She also orders an iced tea. \"OK, he says, \"One iced tea, one Coke.\" WTF? Really? I said, \"No, I want two iced teas and she wants one.\" OK. \"One Tea and one Coke.\"\n\nNooooo. So I get up and try to get him to listen. I told him, \"We never even said any word that even sounds like Coke.\" Another, wonderful server asks me, from a different station, \"What did you want?\" I said, \"Two iced teas for me, one for my friend.\" The dick-server says to him, \"YOU serve them, then.\" And he did and the guy was Great.\n\nI hated the way the first server treated us and I wanted the manger to know how the server was completely unresponsive. She asked me what the drinks order was. I said, \"I asked for two iced teas and my friend wanted one.\" \"Okay, she said, \"One tea and on Coke.\" Are you nuts? Come on-this is a game to you?\n\nHow does this person get to be a manger? \n\nTL:DR Hotel itself was horrific. SCALDING water in shower, no engineers respond to my call to the switchboard, no housekeeping service, pay-per-view film in room 3/4 of way thru film shows completely like those old negatives photos are. THEN, only one person in the restaurant cares about their customers. \n\nWelcome to Laughlin, NV",
        "created_utc": 1519526808,
        "upvote_ratio": ""
    },
    {
        "title": "They really didn’t need to, but did.",
        "author": "littleredteacupwolf",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zzp3i/they_really_didnt_need_to_but_did/",
        "text": "A few days ago my husband and I were thrift store hooping about 40-45 minutes from where we live. We decided to pull into an antique store that we had seen a couple of times but never had the time to pop into.\nAs we’re loading our son into his stroller, we realize his diaper is a bit wet. \nWhen we go into the store, we’re immediately greeted by two very nice workers. I asked them if their bathroom had a changing table.\nThe gentleman’s face instantly fell and replied that it didn’t. He started to apologize, but both my husband and I just go, “It’s okay. No big deal.”  Which it isn’t. We honestly weren’t expecting them to have one, but figured there was no harm in asking.\nMy husband looks at me and says, “we’ll change him in the car in a minute.” I nod and take a moment to look at one of the first “booth” areas. \nAs we’re moving about, the gentleman finds us and goes, “hey, so I set up a folding table in the bathroom, is that okay?”\nMy husband and I are a bit stunned for a moment before beginning to thank him about 20 times.\nAs he guides us to the bathroom, he goes, “sorry that took so long. It’s actually our craft table so I needed to clean it off and wipe it down. Are you sure it’ll be okay?”\nAgain, my husband and I are just thanking this sweet gentleman, telling him that he didn’t need to and that he was incredibly kind.\nI quickly change my son and when I’m done, we go and find the gentleman at the front again. \nMy husband asks, “do you need us fold the table up? Is there anywhere we should put it?” \nAnd he replies, “oh no don’t worry about it! I’m just glad it worked out.”\nMy husband, “are you sure?”\nGentleman said no again.\nOnce again we thanked him. We were still so stunned that it was the only thing we could really say. \nWe stayed for a bit longer, but it was getting in in the afternoon and our son was getting very cranky. I left to take him to the car and told my husband to take his time, I had books and the Juno soundtrack (my sons favorite thing to listen to). \nI thanked the gentleman and lady on my way out, made sure to tell him he was very kind. With a big smile he just said, “you’re welcome!”\nMy husband came out a few minutes later, got in the car and went, “I feel so bad not buying anything but I didn’t want you guys to wait so long!” Plus he didn’t find what he was looking for. I felt bad too, but cranky baby wins every time. \nI told him we’d be back again soon and make sure to buy something then.\n\ntl;dr : went to a random antique store that doesnt have a changing table (not a big deal) the gentleman working pulled out a table from the backroom, cleaned it up and set it up in the bathroom for us to use.",
        "created_utc": 1519507848,
        "upvote_ratio": ""
    },
    {
        "title": "If you can’t set a good example for your kid, then I guess I will",
        "author": "kimpastable",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zz1k9/if_you_cant_set_a_good_example_for_your_kid_then/",
        "text": "This happened within the last couple hours, and it’s really just a tale about a not-so-exciting encounter because I feel like ranting about what happened. It’s my encounter with another customer, hopefully that’s okay. \n\n\n\nI was out doing my grocery shopping at a store where they scan your items, throw them into a cart, then you bag them yourself at a long counter at the front of the store. Now, I tried to get my shopping done earlier in the day to avoid the store being busy. As luck would have it, though, it was still packed when I went. All in all, shopping and checking out went smoothly. Standing at the counter to bag my groceries, however,  was another story.\n\n\n\nAs I’m trying to squeeze my way over to the counter with my cart, I can see that there’s only one open spot to stand in due to it being so busy. I made my way over, and noticed that in this spot there was a young boy (maybe 7 or 8 years old) running back and forth between the cart to his left and the cart to his right. I was slightly annoyed, I’ll admit, but I know that kids are kids. Even the best parents can’t make them stand still by their sides every time they go to the store. I was about to say, “Excuse me,” to him, when he seemed to notice me. He stopped running and went over by the cart to his right, practically climbing into it. *Oh, okay, he’s with those people and he’s going to let me put my cart here. Perfect!*, I thought. I was wrong.\n\n\n\nJust as I started to push my cart into the space, the little boy darted back in front of me and stopped directly in front of my cart, just staring at me. Note here that my cart did NOT touch him, I stopped as soon as he ran in front of it. At this point the woman with the cart on the left (who I’ll refer to as RL for rude lady) snapped her head up to look at the little boy (her son, apparently)  and then to me, glaring. Immediately I said, “I’m sorry!” to her, mainly just out of habit, but also because I definitely wasn’t trying to run her kid down or anything of the sort. She wasn’t having it and continued to give me a dirty look. “You could say excuse me!” RL practically shouted at me, clearly not having seen any of what had been going on. She also had a little girl standing on the other side of her, who I’m assuming was her daughter. \n\n\n\nNow, I definitely felt like saying, *Well, you could watch your f**king kid!* but I held my tongue. Instead, I took a breath and calmly said to RL, “Ma’am, he stepped in front of my cart just as I was pushing it into that spot. It wasn’t intentional, but I do apologize if I made you upset.” I could tell this made RL very uncomfortable. Clearly she was expecting me to either keep my mouth shut or say something rude in response, rather than offering a calm explanation. She would no longer look at me then. Instead, she looked away, then started laughing, shaking her head, and mumbling about how “that wasn’t the case” (because her son is a perfect angel who would never run in the grocery store, right?) as she put her head down and continued bagging her groceries. I was still pretty pissed off internally, but I’m not one to pick a fight with someone or insult them in front of their kids, so I just let it go and started bagging my groceries as well.\n\n\n\nNow, this is the good part. Mid-laughing-mumbling-grocery-bagging-rant about what a rude and terrible person I am, I hear RL’s little girl (probably about 5 or 6 years old) say, “Mommy, why are you laughing like that? Why are you being so mean to her?” RL suddenly went quiet. She shushed her concerned daughter, and hurriedly bagged up the remainder of her items. As she started to walk away, I looked up, smiled at her, and said, “Have a good day, ma’am.” She looked at her daughter (who was watching intently to see what her mom would do), and then at me. I could tell it was killing her when she half-smiled and quietly said, “You too,” before rushing out of the store with her kids. \n\n\n\nAlthough I’m still kind of annoyed over the whole situation, I feel better knowing that A. I was able to be the bigger person (even though I really didn’t want to be!) and B. that even RL’s small child was able to recognize that her mom’s behavior was inappropriate and unnecessary. Hopefully this was just a bad day for her and she’s not going around treating everyone this way, because she did seem embarrassed about her actions. If that’s not the case, I hope she’ll at least think twice next time, especially if her kids are around.",
        "created_utc": 1519502012,
        "upvote_ratio": ""
    },
    {
        "title": "Math",
        "author": "idonotlikemyusername",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zyd55/math/",
        "text": "I was at a major department store known to have at better customer service and cashiers than the other major department store in town, so I was disappointed the other day when this happened.\n\nValentine's Day items were on sale for 90% off. I picked up 5 items and pre-scanned them to make sure that the correct price came up. Three were fine, but two scanned at 50% off.\n\nI got into line to checkout. When it was my turn, I told my cashier about those two items. She had a vacant look in her eyes. I'm not sure what was going on. Anyway, she scanned both of those items and put them in the bag.\n\nI reminded her about what I had told her only one minute prior. She didn't say a word, took them out of the bag, hit a few buttons and scanned the first one again. She then typed 40% off. Grabbed the second one and did the same thing. Then she told me the total.\n\nI was a little dumbfounded. Because there was a line, I decided not to go through the hassle of correcting her, but now I wish that I had. I just don't think she would have understood and I would have looked like a jerk trying to get my last few dollars off. (Items were $10 each. I should have paid $1. Paid $3 instead.)\n\nTldr: 50% off + 40% off does not equal 90% off.\n\nExample:\n\nA) $1.00 at 90% off = $0.10\n\nB) $1.00 at 50% off = $0.50 at 40% off = $0.30\n\nFor every $1 of original price, example B is $0.20 more expensive.\n\nEdit: typos and clarity from quickly  proofreading before I submitted",
        "created_utc": 1519496140,
        "upvote_ratio": ""
    },
    {
        "title": "That time I was a Brit in Tennessee.",
        "author": "Thatdarkokid",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zy1vp/that_time_i_was_a_brit_in_tennessee/",
        "text": "Hey everybody, long time lurker, first time poster! Sorry for formatting, I’m on mobile. \n\nI’m British and I go to the states once every 1-2 years to visit and stay with my buddy for a month or so; this story is about the first time I ever visited the states and it’s a story that always makes me smile/laugh when I think about it. \n\nSo usually myself and my buddy travel to different states when I go and visit and one of the places we visited was Tennessee. We stayed in a few places but the first was near the smoky mountains. So we arrive, check into our hotel and decide to grab something to eat before we go walking around. We find a small restaurant, get seated and provided menus and a few minutes later our very nice waitress approach’s us and asks what we’d like to drink. My buddy orders a Diet Coke and she turns to me, I’ll be M and she’ll be W. \n\nW: What can I get for you? \n\nM: I’ll have a water please. \n\nW: A what? \n\nM: Water, please? \n\nW: Sorry, one more time? \n\nM: Can I have a water please? \n\nW: *stands there looking confused as ever while I want the ground to swallow me up* \n\nAt this point my buddy is just watching the exchange between her and I and chuckling to himself and then orders for me. Because of my accent I tend to drop the T in a lot of words and because of it, the waitress couldn’t understand what I was saying. She was very apologetic and very lovely the entire time she served us but it definitely taught me that while I’m visiting the US, I need to actively try and remember to pronounce my T’s. That encounter is one I don’t think I’ll ever forget and it’s definitely one of the few happy memories I have. \n",
        "created_utc": 1519493459,
        "upvote_ratio": ""
    },
    {
        "title": "Pain Clinic Punishing a Patient",
        "author": "franciswyvern",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zxpoo/pain_clinic_punishing_a_patient/",
        "text": "Hello, I hope this is the correct place to post a story like this. I wasn't the patient but I was the driver for the patient.\n\nNow my GF had an appointment at this pain clinic so she can get some treatment for back pain she's had for a long time finally diagnosed. \n\nHer other forms of transportation fell through so I was the driver. (she lives over 40 minutes away so a closer ride would have been preferred)\n\nWhen we got there she had questions about the procedure like the type of sedation as they never mentioned what it would be in her original paperwork. Asked about whether I could be in there for her. They mentioned no but I could go back to the room where they will prep her for the sedation but after that I can't go into the procedure. All good.\n\nOnce we were back there she got the sedation, which was a different form of sedation than how the front desk mentioned. All good. I was asked whether I was the driver and gave my name and relation to her.\n\nI asked as she was being led back how long the procedure will take, the nurses mentioned it would be about 20 to 30 minutes.\n\nOk so my GF had asked me to go grab her blanket from her home so we didn't need to go by her place on the way back to mine for her recovery. So I went and did so while she was having the procedure done.\n\nI was explaining every time we talked to the nurses and what we talked about because at no point in time did they tell me a driver MUST stay on the premesis during the procedure. Even when I specifically asked how long it would take or they took down my info as the driver did they mention this EVER.\n\nNow It took about 40 minutes for me to return to this place and the nurse actually talked to me before releasing GF and this is paraphrased. \"Because of what happened here we will no longer do any procedure requiring sedatives on her.\" I was confused as all hell, yeah sure it took time but there is:\n\n1. A waiting room with staff and cameras \n\n2. a recovery room where they had my GF the whole time while waiting for me after her procedure.\n\n3. At No time did they tell me or my GF that the driver was required to stay on premesis the whole time. Hell, when I brought that up to them they gestured to my GF who was now beside us, \"Oh we told her\" and she shook her head and said outright they never in any paperwork or any of her appointments leading up to this did they mention this fucking rule.\n\nI wanted to argue a bit more or at least get more explanation on what the hell they were talking about 'No longer doing procedures requiring sedation' But my GF wanted out she was perfectly able to stand and walk on out and was rather pissed and stressed as after she told me that the IV based sedation did absolutely nothing.\n\nI feel this was rather unprofessional literally punishing a patient for the fact that oh no her ride that is assured to be driving her home went to grab something for the patient while the procedure was taking place. I already have my GF writing a complaint to them for the fact they did nothing when she was screaming at them and crying on the table that the sedatives did nothing and she is feeling everything. I was just going to add my own complaint at the end of hers but still it boils my blood being talked to like that and having a patient punished for such a minor thing.",
        "created_utc": 1519490548,
        "upvote_ratio": ""
    },
    {
        "title": "A customer service exchange that's a real headscratcher.",
        "author": "militarymogul",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zvzql/a_customer_service_exchange_thats_a_real/",
        "text": "[removed]",
        "created_utc": 1519470577,
        "upvote_ratio": ""
    },
    {
        "title": "Had the best waitstaff the other night",
        "author": "redfern962",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zv59c/had_the_best_waitstaff_the_other_night/",
        "text": "I don't go out to dinner often. It's not really my thing, I'm pretty picky with my food, and for some reason restaurants totally set off my social anxiety. I currently have family (grandmother's sister) in town, as my grandmother is in her last moments of lucidity before dementia completely takes over, so the other night was one of the few times I have agreed to go out.\n\nWe (my mother, father, grandmother, her sister, &amp; I) went to a lovely local Italian place. Our waitress was absolutely fabulous with my grandmother, taking all the time in the world to answer her many questions, looking her in the eye, and letting her take as much time as she needed to make decisions and figure things out. We are so used to waitstaff just deferring to one of us (usually my father) to ask for my grandmother's order, or getting impatient with her repeated questions and confusion that going out to eat can be difficult for all involved. This waitress was lovely, had such a positive presence, and treated my grandmother like a person. \nOur busser was also great. I drink water like it's nobody's business, and I don't think my glass was empty for more than a minute the entire night. Probably refilled just my glass (9oz) at least 10 times. He was on it with everything,  and was so attentive and lovely the entire time we were there. The food I ordered was not the best, but the staff made the entire experience so worth it. 10/10 would go again. \n\nSo thank you, to the lovely woman who treated my grandmother like a normal person, and who went above and beyond to be kind and patient with someone who is not the easiest to be patient with. You really made a difference, much more than I think you will ever know.\n\nAnd yes, we tipped them both well over 20%. They absolutely deserved it.",
        "created_utc": 1519457258,
        "upvote_ratio": ""
    },
    {
        "title": "Ignored at the Hotcake Place",
        "author": "PortableEndzone",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zukgk/ignored_at_the_hotcake_place/",
        "text": "[removed]",
        "created_utc": 1519449628,
        "upvote_ratio": ""
    },
    {
        "title": "Airline Ticket Agent has psychic ability to determine stroller size.",
        "author": "2PartridgesinaPetri",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zu0gw/airline_ticket_agent_has_psychic_ability_to/",
        "text": "This happened about a year ago. We were on our first flight with twin newborns (4 months old) and had done as much research as possible to ensure a  smooth and successful flight.\n\nWe were using a metal frame stroller which is a super light, compact metal frame that is designed to hold two infant car seats. So when you take the car seats off it folds up incredibly flat and is lighter than an umbrella stroller. Perfect for the airport or so we thought.\n\nWe finish checking our bags at the ticket counter when the ticket lady almost gleefully says “oh you can’t check that stroller at the gate. It’s way too huge. It will never fit down the chute.” \n\nFor anyone who hasn’t flown with kids, it is common practice to walk through security and the terminal with your stroller and car seat and check both items at the gate right before boarding. And there was no way we were dragging two 30lb car seats and two newborns through an entire airport without a stroller to carry them in. I had called ahead multiple times and spoken with many recent travelers and this was never even a consideration in my mind.\n\nSo after a few minutes of my very calm, gracious husband trying to come to a resolution, I gave him what he calls the “hold my purse” look. Which means you could have dealt with Mr. Rational and instead you get Mrs. Gird Your Loins.\n\nMiss America’s Asshole just keeps saying “I can tell just by LOOKING at it it’s NEVER going to fit.” “13 people have been injured this year by too large strollers going down the chute!” Which one is it you nut job!? Is it not going to fit, or is it going to injure someone, neither of which are written anywhere in the Airlines policies. She did not have an actual measurement either. She “JUST KNEW!”\n\nAfter showing her how small it folds down and comes apart and demonstrating how light it is only to be met with apathy and condescension, I just totally snap. My husband, sensing the vibe, packs up the kids and physically moves away from us and the situation with a look that can only be described as, “R.I.P. Miss America”\n\n“Look lady, I AM NOT about to drag three carryons, a diaper bag, a cooler, two car seats and two newborns through an airport with no stroller. I called three times and your airline said it was perfectly fine. So I will literally sit down and wait right here in front of you until you either call us a shuttle car or wheelchairs. Or you bring the guy who runs the chute. Bring his ass all the way up here with his little measuring tape and have him tell me this stroller isn’t going to fit down the little chute.”\n\nSo all in a huff she said, “Don’t blame me for your poor planning. You can certainly go to the gate and “try” to check the stroller. But they are going to send you right back here to check it. I’m just trying to do you a favor and save you some time!”\n\nSo that was that. We loaded the babies up in the contraband stroller and flipped a mental middle finger to Miss America’s Asshole and went on our way. Unsurprisingly the stroller fit down the chute just fine. And we’ve been on 10 flights since then and no one has ever questioned that stroller. But when we got to the gate they did say “Oh you must be Miss /u/2PartridgesinaPetri. We heard about you ;)”\n\nTLDR: Airport employee wanted me to drag two newborns in car seats through a huge airport by hand because my stroller “LOOKS TOO BIG.” Turns out it’s not.",
        "created_utc": 1519443382,
        "upvote_ratio": ""
    },
    {
        "title": "The time our seats were hijacked",
        "author": "LeanBop",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zte7k/the_time_our_seats_were_hijacked/",
        "text": "I’m on mobile, sorry if the formatting is weird. \nI was debating posting this under r/AmITheAsshole because I wasn’t sure if the waitress was in the wrong here.. \n\nI’ve never waitressed before. But I’ve worked fast food. My mom was a waitress my whole life. I used to come into work with her and help her bust tables when I was 10. Waitresses, basically anyone in the food service industry has my upmost respect.\n\nSo anyway, my boyfriend and I went out to a chain Italian restaurant that offers free soup, salad and breadstick refills. \nWe’re on layoff right now, unemployed for a few months, so going out to eat is usually a treat. This time, we had a gift card. So we went out. \nThis is a restaurant in our area we frequent often. We’re familiar with the waitstaff. This time it was dead. Maybe 5 parties in the whole place. We decided to sit at the bar, because we were going to drink a little and enjoy our meal. \n\nThere is no one else seated at the bar area. So grab some stools and sit in front of the TV to watch the Olympics. After two vodka tonics each and salad/breadsticks, we tell our waitress that we’re stepping outside for a smoke, we’ll be right back. We had just put our entree orders in. She says no problem. \n\nNot sure if this makes a difference, but I’d like to note that we usually sit at the bar, and step out for a smoke, and we’ve had this waitress multiple times. \n\nWhen we come back, our seats have been taken by 4 teenage girls. Mind you, there is NO ONE else sitting at the bar, NO ONE else even in the booths behind the bar- \n\nso why didn’t this waitress tell those girls someone was sitting there? Our empty glasses, and our entrees were still on the bar, except the were pushed to the far end of the bar. When other waitresses have drink orders that are made at the bar, they get made by the bartender and then they’re set on the ‘pick up station’ ... y’all know what I’m talking about? So our food was sitting right on the pick up station area. So drinks are being passed back and forth to other waitresses, while they’re all chit chatting (it was slow, remember) right over our food, I watched this happen. \n\nWe moved to another end of the bar, and after a couple minutes of her making drinks/taking the teenage girls orders, our waitress grabbed our food that had been sitting at the other end. We kindly asked her for replacements. She said “oh it just came out a second ago. I hasn’t been sitting long. It got here right before you came in.” I told her it wasn’t that, it was the fact that it was sitting in the drink pick up area, and multiple people were passing drinks/talking above our food. We were super nice about. We weren’t condescending, and we never mentioned anything about her not saving our spots. \nSo after, she says, “okay and I suppose you want fresh bread too??” There wasn’t even bread on the table.. we had finished our first basket before we went outside and she hasn’t asked to refill it. So we said “yeah, sure.” So she takes our two entree plates, and squished them on top of each other and leaves them in front of us. Even while she returns with more bread, she doesn’t take the plates. Is she trying to make us feel bad..? Finally after the new entrees come out, and more drinks she takes the old plates away. She was super rude the rest of the time. \nShe never asked us if we wanted refills, we had to flag her down while she was dusting off wine bottles behind the bar. (THE PLACE WAS DEADDDD) it’s like she was purposely avoiding us. She was super tentative to the girls that stole our spots though, “can I get you guys anything? Drinks?! More bread?? Soup?!!”\n\nLike I said, we’ve had her as a waitress before! Never had problems, ALWAYS left a gracious tip. I asked for a to-go bowl of soup to go, like I ALWAYS do, she has done it before, and she says “oh sorry that’s not allowed.” \nWe didn’t even get those little chocolate mints. \n\nIt’s not so much that our seats were taken, it’s how rude she was the rest of the meal. \n\nWe still tipped her 15%. I always tip 20%, if not more. I tipped her because I didn’t know if she was in the wrong for not saving our seats. She was definitely in the wrong for being a complete cunt the rest of the meal though. \n\nI guess my question is - why didn’t she tell them, “oh I’m sorry, someone else is sitting here, would you mind sliding down?” \nIs it policy? If we go outside to smoke or to the bathroom and another customer sits at the bar stool, are you not allowed to hold it? \n\n\nThis got really long, I’m sorry. I don’t even know if what I typed made sense, I’m kind of rambling. If I was in the wrong, please tell me. \n\n",
        "created_utc": 1519436956,
        "upvote_ratio": ""
    },
    {
        "title": "Wouldn’t Take No for an Answer",
        "author": "taratulatino",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zs3d4/wouldnt_take_no_for_an_answer/",
        "text": "This was a few months back but I thought it would fit this subreddit. \n\nI’m not an expert but I know computers. I know what makes a laptop good and what makes it bad, software to avoid and how to fix a lot of technical issues. I did my research to find a new one and decided on a Lenovo yoga model. Didn’t need anything super fancy, but I wanted something new. I go to ‘big name UK electronics supplier’ and being the quick person I am, I found the laptop and grabbed an employee to ring it up. The guy I grabbed was an older fella who was polite and nice and sent me to the till/computer thing they did all the computer/laptop sales from (wasn’t a normal till). \n\nThe guy who came back with the laptop was different however. Barely older than me. He asked me if I was getting the Lenovo, I said yep and wanted to pay and get on with my day (I’m not a person to doddle or waste time)\n\nNow I’m not dumb, I know these people are told to try and sell anything they can for a bigger sale. That’s fine, I can put up with that. But this guy, I don’t think he understood the word no. \n\nThe only thing I wanted with the laptop was Microsoft office. Just a one year supply, bought there and then because I might not have the monthly money for it - am poor student. \n\nHe asked me 4 times if I was *sure* I wanted one year. Yes. I’m sure. He was really persistent but I ignored it. Then he said they had a sale on Norton Security. No thanks, it’s basically useless. \n\n“Oh but no, see it’s the best there is”\n\nI disagreed and just said I was already paying for a security system I could put on the laptop. \n\n“It won’t be as good as Norton, I’ll just put it in the basket with a discount” and he tapped away on the screen. \n\nI know it’s not something to be so shocked over, but... what? You don’t decide what I’m buying. I’m not an angry person by any means but that really annoyed me for some reason. I told him that, no, I don’t even want it *with a discount* because it’s useless - even if it was free it’d be useless. \n\nWhen I’m angry I show it in my face (resting bitch face represent), and I knew he noticed. Despite this, he did this again over insurance on the laptop. \n\n“It’s £20 a month for insurance, but it’s a 20% for 2 years so we’ll do that”\n\nNo *we* won’t. If you’ve ever read the fine print of those things, especially with laptops, it’s useless. They won’t even fix screens, never mind something really bad. Complete waste of money. I said I didn’t want it. \n\n“If you break it we can replace it, so I’ll just leave it on (the basket)”\n\n“No, I don’t want it” I said much more loudly and firm than I ever think I have in public before. I got a rush of adrenaline from that ffs. He stood that totally confused, like as if I was shouting at him for being too helpful. \n\nAfter that he shut up until I actually paid. He said thanks and come back if you need anything and I have never felt so confused and angry over a shopping experience before. Either he was totally unaware of how he was acting or was a moron who thought he was helping. \n\nRant over I guess",
        "created_utc": 1519424923,
        "upvote_ratio": ""
    },
    {
        "title": "Coke vs. Pepsi",
        "author": "kumochi",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zqvum/coke_vs_pepsi/",
        "text": "Yes, both are soda but Coke and Pepsi are definitely different! \n\nRecently a steak house reopened after fire (yay!) and their soda company is Coke (with the glass and everything). My bf is a soda lover and definitely can tell what's what. With our meal, he ordered a Coke. Once it came, first few sips were fine but he soon realized something was off. We both tried it and was pretty sure it was Pepsi. Eh - no big deal. \n\nMeal continues and soon drinks need to be refilled. Curious, my bf asks, \" Can I get a Pepsi refill?\" The waiter instantly squeaked, \"Coke! Yes I'll get that for you in a sec\" and speeds away. \n\nIt was definitely strange but meal went smoothly and everything was good. My bf went through 3 glasses of 'Coke' to be sure that it was more citrus than raisin-vanilla flavor. \n\nFrom what we know, Coke is more raisin vanilla sweet flavor while Pepsi is more citrus refreshing.\n\nAfter dinner, we stopped by a gas station (literally left the restaurant lot and turned into the gas one) to get a bottle of Pepsi and Coke. We sat in the car tasting each one and I'm 99% sure that it was Pepsi ... unless they added a tangy flavor to their Coke.\n\nI'm not sure what really happened but this whole soda situation just weirded me out, especially the fact that the waiter that was so friendly and chatty at the beginning of the meal squeaked and hurried off. ",
        "created_utc": 1519415416,
        "upvote_ratio": ""
    },
    {
        "title": "*Something a bit different. This is the story of the drunkest women I've ever seen at a bar.",
        "author": "xProperlyBakedx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zpos2/something_a_bit_different_this_is_the_story_of/",
        "text": "So a friend of mine and I were going to this tiny little dive bar to see one of my favorite bands. When we get there we have to park quite a ways because parking downtown in my city is shit. But, as we're walking to the bar we see this late 40s early 50s bar fly stumbling her way down the sidewalk mumbling to herself. We pay no mind and keep on trucking.\n\nWe'll when we get to the bar we decide to wait a second before going in and finish our cigarettes. As we're smoking that same woman comes around the corner and steams *TAAAAMMMMY!* into the bar. Then stands there talking to herself about how *that bitch left me*. \n\nNext thing you know, a slightly less drunk woman pulls up in her car. Apparently this is Tammy. She hollers at her friend to get into the car. Woman 1 tells Tammy she is *way to drunk to drive* and that she will drive. \n\nSeveral people around the entrance to the bar are looking at them and each other waiting for someone to say something.\n\nSince no one else would, I holler over to them, \"Hey, maybe you should take a cab...\"\n\nThe drunker of the 2 yells back *mind your own fucking business asshole. Who the fuck are you to tell me what to do?! You look like a coke head anyway!*\n\nBeing funny (but not really) I reply back, \"Ha! Jokes on you lady, I haven't done coke in weeks!\"\n\nEveryone laughs, she stumbles and bumbles her way into the driver seat. And tries to pull away nearly causing an accident.\n\nBefore they're out of earshot I holler out to them.\n\n*\"Drive safe! And remember, you're never too old for a DUI!\"*\n\nThe look on their faces was priceless.\n\nWe all laughed, she cussed me out. The cops came, she was arrested. The concert was awesome. \n\nThe end.",
        "created_utc": 1519406375,
        "upvote_ratio": ""
    },
    {
        "title": "\"I want my biscuit!\"",
        "author": "muddycurve424",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zomw7/i_want_my_biscuit/",
        "text": "This happened maybe 20 years ago, but I recently remembered it and wanted to share it. So a certain famous US fried chicken place in the Middle East would serve its meals with a plain burger bun. People who worked for this restaurant here would only be aware of what the menu is locally. Also most people probably didn't know what a biscuit even was.\n\nSo I'm standing in line behind a woman (by her accent she was either American or Canadian) who had ordered a meal and gotten a bun with it. She was upset and demanding a biscuit. The person behind the counter was Indian, as was typical of the service industry at the time. They also weren't very fluent in English. So this lady is getting more and more frustrated, and getting louder and louder. The poor guy was confused as hell and kept saying \"no ifham\". Ifham means understand in Arabic.\n\nI figured out that the restaurant served biscuits in the States not buns and decided to help out. I stepped up closer to her and said, \"They don't have biscuits here, he doesn't know what you're talking about. They only have buns here.\"\n\nShe said, \"But back home they have biscuits. I don't want a bun! They should have biscuits!\" \n\nI said, \"Well they don't and there's nothing he can do about it.\"\n\nShe eventually took her meal but left the bun, complaining the entire time.\n\nTL;DR Lady couldn't understand that menus for chain restaurants can be different in different countries.",
        "created_utc": 1519398135,
        "upvote_ratio": ""
    },
    {
        "title": "\"I want my KFC biscuit!\"",
        "author": "muddycurve424",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zmais/i_want_my_kfc_biscuit/",
        "text": "[removed]",
        "created_utc": 1519370236,
        "upvote_ratio": ""
    },
    {
        "title": "They paid our bill",
        "author": "40milesfromnowhere",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zjipp/they_paid_our_bill/",
        "text": "I’m on mobile so I apologize for the format! Also this isn’t your typical tale as it’s a positive one!\n\nToday, my clinical group went out after clinical because it was our last clinical day ever as we graduate nursing school next week. We showed up at 11:30 and there were 9 of us total. There was an elderly couple who walked into the store first and chit chatted with the students in the front of the group (they will come into play in minute). \n\nSo we all sat down and ordered, most got alcohol and the few of us got sodas. As our food was delivered to us the manager sat down across from us and started telling us a story about how he was a paramedic at one point and that he knew one day we would have that patient that would make us question why we ever became a nurse in the first place. \n\nAs we finished the story up he let us know our bill was paid. All of our bills, which i estimated to be over $150. Although they wanted to be anonymous, we figured it out as the couple who walked in, in front of us.  Cue all of the emotional females (aka everyone) start crying. I wish we could have went back and thanked the couple in person, but I know that today will stick with me for a long time to come.\n\nAnd thank you to our awesome server who had to deal with 9 stressed out, loud, and probably annoying students right at opening!",
        "created_utc": 1519342871,
        "upvote_ratio": ""
    },
    {
        "title": "The time I was accused of stealing iced treat rhyming with 'burpee'",
        "author": "Magalb",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zj61l/the_time_i_was_accused_of_stealing_iced_treat/",
        "text": "Mobile post~\n Happened years ago btw\n\n\nI was only ever accused of stealing once. \nMy mother would always send me down to a chain gas station that rhymed with 'heaven unleavened' to fill up a gigantic insulated mug with Pepsi. \n\nI'd been doing it for weeks, months even, when the cashier confronted me out of the blue, claiming she saw me putting the Slurpee in. \n\nI was about 12 at the time, so I was scared. I honestly thought I'd made a mistake, so I took the lid off to show her. She seemed unhappy that I hadn't taken the slurpee after all.\n\nI never really talked to her before, because she was always grumpy; however, she seemed to keep an ear out about me, because when my grandfather had passed away that year.\n\n I had gone in and she started crying. She told me she was sorry for my loss.\n\nIt was kind of sad, now that I think about it.",
        "created_utc": 1519339976,
        "upvote_ratio": ""
    },
    {
        "title": "That Time I Was (Wrongfully) Stopped For Shoplifting",
        "author": "kylastingrae",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zgfxb/that_time_i_was_wrongfully_stopped_for_shoplifting/",
        "text": "This happened at least 14 years ago, but embarrassment really sticks around so it may as well have happened yesterday!\n\nIt was shortly after Christmas, and my boyfriend and I were going to the movies together. We had some time to kill before the show started, so we headed to a nearby strip mall that contained both a video rental store and a common Canadian pharmacy/retail store.\n\nWe browsed the video rental store for awhile, and I purchased a couple movies that were on sale post-holidays. At the time, I carried around a MASSIVE purse, so I opted to stow my purchase in my personal bag rather than take a plastic bag. We still had some time before the movie started, so we decided to wander to the pharmacy to grab a drink to sneak into the movie theatre. Given that we weren't in a hurry, we spent a bit of time browsing the holiday clearance section.\n\nNow, I do take SOME of the blame for what happened. We *were* being silly, and we *were* picking up items and playing with them, and we *were* canoodling in the aisles. But we were also teenagers, so I think we would have had a target on our back no matter how we were behaving.\n\nOnce we felt like we had wasted enough time we headed to the coolers at the front of the store, grabbed our drinks, and headed for the checkout. We were stashing our beverages when a pharmacist comes screaming down an aisle and demands, in a very loud voice, to see what is in my purse.\n\nI'm an incredibly passive person and entirely non-confrontational, and I had no idea at the time that what he was doing was a **major** no-no. Not wanting to cause any trouble, I calmly opened up my bag, and he immediately saw the two DVDs I had purchased next door with receipt sitting neatly on top. The pharmacy didn't sell DVDs.\n\nYou could visibly see this guy's face fall as he realized that he had just accused two teenagers of shoplifting *BEFORE THEY EVEN LEFT THE STORE* (it's not really shoplifting if you haven't left the property, and as a reminder, we were just being silly, not malicious). He stammered out an excuse - something about seeing us joking around on the cameras playing with the merchandise, and he and another employee surmised that we were *probably* stealing something BUT would make a small purchase in order to make us seem like honest, paying customers (which, I again remind you, we were). It was entirely bizarre, especially considering the fact we spent most of our time in the holiday clearance aisle, and why would we steal bows or wrapping paper or plastic pictures frame snow globes?\n\nI didn't know what to do, so I just left, face hot with embarrassment. It ruined the rest of the night.\n\nThis story has a strange ending though. I told my Mom what occurred. She's worked as a manager at this pharmacy chain for most of my life, and she told me that it's 100% against policy to stop people within the store, even if you're certain they stole something. She said that she's seen (EDIT: would-be) shoplifters ditch the product before walking out the doors, so it's not even a crime until you walk out of the store with it. And even if we did take something and walk out of the store, like most retail establishments, you aren't supposed to confront the shoplifter. Best you can do is call the cops, and provide evidence for later arrest/conviction. This guy was majorly in the wrong. I mean, maybe he was having a bad day? Maybe he needed a win or wanted to seem powerful and in charge in front of some kids? Who knows.\n\nWe got our \"revenge\" later, because a couple months down the road my Mom was hired as a manager at that exact location, and really laid into the guy about his behaviour. Even further down the road, as an apology, she made him be the guarantor on my passport (back when you still needed someone in an official capacity to verify your identity). I honestly don't remember if he apologized, because the incident itself is more burned into my memory than any interaction I ever had with him afterwards, but I really hope he learned a lesson that day about profiling teenagers.",
        "created_utc": 1519319214,
        "upvote_ratio": ""
    },
    {
        "title": "Grumpy older lady had no discretion over my birth control at the pharmacy.",
        "author": "purple_urkle_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zcvkz/grumpy_older_lady_had_no_discretion_over_my_birth/",
        "text": "This happened a few weeks ago, but its still on my mind and since ive recently subscribed to this sub and enjoy the stories as im a server myself, I thought id share what happened during my visit to the pharmacy. \n\nSo i went to buy my usual prescription for birth control, but instead of using my usual local chemists, i went to a pink chain pharmacy store thats well known in Australia, as id just bought groceries in a town I usually dont frequent, and the pharmacy was right next door so why not. I didnt expect a problem.\n\nI walked in and waited at the counter for service, and a polite plump woman in her late 50's served me. When i handed her my bc perscription she furrowed her brow and looked somewhat concerned, i almost wanted to ask if everything was ok because there was a pause. She asked if id been to the pharmacy before which i thought was odd but not a bad question, so i say no. \n\n\"So youve bought the birth control pill before, this isn't your first time?\" \n\nI was a bit taken aback because she mentioned the name of what i was buying, the word \"birth control\" at normal speaking volume, and it sounded louder because even though the shop was busy because it was after school time, the perscription counter was silent. So i have no doubt everyone heard this conversation. Usually the pharmisist refers to the medication as \"it\" or something vague during conversation, for privacy reasons. You wouldnt say in normal speaking tones \"have you used this diarrhoea medication before, sir?\". So the same applies to bc. \n\n\"No.\" I say in a hushed tone. \n\n\"How long have you been using birth control.\"\n\n\"Almost seven years, the length ive been with my long term partner.\" \n\n\"And have you had any other sexual partners besides your partner?\" \n\n\"...what? No? Of course not...\"\n\n\"Do you and your boyfriend use secondary forms of contraception?\"\n\nOh. My. God. Still maintaining her speaking voice at a strange customer service drawl, i was totally shocked at how irrelevant i assumed these questions to be. I curtly said no, please, I know what im doing, please keep your voice down. \n\nThis woman looks at me with wide eyes, tells me to take a seat for ten minutes, then looks away, making damn sure i can see her forced expression of \"woah okay\" indicating she thought i was being very dramatic. \n\nI sat down amongst a broad demographic of people waiting in line and also those who were seated waiting for their perscriptions, and felt really embarrassed. Ill be damned if i make eye contact with any of these people. I felt pretty humiliated. \n\nMy perscriptions ready, i hear my surname and i rise to collect it from the same woman and im hesitant and pissed. She explains the usual details about repeats that every pharmisist explains. \"Yep, uhuh, yep\", i just want to get out of there because this is so uncomfortable. I grab the basket but she hold firm. \n\n\"I also recommended thinking about utilising other forms of contraception such as an iud or a condom for your partner... has your doct-\" \n\nI yanked the basket from her grasp so hard the pill box nearly fell out- and i briskly walked to the counter. I didnt look to see peoples reactions. And i dont know why i did that- it was a knee jerk reaction to overwhelming embarrassment. \n\nI paid and left and called my bf to tell him. In all of my seven years buying birth control and using it effectively, this has never happened to me at a chemists. I got plenty of advice and information from my trusted lady doctor, not a bloody pharmisists assistant. I was left feeling mortified and extremely guilty for no reason. After all, i was doing the reasonable thing and buying bc. \n\nHas anyone else had really fucked up instances in a pharmacy of pharmisists not holding discretion? \n\n\n",
        "created_utc": 1519281878,
        "upvote_ratio": ""
    },
    {
        "title": "No Privacy Trying to Speak to the Pharmacist",
        "author": "Chestnut-mare",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7zak6z/no_privacy_trying_to_speak_to_the_pharmacist/",
        "text": "So this happened a few months back but it’s something that still bothers me. \n\nI was on antibiotics for a few days and I ended up getting thrush from them, (antibiotics can cause you to get it). \n\nI didn’t realise I had it until after I’d already had sex with my boyfriend and so I then passed it onto him. \n\nGo to the store and realise I need to speak to the pharmacist as I know what I need to buy for myself to help treat it but no idea what to buy to help my boyfriend. \n\nI go to where the counter is to speak to the pharmacist, someone is there already talking to him, I keep a bit of distance apart, close enough so it was obvious I was waiting to see him but far enough apart so I couldn’t hear their conversation, I just thought this was common sense. \n\n3 more people line up behind me, a guy carrying a toddler in his arms and an old couple behind him. \n\nWhen it’s my turn to speak to the pharmacist I step up to the counter, I’m about to tell him the problem when I realise that everyone has lined up right behind me, so close in fact that the toddlers feet in the mans arms keep prodding my lower back! \n\nI’m already embarrassed and nervous enough speaking to the pharmacist but now with everyone bunched up right behind me I almost change my mind completely. I tried to keep my voice as low as possible as didn’t exactly want other people to hear that I had thrush but with how close the other customers were I don’t see how they couldn’t have heard. \n\nAm I in the wrong for getting really annoyed and stressed out about this? It was a fairly big and empty store, no reason whatsoever why we all had to be bunched up together. ",
        "created_utc": 1519259126,
        "upvote_ratio": ""
    },
    {
        "title": "Fabulous Fabulegs!!! 💗",
        "author": "Catblue77",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z82qb/fabulous_fabulegs/",
        "text": "[removed]",
        "created_utc": 1519239844,
        "upvote_ratio": ""
    },
    {
        "title": "Fabulegs",
        "author": "Ratsky19",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z7wp6/fabulegs/",
        "text": "[removed]",
        "created_utc": 1519238582,
        "upvote_ratio": ""
    },
    {
        "title": "FabuLegs NOT so fab!",
        "author": "Dulceniaa",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z6uih/fabulegs_not_so_fab/",
        "text": "[removed]",
        "created_utc": 1519230818,
        "upvote_ratio": ""
    },
    {
        "title": "Got profiled, lol",
        "author": "dethmaul",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z6rmf/got_profiled_lol/",
        "text": "I've been to this store many times over ten years. Sure I've been randomly bag-searched at the exit, a few times. This time i was sought out lol.\n\nI have a mohawk, and usually it's a lazy sleepyhawk. It's a lot of work to style it up, and if i wear it all day i get a headache. So I don't ordinarily bother with it. So I was styled up fully erect one day, shopped, and went to leave. The bag checker saw me from fifty feet away, moved to intercept and hailed me while smiling triumphantly. He thought he busted a scummy punk rocking thief.\n\nThis was before i knew that you could refuse to be searched lol. I thought it was funny.",
        "created_utc": 1519230234,
        "upvote_ratio": ""
    },
    {
        "title": "Should've left her short!",
        "author": "sabbysabsabb",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z3cba/shouldve_left_her_short/",
        "text": "Long, mobile formatting, just a little rant. \n\nSo I went to this theater with my boyfriend, the kind where you have to pick your seats when you buy the tickets. Well my boyfriend and I have been living on a fixed budget, saving up for some things, and I usually take some cash out for what I can spend. \n\nWell, I only had about 5 bucks left and figured, ehh, I'll put the balance on the card because why not splurge on a movie date night. \n\nAn older woman, maybe in her 50s-60s, was working the register, and I tell her, \"can I do $5 cash and the rest on the card.\" So I watch what she does, because they have a screen on our side, and she put in the 5 cash, but then typed in the remaining balance as cash also. \n\nSo the tickets print and her register opens and she calls the manager. (refund the money and redo the transaction, simple right?)  the manager walks up, maybe 25 years old, and he is an ASS! \n\nShe explains what happened and asks if he can fix it so she's not short. And he goes, \"their tickets printed out, right? \" she tells him yes but she never swiped her card. He says, \"okay, well then just give them their tickets. \" and walks away. \n\nShe just huffed and obliged, and I apologized, I would've paid cash if I had more money on me. I felt so bad because I've worked in retail for over 10 years and it was such an easy fix, but the manager refused to fix it. She would either have to pay it or be short and get a write up. \n\nSo, here's the rant part. \n\nI get inside and tell my boyfriend, \"awe man, that guy was a dick. I wish I had more cash. Should we complain to him? Make a big deal?\". I've learned talking to a manager fixes almost everything in retail because they do whatever to avoid a corporate complaint, but my boyfriend hates confrontation, so he finally tells me he has cash. \n\nGeez. Couldn't have spoken up. \n\nAnyway, I get his money and walk back outside to give this cashier woman the money she would've been short. I knock on the window and tell her oh so politely, \"hey! My boyfriend found some cash and I didn't want you to be short.\" \n\nTHIS BITCH takes the money and just stares at me for a solid 10 seconds and says, \"OK.\" With the rudest, GTFO of my face look. \n\nUGHHHH! No wonder your manager was a dick to you cause you are just a flat out cunt. Excuse my language, but I'm a firm believer in karma and pay it forward and I tried to right this injustice that happened right in front of my eyes and she didn't even care or appreciate it. \n\nRant over. Just... Some people. ",
        "created_utc": 1519192704,
        "upvote_ratio": ""
    },
    {
        "title": "One or the other, not both!",
        "author": "Kfaircloth41",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z1j6k/one_or_the_other_not_both/",
        "text": "Sorry but it is kind of long!!\n\nOne night after work (12am or so) me an another supervisor decided to go to my favorite fast food joint. I fell in love with their original chicken sandwich years ago and I always order it. \n\nDrive thru is all thats open after a certain point so we pull up. She orders her food and I order mine separately. When they give us our food I pretty much forced her to pull up a bit but not leave so we could check our food. I mean 9 times out of 10 it's perfect but...mistakes can happen! I open my sandwich and I realize it's an old chicken patty on an old hard bun. Her food was perfect of course.\n\nI force her to go back through the line. When we got back to the window I was out of my seat belt, and across the drivers lap to talk to the cashier. (The driver was embarrassed and looking the other way, making it super obvious that this was ALL me.) I hand them my bag and tell the girl at the window, \"I'm willing to accept an old chicken patty on a fresh bun. I'm willing to accept a fresh chicken patty on an old bun. But will not accept old on hard and old. (I've worked ALOT of fast food so I've got pretty low food standards) I do not yell at the cashiers because they don't usually prepare the food. It's not their fault. \n\nThe supervisor was at the window in a flash. I'm asked what the problem was and I tell her the same thing. I'll take one or the other, but not both. We're pulled ahead and they bring me a fresh patty on a fresh bun. Yah! They also included a free large fry. I gave it to the driver for being a sport about the whole situation. She says she's NEVER going with me for food again. \n\nI'm not a huge complainer but whoever was working back line that night gave zero fucks and about that much effort.",
        "created_utc": 1519176272,
        "upvote_ratio": ""
    },
    {
        "title": "We can only give this Visa Card back has store merchendise credit...",
        "author": "Pokemoncrusher1",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7z0x8f/we_can_only_give_this_visa_card_back_has_store/",
        "text": "[removed]",
        "created_utc": 1519171275,
        "upvote_ratio": ""
    },
    {
        "title": "An attendant will be here to help you....",
        "author": "Jeheh",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yy5sj/an_attendant_will_be_here_to_help_you/",
        "text": "So I had to run down to the store and pick up a few things. Nothing odd, nothing on sale just run of the mill Milk, eggs and butter stuff.  \n\nI hit the self checkout as all 4 stations were open and after about 4 items I get the all to familiar bane of the self checkout.  “An attendant will be here to help you” \n\nShit. I look around and sure enough the attendant has gone on a hiatus and is no where to be seen.  \n\nSo I said “Screw it” gathered my items and went to another register and started over. \n\nSure enough about 4 items in and the same thing happens... “An attendant will be here to help you”. I look around and while the first register is still yapping about placing my item in the bag I’m now stuck at register 2.  Let’s try this again. \n\nOff to the 3rd register. I gather all my stuff and start over again.  Now I have 2 machines wanting me to put my stuff back and still no attendant. \n\n3 rd times the charm AMIRITE?   Nope.  Same thing and for then 3rd time in 5 minutes with still no attendant.  \n\nNow I have all 3 registers “please place your items back in the bag....” and I’m off to register 4.  \n\nFinally I get all my items to go through an d manage to pay with 3 separate registers screaming and no attendant in sight.  Fuck those things.  \n\n",
        "created_utc": 1519151168,
        "upvote_ratio": ""
    },
    {
        "title": "We accidentally stole a shitload of chick fil la",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ytd0q/we_accidentally_stole_a_shitload_of_chick_fil_la/",
        "text": "[deleted]",
        "created_utc": 1519102657,
        "upvote_ratio": ""
    },
    {
        "title": "Rude Waitress",
        "author": "UnalteredCyst",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ysqlr/rude_waitress/",
        "text": "[removed]",
        "created_utc": 1519096347,
        "upvote_ratio": ""
    },
    {
        "title": "Jackass at self checkout",
        "author": "_Atlamillia_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yp5hw/jackass_at_self_checkout/",
        "text": "Not an employee, another customer.\n\nAt the self checkout. There's 6 small lanes. 5 have people at them, and one has its red light on, and a big sign completely covering the screen, which obviously means it is broken.\n\nI am next in line, waiting at the aisle for one to open. Another guy stands behind me. An old man with one item walks up from the left, passes directly in front of me, and goes up to the obviously broken machine. \n\nI comment to the guy behind me \"Wow, he's not paying attention at all. Walked right past the line and right up to the broken one.\" and he laughs.\n\nThe old man walks back to us and comments \"There's a big sign that says it's broken\" and I go \"Yeah, and there's a line, too!\"\n\nAnd this jackass responds \"Well if you want to stand here go ahead but I thought it was open.\"\n\nAs in, he thought we were just standing there for no reason, and that it's something to be made fun of for *even when we had a reason*, **and** he thinks the appropriate reaction to seeing a line where someone hasn't moved up is to *cut in front of multiple people*, not tell them a lane is open.\n\nWhat an ass!",
        "created_utc": 1519067372,
        "upvote_ratio": ""
    },
    {
        "title": "Wine Whine and Table Torment",
        "author": "hazelnutcream",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yp11u/wine_whine_and_table_torment/",
        "text": "When my mom came to visit me to celebrate her birthday last fall, we decided to do a wine tasting/food pairing meal at a local winery together.  The place does timed platings, so you have to pre-book for a time, the number of people, and the seating area.  They had options for high-top tables or bench-seating.  We booked our seats a day or two beforehand and then we arrived a few minutes early the day of our booking because they charged you anyway if you missed your slot.\n\nWe arrived to the bustling winery.  It was a gorgeous afternoon, and as is common in the region, there are several wine tour buses in the lot.  We check in and are told we'll have to wait a bit.  No problem, we know we're there a little early.  We get to our reservation time and go back up to the front:  Sorry, the group at the tables haven't quite finished their meal.  We can seat you in the high-top area, or else you'll have to wait for the tour group at the tables to leave.  No, we'll wait.  You see, my mom is a whopping 4'8\" or so, in her 60s, and has had a knee replacement.  There's no way she's physically getting into those stools that are above her belly button.   The tables themselves were so tall that she could not have eaten off of them while standing up.  We specifically booked the bench-seating for a reason.  \n\nWe wait longer, and they check in with us to say that they hadn't forgotten about us, that it'll be soon.  Finally, about a half hour after our booking time, my passive little mom confronts them.  They refuse to ask the people to leave, even though their model is based around timely turnover of pre-booked 45-min slots, which they made very clear during the booking process. The wine tour group has long finished their meal and have begun to just tipsily jabber. The staff say there's nothing they can do and remind us that they had offered us an alternative.  No, I explain, it's an accessibility issue and we had no choice but to wait for a table my mom can sit at.  In the end, we waited forty minutes after our pre-booked time before getting seated.  \n\nI'm furious that I let them take advantage of us as they dragged us out with \"we're almost ready\"s and tried to blame us for being stubborn.  I should have demanded a refund and just left.  I'm furious that they made my very sweet mom upset and humiliated for her birthday.  ",
        "created_utc": 1519066454,
        "upvote_ratio": ""
    },
    {
        "title": "The kid tried to expose me",
        "author": "mustardseedyellow",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yoe7x/the_kid_tried_to_expose_me/",
        "text": "So I was going shopping for some new clothes and I go into this one store and pick up a bunch of shirts and jeans. I decide to try them on since their sizing is weird and so I go into the dressing room that is gender-neutral and doesn’t have doors, just curtains. It’s Sunday so a lot of moms have brought in their young ones and they’re running around, meanwhile I’m about to try on a shirt. Then one of the little kids starts tugging on the curtain and tries to yank it open, but I grab it before he can do anything, poke my head out and just glare at the little boy. His mother apologized profusely and I was as nice as I could be given that the kid tried to show my half naked self to the entire dressing room. I quickly changed back into my regular clothes and left.",
        "created_utc": 1519061860,
        "upvote_ratio": ""
    },
    {
        "title": "Dude, just let me buy my tampons without having to explain them...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ymdqe/dude_just_let_me_buy_my_tampons_without_having_to/",
        "text": "[deleted]",
        "created_utc": 1519044089,
        "upvote_ratio": ""
    },
    {
        "title": "Half-term hell at the drive-thru",
        "author": "EffityJeffity",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ylt75/halfterm_hell_at_the_drivethru/",
        "text": "Last week was half-term here in the UK, which co-incided with the release of a slightly bigger form of well-loved burger from a well-known chain. You know who I'm talking about.\n\nI was late getting up so didn't have a chance to make lunch, fancied this new \"Grand\" burger, so decided to go to the drive-thru at lunchtime.\n\nThe line was backed up and snaking through the car park, but I was hungry, so joined it anyway. It moved really fast, and I was able to order within 5 minutes.\n\nI ordered the burger, but with a salad instead of fries, and some chicken strips on the side, and an orange soda. Paid and had my food within 10 mins of arriving.\n\nMy receipt had a code on it to give feedback, which also gets you a burger and fries for £1.99, so I went online and said how good it was that even though the line looked long, I was served quickly and they got my fairly complicated order completely correct - as they always do.\n\nFast forward to this morning, I've run out of coffee for my machine at home, so decide to swing by and get a drive-thru coffee from the only place with a drive-thru near here.\n\nI guess my order and my car are fairly unique, so as I got to the window to pay, the cashier asked if I'd left a review of their service last week. I said I had. He asked me to wait a second while he got the manager. At this point, I'm wondering if they've got my review mixed up with a negative one.\n\nManager comes to the window and says \"thanks so much for your review. No-one ever leaves reviews when they're happy. Anything you want for breakfast is on us today.\"\n\nSo, that's how I got a free sausage and egg muffin.",
        "created_utc": 1519036714,
        "upvote_ratio": ""
    },
    {
        "title": "Where appointments don't matter!",
        "author": "buh-blam",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yiohk/where_appointments_dont_matter/",
        "text": "Yesterday my wife and I decided to get new phones and upgrade our wireless contract. There are two of our carrier stores in our city, one considerably closer to us than the other. We've had exceedingly good experiences at the further one when it was more convenient for us to go there but figured since we had a limited amount of time we should head to the closer one.\n\nTo try and avoid as much of a wait as possible we made an appointment online about 8 hours in advance for 3:30. We show up at 3:20 and tell the woman (CIL for check in lady) with the check in tablet that we made an appointment for 3:30. \n\nCIL: Oh you made an appointment? Yeah, we never check those but I'll put you on the list.\nMe: Alright, how long do you think the wait will be?\nCIL: Well your appointment isn't until 3:30 so at least ten minutes obviously. Phones are back there. (waves in the general direction)\n\nAt this point I'm like, okay, maybe they've just had a busy day, I get it. So we take our time looking at phones and we're pretty decided on what we want by about 3:35. We sit around and wait for a bit because it looks like everyone's still busy and we figure they'll get to us next. On one hand, it's kind of annoying because we made an appointment specifically to avoid all this waiting but on the other hand if something is taking longer than anticipated I can expect them to leave in the middle of it just to get to me on time. One of the employees finishes up and I think \"great, we're next\". Except we're not. He goes over to another couple who are sitting around. So I decide to head back over to CIL to see what's going on.\n\nMe: Do you know how much longer this will be? It's already 3:50 and we're on a little time crunch here.\nCIL: Well those other people got here first so when the next person opens up they'll get to you.\n\nTime out: they walked in right before us. As in, we were standing right behind them when they checked in. 98% sure they didn't make an appointment and I guess it just makes sense to me that if we made an appointment for 3:30 we should been seen as close to then as possible even if other people got to the store before us. Otherwise there's no point. Maybe CIL just forgot...\n\nMe: Oh, well our appointment was about 20 minutes ago and we showed up almost at the same time as them so I kinda thought we'd be next?\nCIL: No, they got here first so they go first.\nMe: But we had an appointment...?\nCIL: Yeah, but see, they're ahead of you on the check in list so they get seen first. It'll only be like 15 minutes until someone can get to you.\nMe: So it's just first come first serve?\nCIL: .. yeah.\nMe: So does it matter that we made an appointment?\nCIL: ...no.\nMe: Alright bye!\n\nWe ended up driving to the store across town. Got in right away, got our phones and cases and extra charges etc. and finished up in about 20 minutes.\n\nTL;DR: Made an appointment at closer store, employee doesn't understand what appointment means, go to store further away and get done in less time than we waited at the other place.",
        "created_utc": 1519000051,
        "upvote_ratio": ""
    },
    {
        "title": "Were you here first?",
        "author": "YourDrunkle",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yhwbh/were_you_here_first/",
        "text": "I was at the supermarket deli waiting. This supermarket seems to always be busy and understaffed so it takes a while. There is no line or number system. Just crowd around and they will get to who is next. I was next and an old man starts waiting at the counter as well. He asks me if I was there before him. I said that I was. He responds, “that’s ok, don’t worry about it,” which was weird. Then the guy at the counter asks me if I am being helped at which point the old man jumps in front of me and places his order. I let it go because I didn’t feel like arguing with a weird old man but fuck that guy. Why ask if you are going to cut me anyways?",
        "created_utc": 1518992669,
        "upvote_ratio": ""
    },
    {
        "title": "This DSW Customer [dis]Service experience was rather painful.",
        "author": "theverybiglebowski",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yhkqk/this_dsw_customer_disservice_experience_was/",
        "text": "[removed]",
        "created_utc": 1518989910,
        "upvote_ratio": ""
    },
    {
        "title": "She Made Me Cry",
        "author": "instantlo",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ygeem/she_made_me_cry/",
        "text": "Last night I celebrated my birthday with a few friends at one of our local Japanese restaurants. We ended up with my absolute favorite server, who, upon hearing it was my birthday, disappeared for about five minutes and then came back with a gift for me! It was a dog mug (I absolutely love dogs). I shed some happy tears and thanked her profusely.\n\nI’m still in awe of her generosity. ",
        "created_utc": 1518980564,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, yes I’m here too!",
        "author": "maddermaz",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yeao5/hello_yes_im_here_too/",
        "text": "Please excuse formatting, I’m on a mobile. \n\n\nThanks to lovely grandparents babysitting, my SO &amp; I managed to get our arses in gear and went out last night on our first date night this year. We went to a ramen place we’d not tried before. \n\n\nIt was fairly busy but we were seated and had ordered within 10 minutes. It was one of those places with long benches rather than individual tables, so there were other people seated by us a couple of seats away either side of us. \n\n\nThe lovely waitress brought our our drinks and starters. All great, then there must’ve been a shift change and a New Waitress came over and asked my SO if he wanted another drink, he ordered and before I could chime in, off she went. We just thought my glass wasn’t deemed empty enough to ask if I wanted another drink too. \n\nThe New Waitress brought out our mains together and popped them down.  We tucked in, delicious. Now my SO is a fast eater, doesn’t matter if it’s steaming hot, dude can wolf it down no problem! I’m the complete opposite. So, my SO has finished his bowl of ramen down to the last drop and we’re happily chatting away whilst I’m eating. New waitress comes up next to my SO\n \n“Oh you’ve finished, let me clear that for you, would you like to see the dessert menu?” She asks, completely ignoring me. \n\nWe look blankly at each other. \n“Er yeah, I guess, thanks” says SO. New waitress gets One, for him and goes off. \n\nWe have a confused conversation, along the lines of “I don’t think she realises we’re here together”. \nI’ve finally finished mine by the time New Waitress comes back, on my SO’s side of the bench, of course. \n\n“Would you like to order some dessert?” She asks my SO. \n\n“You first.” Days SO gesturing to me. \n“Oh” She says surprised, “Oh”. \n\nWe order, it comes, we eat, all good. SO asks for the bill.  New Waitress brings the bill...\n\n“Oh no, they’ve put your orders on the same bill”\n\n“That’s because we’re together” I say pulling out my card to pay. \n\n“Oh” She says. “So are you paying all together or...”\n\n“Yes, all of it on this card, thanks” I say. I pay and we walk out slightly bewildered. \n\nTasty ramen though, so it’s all good.  ",
        "created_utc": 1518961433,
        "upvote_ratio": ""
    },
    {
        "title": "No water for me",
        "author": "cookieeatingfart",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7yacoc/no_water_for_me/",
        "text": "So I was just out with my friends, and they decided that they wanted to stop somewhere to eat. I tell them that I have no preference with where we go because I don't have the money for dinner (saving to move out is costly). They decide that we should go to a diner.\n\nWe sit down and the waitress immediately asks what we want to drink. I get a water and the rest of my friends order sodas. Waitress comes back to take our orders, and I tell her that \n\nI won't be ordering anything. Food comes, and I'm having a nice time with my friends. Waitress asks if we want refills, and I am the first to say yes. She asks my friends what they're drinking. When she comes back, she doesn't bring me a refill. She brought refills two more times while we were drinking.\n\nI understand that I shouldn't have expected Top Notch service because I didn't order anything, but the fact that she completely ignored me kind of ruined my night. Money has been tight for me recently, and it would have been really nice if she had catered to the one thing on the menu that I could actually afford.\n\nEDIT: I did wind up helping my group with the tip using the money I did have, so I feel like entitles me a minimum level of service.",
        "created_utc": 1518909981,
        "upvote_ratio": ""
    },
    {
        "title": "Scanning my card upside down and taking an item off the menu",
        "author": "ThrowawayM0rty",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y9xs6/scanning_my_card_upside_down_and_taking_an_item/",
        "text": "I’m a university student and for our meal plan were given a card that we can use at any restaurant on campus to spend on one of three accounts: flex (generally book store, laundry money) meal plan, and meal plan taxable.  Since the meal plans generally only cover 2 meals a day usually your account gets pretty thin around this time of year, myself included and people resort to getting the last of their other two accounts. \n\nSo today I was feeling like a Thai food day as I usually do at least once a week, except for the last month where I was trying to eat healthier lol. When I get there there is a new employee on cash that I’ve never seen before but I don’t think anything of it as she seems to speak perfect English. I go up and ask if I could have a “basil stir fry.” And she says “sure, what flavour?” I’m a little confused, perhaps she didn’t hear me say basil so I repeated it and then asked me again what flavour I would like. This point I’m very confused and look up and down at the two different signs showing what flavours are available for stir fry and the first option in both listings clearly say Basil as I’ve ordered it a dozen times. She says “okay we have that yes, but what flavour would you like” and she lists every flavour up their except basil. I’m just a bit confused at this point and just pick one of the other options. I thought that maybe they were out of basil or something and just wanted to move on. \n\nThings were going well until she asked me how I wanted to pay to which I responded “flex” since my meal plan was empty and gave her my card. I watched her scan the card through and then hand it back saying there was no money. I asked if that was flex and she nodded, I said it was weird and asked to put it on taxable. She then proceeds to scan the card upside down twice (after attempting to use tap which I told her doesn’t work) and when I mentioned she had to scan it the other way as politely as possible trying to not embarrass her, she could she rudely says back “no there’s not enough money.”\n\nNow I’m a poor uni student but I know there’s way more than enough in my flex and taxable to buy one to go stir fry and I used the card earlier that day without any issues. Logging on afterward showed me that I had more than enough on both accounts. \n\nAt this point I was holding up the line and she was simultaneously took the other couples behind me order so I just said to put it on debit where she forgets to send the payment to on three different tries.\n\nAs a person who works in retail myself currently and previously the food industry I try to be as polite and understanding as possible with employees and as understanding of an employee myself and I hate it when I see other people working who show no care for customers. ",
        "created_utc": 1518906046,
        "upvote_ratio": ""
    },
    {
        "title": "I need that one... right... THERE.",
        "author": "AZtwoNE",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y93y7/i_need_that_one_right_there/",
        "text": "Yesterday morning I went to buy one yellow rose for my mother because we had to put our dog to sleep. Hank was only 11 years old with kidney failure. This happened suddenly, so our house is very quiet right now.\n\nI get to a flower store and I'm standing at the front counter. There's two ladies making bouquets behind the register and they ask if I can wait a few moments. \"No problem, take your time. I'm in no hurry\".\n\n(I'll switch to a script-type layout. I'm \"D\" and the stupid flower lady is \"SFL\")\n\nSFL: What can I help you with?\n\nD: That looks beautiful! Can I take that one please?\n\n(I'm maybe 5 feet away from the flower cooler while pointing directly to the only yellow vase with the only yellow flower. Ray Charles would've seen it)\n\nSFL: I don't know which one you're pointing at.\n\nD: The bright yellow one sitting next to the red one.\n\nSFL: I don't know which one you're pointing at. \n\nThis is when I lean over the counter as much as I could to closer point out the ONLY yellow vase with the ONLY yellow flower in the cooler. I'm still pointing while she looks back and fourth trying to see what I'm pointing at. This gets very annoying pretty fast. My dog took his last breath on my lap thirty minutes ago so I left my emotions at the door. But this idiot flower lady instantly boiled my blood when she says \"Sir, I have no idea what your pointing at\"\n\n(Talking through a clenched jaw)\nD: That one. It's the only yellow flower in that cooler *right there* \n\nI look at her while I'm still pointing and she has this flabbergasted look on her face. It was like I just asked her the square root of something. I wait a few seconds for her tiny-overworked-mind to reboot and get me the yellow flower in the yellow vase. \n\nSFL: (Motionless and speechless)\n\nD: I'll just go somewhere else. \n\nI was very patient but this went on longer than it should've. How did this moron find the doorknob to leave her house? How can *anyone* miss the color yellow? Isn't yellow the most visible color on the spectrum, or is it green? OMG! Afterwards, I got the idea it was her way of telling customers she's done making your damn flowers.",
        "created_utc": 1518898569,
        "upvote_ratio": ""
    },
    {
        "title": "Got a large coffee for being a decent human being",
        "author": "KhloeKodaKitty",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y7e7i/got_a_large_coffee_for_being_a_decent_human_being/",
        "text": "I just went to the Queen’s husband’s burger place for breakfast.  Used the drive through and was greeted with, “I’ll be with you in a moment.”  No prob.  Gave my order a few moments later and pulled around.  The car in front of me was getting their order so I waited maybe a minute until I got to the window.  I paid, and after the cashier gave me my change she said, “And sorry about the wait!”  I just said, “No worries” because honestly, I didn’t feel there was a wait at all.  She gives me my coffee and says, “I’m giving you a large instead for your patience.”  I told her thank you and to have a great day.  \n\n\nWhat makes me sad is that I earned a coffee upgrade simply for NOT complaining?  I mean, I’m very grateful of course but do THAT many people really bitch and moan about being made to wait a few minutes in the drive through??   And does it happen that often that when someone doesn’t they can earn a free item?  Really?  ",
        "created_utc": 1518882876,
        "upvote_ratio": ""
    },
    {
        "title": "Bookshop owners isn't Amazon",
        "author": "shrekine",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y644y/bookshop_owners_isnt_amazon/",
        "text": "[removed]",
        "created_utc": 1518866100,
        "upvote_ratio": ""
    },
    {
        "title": "Potato Chip Munching Syndrome",
        "author": "Ajreil",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y5e1z/potato_chip_munching_syndrome/",
        "text": "During the Great Recession my mom found herself struggling for work, and eventually landed a job in the night shift. She was a cashier at a slightly nicer supermarket chain.\n\nShe had a regular customer. He came in at 3 AM every morning, five days a week. We'll call him Rick.\n\nRick was a nice guy, and always greeted every one with a nice smile. One of those people who just loves other humans.\n\nEvery morning at 3 AM on the dot, he would buy a bag of chips. Not just a small one either, but a family sized bag of potato chips. Every night.\n\nOne night, my mom decided to ask Rick about his habit. He explained that he had to drive from the Twin Cities to his work, which is an hour away.\n\nTo keep himself from falling asleep, he had to buy something to munch on. Since the gas station was always closed, he came here.\n\nThe next night he came in at 3 AM as always, and my mom decided to try to change his habit.\n\nWhen he went to purchase his giant bag of chips, my mom took it from him and gave him a bag of carrots instead. The exchange went something like this:\n\n&gt;Rick: Maaaan, you took my chips!\n\n&gt;Mom: Take the carrots.\n\n&gt;Rick: I can't believe you took my chips!\n\nI should mention that he was black, and he has an enthusiastic accent to match. He wasn't angry, but he was a little stunned.\n\n&gt;Mom: Take the carrots, your wife will thank me.\n\n&gt;Rick: Alright, fine. I'll take the freaking carrots.\n\nSo he left with a fairly large bag of carrots. When he came in the next day, he got carrots as well. Pretty soon he was buying apples, orange juice, celery, and other healthy food.\n\nAbout two weeks later, Rick came up to my mom. In a quiet and begruding tone, he said this: \n\n&gt;Rick: My wife said to thank you.",
        "created_utc": 1518853818,
        "upvote_ratio": ""
    },
    {
        "title": "\"Even if it's expired.\"",
        "author": "DietCodeRed",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y4et9/even_if_its_expired/",
        "text": "[removed]",
        "created_utc": 1518840054,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery - when you’re customer at home",
        "author": "lavasca",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y458x/delivery_when_youre_customer_at_home/",
        "text": "[removed]",
        "created_utc": 1518836840,
        "upvote_ratio": ""
    },
    {
        "title": "I almost became the rude customer",
        "author": "i-like-yogurt",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y3fsy/i_almost_became_the_rude_customer/",
        "text": "I was on my way home from school and decided to stop by the local clown owned fast food chain since I pass by it on my way home. I just got out of school and I was really hungry and tired so I thought this *fast* food chain would live up to its name. I was wrong.\n \n \nI walk up behind a other customer since she was almost finished with her order. When I was up next on the counter the cashier does not even greet me or anything which I'm fine with but she also does not take my order. She was just doing something with the cashier and one of the managers maybe recounting the money or something so I wait. If that cash register was closed she could have told me or something but she just ignored me. I did not want to go to another line since the other lines already had a few customers. I just waited until she finished whatever she was doing. Then she stares at me with that look saying \"well? Are you gonna order something\" I'm hungry so I just order whatever. Cashier tells me I have to wait a few minutes for my order. I start getting pissed but I'm hungry and I just want some food so I wait, and wait, and wait\n \n \nI even chose a table closer to the counter so they can easily see me when my order eventually comes out but I just kept waiting and kept getting angrier and angrier. I just kept staring at the employees working at the counter with a really angry look. It has almost been 30 mins and I still don't have my food. I just really wanted to freak out and yell at all the workers behind the counter because I was just so hungry and just wanted something to eat. The only things stopping me were feeling bad for the workers if I yelled or freaked out in public and I would probably be really embarrassed if I did. Another reason for not freaking out was that I was still wearing my school uniform so that could get me in trouble with my school. I just tried my hardest to keep waiting. It probably wasn't that long but to a hungry person, 30 mins could be an eternity.\n \n \nWhile wainting, this nice lady working for the fast food chain approached me and asked me if I could answer a few of her questions. I was still waiting for food so what the heck and said sure. Turns out it was some sort of survey they were doing and asked me a bunch of stuff about the service there. Questions like how often do I eat at that branch and if I had been greeted by an employee when I arrived (of course I said no) during the Q&amp;A the nice lady was just shaking her head in disappointment about all my negative comments and answers. At the end of the survey they asked for my email so they could send me a coupon for a free ice cream cone. I just had to show the email from my phone. This was just some sort of reward for taking the survey not really like compensation for the long wait but whatever, its free.\n \n \nAfter the survey, I continued giving death stares to the other workers and they start to notice me and look at me and then look at me and then look at their registers. The nice lady probably notified them of my complains. A few minutes later one of the workers comes over and delivers me my order. I start thinking of things I want to say and complain to a manager. I even tried to remember the name of the girl who delivered my order in case I had to complain to the manager. I was just almost ready to be one of those people in publicfreakouts. The moment that girl gave me my order, she was immediately apologetic and also really nice saying sorry for the really long wait and apparently they had forgotten my order so they were confused why some weird guy was giving them death stares. She was so apologetic that she even added additional fries for free. I was actually speechless and just took my order and left. I guess I just didn't want to be mean to that girl after she wasn't really that rude and even gave me free fries after waiting for so long. Hopefully my survey helped to improve a few things around there.\n \n \n**TL;DR:** waited too long in a *fast* food place and got given free fries and an ice cream cone.   ",
        "created_utc": 1518829237,
        "upvote_ratio": ""
    },
    {
        "title": "Honest discussion on tipping",
        "author": "redditnameforme",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y38gn/honest_discussion_on_tipping/",
        "text": "I want to talk about the tip % and give my 2 cents on why i think its wrong. \n\nLets say i go to breakfast,  eat a 10$ meal, get a few refills on my coffee. When the check comes if i was to follow the basic rule i might tip 2 dollars.  Doesn't seem right to me, Espessialy since its basically to compensate for the fact they are paid bellow min wage. So i will tip 5 dollars most of the time.  Unless service was bad.  \n\nOn the other end i go to i high end place,  end up with an 80 dollar bill, to follow the basic rule you would tip 15 to 20 dollars. The basic rule seems very flawed.  The people at the higher end places arent working harder than the ones at the average breakfast spot. And by and large they need the money less,  a lot of those places either pay a livable wage,  and or auto add thehear tip onto the bill.\n\nI would like to hear others thoughts on this. ",
        "created_utc": 1518827202,
        "upvote_ratio": ""
    },
    {
        "title": "I don't serve no homeless",
        "author": "Ivy_oboe",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y2zy3/i_dont_serve_no_homeless/",
        "text": "Excuse my formating ny auntie is telling me this story rn and I'm typing to keep up\nA: Aunt\n U: Uncle \nC:Cashier at food place\n\nMy aunt and uncle went to eat at a fish place for V-Day because it was Ash wednesday as well and why not?\n\nAnyway they get there and see a little old lady outside. \nA: Excuse me ma'am are you hungry? Are you thirsty?\nL: Well yes...\nA: Wait here i want to buy you a plate\n*Aunt and Uncle walk into fish place*\nA to C: Can i have a number one?\nC: Of course\nA: Can you double bag it and give it to the lady there? *A points at L*\nC: *scowls* No. I refuse to serve the homeless. \nA: Excuse me? *completely shocked*\nC: I don't serve no homeless!\nMy aunt is latina, big and has a loud mouth. So when she gets pissed... Yeah...\nU: aw shit here we go..\nA: WTF YOU MEAN YOU WONT SERVE HER\nC: I don't serve no homeless\nA: Bitch im paying for this damn food not your bitch ass. \nC: not anymore *proceeds to refund the transaction* Here's your money. I dont serve no homeless. \n\nAfter some back and forth and cussing a lady appears from nowhere i think it was a manager (m)  \n\nM: Whats the problem?\nA: This bitch won't serve the homeless lady. I'm paying for her meal and she REFUSES to serve her. \n\nManger clearly gets extremely upset. Especially after seeing her cashier arguing with a customer. \n\nM to C: What the fuck is the matter with you bitch? Wtf you mean you won't serve her? Nah fuck that ma'am we are not gonna sell her food we are going to GIVE HER the food. Matter of fact *turns to C* your bitch ass is going to fucking serve her yourself. \nMy aunt then goes outside and fetches the homeless lady. \n\nA to L: Come on ma'am they are gonna give you anything you want. \nA to m: Anything she wants right?\nM: Yes ma'am of course! I am so sorry!\nThe homeless lady was so grateful and kept thanking my Aunt for doing this for her. \n",
        "created_utc": 1518824961,
        "upvote_ratio": ""
    },
    {
        "title": "I stayed in a beautiful hotel that had a portal to alarm clock hell.",
        "author": "AbesAmericanCousin",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y1mx6/i_stayed_in_a_beautiful_hotel_that_had_a_portal/",
        "text": "LTL, FTP, etc. TL;DR at the end. \n\nAlmost a year ago, my mom and I went on a short road trip before dropping me off at my summer camp job. We passed through a few cute small towns, saw some historical sites, did some antique shopping, the works. We decided to stay two days in a cute small town with a really old and charming hotel.\n\nWe had made reservations in advance so we walked in and made some small talk with the desk attendant ( DA) while checking in. He was super friendly, showed us our room, and was overall really helpful. \n\nThe room was fine, but my mom was a bit bummed that it had a view of a brick wall instead of the beautiful park at the front of the hotel. Now I absolutely hate asking people for favors and such, but my mom thinks that it doesn’t hurt to ask. \n\nThus, she asked DA if there was an open room with a better view we could move to while I stood in the background trying to disappear into the wall. (She offered to pay the price of the room we moved to, there wasn’t any normal reason for me to be embarrassed.) \n\nHe was super understanding, and upgraded us to a nice room with a small front sitting area. They normally didn’t rent it the night we were there because the bar was right below the room and it was Karaoke night until 11:30. Both mom and I had no problem with this since we were going to be out late both days we were in town.  \n\nWe drove around to some more historical sites and old houses, and watched a movie until the bar closed. An important thing to note is that there was a full power strip and a mystery plug both plugged into the wall, so we unplugged the power strip for a phone charger. (The plug ran into the mattress spring and seemed important.)\n\nThis is the beginning of Alarm Clock Hell. \n\nWe woke up at three in the morning to the sound of an alarm clock going off. The sound was hard to place, but it sounded like the clock next to us, even though I had checked that it was off the night before, and it was unplugged. It was one with the beeps that got progressively faster, so in my sleep-dazed mind, it seemed like trying to stop a bomb timer from reaching zero. We hit every button we could find, and eventually the alarm stopped on its own. The whole thing was weird, but whatever, maybe the clock was running on batteries and the number display was dimmed. Then, maybe 15 minutes later, another alarm went off, muffled like it came from behind the wall. Maybe the room behind the wall was empty, and the last person to stay there had to get up at three or something. We were confused but rolled over to get more sleep. \n\nThe next day we did more sightseeing, and returned to the hotel, mentally preparing ourselves to wake up at the unholy hour of 6:30 to get me to my job on time. (Hey, we were on vacation- any time before 8 or 9 is too early.) Note that we plugged the power strip back in so our lamps would turn on, and had found a better place for our phones to charge. We went to bed, unwittingly setting ourselves up for...\n\nAlarm clock hell 2: the bad and unwanted sequel.\n\nOnce again, we woke up at 3 am to the sound of an alarm clock. We are done at this point, and can see that it isn’t the one by our bed. I do some searching around, and remember the mystery plug leading into the mattress box? It led to a second alarm clock, hidden under the bed and beeping away at top volume. Now both of us are pissed now, since it’s obvious this was planted on purpose. Then, we hear a new alarm, coming from behind the bedside table. It was plugged into the power strip and also clearly a plant. While I dug that one out, my mom found another one, and the muted alarm started again. That one was not in another room, it was in the bookcase in the front sitting area. \n\nBy 3:30 we had a small pile of alarm clocks, and we turned them in to the night desk attendant with a “done with this B.S.” expression and many apologies on both sides. \n\nThe next morning we dragged ourselves out of bed and checked out, and DA was nice enough to comp us for both nights after hearing that it had been a problem both nights. 10/10 hotel, 0/10 alarm clocks. \n\nTL;DR: I stay two nights in a hotel room booby-trapped with alarm clocks. ",
        "created_utc": 1518812705,
        "upvote_ratio": ""
    },
    {
        "title": "Restaurants",
        "author": "gerardo52285",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7y0b9x/restaurants/",
        "text": "I was told to check out this new restaurant close to where I worked. The food was said to be awesome and out of curiosity I stopped by for lunch. I was seated and kept getting passed around by the waiters at least 4 different ones came to my table confusing me as to who was helping me. It was a little more expensive than I thought it would be so I went for the burger not wanting to spend too much on lunch.The burger came out after about 20 mins pretty much burnt ordered it medium. I told the waiter and he said he could get it remade but it would take another 20 mins. I asked if there was anyway to get it made a little quicker trying to get back to work. He said they would try. It came back out after 15 mins not burnt but pretty well done. I informed them again but I couldnt really have it remained not enough time so I ate it. They came back around to fill my water and instead of picking the glass up to fill it the waiter decided to fill it flat on the table spilling water all over the table, my smartphone and my lap. I looked up at him and he didnt seem fazed as if nothing wrong had happened. I asked for the manager and explained the situation he comped the meal and apologized but I dont think I'll be going back there.",
        "created_utc": 1518802003,
        "upvote_ratio": ""
    },
    {
        "title": "Tips don't make food taste better",
        "author": "PolyNElectro_CAPS",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xzxp4/tips_dont_make_food_taste_better/",
        "text": "Before I start I'd like to mention that I always tip waiters/waitresses if the service itself was at least decent. Usually I tip between 20-25% for excellent service, 18% for good service, and 15% for OK service. I can only recall a few times where I chose not to tip, and this is one of them.\n\nIt was the end of the year, and me and my colleagues just finished a massive animation project, so we decided to go to a local microbrewery resto. I'd been there a couple of times and in my past experience the food, beer, and service were excellent. We get there, and immediately this grumposaurus of a woman just barks at us to find our seats ourselves. Whatever, just an off-day I guess.\n\nWe take our seats, open our menus. Two of my friends ask me for suggestions. As I'm about to state them, the woman from earlier comes to take our orders, glares at us, and says: \"Well, everything here will make you fat anyway but you do know that tipping generously will make the food taste better, right?\" She said all this with one wickedly creepy smile. \n\nWe didn't even hesitate to put the menus back down, get up, and start heading towards the door, all while dino mom was staring at us with a mix of shock and dread. The manager saw everything and gave us vouchers for a free round of beers if we were to come back again (even though we hadn't ordered anything). We went back a week later, and had MUCH better service. Pretty sure that girl was fired, because I still go there to this day and I haven't seen her since.\n",
        "created_utc": 1518799026,
        "upvote_ratio": ""
    },
    {
        "title": "\"Don't worry, I'll page someone cooler for you...\"",
        "author": "fadcat",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xy6xm/dont_worry_ill_page_someone_cooler_for_you/",
        "text": "Hey readers, I want to share this funny story with you about a customer service experience.\n\nAs a preface, I want to mention that the rules in my country regarding retail seem to be a lot more strict than in the US (judging by what I read on Reddit). Just some examples: returning items is only acceptable if the item is in pristine condition and still has the tag/original package, within a 30 day period, and even then you would get store credit only. An exception is made in case something is noticably off (product is faulty/broken in the package): then they either give you a replacement (or an alternative in case it isn't in stock anymore), or they refund you. When the product was OK when you bought it, repairs or replacements are only free when it's under warranty. And if they can't repair it because of something you did to it....then tough luck, they'll dispose off the product for you or you would have to *pay* to get your damaged product back (not joking, this recently happened to me). So as far as I know, it's very *exceptionally* that a store would deviate from their rules and actually give their customer special treatment, which made the following experience even more special for me.\n\nMy partner and I like to go to this low-cost supermarket, which occassionally features special non-food items that are limited in stock. Sometimes people line up first thing in the morning to make sure they can buy it, since the cost is usually a lot lower as opposed to specialised stores.\n\nOne day we venture out to buy an inflatable kayak that we saw was on promo that day - but since it was a very popular sale, the stock was already depleted once we got there. We ask someone at the store for help - no problem, we could still get it on order and we are handed a proof of order so that we can pick it up and pay for it when it arrives. \n\nA few weeks pass, and we get an automated text that our order had arrived. So we head to the store, directly to a cashier, and ask her about our order. She's never done this procedure before so doesn't know exactly what to do, but she pages her manager for us. The manager shows up and asks us if we brought the proof that we were the ones that ordered it. Oh shit! Well we have no idea where we left that paper and figured that since we got texted on our phone, that this would be all the proof we'd need. Manager stands firm and refuses to sell to us, we have to return with the paper and otherwise it would simply be put out front...\n\n(Don't ask me what the logic behind that was, I have no clue either.)\n\nBut anyway, the manager leaves back to \"the back\" or whatever it is where store managers go, and we kinda stood there looking dumbfounded and disappointed. The cashier patiently waits for her manager to disappear from sight, and then she utters the magnificent sentence:\n\n\"Don't worry, I'll page someone cooler for you...\"\n\n...As she presses a buzzer at her register. \n\nFew seconds later a young girl shows up, the cashier explain that we are there to pick up our kayak. \"Sure thing!\" mystery girl says, and off she goes to what I presume is the storage area. She swiftly returns with our order, and holds it for the cashier to scan the barcode so that we can pay for it. We happily return home with our kayak - where it remains in its original box, unused (lol).",
        "created_utc": 1518781394,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Not Sure Where It Went Wrong...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xv512/im_not_sure_where_it_went_wrong/",
        "text": "[deleted]",
        "created_utc": 1518742860,
        "upvote_ratio": ""
    },
    {
        "title": "Time for another tale of my wife being awesome...",
        "author": "xProperlyBakedx",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xsrf3/time_for_another_tale_of_my_wife_being_awesome/",
        "text": "Some of you may remember my other story about when my wife went to buy deodorant and ended up banned from a dollar store for clearing an entire shelf onto the floor. Well this story takes place in a now closed Chinese buffet here in our hometown.\n\nBefore I get to the tale itself I want to emphasize that at no point did blame or shame the gentleman in line in front of me. So please try not to latch onto the wrong part of the story.\n\nThis story begins at a *very classy* buffet we decided to try. They offered all the usual Chinese buffet crap as well as a decent seafood bar. So, we go in and are seated given drinks and both head up to the buffet. We both look around and fill our plates. Come back and enjoy what is actually pretty damn good buffet food. My wife finishes first, as she doesn't load her plate like a Viking trying to pillage a town. And heads up to grab some crab legs from the seafood bar.\n\nI finish shortly after she returns and head up for a 2nd round. This is where the story really begins....\n\nDirectly in front of me in line is a very obvious mentally handicapped person. Non-issue for me, why would it be, right? Well he is also unattended, as his caretaker is apparently busy eating. So I am behind this man in line who clearly has a head cold, as indicated by his snot nose and constant coughing. Well he also clearly isn't sure what he likes and what he dislikes because he keeps reaching in with his fingers and \"sampling the food\". If something is particularly good to him he'll take 2 fingers full before scooping onto his plate. \n\nLike I said earlier, this isn't his fault, he is clearly very handicapped and doesn't understand what he is doing and why it's inappropriate. With that said, I'm not eating snot covered food just to be polite to the handicapped guy. So, I put my plate down and head straight to my wife. I tell her what has just happened, she sees the guy still up there doing it. She is as horrified as I am and stands up leaving her half finished crab on the table. We head towards the cash register to let the owner/manager know what's happened.\n\nThe owner couldn't care less, and when we indicated we wouldn't be paying for our dinners as we only had a single plate and a half, she loses it. She starts screaming in a very thick Chinese accent *If you eat anything You Pay! You Pay or it is stealing and I will call Police*. My wife tried to calm her down and get her to see reason, but she refused. So my wife told her she needs to deal with this situation or she will.\n\nThe owner again just simply says *You pay, or I call the cops.* \n\nOk.... you asked for it.\n\nMy wife says one more time that she should really consider giving us at least a discounted rate before things get worse for the buffet. Owner again refuses and starts to pick up the phone.\n\nMy wife then turns to the nearly full dining room and Shouts as loud as she can. *EXCUSE ME, CAN I HAVE EVERYONE'S ATTENTION PLEASE. THERE IS SOMETHING YOU NEED TO KNOW!*\n\nThe owner's face goes from anger to panic. She immediately starts begging my wife not to say anything. She offers half off our meals. My wife ignores her and continues...\n\n*THERE HAS BEEN AN UNFORESEEN CONTAMINATION OF THE FOOD ON THE BUFFET, THAT THE OWNER IS REFUSING TO ADDRESS! I HIGHLY RECOMMEND YOU STOP EATING NOW, AND DEMAND THE FOOD BE CHANGED OUT OR REFUSE TO EAT ANY MORE!*\n\nThe owner is now losing her mind, as customers start to come up asking what then problem is. At this point the owner turns to my wife and say *Fine! No charge. Now get the hell out of my restaurant.*\n\nI'm not really sure what happened after that, as we left right away. But I do know that place was closed down a few months later for serious health code violations.\n\nNow, had the owner shown any contrition or attempted to fix the problem, this would've never happened, but as I've said in previous stories about my wife. She is a sweet woman, but don't fuck with her. It rarely ends how you want it to....",
        "created_utc": 1518722325,
        "upvote_ratio": ""
    },
    {
        "title": "Customer service rep tried to fuck me over",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xs35n/customer_service_rep_tried_to_fuck_me_over/",
        "text": "I bought some shoes at a store and tried them on there, when I got home they made my feet really uncomfortable. So I went back the next day to exchange them for a smaller size, (shoes were a size too big). Mind you I misplaced my receipt but the store has an exchange policy that you can do it without one.\n\nI get the shoes and head to customer service, and the guy there CLEARLY. Didn’t know how to do his job, he was telling me that I couldn’t do it without a receipt when it literally says you can on a sign behind him! I didn’t argue with the guy and went to the food court to figure some things out seeing as I took a bus to get here. \n\nI did some research and found out you can get a purchased checked at The store by a customer service manager. So that’s what I did and everything checked out, I bought the shoes from there AND I had proof I did. So I took my happy ass BACK to customer service and did the exchange with a different rep.\n\nNo issues what no ever, and the whole time I stared at the other guy who didn’t wanna do his job. And I kept smiling at him while flashing the receipt HIS manager printed for me. He kept looking at me like I was the problem. I kindly gave that piece of shit the finger and reported it to his manager for trying to not help me. \n\nI know the manager didn’t do shit to him but it still felt good to know I wasn’t in the wrong, good help is hard to find these days!",
        "created_utc": 1518716920,
        "upvote_ratio": ""
    },
    {
        "title": "Walmart customer service rep tried to fuck me over.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xrw7h/walmart_customer_service_rep_tried_to_fuck_me_over/",
        "text": "[deleted]",
        "created_utc": 1518715386,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Now a Customer For Life!",
        "author": "_Pebcak_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xrrpd/im_now_a_customer_for_life/",
        "text": "Last night after work, I, like many others was doing some last-minute Valentine's Day shopping.  My husband and I decided to keep this year low-key b/c we have a bigger date planned later this month.\n\nLet me preface this by saying I've been feeling pretty crappy about myself lately for a bunch of reasons.  I've been feeling kinda meh, haven't been sleeping well, etc.\n\nSo after I buy my husband the card, I go to the liquor store to buy his favourite beer.  I'm standing in line with a bunch of nicely dressed older guys buying wine (I'm thinking how adorable this is!!) waiting my turn.  Eventually it's my turn.  I'm P for Pebcak, cashier will be C.\n\nC:  Hi, miss, can I please see some ID?\n\nP:  *Actually blushes and giggles, wtf is wrong with me*  Oh sure!  Wow, you made my day.  You aren't going to believe my age when you see it!  *Hands over license.*\n\nC:  Well, you know, I wasn't sure, I thought 'she looked close...'  *Takes ID, sees my birthday.  Realizes I'm almost 35.  Eyes go wide.  Laughs.*  Well, thank you very much.\n\nWe complete our transaction, and I thank Cashier for making my night.  I know it's cheesy but it was just what I needed right then.  So thank you, Cashier, and thank you, universe, for putting me there at that time :3  I'm going to by all of my beverages from there from now on  &lt;3",
        "created_utc": 1518714410,
        "upvote_ratio": ""
    },
    {
        "title": "Shout out to local baristas",
        "author": "irradiatedcutie",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xr19j/shout_out_to_local_baristas/",
        "text": "My university made some renovations and built a coffee shop known for their green mermaid in one of the buildings. I spend a lot of my free time in there doing a whole lot of nothing. It’s a beautiful space with lovely food and drinks and FANTASTIC employees.\n\nWhile I attend a small school (around 5,000 students I think) obviously there’s dozens of people coming through every day. The baristas are always insanely cheery, remember my name and order and for the most part have it ready before I even place my order. \n\nI have to give it to the manager who I’ll call Natasha. She’s the sweetest being on Earth and she makes my day. She’s given me free drinks and food more than I can count. One time I had my debit card info stolen and for two weeks she asked me daily what the situation was and if I needed anything. \n\nThese baristas work their asses off 7 days a week and do it all with fantastic customer service and I could not ask for better. I know we read a lot of horror stories about baristas being gigantic assholes but every day I thank the old gods and the new for these lovely employees I have the pleasure of interacting with. ",
        "created_utc": 1518708177,
        "upvote_ratio": ""
    },
    {
        "title": "I’m a senior; in high school",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xnkdf/im_a_senior_in_high_school/",
        "text": "[deleted]",
        "created_utc": 1518663495,
        "upvote_ratio": ""
    },
    {
        "title": "Once this plane hits 88 miles an hour it will engage the Flux Capacitor",
        "author": "Cratonis",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xmat9/once_this_plane_hits_88_miles_an_hour_it_will/",
        "text": "Going to make this as brief as possible as I am a first time poster. TL:DR at the end. Occurred a little while back while flying with a US airline heading to Asia. \n\nFlying from the east coast to Asia had a brief layover on the west coast before catching a connecting flight to a country across the Pacific Ocean. As is common delays, runway traffic and general crappiness cause me to miss the connecting flight. This is a whole other story of Dickery by the airline but not important to this story. \n\nHead to the customer service desk to have them get me on the next flight to get the trip back on track. As I am one of many passengers who missed their connecting flight it takes about an hour but finally I get up to the desk. The following exchange takes place. I will be Weary Traveler WT, the employee will be Customer Service Agent CSA. \n\nCSA: How can I help?\n\nWT: I need a new flight to continue my trip.\n\nCSA: Okay let me see your tickets.\n\n(Hands tickets and boarding pass over)\n\nCSA: Okay the next flight out leaves tomorrow at the same time. \n\n(This would be fine but I had another connecting flight after this one. Which I would miss by leaving a day later)\n\nWT: Okay what about my next connecting flight?\n\nCSA: Well the flight tomorrow leaves at 10:00 pm and arrives at 1:00 pm. Your connecting flight is at 4:00 pm so there is plenty of time.\n\nWT: But my connecting flight is at 4:00 PM the following day, and the flight leaves at 10:00 pm tomorrow, and is a 17 hour flight, how could I possibly make it?\n\nCSA: Well if you leave at 10:00 pm and fly for 17 hours you will land at 3:00 pm? Wait but it says the flight lands at 1:00 PM? Let me check on this.\n\nHe started typing away and that is when I realized he hadn’t accounted for the international date line. The flight in reality lasted all day as the time difference was almost the same as the flight time, meaning we lost a whole day during the flight. (I am fudging some math here as I forget the exact calculation and times involved) It was late at night so I figured maybe it just slipped his mind.\n\nWT: With the time change we will be a day ahead so we will need a connecting flight leaving the day we arrive.\n\nCSA: What do you mean?\n\nWT: The international date line, we will jump ahead over 12 hours so we need a flight on the day we arrive not our current flight which is the day before.\n\nCSA: But it says here it is landing at 1:00 pm tomorrow?\n\nI was literally explaining the international date line to this airline employee. I couldn’t believe it. Good thing I had done a good bit of international travel before. After a bit of back and forth the concept sunk in and the agent started to understand. Because the connecting flight was on a different carrier and international he had to call an international agent to book a new connecting flight. As he is talking to the agent I hear him having this discussion.\n\nCSA: No they will miss the connecting flight because it lands a whole day later. No because of time zones. I know the time looks like it will work but the date is wrong. He definitely needs a new flight. \n\nHe then holds the phone aside and covers the mouth piece and says...\n\nCSA: Could you explain that date line thing again slowly so I can relay it to her?\n\nI literally had to walk him through an explanation of the international dateline again, and how it would affect our flight times, arrivals and connecting flight, so he could repeat me word for word to the INTERNATIONAL airline booking agent so she would understand why we needed a new flight and would book a new ticket. Finally she got it and booked a new flight so we were able to flight out the next day and get to our destination. Unbelievably this was not the worst customer service experience I had with this airline on THIS TRIP. The next day, and the following day were worse.\n\nTL:DR Airline booking agent does not understand the International Dateline\n",
        "created_utc": 1518650762,
        "upvote_ratio": ""
    },
    {
        "title": "Taxi never showed for a half hour",
        "author": "mmm1928",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xl6sr/taxi_never_showed_for_a_half_hour/",
        "text": "I live in Canada and when I was a kid it was cold out my moms old car did not start. So she walked to work since it was just down the block and called me a cab to take me to school. I basically watched the window for a half hour and no cab. I called my mom to tell her and she called the company. They said they had waited outside and no one came. She asked for another and it also did not show up so it was a stay at home day for me. We never used that company ever again. ",
        "created_utc": 1518641290,
        "upvote_ratio": ""
    },
    {
        "title": "\"Do people really complain about water?\"",
        "author": "benkbloch",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xio6e/do_people_really_complain_about_water/",
        "text": "(Forgive me if this is too long or badly-formatted, ltlftp and all that.)\n\nMy girlfriend and I recently found an apartment we love and decided to apply. To commemorate the occasion, we treated ourselves to Hizza Put, because for some reason she was craving mozzarella sticks and this was the closest place. Now, Chicago recently had some record snow and cold (important), so there were about 3 other parties at the restaurant; a family with three little kids and two other couples. We sit down and the waitress/cashier comes up and asks if we'd like anything to drink. M will be me, G will be girlfriend, W will be waitress-employee.\n\nM: Just water.\n\nW: Okay, our ice machine is having trouble so it'll have to be bottled water.\n\nG: We can't just have tap water without ice?\n\nW: Um, you can, but it might be a little warm. Someone else complained about that...\n\nM: As long as it's not actively hot, it'll be fine, don't worry.\n\nWaitress looks relieved, takes our food order and walks off. She comes back in a minute with our water. My girlfriend and I each take a sip. It's not ice water, but it's still cold. I was expecting lukewarm/room temperature, but this is just like regular cold faucet tap water. We tell the waitress it's fine and thank her.\n\nWe eat our meal and I go up to the register to pay. As she's cashing me out I ask, \"Do people *really* complain about water?\" She looks up at me with a half-smile and says, \"Yeah. Uh, they're actually still here,\" as she glances back at the room. My eyes go wide and I apologize, but she says it's fine. I leave her a big tip by way of an apology and rush out the door.",
        "created_utc": 1518621288,
        "upvote_ratio": ""
    },
    {
        "title": "I mean, he's technically not wrong...",
        "author": "hahkaymahtay",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7ximcg/i_mean_hes_technically_not_wrong/",
        "text": "This happened when I was in my early teens. My mother dropped me off at fast food burger place and would be back after her doctor's appointment. I had my Gameboy and was about to scarf down some greasy food so I was happy.  \n\nI walk up to the register, crisp ten dollar bill in hand, and place my order. We go through the normal routine and the cashier asks me what size I want for my drinks and fries. It's been awhile since I've been to this place, so I ask what is the largest size fries they have.   \n\nHe gives me a very weird look and tells me that he'll be back shortly. After about 30 seconds, he walks back with a huge cardboard box of fries and puts it on the counter.  \n\"This is the biggest we have, why do you want to know?\"  \nI'm really sure what to say and one of his coworkers asks him what he's doing. He tells them I asked to see the largest size fries, so he brought their biggest box.  \nHis coworker informed him what I was actually referring to and the guy let out a long \"ohhhh\" before finishing my order.  \nIt was so bizarre when it happened and recounting it now makes me think the guy was either playing the worst joke ever or was unbelievably stupid. I guess I'll never know. \n",
        "created_utc": 1518620865,
        "upvote_ratio": ""
    },
    {
        "title": "Valentine's Wine",
        "author": "_Gl0rph_",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xilz3/valentines_wine/",
        "text": "I will preface this sorry by saying I look very young for my age. Because of this, I'll often get stopped and questioned whenever I buy or do anything age-restricted. I'd always just show my ID and we'd have a good laugh after the usual expression of shock from the cashier- but not this time. \n\nIt's the day before Valentine's and I went to my nearest grocery store to grab a bottle of Wine, among other things, to split with my wife tomorrow. Having been through enough altercations in my life, I've gotten in the habit of putting the alcohol first on the conveyor and having my ID ready to get it over with as quickly as possible. But unfortunately that's not how it was going to go today. The cashier gives me this squinty-eyed \"what are you trying to pull\" look as soon as he notices the bottle and tells me \"you know I can't sell that to you.\" Without a word, I hand him my ID and continue loading the rest of my groceries on the belt. \n\nWhen i finally have everything out of my cart, i look up to see him holding my ID up to the light, spinning it every which way, closing one eye, and all sorts of theatrics to suggest he thinks I'm using a fake. So I think \"oh great, here we go\" and prepare to give him the same spiel I do with every cashier, but before I can open my mouth he's on the store intercom announcing that he needs security and a manager for a \"suspicious person\" in his lane. That pissed me off, because now everybody else in the store is looking over at me like I'm some punk kid giving the cashier a hard time.\n\nWhen the manager came over, the cashier accuses me of using a \"poorly made fake ID\" and that I didn't even get the orientation right (mine is verticle, not sideways, as I had it renewed just before my 21st birthday). The manager is visibly embarrassed, and explains to the cashier that it's legit before retreating back to his office.\n\nBut lucky me, Detective Cashier didn't believe it and kept asking me questions relating to my ID to see if my info lined up. \"What's your name?\" \"How tall are you?\" Etc. But after giving my name I realized what he was doing and couldn't help but laugh through the rest of the transaction.\n\nI did end up buying the wine, but my gosh that guy was ridiculous. If I shop there again I'm going to have to make a point to avoid his till.",
        "created_utc": 1518620786,
        "upvote_ratio": ""
    },
    {
        "title": "GPS, tacos, and the WORST delivery driver ever. Or how ordering lunch turned into a SAGA!",
        "author": "KitsuneExistISwear",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xihwn/gps_tacos_and_the_worst_delivery_driver_ever_or/",
        "text": "So, I will be the first to admit that I’m kind of lazy. I work in an area full of plenty of shops and plenty of quick places to eat are within easy driving distance. That being said around noon when I go on break the area is busy, and we live in the age of TECHNOLOGY.\n\nSo I order my food to be delivered.\n\nYesterday, was Tuesday and I decided I wanted tacos because taco Tuesday, amiright? I opened up the rideshare food delivery app and order some tacos from a nearby Mexican restaurant. \n\nSo for whatever reason GPS always puts my work in the middle of the near by mart of walls parking lot. I have customers call me saying that they are in the middle of a parking lot because the GPS took them there and I have to guide them to my store. This happens with the drivers too who bring me my food. Every time I get a call asking me to guide them to my location. \n\nSo this time I decide to try and prempt this and see if I can’t make this easier for everyone. I watch the little progress bar on the app and as soon as my food has been picked up I call the driver at the number provided. He picks up and the following conversation ensued: \n\nMe: Hi! I’m the customer you just picked up the food for and I just wanted to let you know the GPS is going to take to the wrong pl-\n\nDriver: What? I am on my way ma’am!\n\nM: Yes, I understand that you’re only just heading over but the place your GPS is telling you to go is wrong. Basically we’re just down the str-\n\nD: I am on my way ma’am! Calm down. I am coming.\n\nM: Yes sir, I know but where your GPS is taking you is incorrect you won’t be able to find me if you follow it. This happens all the time with other drivers an-\n\nD: You’re at [address], right? I am coming! *hangs up*\n\nSo now I’m mad. But also vindictive and want him to call me. So I watch the little car icon on the app drive towards where the app thinks I am and as he’s about to arrive I watch him pull into the parking lot of the mart of walls and stop. So I’m thinking he’s gonna call me right? NOPE. He starts driving ALL AROUND that shopping center that’s up the street from me. He does that for about 10 minutes and then goes ACCROSS THE STREET to another large strip area and winds his way allllllll over for another 10 minutes. He has my food and I know it’s getting cold and all the sauces on the tacos are gonna make them soggy and I am hungry and just want this to stop. So I call customer service.\n\nThe rep is just beginner to offer to call him when he calls me. I let her go and answer his call.\n\nDriver: I can’t find you I am stuck at Mart of walls! \n\nMe: Thats what I was trying to tell you earlier, sir. If you turn right and go down th-\n\nD: All I see is mart of walls!!\n\nM: YES. I am trying to tell you how to get to me. Just turn right and go down to the next intersection and make another rig-\n\nD: I know where you are! *hangs up*\n\nSo now It’s been 40 minutes since he’s picked up my food and I watch his little car and go down the street getting closer to me and gets to the intersection and TURNS IN THE OPPOSITE DIRECTION OF WHERE I SAID. I now get to watch his car wind his way around yet ANOTHER strip mall that isn’t mine for another 10 minutes. I call customer service again and this rep is very helpful and is saying that I can get a 50% refund on the order and that he was going to call the driver. I gave the address of a nearby shop who’s in the same strip as mine but shows up correctly on GPS and tell him to give it to the driver. He puts me on hold, gets back to me quickly and says he gave the driver the new address with explicit instructions to call me. We end the call.\n\nFive minutes later I still see that he’s winding his way around the shopping center accross the street. I call customer service again. I get the same rep as before and he checks his map and sees that the driver is still in the same shopping center as before and he sighs and apologizes. He asks if I even still want the food, and I say no because it’s been an hour since he picked it up and he’s been rude and my food is probably soggy and cold. He then says he will cancel and reorder my same food for me and I won’t be charged for the first order. I thank him and am glad I appear to be done dealing with rude driver dude. \n\nYou’d think that would be the end right? Wrong! 15 minutes after the initial order is cancelled the rude driver FINALLY has made his way to my job and I come out thinking it’s a customer and he hands me my cold food order and says:\n\n“Very sorry. The GPS took me the wrong way and you gave me very confusing directions. Sorry!” \n\nI have never been so frustrated in my life.",
        "created_utc": 1518619833,
        "upvote_ratio": ""
    },
    {
        "title": "The thieving tow yard",
        "author": "No_time_for_shitting",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xhvta/the_thieving_tow_yard/",
        "text": "Was told this would be a good place to post this story about my run in with a tow yard! Please excuse formating and grammar at work on phone. \n\nI got in a bad accident immediately after purchasing a used car title was signed and in the glovebox coming home from picking it up.\nIt was a bad accident and they had to pull me out on the board and couldn't ask me where I wanted it towed. So the tow company that showed up just took it to their lot car was totalled.\n\nAfter I got out of the hospital I had to deal with the insurance and needed to get the car released to my insurance holding lot.\n\nProblem is, the title was in the car and not in my name I had a bill of sale that insurance accepted but the tow lot would not accept. I explained that my belongings and title were in the car but they would not let me in the car until I filled out a special form and got it signed by the owner who at this point was in another state and being very difficult.\nFinnaly I get the form and show it to them and they say it's fake. After that they stop taking calls and inform me once its been 30 days they can sell the vehicle to cover costs.\n\nI inform my insurance of this and my adjuster basically says they do this all the time and make more money from selling the cars.\n\nSo I had to sign ownership over to insurance with a form and me and the adjuster had to go down there with the police for them to release the car. Insurance payed bill in full. To my surprise any cash and electronics inside the vehicle were missing and it was claimed that rats got to it. \n\nAnd the icing on the shit pie! 6 months later I got a 2000 dollar bill from the tow yard and had to take them to court over it.\n\nFuck everyone that works at tow yards. ",
        "created_utc": 1518613936,
        "upvote_ratio": ""
    },
    {
        "title": "I can’t believe I’m related sometimes...",
        "author": "Stormybabe88",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xgrzu/i_cant_believe_im_related_sometimes/",
        "text": "Just now, my mum and I went to our local Non-Golden Arches burger fast food restaurant whose burgers (in my opinion) are better because they’re not dripping in grease, but not as good as those from a Fish and Chip shop. \n\nUnusually for a Wednesday night, it was busy. Like, one or two car park spaces left with a line out the drive thru busy. So, mum parks the car and we head inside. \n\nAlmost immediately, mum comments on the staff. More specifically, about how there’s no one at the register. In my mind, I think “well, they ARE busy”.\n\nAfter a few minutes (in which mum deliberates which beef filled burger she wants), a staff member wearing a headset flies down from the back and jumps on the register to serve us. It takes longer than normal, with her seemingly deleting, reentering, again deleting and modifying our order before accepting payment. No dollar value change, so I just ignore it. We take our change and receipt and move out of the way. \n\nMum makes several comments about how busy they are and one about how she hopes they don’t forget anything. My only comment is about the worker who handled our money while wearing gloves. Soon enough, our number is called and we go up to get our not very healthy food. \n\nMum asks, “can we please get a tray for our drinks?” to the worker who plonks down the drinks in their take out cups. The worker says “sure” and steps out of the way. Another worker flies in behind the first, drops the tray and runs away before we can give a thank you. \n\nMum scoffs, “nice customer service, do it yourself.” To which I automatically retort with “mum. They’re clearly busy.” Mum just rolls her eyes as she puts the drinks into the tray and we head home. \n\nOnce we do get home, we divide the food into groups of who ordered what. As we do, mum retells our experience to my brother. When she tells about me scolding her for the drinks comment, my brother just says “they should do better.”\n\nTo the workers of this take away restaurant, on this busy night: I’m so sorry I’m related to people like this. \n\nAdmittedly, there were a couple of genuine errors (like handling money with gloves and not taking them off/changing them before handling food again), but you do nothing to deserve the sort of stupidity that comes out of their mouths. ",
        "created_utc": 1518599058,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery person fails to understand how delivery works",
        "author": "LokiOfSassgaard",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xgqo0/delivery_person_fails_to_understand_how_delivery/",
        "text": "I'm not even a little but sure how to anonymise this, but here we go anyway.\n\nBack around Christmas, we had a few instances of packages being marked delivered, but not actually showing up at our door.  Super annoying, but we figured it was just normal Christmas thievery, reported missing packages to the retail giant, and went on with our lives.  At one point, I even heard a neighbour shouting at the mailman down at the street, waving his phone with his delivery alert in the guy's face.  It was a level of rage that I thought was absurd.\n\nFast forward to this month.  I'm expecting a few more deliveries than usual, so I'm keeping an eye on my phone, front door, and mailbox.  I get a delivery alert on my phone that package #1 has been delivered and left in my mailbox.  Huh, I think.  My mailbox is barely big enough to fit the envelope my electric bill comes in.  Weird.  I look outside.  Nope, the package is not by my door.  I go down to the mailbox, which is in a shared carport with the rest of my apartment building, in an alley.  There's my package, sitting on top of the row of mailboxes.  WTF.  I'm annoyed, but I take it upstairs to my apartment.  I got my stuff.  No harm.\n\nA few days later, I get an alert that package #2 has been delivered.  Same deal.  Left in the mailbox.  This one is a very large box, unless the retail giant has figured out shrink ray technology.  I go downstairs.  There's no package.  I report the non-delivery to the retail giant, and am told that they'll make it better.  Cool.\n\nPackage #3.  Same thing.  Package #4 does not have a tracking number, since it came from a different source, but it did come with a delivery window, which has passed.  At this point, I take all of my tracking numbers, minus the one I don't have, down to the post office.  As soon as it's my turn to step up to the counter, I tell the friendly-looking man that I'm having a serious concern with the person on my route.  He immediately has me step over to the next counter and calls the supervisor in.  I pull out all my tracking numbers, and the supervisor is very helpful.  She tells me that the carrier on my route is new, and probably lost some boxes in the truck.  I show her the listing for one of the missing items, and while she doesn't say anything, her face pretty much shows that her previous statement was wrong.  I get that she doesn't want to talk negatively about an employee in front of me as I'm actively filing a complaint.  That's cool.  I'm trying not to be the world's biggest bitch right now, even though I really want to be.  Just to be sure, the supervisor takes all of my tracking numbers to go check to make sure my boxes didn't wind up back at the post office somehow.  They did not.  She tells me to try to get a tracking number for the fourth item, which I've already emailed about, but just haven't got a response yet.  I'm annoyed, but there's nothing much I can do.\n\nNext day, I'm expecting package #5.  I get the email with the tracking number from the other company, and begin taking it down to the post office.  On my way down, I catch the letter carrier leaving several large boxes down in the carport.  I ask if there's any for my apartment number before she starts to walk away.  She quickly turns back, and points to the enormous box on the bottom of what she's left there.  I appear to not be alone, because I turn around to see two other people camping the mailbox like vultures, asking for their apartment numbers.  We all take our boxes and run back home.  I drop off my box and head out to the post office with this and the tracking number.  Friendly man from before recognises me, and immediately finds the supervisor.  We have basically the same conversation, but today she's clearly pissed off.  I'm probably not the only person she's heard from by now, and I've also caught this woman leaving our stuff out in the open to be stolen.  The supervisor assures me it won't happen again, and that all packages will be brought to my door.\n\nI happen to have a PO box through a private courier, which I use for business purposes as a safe outgoing address.  I've never received mail to this location, as it was set up for the explicit purpose of being a safe outgoing address for a home business.  When I get home, I immediately call and ask about their policy on large, incoming packages.  Since I've been using this place for a long time, the staff know me well, and are willing to accommodate me with this issue, and even gave me a spare key so my husband can use the box for his important mail, even though that's really not what the box is for.  The address is changed for everything.  But there's a problem.\n\nPackages #6 and #7 have already been sent out before I could change the address.  One is fairly large.  The other is documents that are too large to fit into a mailbox.  I have no tracking number for #6, which is the documents, so I take to camping the mailbox, checking about every half hour.  Like another package, I have a delivery window, so I know roughly when to expect to see it get here.  Days pass.  Nobody knocks on my door.  I check the mailbox to see if it's been left on top or something dumb.  Finally, this afternoon is the last day of the delivery window.  I am annoyed.  It's late.  Nobody has knocked on my door.  I take my keys downstairs, find no documents waiting for me.\n\nThe people who send these documents do not fuck around.  They're documents that are meant to go into a printer on my end.  They need to arrive in pristine condition, and cannot be bent.  They come in heavy cardboard envelopes.  I expect to see this giant, blue cardboard envelope on top of the mailbox, or maybe in the junk mail bin underneath.  It's not there.  I'm angry.  I open my box to get my car insurance spam and...\n\nThere's the heavy cardboard envelope, folded in half and stuffed into my mailbox.  I can only assume this horrible woman has somehow managed to keep her job, and is now too scared of me to knock on my door, and did this to avoid me.\n\nIf I get package #7 in one piece, I will be absolutely astonished.  Having to walk to a mailbox two blocks away will be a pain in the ass, but so much less of a pain than this month has been.\n\nEDIT: I posted this and went straight to bed.  But yes, everything has been documented and reported again.  It was too late to do anything yesterday by the time I checked the mail, but I've just spent the morning on the phone trying to reach the right people to file a complaint with someone more higher up than the supervisor at the local office for the sake of my neighbours if nothing else.  Our new box is on a different route, so it has a different carrier, and the employees at that location aren't going to let my stuff walk away like this person has.\n\nEDIT 2: I set up text alerts for package #7.  As I'm sitting here at my desk, which looks out at the walkway to my front door, I get an alert.  Package has been delivered and left at my front door.  Like hell.  I told my husband to run down to the mailbox, and he caught the carrier as she was doing whatever she was doing and grabbed it before she could wander away or do whatever it is she does.  We now have our gourmet coffee, and are 100% done with the post office for as long as we live.",
        "created_utc": 1518598496,
        "upvote_ratio": ""
    },
    {
        "title": "I wouldn’t consider that something you’re allergic to",
        "author": "aaareed",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xgd3a/i_wouldnt_consider_that_something_youre_allergic/",
        "text": "I saw a post about someone getting an order wrong due to a health concern and it reminded me of a time over 5 years ago when something similar happened to me. TL;DR at bottom. \n\nI was around 16 and I went out to dinner with my dad while at a conference for his work. We used a meal voucher from the conference which covered dinner and a dessert at an okay restaurant within the hotel. I couldn’t help but notice the employees there seemed to be a little rough around the edges. I have a lot of health issues including food allergies and sensitivities so I’m always really careful about desserts. I have a mild anaphylactic allergy to many nuts including tree nuts so I usually avoid things containing chocolate when in public. \n\nThe waitress comes around after we finish our meals. The whole time she was acting rude and sassy as hell, unprofessional, and as if we were an inconvenience to her. We were in a rougher part of town so likely a lot of people there grew up like that so I just brushed it off. The only way I can describe her as like Cindy from orange is the new black. Acceptable to act like that if you’re in a women’s prison, probably not okay in a restaurant. It was a long time ago so I don’t remember the conversation exactly. Let’s call her BW for bitch waitress. \n\nBW: “You want desert now?”\nMe: “Sure, I’ll have the lemon cake. Are there any tree nuts or allergens?”\nBW: “No we only have nuts in our reeses brownie sundae.”\nMe: “Okay I’ll do the lemon cake then.”\n\nPeanuts are fine for me so I don’t worry about any cross contamination. A few minutes later she comes back. \n\nBW: “We out of lemon cake. You want white cake?”\nMe: “Sure. Does it have tree nuts?”\nBW: *rolls eyes* “No we only have nuts in our Reese’s sundae.”\nMe: “Okay that’s fine then.”\n\nA few minutes later she brings it back and we start eating. I was expecting plain vanilla cake but it had a strange taste. I usually trust my senses when I feel like somethings wrong so I stopped eating. My dad immediately could tell that something was up and took a bite of it. He pointed out that it was coconut cake. Coconut is classified as a tree nut by the FDA but is genetically different, so most people allergic to tree nuts aren’t allergic to coconut. I’m one of the cases where I’m allergic to both. It’s still listed as a nut on most ingredient labels\n\nAll my face and throat began to itch uncontrollably all I remember is my dad yelling at the waitress and she seemed unaffected. \n\nBW: “Well I wouldn’t consider coconut a tree nut or even a nut at all.”\n\nShe turned away and walked back into the kitchen. The manager came out absolutely horrified, apologizing profusely, and offered to pay for our meals. We let him know that we were using our free meal through the conference so he told us just to keep our coupons so we could have another free meal. Thanks man. \n\nWe originally had no intention of returning to the restaurant because of how rude the waitress was. Yet we ended up coming back the next morning to get some quick breakfast before our flight since we didn’t have as much time as we thought we would (thanks to oversleeping since we spent 3 hours at the hospital the night before). We both get the quickest meal on the menu, fruit and a muffin if I remember correctly. Guess who shows up to serve us. \n\nBW: “You eat any more coconut?” -cackles-\n\nMy dad and I just look at each other like WTF. We start eating as she walks away. She immediately runs back to our table. \n\nBW: “By the way the muffins have coconut.” -cackles again-\n\nAs she was walking away that time I swear I heard a “hahahaha white people” as she was mumbling to herself (I’m hispanic).\n\n\nTL;DR: Rude waitress served me food I was allergic to because she didn’t consider it an allergen, and proceeded to joke about it the next day. ",
        "created_utc": 1518592977,
        "upvote_ratio": ""
    },
    {
        "title": "Hello? Is anyone there?",
        "author": "paulec252",
        "url": "https://www.reddit.com/r/TalesFromTheCustomer/comments/7xfwsr/hello_is_anyone_there/",
        "text": "quick one: \n\nI walk into a Donutshop inside a gas station around 6pm. Nobody was at the counter, but I could hear someone doing dishes in the back. I called out \"hello\", but the dishwashing continued, so I said hello (a little louder) after a couple seconds. \n\nThe guy comes from out back and says rather angrily \"Do you mind *waiting* a minute?\"\nI said \"excuse me?\" to make sure I heard him right. \nHe's now standing in front of the register and repeats \"do you mind waiting a minute\" \n\nNo, I say, and he immediately starts taking my order.\n\nI would've accepted \"be right there\" or \"sorry for the wait\"... how dare I announce my presence to an abandoned counter?",
        "created_utc": 1518587120,
        "upvote_ratio": ""
    }
]