[
    {
        "title": "Have any of you been tailed before?",
        "author": "ebiofuel",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/850rzd/have_any_of_you_been_tailed_before/",
        "text": "I just got done with my shift tonight and on my last delivery I had somebody tail me. They followed me around a city block and through another residential area, twice around the same block. They backed off after I pulled into a well lit gas station.\n\nI've had a defensive driving course in the army and understand the concept to keep moving, not trap yourself, and not getting out of the vehicle no matter what. \n\nI felt pretty confident in the situation due to the training I've had but how would all of you have reacted to this? I know I added my areas non emergency police number into my contacts and will probably carry protection with me from now on. ",
        "created_utc": 1521252760,
        "upvote_ratio": ""
    },
    {
        "title": "What could it mean if a particular pizza place offers wages at a 50-75% higher rate than surrounding competitors?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/850a9k/what_could_it_mean_if_a_particular_pizza_place/",
        "text": "[deleted]",
        "created_utc": 1521247670,
        "upvote_ratio": ""
    },
    {
        "title": "If the area code on the phone number doesn't check out, don't take the delivery",
        "author": "Intergalactic96",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84xjhg/if_the_area_code_on_the_phone_number_doesnt_check/",
        "text": "**Edit**: I wish I could change the title to : Use your best judgement when taking deliveries, or how we all got duped by a scammer \n\nJust found this sub, I have a story that I figured would fit in perfectly.\n\nA few years ago, I used to drive for a regional pizza chain in my city. I was working there one sunny, summer day, not doing much. Super slow during the summer and especially during non-peak hours. Cleaning dishes, prepping food, but no rush. \n\nAnyway, we get a call to deliver some pizzas. They're a little outside our range, but it's the first delivery of the day and we've got at least an hour before the lunch rush. I go out to deliver it. \n\nI get there, knock on the door. No response. Not unusual. I check the receipt, address checks out. Knock some more, no one comes. I wait another minute or so and the door opens, but they have the chain on. \n\n\"Who is it?\" I say I'm the pizza guy, they say they didn't order pizza. Ok, that's weird. \n\nSince it's a duplex style house, they said it could be the other unit on accident, which is reasonable. I knock on the other door, they open quicker. It's a nice older couple, they didn't order any pizza either. Ok, that's weird as fuck. I ask again, just to make sure, but nope. Solid no, they didn't order any pizza.\n\nJust as I'm walking back to my car, I get a call from my boss, who's a little irate.\n\nBoss: \"Dude where are you?\"\n\nMe: \"What do you mean?\"\n\nBoss: \"I just got a call from the customer who said his pizza isn't there yet! The lunch crowd is getting here and we need you back!\"\n\nMe: \"I went to the house, it was a duplex, no one ordered any pizza.\"\n\nBoss: \"*under his breath* fuck... Call the number on the order to get it sorted out. just get back here.\" Then he hung up\n\nSo I called the number on the receipt. My first note was that it was  a strange area code, but I didn't really care. I was just annoyed this was happening. Rings for a second, and someone picks it up. He answers as Diamond. The thing is, he had the thickest accent that I could not place. I estimate that I didn't understand around 1/5 of the words, so some of these sentences aren't perfectly verbatim.\n\nDiamond: \"Hello this is Diamond\".\n\nMe: \"Hi, this is the pizza guy, did you order pizza to this address?\"\n\nDiamond: \"Yes I did, I am an insurance agent and have a meeting with the couple, I will be there soon.\"\n\nSo as soon as he said that, my spidey-senses start tingling.\n\nMe: \"okay.... well, I'll go talk to them.\"\n\nDiamond: \"Yeah I will be there soon of course do not worry.\"\n\nSo I go back to the duplex and talk to the older couple. Now, they were very nice. But they were pretty old, and pretty southern, so their accents and way of speaking were kind of a challenge too. It took a few minutes to get my questions across, but they picked it up. I asked them if they had a meeting with an insurance agent, and the light clicked on.\n\nTurns out, they had fallen victim to a credit card scam a few months prior. They lost about 1000 dollars to this guy, but they told their son, who immediately told them to go to the IRS, tell their credit agencies, etc. They got their money back, but this scammer was pissed off at that fact, so he would order pizzas to their house to annoy them and waste their time... Super fucking petty right? \n\nAnyway, after I talked with them for a few minutes, I left, and gave my scammer friend a call back.\n\nDiamond: \"Hello hello\"\n\nMe: \"Hi Diamond, where are you? I'm waiting for you to pay for this pizza man!\" (He ordered it as a cash payment)\n\nDiamond: \"I am 10, I am 10 minutes away, do not worry my friend, I will be there soon, I am an insurance agent and I have a meeting with-\" \n\nI cut him off, I was tired of the bullshit.\n\nMe: \"What road are you on?\" \n\nAbout 4 seconds of silence, and then he hung up.\n\nI thanked the couple for their time, drove back, and explained to everyone at the restaurant that it was a scam and these scammers harassed their victims with fake pizza orders. (Which, again, super fucking petty.) My boss wrote down a note to verify all area codes to make sure they're local, or at least in the US, and we all laughed about it. My boss apologized for being a dick, which was cool.\n\nDiamond was from Jamaica, by the way. His area code was 876. \n\nEdit: oh yeah, I forgot. I missed out on 2 legitimate deliveries and one of the tips was 40% :( \n\n\n**Edit**: I get it, don't go by area codes, I'm glad that your area code is different than your local one. Mine is too. The problem was that the scammer's area code was from Jamaica and no one bothered to check it out. ",
        "created_utc": 1521224157,
        "upvote_ratio": ""
    },
    {
        "title": "Writing a joke in the box...",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84xcjr/writing_a_joke_in_the_box/",
        "text": "Back in the day, we didn't get those kinds of orders.  These days, I wonder if anyone ever [did this](http://www.thewebcomicfactory.com/comic/tales-of-pizza-joke-in-a-box/) to the pizza driver.",
        "created_utc": 1521222649,
        "upvote_ratio": ""
    },
    {
        "title": "Delivery guy vs. psychiatric hospital front desk clerk",
        "author": "jpl270791",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84tovw/delivery_guy_vs_psychiatric_hospital_front_desk/",
        "text": "This happened a couple years ago to a coworker of mine, long before I was even employed by this restaurant, so I'll do my best to provide an accurate account of what happened.\n\n\nSo my colleague, who has worked for the same restaurant for over 10 years, went to deliver a pizza to a patient in my hometown's psychiatric hospital on an otherwise uneventful evening. All he had to go on was the patient's name and the hospital's phone number – no room number or personal phone number.\n\n\nUpon arriving at the hospital, my colleague walks up to the front desk (or whatever the equivalent is in a psychiatric hospital), asks the clerk if she can help him locate this person that he's delivering to. She tells him, in an arrogant and condescending tone, that she cannot help him, that it's not her job, and that he must call the hospital directly in order to get a room number for a patient.\n\n\nExasperated, but not wanting to make a scene, he stepped aside a few feet and dialed the hospital's phone number.\n\n\nLo and behold, the front desk telephone began to ring, right there, in front of both the clerk and my colleague.\n\n\n—You've got to be f\\*\\*\\*ing kidding me, my colleague said to her.\n\n\nStrangely enough, the front desk clerk was suddenly able to figure out what room number the patient/customer was in. The rest of the delivery went without incident.\n\n\nIf I didn't know any better, I'd wonder if she actually had a room of her own, and was volunteering part time at the front desk, hah.",
        "created_utc": 1521185308,
        "upvote_ratio": ""
    },
    {
        "title": "Hit a garage door last week",
        "author": "NikandGale",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84tbhg/hit_a_garage_door_last_week/",
        "text": "Was on my last run and on little sleep when I did the unspeakable. We all always second guess ourselves with the, “Did I put my car in park?” but we always do. I skipped that vital step last Saturday.\nThankfully the home owners were super nice about it. Sucks though because their garage door was so old, I had to get them a new one. Only dented two panels but cost me $615.  Honestly it could have midday and I could have hit a person so I don’t know what I’m griping about. \n\nI chose to just pay for it and avoid any upcharges on my monthly insurance since I’m closing on a house and getting married this month. Not sure if it was the best route.\n\nDefinitely one of those things you only do once. Anyone ever done this before?",
        "created_utc": 1521180157,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Delivery Man of the Year",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84spcq/pizza_delivery_man_of_the_year/",
        "text": "[deleted]",
        "created_utc": 1521172794,
        "upvote_ratio": ""
    },
    {
        "title": "Regulars that don't tip, beware",
        "author": "mk3idi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84sewl/regulars_that_dont_tip_beware/",
        "text": "My store generally knows all of the regualrs that don't ever tip. needless to say we'll take our time getting to you. In some cases in winter the drivers will often say fuck using a bag and deliver you a cold ass pizza. Should you complain about it we will not bring you new pizza if you are a known \" Throat cutter\".",
        "created_utc": 1521169612,
        "upvote_ratio": ""
    },
    {
        "title": "The story on how asking for a tip backfired.",
        "author": "zxchary",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84sb4u/the_story_on_how_asking_for_a_tip_backfired/",
        "text": "This happened today. So, I was taking this order of food, about $150 worth to this accounting firm. I got there, and this guy leads me to the kitchen. He asks if it’s already paid for, and I say yes, but i tell him I’ll need the buyer to sign for it. “Oh, I’ll just get someone here to sign it.” This is how I knew I was about to get stiffed. Most of the time when one single person buys a bunch of food for a business and he’s not there in person to sign for it I usually get stiffed. Except for one instance where I asked the lady who was signing it if the doctor who originally paid for the food authorized for a tip. “Hmmm idk let me call him.” So she calls the doctor and I ended up getting tipped like $20 or so. I figured  that was pretty harmless, maybe if I get into a situation like that again I’ll approach it like that. Good idea, right? WRONG.\n\nBack to my original story.\nSo I get the receipt and handed it to the lady. And before she signs I ask if the original buyer authorized for a tip. Thinking it worked last time, I knew for sure it’d probably work this time. Nah, I was met with the dirtiest look of my whole life time. “Oh we’ll take care of you, don’t worry.” I pissed her tf off, and I knew whatever chance I had at a tip was gone. But guess what? The lady left and came back with $20 for me, but she still had that mean look on her face, like she could’ve burned a hole through my face. “Here’s your tip, but FYI you don’t ask for a tip” I mean technically I didn’t ask. Anyways I got outta there, and of course she called the store, and of course I got an earful from  the managers. Of fucking course. I have no regrets thought, but I’m probably not gonna do something like that again, I’ll just take my stiffs in stride. ",
        "created_utc": 1521168543,
        "upvote_ratio": ""
    },
    {
        "title": "Let the inside people know if you're going to make a stop between deliveries!",
        "author": "tactics14",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84ofw8/let_the_inside_people_know_if_youre_going_to_make/",
        "text": "Just a little rant. Working the morning shift with just me and one driver. We're not very busy but have orders coming in at a regular pace. He leaves with one, comes back and there's one more waiting kinda deal.\n\nDriver leaves with one to the next town over and we get three orders a few minutes after he leaves. I tell them all it will be about 30 minutes as they could all be taken as a neat triple.\n\nDriver a been gone for 20 minutes... He should have been back a couple minutes ago. Maybe the person he delivered to didn't answer the door or something. I don't think anything of it.\n\n25 minute's now... I'm poking my head out the back door wondering where the hell he is.\n\n30 minutes, these deliveries are all officially late. I'm kinda ticked off at this point. Call my driver and ask if he got lost. Nope he's at the grocery store buying lunch. I tell him hurry back, there's three on the board ready to go.\n\n10 more minutes pass - one of the customers have called asking where there food is. I have all three hot bags sitting on a back table by the driver door so he can grab and go.\n\nTen more minutes pass and driver finally shows up. Grocery bags in hand and a stack of lottery tickets - \"sorry\" he says. \"had to get gas too\". I ask him if he bought lottery tickets while he was at it, he pauses for a minute before saying yes.\n\nI tell him whatever, just hurry out the door all these orders are late I didn't know you were going to take a 45 minute break when I quoted them the delivery times.\n\nOkay he says, I just need to pee first.\n\n\nFUCK YOU if you do this. \n\n/rant ",
        "created_utc": 1521136301,
        "upvote_ratio": ""
    },
    {
        "title": "Tips",
        "author": "abe566",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84l63j/tips/",
        "text": "Alright I've worked for a year on and off at a local small time pizza place, the one thing I hate is how people tip. I honestly believe that if you order out you have enough to tip. It's also so fucking aggravating when they look you in the face, say o that was fast and ask for all but a single dollar back. \nThe way I see it, if you have anything less than 10 tip whatever. \nAnything more than 10 tip at least the first number in the total. Example, 50 for food so 5 for tip. 100 food 10 tip. ",
        "created_utc": 1521106052,
        "upvote_ratio": ""
    },
    {
        "title": "Kids Love My Hair",
        "author": "Torpid-O",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84irx6/kids_love_my_hair/",
        "text": "So, for context, my hair is currently dyed green for St. Pat's. Just the part that fits under a hat, just in case a corporate shill shows up at the store, but I don't wear my hat on deliveries.\n\nSo, I have three instances TODAY where kids saw my hair and absolutely loved it.\n\nFirst, I delivered to a local elementary school right after open. I was walking in the front door and kids were heading either to or from lunch, I assume. Anyway, I hear one of the kids say, \"Teacher, that guy has green hair.\" So I turn around and all the kids are saying things like, \"That's cool. Wow.\" One of the kids shouted at me, \"Hey, why is your hair green?\" So I replied with, \"I never ate my vegetables when I was your age! It's like this permanently!\" The teacher got a good laugh out of it.\n\nSecond, I delivered to a home and as I was talking to the customer and a three or four year old girl comes over and says, \"I like your hair. I want rainbow colored hair.\" Her dad laughs a bit, but I bend down to her level and said, \"Then be sure to eat your vegetables. I eat a lot of greens, so my hair turned green. If you want a rainbow you need to eat your broccoli, carrots, tomatoes, eggplant, squash, and lots of other veggies.\"\n\nThe last one, one of the several kids said I look like JackSepticEye, a popular YouTuber if you don't know. Which I can see because he did his hair the same way for a while. So I look over at the kids and do my best impression with, \"Top-O the mornin' to ya laddies!\" They loved it. One started jumping up and down shouting, \"He did it. He did it.\"\n\nSometimes, I hate kids on deliveries, but sometimes they're great.",
        "created_utc": 1521077157,
        "upvote_ratio": ""
    },
    {
        "title": "If you ordered a pizza...",
        "author": "PizzaGuyS197",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84e6t5/if_you_ordered_a_pizza/",
        "text": "Wait inside, or at least where you would know I'm coming! Don't go to your back patio or chill in the back of the hotel if you had a room number(what inspired this post), nor take a shower or try to \"beat\" us ahead of time. I'm not trying to wait any longer in this Midwestern ass-cold piss popsicle winter freeze fuck fest. I could almost understand if it was like 2 hours late, but it's always with a perfectly good on-time order. Jesus.",
        "created_utc": 1521040908,
        "upvote_ratio": ""
    },
    {
        "title": "Taking a 2nd jod as as pizza driver",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84dzym/taking_a_2nd_jod_as_as_pizza_driver/",
        "text": "[deleted]",
        "created_utc": 1521039393,
        "upvote_ratio": ""
    },
    {
        "title": "Did I get The Pizza Guy™️ in trouble?",
        "author": "TheAdoptedBeta",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84clta/did_i_get_the_pizza_guy_in_trouble/",
        "text": "Hey pizza guys! I was wondering if y’all could answer a question I had. \n\nSo I bought a pizza online from [favourite pizza establishment], and was told it would be something like 25-35 minutes to be delivered. Fair enough, that’s about average. It’s the middle of the week at about 4:30 PM when I ordered, and later I notice it’s a little after 5:10. I check the live-update website which tells me the order has already been completed/delivered.\n\nI called up [The Pizza Establishment™️] because I’m starting to worry my Pizza got sent to the wrong place, I moved recently and I’ve had a lot of issues with forgetting to update my address when I order shit. I ask Phone Dude if maybe my ‘za was sent to the wrong place and he assured me the website will announce an order is complete after x amount of time and that my order is on its “probably” way. Weird, but okay, I figure I’ll wait awhile before trying to call again (since he didn’t actually confirm the address or anything)\n\nLo and behold, a few minutes after I first called I get a knock on the door and see The Pizza Guy™️, I greet him with a smile and a friendly “Hey!” And he gives me a pretty nasty stinkeye, staying silent before handing me the receipt to sign (I already paid the tip online, and I always tip 15% on the order including delivery fee, so it’s not like he was worried I wouldn’t tip) so my question is, did me calling the store to check on my order get him in trouble? \n\nTo be fair I’ve never had a problem with this pizza place going over the estimated delivery time, I live fairly close to the pizza place and there’s not much traffic by my house so I have to assume maybe the phone dude called to ask where he was and he got lectured or possibly got called out on taking too long on what should be a fast delivery?  I don’t work in the pizza business so can any of you tell me why he might have been giving me the stinkeye if not that?\n\nEdit: auto correct making sure I was at home ",
        "created_utc": 1521026468,
        "upvote_ratio": ""
    },
    {
        "title": "Be Honest",
        "author": "psychickiss",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84bhth/be_honest/",
        "text": "So a short little story here I wanted to share from tonight. I went to do an order that was around the corner at one of the hotels. The order total was about 12 dollars and the person who answered gave me a twenty and asked for five back. I take the money, pocket it, and then give out the money needed. \n\nWhen I got back to the store, I realized it was a fifty and not a twenty, and I don't think that this guy wanted to give me a fifty on such a small order and only wanted five back. I called him up and asked him if he meant to give me as I was a bit unsure about it. \n\nI drove back over to the hotel and handed the guy the money back, as he meant to gave me a twenty I gave him thirty back. The guy came back to the door and was super nice about it and was super appreciative that I called back to let him know what was going on. He ended up giving me 10 bucks extra because of that. \n\n\nI'm sorry if the title for this is a bit wanky, but I'm not exactly the best at titling my little stories here. \n\n\n",
        "created_utc": 1521011762,
        "upvote_ratio": ""
    },
    {
        "title": "The Craziest thing in my 3 years of delivering just happened to me",
        "author": "4otie7",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/847plz/the_craziest_thing_in_my_3_years_of_delivering/",
        "text": "Im from long island NY and we were just hit with a snow storm. I’m out delivering, making some nice above average tips when the craziest shit just happened.\n\nI’m going across this small intersection (fairly busy but only 2 lanes) and out of no where this kid on a quad just flies in front of me.\n\nI’m like OH SHIT and i swerve onto the side of the road and dink the quad a little bit. The kid (who had to be like 15) goes flying over this ledge and falls off his quad into someones yard.\n\nI immediately get out of the car and am like “Yo!! are you okay?!” and he just looks like at me and scrambles to get back on the quad. \n\nThen i notice that while this whole thing went down there was a cop at the red light in the intersection. He gets out of his car and yells at the kid to get off the quad. The kid tries escaping but he gets stuck in the snow.\n\nThen the cop grabs the kid and throws him to the ground and starts punching him in the back to stay down and he cuffs him.\n\nMeanwhile I’m by the road like holy fuck. Once he’s got the kid cuffed and yell over “officer do you want me to stick around?” and hes like “Only if you want to file a report. If not then get out of here” I give him the double thumbs up and I was on my merry way. Fucking crazy, im full of adrenaline ",
        "created_utc": 1520975328,
        "upvote_ratio": ""
    },
    {
        "title": "Carry Out Tip question",
        "author": "Renceward",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8479su/carry_out_tip_question/",
        "text": "Since I live fairly close to most of the pizza places in town and you can usually get a better price doing a pick up as opposed to delivery - I almost always opt for pickup.\n\nI've always been unsure with regards to tipping for a pickup.  My order is usually less than $15 and I typically tip $2.  Not sure if this is good, bad or just OK.    Thoughts?",
        "created_utc": 1520971661,
        "upvote_ratio": ""
    },
    {
        "title": "I've delivered pizza for almost a year but I'm also a musician, I've found driving around St. Paul Minnesota to be the perfect way to make a music video. Apologies if this is off topic",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8477qg/ive_delivered_pizza_for_almost_a_year_but_im_also/",
        "text": "[deleted]",
        "created_utc": 1520971251,
        "upvote_ratio": ""
    },
    {
        "title": "I got a $60 tip on a $16 order.",
        "author": "Hyrule_NoPizza",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/843nz4/i_got_a_60_tip_on_a_16_order/",
        "text": "The area I used to work in was a hotel dense area in the wealthy part of Minnesota. In Minnesota our liquor stores all close at 10pm and I didn't have time to stop before work so I ended up running to the liquor store sometime after I dropped off an order.\n\n Sometime later that night after 10pm an older lady calls and orders a pizza. After I'm done putting her order in she asks if I'll be the one taking it and I say yeah I will be. So she ask if I would mind running to the liquor store for her and I say \"Sorry, I'm guessing you're from out of state since you're staying at a hotel. Here in Minnesota they're all closed by 10pm but lucky for you I already ran there earlier tonight and if you want you could have a couple of the beers I bought earlier.\" She gets super excited and thanks me. \n\nI get to the hotel and the lady is like 60 or 70 years old and just has the biggest smile on her face. Gives me $16.06 for the order, I give her the food and like 4 beers, then she slips a couple bills in my pocket, gives me a hug and a kiss on the cheek then goes back inside the hotel. \n\nI get in my car and count how much she gave me. She gave me three $20 bills + the $16.06 for her order. That was the best order size to tip ratio I've ever gotten. Called her to thank her and told her if she left a review to not say anything about the beer and she said \"don't worry about it, it's our secret.\"\n\n",
        "created_utc": 1520943278,
        "upvote_ratio": ""
    },
    {
        "title": "What are your specials?!",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/842tgs/what_are_your_specials/",
        "text": "- the most goddamn annoying motha fuckin phrase ever uttered.",
        "created_utc": 1520932959,
        "upvote_ratio": ""
    },
    {
        "title": "Call 911",
        "author": "TheNCPatriot",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/841s4m/call_911/",
        "text": "So for context, I work at a mom &amp; pop pizza/Italian restaurant in North Carolina. The most delivery drivers we'll ever have on is one during the work week, and two, maybe THREE max on a Friday or Saturday night. \n\nI had a Thursday night off so my buddy Jake was working that night. I didn't hear this story until I came into my shift the next day. I came into work and the owner asked me if I heard what happened. I told her no, then asked why I was the only guy on that Friday night (Jake was off, which is atypical). \n\nThe night before, Jake had gone on a delivery and ended up calling the store. The phone call, according to the owner, went something like this:\n\nJake: Hey Dawn, it's Jake.\n\nDawn (Owner): Hey Jake, what's up?\n\nJake: Yeah, so this person's not answering the door.\n\nDawn: Did you try calling them?\n\nJake: Yeah! They didn't pick up. \n\nDawn: Knock louder maybe?\n\nJake: I tried, no answer.\n\nDawn: Did you try looking in the windows and see what's going on?\n\nJake: Here, lemme try. \n\nPause\n\nJake: Yeah, I see them on the couch. She looks like she's asleep.\n\nDawn: ...\n\nDawn: Well what's going on?\n\nJake: Yeah, she's just kinda laying there with her mouth open.\n\nDawn: Uh...\n\nJake: And she has dogs jumping on her.\n\nDawn: Like what kind of dogs?\n\nJake: These big German Shepherds. She's not stirring. \n\nDawn: Uh Jake?\n\nJake: Yeah? \n\nDawn: I think she's dead. Come back to the store, I'm calling 911. \n\nJake came back and everybody heard what happened. Nobody touched the food, they ended up throwing out. They weren't gonna fuck with a dead person's food. Jake was so disturbed by this that that's why he had the Friday night off, the night I was supposed to work. When I saw him next I talked to him about it and we ended up joking that she should've ordered Domino's, they would've been there in 30 minutes or less. Police never followed up with us, we don't know what happened. \n\nTL;DR\nMy friend went on delivery and the person that ordered it was dead as a doorknob when he showed up. We threw the food away, police never told us what happened. ",
        "created_utc": 1520918831,
        "upvote_ratio": ""
    },
    {
        "title": "Any of you guys work in Washington state?",
        "author": "thatsMRnick2you",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/841798/any_of_you_guys_work_in_washington_state/",
        "text": "I have some questions about pay rate and tip credits. I’m thinking about moving to Washington  and I want to make sure I’m clear about how the compensation works there.",
        "created_utc": 1520912111,
        "upvote_ratio": ""
    },
    {
        "title": "Dude stole my car.",
        "author": "snugtruk",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/84158u/dude_stole_my_car/",
        "text": "     I worked at a pizza place on a small island, on the North Carolina coast. People that lived there didn’t even lock their doors, at the time. I was managing a pizza shop and neither of the teenage kids, that showed up for work, had a license. I was forced to deliver, for lack of better help. I was delivering from five until around seven o’clock. I was driving down the road, only a mile from the pizza shop, to the delivery. I noticed 2 teenagers walking down the road. I pulled up to a two story apartment. I was delivering to the ground floor and thought nothing to leave my car running, in the parking lot of the apartments. I walked to the door and knocked. As the customer came to the door, I heard my car door close. I turned around to see a teenager, that looked all to familiar, pulling out in my car. The pizza sign was on the car and it was just before dark. I finish the transaction, at the door, and instantly called the police.\nAfter talking to the police, I had to call my two teenage soldiers and explain that we couldn’t take any more deliveries, because my car was stolen. They had to call back customers and offer a discount for picking up their pizza or we would offer them the same amount, as their order, on their next call or visit. I was very surprised at how well they handled things. \n The police shortly arrived and I gave them the description of the pizza sign and my car. I explained the whole situation and that I originally saw two teenagers, but there was only one in the car. The police quickly found the second teenager and got very bad answers about anybody else or a stolen car. But what do you really expect the kid to say? It seemed like only minutes later they were taking me to my stolen car, only a few blocks away. Knowing I keep nothing in my car but a tool set and the paperwork for my car, I wasn’t worried. As we pulled down the road I saw a line of police vehicles. I was happy to see my car wasn’t wrecked. It was just parked in an empty rental house, no sign of anybody and no sign of the key either. \nAfter getting me and my car back to the pizza shop. I had to finish the night without a delivery driver. I let my cook go home early and only doing dine-in, carry out and pick-up. We had a decent night and I didn’t feel good. It had been a rough night for everyone. So upon closing I let my front person go without cleaning up, other than their pre-closing cleanup. I figured I needed time to think anyway, might as well do it while cleaning. \n The following day, I was relieved to see my car was still at the pizza shop. When I called the dealership, they told me the car had a recall on the ignition and they would replace it for free. I got 2 new keys and the old keys were worthless. Be careful out there! We all can’t be lucky all the time!",
        "created_utc": 1520911534,
        "upvote_ratio": ""
    },
    {
        "title": "The Nightmare Couple",
        "author": "thedarksalmon",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83z6r5/the_nightmare_couple/",
        "text": "So, this happened about two years ago, when I was a fresh apprentice Pizza Wizard, didn't even have my own shirt yet. I was Lime Green.\n\nA couple orders a pizza for pickup, and it's mid-afternoon Wednesday when a couple new to town orders a large pepperoni-sausage for delivery. This warrants a wait time of about 45 minutes because we have a steady flow of delivery right now. Pretty standard stuff. Too bad I am not a standard idiot. I'm an advanced idiot.\n\nI make this pizza, and at some point put mushrooms on it. Absent-minded mistake on my part. I was a month or so in, we caught it early and I made the pizza right. Take note that this pizza will still be delivered on time. 45 minutes is just to give the driver breathing room. They lived like 2 miles out, so it's not bad and it is going to be fine. We used my mess up for the next order, basically their pie was just made one pizza later.\n\nWell, this couple calls about 34 minutes after to check the status of their pizza and delivery. Now, this is odd because no one does this unless the pizza is late. Like 50-55 minutes for a 45 wait time. I pick up the phone, and proceed to make a rookie mistake.\n\nMe: \"Hello, Pizza Place, how can I help you?\"\n\nWoman: \"Hello, my name is Lastname and I was just calling to see if our pizza was still going to be 45 minutes.\"\n\nMe (Here's where I dropped the game winning pass): \"Yes ma'am, it'll still be 45 minutes. *I put an extra topping on, so we re-made it and it's leaving now.*\" \n\nThis is about 35 minutes after the order, the pizza will be there in less than 8 minutes at this point, but I already f**ked up. I look at my co-worker/senior employee and she tells me I shouldnt say that, and just as she does... \n\nWoman: **\"SoDoesThisMeanIGetADiscount?!?!\"**\n\nMe (now a deer in the headlights): \"Oh, uh... here.\"\n\nI pass the phone to a senior employee[SE], who is younger than me and basically the same build and voice as my 17 year old sister.\n\nSE: \"Hello this is SE of Pizza Place, how can I help you?\"\n\nWoman: \"We get a discount right? Because you screwed up?\"\n\nSE: \"Well, no, ma'am. It's the exact pizza you ordered and it's going to be there on time, so there's no reason to issue a discount. \n\nNote, small place, can't hand out discounts all the time.\n\nWoman: \"Well that makes no sense! YOU MESSED UP MY PIZZA!\"\n\nSE: \"Well, ma'am, we were able to use it for another order and just made yours behind their ticket. We can't give you a discount because your pizza was made as ordered and will be there on time.\"\n\nWoman: \"That's not acceptable though! There was a mistake!\"\n\nAt this point my SE/co-worker is starting to feel the effects of this womans charm. \n\nSE: \"Ma'am, I'm sorry, I cannot issue a discount.\"\n\nWoman hangs up the phone. Then calls back, screaming, not 2 minutes later, demanding a discount and my SE calmly says she can't issue a discount, have a good day, and hangs up the phone. Then her HUSBAND calls back, yelling at my SE about the same thing. With unwavering constitution, she calmly replies \"I'm sorry, I already told your wife that I cannot issue a discount. It was made right and arrived on time.\" She then hangs up the phone again.\n\nApparently the driver (my buddy) delivered to them, they kept him there talking trash about my SE, then tipped him $0.48 and sent him on his way.\n\nAnd that's the day I learned how to properly omit the truth.\n\nTL;DR: New couple orders a pizza. I made it wrong, and corrected the problem with a new pie directly upon seeing my mistake. Woman wants a discount for a correctly made, on-time order and we tell her we can't do that. She yells at us, calls back to yell again, her husband calls to yell, and they tell the driver how bad we are.",
        "created_utc": 1520893731,
        "upvote_ratio": ""
    },
    {
        "title": "If you're gonna call up angry, let me resolve your issue.",
        "author": "bosspugs",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83ymws/if_youre_gonna_call_up_angry_let_me_resolve_your/",
        "text": "What is the point of calling to complain if you're gonna say DONT WORRY ABOUT IT and hang up on me when I try to fix it?\n\nGuy called for a small order for his corner store. \n\nHe just called back a bit angry because I forgot to give him silverware. My fault, 100 percent.\n\nInstead of allowing me to send him silverware or something more, he just says don't worry about it and hangs up\n\nLast week we had a pizza delivered somewhere and the cheese slid off. We weren't allowed to correct the problem. \"It's just very dissapointing\" why even call if you aren't gonna allow us to fix.",
        "created_utc": 1520889436,
        "upvote_ratio": ""
    },
    {
        "title": "As a former delivery driver,",
        "author": "madman1101",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83xq2j/as_a_former_delivery_driver/",
        "text": "I know it can be hard to remember, but a hefty thank you to those of you who don’t collect coupons. I’ve got one I’ve used for about 2 months now for half off my favorite pizza. I know as a driver I’d sometimes forget, but y’all have been a blessing. Maybe it’s karma for going through delivery hell myself, but. Keep up the good work. \n\nShit now that I posted this you guys are gonna remember now. ",
        "created_utc": 1520882813,
        "upvote_ratio": ""
    },
    {
        "title": "Wtf-I tip $5-$10 each time on my little one person order-why are they so pissy?? Been at this address for yearsssss-I thought I was not tipping enough til I came here-I’ve been over tipping as I always do on tips-these drivers are not pleased.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83xhea/wtfi_tip_510_each_time_on_my_little_one_person/",
        "text": "[deleted]",
        "created_utc": 1520881052,
        "upvote_ratio": ""
    },
    {
        "title": "Need Casual HookUp To-Night",
        "author": "MiaSalina",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83tf5v/need_casual_hookup_tonight/",
        "text": "[removed]",
        "created_utc": 1520843033,
        "upvote_ratio": ""
    },
    {
        "title": "How I got a $20 tip on a $20-ish order, and got the pizza, too",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83t9tr/how_i_got_a_20_tip_on_a_20ish_order_and_got_the/",
        "text": "[deleted]",
        "created_utc": 1520840999,
        "upvote_ratio": ""
    },
    {
        "title": "Any drivers ever get burned out?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83t61f/any_drivers_ever_get_burned_out/",
        "text": "[deleted]",
        "created_utc": 1520839439,
        "upvote_ratio": ""
    },
    {
        "title": "Not Our Fault",
        "author": "Tr2v",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83rsej/not_our_fault/",
        "text": "This pissed me off today:\n\nI take a delivery to a “new” customer (though I’m pretty sure I’ve been there before). Everything is perfect. His 2 medium pizzas look great and I grabbed his 2 liter Diet Pepsi on my way out so it was nice and cold. I get to his house and he says I can keep the change - only $1 and coins, but I’ll take it since I thought it would be a stiff. As I start walking away, he says “wait is this diet?” “Yes, it’s Diet Pepsi.” He then goes into a tirade because he doesn’t want diet and won’t drink diet and he wants regular Pepsi and why the fuck would I bring diet?! “You ordered diet.” I point it out on the receipt. “Just take it back.” I said that was fine and I’d put a credit on his number for the cost of the soda. That wasn’t good enough. He wanted money back now. I was like ummmm I don’t have a POS with me so I’m not sure what your new total would be exactly (because now he wants all of his change, too) so I’d have to round. Nope. He shoved the pizzas back to me and said to take it all away. Ok whatever. \n\nSo I went back to the store and couponed the order out so it wouldn’t be on my costs. Shortly after, he calls and is bitching about getting a Diet Pepsi. The fucking shift manager gives him a $15 credit. No way, Jose. We didn’t do anything wrong. Why should be give free shit to someone for their own mistake?! No. Now I’m convinced he did it on purpose to scam us (common at my store). \n\nI removed the credit and posted basically this post on the wall. Hopefully when he tries to use the credit, he’ll talk to someone with a backbone that isn’t a fucking moron. \n\nIdiots and stiffs. That’s the tale of my Sunday at Pizza Hut. Fucking shit!!!",
        "created_utc": 1520822687,
        "upvote_ratio": ""
    },
    {
        "title": "Have any of you ever tried to claim your mileage on your taxes?",
        "author": "m_walusi",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83qggl/have_any_of_you_ever_tried_to_claim_your_mileage/",
        "text": "I'm about to fill out my taxes in the next couple days. I've kept track of all my gas receipts, my time cards, and the miles I drive while working. Can I claim any of that? We only get 27 cents per mile. But I saw that the reimbursement rate on taxes was something like 53 cents per mile. Could I claim that extra 26 cents? Or did I waste my time. Haha.",
        "created_utc": 1520809773,
        "upvote_ratio": ""
    },
    {
        "title": "How I got a $39 tip on a $12 order",
        "author": "4otie7",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83p60j/how_i_got_a_39_tip_on_a_12_order/",
        "text": "This house consistently tips $1-2\nThey order a regular pie\nHands me a 50 and a 1\nCloses the door before I can ask if they want change No regrets\n\nEdit: They probably thought the 50 was a 20. I feel no guilt",
        "created_utc": 1520798397,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Anarchist performs benevolent BnE",
        "author": "raetwo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83lcfn/pizza_anarchist_performs_benevolent_bne/",
        "text": "I'm out delivering pizzas. There's a double order close to closing time, and I'd never delivered to the first one before.\n\nIt's a little four apartment building right off our (fairly busy, even at 12:30AM) main street and my delivery is in Unit D... which is seemingly the \"basement\" for a lack of a better term. It's got a door facing the outside, so I don't mind, but I park on the driveway on the side of the building and grab my trusty flashlight and my hotbag and book it toward the door. I left my phone in the car as I often do because if i'm getting robbed, I want to have my phone somewhere safe (locked up in the whip) rather than on my immediate person. I've got a spare key under the fender of my car, so I can literally just bolt for it if I have to fork over my wallet or whatever. NBD.\n\nThat's when trouble began: As soon as I drew near, I realized the front door was wide open. Out comes a pupper. Black dog, very energetic and friendly, obviously just wants to play. It sprints out past the door and me into the yard, getting close to the road, and looks back toward me as if I'm going to give chase.\n\nI look back inside, and see the customer *hard* passed out on the couch. I knock loudly, ring the doorbell, no movement. I see two empty bottles of corona, a couple pill bottles, and a bowl sitting in an ashtray with a pack of cigarettes next to it.\n\nMy first thought: \"Shit, is this guy dead?\"\n\nNow, I'm at a crossroads: I'm obviously not waking this guy up through conventional means, and his dog is going to remain outside until I go and get it. I've had all sorts of bad experiences with coming into customer's homes INVITED and I'm super sketch about this whole thing.\n\nWell, time to do the right thing, I decide after a moment of lengthy hesitation.\n\nI open the storm door, go inside and set the hotbag down, set down my maglite and go chasing after the doggo. Grab doggo. Wrestle doggo back to apartment. Receive generous face bath in the process.\n\nOK, so that first crisis is solved, but now I'm inside homie's place uninvited and I have his food and he's *not* waking up from me just talking/shouting at him. I shine my flashlight on his face. Still nothing.\n\n\"Fuck, is this an overdose?\"\n\nIn retrospect: I shouldn't have shined my flashlight on his face, imagine waking up to a stranger shining a light on your face in your apartment uninvited with a bunch of drugs on the table. Wouldn't have been cool.\n\nOK, so if talking/shouting and using my flashlight isn't doing the trick, I decide to check his vitals. Dude is breathing. His pulse is normal. He's not dead. I read the prescription bottles on the table, it's Adderall and Ritalin. Okay, he's probably not ODed on addies and speed, I decide.\n\nIt's then that I notice there's money on the table. I count it out. The full amount of the check, +$5. Someone pulls up behind me in the driveway and begins absolutely laying into the horn, being a complete dickweed.\n\nAgain, a crossroads: If I just leave the food but don't take the money, then I effectively just paid for this dude's food. If I do, and he's pissed, I'll probably get fired. I need to make a decision soon, because otherwise there's going to be a very irate person waiting for me when I go outside.\n\nWhatever. Fuck it, we'll do it live!\n\nI look around, and find somewhere where the food will be out of reach of the dog: On top of a giant speaker. Put the food up, take the money. Twist the lock on the door so it'll lock behind me and outmaneuver the dog to get to stay inside. Bolt out to my car, probably the fastest I've ever moved. Get in, pull out of the way, plug the second delivery location into my Gmaps and start cruising away.\n\nAt this point I start to feel a weird sort of remorse/guilt. Did I do the right thing? If I'm wrong, I might get fired... I decide to call the homie. He picks it up on the first ring, surprisingly.\n\nWhat followed was the single most confusing and awkward 3 minute conversation in my brief history of pizza delivery. I explain how I had to let myself in, I took the money-- but if he needs change I can bring it back-- and put the food up somewhere. He takes a long moment to consider all of this and I can hear the gears turning in his head as he finally replies with a \"Huh?\"\n\nThen he finds his food, confirms the money was for me, thanks me profusely, and then hangs up. Cool. I take the other delivery. It's a stiff. Whatever. As I'm cruising back I get a text message calling me an \"excellent human being\" and telling me he's going to call my manager and tell them how awesome I am. Apparently he's a med student and just got off a 10 hour residency shift, or something to that effect, and basically just blacked out immediately after hitting the couch. The only reason his phone woke him up is because his ringtone is the same as his alarm, and he's been hard programmed to wake up to that no matter what.\n\nI get back, and my manager is like...\n\n&gt;\"I think this customer thought you were hot or something.\"\n\nI didn't bother to explain the situation because I just *know* I would get bitched out.\n\nTL;DR: Saved a pupperino, delivered food, received tip without customer ever waking up.",
        "created_utc": 1520752922,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever delivered a pizza while on your phone?",
        "author": "saugeoden",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83l8ug/have_you_ever_delivered_a_pizza_while_on_your/",
        "text": "It's the first time in my life I've ever seen it happen. The delivery showed up an hour later than they said (which is okay, I understand busy happens) and the driver was on his phone and told ME to hold on multiple times while I was trying to ask him something. Then I tried to get his attention as he was walking away with my copy of the receipt, as he gave me entirely the wrong order. I tried calling the store multiple times only to get told they can't fix the order (I was told this by their customer service line. The only way to get hold of someone was to call corporate), they're too busy and stopped doing deliveries for the night (at 8 pm?)  \n\nBut for real, do people just brush off customers now and deliver while talking to people on the phone?",
        "created_utc": 1520751335,
        "upvote_ratio": ""
    },
    {
        "title": "Old foreign lady.",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83l6x1/old_foreign_lady/",
        "text": "She had a 40$ even order, she paid via credit card so when I showed her the slip to sign she got so confused and gave me 40$ in cash. I kept explaining to her that she already paid and she didn't need to pay me, she didn't understand anything I was saying. So I gave up took the cash and left.\n\nI made my boss refund her credit card and take that order as a cash order. My boss was nice enough to give me 2$ as a tip because the lady only gave me exactly 40$.....\nAnything like this ever happened to you guys?.",
        "created_utc": 1520750511,
        "upvote_ratio": ""
    },
    {
        "title": "I got a $20 tip for a &lt;$15 order",
        "author": "jcs801",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83kpmy/i_got_a_20_tip_for_a_15_order/",
        "text": "yeeeeeee",
        "created_utc": 1520744021,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Delivery Request",
        "author": "SexualRex",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83k0x9/pizza_delivery_request/",
        "text": "Ordered from Papa's and added a [delivery request](https://i.pinimg.com/originals/85/db/ff/85dbff9e634b5d13a5dbcdfd210d8619.png) \n\n&amp;nbsp;\n\nMad props to the drivers who have fun with this sort of thing by indulging idiots like myself!\n\n&amp;nbsp;\n\n*...boil em, mash em, stick em in a stew!*",
        "created_utc": 1520735977,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good tip?",
        "author": "maldahleh",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83j0o0/what_is_a_good_tip/",
        "text": "Sorry if the question doesn’t really fit the sub’s theme, but I thought here would be the best place for a question like this.\n\nWhat would be considered a good tip?\n\nI’ll preface this by saying I’m a student in Canada, in a college town. I rarely order pizza but the days I do, it’s when a 50% promo is happening.\n\nOrder comes to around $10 with tax and delivery and I usually try to tip $7-9 since it’s money I’m saving with the 50% off promo that i would have usually paid plus more plus a tip so I try to give at least a good part of what I save to the driver. I’ll also say store is around a 4-5 minuets drive away.\n\nI don’t usually get a positive reaction from the driver or any reaction at all really, not that I’m expecting one from the driver, but I’ve always wondered if this would be considered a good tip? I’ve always thought of it as good, though is it not as good since the 50% promo cuts down the total value of the order or that there’s larger tips to be made from orders much bigger than mine?",
        "created_utc": 1520725630,
        "upvote_ratio": ""
    },
    {
        "title": "\"Your shoes are untied.\"",
        "author": "Gothym",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83cys3/your_shoes_are_untied/",
        "text": "I got a delivery job a month ago. Typical Friday night for our store. Understaffed and busy as hell. Because of this, I get sent on three-pies often. \n\nSo I get my orders and deliver them in the order that we got them. The last one is to this sketchy part of town (we call it crystal meth cove) to a new customer. I pull in to a yard covered in mud and a terrible excuse for a drive way. I get to the door, customer comes out, and I hand him the pizza. Conversation is as follows:\n\nMe: \"Hi sir. How's your night going?\"\nHim: \"It goes. What's the total?\"\nMe: \"I hear ya. It's $21.95\"\n*Hands over Pizza*\nHim: \"Alright. Here's $22.00\"\nMe: Thanks! Do you need your change?\nHim: No. You keep it. Here's a tip though.\n*He walks back into house and sets pizza down. Walks back up to door.\"\nHim: Your shoe's untied.\n*Shuts door*\n\nI'm still salty about it. Not gonna lie.",
        "created_utc": 1520656335,
        "upvote_ratio": ""
    },
    {
        "title": "The disgustingness of the Back Door Friend",
        "author": "4otie7",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/83985i/the_disgustingness_of_the_back_door_friend/",
        "text": "There’s an old lady that lives in the backyard apartment of a house. She orders 2 pink lemonades and pasta every time and I absolutely dread going here. As you open the gate a sign reads “Back door friends are the best”.. anal innuendo? Once you approach her door you can already begin to smell the stench. However that is nothing compared to when she emerges from her cave wearing the same tattered puke green shirt. Your eyes are immediately drawn to her long, yellow, overgrown toe nails. If that isn’t bad enough, you’re constantly bombarded by the smells of marinating oldness and sunless apartment. Breathing through your mouth only makes you taste the stench.\n\n\nThere are stretches of time where she won’t order for months and everyone at my job thinks she died, and then out of no where you’re back in action with the Back Door Friend. Currently, we’re in a hiatus. Time will only tell...",
        "created_utc": 1520622472,
        "upvote_ratio": ""
    },
    {
        "title": "My most interesting delivery",
        "author": "hobogod1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/838jkz/my_most_interesting_delivery/",
        "text": "Hey, everyone. I have been delivering for about 7 months now, and I figured I would share my story of my most interesting delivery. \n\nI work at a rather \"hut\" shaped pizza place, and it was a normal night. I had a single to a house 3 minutes away, so I thought cool, it'll be quick, and I can get back to prep. The order was for a couple pizzas, and 2 2-liters, I forgot one of the sodas when I first left. As I am walking down the drive way I see this little old lady standing in front of the window clutching money, and looking out. I give her a small wave, so I don't spook her and for her to notice me. I guess she didn't though, because I still had to wake a minute or two after knocking. She asks me to come in to set the food down, and I did. She was old, and this was a lot of food. This is where it gets interesting. This lady was old, like 80s or so, and maybe hard of hearing or a little senile or something. I'm telling her the total, and she is having a hard time hearing and figuring it out. Then this guy walks out of a bedroom on my right, and walks up to her, and gets right next to her ear. I am assuming he was her son, he looked about 40-50, was overweight, and almost entirely naked. He only had on a large shirt, so thankfully I didn't see any wang. They start yelling to each other about who was paying. They just went back and forth asking eachother if they were paying till he walked off. Thats when he told me i left a drink, I checked and I had, I told I would come back. He then went back to the room, and stood leaning over a dresser, kind of presenting his ass. She then handed me the cash she was clutching, and I counted it all out, and tried to give her the change. She could not figure out what I was trying to do, and kept asking what it was. I kept explaining to her, and she just handed it back I'm confusion, so I just took it. It was 5 bucks, good tip. I left, and when I got back to drop off the other soda, he had not moved from his spot at all. It was all so fucking weird. \n\nIt's a bit long, and if my formatting is off i apologize. I'm on mobile. Feel free to post your own weird or crazy delivery stories.",
        "created_utc": 1520617424,
        "upvote_ratio": ""
    },
    {
        "title": "So this coupon thing that used to happen...",
        "author": "TonyDiGerolamo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/838hlw/so_this_coupon_thing_that_used_to_happen/",
        "text": "When I used to deliver, it was a rule that customers HAD to mention the coupon over the phone or we wouldn't accept it.  Kind of like in [today's comic](http://www.thewebcomicfactory.com/comic/tales-of-pizza-the-three-stages-of-job-satisfaction/).  Guess it had to do with ringing it up or something back in the day.  Is this still a thing?  ",
        "created_utc": 1520617016,
        "upvote_ratio": ""
    },
    {
        "title": "People who ask me to bring the pizza around the back",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/836tnf/people_who_ask_me_to_bring_the_pizza_around_the/",
        "text": "[deleted]",
        "created_utc": 1520603746,
        "upvote_ratio": ""
    },
    {
        "title": "Some minor revenge 😈",
        "author": "RU13R",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/835jdp/some_minor_revenge/",
        "text": "So this happened a week ago. My next order is the infamous stiffer, this apartment orders almost every night and you never get a penny. They always pay with card. It was a slow night and nothing going close to it so it had to be a single fml.\n\n I get there and I knock loud because they always take their set time. A minute passes I knock harder, their neighbor comes out and goes back inside. Another minute passes I grab my key chain and knock on the metal, it's so hard the upstairs neighbors come out and go back inside. No one comes out so I proceed to open their back gate and knock on their glass door hard. Another minute passes so I go to my car and give them a call. They send me to voice mail so I leave a message to call the store. I see the guy walking to the door, through their back window. I'm like fuck this guy so I proceed to drive away. He calls me and I ignore the call, not supposed to use my phone while driving haha right? \n\nI get back to the store and the guy calls complaining about his food, I take the call and tell him the driver was there for almost 10 minutes and that we'll send the next driver again but it's busy so he'll have to wait at least 30 minutes. I tell the next driver to take it with his order since it was on the way back, but made sure to tell him to take his order first and drop off my order on the way back. At the end the guy waited over an hour for his food, so I'm hoping he comes to the door sooner.",
        "created_utc": 1520588570,
        "upvote_ratio": ""
    },
    {
        "title": "Better tips from crappy car.",
        "author": "SCOTTIRVINE",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/834j3w/better_tips_from_crappy_car/",
        "text": "Hi there, yall, i currently deliver in an 04 grand am, and I was considering delivering in my fathers [Saturn](https://gyazo.com/a50977e526e07d157edd38d2d86ee6d9) that was in a [crash](https://gyazo.com/3ae778b54b33be8f9429df4afdb6b618). Was wondering if anyone has experience with delivering in a shitty car, and if the tips were better while driving it.",
        "created_utc": 1520575558,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza Bag Question.",
        "author": "XL_Geek",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82vb49/pizza_bag_question/",
        "text": "The company I work at uses pizza bags with a metal frame. The frames are old and were made by hand. I am curious if anyone here uses something similar.",
        "created_utc": 1520488776,
        "upvote_ratio": ""
    },
    {
        "title": "How come people don't check how much their order is?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82nmd8/how_come_people_dont_check_how_much_their_order_is/",
        "text": "[deleted]",
        "created_utc": 1520422435,
        "upvote_ratio": ""
    },
    {
        "title": "Customers who are defensive about their incorrect/incomplete address",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82kbya/customers_who_are_defensive_about_their/",
        "text": "[deleted]",
        "created_utc": 1520385118,
        "upvote_ratio": ""
    },
    {
        "title": "One of the perks of slangin’ pies",
        "author": "theskimo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82ixv1/one_of_the_perks_of_slangin_pies/",
        "text": "[chicago style](https://imgur.com/a/5c6NV)\n\nLet’s face it, we all get tired of our stores’ menu tens eventually. The insiders at my Papa Joseph’s constantly innovate creations to keep things spicy. I’ve tried my hand at Chicago style pizza a few times. This is the best one yet, though I still have a few things to improve on. Not really driver related but I thought I’d share! It’s a shame that I’m the only one eating this, it came out pretty good. I’m surprised how different this tasted compared to our regular pizza. ",
        "created_utc": 1520373131,
        "upvote_ratio": ""
    },
    {
        "title": "If I offer a big tip, what are the chances of someone delivering to a home 20 minutes away from the store?",
        "author": "ILoveToEatLobster",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82h8me/if_i_offer_a_big_tip_what_are_the_chances_of/",
        "text": " I live outside of town, about 20 minutes away on a highway from the nearest chain pizza place.  What are the chances they would deliver to me if I offered like a $20-$50 tip on a 2 or 3 pizza order?  Is that too much? Not enough?  Or doesn't even matter because 20 mins is too far?",
        "created_utc": 1520360367,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza delivery woman gets big tip!",
        "author": "Adventux",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82gtci/pizza_delivery_woman_gets_big_tip/",
        "text": "[Pizza delivery woman gets $1800.00 tip](http://wgntv.com/2018/03/02/chicago-pizza-delivery-woman-moved-to-tears-after-church-honors-her-with-incredible-tip/)",
        "created_utc": 1520357252,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys think this would work in the hood? I'm skeptical.",
        "author": "Malak77",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82ge0b/do_you_guys_think_this_would_work_in_the_hood_im/",
        "text": "https://www.freep.com/story/money/business/2018/03/06/dominos-pizza-technology-app-millennials-ecommerce/373753002/",
        "created_utc": 1520354060,
        "upvote_ratio": ""
    },
    {
        "title": "Well that just happened.",
        "author": "probably_a_whale",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82d3mv/well_that_just_happened/",
        "text": "I work at the pizza slut and this guy ordered a big dinner box. A lot of food. I get to his place and walk up to his house but there's a gate which is locked and no light on. So I set the bag on top of my car to get out the receipt to call the number. I sit down while it's ringing. He tells me I'm at the wrong house- Google maps has the streets flipped and both streets use the same numbers. Easy mistake to make. So I close the door and drive off. \n \nWell when I turn onto the main Street to go just  200 feet west, I see the dinner box fall off the back of my car. I quickly pull over as I realize my monumental fuck up. A truck, which was definitely far enough behind me to see everything which just transpired, ran over the pizza. \n \nThe humiliation when I had to call the guy back to tell him his pizza was run over was too much. Then I had to call the store and explain what happened. I was hoping I could make it through college delivering without having to tell the customer his pizza was run over by a truck. \n \nYou ever get tipped and think \"maybe I don't deserve this one\"?",
        "created_utc": 1520319018,
        "upvote_ratio": ""
    },
    {
        "title": "I traded in one pizza hell for another.",
        "author": "idwthis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82bgbx/i_traded_in_one_pizza_hell_for_another/",
        "text": "Just a bit of venting, I figured this was the best place for it. \n\nI was a manager at a PJ's. Moved to a new state. Ended up getting in at the Slut instead. \n\nHoly shit. It's like moving to a new country. It's culture shock. \n\nOn one hand, hallelujah, there's no veggies to slice and no dough to slap. No more  looking like the Pillsbury dough boy raped me at the end of the night. \n\nBut on the other hand....I miss the dustinator. God help me, I do. And I miss the way they top pizzas. \n\nAnd I miss the people. \n\nThey have this chick, who is apparently in her  20s who I seriously thought was at least 40 at first, training me on how to do shit. \n\nBut oh my god. She is....flighty and flakey and seems to not understand when I ask a simple question. \n\nAnd she seriously freaked the fuck out over the way I pepped a pizza. God fucking forbid on just the  pepperoni pizza I had my pepperoni touching. God forbid I have been ingrained to leave a \"No Topping Zone\" in the center of a pizza. \n\nLook kid, I came from another place that was way more fucking uptight about toppings, so it's gonna take more than a fucking day of breaking that habit. There is no reason to literally yell and screech at me, and then when I say exactly that, but way  nicer, cause ya know gotta not  curse at  the new job just yet, actually just stare  blankly and  say \"I don't understand what you said.\" Seriously? \n\nAnd what gets me is that she's barely been there a month. \n\n\nAnd everyone just let's the phone ring and ring and ring....\n\n\n\n\n",
        "created_utc": 1520301611,
        "upvote_ratio": ""
    },
    {
        "title": "Pizza chain requires to see the card you paid with upon delivery?",
        "author": "LeanBop",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/82aasj/pizza_chain_requires_to_see_the_card_you_paid/",
        "text": "So I just moved up to Ohio for work. It’s a shady town, shady neighborhood. \n\nAnyway, I ordered my boyfriend and I’s usual pies from Dominers. I order online. I paid with his card because I left mine in the truck. We share the same bank account anyway.\n\nSo when the delivery girl gets here, she says she needs to psychically see the card I used to purchase the order with. Okay, weird, but no big deal. (I’m prepared to snatch her if this is a scam and decides to run off lol) Boyfriend grabs his wallet from our bedroom. After I handed it to her, I asked if it was a new policy or something. She checks the last 4 numbers on the card and on the receipt and hands it back. \n\nShe said “yeah, they want us to check now because a lot of people were getting their cards stolen, and people were ordering a bunch of pizza so at Dominers they have us check when people pay with cards.”\nSay what? \n\nQuite a few times I’ve ordered pizza and sent it to my dads work as a surprise for him and all his buddies. I guess I can’t do this anymore if they’re checking the cards upon delivery? It doesn’t really make sense that this would be a nationwide policy change. \n\nLike I said, this isn’t the greatest neighborhood. Maybe it’s just Dominers around here..? ",
        "created_utc": 1520291222,
        "upvote_ratio": ""
    },
    {
        "title": "I've been doing this job for 5 years and finally a customer with big tits answered the door, topless.",
        "author": "Torpid-O",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/829ipv/ive_been_doing_this_job_for_5_years_and_finally_a/",
        "text": "Unfortunately, it was a big, hairy, Italian man. Blegh.",
        "created_utc": 1520285283,
        "upvote_ratio": ""
    },
    {
        "title": "I've been doing this job for 5 years and finally had a customer with big tuts answer the door, topless.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/829d2w/ive_been_doing_this_job_for_5_years_and_finally/",
        "text": "[deleted]",
        "created_utc": 1520284073,
        "upvote_ratio": ""
    },
    {
        "title": "ITT: We list things we hate about delivering pizza.",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/822zl0/itt_we_list_things_we_hate_about_delivering_pizza/",
        "text": "I’ll start.\n\n- People who don’t answer their door or phone.\n- People whose kids sign and only sign.",
        "created_utc": 1520219978,
        "upvote_ratio": ""
    },
    {
        "title": "At least he tipped",
        "author": "DoeHare",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/822yxs/at_least_he_tipped/",
        "text": "Short and simple \n\nGot a 102 dollar order \n\nDude gave me 105 &amp; said “keep the rest” ",
        "created_utc": 1520219789,
        "upvote_ratio": ""
    },
    {
        "title": "I forgot a soda.",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8229vh/i_forgot_a_soda/",
        "text": "So I took a triple, 2 orders had sodas. Diet Coke for one and root beer for the other. On third run, realize I forgot one of the sodas. I’m already far as fuck from the store and decided to chance it and find a store to buy drinks. In hindsight, I should’ve went back to the store. My first stop was a gas station, but it was a military one. Put the drinks on the counter (had to buy 4 20 oz. to equal a 2 liter) and she asks for ID. I’m like uhhhhh I don’t have. Oh sorry you can’t buy. Fuck! So I’m like shit okay what to do. This gas station was like a few feet from the dudes house by the way. I ask a random guy walking out if he can do me a favor and explain my situation. He looks at me like I’m crazy and walks away. Okay thanks asshole.\n\nI end up going to the delivery, telling the guy I’m sorry I forgot his drink and I have to go to a store. End up at a hotel down the road and their shoppette didn’t have root beer. Great. Find a vending machine, end up spending 2$ per drink and buy 5 12 oz. cans. Rush back over to the guys house.\n\nWorst fucking delivery ever.",
        "created_utc": 1520212847,
        "upvote_ratio": ""
    },
    {
        "title": "What do you listen to?",
        "author": "subscorpio85",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/820ub3/what_do_you_listen_to/",
        "text": "Hey all! \nWhat do you listen to while delivering? I’m a huge fan of true crime podcasts, nonfiction, and alt music, EDM, some metal. If you have any recommendations or Apple Music/Spotify playlists please share! Need something new!",
        "created_utc": 1520199967,
        "upvote_ratio": ""
    },
    {
        "title": "God bless you, well-meaning friends of passed-out customers everywhere",
        "author": "meeraage",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81wp8r/god_bless_you_wellmeaning_friends_of_passedout/",
        "text": "Your willingness to tip generously out of your friend's wallet makes those half-hour-after-close deliveries worth it.\n\nHappy Sunday, pizza fam!",
        "created_utc": 1520154526,
        "upvote_ratio": ""
    },
    {
        "title": "PIZZA DELIVERY MAN CRASHES AND STILL DELIVERS PIZZA",
        "author": "sc219",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81w65e/pizza_delivery_man_crashes_and_still_delivers/",
        "text": "Check out this video to see the greatest pizza delivery man in action! Share this so Domino's recognizes his efforts!\nhttps://youtu.be/6Hou8d1So5Y\n\nUPDATE: A COWORKER FROM THE LOCAL DOMINO'S SAID HE DIDN'T CRASH! THE CAR WASN'T HIS, BUT STILL PROPS TO HIM FOR WALKING THROUGH THE STORM!",
        "created_utc": 1520145845,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else ever get hurt on the job?",
        "author": "MoistWalrus",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81w5da/anyone_else_ever_get_hurt_on_the_job/",
        "text": "Last night during dinner rush I was the extra insider until my GM left and I switched to running the store. During dinner rush we ran out of cheese, and I was trying to grab enough to fill the line (3- 35lbish tubs). Not thinking about my form lifted totally wrong and felt/heard a loud pop fron my shoulder. Cut to this morning and I can't move my arm without pain. A doctor told me I can be looking at a torn rotator cuff or labrum worst case scenario.",
        "created_utc": 1520145493,
        "upvote_ratio": ""
    },
    {
        "title": "First day of delivery driving",
        "author": "Lowkey_HatingThis",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81vn4k/first_day_of_delivery_driving/",
        "text": "So not alot really interesting happened, I found out Google maps can be a piece of shit (took me to a totally different apartment complex then the one I was supposed to be). Turns out calling a customer 7 times and banging on their door won't make them answer any quicker than 15 minutes, and drive past a street as narrow as a driveway 3 times before finding the house of a 7 foot tall black man with an hakuna Matata t-shirt (gotta love that ghetto vibe). I also found out I'm not the only socially awkward reject who says \"you too\" when someone tells me to enjoy my food, I had 3 of those last night! Also met one of my fellow driver's, a weird russian man named Russ (fake name) who told me about his kids, that Putin announced Russia launched a new type of rocket, and asked me if I found my stud alright when I went to go piss. According to the guy I went in training with, Russ once asked him after a shift to drive him all the way to New York City (we live on the opposite side of the state). When he told him no, Russ explained he needed to see his wives (plural) and he couldn't take his own car because they could track him. He had a cousin who's a nuclear physicist, and I cannot wait to talk to this legend again.\n\nAll in all, I love it. I get paid $11.75 base rate, plus tips and minus the $20 I used in gas, I made about $16.75 over 8 hours last night. I don't have to wake up super early cause they open in the afternoon (I'm a night person anyways). It's super close to my campus, everyone is relaxed and easy to talk to, funny also, not stuck up like the managers from my last job. It's basically \"jam out to music and drive around, drop off food after 10 minutes, get paid, rinse and repeat\" for 8 hours, which I don't mind cause I like to drive and listen to music.\n\nI'm a little nervous about driving when it's busy, last night was easy (minus the 1-2 feet of God damn overnight snow) because it was late at night for the majority, and everyone was either in bed or in the bars/houses partying and chilling. I could do donuts on the main Avenues if I wanted. But when it gets busy is when I'm really nervous, especially pulling out into main roads and holding up traffic in narrow streets if I miss a house. But it's a small price to pay for a job that's already way better and higher paying than my last ",
        "created_utc": 1520138649,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else make dough for their restaurant?",
        "author": "TAMtheCAT",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81u6ze/does_anyone_else_make_dough_for_their_restaurant/",
        "text": "Any opinions on it? I personally find it pretty grueling for such cheap wages to be honest. It might just be my restaurant but dough days feel terrible.",
        "created_utc": 1520122635,
        "upvote_ratio": ""
    },
    {
        "title": "I’m quitting dominos, and I want to know if this is legal",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81rvjk/im_quitting_dominos_and_i_want_to_know_if_this_is/",
        "text": "[deleted]",
        "created_utc": 1520101050,
        "upvote_ratio": ""
    },
    {
        "title": "Customer orders for him and his girlfriend at a hotel at midnight. Says they haven't seen eachother in six months and he seems super happy. Unfortunately their hotel had no ice for their alcoholic beverages so he asked me to save the day.",
        "author": "IEATTURANTULAS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81rc2y/customer_orders_for_him_and_his_girlfriend_at_a/",
        "text": "He asked me if I would go to the nearest convenience store to get a cup of ice. He handed me $15 bucks on top of the pre tipped $3. He had just move to my town and had no idea where he could get ice at midnight. This hotel sucked by the way, so it's not surprising they had no ice. \n\nI thought about it and told him no problem. 10 minutes later I come back with a heaping cup of ice and he is ecstatic that he can chill his drinks. We talked for a bit because he seemed like a genuine nice dude. I could tell that his night may have been ruined if they were forced to drink warm alcohol. \n\nSo I saved the day and made a friend last night. He even mentioned he needed a job, being new in town so he might go apply at my place. Even though it was way past our closing I felt like I did a good thing. Although with this being a hotel at midnight we all know the risks involved. Turned out to be a cool night.",
        "created_utc": 1520096323,
        "upvote_ratio": ""
    },
    {
        "title": "I got escorted off property by a turkey",
        "author": "Driddle07",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81qdt9/i_got_escorted_off_property_by_a_turkey/",
        "text": "I apologize for any formatting I'm on mobile. \n\nI deliver in a fairly rural area which can be a lot of fun for an animal lover like me. Today I walk up to the house and see they have a ton of birds, turkeys, chickens, and the like. Well one turkey (who I later learned was a female) followed me up to the door like I've got my eye on you. \n\nI get the pizza delivered nice little tip, they let me pet their dog. life was good, or so I thought. Now mind you the entire time I'm exchanging the pizza and petting the dog this female turkey is there watching me. \n\nI start to walk back to my truck and this turkey is escorting me off the property! I get about half way to the gate to get out to my truck and all the sudden BIG BUBBA APPEARS OUT OF NO WHERE! I've seen turkeys hell I've eaten them before but damn was this a big boy. I don't know much about bird behavior but I do know when a bird is posturing at me to get the hell off his turf. so I put a bit of pep in my step and got the hell out of dodge. \n\nAs I get into my truck I see big bubba climb on the females back for what I thought at the time was turkey murder. turns out big bubba was asserting dominance over me and having sex with one of his women to show me he's the one in charge.  Overall 7/10 would deliver again.",
        "created_utc": 1520086882,
        "upvote_ratio": ""
    },
    {
        "title": "Got my karma today!",
        "author": "smiggie_ballzy",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81q1ht/got_my_karma_today/",
        "text": "So a month ago or so, I delivered to a customer. He had an 8 piece wing, paid cash. Came out to $12.54. He only had 11$ or so, and I was in a huge rush so I was like ughhhh it’s fine bro. Don’t worry about it.\n\nCut to today. Was walking back in the store from a run and some guy flags me down. I’m like thinking who the fuck is this?! He’s like “hey bro a few weeks ago you covered the cost of my wings, just wanted to say thanks.” And he handed me $5.00. I was floored. Such a nice surprise!",
        "created_utc": 1520082703,
        "upvote_ratio": ""
    },
    {
        "title": "Long Live The 'ROO!!!",
        "author": "FBAHobo",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81mn67/long_live_the_roo/",
        "text": "Customer here.\n\nThis weekend's weather shit show reminded me of a similar \"snow event\" a few years ago.\n\nI had relatives in for the weekend, didn't plan ahead, so cooking was not an option (local supermarkets closed early due to the Snow Emergency).\n\nSo pizza it was.\n\nWhen I phoned in the order I was warned of a two to three hour wait on delivery: two of the three drivers' cars were out of commission and stuck in the snow / ditch.\n\nSo pick-up it was.\n\nWhen I arrived, the place was chaos incarnate, with two drivers working in the kitchen.  I was the only customer, and they knew me.  And how do I put this gently: in the kitchen, it wasn't just the pizzas getting baked that night.\n\nEvery minute or so someone would howl, \"ROOOOOOOO!!!\" Others would reply, repeatedly, in slightly lower voices, \"Roo…  roo roo roo,  roo roo roo roo roo…\"  Like some sort of Pizza Primates in a rainforest.\n\nOK.  \n\nThen there was a very concerned sounding, and much louder and abbreviated, \"ROO!!!  ROO!!!\"\n\nAnd as the others joined in with a cacophony of, \"ROO!!!\", a beast that was more rust than steel could be seen emerging from the blizzard:  a 2004 Eddie Bauer Green Subaru Outback with giant snow tires backed up to the door.\n\nIn addition to being the only driver left to deliver, ROO Dude rescued the other drivers and moved their cars to avoid getting towed.\n\nAnd that is the legend of, 'The Night of The ROO'.  Long live The ROO!!\n\n\"ROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!\"\n\n",
        "created_utc": 1520051037,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with the nights that you’re just dead tired behind the wheel.",
        "author": "--sheogorath--",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81lrx1/how_do_you_deal_with_the_nights_that_youre_just/",
        "text": "I’m fairly sure we’ve all had those days. In the bright light of the restaurant you’re find, but then in your car with the darkness broken by street light and headlights you’re just beat, feeling like you’re about to nod off. What do you do to deal with it? Sadly caffeine just doesn’t fix the problem for me. ",
        "created_utc": 1520045282,
        "upvote_ratio": ""
    },
    {
        "title": "Customer didn’t answer their door or phone, left me standing outside in the cold for 15 minutes. And proceeded to stiff me.",
        "author": "dalt8696",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81klqo/customer_didnt_answer_their_door_or_phone_left_me/",
        "text": "[Okay then...](https://youtu.be/Tz1FjI3E_6I)\n\nAt least keep an ear out for when your driver is knocking or ringing your doorbell. Don’t just leave me outside, fucking freezing.",
        "created_utc": 1520037998,
        "upvote_ratio": ""
    },
    {
        "title": "Stay strong all in the New England region",
        "author": "hornicorn-",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/81hxu8/stay_strong_all_in_the_new_england_region/",
        "text": "Shits getting crazy out there. Stay safe. ",
        "created_utc": 1520023225,
        "upvote_ratio": ""
    },
    {
        "title": "Moving to work inside the shop",
        "author": "ipoop4urhealth",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/819yru/moving_to_work_inside_the_shop/",
        "text": "I’ve been delivering for about a year and a half and I have been wanting to move to a position inside the shop. I know it will be a pay cut but I need something different and want to get experience with other things. I talked to the owner about three months ago and he thought that would be a great idea. The only thing was they would need to find a driver to replace me.  About a month ago they found a new driver but are still dragging their feet to get me inside. I approached management again and said they needed another driver, even though they have a new one. I’m kinda fed up and threatened to quit ( actually I put my three months notice in lol I know). I was wondering if anyone else has experience with moving inside? Or being dicked around with switching positions? ",
        "created_utc": 1519947887,
        "upvote_ratio": ""
    },
    {
        "title": "Potentially, how much money could I make?",
        "author": "KissArmy1986",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/816std/potentially_how_much_money_could_i_make/",
        "text": "If this is against subreddit rules please delete. \n\nI’m looking for new career opportunities.  I’ve worked retail management with one company for over 12 years. I’m just thinking about new career possibilities.  Could pizza delivery with a chain restaurant be a lucrative option?  ",
        "created_utc": 1519923941,
        "upvote_ratio": ""
    },
    {
        "title": "Question about tipping online",
        "author": "WVPrepper",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80zhkb/question_about_tipping_online/",
        "text": "I order from a pizza place that is part of a chain. They have a website, I accrue bonus points, and I always google discount codes before ordering.\n\nI do not often carry cash, and the website offers a place to fill in the tip amount and have it charged to the credit card used, or to Paypal.\n\nThis seems easy, and I usually do it, but a few weeks ago, on an ordinary weeknight, I placed my order, added a 20% tip, and then submitted the order. The next page told me that it would be TWO HOURS before my pizza would arrive.\n\nI thought it was a mistake, but it wasn't.\n\nMy BF said I should not have tipped online, and should have had cash on hand. He feels like the driver would have tried harder if the tip was not \"in the bag\" but I do not know. If I had not added the tip online, the driver might have taken LONGER, thinking I did not plan to tip at all.\n\nThoughts?\n\nWill I get better service if I tip online, or at the door?\n\nBONUS QUESTION (for those who work for \"PJs\") what is the deal with the \"$2.99 surcharge for priority delivery\"? My delivery time is generally 20-30 minutes, which I find acceptable.",
        "created_utc": 1519851136,
        "upvote_ratio": ""
    },
    {
        "title": "What a dumbass I was...",
        "author": "notaliseliz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80usmo/what_a_dumbass_i_was/",
        "text": "When I was 16-17, late 80s, I was a delivery driver for a small pizza place in the shady part of a small town. We didn't even have a restaurant, just delivery. I was the only girl on staff and I enjoyed my job.\n\nOne night the other guy on deliveries came back and said he had just been robbed. The boss called the cops and they took the description of the two guys who robbed my colleague at gun point. I listened to this exchange, then went out on a delivery. As I was passing the park I saw two guys who fit the description. In my stupid 16 year old head I thought I could be a badass and get my friend's money back somehow. I stopped my car and yelled at the guys, asking them what color their hats were. These two big black guys came over and were really confused as to why this crazy white girl was yelling at them about their hats. Luckily nothing happened because they obviously weren't the guys who robbed my friend, but it could have been a real ugly situation. I never told my boss what I did because I guess I knew how stupid I was.\n\nTwo nights later the robbers came into the pizza place with guns, made us get on the floor and took all our money and stuff. I remember how absolutely pissed off I was, and I screamed that I actually worked for that money. My boss yelled at me to shut up. I had absolutely no danger filter.\n\nI ended up quitting the job because my boss started sending me to deliver at a crack hotel at night and that was way too scary for me. My danger filter finally kicked in.",
        "created_utc": 1519810588,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale Of Pot Granny.",
        "author": "HappyDaCat",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80tnp8/the_tale_of_pot_granny/",
        "text": "Gather 'round children, while I tell you the story of Pot Granny. I work as a delivery driver for a service that would run errands for you. Normally, it's restaurant orders, but we also commonly get orders for groceries or snack runs from pharmacies.\n\n&amp;nbsp;\n\nSo when I got an order for $50 worth of snacks, I figured that I *had* to be delivering to either a house party that had run out of snacks, or some college kids getting high. No big deal, do what you want, it's not my job to get people in trouble.\n\n&amp;nbsp;\n\nSo I get the food, and start making my way to the address, and the first thing I notice is that this is a *nice* neighborhood. The kind of place where well-off old people go to be near the city, but not so close as to be uncomfortable. The youngest people I see out and about have to be at least 50.\n\n&amp;nbsp;\n\nI arrive at the destination, and it's a nice house, with a nice lawn, and a nice garden, you get the idea. I bring the food up to the door, and knock. I can hear shuffling inside, and after a moment, the door is unlocked to reveal... An old lady, wearing a pink fuzzy bathrobe, holding a blunt in one hand. \n\n&amp;nbsp;\n\nI'm stunned for a moment, but I manage to introduce myself, and give her the food she ordered. As I'm doing so, I look past her to see two other old ladies sitting on a couch. On the coffee table near them is an impressively sized bowl of pot, and a board-game. On the floor is a standard poodle, which is either really well trained, or high as a kite, I'm not sure which.\n\n&amp;nbsp;\n\nSo I get the food inside the house, and as I'm turning to leave, Pot Granny speaks up...\n\n&amp;nbsp;\n\nPot Granny: \"Want some for the road?\"",
        "created_utc": 1519796549,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most unique or expensive car you've seen a fellow pizza delivery person drive?",
        "author": "VapetheVHS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80t9zm/what_is_the_most_unique_or_expensive_car_youve/",
        "text": "Inspired by [this post on r/Autos today] (https://www.reddit.com/r/Autos/comments/80qjeo/under_30_seconds_or_its_free/), where a guy is delivering pizzas in a Lamborghini.\n\nIf you've got any context as to why the person was driving such car, I think it would make for an interesting story.\n\nAlso makes me wonder if having an expensive car leads to lesser tips due to perceived wealth, or better tips because the customer is impressed. Any insight?\n\nThanks!",
        "created_utc": 1519792555,
        "upvote_ratio": ""
    },
    {
        "title": "Random employee signs for $650 order and tips 0. No, fuck that.",
        "author": "IEATTURANTULAS",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80oh7i/random_employee_signs_for_650_order_and_tips_0_no/",
        "text": "I called the lady that placed the order and asked her if she wanted to leave a tip because her employee wrote zero. She said, \"Oh absolutely! Put 30!\". So I did. \n\nFuck random employees signing for big orders.\n\nEdit : For the record, I do not regularly call back customers who don't tip. This was a certain situation in which I honestly felt like the order placer wouldn't tip zero. It was very bizzare. And the fact that she said 30 so quickly makes me think she had that tip in mind the whole time. ",
        "created_utc": 1519754152,
        "upvote_ratio": ""
    },
    {
        "title": "This made me giggle.",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80lsu6/this_made_me_giggle/",
        "text": "Which one of y'all did this XD....\nhttps://imgur.com/gallery/TQkxp",
        "created_utc": 1519731673,
        "upvote_ratio": ""
    },
    {
        "title": "\"This pizza is no!\"",
        "author": "Fitzynator42",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80c3x8/this_pizza_is_no/",
        "text": "Greetings, my fellow Pizza-ists! I have recently started work at a nice enough pizza chain in good old Australia, and my goodness, there have been a few good ones so far. This particular one happened just last week...\nI shall be Me, on the phone, she shall be Her on the other end of the phone.\n_____________________________________________________\n\nMe: Hello, [Company name and location], my name is [me], how can I help you?  \nHer: Do you know me?  \nMe: I'm... sorry, what?  \nHer: Look, I want a pizza - now.  \nMe: Okay, [This is where we go through the generalised 'taking the order' phase] And that'll be [cost].  \nHer: Fine, sure, whatever.  \n   Later, she rings up again, having had the pizza delivered to her...  \nHer: THIS PIZZA IS NO!  \n   That's right, peoples. It is no.  \nMe: I'm sorry, could you please elaborate?  \nHer: It is no! IT IS NO.  \nMe: How is it... no...?  \nHer: It has anchovies on it! I don't want them on it!  \n   I look around for the docket, which has absolutely nothing written on it about no anchovies. I am already dreading having to explain to this lady that we are not psychic, and that we did make the pizza correctly, you did not order it correctly.  \nMe: Well, I'm looking at the docket right now, and I'm afraid you have not indicated that you did not want anchovies.  \nShe: Yes I did!  \n   She says in a somewhat unsure fashion  \nMe: I am sorry, but both the docket and my memory of your order - which I shall point out that I am the same person you spoke to earlier - both say nothing about a lack of anchovies.  \nHer: What difference does that make? I don't want them, fix it!  \n   I am now somewhat done with this, and there are other phones on hold.  \nMe: Look, if you really want to, you can get another pizza. It will take 15 minutes to cook and no less. If you want this one delivered too, it will take a grand total of 45 minutes. Are you certain that you can not simply... take the anchovies off the pizza?  \n   Complete silence for a few moments, then:  \nHer: Shut up.  \n[CLICK]  \n  \nAnd to this day, I do not understand a) why it did not occur to her earlier to remove the anchovies by herself and b) why it is suddenly made 'no' by the presence of removable anchovies.\nI hope I haven't bored you all.  \n  \nHave much many a good!",
        "created_utc": 1519640999,
        "upvote_ratio": ""
    },
    {
        "title": "I'm pretty sure I saw a dead body while on delivery.",
        "author": "TakerFoxx",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80c0ar/im_pretty_sure_i_saw_a_dead_body_while_on_delivery/",
        "text": "I've been delivering for almost seven and a half years, so I've seen some weird shit. But even so, this was a new one.\n\nSo there I was, on my way back to the store when I stopped at an intersection. And as I was waiting for the light to change, I happened to glance to my left. There, lying lifelessly in the middle of the street, was a man. There was no blood or obvious signs of an accident, but he also was clearly not going anywhere, and I had a sinking feeling that he was dead. It looked like he had been jaywalking and gotten hit. However, as there was already a few people gathered around checking on him and calling the police, I went about my way.\n\nAs soon as I got back to the store, I heard the sirens. I didn't have to wonder why.\n\nLater on, while making another delivery to that same neighborhood, I saw that the police had blocked off that entire block with flares in all directions. That was when I knew that the poor bastard hadn't made it, as if he had simply been injured they would have just loaded him into an ambulance and taken him to the hospital.\n\nSo...yeah. No real payoff or moral to this story, save that roads are dangerous and it's real easy to take that for granted. Poor guy.",
        "created_utc": 1519639655,
        "upvote_ratio": ""
    },
    {
        "title": "Ever have a car stolen?",
        "author": "VenusSmurf",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/80axh7/ever_have_a_car_stolen/",
        "text": "I should start by pointing out that I have nothing but respect for the people who deliver pizza to make a living. It's a hard job, and you bring joy to everyone who likes pizza. However...\n\nI was at my local college the other day, and a girl drove up with an entire car filled with pizza. There were probably well over 50 pizzas in that car, and of course only two people came out to get them. The delivery girl was genuinely nice about it and offered to help carry them in, which she did. \n\nProblem is, she had doubled parked, and she left the keys in the car, engine running, windows down, doors unlocked. \n\nThis did not go unnoticed.  After just a minute, a guy \"casually\" walked over, doing that so very obvious head swivel to see if anyone was around. I shouted at him, he bailed, and not even two minutes later, this repeated. I finally just went and stood by the car until the girl came back.  \n\nI'm sure most drivers know better than to do something like this, but it did get me wondering. Have any of you ever had a delivery car stolen? \n\n*If this is the wrong place for this post, please just let me know, and I'll remove it.\n",
        "created_utc": 1519626371,
        "upvote_ratio": ""
    },
    {
        "title": "Do you guys compete for tips?",
        "author": "FaithlessHeartless",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/806eib/do_you_guys_compete_for_tips/",
        "text": "Just wondering of you guys do that too. Ironically I only compete for tips with my boss who takes deliveries if it's super busy,\nThe only other driver is my fiance and we share a bank account already so it's all going the same place...",
        "created_utc": 1519583912,
        "upvote_ratio": ""
    },
    {
        "title": "Dominos online orders",
        "author": "Wilson2424",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/803yn5/dominos_online_orders/",
        "text": "Why is the comment section limited to 35 characters? Ordered pizzas for my son's birthday party at the gym at the local park. Call when on the way was about all I could get in the box.",
        "created_utc": 1519558441,
        "upvote_ratio": ""
    },
    {
        "title": "What's an actual normal tip?",
        "author": "darthnachoz",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/802dcj/whats_an_actual_normal_tip/",
        "text": "Hey guys, not a driver, just an avid eater of pizza. \n\nI'm seriously just looking for someone to tell me what a normal tip is for a pizza delivery. I pride myself on being a generous tipper at restaurants, but I have past server experience so I at least have some context in that sense. Delivery to my place is a pretty easy drive, I don't order complicated shit, and I never complain and/or get free anything....cuz, ya know, I'm ok with paying for the food I order. My average order is usually about 20 bucks before delivery fee. What is my driver expecting? What makes him/her leave my house thinking I'm a valued customer and not some asshole?",
        "created_utc": 1519534597,
        "upvote_ratio": ""
    },
    {
        "title": "\"I am a connoisseur of pizza!\"",
        "author": "shellythelast",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/8010eh/i_am_a_connoisseur_of_pizza/",
        "text": "Before I relate this story to you, I just want to give a big shoutout to almost every other customer I have for not being like this. \n\nI got this phone call towards the tail end of my shift today. \n\nMe: Thanks for calling Dominopes in X this is Shellythelast would you like to try one of our specials tonight?\n\nHer: Yeah I need to order delivery to 123 Street Blvd.\n\nMe: Alright what can I get you tonight?\n\nHer: I want a medium super thin crust with cheese and sausage and an extra large super thin crust... but wait, your thin doesn't come in that size, *does it?*\n\nShe said that last bit with a bit of sass in her tone but I ignore it because I can't imagine a reason she might be upset already.\n\nMe: No, sorry ma'am, our thin only comes in medium and large. \n\nHer: That doesn't make sense. If you can make thin crusts in medium and large why can't you make them extra large?\n\nMe: Well, our thin crusts and gluten free crusts come to us pre-made, but we do slap out the hand-tossed, pan, and brooklyn style crusts by hand. The Brooklyn is-\n\nHer: Oh so you're saying that you can make one after you just said you couldn't do anything.\n\nMe: ... Uh, no ma'am, we-\n\nHer: Why can't you slap out a thin crust with the same dough?\n\nMe: If we made something as thin or thinner than our thin crust then it would likely pull apart.\n\nHer: *Really?*\n\nMe: Yes, really.\n\nHer: Well I'm from Chicago, and I am a connoisseur of pizza, and we only eat the thinnest crusts. And blah blah blah (she goes on for a while about this point, but I have stopped caring)\n\nMe: I can give you an extra large Brooklyn style crust, ma'am. It's the thinnest we offer in that size. \n\nHer: I don't *want* a New York pizza, I want a *Chicago* pizza. Do what you can.\n\nAt this point I'm just prepared to ring her up for a brooklyn and call it a day.\n\nMe: What would you like on your extra-large, ma'am?\n\nHer: Sausage, onions, pepperoni, and green olives. *Oh wait, but you don't have green olives, do you?*\n\nShe says this with the same tone she used earlier for the XL thin crusts.\n\nMe: No ma'am, I'm sorry, we only have black olives.\n\nHer: Why?\n\nWhat I want to say: Well when I founded this franchise at the ripe old age of 1 year old, I decided that green olives are the food of the devil and that allowing them past our doors was welcoming Satan into our hearts, and we just can't have that.\n\nWhat I actually said: I really wouldn't know ma'am, it's not a decision I make. Would you like bla-\n\nHer: No, I don't want olives then.\n\nMe: Alright, can I get you anything else tonight?\n\nHer: You can go ahead and read my order back to me, very slowly.\n\nMe: Okay, I got you down for a medium thin crust-\n\nHer: *Super thin!* I want it thinner than it usually comes!\n\nMe: Ma'am, as I already told you, they come pre-made and we can't-\n\nHer: Roll it out.\n\nMe: Ma'am, they're like tortilla shells, trying to go over them with a roller (even if we had one in the store)- \n\nShe then starts launching into a tirade about how dissatisfied she is and how she is the one paying for this pizza and we should make it exactly how she wants it and yadda yadda yadda. At this point I'm at my breaking point. I'm not a naturally confrontational person, at least not over the phone. So I do something I haven't had to do since the first week I worked here almost 6 years ago.\n\nI held the phone out, her still audibly ranting about her superior pizza intellect, and begged my boss to handle it. \n\nAfter another solid five minutes of her fussing and arguing about her pizza with my manager, she apparently started screaming and cussing, which we used as grounds to hang up on her. \n\nBy now she has called back three times, and each time has been about the same.\n\nTo all of you in Chicagoland, I love you and your amazing pizza. That deep dish is divine and worth every minute you have to wait.\n\nBut even in Chicago, if you call up a Dominopes, they won't be able to thin out your thin crust more than it already is. I promise. ",
        "created_utc": 1519520163,
        "upvote_ratio": ""
    },
    {
        "title": "PSA for customers ordering in bad weather",
        "author": "hardhitsscott",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/800ymv/psa_for_customers_ordering_in_bad_weather/",
        "text": "If you order in snow or pouring rain or otherwise shitty conditions, if you stiff your driver, it is what it is. But do yourself a favor and DON'T mention the weather. We already know the exact weather conditions. All you've accomplished is crossing over from \" Random stiffer\" territory into \"All-World asshole who will be remembered\". Some drivers have long memories and evil sides. Thank you, and I hope your day is going better than mine.",
        "created_utc": 1519519675,
        "upvote_ratio": ""
    },
    {
        "title": "“Wow that was fast!”",
        "author": "tier-1",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zy1zt/wow_that_was_fast/",
        "text": "Anyone else hear that a lot from customers? They’ll often have to go back inside to get cash because I arrived quickly after they ordered and they haven’t gotten their money ready yet. Even if it’s late or I have to stop because I can’t find the street customers still tell me I got there fast. ",
        "created_utc": 1519493484,
        "upvote_ratio": ""
    },
    {
        "title": "Back to delivery today",
        "author": "idontvapebro96",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zxaz9/back_to_delivery_today/",
        "text": "I haven’t delivered a pizza since June, got a new job at an actual chain with a number of employees. The one thing I’m actually excited for is having cash at the end of every shift again (even if it’s just tips idk if I’m getting paid off the books yet I doubt it)  wish me luck",
        "created_utc": 1519486759,
        "upvote_ratio": ""
    },
    {
        "title": "Quick Question",
        "author": "Joey566578",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zvsqa/quick_question/",
        "text": "I got promoted to a shift lead position just about 2 months ago. Ever since then I have been to 5 different stores to help them out(not all at once, that would be crazy) while I still work at my home store. \n\nAll the GMs say that I do an excellent job. I've also helped out my DM with a few projects while I was a driver and after I got my promotion. \n\nI've thought about asking for a raise, but I've heard that they are pretty rare. Would it be a better idea just to wait for another promotion then or should I go ahead an ask for it?",
        "created_utc": 1519467495,
        "upvote_ratio": ""
    },
    {
        "title": "Quick question/advice needed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zvi14/quick_questionadvice_needed/",
        "text": "[deleted]",
        "created_utc": 1519462731,
        "upvote_ratio": ""
    },
    {
        "title": "Kind of a rough first day",
        "author": "splickedyliit",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zvewd/kind_of_a_rough_first_day/",
        "text": "Hello, fellow drivers! I am glad to say that after working for months as an insider/CSR at Domino's, I have evolved into a driver. Well, I'm going to be more of a hybrid employee (some days insider, some as a driver). I made the switch mainly for the following reasons:\n\n* More freedom: relaxing car rides, music, don't get bossed around as much\n* Maybe make some more $$$ &amp; bring home some cold hard cash each night, seems like the better position for part-time work\n* Inside was getting kinda boring: once you've made around 1,000+ pizzas you start to look like one lol (Also, you get those hecka smelly make-line hands at the end of every shift. Insiders know what I'm talkin' about)\n* Mostly short, to-the-point interactions with people (Call me Mr. Introvert)\n* I get to explore my city and learn it: oh boy I'm having trouble learning it\n\nAnyways, today was my first day and it was just as rough as my first day as an insider in terms of the learning process. I clocked in, went on a couple of ride-alongs with fellow drivers to learn the ropes and was surprised by how they knew every location by heart. After that, I was sent out alone to fend for myself - uh oh. It was flustering to say the least. As one might expect, I got hella lost on some runs. I felt really bad/embarrassed bothering customers by calling and having them give simple directions many times as I drove in circles (my sense of direction is so bad). Luckily they were very understanding when I mentioned it was my first day on the new job. From my experience today: House addresses = easy ... apartment complexes = Bermuda Triangle for drivers. Other than my struggle/stress of busting 12 U-turns, circling the block 5 times and letting the customer step out in the cold to find me for some deliveries, I like the job so far and see myself doing this through college. I just hope I'm able get better at knowing my area.\n\nI also wanted to mention I used Waze to GPS all my runs which is probably not the best. Let me know of any apps I can use that would make it easier on me. Feel free to leave any newbie advice and/or share your experiences when first starting. Hopefully my second day is better!\n\nSincerely, \nNewbie Driver.\n\nP.S. I almost dropped my car keys into a storm drain.\n",
        "created_utc": 1519461301,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else feel stuck because of how much they make?",
        "author": "joyofmotion",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zs8sv/does_anyone_else_feel_stuck_because_of_how_much/",
        "text": "Its always very busy at my store. My 40hr weeks pull around 2500$ a month. At 24, any other job i'm \"qualified\" for usually only pays around 12$ an hour at most. I feel stuck because if i leave for something else il have to take a huge pay cut. Has anyone else experienced this?",
        "created_utc": 1519426248,
        "upvote_ratio": ""
    },
    {
        "title": "Arena in my delivery area ordered 360 pizzas to resell for a Christian rock festival last night.",
        "author": "Joe_Rogan-Science",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zrcp8/arena_in_my_delivery_area_ordered_360_pizzas_to/",
        "text": "I ended up getting stuck with 3 separate trips over there, 90 small pizzas each, so 270 total.  The order got a $1600 bulk discount and ended up being ~$1000.  On every fucking trip I took over there, I filled up every inch of space in my tiny truck cab, and on every fucking trip I got $0.00 for a fucking tip.  The employees and owner offered me no god damn help carrying in the hot bags, and had the fucking gall to stiff my broke ass every motherfucking time.\n\nTL;DR- Fuck you Arena and fuck your cheap ass manager and owner and fuck not getting a tip for carrying in a metric shit ton of pizza.\n\nEdit: took the arena name out\n\nEdit 2: It was the venue that stiffed us, not the ministry people",
        "created_utc": 1519418972,
        "upvote_ratio": ""
    },
    {
        "title": "Sludge Dread &amp; The Stinky Porn Dungeon",
        "author": "KrimeFyta",
        "url": "https://www.reddit.com/r/TalesFromThePizzaGuy/comments/7zng6j/sludge_dread_the_stinky_porn_dungeon/",
        "text": "At our store, there's a gentleman we deliver to, and his name rhymes with \"dread.\"  I once took a delivery to his apartment, carrying 40 plain chicken wings, an accompanying 5 bleu cheese cups, and two 2-liters of Diet Coke(R).  I often get excited about delivering the 40-piece, because I'm always happy to serve a customer who placed an order worthy of Asgaard.  But this 40-piece was devoid of sauce.  No passion, no soul!  In this case, I was interested in meeting the blasphemer who ordered a pile of sauce-less wings.\n\nThe apartment buildings were a bunch of closely-built duplexes, nothing that seemed cheap or derelict--though certainly not prestigious.  I get to Dredd's apartment, and knock on the door.  It sounded like people were talking in there, and after a minute or so I hear someone holler, \"Come in!\"  I thought there might be a gathering of folks who were ready to throw down on some bird meat--my kind of people, salt of the earth--so I opened the door and walked inside.\n\nThere were two things that assaulted my attention, and I don't really remember which one got there first.  It might have been: *A.)* the blaring, hardcore pornography playing on the flat-screen; or perhaps it was *B.)* the reeking smell of urine, neglect, and wet shame.  My nose is not easily offended, not by any stretch... but this place was straight-up foul.  I imagine it probably smelled like a crime scene in there.  As I forcibly broke my gaze from the pretty lady getting railed reverse-cowgirl, I witnessed Dread hobble into the living room.  \n\nYou know those pictures of Steve Bannon where he looks like a corpse?  Dread looked like an older version of Steve Bannon, but with a short, gray beard and glasses.  Dread wore a well-worn bathrobe.  I mean, this bathrobe had been through it all.  I would put money on it being stolen from a museum.  Dread had ankles that looked like they had been inflated, and he hobbled from behind a walker--so I couldn't very well just hand him the meat and sugar water and tell him to enjoy his porn.  I walked in there, breathing the rotten air, and doing what I could to ignore the loud sex.  I unbagged the chicken, and set everything on his messy kitchen table.  I gave him the credit card reciept to sign, and he finally remarks, \"I guess I could've turned off the tv.\"\n\nBear with me here, delivery comrades.  I placed all my eggs in the basket of getting a huge shame-tip.  I figured I'd play my customer service card, and put him at ease a little bit.  So no, I didn't run out.  I didn't tell him to fuck off.  I didn't tell him he was getting banned for life.  I tossed him a friendly, \"Yeah, looks like you're in the middle of an educational film.\"  A small chuckle, possibly a courtesy chuckle.  Maybe a shame chuckle.  I grabbed it (yes, with my bare hands, I know) and quickly escaped back to my car feeling a little horny, a little nauseous, and kind of pissed.  The receipt--which was suprizingly dry and unfragrant--revealed that I had been stiffed.\n\nI got back, told my GM what had happened, and she had an amused laugh.  She did not get angry.  She did not ban him.  And if Dread doesn't get banned, what's to stop me from going back there?\n\nThat's what happened, maybe two months ago.  I had forgotten Dread's name, and where he lived--actually pretty uncommon for us delivery folks, I know.  Repressed memories, perhaps.  I was knocking on Dread's door, getting pissed that no one was answering it.  I fumbled with the pile I was carrying so I could fish out my phone and call the bastard, and in doing so, dropped my viking pen on the ground.\n\nJust a second here--my viking pen was fucking cool.  It was plastic, and painted to look like pewter.  It was big, heavy, and the thought of stealing it occured to no one.  People remembered me by the pen I gave them to sign their receipts.  People loved that pen!  I loved that pen!  And then I drop it outside of Dread's apartment.  I pick up the pen, immediately find that the pen-tip was irreparably forced up inside the shaft, and then I have the ba-jeezus scared out of me when the door suddently swings open.\n\nAnd there stand Dread.  In his bathrobe.  And this time, he's done a sloppy-ass job of closing it.  \nAnd there hangs Dread's pink scrotum.  Under his bathrobe.  \n\nPerhaps--by breaking my viking pen--Odin himself attempted to send me an omen.  Maybe the All-Father was trying to warn me of an evil presence.  Dread choked out, \"Sorry if I startled you,\" in a voice that sounded like an anthropomorphic pile of gravel.  As I stood next to his messy kitchen table while he fumbled for another pen, I became wistful for the porn.  Maybe it was that noble, generous woman who graciously bounced on that enormous phallus that distracted me from his blushing, flopping genitals the first time?  The reeking stench of Dread's lair was definitely more powerful without that angel to guide me.  This time I was alone with Dread, and his horrible, swaying nutsack.\n\nI arrived back at Slobbino's HQ, and once again inform the GM that I'd been back to visit Dread.  This time I leaned on her to ban him, and informed her that The Lord of Asgaard personally recommended this course of action.  The GM did this weird, mousy-cute-girl thing, and smilingy declared that she didn't know what to do.\n\nI have since found out that multiple other drivers have stories about Dread.  One of my siblings-in-arms has seen him answer the door with his bathrobe totally open.  Another fellow driver reported to me that he saw clumps of shit on the carpet of his apartment--and no evidence of a dog.\n\nOur GM has not the cajones to ban anyone short of our employees getting stabbed.  I wonder how long we'll continue delivering to Dread's stinking porn dungeoun until he dies in there.  I wonder if his reeking corpse would make much differenct to the stank of that place.  I wonder if Round Table is hiring...",
        "created_utc": 1519386005,
        "upvote_ratio": ""
    }
]