[
    {
        "title": "Never squander a good outage (and how to train a PFY)",
        "author": "Universal_Binary",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k4ad4/never_squander_a_good_outage_and_how_to_train_a/",
        "text": "After some years as a PFY and sysadmin, I got older, the gods ~~got revenge~~ smiled on me, and I became the boss.\n\nI had a number of PFYs (Pimply-Faced Youth, young/inexperienced in IT) over time.  They were all good sorts, but naturally inexperienced.\n\nWhat are the \"rules to live by\" I had to ~~beat into the heads of~~ explain to almost every PFY?\n\n1) Check the simple things before you move on to the hard stuff.  **ALL** of the simple things.\n\n2) Question all assumptions.\n\n3) Don't give up easily.\n\n4) When all else fails, see #1.\n\n(People at the beginning of your career: take note!)\n\nWhen a PFY got stuck and came to me for help, I would always ask about the simple stuff before giving other advice.  (You've got to LIVE the rules to internalize them.)\n\nAt the beginning, this would result in many trips back to the equipment, to personally verify that it was plugged in, that the power cable was seated properly (on both ends!), that the network cable was plugged in, etc.  This was always accompanied by a quantity of annoyed muttering.\n\nAs they got better, they would come to me saying, \"The box won't turn on, and I've checked both ends of the power cable, verified the outlet works, etc...\"  You'd know they were about to no longer be a PFY when, in the course of explaining everything they'd checked, they'd realize what the problem was.\n\nSo one day, this happens, with the PFY about mid-way through this experience.\n\n&gt; PFY: It seems like the network's down in all of finance.\n\nThis wasn't the sort of problem I could let go on for very long, so:\n\n&gt; Me: OK.  You go up there and see what you can find out.  I'll see what I can find out from down here, and meet you up there in 5.\n\nPFY goes up.  All I could tell from my desk was the line from the core switch to the finance area had no link.  I went up and met him in the finance network closet.\n\n&gt; Me: What's the story?\n\n&gt; PFY: I hope we have a spare switch.  This one's dead.\n\n&gt; Me: Oh?  What have you tried?\n\n&gt; Proud PFY: I know it's dead, because it won't power up.  The power cable in the back is in tight, and it's plugged in.  Unplugging and plugging it in doesn't help.\n\n&gt; Me: Is it getting power?\n\n&gt; PFY: Of course.  It's plugged into a UPS.\n\n&gt; Me: Have you checked the UPS?  [ a small UPS sat there, front towards the wall, plugs towards us ]\n\n&gt; PFY: It's fine.\n\n&gt; Me: Is it supplying power?\n\n&gt; PFY: Of course.\n\n&gt; Me: Have you VERIFIED that?\n\n&gt; Annoyed PFY: No.\n\n&gt; Me: How about you do that then?\n\n&gt; Grumpy PFY: Fine.  &lt;rustle&gt; &lt;rustle&gt; &lt;click&gt; &lt;beep&gt; &lt;whiirrrrr&gt;  Oh hey, the UPS was turned off.\n\nSo this closet was a general closet, full of filing cabinets and such.  The network gear was on top of one of the filing cabinets near the door.  I came to find out one of the clerks had been working in there, wanted more room, so she unplugged the UPS.  It started beeping, so she just pressed buttons until it shut up.  She then put it in the corner and plugged it back in, nice and tidy-like.\n\nInterestingly, the CFO's office was also on this network segment, meaning I would be ~~burdened~~ honored by a conversation with him.\n\n&gt; CFO: So this was caused by someone turning off the UPS?\n\n&gt; Me: Yes.\n\n&gt; CFO: Why haven't you locked up that equipment?  We should do that right away!\n\n&gt; Me: Good idea!  I'll have a quote on your desk first thing tomorrow.\n\nHandily, I already had that quote.  Because a few months prior, I had gotten a quote for proper network cabinets.  I had submitted it to the very same CFO.  And it had been rejected by the very same CFO (\"that's a lot of money to protect against something that will never happen.\")  So I printed it a second time and put it on his desk in the morning.  It was signed without question this time.\n\nI had a post-mortem with the PFY, after telling him about the CFO.\n\n&gt; Me: So what have you learned?\n\n&gt; Dejected PFY: Always question my assumptions.\n\n&gt; Me: Good.  What else?\n\n&gt; Embarrassed PFY: Check the simple things.\n\n&gt; Me: Excellent.  Anything else?\n\n&gt; Confused PFY: No?\n\n&gt; Me: Never squander a good outage.\n\n&gt; PFY: Is that one of your rules to live by?\n\n&gt; Me: It is now.\n",
        "created_utc": 1526564067,
        "upvote_ratio": ""
    },
    {
        "title": "Sales be selling.",
        "author": "MH3ndr1ks",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k47j9/sales_be_selling/",
        "text": "I have been lurking for a little while, always wanted to post but was a little hesitant since I feel I am not the best storyteller. That aside I felt confident enough to start with this little story that was too idiotic to keep to myself.\n\nA little backstory, for almost 6 years I work for a medical software\\-company that also sells hardware to install those programs on. Our customers are medical professionals with small networks \\(Client\\-Server model, mostly 1 server and a couple of workstations\\).\n\nSince a lot of our customers don't like spending a lot of money on \"unnecessary\" stuff like a decent server/workstation or an installation and configuration of new hardware through one of our technicians we from the technical helpdesk are used to the loopholes that Sales take to make a sale.\n\nBut this week we had the winner of the most idiotic conclusion to a case. It all started a couple of months ago with a customer that had a workstation that kept freezing \\(PC did not react, Ctrl\\+Alt\\+Del did not give anything, only thing to do was a manual reboot of the PC\\). My coworker, let's call him $MrIdol \\(he likes to sing songs to keep the spirits high\\) did everything he could to fix this problem remote \\(our customers are all over the country so first line is always remote, if we can't fix it we send a technician\\). Being a former technician $MrIdol used all his tricks and wisdom but was unable to fix the problem. The workstation was about 5 years old, the customer did not want a billable intervention from one of our technicians. So he decides to send the case to sales with the question to contact customer and sell a new workstation.\n\nSo what did sales do .....?\n\nSell a bigger hard drive for the server!!!",
        "created_utc": 1526563354,
        "upvote_ratio": ""
    },
    {
        "title": "It's on the clipboard, why can't you just delete it?",
        "author": "M0rtimer7",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k323k/its_on_the_clipboard_why_cant_you_just_delete_it/",
        "text": "Hello TFTS! Long time lurker, very occasional commenter, and now first time poster... I do work in IT myself, but being a developer rather than a dedicated tech support, I'm usually saved from the worst these kinds of stories get. The most interaction I usually get with users is when there's a bug and I need to contact them to figure out more - And while there's some events there that consist out of stupidity, negligence, or just outright lies (or at least, ineptitude), none enough to warrant a proper tale.\n\nThat doesn't mean there can't be other sources of interesting tales that I'm sure many of us are familiar with, of course... That being family. In this particular instance, my mother. Now let me start off by making clear that I love my mom, but things can be rather... Difficult, when it comes to tech. I'd like to say that I'd help her at all times with a big smile, but things do occasionally end up rather standoffish. It's just a kind of natural result when you've tried to show her how to use copy and paste on at least ten different instances, and she still needs the occasional help figuring it out. Add that she can often be stubborn to a fault, and *trying* to help her can be an exercise in frustration. This is one of those stories.\n\nSo I'd just gotten home from work when I got called over- It was \"urgent\". (Note: urgent for my mom when it comes down to anything tech related can range from her having unplugged her pc to there being an actual problem, but that is a rare thing) So I head over, already prepared to do what is probably a five minute job, and be on my way... I found her fiddling with her phone, seeming to be frantically going through her gallery. The conversation went as follows:\n\nME: \"So, what's the problem?\"\n\nMOM: \"Oh ME, good thing you're here. You see, I was deleting pictures...\"\n\nI was already bracing myself at this point, figuring the worst- She deleted something she didn't want deleted and I was going to need ten minutes to explain to her that, no, I couldn't magically bring them back. This would probably not be helped by the fact that I once DID manage to bring them back, after she deleted everything and I discovered that, luckily, windows phone automatically backs all of them up to the cloud. (This was several years ago, and she got an android now and in this story) (un)fortunately however, this is not what was the problem.\n\nMOM: \"But when I tried to delete one of the pictures, I accidentally saved it- I need you to help me delete those.\"\n\nNow I was confused. Did she, somehow, manage to copy and paste some of these pictures in another folder, when I know for a fact that she barely manages after explaining it to her..? I suppose it wouldn't be too much of a surprise, but I still needed more info.\n\nME: \"Okay, so... Do you remember where you saved them to?\"\n\nMOM: \"Oh, I didn't! It was the phone that did!\"\n\nSo, that didn't help. I explain to her that I'm not planning on scrolling through likely thousands of pictures with her until she finds the right one, so I ask her if perhaps she could just show me what it is exactly she did. She fumbles a bit, but, luckily manages to remember what it was she did and saved us both a lot of time figuring out just what was going on. She pressed down on one of the pictures, got her little dropdown, and pressed... \"copy\". A little toast message appeared on the bottom of the screen:\n\n\"Image was saved to clipboard.\"\n\nMOM: \"There! You see?!\"\n\nNow, of course, I couldn't help but laugh a bit as I realized what happened, and I was prepared to laugh it off and explain she shouldn't worry. Mom, however, was not amused.\n\nMOM: \"ME, this is serious, ok? I want those pictures gone.\"\n\nME: \"Oh, well, you don't need to worry about it. If you deleted the actual picture, it should be gone.\"\n\nMOM: \"But it's not gone, it's on the clipboard.\" she said, looking at me as if I were the stupid one. I could already tell this was going to be fun to try and explain.\n\nME: \"Mom, you don't need to worry about it. The clipboard is not a folder or anything like that, it's just like... A temporary storage, for when you want to copy files.\"\n\nIn retrospect, this was a stupid explanation from me, and there were probably ten different ones I could have used that she'd have accepted at face value. Alas.\n\nMOM: \"Okay... So how do I remove it from there?\"\n\nME: \"You don't. It just gets removed whenever you copy something else. You'd have just deleted it when you copied that other picture.\"\n\nShe seemed to pause. She didn't quite understand. She seemed skeptical. She was probably thinking I just wanted to get out and get back to playing videogames. (I mean, I did, but that didn't take away from the fact her issue was never an issue in the first place.) So, after just a couple seconds of staring at her screen...\n\nMOM: \"Can't you just open the clipboard so I can see it myself?\"\n\nME: \"I can't. The clipboard is not a thing you can open.\" I reply. By this point, though, mom got herself convinced the clipboard **IS** something you can see- So, she wasn't having it.\n\nMOM: \"ME, please just stop being difficult and do it. If you need to look up how to do it, I know you can do that real quick.\"\n\nSo, this argument continued for at least ten minutes... As I repeated numerous times that the files she wanted gone were in fact truly gone, and she had nothing to worry about- I even showed her, again, copy and paste and how it worked. She only finally, begrudgingly accepted this \"answer\", even if she seemed very doubtful about what I had tried to explain to her.\n\nIn retrospect, I should just have taken her phone with me for about ten minutes, doing absolutely nothing before returning the \"fixed\" device.\n\n\"It's on the clipboard, why can't you just delete it?\"",
        "created_utc": 1526551131,
        "upvote_ratio": ""
    },
    {
        "title": "There's a lack of \"hackers\" in the IT world and it makes me sad :(",
        "author": "cowsrock1",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k27wc/theres_a_lack_of_hackers_in_the_it_world_and_it/",
        "text": "[removed]",
        "created_utc": 1526539980,
        "upvote_ratio": ""
    },
    {
        "title": "\"DO YOU KNOW WHAT YOU HAVE DONE TO ME??\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k1g7q/do_you_know_what_you_have_done_to_me/",
        "text": "[removed]",
        "created_utc": 1526531618,
        "upvote_ratio": ""
    },
    {
        "title": "I thought the welcome back was going to be a bit more happy and a bit less infuriating.",
        "author": "NakedTurtles",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k107z/i_thought_the_welcome_back_was_going_to_be_a_bit/",
        "text": "[removed]",
        "created_utc": 1526527186,
        "upvote_ratio": ""
    },
    {
        "title": "I can't take your service because you drive a manual car",
        "author": "ultrasuperman1001",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k0ue2/i_cant_take_your_service_because_you_drive_a/",
        "text": "So this happened today. I own my own computer repair business and I drive a manual car. I set up a meeting today with a middle aged woman who said her computer was running slow. When I pulled up she was outside doing some gardening so I said my hellos and when I opened my door she asks \"is that a manual you drive?\" I say \"yes\" and expect the usual \"oh those are hard to drive\" spiel but instead she says \"I'm sorry I can't let you in, the dust from your clutch plate causes cancer but I'll pay your travel charge and 1 hour of service\". At first I thought she was joking but nope. I asked if she was serious and she replied \"yes, I'm sorry but I really can't let you in\". I mentioned to her again that I do offer remote and drop off support (when she first called I mentioned my options) but she again didn't want to do those. So she paid me for my time and I left scratching my head.\n",
        "created_utc": 1526525674,
        "upvote_ratio": ""
    },
    {
        "title": "What? No, the email says my phone number is this!",
        "author": "duck__yeah",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8k0lth/what_no_the_email_says_my_phone_number_is_this/",
        "text": "This happened about an hour ago. Probably one of my favorite calls I've ever gotten while on call, mostly because of my customer's good sense of humor. For reference, I work at a local telco.\n\nCall comes in while I'm trying to head out to do some errands. Phones aren't working, can't receive any calls. I sigh and call my customer back and ask him for some details on what's going on. He reports that for several months they have had trouble receiving calls and that nobody in the same area code/city can call them. He goes on to explain the reason he's porting away (leaving to another telco) on Monday is due to this and an issue with the contract terms. I let him know I'd do some testing and see what I can find since this seems like a weird thing to have never worked in the two months he's had service with us. \n\nI do some test calls from two of my phone switches, three carriers, and three different cities, all of which connect fine except calls to the second line but I can see the call ringing on my equipment on site (nothing picked up, RNA).\n\nI call the guy back and let him know what I found out and he can't believe it. I end up asking him what the second line is since nothing picked up. He explains it's the fax line and then tells me the number to which I ask him to read again. The exchange was as follows:\n\n&gt; $Me: This doesn't really make any sense man, I called from 3 different cities, three different phone systems, and three different carriers and they all complete. What's happening when people call in? Do they get an error, busy tone, or does it just RNA?\n\n&gt; $Customer: It just RNA.\n\n&gt; $Me: Well, I was able to complete and spoke with an older gentleman with an accent when calling the main line, but nobody picked up when I called the second. What's the second line supposed to be.\n\n&gt; $Customer: Sounds like my father. Second line is a fax, 555-555-1024.\n\n&gt; $Me: Wait, can you repeat that number for me?\n\n&gt; $Customer: The fax? It's 555-555-1024.\n\n&gt; $Me: I'm sorry but the second line we have for you is 555-555-0124.\n\n&gt; $Customer: No way, it's definitely 555-555-1024. I was told the numbers I got from you are 555-555-1023 &amp; 555-555-1024.\n\n&gt; $Me: I don't have those numbers programmed anywhere for you. I actually called 555-555-1023 by mistake when testing and I definitely believe nothing picks up, but it's not your phone number. Your numbers are 555-555-0123 &amp; 555-555-0124\n\n&gt; $Customer: No those are definitely my numbers. I have an email from customer support with the numbers hang on let me find it.\n\nHe finds the email and tells me who it's from, $customer_support_rep and $sales_rep which match who he had worked with on the sale and cutover after checking some internal memos. Then he reads off the email to me, the part with the numbers anyway.\n\n&gt; $Customer: Here it is. \"Dear $Customer, we have your new numbers now. They're 555-555-0123 &amp; 555-555-0124. Let us know if you have questions.\"\n\n&gt; $Me: Yeah, that's correct. Those are the numbers I told you.\n\n&gt; $Customer: Huh? No they're... \n\nHe proceeds to re-read the email aloud again and when he gets to the numbers you can hear the click where suddenly everything comes together now. Thankfully he was good humored the entire time and wasn't upset or anything. He didn't seem too thrilled about calling his father and explaining that the phone displays on site, the employees, and his customers were all given the wrong number though.",
        "created_utc": 1526523324,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't care if there's a state of emergency! I need someone here now!\"",
        "author": "pm_me_your_fanmail",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jzkld/i_dont_care_if_theres_a_state_of_emergency_i_need/",
        "text": "LTL, FPT, XYZ, LMNOP...This ended up being longer than I expected. Hopefully it's entertaining enough to be worth it.\n\n\nTL;DR, Always get it in writing.\n\n\nI work for an events office at a university running a Campus/Student Center as well as several other satellite event locations, and part of that job includes providing tech support for meetings. Everything from setting up mics and projectors to video conferencing to basic windows troubleshooting and everything in between. I've got tons of stories from that, but I'm going to start with this one as another story here reminded me of it. (Details and timeline fudged to keep stuff anonymous.)\n\n\nA couple winters back the university was going through it's re-accreditation process. For those unfamiliar with the processes the tl;dr version is it's a **Big Deal** and all the higher ups are involved including the $Chancellor's Chief of Staff (CCoS). The accreditation can affect everything from a school's grants, state, and federal funding to students applying to said university ability to get financial aid. \n\n\nWe'd been leading up to this meeting for weeks. There would be a site visit with the folks from the accreditation board where they would tour the campus, meet some students at the Student Center, some official, some \"spontaneous.\" The whole thing would kick off at 8 am with a conference call to other sister campuses. Everyone was completely on edge about this meeting and I was looking forward to seeing the tail end of it.\n\n\nThe day before the meeting it starts snowing. And it snows. And snows. *And snows.* We're talking record breaking levels here. We ended up getting dismissed from work early. The President of the University and the Vice Chancellor of HR send out the \"Don't come to work tomorrow unless you are essential personnel\" email. The Governor issues a state of emergency and says everyone except emergency vehicles should stay off the roads. I tuck in for the night content in the knowledge that my son and I will get to have a great day at home having snowball fights and building snow caves.\n\n\nWell, the next morning rolls around and I wake up to my work cell ringing. I have a strict \"off-hours\" policy so I put my work cell on Do Not Disturb mode from 12 am-6 am. I've got something like 20 missed calls and texts. But now the $CCoS is calling my personal cell. I don't even know how he got my personal cell number as I only ever gave that number to my work wife. Something very bad is happening.\n\n\n$me: Hello?\n\n\n$CCoS: Where the *$%@ are you? Why is the Campus Center closed! Where is everyone? The accreditation officers will be here in an hour! We need to get everything up and running!\n\n\n*Where do you think I am you moron? There's two feet of snow outside.*\n\n\n$me: I'm at home. The Campus is closed. The governor has issued a state of emergency. I'm not allowed out on the roads.\n\n\n$CCoS: I don't care! These accreditation officers are only in town today so we are going to go through with this meeting. I need the building unlocked and the conference equipment running! And we need those students that are supposed to be part of the tour.\n\n\n*you serious? Half my staff are commuters. I'm not going to risk their safety and make them come in. And the ones that do live on campus, I'm not going to make them come in either, you f-ing nut job, I'd have to pay them extra to get them to come in.*\n\n\n$me: Well, the video conferencing system is plug and play, and I can get facilities to clear the sidewalk but they'll probably charge extra, and I can probably get campus security to come in and unlock the building and staff the front desk, but that's another cost. As for staffing, I cannot make it in, there's two feet of snow outside my house, and a good portion of my students commute so I can't ask them to come in either as I can't ask them to risk their safety. What I can do is ask if anyone who lives on campus is willing to volunteer to come in. But that's an extra charge. And I can't promise they will want to come in.\n\n\n$CCoS: Just make it happen! This is a critical meeting and **everything** has to be perfect. *Do whatever it takes to make this happen.*\n\n\n$me: *Foreseeing a trap* Alright. But I'm going to need this in writing. Can you please send it to me in an email?\n\n\n$CCoS: Yes. Fine. Whatever. *click*\n\n\nTwo minutes later, sure enough, I get an email from him. *\"The Accreditation Meeting is going forward as planned. The Center needs to be open by 8am. Pull whatever resources you need to make this happen.\"*\n\n\nArmed with those magic words I went to work. Being in events, you have to make quick friends with Security and Facilities (and IT), so I got on the horn with both departments and acknowledged that I'd have to pay extra to get them focused on the Student Center, but I let them know that the $CCoS made it very clear that I had to get this done no matter what. Yes, there's an extra emergency charge, plus the 4 hour minimums, but we have to make it happen. Yes, I will also send this in an email so you are covered. Then I find a couple of my student staff who live in the dorms close by that were willing to come through the storm for a little extra emergency pay.\n\n\nThe event went off without a hitch, but the $CCoS was not happy when he got his giant bill afterwards. Fortunately, since I had just sent the bill in reply to his \"Make this happen at all costs\" email, I was in the clear.",
        "created_utc": 1526513685,
        "upvote_ratio": ""
    },
    {
        "title": "Encyclopædia Moronica: E is for Early Morning Emergencies",
        "author": "Gambatte",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jz623/encyclopædia_moronica_e_is_for_early_morning/",
        "text": "Winter is coming.  \n- *some guy on a TV show*\n\n---\n\nIn the Southern Hemisphere, we are entering the cold season. Each day, temperatures are significantly cooler than the last, and this is even more true during the hours of darkness.  \nSo while the temperature under the bed covers remains relatively constant, by virtue of the increased differential, it is increasingly more pleasant, more desirable to stay in bed as long as possible.\n\nSo it was with great reluctance that I sleepily snaked my arm out from under the mountain of covers to swat at the offending noise. As my brain slowly dragged itself out of sleep and higher functions returned, I recognised the sound as my work phone ringing.\n\nI attempted to gather my scattered thoughts as I answered it.\n\n&gt; ME: Ugh... I mean, hello?\n\n&gt; Dispatch (D): Hey G. Did I wake you?\n\n&gt; ME: Not at all, I'm always up at, uh... Wait, why am I awake at 5 A.M.?\n\n&gt; D: You know *{site}*?\n\n&gt; ME: Vaguely? They shut down a few months back.\n\n&gt; D: Well, they've just re-opened, under new management.\n\n&gt; ME: Let me guess - something's gone wrong for the first time since they took over, and now they're panicking, because this has literally NEVER happened before in the whole six times they've opened the site for the day.\n\n&gt; D: You got it, man.\n\n&gt; ME: Yeah, fine - let me finish rubbing the sleep from my eyes and I'll get down there ASAP.\n\n&gt; D: All good - I'm still fighting the new job system, but you should have it in the app by the time you get there.\n\nI carefully flung back the covers, taking care not to disturb my wife. I did disturb my cat, who glared obscenities at my retreating back before going back to sleep.  \nThree minutes later, I was showered and dressed. I checked the new job system - the company had only started using it a few days prior - but the job had not appeared in the app. There was an email with all of the relevant information, however, so I carried on - the email clearly indicated that the entire site was offline, so urgency was about as high as it gets.\n\nTen minutes later, I pulled in to the site's parking lot - fortunately, it was only across town. The front door was open, so I let myself in. A young dark-skinned woman was at the counter, so I introduced myself.\n\n&gt; ME: Hi, I'm Gambatte, from *{company}*.\n\nThis was reinforced by the branded hi-visibility vest, shirt, and baseball cap that I wore.\n\n&gt; ME: I understand you're having some issues this morning?\n\nFrom my pocket, my work phone buzzed. I ignored it, because face-to-face conversations generally take priority.\n\n&gt; Manager (M): Oh, not any more.\n\n&gt; ME: Really?\n\n&gt; M: Yes, I was able to get it working - I just had to press the black button! I told the man on the phone this a little while ago.\n\nI guessed that the buzzing was D, attempting to let me know that I no longer needed to attend - useful information to receive when you're already there. I would later discover that this guess was correct.\n\nThe sleepy part of my brain suggested turning on my heel and grabbing some more sleep before actual work hours started.  \nMy mouth didn't get this message, though.\n\n&gt; ME: I see. Well, as I'm here now, I might as well check the equipment, just to see if there's anything we can do to prevent the issue from happening again.\n\n&gt; M: Okay.\n\nM led me into a back office. Under the desk, I could see a white six socket power board. M indicated to the RESET button on the side of it. This button was black.\n\n&gt; M: That's what I had to press.\n\n&gt; ME: Okay, I'll have a quick look and see what I can see.\n\nM ducked back out to the site floor as I investigated. The power board I could see had only two plugs connected, and neither of them were for my equipment.  \nCurious.  \nI decided to start at my equipment, as I knew this had to have been affected. The equipment was plugged in to the multiple outlets of a single UPS, which was in turn fed power from... a black six socket power board.  \nHuh. The black power board was fed power from... the white power board. Every socket on the black power board was full.  \nThe last socket on the black power board provided power to... another black six socket power board. Which was also completely full.\n\nIn total, one wall socket had been connected to enough daisy-chained power boards to provide 18 outlets, of which 12 were in use - and most of the remaining outlets were in prime position to be accessed by staff members.\n\nAnd on these cold wintry nights, who wouldn't want to plug in a space heater...\n\n---\n\nAs best I could determine, the overcurrent circuit in the first power board had been triggered, killing power to everything downstream. When the Manager pressed the black RESET button, she restored power, and somehow the startup/inrush current from all of the connected equipment was not enough to immediately trip it again.  \nThis was particularly surprising, as the UPS had provided power until it had automatically shut down, so was entering charging mode once power restored.\n\nI pulled out my phone and snapped a few photos of the power arrangement, which I then put into an email to the new owner, along with a few words explaining how \"a temporary condition (like a heater or a vacuum cleaner being plugged in) may have easily tipped the overcurrent protection, causing the issue. Redistributing the equipment to additional power circuits may be all that is required to prevent the issue from reoccurring\", or words to that effect.\n\nA few days later, I received the following response (verbatim):\n\n&gt; NEW OWNER: Thanks for bringing the issue to my notice - I have 6 extra wall sockets in that same small office room; I will distribute the use of the power to the balance 6 extra wall sockets. I realise we have being using this side of the wall socket.\n\nIt's been a few weeks now. The nights have continued to get colder and the bed warmer and more enticing, yet I haven't had to go back - at least, not so far...",
        "created_utc": 1526510150,
        "upvote_ratio": ""
    },
    {
        "title": "The Early Access game I was playing crashed? Must be the drivers!",
        "author": "dmfreelance",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jz3nk/the_early_access_game_i_was_playing_crashed_must/",
        "text": "So I had a guy come in recently. He was playing a Steam Early Access Game. Apparently it crashed. He came to the realization that  he should probably update the graphics drivers, because that must be the problem.\n\nHis laptop has both intel HD XXXX integrated graphics and a much bettery RADEON graphics card. \n\nSo, he decided to use some HP tool for updating his drivers. It updated BIOS, PCIe, intel HD, and RADEON drivers to more recent versions. He then realized his games were running slowly, so he then reset his computer to factory settings and then re-updated his drivers using the same damn HP driver tool. Then he apparently tried the 'update your drivers' option in Device Manager, because (as you all know) that's the best way to solve game crashes. Apparently it somehow actually managed to update one of his drivers. \n\nAs a result, his games are slow as fuck. He has 1/3 the FPS he was getting before.\n\nSo, I get some info from him on when he last reset his computer (*before* this mess of a situation happened) and reverted to the most recent drivers he would have had when his computer was factory reset. Problem solved. Tada!\n\n**tl;dr: if your Early Access Steam game crashes, first try updating your drivers, because obviously it isn't the game's fault. It must be the drivers, right?**",
        "created_utc": 1526509550,
        "upvote_ratio": ""
    },
    {
        "title": "I KNOW THE LAW!",
        "author": "SirDrankTooMuch",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jym1d/i_know_the_law/",
        "text": "LTL, FTP, sorry for formatting. Sorry for long post.\n\nNow that the formalities are over, to the story.\n\nMany years ago i worked as a support technician and many both stupid and funny things has happened. This is one of the stories that i remember the best.\n\nCustomer calls in and has some issues with the internet connection. They just moved and had problems getting their internet started in the new apartment. This was not actually a new customer. They had just moved their connection from one place to the other. \\(The customer was under a 12 month license agreement and since they the company could still deliver the service on the new address they could either just pay a fee and not use the ISP the months that are left on their agreement or the could move it and just continue it as normal\\) however in this instance the customer had not remembered to actually contact customer support and informed us about the fact they are moving to the new place in time.\n\nThis caused some problems for the customer to get access to their internet since in the agreement it states that in case of a move we need to be informed 2 months in advance to have the time to send out a technician to get the old connection unplugged from the old station and the new connection connected in the new station \\(DSL technology where a technician actually had to physically connect the customer in the nearest connection point\\)\n\nNormally this is something that should be handled by customer service and never actually end up in the tech department, but there i was, getting a call from a upset woman that was arguing with me that we had not gotten here internet working.\n\ni'll be Me and the customer will be AW for angry woman.\n\nMe: Welcome to technical support, you're talking to SirDrankTooMuch\n\nAW: Why is our internet connection not working?! \\(already upset\\) \n\nMe: That doesn't sound good. Could you please give me a customer number or a social security number to the person owing the contract and i can check what's wrong.\n\nAW: 1234567890. it's on my husband \\(gives me husbands name\\)Me: Ok, thank you. Can you just give me your address so that i can check it's the correct contract?\n\nAW: \\(gives me the address to the new apartment\\)\n\nMe: Sorry, that does not look correct. the address i can see is \\(their old address\\)\n\nAW: Yeah... we just moved and i talked to the customer support yesterday about moving the connection to the new apartment...\n\nMe: Oh, i see. Well, it can take up to 5 weeks for us to get a technician out to move this to the new apartment. Have you been in contact with us earlier and informed us about the move? \n\nAW: No! I haven't. but you should just be able to switch it on... just fix it! i am working from home and i need it!\n\nMe: \\(headbutts the keyboard....\\) Well, sorry. I really can't, i wish i could, but this is a physical connection that needs to be connected in the station some kilometers away and that needs to be done by a technician.\n\nAW: Well send someone out now then to get this working \n\nMe: Sorry... I really can't there is no one available on such short notice and this is the agreement we have with the firm that is performing this job for us...\n\nAW: THEN YOU DO IT! I DON'T CARE! JUST GET IT FIXED!!!\n\nMe: As i said this is not something that we can do that quickly.  this should have been reported much earlier to us.\n\nAW: I WORK FROM HOME AND I NEED THIS FIXED! I KNOW THE LAW! MY HUSBAND IS A LAWYER!!! YOU HAVE TO FIX THIS!!!!\n\nMe: \\(smiles a bit since i know that the contract we got with the customer says they are not allowed to use the internet connection to operate any kind of business, so i try not sounding smug say to the customer\\) Sorry. but this cannot be done, and we are in the legal rights to take this amount of time to move the connections between the apartments. Also it is important to know that you are not within your legal right to actually use this internet connection to work from home since this is a contract for private use only and no business.\n\nAW: WHAT IS YOUR NAME?! I AM WANT TO TALK TO YOUR MANAGER AND I AM GOING TO SUE YOU AND CALL THE NEWSPAPERS AND YOU ARE GOING TO GET FIRED! I KNOW THE LAW MY HUSBAND IS A LAWYER AND I KNOW THIS IS NOT ACCORDING TO THE AGREEMENT!!!!\n\nMe: my name is Sirdrank. i will not give you my last name because i do not need to and you are threatening me. I will get my manager to call you back when he got time to, but it might take up to 1 week due to heavy workload at the moment.\n\nAW:  WANT TO END THE CONTRACT AND USE ANOTHER ISP!!!!! JUST CANCEL EVERYTHING!!!\n\nMe: That i cannot do. You are not the owner of the contract and your husband is still locked to the licence agreement for 4 more months.\n\nAt this point the customer had enough and just hung up the phone. But i can still not forget how much i loved the fact she actually used her husbands law degree to declare how she knew the law and understood the whole agreement they had entered... That ISP had a licencee agreement longer than a well known phone manufacturer we all know of due to their fruit logo.\n\nAnd just as a side note and something that made my day was that i got a message from a colleague a couple of days later telling me AWs husband called in and asked about what's going on and apologized for his wife's outburst.\n\nTL;DR: Customer calls in and yells at me for not informing the ISP about them moving and says she's going to sue me and the company since she knows the law because her husband is a lawyer. I inform the customer she is in breach of contract with what she is using the connection for and the customer hangs up.",
        "created_utc": 1526505469,
        "upvote_ratio": ""
    },
    {
        "title": "My click to call isn't working...",
        "author": "Ryko369",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jxtd7/my_click_to_call_isnt_working/",
        "text": "Our software is a dealership management software and it helps them record and keep track of sales and BHPH payments.  It does not have any way to call customers directly from it, though it does integrate with TCN to do robot calls.  \n\nA guy called in, sounding rather annoyed.  The first thing out of his mouth was that \"My click to call isn't working. \"  I was struck dumb for a couple of seconds while I tried to remember the last time we offered click to call.\n\nOnce my brain started working properly again I asked him if he was using our DMS or our CRM which does have a way to call customers.  He was insistent that it was the DMS. So I explained that our DMS does not have a way to call customers.  He didn't really like that. I then, just to see what was going on, asked him how he made calls from the system.  Turns out that he uses a phone on his computer which has a feature where you click a number and it calls it.  This is not provided by us.\n\nI had to stifle my laughter as he told me this, as apparently he thought it was obviously something wrong with our system. Once I composed myself, I told him to call the phone company as our software does not make phone calls.  He made an irritated noise at me and hung up.\n\nJust thought I'd remind y'all that people are way too computer illiterate. ",
        "created_utc": 1526499400,
        "upvote_ratio": ""
    },
    {
        "title": "Please don't create a ticket for this/ I told you not to create a ticket/ Stop creating tickets",
        "author": "Lizregbel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jxinm/please_dont_create_a_ticket_for_this_i_told_you/",
        "text": "[removed]",
        "created_utc": 1526497149,
        "upvote_ratio": ""
    },
    {
        "title": "Passive agression",
        "author": "xadcirk",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jwoug/passive_agression/",
        "text": "SO I JUST GOT AN EMAIL FROM **$SITTECH:**  \n\nWe need to get a ticket for **$Xadcirk** (myself) and I to go to @BigNewCustomer  \n\n*Need to address preparations for:  \n@BookKeeping Software  \n@TimeEntry  \n@Dictation Mess  \nIf vendors need to be spoken to or support then we need to be setting up times for Friday to address them.  \n\nNeed to get version info, compatibility info from nondomain to domain conversion. Need location and planning for the server installation for Friday. The business will be closing at 10:30 AM and we can be there prepping for that beforehand.*  \n\nThis after I had to show him this morning how to setup users to have mapped drives on login. This after I told him 2 weeks ago we needed this information.\nTHIS AFTER I DID EVERYTHING IN MY POWER TO DELAY THE WHOLE THING SINCE HE WAS NOT GETTING US THIS SORT OF INFORMATION LAST WEEK.  \n\nhe was sitting right behind me and while I was incredibly tempted I can confirm that I at least did not wheel around with my new Rack shelf and clock him right in the head.\nI thought about it but I managed to breath as I whispered to myself \"Its just until you hear back from the other jobs you applied for. You could be working a government contract again or a large scale IT support desk with all its malice and agony that is not him in just a few weeks. DO. NOT. MESS. THIS. UP. FOR. YOURSELF. RIGHT. NOW. OVER. THIS. PITIFUL. EXCUSE. FOR. A. TECHNICAN!\"  \n\nHe's not bleeding because of anything I have done directly or indirectly.\nI just slurped my soda until he went to get something off the printer. Passive aggression. **PASSIVE**",
        "created_utc": 1526490977,
        "upvote_ratio": ""
    },
    {
        "title": "Windows Servers, AD and Windiot",
        "author": "EEInvoker",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jwlj2/windows_servers_ad_and_windiot/",
        "text": "Hello TFTS, a very good day to all of you.\n\nLong time lurker here, first time posting. English isn't my native language and I am not good with writing either, so excuse/correct any errors. I will post more stories if this one is received well.\n\n&amp;nbsp;\n\nFirst a bit of introduction. I am an information security specialist who works as a system administrator/security consultant for a company that provides professional services. One of our client was a large telco where we had deployed an Identity management system ($IMS). I was the resident engineer/sysadmin for the solution. I also got an opportunity to work with another system called Privileged Identity Management System ($PIMS) as a backup admin when $PIMSAdmin was not available.\n\n&amp;nbsp;\n\nThis story involves 2 systems, $PIMS and Active Directory ($AD). $AD was huge in this environment. Almost every application was configured to authenticate with $AD and the password vault for these system accounts was $PIMS. \n\n&amp;nbsp;\n\nThe telco had outsourced IT operations to another company. They only cared about a 3-letter abbreviation called SLA. This outsourced IT disliked security and specially hated the teams I was involved with ($IMS and $PIMS teams). Some of the it was justified as once they happened to ignore security procedures which later resulted in a large breach (perhaps a tale for another day) due to which the folks in security took away their 24/7 admin rights which started affecting their beloved SLAs. Basically, they only got admin rights when they needed it and involved approvals from upper management.\n\n&amp;nbsp;\n\nThere was a major downside to this. Any downtime on any application managed by IT was thrown at the $PIMS team claiming its $PIMS fault for locking a system account or updating its password (which by the way, never happened).\n\n&amp;nbsp;\n\nThe cast for this tale will be:\n&gt;\n*$HD: Help Desk, the unsung heroes who face end-users.*\n&gt;\n*$WinLead: Team lead for Windows Team. Windows Team manages Windows servers and Active Directory. $WinLead is a friendly guy who always discussed on phone before sending emails.*\n&gt;\n*$Windiot: A member of the windows team who I doubt even knew what he was doing. Senior guy, loves to throw others under the bus.*\n&gt;\n*$J: Me.*\n\n&amp;nbsp;\n\nOne fine day I was conducting some tests in my lab for new features when I got a call from the Help Desk ($HD).\n&amp;nbsp;\n&gt; \n$HD: Hey $J, we just provisioned a user in $IMS but the $AD account creation process didn’t trigger. Could you check if something is wrong?\n&amp;nbsp;\n&gt;\n$J: Sure I’ll take a look and get back to you as soon as I can.\n&gt;\n$HD: Thanks.\n\n&amp;nbsp;\n\nI disconnect the call and start my usual troubleshooting. An outlook notification popped up. There’s an email from $Windiot claiming almost every production system is down because their corresponding $AD system accounts cannot authenticate with $AD. Also demanded that we fix this immediately. \n&amp;nbsp;\n\nHis simple mind flows with: authentication means password, password means $PIMS, $PIMS means blame $PIMSTeam.\n&amp;nbsp;\n\ncc’d in the email were my boss, $WinLead and every single director from IT and Security.\n\n&amp;nbsp;\n\nFirst, I checked $IMS as managing that is literally my job. Rest of the things can wait. As $HD claimed, the $AD account provisioning for new user was stuck in processing for over 10 minutes. I remoted to the server and restarted the service which provisioned $AD accounts (have you tried turning it off and on again). The service did not start and threw an authentication error. \n\n&amp;nbsp;\n\nI logged in to $PIMS immediately and checked the password to the $IMS provisioning account. It was the same password. In the $RDP session, under service properties, I just re-entered the same password and clicked apply. I was greeted with a message “the account $IMSaccount is now granted to login as a service”. \n\n&amp;nbsp;\n\nAfter this I started the service, and hurray it started successfully. I checked $IMS and the pending queue cleared. I called $HD and told them that the issue is fixed. $HD were happy and went about their way.\n\n&amp;nbsp;\n\nNow this was weird because all these service accounts were part of a domain group ($LoginAsService) which granted rights to login as a service on all windows servers. This was pushed as a GPO. I’m no windows expert but can use google. I looked up on GPOs, opened up group policy on the server and noticed $IMSaccount is allowed to run as a service. But no sign of $LoginAsService group anywhere. There was some random account (PROD\\$random) which was allowed to login as a service. (Memories of this part are a bit hazy, as this happened a few years back and I don’t remember what exactly each setting was).\n\n&amp;nbsp;\n\nI decide to run gpupdate /force to get an updated GPO from $AD. After that, $IMSaccount disappeared from the list. I restart the service and it throws the same error. I conclude that the GPO is causing this problem for which most of the production systems are down. Not my problem, but I have to deal with it thanks to $Windiot’s email.\n\n&amp;nbsp;\n\nNow I really don’t like talking to $Windiot as he is uncooperative. So I replied to his email.\n&gt;             \n*Hey $Windiot, was there any recent update in Group Policies? If yes, could you check if any setting is removing $LoginAsService Group from allowed users/groups to login as service?*\n&amp;nbsp;\n&gt;\n*Regards,*\n&amp;nbsp;\n\n&gt;*$J*\n\n&amp;nbsp;\n\nI didn’t want to point out the exact problem to $Windiot since there was upper management cc'd. As much as I disliked him, I didn’t want him to get into trouble because of me.\n\n&amp;nbsp;\n\nWithin a few minutes, I get a reply:\n&gt;***No this password $PIMS problem, security should fix.***\n\n&amp;nbsp;\n\nI am not kidding, that was the actual text of the email (top management is still cc’d). I lost my shit at this point and decided to reconsider the part where I didn’t want him to get into trouble because of me.\n\n&amp;nbsp;\n\nI picked up the phone and dialed $WinLead. \n&gt;$J: Hey $WinLead did you check your email?\n\n&gt;$WinLead: Yeah $Windiot is claiming $PIMS is causing all sorts of issues.\n\n&gt;$J: I looked into it and I think it’s a GPO. Was anything updated recently?\n\n&gt;$WinLead: Yeah $Windiot wanted to allow $random to login as a service on all servers, so he pushed a policy this morning. This is for Project Random.\n\n&gt;$J: So yeah that policy has overridden the existing GPO which allowed members of $LoginAsService to run services. Can’t you guys do something like append it to the existing settings on a server instead of overwriting it?\n\n&gt;$WinLead: Yeah that’s how it was supposed to be. $Windiot probably messed up.\n\n&gt;$J: Well when I gave hints about it to $Windiot, he replied saying its on us. Shall I rip him a new one?\n\n&gt;$WinLead: Well he went aggressive on you, so go ahead. I’ve had enough of $Windiot.\n\n&gt;$J: Great! Thanks. I will mention relevant parts of our conversation in the email.\n\n&gt;$WinLead: Sure, no worries.\n\n&amp;nbsp;\n\nI took screenshots of everything I did during troubleshooting and replied back to $Windiot. Towards the end of it I wrote:\n&gt;\n*So as per my investigation of this issue, it appears to be happening due to some GPO and not $PIMS. Please check for the changes in Group Policies. I spoke with $WinLead about this and he said GPOs were updated today for Project Random.*\n\n&amp;nbsp;\n\nAfter a few hours I receive an email from an $ITDirector apologizing for the mess $Windiot had caused. I never received another email from $Windiot again. He still worked there, but avoided messing around with me.\n\n&amp;nbsp;\n\n*TL;DR: $Windiot asks me to do the needful. I do the needful and rip him a new one.*\n",
        "created_utc": 1526490320,
        "upvote_ratio": ""
    },
    {
        "title": "How it feels to be on a receiving end of bad tech support ticket",
        "author": "Paulius9",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jw8jn/how_it_feels_to_be_on_a_receiving_end_of_bad_tech/",
        "text": "[removed]",
        "created_utc": 1526487690,
        "upvote_ratio": ""
    },
    {
        "title": "No YOU plug it in",
        "author": "zer0mas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jvoiv/no_you_plug_it_in/",
        "text": "Awhile back I was sent out to investigate why a couple of wireless access points wouldn’t power on. The access points are PoE and located in “briefcases” so they can be easily moved around as needed. They are connected to a moving assembly line and placed inside the aircraft during final assembly. These moving assembly lines essentially consist of giant scaffolds that have power, telecom, and high pressure air lines. During line moves these are disconnected and then reconnected once everything is back in place. The process of disconnecting and reconnecting everything is easy enough, and people just have to be sure that the lines are moved out of the way during the move. \n\nThe reason the access points wouldn’t power on is that they weren’t plugged in to anything. Not seeing any CAT5 around I grabbed some and went to reconnected everything. Underneath the aircraft are covered trenches where the network drops are located. I opened up the trench and found the ultimate cause of the network problems. Instead of disconnecting the network cable it was left in place and several tons of equipment was allowed to run over it. As a result the cabling was shredded and then because it was no longer any good it was kicked into the trench and forgotten. This process apparently happened several times. \n\nAfter several emails between managers an explanation for all this was found. Apparently the people who do the actual move were only responsible for the power and air connections but not the telecom connection, which is just a CAT5 cable that gets plugged into a RJ-45 jack on each end. Because they weren’t responsible for the network cable they just left it plugged in, let the scaffolding run over it, yanked it out, shoved it in a hole, and then blamed IT for their lack of network connection inside the aircraft. Why was it done that way? Because none of the people working the line moves is IT or an electrician, which apparently you need to be to plug in a network cable, but not the high voltage (I have no idea how high, but it’s enough to cycle large aircraft engines) power lines.\n",
        "created_utc": 1526483516,
        "upvote_ratio": ""
    },
    {
        "title": "Hobo Comments",
        "author": "VVarkay",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jvcjm/hobo_comments/",
        "text": "the protagonists      \n%program: a 2d cad software, with a lot of legacy code and hard coded files      \n%c : my colleague      \n%p : the programmer      \nme : yours truly      \n      \n      \ntoday a coworker worked on an output config file for creating adobe illustrator and pdf files from %program. you can draw lines and give them attributes based on a configuration file. the output looked good in %program and illustrator but for some reason adobe reader kept crashing when you opened the file. he searched for the error for over 2 hours, just to find that the name of three of 20ish linetypes contained a space character, that was there because the customer insisted on the specific name that had a space. he replaced the space with an underscore and behold, adobe reader could now open the file. he also talked to %p about this     \n   \n%c:  hey %p, i found that if you add a space into the names of the lines adobe reader crashes on the file    \n%p:  oh i didnt know that, i have to look into this issue, thank you, we havent seen this error yet    \n    \n   \ni was looking over his shoulder, he shows me the lines where he fixed the error   \n   \n%me:  oh so these are the faulty lines?   \n%c:     yeah i searched around 2 hours for this and %p told me that he has never seen this error either      \n%me:  ah i see you also put in a comment describing the error, thats great, that saves us the search next time      \n%c:     which comment?         \n   \non top of the 3 lines of code that had the error was a comment that said \"do not use whitespaces or special       characters here\", %c didnt read it and %p, who wrote the comment couldnt remember that he did   \n  \nme: nuclear headdesk into Lmao  \n    \ntitle: a hobo comment is a comment thats there but everyone ignores it, pretending its not even there, despite seeing it",
        "created_utc": 1526480940,
        "upvote_ratio": ""
    },
    {
        "title": "Wanted: Keyboard, black, 102 keys",
        "author": "OldBaud",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jv4lf/wanted_keyboard_black_102_keys/",
        "text": "LTL,FTP and english isn't my first language so please be kind.\n\nBackground: I am a chemist, but ever since punching my first cards at school I was addicted to the binary world, too. Back mid 90s I am working at an university, doing (chemical) analytical stuff, keep machines running and get more and more IT related things shoved my way because... well, I was the only one at $department who was in this kind of things. And before you blink twice you have servers to manage and users to ~~castigate~~ support.\n \n$department had several laboratory courses running over the year, students had to synthesize substances, analyze them and deliver substance and data. To do so, they needed among other things chemical grade glassware (think Pyrex), lots of it. And this stuff is really expensive. \n\nAll glassware was handled since decades by a woman, at this time in her late 50s and her slightly younger sidekick. I will call them Lab Dragon 1 (LD1) and Lab Dragon 2 (LD2). They were very respected within $faculty because of their ability to seed fear in the hearts of young students, absolutely necessary to keep glassware losses as low as possible. Of course most of it was show, actually they would go the extra mile for 'their kids' anytime. If you want to visualize them - imagine a drill sergeant clad in a flawless white lab coat and pinned up hair.\n\nAll this glassware juggling included lots of tiresome paperwork, it took ages to sum up losses, blame the guilty and order replacements. Certainly a computer would speed up things, so it was tasked to me. I made a program for glassware inventory management, at the end you could pretty much generate every report possibly wanted with the click of a few buttons.\n\nEasy, now the hard part: teaching LD1 and LD2 how to use the program, or I should better say how to use a PC. And a keyboard. And a mouse. Several days and lots of suppressed head-desk incidents later they are up to the task, more or less.\nFast forward some weeks: first IT-enhanced lab course running and all seems to work well, although during my visits there I notice LD1 delegates use of some program functions to LD2 most of the time. I was curious but I will not meddle with the internal affairs of our dragons, ever.\n\nOne monday I arrive at my office and want to finish setup of 3 brand new PCs, but somehow I miss one of the keyboards. Now it is not uncommon someone needs a spare one or a mouse and some people are allowed to pick up replacements from my office if they leave a note. But, no note or damaged KB this time. The 3 new keyboards were black, we only had the grayish type before so I should be able to find the missing one fast. I call the usual suspects to find out where it went, but no luck. A little lab raid yields interesting things but no black keyboard… no big drama but annoying, because I am out of spare ones - of course.\n\n\nNext day I am at work early and for some reason I can’t remember anymore my office door is closed, usually its open as long as I am in.\nSuddenly I hear someone tries to unlock my already unlocked door, I suspect it is the cleaner and go open it. Surprise - LD1, and a keyboard. A black keyboard.\n\n&gt;**Baud:** Good morning! Something wrong with the keyboard of your glassware pc? Spilled your tea over it or was some clumsy student’s blood sacrificed?\n\n&gt;**LD1:** ...\n\nNow seeing her speechless was a very rare thing, don’t think I ever saw it before. The dragon starts to change face color too... time for a saving throw!\n\n&gt;**Baud:** Oh come on, I am joking, I know you care for them. So you took the keyboard because...?\n\nMeanwhile her face is colored red-purple-ish, the same color she wears when yelling at a student who broke some really expensive piece of glass.\n\n&gt;**LD1** *finally finding her voice again***:** I... needed it.\n\n&gt;**Baud:** Well yes, what for? The Lab PC keyboard not working?\n\n&gt;**LD1:** No, no... it is fine. I needed it at home, so I took it from your office friday afternoon when you left. Forgot to bring it with me yesterday, unfortunately.\n\nNow I am stumped, not long ago I had a hard time getting her to use a PC at all and now she needs a keyboard at home, maybe...\n\n&gt;**Baud:** You got a PC yourself at home and no keyboard was included?\n\n&gt;**LD1** *face color turning more to the red side***:** No! I just needed the keyboard!\n\n&gt;**Baud** *blank stare, user style***:** ...?\n\n&gt;**LD1:** Look, LD2 is so much better at typing with this thing *shakes keyboard with disgust*. This can’t be, I had to train. Obviously I can’t do that at work, so I took it home and trained typing all saturday afternoon. I am much better now!\n\n&gt;**Baud:** ... \n\nTrying to imagine LD1 sitting at home and hacking away at a not connected keyboard caused some sort of mental bluescreen, took a while to reboot myself.\n\nIn the end I gave her a damaged keyboard with keys still working for her training needs, and of course I had to promise about 50 times to never tell LD2.\n\n**TL; DR:** 99 ways to (ab)use a keyboard, position #42.\n",
        "created_utc": 1526479192,
        "upvote_ratio": ""
    },
    {
        "title": "Please don't user reply-all all of the time.",
        "author": "ambercore1000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8juywh/please_dont_user_replyall_all_of_the_time/",
        "text": "Just a short story today folks.\n\nSo this happened earlier today, and this time it was not a user who sinned, sometimes Users are the ones you can trust. Now, I'm not directly involved, but my supervisor is.\n\n&amp;nbsp;\n\n**The Setup**\n\nIn a few weeks we are going to have some maintenance done on our electrical systems. This means that all power will be shut off to our server room. Now, a important thing to know is that we are responsible for all IT at our location, but we have a international helpdesk team who among other things monitor all of the companies locations.\n\n&amp;nbsp;\n\nThis story will contain the following characters: \n\n&amp;nbsp;\n\n**Supervisor** - The person responsible for any major IT occurrences at our location.\n\n**IH** - Indian helpdesk team for international support.\n\n&amp;nbsp;\n\n**The story**\n\nA email was send from **Supervisor** to everyone at our location (around 175 people) AND to **IH**.\n\n&gt;**Supervisor**: Just to inform everyone that the coming weekend on the XX power will be off in the building that we are working at. And you will NOT be able to work if you show up.\n\n*Reply all* from **IH**\n\n&gt;**IH**: Hi Supervisor,\n\n&gt;Thank you for the update.\n\n&gt;The ticket INC12345 has been created for reference and tracking of this planned outage.\n \n&amp;nbsp;\n\nAtleast 175 people received information about a ticket being created for a issue they have no control over. At least now everyone in the building knows what ticket number to refer to if they should show up that day and need to complain about there is no internet. (or power)\n\nOn the bright side, none of our users has made a reply all to the email they have received.",
        "created_utc": 1526477873,
        "upvote_ratio": ""
    },
    {
        "title": "“Water is not conductive”",
        "author": "TraitorousTraveler",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jux7a/water_is_not_conductive/",
        "text": "You wanted more stories, I’ve got more stories.\n\nPre-text: I am an engineer who services and supports industrial furnaces. Foundries use our products to melt, transport, hold, and pour iron and aluminum. As a result, I work with a lot of maintenance personnel and machine operators. \n\nI get a call from a client. He informs me that while walking through the vault he saw a wet spot on the concrete below one of his capacitor cabinets. I tell him he probably has a small leak. The unit runs and so it’s not an emergency, but I tell him he should fix it after production ends. I also tell him he should wait 15 minutes at least after the unit turns off before touching anything to let the capacitors dissipate the energy. I don’t hear back from him, so I assume everything’s ok and go on my way. \n\n3 months later, I get sent to this location for a PM visit. I catch up with him and ask him if he fixed the leak. He replies, “Well funny story about that...\n\nSo we turned off the unit shortly after and one of the middle capacitors had a small leak, just like you said from the water hose. I could see it dripping down the bus plate and onto the other connection points. \n\nSo I was waiting and I guess it was a couple minutes when I figured I’d check the temperature of the water cooling. I figure, water is not conductive, it’s ok to touch right?”\n\nI smile a chuckle. He’s not completely wrong. Our water cooling system has a conductivity monitor that is supposed to make sure the conductivity of the water is below 60 uS. But even then it’s just reduced, as completely nonconductive water is theoretically impossible and extremely not conductive (below 20 uS) would eat away at the metal piping a lot faster. \n\n“Anyways, I put my hand under the plate to catch a drop and right as it’s about to fall, I see a flash and I’m on my ass. My hand hurts. My back and leg hurts. I had a burn on my finger.\n\n“I bandage myself up and wait the 15 minutes like you said. Then tighten the hose. So it hasn’t leaked since. \n\n“But here’s the funny part. I get home late and I swear this is true. I walk past my TV and it turns on. Confused, I walk back across the room. It turned off. I go and wake up my wife. I show her and she laughs. For the next week, my tv would randomly turn on and off as I walked past it. “\n\nWe both laugh. How he was alive, I have no idea. If the TV thing was true, I have no idea. But I did find during my PM that the conductivity monitor had a bad power supply, and that the valve to the deionizer tank was a NC valve. Meaning for an unknown amount of time the conductivity of the water has not been monitored. \n\nWhen they finally replaced the monitor, the meter read 1500uS.\n\nEdit: Due to a lot of questions, an explanation of uS. It is the measurement of conductivity also called Mhos. It is the basically 1 uS = 1/ 1Mohms. It is measured standardly as uS per cm at 90 degrees F. Essentially, the water is supposed to act as a huge resistor before he touched. Instead it was significantly less resistant. ",
        "created_utc": 1526477465,
        "upvote_ratio": ""
    },
    {
        "title": "Please don't reply all every time.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jutel/please_dont_reply_all_every_time/",
        "text": "[removed]",
        "created_utc": 1526476539,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of phone did you have? A BLUE one",
        "author": "Lizregbel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jummf/what_kind_of_phone_did_you_have_a_blue_one/",
        "text": "[removed]",
        "created_utc": 1526474802,
        "upvote_ratio": ""
    },
    {
        "title": "How do phone work?",
        "author": "midashand",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8juirt/how_do_phone_work/",
        "text": "One of my primary job responsibilities at my place of employment is overseeing and supporting our building's VoIP phones and their connection to the campus Telecom service. (Skype for Business/Lync with Exchange integration) This ranges from installation of new employee's equipment to setting up temporary call centers for ~~We got your donation, want to make another one?~~ \"Thank you calls.\"\n\nA few weeks ago, one of our internal departments was split to occupy two separate office spaces as well as take on separate duties. Prior to this, they had a main phone number that had served both offices just fine. The receptionist and her assistant would answer the calls, figure out which sub-team needed to get it, and send it on. Now, however, these calls were going to two separate office spaces, so a better solution was needed. \n\nAfter meeting with the department and convincing them to trust me..... (They agreed to my proposal, thank God), it was decided that a phone tree would be implemented to allow callers to dial the same \"Main\" number as before, but then be able to choose which sub-department to get transferred to.\n\nPhone tree is set up and tested, custom recording is done to cover up the \"robot\" voice, and I type up a very nicely formatted email that covers all the changes and what they would mean for the staff. \n\nWe're talking several paragraphs, nicely spaced, bold font on the important parts, the whole nine yards.\n\nToday, I get an email from the receptionist that goes something like this:\n\nCopied Text from my previous email: **$OLDMAILACCOUNT will no longer receive voicemails.** (Since two new mail accounts are now being used, one for each sub-department)\n\nEmail from receptionist: **Does this mean I need to be able to open $OLDMAILACCOUNT to check for any voicemails?**\n\n**facedesk* * I don't drink.... but sometimes I wonder what its like.\n\nTL;DR: User fails reading comprehension and critical thinking.\n\nedit: slight grammar corrections",
        "created_utc": 1526473777,
        "upvote_ratio": ""
    },
    {
        "title": "The bar has been lowered",
        "author": "Carlyone",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jud9y/the_bar_has_been_lowered/",
        "text": "I have this story I need to get off my chest. \n\nI am by far not the most knowledgeable technician at my workplace. While I consider myself competent, I don't have any actual degrees or such like some of my co-workers. I've recently been promoted from first line helpdesk to second line at an IT company and as such my primary duty is knowledge transfer from 2nd to 1st line by the way of writing routines, going to meetings with coordinators and generally answering questions.\n\nDuring our morning meeting where unclaimed tickets are handed out, we saw this ticket on our queue, \"User is trying to send a mail, but it is too large. Can you help us?\". Signed the 1st line Servicedesk.\n\nEven the work area boss who is completely operative and have no deep computer or system knowledge frowned and said, \"They didn't even try to zip it? Send it back and tell them to do that.\"\n\nLater that day it came back to us with notification, \"We don't know how to do that. There is nothing about it in the routines.\"\n\nThe boss for my work area said she was going to take it up on the next meeting with the Servicedesk coordinators and I thought that'd be the end of it. But later that week I got tasked with writing a routine for how to compress files.\n\nSo, I had to spend 30 minutes screenshotting, editing and writing up how to right click on a file, go to send to, compressed folder and how this is different from a normal folder. Also, how to do the same with 7-zip. Right click, 7-zip, compress to zip. To spice it up and get at least some use out of the routine I also explained how to encrypt using 7-zip.\n\nThis seriously made me worry about the future for our 1st line helpdesk. I can see how some users have no idea how to work with compression. But people who are supposed to work with IT for an IT company doing IT stuff? And even if they didn't know, not being able to try and figure it out for themselves by a simple Google search?",
        "created_utc": 1526472324,
        "upvote_ratio": ""
    },
    {
        "title": "Access Form Agony.",
        "author": "sgt_lemming",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jt7kc/access_form_agony/",
        "text": "**Email:** \"Please grant me access to folder &lt;xyz&gt;\"\n\n**Me:** \"As per process and repeated in meeting the other day, please log a ticket and attach a signed access request properly completed. Also I cannot see a folder called &lt;xyz&gt;\"\n\n**Email:** \"Here is a completed form for access to folder &lt;xyz&gt;\"\n\n**Me:** \"Form is incomplete, and I need it as a ticket, and I still don't know what you mean by &lt;xyz&gt;\"\n\n**Ticket:** \"Please grant me access to folder &lt;xyz&gt;\"\n\n**Me:** \"As per process please attach the properly completed access form to this ticket. Also please provide complete path to folder &lt;xyz&gt;\"\n\n**Ticket:** \"Form attached, please action immediately as this is urgent\"\n\n**Me:** \"I still don't have a location for the folder, the form is STILL not completed properly. Please redo the form and provide the COMPLETE path to folder &lt;xyz&gt;. A screenshot is fine\"\n\n**Ticket:** \"Here is a completed form, and the folder is in &lt;mapped drive/xyz&gt;\"\n\n**Me:** \"Form is now completed correctly, but not signed. Please get the completed form signed. Also I need the complete path to the folder, not your mapped drive\"\n\n**Emailfrommanager:** \"User is complaining that you're being un-cooperative, please grant them access to folder &lt;managerscomputer/xyz&gt; immediately\"\n\n**Me:** &lt;/facepalm&gt;\n",
        "created_utc": 1526457876,
        "upvote_ratio": ""
    },
    {
        "title": "The Time Lead Cut Traders off from Profit",
        "author": "charish",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jpwct/the_time_lead_cut_traders_off_from_profit/",
        "text": "So, this is one that I remembered after conducting an interview yesterday for an IT intern position where the chat at the end became more relaxed and I started remembering some of the more hilarious and frustrating times at my first job post-graduation.\n\n\n***Background***\n\nMy first gig out of college was working for an international, multi-billion dollar news agency (henceforth known as **$EvilCorp**) that also had a financial division that provided an application for ~~a bunch of spoiled, over-grown brats~~ finance folks to do trades, calls, puts, research and analysis, view ticker info, etc. I helped support the back-end which consisted of about 3,000 Linux-based market data servers around the world located at customer co-los or our data centers all being fed from said data centers by dedicated circuits (ISDNs all the way up to OC48 connections) at a Tier II/Tier III level. In other words, we dealt with issues that affected multiple users at a client or multiple clients --- or as I liked to call the group I belonged to, \"The 'shit hits the fan' extinguisher.\" Despite the stress and starting to grey at a young age, it was fun (most of the time) as hell and I learned more there than I did in college.\n\nWe were a 24/7 shop due to the global nature of our industry and the various exchanges around the world. My shift was from 7am to 3pm which I both loved and hated: the quiet before the ~~daily shitstorm~~ trading day started, avoiding rush hour on the commute, lack of sleep due to being constantly on-call, starting to grey within my first year there, and leaving the office before the average Joe/Jane in the professional world. It meant I could avoid the crowds in bars after a hard day most of the time or the end-of-day rush hour to get home.\n\nFinally, we had a monitoring system with a GUI written in [TCL](https://en.wikipedia.org/wiki/Tcl) back in the 90s with a Java back-end. As crappy as it was even on the best days, it was pretty damn thorough. We had alerting set up for the servers on everything from resource utilization to process' statuses to thresholds of bad web requests (400s and 500s, namely) to hardware as well as the network side of things which consisted of both the client dedicated circuits and our data centers' infrastructure. There was barely anything that we didn't know about and that which we didn't we simply wrote new hooks and rules for alarm triggers. The alarms that popped up were all color-coded according to severity, which was very hipster-y of us since the U.S. would go on to use almost the same exact scheme immediately after 9/11 (take that, [Tom Ridge](https://en.wikipedia.org/wiki/Tom_Ridge)!). This monitoring system was more or less our sun and our team revolved around it.\n\n***The Characters***\n\n$Ego = ```whoami``` (a.k.a., me)\n\n$Cyril = echo \"Older co-worker close to early retirement who worked the same shift as me. Huge fan of Archer and a lively fellow.\"\n\n$ISPTech = echo \"Random ISP tech on the phone.\"\n\n$MS = Our monitoring system. Not a character, but at times it seemed to obtain sentience for brief periods for the sole purpose of spiting us, the team.\n\n$Hammond = echo \"One of the two dayshift managers. A Ukrainian guy not much older than I was, he was a hard-ass but one of the most techie guys I knew both in and out of $EvilCorp. Also my mentor during this time with a tough-love friendship.\"\n\n$Troll = echo \"One of the evening shift managers, even though he came later in the morning than the morning managers. Laid back guy who loved to troll the other managers and subordinates, sometimes too much. But, all in all, we had plenty of laughs with him.\"\n\n***The Story***\n\nI walked into the office at the unholy time of 6:30am when I spoke two words worth of greetings to my two overnight colleagues through a stifled yawn and bloodshot eyes. As per my built-up morning routine at this point (9 months after my start date), I dropped my messenger bag off at my cube and shuffled my way to the office kitchen to make myself some chai which I consumed two cups of before making a third and going back to the main floor. Being on the dawn shift that takes over from the graveyard one, I always chatted with the overnight shift about life, love, and setbacks... and also the hand-off for any outstanding issues, tickets, or calls that might have arisen during their shift or that carried over from the day before. Luckily, our monitoring system and all else was quiet aside from stuff that was up there for the last 24 hours plus so the overnight analysts said, \"Kthxbai,\" and bolted for the elevators to sleep in their own ~~coffins~~ beds.\n\nA few minutes after they left, $Cyril strolled in through the door, chipper as ever at this unholy hour with his poor imitation of The Count's laugh. We both finally got settled in our adjacent cubicles and started combing over everything the graveyard shift passed on to see what we could actually make progress on at 7:05 in the morning. There wasn't much apart from a few follow-up emails bugging a variety of clients' techs for the latest status of action that they had to take on their end before we proceeded further (read: telling them to do their jobs so we could do ours and meet SLAs before being scorned for not doing so). Some time later, though, was when things *really* began to pick up.\n\n&gt; $Cyril: Hey $Ego, uhhh, is $MS spazzing on my terminal or is this legit?\n\nMy head swiveled to the third monitor on my right that was hooked up to a thin client from where we accessed all our servers and networking hardware via SSH as well as where $MS was on display. The monitoring system was bleeding red, pushing all the less recent alarms out of view in its narrow window like a messenger wading through the crowd warning of the marching Persian horde. The alerts were for a slew of circuits, all in all about 20. Now, most of our clients had redundant circuits so these were a mix of primaries and secondaries that went down but there were a few smaller, stubborn ones that only had one line for their feeds so these guys were down hard. $Cyril and I broke into instinctually into our ~~Spartan~~ job training and started pulling up site diagrams, remoting into routers to test connectivity to make sure there weren't any false alarms. Unfortunately for $Cyril and I, they weren't false positives, *but* there was one silver lining in all of this: most of the circuits had a common ISP. The ones that didn't, in these cases, were usually assumed that even though the circuit was managed by another ISP, they probably had a hand-off to the affected ISP somewhere along the path. Once we confirmed that the lines were actually down, $Cyril and I flipped a coin to see who would get stuck with calling the circuits out to the ISP. Needless to say, I got stuck with the task.\n\nI started creating tickets for each circuit under every &gt;affected client in our CRM/ticketing system, Siebel (if you've ever used Siebel, you may think of it as the digital devil incarnate of ticketing systems much like my group and I did). There I was, cloning and editing tickets while on hold with the ISP when, after creating the second to last ticket, I finally got a human being on the phone.\n\n&gt; $ISPTech: Thank you for calling $ISP, can I get your company and circuit ID?\n\n&gt; $Ego: Hi, this is $Ego from $EvilCorp. We're seeing a metric ton of circuits that went down about 15 minutes ago. **starts listing off the circuit IDs**.\n\n&gt; $ISPTech: Is it alright if we do some non-intrusive testing?\n\n&gt; $Ego: Think it's safe to say that this is something larger.\n\n&gt; $ISPTech: ... Right. Is there an internal ticket number I can reference?\n\n&gt; $Ego: **finally getting around to creating the \"master\" ticket to which all the previously created ones will be linked to** Ticket number from our side is 0123456789.\n\nIt was 8am now by this point which the time that $Hammond walked into the office, almost passing by me and $Cyril when he paused to look at the giant 80-inch screen that loomed over what we called \"the platform\" (I'll explain this later) with a raised eyebrow and his coffee halfway to his mouth.\n\n&gt; $Hammond: Is anyone ---\n\n&gt; $Ego: **raises hand**\n\n&gt; $Hammond: Do we have a hot topic? (*Aside*: \"Hot topic\" in our nomenclature was basically a master ticket to which multiple tickets of the same issue for different clients were linked to)\n\n&gt; $Ego: It's 01234556789; I'll email it over.\n\n&gt; $Hammond: Have the clients been informed?\n\n&gt; $Ego: I just got off the phone with $ISP, so I haven't had a chance to. We do have a few single circuit sites that are down.\n\n&gt; $Hammond: $Cyril, call the sites and see what shape they're in.\n\nPhone calls and emails went out to the affected clients to let them know what was going on. Naturally, the ones who were in single circuit sites were in a panic and we (me and $Cyril) had to calm them down and manage their expectations to let them know that this was out of our direct control, thus they would ~~have to untwist their drawers~~ be patient. Privately, though, we were thinking, \"These folks are idiots for not having any redundancy.\" Now, because this impacted so many clients, it was unofficial policy to ~~pester~~ follow up with the ISP(s) on an hourly basis for the latest status and possibly see if there was something that we could do from our end to alleviate the issue in the interim. If you've ever worked with an ISP in a B2B capacity, this tends to be near impossible as they'll insist that their techs are working on the issue along with few technical details about the problem. Fast forward to about 10:30, we finally received an update that was worth communicating to our clients: they had found an above-ground backbone line that had the issue and they were dispatching techs to the site to fix it up.\n\nOkay, fine. So, me, as the owner of the issue/master ticket, got to twiddle my thumbs even faster. While looking at $MS some time later, the open cuts in my day known as the red, critical alarms began disappearing in semi-quick succession. I reached out to $ISP to get a root cause and the conversation went like this (paraphrasing as this was years ago):\n\n&gt; $Ego: Hi, this is $Ego from $EvilCorp calling about ticket $ISPdigitdigitblahblah.\n\n&gt; $ISPTech: Give me a moment to get it pulled up... Reading through it now...\n\nThen $ISPTech starts bursting out in wholehearted laughter.\n\n&gt; $Ego: ... Dare I ask the root cause?\n\n&gt; $ISPTech: So, the trunk line that was affected was severed by a stray bullet.\n\n&gt; $Ego: **face starts contorting to avoid bursting out into laughter at this point** Well... that's a new one.\n\nAfter I hung up with $ISPTech and started updating my ticket, $Troll walks over to get an update ($Hammond was down for a smoke which, sadly, I couldn't join him for; our smoke sessions served as unofficial meetings and status updates and general chat).\n\n&gt; $Troll: So what did $ISP say?\n\n&gt; $Ego: A bullet cut the fiber line.\n\n&gt; $Troll: ... Let the clients know, but be more, uh, euphemistic about it.\n\nThe final calls and emails went out, but I couldn't resist the constant muting of my phone to try and contain my laughter. The clients that were affected were on the opposite side of the country, hence why they were impacted the most.\n\nTL;DR: None. Read at your own leisure. :)\n\nEDIT: Corrected formatting for easier reading.",
        "created_utc": 1526424183,
        "upvote_ratio": ""
    },
    {
        "title": "Remind an old dog old tricks, it works.",
        "author": "KazumaKat",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jpexa/remind_an_old_dog_old_tricks_it_works/",
        "text": "[removed]",
        "created_utc": 1526420199,
        "upvote_ratio": ""
    },
    {
        "title": "A virus was brought in on a thumb drive? Remove the internet!",
        "author": "FoxyKG",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jpe6h/a_virus_was_brought_in_on_a_thumb_drive_remove/",
        "text": "[removed]",
        "created_utc": 1526420039,
        "upvote_ratio": ""
    },
    {
        "title": "Disconnected",
        "author": "serotonineoverdose",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jp120/disconnected/",
        "text": "I have a story as a user of tech support, I hope that's okay. \n\nA few years back both me and me brother went back to my parents place for some family time \\(We're both early twenties, both left for university. So we're all a bit excited to be seeing each other again\\). My father is not home and we decide to watch a movie together with my mother. However my brother quickly finds out that the television is not working, all we get is a blue screen. Both my brother and me take a look and check for connecting wires, but can't find the issue. So we decide to call tech support. \n\nMY mother says to call from the landline as it's the cheapest, so I'm on the couch taking the call and relaying everything the guy on the other end says to my brother who is crawled half into the cupboard we use to hide the mess of wires and gaming consoles surrounding the television. \n\nWe're having a pretty good time doing all this, my mother has left for the kitchen to make popcorn and occasionally shouts to us for updates, while me and my brother are joking around together trying to get this fixed. The tech support man meanwhile seems to be enjoying himself too as I describe my brothers efforts to him. \n\nWe try several different things, but nothing seems to work. \n\nSo after a while the tech support man says that it might be a good idea to just pull the plug and then try to turn it back on again. Me and the tech support man joke about this ancient remedy while my brother tries to find the right wire in the mess. Then brother shouts to me from the depths of the cupboard that he found it. \n\nBrother to me: 'So I just pull it?'\n\nMe to tech support: 'So he just pulls it?'\n\nTech support: 'Yes.'\n\nMe to tech support: 'Okay he is doing it… now!'\n\nBrother to me: 'How long do we wait before we plug it back in?' Me to Tech support: 'How long do we wait before we plug it back in?\n\nAre you still there?\n\nHello?'\n\nNow I imagine this tech support man, probably near the end of his shift. Joking with us but also trying to keep it professional. Sitting in his desk chair while I describe the mess of wires to him and my brother knocking things over, with my mother occasionally offering comments screamed form the kitchen like : 'Ahh, so that is what those lights are for? ' And then he tells us to pull the plug. I say 'now! ', and the next thing he hears is just: bleep bleep bleep…\n\nBecause both me and my brother completely forgot we were calling on the landline \\(because who the hell calls on a landline anymore?\\) and the landline is plugged in with the same main plug as the tv. So when he pulled the main plug from the wall, we disconnected the call as well.\n\nOf course when we realized our mistake it took a few minutes to calm down the laughter before we felt confident enough to call into tech support again…",
        "created_utc": 1526417270,
        "upvote_ratio": ""
    },
    {
        "title": "University Nightmare Client",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jooqc/university_nightmare_client/",
        "text": "[removed]",
        "created_utc": 1526414660,
        "upvote_ratio": ""
    },
    {
        "title": "The alarm doesn't control your key....",
        "author": "xkaosphoenix",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jool3/the_alarm_doesnt_control_your_key/",
        "text": "FTP;LTL\n\n $Me - Work as a field service tech contracted to a Fortune 500 company retail store\n\n$Clueless - New manager at one of the sites I visit\n\nI walk into the site and do my regular walkthrough looking at the POSs, Sigcap devices, printers, etc. We do not currently have keys to the server room where all of our spare parts and things are also stored, so we must have a manager assist us in getting inside the room.\n\nI locate someone wearing manager attire and badge($Clueless), and inform them of who I am and that I need assistance in accessing the server room.\n\nWe walk to the back of the store and this door has always been quite finicky in the lock. Countless keys have been stuck for minutes on end trying to wiggle them out. I had no idea she was new, so I didn't think to mention it.\n\nShe inserts her key, gets the door open, and her key gets stuck. I happen to notice the alarm for the server door wasn't set. The following conversation takes place.\n\n$Me: Please be sure the store manager and LP manager know that the alarm for this room is supposed to be set unless I'm on site.\n\n$Clueless: The alarm says it's not ready to arm.\n\n$Me: That's because the door is open so there's nothing for the alarm to monitor.\n\n$Cluess: Oh, so that's why my key won't come out? Some sort of security measure?\n\n$Me: No ma'am. That's just a wooden door and it's most advanced piece of technology is probably the lock, which is just a lock.\n\n$Clueless: Oh, so if I set the alarm, the lock will disengage?\n\n$Me: No....the lock has nothing to do with the alarm.\n\n$Clueless: But you just said the alarm wasn't ready because the door isn't shut....\n",
        "created_utc": 1526414630,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried turning THAT off and back on too?",
        "author": "Rockeye_",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jolx8/have_you_tried_turning_that_off_and_back_on_too/",
        "text": "I'm going to try and fail to keep this tale short.\n\nWe got called in on a Sunday for a Critical level ticket. This customer has a PROD database with two machines in a failover cluster so that if one dies the other takes over, but both machines are connected to a single Storage Area Network (SAN). The way we configured it, the SAN was basically a big external hard drive. At about the same time, a flurry of about 30 emails from our monitoring software came in, which summed up to \"Two servers shut down\".\n\nWe immediately tried to remote in - failed, of course - then used a very nice hardware-level remote console tool through the network at our datacenter that is supposedly just like being there with a keyboard and mouse, but saw only a blue screen of death indicating a memory dump.\n\nBoth servers had restarted at around 9 AM for unclear reasons, both refused to start up again - lingering on a boot screen for hours on end. Even when we tried to boot to the installation CD and called an expensive tech support line, the system just wasn't responding at all. It literally took 45 minutes for it to load the installation CD.\n\nThis is a production system which is $Client's core product, and it was down without explanation or warning on a Sunday - and STILL down on Monday - so the whole time $Client is shouting our ears off with emails, phone calls, tickets, etc. $Boss ran interference, which I was extremely grateful for.\n\nTroubleshooting attempts continued. Left alone, the machines WOULD eventually boot after several hours, our monitoring software celebrated - for about twenty minutes, and then they crashed again. Long story short, we didn't get much sleep, continually troubleshooting, and about 28 hours later we managed to extract a memory dump file and dig through it to find that the system was shutting down by a watchdog trying to protect the system from data corruption, because it couldn't read the database files...\n\n...Of course. We were idiots. We'd restarted the machines themselves a dozen times, but we never checked the SAN that they were both connected to. The SAN, in a different rack than the servers, was flashing amber lights at us.\n\nIt still took another two hours of trying to gracefully recover the SAN, terrified of data corruption (It sounds a Bad Idea to shut down a SAN with a cache error), but in the end $Boss decided 'screw it, turn the whole thing off and back on again, can't get any worse than PROD database down for a whole day'. Thirty minutes later, everything was working again. I drove home, fielded some emails from relieved client, and slept for 10 hours straight.\n\nEdit: Yeah, I'm not really proud of our performance there, but lesson learned hopefully.\n\nTL;DR: Have you tried turning THAT off and back on too?",
        "created_utc": 1526414091,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure you have a problem?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jofn1/are_you_sure_you_have_a_problem/",
        "text": "[removed]",
        "created_utc": 1526412772,
        "upvote_ratio": ""
    },
    {
        "title": "Old Professor and the porn viruses",
        "author": "zekfen",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jof7f/old_professor_and_the_porn_viruses/",
        "text": "[removed]",
        "created_utc": 1526412677,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure you are an electrician?",
        "author": "TraitorousTraveler",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jnr53/are_you_sure_you_are_an_electrician/",
        "text": "I don’t know if this fits here cause I’m not tech support, but I hope it’s close enough. I’m an electrical engineer that works field support for industrial furnaces. I have a lot of stories of stupid maintenance personnel, but this is my favorite. If you guys feel this stuff can fit here, I may share more. \n\n\nSo we receive a call from a client. They are having the most common problem with our furnace. They have a ground problem. Usually this means the aluminum or iron has gone through the lining so we start there. We instruct the maintenance personnel to check the lining of the furnace for penetrations and if it’s not that, remove the yokes one by one to inspect that. We tell them to call us back after. \n\n\nCouple hours later the client calls us back.\n\n\nClient: It’s not in the furnace.\n\nMe: Well we don’t know that for sure yet. It still can be. There’s one more step.\n\nClient: It’s not.\n\nMe: Well we can prove it by removing one side of the bus. \n\nClient: The what?\n\nMe: The bus bars. \n\nClient: What?\n\n\nInternal sigh. Apparently this guy has little training on our units despite having a contract for training every 6 months. \n\n\nMe: The two metal tubes that conduct the electricity from the power supply to the furnace.\n\nClient: Oh. Yeah. How do I do that again?\n\n\nTrigger face palm. \n\n\nMe: Unbolt it above the capacitor cabinet and add insulation paper between the bars. \n\nClient: That sounds like a pain. \n\nMe in my best salesman voice: Well if you want we can retrofit an isolation switch in there at some point, which will ease the troubleshooting in the future. \n\n\nHe grumbles. \n\n\nMe: But for now, this is what you need to do. Call me back after. \n\n\nI hear back from the client the next morning. \n\n\nClient: It’s still grounding out. \n\nMe: Bus disconnected?\n\nClient: Yes. \n\nMe: Ok that means we have isolated the problem to the power supp-\n\nClient: We need a field service guy. \n\nMe: There’s one more step-\n\nClient: Just get here. \n\nMe: He’ll just sit on his butt the first day while he makes you go through the procedure. \n\nClient: I’ve got a P.O.  just get out here. \n\n\nSurprised, and a little frustrated, I go to my boss with the P.O. so he can pick out the guy who’s gonna go.  It’s Friday, so the client won’t be able to get parts, and my boss sends the weekend quote, trying to talk him into finishing the procedure himself. He has none of it. Boss tells me I’m going since I started it. Reluctantly, I book my flight to Kentucky. \n\n\nI show up the next day on site, ready to get to work. I meet the guy I was on the phone with and ask him if he can partner me up with an electrician since its an electrical issue. To which he replies, “I am an electrician.”\n\n\nI contain my shock, and proceed to the furnace. \n\n\nMe: There’s a slug in there. \n\nClient: Yeah, you took too long. It hardened up. \n\nMe: How can you tell if there’s penetrations with a full furnace?\n\nClient: The metals all there! I can’t see any penetrations, can you?\n\n\nI sigh. This is bad, as remelting the furnace like that will cause the metal to expand and damage the lining. I explain to him this and despite his concerns of the expense, we move on. I now obviously know he did nothing I had asked him to, but with a full furnace I can’t start there. \n\n\nWe go downstairs, and rather obvious by now, the bus is intact.\n\n\nMe: You said you disconnected the bus. \n\nClient: Well, it’s water cooled and I didn’t want to get things wet. \n\nMe: That’s why you disconnect it between the cooled lines.\n\nClient: What?\n\nMe: I need you to disconnect it here. \n\n\nI point at a section of the bus where the water lines change out. He tries to get me to do it, but I can’t fly around with wrenches that big in my box, so he reluctantly does it himself. Afterwards we turn it on and luckily the ground stayed. It’s in the power supply, which means we can find it! Unfortunately the ground meter is up two flights of steps, so checking it every few minutes would be a pain. \n\n\nI ask if he has a spare ground meter, and luckily he does. He runs and gets it and it’s our 0-10V style meter. Awesome. We head downstairs. \n\n\nMe: Ok. Next step is checking the capacitors. \n\nClient: Oh. Wait. How do you check a cap?\n\nMe: Well you have to pull it out of circuit one by one and turn it on again. That’s why I had you get the spare meter. I need you to wire it up in parallel with the one upstairs. \n\nClient: parallel?\n\nMe: Parallel.\n\nClient: How?\n\n\nWhat I wanted to say was “Are you sure you are an electrician?”\n\nI proceeded to explain to the client what the difference between series and parallel was, and then we found a bad capacitor. We disconnected the capacitor from the circuit and he was able to run again. \n\nOn my way out of the plant, I informed him that while it’s safe to run without one or two capacitors in circuit, it won’t be the ideal resonance frequency and prevent him from going to full power. It would reduce his efficiency. That he really needed to buy a new one if he wanted to run at full power. He said he understood and sent me on my way. \n\nNot a month later, I get a call from my boss. Apparently he was complaining cause his 1MW furnace was only running at 937KW and doesn’t know why. \n\nHe has yet to replace the bad capacitor. ",
        "created_utc": 1526407829,
        "upvote_ratio": ""
    },
    {
        "title": "[Engineering Support] Are you sure you are an electrician?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jno88/engineering_support_are_you_sure_you_are_an/",
        "text": "[removed]",
        "created_utc": 1526407229,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from Desktop Support - The willing student who couldn't. ​",
        "author": "techtornado",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jngq3/tales_from_desktop_support_the_willing_student/",
        "text": "This is my origin story, it's laid out in chapter format and I seek to share something different because there is nothing new on [my cutover story yet] (https://www.reddit.com/r/talesfromtechsupport/comments/87as24/the_cutover_part_1/)\n\n$Me - IT student, really really good with computers and networks already, couldn't take Senior/4000 level classes as a freshman due to some CompSci rule apparently.   \n\n$Systems - Grouchy, didn't really fix anything to the public eye, somehow unstable DHCP using public IP's internally and 6 DNS entries per IP was a normal configuration.  \n\n$ITSec - Had some very interesting ideas about network security.\n$NetTeam - Smart, overloaded, at the mercy of someone else calling the shots.\n$CIO - Got problems somewhat sorted out, definitely better than the previous 2 years.    \n$Bradford - Actual name of the NAC, it's terrible and very forgetful implementation.      \n\nThis was the story, campus network generally was bad, when it worked, it was okay, but there were many days where no one could get online, sometimes it was the fault of IT, usually just DHCP dying, and lastly because of the magnetic attraction fiber has with heavy equipment - [as it is SCP-3709 compliant] (http://nn5n.com/index.php?language=English&amp;prefix=scp&amp;object_number=3709&amp;postfix=en&amp;page=object&amp;range=1-99&amp;page_type=current) it's great read and it explains why fiber gets cut so much.   \n\nProblems would always manifest themselves in the Fall/Autumn semester which was the freshmen flood of new students.\n\nI immediately recognized the problem even before I started - DHCP scope/pool exhaustion!\nIT was informed promptly.  \nIT did not succeed in improving the situation.  \nOff and on the network would go, round and round IT would go, never to stop or make anything much better.      \n  \nOne time, at a student banquet, we got to meet various upperclassmen and visit the job fair, one guy was talking in an IT group about the student who kept hammering on them to fix the internet.  \n\\*I introduced myself as that student*\nHe responded in a joking manner, so you're the one who kept telling me how to do my job!  \nI have ideas, I know of ways that work, trying to help \\*shrug*    \n  \nSo, I applied and made it on a helpdesk position at the school, never did make it to Systems or NetOps, but I rocked that helpdesk and was assigned team lead to ~~boss around~~ teach interns what it's like to wrangle computers.    \n  \nA year or so later, a wild IT Security officer appears!\nThey host an open student forum about various concerns and making improvements for the campus. I ask about getting off of public addresses internally, she says due to various compliance reasons, they can't do that yet.    \n\n$Me - Ooookay... can you at least fix DHCP to not crash every week?    \n$S - Uhhhh, work in progress...     \n\nA few months later due to $ITSec's decisions...     \n$Me - Hey guys, do you have email?    \nJack - No...   \nSteve [from a previous story about a jar] (https://www.reddit.com/r/talesfromtechsupport/comments/75ycz9/tales_from_desktop_support_the_jar/) \nNo...   \n  \nJack inquires in the weekly IT meeting, $ITSec had changed system passwords without telling anyone and broke about 7 different and very important services. Including a firewall rule change that denied all email connections in and out of the College.    \n\nThat was a fun morning on the helpdesk, the phone never did stop ringing...     \n\n3 month's later it's midterm exam week and as the evening progresses, the connections are dropping off one by one, not good, not good!   \n\nI run over to the datacenter and inform them.   \n$Systems- No it's not, what do you know kid?    \n$Me \\*internally* Apparently more than you...    \n$Me \\*externally* Watch, see my phone not getting an address?   \nThe network/DHCP is dying!      \n$Systems- Bugger off!  \n\nYou guessed it, the entire network floundered for the rest of the weekend.      \n\nA New CIO:  \n His arrival is announced in a very formal and professional way, like an esteemed scholar would write a sonnet at sunset. I email him with the eloquence of a Renaissance poet describing how there is more downtime than uptime and DHCP must be fixed to not ever crash under extremely high demand every fall/spring. He acknowledges it and says it will be prioritized accordingly.       \n\nFor a while, things did get alot better, then there was some political power struggle which drove off a good part of the IT team and that means all of the good people with great ideas left...     \n  \nSuddenly, a new NAC arrives without warning or surveying the students on what they want out of an awesome network. Bradford was unleashed and stomped out all hope of having a reliable, fast, or efficient network access.    \n\nMe \\*thinking* - You know what, since all web requests are redirected the portal, let me change my DNS to 8.8.8.8, BOOM! Bypassed!   \nNext semester, all DNS requests are now forwarded internally through Bradford, you're welcome said the IT guys. ;)    \n\nWell kids, it was fun while it lasted.   \n  \nBradford was notorious to forget previously registered staff computers, three computers a week was the average where a professor would submit a request that they're not getting email/internet anymore.Can IT reach the computer remotely? Nope! What's the IP? Bradford Isolation network, figures \\*rolls eyes*   \n\nWe had to submit port and computer exemptions all the time just to get computers imaged, staff online, and new systems deployed, it was a huge waste of time and $DesktopSupport had to bug $Networking quite frequently to speed up the process.    \n \nThey moved Bradford to wired only because of how much of a pain wireless was for the students, I would say that there was a 25% failure rate to get people online for the wifi. After $Net moved to a $HoneyComb PPSK, it dropped/dripped the failure rate down to 10% but for some reason, $ITsec did not believe in 802.1X/Radius even after multiple professional colleagues recommended it.   \n  \nOnce again, the PPSK method was not presented or held an open forum for wifi modernization, they just announced, hey we're doing a thing, call the helpdesk if it breaks, may the odds be ever in your favor. During this time, they finally NAT'ed the wifi network, it only took asking them 4000 times and 15 years of prep time /s.    \n  \nLast in the whirlwind take, internet failures on the WAN side happened multiple times, and there was one outage that was $DeathStarISP's fault and was never disclosed what happened, because when you kill cellular + wired service for a large portion of the state, there's going to be a rather large and annoyed set of students needing to finish exams.    \n  \nRandomly one fine spring afternoon, the internet just stopped, and it wasn't DNS or DHCP like before. $RandomProf - Well, there goes the online instructional tools, powerpoint time!  \nWe get an announcement later saying there was digging happening in a nearby city, combined with the SCP compliant fiber and assorted heavy construction that goes with the project, they predictably they cut the only connection serving the school.  \n\nDid they relocate the fiber away from the construction area?   \nNo....    \n\nDid it get cut more than once?   \nYep! 4 times during especially busy parts of the semesters.  \n  \nDid they learn their lesson and get a second connection?    \nEventually...    \n\nThroughout all of it, I learned what not to do, I discovered some new things, aced senior level Networking without ever having to study, and sharpened my tech support skills tenfold while repairing friend and company computers/figuring out the kludgy network design/asking why on earth would you do it this way?​  ",
        "created_utc": 1526405630,
        "upvote_ratio": ""
    },
    {
        "title": "Every user doesn't suck (short)",
        "author": "W1nt3rmute",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jn9sj/every_user_doesnt_suck_short/",
        "text": "God bless our school teachers but they aren't always the most willing to learn.\n\nSo after distributing new shiny laptops without DVD drives, this older luddite asks how can she use her existing DVDs that she has been using for her lesson plans. I tell her we've purchased external DVD drives but just seeing it puts her in a panic. I explain that I can show her how to easily create an MP4 with handbrake and volunteer to do 1 or 2 so she understands how to make herself..teach a man (woman) to fish, right? Her eyes glaze over and I know right away this isn't happening.\n\n&gt; \"How many DVDs do you have?\"\n\n&gt; \"Six,\" she says, and now my eyes glaze over as I grab them all and tell her I'll be back in a bit.\n\n\nAfter doing my thing, I load 'em all on a USB drive and put them on her new laptop and she is absolutely overjoyed.\n\n&gt;\"Don't tell anyone I did this for you,\" I state. The last thing I want to become is Mr. Handbrake.\n\n&gt; \"Don't worry, I take care of my own, and thanks.\" Ok, all good lady. I did my good deed for the day and think nothing of it.\n\nToday she hands me this. To reference Zombieland Rule #32, \"It's the little things.\" My day is made, and my belly is full. Be good people!\n\nhttps://drive.google.com/file/d/1MtsNRg9eUwhF9qzuh9vLIB4vF6zqiqmp/view?usp=sharing\n\n\n\n\n",
        "created_utc": 1526404199,
        "upvote_ratio": ""
    },
    {
        "title": "Of course I did. Do you think I'm stupid?",
        "author": "captain554",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jn7y9/of_course_i_did_do_you_think_im_stupid/",
        "text": "Short story today. This is back when I ($Me) started my first real tech job as a Jr. Net Admin/Help Desk for a small company. One of my users, we'll call him $Foxers, had a very short temper and a low tolerance for technology. I officed with the accounting staff, we'll call them $Geese. \n\nI started my morning with a red-faced $Foxers coming into the Admin office, clearly already upset. \n\n&gt;$Foxers: My damn computer won't turn on. It most be going bad- I probably need a new one. It has done this before. \n\n&gt;$Me: Okay. Did you make sure everything is plugged in? *I legitimately asked this question without malice. I was just in my  troubleshooting mindset. Check the power first... lol*\n\n&gt;$Geese: **all the geese snicker and try to hold back laughter**\n\n&gt;$Foxers: **face turns bright red** Of course I did. Do you think I'm stupid? I wouldn't come over here if I had not tried everything already.\n\n&gt;$Me: Okay, let's go check your computer. *It was a laptop*\n\nWe proceed to walk over to $Foxers desk, the whole time he was complaining about his computer and all the work he had to do. His $coworkers hear all his complaining and start to look at us, curious.\n\nI look down at his laptop and everything looks normal. I press the power button- nothing happens. I tilt the screen forward and see that the AC adapter was plugged into the wall, but not into the laptop. I plug it in and press the power button once more. Everything works. **insert NicholasCageYouDon'tSayFace**\n\n&gt;$Foxers **turns even brighter shades of red and crosses his arms**\n\n&gt;$Foxers: It was... I thought I... you know what... uh... thanks man. Sorry.\n\n&gt;$Me: Just let me know if it acts up any more and I'll be happy to help. \n\n&gt;$Coworker to me: Hey $Me, are you telling me $Foxers pulled your ass all the way over to his desk just because he can't plug in his AC adapter?\n\n&gt;$Coworkers all laugh at $Foxers\n\nTL;DR- If your computer does not turn on, check the power. \n\n",
        "created_utc": 1526403853,
        "upvote_ratio": ""
    },
    {
        "title": "Need Photoshop now!",
        "author": "TechieYoda",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jmj9f/need_photoshop_now/",
        "text": "Short one just happened this morning.\n\nCast: Unicorn = user who thinks she gets preferential treatment because of her title/job/role.\n\nTech = other help desk tech who took the call\n\nTechieYoda = your guide for this story. Also a help desk tech and all around Google-Fu wizard\n\n&gt; Tech: Help Desk, this is OtherTech. How can I help you today?\n\n&gt; U: Hi Techie, this is Unicorn over at dept. I need Photoshop installed today for &lt;long winded explanation of project&gt;.\n\n&gt; Tech: Ok, let me put in a ticket and we'll see if we can get someone over today.\n\n&gt; U: I need it today if possible.\n\n&gt; Tech: I understand, we have X and Y special events going on so I'm not sure if we have a tech available so I'll put in a ticket and we'll see what we can do.\n\n&gt; U: Okay thanks...\n\nOnce the ticket came through I expected the usual...Immediately pulled up her PC info and lo and behold: a 4 year old PC with 4GB RAM *facepalm*\n\nSince I have another ticket for her I grab this new one.\n\nThe preexisting ticket is for a new laptop setup which is scheduled for *tomorrow* and already has Photoshop (whole Adobe CC suite) installed.\n\nThrough the ticketing system the following conversation takes place (within 10 min after phone call).\n\n&gt; Me: Hi Unicorn, I see your new request for Photoshop on your desktop. To confirm, your new laptop has Photoshop installed already. We're still on for tomorrow morning right?\nAlso, because of the age of your PC, the installer can easily take several hours and impact your PC's performance. We'd recommend installing it on a day when you can use your **new laptop** instead of the desktop.\n\n&gt; U: Hi TechieYoda, what about installing it after hours?\n\n*say what?*\n\n&gt; Me: We could, though if something goes wrong with the install, this means having to wait even longer to get Photoshop installed. Are you sure you'd want to have it installed after hours? If so, I can do it tomorrow night *I'll just run the setup and if it fails, it fails*\n\n&gt; U: Tomorrow night is not good for me, I'll be working until 8 PM at least... I know most people get off around 5-5:30... Can we do it Thursday night instead?\n\n&gt; Me: Sure thing. I'll plan on pushing the installer Thursday evening. Be aware that in case of an error, you may not have Photoshop until next week.\n\n&gt; U: okay thanks...\n\nTl;dr Users lie.  Unicorn puts in an \"urgent, need today\" request for software and she ends up deciding to have it installed 2 days later...",
        "created_utc": 1526398713,
        "upvote_ratio": ""
    },
    {
        "title": "It would have been faster to go home &amp; get my laptop",
        "author": "urabusPenguin",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jmg38/it_would_have_been_faster_to_go_home_get_my_laptop/",
        "text": "User1: \"I forgot my laptop at home. Do you have another I could borrow for the day?\"\n\nMe: \"Sure, give me a minute to update the software on it &amp; I'll bring it up.\"\n\n*5 mins later I dock the laptop at his desk &amp; start it up.*\n\nUser1: \"The keyboard's not working.\"\n\nMe: \"Yes, Windows is still automatically searching for the driver for your keyboard to install it.\" User1 has a non-MS ergo keyboard that he purchased himself. \"Give it a minute &amp; try again.\"\n\n*2 minutes later*\n\nUser1: \"It's still not working\"\n\nMe: *Sigh* \"I'll open the laptop up &amp; log in as admin so we can switch your monitors position while we wait for the USB keyboard.\"\n\n*I log in &amp; switch the monitors around. The USB keyboard works when I'm finished.*\n\nMe: \"Okay User1, can you log in now?\"\n\nUser1: \"Sure\". *User1 logs in.* \"Why is it taking so long?\"\n\nMe: \"You've never logged into this laptop. The laptop needs to download your profile from the server.\"\n\n*5 mins of non-interesting small talk.*\n\nMe: \"Okay let's open Outlook &amp; make sure FileSite loads correctly.\" \n\nUser1: \"Thank you, everything looks good... This took a long time; it would've been faster to go home &amp; get my laptop.\"\n\nMe: \"No problem.\" *Exits quickly before saying something that can't be unsaid.*\n\n\n\nThe kicker is that I know that User1 lives literally two blocks from the office.",
        "created_utc": 1526398024,
        "upvote_ratio": ""
    },
    {
        "title": "i have no idea if this call was over...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jm93e/i_have_no_idea_if_this_call_was_over/",
        "text": "[removed]",
        "created_utc": 1526396539,
        "upvote_ratio": ""
    },
    {
        "title": "Error message that tech can't see",
        "author": "kostic31",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jlpa9/error_message_that_tech_cant_see/",
        "text": "LTL FTP ... I'm french so pardon my english !\n\nA short story of a young tech who discovered that asking the right questions at the beginning is way better than at the end.\n\n*****\n\n**$me** : would be me, a Tier 1 helpdesk tech only 2 weeks on the job\n\n**$lady** : would be the lady with the error message\n\n&gt;$me : Hi, this is $me, how can I help you ?\n\n&gt;$lady : Hi, I have a error message on my screen about some resolution issue and I can't get it to go away.\n\n&gt;$me : Ok, there is always a red cross in the top right corner of error message. Can you click on it ?\n\n&gt;$lady : No, there is no red cross.\n\n&gt;$me : Ok ! Is there any \"Cancel\" or \"Ok\" button that you can click on ?\n\n&gt;$lady : Nope !\n\n*$me Whaaaatt !!!*\n\n&gt;$me : Ok ! May I have your $WorkerID and $ComputerName, I'm going to remote on your computer.\n\n&gt;$lady : Sure, it's $WorkerID and $ComputerName.\n\n&gt;$me : I'm connected now, can you show me the error message ?\n\n&gt;$lady : Can't you see it, it's in the center of the screen.\n\n&gt;$me : I see no error message madam. Do you happen to have a secondary screen ?\n\n&gt;$lady : No\n\n&gt;$me : Are you sure ?\n\n&gt;$lady : Yes ! \n\n&gt;$me : Is $ComputerName really you computer name ? Let me spell it : $ C o m p u t e r N am e ! Is that correct ?\n\n&gt;$lady : Yes, that's correct.\n\n&gt;$me : So where is the error message ?\n\n&gt;$lady : Right in the middle of my screen. \n\n*$me loosing hope*\n\n&gt;$me : Can you point with your mice where the messsage is ?\n\n&gt;$lady : I can't ! Each time I move the pointer to the message it disappear.\n\n*$me Whaaaatt !!!*\n\n&gt;$me : What's disappearing ? The error or your pointer ?\n\n&gt;$lady : My pointer !\n\n*$me Sudden flash of realisation*\n\n&gt;$me : Can you read me the full error message ?\n\n&gt;$lady : .... The current resolution is not recommended .... \n\n*A quick change of screen resolution later and the problem is solved*",
        "created_utc": 1526392138,
        "upvote_ratio": ""
    },
    {
        "title": "Despite our incompetence, we didn't do _that_",
        "author": "lawtechie",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jlkol/despite_our_incompetence_we_didnt_do_that/",
        "text": "I'm a part of a team doing a security evaluation of a health information company, HealthCo. HealthCo is one of those health care ecosystem companies that doesn't provide healthcare or payment, but instead does some kind of information processing that is why you have to call some help line to get a procedure or drug approved.  \n \nTypical of the big consulting firm I'm working for, I only know my little slice of the project- social engineering. I've been tasked with trying to trick the targeted employees of HealthCo to either give me credentials via phishing emails or insert USB drives with a little 'phone home' script into their workstations.  \n\nI'm very comfortable with the former, but my Java skills aren't up to snuff, so I'm spending a lot more time modifying a coworker's java app to phone home when clicked, but not break anything else. I am reminded why I'm not a Java developer and just change the icon on some HTML that will call an unique web bug (a 1x1 clear pixel) that will identify the USB drive. To ensure maximum clicks, I name the doc 'Payroll.xls.html'.  \n \nI'm planning on sending the phishing emails a day or two before I'm on-site, where I'll drop the drives, wait a day and write my report. I fly out and drive my shitty rental car to HealthCo's offices the night before. I drop a third of the drives in the parking lot, then piggyback someone going into the office to drop them around the building. I find my way back to my consultant kennel. Sadly, the only restaurant walking distance from my hotel is an Applebee's, so Brewtus and I start writing the filler for HealthCo's report over some rubbery chicken wings.  \n \nThe next day, I check and see that I'm around 50% for my phish and about a third of my USB devices have been plugged in. I also see an email from the client. They have some _grave_ concerns about our test and want to talk about it.  \n \nI throw my suit on and take my 'other fine car' to HealthCo's offices. I'm escorted to the Director of Security's offices. They've collected a bowl of my thumb drives like the least appetizing candy dish ever. There's also a suspiciously clean cut security engineer here with a laptop and a smile that tells me he thinks he's got me dead to rights.  \n \nDirector:\"We specifically asked that you not use malware for your social engineering test. Because of your malware, we ended the test and emailed everybody to bring us any drives they find.\"\n \nme:\"We didn't generate malware. We decided to go with a HTML file instead of a Java dropper. For compatibility reasons.\"  \n \nSecurity Engineer(gesturing at the spreadsheet on his laptop):\"Your malware captured PHI to the drive. That's outside the rules of engagement\"  \n \nme:\"I assure you- I didn't write anything to break into your systems. I wrote a simple web page. Wait a minute, let me show you something\"  \n \nI reached into the bowl and showed them a few of 'my' drives. Each had been marked with a felt tip pen. Drives intended for the parking lot got two dots, while drives dropped inside the building had a small line. It was a way to make sure I spread them effectively without losing track.  \n \nI showed the Director and the engineer my marks. The Director looked unamused while the engineer looked like he wanted to wish one of my marks onto the drive he had.  \n \nme:\"I can tell you what my recommendations are- DLP, turn off USB drives and perhaps some training. You're going to have to figure out who is losing drives full of unencrypted PHI in your parking lots. \n",
        "created_utc": 1526390953,
        "upvote_ratio": ""
    },
    {
        "title": "Im so sorry guys",
        "author": "w00ds98",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jkkxg/im_so_sorry_guys/",
        "text": "[removed]",
        "created_utc": 1526380892,
        "upvote_ratio": ""
    },
    {
        "title": "Macs capitalize the first letter in passwords?",
        "author": "Pat_Riedacher",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jjaai/macs_capitalize_the_first_letter_in_passwords/",
        "text": "[removed]",
        "created_utc": 1526363556,
        "upvote_ratio": ""
    },
    {
        "title": "\"If my grades are affected by this, I will be taking further action with somebody higher up than you\"",
        "author": "nuclear_sloth3000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jin3k/if_my_grades_are_affected_by_this_i_will_be/",
        "text": "Had to make a new account for this because it would've been way to easy to track me down on my usual one. Anyways, this happened about 3-4 weeks ago and I'm still annoyed about it. This is very long, TL;DR at the bottom.\n\n\nI'm about 8-9 months working as a tier 1 within my University's IT department. For the most part, I'm usually dealing with patient faculty and staff members, and most of our callers are very kind. We mostly deal with the University's online accounts for O365, online services, etc, and general tech support issues for anyone associated with the University. The call I will be discussing today revolves around a compromised email account. With a compromised account, we're supposed to talk with the user and try to identify the source of the compromise, have them reset their password, go over good security practices, etc.\n\n\nSo I come into work around 8:30 AM Monday morning, and the first thing I notice is the amount of compromised users is exceptionally high. You see, that weekend we suffered from a pretty high quality phishing attack. An email with the typical \"Your __ university  account in danger of expiring. Please click this *sketchy link* to redeem your account\" had been spreading around like a disease. This phishing email looked way more convincing than usual, and a lot of people were falling for it.\n\n\nGetting to the story here: My first call of the day is from an angry student, lets call him 'ignorant student' or IS for short. Now it's been a few weeks so details might not be exact, but I know the gist.\n\n\n&gt;*ring ring* \n\n&gt;Me: Thanks for calling _university IT, how can I help?\n\n&gt; IS: Okay so like I don't know what the deal is but I can't log into my account. I need to be able to send emails to my professors right now or my grades depend on it. This is absolutely ridiculous, I don't know what the problem is. ID # is #####\n\nI look up his account, and as expected his account is compromised.\n\n&gt; Me: Alright sir it does look like your account is compromised. This means that somebody has your password, and could have had malicious intentions. We can take care of this, we just need to go over a few things. First I need you to use the \"forgot password?\" button to create a new one. Do you know what may have caused your password to be released?\n\n&gt;IS: That's bulls-t. I don't want to reset my password again because you guys already made me change it the other day in **that email**. I have s-t to do. I'm a student and I have tests and assignments to work on. I don't know why this is my problem whatsoever when it's obviously y'alls fault for being hacked so easily. Like that's just ridiculous. \n\n&gt; Me *dying internally*: Sir we can get through this process quickly, I just need you to be patient with me as I go through the procedure. The measures we are taking here are for your benefit, and the security of your account. Can I please have you create a new password.\n\n&gt;IS: Fine. \n\n&gt;Me: Alright, now while you do that I'm just going to give some security advi-\n\n&gt;IS: Um dude I don't know how you expect me to change my password while you're talking at the same time. Since I've already had to change it before I don't even know what I'm even going to change it too now, and you talking in my ear is making it really hard to come up with one.\n\n&gt;Me: ok. \n\nSo I already know that he is got that phishing email confused with a password change request from us, and he obviously fell for it.  This guy was being so rude to me, and I knew he wouldn't respond well when I told him he gave his password away like a fool, so I tried to approach it with caution.\n\n&gt; IS: *annoyed tone* Ok I finally changed it, now take the block off my email account right now.\n\n&gt; Me: Alright, really quick it's important we go over some online safety tips so this doesn't happen again. Have you received any emails recently asking you to click a li-\n\n&gt;IS: Ok dude I don't know anything about technology and personally, I don't care at all. I'm not going to listen to any of this, so don't even bother. I need my email, and I need it now. This is obviously not my problem, and it's ridiculous that you guys put responsibility on me. I need to send email's to professors, and I swear to god, if my grade is affected because of this nonsense, I will be taking further action with people higher up than you. \n\nLOL. Good luck with that.\n\n&gt;Me: Ok. I'll go ahead and process the ticket.\n\n&gt;*click*\n\n\nNow if this dude wasn't so rude to me, I would've actually continued on with the procedure, but at that point I wasn't trying to be helpful. We were supposed to discuss why his account was compromised, and discuss safety measures so it doesn't happen again. I was also supposed to have him check his mailbox rules and make sure there wasn't anything suspicious going on. After that, I'm supposed to mark that we did all those things on the ticket, then it goes into a queue to be reviewed by tier 2. Only then, will the email block be removed, and it usually takes a few hours. When I was updating the ticket, I made sure to *not* mark all the required fields. I also added a note documenting his attitude and inability to cooperate. My day started off terribly because of this guy, and I wasn't about to improve his. \n\n\nTL;DR: Call to take care of your compromised account, but fail to cooperate in any way while being a total jerk? Get used to not being able to send emails buddy.\n\n\nEdit: Fixed a typo that was bugging me, also spaced things out a bit more to make it easier to read.\n ",
        "created_utc": 1526356506,
        "upvote_ratio": ""
    },
    {
        "title": "In which our hero descends into Hell",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jiemh/in_which_our_hero_descends_into_hell/",
        "text": "[deleted]",
        "created_utc": 1526354235,
        "upvote_ratio": ""
    },
    {
        "title": "\"If my grades are affected by this, I will be taking further action with someone higher up than you\"",
        "author": "nuclear_sloth3000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jhbmd/if_my_grades_are_affected_by_this_i_will_be/",
        "text": "[removed]",
        "created_utc": 1526344353,
        "upvote_ratio": ""
    },
    {
        "title": "A new computer for a simple fix",
        "author": "boosted_monkey13",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jgxzg/a_new_computer_for_a_simple_fix/",
        "text": "[removed]",
        "created_utc": 1526340931,
        "upvote_ratio": ""
    },
    {
        "title": "Hard drive surgeon extraordinaire",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jfq36/hard_drive_surgeon_extraordinaire/",
        "text": "[deleted]",
        "created_utc": 1526330745,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding details and their importance",
        "author": "jickeydo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jfpl4/regarding_details_and_their_importance/",
        "text": "Short cast today, just $me and $user. $User is new to the organization and so far has not impressed me with her sparkling personality. \n\nTicket comes in at approximately coffee:15. I roll my eyes when my phone alerts me because, quite frankly, it's Monday and ain't nobody got time for foolishness on Monday morning. It was from $user's supervisor: *$User cannot log in to her workstation.* OK, simple enough, I'll just log in to AD and reset her password and unlock her account. I sent the new temporary password back to the supervisor and go about my coffee drinking. \n\nCue the phone ringing about 2 hours later. It's $user.\n\n&gt;$me: *insert standard phone greeting with way more enthusiasm than I'm feeling*\n\n&gt;$user: I can't log in!\n\n&gt;$me: Yes, I got the ticket. \n\n&gt;$user: My password won't work!\n\n&gt;$me: Right. I reset it and sent the temporary one back to your supervisor. \n\n&gt;$user: Oh, you got a ticket on this? I couldn't log in, Windows was updating.\n\n&gt;$me: *thinking you couldn't wait for it to finish???* We were just told you couldn't log in. \n\n&gt;$user: Right, I couldn't because Windows was updating. Why was my password reset?\n\n&gt;$me: *grinding teeth* Look, $user, I don't mean this to sound quite as snarky as it probably does, but those are the types of details that we need to know. That specific detail would have kept me from resetting your password.\n\n&gt;$user: You're probably right. Haha. I'll get the temporary password from my supervisor. Thanks!\n\n&gt;$me: *thinking next time you log a ticket you word it accurately by saying you're really damn impatient and not trying to blame your not working on IT.* ",
        "created_utc": 1526330642,
        "upvote_ratio": ""
    },
    {
        "title": "\"Can you empty the COIN box\"",
        "author": "sparxcy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jf6bo/can_you_empty_the_coin_box/",
        "text": "Onto another of my talesfromthechsupport stories:\nas i was for many years in a PC shop in Tech support i get a call from a customer could i go round their house and empty the \"COIN Box\"(?)\nSo i made a appointment to visit the customer for that evening to see what the problem was as we never had coin slot machines sold or fitted anywhere.when i got to their house i was told they had been putting coins into the box so the pc would start!\nupon inspecting what they had told me, i found they were putting coins into the towers \"A\" Drive to start the pc! and the Tower was full of coins!\ni told,explained and showed them it wasnt necessary to put coins to start the PC!\nso they showed me a old diagram they had for their (home landline) telephone that was probably from the 50's \"A\" was for the Coin slot \"B\" was for the dial and \"C\" was the speakerphone, they thought the PC tower was something Similar,as at the time the tower was marked \"A\" for the floppy drive and \"D\" for the cdrom drive!\nAtleast they got to keep the change! from the COIN BOX!",
        "created_utc": 1526326706,
        "upvote_ratio": ""
    },
    {
        "title": "Unlimited Power!",
        "author": "linus140",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jf5dm/unlimited_power/",
        "text": "**[Timeline](https://redd.it/6v3az8) of my other stories separated by company.**\n\n&amp;nbsp;\n\n*** \n\n&amp;nbsp;\n\nIt’s been a while since I’ve posted anything. I’ve been caught up with both work, time with my daughter, and sheer laziness. I’m going to try to get back into the grove of posting something at least twice a month. Especially when I have tons of tales from my military days, my current job, and other previous positions.\n\nAs some of you may recall, I currently work for a company that deals with back office software. We’ll call them **$BOCompany**. I am one of two individuals who install our hardware and software for our back office system while the customer is in their implementation phase. Our technical support team takes over most technical issues after the implementation phase has ended.\n\nOne of our technical support representatives is a bit…special to say the least. He tends to ask multiple people the same question as well as not listen at the same time. He also told the entire team that his mom used to call him Boo Boo, so we shall call him **$BooBoo**. $BooBoo has gotten somewhat better at listening recently, but this store takes place about three months ago. He was click happy back then, and still is.\n\nWe use a proprietary in-house built piece of hardware to communicate to our server. These are installed at the customers’ locations to retrieve store information and what-not. Our devices communicate to our servers using a VPN. So like all things, it needs active internet connectivity. The VPN does like to go down randomly on these devices. Sometimes it’s due to the customer’s internet, power loss, or our device just being stupid because it is pretty cheap.\n\nSo, a customer (**$Cust**) calls in because our website showed him that his VPN was down, thus his register information was not being reported. $BooBoo got the call. $BooBoo was excited because this was his first easy call of the morning. I overheard the entire call as I was ~~looking over my schedule and backlog of implementation tickets~~ browsing Reddit before my first appointment of the day. $BooBoo eventually came to me for assistance as he could not get the device online at all.\n\n&gt;**$BooBoo**: Hey $Me, I need help with this VPN issue.  \n&gt;**$Me**: Did you reboot it?  \n&gt;**$BooBoo**: Yeah, and that didn’t work.  \n&gt;**$Me**: Did you swap the Ethernet cables with known good cables?  \n&gt;**$BooBoo**: Yes. Didn’t work either.  \n&gt;**$Me**: Did you try a different outlet?  \n&gt;**$BooBoo**: Yes. Nothing.  \n&gt;**$Me**: Well, I have an appointment in 10 minutes. Make a ticket and I’ll look at it later.\n\nAt this point in time, $BooBoo was on the phone with the customer for about an hour. I heard him try to get the customer to reboot our device several more times. I messaged him on Skype for Business more than once to get him to just open a ticket and get them off the phone until I could call them, but $BooBoo wasn’t having it. He wanted to be the hero. Good for him, right? Not when there’s only three technical support personnel on the queue with calls coming in like crazy.\n\nSo anyway, he eventually gets the customer off the phone and makes the ticket. I finish up my appointment and check out his ticket. He actually put in a detailed description of everything he allegedly did. This was a first, but I digress. I decided it was time to call the customer.\n\n&gt;**$Me**: Hey $Cust, this is $Me from $BOCompany. I understand you have a VPN issue, and I know you worked with $BooBoo earlier, but I wanted to knock out some simple troubleshooting to ensure we covered everything before replacing that device.  \n&gt;**$Cust**: Okay, but we already rebooted it, swapped cables, and everything.  \n\nI had $Cust trace all of the Ethernet cables and power cable from our device to make sure that it is properly plugged into everything it needed to be. And then I heard this dime:\n\n&gt;**$Cust**: It has no lights on it. Should there be lights? I told the last guy I talked to that it has no lights. Not even on the “PWR” light.  \n&gt;**$Me**: …  \n&gt;**$Me**: Did your guy’s power go out? Do you currently have power?  \n&gt;**$Cust**: We lost power the other day, but we do have power now.  \n\nAfter a magical face shaped imprint appeared on my desk, I unmuted my phone and had the customer find a working power outlet using their phone charger. Once an outlet was found, we moved our device to that outlet and our device magically started working again. I also advised them to get an electrician to check and/or fix the wiring.\n\n&gt;**$Me**: Hey, $BooBoo.  \n&gt;**$BooBoo**: Huh?  \n&gt;**$Me**: Did you check to see if our box was getting power?  \n&gt;**$BooBoo**: Yeah.  \n&gt;**$Me**: Are you sure?  \n&gt;**$BooBoo**: Yeah… Why?  \n&gt;**$Me**: Because the box wasn’t even powered on. We moved it to a new outlet and it works.  \n&gt;**$BooBoo**: I swear we tried that!  \n&gt;**$Me**: Obviously not. Just admit you missed a step, learn from it, and move on.\n\nNeedless to say, $BooBoo has not lived this down. Good thing he has a sense of humor.\n\n&amp;nbsp;\n\n**TL;DR:** Is it plugged in, $BooBoo?\n\n**Edit**: Fixed a typo. ",
        "created_utc": 1526326496,
        "upvote_ratio": ""
    },
    {
        "title": "\"the Hoover works but the computer won't\"",
        "author": "sparxcy",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jew0j/the_hoover_works_but_the_computer_wont/",
        "text": "I have spent over twenty years in PC support and i could write hundreds of books on talesfromtechsupport so i'll start on this one...\n(just found this subreddit!)\nGot a call one day from a customer hes PC wouldnt turn on\nso i ask the usual have you pressed the power on button,is the power supply plugged in and turned on... i get the answer yes its plugged in and the power is on the pc wont turn on....but the hoover  works.(?)\n\ni know he's PC is on a table,so ask him if the screen is showing a light on he says yes, so i ask him to swap the pc and screen power leads and tell me what happens when he tries to power up again.\nHe says again \"Nothing\". So i ask check the wires coming from the mains plug do they go to the PC and the screen? he says they do and that he hasnt moved any plugs since i installed the setup some months before,and if the hoover works so should the pc(!)\n So i said get to the mains plugs and follow the leads and  see if they are connected properly to the pc and screen.After many hours back and forth over the phone i went round hes house and found that hes Mrs disconnected the pc and put the Hoover in its place and had the pc connected with a extension to a room next door. at the end of it all he explained that when he turned on the Hoover usually the PC came on aswell. but this time hes mrs had tuned off the Hoover(which was actually the tower)\nMoral of the story:if the Hoover works so does the PC!\n",
        "created_utc": 1526324554,
        "upvote_ratio": ""
    },
    {
        "title": "Tales from the crypt(o)",
        "author": "BTallack",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jeh7q/tales_from_the_crypto/",
        "text": "[removed]",
        "created_utc": 1526321513,
        "upvote_ratio": ""
    },
    {
        "title": "\"What do you mean you can't fix it right now?\"",
        "author": "maxofcr",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jeaou/what_do_you_mean_you_cant_fix_it_right_now/",
        "text": "So I used to work in a school help desk that really doesn't have any special privileges except for minor tech issues such as my computer won't turn on or other software related issues. We also share the space with the library and have to desks one of which is tech support the other is book checkout.\n\nOne day we have a Rude Lady (RL) walk in to the library and go to the book checkout with a laptop. The clerk asks if she would like to check out a book and RL says she needs to get into her laptop. Clerk points to us and says that we can help her. I am ME and she is RL\n\nRL: Hey smart kid fix this for me. \n\nMe internally: so this is how this is gonna go is it?\n\nMe: How may I help you?\n\nRL: I can't get into my computer.\n\nMe: okay let me take a look at it. Does some stuff with username password check and nothing comes up so I can't fix it now and need to send it down to the actual tech people. It isn't linked to our school system as it is new and won't accept the username password.\nMe: I'm sorry ma'am I can't fix your issue currently but I can send your laptop down to tech for repair.\n\nRL: What do you mean?\n\nMe: I can't fix your issue currently because of the needs for an admin to make the changes to the laptop.\n\nRL: What do you mean you can't fix it.\n\nMe: I can't fix it now but I can send it to tech and have them take a look at it.\n\nRL: But I need to get in now!\n\nMe: Well, I can't get you in and it needs to go to tech.\n\nRL: So you can't help me?\n\nMe: No.\n\nRL: Well, i'll just go somewhere else then. *Walks off without issue getting fixed*\n\nWhy do people do this. She needed to comeback anyways as she can't send it herself.\n\n\n\n",
        "created_utc": 1526320188,
        "upvote_ratio": ""
    },
    {
        "title": "You've got Mail",
        "author": "tyrannosaurwes",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jdzsy/youve_got_mail/",
        "text": "I work for a very small credit union with only 5 total staff members and an older customer base. I'm the operations manager and some how online banking support gets linked into that also, (I am the youngest employee by atleast 25 years. So I get a call sent back to my office with a woman having trouble with online banking. Here We go.\n\nMe: Hello, How can I Help\n\nLady: (in a noticeably very old voice) Hi, I cannot access my online banking, I've never done it before but I want to get started using it.\n\nMe: So you've never accessed your bank account online?\n\n(also me)     :|\n\nLady: No, my granddaughter has been trying to get me to do it so here I am!\n\nMe: Ok, well I guess to get started open your web browser and I can give you our website.\n\nLady: I don't know what that means\n\nMe: The thing you use to goto websites.....\n\n(also Me)        :|\n\nLady: Oh, ok....\n\n(audibly here her clicking and all of a sudden I hear an all to familiar sound from the 90's, \"You've Got Mail\".\n\nMe:       :|\n\n(also me)     :|\n\nMe: Soooooo, you use the AOL browser?\n\nLady: Why Yes I Do, It's all I know.\n\nMe: Ok, I am not super familiar with that browser at this point and its compatibility with our website but we can certainly give it a shot. The website is www.nameacreditunion.org.\n\nLady: It won't work, it just shows a blank screen and nothing else.\n\nMe: Did you press \"enter\" once you entered in the website address?\n\nLady: Yes, and it took me to a blank screen, ohhh wait there it is...it just took a minute.\n\nMe:   :|\n\nMe: Ok, so now you have to use your personal info and create a Log In ID.\n\nLady: Ok, I'm going to follow the prompts, don't go anywhere!\n\nMe: ok. I'm here\n\n(She goes through the prompts creates a username and password and then...)\n\nLady: Ok, It still won't let me log in. I enter all of the same information and it just refreshes to the same screen but my info disappears.\n\nMe: Ok, That is not good, it seems like you may have compatibility issues using the built in AOL browser. I can only recommend one more thing before getting you to download a suitable browser. We can try to enable your cookies. That has worked on people using Internet Explorer.\n\nLady: Oh Sweetie, I don't have any cookies.\n\nMe: (audibly laughing) NO NO NO, it is something way different then what you are thinking.\n\n(I then google how to use the AOL browser and how to reset, enable, and disable cookies, and to my surprise am able to pull up step by step instructions on how to do it. I give her the instructions one step at a time. This phone call took the better part of 2 hours of my day. After the final step.....)\n\nMe: ok, once you have done what i told you with all of the settings, please just restart your browser and give the site another go!\n\n(audibly hear \"Good-Bye\", followed by 2 clicks and a \"You've got Mail\")\n\nLady: Ok, Here we go, I'm going to try it again. (in a jubilated voice) I'M IN, I'M IN, Thank You SOOOOO MUCHHHHHHH.\n\nA few days later an old lady came to the credit union with a plateful of chocolate chip \"Cookies\" and wanted to thank me in person.",
        "created_utc": 1526317904,
        "upvote_ratio": ""
    },
    {
        "title": "Short and Sweet",
        "author": "GarretTheGrey",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jdvw8/short_and_sweet/",
        "text": "Ok this was a conversation I had with someone who's not IT, but is supposed to be technically inclined. I installed Proxmox for a company and dropped some vm's on it, but I don't really support them (they're not paying). This guy's in a managerial position, not IT, but he does their IT stuff for them.\n\n$me is me and $dude's the guy that called me. He wiped a machine and installed Win10 on it. had to join it back to the domain. He called me this Saturday while I was overlooking a fiber run.\n\n$dude: Ok I have the windows installed now and need to join it to the domain, can you walk me through it?\n\n$me: ok, sure. Hold the windows key and hit E, then when the window comes up, right click on the background and click on properties.\n\n$dude: Ok cool, so I hit the windows key, click on control panel and then go where?\n\n$me:.....wat..\n\n$dude: hey windows wants to update, should I update first and call you back?\n\n$me: yea...do that\n\n\nAnd Airplane mode....on..",
        "created_utc": 1526317107,
        "upvote_ratio": ""
    },
    {
        "title": "HR Shennanigans Again!",
        "author": "megamanxtc",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jdst3/hr_shennanigans_again/",
        "text": "Tech: Thank you for calling XYZ Help Desk  \n*get initial information*  \n*user is calling about requesting a Leave of Absence*  \nSo, I looked that up for you, you'll need your manager's approval, and then submit that form (that we were looking at and discussing) to HR.\n\nUser: I don't want to go through my manager for this. Is there some other way?\n\nTech: I'm not sure.  That form is the only way I'm aware of - and as it mentions, you need your manager's approval.\n\nUser: Is this HR?\n\nTech: No, this is IT.\n\nUser: Oh...I see.  So, I have to get my manager's approval?  Is there another way?\n\nTech: You'd have to ask HR - let me get you their contact information.  \n*email HR's email address and phone number to the user, confirm receipt, and verbally given as well*\n\nUser: Oh, I already called this number and talked to them.  They gave me your number.\n\nTech: This is IT - is there a technical problem with the form?\n\nUser: No, I just want to request a Leave of Absence, but I don't want to ask my manager about it.\n\nTech: You'd need to work with HR.\n\nUser: HR, that number you gave me, gave me this number.  Anyway, thanks for your help.\n\n**Serious note** - I'm really not sure what the HR monkeys are doing over there...they refer so many \"HR cases\" over to us - it's recently gotten terribly out of hand.  \nThey got a new manager, and laid off 2 or 3 personnel - so they're going through some changes. Feels like they're just delegating work to other departments, rather than doing any actual work.",
        "created_utc": 1526316454,
        "upvote_ratio": ""
    },
    {
        "title": "Can you help me??",
        "author": "babuet",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jdhef/can_you_help_me/",
        "text": "[removed]",
        "created_utc": 1526314101,
        "upvote_ratio": ""
    },
    {
        "title": "You have the power to help me!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jddew/you_have_the_power_to_help_me/",
        "text": "[removed]",
        "created_utc": 1526313297,
        "upvote_ratio": ""
    },
    {
        "title": "The Power of a Pavilion",
        "author": "SteveHeist",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jdcgi/the_power_of_a_pavilion/",
        "text": "As I’ve stated in the past, I’m not technically tech support. However, due to the number of electronics outside of warranty in use at my house on a daily basis, I’ve become pseudo-IT, as I can typically understand and diagnose the issue.\n\n\nThis was not the case today.\n\n\nAt first, it was, as the issue to pass by my “work table”, which essentially amounts to a coffee table drug into a corner, was a case of a stuck spacebar on my younger $Sister’s laptop. Pretty simple, I asked her about it and she said she’d poured soda on it some months ago and didn’t tell anyone, because it still worked. I took it downstairs, and not seeing any easy way to get at the key caps (which became the near-fatal bit of inattention for the laptop), I opened the underside. I bored my way through the case and internals, eventually getting even the main board out. I looked for somewhere safe, as the main board had traces and chips on the bottom and I didn’t want to break it, and eventually decided on the top of $Elder’s white coat. \n\n\n$Elder works as a pharmacy technician, but had come home and gone to the store again, which was why his coat was balled on my table. I eventually realized that my efforts to get at the keyboard via the underside were in vain, as there was no disconnecting the middle frame from the board that I could see. Even Google pulled up nothing, which is when you know you’re in uncharted territory. I reassembled the system.\n\n\nNo boot. 5 second light on the power button. A google search for that told me it was the main board. \n\n\nI tried undoing and redoing every single ribbon cable, and nothing. Tried cleaning the area near the CPU to see if there was residual thermal paste. There was, but it wasn’t the source of my issue, and in the process I got some liquid canned air on the board because I was holding it sideways, and had to wait for it to dry. Then I tried booting it again. No luck.\n\n\nI set it aside, as at this point I’d been staring at the internals of this laptop for nearly two hours, and was thoroughly stumped. That’s when $Elder walks through the door.\n\n\n$Elder doesn’t know the first thing about main boards and the components on them, doesn’t know the difference between a resistor or a transistor, and you could probably convince him there was such a thing as a “consister” under there. He has, however, a good understanding of other mechanics - need a car rebuilt from the ground up? With a little help, $Elder can do it. Leaky sink? $Elder knows how to fix that too. \n\n\nThe other thing he’s good at is bullshitting his way to the problem. I told him what I’d tried, and his response made me feel really stupid.\n\n\n&gt;$Elder: Did you check the underside of the board?\n\n\n&gt;$Me: No.\n\n\n&gt;$Elder: Give me a minute.\n\n\nWith this, he proceeds to, with some guidance to screws, unfasten the main board, and flip it over.\n\n\n&gt;$Elder: Well, there’s your problem. See this? *points at a glob on the board* There’s soda and lint here.\n\n\nWith this, we proceed to clean the board, with a combination of Q-Tips and isopropyl alcohol (logic being “if it’s good enough for CPU thermal paste, it’s good enough for any PCB”). Plug everything back in, and… no boot.\n\n\nMy brother pulls two plugs, which he thought were both the battery (one was the speaker), and, voila. \n\n\n&gt;$Me: WE HAVE WINDOWS! ……… Kinda. Oh no, just slow, we’re good.\n\n\nAnd… UNMOUNTABLE_BOOT_VOLUME.\n\n\nSo, a USB reinstall of Windows later, and we’re on the desktop. Now to try and get everything plugged in underneath, take it upstairs, and gloat, right? No, of course not. Plug the two connectors back in, and nothing. 5 second blink code. \n\n\nSo, what do we do? We unplug the “battery”, and it’s my turn to notice something.\n\n\n&gt;$Me: Um, so, why are you unplugging the speakers and the battery?\n\n\n&gt;$Elder: What do you mean? That’s just the battery, right?\n\n\n&gt;$Me: No. No that isn’t. Plug this *pointing at battery cable* back in. Leave this *pointing at speaker cable* out.\n\n\nIt booted just fine. So, the issue was, at least in part, when I first tried to take apart the system. The speaker cable is located in an odd spot I couldn’t quite get to, so I tried a pair of needlenose pliers. I gave up on that after it slipped, and apparently I did some damage to the connection between the speakers in the PC and the motherboard. The lint-covered soda probably didn’t help, but at the end of the day, it was partially my fault. \n\nTL;DR: I need a better work surface, and a better brain. Also, soda + lint. Bad times.",
        "created_utc": 1526313109,
        "upvote_ratio": ""
    },
    {
        "title": "So you left it?",
        "author": "xadcirk",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jcvxr/so_you_left_it/",
        "text": "Hello Again and welcome all to my running nightmare.\n\nToday's a small tale.\nSitTech: the only other IT guy where I work. Not good at his job.\nMyself: The guy that actually fixes things.\n\nSo were sitting in our Monday morning meeting again and SitTech gets a call from the BigBuissness he has been primary contact for.\n\nA computer is down. Its critical. fix it now. He goes over their after confirming with me that it sounds like the windows update that we have seen Killing dell Ethernet controllers killing another Ethernet controller. Load the controller onto a USB. Login as admin and reinstall. its 5 minute's at most to fix it permanently.\n\nHe walks back in and I look at our ticket board to see its still open.\n\nMyself: \" Hey SitTech. Can we close this ticket?\" \n\nSitTech: \" Na man, they were like they need it up pronto so I plugged in my USB Ethernet adapter and got them back up and left. We (Read that word as you always when he is talking) can install the right stuff to fix it later.\"\n\nMyself: \"...\"\n\nAnd thus was Monday ushered in.",
        "created_utc": 1526309713,
        "upvote_ratio": ""
    },
    {
        "title": "Scammers talk nonsense",
        "author": "Isuckatbattlefield4",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jcp5w/scammers_talk_nonsense/",
        "text": "[removed]",
        "created_utc": 1526308279,
        "upvote_ratio": ""
    },
    {
        "title": "Where in Control Panel is the Fn key?",
        "author": "Lizregbel",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jclna/where_in_control_panel_is_the_fn_key/",
        "text": "This happened 2 years ago when I was still an agent and was taking calls from users. Back then the kind of issues that scared me the most were the \"I cannot connect to wireless\". Most of the times they were in the airport so no chance to try to restart router or anything like that, also could not take remote control to troubleshoot myself.\nThe first question that I always asked was if they could see any wireless connection. Since his answer was no I thought to myself they must have turned off wireless from the laptop. \nAfter trying to explain to him that he needs to press Fn and the F key that had the wireless icon I  ask him for the laptop model and search on google to see which key it was. Let's say it was F8 . So I start to explain. \n- On your keyboard on the left bottom corner, next to Ctrl you have the Fn key, press that and the F8 \n- Let me look.\nAfter a couple of minutes of silence I ask him:\n- Did you press it?\nHis answer almost made me want to hit my head on the desk.\n-Where exactly in Control Panel did you say it was?\nI have to say that I have never mentioned Control Panel and till that day I had no idea that when you tell someone to press keys on his keyboard there will be people that will not know what that is. I keep my calm and explain again\n-Ok, so on your keyboard, can you see your keyboard?\n- Yes\n- On the bottom left corner you have Ctrl, you see that?\n- Yes\n- Ok, and if you look to the right of the Ctrl key what do you see.\n- Ohhh\nTo be honest I don't remember if that solved his issue or not, but I will forever remember that call.  ",
        "created_utc": 1526307508,
        "upvote_ratio": ""
    },
    {
        "title": "\"Please setup $UserFirstName. Why isn't $UserFirstName setup yet? You know $UserFirstName starts next week. Where is the laptop for $UserFirstName?\"",
        "author": "TheITCustodian",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jc7m9/please_setup_userfirstname_why_isnt_userfirstname/",
        "text": "[removed]",
        "created_utc": 1526304360,
        "upvote_ratio": ""
    },
    {
        "title": "We did not do it because no one told us to Part 2",
        "author": "MediocreSupport",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jbj87/we_did_not_do_it_because_no_one_told_us_to_part_2/",
        "text": "My apologies for the long wait gents. Here is part 2. Part 1 can be found [here](https://www.reddit.com/r/talesfromtechsupport/comments/8hwu9i/we_did_not_do_it_because_no_one_told_us_to_part_1/)\n#Intro\n\nSome time ago at a previous assignment I was in a team of 10 people supporting 1st line IT needs of a user base of 2500 users in a colossal international company $BlackSugaryLiquid. Our team was efficient and structured and led by a competent young lady $MissBoss. We would handle all sorts of office and production related IT problems and would resolve quite a lot of them ourselves. Some of our tickets we would have to escalate to back line teams, who would in turn kick it back to us when they had a solution. $BlackSugaryLiquid, while having lots of sites in different countries, had the habit of outsourcing key IT components to the South of the Himalayas ($HCL henceforth) and other low wages countries. This was met with much frustration of everyone within IT and outside of IT, since you receive the quality for which you pay.\n\nI write this from memory so details I no longer remember could be left out\n\n#Once more, into the breach\nThe first week following the $Crypto nuke it was the talk of the day; every day. Many emails came and went, (irrelevant) contact information was exchanged and an effort was made by $Bigbosses to enlighten users on the dangers of bizarre emails in the form of an upcoming surprise test. This test would later prove to be an obvious fake email along the lines of “CLICK ME AND YOU WILL GET MONEY”. Users who would click the link would get written down, while the ones who reported this to the appropriate authorities would get a shiny worthless certificate in outstanding IT security made in MS paint according to a colleague.\n\nAmong all of this buzz there was still a sore spot that had not been addressed: $ITSecurity. We had not heard from them since the initial disaster and we assumed they had their leashes pulled tight; even $MissBoss did not have any news regarding the follow up of $ITsecurity and what they would do to prevent total meltdowns in the future.\n\nThe answer came a mere 2 weeks later after the first disaster. In the $Finance department yet again a malicious email was received and converted into a ticket by $Tool. Some unlucky sucker from $Finance opened the ticket including its attachment and all hell broke loose once again. From his PC it hopped through the shared network drive onto the server and began its onslaught once again. The only thing that stood between $Crypto2 and its end goal of completion was the sheer amount of data itself. If you throw enough bodies at something it will take some time.\n\nWhen we received the phone call that informed us of the news we were flabbergasted. Dumbfounded. Bamboozled. Not only had $Tool not been subjugated to severe scrutiny by $ITsecurity, disaster 2 had occurred exactly the same way as disaster 1. An email to $ITsecurity was send (yes, still no phone number) and while we were waiting in anxiousness loads of verbal insults and cries of lamentation were heard around the office. A high priority ticket was raised once more and $MissBoss was escalating things, desperately trying to get things moving. \n\nLuckily for the entire company $BigBoss had a direct phone number this time for $ITsecurity somewhere written down on a post it and after a full hour after our first email they responded. It still took them 2 more hours to actually DO something as they were waiting for approval to get the server detached from the network to begin their cleaning. After a total of 4 hours after the initial phone call the server was completely detached and wiped. Steps were taken to perform a restoration from backup. The following part will be forever etched in my memory when it was relayed by $Missboss to us. She was in the emergency conference call regarding all this and when it came to the part to restore the backups the conversation proceeded like this:\n\n&gt;$Biggerboss: Alright, the disaster seems to be diverted. We can proceed with the restoration, you have my approval.\n&gt;\n&gt;$ITsecurity: OK, give us some time to do the needful.\n\nNote: They were quite fond of this saying. 15 minutes passed had passed and then...\n\n&gt;$Biggerboss: any status update?\n&gt;\n&gt;$ITsecurity: …\n&gt;\n&gt;$Biggerboss: Well?\n&gt;\n&gt;$ITsecurity: It would seem that after disaster 1 all types of backups were disabled and not been reinitiated afterwards. As of now the most recent backup we have is from 2 weeks ago from before disaster 1.\n\nNote2: keep in mind that this encompassed the entirety of all the financial data + other important documents of all the European sites.\nAfter this statement a full minute of silence was maintained over the conference call. All involved parties were slowly realizing the extent of having no backups for 2 weeks. A pandemonium rose up as everyone started shouting at once trying to get the upper hand. Nothing constructive was blurted and none of the words that actually could be understood were rated PG 13. \n\nBeing the alpha male $Biggerboss let himself be known throughout the chaos: he demanded silence and asked in a civil manner and yet with barely unrestrained anger:\n\n&gt;$Biggerboss: Can you inform us as to why the backups were not switched back on after disaster 1?\n&gt;\n&gt;$ITSecurity: We did not do it because no one told us to.\n\nTL;DR Company gets the IT service for which it pays.",
        "created_utc": 1526297715,
        "upvote_ratio": ""
    },
    {
        "title": "Phantom of the Fax Machine",
        "author": "Nightmare-chan",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8japdp/phantom_of_the_fax_machine/",
        "text": "Summertime has come and with me being out of classes, this is usually the time all technology in the house decides to break down solely to eat up my precious break time. Where I live is a hot city that never sleeps and so I tend to be up late. My evenings are usually spent running battlegrounds with my brother and doing lines of Vaseline to stop the incessant nosebleeds that come with hot and dry weather.\n\nNow my grandmother is a nurse. And as a nurse, the fax machine/printer combo is an essential piece of machinery despite being outdated by roughly nine geological epochs.\nMy grandmother is trying to send a fax to the hospital she works at. It was fairly important that it was sent in a timely fashion. However, today, it's just not working.\n\n$Me: Yours truly\n\n$Gma: My grandmother, nurse of 40 years \n\n$Gpa: My grandfather, knows nothing about tech but tends to blame everything that goes wrong with the computer on me and my brother.\n\n$Bro: My little brother\n\nAfter several failed attempts to illicit a response from the printer, my grandmother charters me to fix the problem. \n\n&gt;$Gma - $Nightmare-chan, the fax doesn't want to go through\n\n&gt;$Me - Alright, I'll look at it.\n\nI run though all my basic steps, is it on, is it connected, all that. I turn it off and on again. I even unplug it and plug it back in for good measure. The cables are secure and the printer reports that it's connected to the computer. But any attempt to send a fax gets precisely zero response, not a beep, not an error message, just the printer UI staring almost aggressively at me. Any number entered in the software gets the same silent treatment. \n\nAs I'm walking out to make sure the phone line is still connected (our landline is connected through our modem), $Gpa comes in. \n\n&gt;$Gpa - How is it going?\n\n&gt;$Me - I'm still trying to fix it. I'll tell you when I've got it working.\n\n&gt;$Gpa - I think it's all those games $Bro installs on that computer. It messes everything up.\n\nI don't bother with that because I've tried to convince him that's not how anything works and it's an lesson in futility. I manage to redirect him outside so I can work in peace. The phone line is connected, as usual, so I'm back to square one. I sit and stare at the printer. The UI screen stares back, as though daring me to try again just to watch me fail. \n\nMy grandmother needs to send that fax before the hospital closes and that's already closer than I'd like. The fax machine seems to know this as the clock on the interface mocks me with the time. Right then, I also notice the number on the chassis does not match up with the printer the fax software was trying to send the request to. \n\nMy grandparents had a previous printer that differed in model number by only one digit, and my grandmother had accidentally selected a fax machine that wasn't there anymore. \n\nI rectified the error and the fax finally goes through. My grandmother is elated, and I wrote a post-it note to remind myself to remove the non-existent printer from the list sometime in the near future.\n\nTL;DR: Make sure your requests are going to the right place.",
        "created_utc": 1526286737,
        "upvote_ratio": ""
    },
    {
        "title": "Think to try thing three times",
        "author": "Bee-rexx",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8jairo/think_to_try_thing_three_times/",
        "text": "I am one of two people working tech support at a primary school. \n\n\n\nIt's a Monday morning and I'm woken by a cat meowing in my face. This almost always means my alarm hasn't gone off and I'm already running late. I race out of bed, get ready and leave just a few minutes later than I normally would. \n\n\n\nI arrive at work and the first thing I notice is my coworkers car isn't there, looks like I'm on my own today. I open the door and before I even get to my office - before I've even taken a step into the building, I'm greeted by two staff members telling me the Wi-Fi is down. \n\n\n\nNow I've been working here for a while now but I'm still new-ish. I've never had to deal with this kind of issue by myself before. Not only that but my absent coworker is the one who handles the severs and would normally handle this kind of issue. \n\n\n\nI dump my stuff in my office and head over to the server room. As soon as I open the door I can hear a high pitched whirring. Pretty quickly I work out which switch has the issue, the big orange fault light confirms this and I figure the first thing I have to try is turning it off and on again. \n\n\n\nI turn it off and that orange light stops staring at me. I wait a few seconds and turn it back on.\n\n\nAlmost straight away the whirring is back and the fault light is flashing that bright orange. \n\n\n\nMy first thought is that I just didn't leave it off for long enough. I do it again and make sure to wait plenty of time before I turn it back on but the moment I turn do I find the orange light and the whirring have colluded to continue to mocking me. \n\n\n\nI decide its time to call in the big guns, I give my coworker a call but he doesn't pick up. I email him instead and with no internet I head back to the server room just in case something jumps out at me.\n\n\n\n\"What's the harm in trying one more time.\" I say to myself out loud. I stare down that orange light before shutting my eyes and turn it off one more time. \n\n\n\nI turn it back on, I can't hear the whirring but I'm still afraid to open my eyes and look. I sneak a peak and there's no light!! I run to the nearest computer to double check and lucky me, I see that pretty rainbow google logo! \n\n\n\nI inform the office, sit back at my desk and listen to the sweet sound of the office lady telling the school the Wi-Fi is working.\n\nTl;dr: Always turn things off and on again at least three times.",
        "created_utc": 1526283941,
        "upvote_ratio": ""
    },
    {
        "title": "No Wi-Five!",
        "author": "devdevo1919",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8j82rn/no_wifive/",
        "text": "This story happened when I was still frontline support and not in the mentor position that I am in now; so roughly last year. It is currently a very slow Sunday night and I just thought of this story. Essentially, this woman's (W) ~~Wi-Fi~~ Wi-Five had cut out and she lost connection. Here's how the call went from what I can remember.\n\n\nMe: Thank you for calling ISP, this is--\n\n\nW: I have no Wi-Five!!\n\n\nMe: I'm sorry to hear that. I need to authentica--\n\n\nW: (Cuts me off) I am W, my date of birth is xx-xx-xxxx and I am at *address*.\n\n\nMe: Perfect, so you don't have any Wi-Fi. Let's see what we--\n\n\nW: It's **Wi-Five**.\n\n\nNow, I've never heard Wi-Fi referred to as Wi-Five, so I was a little confused but did not want to argue so, I began calling it as she wanted. My other coworkers began laughing.\n\n\nMe: Okay, so your **Wi-Five** isn't working. Did you do anything different than you normally do when trying to connect?\n\n\nW: What does connect mean?\n\n\nMe: *internally* Here we go.\n\n\nMe: Did you do anything different than usual when you used the Wi-Five just now?\n\n\nW: No, I usually just go on my tablet and it's there but it's gone and I can't get on Facebook or my games.\n\n\nMe: Okay, are you able to go into the settings of the tablet?\n\n\nW: Where's that?\n\n\nMe: It should look like some gears on your screen.\n\n\nW: But my screen's black.\n\n\nMe: Wait, what?\n\n\nW: Yeah, it's black.\n\n\nMe: *minor facedesk* Can you please turn it on?\n\n\nW: Do I just press the button on the top?\n\n\nMe: Yes.\n\n\nW: it's not working. \n\n\nMe: *medium facedesk* Is it charged? \n\n\nW: Oh, right. This tablet needs to be charged in order for it to work. Silly me!\n\n\nMe: *colossal facedesk* Ah, so it must be dead? \n\n\nW: Let me charge it.\n\n\nMe: Take your time.\n\n\nW: My Wi-Five works now!  Thank you.\n\n\nMe: Great! Can I assist you with something else?\n\n\nW: No thank you. *click*\n\n\nIt made me question how long she sat there with a tablet that had its battery drained expecting it to come back on...",
        "created_utc": 1526256021,
        "upvote_ratio": ""
    },
    {
        "title": "What do you mean the back button?",
        "author": "Krieger117",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8j7m4l/what_do_you_mean_the_back_button/",
        "text": "So my mother, bless her heart, could not learn to use a computer if her life depended on it. I needed her to take some pictures for me for a portfolio for a job application. Now I walk her through the steps of removing the SD card from the camera and inserting it into the computer. I get her to open up file explorer and navigate to the SD card. Now she starts randomly opening folders to try and find the pictures. She's not listening to what folders I'm telling her to open, and now she's 5 directories deep and totally lost. I tell her to go pack to the DCIM folder. \"How do I go back?\" she asks me. I tell her to click the back button. Apparently in her 20+ years of using a computer she has never used a back button in the file explorer. Now we have to close out and start all over again.\n\n\nThis isn't the best part though, not at all.\n\n\nNow we're back in the folders looking at picture. She's finding pictures of she and my father on the SD card from trips they've taken around the world in the past few years. I ask her why she's so surprised to see them. \"Oh I've never seen them before.\" I say to her \"Well didn't you guys back them up, or put them on a computer somewhere?\". She says \"Oh, no. We just kept them on the camera.\"\n\n\nI have a bunch of other stories if y'all are interested. My favorite is her telling me she has no idea how to drag and drop when she's logged over 4000 hours of solitaire. ",
        "created_utc": 1526251394,
        "upvote_ratio": ""
    },
    {
        "title": "Lets send a test email",
        "author": "Invalid_91",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8j6qjq/lets_send_a_test_email/",
        "text": "This happened two years ago at a firm I worked for. The client is a very well known in the UK and have over 1 million employees, lets call them $DocsAndNurses. I didnt personally deal with this, but I was in our companies office when it happened.\n\nSome high up manager of $DocsAndNurses decided that he wanted to test the email system was working as it should. So he decided to send a test email to AllStaff. In his infinite wisdom, he did not send it as BCC. \n\nMoments  after he had sent this email to AllStaff, a lot of people replied to all, saying that they had recieved the test email. \n\nMoments after this, the whole network crashed, due to network traffic. A lot of people who had replied had replied to all and the AllStaff Distribution group had approx 1 million recipients. \n\n",
        "created_utc": 1526243569,
        "upvote_ratio": ""
    },
    {
        "title": "if you wouldn't show your grandma don't look it up at work.",
        "author": "Pudding36",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8j2k95/if_you_wouldnt_show_your_grandma_dont_look_it_up/",
        "text": "[removed]",
        "created_utc": 1526200596,
        "upvote_ratio": ""
    },
    {
        "title": "\"My phone browser keeps crashing...\"",
        "author": "Isoldael",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iww98/my_phone_browser_keeps_crashing/",
        "text": "Another month, another day at the repair café. This one isn't a long story, but I found it pretty funny either way. We'd already done several repairs for people when an onlooker asked:\n\n\"Hey, do you have any recommendations for a smartphone browser that keeps crashing?\"\n\nI start by giving her some general questions / recommendations, like \"what kind of error is it giving you? Just that the app stopped working?\" and \"have you tried reinstalling the browser?\" \n\n After a whole bunch of questions, she asks:\n\n\"Do you think it could have something to do with the fact that I have nearly 250 tabs open?\"\n",
        "created_utc": 1526140455,
        "upvote_ratio": ""
    },
    {
        "title": "The power of Tech support",
        "author": "Ziaber",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iup77/the_power_of_tech_support/",
        "text": "[removed]",
        "created_utc": 1526112531,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you unknown Dell engineer.",
        "author": "dervish666",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iukli/thank_you_unknown_dell_engineer/",
        "text": "[removed]",
        "created_utc": 1526110484,
        "upvote_ratio": ""
    },
    {
        "title": "Why 13-year-olds should not do tech support",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8itsw2/why_13yearolds_should_not_do_tech_support/",
        "text": "[removed]",
        "created_utc": 1526099612,
        "upvote_ratio": ""
    },
    {
        "title": "Feminism and IT support??",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8itgut/feminism_and_it_support/",
        "text": "[removed]",
        "created_utc": 1526095524,
        "upvote_ratio": ""
    },
    {
        "title": "The Force Awakens",
        "author": "SpacemanLurker",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8isgdt/the_force_awakens/",
        "text": "I’ll make this short. I’m a part of the Service Desk for a company. The user is having an issue viewing a website that she had saved as a bookmark in IE - the Sys Admins pushed an update to the Group Policy earlier so the link is no longer valid.\nAnyway, I remote into her machine and start performing my normal IE troubleshooting and eventually get to forcing a GP update in the Command Prompt. The user has a couple coworkers gathered around her computer watching what I’m doing since they’re experiencing the same issue, too. As I type ‘gpupdate.exe /force’ and wait for it, I hear the user whisper, “He’s using the force” to her other coworkers. We all laughed and had a good time for the rest of the call.",
        "created_utc": 1526084242,
        "upvote_ratio": ""
    },
    {
        "title": "Case of the Mysterious Streaks and Snow on the Screen!",
        "author": "ErnestSolutions",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8is3z7/case_of_the_mysterious_streaks_and_snow_on_the/",
        "text": "This is the story of how a single support call turned into a double keyboard\\-face\\-cruncher.\n\nClient calls the support desk and reports that their screens are covered in \"snow and black streaks\".  T1 support logs into the system and takes screen shots of the black streaks, but doesn't see the \"snow\".  T1 then escalates to the onsite team to investigate a \"probable monitor/hardware\" issue.\n\nRead that again.. they took a screen shot of the black streaks via remote control software... then said it was a hardware issue.\n\nOnsite tech is smart and does some work remotely before going onsite.  Something funky is causing the mouse to create black streaks on the screen.  Graphics card driver update and a reboot later, streaks are gone.  However, the user is still reporting 'white snow' on all three screens.\n\nTech goes onsite and cleans the ~~snow~~ heavy dust off the monitors.\n\nTicket closed, on to the next one..",
        "created_utc": 1526080739,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes there are GOOD users...",
        "author": "ratticus_norvegicus",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8is16a/sometimes_there_are_good_users/",
        "text": "$me and my $boss are doing some work in a $client's server room. $client is sitting right there watching our antics. \n\nIn the past couple hours (when it was just me and the client) he had pretended to drop the new server, innocently asked why said new server was smoking when plugged in, and -- when I told him it was due to an overflowing bit bucket -- played right along. Fast forward to now. \n\n&amp;nbsp;\n\n&gt;$boss: \"Hey $client, what's your password for $widget?\"  \n&gt;$me: \"I actually have that written down: it's blabbity123blah, in all caps.\"  \n&gt;$Boss: *hunt* *peck* *hunt* *peck* \"You said all caps, right?\"  \n&gt; $client -- absolutely deadpan -- \"Yeah, except for the numbers. Those are lowercase.\"   \n\nBeat.  \nBeat.  \n\n&gt;$Boss: \"You've been hanging out with Ratticus too long.\"  \n&gt;$me: \"Nuh-uh! He was like that when I got here! I didn't do nothin'!\"\n\n&amp;nbsp;\n\ntl;dr: Sometimes there are users/clients who are a pleasure to deal with. Also, if this is tl, you need more Ritalin. \n\n\n ",
        "created_utc": 1526079983,
        "upvote_ratio": ""
    },
    {
        "title": "Where logic and users don’t mix",
        "author": "Thyri",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ir4m1/where_logic_and_users_dont_mix/",
        "text": "Although not the most entertaining tale, this did have me scratching my head and gave my colleagues a good laugh.\n\nOur software sits in front of a SQL database. We use some of the data to merge information into forms and letters that are created from the system. \n\nThe users can also create reports of data via the software interface. They can print out reports and export them as CSV or RTF files.\n\nAs you are aware when exporting to CSV, if you have random commas it will throw out the spreadsheet columns.\n\nCustomer has commas in all of their address lines. They don’t need them in our software but nonetheless they have them. Customer does not like the mess this creates in the spreadsheet so has a plan to remove them.\n\nCustomer said today that after much internal discussion they want specific records to have the comma removed and replaced with a semicolon (;)and on other specific records to remove the commas and replace them with plus signs...yep this +\n\nI had to read it three times to get my head around what they wanted and the word a gentle and clear email that did not read “are you fucking stupid”\n\nAfter eleven years in this job and many more dealing with IT type stuff, it never ceases to amaze me how people think (or not, as is the case in most instances)",
        "created_utc": 1526071888,
        "upvote_ratio": ""
    },
    {
        "title": "Can I use this email at home too?",
        "author": "BigAssPuppies",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iqkpd/can_i_use_this_email_at_home_too/",
        "text": "CFO approaches me in the morning claiming he is unable to get into his personal email account because he doesn't know the password. He doesn't know any of the recovery information nor does he care about any of the emails on the account so he wants me to create a new yahoo account for him. Not really my job but sure, whatever. \n\nSo I start walking him through the process on my PC, showing him how to go to [yahoo.com](https://yahoo.com), how to click the mail icon, and then 'Setup'. After typing in [yahoo.com](https://yahoo.com) he starts panicking saying I've gone too fast for him and need to slow down so he can follow. So I do just that. \n\nAfter walking through the most simple of tasks, he asks \"Well if I create this email account on my work computer will I be able to use it at home or just here?\" It took every ounce of will power not to laugh in his face. I explained nicely that yes, you can in fact access your email account from anywhere with an internet connection.\n\nOnce I thought I had finished that, he came back panicked about some questions his new email account was asking him and he didn't know what to do. It was the basic startup screen that asks if you want to import your contact, etc.\n\nI wish I could say that these types of issues aren't daily occurrences, but sadly it is.",
        "created_utc": 1526067787,
        "upvote_ratio": ""
    },
    {
        "title": "“Why isn’t it read only?” - when friendly fire gets in the way",
        "author": "jeepmcguire",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ipsp0/why_isnt_it_read_only_when_friendly_fire_gets_in/",
        "text": "It’s a quick one today and for once, it actually happened today!\n\nI support a piece of software where the security model works on the idea of “least restrictive” (ie. it will try its very best to give you access to something if it possibly can)\n\nWe had some of our support team (who should be on our team and know better!) doing some Operational Acceptance Testing before roll-out. \n\nActors:\n$Me - /u/jeepmcguire (fairly self explanatory)\n$Support - the member of support doing the testing. \n$CIO - higher up person\n\nSo it was quite a simple test: set up a user with read-onto privileges and test if a record was read-only. \n\n$Support - (email copied to CIO and Program Manager). “Hey $Me. The security test failed. My user had full access instead of read-only”\n\n$CIO - “Hey $Me, this should have been simple to build, how did it go so wrong?”\n\n$Me - “Hey $Support, you need to remove the Admin (full) access from your test user before performing a read-only test”\n\nI sent the sarcastic response and have gone home for the day. Sometimes I guess friendly fire occurs!",
        "created_utc": 1526061436,
        "upvote_ratio": ""
    },
    {
        "title": "It's the little things that drives me NUTS!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iov7h/its_the_little_things_that_drives_me_nuts/",
        "text": "[removed]",
        "created_utc": 1526054375,
        "upvote_ratio": ""
    },
    {
        "title": "You had one job! And it was to do nothing!!",
        "author": "nagol93",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8iot8i/you_had_one_job_and_it_was_to_do_nothing/",
        "text": "[removed]",
        "created_utc": 1526053933,
        "upvote_ratio": ""
    },
    {
        "title": "I can't get this spreadsheet to sort.",
        "author": "smittyleafs",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8insel/i_cant_get_this_spreadsheet_to_sort/",
        "text": "So technically speaking I'm a report developer for a company of around 4000 employees, spread across a few provinces.  However, a lot of end users have discovered that I'm also fairly savvy with Excel (I'm not really all that savvy, but I guess I know more than the average person).  \n\nSo I'm working away on a project when my phone rings and it's a user from our corporate office that happens to be around the corner from our offices (we outgrew the office, so BI&amp;A is on the other side of a 4-lane street).  I'm having a hard time understanding her on speaker phone, and I can't get VNC to connect to save my soul.  All I can gather is that they're having trouble with a spreadsheet and they've spent 20 minutes trying to get it figured out.  \n\nIt's a nice day, so I figure I'll take the time to walk over and figure it out.  10 minutes later I get there and get the full story: they can't get the pivot table to sort on the Grand Totals.  I sit down, use 2 mouse clicks, and I'm done.  They burst out laughing and apologizing while I just smile and say \"no problem\".  I'm pretty sure they were still cracking up as I exited the building.\n\nTL/DR\nWalked across to head office to click the mouse twice.  End users: amazed.  ",
        "created_utc": 1526045748,
        "upvote_ratio": ""
    },
    {
        "title": "The voip server is down",
        "author": "fool-me",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ini88/the_voip_server_is_down/",
        "text": "[removed]",
        "created_utc": 1526043265,
        "upvote_ratio": ""
    },
    {
        "title": "For the 41st time, the issue has been reported and I can do no more!",
        "author": "spottedbastard",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8inh85/for_the_41st_time_the_issue_has_been_reported_and/",
        "text": "I’m the “help desk” for our company.   We have just over 30 stores, our POS is a thin client and I can fix 99% of the issues within minutes.   Mainly as they are simply things like password resets and asking if there is paper in the printer (waaaaaay too commonly asked).    If POS is out, it’s because their servers have gone down, or the internet is out.  Both things I simply report to the provider and then do a blast on our internal mail/Private FB groups to advise. \n\nI’m also self taught so if I don’t know how to fix it, I say so and pass it onto our contracted IT company (who charge an eye watering $130/hour to google answers, most of which I can do myself abs save the company money) or the third party software provider.  \n\nOnto this weeks pain. \n\nWe have an ongoing issue with our merchant authorisation software dropping its connection with our POS.    It’s intermittent so extremely painful to diagnose.  Add to that our store staff don’t report the issue every time it occurs  as the software supplier  has a “work around” that they shared to the store staff, so they simply use that.  \n\nWe have a new manager in a store.   She’s super keen to make an impression, but is totally technologically challenged (she couldn’t deal with the office products being cloud based, so we had to download outlook and excel to her desktop) .     Of course her store is one that has the issue a bit more than others.      I’ve given her the work around which fixes the issue in 5 seconds flat, but it’s not enough for her.\n\nI’ll be me and she can be Painful Manager or PM for short.  \n\nMonday\nPM:  Hey, sorry to bother you but I get the blue circle thingy every time I choose Eftpos as a payment type.  \nMe:  Yeah.  It’s a know issue with the software and we have this fix.   Do this and I’ll report it to the supplier as it’s beyond my capabilities.  \nPM:  ok.  Thanks! \n\nTuesday \nPM:  Hey, sorry to bother you but I get the blue circle thingy every time  I choose Eftpos as a payment type.  \nMe:  Yeah.  It’s a know issue with the software and we have this fix.   Do this and I’ve reported it to the supplier as it’s beyond my capabilities\nPM:  ok.  Thanks! \n\nIn the meantime, I’ve remoted in and copied all the logs, then forwarded onto the supplier for analysing.    Supplier reports back that there has only been 2 drop outs in the past 24 hours, so their fix should be more than enough at the moment, and certainly not a huge inconvenience to the store.\n\nWednesday \nPM:  Hey, sorry to bother you but I get the blue circle thingy everytime I choose Eftpos as a payment type.  \nMe:  Yeah.  We talked about this on Monday and Tuesday, It’s a know issue with the software and we have this fix.   It’s been reported to the supplier and they are still looking at the files.  I can’t fix this....\nPM:  ok.  Thanks! \n\nThursday \nPM:  Hey, sorry to bother you but I get the blue cir........(interrupted by me!)\nMe: I know PM,  as I’ve told you for the last three days, it’s been reported, you have a fix, and I CAN NOT FIX THIS MYSELF.   You will have to just make do with the fix until they work out the issue!\nPM:  Oh yeah.... sorry you did say that.  I’ll just keep using the fix \n\n\nI know, I should be more patient,  but I can not fix this and she was clearly told this, and I was getting pretty shitty with her nagging me.   The fix is really simple, and the other stores have no issue doing it. \n\nThe supplier had also remoted in themselves on Wednesday to download more files, and she knew they were working on it as she had to open TeamViewer and give them access.\n\n\n\nFriday \nPM:  Hey, sorry to bother you but I get the blue circle thingy everytime I choose Eftpos as a payment type.......\n\n\nFFS...  \n\n\n",
        "created_utc": 1526043010,
        "upvote_ratio": ""
    },
    {
        "title": "Gsync help for Fortnite",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8im8gf/gsync_help_for_fortnite/",
        "text": "[removed]",
        "created_utc": 1526028153,
        "upvote_ratio": ""
    },
    {
        "title": "I know she is beautiful, But i think she should be wearing a helmet.",
        "author": "ambercore1000",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8im0ix/i_know_she_is_beautiful_but_i_think_she_should_be/",
        "text": "**The setup**\n\nA few years ago i was working in a company providing technical support for other companies, one of said companies had recently moved all of their desktops over to a RD server and thin clients for all users, this meant that this was a whole new experience for a lot of users, and many things was not as users was used to. One of the outstanding issues was that a lot of users had .PST files that they needed to have added to their new outlook client. This story revolves around adding this to one users outlook account. Users had revived guides on how to do this, multiple times.\n\nAt the time we were to connect to the users sessions using TeamViewer. (I was not involved with the setup, or the usage of the setup.)\n\n&amp;nbsp;\n\n**ME** - Only a pupil getting the hang of things.\n\n**HB** - Hot Blonde. (In my mind at least.)\n\n**CW** - Coworker that i was \"friends\" with.\n\n&amp;nbsp;\n\n&gt;**Me**: Okay, please double click the blue square that is on your desktop. It should say TeamViewer right underneath. \n\n&gt;**HB**: I cant find a blue square on my desktop? Is it the one that says Outlook?\n\n*sighing internally*\n\n&gt;**ME**: No, its not outlook. it needs to have the name TeamViewer.\n\n&gt;**HB**: Woops! I started Outlook with that cause any issues? Should i restart my computer?\n\nNow, TeamViewer was put on the desktop via a GPO (As far as i was informed) so i knew that it WAS on her desktop\n\n&gt;**ME**: No, you don't have to restart your computer. Please tell me what BLUE icons you have on your desktop.\n\nShe then started mentioning everything from her trash to every document that she had ever created. I'm guessing that around half way through i told her to stop.\n\n&gt;**ME**: Okay, we are going to do this another way. Please click start.\n\n&gt;**HB**: What is that?\n\n*Sighing even more internally*\n\n&gt;**ME**: Press the small flag in the bottom left side of your screen.\n\n&gt;**HB**: What flag? Where? What website is that?\n\n*Screaming internaly*\n\n&gt;**ME**: Take your mouse and pull it all the way down, past EVERYTHING you have open. Then pull it all the way to the Left, and then click your mouse.\n\n&gt;**HB**: A menu appeared. What now?\n\n&gt;**ME**: Please type in TeamViewer.\n\n&gt;**HB**: Where should i type this in? Do you want me to google it?\n\n&gt;**ME**: If the menu is still up please just type it on your keyboard now.\n\n&gt;**HB**: Ohh! It started searching for it. Hey there is the application!\n\n&amp;nbsp;\n\nI then connected to her session, the FIRST thing i saw after connecting to her desktop was TeamViewer on her desktop. I quickly informed her what to press next time she called us so we did not have to go through this again. (I still don't know if she understood what i told her. she seemed kind of phased out at that point.) Set up her outlook as requested and hang up.\nI then turned to **CW**\n\n&gt;**ME**: I have just talked with the most beautiful woman in the world!\n\n&gt;**CW**: How do you know that?\n\n&gt;**ME**: If she does not got that going for her, then she got nothing.\n\n&amp;nbsp;\n\nI never heard back from that user before i left that company, but her memories still haunt me.\n\n&amp;nbsp;\n\nTL:DR: Talked with a beautiful woman i had never seen.",
        "created_utc": 1526024813,
        "upvote_ratio": ""
    },
    {
        "title": "Can My Laptop Have a Numberpad?",
        "author": "CaptainKishi",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ikoww/can_my_laptop_have_a_numberpad/",
        "text": "One that was ridiculous, so I thought I'd share it here.\n\n\n $user - Hiring Manager of New Employee\n\n $op - Me, a Level 1 Support Member\n\n\n$user sends an e-mail to our inbox with paperwork to onboard a new employee, standard stuff except there is a note with the laptop request: $user wants a \"large\" laptop with a \"9 key number pad\".  So I process it, as we have models with number pads.  No problem.  Desktop support orders it and delivers it a few days later.\n\n\n$user e-mails us inquiring as to why the laptop does not have a \"9 key number pad.\"  Huh, I thought I put in a request for a laptop with a number pad.  Look up the ticket, see that it was requested.  Give a quick call to desktop to verify that it was the correct model, and it was.\n\n\n$op now gives $user a call, to figure out what is happening.\n\n&gt; $op: \"Hello this is $op at the Helpdesk, following up an e-mail you sent us, earlier about a new hire's laptop.\"\n\n&gt; $user: \"Hi, yeah I requested a laptop and didn't get the right one.\"\n\n&gt; $op: \"From my records here, a laptop with a numberpad was requested, and Desktop Support confirms they purchased and delivered one.  Can you read me off the serial number on the computer?\"\n\n&gt; $user: \"No, they sent one with a bunch of other buttons on the numberpad, which wasn't what I asked for.\"\n\n&gt; $op: *Pauses for a moment trying to process what he just heard, hoping his worst fears would not be realized* \"I'm not sure I follow?\"\n\n&gt; $user: \"I asked for a laptop with a nine key numberpad, and this one has a bunch of other buttons.\"\n\n&gt; $op: \"So a laptop without a zero key or any of the symbols on the numberpad?  *Pause* To be frank, I'm not sure that there is a model on the market that would fulfill that request.\"\n\n&gt; $user: \"Oh, could you guys make one?\"\n\n\nI'll spare you the rest of it, but this one almost broke my desk with how hard I smacked my head on the desk, after I got off the phone and confirming that the laptop would suffice, although the hiring manager was not pleased.\n\nEDIT: Spelling and such.",
        "created_utc": 1526008587,
        "upvote_ratio": ""
    },
    {
        "title": "Apparently proving the problem does not exist is not the same as fixing the problem.",
        "author": "WizardOfIF",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ikjtv/apparently_proving_the_problem_does_not_exist_is/",
        "text": "ExecutiveUser: There is a problem with this dataset. It reports Value A when it should report Value B and Value A.\n\nMe: It reports Value B unless Value B doesn't exist in which case it reports Value A. Here is the list of requirements I was given for the data set. See that it requests exactly what has been provided.\n\nExecutiveUser: Agreed that is the given requirements. We claim that some of the data set reports Value A even though Value B does exist!\n\nMe: Could you please specify which row of data reports the incorrect Value?\n\nExecutiveUser: No, but here are 100 rows of data of which I am certain 10 rows report the incorrect value.\n\n*After painstakingly combing through each row of data to find that the column in question always reports Value B unless Value B does not exist in which case it then reports Value A*\n\nMe: See here that I have checked each row of data and each row reports the correct value.\n\nExecutiveUser: I accept that you have spoken the truth but I insist that you have not solved the problem.",
        "created_utc": 1526007125,
        "upvote_ratio": ""
    },
    {
        "title": "Are you fudging kidding me?",
        "author": "tenebralupo",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ikgoo/are_you_fudging_kidding_me/",
        "text": "Long time I haven't wrote anything here! Since my last post, I switched company for the same field of work, Fire Alarm Technician. What made me reemerge out of the smoke? Well I just completed a service call that made everyone (my office and the client) in full panic mode which I solved in the best way.\n\n#the cast\n\n**$Me** yours truly, portrayed as [Ser Pounce-a-lot](http://dragonage.wikia.com/wiki/Ser_Pounce-a-lot?file=SerPounceHoDA.png)\n\n**$BT** building Technician, the guy who represent my client/his boss portrayed as [Gato](https://shortcut-test2.s3.amazonaws.com/uploads/role/attachment/117578/default_Gato.gif)\n\n**$SEC** Security agent who sit right next to the entrance portrayed as [Maneki Neko](https://images-na.ssl-images-amazon.com/images/I/51Zql-yJthL._SY355_.jpg)\n\n**$D** Dispatch from my office portrayed as [this cat](https://pbs.twimg.com/profile_images/530292596740866048/nR0ZmD3x_400x400.jpeg)\n\n#STORY TIME\n\n$Me was heading to his third and hopefully last service call of the day, but he receive a call from the office.\n\n**$Me** : Hell...\n\n**$D** *in a panicked voice* : Forget going to [Third location] we need you to go to [Huge Federal building] we need you asap over there and  **$CO-Worker** will leave the office and take care of you third call!\n\n**$Me** : ...llo? Why?\n\n**$D** *still panicking* : Nothing's working! They lost their whole Fire systems and nothing works! We need you to fix that everyone over there is freaking out!\n\n**$Me:** Okay... But I am 5 minutes from [Third Location] it would be pointless to do that!\n\n**$D** *whispering to $CO-Worker about what $ME just said*\n\n**$D** : Okay in this case do the third call then go over there as fast as you can!\n\nObviously $Me completed his third call and finally reached the imposing 6 blocks multi-story building which he knows very well how old the system is and how complicated the networked fire system is.\n\n$Me is greeted by $SEC with her usual attitude and bland tone.\n\n**$Me** *trying to make $SEC downside smile for an upside smile* : Hey $Sec! How are you?\n\n**$SEC** : please sign the logbook while I call $BT.\n\n**$ME** *while writting the required information in said logbook* : So! What's wrong with the system?\n\n**$SEC** : everything! Since this morning I cannot do anything and it is driving me nuts because it keeps beeping non-stop. Come inside and wait for $BT\n\n**$ME** : No prob'! Mind if I start looking at it?\n\n**$SEC** : I am telling you, nothing's working!\n\n$ME drop his backpack filled of tool and start loggin on the Digital Graphic User Interface of said Fire Alarm System. Our hero notice that the mouse is working but not the keyboard. He decided to kneel infront the god of technology and pull out the computer. As he pull it out he notice a small broken piece. \n\nFollowing his instinct, $ME follow the keyboard cable and find out it is plugged in a [USB 4Port splitter](http://www.sparkdesignllc.com/img/41.jpg) but it is in pieces. $Me do his best to fix the cover and make sure everything plugged in is working. Magically, the keyboard is now responding. Our trusty technician then finally log into the computer and start to notice that only the computer does not answer to any Nodes (7 nodes if you include said computer) and when he means any he means that it does not even communicate with itself...\n\n$Me then decide to do what every tech does here. Press Start Menu (because it still runs with Windows XP), Power Menu, Restart. After a few minutes, the Node #7 reboot log in the network, start talking to every other nodes.\n\nSo that's it. #Me rebooted the computer and waited for half an hour trying to get $D sending the WO but alas it wasn't ready yet, meanwhile she had been told that our protagonist was waiting from her to close the call as it is fixed. \n\nHer reaction? (psst, read the title) then $CO-Worker asked how it had been resolved so quick... By doing Step #1 of Troubleshooting: \"Did you turn it off and on?\"\n\nEdit: typos",
        "created_utc": 1526006240,
        "upvote_ratio": ""
    },
    {
        "title": "No, you don't get a pu**y pass.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ikb26/no_you_dont_get_a_puy_pass/",
        "text": "[removed]",
        "created_utc": 1526004679,
        "upvote_ratio": ""
    },
    {
        "title": "The Tale of the magical delete key",
        "author": "Mercas",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8ijtne/the_tale_of_the_magical_delete_key/",
        "text": "I work in an education environment and support a wide range of staff. This story happened the other day and has quickly become my favorite story to share.\n\nMe = Me\n\nProf = Professor for one of our schools that I don't usually interact with\n\nDM = My manager, someone who has been here many years and has a ton of knowledge. Also into gaming so DM is an appropriate name.\n\nThe story starts off in the afternoon of a relatively quiet day, when Prof come to the technology window looking for help. \n\n&gt;Prof: I have a problem with my laptop. About two weeks ago, randomly when I use the delete key my screen goes black and when the computer turns back on I have to log in again.\n\n&gt;Me: okay, let me take a look at it and see if I can find anything wrong.\n\nI take the computer to the back bench, run the built it diagnostic from the company with no errors and run a memory test with no reported issues. I can't find anything wrong, but since the screen is going black I decide to update the video driver and while I am at it the bios.\n\n&gt;Me calling Prof: Okay, I can't seem to find anything wrong. I have updated a couple things and my entire time trying to replicate the issue has not been successful. I am hoping that the issue has been resolved.\n\nProf then came got her laptop and I moved on to the next ticket in my queue. 30 minutes later I get a call that the issue happened again. I ask prof to drop of the laptop for a full day of testing.\n\nThe next day I run a full gamut of tests trying to replicate the error with absolutely no luck. I start thinking it is an issue with the function keys but that doesn't produce the same error. Finally I call up prof and let me know I can't find anything wrong.\n\nAfter she collects her laptop I start talking to boss, trying to think of what else could be the issue.\n\n&gt;Me: DM, I ran the full gamut of tests and I could not replicate her issue, but I would be willing to bet she will be back again. Do you have any thoughts on what could be causing the screen to go black and then back to the login screen randomly.\n\n&gt;DM: Other than the things you already tested for, my thought would be maybe water damage is shorting a key, although it should have been seen during the testing. The other thought is maybe something is messing with the laptop lid sensor.\n\nAt this moment it was like lightening struck my brain. I remembered two things, 1) the professor had a bunch of bracelets on and 2) I remembered u/techdoggo's story [The Bad Touch](https://www.reddit.com/r/talesfromtechsupport/comments/6ssyn1/the_bad_touch/)\n\nThankfully, I have a spare machine of her model to test with so with the magnetic clasp on my watch I test the theory. Using my watch on my right wrist and hitting the right corner of the laptop, the screen goes black and comes back with a log in screen. \n\nI quickly call up the prof, tell her I know thats going on, and ask if I can come to her office.\n\n&gt;Me: So I know what is going on but first let me ask, are any of those bracelets new and do any of them have a magnetic clasp to hold them together.\n\n&gt;Prof looked at me very puzzed but replied: Yes this one right here (pointing to the one on her right wrist). You don't think that's the issue do you.\n\n&gt;Me Yes, yes I do. May I see it and test it to make sure.\n\nI then run the bracelet over the sensor and it shuts the screen off. The reason I couldn't replicate the issue was I have nothing on my right arm with a magnet and when ever prof came to the window she was hunting and pecking to make sure she was doing everything correctly. \n\nShe gladly accepted this as what was going on and told me she would not be wearing that bracelet around computers ever again.\n",
        "created_utc": 1525999987,
        "upvote_ratio": ""
    }
]